{
 "title": "Construction and Consumption",
 "author": "Signal",
 "citation": "   Signal. \"Construction and Consumption: experience with Ether (ID 52622)\". Erowid.org. May 17, 2008. erowid.org/exp/52622",
 "substance": "Ether",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Ether",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52622",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 17, 2008",
   "Views: 10128",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]</p><p>A friend and I got a last minute idea late one night to whip up a batch of ether. neither of us had tried it, but the information on how to make it was brought forward. We sprayed starter fluid into empty 600ml pop bottles until they were half full, then added water until full. Put the lid on, shook bottles, then removed the lid. Let the mixture seperate for 5-10 minutes then removed the top layer of film with an eye dropper, and dropped into a seperate bottle. This took about an hour until we ran out of starter fluid.</p><p>Then came the time to try it out. We rolled dice to see who went first, I gladly accepted the roll of the dice, and poured some ether onto a rag, and a took a big huff. I held it in for about 5-7 seconds, and then exhaled, instead of the usual cloud of smoke i am so used to, a breath full of chemicals filled the room. much like nitrous, except the taste and smell lingers. I imediately felt lightheaded. I gave the thumbs up, and we continued huffing for about 15-20 minutes. Throughout this duration I was coming up strong. I started to feel disassociated, and everything became slightly dream like. I went to use the bathroom, the journey proved difficult, my depth perception and balance were really off. It took baby steps to make it anywhere and I felt little resistance to movement. I could tell my body how and where to move, and I could see it happening, but there was no resistance, to air, or my muscles.</p><p>We continued huffing rags for hours, off and on, with every huff I felt more seperated from myself, and my surroundings. I never felt nausea, although my companion did, he did not vomit though. Once we ran out, I came down rather quickly, it was about 45 minutes after the last huff. At this time, I imediately fell asleep, by this point the sun was rising.</p>"
}
