{
 "title": "Removing the Emotional Shield",
 "author": "Beau",
 "citation": "   Beau. \"Removing the Emotional Shield: experience with Wormwood (ID 52634)\". Erowid.org. Aug 6, 2007. erowid.org/exp/52634",
 "substance": "Wormwood",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Wormwood",
   "(tea)",
   " ",
   "2 bowls",
   "smoked",
   "Wormwood",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52634",
   "Male",
   " ",
   "Not Given",
   "Aug 6, 2007",
   "Views: 12913",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having long since tried absinthe with some friends, I knew that wormwood was a powerful herb.  Several weeks ago, I was at the local magic shop and decided to buy some for incense or other uses.</p><p>On a quiet night at my house, I decided to give the tea a try (knowing full well how bitter it was supposed to be).  I was unprepared for the flavor, which was the most bitter thing I've tasted.  Every sip made me almost gag, and beef jerky was the only thing to chase away nausea.  Then after about a cup, I felt chilled, but gave up and decided to smoke 2 bowls outside.  This I did, feeling more and more comfortable and introspective.  I started to think about feelings and emotions in a more sensitive manner, but since it was late I just went to bed.</p><p>That night was when things really got interesting.  I began to dream like I never had before- colors were not only heightened, but given theatrical intensity.  Soon I found myself in grandiose backdrops, richly decorated.  In the first part, I was travelling across a beautiful lake, surrounded by trees.  Then I saw a girl who I've had deep feelings for in the past in a flowing dress on the edge of the lake, and I was in the middle of the lake standing on an underwater rock, with the water glistening and the sky filled with color.  </p><p>Soon, I left to visit a supermarket, where I met an old friend.  We went outside, and I fought with some guys, but I couldn't seem to hurt them.  I was overcome with pity, so we all sat on my car and felt close.  Then ANOTHER girl I was in love with at one time came and layed down next to us, and all seemed safe.</p><p>I came to conclude that this herb somehow increases the emotions (especially with other people).  Amazing dreams.  Interesting stuff!</p>"
}
