{
 "title": "My New Motivator",
 "author": "Abidnibbee",
 "citation": "   Abidnibbee. \"My New Motivator: experience with Kratom (ID 52632)\". Erowid.org. Jul 3, 2006. erowid.org/exp/52632",
 "substance": "Kratom",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "2 cups",
   "oral",
   "Coffee",
   "(liquid)",
   " ",
   "3.0 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52632",
   "Male",
   " ",
   "Not Given",
   "Jul 3, 2006",
   "Views: 7504",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the first experiment with Kratom, I have decided to listen to the wimp in me, I went for the low dosage of one tablespoon or approximately 3-3 1/2 grams of superior crushed leaf. I began with an empty stomach, I had only consumed a couple cups of coffee in the last 12 hours. I have read that Kratom is great for workers, and attention span, so I intend to use this low dosage as an enhancement to my daily chores.</p><p>I brought the Kratom to a boil in 2 cups of filtered water, and then let it simmer together with one teabag of  Tea. The concoction simmered till cool, I added two ice cubes, and one teaspoon of clover honey and drank the mixture in one blast. I drank some of the Kratom leaf, but most was left as sediment in the glass.</p><p>1:33 pm - Drank it, the mixture was remotely bitter, but the enhancements of Tea, and honey took great care of that known issue.</p><p>1:44 pm - Feel a slight buzz, or more specifically a lightheaded sort of pleasant feeling centered in the temple.</p><p>1:55 pm - Pleasant feelings, some mental, but mostly physical. Continue to feel a tension, or tingle in the scalp.</p><p>2:15 pm - The motivation to get up and do something is not there, but once up I can't stop, I am motivated, able to multi-task, and am getting work done at a good rate. Starting to feel codeine like symptoms as well as some eyesight focusing issues.</p><p>3:05 pm - Feeling a pain in the neck (brainstem area), and a bit of a headache. most likely from cleaning products. I feel like chilling out a bit. Grabbed a juice and am gonna veg on the couch for while.</p><p>3:15 pm - Once I sat down for a while I was starting to feel light codeine like symptoms; nerve sensations, tingles, and a general physical well being. My eyes were not focusing on anything unless I willed them too, like my whole body would only function if I exert my will, and I don't feel like it. These symptoms are all light, I can imagine on a higher dose I wouldn't be getting off the couch for a while, if even for an earthquake.</p><p>3:30 pm - The headache is about gone now, no nausea. I still feel nerve sensations, and noticed that my back pain has dissipated, funny that I hadn't noticed that before. </p><p>4:00 pm - The symptoms seem to be subsiding, all in all this was a pleasant experiment. I was able to keep my motivation up for unpleasant tasks, and I noticed potential for pain relief. My mind is clear through the whole process, this drug is mostly a physical one for me, at least at low doses.</p>"
}
