{
 "title": "Propulsion Into Foreign Lands",
 "author": "Adran",
 "citation": "   Adran. \"Propulsion Into Foreign Lands: experience with LSD & Salvia divinorum (ID 5263)\". Erowid.org. Jan 12, 2002. erowid.org/exp/5263",
 "substance": "LSD & Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 8:00",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5263",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 12, 2002",
   "Views: 9378",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\non the morning of the 17 of febuary I had just come home from a rave where I had found a source of lsd, and taken one tab. but in this report I will talk about my experience with salvia which occured at my house alone in my room, about eight hours into my acid trip. my trips usually last 12-13 hours before I can fall asleep. The rave was absolutely awesome, so you can imagine I was in a state of enlightment and peace when I was in my house. </p><p>I had experimented with salvia before, but knew there was much that salvia hadn't shown me. I had very few experiences where I almost broke through. I was hoping the increased awareness of my trip would help me see into the salvia dimension. I prepared my glass pipe with a load of dried salvia leaf, and kept my bag handy for a reload. I gave a prayer to the salvia spirit to be kind to me and show me what she wanted me to see.</p><p>well after clearing the first hit, I emptied the ashes and I loaded a second hit while still holding in the first. after letting it go, I took a few breaths of air and then began burning the second hit with a slow steady rythim until I could take no more and held it in. right after, I remember looking at my bowl and thinking 'this isn't salvia... but why does my bowl look kinda funny'  the ashes began morphing into this round cartoonic face that was smiling and laughing,(at me perhaps?) and then it began to spin and multiply, I closed my eyes and then.... </p><p>WHOOSH! the salvia wave came through me at magnificent speed like a sonic boom, it caught me so off guard the memory of the round faces faded in the distance along with any conception of reality or my self. I was entering some sort of foreign land, the wave felt like I was a camera of consciousness traveling through an organism. there was no 'I' in this experience, except that I was this camera of consciousness, traveling through an organism, and that organism was I.  I curved around the top of my chest sinking into the base of my spine where I blasted into a mutitude of directions which propelled me into who knows where. the shaman's world?, or a sort of dreamtime, that had very little in common with spacetime. I was conscious at every moment but have trouble remembering what it was like. It was like returning to the state before being born. I remember everything began to fade darker and darker as I fell deeper and deeper into this world, as my soul was departing from its body and entering the holy 'other', like it was my time to go, and the spirits were asking me to follow them. I felt myself struggling to articulate my final thoughts before I left, and I remember thinking   'unless, I breathe...    ...out!'   </p><p>  ...and I let the second hit out. I opened my eyes for a brief second and remembered that there was this person in his room who had just smoked some salvia. I layed down on my bed and closed my eyes, reflecting on how utterly strange what I just experienced was. yet it felt so familiar, so real, the kind of being I had experienced as a child before I had the ability to remember. The whole peak must have lasted no more then thiry seconds to a minute, but it felt like an experience of timezero. I was still inebriated and slightly confused for the next five -ten minutes. </p><p>I had never broken through so profoundly into the salvia dimension, it was like nothing I had experienced before. every other psychedelic I tried (I can't speak for dmt) still retained fundamental aspects of experience, that there is some sort of 'I' experiencing a sort of 'something' . Not only did salvia break all rules of the 'I' experience or the 'something', for moments, I completely forgot about the 'I' or that it ever existed, I would've believed the 'I' to be the most absurd thing, which is a paradox statment since I refered to an 'I' thinking the 'I' to be absurd. But it was another land I was in, and it felt so real, so innate. </p><p>when I came down, I felt like I came back from the other side, with a sort of sacred knowledge. I looked upon this world with immense compassion and love.  I felt as if this world was some sort theatrical play with the end already written, and we were just acting the middle out, except I knew what we felt was real- we are real, and it gave me compassion. compasion to be part of this world, to live with the people that are part of this time, compassion to play myself, to be this person who came back with this knowledge. for the rest of the day I had this sort of dreamy perception of the world, like a glowing afterglow, and felt very euphoric. very happy to have given up all the stupid bullshit of materialistic wants and the selfish ego-- to speak only truth, the truth and knowledge that salvia had taught me. </p><p>    I definately feel that salvia holds a secret knowledge, and has an animate spirit. It is as some others have said a 'teacher' plant.  I feel I need to approach with respect for it to be kind to me, it knows more then I do, and can show me worlds I could never suppose existed. as for combining it with lsd, I definately felt it helped me break through. The usual amplification of my psychic abilities that lsd gives me, made me more aware of the finely intricate details of the experience. and I didn't experience the slight headache that I usually feel after smoking salvia, but felt extremely euphoric and relaxed. it was also probably because I had such a successful experience.</p>"
}
