{
 "title": "It's Not Frightening, But It Should Be",
 "author": "Matt",
 "citation": "Citation:   Matt. \"It's Not Frightening, But It Should Be: experience with Salvia divinorum (10x extract) (ID 52718)\". Erowid.org. Sep 17, 2008. erowid.org/exp/52718",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52718",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2008",
   "Views: 2500",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo, let's be honest - I don't have an extremely wide span of recreational use of drugs besides marijuana. A few weeks ago, a friend talked to me about a 'legal herb' by the name of Salvia Divinorum. I was skeptical, because I had heard many reports of 'legal pot' and other bull that turn out to have no effects. But, I decided that we should try it because I'm up for new things.\r\nWe went up to a local tobacco shop to buy some. When we got there, we asked the cashier where the stuff was. She asked us if we wanted 5x, 10x, 15x, or 20x. We decided to get 10x, because it's kinda in the middle. After that, We went over to my friend 'Bob''s house, and filled the water-pipe with this pot-esque plant. Little did I know that I was in for an experience of a lifetime. My friends decided that I should take first hit. So, I did. We went on the internet and looked at previous experiences from other Salvia users, and they all said to hold it in for 30-45 seconds and then exhale, so I did.\r\nIMMEDIATELY, I felt very stoned. Within the next 30 seconds, I could not even move my head because visual hallucinations were intense, and everything was delayed. I looked at my friends, and they did not even seem human. Rather, I should say, they looked like me. Not as in the way I looked, but that they were a different personality of me. Everything in the room seemed this way. I remember my friend 'Bob' saying 'Everything will be OK'.\r\nThe trip became more intense. It seemed as if everything had involved math; I could literally see math in everything. I didn't go 'out of body', as others have experienced, nor did I laugh. I couldn't even talk. I had forgotten how to talk. I had forgotten how to do anything, except think. While they were talking to me, it seemed like these creatures, my friends, were from some different universe; they had SOME resemblance to their normal selves, but not exactly. I looked at them and forgot that they were human. I forgot that I was human. It is extremely hard to explain, but I feel like I have to explain this.\r\nThe trip subsided. I was sweating profusely, and tried walking to the kitchen for a drink. Then we dived into conversation about my trip. It was so odd, yet it felt so REAL. It felt more real than 'reality' feels real. I know this is weird, but I still feel like when I am on Salvia, that I am in the 'real world'. \r\nSo, about a week later, I told my brother about my experiences. We went to buy some at the same place, same extract --- 10x. I made bong from scraps around the house, because I had misplaced my normal waterpipe. I filled the bowl with the intriguing substance, and lit up. I took a hit, and followed instructions like before, but nothing happened, I only felt a little high. Turns out the bowl wasn't getting enough passage to the filtration system, so I fixed it, packed the bowl again, and lit up for the second time.\r\nAgain, I felt immediate effects. I remember looking at my brother and his girlfriend, and not recognizing them. The same thing happened again; They looked fake. Well, not fake per say, but different nonetheless. Two-dimensional as well. The two of them, again, looked like different personalities of myself. The trip didn't last half as long as before, but it was equally intense. \r\nI've never experienced anything like salvia yet, and probably never will. It's not frightening, yet it should be.\n\n\n"
}