{
 "title": "Mystical Visions",
 "author": "Afrodius",
 "citation": "   Afrodius. \"Mystical Visions: experience with Ketamine & Salvia divinorum (10x extract) (ID 52721)\". Erowid.org. Dec 7, 2007. erowid.org/exp/52721",
 "substance": "Ketamine & Salvia divinorum (10x extract)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   " ",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 52721",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 7, 2007",
   "Views: 9985",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me preface this report by saying that I DO NOT recommend this combination to anyone, and I will never attempt this combination again.</p><p>Set and setting: Only after having become quite familiar with Salvia's effects on its own, did I decide it was time to start experimenting with combinations.  A friend of mine who was a bouncer at a local nightclub gave me a baggie of K, not sure the exact amount, my guess is that it was about a gram.  Now I never really liked special k by itself, but I had found in the past that it has a strong intensifying effect in conjunction with psychedelics such as LSD or shrooms.  So I decided to go get what was left of my salvia extract and find a couple friends to go on this adventure with.  </p><p>My fellow psychonauts and I were at my downstairs neighbors apartment for the journey.  The room was dimly lit and some quiet downtempo music was playing in the background.  </p><p>Experience:  Since this whole thing was my idea it was decided that I would go first.  I dumped out the bag of K, and drew out 3 large rails, about the length from thumb to pinky.  I don't really buy or sell powders so I can't give a more accurate weight approximation.  I did my line, then sat back and waited for the effects to start to hit me.  Once I felt the K coming on I started smoking my Salvia bowl.  The immediate effects of Salvia overwhelmed the K as I fell back and my body as well as my field of vision dissolved in to the familiar and unique energy patterns common to Salvia.  I opened my eyes and watched my friends taking their doses.  </p><p>I still felt really 'out of it' at this point but I had no open eye visuals.  I assumed the lotus position and closed my eyes again.  As soon as I did I was travelling 'through the keyhole' at seemingly phenomenal speed.  That by itself is unspectacular, however, this time I actually came out the other side!  I saw a figure sitting in meditation.  It was the Buddha.  Then it was Christ, then Krishna, then Vajra-Yogini, then Mohammed, and every other conception of the divine that ever has been or ever will be.  </p><p>Then one of my companions blurted out something as one of his visions had become too intense.  We quickly calmed him down, and I was able to once again close my eyes.  The same thing happened as before only with one slight variation.  I was not simply beholding the divine, that meditating figure was ME.  But it wasnt just me it was my firends and even Salvia too.  IT was the bong and the bed, the house and the trees, the sun and the moon, the entire universe.  All I could do was smile.</p><p>The 3 of us discussed our experiences as we come down.  Their experiences were vivid but very different from mine.  My friends outburst of 'What the fu...' had been brought about by a vision where he was in a monastery but no one had a face.  All together the experience lasted about 45 mins, thought it seemed an eternity.</p><p>I started feeling worse and worse physically as I came down.  I was forced to immediately confine myself to my bed.  I was bedridden for a full week afterwards with flulike symptoms.  I figure there could be 2 likely explainations for this phenomenon: A. I had previously been exposed to the flu and this combination supressed my immune system long enough for the flu to gain the upper hand; or B. The effect this combination had on me tricked my body into thinking it was ill.  Either way it was thoroughly unpleasant.  I suppose a price must always be paid to glimpse hidden realities and secret truths.  In hindsight I think it was worth it and I don't regret the experience, but I will never try it again, nor would I ever recommend it to anyone who is not already an experienced psychic voyager familiar with Salvia's effects.</p>"
}
