{
 "title": "The Tea That Let's Me Be",
 "author": "James",
 "citation": "   James. \"The Tea That Let's Me Be: experience with Poppies, Cannabis & Alcohol (ID 52760)\". Erowid.org. Sep 17, 2008. erowid.org/exp/52760",
 "substance": "Poppies, Cannabis & Alcohol",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "437.5 g",
   "oral",
   "Poppies - Opium",
   "(tea)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "6 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52760",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 17, 2008",
   "Views: 19152",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In my love for opiates and in search of the warmth (great Incubus song by the way), I have recently stumbled upon the amazing likes of poppy tea.  I have a very experienced history with psychoactive drugs, and am pretty amazed by combinations at times, even though combinations have landed me clinically dead in the hospital.  My history with opiate use is pretty extensive and I consider myself to have a decent amount of tolerance, and I am pretty good at judging opiate highs (I use for comparison reasons).  The reasons I have decided to try poppy tea are plain and simple.  The materials are legal to obtain and I just seem to feel much better under the influence of opiates.  </p><p>So before I began prepping for my experience, I decided to read experience reports here online tried to gather info at various forums from experienced users.  I can honestly say I gathered very conflicting info.  I had to decide whether to try this tea with poppy pods or seeds.  For reasons of accessibility, I opted for the poppy seed choice.  After a couple of hours trying to find a cheap source for poppy seeds I decided just to go to the damn grocery store and check the spice aisle.  Naturally, there rested 5 bottles of 'whole poppy seeds,' each weighing in at 3 1/8 oz.  A little math will give us a total of 437.5 grams of seeds.  Pretty close to a pound.  And while I was at the store I bought a big green bottle of lemon juice concentrate, and also some Reeses.  Those are damn good.  </p><p>So I got home.  I was pretty stoked about the situation that was going to be happening and the Reeses made everything that much better.  I've got this real nice blender, and so I put it to use by pouring all my seeds in there.  And damn, that's a lot of seeds.  So I puree/mix/chop the seeds to death.  Actually, I just take a minute to do it.  Afterwards, I poured the light seed mulch into a pretty big cooler.  Like a thermos cooler, with the little pop open mouthpiece on the top.  Not because I needed to, but that was about the only thing I had that would work.  So I threw my seed shit in there, and poured my whole bottle of lemon juice in there, boiled some water on the stove and poured it in there too.  And capped it then shook!  Shaking, shaking, shaking, ok its shook.  Then I let it sit for awhile, did it again.  Then boiled a little hot water (not too much, just a little) and then added it to the cooler, shook, stopped, shook, and stopped.  </p><p>I did this for like 45 minutes.  Did I need to?  Who cares.  After shaking, I was left with a lot of liquid!  After I made it, I realized that I'd have to drink all that liquid.  And so I was kinda pissed off.  I mean, sure I was watching Aqua Teen, but ignorance is uncalled for, especially when I'm the one it affects.  So anyway, I uncapped this bitch of a thermos, and looked into it.  What did I see?  I saw some really milky looking whitish/yellowish liquid.  It seemed a little thick, it reminded me of milk in a way.  So I tried filtering the liquid with a shirt.  That didn't really work, it was taking way too long and the shirt was too thick.  So I found a mesh screen, and filtered through that.  Wait, wait wait....yep, it works.  'Wow that's a lot of liquid, I'm gonna have to bong this shit.'  I said.  Well, this is real nasty stuff.  It's pretty bad.  So I boiled a lot of it and reduced it down to a cup and a half.  Now this took like an hour and a half.  Just to boil it down. </p><p>Chugged a cup then sat.  I probably sat there for a good 30 minutes, and I thought I was feeling something, but I couldn't tell.  My body started to get real warm surges throughout it and it seemed like all my back pain just melted away.  But I couldn't be sure, but seriously, my pain was gone.  I thought it was just feeling better naturally.  So an hour and a half after starting the first glass, is when I finish the second half glass.  I am definitely feeling something by then, although it was small, it was a definite will to chill.  I just wanted to sit and watch tv and I was totally content doing this, and normally I am not.  I don't watch tv normally because I just can't stand to.  So I thought it was time for a pupil check.  Sometimes it helps me figure out placebo from real.  A mirror check revealed that I was on my way to an opiate high.  </p><p>After 2 hours ingesting, I was feeling very relaxed.  So I went out, and lit up my bowl.  I even got under my boat and smoked.  It was so relaxing under there, it's shaded in a sunny area.  I smoked a bowl to myself.  It was pretty nice, my brain started to 'flow' and I could hardly even feel the weed.  The opiate high was very outstanding at this point, and marijuana definitely helped bring it out.  </p><p>At this point I am a pretty happy customer.  My body is completely relaxed, my head is pretty spaced, and I am happy doing anything, I'm just wondering when the goodness will end.  Turns out its just getting started.  After the bowl I find myself outside dancing and singing some random stuff I made up.  It was pretty good.  Luckily, I'm headed North for the night to party.  I arrive at my destination, and I'm greeted with unlimited dank.  Gotta love those engineers and their setups.  I smoke some dank, quite a bit actually, and I feel like I've had a good 15-30 mg of oxycodone.  Its very nice, but I just keep wondering if my buzz is going to fade any moment or what.  It seemed kind of wavy.  Not long after the dank, a party is in store for the night.  On the way there, me and my posse are greeted by about 10 people.  That I only knew one person out of.  Normally, I would have been apprehensive, but not under the influence of opiates.  I was so friendly, open, and interested in everyone, I felt great.  </p><p>After I got to the party, I busted out some alcohol.  Beer, Mmmm.  This is what the poppy tea was begging for all night.  A little liquid potentiation.  During my consumption of beer that night, I was in complete bliss.  Everything was so awesome looking to me, everyone was so cool, girls were very attractive, and the opiate high started to feel fucking amazing.  I have to say this was one of the most enjoyable experiences I've ever had in my life.  I was high the rest of the night off of that tea.  It lasted at least 8 hours and felt like it was still lingering when I went to sleep.  I'm gonna say I felt like I took morphine at times and most of the time I felt like I did when high on opium.  I woke up feeling like a million bucks. </p><p>I love poppy seed tea.  It's good stuff, worth the money.  Much cheaper than black market drugs.  I'm gonna change the usage of a whole bottle of lemon juice next time...blah.  Too much man.  Too much too much.  And after my experience I read on the net that the main idea of this tea was to wash the alkaloids from the outside of the seeds, therefore rendering my blending process pointless.  Maybe it is pointless, I haven't tried it otherwise.</p>"
}
