{
 "title": "Born to Die",
 "author": "Michael",
 "citation": "   Michael. \"Born to Die: experience with Nitrous Oxide (ID 52772)\". Erowid.org. Sep 14, 2008. erowid.org/exp/52772",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1982",
   "ID: 52772",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 14, 2008",
   "Views: 9623",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAs indicated by my two previous (brief) experience reports, my initial approach to psychedelics, particularly plant sourced, was quite earnest and I had positive experiences during those first few years (see Datura/Peyote and Morning Glory seeds, both mid/late sixties). Unfortunately, as alcohol and harder drugs came into play my drug use became increasingly compulsive and at times self destructive.</p><p>The eighties found me working as a general contractor.  I secured a contract to remodel a veterinary hospital.  This was an extensive remodel requiring that I spend over two months working alone at night during 'off hours' to complete the job.  I enjoyed a reputation as an excellent finish carpenter, and was given virtual 'carte blanche' to transform the mundane block interior into something more stylish, which I did quite successfully.</p><p>A typical evening would include my usual workday ration of beer (6n 16 oz cans for 8/10 hr. day) and a few joints during periods of reflection. These being 'all nighters' I was using quite a bit of speed, usually in the form of white cross-tops.  It didn't take long to find the Nitrous tanks.</p><p>I was soon devoting 30 to 60 minutes each night to the Nitrous. I was careful never to attach the mask to my face in any way since I would routinely inhale gas until I eventually reached a level where I briefly lost consciousness. I would come out of these 'blackouts' not remembering what had happened which was enormously frustrating.  I endeavored to correct this by 'stacking' other drugs in my system prior to inhaling Nitrous (more weed, more speed, less beer) and by disciplining myself to maintain a thread of consciousness through the Nitrous experience. I did this every night for over two months.</p><p>The following CEV occured during one of the last Nitrous sessions.  I found myself in a dark place, feeling confined though not 'panicky.'  I experienced a desire to move, and sensed foreward movement though I was still in complete darkness.  I felt my face push against something which felt like latex.  I became mildly agitated and pushed my face against the soft barrier with increasing force until I felt it tear.  With considerable effort I pushed my head through the tear, though my shoulders and thus the rest of my body could not follow.  When I 'opened my eyes' my head was inside an immense sphere.  By 'immense' I mean world sized. This world was shrouded in swirling mist which partially obscured a distant horizon.  The entire surface appeared to be covered by water which was as smooth as glass and reflected the gray of the mist and patches of blue cloudless sky. Beneath the surface I could see a shimmering effect which resembled a colorful 'whiter noise' effect. Although there was light everywhere, I could discern no source in my field of vision.  For a few moments I couldn't see anything else, and was quite transfixed by the shimmering beneath the surface of the water.  I felt a pleasant sensation of droplets of mist hitting my face and at that moment forgot that I was under the influence of a drug(s) and was 'carried away' by the experience.</p><p>I sensed movement above my head and to my right. Turning my head and looking over my shoulder I observed a very tall rock formation.  Standing on top was a figure whose face I could not discern due to the mist and distance. As I watched he leaned foreward past his center of gravity and began a slow graceful dive toward the surface of the water. I was reminded of cliff divers in Acapulco.</p><p>I felt a lurch in my own stomach as if I were falling and realized that I was actually watching myself dive into the water.</p><p>As I watched myself enter the water without even a hint of splash, I realized that the diver (myself) was not penetrating the surface at all, but rather disolving into the shimmering colors below the surface. It was such a striking and beautiful image that I didn't register for a moment that I was in two places at once.</p><p>When that realization struck me, it shocked me back to 'reality' and I found myself sitting in a surgery at 2:00 am with drool on my chin and a hissing Nitrous mask in my lap.</p><p>Further reflection 'after the fact' revealed that I had re-experienced my birth and then my death; both im symbolic terms. I am a little embarrassed by the setting and combination of drugs involved; it seems like something which should have happened out in the middle of the dessert after fasting for a week and eating Peyote.  Sometimes I think these visions find us, despite all our efforts to find them.</p><p>All I can add to this overly lengthy report;  Kids, please don't try this at home.  Experienced driver on closed course.  Really, I wasted many years of precous life using a variety of drugs irresponsibly.  My advice is to stick to the (milder) plants and be careful with them. I'm very grateful for the insights gained, but cannot close without quoting Dick Alpert (later Ram Das) on the subject of psychedelics: 'When you get the message, hang up the phone' and 'Enlightrnment is no excuse for forgetting your Zip code.'  Wise words.</p>"
}
