{
 "title": "Now I Get It",
 "author": "LSA underground",
 "citation": "   LSA underground. \"Now I Get It: experience with Tobacco (dip) (ID 52796)\". Erowid.org. Mar 25, 2008. erowid.org/exp/52796",
 "substance": "Tobacco (dip)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "sublingual",
   "Tobacco",
   "(plant material)",
   " ",
   "1 ",
   "sublingual",
   "Tobacco",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52796",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 25, 2008",
   "Views: 10534",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm no heavy smoker of tobacco by any means; I smoke with friends at parties, but only then. In fact, I find most tobacco coming out of the U.S. to be somewhat unpleasant. However, I do enjoy tobacco snuff, which is hard to come by in my area, particularly if you are a minor with not a lot of money for gas to get to a smoke shop.\r\nMy friend mentioned that at the gas station he works they carry snuff. I paid him 5 dollars for what he and I thought was snuff, but it turned out to be dip or chewing tobacco (the container has the word snuff on it for some reason.) I gave most of it away to kids who do chew, but kept a small pile for myself. I had chewed once or twice before, but threw up after loading my mouth with some foul vanilla flavored dip.  I decided to give it another shot, this time using much less.\r\nThe usual head rush commenced, followed by the 'ick' feeling people who hate tobacco say they despise. This only lasted a minute. Next came an overwhelming calm which was border line euphoric. I ate lunch with no problems. In fact, the stuff wore off just in time, allowing me to have a pretty hearty appetite.\r\nI did another pinch and enjoyed it even more. I suppose the dose and variety is important. I have enjoyed this experience, and would like to partake of the gold leaf in this manner occasionally. I don't need to stain my teeth with shredded tobacco: for that I have coca-cola, which I have developed a minor addiction to (yes, the soft drink).\r\nI prefer snuff overall, but this type of dip is pretty damn pleasant.\n\n\n"
}
