{
 "title": "Better then xanax",
 "author": "AnxiousStoner",
 "citation": "   AnxiousStoner. \"Better then xanax: experience with Kava (ID 52837)\". Erowid.org. Jan 9, 2008. erowid.org/exp/52837",
 "substance": "Kava",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "Kava",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52837",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 9, 2008",
   "Views: 21891",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off let me give a bit of information on myself.I am a 22 year old male who has used mushrooms occasionally and cannabis frequently over about a four year span. I also suffer from severe generalized anxiety disorder and depression which has been very successfully helped with the use of meds like ativan, valium and most noteably xanax. I have also found minor relief in other herbs such as valerian and passion flower but have had nowhere close to the success that I did with kava.</p><p>The capsules I bought are liquid phyto and the contents are alcohol extracted. I followed the directions appropriatly, taking one pill before bed with warm water to aid me to relaxation and sleep land. The effects took about an hour to kick in and were very surprisingly similar and in alot of ways better then xanax. Xanax helped my anxiety ALOT but always left me very groggy/zombie like and totally killed my memory.</p><p>At the onset of the kava there is a slight euphoria that leads to nice body, relaxation and overall feelings of being calm and most of all content, a feeling I don't get too often. Sleep was restful and I felt refreshed upon awakening. There were absolutly no side effects I noticed and I feel wonderful! Kava let me have clarity of mind, body and spirit alike, letting me float soothingly in the realm of my mind with a gentle hand. After discovering kava I have seen no reason to go back to using script meds.</p>"
}
