{
 "title": "Zippers and Children's Books",
 "author": "JohnnyD",
 "citation": " JohnnyD. \"Zippers and Children's Books: experience with Salvia divinorum (20x extract) & Cannabis (ID 52904)\". Erowid.org. Oct 3, 2008. erowid.org/exp/52904",
 "substance": "Salvia divinorum (20x extract) & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "4 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52904",
   "Male",
   "",
   "Not Given",
   "Oct 3, 2008",
   "3459",
   " "
  ]
 ],
 "report": "<p>It was Class & Charter day at my college, which is the last day of classes for the year.  It is a college-sanctioned day for all-day drinking, starting at 7am.  Everyone tends to get hammered and still goes to classes, but all the rules about drinking are ignored by students and faculty & staff.  After my terrible hangover from the year before, I decided to smoke pot for most of the day instead of drinking heavily, and my friend J joined me in this.  We started the day off at about 7am with a bowl or 4, then went to a party and had a few beers.  We continued smoking and drinking until we got kind of tired and took a nap around 10am.  We slept for about an hour, and woke up fairly sober.</p><p>At this time, a kid we knew came over and offered us some salvia (20x!) and we decided to buy it and try something new.  We had both tried regular salvia leaves before and didn't feel anything cool from them, so we decided to smoke this extract on top of a bowl of pot.  I had previously made a pretty sweet bong that allowed us to clear entire bowls in one hit, so we decided to pack that bowl up full with pot and add a small layer of salvia extract to the top.  We accidentally spilled a little too much in my bowl, but I was feeling sober, so I decided to smoke it all anyway to get really fucked up.  I smoked the bowl in one hit, which tasted like shit, and as soon as I blew the smoke out the window and set the bong down, I collapsed onto my desk chair.  From here we have two accounts of my trip into the land of conjoining zippers and the fabric of reality.</p><p>My account from the inside:  </p><p>My chin started to feel very heavy, and began to melt off of my face.  When I tried to lift my hand up to put it back on, I discovered that my hand was a piece of cotton fabric and it was zipped onto my desk, which was also made of fabric, but this was canvas.  when I looked around the room, I noticed that everything inorganic was made of stiff canvas, and all people were soft pima cotton.  In order to move, I have to unzip myself from one plane of reality and into another, but I discovered that I could operate the zippers with my mind.  This seemed kind of cool, but then I realized that all of the zippers were slowly closing, and the main zipper of all reality began to close, and we were being sucked in.  This was the scariest experience of my life, and I tried to run through the zippers to escape having my entire life zipped into nothingness.</p><p>J's account from the outside:</p><p>I collapsed onto my desk and was still for about 10 seconds before my arm started moving, but only across the desk, not up at all, this is because my arm was zipped to the desk and I could only move unilaterally.  Then I started to scream, and I yelled at J not to smoke his bowl (he did anyway) and then I attempted to run from the room, but I fell down multiple times (I was zipped to everything, which explains this) and I disappeared from the room.  </p><p>At this point, J had packed and smoked his bowl, and fell into his own intense trip.  His entire world became a children's book with cardboad pages, and a force (the same one that zipped up my reality) began to rapidly flip the pages, taking slices of J with it.  He began to put on his shoes, which proved very difficult with one arm being flipped away.  </p><p>After about 5 minutes, our trips ended, but it felt like an eternity.  We were very drained, and had to sleep for 45 minutes to recoup.  Afterwards, we compared trips, and noticed some strange similarities.  We both completely believed our new realities, there was no recollection of taking any drug, and these worlds of zippers and children's books had always been there, and we had just never noticed the urgency of the situation until then.  We both had an outside force that we had to combat or escape in order to survive, and we were both absolutely terrified from our trips and resolved never to smoke salvia again.  However, we soon overcame the abject terror of the trip and felt the need to go back into the zippers and children's books and find out who was zipping and flipping pages.  We went back in later in the day with smaller doses and an idea of what would happen, and were both able to control the trip.</p><p>Personally, my first trip with Salvia was one of a new reality and pure terror.  Despite of this, I am anxious to go back in and find out what's on the other side of the big zipper.  My friend J is also excited about going back in and finding out what happens when all the pages are turned.  In short, it was an incredibly scary experience, and very mentally and physically draining.  It is an experience which I was not prepared for, but it is an intriguing world, full of surprise, anxiety, and adventure.  I am sure that all the answers lie in Salvia, but I am scared to find them out.</p>"
}
