{
 "title": "Way Better than I Expected",
 "author": "Lizibra",
 "citation": "   Lizibra. \"Way Better than I Expected: experience with Yerba Mate (ID 52921)\". Erowid.org. Jun 14, 2006. erowid.org/exp/52921",
 "substance": "Yerba Mate",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE:",
   "3.5 bowls",
   "smoked",
   "Yerba Mate",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52921",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2006",
   "Views: 23878",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA friend and I were at my house chilling one evening.  My parents had gone out to eat and we wanted to smoke some ganja, but didn't have any.  I looked through my kitchen and my whole house for something to smoke.  I just wanted to smoke some kind of herb.  I was almost about to give up, when I thought about smoking my Yerba, which I drink as a tea.  I like the way it tastes and makes me feel.  I had heard from a South American friend of mine that he tried to smoke it and it made his head feel really bad, and gave him bad headaches.  \r\nI was eager to smoke something so we decided to give it a try.  I brought the whole half pound bag down to a little gulch in my yard and lit up my homemade bong.  My friend took the first big hit, and held it in.  I took the second and we traded off for about 2 hits each until the bowl was cashed and the cherry had fallen through.  \r\nWe weren't feeling anything so we decided to burn down another bowl.  We lit the next one clearing it in about 3 hits each.  (Small bowl, eye dropper).  We started to feel it.  It was like a weed high but not as trippy.  It was a mild weed high.  Pretty much like taking about 3 normal pipe hits of weed.  After, we smoked another bowl and went back into the house to listen to music and play some Halo 2.  \r\nMy friend was completely spaced out. Dying in the video game like nothing, just when I least expected it, it jumped up on me. It really started to hit me.  The walls started breathing, like when Im on shrooms sometimes and looked like water ripples.  It lasted for about 2 hours over all.  It was the single most far out experience I've ever had while experimenting with household herbs.  I will definitely try it again sometime. \r\nThe taste was not bad, and the smoke was not harsh at all.  It tasted like the tea when I drink it, which is good.\n\n\n"
}
