{
 "title": "A Year as an Addict",
 "author": "Jerry420",
 "citation": "   Jerry420. \"A Year as an Addict: experience with LSD (and other drugs) (ID 5292)\". Erowid.org. Jan 13, 2002. erowid.org/exp/5292",
 "substance": "LSD (and other drugs)",
 "bodyweight": "175 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 5292",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 13, 2002",
   "Views: 14676",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLooking back over the last year of my life I have many conflicting feelings. I have grown and changed as a person tremendously, and one area in which my attitudes have most changed is my drug use. In high school I always had a reputation as a big partier, and I was a pothead. I would go to school high every day pretty much, but managed to pull off pretty good grades, this made me think that drugs weren't that big a deal. This line of thinking could have really screwed up my life, and this is what I want to say now.<br>I got into other drugs slowly, one at a time. I started with shrooms, then moved on to ecstasy. After using the two regularly I began experimenting with other drugs like ketamine, cocaine, etc. I was lucky never to get hooked on something real dangerous like coke, and eventually I grew out of my prescription drugs phase as well as nitrous oxide. I did coke once and never went back. But my real problem was trips. I did acid the first time during the fall semester of my freshmen year in college. I loved the experience. I saw new possibilities and new worlds, my mind was expanding. I discovered a newfound interest in philosophy, psychology, neurochemistry and other areas related to psychedelics. I consumed an enormous amount of drugs over the course of the next few months. I would drop two tabs of acid on school nights then go to class the next day, I would roll on a few pills of E and wake up the next day to binge drink. The drug combinations made a never ending parade of new ways to be out of my mind. <br>After a time I began to grow discontent with the experiences. Acid would barely faze me after dropping three tabs. One night I took two pills of fairly powerful ecstasy. I was rolling my face off when I started talking to my younger brother about how I thought he was doing too much drugs. I had noticed that he wasn't quite his old self. He was doing acid, ecstasy, and a lot of pot, plus drinking too much. It made me realize that my poor example was what caused him to embark upon the path he had chosen. I promised myself I would do my best to be a better role model in the future. I also have noticed increasingly frequent visual distortions like motion trails and that 'liquid' effect on floor tiles when I'm high and now when I'm not. While I feel just as smart as ever, I wonder if that was the next thing to be affected. I am glad I have decided to cut back on my usage. <br>From now on I will not take trips for granted, I will be sparing in my use of psychedelics and I have decided to take a long break from ecstasy until there is a very special occasion for it. Other than the occasional shroom trip, the very rare acid trip, one or two more ecstasy rolls, and pot I don't plan on dealing with drugs anymore. By the time I leave college I hope that the only drug I have anything to do with is pot. As for drinking, I've got that way under control now.<br>Basically, the point of this story is to say I that it's alright to take it easy on the drugs. Save them for special occasions in order to make them even more special, don't become a junky like me.\n\n\n"
}
