{
 "title": "Baked on Lettuce",
 "author": "LegalStoner",
 "citation": "   LegalStoner. \"Baked on Lettuce: experience with Lactuca - L. Virosa (Wild Lettuce) (ID 52936)\". Erowid.org. Nov 17, 2007. erowid.org/exp/52936",
 "substance": "Lactuca - L. Virosa (Wild Lettuce)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "smoked",
   "Lactuca - L. virosa",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52936",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 17, 2007",
   "Views: 30483",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I like smoking stuff and getting high, but I have an addictive personality and nosy parents so I can't do much. I smoked weed a couple times about half a year ago, but got caught. Since then, I've been looking into different legal stuff, but most doesn't work. I tried Damiana, Kava kava, and Wild Dagga with no significant effects. </p><p>So a while ago I bought an ounce of Wild Lettuce in Berkeley (it was cheap, only $2.50) to try. I tried it a couple of days ago and it didn't do anything. Today, I was hanging out with my friend T, who is a heavy stoner. I don't smoke weed, but I mentioned that I had a fat bag of wild lettuce. We smoked three bowls of it in his pipe, which has a pretty big bowl, to minor effects. We felt relaxed and had strange thoughts, but that's about it.</p><p>Then we had two gravity bongs each, the gravity bong is made from a gatorade bottle with a trumpet mouthpiece for a bowl. A couple minutes later while we were playing guitar, I started to feel tingly. Then I got a distinct body buzz. What follows was what I can compare to smoking a good amount of white widow weed. I started to see the world differently, imagining everything really big, on TV, two dimensional, and in a couple of other strange ways. My friend T didn't feel much, but he's done a lot more than me before so it probably just didn't seem as significant to him. </p><p>I'm not saying that lettuce is as good as weed, but it is definitely a way to get high. I enjoyed the experience and will probably be doing it again. Also note that it doesn't taste nearly as good as weed.</p>"
}
