{
 "title": "Being Cut in Half",
 "author": "M",
 "citation": "   M. \"Being Cut in Half: experience with Salvia divinorum (17x extract) (ID 52932)\". Erowid.org. Oct 7, 2007. erowid.org/exp/52932",
 "substance": "Salvia divinorum (17x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52932",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2007",
   "Views: 3745",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Last night, I finally purchased the Salvia 17X extract that had caught my eye in a smokeshop about 3 months earlier.  With my money in my hand, I decided to finally purge and buy this substance.  I am not what I would call an 'experienced user,' having tried only leaves and 5X one time which was mixed in with a joint (Fucking awesome, by the way).  I have tried various other drugs, such as marijuana, Dramamine, Mushrooms, DXM on many, many occasions, and a handful of other drugs, mostly prescription.  However, Miss 17X Salvia would prove to be vastly different than any other substance I had encountered.  </p><p>My friend, D, had just purchased a new bowl from the same smokeshop a few days earlier. The piece was about 45 dollars, and proved to be quite useful as my friends usually only smoke blunts, and there were no other smoking devices on hand at the time.  Bowl and drugs in hand, it was time to go on a mental journey.  We felt that a golf course would be a good place to smoke, as it was starting to get dark and the full moon cast an eerie glow over the grass.  We picked a spot behind a bush on top of a grassy knoll to sit down, sort of overlooking the golf course yet sheltered from wind.  </p><p>I feel it necessary at this point to explain to anyone reading this that before I bought the Salvia, I let out my fears and all emotions that I had been previously been bottling up. I did not feel like having a bad trip, so I let everything out and also had a sitter present.  </p><p>I packed a small pinch of the extract into Ds new bowl and crouched down to avoid the wind.  As soon as I had blocked the wind, I sparked the lighter and began to inhale.  The first thing I noticed was that the smoke came a lot faster and heavier than with the leaves or the 5X.  At first I nearly coughed, but once I ignored the reflex my lungs were filled with thick Salvia smoke.  In order to feel the full effects, the smoker needs to hold in the hit as long as possible to let the smoke absorb into their lungs.  I held my hit until I started to black out from lack of oxygen, then released my smoke.  The first thing I noticed was a strange feeling, something almost indescribable.  It was a mix of anxiety and fear, but that soon passed.  I felt clear and collected, but then things started to change.</p><p>One of my other friends who were there, C, was going to smoke once I had taken my fill.  I was sitting there on this hill, starting my trip, and C began to talk to me.  I remember now that he was asking for the Salvia, but some part of me was saying No, he does not understand.  I sat there for a minute without a response for C, but then he began to reach over fore the vial on my lap.  At this point, I was still trying to figure out what was going on, and this person reaching for me was not helping matters.</p><p>I started to see C as some kind of hostile being.  He was wearing a blue hat, and he seemed almost like some sort of Military personnel.  Now, he was speaking but I could not understand what he was saying.  I saw him as a threat, so I started to move away.  I tired to talk but my words sounded like jibberish, very loud and slurred beyond recognition.  I asked myself Woah, is that what I sound like?   My brain felt so clear, but everything around me was changing rapidly My arms and legs felt heavy on my right side, and I fell over onto the ground.  This is where things start to get hard to explain.  </p><p>I got off the ground, but my vision was still skewed as if I was lying down, but I knew I wasnt.  I could see that the earth was tilted and it felt like I was standing on nothing. I looked in front of me there were these 2 people who seemed very mad at me for some reason.  They were talking and laughing, but it had the distinct feeling that they wanted something from me.  I looked to my right, and I could still see the world on its side, exactly what you would see if you were laying on the ground.  I looked at my arm, and this side world started to cut into my arm.  It was almost as if the ground was 2-D, and it was cutting my in half through my arm.  By this point, I had no recollection of smoking the extract.  I just knew that I was going to be cut in half by this 2-D piece of earth.  I frantically rubbed my arm with my left hand to try and stop the ground, but it felt jelly-ish and cold so I pulled my hand away from this goo.  I still had the distinct feeling that I was standing on nothing, as the earth was slicing into me from the right.</p><p>As quick as the feeling came, it left.  The earth slid out from my arm and tilted back to normal, and the words that my friends were speaking slowly started to have meaning to them.  My clothes were dirty, and my shoulder hurt for some reason, but I was not yet in the state of mind to ask why.  I remember trying to ask D something, but my words came out extremely loud and jumbled, almost like someone who was extremely drunk and belligerent.  I sat on the hill for another 10 or 15 minutes, and everything I had just experienced came back to me in pieces.  After a little while longer, I was back to baseline.  </p><p>The whole ordeal lasted only about 3 minutes, but for that whole time I was witnessing myself being cut in half by the ground that I had just been standing on.  I would not say it was a fun experience, but it was definitely something I would try again in the future.  It was a much different trip than the 5X had been, and it was much more intense.</p>"
}
