{
 "title": "3 Weeks In Its Reality",
 "author": "Oliver",
 "citation": "Citation:   Oliver. \"3 Weeks In Its Reality: experience with Brugmansia (ID 52972)\". Erowid.org. Sep 3, 2006. erowid.org/exp/52972",
 "substance": "Brugmansia",
 "bodyweight": "66.7 kg",
 "header": [
  [
   "DOSE:",
   "220 ml",
   "oral",
   "Brugmansia",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 52972",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 3, 2006",
   "Views: 26048",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI first approached Brugmansia with great trepidation and expectation. However, my first experiences were disappointing. Smoked leaves had no effect. Smoked flowers caused a slight shift in perception with pupil dilation and no hallucinations.\r\nRaw leaves and flowers can cause stomach pain or vomiting. My preferred method of consuming raw plant material is to chew it for several minutes then spit out the pulp. I use this method with alcohol. 4 large leaves are enough to induce a mild sedation with a heavy/ floppy body sensation without delusions.\r\nOintment. Pulped plant material was rubbed into my body absorbing the atropine and scopolamine externally. I tried this method because I was too anxious about eating plant material or drinking tea. During application some fluid entered my left eye causing long term dilation and permanently deteriorated vision. This caused a minor shift in perception without hallucinations. \r\nHaving tried every other method of ingestion I wanted to try tea. I almost certainly drank too much because I was in a drunken like stupor for 3 weeks while my dead best friend gave running commentary on my daily activities. This changed my life.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nI boiled 2 litres of water and added 16 finely chopped flowers, approximately 30 leaves and a few thick stems. After straining, I shared 660ml between 3 people (Oliver, Dave and Matt). The rest was frozen. The earthy brown liquid tasted bland and went down effortlessly. It didnt have any of the jelly like gooeyness of mushroom tea. We decided to vaporize some cannabis, eat some space cake and then take a drive while it took effect.\r\n30 minutes post ingestion a dreamy sedation set in with freefalling sensations similar to ketamine or nutmeg (like I was sinking into my seat). The same mundane views I see everyday seemed outstanding, as if I were looking at them for the first time with the brightness turned up 10 times. I try to drop my friends at home so I could meditate back at my apartment without any distractions, but when Matt opens the car door he collapses head first into the pavement before staggering back to his feet and falling again. I got out with the intention of helping, but only succeed in making a public spectacle of myself. I violated like a block of jelly all over the place with my pelvis swaying in every conceivable direction. We were in a busy part of town and people were gathering in bewilderment. \r\nSomeone shouted oh my god! How pissed are they. To cut a long story short I return home with Dave (he refused to get out) and left Matt to be escorted home by the police. We pull up outside my apartment (driving was easier than walking) and I swagger inside leaving Dave alone in the car. \r\nI cant remember the first hallucination or even thinking the tea was working. Every idea of a past, present, future or Brugmansia tea was gone. Oliver was now an empty shell in a blurry dreamscape of delusional chaos. Extreme dissociation left emotional concepts totally void. This felt quite liberating because there was temporarily no more desire, craving, habit or fear. I have a phobia of spiders but felt nothing when hundreds of hand sized spiders scurried down my wall and into my mould covered bed. The grim reaper stood in the corner of my room. I slurred hello and he waved back at me. Demonic bats flew through my head and imaginary glasses of water moved back as I leant to grab them. \r\nFleas covered my ceiling and hopped upside down as if gravity had been reversed. I knew what I saw wasnt possible but it looked too real to be an illusion. \r\nI grabbed a fly spray bottle and began spraying flea infested areas. The interesting thing was that individual fleas dropped to the floor and died after coming into contact with the spray. I could fully interact with every hallucination. I lay in bed for a while watching white doves swoop back and forth, pecking one another (Im not sure if they were fighting or playing). They morphed into huge spiders, then again into insects, then, I noticed a red dog tearing a chickens head off a few feet in front of me. I reached out to touch them but my hand went straight through.\r\nAt this point the door bell rang. It was Dave (who had been sat in the car for a long time) asking the whereabouts of Matt. Neither of us had any recollection of abandoning him. Come in I said, I think hes upstairs. We spend a while looking for him. Theres definitely someone else here I say. Dave replies that hes also seeing people and sits down in the living room. I was exhausted and got back in bed. I couldnt sleep so I kept walking into different rooms then forgetting what I was doing there.  I occasionally passed Dave on the way to the toilet and asked him what he was doing in my apartment. Some time later he walks home. The following day (still very high) he told me that he kept talking to Matt then realising he wasnt there. \r\nDeep into the trip I become aware that I could move inanimate objects without the use of physical contact. Telekinesis seemed perfectly normal in Brug reality. With only a pointed finger I could shift (real) dog toys from one side of the hallway to the other. Each toy had a colourful trail as it drifted across the carpet. 14 hours after ingestion I go to sleep in the living room (there were too many insects in the bedroom).\r\nThe following day I had work as a dinner man in a local school. Still very high I try to phone in sick, but as the secretary answered the phone I forgot who I was talking to and what I was supposed to say. I mumble something about a friend in intensive care. The secretary tells me I have to come to work so I turn up in dark sunglasses which I wear all day. I was now suffering from severe perspective distortion which really isnt good when youve got to serve dinner to 75 kids. The problem I had with imaginary objects moving away from me was now happening with real objects! I made a fool of myself and resigned.\r\nMy eyesight gradually returned to normal after two days and the hallucinations tapered off over the following three, however, the trip was far from over. I was in a drunken stupor for weeks and began hearing voices. Whenever I smoked cannabis things really spiraled out of control. I became delusional and paranoid, the voices multiplied and became even clearer, and my entire field of vision was overcome by kaleidoscope patterns. \r\nThese effects were enjoyable for a week, then, I got the fear. I tried to ride it out but felt like a complete mess and my family kept telling me I had taken too many drugs. After two and a half weeks of delusional paranoia I decided to throw away all of my cannabis plants and three ounces of high potency cannabis. Within a month of sobriety I returned to normal. \r\nThe one thing that really amazed me about Brugmansia was the longevity of the experience.\n\n\n"
}