{
 "title": "Good Stuff",
 "author": "Keith",
 "citation": "   Keith. \"Good Stuff: experience with Sertraline (Zoloft) (ID 52997)\". Erowid.org. May 7, 2008. erowid.org/exp/52997",
 "substance": "Sertraline (Zoloft)",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52997",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 7, 2008",
   "Views: 12842",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been on Zoloft for almost 2 months now, and I feel good.</p><p>There were a number of factors that lead to my depression. When I was younger I was bullied an awful lot, I was an outcast in my class in high school, and still have some self esteem issues. When I finished high school I began uni, and quickly realised that I hated it I went on feeling like this for 2 years. I had no friends there, and hated the course I was taking, but I kept going because I didn't want to be a disappointment to my family. I'm also very insecure, and have trouble with women and relationships in general.</p><p>All of this stuff just snowballed and became overwhelming, I'd stay up at night hating who I was, crying and feeling helpless. I began to think about suicide on a daily basis. One day I made the decision to tell my parents how terrible I felt. I came to the conclusion that I needed to leave uni for a period of time, but it didn't help. Finally I mustered up the courage to speak to my doctor and he put me on zoloft and referred me to a psychiatrist.</p><p>At first there were some side effects. For about 2 weeks I had trouble getting to sleep, and my appetite was chaotic, I lost weight because I wasn't hungry at all, but these side effects have lessened gradually. I also have a bit of trouble achieving ejaculation, I can still do it, but if I've been drinking or smoking grass it's damn near impossible to ejaculate.</p><p>I've been taking 50mg a day and feel great. Things that used to bother me just don't bother me as much any more. I haven't thought about suicide for a ages. I also have more confidence in myself, and have realised that I'm not worthless.</p><p>All in all I really have no complaints about this drug, it has worked wonders for me.</p>"
}
