{
 "title": "I Think It's Worth a Try",
 "author": "Matt",
 "citation": "   Matt. \"I Think It's Worth a Try: experience with Catnip (ID 5299)\". Erowid.org. May 23, 2001. erowid.org/exp/5299",
 "substance": "Catnip",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "smoked",
   "Catnip",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5299",
   "Male",
   " ",
   "Not Given",
   "May 23, 2001",
   "41980",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was bored one night, and had remembered a friend had told me that he once smoked catnip and got a little buzzed, so I figured what the hell, I'll give it a try.  Here's a description of what happened:</p><p>6:00 pm</p><p>I took some ground up and dried 'cosmic catnip' and constructed a pipe out of the tubing of a toilet paper roll and a used up coke can.  I took the ground up leaves and lit them up in my pipe, and took a few hits.  I see no change as of yet.</p><p>6:05 pm</p><p>Starting to notice a plesant minty feeling in the back of my throat, spreading down to my lungs, otherwise I feel quite normal.</p><p>6:12 pm</p><p>The minty feeling has spread to all of my lungs and appears to be spreading a bit outside of them.  I'm starting to notice that reality is taking on a bit of a different look *THIS IS AN EXTREMELY SMALL CHANGE*.  It is hard to explain, but when I move my head my eyes do not seem to be in sync with my head's movements, it is like moving a digital camera and the picture does not follow your camera's movements fluidly.</p><p>6:17 pm</p><p>Minty feeling leaves back of throat and is entirely in my lungs, this feeling is very pleasurable.  Starting to notice slight muscle weakness.</p><p>6:24 pm</p><p>Feelings of mintyness in lungs still there.  Things still same as previous input at 6:17.</p><p>6:48 pm</p><p>Minty feelings decrease a bit, but are still there and feel good.  The slight change in reality is still there, although does not seem to be as noticable as before at 6:12 pm.  I'm feeling slightly tired.</p><p>6:50 pm</p><p>Eyes feel a bit heavy.  Minty feeling in lungs dissapearing very slowly.</p><p>6:55 pm</p><p>Feeling slightly relaxed all over my body.  I am now in a chatroom and seem to be typing slower and making more typos more often than usual.</p><p>7:00 pm</p><p>Relaxed and somewhat euphoric feeling increases a bit, but is still very slight. At about this time the lid of a garbage can fell off and startled me, the rush of fear was felt stranger than it would usually feel when I'm startled.  It was not a more scary or less scary experience, but it just felt different.</p><p>7:04 pm</p><p>Feeling a slight giddiness, for no apparent reason.</p><p>7:07 pm</p><p>Minty feeling almost completely gone, can feel a bit of it in the bottom of my lungs.  I'm in a semi-euphoric relaxed state.  Giddiness gone completely.</p><p>7:15 pm</p><p>Relaxed state decreases a bit. Can still feel some of that minty feeling in my lungs.  </p><p>7:18 pm</p><p>Relaxed state wearing off. Minty feeling in lungs gone.</p><p>7:30 pm</p><p>Returning back to my normal state.  Relaxed state pretty much gone.  I am however feeling somewhat sleepy.</p><p>7:50 pm</p><p>The slight buzz I had has worn off, I am completely normal now, no drowsiness at all or anything.</p><p>\t\t            MY CONCLUSION:</p><p>Catnip is worth the try if you will be satisfied with a very mild buzz, somewhat similar to marijuana.  Do so if you wish, I had a pleasureable experience with it.  You should use dried leaves and it should be smoked.  Note that I used 'cosmic catnip' which comes in plastic containers with crumbled up leaves.  You can buy this stuff at some pet stores.</p>"
}
