{
 "title": "My Life as a Suicidal Child",
 "author": "Anonymous",
 "citation": "   Anonymous. \"My Life as a Suicidal Child: experience with Fluoxetine (Prozac) & Sertraline (Zoloft) (ID 52991)\". Erowid.org. Jun 21, 2007. erowid.org/exp/52991",
 "substance": "Fluoxetine (Prozac) & Sertraline (Zoloft)",
 "bodyweight": "48 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   " ",
   "20 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 52991",
   "Female",
   " ",
   "Not Given",
   "Jun 21, 2007",
   "Views: 12617",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started when I was 11 years old I had been sexually abused numerous times by my dad and when I was 13 I was taken away from my family from then on I decided that my life was fucked at the age of 13 I became a drug addict, alcoholic, and a chain smoker it wasn't long before I became suicidal can I also please note that I was just angry about what happened with my dad.</p><p>When I was taken away from my parents I was put with a couple only 19 years of age both of them because they were the closest relatives they let me do whatever I wanted and I ran wild.</p><p>At the age of 14 I became extremely depressed everything was going down the drain I wasn't been paid attention to and was running a muck of my self.</p><p>Docs workers, counselors and what not all described me as a wild teenager so eventually I had docs chasing after me they made me go to a doctor who diagnosed me with Depression they put me on Zoloft for about 4 weeks and it did nothing.</p><p>When I first started taking it I was getting suicidal thoughts anxiety attacks and what not then it got worse I started wrist cutting every night and even in the day at school and then my suicidal thoughts became more severe. I had never ever thought about suicide Ive always been a smart and sensible girl always getting Excellent grades so thats when I realized the medication was doing something to me. Eventually everything came to much for me and on my 16th birthday I took a overdose of 24 Zoloft's and I was rushed to hospital I have very little memory of what happened that night I remember a beeping noise and the annoying ping known as a drip hurting my hand but other then that not much comes to memory.</p><p>The next day I was seen by a psychiatrist I really wanted to go home so I made up some bullshit story that I was doing it to get attention from my biological parents which wasn't true at all cause I hate them.</p><p>Anyways she started asking me stuff about my thoughts on suicide and I said that they only started happening when I started on Zoloft she didn't believe me and urged me to keep on taking them.</p><p>The suicidal thoughts went on a week later I went to a mental institution for two days, then hospitalized for suicidal attempt for two days and then one day a week later I completely lost it and was again hospitalized for suicidal attempts this time for a whole week. They decided to start me up on Prozac because they were convinced that I was suicidal because of depression I told them numerous times that I was not depressed and I was just angry about everything but they were convinced so now Ive been put on Prozac my suicidal thoughts are worse then ever and now Im hearing voices, seeing things, More angry then ever I wont leave my room unless its for school but other then that they cant even get me to eat Im convinced that Im going to commit suicide.</p>"
}
