{
 "title": "Hot Tea",
 "author": "Kavanoid",
 "citation": "   Kavanoid. \"Hot Tea: experience with Kava (ID 52993)\". Erowid.org. Jan 9, 2008. erowid.org/exp/52993",
 "substance": "Kava",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "6 Tbsp",
   "oral",
   "Kava",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "52993",
   "Male",
   " ",
   "Not Given",
   "Jan 9, 2008",
   "Views: 15530",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was experimenting a little with Kava Recipies and I think I finally found one that I like so I thought I would share.</p><p>Hot Herbal Kava Tea</p><p>Ingrediants:</p><p>4 Cups Water</p><p>4 Herbal Tea Bags (I used celestial seasons sleepytime tea, you can also use sleepytime extra for the added velarian root)</p><p>6 Tbs Kava powder</p><p>Sweatener, Honey works great!</p><p>Preperation:</p><p>Measure out the kava and put directly into a blender. Rip open the tea bags and pour contents into the blender. Bring water to a boil and pour boiling water into the blender. Blend the mixture on a medium blend for 5-7 min. Then strain the mixture using some sort of strainer i.e. nylon bag, cheese cloth, fine wire mesh strainer, I used the later and after 2-3 strains it gets most of the large particals out but leaves the finer, palatable dust. Now sweeten to taste, reheat if needed and enjoy!</p><p>I have found that the minty herbal tea, the hot liquid and the sweetener almost completely counteract the muddy taste of the kava, and makes the tea actually kind of pleasent. The velarian root (sleepytime extra is a herbal tea with extra added velarian root) is a great relaxer without the kava and enhances the relaxing and euphoric powers of kava. It's best to drink it nice and hot, which can be a little difficult because it seems to loose heat rather quickly.</p><p>I'm drinking the concauction right now for the first time and it was so tastey I just had to get on and share it with others. So kick back relax and enjoy a hot cup of herbal kava tea!</p>"
}
