{
 "title": "Completely Otherworldly",
 "author": "Spacetime",
 "citation": "   Spacetime. \"Completely Otherworldly: experience with 2C-T-7 (ID 53003)\". Erowid.org. Jan 22, 2007. erowid.org/exp/53003",
 "substance": "2C-T-7",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "70 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53003",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 22, 2007",
   "Views: 8767",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So, in retrospect, this was not a good idea at all.  I ALWAYS dissolve my chems and dose accurately, but this time I just said 'what the fuck?'</p><p>What the fuck, indeed.  It was like 4 in the morning after a night of drinking (although I'd pretty much sobered up, and I'm sure that any alcohol effect was completely negligible).</p><p>I just felt like something had to give, and I was ready right then and there to explore my new friend, 2C-T-7 very deeply.  Thus, on a scale only accurate to the 100th of a gram, I poured out the material. I'd done 25, and wanted to double the intensity.  Thing is, at levels that small, such a scale isn't accurate in the slightest; since then I've seen exactly 70 mg, and now believe that this is more like what I actually took.</p><p>Long story short, at T plus 90 mins:</p><p>Complete fucking otherworld - I believed that my house was full of caring, like-minded people, there for a party.  Off and on, these people followed me out into the street to represent my every word as I raged against our quasi fascist leaders, greed, war, and the general 'dying of the light.'  T-shirt and bare feet on my cold, rainy block in March for what my neighbor thinks was about 2 hours.  One of the things I actually remember railing against was the 'grinding'.  'Just, for Chrissakes, if nothing else, can we just stop the fucking GRINDING?,' I'd say.  We have a freeway ramp in front of our house, and it was morning rush hour, but I meant the grinding of greed and waste and plasticity, of course.</p><p>I also became fond of yelling 'Don't buy it!' - which, my housemate Ryan later told me, I was screaming at a family and a real estate agent 3 doors down while they were signing the fucking papers on their house!  Luckily, Ryan got home right as the police got there, or things would have sucked a lot more. Oh, god, to think now of what a nightmare would've unfolded had I been placed in cuffs.</p><p>I tried to hug this one gung-ho cadet cop, and he really wanted to arrest me. Somehow, however, I had managed to charm/scare his superior into just leaving me alone.  I just remember throwing my hands up in the air and yelling 'Whaddaya gonna do, you know? I'm sorry, guys, but what can ya do?  It's fucking Portland, Oregon, man!  Whaddaya expect?  This ain't the fuckin' Jersey shore!' \n</p><p>Finally Ryan says, really forcefully under his breath - 'Dude, go </p><p>inside RIGHT NOW or you're going to jail.'  This rang true, so I retreated to the solace of my many friends, who I really believed would have my back.  </p><p>When Ryan came back, I explained this belief, and he told me there wasn't anybody there.  It would be about 5 more hours before I fully believed him.  I was so exhausted I went to sleep tripping BALLS.  No shit - the last thing I remember seeing were hallucinations more intense than any I'd seen before that day, and I was at plus 10 hours on a material that typically lasts 8.  </p><p>My dreams were sooo fucking wierd, but really my sleeping world wasn't that different from when I was awake.  I felt a little ashamed of the scene I had made, and brain dead for about 24 hours. Then I was sick the next day - very possibly from exposure to the elements. But am I glad it happened?  Fuck yes! Only thing is, if I ever go that far again (and I will, some day) it will definitely be in the woods.</p><p>Oh, I forgot to mention that I have tripped jillions of times on a vast array of natural and synthetic materials, including some truly insane ayahuasca journeys. I've left my body twice, but I had never left my mind before.  </p><p>In a way, I finally crossed over to actual loss of sanity.  But my moral compass was at its absolute, all-time most centered, and my notion of well-being (however skewed to include the pigs) was never in question for an instant.  Terrifying, gut-wrenching, beautiful and horrible - a total psychic death and rebirth that I wouldn't trade for anything.  But Jesus, that shit was nuts.</p><p>I could see the fibers of space-time bending around all existence. I am speaking literally. Let me be very clear on this point.  I mean that, with 100% certainty and seriousness, I saw the fabric of space-time, as surely as I see the keyboard on which I now type. Ever seen that?  It's fucking cool.  </p><p>During my astronomy kick several years ago I read about the lifelong quest of one QED/physicist to actually see the 4-dimensional reality of space-time - to both grasp and perceive the warp in the fabric, and witness the dissolution of the illusory distinctions we must maintain in order to live in 3 dimensions. You know how much fucking math this dude had to do?  Guy said he thought he had it for about 5 minutes one time.  I had it for about 6 hours.  No math.  In fact, I'm pretty sure I've forgotten how to do long division.</p><p>There is one important lesson to be learned from this, and it's quite different from the declaration of future abstinance one might expect in the wake of something so harrowing.  The lesson is, when dealing with any of Alexander Shulgin's phenthylamines and tryptamines in their pure form, ALWAYS dissolve a known amount (absent a milligram scale, obviously) in a known amount of liquor, then safely dose accordingly.</p><p>So, in summary, I have to reccommend filing this as both a 'disaster' and a 'glowing experience.'  Since then I've read reports that T-7 can cause actual delusions - this is DEFINITELY true!</p>"
}
