{
 "title": "Learning about my Control-Freakery",
 "author": "Coyote426",
 "citation": "   Coyote426. \"Learning about my Control-Freakery: experience with Ayahuasca (B. caapi & Psychotria viridis) (ID 53014)\". Erowid.org. Mar 6, 2009. erowid.org/exp/53014",
 "substance": "Ayahuasca (B. caapi & Psychotria viridis)",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Ayahuasca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53014",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2009",
   "Views: 7283",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuring my teenage years I developed various problems with drugs. This led me to become straight edge for nearly six years up until my wedding day in October 2006. As a part of my interest in magic I rediscovered an interest in entheogens. It was decided that Ayahuasca was to be the first entheogen Id try after my period of being straight edge and last Friday was to be the day.<br>My wife began making the brew on Thursday night. It was to be for three of us so we had two packets of each ingredient. The ingredients were brewed on a low heat in bottled spring water with some added lemon. The smell from the kitchen was a lovely earthy plant smell. The brew was eventually reduced down to 2 ½ litres at which point we had to go around to our friends place, which is where we would be doing the Ayahuasca. <br>Going into this experience I had wanted to do it in quite a ritual fashion and use this entheogen as a tool for exploration. It did not turn out this way as we did it in a more social and recreational manner with us sitting around talking and drinking the brew. I was also incredibly nervous about what might happen as my years of being straight edge had resulted in me being somewhat of a control freak and this would be my first ever experience with Ayahuasca.<br>The effects of the brew crept on me slowly. I had an effect of the room softening but I wasnt sure if that was due to tiredness or not. There was also a noticeable sway to my moving about as if I was mildly drunk. The greater effects didnt kick in until one time that I went to the bathroom. Due to the noise of the extractor fan we decided we wouldnt use the bathroom light all night so every so often I would be plunged into darkness to relieve myself. Part way through the night I went to the bathroom and the darkness suddenly became filled with glowing shifting shapes and lines of glowing blobs that looked like cells in a body or bloodstream. <br>My sense of distance was massively distorted too, as it seemed to be miles from the door of the bathroom to the toilet seat. When I emerged from the bathroom the accelerated visual effects continued with parts of my body seeming to stretch away from me and then retract. I also experienced fits of hysterical laughter like when I used to get stoned. These experiences werent unpleasant but I did get a little paranoid that I was much further in than my wife and our friend so I tried to hold back the effects. This was unfortunate as I would have liked to have been comfortable enough to just go with it. Eventually I came down. It was quite an interesting process, as it seemed that everything just snapped back to normal with no negative effects.<br>Nearly a week later and I feel quite positive about my experience. I learned a little about Ayahuasca, a little about how I would like to experiment with entheogens in the future, and a lot about my control-freakery. I plan to do Ayahuasca again but this time do it alone so that I feel less restricted by others. As a first time I think the relative gentleness of my experience was a good thing.\n\n\n"
}
