{
 "title": "Swampy Sally",
 "author": "Psy",
 "citation": "   Psy. \"Swampy Sally: experience with Salvia divinorum (10x extract) (ID 53029)\". Erowid.org. Sep 9, 2008. erowid.org/exp/53029",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53029",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 9, 2008",
   "Views: 2382",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis afternoon, me and two of my friends decided to take a trip into the woods of my backyard. When we found what we deemed a 'cool' setting, we put down two chairs in front of a swamp, teaming with reproducing life everywhere. I had brought 'rasta', my bub, and some sally d 10x. I had purchased it a few days prior in the witch city, Salem. I originally hadnt wanted to smoke any of my dear sally, since the last experience I had with it was quite overwhelming. I was apprehensive, but my two other friends wanted to see me do it first of course.<br>We had just smoked several bowls of cannabis before we walked into the woods, and we plugged the bottom of the bub with sum nug to avoid sucking the precious 10x through. After packing up a nice trip, I subsequently wound up being the only one willing to do it (after being persuaded and convinced, not the best way to go into a trip). After hitting the bowl and leaving the lighter to the sally the whole time to make sure it all burns well, I passed it to my friend the proceeded to count with my fingers to 30 while holding the smoke in.<br>When I got to around 23, I felt the pressure of the sally against my body. I dont remember making it to 30, but at around 24 I felt my perception completely warp in about one second to a complete trance state. I now come to think of this as my soul exiting my body; it feels as if the salvia sucks my soul out from my mind. Apparently, I started giggling uncontrollable, then I started rolling towards the swap and my friend had to grab me and pull me away from the swamp. I then repeated to walk backwards while the asked me to walk towards them.<br>Then I seemingly fell onto some plants and partially into the swamp. This I clearly remember, but I had the perspective of some sort of organism in the swamp. My legs were up in the air as I looked down at them, and movement was very limited and difficult, as was thinking. This was replaced by being helped to stand by my friends, then finally finding the chair and trying to sit back in it. This whole time I did not pay much attention to my visual perceptions, but my sense of balance was extremely stricken. It felt like my soul was slowly draining back into my mind.<br>Everything also seemed extremely funny to me, and I had a common hallucination that occurs every time I smoke salvia. This is the change in the fabric of reality. Everything I can see is all sectioned up by dividing lines and these lines, which are in the objects naturally, are where you rip off these pieces like ripping velcro. Each piece comes off perfectly, and when I turn my head they rip and tear and produce sum scratchy auditory hallucinations.<br>The trance state lasted about 5 minutes, and most of it I dont remember, my friends told me afterwards. We walked back to my house since my friends decided it might not be the best idea to take it next to the swamp, and I had to change my pants since they were wet from falling into the swamp and they both tried it but didnt have the same type of experience I did. I didnt feel back to normal for an hour or so, but some of the feelings may have been prolonged from a few ganja sessions. Ever si\n\n\n"
}
