{
 "title": "A Glimpse",
 "author": "Jay",
 "citation": "   Jay. \"A Glimpse: experience with LSD (ID 53036)\". Erowid.org. Aug 23, 2006. erowid.org/exp/53036",
 "substance": "LSD",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1996",
   "53036",
   "Male",
   " ",
   "Not Given",
   "Aug 23, 2006",
   "3497",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There are moments in my life, where I remember myself as the person before, and the person after an experience, I had one of those moments one evening late in the summer of 1996.</p><p>Myself and a group of friends had gathered at a buddy's house, his folks were at their summer home and we used to have get togethers there to party, have bonfires, and listen to music... it was always a good time.  But this one night has stuck with me, I remember it as if it had happened yesterday, the vivid image burned into my memory.</p><p>My friends and I had come across a vial of liquid LSD.  We had done it many times before, see colors move and wave, things seem more alive, make cigarette trails and circles but never in my life have I had an experience like I had that night.  I tear up even retelling this story in print, not because anything horrible actually happened that night, but I, still to this day, feel that I was given some insight from God, as to what's to come.</p><p>We had dropped the acid at about 8:00 pm, they were on the large sweet-tart rolls that have the dimple in them.  Each one had two doses on them, and always anxious to start the fun, we were getting disappointed after about an hour with no effect.  So after about an hour had passed, we took another.  In retrospect, I think this may have been a big mistake, because as the night progressed, I can only say I was taken to a place that living humans shouldn't visit.  </p><p>To this point in my life, I was not a very spiritual person, not a religious person and had no advance knowledge of the stories of the history of the Bible, the events of the night would surely change that.  Anyways, on with the story...</p><p>More people had shown up, some that we had partied with before, some that I've never seen before in my life, it was a friendly atmosphere, and at about 10:00, I began to feel the effects of the LSD.  It began as a normal trip, things began looking not quite normal, flowing wood grain, things that I could associate with my previous experiences with this drug.  </p><p>Then, my friend invited me to come up to his room to look at the fractal generator on his computer, which he referred to as 'god'.  I played along, it was neat, but he continued referring to this piece of electronic equipment as god, and as he did so, I began to have a feeling that what he was doing was VERY wrong.  After several minutes of listening to him, I stood up, and calmly said to him that 'That is not God'...</p><p>I got up and walked out of the room, and started to make my way down the stairs.  I got about halfway down, and began to feel dizzy.  I sat down on the stairs, put my head in my hands and closed my eyes.  I remember having a short conversation, like an argument, with who I could not tell you.  I said 'No, not yet' and they agreed with me, that it was not the right time.. and suddenly, I felt as if I was being pulled from my body.  Further and further back I was pulled, I could see the house and then the city, then the state... but stranger still, I was aware of all the people, things, animals, and that they were all interconnected, like a huge puzzle fitting together in perfect symmetry... and then I stopped.  </p><p>I could feel a presence over my shoulder, not intimidating presence, but felt such a love from this being that I can really not begin to explain it in words.  It told me that it needed to show me something, and that it was the most important thing in the world and asked me if I was ready.  I said yes, and then all of these images began to flash through my mind, slow at first and then faster and faster, I would later realize this as images described in the Bible, from Adam and Eve, through the present time, history flashing so fast that I couldn't grasp all that I was seeing.  </p><p>What I did get from it is that God is in all things, no matter how miniscule, no matter how insignificant.  I couldn't tell you how long I was there, a second, a minute, an eternity, but as quickly as it had started, it ended.  The presence then told me that I'd been shown the most important thing the world has ever known, and that I was to remember and tell as many people that I could.  The feeling that I had seen this once before was strong in me, I later likened it to what people are shown, before they are born into this world.  I remember nodding my head, and then I was told that I was going to be put back into my body, and was reminded once again to remember and pass on what I had learned.  And then 'BAM' there I was, standing outside the house on the front stoop.  </p><p>Standing there with me, was another one of my friends, Wolfy, he had also dosed with us that evening.  The conversation we had was chilling to me, to say the least.</p><p>He looked at me, cocked his head, and said 'Where'd ya go?'</p><p>I said, 'Wolf, you're never going to believe what just happened to me.'  He kind of smiled and started to walk around me.  I then told him that I thought I had just met God, and started going into some of the details of the experience.</p><p>He continued to pace around me, and again, smirked at me, and said 'You know, all that stuff you were just telling me...  You don't want to remember that.  The people and the Garden..' his speech began to speed up, '...the this and that.. You don't want to remember that'  Every time he made a revolution around me, I felt as if I was forgetting a little bit more of what I'd been shown.  Then suddenly, I felt this sick feeling in the pit of my stomach.  I looked at him, and said 'Oh my god Wolf... you're Satan.'  Again he smirked, winked at me, and walked into the house.</p><p>I stood outside for a bit, then myself walked into the house, most of the people at the party had wandered outside to the bonfire in the back.  I went down into the finished basement, it was empty save me and I sat there for awhile... then I had this thought, that a girl I had met earlier in the night was going to come down the stairs, and say something about 'freaking me out'... and click... the door to the basement opened up and down the stairs the footsteps came.  Sure enough, the girl walked around the corner and the first words out of her mouth were 'Hey Jeremy, I hope this doesn't freak you out but I know your ex..'</p><p>I said, 'I really don't mean to be rude, but you are freaking me out, I have to go.'  And I walked up the stairs and began to make my way to the back door of the house, see if I could find some normality with the other party goers.</p><p>Just before I opened the sliding glass door I thought... 'Wolf is going to make a comment of peeing his pants'... I opened the back door, and as I stepped out onto the porch, Wolf stood up and wiped his leg, and said 'Oh my God, I think I just peed myself.'</p><p>I was beginning to feel very afraid, a sense of impending doom began to make a knot in the pit of my stomach, like the world was going to end.  I kept looking out to the horizon for signs of a mushroom cloud or something, and I couldn't shake it.  Then one of the girls sitting around the fire walked over to me, looked at me and said 'Don't ya get it?'</p><p>I said, 'Don't I get what?'  It suddenly felt like she was making fun of me... She tapped another party goer on the shoulder and whispered something to him and giggled.  I began to sense the presence of Evil at the party very strongly.  She then looked at me again and said 'You really don't get it, huh?'  Then another person stopped next to her and repeated the same thing.. 'Jay, you don't get it?'  I had the sudden need to be far away from this place... The question began to travel through the party... 'DON'T YOU GET IT?'  I could hear it as I walked back into the house following me, and no, at the time, I can honestly say that I didn't get it...</p><p>I called my parents house, and got my Mom, I told her that I needed someone to pick me up, told her where I was and that I wasn't feeling well, I needed to be around people I knew loved me.  The question was still floating in my head... don't you get it?... I walked out the front door and was sat down next to my car.</p><p>The front door of the house opened, and my friend walked out, the one that was referring to his computer as 'god'.  He asked how I was doing and I told him that I had called for a ride.  We had some small talk and I was actually starting to feel a bit more normal.  I was thinking of calling back and canceling my ride... and then a thought came into my head and told me that if I kept partying, I would die.  I shook it off and began to get up, and all the hair on my body stood on end.  My friend looked at me, and asked what was wrong... </p><p>I said, 'Don't you see it?'</p><p>He said, 'See what...?'</p><p>I said, 'Oh my God!  Oh my God!' and began walking to the street... It had to of been in my minds eye, but I saw a fire in the sky, and pointed to it... it was growing, and growing... I dropped down to the ground and covered my head.</p><p>It passed over head with the sound of a thousand locomotives, and disappeared into the distance... At that moment, I knew that I had witnessed the end of the world.  I turned an ashen white, at that moment, a car pulled up, it was my brother and his girlfriend.  My Ma had sent them to come get me.  I left the party that night, a changed person.  I started going to church, something that since I've stopped as the church centered a lot around giving to get, and I didn't feel that was right, so now I just pray, and look to God to find the answers.</p><p>I don't really know what happened to me that night.  It wasn't like any other trip that I've ever had before, and I had always had a good experience... I still couldn't tell if what happened that night was a good experience or not, but good or ill, it did change me.  It was also the last time, that I took a hallucinogenic drug.  I realized that there are some things, that us living humans are just not meant to experience.</p><p>I pray for the world, and hope that day, that is so sharply burnt into my memory, never comes to pass...</p><p>God Bless you all...</p>"
}
