{
 "title": "View into Dreamspace",
 "author": "Mole",
 "citation": "   Mole. \"View into Dreamspace: experience with Salvia divinorum (20x extract) (ID 53050)\". Erowid.org. Apr 8, 2007. erowid.org/exp/53050",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53050",
   "Male",
   " ",
   "Not Given",
   "Apr 8, 2007",
   "2923",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I discovered salvia about 1 month ago. The complexity of the salvia experience seemingly grows with each use. A running theme I have found through my brief but facinating trips, are visuals in which I fall from 1 vision, spin/shift/rotate and find myself slipping though another portal to another vision. This typically happens several times. The relation of these types of trips to lucid dreams is also unmistakeable.</p><p>Early one morning, I sat myself on the porch and did two modest sized hits of a 20X extract. I found that anything more than that limits my ability to recall. One cannot underestimate the reverse tolerance effect of the drug.</p><p>With the sun still down and birds chirping in the background, I slipped into a salvia vision. I was in a summer time scene. Lots of people walking, bicycling etc. The hills were alive with trees and a pastel colored grass. I then felt the entire periphery of my view begin to ripple like waves. Slowly, the vision began to</p><p>sink into a vortex a few 100 yards ahead of me. I started to float backwards, slowly but steadily to view the rippling and sinking of this vision. When I broke the horizen of the view I could see the field slowly getting sucked into a wrinkled tan colored funnel. As I floated back further I noticed this funnel narrowed and terminated on the head of a human bust(basically head and shoulders). The man had his eyes closed. He was very old. There were also several other off shoots of funnels leading up to other parallel realities.</p><p>When I reflected on this trip, it seemed to me to indicate that the dream state may actually be a singular view into one of many, perhaps thousands of simultaneous stories playing within the mind at all times. I had a view to 3 such concurrent realities (dream or sub conscious realities) but perhaps there are more. How or when those realities commence is for further speculation.</p><p>How's that for a profound experience?</p>"
}
