{
 "title": "Happy Faces",
 "author": "Nonsense",
 "citation": "   Nonsense. \"Happy Faces: experience with Salvia divinorum (10x extract) (ID 53068)\". Erowid.org. Oct 21, 2008. erowid.org/exp/53068",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53068",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 21, 2008",
   "Views: 2487",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been reading about salvia for a while and bought some, but every time I tried it I barely had any of the effects that I had read about online, perhaps partly because I never smoked allot at one time due to not being in the best place, and I had heard that many have to introduce the substance to their bodies several times before reaching its true effects.  Probably the strongest thing that occured to me while on it was thinking I changed into a fence, which only lasted a few seconds.  I have also been reading about other 'legal highs' and have tried different seeds containing LSA and extracts of SJW.  I also smoke much MJ, and that's the extent of my drug use.</p><p>I had ordered 3 grams of 10x untraditional extract from a site I had previousely ordered some, and some seeds, so I trusted the site at this point so I wasn't worried about doing what maybe a harmful chemical.  Two days later I received it through the mail and decided to try it at my girl friend's house because her dad was sleeping, and the rest of her family was out.  When I previousely smoked salvia, it was very hard and seemed to burn the lungs, so at around four o'clock I brought my water bong into the garage, my girl friend with me, and filled up a bowl, lit it, and began to inhale.  More smoke than I thought filled up the bong, so I quickly exhaled and breathed in the rest, though I realized later I should have held both hits in as long as possible.</p><p>By the time I was breathing out the second hit, I began to feel overwhelmed, but it felt good, so I walked around her dad's boat (by which I smoked), so in case I freaked out I would not run the risk of bumping into the propeller.  I started to smile, and figures seemed to form all around me.  They seemed cartoonish in appearance but then again seemed to look very real and life-like and covered all the walls, and any object around me such as a mower seemed to have the same face as these things, all smiling at me with wide eyes.  I thought that they were singing but I do not remember what they were saying.  I did not remember this until smoking salvia later that night, but I was either being one of these things, or I knew I was a part of their world and I too felt their song inside of me.  I felt very happy to be in this place.  The only possible way to describe what I saw would be to think of the cartoon world in 'Who Framed Roger Rabbit', though what I was seeing was much more real and vivid, everything seemed to be alive.</p><p>The garage itself had the appearence that I was in a well lit building but I was also outside, like I had a short roof over me.  I look up the steps that led into my girlfriends house and I saw her at the top smiling at me.  She told me I should come into the house and the feeling of euphoria and this 'overwhelming feeling' intensified as I thought about what characters may be awaiting me in this house.  As I reached the the top of the steps I could feel the smiling faces becoming a part of me as I walked through the door, like I was walking through a portal that covered my entire body with this crazy push like feeling, all the while I also felt this pressure covering every inch of my body, which I have felt before with unsuccesful attempts to 'trip' off the substance.  I remember almost falling over and everything started to look normal and I walked over to the kitchen counter and leaned on it.</p><p>My girlfriend walked up to me and said something about calling her dog, which was very old and had quite a funny personality, and I started to tell her no because I was partly afraid to look at it, but I could not stop laughing at the thought of this dog coming in and taking on the same smiling form that the walls seemed to have.  Her dog walked into the kitchen and I pet it, but nothing strange happened.  A few seconds after that I felt a little light, but somewhat normal.</p><p>My girlfriend told me after I exhaled my second hit, I started to run out of her garage and stopped when I reached the open door.  I looked over and stared at some flowers we had brought in earlier, and she said I started smiling. I then looked at her and smiled and she smiled back at me, and I started to walk towards the steps all the while smiling at everything I was passing.  I looked at her and she said we should go inside and I nodded my head.  When I got into the kitchen she said I almost fell, and said something about everything outside being gone.  I seemed to snap out of it for a second and I asked her if she was scared, to which she said yes, and I then told her I better not tell her what just happened.  Then she said she got the bong and dumped it out and hid it, and called her dog over.  After petting it I walked into her living room and we talked about what happened.</p><p>I don't remember exactly what time it was when I smoked it, but I thought the whole experience lasted about a minute, and my girlfriend told me it lasted for about two minutes.  I enjoyed the experience very much and I will definitely keep doing salvia.</p>"
}
