{
 "title": "Good Times, Bad Times",
 "author": "Road Tripper",
 "citation": "   Road Tripper. \"Good Times, Bad Times: experience with LSD (ID 5307)\". Erowid.org. Mar 5, 2001. erowid.org/exp/5307",
 "substance": "LSD",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5307",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2001",
   "Views: 9796",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt all started off innocently enough.  I was going to St. George, Utah, to pick up a friend and go to Vegas for a fun filled weekend of smoking weed, cruising the strip, and a Phish concert.  Prior to this trip I had never even considered taking acid.</p><p>Friday morning we left St. George and headed for Vegas.  We smoked some shwag on the way down the canyon and jammed to the Doors, and talked nonsense till we got to Vegas.  When we got to Vegas we met up with some mutual friends, one of which attends UNLV and lives in the dorms, which is where we slept.  Friday night everyone found tickets to the Phish show, so we all went and had an awsome time.</p><p>Saturday morning we woke up late and sat around reminiscing about how cool the concert was.  We all decided we would try to get tickets to the Saturday night show.  Then my friend D pulled out a little bottle and smiled at me.  He asked me if I wanted to do some acid.  It was a very interesting thought, I had never really considered it before.  I had only smoked pot about three times before this trip.  I asked everyone what it was like and about all I could gather from them was that it was 'crazy,' 'intense,' and that I would be a different person after.  I thought for about fifteen minutes and decided to go for it.  D put two drops from the little breath freshener bottle on my tounge.  I rubbed it around my mouth and swallowed.  'That's it?' I asked.  'Thats it,' D said.  The friend I drove down from St. George also took one hit.</p><p>I asked why no one else was doing it and they explained that you develop tolerance and they didn't want to have to do twice as much to get the same effect.  I had no idea the night before that they were all tripping.  At first I had the feeling that nothing was going to happen.  They just told me to hold on and it would work.  About a half hour after taking the acid, things started to happen.  The first effect I noticed was that a blue chair in the room seemed much more blue.  It was strange but not alarming.  Then I laughed my ass off as I watched my friend B roll a joint.  It was so funny that he had these finely tuned 'joint rolling skills.'   Then we set off on what would be the strangest journey of my life.</p><p>As we set off across the parking lot the sun was high and hot, about 1:00 in the afternoon.  I could sense things much better.  I could feel the heat from the pavement and the sun was brighter.</p><p>There was quite a while before the show, so we decided to just chill and walk around the parking lot amongst all the Phish heads.  We picked a nice grassy hill partialy in the shade and by a big 'friendly' rock.  This is when I started to peak.</p><p>I sat among my friends, on a small grassy hill, partly in the shade of my friend the pine tree, and by my friend the rock.  I looked around and the trees started to dance and the grass seemed to flow like a gently, peacefully, rolling stream.  All the people relaxing around me were very beautiful.  It was one of the happiest moments I've ever had.  Everyone and everything were happy to be there sharing in each others' company.</p><p>Someone suggested that we go exploring and I was happy with doing anything.  We walked around all the campers and busses and did some people watching.  It was a very surreal experience.  Walking around thinking crazy stuff, all the dealers wispering 'acid, shrooms, extacy' at us.  Then it happened:  I was lost.  Four hundred miles from home, tripping balls, and I was lost.  I tried to stay calm and was fairly successful.  I just remembered I was on drugs and they would go away sooner or later.  Finally I found my friends without incident and we went back and chilled on the grass which was very relieving.  We didn't find tickets to the show but I was content for I had had my own little 'show.'</p><p>I think I will definitely do acid again some time.  It is quite an experience, but do some research before you try it.</p>"
}
