{
 "title": "A Decent Preparation and Combo",
 "author": "BigRobbo",
 "citation": "   BigRobbo. \"A Decent Preparation and Combo: experience with Anadenthera Peregrina (Yopo), Blue Lotus (20x extract), Alcohol & Caffeine (ID 53145)\". Erowid.org. Dec 21, 2007. erowid.org/exp/53145",
 "substance": "Anadenthera Peregrina (Yopo), Blue Lotus (20x extract), Alcohol & Caffeine",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "2 glasses",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)",
   " ",
   "125 mg",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(extract)",
   " ",
   "10 seeds",
   "insufflated",
   "Anadenanthera peregrina",
   "(ground / crushed)",
   " ",
   "1 glass",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "1 line",
   "insufflated",
   "Anadenanthera peregrina",
   "(ground / crushed)",
   " ",
   "125 mg",
   "insufflated",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(extract)",
   " ",
   "3 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53145",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 21, 2007",
   "Views: 17043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This trip report is a collaboration of two nights' experimentation with blue lotus 20x extract and yopo made from edible lime and anadenthera pergrina seeds. While the reports will be centered over the period of the yopo expierience, the preparation, methodology, setting and mindset will be addressed also.</p><p>First off, I'm a 22 year old, athletically fit male, 215lbs, a seasoned shaman in many spiritual ethnobotanicals and an expierienced drinker. I was in a state of slight intoxication of alcohol during each trial with very little eaten during the days attempted.</p><p>I have previously tried blue lotus petals by smoking, tea infusion and soaking in alcohol. I found the effects calming and relaxing and quite similar to codeine without the itch. I had not tried the 20x blue lotus extracted powder before this period. </p><p>As for yopo, I had read quite a bit about anadenthera columbrina and peregrina seeds before attempting it but have never done any DMT containing plants prior to this.</p><p>It all started on last Friday night when I decided to cut out of the techno club early with my girl S to go visit my friend K. I already had two vodka rebulls when leaving the club and S had a couple of rail drinks. I would say my mindset was relaxed and slightly buzzed from the drinks but wide awake.. (Note: I normally do not drink caffiene beverages, and am kind of sensitive to them.) This I figured played into how I felt the first night.</p><p>Once at my friend K's place I told him we were to try yopo snuff but first we had to make it. </p><p>I took ten anadenthera peregrina seeds and placed them on the frying pan with medium flame. As I heated them they began to puff up and swell. I took them off the heat after about seven or eight minutes and they were all swelled up. We proceeded to shell them of the black outer coating but found it a little brittle and the meat of the seeds on the inside tended to chip off and mingle with the black husks that we shelled. We placed all of the meats of the seeds in a shot glass and ground it up. I then added two pinches of edible lime and ground this throughly into the mix. The edible lime I honestly could say was 1/4th of the total ending powder result. I knew from previous reports that too much lime would result in burning of nasal passages and found the little that we placed in went a long way.</p><p>I then decided to place about a 1/8th of blue lotus powder into my glass of wine and also 1/8 into S's wine but she did not want to try the snuff. We would drink this through the course of about 30 minutes.</p><p>I am NOT a snorting guy AT ALL but I also quit smoking things to save my lungs so I decided to give this a try if only to experiement with the effects. I decided to blow about the size of a dime up to see the initial effects. I became a bit giddy and felt a slight pressure in my head but that was it so we decided to go for more. </p><p>We chopped up six rather large lines between K and I and were only able to pull about two before our noses couldn't snuff any more. There was barely a burn at all and I immediately began to feel stuffed up. I had to blow my nose after the first line and think I didn't get a decent effect from the one. After 10 minutes from initial insufflatation I felt funky, my head swirled a bit and I felt pretty lethargic. I also felt a bit euphoric and relaxed. My nose was stuffed up and began feeling a pressure in my head. I got a slight stomachache about thirty minutes in but it subsided. I started to feel like the TV's images became more colored and alive. I had decided to lay down and almost sleep a bit but was over taken by powerful closed eye visuals. I laid on the ground and litterally drooled for 10 minutes while viewing the CEVS. Altogether this lasted about 45 minutes before subsiding, around this time I felt a wave of euphoria and intense sensory stimulation. </p><p>I knew this was the blue lotus powder kicking in but was much more than what I remember the effects to be from the pedals I had done in previous trials. It was not overwhelming but very strong and sedate. S also noted a feeling of euphoria and relaxation that was not a drunken feeling but a very aprhodisiac sedation. We both felt very comfortable. After about two hours of blowing my nose and just feeling good, S and I finally went home and I slept very hard. I woke up with quite a pronounced hangover which was odd because I had not drank that much. Altogether over the course of several hours I had three glasses of wine and the two vodka rebulls previously. I know blue lotus is very synergistic with alcohol but the yopo was quite a stand alone instant feeling of simulatanous sedation, a floaty head feeling and slight visual distortion with CEVs.</p><p>The yopo I had not used from that night which equalled about two lines worth I saved and decided to try again while I was at a party. I only did one line at this party after consuming several drinks my first shot of vodka for the night which was about an hour prior to insuffulation I had placed about 1/8 gram of 20x blue lotus powder in it. I also had three beers and began to make mixed drinks (one of which I had placed another 1/8th of 20x powder in).</p><p>I chopped up the one line and snorted it all in one go. This had an IMMEDIATE of effects! I was taken off guard by the quick onset of the feelings. I resisted the urge to blow my nose and the effects came on harder and harder. About 10 minutes into snuffing the yopo I could barely keep my eyes open, everything shifted and moved and I had to go sit outside away from people as I felt very overwhelmed by visual distortion and swirling effects. The CEVs were pronouced and fluid but the body load was also present with a floaty, stuffed up head feeling and lethargy of the body. About an hour later I was back to baseline. I found there was no burn at all and I don't snort EVER so I think those who used baking soda or too much lime need remember a little is all that's needed. I also think that is its left to mix up for about a day the yopo seems to work better than fresh made but it's just a theory. I would honestly attempt more yopo but by itself to see what it does.....</p>"
}
