{
 "title": "Panic Be Gone!",
 "author": "Jitters",
 "citation": "Citation:   Jitters. \"Panic Be Gone!: experience with Alprazolam (Xanax) (ID 53176)\". Erowid.org. Oct 15, 2009. erowid.org/exp/53176",
 "substance": "Alprazolam (Xanax)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53176",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Oct 15, 2009",
   "Views: 52649",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy story begins as far back as I can remember. I have always been a very shy and nervous person, and have always had very bad issues with my digestive system due to stress and anxiety issues. In the past I always had experienced just some jitters and minor nausea during particularly stressful events, but nothing I couldn't handle. Now I am 21 and in my 3rd year of college and also getting married soon. It would seem that with the stress of finals and marriage I am now finding myself experiencing full blown panic attacks.\r\nFor anyone who has never had a panic attack it is very hard to imagine what it is like but I will do the best I can to describe mine (they can be different for everyone). I first noticed something was very wrong when I sat down for one of my last exams before finals. First my face started getting a tingling sensation and I started getting really jittery. The next thing I knew I felt my face flush and my palms started getting really sweaty. At this point I was just telling myself I was a little nervous but would be ok, but things kept getting worse. There was still about 5 minutes before the exam was to be handed out and I felt my stomach start turning in knots and severe nausea set it. At this point I really start freaking out and I'm thinking to myself I might have something seriously wrong or I need to go to the hospital. I also kept thinking to myself that I was going to puke and everyone would see me and how embarassing that would be, or that people could tell I was freaking out and that just made me freak out even more. I couldn't take it anymore, all I knew was that I had to get out of there and in my mind I knew if I got away I would feel better, so I just got up and walked out without even taking the test. Within a few minutes I was completely back to normal. \r\nOver the course of the next few weeks this same panic reaction happened to me 5-6 more times for very random things....going out to eat, another exam, going to the store, it seemed like almost anything could trigger another attack, and as soon as I got away from whatever triggered it I would be fine again. I knew I couldn't go through life avoiding everything that could make me panic, so I finally decided I needed help if I was ever going to get through final exams. My doctor was very understanding of the situation and diagnosed me with General Anxiety Disorder, Performance Anxiety, and Agoraphobia. He prescribed Xanax to take on an as needed basis (.5 - 1 mg depending on my needs).\r\nSo my first trial was going to dinner with a bunch of people (something that set me off a few weeks ago). 30 minutes before the dinner I took .5 mg of Xanax. To my surprise I felt fairly normal through most of the dinner. I was expecting a sedative effect as described by my doctor but was glad this didn't happen, instead my anxiety was controlled with no signs that I had taken any medication. I did however feel slightly nervous at dinner so when it came time for my final exams I decided to take 1 mg 30 minutes before the start. This time I felt some physical signs of the drug, my muscles became more relaxed, my mood was slightly uplifted, but in general I felt fairly normal and almost no anxiety. The best I can compare it to is having a beer or 2 while being really relaxed, and the feeling lasts 2-3 hours after the initial onset. Needless to say I made it through my finals with absolutely no panic attacks, and the drug didn't interfere with my ability to concentrate on the exam!\r\nI can't say how this drug would be as a recreational substance because I have not used it for that purpose, but for control of panic attacks and anxiety I can't praise this wonderful substance enough. I have heard some horror stories about addiction to it and withdrawal symptoms so I would never take it as anything more than an 'as needed' basis as I have been doing, but when I am experiencing the symptoms I described this drug can make me feel normal again.\n\n\n"
}