{
 "title": "The Freedom We Should Be Born With",
 "author": "Benkson",
 "citation": "   Benkson. \"The Freedom We Should Be Born With: experience with Mushrooms & Cannabis (ID 53217)\". Erowid.org. Oct 16, 2008. erowid.org/exp/53217",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 53217",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2008",
   "Views: 2636",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One night me and all of my closest friends (Sean, Jesse, and Clayton) decided that we were gonna buy some 'magic mushrooms' that we heard about. We didnt really know about the psychadelic aspect of them. We had just never hallucinated and we wanted to. We asked around and finally figured out where we could get them. It ended up being at a house on America st. downtown. None of us were really thrilled to have to walk up and down that particular street but we also wanted to get shrooms so we went and it was actually pretty easy to find him so it worked out well.</p><p>We got the shrooms and took them in the car on the way to Jesses house. Jesse could barely stomach them. He said the taste was almost unbareable, so he only ate a little more than half of his sack. Clayton ate the other half of his sack and chased it with some gatorade. Sean actually liked the taste and he ate them in about 10-15 seconds. I had read somewhere that if you chew them long enough to where they're almost like a liquid/syrup texture the effects hit you quicker and harder than if you were to eat them normally, so I did that. It was disgusting and took about 15 minutes of constant chewing. We got to Jesses house and went in his backyard to smoke weed around a fire.</p><p>I remember we were all talking about something and I didnt feel like talking about it anymore, so I just sort of sat there in silence looking at Jesses backyard. I looked at his house and I remember thinking that it looked just like a doll house. The way it resembled almost every other house Ive ever seen. I laughed when I thought about it. Then I looked at his fence and I started looking at his yard as a cage rather than a backyard. I felt like I was seeing the world for what it really was. I wasnt thinking about making money or getting good grades or obeying the law or anything like that.</p><p>The whole night I kept thinking how much different my life would have been if I had come across these shrooms at birth or sometime really early in life. Then I remember thinking that no one who is born in this time is really free. I put myself in a hypathetical situation which was - if I was born today and knew nothing about laws or order my natural instincts would be to get food if I was hungry, water if I was thirsty, move if I was restless, talk if I felt like talking, etc. then I compared those things to how you have to be in society. If Im at work and its not my lunch break then I cant eat, if Im at school and in a classroom I cant have a water bottle, if I were to feel really energized in the middle of class I couldnt get up and go for a walk to get fresh air, etc.</p><p>I told my friend Amanda what I was thinking about (Amanda had tried shrooms a few times already but not that night). She kind of laughed and said 'Yeah, they make you feel like you know whats going on, dont they?' right when she said that I got a rush of excitement/happiness unlike any other kind of joy I had ever had. I felt like my whole life I had been on a track, or an assembly line, and I was stepping off and just looking at everyone else on the track. And I felt like I was the only one who knew this track existed, so I just looked at all the houses on Jesses block and laughed.</p><p>Being caught up in the moment, I decided to take a walk. I asked if anyone wanted to go with me and Sean and Clayton came. We all told each other what we were thinking and we were all on the same page. We felt so amazing, and at the same time we felt like we were a part of nature, or that nature was alive just like us and we could relate to it. I looked at a tree and the branches curved to form a slide that little people were sliding down. The wind that blew the branches on other trees gave the trees lifelike qualities. They looked they had arms and legs and faces and they were all dancing. Around that time I sat by myself and looked at all of it and I knew that when I died I would be a part of nature and I would be just as happy as those dancing trees.</p><p>We felt like we were the wisest/most untouchable people alive. So we did whatever we wanted. Clayton started peeing in the street directly under a street light. Me and Sean started walking in straight lines, not dodging anything, we strayed off the road into peoples yards, then into their driveways, then we walked on top of their cars, and continued on the straight line. Not because it served a purpose, just because we felt alive and it didnt matter if we walked on their cars.</p><p>I even called my ex-girlfriend who I had just recently broken up with. Under any other circumstances I would not have done that, ever. I wanted to really bad, but I would have never let myself. I was always too afraid of what she would've thought about it. She told me once that if someone broke her heart, she could forgive them after a while, but she would never let herself get hurt again by that same person. I remember I had the perfect words to say to maybe change her mind about it, although when I thought about it the next day I couldnt remember what I was going to tell her and over time I just decided that I probably didnt have anything profound to say at all and that maybe it just sounded good in the moment, but she didnt pick up and I got really dissapointed, but all it took was Clayton saying 'Haha you just called your ex-girlfriend and said that dumb shit?!...Hahah!!' and I was happy again.</p><p>Me, Clayton and Sean went in Jesses house at about 3am and got some ice cream out of their freezer and we laughed and talked about all the stuff we were figuring out. I even remember Jesses dog coming in and putting on a face that meant he wanted to be pet or given some attention. While he was in the room with us I felt like I could think like him. And that he was not as intelligent as us but that he was just as happy. And then I thought about how at some point in my life I had heard someone say 'ignorance is bliss' and I understood it by thinking on the dog's level. We talked some more then I went to sleep. It was the best night Ive ever had. Its honestly the only thing I can remember this vividly that lasted as long as it did.</p>"
}
