{
 "title": "Mellow Pathway",
 "author": "Threenil315",
 "citation": "   Threenil315. \"Mellow Pathway: experience with Coleus (ID 53261)\". Erowid.org. Sep 1, 2006. erowid.org/exp/53261",
 "substance": "Coleus",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "10 leaves",
   "oral",
   "Coleus",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53261",
   "Male",
   " ",
   "Not Given",
   "Sep 1, 2006",
   "Views: 10660",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I hade been reading that coleus was used by ancient civilizations and even people of this era as a hallucinogen.  I was really bored last night and reading through the articles and browsing through photos of the plant I realized 'HEY!'  I have a lot of this growing right in my own yard.</p><p>I preceded to walk out of the house where I picked 10 fresh leaves of the beautiful coleus plant.  Hmm... I looked at the leaves for a moment and started to smell the aroma from them, I could already tell they were going to trigger my gag reflexes later on as they smelled of a bitter sweet scent.  Anyways I was hoping for a good trip. I was suspecting to see new lands or anything phenomenal but I did expect enhancement of other activities as I figured colors would be more vivid and my mind would create geometric shapes that werent truly there.</p><p>I continued to walk to my room and laid the leaves on my bed and walked out into the other room to relax by watching TV so that I'd be in a comfortable state of mind.  After an hour or so I went back into my room and put in 'The Wall' on my PS2, and started watching my favorite movie for 100th time.  I picked up the leaves I had picked about an hour ago and rolled them into one big ball and popped it in my cheek.  I let my saliva build up and occasionally swallowed and eventually I just chewed up the bitter leaves and swallowed them.  I sat there for 10 of 15 minutes not feeling anything strong but felt 'strange', neither good or bad.  After a while I realized I was concentrating a lot on the movie and when I looked at my ceiling I started to see objects in the light that my TV casts.  I saw waves of the ocean and random geometric shapes.  After sitting there for an hour or so more I went to a deep sleep.</p><p>Today I picked 10 more fresh leaves from a more mature plant in my yard.  I started to chew the leaves but after one bite, I realized that the more mature leaves were even more bitter and almost wanted to throw up, I then put the leaves into a tea mug and warm water for about 20 minutes with a little bit of sugar to hide the horrid bitter taste.  </p><p>Once the leaves had sat a while I gulped down the tea concoction and quickly ate the leaves that I had used to make it.  About 5 minutes went by and I felt slightly light headed, and started to have an out of body feeling.  Currently I am sitting here on my computer writing this listening to the Wish You Were Here album, Pink Floyd and still feel a little strange.  When I close my eyes I see geometric shapes and I feel very connected to the music Im listening to as if Im a part of the song.</p>"
}
