{
 "title": "Time Disappeared",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Time Disappeared: experience with Inhalants (Gasoline) (ID 53280)\". Erowid.org. Jun 16, 2007. erowid.org/exp/53280",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53280",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 8008",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]<br>So earlier today I was bored and had a lack of any mind altering substances or the like, so I decided to look on here for inhalants and such.<br>Gas was my substance of choice. I had been trying it through the little tube in those red gas cans with the gas filled pretty much to the top. That didn't work. So later on I removed the cap and basically took bong hits straight from the hole on the top.<br>About 15-20 hits in my world started to seriously warp.<br>There was this rythymatic wah-wah sound and it kept getting louder and louder and louder then all of a sudden I just blacked out. I hadn't realized I blacked out and I started feeling so helpless. Suddenly the world was a giant pill, and I was watching it spin<br>Then one half of it broke off and I felt a sharp, extremely sharp pain. I thought I was dying and the world was disappearing before my eyes, suddenly the pill came back together and I was screaming but couldn't feel anything, Time had ceased to exist. I scrambled to find something in this black abyss and I finally found it. I had grabbed a plant in my garden. I kept focusing on it and then tried to focus on it's surroundings. It was at that point I actually realized where I was. I looked up and saw the open gas can on the fence(rockish thing about 3 foot high) and the sharp pain I felt was when I fell off the ledge and hit my head on one of those little rock fences around a garden. It was bleeding horribly and was a knot the size of a goosebump.<br>This is an hour later and I had to frantically cover up the smell and plot a story to tell my parents. They say I'll be okay, but I feel so horrible right now. I'm a fucking idiot.\n\n\n"
}
