{
 "title": "Glorious Beach Weekend",
 "author": "Dave",
 "citation": " Dave. \"Glorious Beach Weekend: experience with LSD, Cannabis & Alcohol (ID 53297)\". Erowid.org. Oct 10, 2008. erowid.org/exp/53297",
 "substance": "LSD, Cannabis & Alcohol",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 0:30",
   "0.3333 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 5:00",
   " ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " T+ 5:00",
   "1 cig.",
   "smoked",
   "Tobacco",
   "(plant material)",
   " T+ 5:30",
   "0.3333 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53297",
   "Male",
   "",
   "Not Given",
   "Oct 10, 2008",
   "3807",
   " "
  ]
 ],
 "report": "<p>I just recently finished my sophmore year at college. To celebrate me and a few very close friends decided to take a trip to the beach for some much needed rest and relaxation. The weekend went off with out a hitch, but while we were there I decided to try acid for the first time. My experience was extremely positive and I was glad that I had the opportunity to try the drug since it helped dispel for me many of the myths and mainstream depictions of what LSD is and what it does. My story is as follows.</p><p>Saturday was going to be the day. After we got down to the beach and settled on Friday we decided that tomorrow was going to be when we would trip. The plan was this, head down to the beach, relax for a little while, then take our dose just before evening set in. My drug experience was somewhat limited, and I had never done a psychedelic before, so I was understandably anxious and a bit nervous, but because I had looked into acid a great deal and I knew what would probably happen I decided to bite the bullet and do a half a tab. The two friends who I was with decided to do a tab each since they were very experience in the way of psychedelics. </p><p>We ate the acid at 4:00pm on the beach and soaked up the late afternoon before heading back to the house. We meandered back to the house around 4:30pm. We lucked out on the weather since it was supposed to rain, but instead of thunder and lighting we were treated to a bright and sunny afternoon. The acid didn't kick in until we got back to the house, but I remember the walk back being beautiful and vibrant. To jumpstart things we all decided to pack a bowl and hang out around the house for a while. After smoking I began to feel the effects slowly settle in. I decided to take a shower to wash the sand and salt water out of my hair. As I walked towards the bathroom I felt my mood elevate significantly from anxious to almost giddy. </p><p>While in the shower I saw my first visualization. Now, having never done acid before I expected to see some very crazy things, things straight out of Fear and Loathing or Fantasia. The fact that I took so little probably prevented that, but I was mesmerized by the bath curtain while I showered. The whole bath area seemed to billow and breathe as I washed up. My mood elevated even more so during my shower, not just because of what I was experiencing but also because I had gotten over the initial fear of what would happen while I was on the substance. I knew this was going to be a fun trip.</p><p>After drying off and changing my clothes we decided to put on some music and sit out on the back deck. The sun was still up and the air was the perfect temperature for just lazing around in. For me, the realities of the drug began to set in while we all talked and enjoyed the early evening. I saw one of my friends the most stoned I had ever seen him. We sat around and talked about the finer points of drugs, college, relationships, physics, sunny days, and what we planned to do for dinner. All the while I remember looking at the pine trees out back and watched them dance in the wind against a cloudless blue sky. I didn't get many visuals while staring off into space but I was very comfortable and content with just being outside with my friends.</p><p>Soon the time came to order dinner, which turned out to be a little harder than I expected. We decided on a local sandwich place, but when I tried to read the menu I was more interested in the text on the page than I was with figuring out what to get. I let my vision unfocus a bit and I started to see the words on the page warp, slide around, and melt. After staring at the menu for what felt like a half hour I decided to get a turkey sandwich even though I wasn't hungry.</p><p>At this point we decided to walk back down to the beach and watch the sun set, but our contentness with our current surroundings kept us at the house. Shortly after, I got a call on my cell phone from my parents. I knew they were calling to say hi and see how the weekend was going, but my mind began to play with the idea that something might be wrong and they needed to talk to me. A little bit of anxiety began to set in as I dreaded this beautiful time coming to an abrupt and unsettling end and the anxiety of having a bad trip and what that would mean began to take hold. After talking with my friends, I decided that whatever it was it could wait and there wasn't anything that could possibly be that important. The relief I felt after this decision was one of the highlights of my trip. I thought I was feeling harmony and pleasure before, but now I was genuinely exstatic. </p><p>After trying to eat our sandwiches we decided that we would play some Super Smash Brothers and chill out until it got darker outside. I don't remember how long we played for, but 9:00pm rolled around sooner than I expected. I felt like I was at the height of my trip since my mood was wavering between pleasurable and anxiousness, so before the eventual comedown I decided that some other activities were in order. We shut off the television, put on some downbeat jazz music, and all gathered outside. </p><p>It was much darker and chillier now, but the atmosphere was very comfortable. I grabbed a little beer and wine for everyone and we sat around and drank a little. I also grabbed a cigar that I had been saving for such a time and we passed it around while we sipped our drinks. Its hard to describe everything I felt at the time, but I felt a oneness with myself and my friends. There was no callousness or poking fun, just a warm and mutual happiness and friendly atmosphere. We commented on how adult we felt sitting around smoking a cigar and drinking wine. It was perfect. Once the cigar was through with we decided on rolling a joint and then go for an adventure in town. The joint did not ignite the effects of the acid like it did for me before, but it helped me maintain my mood and that feeling of oneness with everyone and everything.</p><p>After smoking we headed back towards the beach and the small town that lies next to it. It was around 11pm and we toured around the town. Everything was closed since it was late and the off season, but it didn't matter. We ventured down to the beach again and watched the moon and the waves. On the beach there is a big jetty which I walked out to by myself and watched the waves crash over the rocks. I looked at the moonlight on the waves and reflected on my day. There was no doubt in my mind that is was a very positive one. I overcame my anxiety about doing psychedelics, I bonded even more with my closest friends, I experienced a great deal of beautiful sights and sensations, my mood was bright and positive the whole day, I was able to stop myself from worrying about my parent's phone call and bring myself out of a bad trip, and best of all I understood what it meant to do such a drug. </p><p>My one stunning realization about the whole day occured while I stood on the jetty. I thought about my general attitude and person and realized that I live my day to day life like the character Cameron from 'Ferris Bueler's Day Off'. I'm timid, I follow my parents to a T, I never do anything that might be dangerous or break the rules, and I generally get by but not as happily or as confidently as I could. It is hard to recount exactly what went through my head, but I felt that my day and the things I experience coincided very closely with Cameron's progression in 'Day Off', and despite what happened, I was a better person for having gone through with everything.</p><p>After soaking in the evening we decided to head back to the house for a little more Smash and maybe something funny to watch. At that point in the evening I was dead tired and decided to hop into bed instead of staying up more. Everyone else followed suit. I had some problems falling asleep due to racing thoughts and the like, but eventually I drifted off. All in all a very very positive experience. I'd try acid again in a second, but not in the next little while because of how powerful of a substance it is and how special the experience should be.</p>"
}
