{
 "title": "Life Compressed into Seven Hours",
 "author": "Flashback99",
 "citation": "   Flashback99. \"Life Compressed into Seven Hours: experience with Piperazines - BZP & TFMPP, Nitrous Oxide & Cannabis (ID 53383)\". Erowid.org. Jun 14, 2006. erowid.org/exp/53383",
 "substance": "Piperazines - BZP & TFMPP, Nitrous Oxide & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "Piperazines - BZP",
   "(pill / tablet)",
   " ",
   "50 mg",
   "oral",
   "Piperazines - TFMPP",
   "(pill / tablet)",
   " ",
   "6 hits",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "8 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53383",
   "Male",
   " ",
   "Not Given",
   "Jun 14, 2006",
   "Views: 10687",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I should probably say that I'm not much of a clubber myself. The experiences I've hand in most clubs involve copious amounts of alcohol and hard distorted beats and lots of noise and aggression - not my idea of fun. But this experience changed my outlook completely.</p><p>We were planning to go to a trance gig in the city in the late evening which had been booked by a friend. I remembered I had ordered some BZP & TFMPP pills that had been sitting in my drawer for a few days- I had originally ordered enough for what I thought would be a year without overdoing it - 2 high strength capsules, 6 mediums, and 2 super strength.</p><p>A week earlier we had each popped a medium strength one and realised these were perfect for clubbing - the euphoria was indescribable. </p><p>We headed to the venue and decided to take the pills in the club. Another friend who met us had a bag a tobacco laced with some high quality euphoric weed. Even though the pills were legal, we didnt want a search to go wrong, so he hid them on him. </p><p>As we walked to the club at around 11.00pm, we were all a bit anxious as to how the night was going to turn out, also wary of the strength of what we had planned on taking, but also aware that things could potentially go wrong.</p><p>When we turned up on the door we were searched...no problems! We headed into the club. As we entered, the first thing we noticed was three guys having their photo taken with balloons of nitrous! - We were in heaven - all of us having tried nitrous before, it was clear. This was going to be a great night!!!</p><p>A friend had taken the extra strength pill before going into the club, so as soon as we got in both myself and my other friend took our pills. </p><p>The first few hours, the music had just started and the club was slowly filling up. The music was mainly trance, with a hardcore house room and a central funk/breakbeat room. All the drunks gathered in the breakbeat room, falling over each other and generally looking wasted. </p><p>The coke people seemed to all gather in the hardcore room, dancing away. </p><p>12.30am:  By far the most peaceful, non threatening room was the trance room, there was some incredible music playing and we could slowly feel the mild coming up of the pills. The lights seemed more intense and the music was floating around the room. We decided to go to the corner and smoke a joint. As the smooth smoke set in, the hard edge of the coming up was blunted, with a mild sense of 'calm excitement' - we were relaxed that we were heading into a buzz. The weed had this wonderful effect of warming the music up and enhancing it's effect. Eventually, the beats just locked in sync with the overall mood and it was like a movie soundtrack. My mate who had gone to the toilet came back With three nitrous balloons!</p><p>We went to the centre of the trance room and waited for the break. We were so close to the full come up and we were already getting rushes from the excitement of the nitrous. Then we inhaled....</p><p>What happened next was like a whirlwind of pure sound, vision and emotion. As the beat dropped the mind had no choice but to get down to it! We were inside the music, inside the club, inside the world and coming up hard!!! The nitrous hit all the pleasure centers and activated the BZP/TFMPP combo, while simultaneously taking the 'blunted' feeling off the joints. It was pure bliss!!! Dancing was pure euphoria and we couldnt stop - heck just remembering what it was like makes me want to go clubbing again!</p><p>As we walked around the club, there was this wonderful empathic feeling with the rest of the crowd, sights, sounds, smells, it was like we could sense what everyone was feeling and there was a connectedness with everyone there. Walking was more like floating and my shoes on the club floor felt like bare feet in wet grass on a warm summer day.</p><p>But this was only the beginning of the BZP TFMPP combo. All three of us were coming up fast and so after and hour or two of dancing into the night we started to take what would be regular joint breaks. The effect of the joint was to curb the amphetamine like edge and replace it with empathy and a more chilled out feeling. The greatest thing was that as the weed would wear off, the BZP edge would rush back almost like a continuous set of come ups! It was wicked! </p><p>Even as I'm writing this I can still hear the music pulsating away. At around 3-4pm, the drunks had left and only the E people were hanging around in the packed club. We almost had this sixth sense as to who was dropping Es and who had finished being drunk. The drunks were taking lines of coke to continue their buzz and were really aggressive/agitated in behavior. The E people were friendly sociable and non-threatening. This really was/is the chemical generation!</p><p>At one point, we did a double nitrous balloon hit, taking care to breathe plenty of oxygen in between breaths. We entered into the hardcore room! - As the second balloon came off my mouth, I turned left and the whole world had slowed down. People were floating like gravity had dropped a notch or two, and two stunning women flew past me, their hair waving like trees in a strong wind, As I looked right, all of the light and colors blurred in my vision, and my thinking became vivid and sharp, like I was living every millisecond. </p><p>I felt like nothing I have ever experienced in my life. As we went further into the nitrous dissociation, the pill combo hit hard and we went into a frenzy of dancing - the hyper music sounded like the perfect tempo to dance to! - I called it nitrous music! My friends were dancing hard and the breaks were great - we had a deeper appreciation of this really intense music. </p><p>After a while it got a bit too harsh on the ears and we headed to a chill out area where we had a few more joints. This club was quite relaxed on the drug front and they were fully aware what was going on. People were most likely on the A-Z of substances here...</p><p>The evening was coming to a close and I was surprised how gentle the come down over the next few hours was. It felt like the slow dimming of the glowstick in my hand.</p><p>When we left the club we were still really talkative but physical tiredness was catching up. It was a quite strange feeling. The daylight outside had an almost film like colour to it. We got back to my mates house and promptly went to sleep. </p><p>The next morning I could still hear the music and felt like I had had a frontal lobotomy - not sure what that feels like really, but you get the picture!  The beauty was that there was no real comedown, like alcohol or MDMA, We drank water through the night and didnt touch any alcohol and we just felt physically tired and sat around all day, (after having a brownie!). </p><p>Even just a few hours of letting go, has had a postive effect on my outlook on life permanently. I can understand why drugs like MDMA were used for therapy once. </p><p>If one phrases could sum up the experience, it would be 'this is the s***!' - it was said many times during the night!</p><p>I cannot believe that this substance is legal, and yet I can. It hits harder than MDMA and yet the comedown is most peaceful than a hangover.  I sincerely hope it stay legal. -Can't wait to go clubbing again!</p>"
}
