{
 "title": "Ebony Brew of the Bean",
 "author": "Wide Awake",
 "citation": "   Wide Awake. \"Ebony Brew of the Bean: experience with Coffee (ID 53409)\". Erowid.org. Jun 28, 2007. erowid.org/exp/53409",
 "substance": "Coffee",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Coffee",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53409",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 28, 2007",
   "Views: 10563",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started drinking coffee only about a year ago at the age of 20.  Don't know why I never touched it before.  I think I was too into soda through my teen years, my body so soaked with sugar I couldn't stand the bitterness.  But now that I cut most sugary things out of my life I find myself enjoying some very bitter foods, coffee included.</p><p>No cream.  No sugar.  Just black.  And strong!  Its the only way to get to know 'the bean', and because of my love of a dark rich cup, I can't stand cheap pre-ground coffee.  Its missing that nutty taste, almost this sweetness that comes with the overpowering bitterness of good coffee.  If there isn't that oily film swirling on top of my cup after brewing I know I'm going to be disappointed.  I usually buy an organic Guatemalan whole bean at the local health food store that is actually cheaper than conventional beans!  I find I can't go wrong with Guatemalan beans, they seem to have a sweet chocolaty richness to them that just makes me grin.</p><p>I prefer to make it myself, because I use a french press and they make great coffee.  A little chalky at the bottom, but its worth it to get rid of the filter that soaks up so much of the oils.  My second favorite method is my father's old vacuum coffee maker.  Its just fun to watch.</p><p>There's this thing I have to do where I watch the cup cool down.  Its a meditative thing for me, to watch the swirling patterns of steam slowly rise from the cup, the oils on top swirling, dancing slight colors amidst the sea of black...but then again, what part of life isn't that amazing if you just stop and look?</p><p>I personally think that coffee/caffeine is a very underplayed drug.  I don't mean that in a bad sense, but it is definitely psychoactive.  I definitely notice the shift in my mind when I'm drinking it.  Its like hitting the accelerator on my brain.  Conversation flows out of me, I find myself playing with words when I talk.  It really puts me in the zone to make art too, painting is a non-stop pleasure.</p><p>I also meditate a lot on coffee.  I like finding a spot in the woods, just sitting still and slowly sip.  The moment I sit still, all the energy floating around in my bloodstream seems to rush to my head and outwards, creating a visual feast, an overlay of patterns on everything, shifting colors, heightening of sound, acute awareness of movement.  The leaves/branches around me seem to dance!  But I don't drink it expecting the coffee to do all this for me. I can do this without the aid of anything already, coffee just seems to sorta make that self-induced psychedelic state easier to find for me.  Drinking ridiculous amounts isn't going to do it either, its a symbiosis, in fact it seems smaller cups work better than bigger ones if I attempt something like that, as well as some good ol' patience.</p><p>I find that coffee and cannabis are good friends.  When I have bud, I love to enjoy the smoke with a bit of coffee, especially in the winter.  Is it any surprise that my two favorite indulgences go well together?  Each one on their own is really great to make art with, and together it only gets better.</p><p>I should mention some negative things Ive noticed with coffee.  Tolerance builds quickly it seems.  I try to take a break a couple days every once in a while, instead of just drinking more.  Stretches supply, and keeps the feeling fresh, just like with any drug really.  I usually have one 16 oz cup a day usually in the morning.  Sometimes Ill have another 8-10 hours later if I want to stay up all night.  But the second one is a hit or miss. If I have two sometimes it just prolongs the feeling and keeps me up.  Others it causes a weird sedate feeling and chest pains.  Just goes to show that, as with everything, I have to be careful.  Nothing is safe when done under the cloak of ignorance and carelessness.</p>"
}
