{
 "title": "Definitive Answer",
 "author": "Dirt",
 "citation": "   Dirt. \"Definitive Answer: experience with Leonotis Leonurus (Wild Dagga) (ID 53425)\". Erowid.org. May 30, 2007. erowid.org/exp/53425",
 "substance": "Leonotis Leonurus (Wild Dagga)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Leonotis leonurus",
   "(flowers)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53425",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 30, 2007",
   "Views: 20134",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There are so many conflicted reports about the potential of leonotis leonurus, so I am writing this to put an end to the argument once and for all. This shit is real. It works. Simple as that. I live in the one of the southernmost regions of Australia, so my knowledge of American Indians is extremely limited, but I know they wouldnt smoke anything unless it had effectsand this does.</p><p>I am 18, and I have been a daily pot smoker for the last 2 years, not to mention countless cookies, I have taken Acid, Shrooms, Ecstasy, Ketamine, DMT, Diazepam and have tried as many legal highs as I could lay my hands on, Codeine, Pseudoephidrene, DXM, nutmeg *shudder*, Bugmansia Sanguinae, Absinthe (yummy) and others not even worth listing.</p><p>Note: I am currently taking Lexapro (escitalopram oxelate[?]) 20mg daily for Social Anxiety Disorder. I dont know if it changes the effects of drugs or not, but I havnt noticed anything with any other substances.</p><p>Now, I discovered quite a while ago that my house is rife with Dagga plants. 4 or 5 scattered plants that have grown to what I can only assume is the full size, as they have been this big for as long as I can remember. Recently I was given the task of pruning them, and I delightfully went about my task and collected a large quantity of both leaves and beautifully orange flowers, to which I have been, and plan to continue, experimenting with.</p><p>From my experiences, getting a high off the leaves is about as fruitless as getting high off chimney fumes. And very similar tasting. There is absolutely no point in using them as anything more than a tobacco substitute to keep mix lit, and even then I wouldnt recommend it. </p><p>The flowers, ah, the flowersI tried eating them once, and yes there is an effect. However, the taste is absolutely horrid, and the aftertaste even worsebut the aftertaste DOESNT GO AWAY for a long while. I do not recommend this either. </p><p>Now we come to -smoking- the beautiful flowers. As with any good pot mix, these things need to be cut up as fine as humanly possible. Doesnt make the hit stronger, but the burn is faster and easier to shotgun. Add pot, tobacco, etc. as you wish, but the stuff alone works. I add very small amounts of tobacco to assist burning, but if its fine enough it isnt really essential. Contrary to other reports, I found smoking Dagga flowers easier- to handle than smoking pot. And it doesnt stink like the green either, a lot more perfumey and easier to explain to those meddling parents.</p><p>I found that two of these cones is very similar in effect to a single of pot. The high isnt as psychological as pot, and you can remain fairly lucid and controlled under its effect. In fact, in the same way pot makes me nervous around people, I found social interaction easier with Dagga, almost comparable to a small amount of alcohol. The body high is by far the most potent effect, however. It makes one feel relaxed, somewhat numb but without (much) effect on motor functions, perhaps comparable to moderate amounts of codeine (\n</p><p>Bear in mind, that if youre looking to trip balls then this is not for you. This is no placebo, but it is by no means a hard drug in status or effect. It works, its mild, but its pleasant.</p>"
}
