{
 "title": "Spiritual Learning or Cartoon Hell?",
 "author": "Shamano",
 "citation": "   Shamano. \"Spiritual Learning or Cartoon Hell?: experience with Salvia divinorum (30x extract) (ID 53503)\". Erowid.org. Oct 31, 2008. erowid.org/exp/53503",
 "substance": "Salvia divinorum (30x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53503",
   "Male",
   " ",
   "Not Given",
   "Oct 31, 2008",
   "Views: 5238",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I first smoked salvia at a pretty young age but it never worked since I had only had the un-enhanced kind. I had stopped using all drugs however though for a period of about a year or two after a couple of intense mushroom experiences. Yet just recently, as I have been delving into alot of shamanic knowledge and techniques, I decided that I would try out Salvia again, but mainly for gaining knowledge about my own life and enhancing my scope of the dreaming world etc.</p><p>So I went to my friends house who had some and we went to the top of this hill and brought his bong. I started to prepare my mind and body with some shamanic movements, yet these would prove inefficient. I sat down w/ my friend under a tree and a light rain had started, I saw this as somewhat of a bad sign. Furthermore, minutes before, as I was doing the movements, a sudden flash of energy engulfed my perception, as it often does during these exercises, allowing glimpses of the astral realm around me to be seen, and for an instant I saw what looked like a strange, devilish looking spirit in front of me. I have seen such things before and these had always been bad indications. I passed it off though as I felt it was too late to turn back, or rather cause I just wanted to smoke the plant.</p><p>I took large inhalation out of the bong when my inner voice said to smoke more. I took another hit, yet as soon as I put down the bong, the voice said 'Take twelve more hits!'. I was baffled and I had to put down the bong, unable to control my laughter at this strange voice. As my laughing faded, I saw something fly into the mountains ahead of me in the corner of me eye. Immediately afterwards, I heard a loud taunting laugh, which my friend had not heard even though he was a foot away from me. My vision broke into fractals and I felt a strong pressure on my brain. I leaned back and the tree above me turned into a cartoonish face. I felt I should get up, as my body felt stiff and soar, mainly in the areas I had been exercising with the movements, then the tree face started to shoosh me away by blowing at me. I stood up and walked it off, feeling a marijuana like high for the next couple hours. I felt like I had ruined the trip with my thoughts of getting up, so I wanted to do it again.   </p><p>(Trip# 2)</p><p>A week later, me and my same friend, plus another, went into a nearby creek to try it out again. First my friend would smoke, taking one large hit. He explained to me after that he heard eerie music and a voice which told him to move to the left. A similar thing had happened to me on my previously described trip above, I felt as if my body was sliced in half, and that the left side of me was hollow & energetic opposed to the heavier right side. What's even stranger is that after my friend hummed us the tune of the evil music he heard, my original friend burst out with shock, exclaiming that he had heard the exact same tune while he was on salvia one time. </p><p>I decided only to take one hit this time, yet the bong we had now was much larger. Before I took the hit I saw a strange little fly hovering around the bowl. Then I heard a very clear intuitive voice say 'I am your spiritual satan', then 'I will take you to hell'. I took the hit and then laid down with my back against a rock, the voice then said 'Ha Ha I love it when you come here'. I closed my eyes, refusing to think about these little thoughts, trying to deem them insignifigant with the actual power of the trip.</p><p>My vision broke up into little fractals, similar to the way a fly sees. With my eyes closed I still could see the superimposed, yet broken up imagery of the world in front of me. Yet the pieces of the image began rearranging themselves into totally alien, fluid, images. Interestingly, this happened with the sound around me as well. The noises I was naturally hearing started to rearrange themselves. I wanted to take control of this, in fear that I would hear that evil music my friend described, but as I tried to instill my own music and mantra into my head, the salvia song overtook me. I started hearing what was like music you would hear in a mid eighties video game, yet with a haunting childlike tone that seemed to poke fun at my own position.  It was as if the 'ally' (living force or spirit) of the salvia possessed me and fixated my modes of perception into the reality it wanted me to perceive, just like the perception of our daily life is none more than a fixation.</p><p>As the trip continued, I felt as if I really was in some type of energetic hell. I tried to raise it up into a calm, heartfelt feeling yet I felt something was laughing at me, making me feel rather insane. The 'evilness' of the trip started waning though and I could make out more of the fractals in front of me. One image became what looked like the head of a crowned, greenish being. This I thought to be the being that people commonly see during their salvia trips known as 'Lady Salvia'. I did not feel her presence so much though as I did feel like there was a whole bunch of little childlike, yet totally evil, people speaking to me and altering me.</p><p>As I opened my eyes, normal reality was somehow different. My friends looked as though they were made of clay. Their bodies and faces made me see them as what I now completely believe they are not simply products of million years of evolution yet designed creations from God. Going to what I call the 'Salvia Realm' made me see our own world as a created place in such a powerful way I cannot describe. This did not at all occur intellectually though, I simply saw our world more clearly, making it seem extremely beautiful and artistic. Being engulfed in that foreign place made me desire more than ever to be human again.</p>"
}
