{
 "title": "I Regret My Use",
 "author": "Doobi",
 "citation": "   Doobi. \"I Regret My Use: experience with LSD, Mushrooms & Cannabis (ID 53536)\". Erowid.org. Oct 30, 2008. erowid.org/exp/53536",
 "substance": "LSD, Mushrooms & Cannabis",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "1996",
   "53536",
   "Male",
   " ",
   "Not Given",
   "Oct 30, 2008",
   "9997",
   " "
  ]
 ],
 "report": "<p>I could not write this without providing a short history of my life since starting to use drugs and providing a little info about my personality. So, here we go...</p><p>I began smoking cannabis during my teens. I was in high school at the time and was soon in trouble. A favour provided to a classmate turned into a charge of drug dealing. I was given the option of attending a rehab or being reported to the police. I spent six weeks in an in house treatment centre where I was bombarded with totally ridiculous anti drug propaganda. There were one on one counsellor sessions, group sessions, occupational therapy etc etc. I was an ocassional dope smoker surrounded by heroin, cocaine and prescription drug users (the patients) and ex heroin, cocaine and prescription drug users (the therapists and doctors). Eventually I had enough of their bullshit and refused to acknowledge being an addict in group therapy (it was a NA style rehab). After leaving it took about 3 months before I smoked cannabis again. I met new friends through one of my fellow patients who remain some of my best friends to this day.</p><p>With these friends I attended my first music festival where I experienced my first fully psychedelic LSD trip. I had taken a very small piece of a paper before this, but this was the ONE. Uncontrollable laughter, joy, and then, later on I got lost in the crowds of people and joy turned to sudden, inexplicable fear. An undeniable facet of my personality - shyness - rose to the surface of the trip and burst the bubble. In my first trip I experienced the ups and downs of acid. I carried on a few months later.</p><p>Tripping became a regular occurence and, unfortunately, a nightmare. Every time I tripped I would experience the negative thoughts and feelings from my previous bad trips. Smoking cannabis would induce similar paranoia to my LSD trips and stopped being enjoyable in social settings. Set and setting were just not happening for me and I stopped regular trips. Around this time I discovered mushrooms and was delighted to find them like acid, but without the irrational fear acid created in me. Unfortunately this led to a fall as well.</p><p>On the occasion of my 19th birthday I ended up with a 6 gram bag of psylo's and no one to share them with as my friends had bought and ingested their own when I joined them. I decided to take the whole bag alone and see what would happen. This was far, far bigger than the ONE. This was the absolute. I was in a particularly beautiful setting in the South African countryside at another music festival. After half an hour I could not walk. I lay in our campsite and was overcome by the beauty of my friends sitting next to me, the yellow flowers in the fields surrounding us and the mountains surrounding the valley we were in. That was what I think Timothy Leary must have experienced when he ate his first dose of mushrooms in central America. It was religious. I felt spirits in the surrounding mountains observing me and I felt the unity, the oneness, the universe as a whole and I could not contain the tears that started streaming down my cheeks as a result of the joy I was feeling. I was in complete awe.</p><p>The following year I wanted to repeat the experience at the same festival. I went a bit nuts and overdid things. I ate, I think, somewhere between 10 and 15 grams of psylos over a few days. I did not experience a short 6 hour trip but rather an extended 3 week descent into madness which resulted in hospitilization and sedation. Three months of weekly therapy sessions, a couple of psychiatric evaluations and medication followed. My consulting psychiatrist informed me that there was a very real possibility that my experiences could have resulted in long term epilepsy or schizophrenia. My therapist urged me to cease all hallucinogenic use to prevent another descent into madness. I ignored those warnings and resumed smoking later on without the expected epileptic fits or schizophrenia.</p><p>The remaining years until now saw me introduced to ecstasy and electronic music forms, both of which I had abhorred before. These two things showed me the way to enjoy psychedelics again, safely, and without the fears I had known before. I stopped all drugs, except cannabis, in 2005. I still, however, become introverted when smoking cannabis. The magic of cannabis left me. Last year I reached a point where smoking cannabis was no longer fun. I would wake up in the mornings and feel uncomfortable until the first joint which would just leave me feeling normal. I passed a resolution to halt my cannabis use as well and see what would happen.</p><p>My emotional development from teenager to adult suffered as a result of hallucinogen use. I think that in the last few months I have been experiencing some thoughts and emotions lingering from my teenage years. I have been up and down. I have suffered two short bouts of very serious depression and self doubt. At least the negative feelings have been real, rather than drug induced. I wish that there had been someone or something to advise me not to leap too fully into the world of psychedelics at the age of 15. In fact, I wish I had waited until the age of 18 or 19 before commencing experimentation.</p><p>Since ceasing to smoke, my concentration skills are better, I learn new things faster, I am more productive during my spare time, less exhausted, and more optimistic. I have smoked on a couple of occasions recently though and the experiences were sacred again. I plan to limit smoking to once a week, maximum, in the future. For now, I am not smoking at all. I practiced kundalini yoga for a few months after my traumatic mushroom experiences and it really helped me regain some focus as well as getting some good exercise. I am not currently in any classes as I don't have time. I wish to join a tai chi class some time and then decide between yoga or tai chi.</p>"
}
