{
 "title": "Side Effect Nightmare",
 "author": "Utk",
 "citation": "   Utk. \"Side Effect Nightmare: experience with Morphine (ID 53544)\". Erowid.org. Jul 1, 2007. erowid.org/exp/53544",
 "substance": "Morphine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Morphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53544",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 1, 2007",
   "Views: 29387",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt all started on a wednesday. My friend asked me if I had ever tried morphine. I said 'No, do you have some'. He replied 'Yeah do you want the 15mg pills or the 60mg pills'. Me, wanting to get an effect chose the big pills so he gave me 2 60 mg pills in a bag and let me try a 15mg pill at his house. We went into the jacuzzi in his apartment when all the sudden I got really weak and had no muscle strength and I couldnt feel my back.\r\nLater knowing that 15mg had an effect on me I thought that 60mg might be a bit too much for me. I broke on of the pills into pieces and tried a few methods of ingestion. I tried the insufflate method first(snorting). I broke up a little piece and snorted it through a hollowed out pen. All it really did was make me dizzy and it didnt give me this intense pleasure I had heard about.\r\nI then tried to make some tea out of it by disoving it in water. This gave me fuckin indegestion and I had some bad pain starting at the top of my stomach and working its way down. It happened because morphine upsets my stomach and I ate after it. I induced vomiting so I could get all that food out of my stomach because the pain wasn't worth a little buzz because I didn't eat much morphine. The next morning I tried smoking the stuff. I put like 15 mg into the bowl and smoked it and it just made my pupils small and gave me a little diziness.\r\nI got really pissed off at having no effect after all of this and decided to just eat a 60mg pill. I ate it at about 3:00 and all it gave me was indigestion again and no effects. A few hours later I went to the gas station and picked up a energy drink completely forgetting I had taken the morphine earlier. I drank it quickly and went to my friends house to watch the suns game. About 20 minutes later I started to feel high and remembered I had taken morphine. I asked him if my pupils were small and he said they were. I started to get little waves of pleasure when I ran and walked so went upstairs and started playing gta:sa. I didn't feel so good and had to go home.\r\nWhen I got home my parents expected me to eat dinner but I couldn't because every bite made me feel more sick. I went to the bathroom and threw up all the hot cheetos I had eaten. I didn't feel quite so sick anymore and ate my dinner. I told my mom thatit was the caffein which made me sick which it partly was. I got another wave of the sick feeling and decided to stay home and lay down because I had heard that that can help with the vomiting. I layed in my bed and I couldn't feel my legs or arms but I had a strange pleasure. At this point I couldn't even stand up without getting sick and throwing up. I think I passed out or just fell asleep on accident listening to my ipod (which was the best part of taking the morphine)and woke up 2 hours later having to go to the bathroom.\r\nThis is when I first realized I had urinary retention(inability to piss). This bothered me very much because I had drank alot of water and I couldn't piss. It didn't bother me so much then because I couldn't feel my bladder much anyways. After trying hard to piss all I acomplished was to make myself sick and I started throwing up violently like scary movie 2 into the toilet.\r\nIt was 10:00 pm when I first realized I couldn't piss and it wasnt until 12 hours later that I finally managed to go. It got to the point where I was considering waking my mom up and risking her knowing that I took morphine from the signs and symptoms(she is a nurse) because I had to pee so bad. I even had fucked up dreams where I would finally be able to piss and then wake up having to go really bad without being able to.\r\nAll and all I don't think that indigestion, urinary retention, and extreme nausia are worth a little bit of pleasure and good sleep.\n\n\n"
}
