{
 "title": "The Typical Interactions",
 "author": "Archaeo",
 "citation": "Citation:   Archaeo. \"The Typical Interactions: experience with Bupropion (Wellbutrin) (ID 53554)\". Erowid.org. Jun 30, 2006. erowid.org/exp/53554",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "350 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)",
   " ",
   "200 mg",
   "oral",
   "Modafinil",
   "(daily)",
   " ",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  ",
   "oral",
   "DXM",
   " ",
   " ",
   "  ",
   " ",
   "2C-T-21",
   " ",
   " ",
   "  ",
   " ",
   "2C-T-2",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 53554",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 30, 2006",
   "Views: 26704",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDue to general depression during High School, I began taking Wellbutrin and Provigil sometime after I finished a clinical trial, at the tail end of junior year. My depression did in fact begin to subside during senior year, and now that I am in college, I am much better. However, this may be due more to a change in environment, and a more positive senior year generally. \r\nThe actual effects of Wellbutrin on the body may be subtle to notice. Because I was taking Provigil during this period, it's hard to say exactly what caused what reactions. I am fairly sure, however, the Wellbutrin has a very slow onset, sometime after a month to several weeks it began to really affect my mood. I never noticed any particular feelings in my body or different thought patterns. Wellbutrin itself never made me ill.\r\nI continued recreationally using other substances during this period, and I can give an overview.\r\nThere is no real difference between the marijuana, opium, and cocaine experiences I had on wellbutrin and the experience my peers had on the same doses of the substance.\r\nMushrooms (1/16oz): I think that the effects of psychedelic mushrooms are somehow hushed when under the influence of wellbutrin. People around me are simply tripping harder. On the other hand, there were no negative side-effects. Both of my mushroom trips were done while taking full doses of wellbutrin, and both were rewarding experiences.\r\nDXM (150-250mg): This was undoubtedly the worst experience I had while taking wellbutrin. I did in fact have a 'trip' of sorts, and my peers told me that the disoriented thought patterns were similar to their own during the trip. But right at the onset I threw up, and then continued to throw up throughout the trip at regular intervals. I'm fairly sure that it was the wellbutrin that caused this to happen. It was extremely unpleasant.\r\n2c-t-2 and 2c-t-21: On 2c-t-2, I noticed a headache at the end of the trip that my friends did not. And on 2c-t-21 I noticed a body load that others had not had. However, it may just be a personal reaction. I tripped just as hard as everyone else on these chemicals. \r\nAcid: I tripped very lightly, as with mushrooms, but because I only took one stale hit, it's probable that I simply didn't have enough to really get the full effects. \r\nIn conclusion, while wellbutrin has helped me with depression. It's difficult to say where things will go horrifically wrong, when I was taking DXM, I thought I was going to die. I've decided to stop taking wellbutrin, there comes a time when I  have to stop relying on a crutch and approach the problem in other ways.\n\n\n"
}