{
 "title": "The Infinite Universes",
 "author": "Amoreena",
 "citation": "   Amoreena. \"The Infinite Universes: experience with Cannabis (ID 53595)\". Erowid.org. Nov 26, 2008. erowid.org/exp/53595",
 "substance": "Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53595",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Nov 26, 2008",
   "Views: 4282",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have smoked marijuana regularly for the past 2 years, but have never had an experience quite like the one I had last night:</p><p>I was at a friends house with four friends: Kyle*, Rizzo, Bella, and Aqualung. We were just hanging out and watching trippy movies, and then Kyle's parents left, so we decided to go outside and get blazed. Usually I'm extremely careful when it comes to bongs, because they make me cough a lot and they get me high really fast. But this was the last day of school, so I wanted to get fucking high as hell. I took a deep hit and coughed a lot, then drank some water and took two more slow, deep hits. After that I refused any more, afraid I'd get really giggly and not be able to control myself. </p><p>We all went back into the house, and my throat felt really scratchy, and I kept coughing repeatedly. I felt fine, kind of spacey and subtly happy. Then suddenly I got this weird feeling that I was in a different place and time than the others. I looked at them with huge eyes and they looked fine, but I felt like I was tripping out. Whenever somebody spoke, their voice sounded so loud that it echoed all around me, and yet I could hardly understand what they were saying. I decided I really needed to lie down and calm myself, so I went into Kyle's bedroom and laid down on his bed. I took a few deep breaths and told myself that no one would know I was tripping out unless I told them. </p><p>I flipped onto my side, nestled my head into the pillow, and gazed up at the black-and-white Beatles poster that hung on the wall. I watched all of the Beatles faces and they all seemed alive. Paul McCartney's eyes looked so huge and awake, it was like he was about to say something to me. And at that moment I realized that the photograph didn't just capture an image, it captured a piece of their souls. It caught their essence and preserved it forever, which is why they looked so alive. Just as I was really starting to enjoy looking at the poster, Aqualung called me from the living room and told me to come out and watch a movie with everyone. I really didn't want to leave the safety of the bedroom, but I went out and lay down on the couch and started to feel really weird again. </p><p>I knew that the effect of the herb would pass, and the only way to make it through was to close my eyes and ride the roller coaster. I closed my eyes and as soon as I did I started seeing hundreds of pictures in my minds eye, all were incredibly vivid, as if I was actually seeing them. One of the things I remember seeing very clearly was a kind of two-dimensional cartoon. I saw cut-out pictures of mine and my friend Jude's faces on top of childish stick-figure crayon drawings. We danced about on our 2-D stiff, square cartoon bodies in front of a crayon-drawn field of flowers. We held hands and looked happy, our photograph faces always staying still with the same expressions. Suddenly, the background changed from a field to dark hills and a red sky. Jude let go off my hand and turned away, walking away on his stick-figure body. Suddenly his photograph face expression changed from a happy smile to an angry frown. He picked up a bloody cartoon ax and then ran towards me with it, all the while in a comical stiff stick figure way. I ran away on my stick legs and he chased after me, baring the bloody ax. </p><p>The images changed and I started seeing other things. I can't really describe everything I saw but the best way to explain it is to say it was like walking down a hallway, with psychedelic flashing colors covering the floor and ceiling of the hall. The hall had a bunch of open doors, and each door was a porthole to a different universe. Some universes were full of light and color, and some were dark and scary. Each one was different, and I felt I could view each one as I liked. As I looked at all these universes, I realized that I belonged in all of them and none of them simultaneously. I didn't belong in any one, but a part of me was in each one. It was the coolest feeling when I realized that I could be a part of every universe at once.</p><p>All of this went on in my mind with my eyes closed while everyone else watched a movie, completely oblivious to the fact that I was visiting other universes. I opened my eyes and realized that each surface in Kyle's living room was a different universe as well. I looked at his brown wicker stool and somehow knew that it represented a universe full of dead brown trees that were infested with millions of tiny brown gnomes. I looked at a blue couch and knew that it represented the Sorrow Universe, where everyone weeps and weeps for all eternity. I glanced at the floral carpet and happily realized that it represented a jungle universe, full of lush trees and fruit, where I once lived and ran naked with the natives in a past lifetime. </p><p>Keeping my eyes open became too much of an effort and too much of a mind trip, so I closed them and realized that the effect was fading. I was happy but at the same time a little sorry that I had to leave my little universes. As the scary feelings wore off, I realized that I was completely at peace with everything. I saw a vision of myself lying naked in the middle of a desert, gazing up at a sapphire sky, completely at peace. </p><p>The only other really weird thing that happened was I got really horny and even though no one was touching me and I wasn't touching myself, I felt as if I was about to have an orgasm. At this point I opened my eyes and watched the movie that everyone else was watching. It was a bunch of circus acrobats dancing and leaping, and I felt as if every movement gave me sexual pleasure. Every time an acrobat moved, It was as if their movement was touching me between the legs, as if I held everything between my thighs.</p><p>After the visions and the horniness wore off, I felt extremely hungry. I had the munchies worse than I've ever had them. Right before we got high I had eaten dinner, then when I got the munchies I ate a bag full of rosemary crackers, two fat licorice sticks, a power bar, and a dish of ice cream and I was still starving. I felt okay by the time I had eaten, but I still felt strangely like I couldn't move or talk/function very well, so I mostly just sat quietly and didn't do anything.</p><p>Me, Bella and Aqualung went back to Aqualung's house and lay down in bed. I begged Aqualung to find me something to eat, but she told me I had already eaten enough so I should shut up and stop tripping. I tried to sleep, but then for some reason I starting laughing and it took me a long time to stop. Then I slept deeply.</p><p>The End</p><p>Note: After last night I realize that I have an extremely low tolerance for THC. I have had trips like this before, but with this one I was in a fairly relaxed state, so I was able to try to remember some of it. There were hundreds pictures and philosophical discoveries that I am not able to remember. This is a little hard to believe I know, because all I did was take a few bong hits, however, a friend once told me that coughing can give you a better high, and now I think I believe it. I'm definitely not going to try any other drugs...if this is what pot does to me, I don't want to know what acid would do. : )</p><p>*Names have been changed.</p>"
}
