{
 "title": "I'm So Tired But I Can't Sleep",
 "author": "Igiul",
 "citation": "   Igiul. \"I'm So Tired But I Can't Sleep: experience with Venlafaxine (Effexor) & Cannabis (ID 53598)\". Erowid.org. Jul 31, 2006. erowid.org/exp/53598",
 "substance": "Venlafaxine (Effexor) & Cannabis",
 "bodyweight": "107 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Pharms - Venlafaxine",
   "(pill / tablet)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 53598",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2006",
   "Views: 12312",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm a 16 year old male and have been a recreational drug user since I was 12. It was in november 2005 and I had quit using Ecstasy and Base Speed but wouldnt consider giving up cannabis as it is basically my lifestyle.\r\nOne of my best friends had been telling me for years that his dad had severe depression but I'd never believed him. One day he mentioned to me that his dad was now on 150mg Venlafaxine capsules 3 times a day. Curious as I had never taken any anti-depressants before so I asked him if he could get me some. He stole two 75mg slow release capsules and one 150mg. The next day he presented me with a 150mg Effexor capsule...I wasn't quite sure to trust him so I quickly searched the internet...when I found out it was a relatively new class of anti depressants called SNRI's I thought they souded like a good time, I mean when I used to think of Anti-Depressants I used to think they meant happiness...I was wrong.\r\nI took the 150mg capsule and kept the 75mg ones to pass on to friends or use if I liked the Effexor. We proceeded to skin up the first joint of the night and it did not affect me and the whole night even after 7 joints I wasn't stoned but he was stoned to the crows! This pissed me off, I couldn't notice any effects, especially not any of happiness. When my friend left I had more time to think and I realised it was similar to a speed comedown but not so severe...'What a waste of time' I thought so I went to bed as I had school the next morning. I lay in my bed the whole night, tossing and shaking my knee, almost urging myself to sleep but it wasnt possible.\r\nI went into school the next day and I felt so distanced from everything and everyone... I didnt feel tired in the morning but by 12pm I was yawning at every opportunity and was very tired and my mouth was still dry. That night, I tried sleep again but it wasnt happening same thing happened as the night before...I was extremley tired, my body felt sore as did my eyes...just complete fatigue, the next day at school was the same also. On the third night I was more tired than I have ever been and finally managed to sleep but not until after 4am as that was the time I last saw on my watch.\r\nI would advise people not to take any anti-depressants that are not perscribed for them especially not at a high dose... I just can't see how this helps people although I heard they take a few days of repeated dosage to have the desired effect.\n\n\n"
}
