{
 "title": "Danger",
 "author": "Past User",
 "citation": "   Past User. \"Danger: experience with Inhalants: Duster (ID 5361)\". Erowid.org. Apr 8, 2001. erowid.org/exp/5361",
 "substance": "Inhalants: Duster",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1994",
   "ID: 5361",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 8, 2001",
   "Views: 35869",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nIn late 1993 or 1994 I discovered a new, cheap, easy-to-get high:  compressed air used to clean computer parts- we called it air-duster.  I had done nitrous and could compare it to that, but it did some very different things.  I've done LSD on several occasions, but the most vivid hallucinations and delusions I've ever had came from this stuff.  \r\nIt is the most addicting substance I've ever known; once I started a can I would not stop until it was gone.\r\nAfter inhaling, it felt a little like nitrous...yet sounds were warped, you would start getting the tunnel vision and float between consciousness and unconsciousness, having visions of infinity and things I cannot describe.  I had delusions about what was going on around me; like my roommate or on the TV.  One time while riding in a minivan I was told that I stood up and tried to exit the vehicle- while it was moving- and I had no memory of that (I was 'dreaming.') It made me pass out and 'come to', over and over.  I don't know how many hits it took until I passed out the first time, but once I got started I just accepted it - you pass out, come to, take a hit, dream, another hit and another until you pass out, come to, sleep at times I guess, and just keep doing it. Yet you still might be trying to do something- another time I moved and fell off a couch, unaware until I 'came to'. After a while it made me throw up- I guess all that passing out was like dizziness in my head which gave me motion sickness.  It also freezes your lungs and can make you very cold- the can itself gets really cold.  \r\nOne time I was with my 'boyfriend' (a real loser) and I passed out, fell back and bumped my head on my roommate's loft.  When I came to this guy told me I had stopped breathing 'for about three minutes' and he was afraid and wondering if he should call 911.  It meant nothing to me and we kept doing it.  This stuff is really dangerous and addictive.  At the time I was using it, I was depressed and did it to escape reality.  It took about 12 hours to go through a can.  I would always throw up- it was gross.  But once I started I wouldn't stop.  \r\nI would make sure the active ingrediant was chlorodiflouromethane (once bought another one which tasted awful and I was afraid to use).  I only ever found two other people who were willing to use it with me beyond a couple hits; mostly I did it alone.  \r\nThis stuff is really awful and I plead with you not to use it- anything that freezes you, makes you pass out, have hallucinations and throw up is dangerous.  It's hard to believe that I did those things.  It may seem like fun and not 'addicting' to you, but it's really stupid.\n\n\n"
}
