{
 "title": "Beauty and Truth in Everything",
 "author": "Home Again",
 "citation": "Citation:   Home Again. \"Beauty and Truth in Everything: experience with Mushrooms (ID 53616)\". Erowid.org. Feb 25, 2008. erowid.org/exp/53616",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1.4 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53616",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2008",
   "Views: 3242",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me start off by giving a brief history of my drug use up to now. I am a 23 year old male. I have been drinking alcohol casually for 5 years, smoking marijuana casually for 4 years, I have done ecstacy 3 times, used xanax and various painkillers recreationally (although not often), have done cocaine a handful of times and the following is my first experience with mushrooms. Hopefully it will be of some help to you.\r\nAs you have read, I have a good appreciation for psychoactives that I consider healthy and in control. I only do drugs with close friends, in controlled situations, after I have seriously contemplated and researched my next chosen drug. With that said, I have been thinking about mushrooms for a very long time. For as long as I have been experimenting with drugs, I've looked forward to the day a mushroom trip would fit properly into my life, and last week I had my opportunity.\r\nThose who decided to trip were my two roommates (T and M) and myself. M scored the shrooms from a good friend and we set a date so that we could all prepare mentally for the experience. For 2 weeks we talked about it and read up online to get ideas for what we might like while tripping. Each of us ate approximately 1.4 grams, which was definitely a good amount for a first time. After much deliberation, we took the shrooms, put them all under M's little magic chopper thing and chopped them up until they were really tiny. Then, we seperated the pile into 3 smaller parts, chose our respective piles and put them on half a peanut butter sandwich. Very good decision. We practically couldn't taste the mushrooms at all, and since they were cut up so well it didn't take very long for them to kick in. Plus, we chewed our sandwiches really, really slowly, so that probably helped. They were ridiculously dry, but worth it. We finished eating them at approximately 8:45 and we were feeling some effects within 20 minutes, no kidding. It was surprisingly fast.\r\nWe decided to put in Fantasia (the disney musical) and watch it while we were coming up and that was a pretty good idea. Also, T and I highly enjoyed drawing or writing... mine were just lines and squiggles that accompanied the music from the tv, and it felt amazing flowing out of my hand, but T was actually drawing and writing. She didn't put her pen down for like an hour (or so it seemed). The drawings were also fun because it was fun to go back later and see what we'd talked about and what revelations we'd come to. Coming up, I just felt kinda restless and anxious, as did T, but M was feeling very heavy and was watching the tv intensely. She couldn't turn her eyes away. Fantasia was a good choice, it blew our mind with the visuals accompanying the music. \r\nAfter watching that for a few minutes, I suggested we go out for a walk, which turned out to be incredible. The day before, M and I walked around our apartment complex looking for places we thought would be suitable. We settled on a sorority house 30 yards or so from our apartment because the grounds are well kept, it's absolutely beautiful and since no one is living there over the summer, it's pretty secluded. It was good having decided on a place before hand, because we knew where we were going and knew our way back. It was easier on us once we were tripping hard.\r\nWe stayed out there forever, staring at the trees and feeling the breeze and talking about all sorts of stuff that was totally profound and prophetic. Everything had meaning and depth. The truth was all around us. M sat by herself feeling the grass, listening to nature and watching the trees breathe for a long, long time. T walked up to a tree that M and I had deemed powerfully beautiful and instantly started crying, overwhelmed by the beauty. (Over the course of the night, T cried 7 or 8 times, all happy tears. We all cried at some point). All three of us laid on a picnic table, staring up at a tree, talking about how perfect it was, how it was protecting us, how we were part of the tree. Nature was real and true, therefore WE were real and true. There was a black cat that walked around and watched us the entire time. He never left our sight. We were in his territory and he was watching over us. He allowed us to be there, he showed us the beauty of the earth.\r\nWe laid in the grass and smoked a few cigarettes (which felt amazing) and talked for what seemed like hours and hours. It was perfect. Eventually, we decided that we should go in and put on some music and see what that was like. So, we head inside, although it took us forever because we would take 3 steps, see something, be astounded and talk about it, then take 3 more steps and repeat the process. Thinking it had been forever since we left the apartment, we opened the door to our apartment to discover that Fantasia wasn't even half way over and that BLEW OUR MINDS!!! We fell on the couch, mouths agape, unbelieving. The clock said it was almost 10 o'clock.\r\nSomehow, we ended up back outside lying in the middle of the walkway in front of our door looking at the stars, or mainly one star with which we all had an intense connection. There was a definite, but seperate connection between each of us and the star. We talked about it later and all agreed that there was a sort of hallway between us and the star, a direct connection, providing all sorts of understanding and internal comprehension that we'd never had before. For me, there was an eye surrounding the star with reverberating rings extending outward and all the stars surrounding it were being drawn toward it. I could see them moving, as if magnetically drawn toward it, but I never took my eyes away from my star. It was a part of me, it was in me. Then, the clouds blew over and we couldn't help but wonder: were they moving or were we? There were patterns in everything. The sky, the grass, the clouds, everything. Then, while we were laying there talking, there was a knock on a door. T and I were so transfixed with our star that it startled us and we thought the knocking was on our door and that we were inside. It took us a while to wrap our minds around the fact that we were, in all actually, outside. After that public display, we figured we'd better go inside.\r\nThe clock said 10:15, and again we couldn't understand it. Immediately we turned off the tv and turned on Pink Floyd's 'Dark Side of the Moon' (which was a DAMN good choice). Then, we opened a glowstick (that I had been looking forward to for some time. I get completely obsessed with glowsticks when rolling, so I figured they'd be pretty incredible when tripping, and I was right). When I broke it, the light that it gave off was absolutely unbelieve. So bright and pure. How could that much light come from something I can hold in my own hand? Amazing. We walked around the apartment, tripping, talking, expanding our minds, etc for a long time. Eventually the glowstick ended up on a string and I was spinning it. As amazing as it is when I'm rolling, it's equally amazing, if not more so, when I'm tripping. The flow of it seemed perfect. \r\nSo, I start dancing to Pink Floyd with the glowstick and I become so engulfed in the song, in the dance, in the light, that I am no longer dancing because it feels good, I'm dancing because I have to. Because it's what I'm meant to do. Because it's right and perfect. I dance the entire song without realizing I've danced. I was the light, I was the song, the song was me. As the song ended I tried to bring the glowstick into my hand, but as it reachs my hand and I go to grab it, the string breaks, it falls to the floor, the music changes and I stand there awestruck. Only then do I realize that M and T have been watching me, both crying at the beauty. Both blown away. It was incredible. Then, I laid with T, turning the glowstick over and over in my hand and we cried, letting Pink Floyd take over our senses. \r\nThe trip continued for what seemed like hours and hours, but we were so 'in it' that we paid no attention to the time until we were coming down. Other things that were really fun/interesting were going to the bathroom, sitting on the toilet and just staring at the bathroom towel hanging on the rack and watching the fibers move and colors swirl. T had a very trippy experience in the bathroom involving the flowers on the shower curtain moving across the wall and the heat from her hand transferring onto the wall and leaving colorful streaks. Also, we stood at the far end of an empty hallway, turned the light on and let our eyes adjust as much as possible and then turned the light off and it looked as if the hallway went on indefinitely. We could see the lines and planes of the walls continue on and on forever.\r\nAfter Pink Floyd, we listened to the first Deep Forest cd and it was unbelievable. It's a cd made by men who take the songs and chants of forest dwelling societies and such along with forest sounds and remixes it with a beat, it was perfect. I highly recommend it. It was really fun to lay on our backs and spin the glowstick in a circle above us. T and I kept saying over and over that it felt like we were literally under a giant mushroom that was protecting us and keeping us safe. It was comforting. It felt like home. When we felt ourselves coming down we listened to Adiemus Greatest Hits, which was a REALLY good for coming down. Very soothing. At this point, we got extremely giggly, which was fun. T and M ate some chips, which the devoured and described as 'delicious, but salty and really dry.'\r\nThe entire experience was amazing. Definitely worth doing and will definitely do again. The only drawbacks that I could see were that it took us all a long time to get to sleep, simply because our minds wouldn't stop, and M couldn't get her legs to keep still, the next day we all had a headache, but not so severe as to compare to a bad hangover, and not enough to make us regret anything, and, throughout the trip, if we would lay on our stomachs or stand up too fast or something, we would get instantly nauseous, like we were going to be sick, but we'd take a deep breath and change positions and be fine again. Also, we all had a few bug bites from rolling around in the grass, but that was expected.\r\nNone of us had any substantial ego loss, although we did have the understanding that we were nothing compared to the universe and agreed that if we were alone it could have been bad. Once T said that she felt as if she didn't exist and that if M and I had not been there, holding her hand, making her physically feel us, she could have tripped in a bad way, and I agree. It was especially helpful and very necessary for us to have other people around. To know that you are not alone and to feel secure in the knowledge that people we were comfortable with were with us. We had no ill feelings the next day, emotionally or physically, besides the minor headaches. I am very happy with my first trip, as are T and M, and I will be doing it again. Next time, I will probably take a little more, say 1.5 to 1.7 grams or so, but 1.3 was definitely a good starting point.\n\n\n"
}