{
 "title": "Two Paths",
 "author": "Arabiangoggler",
 "citation": "   Arabiangoggler. \"Two Paths: experience with Mushrooms - P. Cubensis (ID 53667)\". Erowid.org. Nov 9, 2008. erowid.org/exp/53667",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53667",
   "Male",
   " ",
   "Not Given",
   "Nov 9, 2008",
   "Views: 2922",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Note: I prepared for this mushroom trip by taking a nap earlier in the day and by limiting my food consumption to a few saltines, some toast and a glass of orange juice. </p><p>2:30 - Consume over 2 grams of p. cubensis mushrooms. The taste and smell is fairly appalling but a couple drinks of orange juice smooth the process. The orange juice also acts as a trip potentiator. </p><p>3:15 - Starting to feel first signs of mushroom high. My group and I get up and decide to walk over to the free art museum in the park. Colors are distinctly brighter than normal. We walk through a clearing surrounded by a flowering tree in full bloom. The feeling of peace and beauty is indescribable. On our way there we leave Z sitting in a field. He has consumed the largest quantity of mushrooms and is feeling both nauseous and extremely high.  </p><p>3:30 - Inside the museum the photographs are radiating energy. Though normal photographs, they all seem to have been taken on an alien planet. In a picture of tall grass bordering a river, the water seems to be flowing. Deciding the museum is too intense and feeling a bit queasy, we head outside. </p><p>3:45 - Sitting down on a park bench outside the museum. I close my eyes and see an enthralling and fascinating world of morphing shapes and colors. Circles, ovals, and patterns are constantly appearing and changing shape. Though the show on the inside of my eyelids is enticing, my stomach feels mildly upset and the nausea is hindering my enjoyment of the trip. I try to tell myself that everything is OK, but the feeling persists. The upset stomach while coming up was the only real road bump during the entire trip. </p><p>At this point my memory of time is a bit skewed. Lying on the ground staring at the sky I began to see a number of patterns. At one point it seems as if the clouds are in multiple layers and the top one is shaking back and forth. Later, I see an alphabet soup of letters swirling around, spelling nothing. I also remember seeing the shapes of horse riders and people beginning to coalesce in the sky, but they never fully take shape.</p><p>During this time while laying on the ground a large group of kids from my school shows up. I presume it is probably E's doing. She has been on her cell phone (I left mine in the car) and probably invited them to the park. They act in a manner that seems boorish to me. One blurts out, 'Dog let's just get drunk!' However, I am completely unfazed by this sophomoric attitude and accept it. Though, I do realize it as a completely worthless way to approach one's life. Also during this time another friend of E's shows up on his bike. Standing there, his tire, inflated to 90 psi, bursts. The boom is deafening and quite a shock to all of us high on mushrooms. </p><p>The body high at this point has become euphoric, unlike anything I've ever experienced on marijuana. Wondering where my friend A is, and discontent with the current group of people, I set off to find him and take my trip down a more serious path. He has been wandering around the park, and somehow I locate him. Our ensuing trip around the park was the clear highlight of the trip and the part I enjoyed and learned most from. </p><p>He is the leader and he begins telling me about the people he has seen while walking earlier. The park we have chosen for our trip is full of bizarre, generally shady, and interesting characters. The people he points out, coupled with his way of describing them, is completely hilarious to me. A white guy rapping, walking around in a bush, listening to his headphones. A weird looking guy in a car just staring at us, presumably doing nothing else. A Mexican guy wearing a bright green shirt. As we walk around, he describes each person in a manner that I find incredibly hilarious. I feel like he is both leading me around the park and leading me into the world of mushrooms. It was partially his earlier glowing experiences that persuaded me to try the drug. He explains to me that mushrooms can be enjoyed on a goofy level, but they can also be something more serious. This is a theme that we expand upon as our journey continues. </p><p>Now, we have reached a different part of the park and I decide to act as leader. He follows me around the tennis courts and we watch the players hit a little green ball back and forth. By now I have stopped giggling and laughing and have come to realize the mushroom trip as something more than recreational. We see a bee dying, it is struggling and its death is a painful one. In the following few minutes everything comes together. </p><p>A explains to me the previous time he was on mushrooms, he was in his friend's basement standing between Person B and Person C. Person B is a cool guy, but his life is basically centered around going to parties, getting drunk, and selling drugs. Person C used to be like that, but he is now focused on playing music, skiing, sports, i.e. the other pleasures in life. A realized that he was in the middle, and had a choice of which path to pursue. Person C's life path was the clear choice. </p><p>As we continue to walk I understand that our journey has been both a literal and metaphorical one. A has shown me around the park and made me laugh. But he has also shown me what a good mushroom trip is about, and more importantly what a good life is about. The entire trip has been an illustration of the perks of each path. I saw the group of kids from our school, getting drunk and smoking weed. While they were probably having fun, ultimately their lives and choices are less satisfying. A has shown me a more grown-up, serious way of living, and at the time it is the one that I chose. </p><p>Later, we stumble upon the same clearing we were in earlier. Bees are buzzing around, pollinating the flowers. Gorgeous petals cover the ground. The visceral beauty of the entire sight is even more breathtaking than earlier (coincidentally I'm higher on mushrooms), and the overall beauty of the life process taking place before our eyes is equally amazing. </p><p>We go to the conservatory, which I had earlier understood to be closed. It is actually open and being inside is thrilling. The cacti are all strange to look, but interesting and cool. We go back to Z and E, intending to tell them to come to the conservatory with us. Reluctantly Z gets up, and E, excited to see the conservatory also comes along. The conservatory is full of thrilling tactile and sensory experiences, but nothing of such a serious nature as A and I had experienced earlier. We all find plants to name after each other and thoroughly enjoy looking at and touching each individual plant. </p><p>We spend a few more hours in the park, coming down pleasantly as the light of the day fades. A departs. I, along with Z and E, decide to smoke marijuana and get dinner in Chinatown. I found the cannabis high to lessen the feeling of peace and well-being the mushrooms left me with. Nevertheless, at certain points that night while high on cannabis I experienced the most comfortable and pleasant euphoria and body-high I have ever felt. </p><p>All in all, I learned that mushrooms, and life in general, can be enjoyed on two levels. There is the amusement park level. One may see pleasant and interesting visual hallucinations, laugh with his/her friends, and generally feel good. There is also the deeper, spiritual level. I can engage in philosophical conversations, meditate on my life, and have life-altering experiences. Though neither level is exclusive from the other (I experienced both during my trip) it is important to recognize the different ways in which this wonderful ethnogen may be used.</p>"
}
