{
 "title": "Absolutely No Control",
 "author": "Betty",
 "citation": "   Betty. \"Absolutely No Control: experience with Codeine & Dimenhydrinate (ID 5367)\". Erowid.org. Jan 14, 2002. erowid.org/exp/5367",
 "substance": "Codeine & Dimenhydrinate",
 "bodyweight": "53 kg",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "oral",
   "Codeine",
   "(pill / tablet)",
   " ",
   "4 tablets",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5367",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2002",
   "Views: 34729",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMindset and setting:\r\nI was desperate to get 'high' before going out to see some bands as I like taking something to make the night a bit more fun.  I was out of dope and I had about 20 minutes before I was getting picked up so I was rummaging through our cupboards when I found a couple of leftover codeine tablets and motion sickness pills.  \r\nPreparations:\r\nNo preparations.  I just took the pills with water all at once and was on my way.\r\nDosage and Timing information and what I learned:\r\nI took 4 pills of codeine phosphate with 30mg in each.  Then I took 4 motion sickness pills straight afterwards along with 2 glycogen tablets.  The time was about 6.40pm.\r\nI felt good after I took the pills but this was probably psycological as I doubt the pills could have taken any effect yet.  I was picked up 20 minutes later and I began to feel really hyper.  I was running around and I felt really good. Really confident.  \r\nWe arrived and I started to feel a little more subdued.  We went in and stood around watching the bands.  After about an hour I started to feel really wierd.  I wasn't aware of anything around me really and I can't remember much but everything started to go black and voices and my vision seemed really distant.  I remember telling my friends I felt strange and had to go outside but I don't remember seeing them.  I then passed out.  I got up (my friend told me) and stumbled about halfway out when I passed out again.  I don't really remember the events in order but my friend told me I then got up, passed out again, got up and passed out again before being taken outside to sit.  When I kept passing out I was really in my own world, I didn't remember where I was and when I came to I was shocked because I forgot where I was.  At one point my friend thought I was dead because I passed out for ages. \r\nI got outside and sat down and I started saying heaps of wierd stuff which I can't even remember like I was babbling and had no control of my actions or words.   \r\nMy vision was really messed up and everything looked like crappy computer graphics.  People were composed of simple colours like white and orange which weren't blended and were made up of the tiny dots that computer images are made up of.  I could speak properly and had normal conversations after a while but my vision was still not proper.  This eventually passed but it was really freaky.  \r\nThis was really scary as I had ABSOLUTELY NO CONTROL of my actions or my vision.  I had no idea how powerful legal drugs were.  It was so freaky and I don't know whether I'll do it again.  When I took them I was just looking for a good time and I remember thinking that next time I should be more careful when taking drugs of anykind.  I often just take drugs without thinking but even a small dosage of these drugs had a really bad effect.\r\nAfter my vision returned and everything I still felt shaky and a little weak but I was fine after that.  \r\nPrescriptions I've been taking:\r\nAt the time I was also on antidepressants and also sleeping pills occasionally.  This may have effected me as my doctor told me that any other drugs worked badly with antidepressants.\n\n\n"
}
