{
 "title": "Makes Me Euphoric and Uppity",
 "author": "~tar one~",
 "citation": "   ~tar one~. \"Makes Me Euphoric and Uppity: experience with Clonazepam, Morphine & Dilaudid (ID 53711)\". Erowid.org. Mar 6, 2009. erowid.org/exp/53711",
 "substance": "Clonazepam, Morphine & Dilaudid",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Clonazepam",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Morphine",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Hydromorphone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53711",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 6, 2009",
   "Views: 19005",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been taking 2-3 milligrams daily of clonezepam for over a year to treat minor to major anxiety, after a long time taking high doses of xanax, and valium, which is crap compared to klonipin.</p><p>I have found that the more I take of this long acting benzodiazepine the less it works and can cause sometimes worse symptoms than before I ingested the fucking drug. I am also a chronic pain patient, I take 30 mg of ms.contin (morphine) 2x daily, with hydromorphone (dilaudid) 4 mg. 4x (daily). The combination of the three makes me very hyper, TALKITIVE.  I'm bi-polar and It has a quite the paradoxical effect. Sometimes I crash hard !! Sometimes I stay up for 48 hours or so and then crash, but if I titrate my doses properly and take as needed rather than as prescribed I have a great experience, my gaba receptors are firing off the chart!! very cool. I love the feeling (experience) and have had great pain relief with the conjunction of the benzo and opiates.</p><p>But it easy to go overboard with the hydromorphone, and I dont suggest to anyone that is not experienced in any opiates, (oxycontin or high doses of morphine to fuck around with high doses of any of the three in conjunction, or any one of three in high doses, they are all three fatal.) What works for me wont obviously work for every body else, including very thin peeps with a hyper metabolism, as it may uptake very fast thus causing a overdose. be careful. (above all else be gentle to yourself)</p><p>As for sleep.... high doses of clonezepam will usually give me very lucid dreams, </p><p>sometimes so, that I can control almost every aspect of my dreamscape, which is sometimes eery. Including dreams are usually in color. Growing up as a child I do not remember dreaming in color, though in my adulthood under the influence of klonipin I remember my dreams and actually can recall almost all of them upon waking. sometimes not cool. sometimes very cool.</p><p>Im not a drinker, I was a lush for years, and quit when I turned 21, basically I was drinking because I had alot of anxiety and tension from having a fucked up life. </p><p>(but who doesnt have a fucked up life right?) So after a few talks with my doctor we decided that with my bi-polar disorder, and actually having the opposite reaction to most downers and uppers, instead of knocking me the fuck out, the klonipin make me euphoric and uppity, and the opposite for amphetamines.</p><p>This med doesnt have the side effects of most benzos, (valium, xanax,) manic episodes, sleeplessness, eratic behavior. Not to mention its a long acting versus a short acting medication with a pretty long half life, the detox is horrible, do not try to cold turket this shit, its potentially fatal.</p>"
}
