{
 "title": "The Sentient Emoticon",
 "author": "Neurochemist944",
 "citation": "   Neurochemist944. \"The Sentient Emoticon: experience with Cacti - T. pachanoi, Mushrooms & Cannabis (ID 53739)\". Erowid.org. May 9, 2007. erowid.org/exp/53739",
 "substance": "Cacti - T. pachanoi, Mushrooms & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 in",
   "oral",
   "Cacti - T. pachanoi",
   "(extract)",
   "  T+ 2:00",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 5:00",
   "0.3 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53739",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 9, 2007",
   "Views: 6320",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI started off preparing all the cactus (sans core) following 'San Pedro Preparation 5' by M.J. Shroomer.  The original intent was to use it at a rave out in the high desert, but as the sheriffs weren't cooperative, the gathering was relocated to a more urban southern California neighborhood.<br>1:00 a.m. - We arrived back at the rave organizer's house, and the DJs set up their equipment and started spinning all kinds of trance.  I drank five ounces of the resulting putrid swill out of a water bottle, amounting to roughly six inches of the cactus.  I managed to keep it down, and got rid of the loathsome bitter aftertaste with some mouthwash I found in the bathroom.<br>3:00 a.m. - At this point, I find it hard to walk, much less stand still.  My stature was likely reminiscent of Johnny Depp's portrayal of Hunter S. Thompson on an ether binge.  My torso seemed to be moving independently of my hips and legs, in a manner which caused me to feel as if these two parts of my body were moving back and forth on a crank, never really aligning in a physiologically appropriate manner.  I then sit down, figuring it was about time to ingest some mushrooms so that the pharmacological peak of each drug might temporally overlap.<br>4:00 a.m. - I join my friend J in the garage, which had been converted to a room decorated in the occupant's own psychadelic artwork.  Under normal circumstances this environment would have been ideal to sit out the trip.  Unfortunately, J was accompanied by the rave organizer's girlfriend, an emaciated e-tard running off at the mouth and slightly immature for her age (27).  I'm no psychiatrist, but even one not versed in our native English would tell you this girl has some big issues.  This killed my trip for awhile, although upon looking at the aforementioned psycadelic artwork, though my initial reaction was 'this does nothing for me,' soon all the paintings' frames were crawling amongst each other, and looking at the mural covering one wall I became suddenly lost in a world of swirling 3D staircases, like some work of M.C. Escher come alive.<br>I went outside to avoid the crazy lady.  Most people were drinking bad domestic beer, and in no state to comprehend what I was experiencing.  At this point, and ever after, I regretted not simply giving up on this crowd and camping alone with J in the desert.  I had some inane conversation about snowboarding with a surfer whose hair was probably too long for certain types of employment and whose eyes were much too close together.  I talked to a DJ who has recently had much success with the PF tek solution to mushroom cultivation, all the while seeing OEVs as a sort of filter over everything I experience, and thus was not too distracting.<br>4:30 a.m. - Due to a noise complaint, the police arrive and the music stops.  Once the crowd leaves, we go to the beach, on a large bay, stagnant still water stretching to the nonexistant foggy horizon, creating a sort of 'bog' effect.  After playing somewhat self-consciously on a playground, J called me out to the water to wade.  As soon as the moist sand touched my feet, confabulations of astronomically large bacterial populations thriving on the surface of the water, as well as a vivid scene of an HIV-infected hypodermic needle piercing my bare foot, overwhelmed my mind, and I declined J's invitation to the water.<br>At this time, the sun was coming up, and I was starting to think about facing my boss Monday morning, and I figured it would be best to attempt to sleep.  We made our way back to the house, and by the time the sun was up, J and I shared a bowl of weed from her pipe, and I retired to the crazy hostess' bedroom, purportedly the darkest place available in the house at that time.  I had to get a bite to eat before attempting to sleep, so I had a couple of pieces of bread I had brought along.  I indulged an overwhelming desire to spice the bread with a bottle of hot sauce I found in the cupboard.  The pain was a little refreshing.  I took to the bathroom, got into the cracked-out peach-walled and yellow-ceilinged bedroom, put in my earplugs, and got under my down sleeping bag.<br>And thus began the main attraction.<br>OEVs started out like what I've seen on high doses of cannabis alone, encompassing rotating circular geometric colored patterns, which all may change at any instant to one object or another, such as ears of corn. Mayan/Aztec images are common elements in my visuals.  I was staring at a hook on the ceiling, which was at first a concrete object overlayed with the aforementioned patterns.  As I kept staring at it however, it shifted about three inches to the left suddenly, after which my eyes deviated smoothly around the hook, creating trails of the hook as well as whatever pattern I was previously perceiving.  At that point, I closed my eyes, and was greeted with visuals more complex than ever.  Looking down a multicolored trigonometric rotating tunnel, red and orange 3D arrows pointed up the tunnel at me.  Various lifelike objects flew past me at a rate too fast for comfort.<br>I opened my eyes and tried to calm down.  I looked at the ceiling, which at its center consisted of nothing more than a four-inch hole in the middle of which three wires dangled six to eight inches downwards.  A two-inch halo of thicker, more opaque paint surrounded the dark hole.  As I stared, the wires began to wave, float, and expand/contract radially, taking on a hairy, mossy character.  The whole thing started to resemble a jellyfish, which made me think of 'Prince Jellyfish,' Hunter S. Thompson's first and unpublished novel, turning the periphery into a sixteenth-century princely hairdo and floppy cap.  I tried to think of something else.<br>I looked over at the wall across the room, and saw purses and hats hanging by a triangular hinge on a nail in the wall.  However, this triangle seemed to waver independently of the rest of the room, and a colon-and-parenthesis smiley face came to life inside the triangle, comprising a sentient being.  The being spoke to me in a high-pitched alien language, similar to the pitch of some animated rodent in a children's fairytale movie.  Unable to comprehend this, I made note of it and moved on.<br>Looking at the ceiling, having regrets of the amount of each drug I took, I saw multicolored, textured hemispheres in rows and columns coming out of the ceiling, each of which seemed to represent a different part of conversation.  Note that these pieces of conversation were seemingly exogenous to myself, and had me breifly questioning the possibility or impossibility of ESP.  And it got weirder.  As I was questioning this pseudo-ESP experience, my boss and members of my family were chiming in, responding to what I was thinking and conferring amongst themselves on the topic of whether or not I'd be able to convince myself of the 'reality' of ESP.  To top it all off, visuals would change in response to another voice beginning to speak.  This was a little much for me.<br>I was extremely happy when the crazy girl went out surfing and J came into the room to trip with me. After having done a second dose of MDMA herself, she'd be 'hippy flipping' concominantly with all the drugs I was taking.  Everything mellowed out from there, and I became sober enough to have a nice time at an exotic car dealership, the beach, and watching 'Fear and Loathing' at J's place.  We got to sleep at 5pm, presumably due to the stimulant nature of the cactus.  I'd recommend this trip only to the most experienced of psychonauts who think they're ready for an experience simultaneously encompassing visual AND auditory modalities, and only in a comfortale shroom-safe environment, such as anywhere that one won't encounter non-trippers.  Happy trails!\n\n\n"
}
