{
 "title": "Cannot Outrun the Desire",
 "author": "Natalie",
 "citation": "   Natalie. \"Cannot Outrun the Desire: experience with Cocaine (ID 53746)\". Erowid.org. Oct 19, 2009. erowid.org/exp/53746",
 "substance": "Cocaine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "0.8 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53746",
   "Female",
   " ",
   "Not Given",
   "Oct 19, 2009",
   "12007",
   " "
  ]
 ],
 "report": "<p>My hands are shaking... I sit here with the coke finally in my hands after struggling through the whole night without it.</p><p>I'm 20 years old and I'm addicted to cocaine. Because of this I lost many close friends, most of my sanity and I'm in so much debt it's ridiculous. I can't help but think it's worth it. I've cut up my first few lines and cleared out my nose so now I'm ready. </p><p>3:20pm: Snorts 4 relatively thick lines. I just took them... I breathe a giant sigh of relief. It burns a little in my nose but it wears off eventually. I feel clearer minded instantly. I need more... right now.</p><p>I was never a bad kid, more like the black sheep. The dark brooding artist with intelligence beyond her years. Not much for common sense though. I mean, what girl in her right mind would try an addictive drug when she has an addictive personality? And I'm bipolar and on Prozac. Not a good combination in the real world. </p><p>3:25pm: I feel a rush of euphoria wash over my mind and body. I taste it in the back of my throat and smell it deep in my nasal cavity. The drip has begun.</p><p>I always talked about coke even before I tried it. I always wanted to try it. Hell, the first time I did it I was alone in my bedroom. No clue on dosage, I chopped it up and cut two very small lines. Now they're huge. My room is a sanctuary for me. I've become a loner where I once was a social butterfly. Sure, it makes me more talkative, but I feel as if I can only be myself and on it around friends who know or at least understand. I don't like running to the bathroom to chop and sniff a line real quick. I don't like having it on my mind constantly day in and day out. And it's only just begun. I started 2 months ago and have been a regular pro at it for the last month. </p><p>3:31pm: I feel a little light headed. My stomachache I had from eating is gone and my teeth are starting to tingle. Time for a cigarette. </p><p>3:37pm: Snorted 2 more lines. Out of the other nostril this time. The drip from the first few lines just increases the buzz I get from this. My teeth start feeling numb. I know they're going to hurt like a bitch when I'm coming down. I just forgot I put my cigarette down. I was ready to light another. </p><p>3:40pm: I keep sniffling. my nose has been either runny or congested for 2 weeks now. Not fun when trying to sleep. Just got a phone call and now I have to leave... may as well snort the last 3 lines. </p><p>3:42pm: Finishes cigarette and snorts remaining 3 lines. More euphoria... sigh. I know I'm going to want more later. I know the comedown is coming. The awful headache, tooth pain, and moodiness is what I fear the most. I can barely afford anything yet I know I'm going to buy and do more later. I'm already done with what I just bought. It's a horrible feeling to need something so bad... to think about it when I sleep and when I wake... to rely on it just to function. Without it I would never be able to wake in the morning. I absolutely love cocaine and do not have any plans on stopping no matter what. It's a sad outlook but I gave in to the white seduction and only time will tell from here.</p>"
}
