{
 "title": "Becoming a Sentence",
 "author": "Efar",
 "citation": "   Efar. \"Becoming a Sentence: experience with Salvia divinorum (ID 53796)\". Erowid.org. Dec 6, 2008. erowid.org/exp/53796",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "  T+ 0:30",
   "1 hit",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 53796",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 6, 2008",
   "Views: 2892",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my first experience with salvia. I didn't really know what to expect because I had never heard much about it, just that it was a short, intense trip.  I found it to be much more than that.  I was in Vienna, Austria in a hotel with some friends.  One bud bought some at a head shop and asked if I wanted in.  Not knowing what to expect, I went for it.  I had two trips that night, the second one the most intense.  </p><p>About 30 seconds after my first big hit, I totally forgot where I was, who I was, how I got there, and even that I had just taken a hit of salvia.  It was the most 'present' experience Ive ever felt.  I felt myself vibrating and saw the walls continue endlessly in all directions.  I was part of these patterns.  It was my first time so I couldn't make a whole lot of sense out of it, so that was about all I can verbalize.  </p><p>Thirty minutes later, after we were reminiscing, my friend smiled and says 'You wanna take another hit?'.  Not realizing the gravity of the drug, I went for it.  One more hit, 30 seconds later.  Patterns again began to form, but I was not on earth.   I was in a vast world of whiteness where the only visual matter were 3d sentences.  The sentences were all being said by a higher being, and all the people that were in the room with me including myself (and my mother for some odd reason) became patterns that formed the sentences visually.  The sentences kept floating off into space kind of like the opening of star wars  and all I could hear was a terrifying laugh, never stopping.  It was as if the higher being was laughing at earth in all its complexity ironically contrasting the simplicity of the world salvia took me to.  Just as I realized that I was part of the sentences and felt myself being pulled away into the nothingness, fearing death, I slowly came back to earth.  </p><p>For the next hour I felt distant from the complexities of earth and its people.  My vision made it all seem meaningless, I felt as if Id been shown an extremely disappointing afterlife.  I wrote three pages of poems and lyrics in my journal during the aftermath of my trip.</p><p>I have yet to determine what lesson about life or anything can be formed from my salvia experience, but these are all thoughts that will not leave my mind for many years, if ever.</p>"
}
