{
 "title": "The Adventures of Me-Mush, T-Mush and Blood",
 "author": "Itsabox",
 "citation": "   Itsabox. \"The Adventures of Me-Mush, T-Mush and Blood: experience with Mushrooms - P. Cubensis (ID 53827)\". Erowid.org. Nov 17, 2008. erowid.org/exp/53827",
 "substance": "Mushrooms - P. Cubensis",
 "bodyweight": "134 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53827",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2008",
   "3782",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As is usual with my mushroom trips this one was well planned out. I tend to consider psilocybin in its natural form somewhat of a saving grace for humanity if integrated properly, so I take care to find the perfect set and setting.</p><p>My family had decided to take a trip up to Lapush, a beautiful beach in the Olympic rainforest, and I had invited my friends T and P. Our second night there my parents told us about a great camping spot on second beach and we set out at about 6:00 with a tent, some munchies, sleeping bags, warm clothes, a few black and milds, and a half an ounce of dried Amazonian Cubensis. Upon arrival we marveled at the perfection of the camping spot: it was hidden about 5 feet back from the driftwood in a flat empty spot in the underbrush, another good five feet above the beach, providing a perfect view of the ocean.</p><p>We divided up the mushrooms three ways, giving the small pile to P due to his somewhat low tolerance. We wandered out to play on the driftwood and wait for the experience.</p><p>Both T and I experienced the same signal for the beginning of the trip, first my, then T's vision did a sudden and dramatic red shift. There was nothing threatening or amazing about it, but it was a playfully wonderful hint at the revelations soon to come. As the effects started to build we decided to go up into the forest to start. Walking up the wooden steps took an exceptionally long time as P had begun to feel them and was drooping all over me and hindering my steps, but eventually we got into deep woods. By this time visibility was almost null, and as such my visuals were taking form as intense overlay, but no actual distortion. Me and T tried to organize our thoughts like we had the night before on mescaline, but quickly realized that though our thoughts felt profound they were very singular and un-string-able.</p><p>We continued our distracted trek into the woods with the intent to take a peek at the civilization that existed on the other side of the woods. About 2/3 of the way there P sat down and refused to go any further, insisting that he had a bad feeling about. This frustrated T and I to no end, as neither of us had any mediation skills at that point. For a while we joyfully argued with P about where we wanted to go, when finally we realized that no matter what wed be happy and we might as well humor P. On the way back T began complaining about everything and I started to get annoyed, until I realized that he was thoroughly enjoying himself.</p><p>Meanwhile P began to say that he was experiencing a bad trip but this was quickly remedied by a hearty round of singing start wearing purple by Gogol Bordello. We found our way back to the beach and began running around shirtless yelling obscenities and toilet humor. BUTTMINES!!!! We got back to the tent and P sat down with his guitar and began yelling Im a fuckin rockstar!</p><p>Me and T got into the tent as well and we all started rambling about mush being life and life being mush. Suddenly P piped up with I need to go take a piss </p><p>Theres the tent door</p><p>But Im tired!</p><p>Okay</p><p>Help me out here!</p><p>P continued complaining in this self defeating way for a while. I got caught up in trying to mediate with him while T was blissfully ignoring him realizing its unsolvable nature. At one point I turned to T and told him you dont care better. This was the start of an amazing amount of playful verbal revelations.</p><p>T and I ventured outside and began to play with language and catalogue our thoughts. First and foremost there is blood. Blood is the inequality that is. It is signified by red, a color often misinterpreted to mean threatening, when in reality it is merely unexpected. There was also the inside out nature of things, like the term bark. Tree bark is related to hand bark (calluses), and a dogs bark is a call for attention, such as a request from a person. Backwards and similar. A very useful concept stemming from this is silent barking. The idea is that in many cases your bark is more effective if it is not expressed at all, or the situation at which you would bark you actively ignore (and I do mean actively). It is quite easy to see if an objects course or a persons mental state will resolve itself and trying only distracts it from its course. A defensive offensive bark. Im not sure what offensive defensive barking would be</p><p>Not very profound but astoundingly fun was another perfect example of inside out. I was gesticulating with a black and mild and I noticed that when held up to the sky it was monotone, however when down against the ground you could see the little white filter. Up: theres only contrast down: when theres no contrast! and Down: theres only contrast up: when theres no contrast!</p><p>We wuffed thoughts, we fluffed thoughts, we rediscovered the beauty of Dr. Seuss, and we reveled in the ability to look at all memory at once, to the point where it no longer existed. I rediscovered how fun bodily functions are, and eventually I drifted of to sleep to visuals akin to fungalinguistic by Luke Brown.</p>"
}
