{
 "title": "A Metamorphic High",
 "author": "Society's Downfall",
 "citation": "Citation:   Society's Downfall. \"A Metamorphic High: experience with Blue Lotus & Alcohol - Beer (ID 53899)\". Erowid.org. Mar 17, 2007. erowid.org/exp/53899",
 "substance": "Blue Lotus & Alcohol - Beer",
 "bodyweight": "8.5 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "8 hits",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(flowers)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 53899",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 17, 2007",
   "Views: 8830",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI purchased 200g of Blue lotus from an online vendor. I was quite excited to try this new substance. I had tried many substances that I believed would be similar to it, marijuana, salvia, wild dagga ect but all of these are quite different to lotus in actuality.\r\nI had just finished my exams and I tried to stay clean while taking them (for obvious reasons) so on the day I finished I was determined to get really high and clear out some of the information that would not be necessary ever again.\r\nAt around 7.50 I took out some of the petals that I had grinded earlier that week, it totaled around 20-30g by my guess. This is considerably more than any report I have read before so I believed this would be good. \r\nAfter 40 mins I came back to the percolator which held the 20-30gs of blue lotus and two mugs of water in it. I poured this brown liquid into a big bottle, I tasted the brew, it was sour and tasted reminiscent of what I believe a bark and dirt mixture would be. I added 5gs of sugar to this and it quickly became a pleasant drink, one which I could drink easily within three minutes. \r\nFifteen minutes past and although in the back of my mind there was the feeling that there were some effects starting it was incredibly subtle and I wasn´t sure whether the petals were even real or not.\r\nI sat down on the sofa and watched some television. After another ten minutes I could really feel some effects, I was watching a cartoon and it seemed to be traveling at a strange speed, way too fast, pictures flashing in front of me becoming more vivid and drawing me into the set. This was a hypnotic and pleasant feeling, quite disorientating though.\r\nI ran up to my room and grabbed a beer, I heard that drinking and lotus synergized well so I gave it a go. After the tea I found the beer easily downable, it tasted quite diluted and I finished within a minute. \r\nI returned to the TV set and continued watching sitcoms and cartoons. A hypnotic and sedated feeling spread across my body and this lasted another 15 minutes or so. Then the synergy of the alcohol began to be noticeable, there was a lucidity and an amplification of the hypnotic feeling in my body.\r\nThe strange part of the experience was the fact that my mind was sedated yet strangely aware and capable of mental processes. My body however was still working perfectly, I could stand and walk straight though while walking any lights did seem to leave trails as I moved my head. I felt a bit off balance but not really dizzy.\r\nI went to my room again and since I wanted to keep the feeling going I grabbed my bong, did about 8 hits getting through about four grams of lotus, I had tried smoking lotus on its own before but without drinking some lotus tea it does nothing.\r\nAfter smoking the lotus the experience changed again. Now I did feel quite strong euphoric feelings and great feelings of wellbeing. I was sedated and calm, with slight euphoria. It wasn´t like MDMA euphoria, it was less naive and potent than that, it was the inner peaceful kind, a wise kind of fulfilled euphoria. Not a heavy drug that gets me stoned out of my mind inexplicably, a subtle yet complex, enlightening and fun trip.\r\nIt was a very cerebral high and any buzz in my head was definitely radiating from the top of my head. My eyelids felt heavy and I did begin to feel tired, very tired.\r\nA great and ever changing, metamorphic high that is only held back by the fact that its effects do not last very long, by 11.00 I was baseline again.\r\nP.S.     I almost vomited when I tried to eat the pulp from the percolator after drinking the beer. It was extremely distasteful and had a nasty texture.\n\n\n"
}