{
 "title": "The Effects",
 "author": "Tenzin",
 "citation": " Tenzin. \"The Effects: experience with Piracetam (ID 53927)\". Erowid.org. Jan 23, 2007. erowid.org/exp/53927",
 "substance": "Piracetam",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1.6 g",
   "oral",
   "Piracetam",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "53927",
   "Male",
   "",
   "Not Given",
   "Jan 23, 2007",
   "54386",
   " "
  ]
 ],
 "report": "<p>I finally ordered and got my bottle of 800mg capsules. As it is currently not scheduled in the US, it was relatively easy to order from an online store. This is my report on its effects from first hand experience. </p><p>Note: My prior entheogenic experiences include Alcohol, Tobacco, Cannabis, MDMA, Psilocybin Cubensis Mushrooms, Cocaine, Nitrous Gas, and Salvia Divinorum.</p><p>I was on an empty stomach, so I took two 800 mg capsules with water. I started driving to a local burger joint for lunch, and it was 20 mins later when I was in the store that I notice considerable effects. Being an experienced psychonaut, I could handle myself well, but realizing my sense of perception was getting slightly changed, I hesitated a bit to see if others noticed anything. I went to the bathroom and noticed no outwardly visible effects such as dilation of the eyes, color of skin, or change in breathing. </p><p>Back in the store, the colors and the entire scene stood out to me. In particular, I had a slightly empathic experience where I felt the negative/fear/frustration energies of all the people in the room. The best way to describe it is.. it's like downing 2 cups of coffee, and having the caffeine rush effect without the jitters or nervousness, or somewhat like a slight mushroom effect, where things in your visual field become 'clear'. </p><p>I called a friend to see if I sounded funny, and he didn't seem to notice anything, so I enthusiastically told him about my experience. I seem to be able to think more clearly than average, and the thing that stood out the most was that I was noticing every little detail of my surroundings. I wolfed down my burger, and got on my drive to my 2:00pm meeting an hour away. </p><p>While my visuals were improved, my sense of balance, thinking, etc., motor/muscular capacities were completely normal. While driving, I noticed details such as the texture of the reflective speed bumps on the freeway divider markers. I did experience a slight headache, which I took care of with 2 tylenols. In 3 hours time, I was completely back to normal and in the middle of my meeting as scheduled. </p><p>All in all, a very interesting experience. I will try a higher dosage at the comforts of my home next time, and try some writing or creative endeavors to see how it is affected.</p>"
}
