{
 "title": "Underwater Vision",
 "author": "Jake",
 "citation": "   Jake. \"Underwater Vision: experience with Kava (ID 54001)\". Erowid.org. Jan 10, 2010. erowid.org/exp/54001",
 "substance": "Kava",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "60 capsls",
   "oral",
   "Kava",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54001",
   "Male",
   " ",
   "Not Given",
   "Jan 10, 2010",
   "Views: 6637",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have always enjoyed kava as a dream enhancer and as a relaxing substance. The effects that I get from kava are always very mild though, so I decided to do an experiment. About 4 hours before this experiment I had smoked some pot, but I was no longer high when I swallowed the capsules. At about 9:00 at night I downed 60 kava pills, a total of 4,500 mg of kavalactones. I started watching some TV and after about half an hour I got very tired. I shut off the TV and drift off to sleep.</p><p>At 2:00 in the morning, I am woken up. I am sweating and my vision is completely blurred. I realize that I am going to have to throw up, so I jump out of bed, but am not able to support my own weight. I collapse on the floor, the whole room spinning around me. I fratically crawl to the bathroom and throw up for 2 hours straight. During each break from puking, I curl up in fetal position next to the toilet and watch the whole room spin faster and faster until I have to throw up again. At about 5:30 I feel like I have nothing left in me, so I crawl back to bed (I still am not able to walk). </p><p>I sleep for several hours, and then am woken up again by a terrible stomache ache and head ache. I stumble out of bed. I notice that my vision is still blurred, like underwater vision. I am unable to communicate with my mom, my words are slurred and I constantly forget where I am. It is not until 30 hours after eating the pills that I gain back sobriety. The hangover was worse than alcohol and I remember rolling around on the floor tearing and swearing from the pain.</p><p>As someone with a high drug tolerance, and with minimal effects from kava pills in the past, I was still knocked right in to place by this substance.</p>"
}
