{
 "title": "Total Satisfaction and Happiness",
 "author": "Caleb",
 "citation": " Caleb. \"Total Satisfaction and Happiness: experience with Amphetamines (Adderall) (ID 54007)\". Erowid.org. Dec 6, 2008. erowid.org/exp/54007",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "Amphetamines",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54007",
   "Male",
   "",
   "Not Given",
   "Dec 6, 2008",
   "17854",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 180 mgs of Amphetamines is considered an extremely high dose.] </p><p>Well let me tell you a little bit about myself before I begin describing my experience. I'm 15 years old and am going to be a sophomore in high school after this summer and I have had a history of drug use. Ive smoked quite a bit of weed in my day, that being my first drug experience, Ive taken quite a few different forms of opiates, valium, quite a bit of alcohol, DXM, keyboard duster, xanex, muscle relaxers, nutmeg, and of course Ritalin and Adderall. I am also a smoker and I have an occasional dip.</p><p>I had taken amps on several occasions prior to this one, but this was first experience of a dosage this high. All the other times I had tried it, it just made me loopy. I had taken it at school and found myself not being able to keep myself still, running full speed up and down the hallways between classes and talking loud and excessively. But at the same time I also had a considerably increased ability to concentrate on whatever it was that I was doing, get my school work done of about 5 times faster than usual and not just in a sloppy manner, it was good quality work. I had really enjoyed these highs and so I decided to step up the dosage.</p><p>It was just after our lunch break in school when I had decided to ask my friend and now frequent supplier A, who has a 30mg adderall prescription for his ADHD, for some speed. Being a pretty decent friend of mine, he sold me the shit for about two dollars per pill cheaper than he sold to most customers. I got the pills and carried to a bathroom to bust the time release capsule, then to a nearby water fountain to throw them on down. Then I hurried up and grabbed my book and some paper before heading to class.</p><p>Soon after I took the stuff, like under ten minutes later, I began to feel its tingling effects. Quickly following this feeling, I felt a side to the drug that I had never seen before, I had a COMPLETE sensation of euphoria come over me. It was like I was totally untouchable. Nothing couldve upset me even the least bit. I felt completely satisfied with everything around me. Its hard to put into words how satisfied I felt. I found myself just sitting there in a sort of daze. I literally could not stop with this huge smile all the way across my face. I was in a state of bliss. I was also feeling other effects that were surprisingly more intense with a lower dose. It was the same old inability to hold myself still and I was getting everything the teacher assigned done much faster that normal. The euphoric feeling only lasted about an hour or so, then I just felt the same old speed high, however, the effects were intensified.</p><p>This particular day in class we were reading out of our text book aloud one at a time to the class. The teacher asked for a volunteer and I couldnt help myself, I had to raise my hand. Once I started reading it came so fluently to me. I mean I am a fast reader anyway but this sent me into warp speed. Not only was I reading quickly, I wasnt stuttering like I usually do when I try to read this fast. They were having to tell me to slow down any number of times.</p><p>It felt like that hour of class went by in a matter of about 20 minutes. Before I knew it I was leaving to go to my next class. For the rest of the day the high stuck with me even as I rode the bus home from school. It lasted all the way through the night. I couldnt sleep even a wink. I was ready for school the next day by 5:30 in the morning when I usually dont even get out of bed until 7. When I arrived at school the next morning to my first class, which was just my friends and I sitting around in the field house talking and screwing around, one of my friends noticed my eyes were severely dilated. I went and looked in the mirror and I could hardly see the colored part of my eye. By this time I was beginning to feel seriously fatigued. But I still couldnt have slept if I tried.</p><p>Later on that day I began to crash. It is a bitch. The worst part about this crash is that I was in class the whole time. While I was crashing I felt so depressed that I actually had to try not to cry. This stage lasted for around an hour and thirty minutes. Then I still felt off until I woke up the next morning. This is probably due to the sleep deprivation. </p><p>I personally love speed and am a regular yet responsible user. In closing, speed is also great to combine with other shit such as weed, opiates, and alcohol.</p>"
}
