{
 "title": "Bursts of Alertness",
 "author": "Trauma",
 "citation": "   Trauma. \"Bursts of Alertness: experience with Caffeine (ID 54034)\". Erowid.org. May 4, 2011. erowid.org/exp/54034",
 "substance": "Caffeine",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Caffeine",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54034",
   "Male",
   " ",
   "Not Given",
   "May 4, 2011",
   "Views: 7144",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently I've been looking for ways to boost my overall energy during the daytime. My job requires a lot of being in the hot sun and that for me is very draining. I wanted to try to use my love of psychoactives to benefit my situation. I decided to test my reaction to snorting caffeine on my day off before trying to go to work and do rails off the work bench or whatever.</p><p>I have a bit of a tolerance for caffeine as it is, with me being a Pepsi addict. But dark colored sodas are quite dehydrating and they make my skin break out, therefore I decided to circumvent the sodas and go straight for the caffeine. I had briefly experimented with No-Doz brand caffeine pills about a year prior, and had found anywhere from 200mg to 800mg oral to be effective and fun. I read a few reports of people sniffing rails of caffeine and having a more comfortable experience versus swallowing pills. So I tried a little bump (about 1/8 of a 200mg pill) and noticed it beginning to kick in within a few minutes. I felt awake, creative, and in a generally good mood. So a few hours later, I rough-estimated about 100mg and carded it out with a grocery store savings-club card and sniffed 2 hefty rails and then had a cigarette. I felt great in a few minutes. With my existing tolerance to caffeine, I didn't really notice anything like shaking or a flushed face or anything negative, just a full on burst of alertness, free-flowing thought, and a happy demeanor. The major effects last about 2 to 3 hours and for me 'coming down' isn't a big deal, its a fairly smooth transition to baseline.</p><p>I used to take 2 or 3 caffeine pills orally to get this kind of effect, but that had it's unpleasentness (nausea, light tremor, racing thoughts). I much prefer this straight-to-my-brain approach with lower doses. With my body being used to caffeine I don't really get any negative side effects at this dosage except for a bit of a drip right after. In summary, No-Doz rails are a fun now-and-again way to enjoy the mundane and get down to business when I have a daunting task.</p>"
}
