{
 "title": "The Energizer Bunny Acid",
 "author": "Psycho-Not",
 "citation": "   Psycho-Not. \"The Energizer Bunny Acid: experience with DOB (ID 54067)\". Erowid.org. Jan 26, 2007. erowid.org/exp/54067",
 "substance": "DOB",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "5 hits",
   "oral",
   "DOB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54067",
   "Male",
   " ",
   "Not Given",
   "Jan 26, 2007",
   "Views: 11416",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well... yesterday I aquired some DOB while trying to get ahold of LSD which in portland oregon is difficult to get ahold of(an apparently rare chemical but I am almost 100% positive it was DOB and 'they' said it WAS dob)I took 2 bong hits and got mildly high and I took 4 hits of DOB dripped on altoids.. then the man offered me just one more hit just for the hell of it so I took it too. </p><p>I didnt feel anything for a long time, then all of a sudden Im feeling a distortion of reality and I am in an overly good mood, and cant stop smiling, then the insanity set in... so Im just hanging out with S and D, Im just kinda sitting on the couch in D's garage and they are talking... and I see everything doubled their faces etc... and Im just fascinated by my mini black light I brought just staring at it spinning it,moving it closer and away from my face. Everything around me is starting to look very weird,very organized total chaos all around me,walls twisting and contorting, with an intense feeling of being CHARGED with energy and I feel like Ive completly lost my mind, But I was extremly comfortable on the couch but I felt the distinct urge to DO something(maybe amphetamine propertys showing) </p><p>So we take a walk around the block, I had no idea what was going on or what I was doing at this point,and why I decided to do it in the first place. just walking aquired a new difficulty and I was extremly confused. Then we go back to D's garage and I sink into her couch once again with a POOFY comfortable WARM blanket and watch the simpsons movie, which just further confused the living hell out of me. and I notice a 4 foot tall cardboard cut out of gollum(the little weird guy from lord of the rings) she has in her garage LOOKING at me, I was just thinking god damnit I HATE THIS GUY! and his creepy eyes and body, and I was plotting the demise of a cardboard cutout, and how I was going to kill him. </p><p>I feel a definite connection with the couch, to where at one point they asked me how I was doing and I simply said 'all I know is COUCH' and they both just laughed at me hystericly, I think to myself WHAT THE FUCK WAS I GETTING MYSELF INTO TAKING 5 HITS of this my first time.... Im losing my mind, I feel completly and utterly devastated and just FUCKED up in every way possible... then I feel the urge to do *something* again, so we go out in D's front lawn and I still have my warm poofy blanket, and I just sat back in a kind of reclining lawn chair and looked up at the night sky, it was simply AMAZING, the stars were not in fixed positions, and they were moving weird forming patterns and stuff etc, I felt like my head was just unscrewed and the whole universe in all its vastness was allowed to enter my brain swirling around my mind, then all of a sudden a dense layer of clouds covered the bright night sky... IT WAS BEAUTIFUL!!!! </p><p>Then I find  myself going back to that lovely comforting COUCH that I seemed to become OBSESSED with, it felt good just to lay there. They made ramen and offered me some but all I could do was stare at the noodles and the way they were twisting and contorting I finally took a bite and it was delicious but I was far more fascinated looking at the noodles themselve and they started winding down and decided they were going to bed(about 4am) they figured I would be alright and not do anything stupid.</p><p>So I was just up all night on the couch tripping my balls off with insane recurring thoughts running through my head... like OH SHIT!!! Ive really done it to myself now iI dont think I will ever be normal again, and at about 6 am I still was awake and saw no end in sight... then I notice that bastard gollum was still just looking at me with his fiendish creepy eyes, all I can think of him is GOD DAMNIT I HATE THIS FUCKING GUY ALWAYS LOOKING AT ME,grrrr... I go lay back in their bed and 8 am rolls around which is when I was supposed wake them up and I did, they just went back to sleep.</p><p>I was STILL somehow tripping and wanted it to just be over I wanted nothing more than to finally sleep and stop losing my mind, it really took me for a ride the whole night and didnt let me free till it was damn done with me... I was sweating alot and I felt somewhat DIRTY, like all impuritys in my body were coming out my pores so I took a shower. It was the most amazing shower ever, I felt cleansed of all badness and I just went and layed back in bed.... and my brother suddenly called and informed me I have a warrant for my arrest(and last thing I want to deal with right now is police) for failure to appear in court for an MIP for tobacco, so im just now coming back to reality... kind of, I have still not slept all night soooo Im going to bed now to try to get some sleep before I have to goto juvenile court and SHIT.</p><p>All in all DOB is complete utter insanity thats organized,it lasts a VERY VERY long time(I was tripping about 16 hours) I dont know if I will do it for a good while, this state of utter chaos and insanity has a morbid fascination in my mind, I want MORE but I dont at the same time. This IS the forbidden fruit.</p>"
}
