{
 "title": "At the Raceway",
 "author": "Tevryr",
 "citation": "   Tevryr. \"At the Raceway: experience with LSD & Cannabis (ID 54079)\". Erowid.org. Dec 10, 2008. erowid.org/exp/54079",
 "substance": "LSD & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 2:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 3:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54079",
   "Male",
   " ",
   "Not Given",
   "Dec 10, 2008",
   "Views: 3444",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It began around 11:00PM when CJ, who had taken one hit about an hour ago, began noticing the trees were sort of 'dancing' in the far distance while sitting in his car in a parking lot. We were waiting for a call from Miles, signalling his escape from the house and our cue to head on over. We got tired of waiting and lurched into the beginning of his driveway, which is nearly 1/4 of a mile, very curvy, surrounded by bushes, trees, and rolling hills. That useless information will make more sense later.</p><p>Still waiting in the car, CJ seemed content to just listen to music and watch the sky, where he exclaimed there was a black man smoking a blunt in the clouds. At this point, he got out and began to wander around and dance. At around 1:00 Miles' appeared. He had taken his hit earlier too, they were both an hour or two ahead of me, so the entire time I felt slightly disconnected. He gave me a hit. Ever since marijuana, I had been very curious about psychoactives and the alterations involved. Of course, there are the bad trips too, so I had been preparing and anticipating this day for a long time.</p><p>We decided to walk to the porch behind his house for rolling papers, and on approaching, his fenced up dog began to bark. This was the beginning of the true trip, as I could actually follow VERY closely the reverberations from the echos smash against the trees and resound back against the open sky. While this was happening, Miles' was busy inside his kitchen getting drinks and the papers. CJ and I both watched for what seemed like half an hour while he wandered about the kitchen doing who knows what. It reminded me of a sitcom for some strange reason. Then the first feeling of anxiety set in from thinking we would sit at the window until the next morning, when Miles' parents would come down for breakfast and see us staring. An odd thing to worry about, but nontheless.</p><p>We each drank a bottle of what I think was Gatorade I chugged the entire thing in literally 3 seconds without realizing and felt nauseous for a brief period. Wandering around the walls of his house for awhile, I noticed the tall grass and stood over it, staring as though it were a pool of death. What little of the ground was visible in the tall grass was a black void full of squirming black snakes. The moonlight was unrealistically bright this night. Everyone decided a little grass would make the experience more smooth, so a joint or two were in order. I couldn't remember who's car it actually was, and was happy to be back outside, in more familiar places. At this point, I vowed to only trip in nature, or at least yards.</p><p>It was getting late, so the three of us departed back to CJ's car, but before we even started to move someone pointed out how awesome the moon was. But it was not the moon, it was the clouds and they were moving FAST. The moon served as a stationary backdrop to emphasize just how much the sky had changed. Also the air behind the clouds were a strange shade of purple, which seemed to deepen as the trip went on. </p><p>30 minutes had passed and we weren't even a fourth of the way back yet, as each of us kept wandering off the driveway and staring at random shit. It seemed the Cannabis combination was having a really outrageous effect on time, so we smoked another joint. While this was going on, I could hear water dripping several houses away and understood how Chinese water torture worked, but for now, it was pleasant and entertaining. We stopped again at a honeysuckle tree (the kind you can pull apart the flowers and eat). I tried to taste one, but found myself staring at the tree and ripping the flower to pieces instead.</p><p>Finally at the start again, we noticed the powerlines above us. Up until that point they were silent, but now they were emitting a loud buzzing sound, and were covered in red lines that moved about the lines. We decided to listen to some music before heading out. The next 20 minutes or so were a complete haze, only remembering entering, exiting, and walking around the car. They had said I 'screamed'. The next part was probably the most bizarre but amusing situation I've ever been in, as we walked back and forth between Miles' house and CJ's car 3-4 more times. CJ kept seeing random animals in all the plants we passed, including bunnies, elephants, and zebras. At one point when Miles' was talking to me, half of his face became contorted, his eye much wider and stretched than the other, his nose also became longer, kind of like the stereotypical Jewish imagery. CJ also took on a similar effect, but it was his mouth instead, which hung about 5-6 inches below his chin.</p><p>Watching the road while on Acid on a late night is like being the passenger of an airship as you sail through thick clouds. The mist and fog on the road seemed about a foot higher than normal, yet all the cracks and details of the road were more visible than ever. I turned in for bed shortly after and stared into the sofa's design. The small ropes and threads it was constructed of began to bulge and breathe. This was broken by a loud 'HIHOWAREU' screeching as CJ's cat walked into the room. The pipes within the walls began to flow with water as I closed my eyes, sounds were definately louder than normal. There was no sleeping involved that night, which may have had caused the LSD to last far longer than usual, as sleep probably nullifies most of the effects.</p><p>I walked back into CJ's room around 10:00am, where he was still sleeping. Sitting down at his computer I figured the trip had finally ended. Believe it or not, this was not so. It was still going, though very weak. Every so often I would look a direction really fast and notice those translucent 'acid wallpapers' you see floating around. They finally made sense. The most confusing part of the entire experience was when the sound of racecars driving around began to fill my ears, sometimes soft, but always gaining in volume at increments. This lasted an hour or so. For the next few days the 'acid wallpapers' were visible every few hours or so, but everything else was dead, with one exception. Two days later at school, walking down the hallways, the two blue double-doors at the end grew to an extremely intense yellow and faded out.</p>"
}
