{
 "title": "Fantasia Spoke to Me",
 "author": "Jaspoon",
 "citation": "   Jaspoon. \"Fantasia Spoke to Me: experience with Cannabis (ID 54098)\". Erowid.org. May 20, 2008. erowid.org/exp/54098",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54098",
   "Male",
   " ",
   "Not Given",
   "May 20, 2008",
   "Views: 3456",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm 16 years old, about to enter my last year of high school this August. Its the end of June, and I just passed my second drug test. My mom had previously found my stash, and told me to get rid of it. I did, but not my pipe. I asked my friend (lets call him M) to hold my pipe for me, and he obliged. A couple of weeks later, I get it back along with 2 grams of some KB M's mom hooked me up with. She didn't want to do it, but she was like 'this is just for you no one else.' Thanks, I reply. We smoke for a bit and have a good time, but this isn't the story.</p><p>A couple of weeks later, my mom springs another test on me. I was ready for it, and passed it with ease. She said she was going to spend the night at her soon to be husbands house, and I think 'Party fucking time.' So she leaves, and my sister and her friends are playing Spades upstairs. I Get all my stuff, and proceed into my garage and turn off the lights. I light up, and taste the bud. Tastes fanfuckingtastic.</p><p>I smoke two bowls, occasionally stopping to let the high come on little by little. I blow some final smoke rings, and re enter my house. I'm pretty damn high, can't string sentences together, and laughing it up. I proceed to turn off the lights, and pop in Fantasia. I fast forward through the beginning parts, all the while moving my head in the 'infinity' loop. I begin to laugh and say 'It feels like a maiden is guiding my head.' Laugh some more. I begin to play it at normal speed at the greek mythology peice. I watch and some points begin to shudder, because it was so beautiful.</p><p>As I continue watching, I begin to take it in. Theres a part in the movie where a black pegasus and white pegasus are flying with their children. All of them are different colors except the black one who is flying in the back. I say to myself 'The black and white (pegasus) mean people, and they have children of all colors. One is black, and she is the most beautiful.' I'm thinking, and I have a revalation, sort of. To me, the pegasus represent a black person and white person, who marry and have children. They are all bi racial, but the one black baby pegasus is black, and the most revered. Interacial marriage in the real world can yeild these results, but is looked down upon by some. The movie showed me that interacial marriage is ok. Even though I was ok with it all along.</p><p>As I start to come down, I turn off the movie and go upstairs to go to sleep. Before I close my eyes, I say to myself 'Now time to send my self to the psychological cornucopia that is sleep.' I didn't even know what I was saying at the time, but a cornucopia in mythology was a goats horn that filled with whatever the owner desired. I had vivid, swirling dreams of color and sound. But, I had one bad dream. I don't recall all of the events, but apparently my teachers had given birth to the antichrist. I killed the baby, and woke up.</p><p>In the end, I wrote the dreams off as my mind working out things that had been worrying me. This was the first time I had a mystical experience with bud. I guess the more potent it is, the different effects it has on your body.</p>"
}
