{
 "title": "Not bad... Not good... but Not Bad...",
 "author": "Dr DNA",
 "citation": "   Dr DNA. \"Not bad... Not good... but Not Bad...: experience with Nutmeg (ID 541)\". Erowid.org. Sep 10, 2000. erowid.org/exp/541",
 "substance": "Nutmeg",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Nutmeg",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 541",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 158053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nINTRODUCTION: During the systematic exploration of various agents in the alteration of the perception of consciousness, nutmeg was examined.  Nutmeg is a dried fruit which has enjoyed moderate to widespread popularity throughout history as a spice.  It has a pleasant nutty, minty aroma and a bitter oily flavor  which complements dairy products, root vegetables, lamb, and various other foods.  It is commonly used as a condiment in flavoring coffee.  It is quite bitter when concentrated and thus is not used to make teas, infusions, etc. on a routine basis.  Ingestion of generous portions of nutmeg (one or two teaspoons) in coffee or espresso have seemed to enhance the effects of the caffeine in a positive way.  Based on this, more rigorous examination of nutmeg itself seemed warranted.</p><p>METHODS:  Whole dried nutmeg was obtained from a local health food store.  A nutmeg grater was used to reduce several whole fruit to a light beige powder which exuded a dark brown oil when compressed.  The powder was then packed manually into gelatin capsules.  A dose of 200 mg per kg lean body weight was weighed out, comprised of 15 capsules.  On an empty stomach, these were ingested with approximately 8 ounces of water.</p><p>RESULTS: </p><p>T + 30 min.: Threshold observed within 30-60 minutes as a subtle alteration in light perception, similar to the narcotized vision of cannabis intoxication.  There is no obvious pupil dilation, confirming the suspicion that this visual change is not typically precursory to psychedelic phenomena.</p><p>T + 6 hrs.: At this point the gradual transition between mild visual changes and true intoxication have become apparent; alterations in perception and memory are quite similar to those of a moderate dose of cannabis.  The overall effect is of low-grade Mexican marijuana, but without the unpleasant headache typically associated with such.</p><p>T + 9 hrs.: Concentration has become more of a problem than one would expect given the relative lack of visual and auditory distortion.  Still no obvious psychedelic phenomena.  Marked xerostomia.</p><p>T + 12 hrs.: This appears to be the peak of the experience.  Strobe light visuals, more familiarly associated with hashish and morning glory use, is readily observed.  Paradoxically, not even the most minimal time distortion or spatial disorientative effect (typically associated with this type of effect) is observed.</p><p>T + 13 hrs.: Mild closed eye geometric patterns are seen.  Nothing very impressive.  No psychedelic or insightful phenomena.  Significant tightening of the muscles.  Occasional myoclonic twitches.  There is a hyperawareness of movement; in particular, I am very aware of the beating of my heart, which seems to be a light, cool fluttering.  Careful palpation of the radial pulse and auscultation via stethoscope reveal a normal heart rhythm however.</p><p>T + 16 hrs.: A slow drop-off.  Perception has now returned to that approximating moderate cannabis intoxication. Xerostomia still pronounced.</p><p>T + 24 hrs.: Still trailing off.  Things seem to have plateaued.  Dry mouth, etc. seems to be relenting, but urinary hesitancy is still marked.</p><p>T + 36 hrs.:  Residual clouding of thoughts makes functioning at work suboptimal.  I had not anticipated the effects would persist this long.  Fortunately, they are rather subtle at this point.</p><p>T + 44 hrs.: Effects are still present, now mostly as a residual haze -- despite a subjective recovery of mental faculties, thoughts and concentration are still difficult.  Because there is no particular associated psychoemotional euphoria, etc., I find myself impatient for the effects to clear completely.</p><p>T + 48 hrs.:  A   v-e-r-y   slow trail-off...</p><p>T + 56 hrs.:  Effects now almost imperceptible, although still above threshold.</p><p>CONCLUSIONS: </p><p>The drug was well-tolerated, and side effects seemed to be relatively minimal.  There was a significant amount of xerosis (abnormal dryness of the mouth, nose, eyes, etc.) as has typically been my experience with psychedelics, in this case more than with psilocybin but less than with unrefined cannabis.  Clouding of memory and slowed thinking were more pronounced than with psilocybin or other psychedelics and more typical of what one encounters with higher dose cannabis intoxication.  Nausea has previously been reported as a major side effect of nutmeg ingestion, but this was not the case for me.  It is possible that taking the dose in the form of capsules rather than raw powder, etc. helped in avoiding this side effect.  </p><p>The overall effect of intoxication was not an unpleasant one, but it was not significantly insightful.  In general, I would say that the effects were very similar to that of moderate dose cannabis ingestion with a few differences. </p><p>1.  There was a slightly 'cleaner' aspect to ascension, similar to that one would expect to encounter with hashish.  The strobe-like visual effects sometimes encountered with cannabis intoxication were present but of a fine fibrillate form. </p><p>2. The psychological and emotional insight one experiences with psychedelics was patently absent here.  While MDMA and 5-MeO-DIPT have exceptionally intense effects on empathy, nutmeg seemed to fall on the other end of the spectrum, having even less emotional impact than LSD, cannabis, or any other such substance.</p><p>3. The duration of effect was exceptionally long. The time from onset to peak was 9-10 hours, and, while the effects had largely subsided (to the point where I could interact normally without effort) after 24 hours, there was a persistent 'haze' which lingered for days afterwards. </p><p>4.  The physical side effects of the drug seemed to outlast the psychic effects, specifically urinary retention.</p><p>RECOMMENDATIONS:  This substance has little to offer those seeking an enlightening experience, but may be of interest to selected recreational users.  Its excessively protracted effects limit its recreational usage to persons having AT LEAST 24 hours of time to dedicate to the experience.  The extended, non-psychedelic, non-enlightening experience left me feeling a bit impatient, waiting for the physical effects to wear off and allow me to get on with things.  The caveat here is that I have a similar impatience toward cannabis products.  While an avid explorer about 10 years ago, I no longer feel that I learn anything useful from cannabis/THC trips.  </p><p>More novice explorers and persons who seek more recreation than exploration may find nutmeg more gratifying.  It is my opinion that better drugs are readily available, making nutmeg more of a novelty than anything else.  As with most who have partaken, I doubt that I will try it again.  Nevertheless, since it is legal, it may appeal to people without access to more restricted substances.  If a slow-to-peak, lingering experience which falls between cannabis and hashish (with a hint of LSD) and lasts for a few days sounds good to you, then nutmeg may be your cup of tea.  Otherwise, stick with using it to flavor your cup of coffee.</p>"
}
