{
 "title": "The Colours Of Darnkness",
 "author": "Tripper",
 "citation": "   Tripper. \"The Colours Of Darnkness: experience with Morning Glory (ID 54108)\". Erowid.org. Jan 23, 2007. erowid.org/exp/54108",
 "substance": "Morning Glory",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "200 seeds",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54108",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 23, 2007",
   "Views: 4945",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had done alot of research on Morning Glory and LSA. My friend and I had bought about 400 seeds of Flying Saucers from the nearby store, and planned on trying them early on saturday morning. However the anticipation was too much, so we took them at around 9 o clock. </p><p>We tryed our own technique to prepair the seeds. We lacked alcohol, and I didn't plan on socking my little snack in Lighter Fluid, so we used good old H20. We started off by putting the seeds in a bowl of water, and refrigerating them for about 20 minutes. We then moved the seeds to a small strainer and strained boiling water throught them. After they were thouroughly clean, we set them to dry on a paper towel. Many people think that a pepper grinder would be the best for the seeds, however we found that an elecrtic coffee grinder does a clean, fast job. The seeds were ready, so we took them home and hid them away for tonight.</p><p>At around 9 o clock we decided that it was time to dose. We sepparated the mound of powder in half, and each ate ours off of a credit card. The mix does not taste good, but it can be easily masked with lemon juice. We took a few tums to prepair ourselves for the aches and pains ahead of us.</p><p>T = 9:30: The effects were beging to be felt. A slight stomach ache was all that I felt from the seeds, so I decided to lay down to relieve tention. At 10 o clock I started to feel cold. I had chills in my head, and my limbs began to feel heavy. The stomach ache would go on and off, but I never felt close to vommiting.</p><p>T = 10:30: This is when the effects realy began to take control. While watching a movie and feeling a kind of stoned or drunk feeling, the power went out. This is what triggered the real tripping. My friend had claimed to have done that with his mind, but I'm sure that wasn't it. Anyways, A flashlight proved to be our sourse of entertainment for that time. The light was beutiful, so we looked closer, until it almost blinded us. This was cool, but the real Tripping kicked in when we turned off the flashlight. The colours were everywhere, every shape, bright as a neon sighn, and clear as day. I could almost touch them, they flew around our heads, and danced with our eyes.</p><p>T = 10:50: The power came back on around this time, which gave us a pretty good scare. The lights were blinding, so we decided to spend the rest of the night in complete darkness. While dancing around my room, I came across my old laser 1ight, which is one of those red lasers that draws pictures on the roof or floor. I set it up and put it on automatic. The Show was magical, and the rythem of music was beutiful. We had some pink floyd, and Gorrilaz, which proved to be very pleasant on the seeds.</p><p>T = 11:50: The show was still going, My friend and I decided to watch a few South Parks inside of the old tp we had in my closet. The shows were funny, but they were not what I wanted. The effects were strong, and still growing at this time, we decided to go get food.</p><p>12 o clock: Food was like an explosion of all the sences in my mouth. Crunchy cheetos had never tasted so good, and rootbeer had a desirable taste. My friend and I talked Phylisophically until around 2:30 in the morning. The effects were still strong, but I decided that it was time to go to sleep. Needless to say sleep was incredible. Vivid dreams, and just the warmth of a blanket came all too easily.</p><p>9 a.m. Morning Finally. The trip had been incredible, and nothing had been forgotten. Going outside was the most beutiful, eye opening experiences of my life. Nature is truely beutiful. I still felt funny from the last night, but I was no longer tripping.</p><p>Conclusion- Morning Glorys do work, and are a very rewarding experience. When theres no light to be found, the seeds will show you the colour of darkness.</p>"
}
