{
 "title": "Tempting Fate",
 "author": "S. Simplicissimus",
 "citation": "   S. Simplicissimus. \"Tempting Fate: experience with Kratom (ID 54115)\". Erowid.org. Mar 17, 2007. erowid.org/exp/54115",
 "substance": "Kratom",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Kratom",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54115",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 17, 2007",
   "Views: 9070",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About 24 hours ago I took what was probably a half an ounce of Kratom leaves.  Maybe it was more.  It was certainly more than the recommended 'strong' dosage that my supplier gave, and more than I had ever taken before.  I regretted it.  </p><p>I had taken Kratom on three occasions before and had very positive experiences.  So, last night, I took a huge amount.  It was a batch of dried Kratom leaves and chewed, then swallowed them.  After about an hour I began to feel the effects:  a sort of drowsy, euphoric feeling and a sense of losing my balance.  It wasn't bad at first, in fact, it was enjoyable.  But after a couple more hours I realized I had taken too much.  I had a little bit of itching and started to feel very nauseated (which I had never felt on my previous doses).</p><p>I tried to lay in bed and go to sleep, but then I started to be afraid for some reason that I might not wake up.  I don't know if this fear was valid or not, but that's how I felt.  Also, I was so hot and sweating so profusely it was hard to fall asleep anyway even though I was immensely tired.  I finally fell asleep at around 5 or 6 am (I took my Kratom dose at about 10pm last night).</p><p>I awoke a few hours later and I felt like I had a really bad hangover and had much difficulty doing a lot of things, like getting dressed, taking a shower, and taking out the trash.  I stayed in bed and slept off and most of the day and felt so drained of energy.  It was even difficult to drink water and even though I did not feel thirsty, I knew I needed to rehydrate but each time I drank a glass of water, I felt very nauseated again.</p><p>By 7 this evening, about 21 hours since I had taken my dose, I was able to go outside for a walk, which did me a world of good.  And now I feel like I'm actually coming down from the high and its poisonous aftereffects.</p><p>This experience has given me a new perspective on the use of psychoactive substances.  In short, I've decided to take a break from them for a while.  I have tried marijuana, salvia, and nitrous a few times (never together, but on separate occasions) and I have been drinking regularly, but I'm going to stop, at least for a while.  I am throwing away the Kratom I had bought, it's just not worth tempting fate again.</p>"
}
