{
 "title": "Sudden Meaning to Abstract Childhood Thought",
 "author": "NukeItGood",
 "citation": "   NukeItGood. \"Sudden Meaning to Abstract Childhood Thought: experience with Diethyl Ether & Inhalants (Starter Fluid) (ID 54162)\". Erowid.org. Dec 12, 2006. erowid.org/exp/54162",
 "substance": "Diethyl Ether & Inhalants (Starter Fluid)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(gas)",
   " ",
   "  repeated",
   "inhaled",
   "Ether",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54162",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2006",
   "Views: 18030",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[Erowid Warning: The water extraction method is ineffective in separating diethyl ether from the volatile hydrocarbon liquids/gases in starter fluid. Our understanding of the literature is that there is no such thing as safe use of volatile hydrocarbon gases: their psychoactive effects are inseparable from nerve and organ damage.]</p><p>So I got back from Alabama yesterday, and waiting for me were my friends, ready to do ether. We had always spoke of doing it, but we just had never got the inclination to take action. We used the starter fluid water extraction method in a glass, used a dropper to get the ether out, transfer it to a smaller container, and cut up old T-shirts to use as rags. There were six of us.</p><p>I got my rag and I huffed my ass off. Within maybe a minute I was feeling the full effects of it. There is a definite feeling of exactly how much the ether is affecting you, and this first time was just enough to see the tip of the iceberg on how ether would be.</p><p>I had trouble standing, but it was fun to try. The most notable thing we all had in common was the constant pulsating of everything. There was a constant 'wo-wo-wo-wo-wo-wo-wo-wo-wo-wo-wo' that caused everything to almost breathe to its rhythm. There was a slight echo to the things people said. The effects only lasted for a little while, maybe ten minutes, but I actually have no idea because you really lose the track of time.</p><p>The second time I did it, I did a lot more. This time it was pure craziness. The pulsating effects of course, but this time I would hear these phrases that it seems like I've heard for years and years and years. Like, childhood dreams that would have these abstract thoughts and feelings to them that I never understood until then. For example, a voice would say, 'Less... than... three?...', then the pulsating would get slower but stronger, and then I would feel something on my hand. It seems like I've had that dream when I was a very small child, and I never understood it or knew the context of it.</p><p>But my friend was trying to read a note his grandfather gave him with indistinguishable handwriting, so we couldn't figure out what it said for the life of us. We were passing it around and trying to make sense of it, but our answers would all come out drastically different. It was exactly like on that Seinfeld episode where Jerry sleepily scribbled down what he thought was going to be good material, but when he woke up he couldn't read it and had to get other people to try to figure it out.</p><p>But anyway, my friend had read it, and said 'Less... than... three?...', the pulsating slowed and grew stronger, and my friend's head had touched the ground and hit my hand. That was the feeling. There was an extreme epiphany at this point, and the same kind of thing happened more. Closing my eyes was a strange experience, and I would see these pulsating shapes and colors moving about, all of which had some kind of prior significance to me. After doing it this second time, I was talking to people about how they felt, and they said there were phrases with great importance to them in their experiences too.</p><p>We did it one last time, because obviously it is extremely bad for you, and we were running out anyway. The last time it was just two of my closest friends and I, which I knew was going to be the best. This time I did a shitload of it. I was just sitting on the bathroom floor and everything became pulsating again. One of my friends was crumpled over himself in uncontrollable laughter. The other just exclaimed, 'Why won't Pikachu get out of my vision?' (we had played Pokemon Snap for nostalgia's sake just earlier). He then said, 'Everyone pet the Pikachu,' and he started petting my other friend who was laughing uncontrollably. I did too, as it made sense at the time. Then he said things like, 'Good Pikachu, that's such a good Pikachu,' etc. etc.</p><p>Our friends outside the bathroom door could hear all this going on, and it was then that they decided to open the door to see what the fuck was going on. They opened it to find us petting our friend, and praising him for being Pikachu. Hilarity ensued, and I realized what the hell I was doing.</p><p>Then I tried to walk, and walking is quite a fun experience. Everything is extremely exaggerated. There was a shoe on the ground, and I kept brushing it with my feet. I kept thinking it was a person, or something I wasn't supposed to step on, so I would have to shift my weight and try to get my balance back, which was no easy task. Finally I got fed up, picked up the shoe, and said, 'EVERY TIME I STEP ON THIS SHOE, I HAVE TO CONSTANTLY RE-EVALUATE MY SENSE OF BALANCE, AND ALL FOR NOTHING. BECAUSE IT'S A FUCKING SHOE.'</p><p>It was a very fun drug to do with people, because we would all say some off-the-wall shit and it would somehow make sense to the rest of us. Of course, we might have all interpreted it differently, which is entirely likely. But all in all, it definitely made me see things in a different way, far different from any kind of drug I've ever done. I'm very glad I did it.</p>"
}
