{
 "title": "Beautiful and Devastating All at Once",
 "author": "The Frog",
 "citation": "   The Frog. \"Beautiful and Devastating All at Once: experience with Mimosa Hostilis & Syrian Rue (ID 54197)\". Erowid.org. Jul 28, 2006. erowid.org/exp/54197",
 "substance": "Mimosa Hostilis & Syrian Rue",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Syrian Rue",
   "(extract)",
   " ",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   " ",
   "16 g",
   "oral",
   "Mimosa tenuiflora",
   "(extract)",
   " ",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54197",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2006",
   "Views: 29985",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had been learning about Ayahausca and the various recipes for it from various websites for over a year...reading books, etc.\r\nFinally I got the chance to try it out. I had had an aweful and long day at work...When I arrived home my mood was greatly lifted when I found the package sitting on the doorstep...454 grams of Syrian Rue and 56 grams of Mimosa Hostilis root bark. I was as giddy and happy as a school-boy in a candy store.\r\nMy headache that I had acquired while at work had virtually disappeared and I was in a wonderful mood...anxious to brew up my new arrival and give it a try. I had never done any Tryptamine before (as far as I remember) and this would be my first experience with DMT and the Syrian Rue both. At about 11:00 pm I began the boiling. I grinded the Syrian Rue in a blender (took a little time even on liquify)...and then I grinded the root bark which was not difficult at all...when I opened the lid of the blender, pink smoke poured out...once it cleared, I saw that the bark had been shredded into thin strands or fibers.\r\nI boiled the 6 grams of Syrian Rue seed powder in 3 cups of distilled water and 1 cup of RealLemon Juice...after maybe a half-hour of boiling, I moved the pot over and let it cool for about 5 minutes before I strained off the seed mush. I then put the liquid in a pitcher and placed it in the fridge to cool it to where it was drinkable.\r\nI then placed another batch of liquid (1 part Lemon Juice and 3 parts water) in the pot and dropped in about 16-17 grams of the root bark. It began boiling and I went outside for a smoke. When I came back inside, I stirred the root bark and added another half-cup of water.\r\nI then removed the Syrian Rue from the fridge and poured a cup full (I had 2 cup fulls total) I took a sip and I swear that it was the nastiest taste I've ever experienced in my life. It tasted exactly like the after taste that remains in my mouth after I vomit...thanks to the lemon juice I'm sure. I eventually got it down and I then took the Root bark off the stove, strained and placed in the fridge. I poured the remainder of the Syrian Rue drink into the cup and gagged it down...slowly.\r\nI stepped out for another smoke. I then poured the Mimosa water into a cup. It was dark red slightly lighter than blood.\r\nI smelled it first which was a bad idea. The smell reminded me of the smell of a new pair of sneakers. If you know what I mean, you know its not something you want to drink. Regardless I bagan sipping it and yes the taste was even worse than it smelled...horrible in every way. Before I began drinking the mimosa water, I had begun feeling disorienting effects from Syrian Rue...small visual distortion and strange and heavy body high.\r\nAfter only a few sips of the Mimosa, the effects were constantly increasing. I went outside to sit and smoke what would be my final cigarette of the evening. The stars were shooting and moving about in the sky...the nausea was creeping up on me slowly. I thought to myself 'I might want to go back to my bedroom and spend the evening there. I can tell this is going to be a long night' I was ever-more confused and disoriented. When I stood up, it hit me like a bag of bricks. I noticed some serious tracers or trails or whatever you want to call them. I began moving my arms about and watching my 'million arms' drift off from one another...even when standing still the trails and incredible vibrations fell from my entire body...looking around outside I could see that the vibrations and trails were coming from everything. I marveled at this for a few moments and staggered my way inside. It was becoming harder to walk, but not like it is when I'm drunk, but like I'm becoming heavier and maybe a little stiff...harder to move.\r\nBack inside the kitchen, the light was on and it looked like I was looking at the world through a glass of water, clear but jumbled and messy...the indoor house plants put off amazing vibration and the entire room shook. I gathered my things and scuttled off to my bedroom. The nausea was still increasing. I collapsed into bed and layed on my back...bed is where I remained for the entire night.\r\nPlease note that I had not drank the whole cup of Mimosa...partly because it was nasty, and partly because I just couldn't handle anymore. I tried but just could not do it...\r\nI did not puke at all. I came close a few times...After what felt like many hours, I forced myself to stand up and retrieve some music. But I forgot why I stood up when I looked back down at my bed. I was still lying there. I was dead...My spirit was looking down at the body. I thought about it for a moment...and then jumped back into my body...my eyes were closed and I saw a myriad of images that reminded me later of the cover art for TOOL's Lateralus. I first saw the skeletal structure of a human body, then the tendens grew on and then the muscles covered the bones, followed by a black shroud with white lines, then the skin came over the body...A third eye emmerged from the fore-head...'Wow'. It glowed bright light and the body faded into the light. Then out of the darkness came jumping animals: frogs, rabbits, birds, deer...fish jumping up from rivers. I saw a giant pagoda but it had a sort of South American Indian design, there were two people standing atop the stairs...they looked at me smiling...\r\nShooting fast through a mad space of 'rainbow vision' and flying fish...\r\nPlants grew incredibly fast from the colors and their vines wrapped around my ankles and legs, and worked their way up my body and completely covered me....\r\nSuddenly for no reason at all my eyes burst open. I mean they actually burst stars shot up into the ceiling fan which spread them around the room until the stars formed the night sky. I couldn't move...the bedroom was severely warping out of shape...the physical intensity of it all was so overwhelming that I began to think that 'I can't bare this anymore...Just make it stop!'\r\nI then buried my face in a pile of blankets and I blacked out...\r\nWhen I 'awoke', the clock read 5:42 am. I was feeling intense vibrations move from my feet up through my legs and pelvis and torso and then out through my outstretched arms and head. I had been very cold through-out the experience and crawled up under the blankets twisting and turning. I couldn't feel the pillow, 'is it even here'. My hands could feel it but my head was like it was numb or not there...floating in a madness of infinity. I became somewhat afraid and was terrified to open my eyes and I was even more terrified to close them...the visions were not scary but I still could not bear them. Even Salvia did not compare to this experience. This made Salvia look like Tylenol. Even more real...as if it could possibly be. I wanted it to end. \r\nThe next thing I knew, I was waking up in the morning...feeling a little disoriented. I had to go to work again...\r\nEven for the first few hours of work, I was somewhat disoriented and slightly confused. It eventually faded away.\r\nI must say that the experience was one of the most intense of my entire life. I am interested in doing this again...however in a more prepared atmosphere possibly with someone else...there was a point in the experience that I recall saying to myself...'I don't want to be alone, I want someone to hold me, I want someone here to talk to me'. \r\nI was not psychologically prepared much like I was when I first tried Salvia. Ayahausca is amazing...something I will never forget...ah well, buy the ticket, take the ride.\r\nIncredible. Fantastic madness...\n\n\n"
}
