{
 "title": "Lost Touch With Reality",
 "author": "DJ_Mescaline",
 "citation": "   DJ_Mescaline. \"Lost Touch With Reality: experience with MDMA, Mushrooms (ID 54195)\". Erowid.org. Mar 4, 2010. erowid.org/exp/54195",
 "substance": "MDMA, Mushrooms",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "6 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54195",
   "Male",
   " ",
   "Not Given",
   "Mar 4, 2010",
   "Views: 5644",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I consider myself fairly well versed in psychedelics, but what I'm about to describe was unlike anything I have ever experienced.</p><p>Around 7:30, I popped 1 pill of E (quite a strong pill, I've done them on their own before) and 6 grams of dried mushrooms. For the first 2 hours I'm only buzzing, assuming that the E was somehow keeping the usual mushroom trip down. </p><p>Soon enough, I begin to see typical shroom visuals, melting walls, color, closed eye patters. By now the E has pumped me up as it usually does, and I'm feeling somewhat anxious, like I have somewhere to be. I don't know exactly when the whirlwind ride began, but it was incredible and terrifying, ecstatic and shocking. </p><p>Upon examining my face in the mirror I became aware that visually, things were moving in a really stange manner. As if reality were a movie and frames were missing from the show. One minute my face would be looking one way and the next it would be in a totally different position, without me actually seeing it move. I have experienced this type of hallucination before on LSD, but it was never as prominent as this.</p><p>Upon returning to my friends in the living room, I became aware that this spacial anomaly was not isolated to faces. Walking up to one of my friends, I saw him leaning against a counter. Next thing I know he's beside me. In addition to this odd movement, the shrooms were causing everything to move and warp, like the world was made of liquid. Because of the E, I was unable to focus on anything long enough to see typical shroom visuals. It was like someone had changed the refresh rate of my consciousness.</p><p>Generally when I do psychedelics, I still feel like I'm there. It feels like I'm observing the world through a special lens. This time, it felt like I was existing at a whole other level. I figure the shrooms caused me to enter a typical psychedelic state, but the E kept erasing my memory. In this sense, I kept forgetting I was on drugs, and my mind was totally focused on here and now. Our evening's plans, my own past, time, the universe, they all lost meaning. It felt like at any second I would blink and realize that I was no longer in the same reality.</p><p>In this state, I felt a constant sense of fear, as if anything could happen to me at any time. </p><p>I've experienced mild dissassociation from shrooms and LSD before, but this was much more intense. As I came down around midnight my reality went back to (somewhat) normal and I became incredibly tired (coming down from E generally does this to me).</p><p>While not necessarily the hardest I've tripped, the feeling of detachment from reality made this experience one of the most intense of my life.</p>"
}
