{
 "title": "You Said They Were Weak!",
 "author": "Pookyhead",
 "citation": "   Pookyhead. \"You Said They Were Weak!: experience with LSD (ID 5420)\". Erowid.org. Jan 14, 2002. erowid.org/exp/5420",
 "substance": "LSD",
 "bodyweight": "112 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 5420",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 14, 2002",
   "Views: 7602",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI consider this the first time I REALLY tripped. I had taken LSD three times before: 2 paper hits twice, and one yellow geltab once, but all three of those experiences are blown away in comparison to this one.</p><p>Mike, a well-seasoned tripper, got some yellow geltabs from his housemates. They had done it during the day and had basically asserted that they weren't all that potent. The one yellow tab I had done a couple of weeks before had pretty much only given me a slight mindfuck and no visuals, so I wasn't intimidated. So, Mike and I decided to trip that Saturday night.</p><p>We each took one tab and left my house at 8:00 pm, in separate cars (big mistake), and went to go rent some good tripping. When we got to the video store, Mike joked 'R u feeling anything?' But the truth was, I was already starting to feel a little funny, and only maybe ten minutes had gone by.</p><p>We left the store and headed to Mike's house. I followed him, Crystal Method pounding inside my car. I was a little uncoordinated when it came to getting on the expressway, and I kind of almost got in an accident, but I managed to get on the ramp OK. The ramp lifted me high up, or so it seemed, and I could see the city lights ahead like millions of little stars. There was construction on the expressway, so there were miles of flashing barricades set up. I wasn't having visuals yet, but it seemed like there were a hundred cars behind me, and what with the soundtrack, I felt like I was doing warp speed in a spaceship.</p><p>After a slightly panicky ride of twenty minutes or so, we arrived at Mike's deserted house, at which point we took the second hit. I just felt weird for about a half hour or so. I could tell when it kicked in, because I had been dancing with glostix and Mike left the room, and I told him he didn't want to hang with the glostick reject and then I burst into a fit of uncontrollable laughter. I can still feel that cold ass tile floor against my back, and there I was, just cracking up. I finally managed to get up and go into the guest bathroom. The counter was moving in all sorts of awesome patterns, and for the longest time I just stared at it in marvel, occasionally laughing nervously. </p><p>When I managed to tear myself away from that scene, Mike and I went into his housemate's room, which had a ton of psychedelic posters and tie-dyed stuff in it. The posters looked incredible and almost three-dimensional. I then got on the bed, which was a waterbed, and lay on my back, staring at the ceiling. Above me, a huge black-and-orange tie-dyed sheet was draped across the ceiling. This was when the tie-dye lines started coming alive, slowly at first, and then they started hauling ass, going crazy. Mike had put some weird trippy electronic music on earlier, and I screamed for him to turn it off. It sounded menacing.</p><p>There was an awful point in time where I thought I was going to go crazy. Mike came over to me and asked if I was going to be OK. I remember looking kind of over his shoulder, and through my peripheral vision a second, translucent face came out of his face, so it looked like he had two heads. I shoved my face into a mercifully dark pillow and moaned. I wasn't exactly sure. The only thing that kept me from falling apart was Mike telling me that he'd tripped so hard before, he had to touch the trees to make sure they were real. So if he had survived, then perhaps I would as well.</p><p>Mike convinced me to go for a walk in the neighborhood. It was nighttime, but I have never seen so many colors in the dark before. Everything had its own distinct pattern: the sidewalk was done up in wavy stripes, the sky had some other psychedelic 60's looking pattern, etc. Dozens of metallic colors were all over the place. Everything had zillions of trails outlining it; my own body had so many trails dancing around it that I felt like I was wearing a thick astronaut suit. Thus, I was walking with my legs apart and arms out.</p><p>The walk consisted of many colors and trails, and me thinking there were people where there weren't, and finally, me totally forgetting where the hell we were. I was happy when we reentered the safety of the house. For a while we lied down in Mike's room and I became engrossed in a lava lamp. I had a strange urge to take a warm bath. Also, it felt like my foot was on the verge of cramping up. It stayed that way for hours.</p><p>Moments later, the rest of housemates got home. They were loud and happy, which boosted my experience. I looked thru the patio door to see one of them pulling little sticky seeds from his feet; to me, they looked like millions of little green baby grasshoppers. This wigged me out, so I went back in.</p><p>We watched one of those psychedelic videos, and it looked so amazing. The screen showed a kaleidoscope of colors that kept morphing and morphing, and they looked razor sharp with detail. I remember being awed at how the mind could keep up with that speed. We popped in Fear and Loathing and laughed till we couldn't take it anymore. We even rewound some parts. When it was over, we watched it again with similar results. I was starving and was eating anything I could get my hands on. I ate some kind of party mix, and sugar cones, like the kind for ice cream. I found that eating very crunchy things was delightful while tripping.</p><p>We finally put in The Matrix, and while it had good visual effects, it wasn't a comedy like the previous movie, and I began to wind down. Outside, I saw the sun was coming up. My eyes ached, like I had been straining them for a long time. About a quarter of the way thru the movie, we decided to go to bed.</p><p>In bed, I felt like I had sunk about six inches into the mattress. It felt very soft, and the comforter felt as though I had swaddled myself in clouds. It was eerily quiet, like that static quiet you hear when u finally come out a loud club and you're partially deafened. I can't remember when, but I finally fell into a deep sleep.</p><p>If that sounds like a pleasant experience, well, it was. I didn't really mean to ingest that much, and it was pretty freaky at first. I can't stress enough the importance of having a friend with you when you trip, preferably a friend who's done it plenty of times before at much higher doses, so that when u think the world and your mind are going to shatter into a million prismatic pieces, someone's there to convince you otherwise.</p><p>PLURR</p><p>*pooky*</p>"
}
