{
 "title": "Narcs In New Orleans",
 "author": "Willie",
 "citation": "   Willie. \"Narcs In New Orleans: experience with Police (ID 54214)\". Erowid.org. Jun 29, 2006. erowid.org/exp/54214",
 "substance": "Police",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54214",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2006",
   "Views: 7408",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The night starts with us leaving my house at around eight o'clock in the evening. We all cruise around in this beat ass car, and this car is probably enough to arouse unwanted attention all on its own. We smoked a bowl, [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] drive around aimlessly for a little while, listen to the radio, so on and so forth. We then drop one guy off at his place so he can shower and do whatever else he had to do. Now we have time to kill, so after some discussion we all decide to go into New Orleans and head to a headshop. </p><p>We look at the records, bullshit with the employees for a while, and then decide to buy a bong. So we pay up, and head on out to the car. None of us notice the five-o who's now parked outside the bar. We get in our car, and my buddy whips out the bong, fills it with water and starts to check it out. He seems satisfied, so we pull out and head on about our business. </p><p>The cop who has been parked right across the street from us the whole time, leans out his window and yells,</p><p>'HEY! Put ya' head lights on!'</p><p>This shakes all of us up a little bit, but the driver flips on the lights, waves at the cop, and we're on our way. Or so we thought.</p><p>We get to the end of the street and we're in a parking lot. We dont know what to do, so the guy riding shotgun suggests that we pop a u-turn and head back out to Broadway. Sounds great, except for the fact that all the streets in uptown New Orleans are one way. This right here is the mistake that opens up a whole new can of worms. As we are headed up the street, the same cops we just encountered get out of their car, step into the street and motions for us to stop. At this point, my buddy riding shotgun throws a baggie at me with a 'Here, hold this.'</p><p>Now these guys are my friends, but thats just fucked up. So, I throw the bag on the floor and cover it with a t-shirt.</p><p>The cop steps to the driver's window and says</p><p>'Get out the car.' Doesnt ask for license, registration, nothing. So the driver gets out of the car and the cop asks him</p><p>'Am I going to find anything in the Car?' My friend replies</p><p>'No sir.'</p><p>The cop asked him repeatedly, but my friend held his ground.</p><p>All of the sudden the cop changes direction with his questioning.'Have you ever smoked </p><p>Marijuana before?'</p><p>'No sir.'</p><p>Now, we're all kinda buzzed, and we all look like stoners. That car stank like reefer and my buddy riding shotgun is holding an enormous bong in his lap. Im thinking,FUUUUUCCK! Were caught. </p><p>While all this is going on Im sitting in the back, sobered up rather suddenly, trying to wrap my head around whats going down.</p><p>As Im sitting there, I see Drug Task Force stamped on the squad car. With our luck, we just so happen to get stopped by Narcs.</p><p>By now, both my friends are out of the car, handcuffed, with the contents of their pockets on the hood. A pack of cigarettes, lighters, wallets, car keys, the herb that was in the drivers pocket along with all our paraphernalia. Now they turn their attention to me,</p><p>'Step out of the car.'</p><p>I get out, get pressed up against the car and am cuffed.</p><p>Now they ask us, 'Are there anymore drugs in the car? We know there is shit in the car. Yall are already going to jail, and unless you want us to destroy your car looking for it, just tell us where it is.'</p><p>This is where I made a crucial decision. I dont know about cops else where, but NOPD dudes are not to be taken lightly. Our gooses were cooked, and the only thing lying to these guys was doing was successfully pissing them off. So I decided not to bullshit the cops any further.</p><p>'Excuse me Officer.'</p><p>'What the hell do you want?'</p><p>'Look, man, there is a baggie and a pipe on the floor behind the passenger seat.'</p><p>'Well now we're cooking.'</p><p>The cop looks where I told him to look, and finds what I told him  he was gonna find. Then he turns to me and says, 'You, I like you. You're cooperative. And slightly more intelligent than your pals here.'</p><p>At this point he asks all of us our age. He starts with the driver.</p><p>'How old are you?'</p><p> 'Eighteen'</p><p>'You?'</p><p>'Eighteen'</p><p>Then he asks me. 'And you?'</p><p>'Fifteen.' </p><p>'You're shitting me. Fifteen?'</p><p>'Yes Sir.'</p><p>The cop chuckled.</p><p>'Well, then tonight's your luck night. Juvenile paperwork is a pain in the ass, and since you didn't bullshit me, you're free to go.' After he put my two friends in the back of the police car, he uncuffed me, called my mother and sent me on my way with this, 'The truth shall set you free.'</p><p>These cops were sitting there in their car, eating, and we just kinda fell into their laps, so to speak.</p><p>When all was said and done I got out of there scott free, and my buddies spent a night in OPP and got off with a slap on the wrist.</p><p>All of us had dealt with the fuzz on previous occasions, and gotten away with more than our fair share in the past, but not all cops are out to fuck me over. Most of them would rather forget about a dimes worth of weed then deal with the amount of paperwork that goes with it, but if  I get them po'ed, all bets are off.</p>"
}
