{
 "title": "Experience Conversion Over Time",
 "author": "Calamari",
 "citation": " Calamari. \"Experience Conversion Over Time: experience with Cannabis (ID 54252)\". Erowid.org. May 9, 2008. erowid.org/exp/54252",
 "substance": "Cannabis",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "200506",
   "54252",
   "Male",
   "",
   "Not Given",
   "May 9, 2008",
   "4814",
   " "
  ]
 ],
 "report": "<p>I have been using marijuana frequently over the past 1 1/2 years. It has more or less not gone more than 2-3 weeks without a hit. I have realised an extreme difference in experiences over this time. When I first began smoking, I was more social while high, and interacted with everyone around me. Now since I began smoking, I have been smoking with the same group of friends. </p><p>During the first year of smoking, as said, I was social and interactive with everyone. I enjoyed having a puff every Friday after school, and I would smoke until I would go home, which was usually on the Sunday morning. The same thing every weekend, just at different houses. Now the last half year, I have realised that I have become more distant to those around me while high. I have usually just sat on a couch or chair, sitting watching tv, and having my completely own routine.</p><p>I am thinking that this conversion in experience is because with my experiences while high, I have become more interested in what amuses me. I have only thought about what would amuse me, what would please my wants, what would make my experience more chilled and relaxed. But this is not a conversion I am enjoying, I have become more egotistical in everyday life, because I now know what makes me happy. Now I can see that those around me do not get any real satisfaction with me being there, because I really do not give them a reason for them being around me. I have become anti-social, frustrated when not high, always thinking, 'This would be so much better if I was high.'</p>"
}
