{
 "title": "What Long, Strange Trips They Were",
 "author": "TB",
 "citation": "   TB. \"What Long, Strange Trips They Were: experience with LSD & Mushrooms (ID 54265)\". Erowid.org. Dec 14, 2008. erowid.org/exp/54265",
 "substance": "LSD & Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "LSD",
   " ",
   "  repeated",
   " ",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "19916",
   "ID: 54265",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 14, 2008",
   "Views: 15617",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was more a typical high-achieving honors student in high school than 'party guy' but that all changed once I got to college.  The summer prior to my first college semester, my best friend and I began smoking marijuana together obtained through his older brother.  A few months later I first tried LSD in the freshman dorms on a rather random Friday night.  Over the next four or five years I took hallucinogens of one form or another  whether LSD or mushrooms  on a number of occasions and sometimes for a string of a couple days.  Oftentimes this was associated with attending Grateful Dead concerts or other concerts of similar jam bands.</p><p>I seemed to be fundamentally immune to what others would describe as bad trips.  One friend even described me as the Pied Piper who guided many of our friends through their first adventure with hallucinogens  a badge I wore with a certain degree of pride for its place within our group.  But one night  many years after my first foray into the world of LSD  I had the trip  the first real bad one and it was rather horrifying.  There was a group of about eight of us who split a rather large amount of mushrooms and I recall very clearly being somewhat reluctant to trip that night.  I had heard stories about being mentally prepared before dropping acid or eating mushrooms in order to have an enjoyable trip and wonder whether my reluctance to indulge that night might not have been an ignored red flag on my part.</p><p>I was certain that all seven of my (rather good) friends were conspiring against me during that trip.  I could hear that they were speaking and saw their mouths move, but could not understand a word.  It was as if each were speaking like the teacher from Charlie Brown and the harder I tried to understand what was being said, the more paranoid I became.  At one point, I excused myself from the rooftop balcony and slipped out the backdoor.  I walked around for what was probably a couple hours and wound-up at an ex-girlfriends house.  Although we were no longer dating, we had remained friends and in the past had tripped together.  She let me come in and comforted me as I lay curled up in the fetal position, describing my terrible night.</p><p>Recently I was diagnosed as bipolar, although as suffering from bipolar 2 or hypomania.  My mother and younger sister had both been clinically diagnosed over the past decade as having depression and through family stories, understand my maternal grandmother to have likely been depressed although she self-medicated herself by drinking a lot of alcohol and passed away when I was a kid.  </p><p>The bad trip experience was eleven years prior to my diagnosis as bipolar, but those eleven years were fraught with  at times  rather severe episodes of depression, mania, sleeplessness, irritability, frustration and achievement.  I have excelled professionally, obtained a masters degree, married a wonderful woman and have many friendships.  After being diagnosed, I have done a fair amount of research and have learned that many high achievers throughout history were too bipolar.</p><p>But I wonder about that fateful night  the night I thought my good friends were out to get me and the years of somewhat mild dysfunction since.  I never believed in bad trips and still maintain that strong-willed individuals are capable of steering their experiences on hallucinogens  to an extent.  But knowing more fully about my genetic make-up and family history of depression, I regret my poor decisions as an experimenting concertgoer.  And it isnt just one experience or one bad trip that I regret  it was the recreational use of LSD and mushrooms over the course of about five years that I am concerned about.  </p><p>Many years after the bad trip during my last summer in college, friends decided to throw a Halloween party and many at the party were eating mushrooms.  I was reluctant to join them, fearing I would experience a reoccurrence of my prior experience, but succumbed to a bit of peer pressure and ate just a couple smaller caps and a few stems.  That proved to be a huge mistake and again, believe my hesitation to take mushrooms should have been heeded.</p><p>I found myself leaving the party and experiencing rather intense paranoia  more intense than the previous episode by far.  I began walking back to my friends place as I had recently moved about an hour or so away and was a good three or four miles from the house.  Fearing that I would be caught by those I believed to be pursuing me, I began to weave back and forth up alternating side streets towards their house.  I found myself in a large public garden and crouched down amidst the plants for a long time.  I was fearful that I was being followed and experienced hallucinations of hearing voices.  After some time, I emerged from the garden after becoming disoriented and lost in it and finally made my way to my friends place, the trip beginning to subside.</p><p>When I arrived back at the house, I was greeted by my friends  most of whom were smoking marijuana or cigarettes and winding down the night of partying.  It was about three in the morning and I had been missing for the better part of four or five hours.  Everyone I had thought was out to get me earlier at the party reprimanded me for not trusting in them when having a bad trip and convinced me I had put myself in much greater risk by leaving the party.  They were right  and I had once again tapped into a part of my mind that was better left unexamined.</p><p>Being diagnosed as bipolar, I wonder about these incidences.  My siblings and I experienced our fair share of stressful events as children including a couple divorces, the death of a step-parent and witness of physical abuse towards our mother.  But I know others whove seen worse and dont know that theyre bipolar.  I feel my experimentation with hallucinogens accelerated what would have likely expressed itself eventually and believe my family history of depression is more correlated to my current and recent diagnosis than my drug use.  But I cant help but believe that LSD and mushrooms (and ecstasy) unlocked the eleven years of frustration, depression and my predisposition towards hypomania.  </p><p>Would I be diagnosed as bipolar without having ever experimented with LSD?  Probably.  Would I have had to endure the angst and exhausting bouts of depression and mania for so many years and the turbulent professional career as a job-hopping financial professional?  Not in my opinion.</p>"
}
