{
 "title": "Good Effin Times",
 "author": "Sm0ke42o",
 "citation": "   Sm0ke42o. \"Good Effin Times: experience with Fentanyl (ID 54277)\". Erowid.org. Oct 22, 2007. erowid.org/exp/54277",
 "substance": "Fentanyl",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "0.3333 ",
   "oral",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54277",
   "Male",
   " ",
   "Not Given",
   "Oct 22, 2007",
   "22318",
   " "
  ]
 ],
 "report": "<p>I am a recreational opiate user as well as for chronic pain. First of let me say I have a moderate to heavy tolerance for opiates so if you are not used to taking opiate based medications this guide is probably not for you although you could apply its information to find a dosage that fits you. </p><p>I recently have become wary of Lortab because 10/325s are so rare and I have to take upwards of 10 7.5s to achieve a threshold dose for euphoria and adequate pain relief without breakthrough pain. I use Methadone when I can get it as it is a very efficient painkiller though the euphoria is significantly less. However Methadone is also rare to come by and always expensive. </p><p>Today a friend of mine gave me a 25mg Fentanyl extended-release transdermal patch which releases so many micrograms of Fentanyl per hour for up to 72 hours. He told me to eat it instead of using it the directed subcutaneous method because a) I would not get high and b) I dont like anything that could possibly incapacitate me for up to 72 hours with no way to stop it. However I have heard much about people overdosing by eating the patches and became disgruntled when I realized I did not really trust any method of delivering this drug to myself. I have tried everything under the sun (with a few exceptions) and am very cautious of substances I am unfamiliar with. I read reports and found that most were not pleasant experiences which further served to warrant concern. So I began searching for someone who might trade some Lortab or methadone for the patch but no one was holding.</p><p>Now any opiate use knows that when you set your mind to a fix you will have it one way or another. So after a few hours I decided to cut a piece of the corner off and chew it. I knew it was working b/c a bitter taste filled my mouth, though it was not unbearable by any means. After about 1 hour I began to feel its effects very nice warm sensation and other tell-tale opiate effects. I knew by 1:30 hours into the experience that I was ok and took about one third of the patch and reached a very nice plateau that was not at all unpleasant. Quite the opposite in fact No nausea was felt contrary to what many trip reports stated, although I have never been sick from opiates so that may just be me. There was very little itchyness and a great numbed mouth as a result of chewing the patch. The euphoria was similar to that of a mild dose of H or morphine or a high dose of Hydrocodone/Oxycodone. I also did not swallow the plastic but rather chewed the plastic until it was no longer cohesive and was falling apart that way I could take it out and let the effects take hold, chew some more, etc. This was to make sure I didn't overdo it.</p><p>I give this drug an A because it had no noticeable side effects and the high was great with no breakthrough pain.</p>"
}
