{
 "title": "STFU Juice",
 "author": "Clonazapam/Rivotril",
 "citation": "   Clonazapam/Rivotril. \"STFU Juice: experience with Clonazapam, Alcohol, Tramadol & MDMA (Ecstasy) (ID 54282)\". Erowid.org. Dec 8, 2008. erowid.org/exp/54282",
 "substance": "Clonazapam, Alcohol, Tramadol & MDMA (Ecstasy)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)",
   "  T+ 6:00",
   "4.0 ml",
   "oral",
   "Pharms - Clonazepam",
   "(liquid)",
   "  T+ 6:20",
   "200 mg",
   "insufflated",
   "Pharms - Tramadol",
   "(ground / crushed)",
   "  T+ 6:40",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 7:20",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54282",
   "Male",
   " ",
   "Not Given",
   "Dec 8, 2008",
   "Views: 12423",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>T=0:00 :- Started drinking alcohol: 7 - 12 standard drinks were consumed over the night.</p><p>T=6:00 :- Ingested orally: 4mL of Clonazapam (2.5mg/mL)</p><p>T=6:20 :- 5 standard drinks were consumed by this time</p><p>T=6:20 :- 200mg of Tramadol was ingested intra-nasally, by this point the Clonazapam had started to take effect. It felt similar to being effected by approximately an extra 5 standard drinks of alcohol.</p><p>T=6:20-6:40 :- The Clonazapam was now having a significant effect and seemed to really increase the effects of the alcohol. I usually get quite drunk from 15 standard drinks.  On this occasion I felt the same but felt no obvious nausea. This is abnormal for me. I also started feeling very drowsy.</p><p>T=6:40 := 1/2 of a relatively high strength ecstasy tablet was ingested orally, a 'white turtle' that was around in the autumn of 2006 in Melbourne, Victoria for those playing at home. I laid back on the couch and from this point I remember nothing and when I say nothing I mean exactly that. To me, as soon as my head hit that couch, I woke up at approximately T = 14:00 in another room. </p><p>The following recount is complied from the recollections, photos and video taken on the night by my close friends: </p><p>T=6:40 := I was disorientated, incoherent, uncoordinated, obnoxious, rude and arrogant. My friends likened the latter three symptoms to the type of person I become on cocaine. I was stumbling around and obsessively adamant on going out for a walk to buy cigarettes. A friend of mine affectingly called my state 'fishbowling'*, where my memory was no longer than 3 seconds long.  </p><p>*Definition of 'Fishbowling' (verb): Metaphorical term comparing an individual suffering extreme short term memory loss (\n</p><p>I was keen to take some magic mushrooms that were available on this particular night.  Importantly to me, this is one drug that I adamantly refuse to consume and have NO intention of ever taking. Luckily I have very good friends and the offer was just in jest. This again proved how my steadfast inhibitions were EASILY lifted. Later I was stunned to learn of this fact, and how far from myself I had actually traveled. </p><p>T=7:20 := Orally ingested the second 1/2 of the ecstasy tablet. I now entered a state of intermittent consciousness. I would converse normally for a 2-3 minutes, which was immediately followed by a 10-15 second catatonic episode.  Following this, I would resume the preceding conversation I had so elegantly left. </p><p>I should also mention that I do not remember any of the last 40 minutes so I cannot tell you if I felt any of the ecstasy and Tramadol which is the CRUX of this report: to highlight the strength of Clonazapam and its overpowering effects over the other drugs consumed. I should also mention. I continued in this state for another 60-80 minutes after which I fell into a deep sleep from which I could not be woken. My friends carried me on the couch that I passed out on into another room so I could just sleep it off at which point I vomited (no memory of this occurrence). By far my most proudest hour. </p><p>T=14:00 := I awoke and had absolutely no recollection of what happened between T=6:40-8:40. This was a completely surreal feeling, especially considering the fact that after seeing the videos/photos from that time period, my memories were not revived, even to this day two months later. To me those 2 hours didn't happen. The person I saw in the photos and videos was not me, it was my body, but it wasn't my conscious mind controlling it. This may be a difficult concept for someone to understand who hasn't experienced it. When I did wake I was still mildly confused and disorientated, but I had regained conscious control of my mind (thank god!!). When I finally got home a couple hours later I slept for 17 hours.  </p><p>The point of this report is to highlight the frightening power of the drug Clonazapam. Bart's final thought after listening to taped sessions: 'Does my voice really sound like that?' </p><p>Written collaboratively by Bart and PandaJZ.</p>"
}
