{
 "title": "Beautifully Scattered Dreamy Thoughts",
 "author": "Delysid",
 "citation": "   Delysid. \"Beautifully Scattered Dreamy Thoughts: experience with Melatonin & Cannabis (ID 54295)\". Erowid.org. Dec 16, 2008. erowid.org/exp/54295",
 "substance": "Melatonin & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54295",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2008",
   "Views: 17732",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI think it goes without saying, the names have been changed to protect the innocent.  This experience was so interesting and, as far as I know, unprecidented, that I felt it had to be shared.<br>I have been taking melatonin recently because it helps me fall sleep and also, tends to help me remember my dreams to a small degree.  It's possible that the excess of melatonin is actually just keeping me in REM sleep longer, but that is not as important to this experience so I won't digress into discusion of that.<br>The other night I needed to get to sleep, having to work early the next day, and I took one 3mg melatonin pill.  I often take 6-9 mg as it cuts my usual hour of trying to fall asleep down to about 15 min.  Just after taking the pill, my roomate Leary came into the room to tell me his younger brother was stoping by to smoke some pot.  When his brother arrived, I declined the offer to smoke at first, because I like to take time to enjoy pot when I get to have it, and I would have to go to sleep very soon.  A few moments later, however, I decided one hit might help me to fall asleep that much faster without having to take more melatonin and risk being too drowsy in the morning.  I went out, took one decently sized hit when it was offered, and went back in to go to bed.  I felt nothing special at first, and decided to check e-mail, etc, before nodding off.  As I signed in to my account, it all started to hit.<br>The experience is difficult to describe, so I hope the reader will bare with me.  It didn't feel like being stoned and it didn't feel like the drowsiness I get when melatonin kicks in, which by the way is a very natural drowsiness, though I guess that goes without saying.  No, this experience was entirely unique.  There was a mild stonning effect, but mostly a spaciness, and a marked shift in thought patterns.  Rather than forming logical sentences in my mind when replying to mail, I began spouting playful musings with only vague connections to reality.  It was as if my imagination had flooded the logic centers of my brain.  I literally could not think in any other terms than metaphorical or out and out fantastical without a great exertion of mental effort.  In response to a picture of someone with some bent metal bars in the background, I commented on how odd the formation was since bars don't 'grow that way'.  I was profoundly distractable, and as the reader can see, at times almost aphasic, although I knew that I was writing strange things, they just seemed to flow out so easily and were so interesting to me that I let them.<br>The next phase came a few minutes later when I was trying to go to sleep.  Leary and our friend Hasbro were looking at things on the computer.  I felt no need to even have the light off.  I simply asked Leary to turn up the music I had set to play.  It sounded full and crisp.  At this point my mind was wandering in and out of dreamlike states.  I would drift off to the point of actually having what almost seemed like auditory hallucinations, and then suddenly swoop back in and the music would come back in full force.  My imagination was running wild.  It was as if seven different dreams were playing in the back of my mind.  I was in an almost hypnogogic state, eccept that it was more variable.  Rather than being stuck between sleep and wake, I simply swung on a pendulum back and forth, now almost totally asleep, now almost wide awake.<br>The music would change and be some other sound, the way that you incorporate an alarm clock bell into a dream, or the music would dissapear entirely, drowned out by what seemed like nearly intelligable sounds.  Small intrumental aspects of the music would seem much clearer and more noticable than ever before when in the more 'waking' states.  And let me say again, my imagination was running wild.  Images supersaturated my mind.  I can't remember it all clearly but there were entire dramatic scenarios playing in one conner of my brain, while quite literally, I had cartoons in another corner.  I distinctly remember one about Bugs Bunny and another about a drill sargent.  These were easily distinguished from actual hallucinations, and I have experienced something like them before, twice, on a high dose of DXM, and then actually once on a lower dose, both times when trying to go to sleep.  The difference here was imense clarity and sharp, distinct divisions between different 'dreams' as opposed to a dim gestalt of diverse but unified images and thoughts.  My head, through all of this, was surprisingly clear, though my reaction time was dulled and there was the slight stoned feeling I mentioned earlier.<br>All in all an interesting, freeing, nearly spiritual experience. I am wondering if it was just a fluke or if can be reproduced.  Only one way to find out.\n\n\n"
}
