{
 "title": "Most Impressive",
 "author": "Daytripper",
 "citation": "   Daytripper. \"Most Impressive: experience with 4-HO-DiPT (ID 54316)\". Erowid.org. Jul 31, 2006. erowid.org/exp/54316",
 "substance": "4-HO-DiPT",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "65 mg",
   "oral",
   "4-HO-DiPT",
   "(capsule)",
   " ",
   "6.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54316",
   "Male",
   " ",
   "Not Given",
   "Jul 31, 2006",
   "Views: 6558",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My wife went away to visit some relatives out of town for the day. She doesn't implicitly disapprove of my experiments, but she chooses not to participate with me. Anyway,I see this as a golden opportunity to invite one of my bros over for some beers and other things. I have obtained 165 mg. of the shiny crystals, and plan on splitting it up in four 20 mg. capsules and two 25 mg. capsules, saving the remaining 35 mg. for a rainy day. As I am writing this 2 days after the fact, I am going to dispense with the usual minute by minute account and instead write a general account of what transpired. </p><p>My bro came over and we drank a couple of brews and then sprung the question...'do u wanna trip?'</p><p>'Sure whaddya got???.This isn't gonna make us puke like the Ayahuasca? Is it?</p><p>No way dude, this is pure pharmaceutical grade stuff. None of that peripheral plant material that may interact in an unpleasant manner'</p><p>'OK dude,let's do it' He was also concerned that the beer we were drinking might not be a good idea. My safety was at stake as well as his so I simply suggested instead of slamming beers we just take it easier than usual. Right away after a few minutes I started feeling something. I did not want to say anything because I was already aware of the hypothesized 'Fundal Absorption'</p><p>But as soon as my bro said 'Hey,I can kinda feel something,' I knew I hadn't imagined the quick absorption just because I had read about it. It took him quite awhile to feel the Ayahuasca last time. Anyway, this all occurred while it was still light out. Id say around 5:30 p.m. Everything was going great, but it wasn't the intense experience I had read about in Tihkal.</p><p>My friend on the other had said he was completely trippin'. We went outside smoked some cloves, sipped some Heineken and contemplated round 2.We went back upstairs popped 2 more pre-measured gelcaps, picked up where we left off watching 'Star Trek-the Motion Picture'(Which I may add is an excellent choice when tripping regardless of dose or intensity),when all of the sudden round 2 started to kick in. I felt me third eye beginning to be massaged open, and at that point I closed my eyes forsake the movie and started to meditate. </p><p>I could not relate to you the things I saw with my minds eye or thoughts I thought of at the moment. All I could say is that I was in a state of Nirvana. The peak was relatively short, lasting maybe 15 minutes or so, but the comedown was also very pleasant. All this time we were sipping beer and sporadically making trips downstairs for refills. At no time since the first pill poppage would I say that I felt any kind of alcohol intoxication. After the peak, I did notice more visuals did not notice hardly any after the first dose, although, after the second I did notice a blue tinge to everything (including the TV, and the characters in the movie). </p><p>I also did notice the effect waning very rapidly. We went down stairs and smoked and discussed the possibility of a 'round 3'.We agreed and at around 11-11:30 p.m. decided to watch Fear and loathing in Las Vegas' (which, by the way, I had never seen. Just had a copy at the house. What a pleasant treat we were in for). </p><p>This was the craziest and most appropriate movie I could watch whilst trippin'. Unbelievable. I will have this to say the third trip (which was increased to 25 mg. gelcaps), did come on strong, but seemed to have more of a body load and I did not really peak. I would say it was much more of a plateau. I defiantly felt the strength, but did not reach the top again. </p><p>All in all though, I still tripped hard this 3rd time, with even more added visuals and a feeling that time had stopped momentarily. Also,with the third dose I did not come down so rapidly. I stayed at a good level and came down slowly. It was time for bed at around 4a.m. and I took 6 mg. of melatonin, because I hate grasping onto the tail end of a psychedelic trip. My friend declined the melatonin and told me later that he could not sleep. I told him that it took me about an hour to sleep, but I did get a good 8 hours sleep. All in all this was great. I am 29 years old now. Never had a bad trip since I started when I was 15.</p>"
}
