{
 "title": "Wiggy Weed...Is This Normal?",
 "author": "ctq",
 "citation": "   ctq. \"Wiggy Weed...Is This Normal?: experience with Cannabis (ID 5432)\". Erowid.org. Apr 1, 2001. erowid.org/exp/5432",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5432",
   "Male",
   " ",
   "Not Given",
   "Apr 1, 2001",
   "Views: 10226",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'm writing this because other people have had the same experience with pot that I have a few times, and I'm hoping it's perfectly normal.  I'm a pretty heavy potsmoker (5-6 times daily), and lately I've been hitting my one-footer alot.  Yesterday though, I took one large bong hit of straight hydro, and got really high.  When the roto got around to me again, I had a green hit, and took a rip so bad I thought I collapsed a lung.</p><p>After my fit of coughing was finished, I began to get really high.  Really high. I was seeing shit that wasn't there, and all the colors in the room began to sway and change.  This was fun, until I started to tweak out.  It seemed as if I could feel my heart and every one of my blood vessels about to explode, and I was having difficulty swallowing. I could feel every movement of food down through my digestive system, as if something inside them were about to burst.</p><p>My chest started to get tight and felt like it would cave in.  I started seeing in frames (like a low quality film), and became nervous and cold.  I kept telling my friends I thought the trees were laced with coke or something, but they told me it wasn't laced at all. I also told them I was wigging out, but when they asked me what was wrong, I couldn't explain it.  Now I smoke pot every day, so I know what being high is like, and I love the feeling.</p><p>This was different though; it was definitly a trip from weed, and I figured out that I had to stay above it and not let it beat me.  After awhile, I started to feel better. The next day I felt fine.  I would like to read about other experienced pot smoker who have experienced this same phenomenon.  It would help me out alot to know that these effects are mostly mental, and that others have had the same experiences.</p>"
}
