{
 "title": "Fun With Hypnotics",
 "author": "Lethe",
 "citation": "   Lethe. \"Fun With Hypnotics: experience with Zolpidem (Ambien), Zopiclone (Imovane), Zaleplon(Sonata) & Various (ID 54338)\". Erowid.org. Dec 26, 2007. erowid.org/exp/54338",
 "substance": "Zolpidem (Ambien), Zopiclone (Imovane), Zaleplon(Sonata) & Various",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Zopiclone",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Zaleplon",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "20052006",
   "ID: 54338",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2007",
   "Views: 43629",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have suffered from insomnia for years. I remember as far back as when I was in the second grade I would stay up nights all the time, usually I would just lie in bed and try to sleep, because my parents wouldn't let me take any pills for my problem.</p><p>Once in the fifth grade I found two 10 mg zolpidem (Ambien) pills in my father's medicine cabinet. I looked them up and, upon discovering that they were sleeping pills, took them that night and had my first 'psychedelic' experience. In retrospect it was nothing like a full-blown trip on acid or some other strong psychedelic, but at the time it was amazing: I listened to an audiobook and watched the characters act out scenes on my bed as I lay in it, and every once in a while I'd see a cartoonish figure walking around in my room, furniture melted, and the ceiling sunk slowly toward my face every time I stared at it for a minute. I knew that none of this was real, and I enjoyed the experience immensely. From then on I craved zolpidem, both because I still suffered from insomnia and because it was fun.</p><p>Much more recently (a few years ago) I finally managed to persuade my parents to take me to various doctors and shrinks to discuss my insomnia with them. I began to beg them for pills almost immediately, and after months of bullshit ('Exercise! Eat this! Go to bed at this time! Melatonin, Benadryl!') I finally managed to secure a prescription for zaleplon (Sonata), a drug very similar in effect (at least in my experience) to zolpidem, but whose effects are shorter in duration and, at the same dosage, generally less interesting.</p><p>I say 'generally' here because I had some amazing experiences with zaleplon during this period. The recommended dose did little even when I first tried it, but a good 50 mg is usually enough for a fun, relaxed, and very visual trip.</p><p>By now I had tried various other psychedelics, and I believe that it was these which caused the visual experiences I have with the three 'Z's to change: no longer do I see figures and realistic images with any of these drugs. Instead, the visuals generally consist of 'layering': a two-dimensional image, such as a computer monitor, a painting, or a pattern in wallpaper or on a rug, may appear three-dimensional and move without any notable change in coloration or detail, this seems to result from an alteration in the way afterimages are perceived when they overlap with various objects in my field of vision. The plainer an image or surface is, the less likely it is that it will produce visual effects. For me, this is very unlike the psychedelics which work by selectively activating 5HT2 receptors for me, since with most of them (psilocybin, LSD, 2c-i, 2c-e, mescaline, 2c-t-2, 5-MeO-DMT, blah, blah, blah) I see complex patterns even in total darkness.</p><p>The three 'Z's are zolpidem, zopiclone, and zaleplon, and I ended up trying them all. Each selectively activates certain GABA receptor subtypes (I can't remember which), thus, they produce 'reverse trips': perceptual distortions that in some ways mirror those produced by other psychedelics even though their mechanisms of action are quite different from those of other psychedelics.</p><p>Zopiclone (Lunesta in the U.S.) is my least-favorite of the three: its duration of effect grows substantially with an increase in dosage, and this surprised me very unpleasantly several times when I took three or four pills in a night only to watch the walls bend all day the next day. Normally I wouldn't be bothered by this, but each time it was accompanied by a feeling of slowness and stupidity and a tendency to act rashly and get angry over silly things, which isn't something I normally do. Zopiclone also produced, in my opinion, the least-interesting visuals.</p><p>I recently (finally) switched to ambien. I hoard up a few pills over a few days so that I never run out of pills before the script can be refilled, and when I feel like it I trip out on them. My usual dosage is three pills, but I sometimes take only one, or even a half, and I have taken eight at once in the past. Three or four is usually the optimal dose for me because I feel the peak effects the longest, the visuals are the most intense, and (importantly) I can at least vaguely remember what I did while I was on it. With 50 or 60, it gets pretty hazy, and although I've never done anything dangerous during a blackout, I find them downright creepy.</p><p>Some fun combinations: Once a friend acquired several hits of what he believed to be STP (DOM). I have no idea whether that was actually what was in this blotter, but two hours after two hits I wasn't feeling much and so I decided to hit some ambien. I took 30 mg and within twenty minutes I had cool visuals where colors seemed to melt out of objects but leave their outlines intact.</p><p>The three 'Z's always mix well together, but be careful dosing the zopiclone. Other than that, nothing else really stands out. Taking a strong psychedelic like 2c-e or LSD with any of these pills is fun, but not so fun that I do it that often. The effects of one substance alone are often greater than the effects of combining them in some instances.</p><p>Oh, and by the way--I'm a smoker, and you might be, too. If you can, avoid smoking just before and during your trip on these drugs, it can reduce or even eliminate their effects, especially if you're on zaleplon.</p>"
}
