{
 "title": "A Very Beautiful Experience",
 "author": "Starla",
 "citation": "   Starla. \"A Very Beautiful Experience: experience with Mushrooms (ID 54384)\". Erowid.org. Dec 29, 2008. erowid.org/exp/54384",
 "substance": "Mushrooms",
 "bodyweight": "106 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54384",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 29, 2008",
   "Views: 5650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I made a very random decision to do shrooms last night.  They had been sitting in my freezer waiting for a time when me and my friend could do them together.  Well this whole week I had been a little depressed and tangled in so many negative thoughts I felt I really needed something to help me break through it.  I had this urge all week and was trying to figure out what I could do, forgetting that I had the mushrooms in my freezer.  Then last night I really felt the urge to find something, I looked to see if I had any herbs that could serve my purpose but I didnt have any and remembered about the shrooms.  I decided to just go ahead and do them myself.</p><p>I took the whole 1/8 and chewed a couple at a time holding it in my mouth and trying to get all the juices out and then after chewing it to a really good pulp I would swallow.  This took me about 5 minutes or so to finish the whole 1/8.  I want to say it took about 20-30 minutes for me to really start feeling the physical effects of it.  It kinda felt like some sort of weird drunkenness, my limbs got all rubbery and noodley feelingit was a really cool feeling actually.  I felt a little nausea and discomfort through the whole thing but it wasnt all that bad.  I set my room up with a few candles and I lit my alter candle and some sandal wood and asked for some guidance during my trip.  I laid down on my bed and waited.</p><p>There were little rainbow hazes around the candle flames which was really pretty.  I laid on my back staring at my ceiling and saw some vague designs start to form.  That was where the trip started.  Of course it was not what I was expecting, it wasnt always a visual trip except during the height of it and when I would gaze at something.  It seemed to flow from an emotional trip to mental to visual and back again.  I would feel an emotion rise up with a certain memory and I would feel it so intensely as if I were experiencing it again which then would shift to a mental trip where I would then contemplate the emotional and come to realizations about that time in my life or that experience, it shifted between these two for a while and then the visuals started to happen more intensely but only when I gazed.</p><p>I decided to try this with my wall hanging that is behind my alter, its a celtic knotwork design with a pentagram in the middle, and it was lit by the candle on my alter.  I usually meditate on this symbol (sober) so I decided that was what I was going to do on shrooms.  It was soooo fucking awesome.  This was where the height of my trip happened.  As I was gazing at the pentagram it began to dance around and the lines and angles on the pentagram would light up differently, showing different angles and shapes within the pentagram and those lines and angles would come off of the wall hanging and into my room making different angles and designs but it was all with the same angles found in the pentagram.  Then it would change back to the dancing and shifting around and then the whole wall hanging would become this dark blue with some kind of steller looking map or designit was hard to tell because this would flash in and out very briefly and quickly, this happened about 3 or 4 times.</p><p>I got up and went to the bathroom because I had to pee, and decided to gaze in the mirror, I saw double hazes around my body, and my hands had tracers when I moved them.  I started out just moving my hands and watching the tracers and then I just started to flow, my hands and arms were dancing with all the energy around me, it was really cool, it was like I was just letting my hands ride and dance on this energykind of like when your driving and you stick your hand out and dance it on the wind except it was different and way cooler.  This flowing freely lasted through the whole trip and I think it was the best part.  My mind and thoughts flowed freely as did my emotions and I felt totally free and beautiful.</p><p>I went back and gazed at the pentagram some more and the same visuals happened and then every so often an emotion would come up and I would focus on it and feel it intensely and the memory to that emotion would come up and I would contemplate and then I would go back to the visual, this happened back and forth through the whole trip.  I got the guidance I wanted although it was mostly mental and emotional but its what I needed and it totally fixed my perception of my life and it is now very beautiful.  I hope I can keep this perspective.</p><p>This was the most beautiful experience I have had yet.  It took me through my whole life and I saw how beautiful it really has been.  All except a very dark past which I could not find any beauty in, but I also came to realize it was truly in the past and right now my life is fucking beautiful so fuck the pastits gone. I love it.  I couldnt have asked for a better trip.  I think next time though I would like to take more so I can trip harder.  I didnt trip as hard as I wanted to but none the less it was a beautiful experience.  I am definately doing this again!</p>"
}
