{
 "title": "Lived a Lifetime in 16 Hours",
 "author": "Pie",
 "citation": "   Pie. \"Lived a Lifetime in 16 Hours: experience with LSD & Cannabis (ID 54410)\". Erowid.org. Sep 23, 2007. erowid.org/exp/54410",
 "substance": "LSD & Cannabis",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "54410",
   "Male",
   " ",
   "Not Given",
   "Sep 23, 2007",
   "5354",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The year was 2000, I was a carefree student who had discovered the wonderful world of chemical mind enhancement. My latest tipple was LSD, although at the time I was taking a lot of cannabis and MDMA as well. One day, I had been to visit A, who had sold me some trips called 'Shivas'. Huge they were, bigger than a UK postage stamp. </p><p>J had come round to share the experience with me. Here's what occurred. I still remember it all in lucid detail, lovely the way these hallucinogens burn onto my memory.</p><p>15:45.. John and I eat our blotters. Monstrously big, I remember us commenting.</p><p>16:00.. Amusing ourselves with music, sitting on the sofa in my kitchen/living room (student accommodation, you've got to love it)! Nothing much is happening yet.</p><p>16:10.. Beginning to feel a bit strange now. That's all a bit quicker for acid, I remember thinking to myself.</p><p>16:20.. The sun is setting, I live in England and it's winter time. I sit there enjoying the sun, sunset is by far my favourite time of day.</p><p>16:30.. Have been enjoying the sunset forever, it feels. I check the clock. 16:30?! That's impossible, I think to myself. Surely that cannot be. I feel as if I've been sitting for hours. I tell J to check the clock. Sure enough, 16:30 he says. Impossible! We check some more clocks around the house to make sure. Indeed, it would seem that 16:30 is in fact the time. Time has indeed taken a turn for the surreal.</p><p>17:00.. It's come on strong now. I'm playing a computer game. I cannot work out if it is the most beautiful thing I've ever seen, or the ugliest. Either way, I don't seem to be very good at it anymore. I entertain myself with it for a while nonetheless. J seems to be enjoying the decor of my kitchen. It's dark outside now.</p><p>18:00.. G, my girlfriend of the time, has come to visit. Comments on how sober we look. From the outside maybe, inside my head is churning. My visual field has become alive. I remember looking at the floral pattern on the kitchen window's curtains. They are evolving at an incredible pace, flowers growing out of flowers, undulating, changing colour, living, dying, and yet, not moving at all. Strange. I remember G waving her hands at me, raising them elegantly into the air. How beautiful! My mind creates a fountain of thousands of hands emerging from her own, twisting up into the air in the most incredible spiral. Time passes in pockets. A minute can slow to hours. The computer no longer interests me.</p><p>18:30.. G decides that she is going to go for a walk, sort out some things at home. In retrospect, sitting with two near silent trippers is not the most mentally stimulating pastime for someone sober. J and I worry, our only route back to reality is about to leave. G leaves.</p><p>18:45.. The 15 odd minutes since G left seem to have taken so long to pass. J had a terrible experience with the music, I had to turn it off. I remember myself attempting to dodge the noises flying from the speakers, then seemed to have taken physical form. Only 3 hours into the trip, and I know that the most intense is yet to come. I've turned on the TV instead, I feel too discombobulated to walk, sitting is just the ticket.</p><p>19:15.. The Simpsons has come on TV. Excellent! Although it had a more ominous, meaningful tone than it usually does. I remember one strange moment when 1000 little tiny Homer's morphed out of the one big Homer that was actually on the screen. The little tiny Homer's proceeded to jump onto the table in front of the telly and frolick there. They seemed to be having so much fun. I found this most amusing. I sink back into the sofa and settle in for the peak.</p><p>20:00-03:00..</p><p>The next 7 hours are all a bit of a blur time-wise. I shall tell you about the most interesting experiences that happened, however. </p><p>At some point, J and I watch a Tom and Jerry cartoon. In this story, Tom is dreaming of going to heaven. He has to get Jerry to sign a certificate before he is allowed to ascend, however. A certificate that would vindicate Tom of all the terrible things he has done in his life. Jerry will not sign, however, and Tom spirals down to Hell. J and I find this a scary religious experience. I find myself thinking of all the bad things I have done in my life. I soon manage to shut that door though, I'd prefer not to explore that route right now. </p><p>There was the blended room moment. Everyone else who lived in my house at the time had come home and settled in the same room as J and I. I remember becoming joined with the sofa. I had no sense of myself anymore. I felt as if everyone and everything in the room were one entity. I could feel what everyone else felt, hear their thoughts. It was a beautiful, special experience that I treasure.</p><p>The split room moment was also interesting. My field of vision split vertically so that there were now 4 rooms. A red one, a blue one, a green one and the fully coloured room. I found this a particularly entertaining hallucination.</p><p>We had a whiteboard in the kitchen that had a rota for the house chores that needed doing. This had been vandalised over time. For all the beautiful art in the world, nothing was as enthralling to look at as this whiteboard that evening. Ever changing, evolving, the whiteboard took on various significant meanings over the course of the trip.</p><p>3:00</p><p>It is now the middle of the night, just J and I again. I feel a little bit more normal now, it's time for a joint. This proves quite difficult to make, especially as the tobacco seems intent on crawling out of the rizla and squiggling all over the place. Still, I succeed, and it was well worth it. </p><p>4:00 </p><p>Feeling more like myself again, yet the visuals and psychological strangeness still ensues. I feel at one point as if I have grasped the meaning of life. It was as if I floated out of my body, up and up until I was looking down on the world and I could see everything more clearly than I ever had before. Unfortunately I cannot remember my revelation now, perhaps it's better that it remains shrouded in mystery.</p><p>5:00</p><p>It's feeling quite cold now, it's winter and the heating has turned itself off. I embark on a mission upstairs. All is going well until I open the dark cupboard to turn on the heating. I could see nothing but a swirling mass of intricate red geometric patterns inside. Interesting, but frustrating. No way I'm going in there, I decide. It's not that cold anyway.</p><p>6:00</p><p>A strange experience whilst getting a glass of water. The water seemed to engulf my hand, then my arm. Strange stuff.</p><p>6:30</p><p>Disaster! I decided that my cannabis plants I was cultivating at the time needed some watering. Somehow on my way to get them water, one of the curtains has fallen from the kitchen window and the ganja plants have been knocked onto the floor. Definitely not my fault, I decide, this is what happens when inanimate objects grow minds of their own.</p><p>7:00 </p><p>J has passed out. I decide perhaps sleep is a good plan. Every time I close my eyes, however, there is an explosion of patterns of immense beauty. So very intricate. Images from my past become part of the patterns, ever changing, ever mesmorising. However, eventually my mind closes down, I sleep.</p><p>10:00</p><p>I wake. Look at the wall. Everything has stopped moving. I think I must have come down. It's actually in many ways a relief. I sit up. The patterns on the wallpaper begin to evolve, move and morph once more. Perhaps I had been too hasty. Still, I feel quite clear in my thinking. Most likely a good time to embark on a walk to the pub.</p><p>12:00</p><p>J has left, I am walking to the pub. Remember noticing the dazzling beauty of nature. Feel a little disappointed that I couldn't manage to walk the night before whilst peaking. Still, the acid is doing nature justice in the daylight, so no great loss</p><p>15:00</p><p>A good few beers inside me and the acid is still going strong. I feel as if I am floating. I manage to play the best game of darts I have ever played, it is as if I can zoom in on the dartboard from my position a few metres back.</p><p>20:00</p><p>A great afternoon of drinking and socialising has been had. I do not feel drunk, but definitely the acid is wearing down now. The visuals are calming down and I feel as if I am actually standing in the pub now as opposed to floating. </p><p>23:00</p><p>I am walking home, once again appreciating the beauty of nature. A grand day it has been. </p><p>23:30</p><p>I crawl into my bed, pass out ready to face the day that dawns tomorrow..</p><p>This was without a shadow of a doubt one of the best trips I ever had, especially for sheer intensity. However, I in retrospect got too far into the whole tripping thing. A couple of years after this trip, I had eaten many many more and it had got to the stage where I was hallucinating even when sober (HPPD, it's called). Although I quite enjoyed this, for some it is very distressing. It took a good 3 years for these after effects to leave me. They've all but gone now, I just thought it'd be a good thing to mention. By all means enjoy hallucinogens, but give them respect. Sometimes they are as wise elders, teaching me meaningful things about life. But others, they are as uncontrollable imps that tear through the house in my head, disorganising and rearranging everything that I have spent a lifetime ordering in there.</p>"
}
