{
 "title": "Wild Combination with Mild Euphoria",
 "author": "Be Leaves",
 "citation": "   Be Leaves. \"Wild Combination with Mild Euphoria: experience with LSD, Syrian Rue, Mimosa Hostilis & A. Muscaria (ID 54429)\". Erowid.org. Aug 14, 2008. erowid.org/exp/54429",
 "substance": "LSD, Syrian Rue, Mimosa Hostilis & A. Muscaria",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.75 hits",
   "oral",
   "LSD",
   " ",
   "  T+ 0:20",
   "4.5 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   "  T+ 0:20",
   "5.0 g",
   "oral",
   "Amanitas",
   "(dried)",
   "  T+ 1:30",
   "5.0 g",
   "oral",
   "Amanitas",
   "(ground / crushed)",
   "  T+ 1:30",
   "5.0 g",
   "oral",
   "Mimosa tenuiflora",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 54429",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 14, 2008",
   "Views: 7399",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was in my apartment, alone, in a good mood, curious, and looking forward to the results of combining an ayahuasca analog with LSD and Amanita Muscaria. Slight worry due to the undocumented nature of the combination, but a fearlessness and the spirit of scientific discovery overtook any and all discomfort.</p><p>T-12:00 -  stop food/water intake</p><p>T+0:00  -  .75 hit of LSD</p><p>T+0:20  -  4.5g syrian rue seeds</p><p>\t\t(in peanut butter sandwich)</p><p>T+0:20  -  5g amanitas muscaria caps</p><p>\t\t(chewed whole)</p><p>T+0:40\t-  light tingling sensation all over the skin</p><p>\t\teyes uninentionally widened and wandering</p><p>\t\ttook some time to writhe around on the bed</p><p>\t\tin pure comfort</p><p>T+1:10\t-  pipe tobacco & wild dagga smoked (1 joint)</p><p>T+1:30\t -  began sipping tea: 40oz green tea w/ ginkgo biloba conataining 5g aminita muscaria (powdered) and 5g mimosa hostilis (powdered)</p><p>T+1:45 \t -  realized recent shortness/rudeness and inability to tolerate certain questions from girlfriend.. </p><p>reliazing now effort should have been made to better understand the curiosity and not analyze the worded question</p><p>T+1:46 \t- the phrase 'dmt stains' seems very funny</p><p>T+2:20\t- finished sipping tea. slight nausea.. drank small dose of pepto bismol.</p><p>T+2:30\t- increased head buzz.. slight loss of balance</p><p>T+3:00\t- combination seems very agreeable.. inital nausea dissappeared quickly.. no uncomfortableness.. no head pain.. very pleasant.. mild euphoria no OEVs.. CEVs consist of vague patterns in constant motion and change.</p><p>T+4:00\t- ingested urine. immediate head buzz.. had to sit and close eyes for a minute</p><p>T+5:30 \t- balanced restored, almost back to baseline.. euphoria emphasized and prolonged.. time for another dagga-bacco joint :)</p><p>T+6:30\t- still feeling something.. pupils still a little dialated.. but definately on the way down.  Getting things ready to go do laundry (remember ancient proverb: after ecstacy, the laundry)</p><p>Epilogue: I enjoyed myself, but was a little disappointed that the experience was not more intense. I later discovered the Amanitas I had were fairly weak. The source was Siberia. It has been brought to my attention (and experience) that the ones that grow in Washington are generally much more potent. Also, Wild Lettuce is a MUCH more pleasant joint than Wild Dagga (the smoke is less harsh and the high is definitely more noticable). </p><p>I don't know if I will try this combination again, as more potent Amanitas seem to have very respectable subtleties to them that I have become fond of and think would be lost in the mixture.</p>"
}
