{
 "title": "High Expectations, No Results",
 "author": "Martai",
 "citation": "   Martai. \"High Expectations, No Results: experience with Nutmeg (ID 54448)\". Erowid.org. May 13, 2008. erowid.org/exp/54448",
 "substance": "Nutmeg",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54448",
   "Male",
   " ",
   "Not Given",
   "May 13, 2008",
   "Views: 4777",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nDecided to only take one nut of 'meg, as it really is a ballache to grind up, and DAMN did it look a lot! Gonna be drinking it in a honey, vanilla ice cream and nutmeg shake, which sounds pretty tasty!</p><p>5:00pm\tT+0:00\tJust on my second nutmeg milkshake out of maybe two and a half. Doesn't taste too bad, decided to use strawberries as I'd run outta honey. Got a nice christmassy taste to it.</p><p>5:30pm\tT+0:30\tMilkshake number 3... Get in!</p><p>6:00pm\tT+1:00\tWatching Wildboyz, just had a huge roast dinner. Seem to be coughing up a fiar bit of phlegm every now and again, and a little light headed, but that's about it so far! Can wait for the peak in a  couple hours!</p><p>6:30pm\tT+1:30\tStarting to feel kinda stoned, and really tired. Starting to get redeye, wooohooo! Showing some effects. Still could murder a joint though, might have to get some weed.</p><p>7:00pm\tT+2:00\tWas feeling REALLY tired right up until a couple minutes ago, now I feel fucking peachy! Gonna go smoke a cigarette, see if that does anything. But first, have to play air guitar to Dire Straits!!</p><p>7:20pm\tT+2.20\tJust read online that taking nutmeg with milk or milkshake may kinda reduce it's effects. Still feeling a very slight something, but now I'm more pissed off at my dad who's just being a cock. Really wanna get outta here and be with friends, so I can just chill and not feel like shit in my own home. Really could do with a joint or a hitman.</p><p>7:30pm\tT+2:30\tRight, finally gonna have that fag (ok, cigarette to my American friends), and I'm gonna get a can of beer too. Try and neck it in one, speed up that alcohol embrace!</p><p>8:45pm\tT+3:35\tOfficially feeling nada now. Kinda disappointed. Next time, thinking of upping the dose and not taking it with milk/milkshake.</p>"
}
