{
 "title": "Power with My Girlfriend",
 "author": "Ben",
 "citation": "   Ben. \"Power with My Girlfriend: experience with Crack  (ID 54473)\". Erowid.org. Jun 20, 2007. erowid.org/exp/54473",
 "substance": "Crack ",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "smoked",
   "Crack",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 54473",
   "Male",
   " ",
   "Not Given",
   "Jun 20, 2007",
   "Views: 12083",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>T+0:00  250mg of Crack Cocaine is placed in a glass tube with a bend, heat is applied with butane lighter until the rock melts and smoke is produced the smoke is inhaled slowly.</p><p>T+0:01  My teeth, throat, mouth, all go numb, I am noticing feelings of euphoria, an increase in heart rate, and shaky hands. Continue to smoke while talking with my girlfriend.</p><p>T+0:02  The effects are much stronger now, there is almost a tunnel vision where everything focuses in around the pipe, or whatever I am looking at, heart rate is really fast now and blood pressure is defiantly up, feelings of extreme euphoria and sexuality.</p><p>T+0:05  The drug is gone now and I put the glass tube away, this is the peak of the effects, everything feels perfect, extreme euphoria, numbness, definite increase in sex drive and socialization I am happy just talking to my girlfriend about whatever comes into my mind, I find my thoughts drifting towards sex.</p><p>T+0:10  The effects are coming down, there is an powerful desire to do more and I go back to the glass tube a few times with the idea that maybe I missed some I was surprised at how immediately addictive this was. I am still physically stimulated and shaky but there is no longer any euphoria.</p><p>T+0:30  Still stimulated, the desire to do more is subsiding, I feel worse than baseline but it is by no means unbearable.</p><p>T+1:00  Baseline.</p><p>Aftereffects  I feel fine today, I think the best way to describe my experience was pure euphoria, thats all it was, just concentrated reward, there was really nothing profound to take away from this experience but it was enjoyable, although I am not sure if I will ever do it again because its potential for addiction scares me.</p>"
}
