{
 "title": "Reborn",
 "author": "Ziggy Zag Stardust",
 "citation": "   Ziggy Zag Stardust. \"Reborn: experience with Mushrooms (P. cyanescens) & Cannabis (ID 5456)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5456",
 "substance": "Mushrooms (P. cyanescens) & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2.4 g",
   "oral",
   "Mushrooms - P. cyanescens",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5456",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 16, 2002",
   "Views: 13473",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had been looking to try mushrooms for a long time. Pretty much the entire year, as a matter of fact. So, when I found that it was harvest season and there was finally a supply around, I began the mad scramble to get ahold of some. I finally got some from the guy down the hall.</p><p>As the night that my two friends and myself had decided on for the trip approached, we began to get more and more excited. All of us had tried LSD before, and I, personally, was somewhat disappointedI only had taken one paper tab, plus my general mindset around that time was a slightly depressed one. In any case, acid had not done for me what I had expected, and I was hoping that mushrooms would open that door for me.</p><p>We ate the mushrooms at around 7 in the evening. The plan was to wait until they started kicking in, then burn our joint down to kick the effects in just a little more. We ate the mushrooms (I didnt mind the taste, but both my friends thought it was horrible), and then sat around for about 15 minutes, during which we all felt a little bit nauseous. This feeling passed when we washed the little bits of mushroom detritus out of our mouths. After about 20 minutes, we began to get a sort of anticipatory feeling, as if we could tell that something was coming. We decided to get something to drink while we could still pass as normal, so we decided to go down to the sub shop (in the same building) and get a juice.</p><p>We went outside so one of us could smoke a cigarette. I began to notice that one particular light, a blue light on top of a campus safety phone, had a sort of lazy, hazy aura around it. No other lights, just that one.</p><p>My friend finished his cigarette, and we made our way back to my room. On the way, I tried to read the little piece of text on the underside of the juice cap, and found that I couldnt make myself care about Tom and Tom of Nantucket Nectars. Back in the room, we sat listening to Hendrix Live at Winterland, and all of a sudden, we got a tremendous explosion of energy. We began dancing around, almost (but not quite) violently, and collapsed with peals of uncontrollable laughter. We began to notice that the door to my room seemed to be breathing, in and out, in unison with our own breaths. The album ended, and after we put on Hendrixs Electric Ladyland and grooved on that for a while, I turned to my friends and said, Hows everyone feel about burning that joint about now?</p><p>Carelessness. Utter carelessnesswe toweled the door and opened the windows, but we didnt turn on the fans or use any air freshener in the hallway. Just as I had settled into a chair and was watching the blacklit pictures on the wall dance in time with Voodoo Child, a sinister knock on the door broke into my flow, out of time with the music. When opened, it was revealed to me that several police officers were at the door. Not just Campus Safety, but town patrol officers.</p><p>Shaking myself back to reality as well as I could muster, I listened to the cops explain that someone had reported (from the smell) some illegal marijuana smoking, and that in such a close-knit community as a college dorm, there will be some people around who wont agree, as we obviously did, with smoking marijuana.</p><p>At this point, we shouldve been stopped-heart, mouth-hanging scared to our souls, but, somehow, we managed to stay totally calmthere were no drugs left in the room, just a bunch of paraphernaliapapers, containers, stuff like such. The cops treated us with courtesy, even respect (one of them asked me about my guitar), and, though they searched the room, they didnt rifle too carefully since wed been cooperative. I even gave him my prized bong, with the slider that said Jah on it. The cops left without knowing that we had done anything more illegal than weed (a common offense up here), and we felt not only relief, but a feeling of cleanliness and purity.</p><p>We were reborn, cleansed by officers of peace of anything illegal to put us at unease of persecution, I laid down in the beanbag chair and, after looking at my pictures on the wall glowing and dancing in green on a black background to Electric Ladyland, I closed my eyes and let 1983 manipulate my head in a way that only it could. After the album and after a quick bathroom break, I headed back to my room.</p><p>As Pink Floyds Dark Side started, I had to lay on my side, because I was getting a little bit uncomfortable. Nothing scary, I just felt like laying differently. Nearly unable and totally unwilling to open my eyes, the music painted its own pictures in my mind, which I just sat and watched. In addition to pictures, I began to notice that I was thinking faster than I ever had thought before in my entire life. I saw how my mind always figures things out that it finds interesting and then congratulates itself for it. At first I made fun of myself for it, but then I could see that with my intermittent crises of self-confidence, this was just how my mind had built up a good image of itself. I saw that this was just human, and I loved myself for it.</p><p>I saw that I smoked entirely too much weed and did everything that came along with it because I was in love with the image of being a stoner and I also saw that this wasnt really the image I wanted to affiliate myself with anymore. Escapism only goes so far, eventually I have to start living.</p><p>I saw exactly why everyone else did what they did. I saw how little of a difference money made, or anything material made. I saw how much more powerful my mind was than my body could ever possibly be. As the album climaxed into the end of Eclipse, I became dimly aware that I was breathing heavily and my entire body was rapidly rolling back and forth on the ground. I saw the entire universe, comprised of how everything reacts with everything else, wrap itself into a ball and shrink away. I was shown everything, allowed to live five thousand years in the space of five hundred breaths. As the last notes faded away I realized that I was laughing and crying at the same time, lying on my left on a beanbag chair in my dorm room.</p><p>It faded slowly and gently, and the lucidity that it left me feeling was the cleanest feeling I had ever experienced. I felt more sober than I had ever been in my entire life. I felt I had stepped outside my own mind, flown around the world, stepped outside of space, and landed right back where I was, only that much wiser.</p>"
}
