{
 "title": "The Blunt That Burned Me Back",
 "author": "Jman",
 "citation": "   Jman. \"The Blunt That Burned Me Back: experience with Cannabis (ID 54572)\". Erowid.org. Dec 12, 2008. erowid.org/exp/54572",
 "substance": "Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54572",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 12, 2008",
   "Views: 4123",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I consider myself to be a generally seasoned 'pothead' having smoked for over a year with the last few months smoking everyday at least once a day. I love weed and love getting high, but one night I had the worst experience of my LIFE.</p><p>On 7/13/06 at the Les Claypool concert me and two of my friends had snuck two blunts in to the concert. We were all pretty anxious for smoking, because we hadnt smoked yet that day. Once the opening band came on we were quick to burn the blunt. I had felt a lot more relaxed and was feeling pretty good until about 10 minutes later when the loud music started to blur and I felt very faint. I made my way to the back of the building where I sat on some stairs. I closed my eyes and felt like I was spinning. </p><p>At this point I felt nauseous and decide to go out the exit that was right in front of me to get some fresh air. Once I got outside I new some think was really wrong, I tripped and fell on the asphalt, scraped up my knees but I managed to some how get back up. I stumbled off to the other side of the parking lot where I sat down. A bunch of concerned onlookers came over to me and asked if I was ok and If I needed something to drink. I was to dazed to actually think about what they were saying so I told them I was fine and not to worry about me. I broke into a cold sweat all over my body and my limbs got pins and needles and then got numb. I began to feel like I was going to vomit so I stood up and leaned on a car where I proceeded to get sick.</p><p>After barfing most of my guts out, I felt a lot better and decided to go back inside. Once I got back inside I stood inline to buy a drink, but before I knew it the same nauseous feeling came back. I broke into a cold sweat and began having thoughts about death. I stumbled out the door and managed to find some steps to rest on. One of the concert staff had got me a glass of water which I threw up right in front of him. He thought I had been drinking earlier but I assured him I hadnt. He took me to the medical area of the building, where an EMT met me. I explained to him my symptoms and he thought that the hot air and loud music had caused me to become ill. (Heat exhaustion) He took my blood pressure and told me that I had virtually no pressure or pulse. He asked me if I have any heart problems, I told him I didnt and he told me to drink my water and he would come back and check on me. </p><p>By this point I was feeling like I was going to die, I called my mom and she came and got me. The EMT suggested I go to the hospital but I told him Id be ok, I signed papers refusing an ambulance and was on my way. When I got home I went straight to bed and the next day I felt fine.</p>"
}
