{
 "title": "What's the Deal with Benzos?",
 "author": "Fed",
 "citation": "   Fed. \"What's the Deal with Benzos?: experience with Pharmaceuticals (benzodiazepines) (ID 5458)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5458",
 "substance": "Pharmaceuticals (benzodiazepines)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharmaceuticals"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 5458",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 16, 2002",
   "Views: 8601",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nRecently I've noticed a trend among the drug using population.  Many people are now experimenting with a class of pharmaceutical drugs called benzodiazepines.  The benzos are intended to be used for diagnosed anxiety disorders, imsomnia, and seizures.  They can lower respiration, blood pressure, and even induce coma or death.  Without much knowledge of the effects of these depressant drugs, many users are succumbing to serious overdoses.  </p><p>I have experimented personally with all of the benzodiazepines currently available.  Although due to slight chemical differences, there are different dosing schedules and duration of action, the active effects of all of them are quite similar.  At low to threshold doses they produce a state of relaxation and lessened anxiety.  This is what I consider the 'fun' level. .5-2mg of xanax/ativan/klonopin/halcion or 5-20mg of valium/dalmane/librium will get most people here.  The effects can be compounded by simultaneous use of alchohol, which, in my opinion, is very dangerous when any benzo is being used. Moderate to high doses cause extreme lessening of inhibitions, disorientation, difficulty staying awake, loss of balance, and amnesia of the events that occured while intoxicated.  These are the 6-8mg xanax (etc.), 30-50mg valium(etc.) dosages. At this level even considering driving is stupid because I may fall into a deep sleep quite unexpectedly.  I know people and I have experienced myself amnesia at moderate levels, this is NOT fun as you may 'wake up' in a strange environment wondering where the hell your car is and how you got where you are. </p><p>High doses of benzos are extremely dangerous. Although individual tolerance increases rapidly, this lures the user into higher and more unpredictable states.  10mg</p>"
}
