{
 "title": "Three Experiences",
 "author": "Dead",
 "citation": "   Dead. \"Three Experiences: experience with Tyrosine (ID 54596)\". Erowid.org. Jul 19, 2007. erowid.org/exp/54596",
 "substance": "Tyrosine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Tyrosine",
   "(pill / tablet)",
   " ",
   "3000 mg",
   "oral",
   "Tyrosine",
   "(pill / tablet)",
   " ",
   "1000 mg",
   "oral",
   "Tyrosine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54596",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 19, 2007",
   "Views: 13708",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I bought a bottle of Tyrosine, 100 pills of 500mg each, for about $15.</p><p>Here are the three experiences</p><p>Experience one: at 500mg</p><p>I took one pill to test out the strength of the dosage, then went and worked out with my usual calisthenics routine in the park along with my friend J. He noticed that I was unusually loud, commanding, and overall more irritable than usual. I definitely noticed a difference in perception. When I came home, M (my other friend) said that he could tell that I was high, from my abnormally hyperactive behavior, excessive talking, and bouncing around like a little kid.</p><p>Experience two: at 3000mg</p><p>The very next day, I decided to take 6 pills to see what happens. T came to pick me up. We hung out for a while, which all seemed normal. We talked for hours about monetary society, like we were planning on blowing the whistle on government policy. I'm not usually open to secular discussions, but this one intrigued me. T is a psychology and law major, so it was different to converse on his knowledgeability, rather than 'chill' and find girls to get drunk with. Tapping into information without distraction was so second nature, that I didn't realize how long we talked until a few days later when I saw T again. Basically, I didn't know I was high until I wasn't high anymore.</p><p>Experience three: at 1000mg</p><p>This occured (actually today) a few weeks after experience two. Took 2 pills at 11:30am and went to my appointment at the hospital which was a medical assessment by New York City to see if I'm competant enough to work, or if I need to continue receiving public assistance. Arrived at 1pm. Waited a very long time to be seen by three different groups of people. Usually, whenever I have one of these social services meetings, it is extremely annoying, boring, and it drives me crazy. This time was different.</p><p>I had the urge to be communacative with every person I encountered, which made the day fun (for the most part,) and all the females that worked at the hospital were flirting with me, which was MORE fun. One girl said that I reminded her of Johnny Depp, while two others said that they liked me because I was making them laugh. All the while, I have a feel-good smile across my face. I've heard that enthusiasm is contagious, so maybe that's why they felt there was a connection betwixt us.</p><p>I finished the evaluations and left at 6pm. By 11:30pm that night I was drained, mildly apathetic, and uncomfortable talking. The effects were similar to a cocaine crash but not at all as drastic. I went to sleep easily by 12am or so, and woke two hours later at 2am, being adequately able to write this report youre reading now.</p><p>Conclusions:</p><p>Tyrosine is a great alternative to medical treatment. (pun)</p>"
}
