{
 "title": "My Various Experiences With Dilantin",
 "author": "Jaallew",
 "citation": "   Jaallew. \"My Various Experiences With Dilantin: experience with Phenytoin (ID 54616)\". Erowid.org. May 1, 2007. erowid.org/exp/54616",
 "substance": "Phenytoin",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Phenytoin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54616",
   "Male",
   " ",
   "Not Given",
   "May 1, 2007",
   "Views: 9585",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've had epilepsy since I was eleven, according to my neurologist, because I would often have little brain twitches in the visual center of my brain when relaxed and thinking hard about something, but it wasn't until fifteen that my seizure threshold dropped low enough to require me to take medication every day to avoid having another grand mals seizure. I was first assigned a dose of 300mg of Dilantin per night before I go to bed and this worked for about a week. Then I had yet another grand mals seizure and I unofficially boosted my dosage to 400 mg. This, so far, has managed to fend off the worst aspects of my epilepsy when combined with a good night's sleep.</p><p>I believe I have experienced the cognitive boosting described in Erowid's overview of Dilantin, and, of course, the anti-convulsant effects, too. Else I wouldn't be taking the things. However, there has been a downside. My short term memory seems to have degenerated quite a lot. There have been more than several occasions when I get some kind of scheme in my head and set about accomplishing it and then suddenly my mind will go blank and I'll spend anywhere between minutes to entire weeks trying to remember what it was.</p><p>I've also suffered a minor overdose for which I wasn't even hospitalized, and it was pretty bad. I stayed up too late one evening and by afternoon the next day I was having the mental twitches again, in rapid succession. I took 200mg of Dilantin, laid down to take a nap in the hopes of raising my seizure threshhold before a fit could take place. </p><p>Unfortunately, it didn't work. During the seizure I dislocated my shoulder, bit my tongue, and lost control of my bladder. When I regained consciousness, I told my younger sister that I had had a seizure, and she reported this to my mother. She arrived with 400 more miligrams of Dilantin and ordered me to take them. I did so and was told to remain in bed for the next few hours.</p><p>After I had gained enough strength to walk again, I spent the rest of the day playing who-knows-what videogame, and reading. I was then required to take my scheduled dose of 400 miligrams of Dilantin before retiring.</p><p>The next day, I awoke with a pounding headache and my vision swayed, refusing to stay in one spot long enough for me to get a good look at what I was trying to focus on. When I stood, my legs were quite weak and my sense of balance was extremely distorted. I went back to sleep, assuming that the symptoms would be cleared up by the time I reawoke. They hadn't, although the headache was beginning to clear. I repeated this process another time and by the time I had awoken again, the headache was gone. My vision was still swaying and my legs were still weak and my balance was completely FUBAR. These last few symptoms kept with me for the rest of the day, and by the next morning, they had all cleared up.</p><p>In any case, don't expect to get high off Dilantin, because it has absolutely no psychoactive effects. If someone takes a high dosage expecting a trip or something equally insane, the only thing they'll find is an incredibly uncomfortable, and that they're trying to walk on an earthquake.</p><p>It is, however, very effective as an anti-convulsant and has, at least for me, no intrusive side effects whatsoever.</p>"
}
