{
 "title": "A Wonderful Night",
 "author": "Mailboxghost",
 "citation": "   Mailboxghost. \"A Wonderful Night: experience with Morphine (ID 54650)\". Erowid.org. Jan 10, 2008. erowid.org/exp/54650",
 "substance": "Morphine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "insufflated",
   "Morphine",
   "(ground / crushed)",
   "  T+ 0:15",
   "15 mg",
   "insufflated",
   "Morphine",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54650",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 10, 2008",
   "Views: 33155",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few weeks ago some of my friends and I obtained four 30mg MS Contin Tablets. Around midnight or so, one of my friends and I decided to have the first go with it. I sucked the purple coating off my pill and neatly crushed and divided it into 2 lines. I snorted the first line and layed back for a few minutes, discussing many topics with my friends. I felt very warm and comfortable, with a slight itchy sensation all through my body. After about 10 minutes I stood up and noticed my body felt very heavy, and I was very friendly to my fellow beings, who were not all under the influence of this amazing drug.</p><p>I then walked over to a mirror on my friend's coffee table and snorted the remaining 15mgs it. Now, this is my first time with a very strong opiate, so 10mgs would have done the trick for me, since I had no tolerence for the drug at all, but I had done all 30mgs of it now. So, after I had dosed for the second time, I was feeling very strange, but good. It felt as though self pride and self esteem had no existence in the world of morphine. I sat at a computer, listening to various types of music for hours, feeling very relaxed and itchy. My eyes couldn't seem to focus right away on something, but they weren't quite blurry either. I then started feeling a bit drousy, so I layed back and watched a movie. although I couldn't quite understand the movie, it was very pleasurable laying there enjoying my surroundings. I later fell asleep, and woke up feeling just fine. I had had a great night with the morphine.</p>"
}
