{
 "title": "Convalescing",
 "author": "ElCocaine",
 "citation": " ElCocaine. \"Convalescing: experience with Mushrooms (ID 54669)\". Erowid.org. Dec 29, 2007. erowid.org/exp/54669",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54669",
   "Male",
   "",
   "Not Given",
   "Dec 29, 2007",
   "7643",
   " "
  ]
 ],
 "report": "<p>To give a more subjective view and personal view of a bad trip, I've written this in a stream-of-consciousness narrative form. The story begins approximately an hour and a half after I ingested one quarter of an ounce of shrooms at a Fest in Maine. </p><p>----------------------------------------------------------------</p><p>The two men live for this battle, it defines their existence. The whole of their being is contained in this single tableau, this moment their sole raison detre. There is a primal and savage passion coursing inexorably through them, an intangible and insatiable bloodlust. But primitive needs aside, is there not something a bit off here?</p><p>The men stand opposite one another, feet planted firmly apart, swords aimed at their respective opponents. Framing them in a rain-drenched courtyard is an intricate arabesque of wooden railings, these bordered by a quadratic oriental building, seems to be a temple. Theres something deeper here though, something digging beneath the surface, its scuffling just barely audible. This obvious frame, the wooden one, its just a hint of something larger isnt it? A wiser and more powerful relative. Something the same in essence but infinitely more important. Not only this, but, further scrutiny reveals, theres an aesthetic aspect a bit too nice, a beauty which has no place in a fight to the death. Note how everythings separated perfectly into thirds, the chaos of the relentless downpour fettered unnaturally by some vague choreography.</p><p>This is all, of course, from the Paradoxical Perspective. The paradox is that the viewpoint is objective in its unfailing resistance to change yet subjective it its insistence on certain vantage points, points that cant be a coincidence. No sir, theres something planned here. Somebody wants me to see this scene this way. No doubt about that.</p><p>These two men, two samurai, do not think of this. They do not think. They act. They do not worry about predetermination. They do not insist on their autonomy, their control, however weak it may be, of something. They are not human are they? These men are killing machines theyre violence in the abstract, anthropomorphic ideas. Their actions have been written out and through the inability not to accept, they accept this.</p><p>But hold on a tic here mate, of course they have no free will, theyre not people,  theyre characters. This is a movie. This is Hero. You brought it with you remember? To use with the laptop during a lull in the music, a lull in the drugs, a lull in the hedonistic revelry in which you longed to immerse yourself. You are watching a film. Remember this, dont let go, dont let go, dont sink for gods sake back into it, dont sink.</p><p>sink  </p><p>Sink</p><p>And</p><p>Now</p><p>Two of each of them</p><p>Or 4</p><p>In all</p><p>T</p><p>O</p><p>G</p><p>E</p><p>T</p><p>H</p><p>E</p><p>R</p><p>But four men fighting? How queer. How out of place in the back of a truck, and so small and vivid. but shit, something isnt right, somethings off, horribly off, its not right, outside, get outside, containment is contrary to your nature, you are an animal, you long for open plains. Look around A fireplace, some spaghetti and sauce in a pot and in plates scattered randomly, well maybe not randomly, there are forces, equations, perhaps theyre scattered in a Poisson distribution. Youre no statistician though, scratch that.</p><p>And FUCK Thats it. OH HELL THIS FORCEits beyond invisible, along with a lack of appearance it has a lack of sound, taste, feeling, it exists deeper, on some metaphysical level, pure essence Plato, you realize that? Theres no shadow in a cave here, this beast exists in the outside realm alone.</p><p>What were you thinking? Containment is the enemy? What is that? Agoraphobia is mans most pressing instinct, I mean, you know intuitively to get into cover. Think of whats outside. The tangible threats of PCP crazed fiends, horrible indescribable sexual acts, bears, bats, vagrants, varicose veins, enemies, republicans, democrats, and the intangible, pure hate manifesting itself in the air, broadcasting on a frequency that only you can hear, the bastard. Inside, inside, Vinny, Joe, Morgan, Hal, theyre there. Did you bite your tongue? Answer yourself, face this problem. Wipe your hand with your mouth, these things demand empirical evidence you know.</p><p>....</p><p>Covered in in something red and white but its blood, its blood true identity, blood revealed in a mystical vision to you, its chosen you as its disciple, to spread the word. But God, you have no tongue. The consequences no communication without hand signals, no speaking, kissing, unless you find some tongue stub fetishist but theyll surely have other issues, tongue stub fetishism is no sunny pastime mate. Oh itll spiral into the bizarre from there. You can bet on that.</p><p>But, oh shit, it is the shrooms isnt it. From the guy storing his shit in a life cereal box. Oh Im getting high on life and it cost me my tongue. Hah, the irony. If only those phony motivational speakers could see me now, living their dream, paying this price. But this isnt about victories and one-ups. Think of your safety man, what about your eyes. What sense organ will be the next to go oh and there are knives everywhere. Theyre inescapable, a part of this environment, pleasure and pain go hand and hand, pride yourself on not being a cutter or an emo but thosere the facts Jack. You need someone to help you to to make sure you dont fuck yourself up again. Thats prescience boy, youre a regular sage, you are, always know what to do. Well fuuuuck, get in the back of the trunk.</p><p>Blankets, softness, thats something at least, maybe tactile sensations of ease will lead to psychological ones, this is all a drug isnt it, or is it a key, something thats unlocked a doorway to a world of troubles and questions that must be answered but that normally remains locked inexplicably? Well its good, Vinnys got your hands, no chance of grasping any sharp implements, but who knows, time is fucked eh, time is fucking fucked.</p><p>And Morgan, whats he doing? Complaining about the lights being off, when theyre on, oh right, he had some too, a quarter ounce was it? Too much man I hate him get him out but fuck are my eyes there? Close one first. Can you still see? Good left eyes intact. Close the other and Good right eyes intact.</p><p>Oh youre losing it mate, and why are all these people around? Faces faces, a gallery of faces looking at you strangely, curved, as if through a fish eye lens. Theyre lucky though, lucky to be in the truck, because all else is darkness nothingness a vacuum a void beyond even a nihilists worst nightmare. Oh I see, theyve come to see you have a bad trip, and bammmmmm you shoot up, look around wildly, like a wounded animal, getting once last glance of its surroundings before a cheetah leaps to kill it.</p><p>Wait whered the truck go. Did you just pass your road? Are you driving somewhere? Not now it's XXXXXXX fest for Gods sake. You dont want to miss  out on that. And thats you isnt it? Is this an out of body experience? And youre in an operating room arent you? Clean, white sterile, a funny contrast this, pure white preceding the pure blackness. The pure blackne- wait so youre dying? This is it? Mom will lose it oh noo and Fuck the Christians were right. Im in hell.</p><p>But whod have thought Hell is an Amalgam of Gilliamesque lights, theatric almost, and symbolic Dantean tortures? The fire is everywhere, you live here now, a carnival of immolation, a festival of flames, those old hit the Negro games at fairs you know? Those last vestiges of real overt racism in the 30s? Well come on it was overt past then granted, but its like that, humiliating and wrong. Flashes of Christian frescoes, statues, psalms but you were so sure it was so illogical. The screaming!!! Screaming misery. Misery loves company does it? Misery loves nothing. Pure misery is misery alone.</p><p>But they were wrong. Because now all is black. But black doesnt mean nothing. This is everything, all is unified. Identity whats that?? Youre one youre one with everything blackness everything....everything.</p><p>But there is some sense of self now, youre a sea, a churning body of water. Thousands of thoughts populate your ocean. You can choose what you like or can you? No they float up to the surface when they please strange artifacts in the depths of the subconscious rising like bubbles to the conscious mind. You watch sopranos sometime. You have a striped shirt sometimes you think youre overweight though youre not, youre actually underweight ridiculous. Hals in this tent Im in a tent Fuck, get Hal out of here.</p><p>Do you want to play Risk? </p><p>Fuck You! Get out!</p><p>Its a sine wave this is, a rising into consciousness, and a sinking back into blackness. They gave you a pill right? To end the drugs horrible malicious effects, malicious I say, malicious but  </p><p>When did that happen?</p><p>AJs next to me, lying..</p><p>Hals back hes not so bad anymore we laugh this is brotherhood man this is real</p><p>Rays here? odd whats he got to say?</p><p>Cam, Harry XXXXX set this place up man, its a good place, youve got no right to have bad trips.</p><p>Haha, thanks Ray </p><p>I got X man, only twenty dollars, you gotta get some </p><p>Im trying to convalesce man, from shrooms and hash and herb and and.</p><p>Well now Im done with that. Odd thinking in the second person, that doesnt happen much does it. The effects are still there a bit, theres some surreal tinge in the air. Im stumbling out of the tent and my god is this like that last scene in fear and loathing. Food and plates everywhere, glowsticks strewn among the spilt spaghetti, liquor bottles littering the area outside our site, drunks and dealers and hippies and freaks and god knows what else stumbling around, meandering aimlessly and theres a crashed van at the back of our site, a windshield with a fractal break, a web with its provenance in human folly not arachnid silk. And a middle-aged women with a slight cut stepping out.</p><p>Hey Cam, come share this joint</p><p>Who are those guys? They know my name? Theyre like twice my age though? Strange, but I might as well. The paper goes around filled with the mystic herb, a plant deified in the minds of most of these fest-goers, deified indeed by the fest-host himself. The abstract feeling of relaxation stemming from something as concrete as THC??? No way, man, theres a spiritual side to all this.</p><p>Oh this festival has been going on from the dawn of time and will continue to go on till its end. Its a celebration of hedonism, collective narcissism, believe what you will about higher values, these are things that matter most. A brotherhood in sin. But it's not sin, it's the very opposite, vice is virtue. Goddamned convoluted bullshit dogmatic catholic church goddamn politicians and cops and who knows what else Im Noah Paytas now am I? whoa not anymore.</p><p>Its been 2:00 exactly now for at least 3 hours. Of course this festival is eternal its timeless. And Joe coming up to me</p><p>boobies man, theyre all naked</p><p>With that grin on his face and I laugh though Im uninterested uninterested because Ive had a revelation the nature of the universe revealed to me, a prophecy, I am the prophet of a new age the next in the line of AbrahamMoses.. Isaac.JesusMuhammad</p><p>Everything in life, see, can be broken down to one fundamental particle, the quark. It is this smallest piece of matter that makes up the neutrons, protons and, therefore, everything. Since this is so everything around us is simply an arrangement of quarks, quarks either there or not, like binary, 1 or 0. As such, being the same, the concept of God, that concept is real, but not some anthropomorphic sage-like old man, no God as energy, something existing in each of us. Gods shattered now, but at one time it was one whole science would call it the big bang but weve been forced apart, and the quarks, they have this desire to return home as all beings do, and this is manifested in human nature as a drive toward the spiritual, a divine homecoming. And this will happen, blue shifts, the universe collapsingwere coming home eventually all basic human desires have their origins in physics the dichotomy of good and evil a human representation of matter and antimatter energy and dark energy. Were all one, were all God.</p><p>I can rest now Im safe here back in the truck A microcosm this is part of everything unified.I can rest.</p>"
}
