{
 "title": "The Chaotic Heaven of Self-Expression",
 "author": "D'Anconia",
 "citation": "   D'Anconia. \"The Chaotic Heaven of Self-Expression: experience with MDMA (Ecstasy) & Cannabis (ID 54671)\". Erowid.org. Mar 13, 2007. erowid.org/exp/54671",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54671",
   "Male",
   " ",
   "Not Given",
   "Mar 13, 2007",
   "5096",
   " "
  ]
 ],
 "report": "<p>First off let me say that I had tried Ecstasy one time before this experience, about a month earlier, and had loved the experience I had.</p><p>In December of 2005 a few of my friends had decided, as we had all tried ecstasy before and liked the experiences, that we would try going to a large rave for New Year's Eve.  Naturally enough we planned on altering our state-of-mind for the event.  We had bought our pills from someone whom we had bought before and all planned on doing different dosages.</p><p>I believe the pills we had were considered 'double-stacks' and I personally had bought three for myself.  All of my friends are about as big as me but I decided to stay a little on the safe side and only take two pills before the rave and just take my last one half-way through the rave.  I had also heard that smoking marijuana would amplify the effects so I stashed a 'doobie' in the beanie I was to wear.</p><p>I was not sure what else our pills were laced with, but my friends were fairly knowledgeable on the subject and were sure we would be fine.  Our venue (the rave) was at a very large indoor stadium, scheduled to be filled with ~20,000 people for the New Year's celebration, about 1 mile from my apartment.  So we all took our first doses and decided to walk to the rave.</p><p>I knew I would be having fun at the rave and thus decided to wear some free-fitting clothes in the form of a beanie, a basketball-jersey like shirt, very soft and loose sweatpants, and  ankle-high socks for my running shoes.  None of us were wearing anything too out of the ordinary as we are all just your average college students and are not much into the 'rave scene'.  It was everyone's first time.</p><p>By the time we had gotten into the rave, we were all just starting to feel the effects of the pills we had popped.  We all still felt a little insecure about being in a new chaotic environment but as time passed we started all to feel more and more comfortable.</p><p>By about 1 hour's time after I had taken my two pills I was feeling amazing.  The rave had at least a few different stages with different DJs playing different types of dance music that were incredibly loud.  I use the term 'loud' here in a good way though, as the ecstasy let us feel the vibrations of the music and also let us take in the amazing light displays that were accompanying them.  As amazing as I was feeling, I was not aware that I was only minutes away from reaching my own version of heaven.</p><p>I had never been into dancing.  I was too self-conscious about looking stupid.  But for the first time in my life I felt the absolutely INSATIABLE desire to dance.  To express myself in the art of music.  To feel the flow of the music and unlease a barrage of dance moves.  The only thing keeping me from going crazy on the dancefloor was my friends.  Their own insecurities about looking stupid while dancing was keeping them from expressing themselves in dancing and was also partially holding me back.  It was at this point that I decided to split off from the group, which was incredibly easy considering how chaotic the entire place was, it was absolutely packed with people wearing all sorts of things.  I took my cell phone with me just in case they needed to contact me.</p><p>Once I had split off, I followed the display of lights accompanying an amazing cornucopia of sounds that led me near the main-stage.  I simply start bobbing my head to the music, then my hips, then the next thing I knew my whole body was grooving to the music and the feelings I was experiencing.  I knew there were no critical eyes watching me and finally reached that heaven I had mentioned before.  I looked around to see people only half-dancing, as though their own consciousness was holding them back and I felt sorry for them.  I felt their eyes watch me in envy.  I was often closing my eyes and just moving how my body wanted me to move.</p><p>The rave was hot.  I was in the middle of thousands of bodies frenzicly (is that a word?) moving all over and here I was in my beanie and sweatpants.  Needless to say I shed off the shirt and put my head through the arm-holes so that it kinda looked like a cape.  I left the beanie on because for some reason it didn't really bother me.  Actually it felt good on my head.</p><p>I had never felt compelled to dance like this before.  Or rather I had never the opportunity to follow my desire to dance like this before.  On this ecstasy I could FEEL the music vibrate in my bones, and all the lights I were seeing were nothing like the normal lighting of the metropolis I live in.  It was dark, but where there was light.  It was VERY bright and was never static.  The lights were moving and flashing in every way they could.  Naturally I felt it was my duty to reciprocate in my own frenzy.</p><p>I can't tell you how long I danced for.  Each song bled slowly into the next, pounding into my body but not just through my ears.  It must have been at least 90-120 minutes and I had worked up quite a sweat.  I could feel my body radiate heat all over the place.  I decided to play it safe and take a small break so as not to dehydrate myself.</p><p>I started to walk, well actually dance, my way out of the crowd and toward a more quiet area where I could cool off and get some water.  I checked my phone and found that I had at least half a dozen text messages (phone calls would go unheard in a rave) from my buddies to the tune of 'Where r u?', 'Where the fuck r u?', 'Where u go?', 'Answer me, let's meet back up', and so on.  I decided to text a couple of them back so we could meet up and smoke the marijuana I had brought with me.</p><p>All of us were pretty split-up and only one friend, actually my best friend, met up with me within a decent amount of time.  He and I went outside to a little cool-off area, bought a couple waters, and pulled out my blunt.  We didn't bring a lighter so we asked someone if we could use theirs.  They let us and we smoked the whole thing.</p><p>At this point I should mention that I am very much in-shape and still had my shirt off since I was cooling down.  Out of nowhere come 3 cross-dressing guys who decided to start hitting my friend and me.  I opted out since I knew my friend wouldn't feel comfortable in the situation and I didn't want us leading anybody on (I'm sorry but I know very little about transvestite culture) or anything, so I came up with the 'Oh what time is it?  We have to meet x, y, and z right now.  Oh hey it was nice talking to you, er, guys', and we drifted off.</p><p>The marijuana had definitely enhanced the effects of what I was feeling and by this point I just felt the best anyone could feel.  Still with my shirt off my friend and I walked around the place and just kinda explored.  I was giving looks to every good-looking girl I saw and they were reciprocating, but most of them had a specific guy with them.  Occasionally I'd see a (I assume) homosexual guy giving me looks and I thought it was kinda amusing.  At these raves it's best not to judge anyone, it will only bring trouble.  Most people just come to have fun and share their fun experiences with other human beings who want to have fun also.  There existed a very wide variety of people at this rave but regardless, we all had a couple things in common.  We were all non-sober and we were all looking to have a great time.</p><p>After exploring for a little bit I decided to take the last (third) pill I had stored up but realized that somehow I had lost the thing.  What a dilemna.  Wait no it's not.  Every 15 seconds (note: exaggeration) someone new was sneaking up on us half-yelling and half-whispering 'X!' so within a few minutes we had already bought a new pill for me.  I chewed this one and split off from my friend with the line 'Yeah you should go meet up with our other friends and see what they're doing'.  With that I was back on my own again.</p><p>I was pretty sure that chewing the pill and swallowing it would make it hit me harder and get into my system faster.  Not surprisingly by the time I got back to the dancefloor I was feeling the mix of the marijuana and extra tablet of ecstasy pretty well.  It should also be noted that it took me a while to get back to the dancefloor, the place was packed.  When I was in the outer-rim of the crowd, I started getting that feeling inside of me to dance.  I acquiesced to that feeling (ha, naturally) and made it a game of dancing while also trying to work my way toward the center of the crowd.</p><p>I was at it again.  The marijuana had definitely heightened the feelings I was having and it also gave a bit of disorientation that made things even more enjoyable.  Where the fuck was I?  I was at a rave in the middle of thousands of people looking up at a humongous platform with huge bright lights and screens flashing and in the center was the DJ.  Standing almost as an authoritarian dictator he was giving us Hedonistic listeners orders.  A scratch or spin here and the crowd would respond.  In a way he really was a dictator, a dictator of expressionism if you will.</p><p>The DJs were very good and I quickly reached what may have been the peak of my experience.  I was almost having a sensory overload, but I was enjoying it and my body was responding in every way it physically could.  Everytime I thought of something new to try, I tried it.  Hands and legs flailing, sweat building up again, I realized it was almost midnight.</p><p>The DJ uttered some absolutely incoherent words and up on the screen we saw the number '60'.  With each passing second we came down to what could literally be called lift-off.  The music started off slow and started to build up slowly.  You could see that everyone, including myself, was itching to release the pressure that was building up.</p><p>At the stroke of midnight I saw a mass of literally 10k people explode in a frenzy of movement.  It had been timed perfectly by the DJ and we were all starting off the year of 2006 with perhaps the best way anyone could: with the art of dance.  For literally 15-20 minutes the craziness did not die down.  Needless to say every part of my body was writhing to the music.  Heck I'm sure even my face was twisting this way and that.  The night was just about to get even more funny/strange.</p><p>A couple that had obviously seen my lack of control through my dance moves had come into my 'inner-circle' and started to talk to me.  I don't know why on Earth they wanted to talk to me.  I mean they should just shut up and dance.  Well I just keep going along with the conversation or whatever while half-dancing.  Eventually the guy starts talking about how him and his wife are going to 'party' at their place after the rave and were obviously looking for me to, oh, somehow make my way there with them and partake in whatever sort of craziness they planned out.</p><p>I'm guessing it was one of those 'hey we as a couple like involving random third-party people of our choice in our sexcapades'.  Unfortunately I had to decline as this was my first rave experience and I was a bit apprehensive to the idea of splitting off from my friends and I swear this is the way that some murder mysteries start off.  Again I do what I do best and make up some excuse and disappear into the crowd.  I dance for a while but it's getting late so I decide to finally meet up with my friends.</p><p>After a few texts I find out where they are, they're at another stage where a different sort of music is playing.  The music is alright, although a bit too fast-paced for my liking, and the dancefloor is WAY too lit.  I think this lighting makes everyone feel a little more self-conscious and it shows in the way people are dancing.  My friends are hardly dancing, and I feel bad for them.  In their attempts to have fun at the rave they didn't couldn't branch off from each other's company and just have fun on their own.  With eyes cautiously watching each other they do the most half-assed dance moves I've ever seen.</p><p>Their lack of enthusiasm wears off on me.  My ecstasy and marijuana-induced highs are starting to wear off also.  I split off a few yards away from my friends and again just start going crazy with my dancing.  It's difficult though as the music is going very very fast.  I thought I was going to hurt somebody.  After about a half hour I come back to our group, which hasn't moved, and see that they are still half-assing it.</p><p>Regardless of what they are doing, the rave soon ends at ~4AM and it's time for our long walk home.  We start our walk and for starters, everyone is practically deaf.  There is a powerfully and constant ringing in all of our ears the incredibly loud speakers that were blasting in our ears all night.  As if this weren't enough, we are all practically braindead from our drug-use and these two factors lead to tons of confusion and our conversations take 10x as long to be completed.</p><p>Finally we get back to my apartment and we smoke another blunt.  Everyone is still very-much retarded so we pop in a movie.  One of the friends, D, gets upset and yells 'God damn it J, will you shut the fuck up?' and the rest of us look at each other in confusion.  'Uh, D, I don't think J was even talking'.  And of course we all burst out in laughter.</p><p>Our braindead bodies stayed in front of the TV until the end of the movie when we realized that while everyone had been watching, none of us had any clue as to what happened in the plot of the movie.  I think it's about time we all went to sleep.</p><p>I curl up into my bed at ~6AM and fall asleep within 15 minutes.  We all get plenty of sleep and I actually feel just fine when I wake back up.  Some of the others are a bit groggy and we head back to our hometown, about 1.5 hours away.  It's at this point that everyone starts giving their 'mandatory' stories of the night.  No one really says anything outrageous except a few say they didn't really have that much fun at the rave.  I find this bizarre and convey my side of the story, which no one really seems to be able to relate with.  One of my friends does mention something to the effect of 'oh yeah I think I saw you for a moment when you split off, you were totally grooving' but that's about it.</p><p>At the end of the day it appears my open-mindedness and my ability to just let go and have fun, even if that means splitting off from the group, gave me a much better experience than everyone else.  To be honest I could definitely rate the experience near the best experience of my life.  I have not done ecstasy since (this is written 7 months after the experience) but am sure I will do it some time in the near future.  I haven't tried shrooms and would like to try a combination of the two as I have read good things about the mix.</p><p>Outside of shrooms+ecstasy I would only really try ecstasy at dance parties and raves where their effects can be fully utilized.  Strangely enough I feel that I could never really get addicted to this substance for one single reason: when it starts to wear off it usually becomes difficult to sleep.  This makes it very easy to screw with your daily life and there's no one out there that loves their sleep as much as I do.</p><p>On a different and sort of random (if not more personal) note, it should be mentioned that this experience really sparked my love for dancing.  All throughout my adolescent life I was holding back from the moves that my body wanted me to do.  If only I could take those days and nights back.  I'd be lying if I said I wasn't making up for it though.  Every good opportunity since this experience that I've had a change to express myself in the art of dance I have done so WITH ZEST.  No ecstasy needed, although alcohol can sometimes serve as a sort of substitute.  The ladies love being with someone who doesn't give a shit about those watching him with a critical eye, the guy who can express himself freely.  The man who has this quality will have the time of his life.</p>"
}
