{
 "title": "DMT is the Devil",
 "author": "-Jhurm-",
 "citation": "   -Jhurm-. \"DMT is the Devil: experience with DMT (ID 54729)\". Erowid.org. Jan 11, 2007. erowid.org/exp/54729",
 "substance": "DMT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "120 mg",
   " ",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54729",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 11, 2007",
   "Views: 24066",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Im still recovering from the trip....I was so scarred....I was shaking all over, and there was this crazy pattern all around me that looked like a brown-paperbag being folded and unfolded thousands of times a second, but for some reason, I was able to see exactly how it was doing each and every intricate folding pattern. The world felt like it was collapsing. I could feel myself begining to mold onto the floor. As I would walk on my hands and knees, I would feel as if I was pulling up the concrete with my hands. I felt as if there was a spaceship, and it was trying to abduct me. If I tried to look in the direction on the spaceship, All I would see is a weird pattern with 2 huge circles with tiny circles around it, In a weird triangular pattern, kindof like this: http://tinyurl.com/q4jtn.</p><p>The circles were spinning at a million miles an hour. The spaceship was very loud, it was SCREAMING at me. The pattern was spinning so fast, at first it looked like one of those gyroscopes, But It wasn't in any particular pattern, It was just all around me. The patterns were moving so fast, they seemed to create a vortex, and everything was spinning. The vortex was creating a huge ammount of free enegy, and it seemed to be about as bright as the sun. I could only look in its direction for a second, or maybe even less. Everything was fucking INSANE.....I blacked out.....</p><p>Everything has changed. My world is forever changed...  </p><p>I regret ever getting into RC's.....</p>"
}
