{
 "title": "Woman With a Parasol",
 "author": "Cain",
 "citation": "   Cain. \"Woman With a Parasol: experience with Salvia divinorum (10x extract) (ID 54744)\". Erowid.org. Mar 25, 2009. erowid.org/exp/54744",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54744",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Mar 25, 2009",
   "Views: 2257",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Although I am a fairly regular marijuana smoker (twice a week to once a day, depending on whether or not I have any/how much I have), and an occasional alcohol drinker, I am still very inexperienced with other drugs. I also tend to have a very low tolerance with drugs, I am drunk with two shots and high with one joint. Another note would have to be that I take Paxil CR, 37.5 mg every day. It is a prescribed drug that I take for depression, anxiety, and other mood disorders. This may or may not have affected my experience. Also, I would like to state that I have never experienced a trip from Salvia. I have smoked her (I associate female with this herb) in a joint with cannabis, in a bong, in an apple-bowl, and in a joint by herself, but have never tripped.</p><p>Needless to say, that did not make my first experience unenjoyable.</p><p>At the time, I had no smoking device, so I made a makeshift bowl from an apple. I smoked a few pinches of Salvia, less than 1/20 of a gram, but more than 1/40. I have smoked the same amount countless times since, but still have almost 3/4 of the original gram left. I felt a mild buzz at first, but none of the 'down the rabbit hole' experiences I had read. Still, I was expectant, so I lay down on my bed in my darkened room, and waited for the experience.</p><p>I did not experience anything for another minute or so later, when I became fed up with the light and turned it off. I returned to bed, expecting to sleep if no effects came. Soon after turning off my light, I turned it back on. In the darkness, I had experienced a deep fear, not unlike a child's fear of the monsters that lie waiting in the dark. Even though I am, ordinarily, mildly afraid of the dark, I have never experienced such expectant fear as this.</p><p>Strangely enough, turning on the lights made me ecstatic. I felt warm, happy, and free. After a few seconds, though, I began to feel a bit too warm. From that point on, a fan had to be pointed at me at almost all times, because I was burning up.</p><p>The first thing I wanted to do was look at everything. I stared, agape, at all of my posters, my books, as if I had never seen anything like them before. When my eyes focused on my poster of a Monet (my favorite Impressionist, it's Woman with a Parasol), my jaw dropped even more. I absolutely HAD to see more of this, I felt like I was gazing into the man's genius. Fortunately, I have a big book full of Monet paintings, and I opened it up. These were even more fabulous, more heart-wrenching, and I could feel the emotions that Monet must have felt while painting them. One painting, of the sea, was such a detailed photograph you could see the brush strokes. As I ran my fingers along them, I could FEEL my fingers painting the strokes, and slowly melting into the painting itself.</p><p>It was at this point that I decided to read a book. As I stood up, I saw a feather on the ground. I had never seen this feather before, and found it grotesquely fascinating. Since I had experienced no visual hallucinations before, I figured that this feather actually existed. I did, however, spend almost a full minute staring at it, as if daring it to disappear. When I was done with this, I fetched my book and returned to my room. The feather was gone, but I barely realized, let alone cared about, it.</p><p>A quarter of the way through my book, I paused to make a phone call to my friend. This is not strange, as I am prone to drunk dialing. I started off by telling him how much I value his friendship, how much I love him, but my heart was filled with so much love that I could not stop telling him how important he is to my life. I realized about two minutes into the message that I had to stop talking, so I forced myself to hang up and continue with my book.</p><p>Even though other people have reported salvia's 'high' only lasting about 5-10 minutes, mine stretched for almost 45. I smoked some more of the salvia, but it was futile to try and bring myself back up, since she is not that kind of drug. Instead, I satisfied myself with finishing the book and a good night's sleep.</p><p>I do not deny that my experience is a very unique one, but I also found it to be extremely positive, despite its not quite living up to my psychedelic expectations.</p>"
}
