{
 "title": "A Stimulating Tea, But Don't Chew the Bags!",
 "author": "Jim",
 "citation": "   Jim. \"A Stimulating Tea, But Don't Chew the Bags!: experience with Coca (with Sodium Bicarbonate) (ID 54787)\". Erowid.org. Dec 18, 2006. erowid.org/exp/54787",
 "substance": "Coca (with Sodium Bicarbonate)",
 "bodyweight": "205 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 54787",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 18, 2006",
   "Views: 17686",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI have used Mate' de Coca on many occasions as an antidepressant.  \r\nWhen used as a tea, it is a pleasant, gentle stimulant until one far exceeds the 1 bag per 50 pounds of body weight.  Adding Sodium Bicarbonate (Baking Soda) seems to help the tea steep much faster.\r\nI'd noticed that Coca-Cola used bicarb in it's process, and the Inca used Lime (a slightly different alkaline), so I decided on baking soda as a readily available catalyst(?).  \r\nAgain, as a tea in low doses, it is much better than coffee.  It DOES wear off in several hours as coffee does, leaving one a little tired. \r\nA couple of years ago, for portability, I decided to fold a teabag, add a pinch of baking soda, and put it in the side of my mouth like chewing tobacco.  1 bag seemed to be a safe alternative to a cup of tea.  For some reason, maybe a bad day, I decided to try one bag in each cheek.  That seemed to bring the stimulation to an 'abusive' level.  It reminded me of Cocaine, and started the associated 'can't get enough' feeling.  \r\nSoon it was 3 bags, then 4, which was all I could fit in my mouth. The sensation was like being CONTINUALLY on a cocaine high.  As long as the bags were in my mouth, it was like that sensation I get from first snorting cocaine, but it STAYED as long as the bags were in my mouth!!  I had a mess of soda and a pile of bags, but the end of day feeling when I stopped convinced me to stop chewing and take a break from the stuff.\r\nWhen one crosses the threshold from use to abuse with Mate' de Coca, it becomes strongly psychologically addictive due to the pleasurable sensation, but when I stop, there's a commensurate great sadness and fatigue. A mild addiction and TERRIBLE nights.  Toxicity becomes an issue with higher doses also.\n\n\n"
}
