{
 "title": "Fun But Can Be Very Dangerous",
 "author": "Steven",
 "citation": "   Steven. \"Fun But Can Be Very Dangerous: experience with GHB (ID 54807)\". Erowid.org. Sep 18, 2006. erowid.org/exp/54807",
 "substance": "GHB",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "90 ml",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2003",
   "54807",
   "Male",
   " ",
   "Not Given",
   "Sep 18, 2006",
   "16340",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My mate bought a huge jug of GHB over the Internet. I dont know if GHB is still legal in the UK but at that time, one was allowed to possess the substance but not supply it. My mate is very drug wise and consults online every time he takes some. At first we did not know the strength of the batch and we consumed very little at first, diluting it as needed. (Notice: GHB is usually diluted but can be very strong sometimes so take care) I usually take GHB when I go clubbing and I prefer it to anything else as I dont experience any comedown or hangover the next day. For me GHB is a mood-enhancer. When you win the lotto while on GHB, you will literally be the happiest man alive. If say, your mom dies while GHB'ing you'll probably cry yourself into a coma. So when I go clubbing its just an excellent night out, real fun with no side effects.</p><p>I also had some sleeping problems but I've never consulted a GP over this problem. I started drinking half my normal dose just before I went to sleep.(My normal dose was about 30mil mixed with any fluid...NOT ALCOHOL!!) As I said before GHB enhances my mood so if I drink it when I go to sleep, I will sleep like a baby or a rock, take your pic. Cool thing is, when  I wake up the next morning I feel VERY refreshed and energetic, its amazing really! </p><p>So one night around 7pm all my housemates except one Spanish bird were out clubbing and pubbing. I was busy with a medical trail and weren't allowed to consume any alcohol so I decided to stay indoors and chill out. Me and my mate had the exact same water bottle in our room. Mine was always filled with water and his was filled with GHB. I was in my room and decided to drink some water. I accidentally drank two mouth fulls of his GHB before realizing my mistake as GHB tastes like dishwashing liquid. (uncolored GHB and water look alike so one can easily get confused) </p><p>Although I ingested way too much, I felt confident in my body to break up the substance very quickly and had loads of water too to speed up the process. I went downstairs and watched some TV. The next thing I remember was lying on my bed with three paramedics and two cops around me. </p><p>What my Spanish housemate reported was that I fell asleep on the sofa in the living room. She went upstairs and after about two hours, she heard screams downstairs. When she came running down she found me in a hysterical state running through the house, up and down the stairs without stopping. When she tried to stop me to ask me what's wrong, I just screamed in her face shaking her around like a rag doll. I even tried to topple a HUGE cabinet over on top of me and if she didnt stop me I would surely be dead or a paraplegic. She got really scared and decided to phone the paramedics and police. I then finally ran into the toilet and took a long wee. After that I was as calm as a sloth, sleepwalked to my bed and continued sleeping. </p><p>This was when the police and paramedics woke me up. When they saw I was in a stable condition, they left.</p><p>I think that whilst unconscious or in a deep sleep, My body had to dispose of some urine. I had some flashbacks of me screaming and being 'crazy' and I do remember that my bladder felt like bursting. That's why after my visit to the loo, I calmed down.</p><p>I wonder if something worse could have happened if I hadn't drank a lot of water beforehand... perpetual coma perhaps? Who knows.</p><p>LAST WORD:</p><p>Store GHB away from water as one wont be able to tell the difference. Not all batches are the same dilution. When taking GHB always tell someone what youre up to so the appropriate action can be taken if something goes wrong.</p>"
}
