{
 "title": "The Social Contract",
 "author": "Rick",
 "citation": "   Rick. \"The Social Contract: experience with Aripiprazole (Abilify) (ID 54812)\". Erowid.org. Jun 16, 2007. erowid.org/exp/54812",
 "substance": "Aripiprazole (Abilify)",
 "bodyweight": "244 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Aripiprazole",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Pharms - Lorazepam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54812",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 16, 2007",
   "Views: 14392",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started smoking pot when I was 15, but very, very rarely until I entered college at age 19. I had been an A student but became very upset at the world at that point, I did not get into Harvard, Princeton or Yale and my safety school didn't impress me that much. I smoked pot a lot when I got there, although I wasn't into drinking or other drugs. I did, however, do mushrooms (maybe about 15 times), and had 'mystical' experiences on them. I think these experiences altered me fundamentally, as we shall see later.</p><p>I smoked all the pot I could get my hands on in college. Bad pot, good pot, the best pot, anything, it gave me a great feeling, like I was in control of myself and, as much as I could be, of my surroundings.</p><p>But I was tremendously depressed (although I didn't know what 'depression' was at the time, and I hate labels when it comes to mental thoughts and feelings), and I saw a shrink at the end of my senior year. Although I believe in pushing the limits of society, I feel I am firmly a part of it and I do not believe it is wise to always be rocking the boat. Hence, the medical approach to my unease.</p><p>The Psychiatrist prescribed an antidepressant, Zoloft, which I had a very bad experience with, and I promptly stopped taking it. I think at that point I had been so angry at the ruling class of higher education for so long that I 'didn't trust anyone over 30', to use a naive saying.</p><p>A year later, another shrink diagnosed me with depression and ADHD, and put me on Prozac and stimulants (Dexedrine). Although it helped a bit, I still felt bad.</p><p>I went to law school, and failed out. I was still pissed at the world - the ruling classes call such feelings 'grandiose'. I spent the next two years at home feeling bad, suicidal, and homicidal, I barely remember them. I rarely did any drugs, if at all. The third year after law school I lived in an apartment in the city and smoked all the pot I could. Not in a good way - always by myself. I would smoke, play online video games, masturbate to internet porn, eat, and be isolated for long periods of time. I rarely had sex, I plotted murder-suicide plans. I was so angry at how I was treated in law school and I was still angry at the fact that I went to a shitty safety school that I could barely breathe.</p><p>Finally I could take it no more and I checked myself into a hospital. I knew I was about to enter the 'pharmaceutical/medical complex' but I also had little choice - society does not care for 'crazy people'. </p><p>Soon enough, I was put on aripiprazole (Abilify) and lorazepam for treatment of 'Bipolar disorder'. I do feel better, but I feel less energized and sometimes dull. I have experienced what doctors call 'Akathisia' on numerous occasions while taking Abilify. I hate this feeling beyond belief and the first time I took Abilify I threw away all of my medications out of protest and fear. </p><p>I am only on week two of taking this medication. I do not know how it will affect me in the future. Every person deals with the tension of the 'social contract' that binds us from birth - I guess my actions and thoughts have been judged to be out of bounds and now I am paying the price.</p>"
}
