{
 "title": "Voacanga and Rave",
 "author": "KaoServitor",
 "citation": "   KaoServitor. \"Voacanga and Rave: experience with Voacanga africana (ID 5483)\". Erowid.org. Mar 4, 2001. erowid.org/exp/5483",
 "substance": "Voacanga africana",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 seeds",
   "oral",
   "Voacanga africana",
   "(seeds)",
   "  T+ 0:45",
   "25 seeds",
   "oral",
   "Voacanga africana",
   "(seeds)",
   "  T+ 0:45",
   "25 seeds",
   "oral",
   "Voacanga africana",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5483",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 4, 2001",
   "Views: 20100",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n4:10 - Just swallowed 25 voacanga africana seeds. Im going to do 25 at 30 minute intervals now, so hopefully I can keep the nausea down.</p><p>5:40  I have ingested 75 seeds over the past hour and a half. Went to holly wood video, and I noticed that things seemed slightly more vivid, almost like heightened 3d. Now, I feel slightly tingly, kinda like with kava.</p><p>9:00  I lost most, if not all of what I ingested. Shat it out in diarrhea. Ah well.</p><p>I got the 75 voacanga seeds from a good friend of mine. He had taken them before, and reported nausea, but also a profound spritiual experience. So, it was my decision to fast for a good 24 hours before taking them. It didn't help very much though, as my stomache emptied itself completely 5 hours after ingestion.</p><p>The following night I went to my first rave with the same friend. </p><p>The effects I observed afterwards were profound, specifically being more at peace with myself and society, feeling very calm, and understanding myself better. It is my guess that those profound changes are the primary results of the voacanga. The rave just helped to stimulate me and open my mind up to the effects of the plant.</p><p>So, all in all, I would recommend this plant to anybody who feels in need ot enlightenment, or of course if you have a drug addiction you need to cure. I would recommend though, that you either try to ingest a different part of the voacanga, or perform an HCL extraction first, rather than ingesting the noxious seeds. Also, starting out with a dose smaller than 75 seeds would be advisable, if you do choose to use the seeds.</p>"
}
