{
 "title": "Important Warning for anyone using Wellbutrin",
 "author": "ucla_vince",
 "citation": "   ucla_vince. \"Important Warning for anyone using Wellbutrin: experience with Bupropion (Wellbutrin), 5-MeO-DiPT & 2C-T-7 (ID 5487)\". Erowid.org. Mar 5, 2001. erowid.org/exp/5487",
 "substance": "Bupropion (Wellbutrin), 5-MeO-DiPT & 2C-T-7",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)",
   " ",
   "30 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   " ",
   "30 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5487",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2001",
   "53666",
   " "
  ]
 ],
 "report": "<p>\nI am on Wellbutrin and recently had a very bad experience with 5-MeO-DiPT and 2-C-T-7. The best we can figure (me and the doctors at the hospital) is that it was all due to an adverse interaction with the Wellbutrin. Here's the story:</p><p>I took a combo of Foxy and T-7 at around 10pm. I was tripping really hard and having a great time when I decided to go for a walk outside at around 1:30 am. The last thing I remember is leaving my apartment and walking down my street. This is what was related to me by the hospital staff. At around 2:30 am I was arrested by the police because I was laying down in the middle of a busy street. It took 5 police officers to subdue and arrest me. They took me to the emergency room where I was screaming and fighting and threatening people, so they strapped me down to a bed and sedated me twice just to calm me down. I however, remember none of this. The next thing I remember after leaving my apartment is comming around in the ER at around 5am, strapped to a bed and covered in my own vomit. After I came to, they transfered me to the Neuro-Psychiactric Institute where I was kept (on an involuntary hold) for 4 days until I was released. I can without a doubt say that this was the WORST experience of my life. So, anyone using Wellbutrin, I would STRONGLY advise that you avoid 5-MeO-DiPT and 2-C-T-7.</p><p>A word to the wise...</p><p>Otherwise, I would say from the earlier part of the experience, that a 5-MeO-DiPT/2-C-T-7 combo could be a really great and powerful experience.  I was feeling quite euphoric and very contemplative.  The audio and visual distortions were extremely intense, and I spent a good deal of time thinking about life, the universe and everything.</p><p>Just don't do it with Wellbutrin!</p>"
}
