{
 "title": "Alert, Jittery and Slightly Euphoric",
 "author": "Coffee Head",
 "citation": "   Coffee Head. \"Alert, Jittery and Slightly Euphoric: experience with Caffeine (ID 54886)\". Erowid.org. Feb 1, 2008. erowid.org/exp/54886",
 "substance": "Caffeine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   " ",
   "1 cup",
   "oral",
   "Coffee",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54886",
   "Male",
   " ",
   "Not Given",
   "Feb 1, 2008",
   "4570",
   " "
  ]
 ],
 "report": "<p>I was looking for a way to go to school because I skipped school twice in a row due to over-sleeping. While I was at the gas station I saw some No-Doz pills that I heard about online, it had 4 pills and it was roughly $1.25. I bought them and the next day I popped both of them in my mouth and laughed to myself as I swallowed the pills with a cup of coffee. Soon after 30 minutes of ingestion, I started feeling more awake and alert. My hands were trembling a bit and as I was getting to school, the minute bell rang so that means I had 1 minute to get to class or Ill be marked tardy and sent to a dumb ass room and wait till next period.</p><p>So I ran and found that I could run faster and I did not feel any fatigue when I arrived to class. Being more alert than I have ever been in the past years I listened to EVERY, ACHING, ANNOYING word coming out of my teacher's mouth, I was so irritated. I'm always irritable especially from her because she came from teaching 1st graders and I'm a junior so the way she speaks to the class just bugs the shit out of me. I did finish my work faster than ever (with 100% grade) but my handwriting was diminished due to the shaking of my hands.</p><p>Then about 2 and a half hours later I felt the effects rapidly vanishing. but I was still very talkative, talking about random stuff which irritated some people. The lift it gave me was incredible but I had a slight headache when I got home and I felt tired.</p>"
}
