{
 "title": "Busting the Blockade",
 "author": "quackntrash",
 "citation": "   quackntrash. \"Busting the Blockade: experience with Naltrexone, Heroin, Alprazolam & Zolpidem (ID 54901)\". Erowid.org. Jul 6, 2007. erowid.org/exp/54901",
 "substance": "Naltrexone, Heroin, Alprazolam & Zolpidem",
 "bodyweight": "246 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "Naltrexone",
   "(pill / tablet)",
   "  T+ 1:00",
   "3.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 3:00",
   "  ",
   "IM",
   "Heroin",
   " ",
   "  T+ 3:30",
   "12.5 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 13:00",
   "  ",
   "IM",
   "Heroin",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54901",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 6, 2007",
   "Views: 17462",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A little background:</p><p>For the past 2 years I have been addicted to vaious opiates, namely heroin. Recently, my parents forced me into a buprenorphine (Subutex) detox program. Over the course of three weeks I tapered from 16mg or bup to 2mg. According to my doctor I was to wait ten days and then begin a daily 50mg dose of naltrexone (a potent opioid antagonist, aka. blocker). </p><p>My experience:</p><p>T 0:00 It had been eight days since my last bup dose and in order to leave my house my parents required me to begin the naltrexone. I felt it had been long enough and took half a pill to test it out.</p><p>T 0:30 I felt fairly normal and left home for a friends house.</p><p>T 0:45 I began to sweat. It didn't suprise me because I usually sweat a little.</p><p>T 1:00 I arrived at my friends house and was feeling a bit edgy like the beginning of opiate withdrawal. My buddy offered me three 1mg xanax pills which I swallowed immediately. These had no noticeable effect.</p><p>T 1:30 My entire body was sweating and my stomach was killing me. I believe the discomfort was more from the naltrexone itself and not opiate withdrawal. Opiate withdrawal is much more intense.</p><p>T 2:00 After talking with my friends for a bit I was feeling too uncomfortable to stay any longer and left for home.</p><p>T 3:00 Once I got home and tried to rest awhile I remembered that I could overpower the naltrexone by administering large amounts of opiates. Well, I gave that little thought before injecting 2 bags (approx. 60mg) of heroin intramuscularly.</p><p>T 3:30 All of the uncomfortable physical symptoms have subsided. I am not high, but feel back to baseline. I know that I will not be able to sleep one my own and therefore take an Ambien CR. This put me to sleep.</p><p>T 12:00 Upon waking I feel rested without the usual grogginess associated with Ambien.</p><p>T 13:00 I decided to test the effectiveness of the so called naltrexone blockade by injecting another three bags (90mg) of heroin. This puts me at ease and I feel slightly high. If I were to inject another two bags I'm sure I would get that warm comforting hug that only heroin can give me.</p><p>Conclusion: It is possible to overcome the blockade produced by naltrexone. However, all sources I have consulted advise strongly against it. Several weeks prior I injected two bags (60 mg) of heroin and got very very high. This leads me to believe that the seven bags I used over the course of this experience would have killed me if not for the naltrexone. I am sceduled to receive a Vivitrol (380mg, 1 month time release naltrexone) shot in a few days. I will not try this same experiment with the shot as I'm sure it would take a massive dose of heroin and would probably kill me.</p>"
}
