{
 "title": "You be the Judge",
 "author": "Slissbox",
 "citation": "   Slissbox. \"You be the Judge: experience with Nutmeg (ID 54906)\". Erowid.org. Mar 4, 2009. erowid.org/exp/54906",
 "substance": "Nutmeg",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 10:00",
   "30 g",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 10:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54906",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 4, 2009",
   "Views: 3024",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAt 4:30 pm this afternoon I was in the same place, doing the same thing I am now -- wasting time fucking around on the internet.  I stumbled across nutmeg and did some research.  Even though  the description said than most of the people that ate nutmeg didn't like it, I found the trip reports to be to the contrary.  Having nothing better to do in these dog-days of summer, and recovering from the previous night's excessive consumption of whiskey, I raided the spice cabinet, and found a brand new, 60 gram bottle of ground nutmeg.   I ate roughly half the bottle then and there, and hung out for a while.<br>It is now 2:30 am, I've been feeling the nutmeg for about 2 hours.  I find the nutmeg high to be kind of giddy and euphoric, kind of like eating a gram or so of shrooms.  I decided to finish off the bottle -- more on that in another 6 or 7 hours.  Tomorrow should be interesting.   I just found a fairly good-sized roach of some killer indica bud and smoked it all, which equated to about 7 hits, and now, I'm really blazed.  There seems to be a nice synergistic effect between the weed and the nutmeg, sadly I don't have anymore but I might smoke some resin later.<br>So, Ill tell you a little about myself.  Im a 20 year old college student/musician,<br>And Ive done just about everything, save for the designer chemicals and hard shit like meth and crack.  Ive tripped on everything but cactus and PCP.  I survived a horrible encounter with datura about a year ago and have since toned down a bit, and no longer mess around with shit like OTCs and sketchy poisonous plants.  The nutmeg is a unique experience, especially with being really blazed, but I have to complain of a slight headache.  Its really fucking with my short term memory, but I dont mind that.  Im gonna smoke a cig and call it a night for now, as its approaching 3 am. At this point in the experience its quite pleasant. <br>T+24 hours:  <br>I woke up today at about 3:30 pm, since I didnt fall asleep until about 6 of 7 in the morning.  All last night my mind was racing.  I couldnt stop thinking, which really annoyed me, and my muscles seemed to twitch a lot.  This was unpleasant.  It is now 4:30pm the day after, and I feel pretty much back to normal, except for the sleep deprivation. <br>My final analysis is that nutmeg didn't do all that much by itself, the actual buzz was barely noticeable.  Smoking some good weed while on nutmeg made it a little more fun.  After the weed wore off it was pretty much just a pain in the ass.  In the end it reminds me a lot of Benadryl --  a cheap, dirty high that lasts too long and doesnt really do much good.\n\n\n"
}
