{
 "title": "Dreamy, Confused Thoughts",
 "author": "Silly",
 "citation": "   Silly. \"Dreamy, Confused Thoughts: experience with Cannabis (ID 54939)\". Erowid.org. Sep 4, 2007. erowid.org/exp/54939",
 "substance": "Cannabis",
 "bodyweight": "116 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 54939",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Sep 4, 2007",
   "Views: 3135",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The other day, I went to an amusement park with 3 of my friends. When we returned, we decided it would be a good idea to go swimming at night at my friend Lukas's pond. Lukas is big on smoking pot. I had tried it two other times before, once over a year earlier and the other time about 2 weeks prior to that night. The first time I smoked, I took about 11 'hits' from a bowl and while packing another bowl I fell completely into a dream and started panicking, not knowing where I was. The last time I smoked though, I had not gotten high at all and I was dissapointed so I hoped this night would be better.</p><p>When we got to his house, we sat down in the basement, while Lukas and his friend Matthew played ping pong and the other girl Jessica and I watched. 5 or so minutes in, Matthew and Lukas decided to go leave for 10 or so minutes to go buy an ounce or so of weed. They gathered up 35 dollars and sent us to bring down water, a bubbler, and towels/bathing suits to the pond. About then our friend Mark arrived and waited while Jessica and I changed. Then we walked in the dark to the pond. We were having a bit of trouble walking through the brush in the dark, and Mark rescued us with a large flood light/flashlight and we went to go sit by the pond and wait.</p><p>Soon Matthew and Lukas arrived, and pulled out the weed while Mark felt it and estimated that the price probably should have been about 10 dollars cheaper. Then they packed the bubbler and started passing it around. Jessica decided not to smoke, but I did. I was the last in the circle of four that were smoking, and I managed one hit before the weed was kicked during the second time passing the bubbler around. They decided then to smoke a joint, and we sat there talking while Mark rolled the joint.</p><p>Slowly I began to stare off into space as they talked, and I began to catch snippets of the conversation they were having. Suddenly I realized that I had just said Jessica's name, but had no clue what I was talking about. I felt like I was dreaming, and started laughing uncontrollably. 'Jessica, its like I'm dreaming!' All the boys looked at me and started laughing. 'Dude, you're stoned.' Mark told me. 'After one hit??' I couldn't believe that I had gotten stoned after only one hit, but I could not pay attention long enough to keep wondering about it. I noticed that my tongue felt odd and I kept opening and closing my mouth. I decided finally that I had cottonmouth, and announced loudly one word, 'Cottonmouth!' then went back into my thinking. After what seemed like forever, we started smoking the joint. After it being passed to me twice, I opted to not smoke anymore seeing that I was already too stoned to function. </p><p>After the joint was done, Jessica and Mark got into kayaks and paddled out to a floating dock in the middle of the pond. I waded into the water, but refused to swim out to the dock because I seemed to be afraid to be able to touch the bottom. For what seemed like a long time, I stood ankle-deep in the water, stepping forward then backward again, trying to decide whether to go back or to swim into the water. When I realized what I was doing, I started to laugh at myself. Somehow, I finally swam out to the dock and sat with Jessica.</p><p>So that we could see, the boys on shore turned on the flood light and pointed it towards us. The light to me looked like a beautiful sunset, a world of black with one sole light and the stretch of the light casting across the water. I told Jessica and Mark, who had suddenly gotten there, that it was just beautiful, gorgeous in fact. Mark asked what the fuck I was talking about, and I became embarassed that I kept speaking out stupid things and then forgetting them, I felt as if I was trapped inside my body while waves of forgetfulness and dreaminess kept me from functioning properly on the outside. As we sat, Jessica was shivering against me, freezing cold. I noticed that I was cold too, but I could not actually feel it and I could not tell if I was shivering or not. Time passed in a series of getting lost in my thoughts, then coming back, saying something, then becoming embarassed as everyone looked at me funny.</p><p>The combination of darkness and the one light confused me and allowed me to have minor visual hallucinations, like seeing my friends that weren't really there, or actually having dreams that I could see while my eyes were open. At one point, I was awoken from my daze of dreams to my friends acting worried and scared because of some noise that was being made in the woods. To me, it sounded like an owl but to them they thought it was a cayote or something. Lukas was the one appointed to swim back to shore and turn off the light so that we could go skinny dipping, and he seemed very afraid. At one point the owl/cayote sounded again and he swept the light across the shore, and suddenly I saw a cartoon lion sitting there. When the light left that spot, the lion dissolved into pink. I screamed 'There it is there it is!' and Jessica told me to shut up. I promptly realized that what I had seen wasn't really seeing a lion and was swept back into my thoughts.</p><p>Some time later, while I was being driven home with Jessica and our driver Jen, I started watching the road and feeling like I was on a roller coaster. Every hill we went on, I shot up my arms, yelling 'Wee! It's just like the coasters we went on today!' I am not sure whether or not we were actually going fast, but I am still shocked at my reaction because usually I do not feel as 'tossed around' in normal driving settings as I did then. When I was finally dropped off home, I discovered that I had the munchies and devoured chocolate chips, trail mix, and grapefruit, then went to bed still stoned. My dreams were fitful and different than usual, and I woke up wondering whether I was still stoned or not.</p><p>What has not been explained in these series of events was how my reaction was different to those of the other kids with me. Everyone else seemed calm, and their remarks at least slightly intelligent, they were able to hold conversations. For me, I experienced constant confusion, and mild visual and auditory hallucinations. This was after only 3 hits. So far both my smoking experiences have left me as the 'event of the night', with everyone talking about my actions and remarks. In the end, I am completely embarassed by my actions and would prefer to smoke alone and be left to my abstract thoughts.</p>"
}
