{
 "title": "A Bit More Intense Than Expected",
 "author": "Phil K",
 "citation": "   Phil K. \"A Bit More Intense Than Expected: experience with Pharms - Nalbuphine (Nubain) (ID 54952)\". Erowid.org. Feb 28, 2007. erowid.org/exp/54952",
 "substance": "Pharms - Nalbuphine (Nubain)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 ml",
   "SC",
   "Pharms - Nalbuphine",
   "(liquid)",
   "  T+ 1:00",
   "0.3 ml",
   "SC",
   "Pharms - Nalbuphine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 54952",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2007",
   "Views: 10939",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI first caught wind of Nubain from a bodybuilder friend of mine who has experience with all types of drugs both psychoactive and performance-enhancing (anabolic steroids, HGH, etc). I told him about some persistent pain I was having in my back because of my job and the frequency of my workouts at the gym. I asked him if he had any good ideas for anti-inflammatories or painkillers and he offered me a vial of 'Nubain' for $100. As I have come to learn, Nubain is the modern painkiller of choice for serious bodybuilders suffering from chronic muscular and joint ache. Based on his description of its effects and my being relatively experienced with a number of psychoactive substances, I was open to try it both for medicinal and recreational purposes. \r\nHis size (5'10' 245 lbs) and tolerance had him taking about 250 IUs as his standard dosage. He recommended a significantly smaller starting dosage for me of around 50 IUs, injected into body fat, I chose the side of my stomach where 'love handles' form.\r\nSo after meeting him to pick up a 10 CC vial and a few syringes from a local drugstore I came home and disappeared to my bedroom for the night. Looking at the bag of needles and the little brown vial was like an old western movie showdown for me. I  put it on my desk and just stared at it wondering what sort of trouble I may get myself into with this new alien substance.  To hell with it, I thought, let's give it a try.\r\nI depressed the plunger, emptied the syringe, and just sat in my desk chair nervously, almost fearfully, awaiting some sort of immediate physical reaction that my body did NOT like what I had just done. Yet, no such sensation arose. In fact, nothing happened . I wondered if I had taken enough? My friend said it takes 10-15 minutes to set in so I turned on some Aqua Teen Hunger Force, knowing the episodes are about 12 minutes long, and hoped I'd feel something by the end of the first show.\r\nMaybe 10 minutes later, as Frylock, Master Shake, and Meatwad's antics came to an end, my body began to warm up. With my ceiling fan above me keeping me somewhat chilly, I felt as if someone slowly draped a warm blanket over my legs and upper body. Soon after, a smooth, vicodin-like head buzz washed over me. 'Ahh, this must be the nubain glow [my friend] described. I wonder if it gets better?' \r\nThe feeling was pretty uniform for the next hour. After getting bored I decided to inject a second, smaller dose. 30 IU and 15 minutes later the buzz intensified. Approximately an hour and a half after the initial injection, I now felt as if I had taken a few too many milligrams of vicodin. Nausea, light sweating, and cottonmouth now replaced the calm of the initial dose with feelings of apprehension and uneasiness. I noticed my breathing begin to slowdown. My first thought was to lay down, fall asleep, and forget about the experience. Images of me not waking up from a deep, opiate-induced sleep kept me wide awake. \r\nI had no interest in taking any other substances to calm me down or keep me awake because of my lack of drug-interaction knowledge with such a potent opiate. Instead, I walked to the kitchen and took down some bread, pasta, and gatorade to get carbs and hydration into my system. The nourishment improved my state considerably. I felt revitalized in minutes and confident that I could fall asleep with a much less-troubled mind. I returned to my bedroom, turned the cartoons back on, and fell asleep. \r\nThe next morning I woke up with the typical opiate-hangover: dry mouth, lethargic muscles, and my head feeling like a bowl of jello. I did have a minor headache, but an excedrin and plenty of water quickly cured that. \r\nFrom a personal perspective, I really don't have much interest in continuing usage of this substance. It is a bit more intense than I expected and unquestionably dangerous in excessive doses. It is not a social drug by any means, as it seemingly numbs your personality. From the literature I read online about it, it also contains opiate-agonists which are specifically used to combat opiate-addiction through causing a withdrawl 'crash'. I did notice the day after I was extremely irritable and slightly depressed with emotions reminiscent of my post-MDMA experiences. \r\nSo to sum it up, be careful with Nubain. Responsible, moderated use is a must with this substance.\n\n\n"
}
