{
 "title": "A controlled experiment in Salvia",
 "author": "xerxes",
 "citation": "   Xerxes. \"A controlled experiment in Salvia: experience with Salvia divinorum (ID 5495)\". Erowid.org. Mar 6, 2001. erowid.org/exp/5495",
 "substance": "Salvia divinorum",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5495",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2001",
   "Views: 20437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n     I had been reading up on Salvia and it's effects for some time, and decided to give it a try.  Salvia seemed to be right up my ally, a profound high, which lasted no more than an hour.  As I usually do when experimenting with new substances, I decided to make an experiment out of the situation.<br>     My first concern, was consistancy of the drug.  I chose to purchase my Salvia from the Lycaeum [erowid note: the lycaeum does not sell salvia, but the hosted site salvia.lycaeum.org is a large vendor], since it sells several different 'grades' of Salvia, and their extracts are standardized, so I knew exactly how much active principle I was ingesting.  I decided to first try their 'Extra Strength' standardized extract, which contains 40mg of salvinorin per gram of leaf, a hefty amount.  The reason for this choice, is the fact that you can buy a single dose.  I didn't want to make an investment just yet.  My 25mg dose came a few days later, and I immediatly opened the package, and removed the small gelatin capsule that contained the Salvia.<br>I chose to have a sober sitter present, to prevent me from going insane, since I didn't know exactly what I was in for.  I set up several perception experiments around the room, including a test for color perception, depth, periferal vision, balance, coordination, and reasoning.  I smoked the dose in one inhale, and was surprised at how harsh the smoke was.  I don't smoke cigarettes, and I use pot on rare occations, once or twice a year.<br>I held the smoke in for as long as I could, and then exhaled half of it, and took in clean air.  I held the rest as long as I could, and then exhaled it all out.  At first, nothing happened.  I felt ripped off, and disapointed.  But within 30 seconds, I felt everything closing in on me.  The first thing I noticed was a loss of balance and control.  Everything seemed fragmented, and I had trouble focusing my vision on anything.  It was beautiful, like a dream, the kind where you have to focus on something, like a test or a fistfight, but you just can't seem to see straight, like you're eyes are closed, but you can see through you eyelids, and the world flickers in blinking rythem.  All the tests I had set up were useless, I couldn't even understand how to take them.  The main part of the high wore off within 2-3 minutes, and I felt unbalanced, and wavey for another 15 minutes.  According to my sitter, I sat in the corner by the heater shivering for about thirty seconds, and then tried to go outside in the snow broken out in a clammy sweat.  This memory illudes me.<br>     My second experience came about a month later, when I decided to order a quarter ounce of raw leaf from the ...  My intent this time, was the chew the leaves for a longer, less intence experience.  I measured a 3 gram dose, and reconstituted it in warm water, and then stuck it under my tongue.  The taste was moderatly bitter, but not nececarily an overall bad taste, just annoying.  I chewed the leaves, and let them sit under my tongue for about 30 minutes, but I had no effects.  I was planning on doing a larger dose a few days later, but I was pulled over on my way home from work for having a tail light out, and the pigs didn't like the idea of a green leafy substance in a plastic bag in my glove box.  Now mind you, salvia is perfectly LEGAL, but, after I explained what it was, and that it wasn't a controlled substance, they decided to confiscate it anyway under the reasoning that they would 'test it for any illegal content.'<br>This is total BS, but what can you do.  It's not worth hiring an attorney over $30 worth of Salvia, not to mention getting the entire police force to hate you for making them show up in court.  It's been six months since this, and I have yet to hear anything from them.<br>My final Salvia experiment came last week.  I had ordered a gram of 'Regular strength' standardized extract from the ..., and proceeded to smoke it without any experimental equipment or tests, and without a sitter.  I don't have an accurate scale, so I measured out what looked like one hit, and loaded my pipe.  The thing that really amazed me this time, is that as soon as I finished hitting the pipe, before my lighter was even in my pocket, I was HIGH!  This trip was different than the first one.  I stumbled inside, and up to my bedroom.  I laid on my bed, and laughed, and laughed, and laughed.  I was in love.  In love with the world, and with this beautiful feeling I was having.  It was a dream.  I felt like my whole life had been a dream, and I was finally realizing that when I'm asleep, the dreams I have are just as real, if not more real, than the dream I was having while awake.  It's really amazing, how a drug can make you feel so at home, so comfortable with yourself.<br>In conclusion, I would like to emphasise the point that Salvia is a very intense high when smoked, but there is NO paranoia (I'm a very paranoid person).  The feeling it gives you is so fucking beautiful.  It's like being out in the cold night, and finally coming home to your warm bed, and your lover, and climbing in next to her, naked, but not in any lustful or sexual way, but just in love, and at home in you own cacoon.  It just seems so familiar, and very right.\n\n\n"
}
