{
 "title": "Holy Mother of Mary! I Won!",
 "author": "Green Dragon",
 "citation": "   Green Dragon. \"Holy Mother of Mary! I Won!: experience with Salvia divinorum (21x extract) (ID 54979)\". Erowid.org. Feb 4, 2009. erowid.org/exp/54979",
 "substance": "Salvia divinorum (21x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54979",
   "Male",
   " ",
   "Not Given",
   "Feb 4, 2009",
   "6323",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Earlier this week I looked at pages online about Salvia, thinking, I haven't tried this one yet. I am 49 years of age and have tripped on LSD, mushrooms, 2CI, and similar phenethylamine analogs. I can do large amounts of phramaceutical grade LSD and lecture intricately on the metaphysics of the Universe without losing my trains of thought. So I am at my bass players house and finished a large mediterranean styled meal and a few beers and a joint or two.</p><p>I mentioned I had read about Salvia this week and Max, my bass player said he had some. My son was there too and he and I have had many psychedelic trips together. I prefer his friends to friends in my 'age group'. Max went and prepared a bowl of 21X extract when I told him I was ready. Jason, my son, told me that some people complained about their clothes feeling heavy so I stripped my shirt off and went to the back yard to sit in the horseshoe of some pumpkin vines.</p><p>I waited till Jason came back out and lit the bowl and consumed the whole bowl and held it. In about 20 seconds the objects in my vision polarized and began to layer and the sense of vision went from my eyes to the center of each lobe in my brain. I mentioned 'The eyes in my head are starting to see differently'. Then..whammo!! First I had the impression of many large buildings growing through the vegetation that suddenly sprung up to replace the backyard scenario, walmart and kmart came to mind and then these smacked into a rapidly approaching backdrop of spin with a green, white and black structure of scaled and recursive energies.</p><p>A cocoon of what I term 'green dragon skin' began tightly vortexing around me and this incredible pressure of gravity spinning from right to left diagonally and I was being cocooned into this. I had no idea how I got there. That was all there was! I thought 'Am I dead?' NO!! 'Am I in hell?' NO!! I am trapped in this dimension and somewhere else is where I should be but this damned vortex of dragon skin cocooning me was keeping me there, perhaps forever. I am a martial artist and my instincts took over. If this was trying to spin me that way then I had to tumble in the opposite direction, to the right, backwards and up! I was told I rolled backwards and began somersaulting around the yard. The dragons skin was whipping by me at a zillion miles a second but I could clearly make out the scales and the specular highlights on the green scales delineated by the black lines. I was neutralizing the spin with my counterspins. At this point I must have stood up and out of the whirling matrix styles green scales Max's face, only his face, appeared. I was totally perplexed at first and asked him what he was doing here. he was grinning ear to ear so I figured he knew where the doorway out was. 'What is happening? Where is the exit?' I ask him.</p><p>Just them Jason's grinning face came into view and I thought 'This is my son. He is smart and will give me an answer! I can trust him.' So I ask 'Where am I???' I thought they had been in this dimension a while and were experienced in navigating it and would give me clues on how to deal with it. He tells me I smoked some salvia, I was holding his shoulders with my hands so he would not zip off into the vortex of the dragon cocoon. I looked at him right in the eyes which were still like looking at a tv screen in green with lots of horizontal noise. I told him 'Jason! I won!!!'  I was so fucking sure of it I was ecstatic. What I won I am not sure of. Death was to the left and down and I went right and up??  I turned to Max who still only had his face visible sticking out of the green vortex surface. I told him 'I fucking won!!'  I was starting to get back to 'this reality' and reeled around the yard smacking the ground with my fists like a great ape and shaking them at the sky yelling 'I fucking won!! I fucking won!!' cranking my elbow and pounding my chest with my fist and laughing my ass off.</p><p>Is the hard pressure and spin symbolic of the seed in the ground pushing up against the hard soils and the spin of the earth centered in its seed? Is the green dragon vortex the initiative flow of leaf making and stem configurement. Is this spin responsible for phylotaxis in the plant kingdom? Is this the mind or physical being/embodiment of Mother Nature? If I cohere the several distinct energies into a common experience I am led to believe I was in the dimension that the intelligence of plantlife exists in. It is aware of gravity, spin pressure and direction, the energies are definitively green in origin. Is this how it feels to emerge from the primordial into the world of things and objects and personifications?</p><p>I do not know anything for sure except 'I WON!!' Whew, what a trip pal. I am glad I did not 'lose' LOL! What I have learned about myself is that even when totally discombobulated I will remain connected to my core heart instincts which took over after my mind was ripped into another REALITY. I will not be dominated by any man or being.</p>"
}
