{
 "title": "An Experience Completely Contained Within Itself",
 "author": "duff",
 "citation": "   duff. \"An Experience Completely Contained Within Itself: experience with Salvia divinorum (ID 5497)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5497",
 "substance": "Salvia divinorum",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5497",
   "Male",
   " ",
   "Not Given",
   "Jan 16, 2002",
   "Views: 5954",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently took a trip to Madison, WI where I encountered a completely legal herb known as Salvia Divinorum.  'How strange', I mumbled as the hippie-looking guy behind the counter described or at least tried to the experience of Salvia.  My roommate and I bought a gram of it to try out.  </p><p>We drove back to our house in anxious anticipation as to the true effects of this LEGAL drug.  We eventually arrived at our destination and quickly filled our two and one foot waterpipes.  We each packed a full bowl, equalling exactly 3 large pulls of Salvia with average potency.  Looking at each other in anticipation we carefully took our first hits.  I felt a little strange, like I was being pulled out of my body from the back.  I held the hit in for about 20 seconds, blew it out, and hit it again.  This time I was obviously sliding to the right side (at least it seemed) and my vision was taken over by constant rows similiar to bowling lanes on both sides of me.  These 'lanes' where created by a constant flow of ONE symmetrical shape.  This 'shape' was transparent and it looked like the blueprint of my subconscious or something.   I can't say for sure how long I held my second hit in...maybe 15 seconds.  I cashed the bowl, taking the third hit, and set the waterpipe down.  Objects seem to evoke feelings of deja vu.  The salvia 'buzz' is an extremely strong 'pulling' sensation that is quite frightening as it seems so strange yet so familiar.  My roommate mustered out the words,' yeah, this is scary', as I just stared like a frightened animal into oblivion.  It faded away rather quickly (within 3 minutes) and we were just left sitting with our new experience in memory.  </p><p>We talked for hours about what Salvia did to each of us.  It is an experience completely contained within itself and to try and explain it is like seeing a place on the travel channel and wondering what it's like to actually BE THERE.  This herb is officially the strongest psychoactive that I have ever tried.  It really does blow my mind and take me into the inner workings of a world visited only through Salvia.  One thing that I should note is that we both used normal BIC lighters and many people advocate the use of butane and torch lighters as the active ingredient, salvinorin a, is consumed more readily with more intense sources of heat than a regular flame.</p>"
}
