{
 "title": "The Bass Note of Doom and the Mushroom God",
 "author": "Sven",
 "citation": "Citation:   Sven. \"The Bass Note of Doom and the Mushroom God: experience with Mushrooms (ID 54976)\". Erowid.org. Apr 6, 2009. erowid.org/exp/54976",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 54976",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 6, 2009",
   "Views: 3456",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis experience was my first with any psychedelic, and above anything else, taught me the importance of knowing your drug. \r\nI was in the middle of high school at the time. One of my good friends offered me mushrooms for a price I couldn't beat. For the past few weeks, I had been becoming more and more interested in psychedelic substances. After all, I had come very close to death not long before (incense fire in my room), and wanted to experience everything I could. So, I agreed, and made the deal to make the exchange the next day. He assured me I would only need one gram.\r\nThe next morning, I felt very nervous about the situation, but everything went off without a hitch. I had originally planned to take them during spring break, but I decided to take them sooner just in case, so they wouldn't spoil. That weekend, I made the 'now or never' decision.\r\nI opened the baggie, took out the mushrooms, chewed them up, and washed them down with a glass of water. The time was 2 A.M. My first thought was 'Why does everyone think they taste so bad?' Basically, they just had an odd texture. My next thought was 'What have I done?' That panicked feeling passed quickly, and I put on my headphones and laid down. I was listening to the album 'Ænima' by Tool.\r\nMy first noticeable effect was a small, spinning black triangle in the periphery of my vision at about t + 00:20. I was neutral to its presence. At exactly t + 00:31, I blinked and everything turned slightly furry looking. This intrigued me, but since this was such a small dose, this was nearly the extent of my visuals. \r\nNot long into the light trip, I began to feel panicked. I could feel my pulse rising higher, and I felt like I was having trouble breathing. I kept thinking it was either a heart attack or an allergic reaction, so I used my albuterol inhaler, and got a drink of water. This calmed me down considerably. I began to think how silly these feelings were. The low dose helped me throughout the experience as an anchor on reality.\r\nContrary to nearly all testimonials I had read by that point (which was very limited), the music I was listening to had almost become more boring than usual. I think more than anything, the nearly overwhelming body buzz had taken over any chance of auditory stimulation. I couldnt stop moving. I kept rolling back and forth on my bed and rubbing my hands together, which made me think of how flies rub their legs together. The rolling and moving felt incredible. I laughed a little at the interesting feeling.\r\nAfter a few minutes, my slight euphoria turned into boredom (I had stopped rolling around), so I decided to switch to the most psychedelic songs on the album, Pushit, due to the interesting trance-like tabla interlude, then Third Eye, which is a song filled to the brim with odd sounds and blatant psychedelia. During Pushit, I began to loose myself in the music, and began feeling the lyrics and taking them personally. This made me slightly on edge. Third Eye was fine until the low-frequency held-out bass note somewhere in the middle. That sudden low-end burst scared the crap out of me, and I could no longer listen to the music. The bad half of the trip had begun.\r\nI removed the headphones, and began to feel bad nausea. All I had eaten that day was a few pieces of pizza a few hours earlier. I ran into the bathroom and vomited. I looked at the mushrooms in the toilet, and began to feel as though the Mushroom God was trying to say Hey. Dont fuck with us, mortal. I began to pray to them to let me stay alive. I looked at myself in the mirror, but I seemed somehow far away. I looked down at the sink, but it, too, had shrunken away into the distance. I took a drink of water, then went and laid down on my bed. I felt sad and cold, partly because my fan was blowing on me full-blast in late winter. I looked up at my bedside table and saw a picture of my girlfriend, which made me feel depressed and sad. I began to miss her very badly, and at one point thought about what would happen if all my friends and family died. I tried turning on the radio to get my mind off of things. Pearl Jams Better Man was playing, which just made me feel more depressed, so I tried covering myself so I could try to sleep. That plan didnt last very long.\r\nAs I sat and vegetated in my decreasing depression, I began to hear voices in the distance, as though there were people in the walls or behind me. This scared me, so I sat up quickly, just to be sure. Then, to make matters worse, my cat started meowing loudly at my bedroom door. I began to fear both the cat and what I would see the cat as in my state. I ignored the voices and the cat and laid back down. I began to see a faint, translucent outline above my bed, as though there was an alien standing there looking at me. Surprisingly, I was very calm and indifferent about this. \r\nFeeling very worn out, I turned over and tried to sleep again. This time, I was prepared for the voices, and they didnt bother me. I had the distinct feeling that I was hearing a different dimension.\r\nI awoke at 7:30 the next morning with a very hung over feeling. I had a headache, and I felt as though I was unable to make my voice work. I felt almost as though I was still tripping slightly. I awoke so early to go pick out a new carpet for my room, which may account for the hideous reddish brown medium-length carpet I have now.\r\nOverall, I think this was an important experience in my life that changed my outlook on things in general. Looking back, my then terrifying experiences seem almost comical. However, certain things, like the voices and the primordial instinct to start praying to the Mushroom God, prompted me to really start thinking about the idea of psychedelics as a religious and cultural tool. In retrospect, I feel that I also should have done much more research before simply diving in, and could have taken several steps to improve my experience. I also should have figured out what species the mushrooms were, as they were quite potent for being merely a gram.\n\n\n"
}