{
 "title": "Overwhelming Body Buzz",
 "author": "Leithwalk",
 "citation": "   Leithwalk. \"Overwhelming Body Buzz: experience with Cacti - T. pachanoi & MDMA (Ecstasy) (ID 54978)\". Erowid.org. Jul 21, 2007. erowid.org/exp/54978",
 "substance": "Cacti - T. pachanoi & MDMA (Ecstasy)",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 g",
   "oral",
   "Cacti - T. pachanoi",
   "(liquid)",
   "  T+ 0:45",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "54978",
   "Male",
   " ",
   "Not Given",
   "Jul 21, 2007",
   "Views: 4943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have tripped on mescaline around a half-dozen timed before, using a variety of fresh and dried cactus.  I also have plenty of experience using MDMA.</p><p>The cactus was measured out at 75g per person for me and a friend.  Powdered in a coffee grinder, and around 1.5 litres of distilled water used to rehydrate it.  Some vitamin C plus the juice of a lemon and lime were added.  The mixture was put onto a low simmer for 2 hours, with occasional blending using a hand blender to break up the goo.  The cactus juice was strained through a handkerchief, the pulp re-hydrated with another 1/2 litre of water, re-boiled for one hour.  Tip: have a sequence of containers to allow some pulp to cool ready for straining.  The end product is around 1 standard-sized glass of cactus juice per person.</p><p>Set and setting: private home, no risk of unwanted interruption, relaxed.  Partner has never tried mescaline before.  Both are sober from other drugs at the outset, and experienced trippers.  I'd only eaten a bowl of cereal for breakfast and nothing solid since, parter had a meat sandwich at lunchtime.  Times are approximate, as there wasn't always a clock at hand (or wasn't in a state to appreciate what 'time' is).</p><p>T+0:00 (c. 5pm) We start to ingest the cactus, which took around 30 minutes.  Used a straw to sip on it and minimise contact with taste buds, and fruit juice as a chaser.</p><p>T+0:45 I take MDMA pill -- probably well under 100mg, from a batch that has been a bit speedy.  Partner is just on mescaline alone.</p><p>T+1:00 Start to feel the MDMA -- much quicker than usual.</p><p>T+1:30 Whoah, this is some come-up.  I'm just immobile lying on the floor, buzzed all over.  Much more intense than any previous use of MDMA.  Can barely talk or move.  Very speedy feeling, high jaw tension.</p><p>T+2:00 Feels like I've downed 10 pills, not one.  Too intense to be enjoyable.  Partner throws up cactus, I feel queasy.  I have never been sick on cactus before.  Loved-up feeling is dominated by the body buzz.</p><p>T+2:30 Both smoke a small joint each.  Hope to take away queasiness.  I'm numb and buzzed like crazy, but finally over the E come-up.</p><p>T+2:45 I purge my stomach contents, makes little difference.  Weed has set fire to the mescaline which now takes over.  Partner has another heave.</p><p>T+3:00 Start to get ego dissolution, strong OEVs.  Not as euphoric as normal, given the fight between the MDMA and mescaline going on in my brain.  Generally pleasant feeling, despite the buzz.</p><p>The next 2-3 hours are a bit hazy, I'm pinned to the floor and still tender inside.  Partner is less overwhelmed by the mescaline, but is clearly having a deep experience.  Partner takes a small amount of ketamine during this period, and describes the combo as very pleasant.  Both extremely relaxed and mellow, 'melt into the floor'.</p><p>Eventually around T+6:00 the come-down starts.  Not very pleasant, feel completely drained.  Dehydrated, body temperature is all over the place, headache, some residual nausea that makes it hard to drink. I can't sleep, semi-doze as best I can until late the following morning.  Trippy visuals carry on for far longer than usual.</p><p>That was by far the most intense drug experience I've ever had, and I could list off a lot of things I've tried.  Being knocked out on salvia, ketamine or nitrous are notionally stronger, but not so long-running and with a high body load.  I'd expected mescaline and MDMA to be additive, instead they were multiplicative, increasing the potency of each other to an uncomfortable level.  Too greedy by half!  They could be a pleasant combination at a small fraction of the dose, maybe 30g of dried cactus and 1/2 MDMA pill, but I'm not in any hurry to find out.  I think a 50g dose of cactus was also more pleasant and fresh cactus, although terrible to eat, was easier still on the stomach.</p><p>And boy, is my kitchen a mess of cactus to clean up.</p>"
}
