{
 "title": "In the Hands of the Universe",
 "author": "Tengu Shibata",
 "citation": "   Tengu Shibata. \"In the Hands of the Universe: experience with Mushrooms (ID 55043)\". Erowid.org. Feb 13, 2009. erowid.org/exp/55043",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55043",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2009",
   "Views: 2817",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My previous experiences with mushrooms were from very low-potent ones so I would consider this report a 'first-timer's' report. The only effects that I had in my two earlier mushrooms sessions were feeling a bit giggly and restless, and that could've easily been a placebo effect, which is absolutely nothing compared to this one.</p><p>To start off I'd just like to introduce myself briefly so readers can get a somewhat view of my mindset and background. I'm a 21 year old college student with no prior experiences in psychedelics but I have experimented different states of mind (meditation) so I believe myself to have a more flexible mind than the average person. I would also consider myself being not more than 'normally neurotic' so trying a psychedelic felt like something that I could handle. Ok, let's begin.</p><p>Me and my tripping buddy (named A from now on) had gotten just above 2 grams (dried) each earlier this day but they were different mushrooms, I can't tell which kinds they were but my 2 grams were said to be 'stronger'. We were on an outdoor party and I was excited about taking them but in the back of my mind I believe there was a slight anxiety. I wanted to take them during the day because of a more 'lightful' experience, but we ended up taking them at sunset. We both sat down on the grass and started chewing them. My buddy, who had taken mushrooms several times before, wasn't very patient and swallowed them fast. I chewed mine slowly and really sucked on it to get a more intense experience. I also had them on an empty stomach. I had tasted mushrooms twice before and it was the same old earthy not-so-good taste that I could handle quite well by now, allowing me to really chew on them for a long time. After finishing them I drank some water to get the taste out of my mouth.</p><p>15 - 30 min: I start feeling a bit weird quite fast. Must've been the empty stomach and careful chewing. I ask A how he feels and he says 'Ok, nothing yet'. We both lay down on the ground and I can see some thin patterns float on the sky. Colors are slightly more intense now. When lights (car lights and lamps) pass my visual field they linger for a few seconds before fading away. </p><p>30 - 45 min: We're now walking around in nature and I feel bouncy. We stop at some bushes to take a piss and when we're done I look at A. His head is slightly distorted and all edges of it are very sharp. When we walk towards the dancefloor a red energy flows past my feet and I stop immediately to have a look at it. It looks like a reddish barely visible transparent river flowing through my feet. My more experienced tripping buddy is starting to feel giggly now.</p><p>45 - 60 min: We arrive at the dance floor and there is a bombardment of the senses. Lights, sounds, people laughing and dancing. After around 10 minutes of dancing I start to trip more intensely. The lighting and sound is really fascinating and people are more goblin like. I hear a lot of laughter that sounds really bizarre, sort of like a mad witch or those stereotypical mental patient laughters. It's quite scary so I walk away from the dance floor and sit down to take a few deep breaths, A joins me. The whole experience is quite weird but I let go of the fear and everything becomes more 'happy'. The light show is very beautiful and the trees look almost like human brains. Visuals are getting more intense</p><p>60 - 80 min: We decide to go away from the music. Standing up after sitting down for a while is really hard and I feel like 250 pounds. The visuals are so overwhelming (one of many things I see is people are 'breaking down' to pieces) and the air feels so thick I can barely walk. It feels like something is boiling under my skin and anything I touch is shaking. It's not scary though, just genuinely weird and quite interesting. My friend A is laughing almost constantly but I'm having trouble laughing. For me the experience is more 'interesting' than funny, so I walk around with either a smile on my face or gaping open-mouthed with excitement. </p><p>80 - 250 min, I can't accurately describe the timing information for the next 3 hours or so because of some heavy time-dilation so this is a brief summary of the next 3 hours:</p><p>After walking around for maybe 10 minutes I just have to lay down, I see so many things that I can't safely move around in this physical world. My friend stays up and walks around enjoying the visuals while keeping an eye on me laying on the ground. This is where I really start loosing grip of time. It feels like an eternity but according to a photo my friend took and estimates of the onset this episode is around 3 hours.</p><p>I stare at the sky and it's exploding with spiraling colorful fractals. I feel a totally amazing connection with the universe, I start to grasp its infinity and how small we really are. When I close my eyes I travel into another dimension. I feel sort of merged with my new dimension and there is no way how this can be described in words. The experience is so profound and enormous that I start to loose myself. I can't understand what I'm doing and I'm starting to feel dizzy. My mind is thinking along the lines of 'This is the answer to everything. Am I now stuck in an infinite space? How will I ever come back to reality?'. I start having negative thoughts and my mind is caught in a loop, 'Am I going mad?'. I'm dwelling on this single thought for what feels like hours but it was probably just minutes, sort of like a stuck CD-player repeating a sample over and over.</p><p>Eventually a part of me starts thinking rationally and convinces me that I am not going insane and that I need to stand up. I can barely stand up but when I do I get an enormous energy boost and I can now easily run. I run on a nearby field with my arms spread feeling like a bird traveling at very high speed. The earlier full-blown, totally dominating open-eye visuals are more toned down now and I can see things that actually are there in real life, making me comfortable running. The hallucinations are still very strong though, with a fire red sky and exploding firework-like effects around me. </p><p>250 - 350 min: I'm not sure what happens next but my friend A leaves me and I lay down to rest. I'm quite far away from any light source now so it's very dark. I close my eyes and there is some really scary laughter going on. I get stuck in another mind loop where I start wondering who I am. I'm not really sure about the answer and I feel very empty and dizzy. I struggle hard to break this line of thought and after around an hour I open my eyes and slowly sit up. I'm not totally sure about this part of the journey, it feels like a black hole to me.</p><p>The trip was still quite intense up till the part where I opened my eyes and sat up. Now it's pretty much like usual except an accompanied weird feeling. Memories of who I am start coming back but I'm not sure my friend A actually exists. Eventually I meet him and we have sit down and have a chat about what happened.</p><p>All in all this was a mind-blowing experience and yes it's been said before but you really really need to have respect for psychedelic drugs. I thought I was prepared but this was far more intense than I could imagine. The dose was also a bit too strong for a first-timer so make sure you are aware of the dose, especially if you're quite light-weight like me. I should've started with around 1 grams, and not +2g. But I don't regret taking the mushrooms, just feeling a bit remorseful about taking such a strong dose for a first time. Despite some bad and frightening moments I still think I can learn something from them, and the spacey part of the trip will definately be an enjoyable memory for life.</p>"
}
