{
 "title": "Should Not Have Taken So Many",
 "author": "mushroom michael",
 "citation": "   mushroom michael. \"Should Not Have Taken So Many: experience with Mushrooms (ID 55063)\". Erowid.org. Sep 13, 2009. erowid.org/exp/55063",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "5.6 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55063",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2009",
   "19943",
   " "
  ]
 ],
 "report": "</p>\nErowid Note: There is a slight discrepency in the reported dose of 8 grams, and the arithmetic-derived dose. Author reports acquiring 1/2 oz (14.17 grams), eating 1/8 oz (3.54 grams) one weekend, then first 5 grams for the experience reported here, followed by the remainder of the 1/2 oz., which would be ~5.6 grams, for an approximate total of 10.6g (rather than 8g).</p><p>So, I had just obtained a half ounce of shrooms. I took an eighth of an ounce on sunday night and had an out of world expierience, but it was nothing compared to what would happen next. </p><p>The following friday A friend and I went to a B-bq and were totally sober when we took our mushrooms. My friend took maybe an eighth of his own shrooms while I took maybe 5 grams of my 1/2 ounce. We walked to the movie store and grabbed Pulp Fiction and Tim burton's Big Fish. We walked home and started watching Pulp fiction. I felt nothing until the classic opening song, Miserlou\n</p><p>We decided to stop watching the movie and i walked into my room with the walls rippling and pulsating and then put the rest of the mushrooms in a ceramic mug and ate them all. First, I changed my shirt and then went out of my closet to find my friend with enormously dilated pupils. I told him and helloked into the mirror. He turned around with a devilish grin and crouched down hopping as a frog. For a a few seconds he really transformed into a frog. Once this odd transformation had ceased, we put on dark side of the moon. I saw gyrating patterns similar to a kaleidascope of all different colors on the ceiling and my mood changed rapidly to a perfect, jazzy calm. </p><p>Soon after this, I think the rest of the mushrooms kicked in because I went into the living room in awe due to ceiling fan that was sucking me in to an inversed abyss of color. I layed on the couch and fell into a complete hallucination. My kitchen grew three enourmous eyes above the cupboards and the island table rose up to meet their gaze. I looked at my computer and it was a big boulder perched on one of those weird plastic tables in pizza boxes. I closed my eyes only to find that i was thinking in french. I tried to change back to think in english but then lost all train of tought and began seeing asian sounding noises shooting across my sight. This is the really extreme part: I then tried to open my eyes only to find they were already open. I got off the couch that now had changed from a dark olive green to a brilliant white and went into my spacious living room enshrouded in my comforter that i thought was my hair. Once I got into the living room, i found myself in an endless desert with stars, multi colored cactuses and everything. I layed down on the floor and stared in to the seusslike sky. </p><p>It was black with bands of bright colors flowing through it at a mollasses pace. I travelled with my mind across the entire desert and to an oasis. There is no possible way i can raconte the rest of my trip because it is much toO mind boggling. </p><p>PERSONAL LONG TERM EFFECTS: </p><p>When im sober, I still hear noises that cant exist</p><p>The sky sometimes has a neon greenish tinge to it </p><p>I do thigs that cant be explained such as throwing my phone on the ground and continuing on without realizing what I just did</p><p>I get extreme light headedness that lasts 2-5 minutes if i stand up too fast</p><p>Sometimes I space out when im sober for 2-3 hours </p><p>I laugh for no reason at all</p><p>I was brainfried for a week</p><p>The mushrooms were very fun but i dont think I should have taken so many, especially since im only fifteen. Im been taking a break from shrooming for a while now because my friends said i should let my brain recuperate but i cant wait to do it again.</p>"
}
