{
 "title": "Weaving a Story, Drawing a Graph",
 "author": "Z-Person",
 "citation": "   Z-Person. \"Weaving a Story, Drawing a Graph: experience with Nitrous Oxide (ID 55061)\". Erowid.org. Mar 11, 2010. erowid.org/exp/55061",
 "substance": "Nitrous Oxide",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55061",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 11, 2010",
   "Views: 4985",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was a bit bored so I decided to try a charger of nitrous, it was the most amazing nitrous experience Ive ever had. I charged up my cream whipper and hyperventilated for a few seconds, then inhaled deeply. I hit me instantly. I could hear Startrek esque sounds as I was going deeper and deeper under, a sound like a ricochet, or a space ship. But with gears, on the way up it went up a gear, and as I came down it went down a gear. When I was completely sober the sound of cars going past the window was morphed in such a way it sounded exactly like that sound. Also I saw a green/yellow pixilate when I came out of the nitrous induced state.\r\nDue to that last experiment into solitary nitrous oxide use, I decided to try using 2 chargers at once. I mustve been completely knocked out, I had utterly amazing hallucinations. Unfortunately I cant remember the bulk of them now. But I woke with the same sound, and it began with the same sound. Also the whipper was left on my face with still some gas left, I really do think I was unconscious. The hallucinations had something about the desert, and when I was waking up I remember a family waving good-bye to me. Its like I was shot into oblivion and then pulled back again. Oh and of course this is all very comfortable, innocent and euphoric.\r\nI go on to repeat this a few more times, the hallucinations get even better. Im noticing the reverse tolerance. I have a pattern, which seems to correspond to all the trips. Every time its stronger. In the trip on the 8th charger the graph of the trip got so unbelievably beautiful. 9th even better! Im making sure that the 10th is my last however. Each time it gets exponentially more detailed. Its absolutely amazing, and I really want to do an 11th, but I mustnt. Or Ill soon finally find myself using a lot daily! Its the most psychologically addictive thing since the snooze alarm. It fills me with a complete sense of utter urgency requiring me to take more nitrous, just to hear the next part of the story.\r\nThe nitrous tells a story in its trip. It shows me a pattern, a graph of infinitely intricate detail. Each and every detail in the graph corresponds and seems to pre-empt things that I hear or see or do. I.e. if the song Im listening to has a symbol crash, BEFORE I hear the crash the graph spikes.\n\n\n"
}
