{
 "title": "Shades I've Never Seen Before",
 "author": "Phanerothyme",
 "citation": "   Phanerothyme. \"Shades I've Never Seen Before: experience with LSD, Cannabis & Melatonin (ID 55079)\". Erowid.org. Jun 1, 2007. erowid.org/exp/55079",
 "substance": "LSD, Cannabis & Melatonin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 8:00",
   "3.0 mg",
   "oral",
   "Melatonin",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "55079",
   "Male",
   " ",
   "Not Given",
   "Jun 1, 2007",
   "Views: 4741",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a fairly average, 19 year old male. Prior to this experience I have achieved effects with the following psychedelics: DXM, nitrous, cannabis, morning glory, salvia (10x), Amanita muscaria, Hawaiian Babywoodrose, and an ayahuasca analogue. Out of the serotonergic psychedelics, I would say ayahuasca has given me the most powerful experience. The experience wasnt weak by any means, but it didnt really reach the places ayahuasca took me.</p><p>Ive been interested in psychedelics for a few years now. Ive never had much in the way of connections, so the common street psychedelics have for the most part remained out of my grasps, that is until this experience. So when my friend (lets call him G) called me up and asked me about doing LSD that night, I said sure. It was a moment I had been seeking for quite a long time and I was really not even that nervous about it.</p><p>While they are good friends, I am not really close friends with L, G, and B, and I wouldnt say I feel 100% comfortable around them all the time. The setting wound up creating an amazing time, but it was surely less then ideal as far as the good set and setting type of ideals for psychedelic experiences go. Also, some driving while tripping occurred. Its an extremely stupid and irresponsible thing to do and no one should ever do it, but in this case I didnt feel like I had much of choice but to get in the car.</p><p>I had been in my normal mood all day, I wouldnt say happy, but content. I was a bit excited upon finding out about the opportunity that awaited me, but I was surprisingly (even to myself) nonchalant about it. So at 8:30 pm, me and three friends (L, B, and G) set out to meet Ls friend (A) who could get the acid. It took a little while, but A managed to get it and squeezed in the car with us. The LSD was in a small bottle of breath mint drops and we all put two drops on our hands and then licked them. For some reason I was not that anxious about it, I suppose I felt I was prepared enough by my previous psychedelic experiences and that I probably wouldnt trip that hard.  That was maybe around 9:30. We went to pick up some weed for the night, and ended up with As friend C coming. C was not going to be tripping. After what seemed like forever (maybe 10:20) we were at the field we had been planning to start the night at. C, L, and A all rolled some blunts and we started passing them around.</p><p>I tried not to smoke to much because I didnt want to alter the experience, as well as the trip was just starting and I had no idea how intense it was going to be. When we finished smoking I would say the trip really began. B just kept walking around, saying he couldnt sit down. L and G were sitting around, laughing at random things. C was working on the beer he had and A would go between talking with everyone and wandering off. I felt energized, muscles tight. I couldnt help smiling, and my teeth were clenched firmly together. I went between walking around in circles and sitting down. I felt natural and comfortable inside my body, but the body buzz itself was a little uncomfortable. We were all standing/sitting/walking-little-circles around making jokes.</p><p>Visuals effects were just beginning to surface, the sky seemed enormous and I was seeing patterns here and there. The texture of the stone bench was swirling around and the dirt was covered with a small geometric pattern that repeated itself every two inches or so. B kept insisting that the ground was covered with bugs and he said they were getting on him. L and G agreed with him that the ground was covered with millions and millions of insects. </p><p>B and I decided to just lay down in the grass. The clouds are dancing, commented B, with a hint of tension in his voice. When I looked at the clouds, they were not really morphing in any way, but the seemed complex and vast, somehow beyond my comprehension. I felt physically centered and at ease while sitting there. My body felt like some sort of object, rather then just my body. Mentally, I was sped up, but the alterations were only moderate. I had gotten up and was thinking off in my own little world when I heard someone say What was that?.  I began to listen and heard a sound like something smacking into the ground. Everyone jumped, and then began to timidly approach the source. When we got reasonably close L yells,  its coming after us and I saw some small creature leaping our direction. We all ran terrified but laughing. I still dont know what it was or if it really even existed, but I remember at that point I had thought to myself, this is going to be quite a night. </p><p>A, who I had never met before, was a great person to be around. I had been thinking that running around sounded great for a little while when he said we should just run. We never did do it, but he convinced everyone to take a walk which I thought was another great idea. When we were all standing in the middle of the field A said,  there something over behind the trees.....look now and suddenly there were three bright flashes of light shooting up from behind the trees. It was a bit freaky, and I would say things really began to pick up here. B seemed to be a little confused. He would often say things like, its only been two minutes, or, whats going on. I dont think anyone really knew what was going on, and the time dilation was extreme. Perhaps the idea that each minute seemed to take an hour, and he was going to be like this for at least a good 6 hours was a little much for him. Whatever is what, I think this was the start of what turned into a bad trip for him.</p><p>I was often paranoid because cars would keep driving around the street surrounding the park. For the most part, the only people who drive on that road are cops and those up to some sort of nefarious activities. Cops dont come by very often, but they have before and I really didnt want a confrontation in the state I was in. I think the others were thinking similar, and everyone just wanted a change of scenery anyway, so we decided to go somewhere else. We all walk over to the car to attempt to leave. We got in and back out three times because L really just wanted someone to finish the two 40s that were left, while A said just leave them behind. During all of this B had been saying Where are we going and Why? No, we cant go somewhere. Eventually we got going around 11:00, with L driving.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>I have no idea how L could drive so well, but he did. The windows were down and I could feel the air rushing into the car, it felt amazing. We quickly found a parking lot and pulled into a spot, and it was like I suddenly found myself outside again. So we started walking down a street. The intensity was still building and I kept reminding myself that where ever the drug takes me, I have to just go with the flow. G noticed that if we continued straight, we would be walking right by a police car. Probably for this reason, C suddenly decided to climb this rocky hill we were passing, and everyone started to follow.</p><p>I was apprehensive because across the street I saw a person sitting on a chair that seemed to be some sort of security, and keep in mind there is a cop car on this block as well. B kept insisting that we couldnt go up this hill, and I had some serious doubts that it was a good idea, but we all went anyway. I wouldnt call it peer pressure, it was more like not wanting to be alone in the city around cops and security tripping hard on acid for the first time. Climbing the hill was great, it was like Im really not sure if this is a good idea (legally) and Im really disoriented, but Ill just go for it and make the most of the experience. The feeling of jumping up on each stone ledge and really using my body felt great.</p><p>Once we reached the top of that hill, the intensity started to catch up with me. I said to myself, Why should I feel good right now? I really might lose control and my surroundings may become overwhelmingly frightening. My heart began to pound, I could feel it throughout my whole body. Anxiety was attacking me from everywhere. The trees and grass around me started to look terrifying and the contrast of my vision was greatly increased, darks were incredibly dark and brights were too bright. This occurred over about 10 seconds, but I managed to accept the distorted reality in which I was going to be stuck in for the next few hours and told myself just to calm down and the anxiety went away mostly.</p><p>So with some more walking and climbing, we find ourselves on top of a cliff-like rock. B asks if its ok that we are up here and A assures him that he tripped up here for hours before and was fine. After a little while, C says Im gonna go, Im not tripping. We all say bye and he leaves. Everyone continued sitting, just staring and thinking, not saying a word. Sitting up there, I could see the guard and the building that I saw earlier, as well as the river and some highways. The security guard seemed to be a mile away, and somehow on a different plane from myself. Everything was skewing and out of proportion. Eventually we got up to leave and we saw the security guard go inside the building. G said He might call the cops, we should go, and so we did.  </p><p>We walked down off that hill and down this slim rocky slope onto a bike trail going through an area where they are beginning construction. There was an opening in the fence of the construction area, and G led us into it. I did not think this was a great idea, as it was very unlikely that things would turn out okay if anyone of any authority saw us, but I once again followed. B had been repeatedly going through his contacts list on his phone saying, I want to call someone but I dont know. I could tell the experience was more then he expected or wanted, and felt like he was really in over his head. With the setting we were in, I can definitely see why.</p><p>We walked for a while and came upon some stairs leading to a little walk path right along the river. It was around 11:40 when we went down there and found a nice ledge to sit on right at the edge of the river. It was a nice view, the river shining back reflections of the citys bright lights, illuminating the tree lined riverbanks, and several layers of highway twisting behind that, the occasional car going by, lonely and oblivious. And above it all was the infinite night sky, the essence of space. The images of trees reflected in the water danced amazingly crisp over the rivers gentle flow. The light bouncing off the water wavered on my white t-shirt. </p><p>Color fields were changing in random sections of my vision, sweeping across like a blanket and eventually changing the hue of everything. At some points, it seemed as if someone had flipped on a negative exposure switch in my mind. I would also like to mention I am color-blind (not to bad, I have a hard time seeing the red in colors, like purple and brown, making them seem like blue and green) and I believe I was seeing shades that I have not perceived before. Though my mental state was severely altered and I am not sure of that. Every so often I would become entranced enough that I did not recognize the things I was seeing as being from this world.</p><p>It felt like my normal self had been condensed and was more of a concept. I knew that my self consisted of many different aspects, but on acid that normal self was simply reduced to the concept of my normal self. Throughout the peak, I felt that I had to keep reminding my concept of self to just let things be, as I was very paranoid of being caught and was generally struggling to figure everything out. B was still looking at his phone. Periodically, one of us would try to talk to him and ask him what was wrong. When I asked him whats going on, he gave me a hopeless, I dont know man... How are you doing?.</p><p>I really wanted to help him, but it was a bit difficult in the state I was in. I told him Im just letting things go as they go, not worrying and taking it as it comes, you know. He just sort of looked at me and I could tell it wasnt helping him. I really didnt know what I could do. I had realized that the minds possibilities are infinite, but thats all it is, my mind. My mind can be put into places where I can feel pure sadness or discomfort, but if I realize that its only within my mind, and those things dont actually exist, then I can get past it. But at that point, I did not really have anyway to communicate that, and Im still not sure if it would have even helped. </p><p>We eventually decide to leave that area and head back to the car. As we were walking out and the gate came into vision, I was extremely excited. All of the solution to my paranoia and inability to fully enjoy the trip were on the other side, and I couldnt wait to get out. Reaching the gate, I found a section the we could squeeze through, upon getting out I felt a great surge of relief. It wasnt over though, we had to survive a car ride. We made our way back and everyone got in, L started the car. I buckled my seatbelt and hoped for the best. </p><p>The radio came on, playing the song Black hole sun. We started to drive and the music was hitting everyone full force. I think things turned a little for the better for B. He commented how good the music sounded and the force he could feel in it. We all laughed and decided that it was a great song to start the drive with. After some discussion, the plan was to drop A off home, and then go to Wawa for food. We dropped A off and headed to Wawa. I thought about how crazy it is that A just randomly decided to do LSD with four guys that he only knew one of, and he had class pretty early the next day. I really enjoyed his presence though and thought he was a great guy.</p><p>We arrived at Wawa, and everyone except B went in. I went in and decided to look at the beverages trying to act as normal as possible, but my mind was racing. I couldnt keep a thought for more then four seconds and that lead to my spacing out and standing around looking at nothing. I eventually decided that an orange sounded really good, and on the way to the cashier picked up some gum that I figured would help with jaw tension. I tried to total the price in my head, but it wasnt possible so I just decided to hold the four dollars I had in my hand and wait for how much it was going to be.</p><p>When the man in front of me was paying, I had a moment of empathy for the man and cashier. I felt the mans insecurities about his weight and appearance. I saw the cashiers frustrations and boredom of being stuck doing his job for hours. I saw how they were just two completely different people, interacting on a mutual level. Normally when I see a person, I really only see them at that moment, and I often dont know what they are really feeling or thinking. Everyday interaction seems to take place between me and people. But this time they werent people they were individuals.</p><p>Eventually its my turn, the cost comes around to $2.30. After what Im sure was a noticeably long period of time, I figured out to hand him three dollars. I waited for the change and then a receipt. Apparently he just threw out the receipt instead of giving it to me, because I waited and there was an awkward yeah, thats all type moment. So I took me things and went back out to the car.</p><p>I was the first back, and I got in telling B what I got. I wouldnt say he was particularly enjoying his trip at this time, but I dont think it was bad. I start to peel the orange. Realizing I have no place to put the peels, I just start to pocket them. I couldnt wait to finish peeling before I took my first bite, and it was a good bite. I devoured the orange, but in doing so covered myself in orange, but I really did not care. I took the orange peels out of my pocket and threw them out the window, they are biodegradable after all. Its around 1:15 and G figures no one will be up at his house to so we go there.</p><p>At Gs house we go into his living room and turn on the air conditioner, as it was very hot. B lies down across a sofa, and G turns on Playstation and sits in a chair. L and I sat in the back of the room on a sofa, L eating the meatball sub he bought and I just taking everything in. After some times B asks, like.. Are you guys still feeling it?. Everyone gives him a hell yeah and the decision is made to listen to some music. G put on some new Thom Yorke tracks that I had never heard before. The music was very odd, but it was so great and it made me wonder how he could be such a genius musically.</p><p>So after some music, G puts on the movie Clerks. I dont like movies for the most part, so I didnt like this idea that much, but I was down for whatever. After maybe fifteen minutes of that, no one had the attention span to watch it and off it went. The next plan was to play some video games while listening to music. After a while of this, I see its about 3:00 am and decide to go home. I tell everyone bye and start my walk home.</p><p>I walk down the street realizing that its not exactly normal to be walking around at three in the morning, something I hadnt thought about earlier. I heard a car pulling up behind me and wondered who would be driving around at this time. As it passed by, I believe a young guy yelled, you better watch that dog behind you at me from the back seat. I looked behind, and of course, no dog. I dont think he said that at all, and probably wasnt even talking to me, my paranoia was getting the best of me. I continued walking, looking at the ground. I noticed how foreign and odd it seemed, it didnt seem anything like the ground I was used to walking on. Probably from the time we had gone to Wawa, I had felt the effects were winding down, but I realized that they were still strong. I reached my door, key in hand, and began to work at the locks. Not too difficult, after a minute I was in and quietly went into my room.</p><p>At this point I was truly relieved of all stress, I had made it back to my home safe, no injuries, no criminal record, and my sanity intact. I got changed into comfortable clothes, smoked a bowl of cannabis, and lay in bed listening to Pink Floyd and Radiohead. I knew sleep was going to be impossible, but I became really restless and couldnt even lay in bed. For the next few early hour of the morning I went between playing guitar, listening to music, writing an email about the experience to a friend, making tea, and attempting to write down some thoughts (turned out nonsensical and mostly illegible, though one sentence read you analyze yourself too much).</p><p>At one point I took a 3mg melatonin to try to calm down the energy feel. I did feel the typical melatonin drowsiness a little, but it really didnt do much. When I was listening to music in bed, I experienced some very strong visual effects. With my eyes closed there were rapid vision of morphing faces and geometric shapes. At one point it was like I was descending through some sort of cavernous tunnel and all of the surroundings would morph into some disturbed looking face, though it didnt really bother me.</p><p>With my eyes open, I saw what looked like a gate next to my bed. It was black and had vertical bars with ornamental shapes in the middle of the bars. The gate would begin to flip and twist, and open up inside itself, seeming to move through dimensions of spaces deeper than those that we can typically perceive. I was extremely impressed by this, it looked so vivid and realistic, I did not know LSD could cause hallucinations so real looking. I looked into a mirror and at first everything was fine, but the more I stared my face began to distort and take on an evil quality. I decided to stop looking before it really freaked me out. I also believe I was having a lot of aural hallucinations, as I constantly thought I heard someone walking by my door, or something creaking. </p><p>At 8:15 I went into my kitchen, made a sandwich, and poured a glass of milk. The sandwich had so much texture and depth. I could taste each little air pocket in the bread, and all the little particles of chicken and cheese that made up each bite. Each gulp of milk was incredibly filling and refreshing, the texture was so smooth. After that I just did more random things until 1:10, when I began writing an outline for this report. At that point I was still feeling light effects. I went for a bike ride at about 3:30 that day, and while riding I noticed I was still seeing patterns in the ground. This was sixteen hours after I had taken the acid, and from what Ive read thats not normal. But my  Hawaiian Baby Woodrose trip lasted for a solid twelve hours, and I dont believe that is normal either. I guess my body chemistry is a little different from most. At around 6:00, I really started to crash, and by 7:00 I was asleep. I woke up the next day at 9:30, completely refreshed and feeling 100% normal.</p>"
}
