{
 "title": "Strong Peak",
 "author": "Brian",
 "citation": "   Brian. \"Strong Peak: experience with Coleus (ID 55102)\". Erowid.org. Nov 6, 2007. erowid.org/exp/55102",
 "substance": "Coleus",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "buccal",
   "Coleus",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55102",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2007",
   "Views: 27576",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At exactly 11:30 last night I put my mass of 10 large and 10 small Coleus leaves in my mouth. Large leaves are probably 1 inch wide and 2 inches long, with small leaves being halved in both dimensions. I had found the plants in pots on my back porch, my Mom grew them for the coloration. The leaves had been semi-dried on my windowsill for two days, but North Carlina has downright soggy air, so the humidity only allowed for the leaves to crumple a bit, they were still fairly juicy. </p><p>The quid was bitter, but I held it in my cheeks and under my tongue, chewing periodically, while I took a shower and read Noam Chomsky. At about 20 minutes, reading, I felt a slight kind of 'fullness'(?) in the front of my head.  This had happened a few days ago as well from simply absent-mindedly chewing and eating a small stem. The stem is very juicy, so I think there might a higher active chemical content there? This came and went for ten minutes until I stopped reading. At 12:05 I swallowed the quid, very bitter. Washing it down with water though, there was no residual aftertaste, which was convenient. I may add that the stem I chewed earlier tasted good. Might be a good addition to a salad. </p><p>There after I had a very nice relaxed feeling. I felt like I could just relax and sleep all night. The past two nights I hadn't been able to calm my mind and anxiety (I recently came off my anti-anxiety drug, Busiporone [Buspirone], I think is the chemical name.) Coleus helped markedly with this. However, I masturbate a lot and had decided that I wanted to before I chewed the Coleus. Despite the Coleus, I couldn't shake the urge, and I was curious to see what it would be like. It was difficult, couldn't really get excited or correspondingly hard, but I ultimately finish. The climax was actually more euphoric and greater in volume. Very wet tissue. I wouldn't use this as a sex enhancer though. It makes me really work for it. After this I was filled with just a very pleasant relaxed feeling. I meditated some on it, just feeling good. It is a very good meditative aid. My mind was uncommonly clear and empty, so I could just focus on my feelings. I turned on Beethoven's Ninth Symphony, and it wasn't greatly improved, though I never have much liked that version of it. After hearing Leonard Bernstein's version, none other will do, so this may have been a poor choice of music. </p><p>Getting up to pee, I noticed that in the dark lights shine a bit more brightly, and dim lighting had a somewhat greenish-yellowish tint cast into it. When I turned on the lights my vision flickered, going from dark to bright a couple times. Very odd, not unpleasant. At about 12:20, while meditating the peak came in an abrupt wave. I felt myself getting warm, my heart speeding up, an odd kind of apprehensive euphoria, and a dramatic floating sensation. I saw a kind of outline of two small Native American-style gods' heads floating around behind my closed eyelids. This state lasted maybe 30 seconds, if that. It was nice. Two more similar, but weaker waves came after that in about a ten minute span. The waves felt a great deal to me like the body load from salvia, which for me is very pronounced, though welcome. After the peak, I abruptly fell off, and was back to the previous night's psuedo-insomnia, ultimately taking maybe two or three more hours to fall asleep.</p><p>Coleus could be really powerful I think in an extract form. I also want to eat a higher dose and them smoke some salvia extract while on it. I think they would complement each other nicely. At college, maybe I can make and smoke an acetone extract of an entire plant.</p>"
}
