{
 "title": "The Gods Have Forsaken Me",
 "author": "Trick",
 "citation": "   Trick. \"The Gods Have Forsaken Me: experience with Salvia divinorum (15x extract) (ID 55128)\". Erowid.org. Apr 9, 2009. erowid.org/exp/55128",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55128",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 9, 2009",
   "Views: 14334",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSalvia is a substance I have had experience with in the past. In fact, the friend who described it to me inspired me enough to try it, and I had never tried any other drug before. After experiencing salvia, I had experimented with a few other drugs, but I have never experienced anything like I did today.\r\nToday, I was with a friend of mine jamming in our jamroom and we were bored. We sat around and we finally figured we'd go buy some salvia from the headshop. I wanted him to try it because he had never tried it before and I wanted to see how he'd react to it. We thought it'd be fun. Well, we ended up doing it 3 times today. The first time we were in his room and we had the typical weird experience people often describe. Then we did it again later that evening. Then we met up with some other friends because we told them we had salvia and they wanted to try it.\r\nSo my friend, and 3 other female friends were all sitting on the curb outside my friend's house. All of them but myself were having fun with it and I was reluctant because I had already done it 2 times and felt I had enough of a trip already. But finally, after my friends had such magical experiences on it, I decided I'd try it one last time. It seemed as though this particular setting was giving off significant visual alterations. This time would be the most intense experience of my entire life.\r\nLet me lay down the setting for you before I begin describing the experience. It was about 1 am. One of our friends car was to our right and we were in a circle like a typical circle of friends. 3 of us, including myself, were sitting on the curb, my friend, who we'll call Roy, who's house we were located, and my other friend, who we'll call Julie, were standing on the street in front of the 3 of us on the curb. They were talking and laughing and I decided I'd go ahead and take the hit. What would follow would be an extremely frightening experience. It is VERY difficult to explain the state of mind I was in because it's so intensely mind altering, the world I went into is based around a completely different set of fundemental logic than the reality I'm used to. This time was unique because I somehow managed to keep in my mind that I had just smoked salvia and I knew I was under its influence, where as most of the time, I'd get so messed up, I wouldn't have a clue what was going on. This time somehow made more logical sense though. This time would also be intensely visual. Genuine visual and mental hallucinations would occur.\r\nThe reality around me began to completely alter, the universe completely transformed into a dream world. I lost sense of my own body, could no longer feel it, as if I were lifted out of it and it no longer existed. Instead, it morphed into what I felt and interpretted as grey, yellow and white flowers. The 2 friends sitting next to me morphed into flowers as well. The street turned white and was outlined by trails of colorful circles that looked like candy, my friends insisted that the world felt like a  'candyland'. The street faded to a horizon like a hill and where the car was, there was the night sky.\r\nThis became extremely confusing and disorienting. Unexplainable nonbodily physical sensations as if I were morphing into my surroundings, as if I had physically become everything I saw. But there was a problem. It felt so real I started to become convinced that it was real.\r\nWhat was happening was that beyond the horizon, there was my 2 friends, Roy and Julie standing there behind the hill looking at me, they were more cartoonish than usual, but they were just as real as anything. They began to explain to me that I was dying and that the reality I was experiencing my whole life was entirely a joke devised by Roy and Julie themselves because, they themselves were gods that created the whole universe with me as the central figure, and laid out every sequential event in my life to all lead up to this singular point where I'd meet them and smoke salvia with them so I could enter this other TRUE reality where they would decide to give up on me and the universe, the fake dream reality they created, the one I had lived my whole life in, and destroy it. My whole was like fate that lead up to this point.\r\nIt seemed as though they were basically telling me 'Sorry, you really thought this whole life was the true reality? It wasn't, this is and we're the gods. But we're sorry (saying this almost sarcastically, because they created me as a joke) but we've gotten bored with you and we're giving up on you.'\r\nThey would say this to me as I felt as though I was blacking out.\r\nI was convinced that at that moment in my life, that what I had smoked was a true portal to the true reality, and that reality as I knew it, the reality I had lived, was all a dream, all a complete joke devised by Roy and Julie. It was like they were saying 'See, here's true reality, you moron!' They descended behind the hill waving goodbye to me. This frightened me. I can't explain it in words just how strange and real the experience was. I felt so upset and scared because I knew my life was coming to an end at that time. I thought I was truly dying.\r\nA few minutes later, I slowly began to feel normal reality again but even as things were returning to normal, I was still frightened and completely unsure as to what true reality was. Even as I felt reality again, I felt as though I could no longer trust Roy and Julie. They were standing there, like they were the whole time, but they were just talking to each other and watching me trip out and zone out. They kept trying to talk to me but I was unable to respond. I eventually was able to say, 'Help me', but at that time they could tell I was an emotional mess, the drug was no longer a fun joke anymore, they could tell I was on the verge of crying. So I strugglingly spoke, 'Help me' a few times and they came over and tried to comfort me. Now reality was normal again but it felt as though their comfort was insincere because I had thought that just a few minutes ago, they were about to give up on my life and didn't care, and it confused me that they're now trying to comfort me.\r\nEven 20 minutes later, I still was unsure to what true reality was, the female friends of ours had left and I was laying on Roy's bed inside trying to cope with what just happened. Still wondering whether or not Roy and Julie were really gods who created my life as a joke. Even now, several hours later, I'm still unsure. What happened felt so real.\r\nI talked to Roy about it and he kept trying to assure me that it was just the drug, there is no truer reality than the one we were in and he certainly wasn't god over my universe. I just don't know what to think about reality anymore. I drove home and went to my room and started crying. Then I wrote this. I probably won't smoke salvia anymore.\n\n\n"
}
