{
 "title": "A Meeting with the Mushroom: A Personal Psychedelic Experience",
 "author": "Robert W.",
 "citation": "   Robert W.. \"A Meeting with the Mushroom: A Personal Psychedelic Experience: experience with Mushrooms (P. cubensis) (ID 5513)\". Erowid.org. Mar 5, 2001. erowid.org/exp/5513",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "1997",
   "ID: 5513",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 5, 2001",
   "Views: 20542",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[The following report was originally published in The Resonance Project magazine, Issue 2.  Thanks to TRP for granting us permission to use it.]</p><p>Summer was getting into full swing and it was time to start thinking about this season's psychedelic experience. While I had been fortunate to experiment with some rare psychedelics such as Mescaline Sulfate and some authentic amazonian ayahuasca over the past year, it had been almost a year and a half since I had made a journey with my true ally Psilocybe cubensis. I felt the time was right to return to my old friend. </p><p>I have used cubensis under many circumstances in many places, usually exotic or beautiful natural locales, but this time I was particularly interested in setting up a trip the way Terence McKenna had suggested, at night in the darkness, in a very quiet place with as little external stimuli as possible. In other words, sensory deprivation. I chose an island off the Washington coast where a friend has twenty secluded acres. </p><p>As I got ready to begin my trip I burned some sage, played my flute, and smoked a cigar as an offering to the gods. Then I poured very hot water from a thermos over 3.5 grams of powdered cubensis. After letting it sit for about ten minutes, I stirred up the concoction and down the hatch it went. Within twenty-five minutes my thighs began to vibrate wildly with energy. I closed my eyes and found more light and depth with my eyes closed than with them open. As the mushrooms began to take over my consciousness I tapped into a flow of information. It seemed so ancient and yet the visuals were so high tech, almost futuristic. I began to realize that the mushroom is both ancient and futuristic, timeless and infinite. My companion on the journey noted how similar our experience was to the world wide web, only we were surfing the internet of our own consciousness, cruising through the web of our own minds. Yet somehow we were also tapping into a timeless database of universal wisdom, beauty and love. I couldn't get over how beautiful the visions were, like a swirling sea of shimmering light all around me. My companion remarked that it was like scuba diving in another dimension. </p><p>The plant teacher began to teach, gently correcting me every time my mind wandered in the wrong direction. Forgiveness, acceptance, love, suspension of judgment, no telling people what they need or should do. Many emotional releases followed, I was dancing with my emotions, able to cry at sad thoughts and laugh at funny ones. It felt as if laughter and tears are made of the same energy and crying is as joyful as laughing. It's okay to just be, I don't have to feel guilty about being alive, it's okay to feel bad, it's okay to feel good, the important thing is to let your emotions wash over you, to go in and explore them, but then move on and let go and make room for the next emotion to flow through. I realized how I fight myself day in day out, the message I'm sent is that it's time to declare peace with myself. It then occurred to me that we all really love each other, it is just our neuroses that struggle against one another. What a shame I think, but the mushroom says no, you must accept that too, it is the way the world is. Infinite love, infinite acceptance even to our faults, our neuroses, our pain. </p><p>There was a dialogue going on but I couldn't figure out if I was communicating with my deeper self and accessing my own true wisdom, or if this was the other and I was channeling some infinite wisdom through another dimension. Whatever it was, it told me this: We've been doing this forever and we always will be. Welcome, we are glad you came, we have been here all this time, and most people don't even realize it. Isn't it funny that most people are scared of this place? Come back and see us again. </p><p>The next day I was awed at the experience  without a doubt my most profound psychedelic exploration to date. I understand now what Terence McKenna has been saying all along; music and nature are transcendent and inspirational in themselves without the mushrooms, but it is the internal psychedelic experience that offers us a unique opportunity to explore usually inaccessible regions and encounter vast landscapes of mind and consciousness, unknown realms of love and beauty and information. I'm not saying that tripping out in an ancient forest or dosing at a secluded spot by the ocean during the day is wrong. On the contrary, I have enjoyed many wonderful journeys in just such locations. However, if you have never tripped at night in the pitch black with no social distractions, I leave you with this thought - the darkness has much to offer. My thanks to Terence McKenna and Psilocybe cubensis.</p>"
}
