{
 "title": "Floating to Sanity",
 "author": "AKo",
 "citation": "   AKo. \"Floating to Sanity: experience with Mushrooms (ID 55160)\". Erowid.org. Apr 10, 2009. erowid.org/exp/55160",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55160",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2009",
   "Views: 3048",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI ate my mushrooms on the car ride down to the Guadalupe, probably about 30 minutes before we got to the river. By the time we parked I was already feeling the effects pretty strongly and almost hurled in line while waiting for my tube. Floating in the water made life about 100x better, and the large muscular-looking trees that line the Guad made for some spectacular scenery. Also, for whatever reason, there were thousands of butterflies floating around making it almost too beautiful to believe. That may have contributed to my disassociation from reality.<br>Maybe 30 minutes down the river things started to pick up big time. I couldn't get comfortable in my tube so I tried various ways of laying in, on, and around it. Eventually I settled in the fetal position, mostly submerged, with just my head above water inside the donut. It made a nice little world in there that prevented me from having to deal with the hordes of other rivergoers.<br>I had a bad habit, being inside my tube as I was, of floating off forcing people to come fetch me. Eventually I floated off so far that neither they nor I knew where I was. The trip was pretty much in full effect by this point, I have to say it was one of the strongest I've had. Things no longer mattered, whatever I did didn't seem like it would have any implications on the world, therefore nothing was real. It was kind of like being in a video game, in the sense that I felt no obligations to behave or respond to people.<br>There were two things that did matter though: the feeling that I wasn't getting anywhere, and that I had to pee. The first was probably attributed to the fact that I was standing on some rocks in a shallow area for 10-15 minutes, but I don't really remember. To solve them both, I saw a house up on the bank and I figured I could go use their bathroom. By the time I got started up the lawn some police stopped me to ask that I go over to this cement area. One of them proceeded to ask all sorts of questions and I just stared at him blankly. He wasn't real, as far as I could tell, so why should I strain my already strained brain to reply. He initiated a mental game that I enjoyed, so I tried to play along. I guess I passed the sobriety test, and he told me to get back in the water. As a note, I didn't think this really happened until much later as I came down, when everything else I was experiencing turned out to be real.<br>Standing back on the rocks looking down the river with all the trees, haze, and bobbing puffy white people in tubes, I felt like I wasn't making any progress. I needed to get to the end of the river, so I started swimming. Somehow, and I have no idea how, I wound back up in the group, tubeless. People asked me all sorts of shit, like where I'd been, etc, and still I felt no obligation to reply sensibly to these 'dream people'. Occasionally something would happen, like Sara shooting me with a squirt gun, and the combination of the seeing and feeling the event would make me think, just for a second, that this was actually happening.<br>Then the storm came in. Winds picking up, rolling thunder, and what seemed like a torrential downpour gave me a pretty good idea that the party's over, although at this point I didn't WANT to believe it. While most people were confused, those of us on mushrooms were REALLY confused. I looked helplessly at my Rockin' R wristband hoping it would give me a hint to what I should be doing to get home (after all, the guys on the bullhorn back at HQ told us it was -important-). People started getting off on the shores looking for our tube company's trucks, trying to carry heavy-ass coolers wrapped in unwieldy tubes of their own. Waiting for the buses things devolved into some sort of Woodstocky primal state. Beer and bodies all over the place, music, and various forms of sex. The prison-esque buses arrived, I got on, and was dumped off back at the start. The storm was over, and a beautiful post-trip sunset sat on the horizon.\n\n\n"
}
