{
 "title": "Illusions, Delusions, Terror, and Clarity",
 "author": "Humblesponge",
 "citation": "   Humblesponge. \"Illusions, Delusions, Terror, and Clarity: experience with Mushrooms & Diphendydrinate (Dramamine) (ID 55174)\". Erowid.org. May 15, 2009. erowid.org/exp/55174",
 "substance": "Mushrooms & Diphendydrinate (Dramamine)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(tea)",
   "  T+ 0:15",
   "50 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 55174",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 15, 2009",
   "Views: 3969",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My trip began ideally. As a junior in college one of my buddies' parents were away for the weekend, and we had his house at our disposal. He had procured a quarter ounce of dry shrooms. There were 6 of us there, all extremely close friends, with plenty of beer, television and stories to keep ourselves entertained. I was very optimistic about the evening. I should note that this was my 2nd time using shrooms. The first time was somewhat unpleasant, as I experienced a great deal of nausea and 'time-looping' where I felt stuck in the eternity of a moment. That experience was in a dorm room, and without close friends, so I wrote it off.</p><p>As we all arrived at J1's house around noon, the first thing I did was take a portion of the shrooms (about 1/8 ounce or 3g) and steep it along with a Celestial Seasonings ('Tension Tamer' ironically) teabag in hot water. I eagerly gulped it down and returned to the living room, where we chatted and joked around for awhile.</p><p>Later on, J1 was sitting on the opposite side of the room from everyone, in a rocking chair, trying to stitch a patch onto something (I believe). In any case, all I could think of was Betsy Ross sewing the American Flag. I made the observation and everyone laughed hysterically, saying that I must really be tripping. At this point, J1's face began to look very sinister, and I got scared and nauseous at the same time. I went into the other room and took a Dramamine to try and help the nausea. Feeling somewhat composed, I returned to the living room to see that 4 of my friends had left to grab some tacos, leaving me alone with J2. Now, this is where things went very, very wrong.</p><p>J2 is possibly my closest friend. We know each other extremely well, and we know how to fuck with each others' heads. Also, J2 has somewhat of an aversion to drugs in general, owing to a brother with wreckless drug behavior. So putting me (a guy who is twisted and talking stupid) and him (a sober guy who is annoyed to be stuck with me) in the same room was not good. I said something stupid to set it off. I can't remember exactly what it was, but it was something delusional, like 'Whoa, it seems like those people on TV are speaking directly to me.' Whatever nonsense I said, he calmly replied 'Yes, you're right, they are.' At that very moment, there was a shift in my psyche. It went from observing the drug's effect, to feeling as though reality might really be changing.</p><p>Simply put, a screw went lose and I was gone. As in completely psychotic, irrational, unmanageable, disoriented, etc. I stood for several minutes opening and closing my cell phone, apparently asked J2 15+ times where everyone had gone, basically stuck in a time-loop. The next thing I remember was everyone rushing in the house and coming at me, bombarding me with questions. I tried to flee, and fell down on the kitchen floor. At this point, I experienced intense olfactory hallucinations, some scent that was deeply embedded in my memory of childhood, although I couldn't describe it. </p><p>My eyes were either closed or rolled back in my head, because at that point I was rolling in eternity. To use a cliche, my life was flashing before my eyes. At that point, I had a revelation, albeit a stupid one. I realized that perhaps I was the only entity in existence, a god, and everything that existed was fabricated by me. If I willed something to be, it must be.</p><p>After 'rolling around in eternity' awhile longer (with friends becoming frightened and trying to restrain me), I suddenly felt as though I could control my surroundings. I stood up, walked straight for the window, and stepped through it. When my foot sunk down into the mulch outside, I felt as though my foot had passed through solid ground, reaffirming my delusion. I was scratched by some brambles and forcibly dragged back inside. In my mind, I couldn't understand why these beings (who I believed were my creation) were interfering with my will. At that point I really became angry. I had to prove to myself that I could bend reality to suit my will. </p><p>I walked around the house, pulling pictures off the wall. I pulled down my pants and started to pee on the wall. I grabbed a wine bottle and threw it hard at J1, who luckily caught it. Then I was restrained. Three or four of them put me under a blanket and held down the sides. The terror is unforgettable. Imprisoned by my own 'creations.' They brought me upstairs and put me in a bed, with two people guarding the door. Seeing their silhouettes at the door in the dark, standing silently, was terrifying. Eventually they got tired of guarding and left, at which point I wandered back downstairs.</p><p>Then my trip became oddly sexual. I went up to my friend F and asked him point-blank if he wanted to have sex. At times in my life I've questioned my sexuality, but this was way out of character. At some point I took off all my clothes, walking around with absolutely no sense of embarassment or shame. After all, if I was the only entity in existence, I could damn well be naked if I pleased.</p><p>Several people left over the course of these events, and in the end I was left with J1 and R. J1 (guy whose house this was) was extremely pissed, and told me to show some respect and put on my clothes. I argued back and forth, still completely twisted. The amazing thing is, it had been 9.5 hrs since I drank the tea. As far as I know, the longest it should last is 4-6 hrs. I was acutely psychotic. </p><p>Finally, J1 looked me straight in the eye, and with a very authoritative tone, said 'Look, you are a single human being and a part of society. As a part of society we must abide by simple rules to function. Have respect for these rules and put on your clothes!!' And BAM, I was sober. Just like that, I shit you not. The first thought that entered my mind was 'Oh fuck, what have I done?' </p><p>A couple of curiosities that my friends later pointed out: A severe thunderstorm began right as I lost it, and then abruptly stopped when I became sober. A grandfather clock (which hadn't been wound recently) stopped at the exact minute when I lost it. Afterwards, when we were sitting on the porch reflecting on the experience, a stray black cat (who J1 didn't know) came onto the porch and jumped on his lap (he hates cats by the way) as if to comfort him after all the damage I caused. I'm not superstitious but those were all interesting coincidences, and we had a nice chuckle.</p><p>I also strongly believe that I had a temporal lobe seizure as part of my experience. Temporal lobe seizures involve intense sensory hallucinations, inappropriate behavior (often sexual), feelings of deja vu, repetitive movement (e.g. opening, closing of phone) and are exactly what I experienced, with sudden onset and offset. I feel that this seizure was somewhat independent of the drug, or perhaps was triggered by a combination of stimuli, chemical and otherwise. I should note that J1 and R both consumed the same dose as me, and complained that they hardly tripped at all.</p><p>The aftermath involved a lot of awkwardness and apologies. For a good 45 min or so I wondered if I could ever become reaccustomed to *this* reality. Luckily that feeling wore off. </p><p>I have nothing against shrooms. In fact, now that I'm a bit older and wiser, I wouldn't mind trying them again *under the right circumstances*. I believe that tripping is something I must plan for. I went in foolhearty and wound up in hell.</p>"
}
