{
 "title": "Shadow People Appear",
 "author": "Moustache Pete",
 "citation": "   Moustache Pete. \"Shadow People Appear: experience with Cannabis & Alcohol - Hard (ID 55183)\". Erowid.org. Jun 25, 2007. erowid.org/exp/55183",
 "substance": "Cannabis & Alcohol - Hard",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "10 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55183",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 3426",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was the craziest thing I ever saw while messed up, whether acid, shrooms or whatever I'm familiar with seeing things that may not necessarily be there but this experience was different in that I wasn't expecting it. I've always been a big fan of drinking some booze and then smoking a joint or six. My friend and I had been drinking Canadian Club whiskey and watching TV/shooting the shit when he suggested going outside to smoke this fat joint he had. I agreed immediately and we commenced to smoking the weed in my parent's backyard. </p><p>We finish the spliff an go back inside to watch more TV or whatever. We hadn't been sitting down for more than a few minutes when I see what I will refer to as a shadow person walk through the room. He was about my size but completely black and transparent - like my shadow had got up off the ground and taken a walk around. </p><p>This thing was scary and I was sure it was staring right at me. It walked through the centre of the room and then behind my parent's bar where he crouched down out of view. Like I was in remote control I got up from my seat to see if this shadowy bastard was lurking back there. On the walk over my mind was screaming at me to turn back but I couldn't stop. Once I looked behind the bar he was gone. When I turned back to my friend he was all freaking out, so I helped him outside and got him a glass of water. </p><p>Once he'd calmed down enough he was able to tell me that he had seen the shadow man too but standing behind the TV. Afterwards we just laughed about it and kept drinking/smoking but sometimes I think back on it and still get a chill. wondering whether this was just a hallucination or some entity that our altered state allowed us to see.</p>"
}
