{
 "title": "Nothing Hit Me",
 "author": "Messy87",
 "citation": "Citation:   Messy87. \"Nothing Hit Me: experience with Salvia divinorum (5x extract) (ID 55217)\". Erowid.org. May 15, 2009. erowid.org/exp/55217",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55217",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 15, 2009",
   "Views: 2973",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor years I had been interested in Salvia, and when my mate was home alone I could finally try it out, not only would I have all the time in the world, it also meant I had a sitter and a quiet place.\r\nWhat attracted me to Salvia was that it is not a party drug. I've always been interested in philosophy and I consider myself a deep thinker ,) I'm studying philosophy next year, and since it's such a big part of my life Salvia naturally sounded appealing to me as a powerful entheogen. I felt the experience of Psilocybe mushrooms was too distracting from such things due to visual and chaotic aspects of the trip and weed and hash only allow me to focus on them more, as I would be able to when sober (with or without meditation). Up to my experience with Salvia those were the only drugs I had tried, besides of course, things like coffee etc. ,)).\r\nI had been reading about Salvia for years, so when I went to the smartshop - I'm Dutch, so it can just be bought here, I don't know what it's like outside of the Netherlands - there wasn't much new they could tell me. I talked to the lady at the psychedelics' counter for a while and she wished me a lot of luck. I then went to buy some weed for my sitter so he had something to do after my salvia experience.\r\nIt was around half past eleven when I arrived again at his home. He had set up a dimly lit room, we had a small bong (hardly 20 centimeters high) and we had rehearsed exactly what we were going to do:\r\n- We'd measure the salvia and take 1/6th of the bag (a full portion, I forgot how many grams were in it exactly),\r\n- I'd put it in the bong,\r\n- He would light it as I held my hair back and inhaled,\r\n- While I was keeping the salvia in my lungs (holding it for at least 30 seconds) he would refill the bong to make sure I could hit again soon after if it wouldn't work, and last but not least\r\n- When I would not give the signal that I'd need another hit he would dim the light closest to me which we needed to see what we were doing, after which he would then sit back and not say anything. I was just going to go with the flow, I was planning on closing my eyes and going for closed-eye visuals, but I was aware that I might forget about my plans after entering the trip.\r\nWhen we were finally ready, we did just that, and after inhaling deeply and keeping it in I was expecting to go on a ride just as I exhaled. But nothing happened. After two more attempts we thought of what we could have been doing wrong. There was water in the bong. We had just gone ahead and put water in it as per usual, but it was apparently filtering out the salvinorin or otherwise keeping me from getting much out of it. Now I still don't know if this was the actual problem (I saw no mention of it in any salvia FAQ and I can't imagine forgetting or accidentally skipping it), but sure enough when we took out the water and I smoked the last few portions I did more clearly feel a lot of (significantly stronger) smoke fill my lungs. It had a very specific smell to it and I knew that I finally had Salvia Divinorum's smoke in my lungs. I held it in for more than 30 seconds, exhaled and not much happened. I felt a slight difference between the right and left side of my face - with the right side feeling as if it was slightly whiping out -, as well as having reduced motor skill.\r\nI felt a second hit was needed, and this time too not much happened. When I was holding the smoke I heard the clock in the distance tick. I had never heard it before, but it was very clearly ticking as if it was rather close to me. When I exhaled there were some background dreamlike experiences, though they were more like vague 'themed thoughts' of a carnival and taking a ride or not. It wasn't a very strong feeling, and even though I did welcome it, it faded quickly. So far this was not really the Salvia experience I had heard and read about.\r\nI decided to go for it and take another hit, knowing that I would have thereby smoked the whole bag - as I mentioned above I forgot how many grams were in the bag, but the piece of information accompanying the bag said it contained 6 portions -, but one can't overdose on Salvia, and I really hadn't experienced much so far. I went for what seemed to me to be the biggest hit so far, and held it in for a total of 40 seconds (my heart was racing). Again I heard the clock ticking, and when I exhaled my vision had changed somewhat. However I was clearly still just as sober, with the same minor losses to motor skill.\r\nFor the next few minutes I tried in vain to test if I wasn't at least slightly hallucinating (which might have been stopped by my own criticism). I moved from the garden, to a mirror, to a dark place to see if there was anything I would notice, but it was clear: Salvia had not hit me.\r\nA summary of what I had experienced so far:\r\n- Reduced motor skill,\r\n- Misplaced awareness of my body (though only of my face), \r\n- Somewhat vague dreamlike 'themed thoughts' in the background that faded quickly, and\r\n- Somewhat enhanced senses (mainly that of sound).\r\nIn short I did not experience a true Salvia trip. I wasn't overwhelmed by any experience, and I must admit I was a bit dissapointed by this. I will most likely have to conclude I'm what they call a 'hard-head'. I have no idea why I failed, but I'm definitely planning on trying again eventually, hoping that someday lady Salvia will reach out to me :)\n\n\n"
}