{
 "title": "Through the Universe and Back to the Start",
 "author": "Elucidate",
 "citation": "   Elucidate. \"Through the Universe and Back to the Start: experience with 5-MeO-DiPT (ID 55211)\". Erowid.org. Aug 16, 2006. erowid.org/exp/55211",
 "substance": "5-MeO-DiPT",
 "bodyweight": "400 lb",
 "header": [
  [
   "DOSE:",
   "130 mg",
   "smoked",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 55211",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 16, 2006",
   "Views: 4157",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 130 mgs of 5-MeO-DiPT is considered an extremely high dose, see 5-MeO-DiPT Dose Chart]</p><p>It was may 2002, and I was just having some fun with misc. tryptamines here and there.  Unfortunately, I got a hold of some 5-MeO-DiPT (foxy) and thought for some reason, that I had weighed it out right..</p><p>Realized later I completely screwed up right about the time it started peaking and sent my world spiraling downhill.</p><p>First thing was first.  I headed straight for the shower.  Figured some cold water and physical stimulation would help bring me back around.. No such luck.  My heart rate was already super high, probably almost 200, and I was flushed and getting muscle spasms.  </p><p>Then things got weird. </p><p>From there, I started to trip.  At first I didn't know where I was, what I was looking at, or what I was.  I felt like. I was part of the universe. I was seeing everything and hearing everything at once.  So many patterns, so many colors, so many shapes and words. Nothing could be distinguished from one another because of the speed and variance of the visuals. </p><p>I had my girlfriend closely monitoring my vitals since I knew I was overdosing.  I told her to keep a close eye on me and watch over me, but not to call the paramedics because it was a psych drug, no matter how bad the overdose, I would be fine if my vitals held out.</p><p>Turns out I was having multiple waves.  Some people describe one or two waves of peaking.  I had about 30 or 40..  I would have brief (5-10 minutes according to my gf) periods of tripping followed by periods of time I can almost remember, where I was apparently responsive and conscious. </p><p>Those 5-10 minute periods however, were hell.  hell on earth. Or wherever I was. While the actual trip mostly escapes my mind, and what I saw was just described above, the time periods were the real problem.  Time distortion to be precise. </p><p>Apparently, in these 5-10min periods of time, I felt as if I had been gone years.. many years.  Through a few of my slips into reality, I was told I muttered sentances like 'Wow.. How long have I been gone?' '5 minutes honey..' 'Damn.. it felt like 20 years..' and another time something along the lines of 'Hey! I haven't seen you in so many years.. it's nice to know you're still here..' </p><p>I'm not sure where I went in my head, or how.  I'm not sure how long my brain really thought I was gone, or where it thought I went.  </p><p>I'm not sure of a lot of things with this trip.  I do know that during my brief periods of sanity, and after the trips finally quit peaking, I was still experiencing severe auditory hallucinations.  Particularly the dishwasher was tormenting me beyond belief.  Even when that was shut off, for easily the next 6-8 hours, everyone had altered tones in their voices.. like.. they've been pitch shifted. </p><p>Everything sounded like it had been fed through a voice modulator. </p><p>The muscle contractions and general restless feelings lasted almost 24 hours total from the time of ingestion.</p>"
}
