{
 "title": "Lucid Dreaming",
 "author": "Legend",
 "citation": "   Legend. \"Lucid Dreaming: experience with Fentanyl (ID 55216)\". Erowid.org. May 17, 2008. erowid.org/exp/55216",
 "substance": "Fentanyl",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "7.5 ug",
   "oral",
   "Pharms - Fentanyl",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55216",
   "Male",
   " ",
   "Not Given",
   "May 17, 2008",
   "14980",
   " "
  ]
 ],
 "report": "<p>My friend recently acquired 2 boxes of 75mcg fentanyl patches prescribed for his father whom used to have severe back pain.  I, curious in the experience, bought 1 patch from my friend for 20$ and tried chewing approximately 1/20th of it the first night I got it. That first night, the only effects were mild euphoria, a sort of loopiness and a general numbing.</p><p>Last night I decided to up the dose and chewed on approximately 1/10 of the patch cut off using scissors.  I began chewing the patch and noticed the effects begin to kick in 10 minutes after I began chewing.  After approxiamtely 30-45min of chewing I felt very stoned.  I could barely read the websites I was surfing and when I stood up to walk, I had extreme trouble with my coordination similar to about 8 drinks of alcohol.</p><p>I layed down and began to watch tv.  After about 5 minutes of that, I realized that I wasn't breathing.  Knowing that respiratory depression was a possible side effect of opiates I immediately spit out the patch that I was chewing on and forced myself to stay awake for fear of falling asleep and not waking up.  For 20 minutes I had to consciously remind myself to inhale.  After that I began breathing regularly again and felt comfortable enough to try to sleep, I drifted off into a half awake, half asleep lucid dreaming state which was quite unique for me, and I've tried nearly every hallucinogen and never had such an experience.</p><p>I ended up waking up 2 hours later and making my way from the couch to my bed where I enjoyed a nice long sleep.  This fentanyl is a highly addictive drug though, and ever since I first took it, I've been looking forward to taking it every night all throughout the day. Part of me can't wait to finish this patch and never look back again.</p>"
}
