{
 "title": "Mixing caffeine with herbal supplements",
 "author": "Sparkelicious",
 "citation": " Sparkelicious. \"Mixing caffeine with herbal supplements: experience with Caffeine & Ginseng (ID 5523)\". Erowid.org. Jan 17, 2002. erowid.org/exp/5523",
 "substance": "Caffeine & Ginseng",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Caffeine",
   "(liquid)",
   "",
   "2 ",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   "",
   "4 ",
   "oral",
   "Ginseng",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5523",
   "Female",
   "",
   "Not Given",
   "Jan 17, 2002",
   "28115",
   " "
  ]
 ],
 "report": "<p>\nNormally I'm a very straightedge raver.  I've never done ecstasy, acid, weed, or any other illegal drug.  Nor do I smoke or drink.  I usually go pretty easy on the caffeine during regular days (maybe one or two sodas a day max and sometimes a cup of coffee to start the day).  However, for a rave party I somewhat foolishly decided to mix some Jolt cola, two Vivarin, four Siberian ginseng capsules, three ibuprofen, and a Sobe Energy (has caffeine, ginseng, and ginkgo, if I remember right) all mostly within about an hour.  At the party, I felt this nervous excitement and a kind of weird edginess that I usually don't feel.  My two friends were rolling from a bit of X so they were pretty mellow, lovey, and happy while I couldn't get them to move fast enough wandering around.  So I left them alone for a while and danced to DNB like I never had before. I got this really nice slightly floaty euphoria feeling for a while.  </p><p>After I was cooling down from dancing, I saw this guy just sitting by himself on the dance floor.  He was rolling a little bit so I gave him a massage.  I don't know if it was the ginseng (I've heard it is a male aphrodisiac, maybe it works for females too), but I ended up making out with him cause I was pretty horny, something I would probably not do normally.  Finally we left the party around 5 AM and I knew I was going to be doing the driving for two hours home, so I took another Vivarin to keep me up.  I was pretty awake the whole time.  When we finally crashed back at our dorm around 7 AM Sunday morning, I couldn't go to sleep for at least 2 or 3 hours.  I just layed there shaking and having my heart race a million miles per hour.  When I finally fell somewhat asleep and woke about an hour or so later, I felt so bad, I almost fell off my loft.  I eventually got down and went to lunch around noon, but the most I could eat was about four or five spoon fulls of Lucky Charms before coming very close to throwing up in the dining hall.  My hands were still trembling for several hours later, and the nauseous feeling didn't totally leave me even the next day.</p>"
}
