{
 "title": "Physical Rather than Mental Tripping",
 "author": "phoenix",
 "citation": "   phoenix. \"Physical Rather than Mental Tripping: experience with Gabapentin (Neurontin) (ID 55292)\". Erowid.org. Mar 1, 2007. erowid.org/exp/55292",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "2700 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55292",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 1, 2007",
   "Views: 29508",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I found these in one of my mum's medicine cabinets, and once I saw that it was used as an anticonvulsant I knew it would have some interesting effects. I decided to dose up on 9 of the 300 mg pills.</p><p>I was going to watch a school play that night so I thought that they might help make it more interesting. Well all I can say is it was disappointing (the Gabapentin, not the play, it was actually pretty good (The Crucible). They made me intensely tired, and the intoxication felt simply like alcohol, WITHOUT the inhibition, which is the best part of alcohol's psychoactive effects. Not only that but I felt slightly nauseous, which I hate. This made me worried about the drive home as it was in a taxi, so I went and made myself empty the contents of my stomach into a toilet by pushing my fingers down the back of my throat.</p><p>Then when I was walking back from the toilet a friend saw me and a I was tripping everywhere, as in physically stumbling. And he asked if I was drunk and if I was driving home. So basically all I got out of this drug was an intoxicated feeling, nausea, and suspicion from my friends. However when it wore off a bit it slightly helped me to socialize, I think it may have very slight inhibitory effects. Maybe the dose I took was too high. </p><p>It also may be that I'm used to, and love my normal combination of 20 mg oxycodone and alcohol, which allows major inhibition while still decent social functioning. This may have lead to me having high expectations... opiates are the best substances known to man in my opinion, when taken irregularly so as to not form a dependence. That is the best drug combination I have tried ever, and do regularly. Bottom line, I'm pretty sure I won't be dosing on Gabapentin again.</p>"
}
