{
 "title": "First Time For Everything",
 "author": "S.O.",
 "citation": "   S.O.. \"First Time For Everything: experience with Ecstasy (ID 553)\". Erowid.org. Oct 2, 2000. erowid.org/exp/553",
 "substance": "Ecstasy",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "553",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 2, 2000",
   "Views: 4418",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOn the Eve of the Millenium, I ventured out with many of my friends to party the new year in. We had already passed the countdown and it was getting late, about 1 or 2 am. My friends Joe, Mike and Nester all showed up at the party I was at and asked if I wanted to go with them to rave. I agreed because I am a big lover of the rave scene. So we all piled into Mike's car and went to his house. Joe said he Mike got 4 hits of x and we were all going to share. We all took a hit. I remember Joe came up to me, put the pill in my hand and handed me the Gatorade. I drank it down and he said ' Don't think about it, and it will hit you quicker' So we proceeded to Mike's Bedroom and we all sat around talking. Mike put on some Bjork, and we all just enjoyed the music. </p><p>Soon enough I felt a tingling all over my body. I noticed my skin felt like a different surface, like rubber. I put my head in my hands and felt the strands of hair flow between my fingers. I went to lay down on the bed and put my jacket over my face. The lining was so soft and seemed to flow like water over my face. They asked me 'Are you okay?' I answered back, 'Mmmhmm.'  They asked me to go sit by them on the floor. As I sat down, I felt the white carpet rub against my hands. I had never felt such softness in a carpet. I noticed this and yearned to feel the carpet on my arms and body.  So I lay down on the floor and proceeded to roll around like a cat rubbing my body all over the carpet. Nester got me up and put my hands on his head. It was incredible. He had a shaved head and the peach fuzz was so incredibly soft, I never felt anything like it. </p><p>Joe and I found interest in each other that night also. The others left us alone with Bjork playing and the music was so beautiful. The bass took over my body and I felt like she was singing to me. Joe and I traded massages and  well, discovered each other's bodies for the next 2 or 3 hours. Finally we got up and went looking for Mike's dog but couldn't find her. We wanted to pet her and experience her softness. Since we didn't find her, we had a cigarette. I don't even remember the brand name, but it was the best cigarette I had ever smoked. At about 5 or 6 a.m., We decided to go to Joe's apartment and go to sleep. When I stepped outside, I was still feeling good. The sun was coming up and the morning was absolutely beautiful. After that, I started to come down, and when we got the apartment, I was tired and thirsty. I drank some water and crashed on Joe's bed. I woke up at 12p.m. and Joe fed me breakfast.</p><p>The whole experience was so beautiful and enlightening. I loved it. </p><p>Be safe, Be smart, be careful... If you dose... dose carefully. ;)</p>"
}
