{
 "title": "Intravaneous Bliss with a Chaser of Depravity",
 "author": "Smitty",
 "citation": "   Smitty. \"Intravaneous Bliss with a Chaser of Depravity: experience with Cocaine (ID 55309)\". Erowid.org. Oct 4, 2007. erowid.org/exp/55309",
 "substance": "Cocaine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "IV",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "55309",
   "Male",
   " ",
   "Not Given",
   "Oct 4, 2007",
   "26146",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done drugs for a number of years..actually, since seventh grade.  My preferred drugs are typically hallucinogenic in origin, but there was a time where narcotics ruled the roost.  Namely, 'cocaine'.  I had just purchased three grams of the finest in town..(Granted in America that's not saying much)  Not the wasteful type, I thought, 'Hell, if I'm going to do this, I might as well do it right.'  I Stopped by the walgreens for a pack of syringes and I was on my way. </p><p>Preparing a syringe is always the best part of shooting up.  As I measure out the .5 CCs of saline, and the fourth gram of substance, a sense of joy overwhelms me.  My hands are shaking with anticipation, but somehow I manage to pour the ingredients into the spoon without spilling a drop.  I place a lighter underneath the solution and turn it to the highest setting, the murky liquid boils quickly, and mixes automatically.  That's enough, don't want it to be too hot when I inject it. Now it's time to prepare the syringe.  T take the plunger completely out of the syringe, and pour the liquid in with my finger on the needle, keeping the precious liquid where I want it.  I then tilt the syringe with the needle facing upwards, and tap the plastic until all the air goes to the top of the syringe, push the plunger until all the air is expelled, and I have nothing but liquid in the shaft of the syringe.  The only thing left to do is the final deed.  </p><p>I find a strong vain, and point the needle facing away from my hand up my arm, and quickly jab it in.  Without wasting time, I pressed the plunger, and felt the liquid spreading like an electrical current from its point of origin.  The effects are instantaneous and extreme.  A once serious and quiet individual becomes a giddy wreck, and the overall sensation of euphoria is paralyzing.  This same dose was administered multiple times that day because, though the effects of injection were stronger and lasted longer than mere snorting, cocaine never lasts long.</p><p>After the coke is gone, I'm left feeling a yearning stronger than most any desire, and this is coming from a guy who was on heroin for a year.  The initial yearning leaves after a day or so, but the underlying memory is still there.  In retrospect, it was amazing, as most drugs are, but the swollen veins, and overall pain afterwards may deturr me from trying it again, then again probably not.  A high this good is hard to pass up.</p>"
}
