{
 "title": "My Concert Seizure",
 "author": "Joe",
 "citation": "   Joe. \"My Concert Seizure: experience with Mushrooms  (ID 55314)\". Erowid.org. Jun 15, 2007. erowid.org/exp/55314",
 "substance": "Mushrooms ",
 "bodyweight": "310 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 0:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55314",
   "Male",
   " ",
   "Not Given",
   "Jun 15, 2007",
   "4020",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Me and a few friends thought it would be fun to eat some mushrooms and go to a concert. I had bought 4 grams and I ate about 2.5 (I had one really big cap left) and went to the concert. When we got there I had a beer, then about 30 minutes after we ate them we smoked a blunt and everyone started to trip but me so I ate the last of my stash. </p><p>About 15 minutes later I began to feel my body contract and expand with the music, things became very dark acrylic colors and lights very bright. The last thing I remember was being in complete ecstasy, everything looked awesome and I felt great, but then all of a sudden I woke up and I didn't know where I was. I felt horrible and was sweating profusely. For the next five minutes, I lay my head down and I felt darkness reaching for me. I had to focus on the light and found that breathing deep and focusing brought me to a more comfortable state. My friends explained to me that I had been sitting down starring at the stage when I suddenly fainted a went into a seizure. They said I was flopping around for about 30 seconds; one of them had been trying to hold me down and the other was slapping me in the face when I finally came to (I dont remember any of this). </p><p>After I pulled myself together, it seemed like I was at a party in outer space and I still had a hard time believing that all this had happened to me, but in the past I have had bad trips and brought myself out of it by throwing up, so I went to the bathroom and puked up everything I could. I was fine for the next half hour when I began to feel light headed again so I left the concert and drove home, which was a really bad idea because my contacts had come out during the seizure and I was seeing heavy tracers and psychedelic patterns. I made it home and tried to just go to sleep but when I closed my eyes I just felt like I was flying through these crazy psychedelic patterns. I tossed and turned and eventually passed out. The next day I felt completely normal and had to call my friends to make sure they made it home from the concert (I was their ride and I left after I began to freak out again) and to confirm that it wasn't a dream and it really had happened.</p>"
}
