{
 "title": "Bonding Experience",
 "author": "Dork",
 "citation": "   Dork. \"Bonding Experience: experience with Cannabis (ID 5532)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5532",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "6 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5532",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 16, 2002",
   "Views: 6280",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA friend of mine, Matt, was drifting away after the summer ended. We stopped talking and hanging out. Every now and then he would come over to my house, pick me up and we would drive around with his 'new' friends and get stoned. I didn't really feel connected with him anymore, he seemed older, more mature. Recently, we have been talking and hanging out a lot more, and I got to spend the night at his house with a friend of his. I didn't really know this new friend...and I felt intimidated. Anyway, we were walking around the area I live in, trying to get 'shrooms, but just settled for more weed. We went behind the movie theater and got stoned. They smoked 2 bowls between them, and I smoked 1 (I'm very sensitive). We then waited out front of the movie theater for Matt's friend's dad to pick us up. While we waited we had a long conversation about how fake the moon landing was. It was actually a very interesting conversation, full of exaggerated facts and fake sources, like most of the conversations me and Matt had over the summer, only Matt's friend was joining in.</p><p>When we got to the mall, me and Matt's friend, still slightly stoned, talked about 'shrooms and how great they are. After a while at the mall, we went back to Matt's house. Matt's house has a lot of history, we always got stoned there, it was the best place to go. Now, I felt very comfortable around both Matt and his friend, being able to have a good back and forth conversation with both of them. I felt connected, I finally felt like I belonged after losing my best friend.</p><p>We then smoked the rest of my weed in a blunt, and they smoked 2 more bowls between them. A half hour later, I asked if we could smoke more, so Matt packed 3 bowls. About an hour after smoking out of the pipe, I asked to smoke a little more, so we smoked 2 more bowls. Now I felt even more comfortable. These were my friends. We talked about how weird batman was, and how great weed is. I didn't quite learn anything new while hanging out with them. I never smoked weed to have a 'life affirming experience.' Just after me and Matt drifted away, I kind of became a hermit, and lonely, unable to care about anyone, but that night changed my attitude completely. It was a great experience, and I never felt more comfortable around two people in my entire life.</p>"
}
