{
 "title": "Ever Puke from a Taxi Cab? I Sure Have ...",
 "author": "Dutchmaster Killa",
 "citation": "   Dutchmaster Killa. \"Ever Puke from a Taxi Cab? I Sure Have ...: experience with Syrian Rue (ID 55345)\". Erowid.org. Aug 14, 2008. erowid.org/exp/55345",
 "substance": "Syrian Rue",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE:",
   "20 g",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 55345",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 14, 2008",
   "Views: 4094",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a Friday night and I was in a friend's room waiting for this guy to come by who was going to sell them some mushrooms. When he arrived he was selling them the mushrooms and said that he also had something called 'Syrian Rue' which looked like seeds in a bag and he said that if you took enough of them you could have a good trip as well. My friend's did not end up copping any but I did; the price was fairly reasonable and I ended up leaving with an ounce of Syrian Rue seeds.</p><p>Now, the guy who sold me them told me the best way to take them was eating them in something like yogurt, so I got a couple tubs of some yogurt and poured in what measured to be 20 grams, I gave the other 8 grams to a couple of my friends. </p><p>It was extremely difficult to eat all the yogurt and the seeds primarily because it was disgusting, but I eventually ate all 20 grams and the yogurt I had put them in. </p><p>After that I got ready to go to a party, so I got all dressed up and proceeded to walk to the party with a few of my friends. I had informed them that I was tripping out so if I needed them to they would get me home or take me to the hospital.</p><p>After about 45 minutes to an hour I could feel the onset of something, and my perception began to change, I first began to notice a change in spatial perception, and that everything seemed to be a great distance away from me, but nothing too out of the ordinary. Shortly after I began noticing a particular enjoyment for music, and found myself getting lost in the beats of some songs.</p><p>About 30 minutes after that things really started to get fun. I began seeing motion trails of people as they danced or walked by me. The trails were vivid and extremely colorful.</p><p>At this time I began experiencing extreme dry mouth so I went to the bathroom to get some water and wash my face. As I entered the bathroom the patterns on the floor and the walls began to jump out at me and my vision was overwhelmed by intense geometric patterns I enjoyed this very much. </p><p>Not too long after my trip to the bathroom I began to feel some indigestion and felt like I may have to vomit soon so I left the club, not twenty meters from the club I began to vomit. The vommiting however made me feel even worse. This prompted us to go to McDonalds where I ordered a coke, I ended up taking about two sips of it then throwing it away. At this point we called a cab because I was unable to walk all the way home.</p><p>While in the cab I had to vomit again, I informed the cab driver and he stopped the car and pulled to the side at which point I opened up the door and vomited out the car.</p><p>When I reached my room the vomit fest continued, I probably vomitted 15 or so more times when I reached my room. The last few were painful dry heaves in which I would pass maybe one or two individual seeds up from my stomach. After I vomited basically for an hour or two straight I went to bed.</p><p>When I woke up I felt completely fine and had no residual or hangover effects.</p><p>Regardless of the vomiting I still look back on this experience postively, the trip while it lasted was very intense and amazing. Syrian Rue is defintely something I might try again but probably in a lower dose.</p>"
}
