{
 "title": "Allergy, Shock or Oversensitivity?",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Allergy, Shock or Oversensitivity?: experience with Dimenhydrinate (ID 55382)\". Erowid.org. Apr 28, 2007. erowid.org/exp/55382",
 "substance": "Dimenhydrinate",
 "bodyweight": "185 kg",
 "header": [
  [
   "DOSE:",
   "1 ",
   "sublingual",
   "Dimenhydrinate"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55382",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 28, 2007",
   "Views: 8963",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAnyone who seriosly considers using this as a recreational drug should heed this warning. I'm not a drug user - in fact, I don't even use alchohol or tobacco. But I tend to get carsick on bus and train jorneys, so I picked up a pack of calma chewing gums as an emergency solution. I popped one gum into my mouth, and chewed quickly. <br>Approximately five minutes afterwards I began to feel woozy - but thinking it was the ordinary effects of dimenhydrinate I ignored it. Some minutes afterwards I noticed that my tounge and the inside of my mouth had lost it's sense of touch! At this point I also got a slightly raised heartbeat, so I spat out the gum, and also noticed that I seemed to have difficulty catching breath. I felt like I was about to die, and panicked a little (I'm a slight hypocondriac, so that might have aggravated the effects). My fingernails went blue, and I lost the sense of touch in my hands and feet. Still feeling a great deal of death-fright, I screamed to the bus driver to stop the bus and call an ambulance, which he promptly did, and it arrived maybe ten to fifteen minutes later. The difficulty in breathing and elevated heartbeat persisted during this time.<br>In the ambulance, I got my pulse, oxygenation level and blood pressure checked - they where all whithin normal parameters. I began to have shivers and shakes, and felt cold, as if I had a fever, my teeth shaking to the point of having slight difficulty to maintain a legible conversation with the paramedic. My fears subsided a bit at this point, since I realized I was more or less out of danger. When they hauled me into intensive care, I was still fully concious, and my sense of touch in my tounge region and hands and feet had returned. I did, however, still freeze a lot which was remedied with blankets. They gave me anihistamine and cortisole, to alleviate allergic shock.<br>I lay like this for maybe one hour, before the effects started to subside. I felt woozy all this time. At the end of this hour, I began to feel better, and tried to sit up, however, the shakes and dizziness returned. Half an hour later, I felt almost normal, appart from being quite groggy (could have been an effect of the antihistamine.) The nurses had me on monitor during this time, and my blood pressure etc. was in fact normal, but rose during the time I began to recover. The doctor theorized that I had gotten a lowered blood pressure and lack of sensation in the mouth as a side effect of an allergic shock to the active substance. The loss of sense in my hands and feet was from lack of oxygenation in these parts of my body. <br>Later, I got a cab called to the hospital and got sent home without further due. At this point I felt quite well, I approximate that the timespan of this ordeal was three, maybe two and a half hours. It's the day afterwards now, and apart from waking in the middle of the night in shakes (probably from hunger and the meds I received) and a persisting feeling of weakness and tiredness that persisted untill afternoon I feel well.<br>Before I wrote this I checked up on the known side effects of dimenhydrinate, and it seems that dizziness and elevated heartbeat where known symptoms of an overdose. I guess the shivers and cold where just normal effects of mild shock. The experience I had was, whether caused by oversensitivity or allergy was quite frightening, and I would hate someone else to have to go through it, maybe even die, if they take enough of the substance to get high on it.<br>I am 18 years old.\n\n\n"
}
