{
 "title": "The Great Realization",
 "author": "Gcl5",
 "citation": "   Gcl5. \"The Great Realization: experience with Cannabis & Buspirone (BuSpar) (ID 55384)\". Erowid.org. May 27, 2009. erowid.org/exp/55384",
 "substance": "Cannabis & Buspirone (BuSpar)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "9 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "15 mg",
   " ",
   "Pharms - Buspirone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55384",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 27, 2009",
   "Views: 10857",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nWell I have been a pretty experienced user of this drug cannabis. I had decided to stop this habit because I was about to going to go to college in the fall. To make sure I would never do this drug again I promised a close friend of mine that I would quit seeing how I can't really break a promise I knew it would work. <br>Well it being graduation night and all I decided to rationalize and celebrate. Big mistake on my part. Earlier that day my friend, who is very inexperienced with any type of drug, decided to buy an eighth off some shifty dude. He later showed me his purchase and what he had bought it looked pretty bombin though like I said it defiantly looked like he got ripped off so I laughed in my head at his fault. So the next day June 9th I graduated from high school. And my friend had a party .A party that I'll never forget.  <br>This experience takes place outside on a warm June night at a graduation party. My friend took great preparation for the party he went out and bought wood for the fire and snacks and tasty drinks. The party started around 10:30 or so and carried on into the wee hours of the morning.<br>11:00 PM I took nine bowl hits of this bombin dope <br>11:05 PM fuck is the only word I could describe when I realized I was on my anti-anxiety medicine Buspirone (Buspar). Around this time my hands and legs began to become very tingly and ice cold. I looked down at my feet and the ground below was moving. I suddenly felt as if I were about to pass out so I became very serious and quiet. Kids would tell me congrats and what not and I just sat there saying yea in a monotone voice.  <br>11:05 PM-to Infinity: By this time I was getting a bit freaked out. Having an anxiety disorder defiantly does not help this situation. Of course I felt no anxiety at all which was strange because of the medicine. I had let my friend borrow my dads car to go buy some beaster. So in my mind at the time I figured they would get caught and arrested so I was freaking out, apparently I look rather worried. Then my friend came back and I was so relived but what followed was much unexpected. This is where the outside looking in feeling came into play and an introspective nightmare was about to follow.<br>I suddenly realized that his party was really stupid and I was alone. My friend said he got the same feeling when he hit a gravity bong and said it almost ruined weed for him. About this time I began to have mild open eye visuals and closed eye visuals. This wasnt the first time I have had visuals with this stuff so I wasnt too alarmed, but these visuals were different. The first visual I had was a floating grid pattern that appeared out of no where soon it turned into two laser beams with some sort of cells floating back and forth with in them. I then closed my eyes and saw and giant cell just living and colors coming from every where. After all of that my best friend called and I told him about what was going on and how awful things where going. He told me that his girlfriend had the same thing happen because she was on a lot of antidepressants. And he said we will be there soon and he was and that made me feel a bit better.<br>When they arrived I was acting incredibly stupid and falling on the ground and laughing very hard and wandering around mumbling (please keep in mind I dont remember a lot of that night in exact order because I was out of my mind). The Great Realization was soon to follow an epiphany if you will. My best friends girl friend was there and she made me feel a lot better and told me that goldfish make everything better and these snacks made my mouth horribly dry. By now I wanted it all to end. When she gave me the tasty cheese flavored snack it seemed there was light glimmering all around her and then I noticed what true beauty was and who good people really were. (The Great Realization) I went over near the pool and hung around my friends and I felt warm and good inside like these were the type of people I should be with. The other people around the fire on the other side of the yard I felt distant and cold with them and I saw that they were fake. <br>So after that me and my other friend went around and hung in the tree house until the night ended when he got back from getting beer. That also made me feel better when it was just him and two other people and getting away from everyone else. By now the hell that once was slowly ending and people would slowly come up to talk which wasnt so bad. I also thought I saw people swinging that werent really there and that spooked me a bit. I also called out names to people who walked by even though it wasnt them and they looked at me funny. Then I realized all I had left was the guilt of a broken promise.   <br>Well overall this is not an experience I do want to have again it was awful. The next day I realized Marijuana should be given the respect it deserves it can be an extremely powerful psychoactive drug especially when mixed with other drugs. I also realized that it's no different than any other drug and that no other drug is worse than another. They are all the same they just do different things. After this experience I look at magazines like High Times and Cannabis Culture and wonder why there arent magazines for Heroin Junkies or for Speed Junkies or Cokeheads. I think society has done a great misdeed with rewarding Marijuana with a positive image and all other drugs like Tobacco, Cocaine, etc with negative images, people fail to understand that Marijuana can be a pretty serious problem if you can't handle it. In a few years maybe I'll think all of what I just said in this paragraph bullshit who knows. But one thing I do know is that I am much wiser (or I feel wiser) after this experience. After this I do know I won't being smoking pot again. And yeah Im sure I sound like your mom.\n\n\n"
}
