{
 "title": "Nutmeg, A Hidden Reality",
 "author": "Koshare!",
 "citation": "   Koshare!. \"Nutmeg, A Hidden Reality: experience with Nutmeg (ID 5543)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5543",
 "substance": "Nutmeg",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "3 Tbsp",
   "oral",
   "Nutmeg"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5543",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 16, 2002",
   "Views: 117713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI have used nutmeg around 5-6 times. The most important things I learned to remember:<br>1. Never have anything important to do.<br>2. Never be around people that I don't like.<br>3. Have 3-5 days of rest.<br>4. Drink lots of water (NOT pop), before during and after. (This tends to get rid of the side effects. Many people dislike nutmeg, it is too weak or too strong for some, and sometimes has nasty side effects.)<br>This is an account of my most memorable and recent trip.<br>Noon - I ingest 3 tbsp of nutmeg.<br>1:00 - No effects yet, like expected.<br>2:00 - Mild pot-like buzz.<br>3:00 - Things get interesting. At times nutmeg feels like acid, pot and MDMA. Acid-like patterns form, short term memory is non-existent. My body feels lightweight, and heavy at the same time. Things that are cold or warm to the touch feel strange, sometimes it is hard to tell the difference between cold and warm things.<br>7:00 - My friend and I decide to go see Crouching Tiger, Hidden Dragon.<br>It was difficult to concentrate on the movie. I had decided that I shouldn't have gone to a public place. I needed to go pee but was afraid that I would get lost and go into the wrong theater. Eventually I got the courage to go to the bathroom. Upon returning I watched the rest of the movie, and the fight scenes looked and sounded cool. All of the characters in the movie were moving in slow motion at times that it would not have made sense for the effect to be there.<br>10:00 - I was frozen in a euphoric state, unable to move. I have never done heroin, but this is what I guessed it would feel like. <br>Sounds were very loud. Visually there were few effects unless I meditated. I had a feeling of grandeur throughout the rest of the trip. I felt like I was the king of the room I was in and my pets were my servants. My lizard, which is a bearded dragon, was my bodyguard.<br>2 days later - My mind was gone until a few days afterward. I enjoyed the trip. This is a definite boredom drug. If you are bored and have the time, go ahead and do it. I DO NOT recommend doing this drug if you are not experienced in chemicals.<br>PEACE.\n\n\n"
}
