{
 "title": "Frightened and Confused",
 "author": "Niki",
 "citation": "   Niki. \"Frightened and Confused: experience with Dimenhydrinate & Codeine (ID 55435)\". Erowid.org. Mar 5, 2009. erowid.org/exp/55435",
 "substance": "Dimenhydrinate & Codeine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "Codeine",
   "(pill / tablet)",
   " ",
   "1800 mg",
   "oral",
   "Acetaminophen",
   "(pill / tablet)",
   " ",
   "200 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 55435",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2009",
   "Views: 16064",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBackground Information\r\nBefore this experience, I had much experience with extacy and speed. I had also experimented with acid, shrooms, coke(crack and precook), codeine(my drug of choice), marijuana (I live in BC :P You're jealous, I know :D), and crystal meth. \r\nMindset and Setting\r\nThis was my first time taking dramamine recreationally. I'd undergone stomach surgery 2 weeks earlier. My boyfriend was out of town, I was alone at home and bored. I was not in the most pleasant space of mind, simply looking to 'get high'. It should be noted I have a history of chronic depression with bi polar tendancies. I have been diagnosed with generalized anxiety disorder and extreme panic attacks(heart rate above 180BPM for over 3 hours is not uncommon for me). I do not take antidepressants because of the side effects, I occasionally take Lorazepam (2mg) when I have a panic attack. I am also anemic (lack of red blood cells), so I suffer from constant heart palpitations\r\nand shortness of breath. \r\nDosage and Preparation\r\nI took 8 tablets of dramamine(Gravol) and 180mg of codeine(Tylenol 3) orally, on an empty stomach. Gravol was obtained through the pharmacy, days earlier, to ease my nausea(from the surgery)... It is not an OTC here in Canada. I am lucky to have a (relatively unlimited) supply of Tylenol 3s from family members who recieve monthly prescriptions(for arthritis, I believe) and are happy to share. I was not taking any medications at the time, perhaps birth control pills, though I can not remember specifically. I take Keflex(iron supplement) daily as well as a vitamin B supplement for the anemia. \r\nTrip\r\nI was told by a close friend that taking Gravol could 'make me trip out'. I read a little bit about it online, and despite the fact that 90% of people who have taken it recreationally did not enjoy the effects, I went ahead and dosed, out of curiosity. I smoked a few bowls of prime BC bud, waiting for it to kick it. I did not, at anytime, become tired as others have reported. When I first realized I was coming off baseline, I was actually feeling quite hyper. I wandered around my house aimlessly, cleaning up, playing on the computer, playing with the cats, trying to find anything to keep my mind at ease.\r\nLooking back, I was rather nervous. I am usually very careful when taking drugs, especially, new ones. I have never(other than this one time) tripped alone. Somehow, I was able to justify taking these drugs despite knowing if was not a good idea, and knowing I would not have a good experience. \r\nMy first visual came, roughly an hour and a half after dosing. I was sitting at the computer, and turning around, I noticed a strange white jelly floating above my cat who was sitting behind me. I sat down next to her, and placed my hand into the jelly. It wiggled around, and I found I could move it as I desired using my hand. The other cat came over to say hi, and she had the white jelly above her as well. Getting back to the computer, I noticed it(the jelly) was also hovering above the tower. \r\nIt was somewhat foggy looking, all around the room by now... I've experienced this before with acid. By this point I was feeling a little unsure, as, perhaps I had underestimated the strength of this drug, and, I could feel that I was in for a trip, even though I thought I had taken a respectable dose. \r\nI tried to keep distracted and calm, by talking on MSN messenger to some friends. The jelly was everywhere now, and I realized, that it was caused by heat. It covered anywhere which was warm, that being my computer, cats, and myself. My next visual also came care of the computers' tower, little fractal patterns, glowing yellow, began appearing. They would morph and move about, they turned into daffodils which seemed to be growing and shrinking the more I stared at them. \r\nAt this point, I had to go to the washroom. Looking at myself in the mirror, I noticed the yellow lights accross my body. I looked down at my arms which they covered. They morphed into lines instead of dots, and morphed again, into bloody cuts. They were dripping shiney red blood, this unnerved me, and I told myself not to look at them. By this point, I did not want to be high anymore. I was frightened, and fighting off a wicked panic attack. I have had problems with self mutilation in the past... No doubt this visual was born from surpressed memories.\r\nReturning to the computer room, patterns in the carpet and woodgrain of the desk were becoming more obvious. They morphed, and slithered amongst themselves, similar to my LSD experiences. At this point, I went into my bedroom and decided to lay down for awhile, hoping to calm myself, as I was still shaken. Turning out the lights, I layed there with my eyes open... For some reason, whenever I trip, I can never remember to close my eyes. The shadows in the room, cast by street lights by my window were obviously alive. The flew around, like bats, or dark spirits or something, above my head. There also seemed to be a green tint to a corner of the bedroom. I watched this foggy green cloud thing for awhile... I saw it turn into a rocking horse, a miniature green rocking horse... It climbed a nightstand and rocked back and forth, before gallopping off into the wall... Interesting. \r\nConcentrating on the floor of the bedroom, I could see out the stars and moon out of the corner of my eyes. It looked like the roof of my house was missing, which is strange because the house I live in is 2 floors, my bedroom being on the bottom floor. I watched the stars dance about for awhile, this was the only enjoyable part of the trip. \r\nThroughout the trip, I realize now that my internal dialogue had not changed much as it usually does while under other hallucinogens. Rather than having thousands of thoughts per second, all hitting me at once, and feeling quite overwhelmed, I was instead an empty shell. Gravol stunted my ability to think and comprehend, and left me in a constant state of confusion. I guess that's why it's called a deliriant. These were the only noteable OEVs which I had that night. \r\nI did not find this trip enjoyable. I was naive and irresponsible in taking gravol as a recreational drug, alone, and in the mindset I was. I payed for this, by fending off paranoia and panic for the rest of the night... It's a good thing I have alot of experience with living on the edge of hardcore wicked intense panic. It wouldn't have been fun, trying to explain to the doctors in the ER that I had taken antinauseants to 'get high'.   \r\nI will not repeat this experience, and I don't recommend it to anyone, though if you must try it, at least have a sitter, and be confident & happy in your decision. I hope that in sharing my experience with you, an understanding of the effects, and intensity of this drug could be helpful to someone. Happy tripping, and be safe :D\n\n\n"
}
