{
 "title": "I'm Dying ...?",
 "author": "Lydia",
 "citation": "Citation:   Lydia. \"I'm Dying ...?: experience with Diphenhydramine (ID 55446)\". Erowid.org. Mar 5, 2009. erowid.org/exp/55446",
 "substance": "Diphenhydramine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "oral",
   "Diphenhydramine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55446",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2009",
   "Views: 15732",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy brain had refused to shut up - it kept playing over the day's conversations, the drugs, the images, I was hearing absurd sentences in strangers voices and everything was profound and complicated, it wouldn't stop - We were all awake and up at 7AM, an hour after we'd decided to go to bed. As tired as we were, none of us could sleep (I thought that had worn off!)\r\n'So, uh, do you want to go smoke in my garage?'\r\nI was mixing things again, but I remember hearing that you should never mix alcohol with bennys.. something about that specific combination, it shuts down your respiratory system, you go into a coma, you just stop breathing. Not to mention, that taking those pills alone is something, but the last cocktail with those, I barely needed any and my brain was smashing into walls. I said I didn't want to take as many pills that were already on the table for me. I'd already explained the mixing with alcohol part. I was thinking, what if those last 2 pills killed me? We wasted a bit of time laughing uncontrollably over the fact that it was around 8 in the morning. Those last 2 pills.. well, I already knew I was going to take them.\r\nWe wandered back into the living room. All of the things we'd just done can make me terribly tired, so she said she'd go to sleep. I drew pictures with an orange marker - strange ones without thinking - and occasionally looked over to be sure her chest was still rising and falling. It had all started to kick in... I forced myself to stay awake, not trusting what would happen if I didn't. I was so tired... I watched my breathing once it felt like I'd forget to take a breath if I didn't. Deep, slow breaths.\r\nMy hands were turning blue.\r\nI stared at them for a minute before waking her up (she'd never really slept anyways). Her hands were just as blue. We looked at our feet and our arms and our legs. 'Fuck...'\r\nWe woke up Lisa (who I don't think had ever fallen asleep) and made her look. She told us they looked normal. Normal?! Our skin, looking pale and blueish, like zombies, our fingers and toes losing touch - normal?!\r\nI kept forgetting where I was, I was kind of stuck in that dreamlike feeling of tripping, it felt like I was falling asleep with my eyes open, until I'd come back to the room and the realization that I was losing circulation. Sarah and I sat on the couch and looked at each other. Hospitals and stomach pumps? We couldn't think. Lisa, meanwhile, kept trying to tell us that we were making it up, it was the lighting, we were tripping. Sarah and I looked at her with the same face - are you kidding? We sat in an anxious, confused state for a while, not sure of what to do, and constantly looking at our hands. It wasn't getting worse, nor better, but we were still blue and shaking and lost. We considered making ourselves throw-up, and I did have a couple minutes alone over the toilet.\r\nWe went into the kitchen to call AJ and see what he had to say. I sat on the floor, I didn't trust that I could stand. AJ, like Lisa, tried to tell us it was nothing. We gave him the same answer - my hands are fucking blue! - and he said he'd come over.\r\nAt some point, during waiting and worrying, time stopped going so slow, maybe other things were wearing off. By the time AJ got there, my hands and everything were back to normal, although I was still too shaken and trippy to feel alright. We walked home. As if the whole 'day after' thing wasn't bad, I had no sleep and a panicked morning on this 'day after'.. I felt like shit. I still do, and judging by the way my head feels heavy, the loss of words and clear thinking, the worry without reason.. I'm still coming down (sigh.)\r\nI don't know if my hands were really as blue as I saw them, I don't know how much was in my head. But it was the worst feeling, of worry and dread and panic and .. now I understand the words BAD TRIP.\n\n\n"
}