{
 "title": "Where is my Mind",
 "author": "As",
 "citation": "   As. \"Where is my Mind: experience with H.B. Woodrose & Salvia divinorum (10x extract) (ID 55451)\". Erowid.org. Feb 25, 2009. erowid.org/exp/55451",
 "substance": "H.B. Woodrose & Salvia divinorum (10x extract)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   "(ground / crushed)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55451",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 25, 2009",
   "Views: 2816",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI'm more an alcohol than a drug person, and have never really done anything more potent than weed and absinthe. But with my parents being away I thought I'd order some HBW and some 10x and 15x salvia divinorum. I'm not sure whether it was a combination of chemicals, reading bad reports online or my own sub-conscious that triggered the bad part of this trip, but after ingesting 4 crushed seeds at about 4pm I felt great. Relaxed and happy, the mild trip was uneventful, but unfortunately left me unprepared for the nightmare I was about to face. </p><p>In a flash of misguided inspiration, I thought to myself 'Yes, I'm going for the Salvia'. The HBW had made me let my guard down, my promise to myself to get a sitter out of the window. So I loaded the pipe sat down and took a toke of the 10x. It happened in stages.</p><p>1. Things around started to appear to have a 2 dimensional, cardboard quality. The pictures on the TV, the TV itself, the room itself essentially became a TV screen. </p><p>2. I looked at my hand - it appeared fused - but to nothing in particular. If I was a spiritual person I guess I'd say to time and space or the universe or something but at the time I just thought it looked damn cool.</p><p>3. I became aware my lighter I was holding felt like a living organic part of me. An extra finger, perhaps, and I recognised and tried to remember this feeling from my past. A mistake maybe, because this is when it started to go downhill.</p><p>4. It was as if the drug had gone up about a dozen gears without me noticing. I suddenly felt trapped, lost and confused and began to panic. </p><p>5. I forgot I had taken the drug.</p><p>6. I honestly felt like I was the only thing that existed, as if I was a one dimensional creature, living in some strange blackness or void, despite still seeing distorted versions of everything around me. My heart was racing, I was terrified. I thought I would be in this place forever. I felt like a body without a mind. </p><p>7. This is the most disturbing part of the experience. Some part of me was trying to convince myself that everything was OK, I was only tripping, it would be over soon. I looked down at my pipe, and kept mumbling 'drug' over and over again, but like everything around me, the word meant nothing to me.</p><p>8. I couldn't move, I tried to focus but nothing seemed real to me. Total disconnection from everything and everyone, and absolutely no idea why. I was still trying to console myself but all words and thoughts became a nihilistic tangle in my mind. The only emotion I was feeling was a deep sense of dread and fear. </p><p>9. That was when I appeared to snap out of it. I got ran to the bathroom, shaking and sweating all over, tearing at my clothes. 'Drug, drug, drug, its only a drug' I recall saying before sticking my fingers down my throat and collapsing on the tiles. I remember literally hugging the floor, feeling its coolness, just glad to be back from the strange place I had managed to escape from. </p><p>I guess that about sums up the Salvia trip. I was still a little shaken and the Saliva appeared to have an adverse affect on the HBW 'trip' I was still having. I was shaken and paranoid. I couldn't sleep because every time and started to breathe evenly, I felt I had stopped and felt the need to take a deep breath.</p><p>Now the following morning I am still not sure about the whole thing. Was it as bad as I thought? What triggered it? Will I ever try it again, or have I been scared for life? It will be interesting to see how long this feeling lasts.</p>"
}
