{
 "title": "Stuck in Nothingness",
 "author": "Paul",
 "citation": "   Paul. \"Stuck in Nothingness: experience with Salvia divinorum (17x Extract) (ID 55472)\". Erowid.org. Mar 5, 2009. erowid.org/exp/55472",
 "substance": "Salvia divinorum (17x Extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55472",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2009",
   "2348",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I heard about salvia first from a friend who did it and thought they were in a cartoon so i thought it was pretty cool. I researched its effects online and thought i'd try it out.</p><p>I started sitting in a chair on my deck with three friends. I took the first hit of salvia from a pipe and almost immediately felt its effects. A couple seconds after I blew out the smoke one of my friends asked if I felt anything. I did not respond to this and seconds later I was pulled backwards into blackness and was no longer on my deck (mentally).</p><p>I did not speak at all and could not hear the people around me. Apparently I had stood up and started walking around my deck but I do not recall this. My mind was spinning in this vortex of designs and colors that I can not put into words and I heard the same loud noises over and over again. It sounded like thousands of metal figures were crashing together in a repeated pattern. I could not control my body at all during these hallucinations. I dont know how long any of this was going on because time meant nothing.</p><p>I could now see a huge freighting image of my brother grabbing onto me and trying to pull me back into the endless spinning. I started fighting away from him to escape and he was struggling to keep control of me. I thought he was against me and was trying to keep me inside this horrible world. I heard him over the other noises say, What extract did he have? and moments later I was in the chair again on my deck but I was still hallucinating. </p><p>I saw chains of consecutively numbered blocks about the size of big legos. These chains held me down and I could move at all. I also could not speak because I felt like my face was stuck in one spot. I was afraid that I was still going to be stuck there when my mom got home and would learn what I did. My brother and friends were all huddled around me and my brother was asking them who gave it to me. Then one friend said, Its all going to be ok just stay in the chair. I felt like my friends were all against me and tricked me into doing this purposely to teach me a lesson about taking drugs. This was just paranoia. </p><p>They all said that I was holding my hands around my neck like i was choking and I was breathing very weird. I also was looking at my reflection in the window and looked very confused. Then somehow I was on a lawn chair on the bottom of the deck and my brother was just pulling the last chain of blocks out me. When the last one came out I was pretty much back in the real world and everyone was huddled around me. I started saying things like What just happened? My brother was taking my pulse and it was going incredibly fast and I was sweating really badly. He told me to run out into the lawn because he wanted to see if I was ok. I ran out and was having trouble standing but made it. When I got out into the lawn I was thinking why I just did that and what the fuck just happened. </p><p>I went to sit on the deck to comprehend this madness and I could not stay in one spot and stared flipping out because of the intense heat and confusion. It was like I was in this fucked up dream where anything could happen and when I 'woke up' I did not really remember what happened and it took time to recall the events. This drug is very intense and should not be messed with. It has taught me a valuable lesson about life and I am a little iffy about doing it again because I fear the same or a similar experience.</p>"
}
