{
 "title": "My Natural OBEs Compared with Salvia",
 "author": "Rendi Case",
 "citation": "   Rendi Case. \"My Natural OBEs Compared with Salvia: experience with OBE & Salvia divinorum (ID 55486)\". Erowid.org. Apr 2, 2009. erowid.org/exp/55486",
 "substance": "OBE & Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55486",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 2, 2009",
   "Views: 13393",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In this experience report I will give a retrospective summary treatment to my own out of body experiences (OBEs) as they occur without any psychoactive substance intake, and minimal psychoactive substance intake, and compare these experiences with those I have had with smoked Salvia divinorum. </p><p>I have had many OBEs in my life. I do not believe that my astral body separates from my physical body and flies or floats in ether or what not. I do not disbelieve such concepts either. Then again I do not believe that there is a real physical world (as opposed to unreal worlds of dreams, imagination, hallucinations, etc.) in which I am writing this report either. Belief itself is absurd in our post-medieval, post-Newtonian, post-deterministic world. We experience what we experience and these have differing degrees of repeatability and verification, scientifically speaking, and varying degrees of meaning and impression in our personal lives and can be recalled with varying degrees of clarity or distortion in our infallible memories. So for the purpose of this report I am speaking from an attitude of ontological agnosticism and will focus on the experiences themselves as such. </p><p>I have sometimes have dreams in which I am floating or flying. Though interesting, these are, however, merely dreams that happen to be about floating or flying. There are other dreams that occur while my physical body is laying asleep in my bed, which seem as real as my waking experiences and not at all like dreams, in which I seem to be having out of body experiences. </p><p>These can be thought of as falling into one or more of a few types.</p><p>The wandering </p><p>In this type of OBE I find myself wandering around in my home trying to do this or that before realizing that I am not actually in my body. When this realization hits I can sometimes go into floating or flying mode but sometimes I immediately feel myself sucked back into my body where I immediately find myself awake in my physical body in my bed. </p><p>Sleep Paralysis</p><p>Sometimes I find myself awakening in my bed mentally but unable to move physically. Sometimes with a little effort I can get my physical eyes to open, or to move a limb or what not until I have complete control over my physical body again. Other times I find it much more difficult to move my physical body at all. Sometimes after some struggle I can move my body again. Other times I merely let my mind fall back into sleep and have no trouble waking and moving my physical body later on. From what I understand, this is called sleep paralysis. The more difficult of my sleep paralysis experiences have been occasioned by the following experiences.</p><p>A Dream Within a Dream Within a Dream </p><p>Though not often, there have been times in which I thought that I had awakened from a mere dream or one of these OBEs and tried to get out of bed only to find that I have not actually got back into my body. Sometimes I think that I have really gotten up only to realize within a few seconds that I am still really laying motionless in bed. Sometimes it takes multiple attempts before I either really get up or give up and let myself fade back asleep.</p><p>The Encounter</p><p>Sometimes I find myself sensing what seems to be a presence of another aware and intelligent being or multiple aware and intelligent beings. This is hard to explain, but the feeling is very impressive and very convincing although I do not see or think I see anyone or anything. Usually I feel this being or beings near the foot of my bed or floating a few feet above me. Almost invariably, I find that I am in sleep paralysis when I experience an encounter with these beings. Disappointingly I have so far felt only negative feelings from these beings. This too is hard to explain. It is as if they are so filled with intense terror and despair that they fill me with fear and the feeling that their terror and despair is so deep that a closer encounter with them may do some unspeakable damage to my psyche. I used to struggle to move my body, to open my eyes and get out of bed for a while when these experiences occur. But one time, when I felt these beings floating above me, I decided to let go of my fear, rather than to maintain a shield or resistance. Oddly, I immediately felt these beings suck into me and the feeling of presence and fear was immediately and completely gone. It was years before I felt any fear from these encounters again. The last time I felt an encounter it was again accompanied by fear but once I remembered that there was no reason to fear, the fear simply ceased. As I understand it, this experience, or variations of this experience is common to others. </p><p>The Zoom</p><p>Sometimes I feel myself going from being asleep in my bed to waking up while zooming out of my body. This experience is difficult to describe as well. It feels like a surge of energy coming in short waves and increasing in power until I feel myself swiftly floating out of my body. This feeling is very powerful and I can easily see how this may put someone into panic. I have read some reports of DMT and 5-MeO-DMT experiences that sound to me to be similar. I have not, however, had personal experiences with these substances. This zoom experience has a period of pre-take off and a take off. That is, there is a short period in which I can feel the energy build while I still seem to be in my body and then a transitional period in which I feel myself being propelled out of my body. This type of out of body experience leads into one or both of the following types.</p><p>Floating</p><p>Sometimes my OBEs involve the simple sensation of floating. Sometimes I jump into the air and can stay afloat for a moment or longer and sometimes I can stay afloat indefinitely. Often I go from dreaming that I am doing one of these jump-floats to becoming mentally awake and aware that I am seemingly not in my body, but rather floating about. Once I realize that I am not dreaming, I cease to see dream imagery. In fact I usually see little or nothing when I am aware that I am having an OBE. Often this floating type of OBE makes a transition into the next type. </p><p>Flying</p><p>Sometimes I can fly about in these OBEs. Often I float higher and higher and then fly around. It boggles my mind how realistic this sensation seems despite the fact that I have no real experience of such a sensation in the physical world. I would imagine that flying with a jet-pack or a hang-glider with a jet engine may be similar. These experiences are pure delight for me. </p><p>Swimming</p><p>If going up feels like floating or flying, going down feels more like swimming in light water or thick air if one can imagine such a thing. It seems that up is light and weightless and down is somewhat heavier and there is a noticeable resistance to movement. This resistance is not as strong as the resistance one feels while swimming, but not as light as the resistance one feels from air. There is also another difference in feeling between up and down which I will detail below. </p><p>Up and Down</p><p>As mentioned above, when I go up it feels much lighter (as opposed to heavier) and when I go down it feels somewhat heavier or thicker than up but not nearly as dense as the physical world. But there is an other difference in sensation from up to down. Whereas up feels more heavenly and light (light as in sunlight as well as in not heavy) down feels more under-worldly (though not in the least bit frightening) and dark (though I see nothing in either case). In a way, the lower world seems to give me a satisfyingly subversive feeling whereas the upper world gives me a light-hearted and innocent feeling. </p><p>Day and Night</p><p>There is a final factor that I have noticed. When these OBEs occur at night, it seems a little more vague and I see little or nothing. However, if these occur while I am taking a daytime nap everything feels more solar if one can imagine this. Things seem brighter and sometimes I can see things brightly and clearly. The amount of sunlight in the room is not a factor because the majority of these daytime OBEs occurred while I was napping in a basement room with no windows.    </p><p>The various types of OBEs described above occurred when I had not taken any psychoactive substances or, sometimes, after smoking some cannabis. I have, however, noticed (or couldnt help but notice) that the onset of smoked Salvia divinorum feels exactly the same as the zoom described above with an added circular or spiraling motion to it. There is the same distinct surge of energy and the same feeling of inevitable blast off as I leave my body. But whereas in the spontaneous zoom I feel as though I were leaving my body in a simple upward direction, with smoked Salvia it feels like this is occurring in either a distinct circular motion where I am moving up and backwards in a circle or in an upward spiraling motion. </p><p>With each of the few times I have smoked Salvia (with the exception of my very first time) This zoom feeling has occurred and built into what felt like an oncoming threshold beyond which, I felt, I would have been blasted out beyond the gravity of my body. I have not actually gotten past this point yet. The point is that besides the circular or spiraling geometry the feeling is identical to a spontaneous onset of a zoom into an out of body experience.</p>"
}
