{
 "title": "Horrible Drug-Induced Seizure",
 "author": "Amber",
 "citation": "   Amber. \"Horrible Drug-Induced Seizure: experience with LSD (ID 5549)\". Erowid.org. Jan 17, 2002. erowid.org/exp/5549",
 "substance": "LSD",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 5549",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 17, 2002",
   "Views: 21899",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAfter a long night at work and a few shots of Jaegermister my 18 year old sister came home to a house full of friends. We all had decided to talk her into tripping with us because it was going to be such a pretty day. After about an hour of coaxing she gave in and ate the cubes. <br>After about another hour or so it started to kick in. We were all sitting outside in the sun trying to see whatever we could move. I was starring at a rock and for whatever dumb reason I started moving my head back and forth to make the object seem trippy or whatever. I told my sister to try it, it was cool.<br>That was the beginning of the most horrible drug induced seizure I ever witnessed. After she moved her head up and down a couple times she began to black out. None of us knew what was going on. She began to wave her hand in the air and kept saying 'woah, woah' we all thought that she was swatting at a bee since there was a nest nearby. She then fell into the side of the house and began convulsing. <br>I could hear her teeth grinding together and I will never forget the way it sounded. We all ran to see what was going on when she started shaking almost in slow motion. Her arms were stuck straight out and turned upside down. We took her into the house and sat her under the air until she became concious again. I kept asking her what her name was and she just looked at me like she didn't even see me. I was horrified and will never, ever trip again.\n\n\n"
}
