{
 "title": "Remembering the Finer Points",
 "author": "Chatterbox",
 "citation": "   Chatterbox. \"Remembering the Finer Points: experience with Piracetam (ID 55497)\". Erowid.org. Jan 17, 2007. erowid.org/exp/55497",
 "substance": "Piracetam",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55497",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jan 17, 2007",
   "Views: 17911",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started using Piracetam about 2 months ago and have noticed positive effects.</p><p>I started with an  Attack Dose  of 4800mg (6 caps) for the first 3 days then dropped back to 2400mg in 3 divided doses during the day. At first I felt nothing but it was about a week into my usage I went to the doctor and when asked for my health care card I reeled off the 10 digit number off the top of my head  something I could not usually do. This surprised me so I thought of my licence number ( which I previously didnt look at all that much ) and remembered it, I checked my licence and I was correct. My car rego number  didnt know it previously but could recall it now, I checked and again I was right.</p><p>I want to stress that piracetam is not an Instant Einstein pill, but they do, in my experience, have positive effects on memory and strangely vocabulary.</p><p>I tried taking 2400mg (3caps) in the morning and 2 at lunch and another 2 in the late afternoon for a week and noticed the emotionless spock type feeling others have experienced. Also at this dose I couldnt remember things well. For example, at work I would be told there would be a discharge in room 16c, 2 minutes later I would have to check again which room because I forgot. Went back to 2800mg 2-3 times daily and this has stopped and Im not so emotionless.</p><p>On another note I saw a report that piracetam does not decrease the effects of downers, opiates etc. I would definitely disagree. I use a cocktail of opiates, opioids and benzodiazepines Very regularly (almost daily) and have found if I take piracetam shortly before or any time after it does diminish the effects of these drugs greatly. On a positive note, if I start to get cold, clammy and sweaty because Ive taken a couple too many trams or oxys etc I take some piracetam and within 30 minutes the feeling has gone, so has the high to a great extent : ( . Maybe there could be benefits for mild opiate/ opioid overdose with piracetam?</p>"
}
