{
 "title": "Harsh Smoke!",
 "author": "Explorer",
 "citation": "   Explorer. \"Harsh Smoke!: experience with Damania (ID 55501)\". Erowid.org. Oct 28, 2009. erowid.org/exp/55501",
 "substance": "Damania",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Damiana",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55501",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 28, 2009",
   "Views: 12364",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI ordered an assortment of herbs from a well established website.  The damania looked a lot like the small leaf trimmings from an actual marijuana bud with some thin twigs thrown in.  The raw herb smells a bit like earl grey tea, definitely pleasant and floral.\r\nI loaded and fired up the large bowl of my newly carved grandfather pipe and immediately choked on the harsh smoke.  It tasted nothing like it smelled in the bag.  I managed to get through the first bowl, but couldn't hold onto the smoke for any length of time.  It did make the inside of my mouth tingle a bit, which I have gotten with bides (Indian poor man's cigarettes) so I can't be sure what, if anything, this indicates.  There was surprisingly little cottonmouth, but I also didn't really inhale at least half of the smoke.  I felt a little lightheaded but it was difficult to tell for sure, so in the interest of science I puffed my way through a second bowl.  I definitely feel a bit floaty and relaxed, although motor skills do not seem even slightly impaired.  Thought processes are a bit slower, but no less lucid.  \r\nIn conclusion, dealing with the super harsh smoke is not really worth the effects.  I will try to re-hydrate some of the herb in hopes that it will make the smoke a bit smoother.  I also think the size of the pipe bowl may have conspired to make the smoke harsher then it would have been with a more reasonably sized pipe. Tonight I will try it in a tea in hopes that it will the same effects without having to put up with the nasty smoke.\n\n\n"
}
