{
 "title": "First View of the Shroom Realm",
 "author": "TSC/orphan love",
 "citation": "   TSC/orphan love. \"First View of the Shroom Realm: experience with Mushrooms (ID 55518)\". Erowid.org. Mar 2, 2009. erowid.org/exp/55518",
 "substance": "Mushrooms",
 "bodyweight": "177 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55518",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 2, 2009",
   "Views: 2611",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went into this expiernce not knowing what to expect. I had at this point tried many substances, but the one thing i learned was that all substances are different in their own perspective. I went to buy the chocolates and returned to my apartment. I made sure i had not eaten at all that day. i turned the lights down low and put on my favirite record (sublime gold) and i lit a blunt. I sat for about twenty minutes and began to wonder if i had been ripped off. I decieded to wait it out before calling my sources angry. </p><p>At the forty minute mark my feet seemed to slip out of my awarness and this bodily void began to creep its way up. When this comfortably numb sensation had finally reached my brain i began to notice my thoughts becoming more and more abstract, or so i thouight. I began to get very warm so i stepped on to my porch. As i stepped out into the night i began to notice things were begining to change, walls were waving as if some breeze from another world was swaying them gentely in the wind. When i saw this it did not seem foriegn in any way, it was the thought that wall shouldn't be waving that seemed odd. At this point i decided to go into my apartment because a party of people were starting to congrgate outside. </p><p>I floated to my couch and turned out all the lights. My living room consits of two chairs, a couch, and white walls. I began to let my mind wonder(and deep down i hoped i would never come back), at this point I was at the one and a half hour mark. As I sat in the dark I looked up to the celieng expecting to see the universe layed out in front of me. Upon looking i saw what looked to be a blue circle spinning. I sat and watched this event unfold. The circle began to take on another function. At first it was meerly eterntaining, but the more i looked at it the more real it became. I felt like i was seeing my soul freely flowing in font of me. It began to take on the shape of a tribal design sun. </p><p>When i saw this i stood up and walked into it. When I entered the presence of this sun I began to feel warm and at peace, andi felt more connected to everything than ever before. I stood in the suns presence for about twenty or thirty minutes, after that time i felt i had enough. I turned away from the sun and ventured back to the couch. Upon arriving to my couch the suns presence was gone, but the feeling i felt in my soul's  presence was still there. I sat there on my couch and listened to sounds of all the people in my apartments and began to realize i was the only expierncing this life changing event. I decided that i was handling myself well so i ventured into the night to see what the world could show me. </p><p>As I stepped into the hallway of my building i felt an overwhelming sense of exicement. I stepped into the hallway began walking towards the elevator. The thought that my pupils were the size of half-dollars had yet to occur to me. As i entered the elevator another person walked in behnd me. The elevators in my building are farily dirty. I looked down to see the dirt swirling arounf on the floor like a whirlpool of sorts, this image different frighten me but it was amusing. I began to laugh and i couldn't control it, the other person in the elevator looked at me and said 'Dude you look like you are trippin balls.' With the words from the kind stranger my mind decided it was time to go back home. </p><p>I went back to my apartment and smoked some more, i sat on my porch and watched a thunderstorm roll in. After about six hours from taking them the visuals became few and far between, when my normal state of thoughts returned i looked back on everything that had occured and i realized from that one piece of chocolate my whole perception of the world would be forever changed. This change was the best thing to happen to me. I at this point had no spiritural beliefs. That was the most spiritual expeirence i have ever had(through out my life i was exposed to church). I feel from that expeiernce that shrooms are beatiful gift of god not be abused but enjoyed. Shrooms are not for everyone so if you choose to take them understabnd what you are getting into and enjoy.</p>"
}
