{
 "title": "Get This Monkey Off My Back",
 "author": "Slaz",
 "citation": "   Slaz. \"Get This Monkey Off My Back: experience with Oxycodone (Oxycontin) (ID 55527)\". Erowid.org. Nov 9, 2008. erowid.org/exp/55527",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Oxycodone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55527",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2008",
   "Views: 9227",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAbout 9 months ago I blew out a disc in my back while doing some work around the home.  Over the course of the nine months, I went from doctor to doctor, each one prescribing me something different, or injecting me with steroids, trying to find a way to fix it.  Turns out the only fix was surgery, which I had later.  But for the duration of the time my disc was blown, I was in severe pain, and nothing the doctors gave me would make it better.  Enter Oxycontin.  A relative was in chronic pain and was prescribed Oxycontin in large quantities.  Relative told me I was welcome to take some of them.  Desperate to get out of pain, I gratefully accepted them.\r\nI had dosed Oxy before, but always orally, never crushed/broken.  So I thought I knew what to expect.  I had a 40 which I broke in half, I cleaned the outer coating off by licking my finger and rubbing the coating -- this makes it come off easily.  I crushed 20 Mg (half of the 40 Mg pill) into powder and proceeded to insufflate (snort) it up.  The rush came on me over the course of a few breaths.  It became so strong that I had to sit down and recline to avoid the nausea.  At this time, I was concerned that I'd overdosed, having done thorough research that indicated people have died from overdosing on this drug.  I decided I would not allow myself to sleep.  The next thing I did that helped was to create a focal point to focus attention on -- in my case, I loaded up a video on my laptop and watched a couple shows.  By this time, the rush was gone, replaced by a warm, fuzzy body buzz.  It felt like energy was coursing through my body, it was like Tai Chi except a thousand times more potent -- it was incredible!  \r\nThe next thing I know, I'm grabbing another.  And another.  And soon, I've doubled the dose to 40 Mgs, insufflated (1 pill).  Then I'm doubling the dose to 80 Mg (2 pills).  My tolerance got so high, that even a stronger dose, such as 80 Mg, hardly hit me.  That was probably the highest dose I dared to take at one time.  Some times I'd dose 80 Mg and then take a booster dose of 20 Mg after about a hour.  My use skyrocketed.  I was burning through 200 Mg a day, easily.  Soon, I was using too many of the pills.  I had to quit, but the monkey on my back had grown too big.  I was a willing prisoner to the drug.  It's not a glorious thing, realizing you're a slave.  I looked around, and everywhere I looked I saw a user (to help justify my own use).  I was cynical, I kept telling myself, 'everybody's doing it.'  Well, everyone is not.  There are some users out there but for the most part, you have to believe there are people in the world who don't need this shit.  People who know when to stop.  I didn't know when to stop.  I didn't even know how.\r\nI finally hooked up with a surgeon who had me undergo an MRI to ascertain the damage to my back.  Once he knew what it was, it was a simple surgery to fix it and set things right.  He prescribed me Oxycontin for the pain, since that had been what I was taking.  Overall, he probably prescribed me 50X20 Mg pills.  I burned through them in days.  What happened next could only be described as utter hell.  Once I had no more of the drug, I decided I had to do something -- I didn't want to take any more of my relative's drug, I had taken too much in the past.  It was a problem.  So, I stopped, cold turkey.  \r\nOver the next few days, I was in misery.  I stayed home from work -- there was no way I could've worked when feeling like that.  Nausea, clamminess, hot/cold flashes, sweating.  Every cell in my body screamed out in agony.  It was screaming for Oxy.  Well, I did finally allow it in very small, controlled doses, administered to me by my relative, who kept me in line, and managed to wean myself off of it, by doing 20 Mg every two days, every three days, until I was off of it.  Weaning off of it was definitely better than cold turkey.  I could snort 20 mgs and the withdrawal symptoms would magically vanish, for a day or two.  I've been off of it now for a couple weeks.  My mind is still convinced I need it, the monkey is still on my back.  I suspect the monkey will be there for the rest of my life.  I became an addict.  I became a statistic.  All because I lost control of a drug.  I never thought I would.  In the past, I've tried things -- never taken them this far, though.  \r\nIn my experience, three days of constant use has been enough to hook me.  Quitting Oxy has been one of the hardest things in my life.\n\n\n"
}
