{
 "title": "Afraid of Dust",
 "author": "Mindless",
 "citation": "   Mindless. \"Afraid of Dust: experience with Methamphetamine (ID 55561)\". Erowid.org. May 13, 2008. erowid.org/exp/55561",
 "substance": "Methamphetamine",
 "bodyweight": "94 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 55561",
   "Female",
   " ",
   "Not Given",
   "May 13, 2008",
   "Views: 11067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been using crystal meth for about a year. I had been injecting it only for about 3 months. About a week before I got arrested and ended up in long term rehab, I lost my mind and had the most frightening experience of my life.</p><p>I was driving to see a friend. I was high as a kite, feeling good. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I had just shot up right before I left my house, so everything was great. I was smoking a cigarette and I went to throw it out of my sunroof. About five minutes later a whole bunch of ashes fall on me (it turned out the cigarette didn't go anywhere, it got stuck between the sunroof and the inside of the car). It was then that I lost it. I felt the ashes land on my arm and I immediately freaked out. I cant really explain what I felt - it was just fear. I pulled over and began wiping myself off, and I felt the strong need to wipe every piece of dust off the dash board of my car. I had to have everything spotless - I felt afraid of dust and afraid of ashes and afraid of everything.</p><p>I picked up my friend and I didn't tell him what happened. I was too embarrassed and I just wanted to let it go and forget about it. A few hours later after I dropped him off I was parked in my car freaking out. I saw things coming out of my skin and I couldn't get them to go away. I saw things coming out of the seat of my car - it was almost like every surface had pours and they were all exploding and threatening me. I was so scared! I didn't know what to do. I saw little black specs coming through my skin. I sat there and squeezed and picked and tried so hard to get them out but they just kept coming back. Every particle of dust that I saw (and I saw alot) frightened the hell out of me. I would jump and almost scream whenever I saw any. </p><p>I never want to feel that way again.</p>"
}
