{
 "title": "Doesn't Play Well with Others",
 "author": "Mr. X",
 "citation": "   Mr. X. \"Doesn't Play Well with Others: experience with Salvia divinorum (5x extract) & Amphetamines (Adderall) (ID 55585)\". Erowid.org. Mar 3, 2009. erowid.org/exp/55585",
 "substance": "Salvia divinorum (5x extract) & Amphetamines (Adderall)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "  T+ 24:00",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55585",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 3, 2009",
   "Views: 3255",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOK, so I like experimenting with new things, and one day, salvia caught my curiosity. After doing a little research and discovering its legality, I ordered some from the internet. I ordered a gram of 5x and a gram of 10x. I decided I'd start with the 5x and figured if the effects were pleasent, I'd try the 10x. So I loaded my glass bubbler with some 5x and fired it up at around four.<br>I inhaled the first hit and quickly loaded up the second, knowing that speed is imperative when dealing with salvia. I didn't want to overdo iot one the first day, not having a sitter and all. So after the second hit, I put my pipe down and lied back in my bed. As expected, nothing really happened. It just felt like a very light marijuana buzz. Disappointed, I continued the rest of my day without any incident resulting form salvia. That is, until the next day.<br>I work as a dishwasher (I know it sucks but I'm only 18), and I have ADHD, so I take my perscribed 20mg of Adderall before school or work. It was 3:45pm when I took the Adderall. It usually will kick in 20 or 30 minutes later and I have fuel to get me through the night. This day however was different.<br>About 1/2 hour after I took the Adderall, I'm in the middle of punching fries in the fry press, when I suddenly start to feel a little light headed and woozy. I shrug it off and continue on with my duties. 10 minutes later, one of the chefs finds me propped up agianst the freezor. I feel TOTALLY stoned! He takes me outside and has me sit down for a while. I sit out there for about an hour watching the trees wave at me and the ground ripple like a black asphalt sea. A truck pulls into the parking lot, and although it's about 100 feet away from me, I jump in my chair out of the way, convinced it's going to hit me. I slowly return to normal and continue on with the rest of my night. EVERYONE who works at this place smokes weed, but a few others other are harcore consumers of illicit substances. It is not at all uncommon for a chef to come in stoned out of his face, so of course my little trip was received with laughter rather than trouble. <br>I am convinced that my trip at work was the result of the Salvia I smoked the day before.\n\n\n"
}
