{
 "title": "A Calm Evening",
 "author": "Garrix",
 "citation": "   Garrix. \"A Calm Evening: experience with Syrian Rue (ID 55640)\". Erowid.org. Mar 6, 2009. erowid.org/exp/55640",
 "substance": "Syrian Rue",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55640",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2009",
   "Views: 11837",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have a stomach that does not do well with psychedelics (mushrooms, acid, cacti), so I decided to try an MAOI, in the event that in the future it will allow me to ingest these at lower doses with a greater potency.</p><p>I had abstained from tyramine-containing foods for over 24 hours (and followed up with that regimen as well). The night came of my planned experiment, and I was feeling rather irritated with myself for not having worked all day.</p><p>+0:00 I measure out a tablespoon of seeds, wash them, and begin eating, crushing them in my mouth very well before swallowing.</p><p>+0:15 My mouth is pretty numb.</p><p>+0:20 I read a little Lewis Carroll. Something he writes is so clever, that I chuckle. All of a sudden, I feel much better emotionally, and my funk is gone. I take a shower and sing.</p><p>+1:00 I haven't felt much of anything up to now (but I've been distracted, getting ready for a party. All of a sudden, entering a room with lights, I notice crystal-like trails when I move my head. I noticed this the one time I drank ayahuasca tea, which I also prepared with rue.</p><p>+1:45 I experience some nausea. I'm also feeling a bit distractible, and do rather poorly at boggle, a game at which I generally excel.</p><p>+2:30 I'm walking around, and not feeling so well. I almost run to a bathroom to puke, but decide against it.</p><p>+3:00 The badness has subsided, and now I'm just seeing the crystal trails every once in while. I notice nothing exceptional with my eyes closed. It's not unpleasant, just 'there.'</p><p>+5:00 I notice that the trails are pretty much gone.</p><p>All in all, a good experiment. In the future when I take psychedelics, I will do so at a lower dose, having taken an MAOI 2 or 3 hours prior. I think I will blend the rue in the future. The nausea and the 'rue burps' were the most negative aspects of it, however, the whole experience was pretty calm. I don't know if the mood shift was purely due to Carroll (he is awesome), or if it had something to do with the antidepressant effect of the rue.</p><p>Good luck, and be safe!</p>"
}
