{
 "title": "The Deepest Sleep",
 "author": "Mindgame",
 "citation": "   Mindgame. \"The Deepest Sleep: experience with Amitriptyline (ID 55643)\". Erowid.org. Jun 16, 2007. erowid.org/exp/55643",
 "substance": "Amitriptyline",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55643",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 23671",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well I have had sleep problems for quite a while but my mom is too afraid to let doctors prescribe anything for me in fear of sleep aid dependency. So I was rummaging through my step dad's medications and found amitriptyline, and with a little help from the internet found out that it was a sleep-aid, and anti depressant. The first time I took 2 pills at about 11pm and feel asleep on my own feeling no effects at all. The next morning I woke up feeling like I hadnt slept in days. from about 11am to 6pm I lay on my couch and watched TV.</p><p>I assumed that the effects for this drug took awhile to set on and I was correct.</p><p>The next time I took 2 pills at about 6pm and didnt feel any effects until about 9pm when I was about to take a shower. While in the shower I felt like I was dreaming, and even lay down and feel asleep in the deepest sleep I have ever felt. All the other experiences talk about some kind of trip that happened after taking this drug, but the only thing it made me do was feel very very very sleepy. After I forced myself to get out of the shower in fear I would fall asleep and stay in there for hours I went to my room and tried to sleep. It took about 2 minutes of lying down before I was in a state of complete sleep. </p><p>I felt like I had been dreaming for days and days. I woke up the next morning feeling fine like I had gotten a full 12 hours of sleep. I still sometimes take some of my step dad's amitriptyline when I have something important to do and know I cant sleep.</p>"
}
