{
 "title": "Edward Scissorhands and Oriental Rugs",
 "author": "Edudyawon",
 "citation": "   Edudyawon. \"Edward Scissorhands and Oriental Rugs: experience with Mushrooms (ID 55664)\". Erowid.org. Apr 1, 2007. erowid.org/exp/55664",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55664",
   "Male",
   " ",
   "Not Given",
   "Apr 1, 2007",
   "Views: 2910",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me start of by saying that I've done a good amount of mind-altering substances in my lifetime including: Alcohol, Tobacco, DXM, Heroin, Cocaine, Cannabis, and Inhalants. With that said, onto my experience with the fungus among us.</p><p>I had been wanting to try mushrooms for a while until about two weeks ago. My friend, we'll call him 'K', had finally been able to get his hands on an eighth. He took all of it himself and called me to come chill with him and a few friends. He wasn't very talkative, he just giggled at almost everything. Unfortunately for him, he had a pretty hard comedown and started freaking out. Afterwards, however, he claimed that it was amazing and that he definitely wanted to do it again. This made me want to do it considering that he did an entire eighth and didn't feel too bad. So about two days later, he bought another eighth for him and his on-and-off girlfriend 'G' to split and an eighth for me and my friend 'J' to split. We got to our spot which is a strip of fields for power lines to cross through. We pulled out the baggies and wrote ourselves notes in case we had a bad trip. Mine read something like 'My name is ____. I just took mushrooms. I will come down after about 6 hours and everything will return to normal. There is nothing to worry about at all.' At the bottom I proceeded to draw a stick figure which would hopefully be something to giggle at later on in the day. At almost exactly 6:00 in the afternoon, we ate our share. J and I split up our baggie by three caps and three stems to each of us. I assume K and G did the same although I wasn't paying much attention to them. They tasted fine although G had gagged a bit. K smoked a cut of a blunt that he had saved from the other day and we sat around waiting for the effects to kick in.</p><p>While we were waiting, J and I walked around the field observing our surroundings and rambling about how we couldn't believe what we had just done. I walked away for a little while and found a bright red triplet of connected leaves springing out of the ground. I found it strange since it was the only one there that I could find, so I pulled it out, twirled it a bit and tossed it somewhere. I continued walking around until I found a bright yellow and pitch black mixed feather. It was amazing that I had found it since I had never seen anything alike it in my town or probably anywhere. I showed everyone else and they thought it was pretty cool. I decided to keep it for later because I figured it would trip me out. I stuck it in my cigarette pack for safe keeping. Eventually the nervousness settled and J and I decided to sit down at one of the columns to the power lines. This is where the magic begins.</p><p>(6:30) I start feeling a strange sensation, something I've never felt before, almost like an electric current is running through the outermost layer of my skin. I start giggling and telling J about it. Then come the visuals. The grass to the left of me gets greener and greener with each passing second and the power line tower turns a bright mustard yellow. I told everyone about it and they noticed it too. Then I looked out over the field and it seemed as if every single blade of grass moved in unison and arched toward each other making some kind of knotted pattern. Soon after I noticed that, all the edges of the grass started growing this white fuzzy glow around them and eventually the entire landscape started waving almost as if someone had draped a paper-thin transparent oriental rug over it. The patterns and colors were amazing. All the trees seemed to have a pattern as well and I felt as if they were smiling at me. I didn't actually see this but that's the way it felt to me. After observing this, I took a look at the ground and all the dead grass started wiggling around like worms. I was amazed by what I was seeing and I remember claiming a few times that 'I never thought I could actually see things like this on any kind of drug.'</p><p>(6:45) G apparently had to go to see her grandmother so we decided to walk her out to the street and wait for her to get picked up. We walked through the small path to the street where we had parked and as soon as we got out, I was in total awe at the colors of the houses. Being that I live in one of the most suburban towns in the US, all the houses began to look like the houses in Edward Scissorhands. Ridiculously vivid colors and bright whites and dark blacks. I specifically remember one house which was bright white with extremely vivid red shutters and as I looked at it, it turned into a winter wonderland house as if it had snow on it and was all decorated for Christmas even though it was the middle of the summer. All the edges of everything had a white halo around them. Also, all the grass seemed to change into that of a cannabis leaf, except more thinned out and pointed. Greens became greener, whites became brighter, and the end of the street looked like an oil painting. So K and G sat on the curb while J and I inspected the surroundings some more. We came across the corner house and its lush garden filled with sunflowers and daisies. I would later find out that the entire garden was almost completely dead, but at that point in time it looked like the garden of Eden. I looked at the street and all the white speckles started moving and waving and it looked like and army of teddy bears all laying down and every now and then, they would lift up their heads and look at me. Waiting for G's ride felt like an eternity even though it was only about 15 minutes. I walked around on the sidewalk and drifted into my own world. I found a dead daisy toward the edge of the sidewalk and as I looked at it, it came to life, all the color that was lost came back and as I picked it up, I concentrated on my hand and the daisy and somehow managed to turn it into an oil painting. My hand, the daisy, and the sidewalk became one. After that episode, I resumed talking to J while K and G sat on the curb. J and I came up with the idea that the two of us belonged to the purple race (given our fair complexity magnified by the mushrooms) and that G and K were of the orange race (given their, dark, tanned complexity). Eventually Gs ride came and the remaining three of us continued to smoke cigarettes and bullshit. A storm had been looming for a while but none of us really thought much of it until it started drizzling. It eventually stopped and we decided to go back to our spot. We went into the wooded area there (which seemed like a level of Zelda 64) and almost as soon as we got there, the drizzle turned into a sudden downpour. We bolted back to the car running through the small pathway, hitting our heads on overhanging branches. This sprint seemed like a year in Vietnam during the rainy season. We eventually made it back the car (I use eventually lightly considering the run only lasted about 30 seconds at most) and hopped in.</p><p>(7:00) Completely soaked, we began emptying our pockets to see what got wet and what didnt. Luckily my stogies remained dry, however most everything else on me, including my note, my phone, and my wallet didnt. Upon finding my note, I began reading it. As soon as I looked at it, the letters started melting and warping. The letters also stood out with so much contrast to the paper that I couldnt take the paper away from my eyes for at least a good 5 minutes. K popped in a CD which was exclusively dedicated to a gypsy-punk band. The music seemed to go extremely fast and seemed a lot louder than it actually was. As I sat in the car, I started switching from blazing hot to ice cold faster and faster and my mind began to wander. I felt as though I was insane. Everything got darker, the rain got louder and harder, and the music made me feel as if I was on some insane carnival ride and I could not stop laughing. I grabbed a hold of the seat in front of me and my body felt as if it was totally liquid, as if I would melt if I let go, which I did from time to time. I was extremely hyper and I hit the seats and doors in order to control my excitement. Not hard enough to hurt myself or damage the car but just as a release of pent-up anxiety and nervousness that had all come out at the same time. After what felt like a lifetime, the rain finally stopped and we decided to get out to have a cigarette. Apparently during that time that we were in the car, the entire town was under water. We had to jump from our seats in order for our feet to keep away from the 2 inches of water that had surrounded the car.</p><p>(7:30) We got out and lit up and walked aimlessly around the car and planned on walking to the park down the street since driving was beyond impossible. It took us a good 15 minutes to actually get up and start walking because we kept looking at everything and straying from the subject at hand. We walked at a brisk .5 mph down the street and finally got to the park. Everything around us was soaked and the sun had gone its final stretch to its setting. We walked on the sidewalk next to the park and saw a water fountain which I found extremely ironic considering we were totally soaked from head to toe, as was the entire town, and yet we were so happy to find a water fountain. After the water fountain we set off to our local pharmacy to meet our friend A. The walk took forever and we finally got there. We walked in and the colors were just overwhelming. Since its a chain pharmacy, they have plenty of money to invest in flashy advertising and decorations which at the time seemed like walking into a candy store. We walked around, giggling to ourselves at the flashy vivid colors and the strange customers with mullets. I proceeded to the drink section where I grabbed a bottle of flavored seltzer. I walked through the aisle pointing at things and I specifically remember whispering to K Dude, that is NOT that pink! and cracking up under my breath. I went to the counter to buy my seltzer and looking in my wallet, I noticed that I only had a five. Since the bottle was only 89 cents, I decided to pay in quarters. Cracking up the entire time right in the cashiers face, I fished out 4 quarters and gave them to her. She seemed a little agitated since the whole ordeal probably wasted her time. Be that as it may, I went outside to meet J and K who were standing near the door. We waited for a while when our friend D, who worked there, came up to us and asked what the fuck was going on. We told him and he laughed and told us how he had to go in. A little while after he left,  A walked over. K and I started laughing uncontrollably. This is when I started to come down.</p><p>(8:15) We decided to walk down the main street and I fell a bit silent as I was battling with my nausea. I began to get a little paranoid that I would puke on one of the main streets or someone would see me and call the cops on us. My throat became kind of numb which added to the nausea because it felt like I had a lump in my throat. K had already started coming down and J didnt have too much of a body high to come down from. We made our way back to the car and stood around it for a little bit. At this point I was extremely nervous about K driving and was definitely not up for a car ride even though I just wanted to sit down and chill and get somewhere else. The other three, went back into our spot and grabbed some booze to bring somewhere else to drink. Once we got it, we all hopped in the car, me in the back seat and K began driving to a different spot near his house. I was really freaking out at this point because while we were driving, it felt like we were going extremely fast and drifting into other lanes. However, I trusted A to make sure K was able to drive alright. The entire car ride I was glued to the seat, pressing back and clutching anything I could. The drive only took a few minutes and we parked and went into the woods. The three of them drank while I struggled with my nauseous feeling. I wasnt paranoid anymore since we were out of public sight but I still felt a little sick. When they finished, I started feeling better.</p><p>(10:00) We left the woods and went to a convenience store a block away. The bright fluorescent lights did wonders for me because at that point I started feeling sober again and the letter I kept in my pocket stopped melting off the page. Once we were done at the store, K and A went home and I walked with J back towards my girlfriends house. He walked me to the corner where we sat and smoked a cig and then walked me over to her place. Then he walked the block over to his house and I chilled at my girlfriends house for the rest of the night. I was extremely happy to see her because I had been thinking about her the entire night especially during my episodes of paranoia. Just being with her made me feel a lot better. I stayed there for a while and around 1:00 I walked home.</p><p>Now as I sit here smoking the last of my cigarette, I think about how great that trip was and how much I anticipate my next one. Next time I plan on doing it at the same place but earlier, probably around 2:00 and coming down around sunset. Mushrooms are intense and extremely fun if you know what youre doing and you prepare yourself. If you took the time to read all of this, I thank you and I hope that my experience helped you in the long run.</p>"
}
