{
 "title": "Living in Random Objects",
 "author": "T$$$$$",
 "citation": "   T$$$$$. \"Living in Random Objects: experience with Salvia divinorum (extract) (ID 55682)\". Erowid.org. Jul 20, 2009. erowid.org/exp/55682",
 "substance": "Salvia divinorum (extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 55682",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2009",
   "Views: 2195",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe beginning of my strange journey into an absolutely terrifying world is somewhat blurry to me. Me and a friend decided to use his 3 foot bong to smoke salvia for the first time. My girlfriend was there as a sitter but she actually made things worse. We hadn't really prepared much of anything for this new experience we were about to engage with except for the setting that we would try it in. We wanted to do it outdoors and somewhere beautiful. I wish I could remember the exact strength of the salvia we had purchased but I don't clearly remember. I know we payed $90 for about a gram of purple sticky salvia. I want to say it was 24x but I'm not exactly sure.<br>So the journey started off like this. We were at a rather large lake surrounded by pine trees and beautiful scenery. We followed a trail until we came to a small clearing (surrounded by massive pine trees) and set our bong down on a small picnic table. My friend (for this story Eric) loaded up a decent sized hit of salvia packed on top of weed. He milked up the bong and cleared it. He immediately started giggling like a child and started walking around uncontrollably kicking his legs high into the air. I was extremely excited and it was my turn to hit the bong.<br>I quickly said 'Hold on I'm coming' as I packed even more salvia into the bowl. I milked it up but my girlfriend made me laugh so I exhaled the hit and took another. The taste was strange and gross. Bitter and somewhat harsh. I took a massive hit. Holding it in was not an option for me because I almost immediately stumbled backwards and blacked out for about 1 minute. The only thing I remember before the black out was stairing at a giant red and blue tower made of legos, which is explained by the red and blue bong we used. I would later on realze that I wasn't seeing legos but a series of neverending layers. I don't remember this but my girlfriend and Eric both told me about it. My girlfriend was trying to talk to me asking me questions but according to her I had a blank terrified look on my face and I didn't even know she was there.<br>When I finally 'woke up,' I guess you could say, I was in a completely different world! Life in every form had slowed down so much that I could see a million layers in every object I looked at. I deeply understood life and how time worked. I remember standing up and swaying back and fourth almost falling over. The billions of layers that I saw could be compared to a rolled up newspaper, each one clearly having the words keech up on them.<br>I was absolutely terrified, the one thing that kept me from running into the lake was talking about what I was seeing to my friend. I kept saying 'U know where I am' 'Your here with me right' hoping that I hadn't gone completely insane. I started walking towards the table, all I wanted to do was sit down and fall asleep. I had almost made it to the table when somehow I wasn't in control of my body any more. I was one of the billions of layers inside of my body and I was actually seeing the world from as a layer in my right hand.<br>For some reason my body decided to wave at my girlfriend and as my hand passed by her I had never felt so scared in my whole entire life. I thought I would be in my hand forever and whatever had taken over my body had taken it over forever. This next part is truly hard to explain. The layers inside of my body were basically smaller copies of myself. My biggest fear was this: A part of me had taken over my body and would live as the main controller of my body forever, taking away everything in my life even my girlfriend. But this all changed in a matter of seconds...<br>I sat down at the table and decided to close my eyes. This really made everything a lot more intense but I didn't care, I was trying to go to sleep and forget about everything. I would here a loud noise and all of a sudden I would be a layer inside of random objects. The first object was a book. I thought I was living my whole life inside of a book. Not a character in a story or anything like that just the outside of a book. Everywhere I looked there were millions of books, I didn't know what to think. Then seconds later everything would turn black for a split second and I would be living in another object.<br>I saw a house, the house I grew up in. I was falling about to land in my living room but before I could slam into the ground I sort of just stopped right above the ground. I had floated into the end of a fireplace mantle. I saw my mom, dad, and two brothers living there lives not knowing that they were inside of the fireplace mantel but thinking they were living a normal life. I wanted to tell them but I couldn't. I didn't want them to know. I honestly thought that for the rest of my life I would be living in whatever object I had turned into at that moment. <br>I then heard Eric talking to me trying to calm me down. He kept saying 'You have to just understand that u smoked something weird and accept the fact that your messed up right now and make the best of it.' This really helped me I started calm down and I even managed to start talking to my girlfriend, who wouldn't stop asking me questions about how I felt. I tried explaining what I saw but it was impossible. <br>About 15 minutes had passed by and the effects of the salvia were almost unnoticably wearing off but slowly I was lifted out of that strange layered world. I was still scared though I was afraid to leave the picnic table. I then heard something crashing through the trees. I looked up and saw a deer stairing right at me. It was probably no more then 20 feet away from us right near the tree line. I then heard something behind me so I turned around and saw another deer looking directly at me. This freaked me out I didn't know if was seeing the same deer or a different deer. <br>The deer ran off and we all decided to go back to the car. It was a terrifying thought knowing that I would have to leave the safety of the picnic table. But I led the way anxious to get into the safety of Eric's vehicle. I felt safe once inside the car even though I was feeling the effects quite strongly after about 30 minutes. I felt strange for the rest of the night and had a very different outlook on life. <br>I cannot fully explain what happened to me that day but that's how I feel every time I have a crazy trip. I have tried acid, shrooms, and varius other drugs and I have to say for the peaking minutes of salvia it is the craziest thing I have ever tried. In the end I was glad I tried it and glad I had such a crazy experience.\n\n\n"
}
