{
 "title": "My Nose Is on Fire",
 "author": "Yurt",
 "citation": "   Yurt. \"My Nose Is on Fire: experience with Bupropion (Wellbutrin) (ID 55685)\". Erowid.org. Jan 1, 2011. erowid.org/exp/55685",
 "substance": "Bupropion (Wellbutrin)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "insufflated",
   "Pharms - Bupropion",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55685",
   "Male",
   " ",
   "Not Given",
   "Jan 1, 2011",
   "12880",
   " "
  ]
 ],
 "report": "<p>About a year ago my friend gave me some Wellbutrin at my request because I had read some interesting trip reports and wanted to see what kind of effect it would have on me. She gave me a few pills and I kept them, forgetting about them until yesterday.</p><p>I was rummaging around in my room and found them and decided, what the hell, I'm not doing anything else today and it might be interesting, how wrong I was. For some reason I decided that insufflating them would be the best route, I read how painful it was, but I had snorted ambien recently and figured it couldn't be as bad as snorting that was. I cut that shit up and had just one line of powder.</p><p>I snort. PAIN. I got half way through and holy fuck it feels like someone has punched me in the face with needles, not only that, the inside of my left nostril feels like I've put a very sharp knife up it. Not pleasant, but I grit my teeth and do the rest of the line... OWWWWWWW. Surprisingly it didn't improve at all. I figure the worst is over with and start cleaning up getting prepared for the experience in the short time I have. I then grab a paper towel and wet it with cool water, and breathe through that but it really doesn't do anything for the pain.</p><p>After 30 minutes the pain is so unbelievably present that I start thinking I've done permanent damage to my nasal passages, or maybe a sharp piece of powder somehow didn't get crushed and is just lodged in my nose. That's when I start snorting some water with a bit of salt in it, this doesn't do anything for the pain either. I'm upset to say the least.</p><p>I'm able to focus on the high for about 10 minutes tops, and during that point I feel great, it feels a bit like a dull amphetamine high. I'm looking forward to things in my near future and whatnot, and then the pain quickly returns to the front of my mind. With it comes dysphoria which I really don't need at this point, I can only focus on how stupid I am for snorting an anti-depressant pill. I then wash the rest of the pills down the sink. I want nothing to do with this shit any longer.</p><p>One hour later and it feels like I have the flu, my nose has somehow found an infinite source of mucous, requiring me to blow it once every few minutes. I have a headache, and just basically feel horrible and slightly depressed... ironic.</p><p>5 hours later is when I first notice that the pain has subsided enough to where it's not the only thing on my mind. However, it's still noticeable right up until I go to sleep, about 12 hours after snorting the line.</p><p>Once I wake up in the morning the pain is completely gone and my nose feels back to normal. I'm not sure why I reacted so much worse to it than anyone else I had read about or talked to, but I did.</p>"
}
