{
 "title": "Medicinal Benefits for Me",
 "author": "Tiamat",
 "citation": "Citation:   Tiamat. \"Medicinal Benefits for Me: experience with Kratom (ID 55692)\". Erowid.org. Mar 17, 2007. erowid.org/exp/55692",
 "substance": "Kratom",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "20 g",
   "oral",
   "Kratom",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55692",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 17, 2007",
   "Views: 10944",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirst off, I want to say that Kratom is a miracle plant. \r\nI have been using kratom very regularly for nearly two years now.  Sometimes I use Kratom every day.\r\nI have experimented by taking 20 grams crushed leaf EVERY DAY for one month and then quit abruptly.  I stayed off the Kratom for one week and found that I had NO physical withdrawal symptoms.\r\nI did have an urge to take Kratom though.  The reason for this, I believe, is due to its medicinal qualities, not any addictive properties.\r\nI have suffered with a medium level of depression my whole adult life.  Kratom has cured me of my depression and I therefore do not want to discontinue taking my medicine.  \r\nHere is a list of the great things that Kratom has done for me:\r\n1)\tKratom makes me more social and thus reduces my use of alcohol to make me more comfortable in social situations.\r\n2)\tKratom eliminates my depression.  I only take one dose in the evening and the elimination of my depression lasts 24 hours.\r\n3)\tI often suffer from very annoying allergies (hay fever) and Kratom completely eliminates my hay fever.  It works much, much better than OTC antihistamines.\r\n4)\tKratom gives me physical energy which often comes in very handy as I am a musician and often have to stay out late and lug around lots of equipment.\r\nThe only negative side effect that I have found is that I very occasionally get nausea when I eat while under the influence of Kratom.  On the off chance that I do vomit, this act immediately makes me feel 100% better (It is not like alcohol where I keep puking until I dry heave and I still feel sick)\n\n\n"
}