{
 "title": "Destroyed My Love for Weed",
 "author": "Ex-Stoner",
 "citation": "Citation:   Ex-Stoner. \"Destroyed My Love for Weed: experience with Cocaine & Cannabis (ID 55698)\". Erowid.org. May 19, 2008. erowid.org/exp/55698",
 "substance": "Cocaine & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55698",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2008",
   "Views: 23619",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe past 2 years I've tried numerous drugs (marijuana, mushrooms, mescaline, lots of ecstasy), but a couple months ago I decided to give Cocaine a go. This was a decision that ruined my life.\r\nMy favorite activities involved drugs, especially marijuana. It was a way to have fun, a way to chill and relax with my friends or when I was alone. I would smoke weed all day every day, and I told myself I would smoke weed for the rest of my life. Wrong. I was watching the movie Scarface, and that immediately sparked my interest for cocaine. I knew it was bad for the body, but hell, if Tony Montana could do it, I sure as hell could too. I called up a friend who I knew had the connection. He called me back with the good news and I bought a gram for $50. I went home, cut up a few lines, and felt amazing. I felt strong and confident, and best of all, in control. I did this continuously for a few days, using Cocaine instead of the usual weed. \r\nThen, the hellish night came. I was staying up pretty late alone in my room, and when I decided to quit I had done about 4 good-sized lines in a period of about 4 hours. After about an hour or so it started to wear off, and naturally I felt shitty. I was still pretty awake, but I wanted to sleep. In the past, whenever I couldn't sleep, smoking would always put me out within a couple minutes. Not this time. I smoked 3 snappers and crawled into bed. Not 2 minutes later it started.\r\nMy heart started racing extremely fast, I could see it thumping underneath my skin. Thoughts of death and going insane quickly flooded my mind, thoughts of total fear. As 10 minutes passed, it grew more and more intense. By this time I feared a heart attack, so I checked my pulse. My heart was racing at 160 beats per minute with no sign of slowing down. Fear of death, and humiliation from my family were all I could think about. The next 3 hours were exactly the same, extremely fast heart beat, cold chills, dizziness, and a flushed, white face. I was promising I wouldn't ever touch Cocaine again. All the while I was thinking of how I was going to die, and what my family and friends were going to think. \r\nIt finally subsided about 3 hours later, enough to where I was at least able to sleep. When I woke up the next morning I felt fine, almost as if nothing happened. I felt deep remorse for what I had done, as if I had betrayed my family. I had promised myself I would never do it again, but 2 days later I quickly gave in. Then it happened again. All of the above symptoms, but this time weed was not involved. Just 7 lines spread out from 3 p.m. to 11 p.m. Once I snorted that last line I felt that horrible experience all over again. Identical to the first bad trip. \r\nAfter this, I have never been the same. A week later I tried smoking a few snappers of some pretty good weed and I started freaking out. My heart started racing and I felt awful, but it was only weed! I've tried smoking several times since the last bad Cocaine experience a couple months ago, but it always leads to a panick attack. Since then, I have had about 2 weeks of severe depression and anxiety. I would sometimes feel like I didn't want to live anymore because I was so depressed, and this would often last for 1 to 2 full days. On 2 different occasions I woke up from a dead sleep in the middle of the night with chest pains, and when the pains subsided, I would start shaking violently. These were obviously panick attacks, but they were triggered for no apparent reason. Before my cocaine use, I have never had a panick attack, or any kind of mental weakness for that matter. Now I feel mentally week, unable to control a mushroom trip or ecstasy trip the way I had before.\r\nI regret using cocaine, for what little I used it, more than anything in my life. I loved using other drugs and having fun with my friends. And most important, I love marijuana. That's right, I fucking love weed. I love everything about it, the growing, smoking, smell, everything. But Cocaine has torn me away from this. I am now unable to use and experiment with other drugs. I had unexpected panick attacks, and I still suffer from mild depression and anxiety. Definitely not worth it.\n\n\n"
}