{
 "title": "How It Almost Ruined My Life",
 "author": "Andy",
 "citation": "Citation:   Andy. \"How It Almost Ruined My Life: experience with Oxycodone (Oxycontin) (ID 55704)\". Erowid.org. Jun 25, 2007. erowid.org/exp/55704",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "139 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Oxycodone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55704",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 9377",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuring the summer of my senior year my best friend and I began experimenting with his mom's oxycontin prescription. Our original plan was just to try it a few times and then stop, but oxycodone had other plans. Soon we had moved up from taking 2 40 mg pills to do before school the entire week and where taking nearly 20 80 mg pills each in one week. \r\nIt went on for 4 months and by then we were obviously addicted since we were only snorting them. On average we went through more than 100 mgs a day and whatever we didnt use we sold. It was a profitable business for us since we got all profit. Most times we ran out before the demand was met and in the end I even started to make trips south about an hour like once a week to get entire bottles from a guy I knew just to keep our customers happy. \r\nBy now I realized that I had a serious problem. If there was a day I didnt have OC I went crazy. I had the shortest temper that can be imagined and I would often flip on or be deceitful toward the people that mattered most to me.\r\nIt all came crashing down in October 2006 at the homecoming dance. I went outside to my Jeep to get a bottle of deodorant and was escorted by a Deputy Sherriff since we were supposed to sign out with an adult to go to the parking lot. While I was looking for the stick I accidentally uncovered my bottle of pills. The sheriff immediately asked me to step away from the car and got a warrant. I was charged with possession of a Schedule II narcotic and could have faced up to 1 year in the county jail. \r\nBy now I was already accepted to the Virginia Military Institute and worried about my future there. I didnt even know if I was going to be able to finish high school. Eventually I was accepted at a military school. I could continue my passion for wrestling that I have had ever since in can remember. I even ended up placing 2nd in the state that year.\r\nMy story isnt really about how euphoric or exciting the drug was (although it was fucking amazing). It is incredibly addictive.\n\n\n"
}