{
 "title": "Next Thing I Know, I'm in New Clothes",
 "author": "DeeSquared",
 "citation": "   DeeSquared. \"Next Thing I Know, I'm in New Clothes: experience with Datura Inoxia (ID 55711)\". Erowid.org. Mar 13, 2010. erowid.org/exp/55711",
 "substance": "Datura Inoxia",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "60 seeds",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55711",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 13, 2010",
   "Views: 4436",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOkay, heres the story...<br>A friend of mine called me one night and asked if I wanted to buy about 60 datura seeds. My only response was, 'WTF is datura?' He told me all he knew about it and then I checked to see what some internet sites had to say about it.  The general feelings I got from it were that this drug is something I have to try...with a trip sitter.<br>I am one who always likes to try new things, and out of a group of about 30 people I was the dumbass to eat them, all of them, at one time.  Being that they are legal I enjoyed eating them inside of a MacDonalds and was completely open to them that I was about to start tripping. I ate the seeds at around 9.  The taste was not good, but not bad enough that I couldnt chew them up and wash them down with a free MacDonalds water. No signs of a trip until I had to go home at 12, my trip sitter asked if he should stay, but I told him that what I ate must have been bullshit because I was feeling no effects at the time.  I opened my garage door and went inside.<br>Okay, just a fore-note, the following may not have happened as remembered, but it is what I remember doing and how I believe things happened that night<br>I walked into my living room and sat in my reclining rocking chair.  Two Asian kids were politely sitting on my couch and somehow I did not find this to be odd.  I began to talk with them and enjoyed their company, until one of them said something and made me extremely angry.  I got very pissed at him and threw a pillow that sits on another chair in the room at him.  The pillow hit my phone on the dresser in my room, the crazy part is that my dresser is upstairsin my room, and it knocked it off onto the ground.  I knew of this but continued to talk to the Asians in my living room.<br>The next thing I know took place was me waking up downstairs in the same chair I was in earlier with a completely different change of cloths on. It was daylight so I walked upstairs and was confused by my phone being located on the ground.  I went back to sleep and woke up later in the day feeling fine, and never found out any more of my trip.\n\n\n"
}
