{
 "title": "A Psychedelic Mystical Land",
 "author": "R. Proulx",
 "citation": "   R. Proulx. \"A Psychedelic Mystical Land: experience with Salvia  divinorum (leaves & 10x extract) (ID 55723)\". Erowid.org. Aug 22, 2007. erowid.org/exp/55723",
 "substance": "Salvia  divinorum (leaves & 10x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55723",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 22, 2007",
   "Views: 2821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few nights back me and a friend, we will call him AC, decided to experiment with some salvia that I ordered off the internet. We put on some Grateful Dead, and lit up some Nag Champa. I thought that music would add to the trip. I've had some pretty intense salvia trips before, but this one was a lot different than anything I have experienced. I packed a quarter gram of 10x, mixing in a bit of ground leaf to mellow out the otherwise harsh smoke. As I took my first hit I glanced at AC and he smiled at me, feeling at ease I leaned back in my seat and looked up at the ceiling.</p><p>After a brief moment I noticed the room around me started to get brighter, almost sparkly I thought to myself 'Can I see the air?' And then, I was in space. Am I still apart of my body? Or is my mind just floating around in an endless universe. Feeling all of humanity, life, and reality slipping away from me, I looked at my pipe, trying to remember what am I doing here? What is 'here'?</p><p>Then AC suggested I take another hit, which I did. It was as if I had became part of the floor, that AC and I were two plants that could communicate, growing in some psychedelic mystical land. The music playing was like some ancient language, speaking words of wisdom telling us all the secrets of life and how to find eternal happiness. Then I started to grasp reality, and I started to remember who I am, and what I am. </p><p>Normality came back to me very rapidly, then I was just very dazed for a few minutes. What I have written here is only what I can describe in words, for most of the experience adjectives arent strong enough to describe what was happening.  Salvia is very sacred herb enjoy it while it is still legal, cherish the knowledge and wisdom it teaches you and dont take it for granted.</p>"
}
