{
 "title": "Encapsulated and Free",
 "author": "The Piper",
 "citation": "   The Piper. \"Encapsulated and Free: experience with Poppies & Cannabis (ID 55762)\". Erowid.org. Sep 5, 2008. erowid.org/exp/55762",
 "substance": "Poppies & Cannabis",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "7.0 g",
   "oral",
   "Poppies - Opium",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55762",
   "Male",
   " ",
   "Not Given",
   "Sep 5, 2008",
   "10933",
   " "
  ]
 ],
 "report": "<p>During my previous experiments with poppy tea I found out that combining it with cannabis is an extremely pleasant experience. The opium encapsulates me in a safe, warm feeling where nothing from the outside of my drug-induced cocoon can harm me. The cannabis activates my fantasy and frees the wildest dreamlike visuals my brain is capable of showing me.</p><p>It was the last day I had to work in this week, I was in a euphoric mood and I was looking forward to experiment with new combinations and dosages of mind altering substances in different sets. In the evening I went home and about 19.30 I drank my poppy tea made of 7g gried, crushed poppy pods. I always boil a cup of water and then wait a few seconds until it stops boiling before I pour it over the poppy material. I then stir the tea every few minutes quite intensely and filter the plant material after 15 minutes. I sweeten the tea with sugar, hold my nostrils closed with one hand while drinking the tea with big gulps. The trick is to keep my nostrils closed until I got the tea down AND washed my mouth out with some other liquid. This way I hardly notice any of the quite unpleasant smell at all.</p><p>Okay, the oncoming starts quite soon. I usually get this dragging in my whole body, especially in my neck. I also experience quite often a slight pressure in my head, like a extremely mild headache, but it doesn't hurt at all. I don't experience the poppy tea effects as a 'rush' like I do with cannabis or the most other drugs, it's more like there's something in me that I only feel when I activate it with something like seeing or talking to other people or smoking some cannabis :-).</p><p>Well, that was exactly what I did then at T+2:00, since I thought the effects wouldn't get any stronger anyway. Pink Floyd's movie 'The Wall' was ending soon and I first vaporized and then smoked some quite potent pure hashish. After that, until T+6:00 I had what I think is a classical 'drugged state', in the way unexperienced people think of such a state. I just lay down on my sofa, listening to Becks 'Sea Change' and after the CD was finished, to the silence surrounding me, which I didn't even realize since I was quite cut off from the world outside my dreamlike visions. I was extremely disconnected to anything 'real'. I often didn't even feel my physical body at all.  Sometimes, the vision became so real, that I absolutely could NOT differ them from the reality we experience with our normal consciousness. You could call it a quite strong vision or an out of body experience or both, however you want to categorize it.</p><p>Even as I stood up at the end of the experience to get some food and something to drink, I felt like I would be in a dream. That's really the best way to describe it, it exactly felt this way, like a lucid dream! The next day I went walking in the woods and didn't feel weak at all. There was no hangover, I felt physically and especially psychically just great! I think the opium was still working the next day in a very small intensity.</p>"
}
