{
 "title": "Extended Use & Depression",
 "author": "Liamfox",
 "citation": "   Liamfox. \"Extended Use & Depression: experience with Modafinil (ID 55776)\". Erowid.org. Sep 30, 2006. erowid.org/exp/55776",
 "substance": "Modafinil",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Modafinil",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55776",
   "Male",
   " ",
   "Not Given",
   "Sep 30, 2006",
   "Views: 19865",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A bit of a background on my situation:</p><p>I had suffered a severe debilitating depression for some time which did not respond to the traditional medications, Prozac, Wellbutrin, Levaquin, Zoloft, Cymbalta - they all showed positive effects after the initial two to three weeks, but eventually my depression would rise through the antidepressent effect worse than ever. One significant aspect of my depression was my incredible urge to sleep all the time. Ruling out anemia, sleep apnea, and other disorders, this left my doctors perplexed. It was eventually decided to prescribe Modafinil 200mg to treat this.</p><p>I do not wish to describe Modafinil as the 'wonder drug' that it has been called in various sensationalist magazine articles - but it has been very successful for my condition. I take it in the morning and an hour later I feel energetic and youthful and optimistic like I cannot remember feeling in some time. </p><p>I have been on it for about six months now with no wane or tolerance build-up that I can detect. Modafinil seems to have a day-to-day effect, going without for a day brings me back to my original state of tiredness for that day - although the antidepressent effects seem to last beyond the day to day stimulant effect.</p><p>The idea that a pill could keep me awake without feeling tired is certainly an appealing one - Modafinil can certainly keep me up for extended periods of time with repeated 8 -hour doses (Naturally I have experimented with my prescription) and with much better results than caffeine and much fewer side effects than amphetamines, but I certainly 'feel' that I am up longer than I should be. It disassociates me from the tired feeling inside me, in my joints and muscles and eyelids, although I still become easily distracted and begin to see things out of the corner of my eyes after the two day mark - I just don't have the crushing urge to find a bed to collapse in. In this way I feel it does not have much of a potential for abuse - I could see it becoming quite popular for college students or the military where wakefulness becomes a necessity, not a luxury. </p><p>Modafinil is also interesting in that despite its stimulant effect, I can still sleep while taking it. I have in fact made the mistake of taking it in the morning and returning to my bed for a nap, only to wake up some hours later. Its effect on my desire to sleep seems to have little effect on my ability to actually fall asleep. Taking modafinil after I already have a desire to sleep (using it to stay up the day after a party, etc) is a miserable failure. I must use repeated doses to sustain the effect. </p><p>Other reports have stated Modafinil has no jittery effect. In this case I differ - I certainly feel the jitters on Modafinil. Mind you, they are extremely mild and consciously controllable, but I have noticed a slight tremor in my jaw, 'jiggling' of my knee and ankle when I sit, sweaty palms - typical jittery or 'speedy' symptoms. Ameliorating this somewhat are the warm tingling sensations in my thighs, joints, shoulders and neck I can only describe as being like the very initial onset of an MDMA experience - very pleasurable but mild. </p><p>Most of the coverage on Modafinil has concentrated on its effect on sleep - I must also report on its effect on my state of mind. Perhaps my depression was linked to my exhaustion, but I feel as if Modafinil has lifted me out of my depression with better success and more of a 'genuine' feeling than other antidepressants I have tried - I don't feel soulless or robotic or artificially happy as I have on other medications. Modafinil definitely has a very rapid effect on mood in my case, within one hour I feel quite good.</p>"
}
