{
 "title": "Surprised By The Quid",
 "author": "Lychees",
 "citation": " Lychees. \"Surprised By The Quid: experience with Salvia Divinorum (leaves) (ID 55838)\". Erowid.org. Aug 26, 2009. erowid.org/exp/55838",
 "substance": "Salvia Divinorum (leaves)",
 "bodyweight": "182 lb",
 "header": [
  [
   "DOSE:",
   "3 leaves",
   "sublingual",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2006",
   "55838",
   "Male",
   "",
   "Not Given",
   "Aug 26, 2009",
   "3374",
   " "
  ]
 ],
 "report": "<p>This was not my first time experiencing Salvia, but it was the first instance in which I had utilized a fresh leaf quid.  My initial usage was via oral tincture, and subsequent to this, via smoked enhanced leaf.  After my last experience with smoked enhanced leaf left me somewhat unnerved, I chose not to use Salvia for a few years.   Despite this time away from the plant, I continued to be intrigued.</p><p>After tending to a live specimen in my home for almost a year, I decided that I would try a more traditional ingestion method to see if the experience was more useful and reassuring one.  With some trepidation, I plucked six or seven leaves from my plant and set them aside.  As my wife and family had an engagement for a few hours, I planned to chew these leaves in a quid just after dark.  Waiting until dark was a mistake, as it caused the experience to feel time constrained and my family returned before the journey had wound to an end.  That aside...</p><p>Once twilight set in, I went out to my back yard, sat down on my porch, and began the process of chewing the quid.  I had used large leaves and could only fit about half of the quid in my mouth.  Seeking a mild experience, I wasn't concerned by halving my consumption.  While not as overwhelmingly bitter as San Pedro, the Salvia essence packed very potent flavors, and I did not find holding the quid in my mouth to be pleasant.  Salivation definitely increased and I found myself needing to spit several times.  As it turned out, I did not need to hold the quid in my mouth for more than fifteen minutes or so before I could feel the plant's effects take hold.</p><p>Once I began to really detect the signature effects setting in, I spit out the quid and closed my eyes.  My focus was on generating a positive, healing state of mind.  Initially, this seemed to bear fruit.  I can clearly recall a mental image of my body being washed through with a brilliant yet minty-cool bluish white wind.  As it passed through my form, I saw my form filled with a clear transparent quality.</p><p>This initial vision passed.  It was replaced with a sensation which has been consistent throughout all of my handful of Salvia journeys.  I felt a dark crack open behind and below me in the earth.  With methodical force, sinuous vines or tendrils wound up from the crack and pulled me down into the 'other' place.  The place was the same in this instance as in all the others. It struck me as another plane which lies just beneath the surface (both the surface as in what is normally perceptible AND the surface of the earth itself).  As always, it felt as though I had always been aware of the place, maybe as a child on the verge of sleeping or waking.  The energy of this unnerving locale seemed dark as the darkest forest.  In remembering it, I picture something out of an old fairy tale - lost in a dark wood with hundreds of unseen eyes occupying the deeper shadows.</p><p>I felt that I did not want to stay in that place, that it was not 'warm' in the way that I desired this journey to be.  At this point I opened my eyes, stood up and walked into my garden.  My balance was certainly off.  I felt slightly drunk as I set out toward my tomato plants.  In an effort to rid my mouth of the lingering bitter-chlorophyll salvia aftertaste, I popped a cherry tomato in my mouth.  It was not satisfying.  Slowly, I was beginning to realize that my journey felt rushed and over-manipulated by my effort to 'warm' the eerie green salvia energy.  I no longer wished to be where I was.</p><p>With the intent of bringing some balance back to this experience, I sat down on the crisp brown grass.  My bare legs felt the leaves dryness as a sharp and biting harshness.  I was physically uncomfortable.  My tactile sense was extremely heightened.  Trying to ignore this, I focused on the garden and tried to extend the sense of being a gardener out into the world as I envisioned it.  My last image in this regard was the image of my vision struggling with a dark energy.  Struggling to believe that I could accomplish positive results in my life.</p><p>Right at that moment, my kitchen light turned on.  I knew that this meant my wife had returned.  I also knew that I had made a mistake in trying to force the journey to fit my timeframe.  I stood up and went back inside.  Unfortunately, I further fouled the journey when I told my wife that I had taken a nibble of one of my 'plants.'  She rolled her eyes and I took this personally.  We argued.  In the end, I came back to reality with a sense that I had taken a very flawed approach in this return to the world of Salvia.  I had tried to force the duration, the quality and the content of the evening's journey.  This mistaken approach left me disappointed with myself and unsure about my suitability for the Salvia experience.  I may return to this teacher, but cautiously, and more carefully.</p>"
}
