{
 "title": "A First and Complete Look",
 "author": "Greenfox",
 "citation": "   Greenfox. \"A First and Complete Look: experience with Kratom (15x extract) (ID 55856)\". Erowid.org. Jun 16, 2007. erowid.org/exp/55856",
 "substance": "Kratom (15x extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tsp",
   "oral",
   "Kratom",
   "(tea)",
   "  T+ 0:40",
   "1 tsp",
   "oral",
   "Kratom",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55856",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 20971",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background:</p><p>At first, I dismissed any and all reports, because in my experience most 'legal' drugs are legal for good reason: they do little or nothing to enhance the perception. I've come across a few exceptions, Kava Kava comes to mind, but in general, the placebo effect strongly outweighs any real effects from the substance itself. Also, many reports that I have read show indications of combinations of drugs being used, which is very unreliable for any real scientific reports to be made on one substance in particular. Given this, I felt it my responsibility to write a sensible and (as much as possible) unbiased report so that others can gain insight. Anyway, I will delve into my background as it relates: </p><p>Gender: male</p><p>Age: 27 </p><p>Weight (approx): 170lbs.</p><p>Previous drug experiences: </p><p>Almost all. A short list for relevant comparison would be: Amphetamines, Cannabis, Cocaine, Rx pills (uppers, downers, painkillers, I've had them all), legal herbs such as Kava and Dream Herb, Heroin, Opium, Salvia, LSD, 'magic' mushrooms, and many, MANY others.</p><p>OK, on to the good stuff. I acquired a '15x standardized extract', NOT the actual plant/leaf material. I ordered it less than three days ago, paid for overnight shipping, and it came today. The bag was sealed properly and the 'smell/taste' factor leads me to believe that this is 'fresh'. </p><p>PREPERATION: </p><p>I initially brewed a small amount of water, less than a cup, and let it boil. I took the water off the stove as soon as it came to a boil. In the bottom of my mug I squirted a small amount of honey because I didn't have any tea bags and the reports I have read claim this to be a bitter-tasting substance. I had no way to measure, so I put a 'heaping' teaspoon in and stirred the water, mixing it completely. The concoction was not too hot, so I drank it very quickly. This substance *is* bitter, but NOWHERE NEAR as bitter as some reports have made it out to be. I would describe the bitterness as 5.5 out of 10, 0 being a cup of water, 2 being black coffee, and 9 or 10 would have to be wormwood.</p><p>CONSUMPTION/*THE* REPORT:</p><p>0h:00m - The concoction was drank with honey, and drank within one minute, literally. The cup was filled with water halfway because there was still a small amount in the bottom. This was drunk immediately. </p><p>0h:05m - I got into my car and began driving back to my job where I would begin writing this very report. </p><p>0h:07m - I am noticing 'the flushing feeling' of warmth. My palms are a little sweaty. I try not to make generalizations because of placebo effects, but something is definitely 'happening'. </p><p>0h:10m - Effects are starting. The quickness I think can be attributed to an empty stomach. I can't describe or pinpoint *what* those effects actually are. Therefore, I wait.</p><p>0h:12m - I am pulling back into work, and take another couple minutes to get to this computer. A few more waves of noticeable body warmth flush through me.</p><p>0h:17m - I am in front of this computer, beginning to write what you have already read. I notice a caffeine-like effect rippling through my body. The words I type are somewhat longwinded, but my vocabulary is dead-on. There doesn't seem to be the dulling of the mind that other stimulants, particularly cocaine, have on the body. Words are typed with ease and the need and desire to share the experience is intense. </p><p>0h:40m - I am on *this* timestamp entry now. Everything above this very sentence was typed within 23 minutes exactly. Albeit I am usually a fast typer, the speed and accuracy in which the words flowed from my fingers is amazing. I want to experience more of this, so I take another teaspoon and 'parachute' it at this point (or ate it dry) and flushed it back with a small amount of non-caffeinated soda. </p><p>0h:55m - Another fifteen minutes have past. I waited for the effects of the second dosing to kick in before continuing this report. The Dead is playing in the background. The music sounds involving, more so than usual. I can communicate with my co-workers with the greatest of ease. The empathy I feel currently could be compared to low doses of MDMA. Answering the phones, which to me is usually a boring and tedious task actually becomes FUN! The people on the other end seem amazed with my genuine desire to help them. Stranger still is my ability (through a phone line, mind you) to pick up on *their* emotions and contentment with the service I am providing them!</p><p>1h:30m - A little more than a half hour has past, and I am enjoying the effects immensely. Once again, I hate using comparisons to other drugs, because nothing is one hundred percent 'like' something else, however, I am compelled to write that this is definitely 'like' MDMA and opiates. I speak as an avid opiate user, and I can distinguish the difference between effects in opiates down to a fine point. Having stated this, I would compare what I am feeling now (having doubled my dose) to the equivalent of 50mg of Kadian, or perhaps 15-20mg of oxycontin. The effects of warmth and well-being are pronounced, and don't feel 'synthetic' at all. However, as euphoric and as relaxed as I currently feel, I cannot compare this to heroin because there doesn't seem to be a dulling or sedating effect to the point of a 'nod-off'. In other words, I feel really good, in a speedy/MDMA sort of way, but the sedation of the MU-OPIOID chemicals found in Kratom is certainly making themselves known. </p><p>SUMMATION: I am still in the second hour upon completing this report, but I want to summate it now because I feel the empathy and desire to do so. First, this is definitely 'for real'. Not a placebo or 'legal drug am I really feeling something or not' type effect, but a noticeable, DEFINABLE effect. Second, I cannot comment on the addictive nature of this product, having used it only one time as of now, but I *can* comment on how I think this COULD be addictive. It seems to have all the defining effects of a stimulant AND a depressant, without any of the negative effects usually associated with either class. Third, I can say with some safety that I feel this would be a good 'social' drug.</p>"
}
