{
 "title": "Splendid",
 "author": "John",
 "citation": "   John. \"Splendid: experience with 2C-I (ID 55855)\". Erowid.org. Nov 4, 2008. erowid.org/exp/55855",
 "substance": "2C-I",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-I",
   "(capsule)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 55855",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 4, 2008",
   "Views: 2415",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So I just moved into this house and because acid and shrooms are like a traveling circus around here I purchased some 2ci. A 25mg tablet for me and my good friend tim. We have both tripped on this drug before a handful of times. We would ushually go out and skateboard or just look at clouds or stars or something. The first time I tried this drug it made me sick. I am pretty sure the reason is because I never ate anything. You know that bullshit that everyone tells you when you are a kid, 'Don't eat anything so you can make sure and trip hard'. Well I gotta eat before I take this pill or the substance will find whatever it is in my stomach and move it out. When I already have just like a double cheeseburger in there I will be fine. So anyway. When I eat it does make the come up take a longer time. In this time I have lots of conversations like, 'Dude what the fuck call that mother fucker up and make sure this shit is real.' or something along those lines. </p><p>BUT when it hits, it is gonna hit. Let me just say this as a recommendation to first time users. Make sure you know the people you are tripping with well and by well I mean well enough so that there is no possible way that you could be hostile toward one another. Becuase this is not a drug I would do at a party. I enjoy finding a place with music that can be played as loud as I want and somewhere I can lay down and just chill back for hours. </p><p>So in the mean time before the trip sets on we smoke a ass load of pot because there isn't anything else to do I don't know anyone out here. So we are both really baked and we are chillin with our friends Jesse and Jackie. We were all drawing on this table I have with permanent markers when I suddenly look up and tim is lookin right back at me and I can tell that it hit him and he can't tell that it hit me. I have tripped with Tim so many times that we normally experience the same feelings and visions. So we both are just laughin and hangin out. It feels so good to just be in the very spot and so content with everything. With good vibes in the area everyone just lays around talkin about life and makin jokes. Everything and when I say everything I mean anything contacts any of my sense is intensified greatly. Once the visuals kick in Jesse and Jackie leave because Jackie is drunk and she is starting to be a bitch. </p><p>Me and Tim sit in silence for hours just takin in all the beauty around us. My pupils get so dialated that I can see the eyelashes hanging off my eyes. When I go outside the streetlights and the moon and the stars all reflect off those eyelashes and make the most beautiful, colorful spirals right in front of my eyes. I open and close my eyes unconsciously so the spirals move and grow and I feel like I'm seeing shit but that is really what it is, regardless it is so beautiful that I really cannot described what it looks like accurately. I seem to see that everything tilts and contorts itself right in front of me. Houses seemed to be 'breathing'. I can only describe it as the garage doors looked like air was being pulled in behind them and moving the doors and right after that the blinds of the windows would appear to blast out by some huge force of air. </p><p>This goes on and on an I can do nothing but stare in amazement. I would say off my dose and tolerance I got a good visual trip for about six hours but the body trip lasted into the 10 to 12 hour range it is hard to say though. the body trip is similar to X but a little more light the visuals are in my opinion would be about the same if I did a quarter of shrooms or 4 hits of acid. This drug is very strong. I know plenty who tripped on this as their first psychedelic and they all never had any problems other than vomiting. I have to say after I vomit though I peak so hard and all the blood shoots to my face and everything WOOOO its crazy. The conversations I have with other people are all deep and the topics are serious in nature but no one ever gets offended by anothers opinion. It makes me defensless with all the weeed we smoked we were just out of it completly. Just laying down and lookin around the room. </p><p>2ci is the best drug I have ever done the comedown is not really a problem you get passed it. No muscle pain maybe a mild headache but thats it. O yea and tired. But every drug makes me tired the next day so I don't complain. I really don't see any addictive qualities in this drug. I have done it a few time ad I will do it again but I don't need to do it again. It is like a vacation. It's fun but it is expensive. We don't know what this could be doing to our brains though because there hasn't been to much research into it. I really don't feel bad or different from it although after the first time at this drug I look at things differently. I recommend this drug to anyone who wants to try something other than X acid and Shrooms. It is cheaper and it lasts longer.</p><p>    2ci two thumbs up.</p>"
}
