{
 "title": "Keech Up",
 "author": "Keecher",
 "citation": "Citation:   Keecher. \"Keech Up: experience with Salvia divinorum (20x extract) & Cannabis (ID 55871)\". Erowid.org. Oct 16, 2007. erowid.org/exp/55871",
 "substance": "Salvia divinorum (20x extract) & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55871",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2007",
   "Views: 2632",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMe and a friend had heard of salvia and it sounded like a good experience so we went to the local head shop and purchased 20x purple sticky salvia. $82.00 for about a gram. I thought to myself this better be worth it. \r\nSo first of all I should explain this to you. When I try new drugs I find it best not to research them so Im not expecting a certain trip. I guess I just like to go into it not knowing what will happen I have a better time this way. I definitely learned my lesson with salvia! Okay so I basically had no clue what effect the salvia would have on me and I was very excited to find out. I was also very nervous. We decided to have my girlfriend come along as a sitter which was definitely a good idea. We decided to go to a near by lake and try the salvia outdoors in a very beautiful setting surrounded by pine trees and having a spectacular view of the lake and mountains.\r\nWe walked to a small clearing in the woods about 25 feet from the lake. We set the 3 foot bong on the picnic bench and packed a bowl of half cannibus half salvia. My friend tried it first, all I can remember was he started giggling and walking around lifting his legs very high off the ground. I quickly said 'hold on Im coming' and started giggling myself. I pinched a large amount of salvia and smooshed it on the salvia and cannibus that was left the bowl. I milked it up exhaled, and laughed at something my girlfriend had said about my friend. I quickly cleared the bong and decided to take another rip.\r\nI had initially planned on holding the hit in for as long as possible but I really had no choice when it came down to it. All I remember was looking up at a gigantic red and blue lego building I had no clue what was going on or where I was. This gigantic building was the 3 foot bong that I had just smoked out of 2 seconds ago! I don't remember what happened next but I was told that I fell on my ass and landed in a bush. The look on my face was terrifying and I had no clue that my girlfriend and friend were right in front of me asking me questions. I was in a different world!!! \r\nTime seemed to slow down to the point where I could see every layer in any object that I looked at sort of like pages in a book. The layers appeared to be rolled up news papers with the words 'Keech up' clearly printed on every newspaper in red. I was extremely scared at this point! My body stood up but I wasn't controlling myself. Just like everything else there I could see billions of tiny microscopic layers to my body and they all looked like tiny versions of me. While my body stood up I remember being one of those tiny layers except I was stuck in my right hand. It was definately terrifying not being in control of my own body, I thought that I would be stuck in my hand forever. My body walked towards the table and for some reason waved at my girlfriend. As my hand passed by her I said 'hello. I was sad because whatever part of me that was controlling my body had taken my life from me. I thought that I would be living in my hand forever!!\r\nA few seconds later I was sitting at the table with some control over my self. As I looked around all I saw were billions of rolled up newspapers with the words 'keech up' printed on them in red. I closed my eyes hoping to fall asleep which greatly intensified the whole situation. Really weird things started happening! I found my self living in a book. Not like a story in a book just a book. But I wasn't alone my whole family was there with me. Everywhere I looked there were billions of books and when my book would collide with another I would somehow be transfered to that book. All the time seeing my family and different versions of myself living in each of the books. I'm not sure how I got out of the books but when I did I found myself falling into the living room of the house I grew up in.\r\nI saw my family once again standing in a circle. As I approached the carpeted floor in my living room I suddenly landed in the mantle of my fire place once again with the rest of my family living there right beside me. I wanted to tell them that they had been living in a fireplace mantle for there whole life but I didn't want them to be sad or scared like  I was. I can't quite remember what other random objects I had fallen into but I know there were more then two. And every object that I was living in I really thought that I was going to live in that object for the rest of my life!\r\nI now opened my eyes and managed to ask my friend what was going on. I wanted to know if he was in the same world as me. He kept saying yeah Im here to man. But later on I found out he was just trying to keep me from going nuts. I felt relieved that I wasn't the only one in this crazy world. Though still scared that I would live in this strange world of rainbow colored books, rolled up news papers, and almost a slow motion type of effect forever and this scared the crap out of me! I remember looking at the lake. It looked different, I could see every layer and particle that made the water what it was and I thought I could walk right into the lake and be totally fine. Like the water appeared to be blue air. I am almost positive that I would have attempted to walk through the water if my girlfriend hadn't stopped me.\r\nAfter about 20 minutes things became slightly less scary. Just as I started to feel happy something crashed through the trees near by. Although it was extremely hard I managed to focus on whatever had made all the noise. It was a small deer. I remember looking right into it's eyes like it was trying to talk to me. I then turned around and saw the same deer right behind me. I found this to be very weird but interesting. The deer left and I started to feel a little better. My friend had told me that I was fucked up and I just had to accept it until it wore off instead of fighting against it. This made me have a better time.\r\nEventually I felt well enough to walk back up the path and get into my friends S-10 blazer which made me feel very safe. My friend asked if I felt like I was okay to drive I laughed and told him I would crash on the first turn, I was still feeling the salvia quite strongly. Luckily my friend was able to drive and after about another 20 minutes the salvia had finally wore off. \r\nWhat a strange experience this was. I have done shrooms and acid a few times so I wasn't to scared of trying salvia, I thought it would be completely different then it was. It was definately more intense then acid for about 15 minutes. I definately should have researched the salvia before I tried it. The same day that I tried the salvia I vouched to never try it again! I was amazed by it's power! But I was glad to have tried it and to have such a crazy experience with it.\r\nThe whole time I was tripping my girlfriend had been videotaping 15 second intervals of me with her cell phone. Later on I watched these clips and it was absolutely insane to see myself like I was! Like I was possessed! what a freaky look I had on my face! You could definately tell that I was trying not to scare my girlfriend by trying to say I wasn't fucked up. Haha what a crazy day this was I have tried salvia once since then in a powder form but did not experience such an intense trip. Just felt weird like I was about to fall into the world that I was in the first time but I kept myself from doing so. All I can say is Salvia is a very powerful substance and you should not underestimate it's power!\n\n\n"
}