{
 "title": "Euphoric but Crazed Roll",
 "author": "Ewm",
 "citation": "   Ewm. \"Euphoric but Crazed Roll: experience with Unknown (Sold as Ecstasy) & Cannabis (ID 55906)\". Erowid.org. Aug 26, 2009. erowid.org/exp/55906",
 "substance": "Unknown (Sold as Ecstasy) & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "Unknown",
   " ",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:45",
   "2 tablets",
   "oral",
   "Unknown",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55906",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 26, 2009",
   "Views: 3264",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: Ecstasy tablets are notoriously impure or misrepresented, often containing chemicals other than the one they are presumed to contain. This report is marked as an MDMA report, but readers should be aware that this is more of a general Ecstasy report and the contents are unknown; the tablets consumed may have contained an MD* compound or none at all, with our without other chemicals.]  \r\nOver the past few months, I have become much more experimental with drugs.  Aside from daily smoking pot, I have acquired somewhat of a taste (smell?) for cocaine, which I use at MOST once every month or so.  I have delved into the realm of perscription drugs off and on for the past 3-4 years.  After all the chemicals I have introduced to my body, I am most fond of Ecstacy.  Since my first time 'rolling' around January '06, I have only rolled about 5-6 times since then (now sept. '06).\r\nLast night, I acquired 3 rolls from a friend.  Two were yellow music notes, and one was a green music note.  I have taken both types before and found them to be VERY good, with the green ones being, in my opinion, the best.  Throughout the night, I was in a comfortable environment around people I completely trust (3 people total counting myself).  I was the only person rolling.  We were all smoking marijuana from a joint and water bong.  Once we attain said substance(s), I wait until we're almost at Friend A's house before taking the pills.\r\nT 0:00  -  riding in Friend A's car, I take two of the yellow pills with a small drink of sprite to wash it down.  Nothing else to drink until I feel the onset.\r\nT +0:30  - feeling the onset of rolls, have already smoked a joint and 2 bowls from the water bong.  Mild, yet obvious tracers appear in vision.  I decide to get a glass of water and pop the last music note (the green one).\r\nT +0:45  -  not really much more than when I popped the last pill, just edging more and more towards peak.  Feeling VERY sedate due to marijuana and mindset.\r\nT +1:15 - I am rolling hardcore now.  I see tracers on almost everything.  My sense of touch is GREATLY enhanced.  I want to talk..no, better yet, I want to lead conversations!  Which, is bad, mostly because I can't even form a complete sentance at this point.  I thought I had left my phone in Friend A's car, so I got his keys and looked in his car for my phone.  Though I didn't find the phone, the trip (a whole 30 feet round trip) was an oddysey.\r\nT +2:00 - instead of actually talking, I begin to relay my thoughts through body language and eyesight. I don't know if anyone else understood what I was saying at the time, but I knew!  I really starting to wonder if I took too much.  My friends are saying I'm starting to look really bad.  Pupils were massively dilated and bloodshot (from marijuana).  I can't stand in one spot without losing balance, yet walking around comes so completely natural.  \r\nT +2:15 - I take my shoes off and walk barefoot in back yard.  Cold dew on the grass touching my bare feet creates such an electric feeling.  I have never felt so alive, in fact, this is the best feeling I have EVER had!  My friends still say I look bad and keep telling me to let them know if I stop feeling GOOD and start feeling BAD.  I reassured them I knew what felt good and what felt bad.  I told them that no matter how bad I looked, unless I say otherwise, I had never felt better.\r\nT +2:45 - ok, this is a new sensation for me.  I am rolling SO HARD!!!  I can feel every pore on my body.  Every single breath I take, I can actually feel the chemical reactions that take place with each breath!  I have never felt so alive, yet fucked up.  I stare at Friend A's wall for almost 20 minutes because it's one of the most interesting things I've ever seen.  My eyes are twitching back and forth uncontrollably making it impossible to read or see anything with clarity up close.  Distance sight is not a problem, just trying to focus on nearby objects is impossible.  \r\nT +3:00 - I have never rolled this hard for this long.  I assumed I was very close to my comedown, so I agreed to leave with Friend A.  He is taking me back to my car, which is about 15 miles or so away from where we were.  On the trip to my car, we stopped at a gas station to get some drinks.  I bought some sports drinks and some OJ.  On the way to his house, I found out that I was nowhere NEAR comedown, as I started a second volley of hardcore rolling.\r\nT +3:30 - after sitting in his driveway for nearly 30 minutes, I decided to take a drive around his neighborhood to see if I was too fucked up to drive on the road.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]   during the first trip around his neighborhood, I was literally hallucinating.  I was seeing people walking down the road, but when I would look again, they would vanish in a cloud of smoke.  I could WATCH them vanish.  I parked the car in his driveway and decided to wait a little longer.\r\nT +4:00 - it was already almost 4am by this time, and I was still hallucinating.  I really really needed to get back home.  While I think this was a retarted decision, I decided to begin the journey home.  My drive from Friend A's house is a little less than an hour.  I decided that if I took back roads and went only as fast as I could stand, I would be alright.  Although nothing bad happened on the way home, I saw multiple occasions which it could have.  The entire trip home I was hallucinating.  I would just see people walking on the side of the road, and the closer I got, they just vanished.  The way my headlights were lighting the road created very odd patterns, some of which I believe I could only perceive in that particular state of mind.  It took me over an hour and a half to get home.  \r\nOnce I returned home, I went to my bedroom and lost complete track of time.  I was sitting in front of my computer just looking at it.  I was still hallucinating, but mildly at this point.  I kept seeing people in my closet, like they were stealing my clothes.  I actually held a conversation with a friend of mine who was in there, and at the end of it, I told him to get out.  As soon as I said that, I realized I was hallucinating and felt very stupid for talking to my closet door.  \r\nI'm not sure, but I'm almost positive that I overdosed that night.  My heart was racing, I was sweating, and my eyes COULD NOT stay still.  My thought patterns were VERY irrational.  Mostly, I've only heard rare occasions of people hallucinating on X.  Throughout the night, I was not thinking 'Oh my god, I'm gonna die'... rather, I somehow kept the mindset of 'This is the best I've ever felt in my life!!'  I believe that fact saved me a trip to the hospital.  As I said above, I may not know my limits when it comes to drugs, but I DO know what feels good and what doesn't.  I also know that if I feel bad or have negative thoughts, this is most likely how my trip will end up.  \r\nI am writing this at about T+21:00 and all I can really say is that I am very much e-tarted.  Anything more than getting up to use the restroom requires too much energy and most likely will not be done.  Unlike most people, my e-tardation does not depress me.  After a roll on E, it almost seems I realize what wonder and beauty surrounds me.\n\n\n"
}
