{
 "title": "Higher Awareness",
 "author": "Noss girl",
 "citation": "   Noss girl. \"Higher Awareness: experience with Nitrous Oxide (ID 5591)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5591",
 "substance": "Nitrous Oxide",
 "bodyweight": "52 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5591",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2002",
   "Views: 9227",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI am writing this after doing some noss so I am still feeling a little 'funny'.</p><p>The conclusion I came to is that nossing brings about a higher level of awareness.</p><p>Suddenly sounds become clearer and louder.  I have listened to the crickets outside my bedroom window and their sound has become so much louder and sharper.  With increased noss the sounds become even more clear.  On one occassion with a few friends I could hear the wind so clearly.  I asked my friend if she could hear it and she could but my other friend couldn't as they hadn't had as much as us.  We could hear birds from really far away so clearly as if they were close.</p><p>Sometimes when I have had enough noss I can see the gas coming from the whippets as they hit my bed after I throw them away.  I can see the gas coming from my cannister when i unscrew the whippets and some gas comes out.  I can see the gases in the air.  I remember lying there one time hearing my breath so clearly, my heartbeat and seeing the different oxygen and nitrous particles.  It was so peaceful and beautiful.  I'll never forget it.</p><p>I can also feel so much more on noss.  I can feel the music touching my body in time with the beat.  I can feel my clothes and the blankets on me so much more clearly.  </p><p>It is a much higher state of awareness and consciousness when I have it at the right amount.</p><p>I've had some times where I've passed out and seen things which are good too but those times are a million other little stories which I can't even really remember well enough to explain in detail.</p>"
}
