{
 "title": "A Lame Evening",
 "author": "Day Tripper",
 "citation": "   Day Tripper. \"A Lame Evening: experience with Oxygen (ID 55924)\". Erowid.org. May 4, 2008. erowid.org/exp/55924",
 "substance": "Oxygen",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Oxygen",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55924",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 4, 2008",
   "Views: 16567",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently, an oxygen bar opened up in our town.  Me and my friends noticed it one evening while walking up and down the mall.   We resolved to try it out, so we went back a week later.  I consulted a friend who had already gone to the oxygen bar, and she said that she had definitely noticed something different, and described it as a legal high.</p><p>We went on Friday night, and my expectations where reasonably high.  The owner came over with oxygen menus, and he advised us to only do a half hour, since a whole hour could be 'pretty intense' for a beginner.  I decided to do a flavor called 'wise man' which promised to open my inner mind, while my friends both chose an aphrodisiac flavor.  They put an oxygen tube in my nose, like old people sometimes wear, and I laid back breathing deeply.  This more or less killed our conversation, and we sat there quietly.</p><p>At first I felt a little bit tired, but thats because it was a Friday night after a long week.  It soon became clear that nothing extraordinary was going to happen.  I was disappointed, and gradually became a little pissed as I thought of how I paid 8 bucks to get scented air blown up my nose.  Eventually our 45 minutes where up, and we left feeling like we had wasted the first part of the evening.  None of us noticed any real effects, except Heather who said that it did make her hornier.  However this is up for debate, since she is always horny.</p><p>CONCLUSION:</p><p>The oxygen didnt do anything significant.  The oxygen, bar however, was a quiet place and provided a nice setting for thought.  I cannot imagine oxygen being used recreationally.</p>"
}
