{
 "title": "Amplified Party Experience",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Amplified Party Experience: experience with MDMA (Ecstasy) (ID 55920)\". Erowid.org. Mar 25, 2009. erowid.org/exp/55920",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 55920",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 25, 2009",
   "Views: 4026",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The pill: A small, rounded turquoise pill with a four-pointed star. Supposedly came out of San Diego, CA. A similar pill on ecstasydata.org out of San Francisco, CA was nearly pure ecstasy. Judging by the lack of unexpected side effect, the pill would seem to be reasonably pure.</p><p>Body Chemistry prior to Ecstasy administration: I had eaten a moderately large meal about 2 hours before ingesting the pill. I do not take any medications. I had a very slight cold that day.</p><p>The Set: I'm always a little anxious when using any drugs. Practice has given me the strength of will to cope with any mental quirks during the experience. I did not have any particular feelings for or against taking Ecstasy that night. I knew I would be in a controlled situation, A get-together of about 12-15 people. I was with a trusted friend who was also taking Ecstasty.</p><p>The Setting: A get-together with 12-15 people. Most of them either took a gravity bong hit, were first time smokers, or had taken several shots. The host was ensured that he had created a safe space for everybody, people were encouraged to spend the night.</p><p>The Experience: My friend and I approach drugs from a direction of experimentation, experience, and respect for their power. He has taken Ecstasy twice, I had never used it. We wanted a way to remain fairly lucid so we could guide the first time smokers, and make sure everyone felt comfortable, yet still have fun. After taking the Ecstasy about 10:30PM, we proceeded to go outside and set up the gravity bong. We both had a small taste of the marijuana (1 small hit off a pipe), but we wanted to make sure our experience was not tainted, so we could tell what the Ecstasy was doing. The Ecstasy hit my friend about 40 minutes after ingestion, he is a much lighter bodyweight, and he hadn't eaten prior to taking MDMA. His pupils were greatly enlarged, and he pursued conversation with great enthusiasm. Aware of his intoxication, he remained lucid the entire time.</p><p>After reading that Ecstasy generally hits no later than 2 hours after ingestion, I was a bit disappointed when 12:30AM rolled around. The rest of the people wanted to smoke a little bit more, and I smoked with them, taking 3 bong (Not gravity bong) hits. Moderately feeling the cannabis, I followed the crowd up to a dark room with a great sounds system, and listened to 'The Dark Side of the Moon' for about 30 minutes.</p><p>At approximately 1AM, I remember noticing that the cannabis was wearing off. Suddenly, I realized that my fingers were hurting. I looked at my hands to discover I was gripped the armrests of the chair I was in as hard as I could. The onset was extremely quick and unnerving, as it had been more than 2 and 1/2 hours since ingestion, I was not expected the Ecstasy to really do anything for me, especially since it hit my friend only 40 minutes after ingestion. I left the room, and my friend followed. Looking in the mirror, I noticed my pupils were dilated, but not to the amount that my friends were. Having a bit of an anxiety attack, my friend suggested that I lie down. I relaxed after talking with him for a bit, and he left the room after a few minutes. At this point I was able to focus on what I was feeling.</p><p>The feeling of mixed euphoria/exhilaration was not an unusual feeling, except that it was continuous, as opposed to the short lasting excitement of a rollercoaster ride or similar experience. I had to leave the light in the room on, in the dark I felt like I did not have as much control over my thoughts as I did with the light. At this point, approx 30 minutes after this first 'high' feelings, I began to have hot/cold flashes, followed by shivering. It felt good to do repetitive, almost autistic movements with my hands, so I did. There were no visual distortions whatsoever. It was different than the cannabis in that for me, senses were not amplified, but I experienced everything through a window of euphoria. I went outside so I could experience it alone for a while. At that point, I was controlling the drug enough, that I'd though I'd test some effects and have a little fun.</p><p>I was a rockstar! I played air guitar on the back porch for upwards of 10 minutes, singing to myself. At this point I had closed eye visuals of beautiful crystal lattice patterns melding into whatever I wanted them too. The most enjoyable however, was the physical movement. If I had had a Djembe drum or something at one point, I would've been in heaven, but I had to make do with imagining I was in a dream world. I used my body to slowly cut through the air. Anyone watching would have thought I was doing some funky Tai Chi or similar.</p><p>After about 30-40 minutes of having fun outside, I came back in to discover that the party was winding down. The 1st time smokers were sounds asleep, and the nymphos had found their rooms. I sat on the stairs in the dark, and was joined by the host, my friend, and a couple of girls. The conversation was excellent. I thought someone might think it weird that I was vigorously rubbing the carpet, and my eyes were moving quick from place to place, but I guess it was too dark. After the conversation, I found a bed to sleep in at about 3:30 AM. I turned out the lights, and had a slight panic attack, but I talked myself out of it. Tired because of the cannabis, yet amped up because of the X, I found it incredibly frustration to try and sleep. I finally managed to about an hour later.</p><p>I woke up about 8:30 AM. I felt amazingly fine, no hangover, no exhaustion. I got a ride home with my friend, and we talked about the similarities and contrasts of our two experiences. At 11:00 AM, I wrote this report.</p><p>In Summary: I find Ecstasy to be a tad boring. It is a very physical drug, and I take drugs mainly for intellectual purposes. Ecstasy has its place: for young people either at raves, or some venue where the physical nature can be enjoyed, or for young people interested in a stronger drug experience, but not confident to take a drug like LSD/Psilocybin which takes more mental control and curiosity to have a good time. Ecstasy forces me into the Euphoria, which could be beneficial to those who have second doubts about hard drugs that would otherwise cause them to have a bad trip. The only thing that irritated me was that it fooled me, because it came on much later than the standard time frame, I was not expecting it. I believe the late onset time was a combination of my bodyweight, the fact that I had eaten recently, and that the initial effects were probably hidden by the cannabis.</p><p>To drug users looking for a deeper insight into altered states, I would suggesting finding a source of quality Ecstasy, and trying it once to 'get it under your belt', but other than that, stick to exotic plant drugs and hallucinogens. To others looking for an amplified party experience, quality Ecstasy is the way to go.</p>"
}
