{
 "title": "Trance in the Winter",
 "author": "Amdamhilkit",
 "citation": "   Amdamhilkit. \"Trance in the Winter: experience with Salvia divinorum (10x extract) (ID 55996)\". Erowid.org. Apr 2, 2009. erowid.org/exp/55996",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "132 kg",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 55996",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 2, 2009",
   "Views: 2266",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMe and a friend traveled to a cottage in the winter time, started a fire in the fireplace, and got situated. My mind set was one of knowing that a very transcendental experience was forthcoming. I was excited but also very relaxed, I had no hesitation or fear, but I was not in a rush I knew what mattered most was preparing all this perfectly. I had done salvia once before in order to be able to experience the trance upon my second try. We had a pipe, and the salvia extract. It was completely dark outside of the cabin, I barely even remember being able to see much moonlight reflecting on the snow. I decided to do my trip in the dark, only exception being three lit sticks of incense. <br>The night was black, its smoke of <br>life <br>was all over us in the cabin<br>three small coils of smoke <br>poured up from three lit incense sticks<br>the salvia was smoked, <br>two bowls held long<br>and I drifted into hyper-awareness, <br>I was frozen physically in reflection on my life<br>I began to feel all my soul <br>moving downward, passing down into the skin that<br>touched my chair, <br>the soul enlarged and thickened downward<br>my eyes gave away to visuals, <br>I traveled away from my consciousness <br>I entered into a consciousness of flawless fatality<br>where the final processes of an ending life approach<br>my soul was engulfed by this fragment of my brain<br>that is close to ones death or even <br>to be enlightened in ones dreaming <br>I became aware of being next to land in the dark<br>I felt there was a river forty feet away or closer, <br>there was earth that I stood upon, <br>and there voices came to me, <br>their voices were clear and loud before I saw them<br>Their spirits came downward or forward<br>some from my right side, I believe one entity, <br>the prevalent speaker and perhaps one of her friends, <br>and some from the left, more so before me. <br>There was a line extending out of my heart, <br>it glistened like a wall of skin and made itself aware to my eyes, <br>it attached its presence to all of my consciousness and maintained its angle, <br>it angled off to the right from my heart, and seemed to point upwards, <br>The voices cause me to speak, to yell, I was turned on <br>to their investigative qualities, their sentences of half-questions<br>One predominant female voice exchanged with me<br>all that she had come to know about my life <br>and how I live it <br>she confronted me with my most deeply personal fates<br>she comforted me from my fears, she showed me my inactivity<br>she made me sing with her in rhythm, <br>though I have forgotten her song I thought I never would<br>she caused me to surrender, <br>my chanting bowed before her and my voice grew<br>something about her being the for real, <br>she is the power, I know you are the speaker<br>They were close together now, the entities, She was nearest to me<br>Did they leave together back up the path to the road<br>just up away from me almost on the left-side  or <br>did she return back to the right-side while the others drifted <br>up their own paths, The land off in the distances was hard to see, <br>it was in the dark of night, <br>there may have been something like moonlight but it seemed to be faint <br>and right over us, dissipating when they moved away, <br>if I had taken enough to move those entities right into me<br>I may have seen an even different entity, perhaps a louder voice, <br>a searing light,<br>it seems I may have been standing next to some cottage or house<br>when they were talking to me, perhaps the house was a part of my brain, <br>a cavern of my brain that I have never dissolved. <br>Things became a wash as they still had me in song and they floated off<br>it seemed they were slowly closing a door...<br>and now I could see something else, <br>a visual hallucination still strongly under the effect of drug<br>yet based off something that existed around me in the immediate world<br>the three lit tops of the incense sticks came into my eyes much like <br>the silk strings of skin or light that had such a profound angle earlier in the high<br>I watched how this concept of points of orientation with accompanying lines and strings<br>resembled much of what I had seen in the high, <br>and it was the most pleasing way to come back into my surroundings<br>after an experience so dark and personal, blinded from life and then all of life turned on<br>within my soul. <br>I was still dazed and still felt the urge to repeat her rhythms, <br>certain feelings of song and music she had conveyed to me, <br>I thought maybe one thing I could show for that experience, forever, might be <br>the rhythm and song of salvia. <br>Even in following salvia experiences I heard the rhythms. <br>I Dont bother doing salvia in the day, unless I do quite small doses such as using it to gain a light stone, a clear-headed buzz, because if I take large amounts in the day like I did that night most of what I see will be a buzz kill, almost depressing, <br>And the sense that Ive driven myself insane and unable to move and do normal things with people will leave me quite saddened and at the time of the peak very unnerved <br>a feeling that is like a hot flash is extremely typical for daytime salvia use. My body will reach a new temperature because of the smoke I have inhaled, and then my body will itch and I will become unnerved because it will feel like I cannot have an enjoyable experience just because of the heat, its a very scratchy feeling, not very desirable, it can be lessened by wearing no clothing at all when I take it. <br>I did not receive the trance on my first time, smoking it for the first time in the daytime was actually quite pleasant since the effect for me was a lot like laughing gas mixed with a stimulation that makes me want to run and shake my body and head in order to squeeze the most from that. After that initial rush and peak the other effects were light visual hallucination that is kind of like hash and low dose mushrooms, yet I felt like something great and amazing might be on its way\n\n\n"
}
