{
 "title": "Like MDMA Without the Fun",
 "author": "radiometress",
 "citation": "   radiometress. \"Like MDMA Without the Fun: experience with bk-MDEA (ID 56007)\". Erowid.org. Sep 15, 2006. erowid.org/exp/56007",
 "substance": "bk-MDEA",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "160 mg",
   "oral",
   "bk-MDEA",
   " ",
   "  T+ 2:00",
   "90 mg",
   "oral",
   "bk-MDEA",
   " ",
   "  T+ 0:00",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   " ",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 8:15",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 56007",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Sep 15, 2006",
   "Views: 18580",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At approximately 8:45, ingested approximately 160 mg of ethylone. 30 minutes later noticed the need to go to the bathroom as well as some nausea that seemed to come and go in the next half hour. I also experienced a slight headache that came and went after the first 30 minutes. I didn't take anything for the headache for fear of aggravating the nausea, but it may not have been such a bad idea. </p><p>Full effects began about an hour after ingestion. The effects were similar to MDMA in that there was a significant lack of inhibition in terms of talking about things that lie just beneath the surface but usually take some work to get out when I am sober. Though there was no real 'push' from the substance itself, once a subject was brought up it was very easy to open up and bring up subjects related to sexuality as well as interpersonal relationships and talk about them with little inhibition. </p><p>I was taking the substance with my husband, so it was a definite aid in talking about various aspects of our relationship. Much of the trip rotated around talking about such issues and exploring our relationship sexually. I have only ever really experienced that type of complete lack of inhibition on MDMA. The difference with ethylone is that the euphoria is not there both in terms of a body high as well as the mental euphoria. On the plus side, that means I am able to focus when talking about important issues and actually remember all aspects of the conversations the next day rather than getting distracted every 5 minutes. </p><p>Physically, I would best describe the experience as stepping through a time warp of sorts. In the ethylone world things seem to move in slow motion. My body feels a bit heavy and difficult to move, though once I move there is no problem. Sexually, I was unable to achieve an orgasm, but the sexual experience was extremely enjoyable nonetheless. </p><p>I would say the come down began at about 1-2 am. There were periods of falling into anxiety and negative feelings about the trip ending as well as the desire to extend the trip, but these did not last too long and could be deflected to some extent by focusing on some other kind of activity. I attempted to go to bed at about 5 am and found it rather difficult to fall asleep even after taking 1mg xanax. The period of falling asleep was rather interesting because there were moments when I fell into a kind of trip state where I wasn't asleep, but was lost in a kind of closed eye world with very, very mild visuals. I woke up once in the morning with a headache, very tired, but was able to sleep till about 1 pm the next day. </p><p>I doubt if I will do this substance again anytime soon. The hangover was very similar to that from MDMA, but I also had a headache though it went away with some ibuprofen. I'm not sure if the headache was simply an exhibition of my usual monthly migraines. It could have been. </p><p>I may consider low doses if there were any interpersonal relationship issues I thought needed to be brought out. It would certainly aid with such issues.</p><p>There are two amendments I'd like to make.  First,  Cannabis and some nitrous oxide were used during and after the peak of this experience.  Second, ~150mg MDMA and 22mg 2C-B were taken one week previous to this experience.</p>"
}
