{
 "title": "Too Mild for My Tolerance",
 "author": "sixthseal",
 "citation": "   sixthseal. \"Too Mild for My Tolerance: experience with Opioids (Meperidine) (ID 56028)\". Erowid.org. Sep 21, 2006. erowid.org/exp/56028",
 "substance": "Opioids (Meperidine)",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "IM",
   "Opiates",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "56028",
   "Male",
   " ",
   "Not Given",
   "Sep 21, 2006",
   "33414",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nPethidine is also known as meperidine a.k.a Demerol, an opiate agonist used for moderate to severe pain, with an equivalency of 7.5 mg of pethidine to 1 mg of morphine in parenteral administration. Pethidine/meperidine has a duration of 2 hours so it's a pretty short acting opioid. I was out doctor shopping the whole of last night and didn't get a hit out of the five medical establishments I went to. I guess six is my lucky number coz I managed to get a pethidine IM injection from it. =D</p><p>[photo no longer available]</p><p>This is Injection Pethidine Hydrochloride 50 mg/ml made by DuoPharma (Malaysia). I have never tried pethidine IM injection so imagine my glee as I made this happen. ,)\rDoctor: You were here for DF-118 last time right? The medical record says you have a bad back.\rMe: I actually had a slipped disc (actually, I don't ,)) and it slipped again for the second time.</p><p>(makes 'ouch face', grimaces and made as if my spinal cord was killing me)\rDoctor: Do we have DF-118 here? (talking to nurse)\rNurse: (after rummaging through the restricted access medication cabinet, they don't have it, I know that coz I've been here before) No we don't, but we have Voltaren.\rDoctor: Do you want something else? I can give you another pain-killer.\rMe: (Hell no! It's opiates or nothing) Doctor, I hope you can help coz I'm in a lot of pain right now. Can you write a script or something?\rDoctor: Okay, do you have a medical history of your slipped disc?\rMe: Yeah, I had an MRI and X-Ray done in KL, where it happened (which didn't happen, of course ,)) and the prognosis was a slipped disc, which I slipped again just now (*grimace of pain*)\rDoctor: Do you have it with you?\rMe: No, I'm sorry doctor, I left the medical documents in KL...\rDoctor: Okay, well since you have a prior here, I'll script you. Is there anything else?\rMe: (pushing my luck, deciding to go for gold) Hey, I know this is a strange question, but I'm in a lot of pain right now, do you have anything to help me get through tonight? Can you give me a morphine shot? (Prays to God he doesn't go amok)\rDoctor: Morphine...hmm...well, we do have morphine but we don't give it to outpatients. I think we have pethidine though, do you want that?\rMe: Is pethidine an opiate? (Knowing full well it is, but no harm in playing the dumb patient)\rDoctor: Yes it is.</p><p>(Writes Pethidine 50 mg IM stat on my medical record)\rMe: (looks) (tries not to grin) (tries not to grin again, perhaps somewhat unsuccessfully) Thank you very much doctor.\rDoctor: Alright, just lie there and I'll prep the shot.\rMe: (puts on a show of painful lying down and bolts straight up, apparently with a good back again) Hey, I'm sorry doctor, another unusual request, can I take a photo of the pethidine vial?\rDoctor: Why?\rMe: It's just an interest of mine. (starts photoshoot of the IM pethidine 50 mg snap off ampoule) Thanks doctor.\rDoctor: Okay, I'm going to inject you now. Turn over.\rMe: Er...can I take the IM injection in my arm? (I don't want the doctor to see my thigh, which is the best place to bang shit if you're holding down a professional job - full of scar marks and bruises from injections - he would have known for sure I'm an IDU - Injecting Drug User).\rDoctor: (Grips my arm) Seems to be okay here.\rMe: (starts filming the procedure)</p><p>[photo no longer available]\rScript from pethidine injection video:\rMe: Is it in? Pethidine 50 mg?\rDoctor: Mmm...\rMe: Okay, IM, sixthseal.com (Jesus Christ, I should not have said that in the video but it just slipped out).</p><p>(sounds of pethidine injection process)\rMe: Yeah, that's the place.\rDoctor: Hmm...why do you have some bruises here?</p><p>(OMG those are my IM injection spots when I was injecting ketamine)\rMe: Er...uh...they're some just bruises, ya know. I probably hit something.</p><p>(Quickly changes subject)\rMe: So, is that pethidine 50 mg?\rDoctor: Yeah.\rMe: Thanks.</p><p>[video no longer available]\rDoctor: Are you driving?\rMe: Er...no. (actually I am)\rDoctor: This will cause the usual opiate side effects, drowsiness etc. so be careful.\rMe: I will, my friend is just outside (actually no one is outside, I don't take friends on doctor shopping expedition after a disastrous incident where I lost a good doctor coz me and my friend was stoned and high on meth and she had a laughing fit).\rDoctor: Okay, here is your script. You're not a drug addict are you?\rMe: (*coughs and nearly chokes*) Of course I'm not. I hate drugs. ,) (I didn't wink, I'm just winking on the blog)\rDoctor: Good.\rPrice of 50 mg pethidine vial: RM 10\rPrice of surgical consumable items (that means the syringe and swabs): RM 0.40\rPrice of boosting a pethidine shot: PRICELESS! =D\rPethidine Experience Report:</p><p>(10 minutes after the shot)\rMe: I'm not feeling it yet, doctor? How long does it take to kick in?\rDoctor: It's not going to be so fast.\rMe: So we can't IV pethidine huh?\rDoctor: (gives me a strange look) No, it's for IM.\rMe: Okay, thank you very, very much doctor.</p><p>(Shakes doctor's hand very vigorously, perhaps too enthusiastic to be unsuspicious)</p><p>[photo no longer available]</p><p>T+ 0:30: A general feeling of elation and well being. Don't know if it's the pethidine or the euphoria of getting away with a shot of pethidine just like that.</p><p>T+ 0:45: Cigarettes smokes well, like on opiates but it's nowhere near as strong as dihydrocodeine. It does give a rather pleasant high though - kinda chill, but still motivated, I'm typing this as we speak, which I usually don't.</p><p>T+ 1:00: I think this is the peak - it's nothing special - I could compare it to a cross between tramadol and codeine if that makes sense. It feels like tramadol + codeine...and er, it seems a wee bit hallucinatory, I don't know how to explain it, it's like the feeling when I get a hit of LSD and am about to come up and trip, but it never happens. I just mentioned it coz I saw the cigarette smoke drifting off. Perhaps a more apt description would be a very mild case of Ambien induced hallucinations.</p><p>T+ 1:30: Hey, I'm feeling a little of that opiate warmth now. It's nice but too mild for my tolerance.</p><p>50 mg of pethidine wasn't enough to get me off, but I did feel good - which part of it is the phethedine and which part is the elation of pulling this shit off is subjective. I'm full of glee though. :)\rPethidine IM feels a lot like a combination of tramadol and codeine at doses of 100 mg and 300 mg respectively. There is a general feeling of well being and slight stimulation but with some of the jitteriness of tramadol (very mild). It's more like a cross between tramadol and codeine. The opiate warmth is present but mild. At my tolerance level, 50 mg of pethidine isn't much, but at least I can feel it...and I'm STILL feeling st0ked about pulling this off! =D</p>"
}
