{
 "title": "One Bad Day",
 "author": "Robbo",
 "citation": "   Robbo. \"One Bad Day: experience with Cannabis & Alcohol (ID 56041)\". Erowid.org. Aug 25, 2009. erowid.org/exp/56041",
 "substance": "Cannabis & Alcohol",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 56041",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 25, 2009",
   "Views: 1774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOk first a bit of background information. I have smoked pot for around 11 years on and off. I used to be quite a heavy user in my younger days but after developing panic attacks and paranoia I quit. Lately when I smoke I only need 1 pipe to get me mashed. <br>This particular day it was around 1pm and I had not yet eaten. I decided to have a pipe and go to the pub for a few beers. We played some pool, had some drinks and I decided to go and have another pipe by the car. As soon as I exhaled I knew I was going to be ripped. What I didn't know was that this was going to be the day I quit weed. <br>I went back into the pub and to the pool table. I took one look at my mate who knew straight away I was wasted. At first I laughed but within 2 minutes the paranoia kicked in. Everything inside me was going so fast. My heart was racing, my hands were perspiring, and my mind was moving from sound to thought, then to smell and it kept getting stronger and stronger. I had to get out of there. I said to my friend 'Let's go I am too wasted, I have to go right now'. I felt like I was going to explode. I asked him to feel my heart rate. He said it was normal.<br>We got into the car and I heard some music that I knew. I turned the CD player up and pretty much danced for the trip home. Inside I was speeding my head off. I mentioned at one stage that I needed to find a dog because I now understood them??? I was in another time zone. In a way this part was actually eye opening but the paranoia was far too overwhelming. I recorded onto my phone a clip of me talking to myself like there were two of me, and I was sending it from another dimension. Looking back at the clip it is embarrassing to see myself in that state. The trip home felt like it took 45 minutes but it was only a 20 minute drive. <br>The first thing I did when we got home was get on my drums. I was the most stoned I had ever been and my mind was racing from thought to thought. My mate hopped on guitar and the other on bass and I just went with it. Every bar of drums felt like a lifetime. I could hear everything single hit perfectly and when I missed something, to me it stood right out but I doubt the others even noticed. It was the best jam I have had in my 10 years of drumming just because of the level I was on. In one song we made up, I could feel the emotion switch from sad to happy. I really cannot give my experience justice. An hour and a half passed of jamming but to me it felt like 5 hours!!<br>It was time to have a shower and I felt like such an amateur. I was washing myself but  I felt like I was really crap at it. I had this impending feeling of doom. I thought the shower glass was going to break and cut me open. I had to get out of there. The next hour and a half was pretty much me trying to get back to reality. I was still really stoned but I could at least handle it. It was a 5 hour round trip till I was straight again but the first 3 and a half hours were horrible. The thing that saved me in this state was the jam. Even then I still felt like I was going insane. Safe to say this was my last trip on the Mary Jane ride\n\n\n"
}
