{
 "title": "A Short Trip to Extravagance",
 "author": "Mr. Pilgrim",
 "citation": "   Mr. Pilgrim. \"A Short Trip to Extravagance: experience with DMT (ID 56042)\". Erowid.org. Dec 10, 2006. erowid.org/exp/56042",
 "substance": "DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "DMT",
   "(powder / crystals)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "56042",
   "Male",
   " ",
   "Not Given",
   "Dec 10, 2006",
   "Views: 4202",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started at about 6:00AM one morning after I had gotten ready for work. I pulled out a fairly large joint of Marijuana that was chemically combined with DMT that I had recieved from a buddy the night before. I went out on my back porch amidst a dense forest and near a fairly small backyard pond.</p><p>I lit up the joint and smoked the whole thing in about 1 and a half minutes taking very large hits 'til it was burning my fingers at the end. The first thing I remember seeing, that was out of the normal, was the seperation of every single water dropplet in front of me. The time was about 6:10AM, and I walked inside, and the journey began.</p><p>I was going to attempt heading to the bathroom before my trip began, but it was too  late and I had lost all sense of reality. The first thing to hit me was probably the largest emotion I've ever fealt in my life. A very positive emotion considering what I had experienced in the past. I fealt like I had absorbed all of the worlds peace, love, and serenity in that microsecond of my life. Along with this came a large explosion of color, almost like a large spark explosion that you see in comic books.</p><p>And when that emotion had subsided, I found myself in an extravagent castle, made out of a khaki stone with gold and jewels piled everywhere, and large stone columns, painted in a striped pattern, were soring into the heavans. At this point, to my suprise when I thought about it later on, I was not shocked, but I was strangely at home. I fealt this is where I should be and as long as I was here, retaining all of the knowledge of my emotional explosion earlier in the trip, that there was no worries in the world, and that the entire world had reached a single cooperative and euphoric state that Lennon had dreamed for not so long ago.</p><p>I was in this castle for what seemed to be millions of lifetimes, just wallowing in this amazing feeling of peacefulness when finally I found myself in a downwards spiral. I found that one of the endless pilars that was in the room was falling towards me. But rather that feeling scared of the death that I knew I was going to recieve, I knew it was because I had done my share in bringing peace into this world, and knew I had to, like Adam and Eve, face the harshness of reality. The pillar struck me, and like an apple hitting me in the forehead from atop a tree, I was back in my basement.</p><p>One of the strangest things was that there was a pool que in my lap where I was lying, which I later connected to being that pillar that toppled me back into reality.</p><p>I checked my watch immediatly to see how many years I must have had been laying here for, decaying, and to my suprise, it was only 6:28AM. Still just enough time for me to head to work.</p><p>It was the singlemost amazing trip of my life, in just that 18 minutes of my life, I had fealt the best I have ever fealt in my life, and I hope many others can feel what I did that night.</p><p>Peace to all of ya.</p>"
}
