{
 "title": "Chain Reaction",
 "author": "rarge",
 "citation": "   rarge. \"Chain Reaction: experience with Ketamine & Alcohol (ID 56086)\". Erowid.org. Oct 16, 2010. erowid.org/exp/56086",
 "substance": "Ketamine & Alcohol",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "2 lines",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56086",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 16, 2010",
   "Views: 2846",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started on a Sunday night when me and my two roommates decided to go out to a night club and test out our social skills. We live in China, and are currently trying to learn the language to the best of our ability without having to spend money for structured lessons. One of the best ways to learn a language is through necessity, after all necessity is the mother of invention. The order of necessity for that night went in this order: get free alcohol, get drunk, find interesting and exotic women and bang them, if theres enough time left get some drugs. Little did we know that the order of things would be a little messed up.</p><p>First Ill give you a little background information. In the past I have experimented with: marijuana, mushrooms, 2c-b, ketamine, ecstacy and salvia. Its not an extremely large repertoire, but I am still experienced in the field of chemical ingestion to be the highlight of the night.</p><p>(Normal reality)</p><p>After arriving at the club, our friend L was instantly swarmed by girls, and I acted as a translator for him, they invited us to their table and asked us to sit down and have some drinks with them. We talk, clinked glasses and had some fun, until our topic turned to one of drugs. In this country, this kind of thing is extremely illegal, and being caught can mean your life if it is under the wrong circumstance. Well, the other friend I was with (J) brought up the subject of Ketamine, and how it is so popular lately in this country. The girl suddenly had a devilish smile on her face and left the table rather quickly. She returned with her friend, who is apparently a member of the biggest drug ring in the city where I currently preside. He pulled out a small bag and motioned toward the door, he got up and we followed him to a bathroom stall, where he laid out lines of disproportionately large size, and asked us to take as much as we want up our noses. At this point I had a few drinks in me and was feeling uninhibited so I bent over and took two large lines in my nose, If you asked me to guess the dosage I could not tell you, I have no skill at eyeballing whatsoever, all I can tell you is IT WAS BIG! All three of us finished and left the stall, our new friend followed us out shortly after with a satisfied look on his face. This was to be the end of normal reality for the rest of the night.</p><p>(First hints) --> Ill give a broken down feeling of the onset.</p><p>T+ :30 seconds --> a slight burning in the nasal passage and the start of a drip in the back of my throat, we decided to walk back to our sponsors couch at this point and try to relax. All three of us decided that this was going to be a heavy trip</p><p>T+ 1:00 --> we sit down at the couch and I see L blow his nose and give me a worried look, I can feel a slight tingle at the base of my skull and the loud music starts to become more pronounced but blended together (like I couldnt tell base from treble)</p><p>T+ 3:00 --> I looked at J, he had a blank stare on his face, he didnt seem to be responding to outside stimulus such as our new friends offering him cigarettes but rather touching his temples and quietly uttering What the hell is happening? This is where I started to feel the K in a pronounced manner as it took over the alcohol in intensity, I felt my body shrink in size and importance. The tingling at the base of my skull had surrounded the rest of my body with more feeling around the eyes and the center of my forehead, my limbs were heavy and moving became very difficult. My mind started to recoil in horror (kind of like in Fear and Loathing in Las Vegas). L sensing something bad was about to happen convinced me to leave the club (he had blown the K out of his nose in a desperate attempt to not end up like J), we rushed outside and he sat me down on a bench.</p><p>T+ 5:00 - blank.</p><p>At that point all memory of my experience until about 40 minutes later was lost in a storm of colors and undefined shapes, as well as muffled voices saying things to me in a foreign language that I can barely understand anyways. The rest of this tale is a recount told to me by L the next day. </p><p>Apparently as he re-entered the club to find J and extract him, one of the Chinese guys went outside and brought me back in, saying that I should dance and listen to music, also that he would give us free drinks and fruit to eat. </p><p>He looked at me, and all I could muster was a blank stare (I have no recollection of this part), and J was the same way. Eventually he convinced the Chinese guys to let us leave without offending them, and we exited the club and headed for a Taxi (if you have ever been in China you will know that if something weird happens [especially to a foreigner] there is instantly 50 people watching and talking about it) L stumbled out of the club with us hanging off his shoulders, and the Chinese guys were helping him (we were basically sacs of potatoes at this point). He opened the taxi door and we got in and sped off to our apartment. At this time we started to come to (this was something like 2 hours after the dose was first taken). J woke up first and started to mumble something about L skywalker... The taxi driver was laughing at us, and insisting that we shouldnt drink so much, after leaving the taxi we slowly robot walked our way to the base of the apartment building and I sat down in a corner. This is the low point of my story as I proceeded to throw up all over the side of my body, and onto the ground, then I fell over and cracked my skull on the ground. If I wasnt anesthetized this could have been extremely painful. </p><p>It was said that walking up the stairs to our apartment we resembled fauns finding fresh legs after being first born. A couple of times J bailed onto the ground, but eventually we made it to the couch and put on some music. I woke up the next day at around 10:30 am and asked L what happened the night before. He had recorded us in the house on his digital camera and the conversation sounded something like this:</p><p>L: J how are you feeling?</p><p>J: you, you, you, are L sky waaaaaalker. Thankkkks maaaan.</p><p>L: how about you guy? </p><p>Me: snoring sound</p><p>L: Oh! The beauty of drugs, the wonder, if only everyone could experience this. (sarcastically)</p><p>Me: IIIII dont knoow what youre talk aaaaaaboutt. I hud Lots of fn.</p><p>L: yah, I can see the fun all over your shirt.</p><p>Today, I woke up with little hangover, other than a sore nose, a bump on the back of my head and the stale taste of cigarettes and beer on my breath (mixed with a little bit of a chemical taste), and a hazy feeling, that might be with me for a couple days. I had no revelations, no spiritual guides to walk me through mystical planes, no elves talk to me about my life, I had simply been reduced to an object with the intelligence of an eggplant, as my mind recoiled into the recesses of my brain, like a tendon being snapped.</p><p>If there is one thing I am glad for, It is to be alive.</p>"
}
