{
 "title": "Too Much",
 "author": "Mini-thins",
 "citation": " Mini-thins. \"Too Much: experience with Ephedrine (ID 5611)\". Erowid.org. May 23, 2001. erowid.org/exp/5611",
 "substance": "Ephedrine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5611",
   "Female",
   "",
   "Not Given",
   "May 23, 2001",
   "49282",
   " "
  ]
 ],
 "report": "<p>\nOne night I was bored so i stopped at a convenience store and bought 2 little packs of 6 mini-thins each. I took 6 on the way home (25 mg each) at about 11:00 and called my friend J to see if he wanted to come over. When he got there i gave him the other 6.</p><p>The first feeling I had was that my heart started to beat very fast. I absolutely couldn't sit still and I walked in circles around my house for a few minutes then felt like i suddenly had to sit back down. When i would sit down i felt like my whole body was one big heartbeat and I had to make a very concious effort to breathe. I spent a couple hours leaping up and running around the house followed by laying motionless and then covering myself with a blanket then taking it back off again.</p><p>At one point i remember describing it to J as a mild MDMA roll. My eyes were pinging and I felt the need to chew on a straw -but- my eyes ping all the time when I'm tired ever since the first time I tried MDMA.</p><p>About 3 hours after i dropped the pills i began to feel nauseous. It was very unpleasant and my heart was pounding so fast and i felt like someone was sitting on my chest. I finally calmed down enough to enjoy what was left of the feeling, which was mostly tingling in my scalp. </p><p>I decided to try to go to sleep but I just laid in my bed for several hours rolling around trying to get comfortable. I remember still being awake at about 8am and I -think- I slept for about 30 minutes then i got up and started watching tv. The rest of the day i felt very sluggish but not sleepy at all. I didn't go back to sleep until the next night. </p><p>I will probably take ephedrine again but I will only take about half of what i did.</p>"
}
