{
 "title": "Blindsided by Depression",
 "author": "andre3000",
 "citation": "   andre3000. \"Blindsided by Depression: experience with Cocaine (ID 56176)\". Erowid.org. Jan 25, 2009. erowid.org/exp/56176",
 "substance": "Cocaine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 56176",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2009",
   "Views: 3976",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I want to make this short and to the point. I hope it offers some insight into coke from my insight. I might add very shortly that I make no illusions- I use my fair share of substances and am not partial to anything in particular. The first time I ever tried coke, I shared a gram between myself and three other people. The second time we got it, it was from a relatively shady source who sold us a 'gram' for 50 bucks. It was actually an 8-ball. Nonetheless, it was good coke- pearlescent, shiny etc. We each took about a gram for our own. I 'got the ball rolling' as it were, with the first line- about half the length of an American bill and approximately half a pen's width. I felt very euphoric and also, very energetic. In short, very 'good.'</p><p>Over the course of the evening, I snorted the rest of the gram, often retreating to the bathroom of a friend's house to take knife-tips of coke just to elevate myself and to 'rekindle' the fire of that first line. In the end, I shorted the whole gram in the first night, only to have the seller offer more of the same variety of coke to me. Let it suffice to say that he was obviously offering good coke at a cheap rate for the sake of trying to break into the coke market with some naive users. </p><p>All told, I can vouch for the validity of all experiences based upon my own limited scope, but I can truly say that the day following my coke use, I was blindsided by depression and overall malaise as a direct result of its usage. As an addendum, I can truly say that I felt as if the only thing that would 'cure' this was more coke and that is not a good place to be for anyone.</p>"
}
