{
 "title": "A Serene Afternoon",
 "author": "Red Skies",
 "citation": "   Red Skies. \"A Serene Afternoon: experience with Mushrooms  (ID 56203)\". Erowid.org. Jun 4, 2009. erowid.org/exp/56203",
 "substance": "Mushrooms ",
 "bodyweight": "188 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 56203",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 4, 2009",
   "Views: 2581",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAt a small, all-day music festival in New England, things were taking a while to heat up, and it being early in the afternoon and the headlining talent not performing until the evening, a friend says, 'Let's go eat some mushrooms.' No... wait, okay, yes, let's. 'I've never done this before,' I admitted. My day was already going nicely after seeing many friends and having a beer or two at the bar, so my friend and I go, chew up, and swallow these things, that taste like... cardboard, maybe. Anyway, we have a smoke and I walk back in with the same confidence I get after eating a couple pills of ecstasy, that, 'I know something you guys don't,' kind of feeling.<br>I chat with people, listen to some music and hang around and feel a little chilly, and then nervous, but not so much anticipation but something else. And then, 'Oh my gosh, what if I ate too much?' so I sit down on a couch next to another buddy and tell him what I did. He responds, 'Man, in an hour you're gonna be all like this,' and proceeds to make a fearful face while holding his hands up as if pushing the room away, and I was surprised how this affected me as I started thinking, 'Oh my god am I really gonna' freak out?' So I told myself no, I wasn't going to... and slumped on the couch feeling like I just smoked a bunch of weed - a fat and lazy kind of feeling, something I don't really like since my drugs of choice are usually amphetamines, mdma, and cocaine.<br>The lights are bright and I'm beginning to enjoy this feeling of relaxation, melting into the leather couch and whoa, breakbeats have never sounded so good. Watching someone spinning lights quickly gave way to tracer effects, and a feeling like my central vision was expanding - I could very distinctly see my hand holding a cigarette even though it was on the far edge of my vision. The grain of the wood, melting and folding into itself. 'Nice,' I thought. I stood up and felt very 'flowy,' but walked to the bar area, through a crowded dance floor with exacting precision, not even a hiccup to my gait.<br>I peed in the bathroom, smiled at myself in the mirror and spent a few moments examining the wooden door, clearly made up of some kind of brown liquid, and having done carpentry work, wondered 'How do they install this?' and then laughed at my own question. Walked back out to the bar area, sat next to a friend and struck up conversation with an almost unfamiliar ease, looking at peoples faces and how they almost looked 'airbrushed' as after the trip I could see pock marks, zits, and other 'impurities' that were simply not visible while on mushrooms. As the conversation went on, more and more people joined our group and as that corner of the bar was becoming more and more crowded, I felt more and more comfortable and just, 'myself,' as ecstasy use has certainly helped me to open up to people, with mushrooms this feeling was even more pronounced. And still, my headspace was quite clear and had no problem focusing on conversations (unless I stared off at an empty beer bottle waving and growing for a sec.)<br>So being out of smokes, I left to walk out to my car, parked on the street. This did not strike me as a bad idea, and I was intrigued by what it would be like outside since my entire trip was thus far spent in a bar and dancefloor area. So I walk out into an overcast yet quite bright (as in, brighter than it should be,) day and down the street to my car, though it took quite some time as clearly, every car on the entire block has just gotten a wash-n-wax, and someone MUST have just powerwashed and glazed the sidewalk. There was no dried gum or bird shit to be seen - ANYWHERE. I got my smokes with no problem and enjoyed the nice, shiny stroll back inside. I decided to try and dance and doing 'liquid dancing,' with which I have minimal experience, suddenly became easy, and my arms and hands flowed about freely yet distinctly to the beat of the music, and also with my own style which until that point was unknown to me. After coming down, I could still dance like that, and I did.<br>When I noticed things weren't looking as wild as they had been before, I realized I was coming down about 3 hours after eating the mushrooms. Still, the massive endorphin release from such a cool experience on the mushrooms, as well as residual visual effects lingered on as I sat elbow to elbow with some good friends acting silly, pinching nipples, and generally acting much younger than my 23 year-old psyche usually allows me to do. That afternoon trip was so pleasant and comforting that I still felt very much at peace, quite comparable to an ecstasy afterglow sans amphetamine effects, for the rest of the evening, which lasted another 7 hours.<br>Clearly I did not eat enough mushrooms for a wild ride into another dimension complete with spiritual revelations, but that first little taste was comforting and exhilarating, and also as much as I hate to say it, mushrooms being so 'sacred' and whatnot, it was FUN. I also felt like I was richly bonding with the people I was with, and more importantly I was also able to express it. I will definitely try mushrooms again, although I think with a higher dosage, I will choose a more serene setting.\n\n\n"
}
