{
 "title": "Enlightening with a sign of toxicity",
 "author": "Leprchaun",
 "citation": "   Leprchaun. \"Enlightening with a sign of toxicity: experience with Ecstasy (Tested MD*) + Moclobemide (MOAI) (ID 5620)\". Erowid.org. Mar 11, 2001. erowid.org/exp/5620",
 "substance": "Ecstasy (Tested MD*) + Moclobemide (MOAI)",
 "bodyweight": "64 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Moclobemide",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5620",
   "Male",
   " ",
   "Not Given",
   "Mar 11, 2001",
   "12487",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n[erowid note: some readers have reported confusion with the dosage.  This report involves the use of 1/2 pill of Moclobemide (100 milligrams).  Also, combining stimulants and MAOIs is potentially very dangerous and very little safety data is available.  Some MAOIs + MDMA cause fatal reactions.]</p><p>I had been told on previous accounts that MDMA and an MOAI can prolong the euphoric and empathogenic qualities of MDMA. However after some research I had discovered this combination to be quite dangerous, with a risk of hypertension. I decided for the sake of research to have the two in combination. I have known of people to have a full 200mg dose of Moclobemide and MDMA and have no problems. However, I had was taking a chance and decided to only take half a dose of Moclobemide, this in retrospect was a very good idea.</p><p>I had never had a feeling so intense as the one that had occured, and this feeling was wonderful and enjoyable, my night was prevalent with hedonistic craziness. New friends were made, and old relationships reinforced.</p><p>However, since there are so many desciptions the MDMA state of mind, I won't go much into that. The things of note are the toxic responses to the experience I had.</p><p>After ingesting the Pill about 5 minutes after I felt a strange response in my body. It felt as if my nervous system was speeding up, but the energy levels were placed elsewhere as I suddenly felt weak. Twenty mintutes later I had a mild elevation of mood. As we were entering the place we were looking for I suddenly felt my entire body wrench. I went pale and the temprature in my hands dropped suddenly, they felt numb. My head was spinning and the vertigo was unbelievable. The temprature drop in my hands continued. I walked into the club and I began to feel very sick. I felt like I was poisoned. I then sat down, contemplating to call an Ambulance. However, as the urge to throw-up passed the euphoria and empathy errupted. The intersting aspect about the Addition of an MOAI was when the euphoria/empathy began to recede all of a sudden it was like I had just dropped again, and a full burst of the MDMA feelings errupted again. This happened about four or five times with the intensity of each consequtive burst slowly receding. At the end I decided to ingest some Prozac and 5-HTP to help lessen the toxic damage I may have caused. I will not repeat this experiment due to the fear of toxic damage, but it was worth it, even in only in the name of research.</p><p>This was one of the most memorable experiences I had ever had, and now it seems like a dream. Yet, there seems little difference between and a dream and reality in altered states of conciousness.</p>"
}
