{
 "title": "My Brain Split in Three",
 "author": "Opimum",
 "citation": "   Opimum. \"My Brain Split in Three: experience with Salvia Divinorum (60x extract) (ID 56212)\". Erowid.org. Aug 26, 2009. erowid.org/exp/56212",
 "substance": "Salvia Divinorum (60x extract)",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56212",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 26, 2009",
   "Views: 2460",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Prelude: it was an average Saturday afternoon, and my parents were out at the cinema, the time was approximately 3pm. I have had quite a few experiences with salvia in the past, but only one prior to this where my reality/perception had been completely changed. I rang up my friend, 'O', who turned out not to be in. I have been determined to really push salvia as hard as I can for a long while, so despite having no sitter, I decided I'd hit it anyway. I prepared a small bowl of 60x, planning to do it in two hits, filled the bong up, and sat on a small set of steps outside my cellar door. </p><p>Please note: I struggle to comprehend parts of this, so if certain snippets make very little sense, sorry. </p><p>T: I take back the average size hit with surprising ease (my lungs can't handle much), and wait for the thirty seconds to pass. I started to get 'salvia tingles' (weird tingles up and down my arms, almost like pins and needles) at about 20 seconds in, so I was expectant of something good. I can't remember looking down at my watch and seeing thirty, but I do remember breathing out and looking at my reflection in the door. </p><p>I looked down at my feet, and suddenly, there was a princess on my left, and a horse on my right. I find this part immensely difficult to explain: they were not there, they weren't a hallucination, they weren't with me at all, but somehow, they were in my consciousness, this princess and the horse. There's a bit of a blank in my mind at this point (salvia tends to batter my memory a fair amount), but I remember my rational mind being used as a medium for argument between the horse and the princess about whether I should take the second hit. The horse just wanted me to get it done with, I can't exactly remember what the princess wanted, but I feel it might have been for me to not to do it, and my 'rational' mind in the middle was saying there couldn't be any salvia left in the bowl. </p><p>So anyway, I finally come to the conclusion the second hit should be taken, blaze the rest of the bowl, and inhale deeply. I hold the hit for a few seconds, then think 'king', which immediately makes me exhale. This is another thing I really cannot explain: I have no idea why 'king' would make me exhale a bong hit of salvia divinorum. Logic would presume that the princess told me not to take the hit, however, since when has logic ever played a part in strong psychedelics?</p><p>I sit there, enjoying my brain being split in three, trying to comprehend what in this godly earth is happening to me, when suddenly it occurs to me to unscrew the bowl. I tend to find this kind of stuff impossible to do, so I just sat there with my chin in hands, and forehead on top of bong, but after I thought 'perhaps I should unscrew the bowl?', the horse would not stop nagging at me about it. I gave in, unscrewed the bowl, and emptied it. </p><p>I screwed it back on, and this is when stuff got rather less weird, but still equally messed up (note: if I say that I said 'words here', I might have thought them. I have absolutely no idea whether I was speaking or thinking). Due to the fact I was now done with the bong, I thought emptying it might be a good plan, so I tip it out. All the water comes out instantly, and so do the top 5 or so blocks of ice: but three blocks remain - this small fact pissed me off immensely, so I thought I'd have some fun with these damn rebellious ice blocks. After all, I had made them, who the hell did they think they were to stand up to me?</p><p>So, I said 'you want a fucking holiday in the bong? Fine, have a fucking holiday'. At this point, I covered the mouthpiece with my hand and shook the bong as hard as I felt would be humanly possible, hoping to seriously damage what I considered the 'Father' (the top ice block), and hopefully hurt his motherless children too. So, I ask 'Are you done holidaying yet?' and try to tip the ice out the bong (the bong I was using has a rubber, removable mouthpiece, if you're wondering how I could get ice in but not out). The ice doesn't move. Now, at this point, either my memory is very skewed, or I had a hallucination, because I distinctly remember pushing the ice out from the inside of the bong, which is obviously impossible. </p><p>Anyway, whatever happened, all the ice was now on the floor. I stamp on the various blocks a bit, shouting 'take that you fuckers!' and just generally enjoying myself a great deal. I then tried to open the cellar door, which I did successfully after a few attempts. Stepping inside sobered me up no end. I suddenly felt completely normal, except for the fact I think I had a bit of an 'afterglow' from the trip. At any rate, I used it as a great excuse to go upstairs, play comfortably numb excessively loud and shout the lyrics at the top of my voice. </p><p>Oh, I just realised I didn't really give an indication of the timescale: time was messed up. The whole mental process from taking the first hit to opening the cellar door again was at least 20 minutes worth of normal thinking, however, it took a maximum of 10 minutes, and I believe it was closer to two. </p><p>All in all, I'd say salvia seems to be quite an interesting drug, and I would absolutely 100% definitely like to try a much higher dose with a sitter.</p>"
}
