{
 "title": "A Sedentary Stoning",
 "author": "Red Bennies",
 "citation": "   Red Bennies. \"A Sedentary Stoning: experience with Kratom (ID 56227)\". Erowid.org. Oct 18, 2006. erowid.org/exp/56227",
 "substance": "Kratom",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Kratom",
   "(liquid)",
   "  T+ 0:39",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:11",
   "  ",
   "smoked",
   "Leonotis leonurus",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56227",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 18, 2006",
   "Views: 16141",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Relaxing at my house while a heavy rainstorm rages outside, ready to try Kratom for the first time I was in a peaceful mindset, no stressors to harsh my buzz, and I am ready to spend a night enjoying a new psychoactive substance. I had recently acquired a package. I got 4g of kratom 15x extract, 1g wild dagga 25x resin, 1g lotus paste, etc...  Anyway,</p><p>9:51  </p><p>I mix as close to 2 grams of the light brown powder as I can without scales into some tea, and add a little bit of honey because I have heard it has a bitter taste.  It mixed very well, I expected to have to stir this thing for a while to get the clumps out, like a protein shake, but it was very soluble.  I downed the glass, no problem.  It didn't really taste bad at all, it actually tasted a little bit like instant ice tea mix, so tea was the perfect medium.  I washed the glass out to get the last of the grains. I had a kinda empty stomach, I had eaten a sandwich about two and a half hours ago.</p><p>10:05  </p><p>I go out to my garage.  I have a little corner all set up with my rows of different herbs and paraphernalia and the like, and a little chair.  I start rolling a joint. I ground up 1/2g mid-grade cannabis and 1/2g I.O. Dro buds for the taste, as well as to space out my pot habit, as it is quite expensive.</p><p>10:07  </p><p>I start feeling a Hydrocodone-like buzz, my eyes felt somewhat ho, and I felt warm and fuzzy.</p><p>10:10  </p><p>Rolling joints slowly, motor coordination slightly impaired.  I feel a euphoria and a definite opioid buzz. Delicious.</p><p>10:18  </p><p>Ah, there it is, the familiar itch.  It said that 2g was a strong dose, I would hate to think that this is the peak.  I feel heavy, and have no want to stand up, or go anywhere.  I'm not sure how long the ascension takes before the plateau, as I have never ingested this substance before.  is very enjoyable, I will say, not at all unlike eating 3 or 4 percocets.</p><p>10:30  </p><p>I smoke a joint.</p><p>10:42  </p><p>I totally lose track of my lighter.  Smoking really increases the buzz of both the Kratom and the marijuana.  I find my lighter to my right, next to my leg.  I have not moved from my cross-legged position since I came out.  I would say that the 'level of high'  would be equal to that of smoking a joint with red rock opium in it.  I feel stuck, but 'up' at the same time.  Quite nice, but I was expecting more of a stoning quality.  Black tar opium, the real stuff, is one of my favorite drugs, and sadly it has not come around my area of Southern Indiana for 3 1/2 years, maybe more. *sigh*</p><p>10:50  </p><p>Really getting into my music, euphoric trance at the time. It is now setting in with everything else.  I pack a small bowl with a small chunk of Tibetan three lotus paste on top.  The flavor of this stuff is amazing!  </p><p>11:02 </p><p>I finally get around to lighting the pipe. After about three good hits, I put a small chunk of Wild Dagga resin on top.</p><p>11:08  </p><p>At this point, I am quite stoned, a wonderful warm and fuzzy euphoric tingly feeling. The thunder shakes the whole house, and the lights flicker.  I close my eyes and listen to the storm.</p><p>11:21  </p><p>The high now is like Oxycontin with a lot of pot</p><p>11:25  </p><p>Really itchy off and on, not as bad as, say, snorting 60mg of OC or anything like that.  I feel Great though.</p><p>11:47  </p><p>I start to feel the Kratom start to wear off very slowly.</p><p>12:30  </p><p>Still kinda toasted, I'll start up a game of Civ III.</p><p>1:00?  </p><p>I go to bed, still feeling the afterglow effects.</p><p>Next Day:  I experienced no hangover or negative effects whatsoever.</p>"
}
