{
 "title": "Fearless Freedom",
 "author": "vestyjr",
 "citation": "   vestyjr. \"Fearless Freedom: experience with Damiana (ID 56225)\". Erowid.org. Dec 11, 2007. erowid.org/exp/56225",
 "substance": "Damiana",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "  hits",
   "smoked",
   "Damiana",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56225",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 11, 2007",
   "Views: 21973",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I first got into herb smoking about a month or so ago after realising that 'the herb' was not going to be such a good idea to smoke because of the short term memory loss that occures after prolonged smoking. So since I have exams this year I thought I would try something a little less 'harmful' (?). </p><p>So my two friends and I went into Nørrebro and walked to the herb shop. This vendor is extremely reliable and they sell very good quality, fresh herbs ranging from absinthium to skullcap. Anyway - we bought 40 grams of Damiana and went back to the skatepark where we had been earlier. </p><p>We proceeded to pack a bog-standard tobacco pipe with Damiana. We were all excited to try it and quickly lit it up. I took the first dope and I instantly felt the buzz - much like the instant hit you get from 420. The smoke tasted surprisingly good - much better than catnip. I really enjoyed the first toke. I passed it round and we had a nice relaxing smoke. </p><p>A quick discussion ensued and we talked about the effect. I personally felt the feeling was much too potent in order to be a placebo effect (to be honest I wasn't expecting much). I was extremely happy that it worked. After about 2-3 minutes we were all back on our boards. It seemed like we were all fearless now. We were trying tricks that we didn't even dream of. </p><p>I shared this with my friends and they agreed, though one of them still denied any feeling. Even now I feel like the effect was strongest when sitting still of just rolling along. Walking or running took away the effect of the Damiana. </p><p>To describe the effect I would say it was a definite MJ like buzz, fearlessness, lack of trepidation and a general happy feeling.</p><p>Around an hour after inhalation we were on the train and we started to talk about 'space cats' - this is not a topic of conversation that we would usually pursue though at the time we found it extremely amusing. Our laughter was attracting a lot of attention to us and people's comments just seemed to worsen (if you like) the laughing fits that we experienced. This was much like the effect of a small dosage of hash.</p><p>In conclusion, this herb is definitely one to add to the list of recreational herbs. It's something that really should be tried.</p><p>I would make sure to buy from a reliable vendor. Do not buy Damiana from a supermarket or tea shop, as this will not be 100% pure. Stick to the designated herb shops.</p>"
}
