{
 "title": "Leno Encounter and a Golden Bridge",
 "author": "Decriminalizeit",
 "citation": "   Decriminalizeit. \"Leno Encounter and a Golden Bridge: experience with Salvia divinorum (20x extract) (ID 56229)\". Erowid.org. Sep 7, 2009. erowid.org/exp/56229",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "56229",
   "Male",
   " ",
   "Not Given",
   "Sep 7, 2009",
   "Views: 1969",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Previous to this experience, I had tried to achieve a strong trip from salvia a few times, but had never really felt the true power of this drug.</p><p>So it was around 11 pm, and Leno was on, and I packed some salvia into my bong (a friend had suggested this because you can take bigger hits).  I really didnt prepare at all, other than to put and the Allman Brothers song 'Little Martha' on pause on my CD player, and to get my room set up so I wouldnt knock anything over.  </p><p>So anyway, I sparked it up, and took one decent sized hit, which I held for a while, I started to notice a stoned feeling, but I knew it wasnt the feeling I was searching for, so I exhaled and took another hit.  This one was quite large, and left a dense smoke in the chamber of the bong.  I held this hit, and started to get a feeling that I can only describe as the beginnings of the trip. I exhaled, and cleared the chamber.  As I held in the 'clear' hit, the image of Jay Leno on my TV screen suddenly grew, the next thing I knew the image was superimposed all the way across my room (I exhaled the hit and set the bong down) Leno was telling a joke involving refridgerators, and how lazy and fat Americans were.  I started to laugh even though I didnt know what was going on, and soon the whole texture of my room began to change.  Suddenly I had a weird, and difficult to describe feeling that I can only come close to describing as that of my room turning into like an animation, and hallucinating that I was inside of a fridge, and the superimposed Leno was a door that was closing on me.  </p><p>Suddenly I snapped out of that and started to get paniced.  'What the fuck!' I turned off the TV, cuz it was too intense, I started to hear Leno again, and started to forget whether I had even turned off the TV.  I lost track of time at about this point, and I wasnt sure whether that Leno encounter had lasted for 3 seconds, or 3 hours.  I calmed myself down enough to turn off the lights, and turn on 'Little Martha'.  This is when the second part of my trip took place.</p><p>I closed my eyes, sprawled out on my bed, and the music started to form visions in my mind.  I saw some meadows, and things like that, but then I saw something very peculiar, that I still dont fully understand the meaning of.  I saw myself, from two angles at once...from a point on the ceiling, and at the same time from what appeared to be normal vision, only from a point that felt squewed from where my head was on the bed.  Anyway, I saw a beam of light propel from my chest to the ceiling.  This beam soon morphed into what appeared to be a golden cobble stone bridge that was shooting beams of golden light off into all directions from my room.</p><p>As the song progressed so did the complexity of the vision.  Soon two human figures, one male, and one female, appearing to be children (dark outlines, with no specific features) appeared on the golden bridge.  They were giggling and laughing and playing, and soon, they motioned to me to join them.  I felt happy that they had invited me, but I also felt that I was kind of attached to whatever in me they wanted me to leave, and didnt want to go.  After some pressuring from the forms, I saw another boyish figure walk out of my chest (and felt like a part of me had left).  It was again just a dark outline of a boy.  He talked to the other two forms for a few seconds, then they joined hands and started skipping up the bridge, and into the ceiling.</p><p>Im still perplexed as to what exactly this all means...but the 'golden bridge' half of the experience was much more pleasant than the Leno experience, even thought that was pretty fucking tight.</p>"
}
