{
 "title": "Visiting Nirvana",
 "author": "Nikau",
 "citation": "   Nikau. \"Visiting Nirvana: experience with Mushroom & Syrian Rue (ID 56238)\". Erowid.org. Oct 14, 2007. erowid.org/exp/56238",
 "substance": "Mushroom & Syrian Rue",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   " ",
   "20 caps",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 56238",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 14, 2007",
   "Views: 4402",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Combining MAOIs with other psychoactive drugs carries serious medical risks and can result in extremely unpleasant side effects, overheating, nausea, confusion, heart problems, and even death. Please see Erowid's MAOI Vault] </p><p>I'd taken mushrooms several times, and had fun trips, party trips, nothing heavy. Sex on mushrooms and pot was always excellent, and I would go round to one particular friend to trip, get stoned, and have wild kinky sex. This all changed one night when I experimented with Syrian Rue seeds. These potentiate the effects of mushrooms (and some other drugs) by blocking an enzyme that breaks down the alkaloids in the mushroom. I then had about 20 fresh mushies, probably half as much again as I'd taken previously.</p><p>Normally, I feel the effects after 40 minutes or so, but this time disorientation and visual disturbances hit after 10 minutes. It was so strong and sudden, I knew I was in for a rough ride, and had to stop Willy from playing with me, I just wanted quiet. For the first time I was descending into a bad trip. 'Monsters from the Id' tormented me, was I dying? Had I taken poisonous 'shrooms? Would I end up in the emergency room? Doubts and fears crowded in, and I clung to sanity with some difficulty, telling myself that of course I'd be OK, I'd get through the trip and live another day. I felt I was sinking down a dark tunnel of my soul. I don't know how long this went on, I'm guessing probably half an hour.</p><p>Then with no warning, and in about 2 or 3 seconds, the trip changed. The crowding doubts and fears were suddenly swept away by what I can only describe as a sun or blow-torch of the purest love and joy. I felt I'd sunk to the depths of by soul, and reached a well of pure goodness. At the same time I knew, absolutely and with no doubt, that I was in Nirvana, the Buddhist heaven, which was strangely inside me as much as an external place. At the same time as this joy erupted, the room I was in exploded in colour, pulsing across the spectrum and beyond, to colours that don't exist, and while I remember marveling at the colours I'd never suspected could exist, I cannot now recall them. I guess the brain isn't equipped to remember such things! I remember telling Willy that if I died, I would die happy, I'd seen it! I stayed in Nirvana for about four hours, before being gently let down to Earth.</p><p>I can't adequately describe the intensity of my experience, it's like trying to describe the colour red to a blind man. I can only say it changed my life. This happened about four years ago, and I can't look at the world in quite the same way still, there is more beauty in the world than I ever thought. Contemplating a flower is enough to lift my mood. I had a strong feeling that I could never go to the same place again, a vision of Nirvana is at best a once in a lifetime experience. My feeling that this was Nirvana was strengthened by visiting Nepal and seeing Buddhist Thankas (religious paintings). One form, the Mandala, has concentric rings, the outer ones inhabited by demons, but ending in Nirvana in the centre, just how I would paint my experience if I could! I suspect that the monks who originally formalised this form of painting reached the same state of mind as I had, but maybe by meditating for years rather than using psychedelic plants. </p><p>I have had many more mushroom experiences, but since my 'Big Trip', they have changed. They aren't just a 'drug experience' any more, but a deeply spiritual experience. The world becomes coated with true magic, and I can sense the flow of life in things. Standing barefoot on grass, my consciousness spreads out through the soil, roots, fungi, and feel the interconnections of them all. Touching a leaf on a shrub, and my mind dives into it, along branches and into roots. I wondered what an ancient tree would feel like, and recently tried to connect with one, a disappointing experience, as the dead bark seemed to insulate me from the tree. A shame that an weed works better!</p><p>Imagine what it's like touching another person then. If the other person has had mushrooms, I can often sense the 'mushroom light' glowing from inside, and with gentle touch, caress their soul. It sounds crazy (even to me), but it happens. I can drive them wild with pleasure, or 'download' knots of emotion, healing emotional wounds. I haven't lost the plot, the friends I do this with corroborate my experience. </p><p>Last week, I tried some San Pedro cactus, and (for the first time with cactus) the magic coated the world. I was with a friend who hadn't had any, just some cannabis. He looked into my eyes and surfed on my trip, and swore he saw incredible depth and power surging through them and had the most pleasurable experience of his life. I can't discount what he saw as my delusion. So what is happening? I don't know, but it is true magic. I'm looking forward to continuing this journey of discovery, with good friends and much pleasure!</p>"
}
