{
 "title": "De Profundis!",
 "author": "jabba moonkey",
 "citation": "   jabba moonkey. \"De Profundis!: experience with Salvia divinorum (ID 5624)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5624",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5624",
   "Male",
   " ",
   "Not Given",
   "Jan 18, 2002",
   "7857",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThe first time I tried salvia nothing profound happened. A friend and I smoked a few bowls and laughed mostly, actually wildly at times, and did a strange rendition of 'knocking on heavens door'. I meowed like a cat and he barked like a dog, but we do stuff like that anyway so I'm not sure if it was the salvia.  That was mostly it, although I was intrigued and definitely planned on smoking the rest of the half oz I had. And thank god I did...</p><p>My cat woke me up at around 5am one morning. It was dark outside, moonlight coming through my window. My cat was in heat, and was making quite a racket. I couldn't get to sleep so I decided to put on some choral music: Arvo part - de profundis, really beautiful stuff. I figured I'd spark up a bowl of salvia and see what would happen. I kept the lights off and had a bowl or two and held it in as long as I could-very important. Well, it happened. The salvia hit me. It is profound! And there is no shit, no room for shit.</p><p>The choral music helped elevate me into a realization of the divine nature of reality and I felt like I was sitting with god, in god, and everyone was there. Everyone and everything. And my cat was part of it and now was perfectly still and looked at me and I realized that she woke me up for this and I laughed at my being pissed at her previously. I was not disoriented or confused and all I wanted to do was clench my hands together and sit there in such a sacred place. But the place was no different. I recognized everything in my room, and I began talking out loud to it, and I walked around my house. I had no trouble walking, unlike what some people have said. I actually liked it and it did not take away from my high. I was sky rocketed into my reality and I loved it. The painting my mother had given me on the wall. My beautifully disorganized household. The t-shirt I had on. My heart started beating so hard, I thought I might be dying. I don't mean that in a paranoid sort of way. I just thought maybe I was being called back. But then I realized that I wasn't being called back, I was just being called. I had had a pretty strong dialogue with god going on for quite sometime before this experience, but this definitely rates way up there. </p><p>My musician friend and I had planned on working on some tunes that morning and I felt the need to get him over as soon as possible. See, here's the thing: I wasn't fucked up. I was actually very not fucked up. I was very very present and it wasn't acidy or trippy, well trippy but life's a trip, nothing was contorted or anything. I was just really in the moment. It was a good place to be. So I called my friend and it was way to early to be calling anybody. I later learned to just ride it out and sober up some before making any dramatic moves under salvia even if it seems really important at the time. And he doesn't remember any of that call but it was perfect. But tooo early. </p><p>So the high started to recede, but I was still incredibly enthusiastic. I picked up my bowl and took another hit, bam! Right back. This is great, but how? How can I see it then not see it? Very odd, I'm here and everything, everybody is there and then 20 minutes later back to earthly existence. So I figured I could smoke salvia and write down what I saw and be a conduit of godthought. Like in the old days. That's where I was off the mark. You see, you have to learn to work with the sage. My friend showed up and of course he was enthusiastic about my experience and wanted to smoke. So we smoked and I thought we would skyrocket to that same place...Nope. I mean we got real nice and high, but we just jammed. But that's what we do. And that's what I realized. There are certain experiences that happen when they are supposed to happen. </p><p>I have found that salvia is not like anything I have ever experienced. My buddy and I nicknamed it 'carpe diem' 'carpe' for short. We also call the high a 'wave', as it is much like surfing in a way, not that there is much surfing going on here in Maine. But we ride the wave out and we're just there and we don't need to worry about what somebody who maybe we don't care for is doing on the beach at that moment. We just ride.</p><p>Since then I have actually gone further, which is reassuring. But each time there is a difference, an evolution of sorts. I have found I am highly sensitive to the plant, and it works for me, but I do not crave it. It's actually a bit of work. Kind of like, whew I got through that one, it was great, but I think I'll take a break for awhile. The high can be so big and so profound that I have no time or energy for bullshit. And that's not something I think I am not ready quite yet, to experience all the time. So I go up and I go down. And that's enough for the time being. </p><p>We are part of something phenomenal, really amazing, and salvia can help break down some of the fog that clouds our perception. Just the other night I took my first salvia journey to another place. That was nice, it was a beautiful place. A place of mirrors and it's been visited by many people. It's a reflection of everything. </p><p>I share my experience, and a good one for me, but everything affects people differently. If you plan to try salvia, realize that it is a very potent substance and demands respect. I have a feeling one could have a very unpleasant experience under its influence. I have bordered on some pretty dark places. They turned out to be good for me after, but I can imagine someone-especially one who primarily uses drugs recreationally-being caught off guard. It's not a party drug, although I threw a party the other day and somebody told me they took a hit and really enjoyed watching everyone move around and dance and stuff. I don't think he said too much, though. </p><p>I smoked some outside a bar once and when we entered it I ran onto the dance floor and danced like a madman-all by myself. So, I have resorted to doing it in my house, maybe with a close friend or two. All in all I love it. It's probably in my top three, hanging out with mushrooms and pot. Mushrooms are my favorite as far as having a good time, but salvia is the most profound, for me anyway.</p>"
}
