{
 "title": "Another Time and Space",
 "author": "Martin",
 "citation": "   Martin. \"Another Time and Space: experience with Salvia divinorum (ID 5625)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5625",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "130 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5625",
   "Male",
   " ",
   "Not Given",
   "Jan 18, 2002",
   "15016",
   " "
  ]
 ],
 "report": "<p>\nSalvia is an amazing drug. I first researched it well and then ordered online a 5X gram bag of the Hawaiian strain. The first few people who took bong hits, all had a dose of .10 grams. The typical experience was one that included light visuals and appreciation for sound. I took a slightly larger dose of .13 grams. I had read the highest dose to take was .25, so I figured .13 to be a decent hit.</p><p>My experience: I took my first bong rip. I held the smoke in my lungs as long as I could. Immediately upon releasing the smoke I took the second hit to clear the bowl. My body shook and I felt it difficult to hold the bong. I asked my friend to take it from me. Then I am not sure what happened. Maybe I blinked or just moved my head, but I was suddenly in a new place. Now tonight I saw the Simpsons episode where Homer eats the super chili at the chili contest and he trips. Anyway what happens from this point happened just like that to me, kinda. I looked to my left and right and an area that slightly resembled my room seemed to stretch as far as I could see. Which was forever. I then looked in front of me. There were about 5 other people in the room before I hit the bong. But now there were just 5 things. </p><p>I knew I was still in my room or maybe my room so something like my room. But the people in the room were weird. Box shaped bodies, unrecognizable faces, seemed like legos and shapeshifting. Weird huh? Thats what I thought. I was a little scared. I just kept thinking what the hell. I was to scared to say anything. Eventually which to me was a while but might have been immediately I slowly got up. It seemed like everything that used to be a person was staring at me. I slowly moved to the middle of the room. Slowly I had my arms outstretched as so not to fall. I stopped and put my arms to the ground to maintain balance in this strange place. Then I am not all too sure. I did a lot of staring around trying to figure out what was going on. At some point I yelled at everyone/everything in the room, 'you fucking sheep.' I turned on the lights because everyone had these weird shadows on their faces and I wanted them to go away. I also went on about how I didn't live here, but I did, but not in this world. I then moved back to the bed I was sitting on when I entered this new dimension. I said something about closing my eyes, leaving this place and going to my universe. I then fell over and closed my eyes. When I looked up I found myself to be somewhat inbetween worlds. I went to the other bed in my room and closed my eyes again. In my head I could see myself stuck in the wrong world. I just wanted to get away to forget. Then suddenly I realized I was not stuck and I was fine.</p><p>This was amazing. A small dosage changes every significantly. I had read on the Salvia chart of trip strength, that I was probably a level 4. Which is the level the shaman reach. But the shaman cloase their eyes and trip. I sorta  felt that with not closing my eyes I was making a choice as to where to be. It was like the matrix. Like Neo when he wakes up and is in the real world full of computers. I felt the real world was the one I left but rather go to the dream world I visited the underlying reality. Where physical forms were distorted and unreal. Would I try it again? Yes, didnt think so right away but after some thought yes, but with my eyes closed this time.</p>"
}
