{
 "title": "The Magic",
 "author": "DJMaux",
 "citation": "   DJMaux. \"The Magic: experience with GHB & MDMA (Ecstasy) (ID 56268)\". Erowid.org. Jun 25, 2007. erowid.org/exp/56268",
 "substance": "GHB & MDMA (Ecstasy)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "2.5 g",
   "oral",
   "GHB",
   " "
  ]
 ],
 "footer": [
  [
   "2002",
   "ID: 56268",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 5275",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience was 1 1/2 dove pills which dint really do much for me. </p><p>My second ever experience was with 2 tablets, GHB and cannabis.</p><p>I took my first pill and 20 minutes later took about 2.5g GHB. I wasnt expecting much and was playing team fortress which is a game online. I was just playing as I normally do when suddenly I started to really enjoy the game and felt very euphoric. I decided to go into my room and put some music on. After some more time passed I got higher and higher. I then took the other tablet topped up on ghb and smoked a joint.</p><p>I began to feel absolutely amazing. I looked in the mirror and total self love like Ive never felt before. I couldnt believe how good I felt. I mean I didnt just feel good I felt absolute bliss. I mean ecstasy is good and all but with the addition of ghb it was 2-3 times as good as a really good trip and of course the cannabis magnified it even more. I rang up friends at 4 am to rant about how good I was feeling which they werent to happy about but I didnt care I just had to tell someone how good I felt. I spent most of the trip listening to music which blew me away. One song in particular was frozen by Maddona. It was unbelievable. Like I said it takes a really good pill trip and multiply it by a factor of 2 or 3. </p><p>My next encounter with ecstasy was when I bought 30 triangle pills which were so good I went through them in just over a week. Oppss. They were all absolutely amazing. I was listening to chilled euphoria music and I was in tears I felt so good.</p><p>When I took pills afterwards though they got me high but not happy high just stoned a bit like cannabis. They had lost the magic.</p><p>I have taken GHB and Poppy tea and cannabis which I found to be very euphoric.</p>"
}
