{
 "title": "A Most Unusual Experience",
 "author": "Seezee-Three",
 "citation": " Seezee-Three. \"A Most Unusual Experience: experience with PCP & Cannabis (ID 56317)\". Erowid.org. Dec 17, 2008. erowid.org/exp/56317",
 "substance": "PCP & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "PCP",
   "",
   "",
   "0.5 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "56317",
   "Male",
   "",
   "Not Given",
   "Dec 17, 2008",
   "52799",
   " "
  ]
 ],
 "report": "<p>I had only heard rumours of angel dust before. All I knew was that it had the potential to trip my balls off, and also the potential to turn me from Dr. Henry Jekyll into Mr. Edward Hyde. I decided it would be a worthy experience, and my best friend, let's call him Kevin, produced a small, dark green chunk of what looked like a dank little nug of Mary Jane.</p><p>It started small, yet broke up fluffy, and completely filled my bowlhead, a bit over a half gram. Since we were smoking in Kevin's mothers house, we proceeded to smoke as we normally do, hanging out his window to hit the bowl. My experienced started as it normally does for marijuanna. I got a bit of a headbuzz and a bit of relief and euphoria when I exhaled my second hit. I remember pretty much all of the 'smoking' period, however Kevin felt a bit differently. He seems to only have visual memory of actually hitting the bowl out the window. Then, everything went black as we laughed quite hard for what could be seconds, or even minutes. This is when I start to feel strange. When I smoke pot, and something is mildly funny, it turns funnier, and occasionally, I get into a bit of a laughing fit. Nothing like this however.</p><p>I assume we enjoyed our high for a bit, however I was wearing no watch, and time seems a bit skewed. I don't remember much of the early experiences, but since I don't remember feelings of discomfort, which imprint in my memory much better, I assume it was a good time. The next thing I remember is staring at the wall. Well, not at the wall. That particular action comes later, I was almost looking through the wall, as if it served only as a medium for me to experience something else.</p><p>Here is where my hallucinations start. To this day, I am not sure if I actually saw these things in front of me, or if they were in my minds eye, but at the time they were as real as the monitor in front of you now. It's hard to convey exactly what I saw, but if you have ever seen the 'making of' a CGI sequence or popular modeled video game, you are probably familiar with wireframes. As best I can explain a wireframe is, a stick figure, that is much more complicated, displaying a line every place a skin is to crease, forming a transparent model. Now picture a farmer. Now picture a pulsating, neon multi-colored wireframe farmer, complete with fence, field, I think a scarecrow, pitchfork and perhaps a pig. The farmer stood there and waved, as the various lines flashed different psychedelic colors. My head was spinning. I felt like I had been awash in a wet, cold fatigue. At this point, I prepared my bed. However, trying to gather bedding materials in this state left me with only a pillow, thin blanket, and plywood floor.</p><p>Now is where thing get more weird. I was standing under the rails of a roller coaster. As the coaster full of riders. I hear screaming, maybe laughing and some other horrible noises. If I closed my eyes, and pressed my nose against the pillow at a 45 degree angle, I experienced an auditory hallucination that sounded like a roller coaster was racing in and out of my head at intervals of but a few seconds, full on Doppler effect, with sounds increase in pitch as they approach the observer, and lower in pitch as they leave. As well as the pitch changing, the sounds got louder, and then fade.</p><p>At this point Kevin has told me he is hearing voices telling him he is near death, and then a viscious 'Boom! You're dead!'. He then instructs me to close the window we had left open, which is making the room very cold. I reply with 'I don't want to go in there. It's cold in there. I want to stay out here.' I think I was talking about not wanting to leave my cuccoon of a blanket, but I got confused and couldn't construct my sentance as I wanted to. Or maybe I was just downright fucked up. Somehow the window got closed (I vaguely remember Kevin's mother's 'friend' Jim entering the room, noticing us in our altered state and probably closing the window) By this point I was exhausted and I believe I went to sleep.</p><p>Or Did I?</p><p>The next thing I remember is the next morning, not waking up, not wondering what the hell happened, but simply staring at the wall, this time actually at the wall, and the knots in the wood panels resembled a deer of sorts. Had I slept? What did I do in the time between the open window and my blank, mouth wide, head cocked stare at the room that seemed my prison the night before?</p><p>Long story short, I am alive today, I don't plan on trying PCP again, and to this day, we still see the drugged-out deer in the wall. It's amazing the things you can find when you are fucked out of your skull.</p>"
}
