{
 "title": "I Smoked the Legal Smoke, and Lost",
 "author": "21 and Tired",
 "citation": "   21 and Tired. \"I Smoked the Legal Smoke, and Lost: experience with Tobacco & Cannabis (ID 56322)\". Erowid.org. Apr 23, 2007. erowid.org/exp/56322",
 "substance": "Tobacco & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   "(daily)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 56322",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2007",
   "Views: 36944",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAh, the good ol' days.  When my lungs were treated to the kindest smoke money could buy.  Too bad prohibition makes it an economic burden.  I'm talking about our good friend cannabis. Seems a strange place to start, but I feel its important.  I smoked the magic hemp on and off since I was 16.  At the age of 20 I was smoking about an 1/8th every 2-4 weeks.  Learned a lot about myself.  Wouldn't trade any of the experiences, good or bad, for anything.  Don't regret a thing...\r\nWell...I do regret one thing.  That I ever stopped.\r\nThat's right.  I regret the day I decided to stop smoking cannabis.  It wasn't doing anything bad outside the realm of my pocketbook.  In fact, it did a lot of good.  I was diagnosed with post traumatic stress disorder at the age of 4, and up to the point I started smoking herb, every waking moment was an irrational panic attack.  But I stopped the self medicating because I wanted to save up money quick to embark on an expensive endeavor that turned out to be a big mistake.\r\nI went and studied oil painting in europe for 1 1/2 monthes.  It was supposed to be 3, but like I said, I realized it was a mistake and went back home, more broke and stressed out then ever.  I had a hard time getting a job when I got back, so that meant no cannabis.  I remember the day, itching for something to smoke after monthes of fruitless job hunting, I caved and bought cigarrettes.  When I was toking cannabis I didn't take any other substances other than the occasional mushroom voayage.  I didn't drink alcohol, coffee, smoke tobacco, nothing other than that sweet sweet herb.\r\nIn the beginning tobacco seemed great.  First time I smoked it I couldn't get up, colors exploded in my face, and I started giggling.  It started to become habitual and now, after only 6 monthes I smoke up to 6-12 cigs a day.  These past 6 monthes with tobacco have brought an unforseen 'gift'.  My chest hurts.  Bad.  Especially right after a cigarette.  On the left side no less.  I'm beginning to fear for my heart, yet I keep smoking, even though the 'magic' is gone.\r\nThe stress piles up, and so do the cigarrette butts around my feet.  Its very expensive, easily costs me $15-20 a week, not to mention the exponential damage on my heart.  Its no cheaper than bud, doesn't taste as good, doesn't relieve stress as good, and is HORRIBLY addictive.  I can, and have many times have said no to bud, I can't say no to a cigarette.\r\nI want so bad to go back to the embrace of mother hemp, but my old supplier is gone, all my old friends have moved on, and I went back to college after a year hiatus.  I know no one there since I just transferred back and am such a mental wreck from the past year of my life that I'm keeping a lot of distance from people.  When I'm not at school or work I'm sitting alone at home smoking, trying to find some motivation to pursue my true passion and talent: oil painting.\r\nBefore, I was smoking herb, painting all the time, was doing good in school, my bank account always had a nice cushion, and feeling good about life in general.  Today, I drove an hour to work, ran out of gas because the paycheck I deposited yesterday all went towards the huge debt I owe my bank for the financial crisis I created by funding that trip to hell, and ended up sitting in the parking lot of the bank for hours unable to turn my car on just smoking smoking smoking until I got a hold of someone to drive all the way out where I was to give me $20 to get home.  I don't know how I'm going to go to school until my next paycheck.  But I'm sure I'll find enough change in my couch cushions for a pack.\r\nI went home and smoked and smoked and smoked.\r\nI am so tired.\r\nAnd this isn't helping.\r\nAt all.\r\nStay clear of this one people.  I'm really fearing for my health at this point, my left arm goes numb sometimes.  Its literally killing me.  And I'm at a point where I just don't care anymore.\r\nWhy is the hand of death that chokes my heart legal?  Why is the sweet spicy breath of of peace I once partook in illegal?  I will never understand this.  I am beginning to accept the fact that my life will be a testament to the hypocrisy that resides in this.  I will be seriously crippled at a young age by a socially acceptable legal drug that carries such a huge risk, in a vain attempt to find a subsitiute for a demonized illegal one that did no harm to me whatsoever other after years of use other than calm my nerves and give me a slight cold when I stopped smoking it.\r\nI am fairly certain that my heart problems have nothing to do with past cannabis use.  There was a year inbetween whenIi stopped smoking cannabis and started smoking tobacco.  In that year between I felt physically fine, a bit stressed out though a lot less than before I started smoking herb.  The stress didn't get to me until after returning from europe and watching all the money I saved for so long get gobbled up for what turned out to be such a worthless cause.  That's what drove me to this evil golden leaf.  Within a month of smoking tobacco my chest began to grow heavy and here I am now trying to ignore the stabbing pain in my chest.\r\nBah, I'm tired of ranting about my life with tobacco.  I'm going to go have a smoke and hope my heart doesn't explode quite yet.\n\n\n"
}
