{
 "title": "Enjoyable Experience",
 "author": "Reverie",
 "citation": "   Reverie. \"Enjoyable Experience: experience with 4-HO-MiPT (ID 56328)\". Erowid.org. Jan 23, 2007. erowid.org/exp/56328",
 "substance": "4-HO-MiPT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "4-HO-MiPT",
   "(powder / crystals)",
   "  T+ 2:45",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56328",
   "Male",
   " ",
   "Not Given",
   "Jan 23, 2007",
   "Views: 10418",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Me and a friend aquired a total of 30MG of this chemical 4-HO-MiPT. Not much detail into what this chemical would do is online, only the TiHKAL reference. So we were kinda goin in blind. I eye-balled the powder in half, making it roughly 15MG each, then put them into capsules. We both had a full stomach, and a relaxed enviroment. My friend has about the same things to say about his experience, but this is how it went for me. I wrote a bunch in a journal, but after about 2 hours in, not much of It makes any sense but the times. Fortunately I remember the whole night.</p><p>8:30PM - Initial dose</p><p>9:00PM -  Notice a slight light-ness, deffinately something happening.</p><p>9:30PM - Growing stronger at this point, very relaxed, euphoric at the least. Colors seem brighter, vision is off a little bit but no  headache or dizzyness of the sort. </p><p>10:00PM - Start playing guitar, which is  a great idea because for some reason it sounds really cool. My hand slightly cramped but I can still play. The music def sounds different, very very relaxed feelings throughout. I can still completely notice whats going on around me, but reality just seems different. It feels really great.</p><p>10:30PM - We put on some trippy music at this point. Everything is relaxed and going great. Music is so nice, colors vibrant. I'm also excited at this point that nothing is going wrong and its accually working. </p><p>10:45PM - We decide to go outside. Me, my other friend who is tripping, and my friend who was totally normal(to make sure eveytrhing went ok) start to walk. Trees and the ground are really crazy looking. Nothing out of the ordinary, but everything is more defined. Colors and sounds are still much more prominent. Still very happy and relaxed. I had a pretty stressful week, and no thoughts of sadness/depression could even break the way I was feeling at this point, which was very satisfying. </p><p>11:15PM - We then smoke 2 bowls of cannabis. THis is where it gets nuts. Everything changes, for the better. The effects are so greatly enhanced that I don't even know whats goin on. I see so many colors. I never expected it to go this far. </p><p>11:30 - We are still walking around. The cold temperature doesnt even phase us, its like it doesnt matter. There was no axiety or anything, everything was relaxed. I kept coming in and out of this trippy world, where it seemed like a different reality. We then started talking about weird things like the galaxy and life and crazy things that you would strangly talk about when your on some sort of psychedelic substance.</p><p>12:00 - Back at the house, we are just relaxing, listening to music and letting this state of mind take over.  Dark Side of the Moon was too much for me because of this thumping beat in the back that made me feel like it was my heart. But other than that everything was nice and easy. </p><p>1:00 - By this time I felt like I was just high from the cannabis,  but still realised what the past 2 hours were like. It seemed like much longer, but I didnt think much of it.</p><p>1:15 - Friend picked us up to go drive around, get something to eat. Just an enhanced smoking high now. </p><p>1:45 - Basically on the comedown, trying to fall asleep which wasnt to hard. </p><p>2:15 - I think this is when we fell asleep.</p><p>To conclude, I had a very fun night. Nothing went wrong, everything was great. I have never done shrooms or anything like that, so I'm not gonna say this was like that in any way, but it was very crazy. The next day I feel great. I had no problem sleeping and have 0 burnout effect. I had a great experience.</p>"
}
