{
 "title": "Meds That Actually Work",
 "author": "Lazlow",
 "citation": "   Lazlow. \"Meds That Actually Work: experience with Bupropion (Wellbutrin) & Various (ID 56343)\". Erowid.org. Jan 1, 2011. erowid.org/exp/56343",
 "substance": "Bupropion (Wellbutrin) & Various",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Bupropion",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "56343",
   "Male",
   " ",
   "Not Given",
   "Jan 1, 2011",
   "Views: 10276",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nA few months ago I had a bad episode at school. I dropped out of college. I was using cocaine frequently and occasionally heroin to self medicate. After a month of being out of school I decided to move to Idaho, where I became more paranoid and claustrophobic. A month and a half later I returned to my home. My parents told me that a good friend of mine had passed away while I was in Idaho. Then I learned that my dog had only two months to live. I started using coke again and generally feeling like crap.</p><p>My doctor had long ago diagnosed me as obsessive compulsive and manically depressed with mild symptoms of schizophrenia, conditions which run on both sides of my family. I went to see the doctor again and decided to start taking prescription meds again. I strongly disliked everything I had been prescribed before because of the side effects. This time I told the doc that I was using coke and why I liked it and she told me about Wellbutrin. She said it stimulates the same parts of the brain as coke but lasts longer and does almost no harm to your body. I thought it was too good to be true.</p><p>The first pill I took as soon as I swallowed it I felt an increase in energy. I wasnt just slightly more energetic, I was amped! The initial rush lasted about as long as coke would last. I got the same feeling every time I took it for a week, and what a week it was! That week was one of the most intense weeks of my life. I felt true joy, genuine happiness, and discovered insights I never realized I had before. A single dose, when I actually FEEL IT and FEEL GOOD is comparable to a bump of cocaine, a tiny amount of mushrooms and smoking a cigarette all rolled into one. It has an initial rush and then it remains at the same level of satisfaction for hours on end. </p><p>That was five weeks ago, but for the past month the thrill has worn off, Im sure it was my tolerance going up. The magic seemed to dissipate and for a long while I was terrified that it was all in my head. I thought it was just a placebo effect which played on my brain to enhance the drug. I felt those old feelings creeping up on me again. During this time I became very hostile and aggressive, having strange mood swings and rage. At one point I almost got in a fight with my step dad. My stress was coming on strong again. I even started frequently using coke and heroin and smoking cigarettes again.</p><p>Tonight seems to be the return of the good feelings again. I simply took two pills this time instead of one. It feels even better than the first time I took the pill. The initial rush lasted three times as long.</p><p>Let me just explain a little more about the exquisite beauty of bupropion. I feel a rush of thoughts under the immediate effects, they are still obsessive compulsive/intrusive thoughts that feel unlike my own, but they are mostly positive and they engulf the mind coming in at a machine-gunfire rate from all directions. Bupropion is like pot in a funny way, I only remember those special little things about it when I am actually using it then I forget them when Im not. For the first week of me using the Wellbutrin I had visions of grandeur, thoughts which provoked me to take up some great cause and change the world. I spoke with a fierce intensity, thoughts showered down like rain, so fast and organized that I could dish out quips, jokes and complex thoughts faster than I could recognize that I had formulated them. I had more vigor than I ever have before in my life. I was able to physically move more quickly, assert myself, and even exercise for a whole day. I am known as the laziest person. I have never exercised before in my entire life. Chores werent boring anymore.</p><p>My life before seemed like a long drunken stupor full of fatigue and self loathing. Nothing was good in the world, but now, everything is beautiful again. Every single aspect in the spectrum of the human condition is enhanced to my liking. I no longer lack empathy. I even try to meditate, write, do all different kinds of artwork and think in a manner which tries to help the rest of the world. Shamanism seems like an intriguing concept now, after I regarded it as a novelty for so long. </p><p>On a final note I just want to point out that even though bupropion is used to treat cocaine and nicotine addiction it absolutely does not stop me from wanting those substances or even enjoying them. In fact I still strive to use those drugs as well as others when the time is right. The other night I took a couple Wellbutrin and shot a little heroin and didnt pass out. Instead I spent the whole night thinking about how to make the world a better place for everyone, and I felt like the coolest person in the universe at that moment. Wow.</p><p>I hope this helps somebody out there. Thanks for reading!</p>"
}
