{
 "title": "Unfolding into a Disturbing World",
 "author": "Oldenuftonobetter",
 "citation": "   Oldenuftonobetter. \"Unfolding into a Disturbing World: experience with Salvia divinorum (10x extract) (ID 56354)\". Erowid.org. Jul 7, 2007. erowid.org/exp/56354",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56354",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jul 7, 2007",
   "Views: 2711",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My niece wants to try Salvia, so being the older experienced aunt. I told her I'd get some and we could try it together. So I bought some 5x and 10x extract. When I got it, I thought it would be a good idea to try it without her first so I would have an idea what would happen and be better prepared. My husband said he'd be my sitter so o.k, all set. Since I'm such a experienced drug using, I figure eh what the hell I'll try the 10x. I really thought nothing would happen, big mistake.</p><p>I fill up my bong bowl almost to the top, it is an oversize glass bowl. My husband gets up to use the can and while he's in there I let er rip. Easily take the whole hit and set the bong down. Oh yeah I should mention that I did it during the day and wanting to enhance the experience I had earplugs in and a sleep mask on. I pull the sleep mask down and lay back in the recliner. The last rational thought I had was 'O.K. it said it takes about a minute for the effects. That's when I realized I was in a room like my living room even though I could not see because of the mask. At the center of the room a vortex starts to form. I can't move away from the vortex and it is coming towards me fast. I start to say something like 'What is going on here' but my words are slurred because my mouth has started to stretch and fall into the vortex. My body soon follows. It feels like my body which used to be 3D and whole has become like a leaf that was tightly folded coming unfolded. Now I'm starting to panic as I hear voices around me saying things like:</p><p>She hasn't realized it's over.</p><p>Your time has passed.</p><p>She'll understand in time.</p><p>This is the way it is.</p><p>Now, I'm saying NO NO NO NO this can't be happening, this isn't the way life is. Now I'm like part of a wall. A wave came by and unfolded me and now I'm just part of a wall all flat and 2 dimensional. I can see that wave continuing through other bodies. The voices tell me again that my time is over that others get to drive now. That this is what life really is, I was just living my own fantasy when I had control. I'm arguing with them asking them how can that be, what about science and medicine, the way my body used to look, roads, cars, that has to be real. They say no, this is the way it is now and it will always be this way.</p><p>I'm really starting to panic as I start to realize I can never go back to the way it was, that part is over and this is all that's left. But wait I am trying to refold myself desperately now and somewhere far away I hear a voice saying 'Leave her alone, don't touch her'. But I am starting to refold back into my 3D person. I'm almost afraid to believe it's true at first. After hearing them say Don't Touch her I'm thinking Oh my God, someone is here and can see me all flat and stuck to this wall. I realize it is my husband and for some reason, I think there are other people with him like parametics and I'm thinking, holy shit I had a bad trip and he called for an ambulance.</p><p>Then I feel someone pushing my shoulder back. It's kind of irritating at first, but then I push the mask off my eyes and I can see my husband. He's holding my shoulders back against the recliner and I reach out and put my hands on his chest and say over and over. It's o.k, I'm alright. Then I start feeling my legs and arms to see that they are indeed 3D. I see some unfolding around the corners of my vision and I get scared, thinking I'm going to get sucked back into the world I was in and I DON'T WANT TO GO BACK THERE! I continue to hold onto my husband until the effects pass.</p><p>What my husband saw...</p><p>He comes out of the bathroom after hearing me toke the bowl and says that I sat up and started to mumble. Then I just fell over to the left and started moving around. I was hanging over the recliner onto the end table. So he moves the bong and stuff out of the way. He says that I was mumbling words like mump, miff, erfh, sic, then out of the blue I said 'I don't know, maybe you need pliers'. When I finally opened my eyes he said I looked very scared and he was scared to. He doesn't want me to do it again. </p><p>He did say 'Leave her alone, don't touch her' during my trip, but it was to the dogs who had come over to see why mom was acting so weird. And the pushing on my shoulder was him trying to keep me sitting upright, I kept falling over to the left during the trip.</p><p>I don't know if I'm going to tell my niece about this, I'm not ever sure I want her to try it, but I guess if she still wants to I'm going to go first and only take a small hit of the 5x and let her watch what happens before letting her try. Afterwards, I'll let her read this.</p>"
}
