{
 "title": "The Rampage",
 "author": "Comfy Dude",
 "citation": "   Comfy Dude. \"The Rampage: experience with Alzoprolam (Xanax), Alcohol & Cannabis (ID 56365)\". Erowid.org. Oct 15, 2009. erowid.org/exp/56365",
 "substance": "Alzoprolam (Xanax), Alcohol & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 0:30",
   "12 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 0:45",
   "12 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 1:00",
   "1 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 1:15",
   "1 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 1:45",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56365",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 15, 2009",
   "Views: 30172",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About a week ago I purchased some Xanax from a friend of mine.  I had taken the drug before and knew its' effects well.  I use Xanax recreationally and I use it to cope with my anxiety at work (talking to girls, solving problems, etc.) It's a great drug for anxiety because I get this overwhelming feeling of security, if I take the right dose of course.  Well here we go, I'm going to do the best I can to recall all of the events, because it affects my memories :)</p><p>T+ 0.00 mins</p><p>I am resting on my couch and I am thinking of taking some Xanax seeing as I have nothing else to do.  I'm off work today and I have the house to myself.  I imagine activities that I can have fun with while using xanax.  I really like to play video games while on xanax because I feel like I can really focus on what I'm doing and nothing distracts me from the game.  I really do suffer from ADD and anxiety, that's why I cherish xanax, but I will continue my experience.  I take 1 blue xanax with water, no alcohol yet, that comes in later. </p><p>T+ 0.30 mins</p><p>I can feel that xanax starting to sweep over me because I took it on an empty stomach.  The drug is more intense on an empty stomach.  I'm having fun playing Elder Scrolls 4 Oblivion on my PC and I suddenly remember that alcohol intensifies the effects of xanax (and many other drugs) This is when I drink the first beer.</p><p>T+ 0.45 mins</p><p>The 12oz can of beer does wonders because I feel euphoric thoughts erupting like a volcano.  Deep thoughts occur that normally wouldn't surface if I wasn't under the influence of xanax.  I remember thinking that if I were to take just one more blue xanax and crack open another beer I would go even further into these wonderful thoughts.  I kept thinking about how wonderful everything I have is.  I started to appreciate my home,  my family,  my freedom.  It was a glowing experience to say the least.  It was as if any thoughts of self doubt, fear, sadness...did not exist. </p><p>T + 1.00  </p><p>It's been an hour since I took the first blue pill.  I feel so good right now.  I have taken the second blue xanax and I am drinking my second beer.  I am careful with alcohol and xanax, I have had a prior experience to this one when I took 3 peach xanax (half the potency of the blue ones) at a party while already intoxicated by about 7 beers and all I remember from doing that is puking my guts out and the toilet and then my friend L dragging me to a bed to pass out...yeah not fun.  This experience was different though, it was controlled and I knew what I was doing and what my body could handle.  Now I am excited and anticipate the second dose to wave in.  I am still just playing my computer game but little did I know that the second xanax I took would take hold of me and make me do things I would never have done if not under the influence.</p><p>T + 1.15</p><p>I have left the living room and I am now in my bedroom loading plastic bb's into my favorite airsoft gun.  I play airsoft with friends in my neighborhood and it is a hobby of mine.  I change into my BDU's (Battle Dress Uniform) my combat boots and my JT goggles.  I feel like roaming around the neighborhood and shooting plastic ammunition at my neighbors.  Around this time is when I take the third blue xanax.  What is strange is that when I think about it now, I am ashamed of what I did because I could have gotten in a lot of trouble.  I live in the country and when I say neighbors I am describing houses that are a good distance away from mine.  I distinctly remember jogging long distances to set up in a position to fire my airsoft gun at houses.  I would laugh at the 'tink' sound the plastic rounds were making against the neighbors windows and cars.</p><p>All of a sudden I remember this girl I am crazy about who lives down the road and I want to go see her.  It's like 3 in the morning but I'm so fucked up I just don't care.  I run back to my house and I get in my mom's SUV to drive down to her house.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]   I know, I know, extremely bad idea...but hey at the time I felt unstoppable.  I drove to a location close to her house but I didn't actually drive into her driveway, glad as hell I didn't now that I think about it lol.  I start making my way across her yard and I tap on her window but nothing.  She is asleep, she is still in school and she is sleeping because she will have to wake up early for school.  I don't try tapping any harder because it might wake someone who I don't want awakened.  </p><p>T+ 1.30</p><p>I'm driving home now,  I am under the control of the xanax and alcohol because in my mind I can remember feeling angry that I couldnt speak to this girl.  I spot a mailbox and I slow down and look at it for a moment and decide it would be fun to drive my moms huge SUV into their mailbox and knock it over.  Well I actually did it, I punched the gas and ran into the mailbox and knocked it over.  Honestly people, I really did this.  I remember having a good laugh and driving home.  It was when I was getting out of the car that I had realized what I had done.  Xanax is strange, if I take enough it will make me do things I regret, but at the time of action there is no conscience saying 'That's not a good idea.'  The plastic license plate cover was cracked all to shit and there was a small dent in the front of the SUV and I shook my head and though oh man what the fuck did I do that for. </p><p>Maybe that has a connection to why xanax lets me open up to people and it frees me from anxiety.  The alcohol I believe just intensifies that and maybe that is why I so desperately tried to see this girl.  Also the reason I ran over the mailbox, my emotions were amplified.  I have cried while taking Xanax because it unlocks emotions that are bottled up inside of me sometimes.</p><p>T+ 1.45</p><p>I am changing into some more comfortable clothes and I decide to eat some food because I am feeling excessively dizzy from the xanax and alcohol.  I finish eating my meal and I smoke some cannabis and reflect on all the events that happened.  When I smoked the weed my brain's thoughts picked up and started moving faster and I started to worry about the cracked license plate and that small dent in my moms car.  I drift to sleep...the xanax provides me a sleeping aid.  </p><p>The Next Day</p><p>I wake up feeling a little hung over, a little confused, but I immediately remember fucking up my moms vehicle.  I quickly think up a story about hitting a deer, it happens a lot out here :).  When I come home from work there's my mom, we exchange words and talk for a while and then I bring up that I hit a deer on the way home.  She beleived me and even thinks the dent is from a deer's antler.  I feel bad for lying but what was I supposed to say, 'I was drunk and taking xanax and I ran over this guy's mailbox.'  </p><p>This experience was intense to say the least, xanax is more intense than a lot of people think it is.  The blue ones are anyways.  Well I've shared my experience with you and I hope people out there will read this and gain knowledge about xanax from this.</p>"
}
