{
 "title": "Relaxed Insights",
 "author": "OneWorld",
 "citation": "Citation:   OneWorld. \"Relaxed Insights: experience with Morning Glory & Kratom (ID 56374)\". Erowid.org. Oct 20, 2006. erowid.org/exp/56374",
 "substance": "Morning Glory & Kratom",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Kratom",
   "(liquid)",
   " ",
   "250 seeds",
   "oral",
   "Morning Glory",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 56374",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 20, 2006",
   "Views: 7199",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have had much experience with psychedelic substances in the past, but have not taken any for a few years until now. I am also into spiritually and practice Yoga and meditation several times daily.\r\nI am not on any medication currently or for the past four years.\r\n9:30 PM: I drank a small cup of water which I a added about 5 grams of Kratom and stirred.\r\n10:30 PM: The effects have come on, but unlike the first time I tried Kratom, this time I decidedly do not like what I'm feeling. I was clearer and more energetic before and now am beginning to feel cloudy, and down in a way. I guess people who like painkillers might enjoy Kratom but I wasnt liking the experience too much. \r\nSo I decided since I was experimenting I would give morning glory seeds a chance as well. I counted about two hundred and fifty seeds and after blessing them and picking an intention (mine was to gain insight into my life) I ate them raw and drank water to wash them down.\r\n11:00 PM: begin to feel some effects but maybe placebo. Feels like the beginning of a trip like on mushrooms used to be like.\r\n12:00 PM: After overcoming come fears and nauseous feelings I perk up. Now I feel relaxed and loved. Not euphoric by any standards but very good and relaxed and slightly psychedelic. The thing about eating the seeds raw (maybe also with other preparations Im not sure) is that all my sense of taste is warped. I drink water but it tastes salty much like the seeds. I eat a bit of food but again cant taste much. Strange.\r\nAt one point I started playing guitar in my room. I felt that I was playing without effort. The words came naturally too. I made a bunch of heartfelt songs within a few minutes. Ofcourse the next day I had forgotten them ,) my voice sounded so beautiful and I felt in touch with the most creative part of me. Very loving, tender and innocent. Very nice feeling.\r\nThen I headed to bed at some point because I realized my 'trip' wasnt going to be very intense. Once in bed I had no desire to listen to music, but simply to listen to my thoughts. My thoughts were altered. Not the thoughts themselves but rather the quality of them. They were much more eloquent than usual. No effort was needed to figure things out. They flowed in and out of each other with amazing clarity. I gathered one or two basic insights about myself, but realized mainly that there wasnt too much insight I needed to gather about myself and that I was pretty clear on who I was. That was reliving for sure since I was expecting some huge challenge to be overcome or some huge doubt to arise. They never did. \r\nConclusion: I realized the spirit of morning glory seeds is very nice and friendly (to me). They are gentle and alter the quality of thinking just enough while still being comfortable (at this dosage). The seeds have potential for teaching, and yes also for relaxing and enjoying a different experience in my life as long as I am happy, peaceful and loving when I eat them.\n\n\n"
}