{
 "title": "Low Dose at Bedtime",
 "author": "Jarrid",
 "citation": "   Jarrid. \"Low Dose at Bedtime: experience with H.B. Woodrose & Melatonin (ID 56388)\". Erowid.org. Jan 20, 2010. erowid.org/exp/56388",
 "substance": "H.B. Woodrose & Melatonin",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   " ",
   "  repeated",
   "oral",
   "Melatonin",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 56388",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 20, 2010",
   "Views: 6171",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLately, I have been quite curious to try out some new things, preferably in the natural range.  A close friend of mine suggested I try out a few things and Hawaiian Baby Woodrose was one of those recommendations.  Through my history with psychedelic substances, I have tried psilocybin, LSD, Salvia Divinorum, and MDMA (if that counts).  I love them all, but since the quality and quantity is horrible where I live, I have learned to use other resources in order to enlighten myself when I have the time to do it.  <br>I ordered a total of 50 seeds from an online herb/seed store and got them in on a Monday.  That night I told myself it would probably be better to wait until tomorrow since I was so tired.  Tuesday rolls around, and I get off work at around 12:00am.  I'm fairly excited to try it out, but I didn't feel like staying up until 7:00am in the morning tripping my balls off.  I came to a conclusion: eat two seeds before I go to bed and take my melatonin. <br>Well, I ate the two seeds, felt a little rumble in my stomach, and took my daily herbs and vitamins (vitamin C, Ginseng, Spurlina, St. Johns Wart), and then my melatonin.  I always alternate with my melatonin after every night.  I go from 6mg to 9mg to 6mg and so forth.  Before I passed out, I noticed things were getting a little stranger than usual, but nothing really dramatic.  My white room seemed a bit brighter, and the TV was a little louder than normal.  I slept for about seven hours straight without and disturbances.  I woke up and noticed things were a bit more vivid, my mood was positive, and I was ready to get going for work.<br>Work was excellent that day.  I was in fun loving mood, my surroundings were rich in color, and I was wide awake without any stomach troubles whatsoever.  After work I ventured into my room and smoked a bowl of salvia divinorum to calm myself, and went a long playing my videogame for about an hour.  I pondered to myself: if I repeated what I did last night, will it happen again?  I ate three more seeds that night.  My stomach acted up a little more than what it did the previous night, but nothing really serious.  I woke up the next morning in almost the same manner.  Work that day went along the same way it did yesterday.  I enjoyed my time at work and loved being around the people there.<br>For one whole week now I have been taking about 2-4 seeds every night before I've gone to bed, and I have been waking up in a great mood.  I'm not exactly sure whether prolonged use of HBW is dangerous to the internal organs, but I have not noticed any side effects whatsoever.  I have yet to try it while awake, so I'm a bit curious on what will happen if I do that.\n\n\n"
}
