{
 "title": "Not for Everyone",
 "author": "Chair",
 "citation": "   Chair. \"Not for Everyone: experience with Methylone (ID 56446)\". Erowid.org. Jan 31, 2007. erowid.org/exp/56446",
 "substance": "Methylone",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "230 mg",
   "oral",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56446",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 31, 2007",
   "Views: 10479",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On a windy Thursday morning I ingested 230mg of methylone from a reputable supplier.  It had only been in my possession for a week.</p><p>I've plenty of experience with psychedelic drugs, both the usuals and the RC's.  Lately I've been on vacation from drugs, pursuing sober life, trying to manifest the changes I've seen I need to make to be proud of myself.  I meditate and do yoga, and I am very sensitive to changes in my psyche.  15mg of caffeine is too much for me.</p><p>My state of mind going into the experience was not exactly positive.  Life is tough and I'm having trouble transitioning from passive to active life.  Wednesday was my 21st birthday, which I spent alone.  Basically I was too depressed to want to talk to anyone.</p><p>So this morning I got up, did my beach yoga with the rising sun, wrapped the pungent chemical in some paper and ate it.  I was already feeling better than the night before.</p><p>10:47 +230mg methylone</p><p>In ten minutes I took a shower and did some dishes.  Then I packed my backpack with some music, a sketchbook, and some sweet Faber-Castell markers.</p><p>I sat on the beach and tried to meditate as the chemical set in.  I burped a couple times and tasted the chemical.  </p><p>11:30</p><p>Possible first alert.</p><p>12:00</p><p>I try laying down in the sunshine and listening to some music.  It was really very nice, but not any nicer than usual</p><p>12:20</p><p>I wonder if the chemical is going to kick in.  I wrapped it in a receipt, and I wonder if receipt paper is harder for the stomach to digest than tissue or toilet paper.  It seems unlikely.  </p><p>I move to a bench and start to draw the sun shining through clouds.  A priest professor from the university comes over and lights up a cig.  I make some conversation, hoping that this chemical shines with social interaction.  We have an interesting talk about literature, but nothing unusual.</p><p>I finish up my picture and its pretty sweet.</p><p>2:00</p><p>I go to eat in the cafeteria alone, and sit down next to some random chick.  I usually try and do this kind of thing, and we usually talk.  I get her number, nothing too unusual.</p><p>So I never really ended up feeling anything.  My heart rate didn't increase that much, although I was a tiny bit sweatier than usual.  I tried to do some yoga towards the end of the experience and it wasnt any different than usual.  I would describe the experience as similar to eating blotter before it has been saturated with a drug, or like being around drunk people.  I ended up in a good-ish mood, but I wasn't smiling or anything.  Also, all my normal social anxiety was fully present when talking to the chick.</p><p>I don't really have any way to explain my reaction.  I don't have any special allergies or anything, and it was my first time with an 'entactogen'.  For all the psychedelics I've tried, I have avoided MDMA.  I wonder if it has to do with the extent to which I used to trip - other experience reports talk about life-critiquing experiences which made them want to change bad habits or something, whereas that is all I think about, ever.  I'll definitely try it again, as I have a couple grams of the stuff left over and it would be a bad idea to try and share it without having experienced it myself first.</p>"
}
