{
 "title": "General Usage",
 "author": "Psychevolution",
 "citation": "   Psychevolution. \"General Usage: experience with Yerba Mate (ID 56458)\". Erowid.org. Mar 6, 2007. erowid.org/exp/56458",
 "substance": "Yerba Mate",
 "bodyweight": "167 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Yerba Mate",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2003",
   "56458",
   "Male",
   " ",
   "Not Given",
   "Mar 6, 2007",
   "Views: 6882",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Generally, over the past 3 years, in a 2-5 person apartment, school or work related setting I(Age: 25 WHITE MALE) have used Yerba Mate many times.  </p><p>Yerba Mate' is like coffee minus shitting in 35 minutes, plus a feeling of accomplishment. I have never felt the arm pains or dysphoria, coffee infrequently causes me. However, very mild gastrointestinal pain has occurred in the upper dose ranges, usually curable with food, and in my case a reduction in alcoholic intake. Considering it is caffeine and vitamins that's pretty reasonable. I think it may cause a coffee-breath type phenomenon, comparable in intensity, but completely different in smell. </p><p>The taste is equivalent to 1 part smoky, 1 part sour, 1 part exotic herbal tea. I like it best on ice, frapped, with milk and honey, and since it is caffeine feel free to apply Red & Vodka logic. It is also, quite possibly, a more viscous beverage than coffee so thicker/milk related drinks work best. </p><p>I have typically prepared the garden variety, yerba mate in a press pot, I attempted the whole gourd thing at work and it was weird: 2-10 Tablespoons, fill press pot with just BARELY boiling water, let steep for 5 minutes, drink. Or rather drink and drink and drink like the South American discoverers do.</p><p>Its is also very good hot with milk and honey during the Winter. Occasionally, I would get a group of people to do cold, straight shots, also fun. </p><p>Used at party settings, for studying and completing strenuous activity and all worked wonderfully. I was first introduced to Yerba Mate', at age 17, by an older co-worker who had travelled to South America. Thought it was dope.</p><p>I've bought it maybe 8 times, from various internet retailers, in the 1/2 kilo size.</p>"
}
