{
 "title": "Positive Experiences",
 "author": "Average Joe",
 "citation": "   Average Joe. \"Positive Experiences: experience with DXM (ID 5650)\". Erowid.org. Jan 16, 2002. erowid.org/exp/5650",
 "substance": "DXM",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "350 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5650",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 16, 2002",
   "Views: 28793",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'll start by giving a bit of information on myself and my experiences.  I'm a fairly ordinary college guy and I've done my share of drugs, but I'm far from what you might consider an 'experienced' user.  I've tried cocaine, ecstasy, LSD, marijuana, and of course DXM.  The only things I do regularly (meaning on the weekends, at parties, et cetera) are marijuana and alcohol.  DXM is something I'm fairly new to.</p><p>Of all the drug-induced experiences I've ever had, the most positive have come from DXM in low dosages.  I never enjoyed getting drunk to the point where I blacked out or smoking herb to where I could hardly even move.  For me the most positive effects of a drug are not the physical feeling of being 'messed up'.  This is why DXM appeals to me.</p><p>DXM doesn't make me feel 'high', physically.  In fact, it's often difficult to tell if I'm still feeling the effects of DXM.  It produces a slight feeling of dizziness or disorientation.  The real effects of DXM at this dosage are psychological.  I've found it altogether impossible to feel hostility, frustration, anger, or boredom while using DXM.  Aside from this altered state of mind there is little indication that I'm still under the effects of the drug (dialated pupils and slight disorientation/dizziness are all I've noticed).  It's nowhere near as intense in physical feeling (impairment) as even marijuana or alcohol.</p><p>The lack of these feelings doesn't begin to describe the effects of DXM, however.  On DXM life is good, people are understanding, and I have a general feeling that everything is as it should be.  It's similar to ecstasy in that I feel that things in general are really good, but the empathy toward other people is even deeper (I felt a distinct difference between DXM and ecstasy in that my feelings on X were less empathetic and more self-centered).  It has completely changed my relationship with the friends I've done the drug with.  We connected through the use of DXM one night, analyzed ourselves, and came to the realization that we were really not very nice to each other.  Since that time we have been much less critical of each other.  It's truly amazing to me.</p><p>There is also a feeling of understanding toward my environment.  For instance, walking through a forest on a sunny afternoon could be described as pleasant by most.  But on DXM it's something more.  The birds chirping, the sun filtered down through the leaves overhead, the earthy smell, a light breeze; all of these things are much more noticable.  Normally these things cannot truly be appreciated because they are ordinary.  With DXM nothing is simply ordinary.  Everything is 'good' and, well, extraordinary in it's own way.  </p><p>My latest DXM experience was a hike through the forest for 6 hours on a sunny afternoon with a few friends.  There was not a moment of boredom.  At no point do we feel like we were wasting time or that something else might be more entertaining.  Our entire afternoon consisted of wandering around, stopping to sit and listen, and then wandering to another point.  And by the end of the day we all felt very upbeat.  It was as if we had spent that entire afternoon doing something worthwhile and feeling completely content.</p><p>A few things to I've found:</p><p>Don't do DXM with antidepressants.  If you survive it could still be a very unpleasant experience.</p><p>Don't attempt to drive a car on DXM.</p><p>Don't mix DXM with marijuana, alcohol, or other drugs.  Drug interactions and overdoses are something to worry about here.  Marijuana won't hurt you any, but it will produce a completely different effect than DXM by itself.  It's fun, but in my opinion DXM by itself is a better experience.</p><p>DXM impairs my judgement somewhat.  I imagine the higher the dosage the greater this effect.</p>"
}
