{
 "title": "So Far So Good",
 "author": "macarisma",
 "citation": "   macarisma. \"So Far So Good: experience with  Venlafaxine   (ID 56500)\". Erowid.org. Apr 20, 2009. erowid.org/exp/56500",
 "substance": " Venlafaxine  ",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "Pharms - Venlafaxine"
  ]
 ],
 "footer": [
  [
   "2006",
   "56500",
   "Female",
   " ",
   "Not Given",
   "Apr 20, 2009",
   "Views: 4103",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For over 12 years now I have been suffering from depression so severe that it often causes black-outs when things get too much for me to handle. I 'shut down' & have periods of doing things that I don't remember doing at all. More than one of those periods have included dangerous behavior & suicide attempts.</p><p>Recently, I had to out myself to friends & family because of my actions during a black-out which ended up getting me in some shit with the law. For court proceedings my family & I decided that it was in my best interest to get a psychiatric evaluation & a full check-up at the Doc's.</p><p>My psychologist sent me to a local clinic, because like the many in this farce of a democracy, I have no insurance.  I explained everything to the doctor, telling him I have depression, blackouts, anxiety, panic attacks, daily thoughts of suicide, etc.</p><p>Now, hypodermic needles give me severe panic attacks. I am deathly afraid of those things, which is good in part as I can never become a shooter. So, basically he couldn't draw blood from me to test what my chemical imbalances might be.  He thinks I very well may be bi-polar but isn't quite sure.  He told me he was giving me some free samples of Effexor (5 weeks, what a peach!) & to call him if my 'highs' were 'too high', which is an indication of being bi-polar/manic depressive when on an anti-depressant.</p><p>So far, I feel really good. I don't wake up in the morning thinking of fun new ways to kill myself. I don't flip out over tiny things. I'm quite calm, I have energy to get things done, I no longer feel the need to hole up in my room all day with my phone turned off.</p><p>I don't take it at bedtime because it keeps me up. I was warned strongly against quitting cold turkey, even if I have to resort to begging on the streets because I can't afford the next refill to get me off the stuff, I will.</p><p>If it turns out that I am not bi-polar/manic depressive I will keep on with Effexor. I dont mind the whole loss of appetite thing, I'm fat anyways. Heheh. No sexual side effects thus far, but if it becomes a huge problem well...there are ways past that I think. Like a patient & understanding partner maybe? I suggest, for women anyways, getting some sort of stimulating lube like Play in the green bottle. I have had issues coming to orgasm since I started having sex & this little bottle is a godsend.</p><p>Anyways, no complaints from me!</p>"
}
