{
 "title": "First Time with 2c-t-2",
 "author": "Gandolf",
 "citation": "   Gandolf. \"First Time with 2c-t-2: experience with 2C-T-2 (ID 5656)\". Erowid.org. Mar 13, 2001. erowid.org/exp/5656",
 "substance": "2C-T-2",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5656",
   "Male",
   " ",
   "Not Given",
   "Mar 13, 2001",
   "Views: 21219",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSetting: Comfortable suburban house. Two good friends decide to try 2c-t-2 for the first time. The heavier set one (about 250lbs) tries 22mg dosage, the lighter one (me- at 185lbs) tries 8mg. Both doses were oral.</p><p>The doses appear to hit us with an initial flush of mild anxiety and bright colors about 1 hour after ingestion. Over the next hour there was a ramp up to a very nice comfortable empathetic state, enhanced colors and mild tracers. My friend who took the larger doses reported having his visual field flooded with fractal patterns. There was mild nausea at the beginning, with both of us, and a desire to defecate at the 2 hour mark. Normal bowel movements, although I had loose stools at the trail end of the trip, at the 7 hour mark.</p><p>Overall the effects were for me very pleasant, reminding me very much of the somatic trippiness of San Pedro, but less speedy. My friend reported a more confused state, but not overly paranoid or dissociated. Generally we both experienced introspective and empathetic trips, thinking about loved ones and friends. We talked, but also shared long moments of silence. I felt wrapped up in a cozy blanket of my own thoughts and reflections.</p><p>We were more or less down 7 hours after ingestion.</p><p>In comparison, this seemed much less pushy of a substance than 2c-t-7, less euphoric, and less speedy, but more visual. I would venture that 2c-t-2 is more of a tool for introspection and therapy, and less of an 'up' party drug. It reminded me of 2c-b, but a bit more edgy on the visual side, and maybe more introspective. If 2c-t-2 and 2cb had a love child, the offspring would be 2c-t-7, showing characteristics of both it's parents, a little visual on the one hand, a little erotic on the other, but also young, impulsive, unpredictable and full of endless energy. 2c-t-2 seemed like the older more sedate, but no less powerful parent. I would not do this at a party. But I will do it again. It feels to me somehow more useful, or easy to navigate, than 2c-t-7.</p>"
}
