{
 "title": "I Love Smoking Alone",
 "author": "brighteyed steve",
 "citation": "   brighteyed steve. \"I Love Smoking Alone: experience with Cannabis (ID 56613)\". Erowid.org. Oct 12, 2006. erowid.org/exp/56613",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2005",
   "56613",
   "Male",
   " ",
   "Not Given",
   "Oct 12, 2006",
   "8244",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI started smoking about a year ago w/ friends and never really found an absolute comfort zone while smoking with others. I find myself getting paranoid and insecure, worrying about things such as being brainwashed by modern television or being attacked by acquaintances for being gay (which I am not). Usually, if I smoke more than a bowl in a night, I'll have to go home before the night is through (though I do control myself well, & unless I explain, people can't usually tell I'm in a bad way).</p><p>However, when I get home (or if I'm smoking alone), I feel energized and healthy when I smoke. Things make sense. I'm not paranoid or nervous, and often with a little meditation I can achieve very lucid, and dare I say, mystical states. For me, it's a lot more like mushrooms or other higher reputed hallucinogens under the effects of which, people tend to be rewarded greatly in the most nurturing environments but often tormented in anything less than. </p><p>I absolutely love smoking alone. My highs are spiritual and adventurous and rewarding. But few people understand that I don't do well being high on marijuana around others. I seem to 'trip' more than others (not always negative) and I do have a slight tendency to social anxiety, which I'm sure is the problem, and it may be too deep to fish out a resolution in one short high. </p><p>Am I making an unhealthy decision in smoking at all? Should I just smoke alone or where I'm absolutely comfortable? And if so, how do I explain to regular social-smokers that I don't get high the way they do? When I try to tell, people are often put off or they believe there's something wrong with me. And I feel rude not participating. I've been struggling with this for quite some time.</p>"
}
