{
 "title": "Infinite Knowledge",
 "author": "Dustin/ThinkTank",
 "citation": "   Dustin/ThinkTank. \"Infinite Knowledge: experience with Salvia divinorum (ID 56675)\". Erowid.org. Jun 12, 2009. erowid.org/exp/56675",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56675",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 12, 2009",
   "Views: 2544",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a lonely September Saturday night as many had been previously, I had purchased 1 gram of the salvia 3 days prior and had tried it just enough to spark more interest.  I was standing alone in my bedroom with a cheap acrylic pipe I purchased at my local head shop for the sole purpose of this experiment.  I have had plenty, if not too much, experience with other psychedelic,s mainly LSD, psilocybin mushrooms, and MDMA and assumed I was prepared for anything this could throw at me (600 mcgs of LSD can change your expectations of any drug).  I loaded a full bowl into the pipe, turned off the music and television, and stood at my window, this came from advice of a friend that told me the silence can help you orient your thoughts during the duration of the experience (I soon learn how loud my own mind can truly be).  </p><p>After a few deep breaths I sparked the first hit holding it in until my head felt light, second hit I feel like I weigh 300 pounds, third hit my thoughts retreat back into my sub-conscious mind as if I stepped into a waking dream.  My very soul became a very real, very tangible 'object' that I understood and could almost feel, but as this came to my realization I also became aware of the 'soul' of the entirety of the universe and in this moment my own being was dispersed at an atomic or even smaller level and distributed amongst the particles and atoms of the rest of existence, this was not an unpleasant feeling but rather a very pleasing calming feeling because I was no longer a confined being in a small insignificant vessel of flesh and tissue, but rather a force or energy that was the life of the universe, infinitely powerful and endowed with infinite knowledge.  It was as if my conscious mind was distributed to the conscience in every thing in existence (living or not), I could look at everything and know everything from the point of view of everything.  </p><p>For all of eternity my 'omnipotent' soul took in the knowledge of everything, the insight of the reason we are here, why anything is here.  I feel this could be the closest thing that could be compared to the state of Nirvana or infinite enlightenment of the afterlife.  Suddenly I felt a force beyond anything that can be imagined pulling me back to my own mind and knew this was not right, why was I being drawn back after spending, what I knew as all of time, among the life force of the Universe.  I resisted with all my energy but I felt as my life force was being contracted back into this mind so was the knowledge I had gained I felt an unimaginable fear that the life I knew was a punishment for my wrong doings I could not stand the thought that I would soon be forced back into a life of ignorance and pain and physical limitation.  </p><p>As I resisted this I suddenly was overcome by the most powerfully loud yet nurturing voice, the voice of an elderly wise woman that seemed to shout into me calming words that let me know this was how it must be, that it was merely a step into the eternity that awaited me, she kept talking in this voice that overpowered the noise of my own thoughts and fears and anxiety to let myself slip back into this meaningless life.  I can not remember the exact words that she spoke to me because they were not words in the literal sense but almost the conveyance of actual ideas and emotions directly into me, but I understood them as words or rather sounds that produced these ideas and emotions.  As my conscious mind continued to contract into my natural form I again became aware of my former body and ego (which I expected would have been long dead and decayed over the eons that I spent transcended from it) but it was as I remembered it.  </p><p>I could not begin to say how much time I spent in this state, when I came back to I felt very tired mentally, almost the same feeling after the full extent of an acid trip, I had somehow made my way from my window to sitting at the foot of my bed with my right hand over my right eye and a feeling that I was being pushed from all sides of my body from an unseen force.  For several moments after I became aware of my suroundings I could hear the echo of the womans voice, I tried to gather my thoughts enough to make out what it was saying, but again they were just coming through as sounds that I knew meant something but could not relate to a familiar idea or word.  I was drenched in sweat all over and the physical 'push' that I felt was bothering me very badly I then started to remember that this was all drug induced and I had not truly died but as I tried to remember the things that I had learned in this state I only became confused and slightly scared.  </p><p>A few moments later I was fully back to my normal (or as normal as I could be after that) and stood up to try to find my pipe.  I still had the lighter in my hand but to this day I have not been able to locate the pipe, outside the window or otherwise.  I found this to be very unnerving and humbling to my own views, no words or expressions could truly begin to do this experience justice, as is the case I'm sure for many peoples experiences to this degree, my use of quotes throughout just illustrates my lack of a better word.  </p><p>After discovering that I had for some reason removed everything from the top of my entertainment center and stuck it into every pocket that I had, this included T.V. remotes, straws, one end of a video game controller, folded papers, a couple of DVDs into my back pockets (which obviously were broken in the process) and other assorted knick knacks on the shelves that could fit into my pockets with any kind of force, I tried to sleep but I found myself questioning everything I had just experienced with anxious, racing thoughts so I took 100 mg of seroquel to help me into sleep.  </p><p>After about 30 minutes I was very calm and satisfied with what I had learned and simply fell asleep with no problems.  I remember nothing that I had done as far as the real world goes, I woke up the next morning with bruised knuckles and a large red spot covering my forehead and my eye that I had been covering when I came back to was black, yet another testimonial to the importance of a sitter, I am just glad I didn't truly injure myself in my apparently outwardly manic state.</p>"
}
