{
 "title": "Unprepared for E",
 "author": "Johnny Raver",
 "citation": "   Johnny Raver. \"Unprepared for E: experience with Ecstasy (ID 567)\". Erowid.org. Sep 10, 2000. erowid.org/exp/567",
 "substance": "Ecstasy",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "567",
   "Male",
   " ",
   "Not Given",
   "Sep 10, 2000",
   "6848",
   " "
  ]
 ],
 "report": "<p>\nE. Ecstacy.  You hear about it used in reference to clubbing or raving, and the reason behind this is because really, if you are thinking about rolling, or have done so only at your house, you need to roll n' rave. I have been diagnosed with ADHD and am taking cylert (a CNA stimulant) regularly.  I am not really an introverted person, rather I perceive myself as one of those intellectuals, that feels that they are better than everyone.</p><p>I get to the party, it was a Real party at a gay bar called U4IA (pronounced euphoria).  Weekdays it was home to all of Clevelands homosexuals, but on the weekends it housed some sweet parties with kickass headliners.  We get there at 10:00 with my even more hopeless friend I will call Tom.  Tom was an intellectual introvert who was worse off than me.  We were supposed to meet a friend of his from work, that I will just appropriately call 'The God of Rave'. </p><p>We were the first ones at the party.  The dancefloor was non-existent, but there was music.  The 4 to the floor house beat, with a dj throwing down some crazy ghetto house.  I stood there, motionless and disconnected from my setting.  Christ I even played a game of pinball. At 10:30 GOR arrived.  We met up with him and another one of his friends.   GOR was already rolling, I assumed and having noticed we were not, and have never done E, he hooked us up (one of the many times.  GOR could walk into a party with just enough money for admisssion and come walking out of the party with 100 bucks and 5 free pills that he hooked up his friends with.  He would get fronted pills and sell them till he made his way up to getting free pills.)</p><p>I remember he put his arm around me in a friendly gesture and I pulled away and said something like 'What are you some kind of fag?' or something of the like. 20 bucks and about 10 minutes later, he returns with 3 gelcaps.  Feeds them to me Tom and my friend 'KB' and we all just sat around waiting for the pill to kick in.  When telling about this experience to a friend or to someone who hasnt rolled it is hard to describe, I always tell them this story.</p><p>10 Minutes after taking the pill, my head was bobbing.</p><p>10 Minutes after that, my foot was tapping.</p><p>10 Minutes after that, my head foot, and body were moving to the music.</p><p>10 Minutes after that I was on the dance floor.</p><p>The first thing I felt, was a headrush, and strange anxiety.  I was leaning against the bar after 35 mintues poking my hand with my finger just to get the feeling.</p><p>It was about 11:00 at that time, and Tom was still sitting in his chair motionless.  His hand placed on his chin as if deep in intellectual thought.  Me and KB were already starting to bounce around a little bit.  I was feeling good guys... actually I was feeling fucking great.  My head was clear, not like alchohol that everyone can tell you were drunk.  I was just happy.  Kathy Lee happy, which was just incomprehensible to me.  I had never been that happy.</p><p>GOR asked KB and I how we were doing, after he laughed at me for me poking my hand.  He goes down to Tom, puts his hand on his shoulder and asked him the same, but he responded with an 'I'm Ok'.  As GOR starts to walk away Tom remembers something he wanted to say and stands up to tell him.  Now, before I tell you the rest you need to understand how deeply rooted Tom's analytical and introverted life is.  It sucked.  Always over analysing a situation, always the kid who everyone asks why he doesnt say much.  For that one second I had the joy of looking at the kid.  For that one second when all the blood rushed from his head to the other parts of his body.  I watched as he stopped after he stood up, and put his head down low in the light, and just was absorbed in the E rush.  First time roller, stands up, blood rushes to his head and he knows he is rolling.  He was trying to analyse and negotiate with what was coming, and what he was feeling in the previous 40 minutes.  He was trying to rationally understand what the drug was doing to his body, like how an intellectual deals with taking acid.  He actually thought that E was going to be like tripping.  And in that moment, not only did he lose the report on what he was feeling but at that almost magical moment he realised that what he was feeling couldn't be described by words.  It was a spiritual experience that only gave made him laugh in sheer joy.  He stood up with his thoughts and ideas and sat right back down, unable to cope with the feelings of unity and happiness with the music.</p><p>Tom, the socially inept and incompetent became Tom the childish and friendly out for a good time raver. I'm sure there are many other stories about what happens after this.  But I was dancing.  Me.  Dancing.  </p><p>Your average homophobic teenager dancing, hugging and raving with everybody.</p><p>GOR was kind enough to babysit me that night.  He was the guy who made the trips to the bathroom sink to fill up my water bottles.  I highly recommend anyone who has never rolled and raved for the first time to attach themselves to a veteran who knows what they are doing.  A good friend who won't pull some shady shit and try to slip his hand in your pants because your rolling.  Someone who will help out the vibe, and make sure you are not doing something stupid (like drinking alchohol or anything that isn't water).  </p><p>The only other thing I really have to say about my first time raving that really shows how inept I was about parties.  GOR went off to find me a Menthol, and came back with a raver named Deena, who hooked me up with my first back rub and a sea breeze (someone using a vicks inhaler to blow in your mouth, eyes and nose).  After she finished giving me my backrub I turned and asked her if I had to pay her or something, and she just laughed at me and shook her head no.  </p><p>Since then I have rolled many times, but obviously nothing compares to your first time.  I highly recomend anyone rolling (in moderation of course) as it truely has given me a new outlook on life.  For a few hours I was free of anything that bothered me, any problem was shrugged away.  When I was coming down in GOR's apartment, I sat and thought about things that bothered me and nothing could bring me down.  Even if you only do it once I think everyone should roll.  Roll in moderation and roll at a rave.  Meet some phat people and have a kickass time.</p><p>Johnny Raver [Johnny 'Fucking' Raver]</p><p>Representing Cleveland in full effect.</p>"
}
