{
 "title": "2C-T-7: Not What I Expected",
 "author": "E-Head?",
 "citation": "   E-Head?. \"2C-T-7: Not What I Expected: experience with 2C-T-7 & Cannabis (ID 5671)\". Erowid.org. Nov 29, 2001. erowid.org/exp/5671",
 "substance": "2C-T-7 & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 3:00",
   "5.0 mg",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5671",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 29, 2001",
   "Views: 8523",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis is my second time experimenting with this compound.  The first time I attempted a 25mg dose followed by 125mgs MDMA two hours after ingesting the T7.  The T7 never kicked in the first time, which left me extremely unsatisfied.\r\n\nIt should be noted that I obtained this substance from reliable supplier, so it is definitely 100% legitimate.  I weighed the compound out initially in doses of 20 and 25mgs.  The 25mg doses were intended for a friend and myself.  I did have one dose that contained approximately 30mgs of T7.  I say approximately because I was using a balance, not a digital scale.\r\nI also had a very small amount of food to eat about 1.5 hours before I ingested the T7.  I doubt it had any effect on the trip.\r\nT+00:00\tIngest approximately 30mgs orally by pouring the powder on my tongue and swallowing it with water.\r\nT+00:30\tI decide to smoke some weed to curve anticipation a little.  Will report more when the drug starts to take effect.\r\nT+01:00\tFeel something, but cant distinguish the sensation from the weed or the T7.  Some mild hallucinations are occurring, monitor moving around doing some weird things.  Mostly in my peripheral vision, but I cant tell if its the T7 or placebo/weed.  I hope it comes on soonlast time I waited four hours and nothing ever happened (on 25mgs).\r\nT+01:15\tDefinitely getting some visuals on my computer monitor.  The screen is alternating size and shifting from left to right.  As well as some minor pink and green hues.  Very minor visuals, at about the same intensity of 1 hit of acid.\r\nT+03:00\tTrip reminds me of a low dose of acid without the mind trip.  So far I am not feeling any of the empathogenic properties of this substance.  I just feel a bit out of it, nothing great about this experience.  I dont think it is going to become any stronger than this.\r\nDecide another 5mgs insufflated wont hurt.  Jesus this hurts, but not in a conventional insufflated way.  More in the back of my throatburns my head.  Shouldnt be too bad though, its becoming more manageable.  There is a definite sense of coherency present with this substance; I definitely dont feel as though I have ingested a large quantity of acid.\r\nTalking is fine; people cant tell Im on drugs.  It lacks the mental cloudiness of most of psychedelics I have experienced.  Someone in the Bluelight #otherdrugs chat room suggests I stare at a lit light bulb directly for about 20 seconds, and then concentrate on the burnt image.  I do this and as I stare into the light bulb it begins to change to green, then to blue.  Amazing!  I look away and the burn image produces some brilliant colors: reds, purples, blues, and greens.  Finally the burn image diminishes and takes on a spiraling movement of green light almost like those green laser machines at raves.  Needless to say it was beautiful, but I really had to concentrate on the image to induce the visuals.\r\nT+04:15\tDefinitely got an increase in my visuals thanks to the 5mgs insufflated.  I feel fine, no body load.  Visuals are superficial in the way of flowing textures and designs moving a little bit.  If I focus hard on a single point on the wall, there is a definite shift of surface patterns.   Ive experienced this on low dose acid trips (about 2 hits).  Nothing truly phenomenal to set this trip apart from a low dose of acid.  In fact, I prefer the head-trip associated with acid if the visuals are week, theres more to work with, increased sense of humor, etc.\r\nT+09:00\tEffects are almost completely gone.  Nothing about the trip was earth shattering.  Maybe Im expecting too much from this drug, but so far it hasnt lived up to the expectations.  From what I have heard from friends and people on erowid and bluelight, it should have been a lot better.  \r\n\nAll in all I would say the trip left me a little unsatisfied.  I experienced minor hallucinations, and very little deep thought or introspection.  I realize that tolerance is a factor when taking T7, and this may explain why my second trip was not very fulfilling perhaps because I took T7 two days before this trip.  As of now, I think T7 is more eye candy than anything.  I hope next time I can attain a higher-level trip and prove myself wrong; I guess its just a matter of the dosage.  Im pretty confident this drug would be quite fun if I get my dosage right.  Until then all I can do is wait.\n\n\n"
}
