{
 "title": "Salvia Was The School Marm",
 "author": "Zaero",
 "citation": "   Zaero. \"Salvia Was The School Marm: experience with Salvia divinorum (5x extract) (ID 5674)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5674",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5674",
   "Male",
   " ",
   "Not Given",
   "Jan 18, 2002",
   "10080",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently had the good fortune to try Salvia Divinorum, i got my substance from an online company (which i will not name) and it was 5x which according to them is basically the leaves coated with enough extract to make it exactally 5x more potent, the experience that i had with this drug is what i would call, at the very least, life-changing.</p><p>I recieved my prize in the mail and that evening loaded a decent sized bowl in a new glass pipe that i had bought specifically for this purpose, i turned out all of the lights and music and, at the suggestion of a friend on irc, lit a candle and some incense.  (something that you must know about me is that up to this point i was strictly a recreational drug user although i enjoyed the entheogenic qualities of many drugs i did not take them for that purpose), i lit the bowl and carbed as large a hit as i could muster and then cleared it and inhaled as long as i could i held this hit for a while and then hit the bowl again very hard.</p><p>I began to notice a definite tingling in my extremities as well as what just seemed like a mild head buzz, i lit the bowl again but alas it was cashed at this point i set it down and hoped for the effects to begin, i would not be dissapointed.  I saw what was clearly the spiralling visual that i had heard so much about.  The objects in my peripheral vision seemed to take on a blurred form like they were on a downward spiral into some cone of some kind.</p><p>From the very first time i had lit the bowl it has now been about 20-30 seconds, then i heard a voice, not with my ears but in my head, it was a gravelly female voice and was, i was certain, the voice of the plant itself, i could feel that the substance was angry with me, not in the way that someone you wouldn't know would be, but in the way that your mother would scold you for doing something wrong, it was a loving angriness.</p><p>I could easily tell the reason for which she was mad as well, i had taken the substance too lightly.  Mother Salvia was angry with me because i smoked her to have fun and not to explore my inner self, i felt horrible and i remember apologizing to her, out loud even.  I stumbled back to my computer to hop back on irc and tell my waiting friends what the experience was like.  Although i wanted to tell them that it was amazing and it was the most unusual substance i've ever done in my life, all that i managed was 'she's pissed at me'.</p><p>I explained the situation to them, making no sense i'm sure, and opted to not smoke it again until i felt that mother salvia wanted me to, i sat around a little while chatting etc.   As i was feeling kind of down, i decided i would try to go to sleep.  I lay in bed and worked up the courage to take another trip so that i could ask for her forgiveness.  I loaded up another bowl and hit it twice, as hard as i could. Just as before i had only candlelight and incense burning.</p><p>On the thrid hit it was cashed and i layed the pipe down lay back on my bed and closed my eyes, this time it came in waves like the spiral was moved somehow from being centered on my point of perspective to being centered somewhere below my feet or above my head, i was being shocked with waves of pleasure rushing in the same direction through my body over and over again and all of a sudden i was there:  it was a schoolyard (an old-fashioned one ) like in england in the thirtees and we were all wearing the little blue white and red uniforms, there was a boy chasing a dog and other children all around me, i became aware that i too was a child in this place, and that the children around me were fellow psychonauts who were smoking salvia at the same time as i was.</p><p>Salvia was the school marm, i spoke with her about my situation and she informed me that she was not angry with me she was just concerned about my missuse of her as a substance.  She stated that if i angered her again then she would be forced to punish me, but that everyone was given one mistake in this world.  As i began to slowly drift back to the physical realm i thought to myself, as long as i'm not a moron i think i will enjoy this place, since then i only do salvia on certain occasions and everytime it returns me to the schoolyard and i converse with my mother, my teacher, salvia.</p><p>One thing that you must know before taking this drug, it is unlike anything else in the world, it will definately change the way you look at drugs, and from what i understand unless you've taken dmt, there is no way that you can be prepared for how emotional and spiritually moving this drug is, it touches you in a way no other does.  Truly a trip to cherish.</p><p>Wishing you always have a safe and enjoyable trip,</p><p>-Zaero</p>"
}
