{
 "title": "You Will Never Be Able to Describe THIS",
 "author": "Noiseless Infinity",
 "citation": "Citation:   Noiseless Infinity. \"You Will Never Be Able to Describe THIS: experience with Salvia divinorum (ID 5678)\". Erowid.org. Jan 21, 2002. erowid.org/exp/5678",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5678",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 21, 2002",
   "Views: 6709",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nBeginning of Notes just after Smoking Salvia, ONLY 4 bong hits of UNFORTIFIED! This is my 6th time breaking through with this plant, and I swear, it takes less and is more intense every time:\r\n'I just smoke Salvia D. More on this later..\r\nshot in the head, could see shape, etc.. details...'\r\nThe above was around when I was still tripping pretty hard and I had to stop writing.\r\n'Being forced back to spacious darkness engulfing the back of 'me.' Many entities, it seemed at first were competing for my 'head' or ego. or 'being.' My eyes were closed and I have never seen such vivid detail in my imagination before. I could rotate around mountainsides and move my head around looking at EVERY DETAIL.  and I could see the entities with perfect clarity and detail.  Beyond the experience of ANY dream in my entire life.  They were translucent and superimposed three dimensionally (maybe more?) upon my own translucent body... except their heads were *my* head (as if I was simultaneously *many* different creatures at once, all of my bodies waving below me.  \r\nOne was a fishes body swaying as if it were swimming, one was a creature I had never seen before...  Then I realized that these creatures were very much dying and they were smearing through a membrane that contacted with the spacious darkness... the void that I mentioned in the beginning that was in the back of me.  I was in the same membrane.  And then I realized that I was actually going beyond my own mind and into parts of death (or at least in the membrane that surfaces it.) or the cosmos... So I was coexisting with many other beings that were passing through the same membrane, creatures that were actually dying at that moment.  \r\nThis realization rocked my ego, and the visions subsided for a moment and I could concentrate on what I just experienced. I was absolutely, completely EXHILARATED at what I had just experienced and began to think of how I would describe this to my friend. And as I thought about that I felt a pressure increasing on the bridge of my nose.  When the pressure was too much (though not painful) I stopped thinking about how I was going to describe it and realized that my nose had been slid down my face and over my mouth.  Where it was supposed to be was now a square hole in my face.  There was no pain, and I became aware that this was how the salvia entity was entering my mind.  Then I felt salvia taking over as it pressed its way more and more into my mind, expanding the hole in my head.  The hole expanded vertically through the middle of my head, separating my head almost entirely. Then the salvia seemed to get almost entirely 'in' and my perception was dropped from its regular place to a position laying sideways, so now I was looking at the force enter through the hole in my head, which was now sideways in reference to my perception, through the now horizontal hole in my head.  My head looked very foreign.  Then the horizontal slit became a metal bar across my perception, and everything else vanished into a dark almost bluish color. The bar was gripped and shoved downward which had the effect of slamming my consciousness or perception downward (like wearing a football helmet and someone pulling down on the facemask). \r\nThe force seemed to be trying to suffocate my ego or consciousness, and it succeeded.  The bar and blue space wobbled and blurred and darkened as if I were drunk or passing out, then it faded completely to black, the suffocation complete.  I still had basic sense of ego and self, though no memories.  Then the force released pressure on the bar and pulled it back slowly, the dark space turned out to be the dark end of the round thing that was used to apply pressure to my ego.  I saw something look around the side of the blue object curiously at me to see what it had done.  It was my own face! So real and me, yet not me.  It was so detailed, as if I were up close in a mirror looking at my facial hair and blemishes, etc.. Then it (I) laughed at the spectacle and then I again started to surface and laid there astonished and slightly amused and thought about what it meant and how I would describe it to others.  Then the presence returned again and laughed comfortingly and said 'Stop trying you know you will never be able to describe THIS to them.' and I knew it.  \r\nThere is so much more but I am exhausted... it takes a lot of effort to try to describe this and I am not even close. Things that I noted to be amazing were the brilliant colors formed in my imagination and the coherency and reality of everything...  There was so much detail in every object and I could rotate around the things, etc..  I did not know that my mind was capable of sustaining that amount of information (the objects appearance and shape) for that amount of time... as though I had a photographic memory.  OK that's all that I got to say right now, I'm tired now and I just had the need to write this down before I forget.'\n\n\n"
}