{
 "title": "Brink of Death",
 "author": "Alchemist",
 "citation": "   Alchemist. \"Brink of Death: experience with Alprazolam (Xanax) & Alcohol (ID 56784)\". Erowid.org. Jul 7, 2007. erowid.org/exp/56784",
 "substance": "Alprazolam (Xanax) & Alcohol",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 1:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "  T+ 0:00",
   "1.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56784",
   "Male",
   " ",
   "Not Given",
   "Jul 7, 2007",
   "Views: 35422",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The Preparation</p><p>I still have 6 blue Xanax tablets purchased from a friend of mine who has a prescription and a 12 pack of beer in the refrigerator.  Tonight I have planned to get very inebriated.  I like the buzz you get with Xanax and alcohol.  </p><p>I'm an experienced user of Xanax and I am very familiar with its effects and I'm even familiar with it's effects mixed with alcohol.  I get an amplified feeling of well being,  relaxation,  happiness.  One thing I was not prepared for this night was the fact that, if overdone, you can receive undesired effects.</p><p>T+ 0.00 min</p><p>I take a 1 mg blue xanx and take a swig out of the first beer.  I am just watching TV at this point and I continue to drink my beer and flip through the channels.  I know that I am watching TV for now but later on will probably not be interested in TV because I will be in a different state of mind.</p><p>T+ 20.0 min</p><p>I decided to put in a new video game I have purchased and play it.  I enjoy things while on Xanax more I think because it calms me down and allows me to really soak everything in instead of letting my mind wander.  I can definitely feel the first Xanax kicking in now because I have begun consumption on an empty stomach.  </p><p>T+ 45.00 min</p><p>My first beer is gone,  I have had only one beer yet I feel as if I have had 2 or 3 really.  I decide I want to take this even further as it was a long day at work and I have been looking forward to this moment.  I get another beer and another 1 mg pill and I dose again.  This is where things go pretty wierd.</p><p>I'm going to try my best to remember as much as I can but this stuff can really mess with my memory and I can only remember bits and pieces after taking the second blue xanax and finishing my second beer.  What I do remember is this.</p><p>T+ 60.0 min</p><p>I am simply just feeling the vibes of this stuff,  I feel like the xanax and alcohol have taken over and it's all I can feel. I feel overwhelming joy and relaxation.  I feel as if I am in a trance, locked on to the TV which I thought I would lose interest in but damn xanax can put you in a trance.  I decide to get up and walk around.  I fix many different things to eat, a frozen dinner, toast, spaghetti.  I had the munchies from hell but it was only because I hadn't eaten almost all day,  not because I was smoking weed, the only weed I had smoked all day was early in the morning about 16 hours prior to the ingestion of xanax so I don't really think that has any relevance in this report.  Something really scary about this part of the experience is that I took another Xanax but I myself do not remember taking it, I only know I took it because of how many I had the next day.  The very last thing I remember is feeling zombie like and fixing a bowl of honey combs.</p><p>The next morning</p><p>I wake up feeling slightly groggy but I don't feel terrible.  As I walk out of my bedroom my mom asks me how I'm feeling. I tell her I'm just a little hung over because I drank too much last night and this is where is just gets wierd.  My mom says she woke up at 4 a.m. to use the bathroom and she saw me sitting on the couch with a bowl in my lap, cereal and milk all over my clothes, the floor, the couch.  She said my head was slumped forward, drool and milk pouring from my mouth.  She told me she got very scared and shouted my name loudly but got no response.  She said she repeatedly called my name but I made no response as if I were dead.</p><p>She told me that she even tried shaking me and nothing happened so then she just hauled off and smacked the hell out of my face.  She says I woke up, just snapped out of it and asked her why she was so freaked out.  She told me to go to bed angrily.  Let me state right now, I do not remember ANY of this.  I don't remember waking up from the coma I guess you could call it, I don't remember her shouting my name and I don't remember getting up and going off to bed.  That's not cool.</p><p>I want to add that I ate lots of food throughout this because I felt like it would help keep me straight.  Call me paranoid but I think I could have died that night,  gone into a permanent coma and stopped breathing or who knows.  I am glad I am alive and I have full motor functions.  I am completely fine.  I have learned my lesson about mixing alcohol and xanax uncarefully, it is dangerous.</p>"
}
