{
 "title": "Horrible Taste and Minimal Effect",
 "author": "Swirly",
 "citation": "   Swirly. \"Horrible Taste and Minimal Effect: experience with Alcohol - Hard (ID 56799)\". Erowid.org. May 8, 2007. erowid.org/exp/56799",
 "substance": "Alcohol - Hard",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 56799",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "May 8, 2007",
   "Views: 13113",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have always hated the taste of alcohol, so I avoided it until I was desperate.   For PAIN RELIEF !  I had recently been diagnosed with ovarian cysts and was in pain most of the time, beyond the scope of OTC meds and the prescription NSAID I had.  The doctor would not refill my Rx for Vicodin, and I was getting ulcers from the steady diet of Advil and Tylenol, so I was hurting and in need of help.  </p><p>After two months of pain and despair, I was also extremely depressed and starting to break down mentally.  The pain came and went, but would sometimes stay for days and weeks at a time, 24 hours a day.  Unable to acquire any useful opiate painkillers on the net, I decided to give alcohol a try. </p><p>I went to the experts (the older guys at the liquor store), and was informed that alcohol was indeed a potent analgesic.  I also hoped it would improve my mood somewhat and reduce the constant stress.  I went home with a bottle of 80 Proof Skyy Vodka and mixed it with orange juice, as one of the guys had recommended for the 'smooth, lack of taste' I was hoping for. </p><p>Ugh.  The stuff tasted like poison, rubbing alcohol, and just plain SHIT!  It was horrible, but I managed to drink about 4 shots of it, gagging the whole time and washing it down with plenty of OJ.  Within about 10 minutes, I started getting a stomach ache and feeling warm, and my mood improved.   The ache passed, and sure enough, the abdominal pain went away, too!   I felt more relaxed, drowsy, and comfortable.   I also became a little dizzy, felt cold, and went to lie down.   The pain relief only lasted about three hours, though.   </p><p>Afterward I felt the same as before, so I decided to try drinking more over the next week. </p><p>The taste was even worse the next few times, and I had trouble swallowing it.  I tried mixing it with several different juices, to no avail.  Then I read on the net that Vodka only tastes bad because it has 'impurities' in it, and that these could be filtered out with a Brita filter.  So I filtered the rest of the Vodka and it did improve the taste a bit. </p><p>I was able to drink more of it, about 6 shots.  </p><p>It was worth it to get that relaxed feeling and not have to worry about the pain (or taking more OTC pills) for about 4 hours.  But I was pretty dizzy and had to really concentrate to walk straight and keep my balance.  It felt like I was in a cloud, sort of, like there was a thick barrier between me and the world.  I was in a good mood, but I didn't notice any of the other effects that I always hear about with alcohol. (No slurred speech or anything.)  I could still think clearly, and even went to the post office and mailed some stuff, talked to the clerk like normal.  (Though I felt really weird, like my head was floating.)    </p><p>Then I went home and, feeling tired, went to take a nap.  That was the first time I felt the *crash* of alcohol.  I crash hard and fast!  My mood plummeted, and I felt very bad emotionally, and a little nauseated and dazed, and the pain came back full force.   </p><p>I realized then that alcohol is a very dangerous drug, WAY worse than any opiate I've tried, because the sudden fall makes you desperate to feel better again, and fast.  Alcohol doesn't let you down gently like opiates do.   I understand now why it's so addictive, and it is so easy to lose track of how much you've had.  It's amazing to me now that opiates are so strictly controlled while alcohol is so easy to obtain.   It should be the other way around.</p><p>I also learned that (unfortunately) I somehow have a naturally high tolerance for liquor, and that I would have to get something even stronger.   I bought some 150 Proof Rum, as this would mean that I would only have to drink a few shots of it to get the analgesic effects.   </p><p>Rum is absolutely vile.  At 150 Proof, it is like shit on a stick in a bottle and on fire.   I tried holding my nose, drinking it with a straw (pulled to the back of my throat so the stuff wouldn't touch my tongue), and mixing it with everything.  Eventually I was able to throw it back with Coca Cola if I held my nose and then washed it down.   It burned all the way, and I would gag if I caught the smell of it.   I only had to drink </p><p>3 ounces of it to get the effect I needed, but they were *dreadful* ! </p><p>I did this every day for a couple weeks, trying to work into a habit, but it never got easier.  Eventually I couldn't swallow the stuff anymore, and would gag it up even if I held my nose.  </p><p>Thus, my alcohol adventure came to an end.  Back to overdosing on ineffective medications, still no Vicodin.</p>"
}
