{
 "title": "What a Long Self Destructive Trip its Been",
 "author": "Spasmelodic",
 "citation": "   Spasmelodic. \"What a Long Self Destructive Trip its Been: experience with LSD, Cannabis & Anti-Psychotics (ID 56838)\". Erowid.org. Jul 9, 2007. erowid.org/exp/56838",
 "substance": "LSD, Cannabis & Anti-Psychotics",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "LSD",
   " ",
   " ",
   "  repeated",
   " ",
   "Cannabis",
   "(daily)",
   " ",
   "  repeated",
   " ",
   "Pharmaceuticals",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 19912006",
   "ID: 56838",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 9, 2007",
   "Views: 16935",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok so here it is.  Fifteen years of mental psychosis and non-stop tripping summed up in a few paragraphs.  </p><p>When I was sixteen I was bored with smoking pot everyday so I gave in to the mystery.  The entertainment industry was making it look like harmless fun and all my friends were doing it so being an impressionable kid I tried it.  I bought a tiny piece of paper with a blue sperm cell printed on it from some cool kid who sold drugs.  I had seen 'The Doors' recently so I was expecting a cinematic experience of ego deconstruction and deep revelation.</p><p>I was sitting on my friend Steve's couch when I first felt it.  I somehow had managed to isolate myself, as I always do, in the living room while they sat in his room and smoked pot.  The initial effect was a physical euphoria unlike anything I had felt before.  'I like this', I thought to myself.  Steve's dad was coming home soon and he was worried that I would get him busted because I was saying strange things and my eyes were nothing but pupil.  He kicked us out and we wandered through the graveyard where I was convinced I heard people talking to me from inside their coffins and on to my dude Sams house.</p><p>So two hours later I'm on top of my friend Sam's house barefoot singing some re-worded version of the Star Spangled Banner (it was the 4th of july by the way).  The whole night was politically themed.  I was giving speeches to all my friends about how horrible capitalism is and stuff.  A negative experience for all those involved.  I went home because my friends were tired of hearing my uneducated ranting.  I sat down in front of the television and watched fireworks with my parents.  They were flying off the screen and exploding on the walls and ceiling.  My mom asked me what I was staring at, as my dilated eyes were fixed on the ceiling.  'The fireworks' I said.  'Are you ok ?' I decided that being around my parents on acid wasn't a very good idea so I went to my room and listened to music.  It was more like participating than listening, which is one of the things that I've always loved about acid.  One of the few things.  </p><p>A year later I was taking acid every weekend and I was starting to develop some depression.   Another year goes by and I start having paranoid ideas that cops are watching me and everyone around me is judging me.  Year three, I was tripping three times a week at large doses.  I went to a psychiatrist because I was disgusted with the world around me.  I felt somehow omnipotent.  Nothing seemed real and I decided that I would like to kill myself because life wasn't real anyway.  I was admitted into a mental institution because I was always talking about death and couldn't motivate myself to do anything but smoke pot and do acid.  I was diagnosed bipolar and put on Prozac and Depekote.</p><p>Once the antidepressants kicked in my lsd trips became much more intense and unbearable.  I soon was in a constant state of tripping.  I didn't even need the acid to get off anymore.  It started scaring me because I couldn't look at a painting flowers without seeing them wither and thrive simultaneously.  Everyone I looked at had a pulsating skeletal look to them, as if I was seeing past their skin.  Voices had a flanged space - echo effect to them.  Anarchic ideas flooded my mind and dominated my subconsciousness to the point that I was convinced that I was going insane.  My psychiatrist's answer to these problems was always trying me on some new medicine.  I was put on dozens of pills to no avail.  </p><p>By the time I was twenty one I couldn't smoke a joint without triggering a full blown acid trip.  I was a devout pot smoker who smoked at least five times a day, so basically I was always tripping.  The tension was physical and mental.  My muscles were always sore and I had become 50% grey headed.  My entire being seemed to be defined by lsd.  I'm not talking flashbacks, I'm talking always tripping.</p><p>At twenty five I hadn't tripped in years but the effects hadn't subsided.  My doctor finally introduced me to antipsychotics such as Haldol which gave me severe dystonic reactions. He switched me to Mellaril.  The Mellaril stopped the HPD symptoms but it killed my sex drive and made me lose my creativity so he continued to experiment on me with different drugs.  He also diagnosed me with HPD and ADD to complement my bipolar disorder, which meant nothing to me.  I just wanted to stop tripping!  Finally I was put on Carbatrol which curbed the HPD with low side effects and I was able to focus on life again.  I was also given the laundry list of benzodiazepines, which I became hopelessly addicted to.  </p><p>I remember speaking to an old hippy lady in rehab one time about being permadosed.  She said time is the only cure.  'Be patient and don't pick your scabs .'  In other words, dont take acid and stay alive until you come down.  I guess she was right.  I've adapted to the residual effects of half a lifetime of tripping.  A constant trace on moving objects, especially against a dark background), little paisley looking things that crawl in and out of everything I see, paranoya, etc.  I'm actually on no medicine now.  I still smoke cannabis all day every day, but I don't really trip from it anymore.  I'd say it took about five years of total abstinence from lsd for me to finally stop feeling it.  I don't plan to ever do it again.</p><p>I researched lsd before I tried it.  I prepared myself.  I was still dominated and turned out by this drug.  I don't even consider it a drug anymore.  It is a being.  Some sort of extraterrestrial ally/enemy that stands in narcissistic and unforgiving judgement of all who embrace it.  It has become a part of me.  I am no longer the person I was before that little blue sperm cell.  I'd like consider my experience a right of passage.  Although the reality is that it was a needless personal hell that has played a large role in the amputation of my destiny.  I have completely ruined my life by using lsd, I'm certain of it.  I had some bad experiences with datura, liberty caps, amantia, morning glory, ayahuasca, ibogaine, and dozens of synthetics, but lsd has remained the root of my psychosis.  No other known substance on earth can effect me negatively like lsd.  None.  </p><p>My problems with lsd were quite possibly because of my underlying pre existing psychological problems.  The thing I wonder is how much better or worse they would have been had I never done lsd?  Half of my life has been a hideous experience of unrelenting fear and confusion.</p>"
}
