{
 "title": "A Message from the Plant",
 "author": "Visionary",
 "citation": "   Visionary. \"A Message from the Plant: experience with Cacti - T. pachanoi & Meditation (ID 56932)\". Erowid.org. Apr 12, 2007. erowid.org/exp/56932",
 "substance": "Cacti - T. pachanoi & Meditation",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cacti - T. pachanoi",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 56932",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 12, 2007",
   "Views: 11224",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had heard of the plant from friends who had taken it.  I found their experiences varied and rather bizarre  but that was before I tried it myself.\r\nArmando, who was out from Peru, agreed to provide us with dried cactus and guide us through what he called the gates of San Pedro.  We started about 9am one Saturday by ingesting the plant, one handful each, and then once the nausea had passed (or been embraced) we embarked on a blindfolded meditation (the Rainbow light meditation) in which our guide took us through each chakra from root to crown.  At each chakra we visualized the corresponding colour, chanted a mantra, focused on the breath and movement which was unique to that chakra.  The purpose was to facilitate opening and at each stage I could feel the energy swirling up until we reached the crown chakra at which stage my spirit / soul literally exploded out of the top of my head and soared up into space or what I believe was the universe.\r\nSilence, darkness and complete love and compassion surrounded me.  I was not a separate entity but one with everything.  I felt inseparable from the universe as if I was in fact the whole universe and I sensed an increased consciousness, an awareness that was total and unlimited (endless).  \r\nI realised that everything I (me on this earth) had experienced up until this point in my life was not real. Its like being in the matrix (the movie) and then having the plug pulled and suddenly you have a new reality. Its the realisation that life as we know it is in fact a manifestation produced by our consciousness, or the universal consciousness.  \r\nI believe now that we manifest ourselves on this and other planets to learn and grow spiritually.  The earth is one of the fastest planets that we can grow spiritually and this is generally achieved by what we perceive as human suffering.  When we become enlightened, that is, we move out of the victim archetype and into one where we embrace everything and believe that everything happens for a reason, we then are able to manifest on earth whatever we want.  But I digress.\r\nAnyway, here I am in this matrix space and in truth just a little bit freaked out.  So I start looking around in the blackness and start to see faint lights like distant hazy stars floating around (and Im thinking angels?) and then start to wonder if there is a heaven and what it would look like and in that instant I heard a booming voice saying welcome to Nirvana Lounge and looking around see this bright and sunny pool like setting and there sits Armando and one of the other guys in our group who was training to be a shaman like Armando.  I stayed here for a while laughing and talking in the sunshine and then later when I was calmer decided to go back. I start wondering how Im going to get back to my body.\r\nInstantly Im back in space, slowly feeling the tug / urge to return and simultaneously feeling the fear of going back, back to an existence thats not real. I saw my life on earth through a window, me sitting blindfolded on the floor, the group in the room, my life playing out before me but without me. Did I want to go back? Could I stay? But what would happen to me here? I felt I had to return, but how. I started to get a bit panicky and then I heard a voice in my head (Armando) saying breathe and so I did and next thing I felt my body around me. The aches from sitting too long in one position, the sound of my breath and all my senses prickled and felt alive.\r\nIt was a truly awakening experience, one that I will strive to attain without the aid of mescaline (which San Pedro is).  It took some time to process the information I gained from my trip but I am grateful for the knowledge and the experience.\n\n\n"
}
