{
 "title": "A Night on the Monolith Highway",
 "author": "Hamsterman",
 "citation": "   Hamsterman. \"A Night on the Monolith Highway: experience with Salvia divinorum (20x extract) (ID 56948)\". Erowid.org. Jun 12, 2009. erowid.org/exp/56948",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 56948",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 12, 2009",
   "Views: 1907",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuring a recent trip to local smoke shop, I picked up some Salvia Divinorum. This was the 7X extract formula. I got together with some friends and we all smoked it from a small glass pipe and did not really get any effect. So we all played off Salvia as a bunk drug. I returned to the smoke store the next day to tell the man working there that this very expensive herb I purchased did not have any effects and that I was somewhat dissatisfied. He tosses me a little baggie and says, 'Well, then try this. This is 20X, I'm sure you'll feel this.'<br>So I take this small bag of the 20X formula over to a friends house and we all smoke a little out of a glass pipe. This time something happens. Spatial relationships were affected, light open eyed visuals, tracers and patterns that would shimmer and wave. These Feelings lasted for about 5 minutes and then things returned to normal. I was excited about the experience I had. I told my other group of friends and we were all excited to try some more. I returned to the smoke shop where I had first purchased the herb. They said that they were out and that they would not have any for a few more days. I visited another local smoke shop of mine to see if they had any. I asked the clerk and they said they had a 10X and 20X formula. I told them that I would like the 20X formula and they gave me a little pop cap containing a gram of salvia. This was professionally packaged and sold by a company, so I kind of had my doubts about it.<br>I returned home and started talking to my friend online about the salvia I just got, and told him I was going to try some out before I came over. So I packed a very small amount into a glass pipe and the lit it and inhaled deeply. This time was a little different. As I blew out the smoke I was talking to my friend about what was happening to me. All vision became distorted and light became the focal point for everything. I have a ceiling fan in my room and as I looked out of the corner of my eye, a woman emerged from the light. The beams of light became her arms and they wrapped around me making me feel warm. Without speaking she told me that she wanted me to stop typing on the computer and to come with her. I resisted as I was trying to describe to my friend over the internet exactly what was happening to me. After about 5 minutes I returned to normal, and then I packed everything up and went over to my friends house.<br>When I arrived at my friends house, he seemed anxious to try it, but remained skeptical it would live up to what I had told him. We packed a small amount into a water pipe, and he took a deep hit. After taking a large hit out of the water pipe, he set it down and just started to look around in disbelief. He looked at me and said 'This is legal?' and that would be the last time I could communicate with him for about 4 minutes. I noticed that he looked like he was trying to push things away, and kept touching his hands and things around him, maybe just to see if they were real or not. He later explained to me that everything had vines growing around it, and that flowers were appearing on everything. He said he felt as if some one were trying to pull him into the floor, and that he felt he was somewhere he didn't belong. I was the only person in the room with him at the time, and he told me that while he knew I was the only person there, he felt other people in the room. He said that he felt the strong presence of a woman as well as when I had my second experience. He came back to reality after about 6 minutes, and swears he will never do it again.<br>We then went from his house to our friends house were the rest of the group was waiting. We packed up the water pipe and then the rest tried it out. Person B: Takes a large hit from the water pipe, he sits there and I take the pipe from him as I see he is starting to loose touch with reality. He begins to look at his hands and begins to move them around, he then lays down on the couch and just froze in a guarded position. He later came back to reality and told us that he could see everyone around him, but couldn't tell if we were real or not. He couldn't recall much more of his experience.<br>Person C: This person had a couple different experiences through the night. In his first he report that one of the sides of his field of vision started to melt, and that he seemed to merge with the things surrounding him. He said that he was in a forest and that things started to shimmer while they began to melt. He looked down at his hands, and they began to melt and drop down his leg. In his second experience, he claimed that he was floating into space and that his limbs were being torn off and began to float away, then he fell into a field of beautiful grass with metal object surrounding him. He was one of the very few people of the group who enjoyed his experiences.<br>Person D: This person didn't want to talk about their experience until they could write it down for themselves and collect their thoughts. But as I watched, they seemed very anxious and confused.<br>Person E: This person was very apprehensive to try it after seeing what it was doing to other people. He first tried smoking some out of a glass pipe, and liked what he felt at the time. Later on he tried it out of the water pipe, his last words before losing touch with reality is 'I don't like this, how long does it last.' He didn't really speak about his experience and then went into another room to gain his composure.<br>Person F: Didn't speak at length about his experience, but once again, said he had lost touch with reality.<br>Person G: This person also had a couple experiences through the night. His first one he found enjoyable. He said that everyone around him looked as if they were cartoons, but kept touch with reality, as he could see us and somewhat communicate. His second experience he can not recall, but as an observer. I was terrified. He reverted to almost a primal state, clutching this and waving his arms around violently. At some points during his experience, we had to restrain him so he wouldn't hurt himself or some one else.<br>Person H: This person stated that he was becoming one with the couch that he was leaning on, and beyond that he didn't speak at length about his experience.<br>As for myself, I will try and describe what happened to me as best as I can. After the fact I can remember taking a very large hit from the water pipe. and that is about all. I felt as if I was some ancient plant in another world. I could see the 'real' world through what I can only describe as a keyhole. The keyhole seemed to get larger and larger. This was me trying to come back to reality, but I felt the urge to fight it. I felt that if I let the real world take over me, it would be the end. That I was meant to be in the other world. As I started to slip back even more, the woman appeared once again and tried to grab ahold of me, telling me not to go. That the people I saw through the keyhole weren't real and that they wanted to hurt me. I slowly started to come back and even when I could tell what was going around me, I questioned reality for about 10 minutes afterwards. The scariest part of Salvia is that it hits me so fast, and so hard, that I forget that I've taken a drug. Not only did I forget that I was on a drug, but I forgot that I existed.\n\n\n"
}
