{
 "title": "The Bigger Picture Leading to Infinity",
 "author": "Nathan Long Hair",
 "citation": "   Nathan Long Hair. \"The Bigger Picture Leading to Infinity: experience with Nitrous Oxide (ID 57)\". Erowid.org. Oct 9, 2000. erowid.org/exp/57",
 "substance": "Nitrous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 57",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 9, 2000",
   "Views: 12591",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had to use N2O about 100 times before I began to feel what I am going to describe to you.\r\nIt all starts with one balloon full.  That is all I need to feel the infinity effect.  Every time I do it.  It gets stronger.  The effect of the time before it seems like a microscopic dot.  It is nothing.  With each experience, I see the bigger picture.  \r\nYou will step back and see what you thought was the highest you had ever been is really nothing.  And it will work like that for infinity.  You can't begin to imagine what the next 'Bigger Picture' will look like.  It will be a thousand of your thoughts all in one.  The highest you have ever been will fold into just a fraction of your current experience.  It almost scares me.  You travel to a level of hundred for example.  Then it's like that hundred is inside of another hundred hundred the next time you do it.  One universe on top of another.  You can see infinite feelings.  And infinite worlds.  You will only understand what I am saying when you see it.  And when you do, you will get a feeling in your stomach like you have unlocked the answer to the meaning of life.  Like you can see what infinity is.  \r\nBut unfortunately, you will loose your insight on it as soon as the high is gone.  Only when you get high again will it return.  It is a realization.  And you can realize it over and over again.  You can never end it.  And when you think you have.  That one experience will take you a level you could not even imagine before.  All the feelings are the different but they are the same.  The are different because they are different infinities of themselves.  Everything is in everything.  All feelings are forever and infinite.  \n\r\nTry this --> write down what you are thinking while the high is at its peak.  Make a sentence.  When the high is gone, it will look and sound stupid.  Then get high again and read it.  You will know while you are high what it means and you will then understand it.  But at the same time, you will know when you come down.  You won't understand what you know at that moment.  You can even try to add onto the sentence.  Write a book.  A book only someone high on nitrous oxide will understand.  \r\nAnd for anyone, who has had this experience, think about this.  When you see the bigger picture.. the infinity of it all... how do you know... right now as you read this.. and as you live on earth... if it is just another stage of the infinity and you just have not gone down to the next level... and as of now... we can't even grasp what the next level could possible be....\r\nMaybe I will see you in the infinity....\n\n\n"
}
