{
 "title": "Waving Wizard",
 "author": "Tamie",
 "citation": "   Tamie. \"Waving Wizard: experience with Belladonna & Cannabis (ID 57001)\". Erowid.org. Jan 18, 2007. erowid.org/exp/57001",
 "substance": "Belladonna & Cannabis",
 "bodyweight": "54 kg",
 "header": [
  [
   "DOSE:",
   "1 tsp",
   "oral",
   "Belladonna",
   "(flowers)",
   " ",
   "  ",
   "oral",
   "Belladonna",
   "(tea)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57001",
   "Female",
   " ",
   "Not Given",
   "Jan 18, 2007",
   "13454",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my first experience of Belladonna. I am still relatively sane so am typing this as I am tripping. Started tripping last night. Me and a friend of mine found a Belladonna plant and took some home with us for me to try. My friend has done a lot of Datura/Brugmansia while I had never tried anything more than mushrooms and cactus.</p><p>I'm not entirely sure how much we took so I am estimating in saying we both took about 1 teaspoon worth of flowers, then I left to go to a metal gig in town.</p><p>While at the gig I had 2 bottles of Jim Beam and coke and we then went outside to have a pipe of weed.</p><p>Well not long after having the weed too the trip started to come on.  I was at the back of the audience with another 1 of my friends when I started hearing people talking behind me and I would see heaps of people all standing there talking. The only person behind me was my friend and she was too busy headbanging to be talking.  I started to feel very claustraphobic so I went outside to sit in the carpark.  By this time my heart was beating furiously and I wasn't sure if I was going to pass out or throw up.  The trees across the road were swaying then jumped up and down and went all over the place.</p><p>Eventually we decided to head home, the trip seemed to abate a bit while I was walking apart from the odd minor hallucination, but when we got home I opened the front door and a grey and white cat ran out of the house and onto the footpath then vanished.  When I got inside I went to pick up a plate of catfood off the floor(I don't even have a cat).  I went to sleep pretty much as soon as I sat down.</p><p>Still feeling the effects slightly from last night, I decided to have another trip tonight so my friend boiled the leaves and made a tea for me to take.  I took that but didn't feel any effect so we boiled the stalks and I took that too.  That was about 2 hours ago.  We then had some weed.  I'm feeling pretty good now, the effects are nothing too spectacular.  I have had no memory loss or such like.  I am still able to type this, though at times that does prove difficult as I keep seeing things that distract my attention and I find it difficult to tell the keys on the keyboard apart.</p><p>I do not feel dillusional.  I am still able to realise what I am imagining and what is real.  But the hallucinations are really quite fun.  The ornaments and posters move.  I have a wizard on the shelf that waves to me every now and then and a grim reaper moddle on top of the computer that whenever I look away (at the keyboard) he flies around the room.  But when I look at it, it lands back on the computer again.  lol.  I keep hearing noises and seeing things move out of the corner of my eyes.</p><p>All in all it has been a pretty good trip and I have many hours left of it although I am feeling rather sleepy.</p>"
}
