{
 "title": "The Second Trial",
 "author": "Myself",
 "citation": "Citation:   Myself. \"The Second Trial: experience with 4-AcO-DMT (ID 57030)\". Erowid.org. Oct 30, 2006. erowid.org/exp/57030",
 "substance": "4-AcO-DMT",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "4-AcO-DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57030",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 30, 2006",
   "Views: 18843",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a healthy male in the mid-30s and have tried many tryptamines e.g. DMT, 5-MeO-DMT, DET, DPT, 5-MeO-MIPT, DALT, 5-MeO-DALT, 5-MeO-DIPT, DIPT and a few others. \r\nI am luckily married with a lovely, pregnant woman and I have a 7-year-old son. I am one of the few, who really love their labor. It really is my passion, -Id say.\r\nRecently I had the chance to test my first 4-something-tryptamine, 4-AcO-DMT. \r\nMy first trial was with 7.5 mg.  The only thing, I observed was that my mind is quite disturbed, but definitely no empathogenic proprties. Talking was rather difficult, I remember.\r\nMy wife and my child were out, so I tried it at a little higher level:  16 mg, on an empty stomach at the evening 7:25.  My mood was OK, I felt a little tired. I put a comedy CD into my player and tried my humor, which supposedly should be great on this material. I cooked an Asian hot and spicy soup, which is my favorite thing during my come up. The onset is enormous! I forgot the soup, I could not eat any more at  T+0:25. The comedy CD is lousy, -changed CD into one of my favorites. \r\nMy appetite has gone.\r\nT+0:40 min \r\nWowww! The colors! I never had visual changes of that kind with my eyes open. The room tends to transform itself. CEVs comparable to DMT, my thinking is out of order, -nothing! The muscles of my face, esp. that of my cheeks contract that way that my face transforms into a smile. \r\nMoving my hand in front of my eyes leaves long traces. \r\nT+1:20 \r\nThis stuff makes me active like nothing ever tried before. There are so many crazy things that spring into my mind, which I could do now: Walking out jumping around I must take me completely together not to do any really stupid thing. Im tripping too hard for that all. \r\nI decide to take a full bath with a lot of foam. Looking in the mirror, I look like a gnome, my face looks hairy. (although I shaved that morning) Everything looks so magical. The foam! The flickering candle light makes me panic, sitting in my bath. I imagine that everything is on fire and everything will be lost and destroyed. I left the bath and extinguished the threatening candle. At this point my trip completely changed into something very different.\r\nT+1:40 \r\nI get in my bed and think about sexuality. It seems totally meaningless and senseless to me.  (which normally is not at all to me)\r\nI notice that I cannot imagine any emotion at all. This is strange. The visuals are gone now, the colors maintain more intense than usual, but they are not beautiful. \r\nI try to remember my beloved wifey and my child. This all makes no sense. There is no emotional response in my mind. It scares me. \r\nWhats up with me? I change the CDs, but there is nothing joyous, its not bad, too, its simply NOTHING.\r\nI ask myself: Is it the late evening hour and the darkness outside that makes me so, so,  so, feeling nothing? No idea!\r\nI fetch some photo album. I remember everything in the album, every person, I know my usual relation to each person and the emotions that are usually connected to them, rationally, but I cannot feel it. Recognition works well, association works, too. But there is no emotional response. I want to feel anything: Joy, hate, fear, envy, disgust or anything else. I wouldnt even disgust when I eat a dog pile that state, I think.\r\nI must really pay attention that I dont seriously hurt myself just to feel at least pain.\r\nI sit still and try to make sense out of this, I read in TIHKALs Places in the Mind to find a solution, is it The Void? No, I suppose. The colors still glow bright and there is definitely no depression, (-I probably would welcome it actually) -I know how 5-MeO-DMT feels, and this here feels different.\r\nProbably this is the Beth State, he describes. But I think not so. Shulgin writes about it: The only negative that could possibly be associated with the Beth place is the fear of dying od boredom No, Im not bored, It is no Euphoria, no Dysphoria, it is APHORIA.\r\nI try to make sense of all that and consider what can be learned from this place of no feelings. I drew intuitively pattern on the sheet of paper where I write my notes. Also no sense, not good, not bad, nothing.\r\nI consider to do anything outside, throw a stone into a window of anybody and see how it would feel if anybody is very angry about me. The only thing that gives me hope is that everything will end, and it is only the drugs action.\r\nI struggle with all that until T+17:35 and found no solution. So I drank half a bottle of wine, took a Halcion sublingually and decided that this was enough for today. I slept deep and fine.\r\nThe following day I phoned to my wife and was so glad, that Im the old again.\r\nIn retrospection:\r\nThis was definitely my most difficult trip, ever! Though it surely was not my most intense trip.\n\n\n"
}