{
 "title": "A Pleasant High",
 "author": "InfiniteLoop",
 "citation": "Citation:   InfiniteLoop. \"A Pleasant High: experience with Alcohol, Cannabis, Wormwood (extract) & Catnip (ID 57060)\". Erowid.org. May 30, 2009. erowid.org/exp/57060",
 "substance": "Alcohol, Cannabis, Wormwood (extract) & Catnip",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   "  T+ 0:00",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:25",
   "1 bowl",
   "smoked",
   "Wormwood",
   "(extract)",
   "  T+ 0:25",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57060",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 30, 2009",
   "Views: 5446",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI read many stories about wormwood and catnip and got very interested in these herbs and their effects. I've tried wormwood tea (most bitter substance I've ever consumed), and smoking joints with wormwood or catnip alone, but none of them produced effects strong or beneficial enough to be worth it in my book. From the information I had gathered online it seemed that very few people got effects satisfying enough by using the herbs alone - most got weak to mild or no results at all. The main conclusion of most experiences was that the herbs' effects manifest themselves to most people only when smoked in conjunction with weed. So after trying smoking wormwood and catnip in a variety of ways just by themselves the next step was trying them with cannabis.\r\nA friend of mine prepared a non-standard wormwood extract of 7x by putting a large quantity of the herb in acetone for a few days and then evaporating the acetone (now supposedly filled with the active ingredients of the herb) on a smaller quantity of wormwood material. I tried smoking the extract alone rolled in a joint and there were no effects, while trying the same thing my friend (the one who made the extract) got pretty high. He reported closed eye visuals, alterations in his thought process and the occasional giggle. From that we can conclude that some people are just more prone to getting high by wormwood than others.\r\nSome weeks after preparing the extract a couple of friends organized a party which seemed as the perfect place to try the herbs in conjunction with weed. The party started off as a pretty boring event and while waiting for the people to roll the joints with the weed I poured down beer after beer, having nothing better to do. As I hadn't eaten for at least 7 hours I felt the effects of alcohol on my system pretty strongly. Next we smoked the marijuana joints which as expected strengthened the alcohol's effects while adding its own. I started feeling dumb and lightheaded and had a rough time keeping my balance.\r\nNext, my buddy (the one who fixed up the wormwood extract) pulled out a bong and the herbs. I had been high on Jane for about 20-25 minutes as of then I suppose. I smoked a bowl of the wormwood extract and another one with catnip. The high I had gotten from the beer and weed quickly started to change. My thought process which to that point was seriously impaired rapidly started becoming more lucid and fluid. Fascinating thoughts and ideas kept coming to my head in a steady flow.\r\nMy short-term memory which was practically non-existent when high on Jane came back to me stronger than ever. I could remember every word everyone said for hours while the majority of people (who hadn't smoked from the wormwood and catnip) couldn't remember what they were talking a few sentences back. Some guys were talking about something and got carried away to another subject and when they decided to go to the previous they had no idea what they were discussing 5 minutes ago. This is where I amazed them by repeating the last few sentences of their previous conversation down to the last little word, almost like I had it recorded on tape somewhere in my head. I got a few Wow-s because of that and it proved to be quite a party trick when you're around people dumbed down by marijuana. I had a short exchange of text messages with a friend of mine and the messages I composed were very clever and witty. I mean, they always are, as I tend to write witty messages all the time, but this time I didn't give them any thought  they just came out that way with no effort on my side whatsoever. I can conclude that as reported by the other experiences  wormwood boosts creativity. For real.\r\nAs for visuals  they were close to non-existent. I had a strong dollhouse effect  everything seemed clean and as if made of plastic. Fun stuff. The vibrations I feel when closing my eyes when high on cannabis were stronger, as well as the closed eye visuals which in my case always resemble a 8bit video game. As for the munchies  there weren't any.\r\nI think most of the effects I experienced were due to the wormwood. I really have no idea what impact the catnip had on the trip, if any. If I try just cannabis+catnip I'll be sure to report.\n\n\n"
}