{
 "title": "Death Fishing",
 "author": "34th Captain",
 "citation": "Citation:   34th Captain. \"Death Fishing: experience with Inhalants: Duster (ID 5706)\". Erowid.org. Apr 8, 2001. erowid.org/exp/5706",
 "substance": "Inhalants: Duster",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5706",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 8, 2001",
   "Views: 30178",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nMy parents brought home a package of three Dust-off containers a couple of weeks ago. They had purchased them from COSTCO (wholesale store), but I hear you can purchase them at any computer store at a jacked up price. When i first saw them i read the container. 'Inhalant abuse is illegal', 'abuse may result in death or imprisonment'. I wanted to try this product and at the time i could not find any information that proved me wrong. I knew inhalants were bad for you but I loved nitrous and hoped it was similar. \r\nWhen my parents had go to sleep one night and my sister was out of the house, I took the first container out of the package. I took 1 small breath at first and it was sorta like a head rush. I decided to push the button down a litte more the next time and it was really like a MEGA strong rush. I decided to do it one more time for the night. I inhaled 3 large breaths. The next thing i remeber was an extream buzzing noise followed by a closed-eye hallucination (which will prove to be a re-occuring one.) In this Hallucination I can't remember it perfectly even three min after the experience. there are three people two are up top (above water) and I (I think its me) is under water, the first couple of time I dive down its okay. I come back up and the two people tell me to try for longer (longer under water) so i dive down further than even where i panic. I cant get any air. I hear calling. He says 'what's wrong?' (i dunno how i can hear him under water but it is just that way) He says 'remember the signals, whats going on down there' i cant remember what the signals are so i yell and scream. \r\nthe next thing i know i awake staring at my TV screen. I had passed out. I felt relaxed, as if i had been asleep for days. My sister pulled into the drive and i ran to my room with the can in hand. I went to sleep. In the morning my parents had gone out and my sister was still asleep so i inhaled about 3 long breaths again. But i was standing up. I passed out and fell to the floor cutting myself in many places. I had the same hallucination again and when i woke up my sister was banging on the door. I had fallen in front of it. I later found out she was about to phone the police. \r\nI stopped doing it now because of re-occuring hallucinations every time i take more than one breath. I would not recommend this to anyone. Or any inhalent other than Nitrous. But thats my opinion. No matter what you do be careful!\n\n\n"
}