{
 "title": "Blade Runner",
 "author": "Disciple",
 "citation": " Disciple. \"Blade Runner: experience with LSD & Cannabis (ID 5715)\". Erowid.org. Jan 21, 2002. erowid.org/exp/5715",
 "substance": "LSD & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "",
   "4 bowls",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "1990",
   "5715",
   "Male",
   "",
   "Not Given",
   "Jan 21, 2002",
   "10622",
   " "
  ]
 ],
 "report": "<p>\nThis is story about destruction and redemption. I had taken LSD probably a dozen times and smoked my body weight in marijuana before one fateful night. Until then, me and drugs (and I've tried just about every one) had always gotten along fine.</p><p>I was with a cousin: we dropped the acid and swung back to his place to smoke. Trip started out fine. Heavy, heavy, heavy, but beautiful. I kept smoking wanting to push it further. Guess I went further that night then I could handle. Came face to face with my limit, for the first time.</p><p>My cousin was a stranger. I knew him, but didn't know who he was. Looked out the window and saw our world, earth, but in the future. Flying cars, towering neon spires, a night sky that looked like static. Normally I would have loved such intense visuals, but it was too much. I had time traveled, or dimension hopped, and didn't know how to handle it.</p><p>I pulled my eyes away and tried all the things I normally loved to do on LSD: drawing, listening to music, talking, etc. Nothing worked, my hands wouldn't move right, and my mind couldn't focus on any material task. I eventually begged myself to sleep, and did so... in a whirl of colors, voices, sounds, and strange thoughts.</p><p>The memory of losing control that night haunted me. I tried LSD over and over to recapture my initial love for the drug, but it, and pot were no longer my teachers, they just fucked me up too bad. I went from being the person everyone asked to trip with, to not being able to touch it. Humbling. :)</p><p>So I waited years. Grew, got deeper, reflected. Thought about the night and what it meant. Thought about the Grand Scheme. There are many possible explanations of what happened, of why it went sour. I meditated on these.</p><p>I've begun healing myself. Experiences like that leave scars. Spiritual scars. I'm slowly reprogramming my brain. (For me, it has to be slowly.) I'm letting go of my negative associations, and willing back the good ones through meditation and the use of other substances.</p><p>There are many factors that come into play when I take drugs. Many of them are well-known: body weight, where you are, who you are with, what you've eaten, how healthy you are, how well rested, etc. But there is another factor when it comes to psychedelics, and that is spiritual readiness. If you push harder and further into The Beyond (call it what you will) then you are ready to go, these things can happen.</p><p>My advice, as one who has gone to the edge and returned is this: remember psychedelics are sacred. They are a gift. If you are determined to use them, give them the respect and love they deserve. As a wise man once told me, you can't rush the opening of a flower.</p><p>Be well brothers and sisters. We are all in this thing together.</p>"
}
