{
 "title": "High Dosage Insufflated",
 "author": "Jesus H Crust",
 "citation": "   Jesus H Crust. \"High Dosage Insufflated: experience with 2C-B (ID 57285)\". Erowid.org. Jan 15, 2007. erowid.org/exp/57285",
 "substance": "2C-B",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "insufflated",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57285",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2007",
   "Views: 8720",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo 2 days ago I got hold of a few 2C-B capsules that I was told had 45mgs apiece. That night I took one on an empty stomach and smoked a couple joints on the come up. After about an hour and a half I was peaking. The visuals were fairly intense but not intrusive (I had to stare at something for a second or two before it started flowing and geometric patterns appeared swirling. I experienced a color shift in my vision and lights and colors seemed more vivid. Over all it was easy and fun experience. \r\nSo the next night I decide to snort one of the capsules, so I broke it open getting prepared for what I was told was one of the most painful things you can put up your nose [Erowid Note: 45 mgs of 2C-B using insufflation is considered a very high dose, see 2C-B Dose Chart].  Holy shit that stuff burned so bad. I didn't have a watch and I realize now that my time perception was way off but the come up was very quick (peaking in under 20 minutes). Every thing started moving and street turned into a deep raging river of molten asphalt (100 times more intense than the film of plasma I see covering the street on shrooms) The only comparable experience Ive had would be a 600 mic LSD trip I took. My head was clear enough for me to keep from freaking out but I felt an almost overwhelming fear of going insane and not being able to control my actions. \r\nI then became terrified at the idea that I'm a single individual out in this big world alone responsible for my own life. I felt very isolated. I was able to hold a brief rational conversation despite the world swirling out of control around me. It eventually became so overwhelming that I found a place to lay down and try to chill out. After a couple hours I was still tripping but not as hard and it became a more pleasant experience. Next time I think Ill just snort half or a third or the capsule. Its not that it was a bad trip just difficult and over whelming at some points.\n\n\n"
}
