{
 "title": "Able to Start Living Again",
 "author": "KT",
 "citation": "   KT. \"Able to Start Living Again: experience with Buprenorphine (Subutex) & Buprenorphine with Naloxone (Suboxone) (ID 57318)\". Erowid.org. Oct 10, 2010. erowid.org/exp/57318",
 "substance": "Buprenorphine (Subutex) & Buprenorphine with Naloxone (Suboxone)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Buprenorphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57318",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 10, 2010",
   "Views: 12761",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Two weeks ago I finally decided to get some help for my addiction to hydrocodone.   It took about 6 hours and dozens of phone calls but I finally found a doctor who specialized in addiction medicine.  He suggested that I get on Suboxone and said that if I wanted, I could take it for the rest of my life.  I scheduled my next appointment two weeks out so that I could binge one last time on my precious hdyro.</p><p>On the day of my appointment, which happened earlier today, the doctor asked me when was the last time I took hydro and I told him 24 hours even though it had only been 12.  I don't know why I lied...I think because I was afraid he wouldn't give me the suboxone.  Anyway, I wasn't quite feeling withdrawls yet so when he gave me the first pill, a 2 mg of subutex, which is suboxone without the opiate blocker, I didn't feel any differently.  After a half hour, he gave me another pill which was suboxone.  He wrote me a script for 15 8mg pills.</p><p>After filling the script, I took another pill, letting it dissolve under my tongue and went to work.  As far as the effects, I was able to work and was not irritated or unfocused (this is how I feel when I'm at work and going through withdrawls).  In fact, I was a bit speedy and got a lot done.  At one point, I was looking for some documents on my desk, and I kind of zoned out.  I glanced up at my co-worker and he was giving me a strange look.  Besides that one incident, I actually felt fine and even stayed late to catch up on work.  Oh and on a final positive note, I was able to go poo which is something that is nearly impossible on hydro.</p><p>So I just got home and I started to get cravings again.  Not withdrawls, just cravings.  So I popped two more pills (which is almost double the dosage that I'm supposed to take)--that's 16mg's and I started reading about the drug online.  It seems that everyone else is getting really high off 2mg and here I am, feeling a much less effect from the drug and I've taken 16mg!  I'm not warm and itchy, the way I yearn to feel.  A little woozy but it is nothing like the feeling that hydro gave me.  Prior to this, I had been taking over 200mg of hydro a day and I hardly got high at all any more.  Maybe my tolerance is just too strong.  Or maybe I should try this drug when I'm in withdrawls hell.  I guess I just need to realize that the purpose of taking this drug is not to get high but to start living again.</p>"
}
