{
 "title": "A Broken Lent Promise",
 "author": "Lb Puppy",
 "citation": "   Lb Puppy. \"A Broken Lent Promise: experience with LSD (ID 5734)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5734",
 "substance": "LSD",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5734",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 22, 2002",
   "Views: 7140",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI upset the oversoul during my spring break.  I had said that I would give up synthetic drugs (i.e LSD and rolling) for lent this year.  I'm not Catholic, (or Christian for that matter), but I like the idea of sacrifice to a higher cause.  But...It just so happens that my spring break was during the beginning of lent, so now I'm faced with a dilemma.  </p><p>I had smoked some home-grown from my older sister's plant; I had about 3 good bowls left, and now my friend has enticed me to eat some papers from the bowling alley of all places.  I normally would have resisted, but my friend Jonathon's best friend Randy was tripping for his first time and they needed some stimulation and games.  I'm an experienced tripper and love being the entertainer/parental unit of the group.</p><p>  Randy drove a stick, but was too far gone to drive. Jonathon didn't drive a stick, and that left me at the helm. The whole way I kept thinking of my promise to Jesus.  Pretty soon into the car ride, we saw a beautiful church with multiple stain-glass windows.  I felt calmed.  Soon, however, as we wonder through the streets of Atlanta, we continue seeing churches.  As we passed different portions of the city, we continue to see Churches.  I told my friends that it was bizarre because the last time I had tripped in Atlanta, I was at a club called The Church, you guessed it... an old church.  I had driven around with bad directions, a head full of paper, and vague memories of how to get there.  I ended up there that night, and this night in question.  My friend Randy said, 'what club?  What church are you talking about?'  As I pulled up to the red light, I pointed at The Church!  (We had taken randomn turns and twists all around, fully unplanned.) We freak out on Atlanta a little more and then start driving home.</p><p>  We pass some more churches and pull into Chickfil-a for the crackhead sunrise.  As I was looking into the clouds being pierced with light, I felt an overwhelming calm.  I saw in the clouds a massive migration of people whom I had never met.  They looked like western settlers placed on a highway, and they were being ejected from heaven.  I don't know what others would say about my experience, or how they would have handled it for that matter.  I had a received a spiritual warning.  I felt the awesome presence of the Almighty, Muhammed, Buddha, and the general oversoul that connects us to the past and to each other.  I can still feel it.</p>"
}
