{
 "title": "Foxytripping",
 "author": "FlowGnome",
 "citation": "   FlowGnome. \"Foxytripping: experience with 5-MeO-DiPT & LSD (ID 5735)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5735",
 "substance": "5-MeO-DiPT & LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "  T+ 0:20",
   "2 hits",
   "oral",
   "LSD",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5735",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 22, 2002",
   "Views: 10839",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWell, the other night I was very bored, so I went to sleep. That's when this strange dream started, that I thought people might be interested in.</p><p>-- Begin Dream</p><p>I was sitting around reading trip reports on the internet about Foxy, having just purchased some and trying to find something interesting to combine it with since I did not like it by itself. There was no combination mentioned in any of the reports with both LSD and Foxy, so I decided to boldly go where no man had gone before. The 5-MeO-DiPT FAQ suggested that LSD would probably overpower the Foxy and it would not contribute much to the experience... boy were they wrong:</p><p>25mg of 5-MeO-DiPT was measured out and ingested.</p><p>20 minutes later, when a tryptamine buzz was being felt from the foxy, 2 hits of fairly strong acid were placed under the tongue. </p><p>Within 2 hours, both drugs had fully taken effect. The normal world became very 2 dimensional in appearance, but photographs would become 3D. Around an hour was spent thumbing through old photographs and feeling like I was actually there again, remembering everything that happened at the time fully. OEVs were getting extremely intense, to the point where it was becoming very difficult to see straight at points. The ceiling turned to a metallic liquid, and everything just looked wrong. These visuals were much more intense than 2 hits of this acid would normally bring about. Text on my computer monitor became unreadable at several points.</p><p>Audio was distorted as well. There were extreme up and down shifts in pitch and speed of music to the point where I could no longer understand the lyrics during the peak. These shifts seemed to correspond to the visuals somehow but I could not quite place how they were related. </p><p>The mental effects were much like acid alone, but it seemed as though my thoughts were being 'slurred' somehow, much like the way a very drunk person sounds when they are talking, except to my internal dialogue. This was not the same blending of words that happens to me on acid alone, but more of a messup in the language processing units of the brain that was kind of annoying IMHO.</p><p>I was also horny to an extreme level, which I kind of expected considering either of these substances alone turns me into a horny bastard. </p><p>On the body load side, there was some mild nausea at the start and some loose stool at T+12h. Muscle tension filled the experience, as well as a hint of the 'overload' feeling I get on high doses of 2C-T-7. Overall, this was an interesting combination, although I described it to a friend the next day as something I would not repeat because of the body load, and I loosely quoted another trip report I had read a long time ago: </p><p>'I was dumped out of the experience sometime the next day not having learned much for my troubles and with the general feeling that I'd been insulted somehow.'</p><p>--End Dream</p><p>So anyway, according to that dream these substances definitely have a synergy, and a very strange one at that, but this dreamer did not find it particularly interesting.</p><p>Take care!</p>"
}
