{
 "title": "Seperation of Awareness From Mind",
 "author": "The Eye",
 "citation": "   The Eye. \"Seperation of Awareness From Mind: experience with Salvia divinorum (20x extract) (ID 57386)\". Erowid.org. Sep 28, 2007. erowid.org/exp/57386",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 57386",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 28, 2007",
   "Views: 2605",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well I purchased salvia through a friend and i was quite excited about using it as i had heard many reports of deep and mind bending experiences on it. This was one of those experiences.</p><p>I have a small and quite ridiculous keychain pipe that I got in a funny little novelty shop. I guess the size and impracticality of it act as a monument to my experience and desire for weed or other smoke able substances (I recently quit weed due to the monotony of the experiences).  I used it for my first endeavor into the world of salvia and I got minimal and almost nominal results which made me question the drug itself rather than the piece. How stupid of me.</p><p>The very first time I smoked it I realized that the plant itself was an entity which I thought was farfetched at first but I really got to know its personality and characteristics. Salvia is devious and sly but at the same time, infinitely wise and deeper than the human mind. In my mind I sort of playfully tested the drugs potential and threw my mind about the room searching for results. In hindsight I was immensely idiotic and showed salvia no respect whatsoever. It really does deserve respect.</p><p>The night that I truly experienced salvia, I had made a pipe out of a BIC pen tube, a bottle cap and a red bull soda tab. It worked surprisingly well! I loaded up much more than I needed out of some form of frustration and I smoked it out of my window while my guardians slept soundly (yeah Im pathetic, I know). I didnt use a sitter which could have spelled disaster but I dont regret my choice at all. I took one huge hit and coughed it out quickly for some reason. Maybe it was because the pipe was made of plastic. I then took another out of ignorance and dissatisfaction. Then after that I remember little but I know I took more and more hits. My mind blurred and I was in a subconscious limbo for awhile and then my awareness was completely separated from my mind and it was thrust into another world entirely.</p><p>This new world was so alien and strange that I had a difficult time grasping it at first. It was almost dreamlike. I had an entirely new range of emotions and senses that mixed together to make overwhelming feelings. I was then observing beings of another realm entirely! These beings where so unique and abnormal that I know my mind could not have invented them and that the experience was entirely separate from my mind. </p><p>The beings were arranged in descending slices that looked like cross sections of the same design. The slices would fall into the ground and obliterate themselves, sending debris everywhere. The slices were arranged in a column that made up the entire being itself but the slices were not in any true way connected. The design on them could not be seen by human eyes because in this place there were no human senses. I can only distantly relate the sense to sight. The design on each being conveyed all of the information about the entity to me such as, personality, something that can be described as gender (not in a biological sense), and emotions (nothing like our own). As each slice hit the ground, the being would utter a sound or something that closely parallels sound. Each sound was unique and also gave information about the individual just as the design did. Every being had a distinct but indescribable color to it. Almost as if it was two colors at the same time in the same place that do not mix to form new colors but remain separate and the same. Its hard to describe. The colors served the same purpose as the other characteristics. I could not believe what I was experiencing and quite frankly I didnt know what I was experiencing. </p><p>I then quite smoothly became one of the beings! I was trapped in this form for quite some time. All I did was smash into the ground in a continuous stream of slices while at the same time making weak communication with the other beings. I recall the sound I made to: im-jae-famopolis. And I repeated it over and over every time one of my slices crashed. I felt an overwhelming feeling of hopelessness that stretched beyond fear or despair. The beings almost laughed at me for this and they simply danced around me in a way and showed me how to live. I didnt recall any other form of existence before this one and I only knew what was happening in the moment. I knew that I was not in my natural place but at the same time I had no idea where that was. I felt so lost and helpless. I was merely an awareness with no actual mind. I lived out several lives in this form which was not very long but longer that I thought I had been gone. </p><p>After a long time I began to recall my natural form. Every time I did this I would move a little bit closer to it. It felt so comforting but I was still lost in this world. Each time I moved desperately forward, I could hear laughing. I now think that it was the salvia laughing at my desperate attempts to regain my body. I am an atheist but if I believed in god, salvia would be mine. I finally found my way back to my mind and I stumbled into bed. I was lucky not to have fallen out the window. </p><p>I lied in the darkness for a time and then I realized that the lighter was still in my hand but I had no pipe! I dragged my limp body out of bed and searched my room for the pipe by the light of my ipod. I found nothing and gave up. I tried again in several minutes and even looked out the window but nothing. Then I found it all the way across the room in shambles. I didnt have the wherewithal to clean it up so I just swept it under the carpet and went back to bed.</p><p>I see now that salvia is the most intelligent drug that exists and it holds power that you cant imagine. It needs to be understood and respected. I feel as if it acted as my tour guide to existence and awareness itself. I am still in awe 3 days later and I still dont recall how many hits I took. It was the most moving experience of my life. I now have a much greater grasp on my life and the cosmos thanks to this wonderful, terrifying, awe inspiring, deep, powerful drug called salvia. </p><p>This drug IS the keeper of the COSMOS</p>"
}
