{
 "title": "Double Double Toil and Trouble...",
 "author": "Komrade",
 "citation": "   Komrade. \"Double Double Toil and Trouble...: experience with Absinthe, Mushrooms (P. semilanceata) & Cannabis (ID 5739)\". Erowid.org. Jan 22, 2002. erowid.org/exp/5739",
 "substance": "Absinthe, Mushrooms (P. semilanceata) & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   "  T+ 1:30",
   "300 mg",
   "oral",
   "Codeine",
   "(extract)",
   "  T+ 1:30",
   "25 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   "  T+ 2:00",
   "2.5 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 2:00",
   "25 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   "  T+ 2:40",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 3:15",
   "7.0 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)",
   "  T+ 3:25",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5739",
   "Male",
   " ",
   "Not Given",
   "Jan 22, 2002",
   "26532",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWhat started quite passively turned out to be probably the most intense trip i've ever had.  Here goes the story...</p><p>time - 9:30 eat an ephedrine (25mg) and plan to do some homework...</p><p>10:20 - decide that codeine would make electrodynamics homework a little more pleasant...prepare 300mg of codeine by cool filtration method. ..let chill</p><p>11:00 = T+0  I start the clock here with the 300mg of codeine and a 25mg pill of ephedrine.  Start into assignment...</p><p>T+0:30 min  decide that a stiff scotch on the rocks would help this whole studying thing even more (this is saturday..I don't do this often, just don't want to give the wrong impression) :-) pour out maybe 2.5oz scoth over ice; have another ephedrine (25mg) shorly after..</p><p>T+ 1:00  ...whew.  Staring to be quite a lot less productive, but my body is glowing.  I've done the ephedrine, codeine(+caffeine), and alcohol thing before, so I'm familiar with this warm buzz and I'm really digging it :-) </p><p>T+ 1:10 ...can you tell I procrastinate a lot?  I have an urge for some nitrous...that would go so well with this euphoric state.  I fill a balloon with a standard 10cc nitrous charge and huff on it for a while... like a usual nirous boost I swim in vibrant psychedelia for a few seconds and drift back to a nice hummmm</p><p>T+ 1:35 ...my weed smoking has dwindled the past while, but for some reason some good bud would be sweet now.  Unfortunately all I have is some dry old skunk, but it's better than nothing...  I pack a bowl of the really dry weed and figure i'l give it a bit of a push and sprinkle about 7mg of 5-MeO-DMT on top(heh).  Well I didn't get past one toke before the DMT blasted me out of this existence.  </p><p>I am radiating euphoria and energy.  I become nothing but a consciousness and my whole body dissolves in a pulsing mass of the best feeling plasmic energy you've imagined.  I think of all the things that are great in my life and all the things I am so grateful for that I usually take for granted...I explore my inner self as the experience massages every single pleasure point in my brain.  I come out of the state somewhat and am feeling so energized.  The combination of drugs was fantastic, giving incredible euphoria, energy, psychedelia and ego-separation.</p><p>T+1:45  it's been about 10 minutes (?) since the 5-meo hit me and a solid 30% of the DMT is still kicking...I wonder what nitrous would be like now!?!  Run and grab a charger with an excited urgency (DMT is still pushing me) and load up a balloon...</p><p>WOW!  This balloon totally destroyed me.  I felt my whole body tensing and pulsing energy like I was the focal point of the universe and was being blasted with a collosal sensory force that surged and rushed through me.  As I breathe back into the balloon I wonder how long it's been since I had a breath of air...had I remembered to breathe?  I let in a big breath of air and then alternated with the balloon a few more times riding out this experience.  As I lay back I feel exhausted like I have just done a bout of exercise.  I breathe in and out deeply as my head swishes through the music...</p><p>about 45 mintes have past since the DMT...whew, what a way to make codeine seem like it's lasting a WHOLE lot longer!</p><p>T+2:20   I decide to lay down and listen to some music...I let the journey ride out in a nice contented psychedelic coast back to the warm undertones of body buzz that were left over from the codeine and ephedrine.  Reflect on the trip ... most probably the most intense experience I've had with drugs. whew!</p><p>T+ 3:30  I type this now, still a little jittery from all the caffeine in the codeine (about 560mg) and whatever other leftovers.  </p><p>I got to know these drugs before I even thought about trying this.  These doses (especially codeine, alcohol and ephedrine) I've felt out carefully and are very sensitive to overdose.  A lot of codeine with any more ephedrine than I've done tends to lead to chills, nausea and vomiting...it's not fun.  Too much alcohol and codeine can knock you right out an put into respiratory arrest (stop breathing=bad).  As for 5-MeO-DMT, well, anything that put reality through the shredder like that I think deserves some respect, ok.  </p><p>Cheers,</p><p>Komrade</p><p>'Living in a box, all you know are its walls...</p><p>          We all live in a box'</p><p>      ----Machivellien Nomen</p><p>           Ewige Blumenkraft, meine freunde!</p>"
}
