{
 "title": "Sedated and Euphoric",
 "author": "Psychonaut",
 "citation": "   Psychonaut. \"Sedated and Euphoric: experience with Kava, Alcohol & Cannabis (ID 57399)\". Erowid.org. Jan 10, 2010. erowid.org/exp/57399",
 "substance": "Kava, Alcohol & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "8 g",
   "oral",
   "Kava",
   "(plant material)",
   "  T+ 0:00",
   "3 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 0:45",
   "  ",
   " ",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57399",
   "Male",
   " ",
   "Not Given",
   "Jan 10, 2010",
   "Views: 4350",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So, I bought some Kava Root powder from an online vendor. About 4 oz. Ive drank about 2 oz. so far. And my current experience starts 45 minutes ago. </p><p>I usually drink this stuff as a tea free from alcohol and find it to be nice and relaxing prepared that way. But I decided on a little Kava mixed drink. I have cinnamon flavoured Kava that is Hawaiian Mahakea and of very good quality. I enjoy this stuff with apple juice quite a lot because of the cinnamon. I tried it without straining the Kava powder, and enjoyed it that way best. But this time I added about 3 oz. of rum to a glass then throw in the cinnamon Kava. I put in about 8 grams of it, stirred and let it sit for 15 minutes. After the 15 minutes was up I dipped my finger in the thick mixture of Kava and rum and dapped it on my tongue. It went about as numb as cocaine makes my tongue. I added apple juice to it and was ready to go. I stirred it up one last time and gulped it all down.</p><p>After ten minutes or so I felt very buzzed from the alcohol. No Kava effects, other than a slightly numb mouth. I noticed about 15 minutes ago (which was 30 minutes after ingesting it) that I felt extremely sedated and euphoric. I felt and still feel very happy. Im surprised at the effects because 8 grams in tea have never felt this potent. This is something Id definitely try with a little alcohol again. Its much nicer than being drunk, and very potent at the same time. I threw a little MJ in the mix just now as well and the synergy is quite nice, as I also noticed with the tea.</p><p>Kava is a great drink the relieve stress, and while its great with alcohol I typically use it to avoid using alcohol.</p>"
}
