{
 "title": "Mild, Easy Comedown",
 "author": "rm1x",
 "citation": "   rm1x. \"Mild, Easy Comedown: experience with Piperazines - MeOPP & Alcohol (ID 57410)\". Erowid.org. Nov 15, 2006. erowid.org/exp/57410",
 "substance": "Piperazines - MeOPP & Alcohol",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   " ",
   "400 mg",
   "oral",
   "Piperazines - MeOPP",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 57410",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 15, 2006",
   "Views: 8424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So I decided to have a go of some of my meoPP I had sitting in a bag for a week.</p><p>Not taking it before I did'nt really know what to expect. The only other piperazines that I have tried were a blend of BZP and TFMPP, which were sold as party pills.</p><p>The effects were amazing, but the comedown was atrocious, which resulted in a really bad headache, paranoia, and all the things you don't want from a drug lol</p><p>Anyway I measured out 400mg of the beige 'sunrise' meOPP HCL powder and put it into the bottom of a cup. I then put 10ml of warm water into a 20ml syringe and mixed it, then drew it up. I had a little over 10ml of rose coloured liquid.</p><p>Now I had been drinking a few beers that afternoon, so I thought I would wash the meoPP down with a swig of beer. (DON'T MIX DRUGS AND ALCOHOL. IT'S STUPID)</p><p>I squirted the liquid into my mouth and was greated with a pretty horrid chemical taste. It was salty, and not unlike a MDMA, not as intense in flavour though. I washed it down with beer, the beer all of a sudden took on a really sweet flavour lol This lasted for the rest of it. I probably burnt my tastebuds out.</p><p>It came on really quickly, much faster than I anticipated. Within about 15 minutes I was starting to feel something different. As I have never taken this substance before I was'nt sure what to expect.</p><p>Around the 30 minute mark I started to feel very jittery. It had a similar feel to the come up of LSD bodywise, I also began to feel slightly nauseous. It was'nt bad or anything, but it made me put my beer down. I can see why they recommend using freshly ground ginger, or ginger tabs, I feel this would have stopped the queasy feeling.</p><p>I felt queasy and jittery for about another 30 minutes. In this time I found that colours were slightly shifting, becoming more intense, and lights were much brighter.</p><p>I noted that I could actually see the TV strobe when it was on a bluescreen. I also noticed that white text on a black background shimmered and strobed, also got minor trails from them. The posters on the wall were starting to get depth, one in particular, a NOFX tour poster was fading between green and blue hues, I thought this was pretty cool.</p><p>My body was starting to get rushes, similar to mdma, my skin was tingling. I threw on some ambient (Carbon Based Lifeforms) and found I was getting heaps of introspection. I got sick of that quickly and went out for a cigarette. While I was having a smoke, the neighbours daughter was leaving, so I was sitting there watching their interaction.</p><p>It was comical, I am sure they were overacting because they knew they had an audience, I was kind of disturbed by it for some reason, thinking it was way too over the top, wanted to go back inside, but at the same time was transfixed by this cartoonesque version of the happy family.</p><p>I came too and decided they probably didn't like the weird fellow with the bug eyes staring at them like some kind of slackjawed yokel and went back inside. For some strange reason, even now, I feel like I shared an intimate moment with this family, it was almost profound. In a really demented way.</p><p>I was feeling really restless, so I put on some psytrance. I found this really energised me so I had a dance around the living room. I did this for about 10 minutes, then got wholly sick of it and decided to throw some drum n bass on. This was good. About 1.5 to 1.75 hours into the trip I decided to have another cold beer as it was a hot day. I was going to do this sooner, as my nausea had passed after about an hour, but I kept forgetting to get one, plus I was transfixed on how sweet a glass of coca cola was. So I grabbed myself a beer. Took a sip, and got what I can only describe as a full body cold rush. It started at my feet and went up AND down the back of my neck at the same time, and travelled all over my arms and legs and spread to the tips of my ears. This was such a nice feeling, and it kept happening everytime I had a sip of this one beer. In hindsight it may also have been the breeze that was flowing through the house, but I am hell bent on having a magic rush beer, so I stand by it being the beer.</p><p>Around the 2 to 2.5 hour mark I decided to watch a WildBoyz series. I had the volume down, with some music on in the background, but the show gave me a good laugh. I felt like I was more at one with the people on the show for some reason. I also found that I felt closer to the people I was with, we all shared some pretty deep belly laughs at the most random stuff. Connected. I felt this way for a few more hours until the effects started to taper off and the alcohol started to overpower the effects. (I'm cutting it short as it is a bit blurry)</p><p>All in all the effects lasted for about 5 hours, maybe 6. I had a really wonderful time on meOPP, it had moments of stimulation, but on a whole it is a really relaxing substance. I had rushes all over my body like from mdma, also eye wiggles,  mild visuals and tracers, some pretty good laughs like I get from LSD, and a general overall sense of oneness with the people I was with. My attention wasn't too great on it, and I found I would get pretty bored with things quickly. I feel this is a nice mild substitute to mdma, the comedown was really easy, and there was no depression the next day. I found my appetite was'nt very good the next day, but by the afternoon I was eating as normal. I did however get a hangover from the beer. Next time I won't drink before hand so I can properly gauge the effects, and do a proper trip report.</p>"
}
