{
 "title": "The Anemone Experience",
 "author": "Ben",
 "citation": " Ben. \"The Anemone Experience: experience with Mushrooms - P. cubensis (ID 57437)\". Erowid.org. Jun 16, 2009. erowid.org/exp/57437",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "",
   "1 cig.",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2006",
   "57437",
   "Male",
   "",
   "Not Given",
   "Jun 16, 2009",
   "2122",
   " "
  ]
 ],
 "report": "<p>I got to the woods and ate about 4 grams dry home grown Mexican cubensis, although they werent all dry  some aborts.  I came up as the sun began to set, and the sky was wonderful, I found a place on the edge of the woods where the view over the countryside was great, and I danced in the long grass.  Flies and birds left rainbow trails that formed like ripples behind them in the air.  I stared at the pulsating purple-rainbow ripple vortex that has been with me in blue sky every sunny day since I first tried morning glory seeds.  My girlfriend met me back at the entrance to the woods, and we began to make our way to a bit where fallen trees cross this streambut we ended up ploughing through ferns that were bigger than our headsthey all stroked me as I went through.  The thorns clutched at me though, not in a negative way, but in a lusty (?) way.</p><p>After we left the woods I made my way back home in the duskit seemed like colour had drained from the world, only me, her and the cats were illuminated in strange geometric multicolour outlines.  She left then, and I made my way to the graveyard to enjoy the view over the fields, where in the distance I could see the first place I took mushrooms.  At this point the shrooms started to really take overI had thought at the beginning that the first waves were pretty strong, and now my senses started to collide.  The bench I sat on wobbled and pulsated and the grass felt even weirder.  I looked and felt for dew, but couldnt distinguish between wet and dry, or hot and cold.  I felt for dew because I was face down in the grass and I didnt want to get wet.  I started saying My names Ben, and Im not melting But I couldnt hold myself together, I felt like I was melting, not downwards but inwards and reality faded.</p><p>There was darkness, and then I became aware of a strange anemone thing, but without perceiving it, because there was nowhere for me to perceive it from.  It was electric fluorescent neon blue, and its tentacles were all wiggling and fluctuating.  I looked to the point where all these tentacles originated, and found it was infinitesimally tiny, almost nothing.  I saw that some of the tentacles were brown and kinda like hair in texture, scaly and rough, decaying, they werent moving like the others, but still, or moving stiffly.  I realised that I was looking at myself.</p><p>The point at the centre was what was essentially me, a priori, before birth, memory and experience.  That was the part of me that would never change.  The tentacles were parts of me I had acquired through living  aspects of my personality, my lifestyle, my perspective, all organic living things.  The brown ones I recognised as negative parts of my life, fear, anger, pain, apathy, the fact that I smoked, etc.  I watched as these bits began to crack, as if they were brittle, and break off, and the whole thing shuddered.  I was pulled with it as all the tentacles receded into the centre, blank for a second, and then came an explosion like the beginning of the universe.  The blue fluid like tentacles shot outward to beyond their previous state, gloriously, magnificently, like fireworks.  It felt like something monumental, but I cant describe any other sensations apart the visual aspect, I cant remember them even if I was able to distinguish sound from touch</p><p>Then they fell back to their previous state, wiggling like an anemones, growing.  But the brown ones were gone, shaken off, erased.  I looked up from the grass and found myself face to face and surrounded by animals, otters, badgers, mice, ferrets, rats, foxes, dogs, cats, rabbits, moles, all kinds of woodland animals, maybe a few deer, and the sky was filled with hovering owls, and bats flitting around.  They were all looking curious, concerned, as if they were getting closer to see what was going on, but they stopped as soon as I raised my head.  They disappeared and I got to my knees (very confused, still thinking about the blue anemone experience), and although most of them had gone.  There was a black cat looking at me that was real, but it swiftly eloped before I could stand or utter a greeting.  From the beginning of the anemone it had all happened rather quicklybut I felt like I had been here for hours</p><p>I sat back down on the bench and calmed downafter a while the trip was ending, and I was thankful that it was over  I felt like I had fallen into the abyss after only requesting a look.  Like I had died and been reborn, able to reconstruct only the parts of me that I wanted to keep.  Never-the-less it is still one of the most important experiences Ive had, and one of the most valued.  I had a wonderful time, and was completely humbled and awed by the outcome  but I was still glad I was back  it was so intense.  I lit up a joint to provide closure  give myself a definite end to the trip, and knew that after I finished my home-grown white widow there would be no more smoke for me.  Before the experience I smoked 3-4 big fat joints a day at least, every day, for over a year.  It was having a terrible effect on my health, but after that night I no longer felt a need for weed, or boredom when without it like I used to.  Even now I dont feel that craving the plan was to eat weed instead, but my dealers have been away, and I just havent felt the urge.</p><p>Ive been on a different plane of being since that night, all those negative emotions just dont hold any real meaning anymore.  I think I move from day to day in a relatively tranquil state.  I see those emotions in other people more clearly now, how it drives their actions sometimes, and I dont even feel disapproving because I feel I understand everybody much better.  I feel I have the confidence to move through life and through the world in a truly good way.</p><p>Some days now I just feel really happy, for seemingly no reason, deeply content, fulfilled. :)</p>"
}
