{
 "title": "Hyperspace Sideshow",
 "author": "Entheogen23",
 "citation": "   Entheogen23. \"Hyperspace Sideshow: experience with DMT (ID 57450)\". Erowid.org. Jan 13, 2007. erowid.org/exp/57450",
 "substance": "DMT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "inhaled",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57450",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 13, 2007",
   "Views: 5092",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>50mg NN-DMT clean off-white crystal freebase, vaporized in glass pipe. (but turns out only smoked around 20-30mg)</p><p>Total time of trip: 6-8 mins</p><p>Smoke was smooth, nothing like the nasty orange gooey shit I had smoked in the past. I was cautious about burning the spice, so went at it slow with the torch lighter. Realized I wasn't heating enough until third hit, then got nice white whispy smoke. Two more hits immediately made it hard for me to concentrate to hold the pipe. That was 4 hits total, but only two good ones. Visually reality became very much like looking through melted glass or old fashion hand-made plate glass windows from the 1800's. Was able to set the pipe down and then closed eyes.</p><p>Visuals came on strong and intense. The colors, oh my god, the colors on DMT are just so vibrant and amazing and beautiful. Somewhat like in an Alex Grey painting, or in some really brighly colored psychedelic computer art, but somehow brighter, as if both reflecting light as well as glowing. Like neon. Neon is the best comparison, but even then with DMT hyperspace, they are more hyperreal, more luminous and glowing. </p><p>Similar visions from previous experiences, being in some sort of neon hypercube room, maybe in a castle of some sort, walls pulsing and glowing, with intricate detailed hieroglyphics and op-art style patterns. A sense of some sort of entities there, showing me things. </p><p>Then, oddly, a woman appears, sorta punked out Suicide Girl looking, and flips me off! She taunts me, and I laugh to myself. 'Go away!' I think. She laughs and mocks me, and flips me off again. Then she shows me some sort of glowing blue neon blob with dentrite-like protrusions from it. Looks like a deep blue neon model of a neuron (brain cell). I realise again she is trying to distract me. I focus on ignorning her and the object, and focus on visualizing a mandala like pattern. It morphs into a Aztec calender, and then I am back in the hypercube castle room again. There are all sorts of moving psychedelic images and objects flying around in front of me. </p><p>The visuals are odd in that they are 4 dimentional (3D + time shifting), but the actual objects and things flying around are mostly 2D, like pieces of thin translucent acetate with brightly colored patterns projected onto them. As I have experience in the past, both NN-DMT and Salvia  extracts (10X) they seem very 'plastic', or maybe metal. I think to myself: This almost seems like stepping into some hyperspace alien cityscape, like Tokyo in Bladerunner (or in real life!), with all the flashing ginourmous TVs and signs and neon. And just like Tokyo, I can't read anything, it is in some sort of visual lanuage, more complex than Kanji or hieroglyphics. Maybe like mutating/morphing hieroglyphics, in colors beyond the real. Yet there is always the strange sense that 'this seems really familiar', like I have been here many times before (even before I knew what DMT was).</p><p>While the trip is amazing and colorful and awesome in the literal sense of the word, it also seems a bit shallow or somehow unfulfilling. Like a really cool video game or VR world, but something that doesn't allow time to really explore and/or that you can't really go as deep into as it seems at first glance. (Like those video games where you want to explore outside the town you are placed in, but there are invisble borders that keep you from going any further. </p><p>After about 5 mins I start to come down, and then I start getting the usual full body shaking, like an intense but harmless electric shock is zapping me. I find myself yawning a lot too. Odd. I used to worry these effects were the residues of naptha or something, but I think it is just the intense rush of the experince finally catching up to my body, and my body say 'woah! hey! FUCK! that was WILD!' I open my eyes and see faint traces of the op-art patterns on the walls and ceilings. I close my eyes and start seeing the electric neon blue neuron thing, and it 'shocks' me psychically (in a playful way). Images start to fade, and still shaking I arise to go into the other room to write this report up.</p><p>Afterthoughts</p><p>I'd like to try and get a bigger dose next time. I had 50mg loaded, but was only able to get down 20-30mg of it or so before I had to set the pipe down. A trip sitter would help a lot!</p><p>Very amazing substance this NN-DMT! Unlike any visuals I have ever had before.</p><p>Unlike the sometimes disturbing Salvia trips I have had, I never once forgot who I was, or that I was laying in a bed and had smoked DMT. Perhaps at higher doses there would be more ego-blurriness?</p><p>The short-lived trip, and the somewhat superficial or 'plastic' feel make me want to pursue Ayahuasca  and/or varaitions of pharmahuasca even more then before this trip. I want to go deeper, slower, and have time to explore this new world.</p><p>Smoked DMT is somewhat like the way George Lucas directs his films: fast and furious. Images cut from one to the next, little time to focus (or appreciate) the grand scenic vista. Fun as hell, and mind-blowing, but leaving me wanting more. Like if Steven Soderberg directed Star Wars. Slower, more reflective, with time to take it all in. (LOL, I am a movie geek, I can't help but think in metaphors like this )</p><p>30 mins later I noticed that a fair amount of the DMT has cooled and re-crysyalized in the pipe.  So I sat down to smoke this, and that time WOW.  Total breakthrough experience, nearly totally overwhelming this time.  I was in soooo much deeper this time.  Made the first trip seem like a mere circus sideshow.  Can't even put it into words, but will attempt to on my next journey to hyperspace.</p>"
}
