{
 "title": "The Will and Plants",
 "author": "Phlairfire",
 "citation": "   Phlairfire. \"The Will and Plants: experience with Lotus - Nymphaea nouchali (Blue Lotus) (ID 57477)\". Erowid.org. Sep 14, 2009. erowid.org/exp/57477",
 "substance": "Lotus - Nymphaea nouchali (Blue Lotus)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "6.5 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   " ",
   " ",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3 hits",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 57477",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 14, 2009",
   "Views: 7712",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went into the experience with the intent to experience directly the act of being a Will.  That is to say the stages included in its discovery and the full realization of the impact, and subsequent possabilities.</p><p>So I receivied a postage containing approx. 100 grams of blue lotus, and immediately put 20 grams to soak in approx. one bottle of wine.  This was allowed to sit in fridge for three days.  On the third day, I aquired a small amount of schwag quality marijuana, and mixed it half, and half with some dry lotus rolled into a reefer about the diameter of a mechanical pencil.  </p><p>a little back story:</p><p>I quit smoking maryjane habitually around four months ago.  I haven't exactly been practicing focus of mind, and paying attention exercises every day.  But I've trained myself with the technique outlined by jonn mumford in his yogic exercise books, the visualizations and concepts for which I've almost memorized by rote.  Of course, practice helped.  I'm a math undergrad, though, and I feel the amount of focus, attentive thought, and will to succeed into them, that it amounts to a type of meditation in motion.  School and a certain reorientation to my methods of committing, and emotionally communicating, are what influenced my lifestyle change.  I've a descent conception in the teachings if Erik Milton's hypnosis and NLP's techinques for understanding how they work.  All of these things played a role in my experience.  This and my recent investigation into the nature of WILL-Power, as outlined in Assagioli's system of Psychosynthesis.  So bear these things in mind as you read.</p><p>So, I filtered the leaves off of about a 6.5 oz cup's worth.  I drank this pretty quick, as I'm not a fan of the taste of wine generally.  I then begin to think over the idea of the stages of realization of the WILL as self.  I then realized that by thinking over such things I created heat in my body, a direct influence on material reality of the minds will to think, which in turn produced an image of a field of matter, and the influence of my thoughts upon it.  As a reaction I thought 'The process of seeing, I will to do, the process of feeling I will to do, the process of hearing, tasting and smelling I will to do.  I will every movement of body and meandering of mind.</p><p>I looked up to see what time it was and it had only been a moment.  I then sat down and took three big hits from my reefer cigarette, and hoo boy.  The previous insight became a reiterating meditation. Compounding the insight threefold, fivefold, and tenfold. I became aware of the significance of the metaphore that is chi, prana, and unfied life force energy, all as metaphores of the will.  I am these things as I am the Will to experience such things, I am the Will to experience the repercussions of the influence of every physical function.  These sorts of epiphanies, and seeming dozens of charged visualizations, and their meaning with respect to will, washed through me, my thoughts, and my actions.  I paced around completely aware of my pacing, I visualized, I allowed my mind's attention to focus wherever it would, and I even attempted to set an anchor in meditation, in order to get back this place, at will, when sober, in an attempt to sublimate, calcify, and as such, purify, the quality of the experience, ultimately to incorporate it into my everyday experiences, and reactions. </p><p>Overall, only time will tell whether this experiment has been a success.  I will spend the next several days attempting to go into an attentive trance, with the anchor I set, and amplify the accesability, and frequency of my realization of will, and its skillful utilazation, in everyday activities(chores, hygene, study, etc.), and deeper spiritual and psychological activities(meditation, ceremonial prayer, evakation and invokation).  Then maybe I will consider resetting the anchore with the plant helpers in person.</p><p>Funny I just had the realization that inbibing the plants is a type of invokation, and that it increases one's physical response to evoking them into one's mental field, thereby enabling the establishment of a physical communication with the entities, All under the gentle use of the power of the strong will skillfully applied in the direction of one's desired outcomes.  A realization I find truly beautiful, and fulfilling.</p>"
}
