{
 "title": "No More Vivarin, Please!",
 "author": "Zonker",
 "citation": "Citation:   Zonker. \"No More Vivarin, Please!: experience with Caffeine (ID 575)\". Erowid.org. Sep 10, 2000. erowid.org/exp/575",
 "substance": "Caffeine",
 "bodyweight": "137 lb",
 "header": [
  [
   "DOSE:",
   "36 tablets",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 575",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 36645",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was alot younger when I did this, fifteen years old if I remember correctly.  It was one of the stupidest things I did in my life. Like many adolescents, I, for some unknown reason, had an urge to try as much of as many drugs as I could.  This led to me eating pills that even now with a PDR I can't determine. Anyhow, I went to see some bloody action flick with my first love ( and, for reasons I don't recall but many would understand), I stopped into a store to lift two boxes of Vivarin, not just any, I had to pick the coated stuff.  I went home, and me and her split the pills, she had half of one box and I had all the rest. I don't know how much it came to now. I was suspended from high school for a few months at the time, so I think I was accounting for a tolerance I no longer had, or something (my suspension was caffeine related, too!)\r\nIn any case, soon we were running outside in a glorious warm spring rain, laughing and sliding in the mud and running barefoot down the street, laughing and in love. There were multicolour lights in the sky, like at the beginning of a VERY HARD acid trip (full visuals), but it was all cool and I was happy. I don't know just how much time we spent outside, but some time later I was sitting on a chair in my room, and everything began to rock, not really my balance-feeling, but the room itsself. The more it rocked, the less comfortable I felt. I laid down, and this didn't help. \r\nSoon the world was spinning like a washing machine - literally, everything was blurred into a brightly lit spinning circle. The old vertigo began to act up now as well, after this tactile asault, and as a consequence, so did the nausea. Try to make it to the bathroom and puke. Fall down. Puke, try to stand up. Puke. Go to hospital, have stomach pumped while semi-concious. Get story in newspapers next day. Not fun. My relationship lasted, though, for a while. My aversion to Vivarin, however, lasts to this day. Coated pills, like the 'Specially Lined Keystone Cans' take the 'Special Lining' off my stomach.\r\nI do know why this happened. If you look for it, you will find the levels for fatal doses by weight for caffeine. DO NOT take anywhere near this amount. It IS NOT pleasant, particularly the suction part, even if you did already puke out a handful of half-digested pills.\n\n\n"
}