{
 "title": "Ergine Extraction",
 "author": "Mandel",
 "citation": "   Mandel. \"Ergine Extraction: experience with Morning Glory (ID 57508)\". Erowid.org. Nov 20, 2007. erowid.org/exp/57508",
 "substance": "Morning Glory",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "500 seeds",
   " ",
   "Morning Glory",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57508",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 20, 2007",
   "Views: 50534",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nErgine Extraction from Ipomacea Violencia Seed Matter\r\nExperimental\r\n1)  Approxamately 500 seeds are ground as fine as possible in a coffee grinder.  I have tried this many times before with no success.  It costs fifteen bucks, get real and just buy a coffee grinder.  This forms a yellow nutty smelling powder.  There will probably be a couple of still visible shreds of seed husk as well.\r\n2)  The powder is placed in a 1 L flask and petroleum ether is added to fill the flask.  Some people suggest using Naptha as a solvent because of its relative ease of purchase.  It could be used in a bind, because it is a quick evaporating solvent.  Just be aware that naptha also goes under the names of petroleum benzine and coal tar.  Petroleum ether is a much better solvent I think, and worth the hassle that comes with getting it.\r\n3)  Agitate the liquid for 4 hours.  If this sounds like it might wear you out then you might want to consier creating a machine to agitate it for you.  There are several on the market, but they are a little pricey, and a little bit of creativity and ingenuity can save a lot of money.  After agitation the liquid should have turned lemon yellow/green.  Filter and discard the liquid.\r\n4)  Repeat step two and three until the petroleum ether no longer changes color.  Keep in mind that the more you agitate, the more you get with each wash, and the less precious petroleum ether you have to use.  Penny saved is a penny earned.\r\n5)  Take wet seed matter and evaporate under vacuum.  If you don't have a vacuum to evaporate under, then you can get a Pyrex pie pan and rig it on the stove using a skillet underneath it to distribute heat a little more evenly.  Use as low a heat as possible.  Eventually it will get very dry.  I have been unable to find a heat of breakdown of ergine, but I am certain the low heat required to evaporate petroleum ether is probably below it.  Once dry, break up matter if it has clumped together.\r\n6)  Dried seed matter is placed in a clean 1 L flask and 183 proof ethanol is added to fill the flask.  Ethanol is the best solvent for multiple reasons: it can be purchased legally and easily if you are over 21.  (If you aren't over 21, what the hell are you doing getting into chemistry this serious?)  It is obviously suitable for ingestion, and it evaporates quickly and nicely.  Agitate the flask for up to four hours.  The alcohol should turn dark yellow/orange.  Filter off alcohol and save in a large flask or nalgene.  Repeat this step until the alcohol no longer turns color.  Once expended, discard seed matter.\r\n7)  You should now have between 3 to 5 liters of orange tinted ethanol.  This consists mainly of the alkaloids and resins.  Most people here suggest evaporating it off, which is fine, but can leave your possibly enclosed area with a whole lot of alcohol fumes, and so I suggest a different method.  A 500mL flask is filled with the orange solution and a condenser is set above it.  Heat is added to produce alcohol fumes, and the solvent is condensed off.  Not only do you get a large portion of your alcohol back (and probably substantially higher concentration), but you also don't have a large amount of fumes.  You could buy a condensor somewhere for a couple hundred bucks.  I got creative and made one out of some stuff at my house.\r\nOnce the flask has dropped below one-third full, add more orange solution to fill it, mix, and then replace condensor.  This step is a little tedious, but is worth it as far as speed and efficiency.  Once you get down the the last flask full, the solution should be very cloudy, and if allowed to cool and stongly agitated, you can force crystallisation of the alkaloids.  I was considering filtering them off here, but decided to continue on the evaporation to get them all.  Once you get down the the last third of the flask of solution, put it in a pyrex pie pan rigged on the stove top or heat source that you have as before, and dry off the remaining solvent under a fume hood.  If you only have a stove fan, I would suggest at least rigging an additional box fan blowing out the vent as well.  If you want good separation, put the pie pan on an ever so slight tilt, you will find that things with less molecular weight will come out of the drying solution first, and will form little veins across the top of the pie pan.  The heavier resins will come out last as a big thick brown glob at the bottom.  If you keep the pan level it will all just be together, so save yourself the nasty brown gunk.\r\n8)  When completely dry, take a clean razor and scrape the little yellow veins on the pie pan (or just the whole brown gunk if you couldn't get them to separate).  If you are a decent chemist, you should have a yellow crystalline solid.  I got mine looking pretty good with no need for a recrystalisation in a lighter solvent.  Some friends of mine upon seeing it said that it looked sort of like really light brown sugar.  After this, an acid-base separation is possible, although there are plenty of useful methods out there already for that and me putting one up would be redundant (not to mention I didn't use this additional method in this experiment, and so I wouldn't be able to write it with any qualitative information).  The only more pure you get after that is chromatography, but if you can afford chromatography/spectroscopy you could probably afford to hire a private chemist tutor to teach you how to do this too. :-)\r\nNow that you have the end product, it can be ingested (preferably by placement in a gel-cap), or it can be saved as material for further reaction.  I am doing a little research on peptide synthesis right now, so within the next couple of months I will either have an experience report, or an experiment regarding further synthesis using this product.\n\n\n"
}
