{
 "title": "Our Pointless, Artificial World",
 "author": "Salvia divinorum",
 "citation": "   Salvia divinorum. \"Our Pointless, Artificial World: experience with Salvia divinorum (15x extract) (ID 57512)\". Erowid.org. Sep 9, 2009. erowid.org/exp/57512",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57512",
   "Female",
   " ",
   "Not Given",
   "Sep 9, 2009",
   "3243",
   " "
  ]
 ],
 "report": "<p>I will start this out by saying that I have no experience with any other type of drug other than pot. One night, I told my friend that I wanted to try salvia or shrooms. So, he bought me some salvia (15x). The location was my sister's house and it was only my sister, my friend, and me there. I feel that it is important to say that I trust and love them both very very much. They both had tripped on Salvia before, so I thought I knew what to expect based on their experiences. I assumed I would have mild hallucinations but, MAN, was I in for a HUGE surprise! </p><p>The last thing I remember was ripping the bong on the floor of the room and starting to cough. I managed to say, 'I thought you said this doesn't burn...' I trailed off. I immediately noticed that the room was fuzzy, similiar to that of being 'baked', and I thought 'holy shit this is already kicking in!' The next thing I know, I am in a forest of brilliant color. I have NO IDEA of ANYTHING from my past. Ex: my name, that I smoked, or that this wasn't where I had always been. I have trouble recalling the forest but it was in such bright color with all flowers and shrooms everywhere. There were huts and I walked into them like I had been there before. I saw people whose features were similiar to those of plants. Very hard to describe, perhaps with stems for arms and buds for noses, VERY realistic and detailed at the time. I tried to talk but I realized that I couldn't. It felt as if I had no bottom jaw or something and my whole face was numb. It was like a nightmare. I tried to talk but I just couldn't. Recalling it is more terrifying than the actual experience. At the time, I soon forgot that I had ever been able to talk so it didn't bother me much. The plant people talked to me but I cannot recall what they said.</p><p>I then began to see that there where animals in the forest. But, with closer inspection, I found that they were not real. This frightened me. I looked around and it soon became apparent that NOTHING was real. What if I'm not even real? I noticed that the forest wasn't actually a forest at all and that it was divided up into rooms. It made sense at the time-hard to understand now. I then must have been coming back to reality because I saw my sister smiling, just sitting there, staring at me. I tried to tell her that the whole world wasn't real but I couldn't talk. She just sat there and said 'its too late to turn back now' and I instantly remembered smoking. I thought she gave it to me so it would show me that the world was fake. I realized that she was one of the flower people and that she was never my sister after all. I thought that my whole existance was just an illusion. I instantly wanted to find my friend but I realized that he was fake as well. They were all fake, EVERYTHING in the whole universe was fake! Actually, I realized that there wasn't even a universe. I realized that this was it, and that I would die and there wouldn't be anything afterwards.</p><p>I panicked. All the 'rooms' that made up the forest began to fall away until I was in the only room left. I realized that this was really the end of the world. Even though there wasn't really any real world afterall. I saw my sister and she was made up completely of squares. The squares she was made up of started to fall apart and slide down her into a hole in the ground. It was not gory at all, more like pixels in a picture being deleted. I then also felt fake and like one of those part plant people. I felt stuck to the checkerfloor of the room and I couldn't get up. I was becoming part of the floor. My legs were molding to it and I couldn't escape. I didn't want the world to end, I wanted everything to be how it was even if I was living in complete denial.</p><p>I then began to see reality clearer. My sister's house came back to me and I was laying on a bed. The room looked so grey and drab compaired to the colorful world I had just come from. I felt like I was pouring sweat, even though I wasn't. I heard my friend and sister talk and talk and talk but I couldn't understand them. I just layed there, unable to move. I gasped for breath but it was hard to breath. Actually, it was hard to do anything. I began to talk but I can't recall what I said. I was so happy to be back to the familiar world, real or not.</p><p>I don't know how I got onto the bed from the floor. My sister and friend say that I just looked around and reached for things that weren't there. They said that at the peak of my trip, I just sat there, twitching and drooling-like I was on the verge of a seizure. I have no memory of what my physical body did while I was tripping. I still wonder if my experience was actually reality. I hope not. Either way, it gave me a much different outlook on life.</p>"
}
