{
 "title": "Not for Writing",
 "author": "j4",
 "citation": "   j4. \"Not for Writing: experience with Cocaine (ID 57574)\". Erowid.org. May 10, 2008. erowid.org/exp/57574",
 "substance": "Cocaine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57574",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 10, 2008",
   "Views: 8557",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm a composer and have tried coke off and on in social situations since college. Cocaine makes me feel like superman in some ways, I feel amazing and I like myself better and I feel proud of myself and feel a stronger bond between people when I'm on it. It's not that I haven't felt any of these feelings before when sober, but it gives me that 'yeah' moment, like oh yeah I rock, this is inspiring and fun.<br>I've done adderall and ritalin recreationally and it has some of the same effects, and they really helped me in 'crunch' times in college. But I'd never tried coke to help me concentrate, and wanted to try. I'd say that it can clear my mind and motivate me, and I have a big deadline coming up so I bought a 50 bag thinking I could use it like ritalin.<br>I would try to do a few lines and then try to write, but I have to say, it doesn't help me creatively. It's too distracting. My heart races and I'll write a few bars, and while it does help me be in a good mood which helps me write, it's too intense and I come down too quickly, and the come down is way more distracting than the coke helps inspire me.<br>I was all set to self medicate myself with a street drug alternative to a pharmaceutical, but the buzz is too fast and too intense for me to be able to work with it. I guess slow and steady wins the race after all, I'm always looking for a shortcut. I work well under pressure but the comedown makes me not give a shit and I go to sleep.<br>Coke's a fun drug but I put it on a pedestal. That's not to say it's not dangerous -- it's probably better that I'm learning I can't depend on it -- but while it may not be as crazy dangerous as I initially thought, it's also not the wonder drug that I thought would unlock my creativity either.\n\n\n"
}
