{
 "title": "My First Chemical Love",
 "author": "Lecaotter",
 "citation": "   Lecaotter. \"My First Chemical Love: experience with GBL (ID 57584)\". Erowid.org. Oct 17, 2007. erowid.org/exp/57584",
 "substance": "GBL",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "GBL",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 57584",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 17, 2007",
   "Views: 13261",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I first started taking recreational drugs approximately a year and a half ago. Though my experiences since then have been varied and I consider them to be quite an important portion of my life, both in the area of personal development and in garnering a rich history of enjoyable memories. To date I've done enjoyed Acid, Mushrooms, MDMA, various types of speed, Blue Lotus, LSA, Cannabis, a number of research chemicals, and a few others which escape me at the moment. To date I've also never found an addictive quality to anything, save for G.</p><p>I originally started taking G when my significant other introduced me to it, it was his personal favorite and when I found you could order GBL online, my curiousity could hardly be abated! The first dose I ever took was by far the most memorable, 1ml followed by a vague, questionable lightheadedness which lead to me deciding it was likely not much fun, and hence, explainably easy to acquire. The 1ml was bumped with another 1.5 after an hour, an attempt on my part to try to assuage my disappointment with the substance thus far. Within a good 30 minutes and after a brief, hot shower I felt an intense euphoria accompanying what I like to describe as all the best parts of being drunk without the negative aspects.</p><p>GBL has always been the best alternative to drinking for me, and that I found quite important as I frequently consumed an entire bottle of 100 proof liquor in order to get sufficiently drunk at parties. Time went on and I continued ordering G, eventually reaching the point where I would dose nightly to relax and enjoy a peaceful intoxication. G was everything I ever wanted in alcohol, a cleaner, happier high that was significantly more clear-headed and pleasant without any negative side-effects the next morning. In fact, I found it quite to the contrary, I felt better after the G wore off than I did before consuming it in the first place.</p><p>As time went on I noticed my nightly G habbit had also caused me to lose a bit of weight and add muscle tone, which was impressive as I normally weigh about 155lbs anyhow at 5'9' and typically only put on a very thin layer of fat to begin with. I felt better than ever, healthy, slim, with good tone and generally happy. Things progressed however and I found myself unemployed and taking night courses, the eventuality of it turning quickly into a dose in the morning to help wake up and feel good instead of a coffee and an hour of foggy tiredness. The morning dose soon became an all morning dose, and then another in the afternoon, and more at night. The habbit escalated to constant use, and has stayed there to this date. Presently I have been high all day, every day, for about six months. It was originally not a problem in my opinion, until just recently.</p><p>G has a very interesting way of turning on you, I've noticed. I still find it very pleasurable, however I have noticed that now, when I am between doses, I experience an increased heart rate which is fairly uncomfortable and I find it nearly impossible to sleep. Even as I write this, I'm awake at 5:25am after 2 hours of sleep which were promptly interrupted as the G left my system, with a glass of coke and GBL resting beside my keyboard.</p><p>It is not my intent to demonize G in any way, quite the contrary. I would like to warn anyone who is a frequent recreational user than tollerance and addiction are possible with G, however they are not necessarily as big of a problem as with many other drugs. I myself am tapering my usage lately with very mild discomfort, slowing down my consumption in order to achieve a nightly routine again rather than a constant dosage. My advice is to avoid taking it a contant basis as it leads to a somewhat messy dependancy which is troublesome to ween off of.</p><p>I would however, like to go into further detail about what I feel are the shining aspects of G, and the reason that I don't imagine I'll ever cease consumption at least on some level. G has a certain wonderful social quality, reducing inhibitions and stress to a significant level. I find it increadibly useful as I am presently employed in sales, and intoxication seems to increase my closing average by a considerable amount. Work is also, as you may imagine, far more entertaining while high.</p><p>G appears to have far more health benefits and far less health problems associated with it than the consumption of almighty Alcohol, the psychoactive of course for the US government. Personally, I reguard alcohol as a dirty, painful experience after my habbitual use of G, a last resort I am perhaps considering to produce depressant effects in order to calm myself during the G-withdrawl. G is also perhaps the best sleep aid in existance. It works fabulously to that end, sleep is uninterrupted and even a brief nap can be considerably more refreshing than without it.</p><p>An overdose of G, I have found from repeated personal experience, even up to consuming 10ml of pure GBL over the course of an hour, is extremely mild in comparison with many other drugs, a few hours of rest and I will usually just wake up and feel alright again. I have also found that G is a fantastic substance which lends it's wonderful qualities to most any other drug in good combination, though I don't recommend it with any manner of speed as it tends to negate the effects of amphetamines, being an extremely powerful depressant. Perhaps one of the other increadible values one can attribute to G is certainly it's ability to minimize after-effects from other substances, most noteably E. The post-E depression and general lethargy and nastiness can be abated by dosing with G I've found, making it quite useful if one is forced to do anything of importance the day after a particularly hard roll. </p><p>Overall, I value my experience with G very highly, and while I am slightly dependant on it at present, I still don't believe I can condemn the substance rather than my own gross abuse of it as of late.</p>"
}
