{
 "title": "Massive Dose and Synesthesia",
 "author": "RealityGone",
 "citation": "   RealityGone. \"Massive Dose and Synesthesia: experience with Phenytoin (ID 57606)\". Erowid.org. Nov 19, 2007. erowid.org/exp/57606",
 "substance": "Phenytoin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1000 mg",
   "oral",
   "Pharms - Phenytoin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 57606",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2007",
   "Views: 9107",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I used to have access to quite a bit of Dilantin because my father suffered from seizures but didn't take his medication like he should (mainly because of its interaction with alcohol). But, anyway, when I would run out of weed and anything else and I realllly wanted to get high I wound up taking very large doses of Dilantin (Varying from perhaps 600 up to 1500mg It's been awhile it is hard to remember).</p><p>The effects of this drug were very strange and my memory is kind of hazy. </p><p>The most startling effect that I remember was an indescribable connection between sounds and feeling. I suppose this is synesthesia, but I haven't read anything about that side-effect in any of the PDR copies I've found on the web. But I remember it being extremely pronounced for the first 36-48 hours after ingesting the drugs. The effects would slowly wear off over the course of a few days.</p><p>The initial effects are sleepiness, mild confusion (I remember feeling extremely fuzzy headed, it was hard to think clearly), and loss of coordination. The auditory/sensory effects would kick in a little while later, but they would last much longer than the other effects. While the experience wasn't very pleasant (sometimes the synesthesia was kind of unnerving) I tried it a few times. I don't recommend it at all for recreational use, and I didn't notice any cognitive improvements.</p>"
}
