{
 "title": "We Are All Just Human, That is What We Are",
 "author": "Sage Apprentice",
 "citation": "   Sage Apprentice. \"We Are All Just Human, That is What We Are: experience with Salvia divinorum (ID 5761)\". Erowid.org. Jan 31, 2002. erowid.org/exp/5761",
 "substance": "Salvia divinorum",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 5761",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 31, 2002",
   "Views: 11404",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI will have to say that Salvia Divinorum has provided me with quite an experience in conscious awareness. Not quite LSD, not quite marijuana, but rather in a no-name category. <br>I recall taking the first hit from a bong I had. As I lit it up, I began to observe the smoke fill up the chamber. A few seconds afterwards I became entranced with the movement of the smoke and I held it in for a couple of seconds. The next few moments that followed were one of the most perplexing moments I had ever experienced. <br>I do not recall exhaling the smoke because I was in a trance, I kept observing everything around me and I didnt know what anything was. It felt as if I was looking at everything for the first time with no previous knowledge or memory of what anything was. As I looked at my bong and held it in my hands I was cofused because I wasn't sure what this device was, but then I felt as if I was becoming that bong. As this strange phenomenon took place I tried to make sense of it's use. The more I tried, little by litle I began to remember what it's use was. Then I saw an image of myself smoking from this bong and began to question myself and my use of this bong. I saw myself smoking and blowing out smoke. Then I asked myself similar to how a child would ask, 'why?'. I could not provide a logical answer, I knew I smoked to get high, yet at that moment, getting high made no sense; it didnt have a point. Then I started to observe my human nature and I was just simply amazed at this nature that I was part of. <br>I closed my eyes and I really didnt see any spectacular imagery, however there was a constant chant going on in my head...'We are all just human, and that is what we are...' this thought both amazed and shocked me at such a profound level. I was so amazed that even after I was straight, I had to sit down and contemplate what had just happened. <br>The Salvia Divinorum plant has shown me the beauty of our humanity. It has shown me that simply being a human is a wonderful thing. Money, Power, greed, and Fame are transient elements that tend to distort the mind from what beauty really is. What is beauty? Humanity is. It's beautiful because we are all just human, and that is what we are...\n\n\n"
}
