{
 "title": "A Ket's eye view of Britain",
 "author": "Mr H",
 "citation": "   Mr H. \"A Ket's eye view of Britain: experience with Ketamine & Ecstasy (ID 5762)\". Erowid.org. Feb 1, 2002. erowid.org/exp/5762",
 "substance": "Ketamine & Ecstasy",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 3:30",
   "500 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5762",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 1, 2002",
   "Views: 26707",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me begin by saying that drugs in Britain are a bit different. Here we buy Ket in 1g wraps which is usually prepared by boiling liquid ket with Glucose. It's usually quite clean and not cut with speed or anything else. The cost is standardised and just about anywhere in the UK a gram of Ket will cost you 30 pounds (dunno what that is in USD.)</p><p>After a mad nights clubbing where I'd done 5 pills we went back to my friends house for one massive K-Sesh. Most of my mates are pretty experienced and I've been doing drugs for about 2 years, but I'd only been doing ket for a couple of months.</p><p>The location was perfect for a massive dosage; everybody was loved-up from a good night out so the feeling was warm and friendly.  We had quite a big front room so we put some quiet music on and got down to business. Someone brought glasses of orange juice and tea but I declined cos I tend to chuck on Ket. This guy I hardly knew just said 'Hi, I'm John, here, have a pill.' So I had one of his pills (brown-speckled mitzy) and waited to peak on it before doing some ket. </p><p>After a couple of lines I sorta felt invincible (a common feeling on Ket I'm told) so I challenged my mate Mr R. to a ket-race. This was fucking stupid but I wanted to and so did he, so fuck the rest of the world. Anyway the floor was pine slats, so I got an entire G (yes, 1 gram) and made a line about 36-40' in length on the floor. It looked seriously bad. Anyway Mr. R started at one end I started at the other. 20 seconds later I had snorted the entire half and Mr R was not far behind.</p><p>There was no warning; suddenly I was propelled into the biggest KHole I have ever experienced. No fuck it, It was a K-Abyss. The entire room and all my friends dissolved and I felt alone. I rememeber my KTrip quite well if you let me I'll tell you about it.</p><p>The first thing I saw was that I was standing on a small platform suspended above a complete nothingless. then I saw an image of the room kinda floating (try to imagine big cinema screen floating in thin air) Then I heard this really horrible sound (and this I shit u not) and these big robot arms came out of no where and starting ripping it up and tearing it to shreads and then it shattered like a piece of glass. Er, this was the point i thought 'Oh fuck, I'm gonna die now'</p><p>The only feeling I got was one of sheer terror. Here I was stuck in my own personal hell with no-one for company. </p><p>The rest is sketchy but I certainly remeber hallucinating my own death. Basically I started to fall deeper and deeper into nothingless (kinda like that bit on 'Bill'n'Teds bogus journey' when they fall into hell but a hell of a lot worse) and then I hit something hard and I saw myself impaled on this great big steel spike that just appeared out of nowhere. There was blood everywhere. I was screaming in both my trip and in the real world (so my friends tell me)</p><p>The trip lasted about 2 hours and when I came to the whole room was just spinning uncontrollably. I felt sick, weak and very upset.</p><p>I don't rememeber the rest. I still sometimes get flashbacks. Although I continue to pill, I've never touched Ket again.</p><p>Yours,</p><p>Mr H</p>"
}
