{
 "title": "What a Nightmare",
 "author": "Lost in Time",
 "citation": "   Lost in Time. \"What a Nightmare: experience with 5-MeO-AMT (ID 57636)\". Erowid.org. Nov 28, 2006. erowid.org/exp/57636",
 "substance": "5-MeO-AMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 57636",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2006",
   "Views: 13461",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Throughout my life I have had the opportunity to try many different psychoactive substances, ranging from LSD to speed to Salvia, and none have completely destroyed my ability to put together cognitive thought and function as badly as an unmeasured dose of 5-MeO-AMT did one night in mid-December 05.</p><p>I had trifled with the brown substance before as I had managed to acquire some for myself, and for my previous experience I measured out 4mg and took only this dose. I experienced a mild discomfort that was expected from previous flirts with substances, and experienced mild geometric hallucinations effects that lasted for 3-4 hours. Comedown was not insightful. I was a little disappointed, and re-considered the low dosage. I made a mistake feeling this way about it.</p><p>The next and last time I tried 5-MeO-AMT, instead of measuring a dose, I licked my finger and put it in the brown powder, then ingesting the substance at about nine-o-clock at night.</p><p>About an hour later I felt a very strong boost in energy and was very interested in where the trip would lead. Brightness of light and color begins to get exaggerated, and I could almost describe it as saturated, and I still think that I am going to feel 'good'.</p><p>One of the neighbors stops by with a very small amount of marijuana and becomes interested in what kind of substance I have obviously taken. After some sort of discussion about it while watching tv, my neighbor has a fingertip worth of 5-meo-amt in his mouth. </p><p>After a small toke that relieved some nausea I was feeling, I became aware that this substance was very powerful, but I still did not see the danger that lied ahead, and my neighbor managed to convince me that we should do another dose. So we both eat another fingertip covered in 5-meo-amt.</p><p>The incredible feeling of increased energy is beginning to become more of a deep change in the ability to think properly, I also had a strange feeling of discomfort in my skin. Hallucinations are geometric, but the dominant overcoming effect is the increased brightness of light and saturation of color, and a slight illusion of the walls in the room shifting. No pretty rainbow edges like 2C-*. My neighbor begins to act strangely and leaves. I attempt to relax and enjoy myself but I am becoming more and more aware that the substance is not only having a psychoactive effect on me, but is affecting my cognitive ability, and I started finding myself in a horrible dream-world where it takes minutes to remember even who I am and what is going on. I had begin to vomit. The mild visuals that I experienced earlier had become more intense than anything I have ever been through in my entire life. I was laying on the bathroom floor and watching the marble pattern linoleum make the most horrible warped images I have ever seen in my life. The visuals were overwhelming. I smoked Salvia once in a bong, and this is the only state I can compare it to, but I could not stop what was happening to me. Time was dissolving along with my world and mere moments were turning into an eternity of agony.  Through demented and labored thought processes I could tell that I was in alot of trouble, and also remember noticing that my breathing was labored.</p><p>I tried to lay in bed and wait for an end to the madness, but the effects seem to gain intensity. An hour or two feels like an eternity of senile, demented thought. Everything that has importance to me in my life was dissolved right in front of me. I do not care about anything. I saw terrible moments of traumatic events in my life happen right in front of me. I miss my family and feel a terrible sense of guilt as they become the only thing my mind can find importance in. I become gravely aware of how frail reality and the human psyche is, and though I cannot remember much of the dementia I suffered through, I remember believing I was suffering symptoms of brain-death, and thinking I knew what death might feel like. I felt I was not hallucinating, I felt like I was dying. I would suffer uncontrolled writhing in bed, and I would occasionally wake up and see a strobe-light effect in the room for a few moments. I was suffering sound hallucinations, and I felt itchy all over.</p><p>I woke up about eleven in the morning, and I still felt a lot of the same effects from the night before, and I wonder if I will ever be the same person again. I still am not interested in many of the things my life involved. I stay awake for about two hours, try to eat something, and I notice my tongue cannot taste properly where I had the 5-MeO-AMT on it. Everything tastes like a 9-volt battery, without the shock. I go back to sleep.</p><p>I woke up the next day, and I feel more confident that I will be able to get myself together again. A time goes by where I still cannot find the happiness in a lot of things, and question whether I am even the same person I was before this happened. My neighbor relapsed on crack cocaine after taking the 5-MeO-AMT with me, and has told me that when on the 5-MeO-AMT t his vision was in black and white, and that color would fade in and out for a while. I do not remember this effect, except maybe the white strobe light symptom when I would wake up. I think I may have ingested more than my neighbor.</p><p>Now, I generally feel like I have completely recovered from what happened to my spirit during this experience, and I would not wish what happened to me on anyone else. I sympathize deeply for the reported death(s) on this substance, it is disturbing for me to think about.</p>"
}
