{
 "title": "It is What it is",
 "author": "Koey loon",
 "citation": "   Koey loon. \"It is What it is: experience with 2C-I (ID 57644)\". Erowid.org. Mar 10, 2008. erowid.org/exp/57644",
 "substance": "2C-I",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "2C-I",
   " ",
   "1 repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57644",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 10, 2008",
   "Views: 2584",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDoug had obtained two doses of 2c-i from a friend. They were free because Doug and I's opinion of drugs are highly respected in our circles. We have eaten a lot of acid and mushrooms and well...almost every drug. Except for peyote, salvia, and DMT. These free capsules were for us to 'test drive' the 2c-i and tell other people about it. Doug dosed around 8:00 p.m. at his house. He finally made his way to my house around 10:00 p.m. Upon arriving he said he wished that he would have let me pick him up. So I'm not sure driving on it is a good idea. Although he made it. Take it as you will. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]<br>Doug gave me my dose and told me these were stronger than the other doses the kid had. So I ate it. I feel I need to say that neither Doug or I had eaten any food all day as to prepare for our new drug experience. We had both read online that eating before it could upset your stomach. Neither of us had an upset stomach, and I feel I could have eaten food prior to dosing and not have had an upset stomach. Again...take that as you will. The 2c-i took about 45 minutes to kick in. It felt like an acid buzz...just a little speedier. <br>I asked Doug if he wanted to smoke a bowl and he passed on it. Said something about 'it' being to much. Whatever that means. So we chilled in my room. Played some NES, listened to music...bullshitted. My buzz is building. Colors are everywhere. Blues, reds, purples, greens, yellows, oranges....everywhere. The lights were also nice and smooth. Brighter. More alive. Then...ZANG! 2c-i hits me all of a sudden. It's just a buzz and some colors..then...BOOM. Lights, accents, colors. Very speedy. <br>Now...it haden't sunk in fully. It was still coming up to me. How would I know? So...Doug and I decided to smoke a bowl. I packed some nice outdoors. Wonderful weed. Tasty, tri-chromie goodness. So we smoked a bowl in my room. (Parents were upstairs. Makes any drug a little more edgier.) We finished our bowl and Doug asked to smoke another. I concured. What the hell? That's beaster. That asshole gave me two different types of pot. Not a good thing to realize when your expecting the sweet taste of outdoor...then get the harsh...lung clogging beasters. But regaurdless...we smoked it. <br>It was after this that I realized the pot made the 2c-i to intense. So that's why Doug didn't want to smoke when he got here. He was still in his intense part. It had just hit me. All I could do was sit on the edge of my bed and ride it out. There were also very nice closed eye visuals. Geometeric anythings going in and out of each other. Crazy colors. If only they made noise. The buzz was to speedy to keep my eyes closed for to long. I feel I should have enjoyed them a little bit more. Finally...I feel the high come down. It's off the peak. Now I can relax. <br>The rest of the time we spent just...talking and not really doing anything. Just being fucked up. The 2c-i lasted for about 6 to 7 hours. We smoked pot thoughout the night.  There were also some mushroomish visuals...my ceiling was like water. But I would not call this tripping. This is just being fucked up in style. What it lacks? The mystical experience. This seems to be a drug that just gets me high. Having an enlightening expierence seems to be very unlikely.\n\n\n"
}
