{
 "title": "Alien Contact",
 "author": "Plasmomorphing",
 "citation": "   Plasmomorphing. \"Alien Contact: experience with Mushrooms (ID 57669)\". Erowid.org. Sep 24, 2008. erowid.org/exp/57669",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 57669",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 24, 2008",
   "Views: 9697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Being an experienced explorer of the psychedelic realms, this night proved to be one of the stranger ones that I have experienced. I wont go into what happened during the day before the trip in detail, but it seems that mushrooms were the focus of the days investigation. My dear friend who is also a shamanic initiate (well call him Merc) introduced me to a man that night, a shaman, who possesses secret knowledge, proof about the connection of the mushroom and Jesus Christ. Proof of secrets that the Christian church has been hiding, and the real truth about the sacred sacrament proposed by Christ. As this information is totally secret and I am afraid if I release too much the man Im talking about might be in danger, Ill let you figure it out on your own. It involves ancient paintings of Jesus Christ depicted with the mushrooms as the sacrament. Anyway, after hours of hearing the man speak it was time to go home. We knew what had to be done. </p><p>So three of us, young shamanic initiates, left the old shamans home and drove to Mercs keep for a night venture into the unexpected. It was a basement apartment, or more so like a large open space room with red walls, candles lit, comfortable seating, beanbags on the floor, a bed, and a coffee table. The room, even before taking the Sacred Mushrooms, had a psychedelic aura, a sense of heightened energy. A sacred vibe was radiating through us. </p><p>Now convinced and proved to that the mushroom is a key to the Divine knowledge (something I knew intuitively already) and that even some of the most corrupted of religions, such as Christianity, falls back on a legacy of keeping this information a secret, we began our sacrament in a more sacred fashion than simple ingesting. We decided to enchant the Mushrooms with a short prayer and a moment of silence. I conducted the prayer that went something like, Lets thank the Divine for letting us partake on this journey with the Mushroom. Please, guard our spirits from negative and evil powers and let us journey safely outside the limits of everyday perception. The mushrooms were ground and mixed with sesame and honey as Merc had prepared them about 2 months ago, and were sitting in the fridge for the time. We all thought it would have been better to just eat the Mushrooms plain, as the mass was too sweet from too much honey. Nevertheless, we all ate 3 to 3.5 grams each. </p><p>After about half an hour the mushrooms started to kick in. It was a relatively pleasant ascent, with no major stomach and body discomfort. As usual, lights became brighter, and the tapestry of the air in the room started to become more visible, undulating softly. Merc and our other friend were having a philosophical conversation reflecting on the Mysteries that have been revealed to us through the shaman earlier that day. The amount of information that was presented to us was absolutely unbelievable and totally astounding. Sometimes I joined the discussion, but was more trying to focus on the onset of the trip.</p><p>Within an hour we were all full on into the psychedelic journey. At this time I became uneasy about the music that was being played on the stereo. The house music was just simply not compatible with the mushrooms as it lacked the sophistication and otherness and while it didnt bother Merc too much I asked if it was ok to change the flavor and they were ok with that. So I put it on Deja-vu Fabrique album compiled by Zolod. For those who dont know, it is psychedelic trance. As soon as the disc was changed, the consciousness in the room elevated to the next level. As the initial sounds of the first track spread through the air through the speakers, it synchronized with the vibe perfectly and calmed my fatigue. My two friends were blown away as soon as the CD started playing. Merc exclaimed, WOW, This is totally Amazing!! Who is this?? Our other friend, who wasnt very familiar with psytrance couldnt believe what he was hearing. In other words, the music guided our trip and grounded our spirits, melting away all negative feelings of fatigue and nausea, letting us transcend effortlessly into the Divine realms.</p><p>As I laid there on the bed, with my eyes closed I was being shown beautiful fluorescent worlds, of different hues like reds, blues, purples and yellows. The imagery was mostly lined which formed amazing psychedelic visions. I couldnt believe the amount of visions I was getting. So strange and alien they were. I could tell I was seeing glimpses into possibly another dimension. The forms were always changing in imagery and colors. They were absolutely beautiful and felt very Sacred. This felt like total liberation for the spirit and it made me grin the whole time. I felt very grateful and thankful of the mushroom for letting me see into other realms of the universe. We rolled a couple joints that night of potent cannabis that we passed around and smoked.</p><p>About two and a half hours into our journey, I realized something very strange and startling. Merc and our other friend were having a conversation with one another in the corner of the room. As I was sitting comfortably on the bed, I had noticed that besides my two friends and I, we werent alone. I noticed three bodies or silhouettes doing something to me, or my head. Now let me explain in detail how these beings came across. I have had many psychedelic experiences of contacting alien beings from other dimensions but all of the beings I have encountered before had a physicality to them. That they were made of physical bodies. These three beings however, didnt have a physical body. Instead, they were made of a fluidlike ethereal shadow that diffused in and out of sight within the holographic nature of empty space. It seemed as if what I was seeing was their spirit bodies and their physical bodies were possibly somewhere else in the universe. Although they lacked physicality I could still make out of soft edges of what theyre bodies looked like. They were not spirits from this world but definitely alien.</p><p>As they inspected me and conversed among each other telepathically, I can see that I was the focus of their attention. Sometimes I could see their spirit bodies encode the shape of their physical bodies in soft flashes that came in and out of perception. They were tall and insect like, with thin and long arms. Although I stress, that most of the time they were there, their physical appearance wasnt definite, as their energy was like a holographic liquid. These beings were extremely sophisticated and operated on a way higher level than our own. I could see that out of the three one of them was a leader, and it was the leader who was doing something to my brain. It was kind of frightening, but I let it do what it was doing. The other 2 were discussing something in telepathy and I knew they were talking about me. Just didnt know exactly what. I noticed also that I could see them with my eyes opened and closed but to operate on their level of existence I had to use my third eye to fully visualize what was happening. After letting these aliens do something to my brain, the leader of them stepped back from my head and the three of them were staring into me or at me and talking amongst each other, I interrupted my friends conversation and said, Guys, we have visitors.</p><p>Merc jumped up and sprung to me with an ear-to-ear smile, What do you mean? he asked.</p><p>I mean there are aliens here in this room right now and they were operating and doing something to my head. When he heard that, he was like No way! Are you serious?? and started laughing really loud. The alien spirits then looked at him, looked at me, looked at each other, and in an instant like wind trailed out of my perception and disappeared. It seemed they didnt like the vibe of Mercs laugh. That maybe his laugh gave a sense of a slight disbelief. I got a feeling that were like This guy laughing doesnt know anything. </p><p>It was an alien encounter like no other and Im still, after about a month after in awe of what actually happened. These things were definitely separate from my imagination. They moved at their own will and possessed knowledge that is way ahead of our own. I am also certain that I am not the only person that has experienced these kinds of aliens as their attention was very much focused on the human agenda. But what were they doing to my brain? As a psychedelic visual artist, I had the feeling of being selected. That they chose me and not my friends to perform their studies on. I would love to hear other people who have experienced these same beings.</p>"
}
