{
 "title": "The Concept of Anything Negative Disappeared",
 "author": "Chris N.",
 "citation": "   Chris N.. \"The Concept of Anything Negative Disappeared: experience with Mushrooms - P. cubensis & Cannabis (ID 57697)\". Erowid.org. Sep 8, 2007. erowid.org/exp/57697",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 3:05",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57697",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2007",
   "Views: 2416",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was a very spontaneous decision. It was Monday and I remembered Adam telling me that shipments arrived every Monday. I didn't ask who the middleman was, I just gave him the money and let him deal with it. After doing all of my classwork in preparation, I called Adam the next day to pick them up. To my chagrin, I found out he had gotten a job and wouldn't be back until about 10PM, delaying my expected start time. I headed over to his dorm around then and picked them up. He and another guy told me that these were not your average shrooms.<br>Apparently they were a special strain grown only in Georgia, and this was the last of this year's crop because it was natural. Apparently they had so much psilocybin they turned black during the drying process due to oxidation of the psilocybin. I'm not sure how fully I believed all of this because I'm sure that the dealer was just trying to make his shrooms sound better, but I did know from other friends' experiences that these were definitely stronger than your average Cubensis mushrooms. I was instructed that it would be a bad idea to eat the entire eighth due to their strength. I thought very hard about this on the way back to my dorm.<br>Upon returning, I informed my friend from another college online that I finally attained shrooms. He proceeded to yell (rather, type in all caps at me) to eat them for the next five minutes, so at about 10:10 PM I ate the entire eighth, partially because I was sick of having psychadelic experiences fail. Five minutes later, I took a pepto because I had had some stomach pain earlier that day.<br>[T + 0:20] I was feeling a mix of tired, dizzy, uneasy, and anticipatory. I definitely wasn't caught up on sleep, so not all of this could be explained by the shrooms, but I was definitely feeling unusual at this point.<br>[T + 0:30] I left to take a shower. By the time I got in the stall, the visuals had begun. The first thing I distinctly remember is the bumpy texture of the wall of the shower stall forming into various demonic faces. I began to get lots of random visual patterns, amplified when I closed my eyes. Another thing I distinctly remember was looking up and having the entire stall turn a brighter beige, and looking down and having the stall turn more orangish. The stall became very claustrophobic, and I left after another 20 minutes.<br>[T + 0:55] I returned to my room and felt a bit better, being in a somewhat open space. I went back to my computer and put on Pink Floyd's album Wish You Were Here, specifically the song Shine On You Crazy Diamond. I resumed talking to my friend, and he asked me what I was seeing. After saying vague things such as 'fast changing detailed stuff' and 'fractal patterns,' he recommended I look at my hand and I would see morphing and twisting patterns. I looked at my hand and it appeared as if the skin on some fingers was moving in, and on some fingers moving out. I finally was able to describe some of the crazy patterns I was seeing: blue, red, and green stars and ribbons that wrapped around each other, then a purple rectangle appearing around them. My hair, still wet from the shower, fell in front of my eyes and looked incredibly cool.<br>At this point I had the intense urge to get everything done, although I wasn't sure what there was I needed to accomplish. Upon glancing at my left arm, it looked as if it was not connected to my body because I had a blanket covering my upper arm area. I also kept reading random stuff about shrooms online this entire time. I became very confused because I saw different times listed under 'onset' and 'coming up.' For a good 30 seconds, I could not understand the difference in definition between the two terms, but after thinking long and hard I remembered what they meant.<br>I had been sick with a respiratory infection at the time, but I noticed that since taking the shrooms, I had not had to cough at all. This would unfortunately return after I came down from the shrooms. The downside of the shrooms was a very weird feeling in my mouth and head that I cannot really explain. This would cause me to be worried for a lot of the trip, especially during the intense moments, that I needed to vomit, even though I knew it was probably not true. Luckily this worry would soon become unimportant.<br>[T + 1:05] I was seeing pretty good visuals, but when I closed my eyes they were even better. At the moment I was seeing dark green and dark purple shapes and curvy lines with white outlines. I proceeded to tell my friend that we should do shrooms together, but next time I wanted to do a lot less because so far it was too intense. He told me I would change my mind after the trip but I didn't believe him.<br>[T + 1:15] My roommate, Joe, and some random girl he talks to about his problems entered the room. I was dreading my roommate's return because he's annoying and is the kind of guy that would try to mess with you when you're on drugs. Luckily he seemed too preoccupied with his immature emotional problems to worry about me. I continued talking to my friend online, and noticed that if I didn't focus on my roommate's speech, it sounded foreign.<br>[T + 1:25] My online friend left to watch a movie, but encouraged me to continue leaving him messages. I did, leaving him about five messages a minute for the next 20 minutes, which seemed to last a lot longer. During this time, I turned on the visualizer in Winamp, which is trippy to watch even while not under the influence of anything. I was convinced that if I wasn't in that exact situation (lying on my bed, listening to Pink Floyd, typing my thoughts in a chat box) that I would go insane. My roommate's friend left 20 minutes later, and said bye to me on the way out. This took a while for me to realize, and I concluded that human interaction would probably not be good for me then.<br>[T + 1:50] I began talking to my roommate instead. Normally I don't like talking to him, but I enjoyed it at that moment, so you can tell I was messed up. I knew my friends Casey and Matt were probably smoking and planned on checking on me at some point during the night, but I did not want them to enter the room because I felt that the current situation was best for me and was afraid of any change.<br>[T + 2:20] Casey and Matt do come by, and I do not mind so much, in fact I enjoy talking to them as well. At this point my roommate finds out that I am on shrooms, and says he knew that I was on something and decided not to ask. I was thankful for this. Me, Casey, Matt, and my roommate talk for a while. Casey and Matt are surprised I'm lying on my bed doing nothing because they expected I would want to explore things and walk around. They actually say I appear fairly sober, that most people on shrooms giggle a lot, act confused, and look a lot less normal. Well I certainly felt like I was tripping.<br>As the time passed, I became more and more happy. My happiness was very contagious, Casey, Matt, and Joe were catching my buzz to an extent. We decided that we would smoke a little bit of everyone's marijuana, and Joe asked if he could join. I convinced Casey and Matt to let him, because on shrooms everyone seemed a lot more human to me. Everyone seemed a lot more indecisive during my trip, and also time seemed to move a lot slower.<br>We eventually went to Casey's room to prepare to smoke, but end up staying there probably 30 minutes while we talk about stuff and roll two joints. Apparently although I felt Joe was much more of a person, I also unintentionally entertained everyone by releasing some pent up rage with comments like 'Joe, don't you realize that your opinion is of absolutely no value in this discussion?' Unfortunately Joe did not take these comments very seriously, assuming that I was just screwed up on shrooms, although that was very very true.<br>My friends told me that I was extremely talkative at the moment, especially since I'm normally a fairly quiet person. My mind was a storm, I had millions of thoughts running through and I felt constantly as if I needed to tell everyone all of them. I was also intensely curious. I greatly enjoyed this feeling, although my visuals were diminishing so I was excited at the prospect of smoking.<br>[T + 3:05] We exited the dorm and went to the secret stairwell into the ground across from our dorm, also known as the bunker. After smoking the two joints, we returned to the dorm, my visuals somewhat renewed, and my friend was back to talk to again online. At this point I was the most happy I had ever been in my life. I did not care about anything at all. I thought about scary thoughts such as being arrested or everyone in the world dying or even committing suicide and they did not phase me. This made me realize that if someone isn't in a good psychological situation, shrooms can be very dangerous.<br>I wondered why money was important at all in this world and decided everyone should stop worrying about stuff and just do drugs. Looking at Winamp's visualizer, I saw the patterns extend outside of the window and they were present across all of the computer screen, and even all of my vision. I decided to try eating to see if it was any better than when I was on morning glory. A box of nerds tasted fine, not unusually good, but definitely not bad. I notified my friend that I thought of a cauliflour for no apparent reason, and then left to play video games with my sesh-buddies.<br>[T + 3:30] On the way I stopped to talk to my friends Kyle and Robin. They were also cheered up by my contagious happiness, or so I assumed due to my europhic intoxication. Robin tried to convince me that I wanted her to cut my hair. That was a dick move on her part, but I was smart enough to know I didn't want that, even when she presented me with scissors. I explained to them my shroom-induced views on the world, and then left to play Smash Brothers and Perfect Dark. I was pretty bad at Smash but I at least got a few kills. On the other hand, I was completely incompetent at Perfect Dark, and could not manage a single kill. The map confused the hell out of me.<br>[T + 4:30] I returned to my room, and was definitely coming down. I was still listening to Pink Floyd's Wish You Were Here (album) and it was not boring at all, but I decided to try something else. I was very indecisive, and decided to look for something that was full of a variety of sound. I tried DragonForce's Fury of the Storm, but it was not as satisying as I had hoped. I eventually went to my girlfriend's room to go to sleep, and slid into bed with her as my world became fairly normal again.<br>Writing this summary almost two weeks later, I greatly appreciate my experience with shrooms, and I am very excited to do them again. I would not deny this dosage to try again, although I doubt I will be able to get shrooms as strong as this very often, and for money reasons I don't think I'll every buy more than an eighth. Now that I have tripped, I realize that while the comeup is intense, it is well worth the ride. <br>Also, next time I do shrooms, I will not be so impatient that I can't wait a week or two for someone else to do it with me. I imagine the experience will be enhanced, and have a comeup that is easier to endure, if I have someone to share the experience with. I was surprised at the euphoric feelings I had during the trip and I cannot wait to feel them again. I literally could not understand what something bad was, or how someone could have a bad trip on shrooms. Another observation I didn't fit in anywhere is that processes such as breathing were very automatic, I could not even hold my breath at some points, my body would breathe without me trying or wanting it to. That's about all I can remember now, so until next time, be it shrooms, acid, salvia, or something else entirely new and special.\n\n\n"
}
