{
 "title": "So That's What Happens",
 "author": "Neight",
 "citation": "   Neight. \"So That's What Happens: experience with MAOI & Cannabis (ID 5774)\". Erowid.org. Jan 31, 2002. erowid.org/exp/5774",
 "substance": "MAOI & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Syrian Rue",
   "(capsule)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5774",
   "Male",
   " ",
   "Not Given",
   "Jan 31, 2002",
   "Views: 32024",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSurprisingly, I've only found one report of combining MAOI's with pot, so I felt it deserved some backing.  3-4 grams of ground harmala were ingested in 15 capsules, I poked holes in the capsules to make them dissolve faster.  The harmala effects were felt within the hour and two hours after taking it I sat down in my basement to smoke a bowl.  I finished one bowl of shwag, decent shwag, but still shwag.  I returned to my position on the couch feeling higher that usual for one bowl but other than that nothing.  </p><p>Then I glanced towards my steps and caught trails off the rims of my glasses.  I couldn't believe I was getting trails off weed, whenever I would blink, the room would strobe like when you turn on a fluroscent light, slowly regaining continuity.  I finished another bowl and sat down again.  I shut off the TV and all the lights and sat with my eyes closed in the darkness.  I seemed to have two very distinct channels of thought.  One was philosophising and the other was analyzing that channel like it was completely detached.  The two seemed to be interchanging the same ideas and looking at them from entirely different perspectives!  </p><p>Possible futures of myself depending on different personalities I portray were understood very quickly and clearly.  It was like looking at 'myself' through the eyes of another oddly sober person, and all off of regular weed!  Turning inside yourself is very easy with this combo, it is a genuinely intraspective experience.  I want to try eating some pot with the harmala to see if the delta 11(a product of the metabolism of THC instead of the smoked delta 9) will have any unusual effects.  I am very sensitive to the psychedelic effects of drugs (or when I'm sober) and cannot guarantee you a simliar experience but just know that MAOI's combined with weed were definitely effective for me.</p>"
}
