{
 "title": "Interesting Experience & Hospital",
 "author": "Uiosmorpheou",
 "citation": "   Uiosmorpheou. \"Interesting Experience & Hospital: experience with Lorezapem (ID 57748)\". Erowid.org. Mar 29, 2007. erowid.org/exp/57748",
 "substance": "Lorezapem",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "5.5 mg",
   "insufflated",
   "Pharms - Lorazepam",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 57748",
   "Male",
   " ",
   "Not Given",
   "Mar 29, 2007",
   "Views: 103516",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Timeline:</p><p>dosing 2 pm  5 pm spread out evenly over this time frame.</p><p>sleep at 12 am</p><p>I was prescribed lorazepam (Ativan) by my psychiatrist to use in quelling incipient rages. I was not instructed to take it daily but rather as needed. Being in a depressed world weary though not specifically suicidal state and without other drugs handy and curious on the effects of higher dose lorazepam I self administered greater than the recommended dose of 0.5 mg. The preparation was sublingual so not an *HCl salt. Having used one 0.5 mg tab in its intended way, beded beneath the tongue, I proceeded to insuflate the remaining 5.0 mg over the course of 2 to 3 (or possibly 4) hours.</p><p>Insulfation of lorazepam entailed little or no pain for me. Maybe it has something of a local anesthetic effect? Sandwiched each tab between two index cards and ground it agianst the table with a coffee mug. This prevented loss of the material while it was being pulverized. Insuflated through the traditional ten dollar bill. Cotton based currency paper seems to roll into a tube more facilely than an index card.</p><p>Did not feel a rush of pleasure like amphetamine or even espresso after each snorted dose, rather it was like a wave of instant inebriation. Waves of drunkeness. However, I felt remarkably clear minded, just calmer and slower than usual through out the experience. It seemed as if the whole world moved slower.</p><p>Midway through (around 2.0 mg) I went for a drive to test my impairment.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I live in a quite rural area and it was a week day so did not expect or find much traffic. I had no problem with staying on the road but my interpretation of spatial depth was lessened. In this vein rounding a turn I came upon a white pickup in front driving slower and breaked late which resulted in coming too near his rear end for his comfort but no collision.</p><p>Around this point I noticed moderate ataxia navigating stairs but was not visibly intoxicated to other inhabitants of the house.</p><p>Around 2.5 mg to 3.0 mg inspection in mirror showed involuntary drooping of eyelids.</p><p>I was physiologically and functionally quite impaired at this point. But did not feel it mentally. Felt clear and calm and distant from the world. There was a maybe a little visual grainyness or visual lassitude at this point but things seemed clear and controlled for the most part. Being frustrated at the lack of experience I consumed more.</p><p>The bottle was empty by 5.5 mg. Did not feel sleepy. Things seemed alright, cool, chill, warmly dark, langorously slow, etc. Drove to my mothers house for dinner not realizing how out of it I was. Again depth fault caused me to park my car in driveway retaining wall rather than in front of.</p><p>She noticed drooping lids, and she thought it was strange how I was discussing a comic in the paper. I had trouble formulating a cover in my truth serumed condition. It came out.</p><p>Paramedics escorted to hospital in ambulance. Blood oxygenation at 77%. Suplemental oxygen corrected deficit. I was subject to the usual overdosage/possible suicide attempt procedures. Was released in a day. No antagonist was adiministered. Sinus arrythmia was observed. I do not know the seriousness of this.</p><p>On the whole this was a very enlightening experience for me. Something clicked with this and an extreme alcohol binge a day latter which energized my life batteries for several months. A rapid onset long lasting antidepressant effect. Perhaps the psychology of somewhat near death, perhaps NMDA swings. Not recommended though. No nausea. No uncontrollable urge to sleep No physical and minimal emotionally discomfort. Strangely I remember the conscious part (except for a urine sample) quite well but had hyper-real dreams while asleep that I do not remember. Unfortunately it was traumatic for my family.</p>"
}
