{
 "title": "Like Eating Booze",
 "author": "eG",
 "citation": "   eG. \"Like Eating Booze: experience with Lorazepam (Ativan) (ID 5779)\". Erowid.org. Apr 9, 2001. erowid.org/exp/5779",
 "substance": "Lorazepam (Ativan)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Lorazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 5779",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 9, 2001",
   "Views: 76180",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is an interesting and useful pharm given me by The Candyman (s I call the shrink with the almost-gone 'scrip pad). A benzodiazepine tranquilizer/sedative/anxiolytic/hypnotic drug, it is very useful for its 'legitimate' prescribed uses, and a nice 'booster' substance for recreationalists. Most often sold under the brand name Ativan in the US, the pills are small and shaped like home plate.</p><p>The standard clinical 0.5mg dose produces no noticeable physical effects. There is a slight reduction of the 'background noise' in my brain at this level, and the attainment of a calmer, more-balanced outlook. It is very subtle. A 1.0mg dose is all of these plus a slight-tho-noticeable feeling of heaviness, a drag on my movements, very much like a muscle relaxant. With 1.5mg this is more pronounced, esp. so with 2.0mg.</p><p>Above this level things don't get more interesting, but they do increase; however something about this drug prevented me from truly feeling exactly what dose I took. After ingesting perhaps 3.0mg over the course of a few hours (works nicely with cannabis) I did not really feel at all intoxicated, just sightly relaxed. However, I was stumbling about, tripping over my own feet. My body was all loosy-goosy yet I felt like I had only had a pint of stout. It was like eating alcohol, but without the spins or even really the buzz. Be careful with this substance for that reason-- you could be plastered and think you're almost straight.</p><p>Lorazepam also does something strange to the eye muscles; sweeping from side to side across the field of vision revealed a 'skippiness' to my eye movements, like they are no longer operating smoothly. As this sort of motion is also caused by high doses of alcohol and is the basis of a field sobriety test, taking any lorazepam and driving is a big risk (esp. since you could be way more sedated than you think). I have not seen this effect (yet) with bentazepam, another benzodiazepine (used in Europe but not in the US).</p><p>Taken orally a dose of lorazepam will start to kick in after an hour or so, reaching peak plasma levels in two hours, the effects wearing off after eight to ten hours. Dissolving the pill under the tongue will increase the rate of absorption, with peak plasma reached after only one hour (initial effects in 20 mins). Tolerance to lorazepam builds up very very quickly; after two days of using it most people will require that the dose be increased to attain sedative effects (though the anxiolytic effects seem immune to tolerance). Dependency and addiction is possible; if you have been on it a long time, slowly taper off your usage when quitting. Sudden withdrawals from benzos can cause delirium tremens (like alcohol) and can be fatal (unlike opiate withdrawal). This is not a drug for hard-core pill-poppers, but a useful and occasionally fun drug for the anxiety-ridden and the responsible.</p>"
}
