{
 "title": "Good While It Lasts",
 "author": "Whatevr",
 "citation": "Citation:   Whatevr. \"Good While It Lasts: experience with Lorazapam (Ativan) (ID 57834)\". Erowid.org. May 13, 2008. erowid.org/exp/57834",
 "substance": "Lorazapam (Ativan)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Lorazepam"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57834",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 13, 2008",
   "Views: 36400",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nEver since I was 12 years old I have been on some kind of anti depressant or anti anxiety medication (thanks to my mother).  To name a few, I have tried:  paxil, celexa, zoloft, cerequil, prozac, ativan, wellbutrin etc.  I always took ativan to help me go to sleep and thought it didn't do anything.  One time, to knock me out before an MRI, I was given 2 mg ativan whereas I usually took .5mg.  I started to feel a little high, and decided to try it recreationally.\r\nAt first I took 3 mg.  I felt a better high than I had ever from smoking pot.  I felt euphoric, and my entire body was tingling.  I felt completely happy and like I understood the world.  I wrote pages and pages of poetry about human nature and peace.  I was dancing to music and feeling it vibrating all around me.  I dumped a bottle of water over my head just to see if I could still feel anything (and I barely did!).  I loved it and did this for a while.\r\nThe only thing is I've developed a high tolerance.  Maybe because I'm so used to taking medication, or maybe not, but now if I even take 6mg I only get tired.  I doubt I will ever be able to feel that wonderful on the drug again.  Pretty quickly I find that I needed to keep increasing my doses, which is a huge pain.  I will be very sleepy (as it is an anti-anxiety med).  Even when I feel sober, it does stay in my system, and I sometimes appear high or 'slow' to others around me.\n\n\n"
}