{
 "title": "Talking Bugs and an Experience of a Lifetime",
 "author": "DayWalker",
 "citation": "   DayWalker. \"Talking Bugs and an Experience of a Lifetime: experience with Mushrooms (ID 57863)\". Erowid.org. Sep 19, 2009. erowid.org/exp/57863",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57863",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 19, 2009",
   "Views: 2258",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a sunny spring day in mid April of 2006. Me and 3 of my friends had been planning to do shrooms for over two weeks now. Being completely stoked for it we went up to a place we discovered called 'Snake Hill' which is 1200 acres of a biological preserve. Going at around noon after school one day, we took the shrooms at 1:00 pm. We then sat in tall green grass and watched the clouds move by as the 4 of us sat and waited for them to kick in. Although one of us was not shrooming because he was the person there too look after us, instead, he got really stoned.</p><p>After 45 minutes the stoning effect kicked in and suddenly I started laughing uncontrollably. I went and sat on top of a hill overlooking trees and grassland. My friend who was stoned came up to me and gave me my ipod to listen to. Listening to a song I had never heard before tripped me out and made me extremely happy. I played the song probably 200 times before I got sick of it. When the visuals kicked in I was still sitting on the hill and the trees started to take shape of a lion. I simply looked at it and smiled and it roared. </p><p>Being completely amazed by everything made me so happy. Being that my friends kept coming to talk to me made me frustrated because I had to keep taking out my headphones. So I decided to go on a walk. Keep in mind this place is 1200 acres. Walking down a path shaded by trees, listening to very floaty music and simply flying over the land, I felt as if I had no legs and was just hovering over the ground. Again I was extremely happy and observant of my surroundings. Trees dancing with my music and amazing visuals were going on everywhere. Suddenly the path I had been floating across opens up and turns into the most breath taking view I have ever seen in my entire life. Nirvana. Bright green grass fields with radiant purple flowers growing on them in the distance and birds flying close by me. At this point I lost all check with reality. I was in my own heaven. Everything I did went perfectly with the music, like a soundtrack to my life. The song is still on repeat. I lied down in tall green grass and just looked at the view for a good half hour. </p><p>During this half hour, I began to go deep in thought and think about things my mind could normally not handle. I thought about time and how strange it was. It is really just numbers and something to keep track of our lives. Nothing that really matters. The other thing that I thought about time was that we never have time to just simply be. We labeled everything we do on a daily basis by hours, minutes, seconds and so on. </p><p>Sitting in that same spot made me think about what else was out there, I could sit there forever if I wanted to but I forced myself to go and walk. Walking for probably 2 hours, still not checking in with my friends. I walked on a path and ended up at the cloud line on top of a mountain. It was also breathtaking. Peaceful. My heart was filled with so much joy through out this whole adventure. After walking I stumbled across a beetle, a quite large one at that. I stooped down just to admire it. It then stopped in its path and looked up at me and said The fuck you looking at? to this day I have no idea how that happened. I was so real. Speechless I stood up and walked away without saying anything. There was nothing I could say.</p><p>I then ventured out to where I saw the purple flowers. After walking for about 15 minutes through tall green grass I grew closer to the flowers and they turned out to be dead, grey, twigs on the floor. From a distance they covered all the hills and looked amazing. Being a little disappointed I turned around walked up a hill. I then sat under a tree and watched the clouds. Seeing the clouds turn into fish was amazing, it was like the ocean in the sky. Beautiful. Sitting there thinking about so many things, I went into the deepest thoughts that have changed my life completely. I couldnt even begin to describe the things I thought about on that day. I figured out my life. </p><p>After remembering my friends and finally getting sick of the song I was listening to for the past 4 fucking hours, I walked back at least 2 miles and found my friends. They were miserable. I found one bored out of his mind (the one who was stoned, well not anymore), another wrapped in a blanket going insane and just being very very uncomfortable. But the strangest of my friends was just standing there saying, Dude, are you ok dude? repeatedly. It drove us fucking mad. But apparently he was having the worst experience of his life. But I won't get into that.</p><p>Would I do it again?: give me some time, I physically cannot handle going into such deep thought again. And Im also worried my next trip will not be as good as the first and it will ruin my shrooms experiences.</p>"
}
