{
 "title": "It Goes Right Back Up My Back Down",
 "author": "J",
 "citation": "Citation:   J. \"It Goes Right Back Up My Back Down: experience with MDMA & Cannibis (ID 57904)\". Erowid.org. Sep 13, 2009. erowid.org/exp/57904",
 "substance": "MDMA & Cannibis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 57904",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 13, 2009",
   "Views: 3142",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first encounter with MDMA was on a saturday afternoon, around 5 oclock.  My friends A and R picked up three tablets from our supply, and we all met up at R's house.  \r\nWe had originally planned to take the pills that night, later on around 8 or 9.  Since it was our first time, we wanted the experience to be as safe as possible (no parents).  When R discovered that he couldn't have us stay over that night, we decided to take the pills then.  We went into R's basement and all ate our pill.\r\nI started to get pretty anxious after about 10 minutes. I hadn't really heard much about the drug, just a few friends I knew that had taken it had told me about it.  I hadn't heard anything bad about it though, so I was just excited for the effects to come on.\r\nAt about T+20min, the effects started to kick in.  I had only eaten a bagel around noon that day, so I was taking the drug on an empty stomach.  R found that the effects hit him hours later, and he had a full stomach.  So tip #1, take this drug hungry.\r\nThe first effects of the drug that I felt were a slight lightness and occasional waves of euphoria.  I was relaxed, content, and in a good mood.  \r\nA, R, and I decided to go for a walk around R's neighborhood, on bike paths and such.  At about T+30min, we were all really ancey, energetic, and just excited.  We stepped outside and began walking around. \r\nAt first, I didn't feel much different.  The heavy effects hadnt hit yet, but I knew that.  And I didn't have to wait long...\r\nT+35min: I started to feel some more intense effects.  At this point, I was more energetic than before, and I was talking a lot.  It reminded me almost of a mild cocaine experience I once had, same setting, same two people.  \r\nT+40min: Wow.  All of the effects I was feeling a short while ago just multiplied by 20.  I felt a sheer love for my two best friends. I thought about their details and the reasons I hung out with them, and I looked at it all in positive manner.  These were what my emotional effects were like.  I appreciated everything so much more, and felt like no matter who crossed my path, be it my worst enemy, I would get along with them. I would only focus on their positive traits, and I would like them no matter what they did to me in the past or at that moment.  I felt so connected to the world and it's people that it wasn't even funny.  \r\nT+45min: During our walk, A, R, and I decided to visit our highschool, which was right down the street.  Upon arrival, I looked at the building and said, 'Wow, this is where i spend 7 hours a day.  This is the reason I wake up at 6 AM every morning.  This is why I've slaved hours into the night to finish a paper or project.  This place must be important or something.'  At that time, I would've done all the math problems and english papers I had to do.  I just felt like school was good, and that in a classroom with my peers is where I belonged, and let me say, that is not my normal mindstate.  \r\nWe walked over to the track/turf field and there was a girls soccer game taking place.  On any other day, watching girls soccer would sound like a great idea, but we were so full of energy, restlessness, and dehydration that we just decided to get a gatorade each from the vending machines and leave. \r\nT+1hr: A, R, and I decided to walk to a park nearby.  There, we met up with A's ex girlfriend, and still close friend, K.  A & K shared a hug, which seemed extremely heavenly at that moment.  I was in such a good mood that I actually asked my best friend A if I could hug K as well, to which he implied.  I hugged her, and it was great.  \r\nT+1hr 30min: R's peak had just set in, finally, because of his full stomach.  He and I decided it would be cool to let A and K socialize.  So, we went to a baseball park nearby and ran laps. \r\nI don't even like running in gym class.  Track is a joke to me.  but the moment I started running across the field, it became like a whole new hobby.  I felt like I was GLIDING rather than taking steps.  Actually, I felt like I was flying.  When I ran, I couldn't even tell that I possessed legs.  Without looking down, it was as if my body was flying across a plain, like my brain power was controlling it.\r\nShortly after, I decided to jump.  Jumping was almost as fun as running, because I felt like I was jumping so much higher than I actually was. \r\nT+1hr 40min: We all decided to leave the park.  K gave A, R, and I a ride back to R's house.  When we got in the car at first, it felt weird.  When K started driving, it felt even WEIRDER.  The car seemed to accelerate very quickly.  It seemed like it was going faster than it was.  I could almost compare the car's takeoff to the start of a high drop on a rollercoaster.\r\nT+2hr 30min: After being dropped off, hanging out at R's house for a while and coming down, I had to leave.  I went and ate dinner with my dad.  I wasn't rolling anymore, that part only lasted about 2 hours, maybe less.  However, I was extremely talkative with my father, and I never am.  I was being really nice to him as well, talking to him about his girlfriend problems, meanwhile I've disliked most of his girlfriends.\r\nEcstasy is the funnest drug I've ever taken.  This report is on my first time taking E.  I liked it so much that I took one the next night as well, and then the week dragged until Thursday where I did it again, and Friday.  Four times in a week, that is my extent of ecstasy experience.  I must say, each and every one was worth it. \r\nOn my Sunday night experience, I smoked mad weed after my peak ended.  And I swear, the effects of the E went right back up.  Everything felt like I was rolling again.  It lasted a good half hour too.\r\nI think it takes a lot to build up a tolerance to E.  You'd have to take more than one in a day several days in a row.  Otherwise, doing a pill once a week or something like that will still make you roll motherfucking balls.\n\n\n"
}