{
 "title": "To Forget or Get Numb",
 "author": "nam67",
 "citation": "Citation:   nam67. \"To Forget or Get Numb: experience with Heroin (ID 57905)\". Erowid.org. Feb 19, 2009. erowid.org/exp/57905",
 "substance": "Heroin",
 "bodyweight": "168 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1967",
   "ID: 57905",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2009",
   "Views: 14663",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first experience with heroin was in Vietnam back in 6'. After one of the worst firefights that I'd ever been through, it was somewhere near the Cambodian border. I had left the base with 4 of my buddys, only came back with 1. After that I was open to absolutely anything that would take my mind off of my dead friends. So me and this guy they call Jesus (he kinda looked like Jesus, with the beard and the hair and everything) we went down to one of the shitty little villages outside of our base, and went down to this little shack, and a girl about 8 or 9 years old came out and handed Jesus some herion, he handed her some cash and we made our way back to base. \r\nThere we sat with our 2 spoons and 1 lonely candle, trying to forget. As soon as it hit my veins, I just laid back onto my bed, then gimme shelter came on my little piece of shit radio, and  then I became numb, so numb that I was not even sure that I actually existed, kinda like floating... And there I layed...the more fire fights the more heroin I shot.. Its a terrific drug to use when I want to forget everything and everyone, but what I learned from using  heroin, when I take it to forget or get numb, the pain comes back twice as hard. When I came back to the states in '70, I found that I couldnt keep up my habits, so, I started to do anything for it, robbing, stealing from people, many things that I regret to this day. Then around '72 or so I got help and kicked it by '73. So basically what I'm trying to say is that it isnt a drug to take more than once, or even once for that matter, unless you are in a practically hopeless war like I was in. I wouldnt recommend it to anyone, smoke pot or something instead, its impossible to OD on pot, but extremely easy to on heroin, by the time I left Nam in '70 over 30 people had OD'd on heroin.\n\n\n"
}