{
 "title": "My Entire Life Has Been a False Reality",
 "author": "Eckstra",
 "citation": " Eckstra. \"My Entire Life Has Been a False Reality: experience with Salvia divinorum (10x extract) (ID 57966)\". Erowid.org. Sep 8, 2009. erowid.org/exp/57966",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "57 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57966",
   "Male",
   "",
   "Not Given",
   "Sep 8, 2009",
   "2769",
   " "
  ]
 ],
 "report": "<p>Ive tried salvia once before, and just like a lot of stories Ive read, nothing happened the first time, but did the second. Before I start Id like to make it clear that everything described was imagined rather than physically seen, but it felt equally real and strong. I had my eyes shut almost all of the time, and I wasnt looking at anything.</p><p>I was alone in my room, no music, curtains drawn, no sitter. I was a little bit worried about doing it solo, especially on my first time (provided it worked this time), but looking back on it there definately was no need and I'd perfectly happily do it alone again. I loaded the bowl with as much as it would take (its quite small), lit the jet lighter up and started torching the bowl. Quickly the chamber was filled with very dense smoke, and I got a complete lungful of this smoke. I held it in and started counting to 20, 20 came and I still felt nothing, I was quite annoyed it wasnt working. I started to exhale and there was a lot more smoke left that I expected, so I stood up on my bed and opened the window. This is when I first felt something strange, but I dont think I totally noticed it. I breathed out properly, and this is when it really got me.</p><p>I found myself repeating a strange word as I fell to my bed, and as I shut my eyes everything changed. For the ten long (or so, its extremely hard to tell) seconds that it lasted, I realised that the world I had been living in, that version of reality, was entirely false. It felt exactly like when you just wake up from a dream, and realise everything youve just done never happened, nothing was real at all. I had finally been released into this black void, although it had no name, the true reality. It was an extremely satisfying feeling, absolutely everything bad and all worries were just eradicated, and all there was, was me in the void. It was all black and extremely peaceful. The feeling was so strong and true, I didnt question it for a second.</p><p>I would occasionally get random boring thoughts about things happening in the real world, but then dismissed them as part of the false reality, and they didnt even exist. Then, unfortunately, I opened my eyes. I remembered that I was on salvia, and this awakening was false itself, and it was only the salvia. It felt like a sham, but I quickly shut my eyes to carry on with the trip. I didnt want anything at all from the real world to have anything to do with me. The void was so simple and true, nothing like physical temperature for example played a part in it. I wasnt hot or cold, temperature didnt exist any more. Anything that was a normal part of the reality we actually do live in, would remind me that it was just salvia making me feel this way, and I didnt want that.</p><p>Thats what I actually felt. It was accompanied by some equally surreal visuals.</p><p>I think it must have really hit me as I was falling back onto my bed, because for the most intense part of the trip (before I realised I was tripping at all) I was falling backwards, like how it would feel if you fell onto your back from standing straight up. As I hit the floor I bounced back up, and I made lots of these bounces (Im pretty sure nothing like this actually happened in real life). It felt like I was leaving a white line trail wherever I went, and these lines formed the edges of squares. In these squares were frames from the real world, and like a book being flicked through they were scrolling from left to right. I think I was partly saying goodbye to them at this point.</p><p>Each frame was progressing with my heartbeat, which was pounding pretty hard, but it didnt feel uncomfortable. The trail I was leaving made a series of rectangles, and at the top of these rectangles there was a sort of platform made from the lines, and on the top of this platform there was a woman. She wasnt anything like how you would think of a woman in real life, she had barely any physical existence, I can remember she was made from the colour white, though, I think she had a completely white head and white hair. The rest of her was an outline. When I thought that I had been freed from the false reality, she was one of the important people in the real reality, and along with some other peers, which I never saw but knew they were there, I think they were male, she welcomed me out of the dream I had been living.</p><p>Another strange thing I saw was as this white line progressed as it scrolled from left to right along with the frames, I came to a completely white silhouette tree, against the black void. I just saw it for a few seconds, then it went away. </p><p>Anyway, after all this there was much of the same but far less intense. Very strange images and scenes, for the rest of the trip I think they were in colour rather than just pitch black and completely white, but not really very bright, vibrant colours. Nothing out of the ordinary. I slowly came down and things in the real world started to become a larger part of the trip. After what I thought was ten minutes I got off my bed to check the time and start writing everything down, I was shocked that half an hour had passed. For another half an hour after that I felt quite chilled out and relaxed.</p><p>So, to finish, Id definitely do it again, but next time I think Ill try and keep my eyes shut for the whole thing. It was really very enjoyable.</p>"
}
