{
 "title": "The Simpsons Are in My Living Room",
 "author": "PennyLane",
 "citation": "   PennyLane. \"The Simpsons Are in My Living Room: experience with Salvia divinorum (30x extract) (ID 57973)\". Erowid.org. Sep 8, 2009. erowid.org/exp/57973",
 "substance": "Salvia divinorum (30x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "57973",
   "Female",
   " ",
   "Not Given",
   "Sep 8, 2009",
   "Views: 2370",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a 24 year old female and experienced with drugs, however, Salvia is definitely a high unlike any I have encountered. I have experimented with other hallucinogens but they did not compare to the crazy trip Salvia sent me on.</p><p>After learning from our friend that Salvia was readily available at the convenience store, my friend John and I made it our mission to find some despite a snow storm. We live in an ultra-conservative city in central Ontario, so you can imagine our surprise when we were successful upon walking into our second Chinese convenience store.</p><p>We began smoking pretty much as soon as we walked in the door. John went first, opening the first of four 0.12 gram baggies we had purchased, and smoked it in the bong.  Getting the play-by-play from John began to help calm some of my uneasiness, mush-mouth, intense giggling, stuttering, but overall nothing unmanageable. Still feeling slightly unsure, I insisted my boyfriend go next. Now, he is a bit smaller than John but decided to smoke the same amount. BIG MISTAKE. To say the least, he freaked out!</p><p>After he came down, maybe 5 minutes later, I attempted to keep myself calm as I opened the third baggie knowing I was next. I packed myself a TINY bowl in my pink bong and took a DEEEEEP breath. I maybe had a third of what the guys had, but I ended up having the best experience of anyone. I held the smoke in for as long as I could then almost exhaled a ghost of tasteless, odorless smoke.</p><p>I sat back as a feeling of utter relaxation overtook my entire body in waves. All I could think of was the bad trip my boyfriend had just taken, and I kept telling myself I was NOT going to go there. Just stay calm. Within seconds I was unable to move, unable to speak, and barely able to keep my eyes open. It took everything I had to keep calm. The only thing I knew I could control was my breathing, so I focused on that. Deep, slow breaths. Thankfully, The Simpsons was on, so I watched intently as my trip intensified. It was the episode where the family steals cable. Lisa was in Rev. Lovejoys office discussing the option of turning in her father but I couldnt focus on the audio because the visuals were too intense. Without warning, my living room became the Revs office as the tv screen enveloped me and everything in sight. Before I knew it, everything and everyone turned Simpson-esque.  Now, I dont mean my friends turned yellow and bald, but every line (peoples faces, the couch, the coffee table, the entertainment centre) became very animated. All I could do was try to stay calm and enjoy the live entertainment that had entered my home. I am not sure why, but I glanced up and realized the outside of the tv screen, the casing, was over me. I, my friends, my dogs, and my living room, were IN the tv!</p><p>Slowly, everything began to return to normal and I once again regained control of my body. Dont get me wrong, I was still heavily intoxicated at the time. I moved to sit up and began to giggle. I looked up at my friends all looking at me and yelled Lovejoy Simpson LIVING ROOM!!! and began SCREAMING laughing. Harder than I have EVER laughed in my life, which of course was nothing but entertainment to my friends. Thanks guys! Within a minute I was easing into the familiar, stable pot high I am oh so used to. I was surprised to find that it took a few hours before I FINALLY felt normal again even though my trip lasted only 2-3 minutes. I have never experienced such an intense high with such crazy and vivid hallucinations before, that was so short lived. </p><p>Overall, a big thumbs up from me. I will try again.</p>"
}
