{
 "title": "Drowning My Professor in a Vat of Acid",
 "author": "Suicide Messiah",
 "citation": "   Suicide Messiah. \"Drowning My Professor in a Vat of Acid: experience with Wormwood (ID 58005)\". Erowid.org. Jan 5, 2008. erowid.org/exp/58005",
 "substance": "Wormwood",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Wormwood",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58005",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 5, 2008",
   "Views: 10417",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently I was bored and rather depressed over my schoolwork so I decided to try some wormwood out for some entertainment.  I went into an apothecary store and bought a bag of dried wormwood.  I probably purchased about 30 grams, and it didn't cost over 5 bucks.<br>When I returned to my house, I decided to try it out before I went to bed.  I got several grams and chewed on it like tobbacco until there was nothing but some fiber stuff left.  It is definitely the most bitter tasting think I have ever eaten, but it went away with a glass of orange juice.  After I ate my dosage, I waited for the effects to set in.  About 30 minutes later I started feeling this strange calm sensation.  I was relaxed, sort of like what I get after smoking some pot, but it was lighter and happier in a way.  After a while I started wondering if any hallucinating would occur, but it didn't unless I closed my eyes.  When I did this I could vividly see simple but satsifying light patterns.  After a while the buzz faded away, and I went to bed because it was pretty late.  I had a nice dream involving drowning my english professor in a vat of acid, but that may have been coincidental.<br>My experience with wormwood was pretty enjoyable, but next time I'll probably smoke it instead for a more powerful high.  I definitely roeccomend it for empty pocketed people that want to feel relaxed without very many side effects.  I also had the idea to mix it with catnip then smoke it.\n\n\n"
}
