{
 "title": "I'm Not Bitter, But Sinicuichi Is",
 "author": "James",
 "citation": "   James. \"I'm Not Bitter, But Sinicuichi Is: experience with Heimia salicifolia (ID 5801)\". Erowid.org. Feb 4, 2002. erowid.org/exp/5801",
 "substance": "Heimia salicifolia",
 "bodyweight": "100 kg",
 "header": [
  [
   "DOSE:",
   "5.0 g",
   "oral",
   "Heimia salicifolia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5801",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 4, 2002",
   "Views: 21169",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nJust over a week after ordering 100g of sinicuichi from an online entheobotanicals supplier I received a package bearing my goods. Inside was a bag of dried leaf and leaf-matter labelled with 'not intended for human consumption'. There was a gentle smell attached, somewhere between tea and good-quality hay, nice and aromatic. I tried eating a leaf, just to see how it tasted. It was slightly bitter, but wasn't too bad. I was therefore expecting the taste of the tea to be similar. I was wrong.<br>That night, in preparation for the next day, I took 10 grams of the dried sinicuichi and placed it in a Pyrex dish. I poured 3/4 of a pint of hot, though not boiling, water over the leaves, covering them. I then left this in a warm, well lit room for fifteen hours, reheating the mixture once, a few hours later. After fifteen hours, most of which I spent asleep, I strained off the water, which was now a clear brown color, like strong tea, though with a slight green tint. I heated this, mixed three spoons of sugar into the hot liquid and set about drinking it. Frankly, I couldn't. This liquid tasted disgusting. The taste of the dry leaf was there, but amplified. The bitterness was not mitigated by the addition of sugar: Whilst I could taste the sweetness, the underlying bitterness was overpowering. This is the most bitter substance I have ever tasted, worse than instant coffee granules straight from the jar.<br>Once I had got half a cup down, by holding a sweet in my mouth and chugging blackcurrant juice, I felt quite sick. When I took a gulp of the liquid followed by some pepsi, and it came back up again, I decided that my body really didn't want any more, so I reluctantly quit drinking it. The remains of this nausea quickly faded. The whole process of drinking had taken ten minutes.<br>Beforehand, I had decided to watch a movie -- David Cronenberg's The Fly -- so I went downstairs and lay on the sofa watching the movie. I felt tired, I didn't feel like moving, my body felt heavy and my eye-lids were half closed. I sunk down into the sofa and curled up. My body felt a little numbed, my mouth seemed full of saliva. My thought patterns seemed to be affected a little; when I could be bothered to have them, thoughts flowed easier. I found myself wondering if sinicuichi was 'my cup of tea'. I found that thought hilarious. The movie amused me. I remained like this until around twenty minutes before the end (one hour, forty minutes after initial ingestion). After that point, I felt myself becoming more alert.<br>Three hours after ingestion, I felt close to normal. There wasn't any hang-over. If anything, I felt happy, calm and relaxed. The overall effect wasn't very pronounced. In particular, I noticed no audio effects. However, aside from the method of ingestion, it was a pleasant experience, something that I'd try again, though not by drinking.\n\n\n"
}
