{
 "title": "Reality Through a Ringmod Tapeloop",
 "author": "shpongle",
 "citation": "   shpongle. \"Reality Through a Ringmod Tapeloop: experience with Nitrous Oxide & Cannabis (ID 58012)\". Erowid.org. Aug 28, 2007. erowid.org/exp/58012",
 "substance": "Nitrous Oxide & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 58012",
   "Male",
   " ",
   "Not Given",
   "Aug 28, 2007",
   "Views: 4603",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'll skip the big credibilty introduction by just saying I've experimented with quite a few drugs (I'm the 'explorer' type) and know pretty well what I am doing.</p><p>So I was celebrating the end of the semester at D's house over a few bongloads when the pillhead next door, H, comes back from the porn store with 3 cartons of nitrous, a cracker, and some balloons. I was flooded with visions of the old days of hunching over the Reddi-Whip as an eager 13 year old, and I begin to prepare myself for the glee ahead. We start small with a 2 cart. load for everyone. This gives everyone else a hearty giggle, but fails to give me the psychonaut exploration I crave, so as my companions laugh their asses off, I devise a way to get higher. My eyes drift to the bong beside me (nicknamed 'Ike Turner, Cause He Hits So HARD'). There was some crystal in the house, but mixing meth and nitrous didn't sound like much a trip, so picked up Ike.</p><p>I begin by completely filling the bong's chamber (relatively large) and clearing it in one hit, holding for a bit, then fully exhaling. Before I can suck in any oxygen, I lift a 2 cartrige balloon to my lips and breath in and out in it about 10 times, and just as I get the repeating and steadily increasing in tempo audio hallucination (people call it the 'WOWOWOWOW' but mine is more of a high pitched electronic sound through a ring modulator). After the first balloon I grab the other 2 cart. prepared for me by H and heartily inhale it while standing up briskly.....</p><p>The audio flanging escalates to the point of oblivion, as I wander around like a zombie, stumbling around D's apartment, mouth gleefully agape in that nitrous induced nirvana we all know so well, too wigged out to actually laugh. </p><p>After about 30 seconds, the flanging escalates to the point that my brain quits hearing it as noise and accepts it as reality, and I collapse on the ground as I wonder to myself, 'Is this real? Can I really be experienceing this? Is this just a vivid imagination?' My mind checks all my senses and firmly answers YES to the first question, which voids all the others, after barely recognizing my friends faces through the flanging haze. </p><p>After about a minute of shattered reality, I muster up the self-control to laugh as the flanging slows down and begins to blend with the raucous laughter of the audience at my outlandish behavior (we go in turns, more fun that way). Finally I pop up back into consciousness and mutter about how cool that was, and patiently wait for my next hit. I repeat this process once more with different results: after taking the same amount with the pre bongload, I was somehow possessed to run out of the house, through the driveway, and 2 blocks down the street before coming down and realizing what the fuck I was doing.  </p><p>Third time around, I kick it up a notch, taking a double-chamber hit from Ike, moving straight to a 3 catridge balloon, and then taking a double balloon as I stand. I quickly realize that standing is not a part of the universe I am entering, and collapse on the couch as the opening bass taps of 'Jerry Was A Racecar Driver' by Primus drift through the ringmod tapeloop of my auditory perception. The tempo glides infinitely upward to oblivion as I lie wide-eyed but sightless with a manic open-mouthed grin (undoubtedly creeping the shit out of everyone else, but they were laughing when I came to). </p><p>As my body gradually slows its spinning speed down from infinity, the aforementioned ringmod tapeloop slows down and meshes with reality, my connection with reality somehow perfectly synching with the break section of the previously mentioned song, and gives the whole experience a sense of blessing from on high, as if it was meant to happen this way.</p><p>As I touch down on Earth, I'm greeted by the hysterical faces of my friends, followed by the sounds of their laughter a few seconds later, and I step out into the cool brisk air to peice my mind together over a cigarette...</p>"
}
