{
 "title": "Self REALization/Oneness",
 "author": "Time Traveler",
 "citation": "   Time Traveler. \"Self REALization/Oneness: experience with 5-MeO-DMT (ID 5804)\". Erowid.org. Feb 4, 2002. erowid.org/exp/5804",
 "substance": "5-MeO-DMT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "5804",
   "Male",
   " ",
   "Not Given",
   "Feb 4, 2002",
   "31779",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFirst time user with lots of other previous exploration.  It's like the line from the Matrix where Neo is asked if he wants to take the red pill or the green pill.  If I had been not prepared to have the illusion of the world crumble and the veil pulled aside, I would have left it for now until I felt called to do it.  </p><p>Sunday morning 11am.  No food since previous evening.  One very experienced person was with me and I was laying back on the couch with soft music playing.  I prepared myself mentally to totally surrender into the experience by doing some Yogic breathing and holding (bandas) and breath holds.  I'm not sure about the dose but it was one hit of white crystal/powder held as long as possible (approx. 40 sec.).</p><p>I had worked with DMT several times in the past and was prepared for a similar shock.  I've have numerous experiences with high dose mushroom journeys, large dose LSD 'psychotherapy' sessions, traditional Ayahuasca sessions, and DMT.   In addition, I've practiced Hatha Yoga for over 5 years and have worked with altered states in holotropic breathing sessions, rebirthing, Tantric Yoga, and Gestalt Practice.   All of these experiences have been approached with an intention for transformation that filters into everyday awareness. </p><p>What I got after about 30 seconds of one hit was an immediate complete dissolution of any identity and a merging into the Oneness, timeless, pure awareness and light energy of the Universe (which we are - as above, so below, the macrocosm within the microcosm ).  An enlightenment experience.  Complete clarity.  Similar in some ways with a previous Samadhi meditation experience.  I also had the experience of energetically dumping Everything that I had been holding onto from the past up to that point in my life.  There was a knowingness that all of my previous 'suffering' was designed perfectly and got me to this point in time where I could have such a direct experience of my (our) true nature. </p><p>The experience lasted about 10 minutes.  As I started to come down I noticed the strong expectation that this would have an immediate effect on my experience of the material world. After about 30 minutes that was not the case.   Everything was back to normal.  I began to have a hard time remembering certain realizations of the experience that had previously been so obvious and seemed like I would remember.  I know that in the past insights from these types of high impact experiences start to filter wisdom into normal awareness.</p><p>This was very different than my three DMT experiences where I seemed to be in other dimensions that clearly had entities present with vibrant visuals.  I also did not experience the initial terror of the DMT experience.  With 5MEO I seemed to go beyond everything - to nothing (No-Thing).  It was a much smoother and gentler experience - more loving.</p><p>What did all this mean?  I'm not sure.  Still integrating the experience.  I continue to be deluded by the illusions of the world and my mind(thoughts), and really truly believe, in my normal awareness, that I am a person limited by my false identity and Thoughts about myself and the world.  </p><p>It certainly showed me a state of perception that I can have again.  In meditation, I now have a better idea of what letting go is and how to do it, of what being present is.  Now, I see that the calling for me is to learn to move through the different stages of awareness without being assisted by substances, although they continue to be teaching tools.  The work is to continue to distinguish between self and Self, and to integrate as I go through my day-to-day life.  The importance of having a practice to integrate the different states of awareness on a regular basis is more obvious and therefore strengthens my commitment.  In my case it's Yoga.  </p><p>I would definitely do it again with no problem but would caution others to only do it if it calls to you and to prepare for the intensity and totality of it the best you can.  Intention is key.  Surrender is the answer.</p>"
}
