{
 "title": "Lack of Pain is My Euphoria",
 "author": "Katie_okell",
 "citation": "   Katie_okell. \"Lack of Pain is My Euphoria: experience with Oxycodone (ID 58052)\". Erowid.org. Dec 12, 2008. erowid.org/exp/58052",
 "substance": "Oxycodone",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "19992004",
   "58052",
   "Female",
   " ",
   "Not Given",
   "Dec 12, 2008",
   "Views: 9590",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was born with a birth defect, I had two uteruses (uteri). Having two uteri caused me to have stage three (there are only four stages) endometriosis, which is quite possibly the most painful thing I have ever experienced.</p><p>However, doctors did not believe me. They thought, since I was only 13 at the time, that I was over-exaggerating my story to get attention, or that I didn't have a very high pain tolerance. Over the course of two years, I was prescribed every pain-killer imaginable, and none of them worked. My pain seemed to get worse and worse as the weeks wore on, and nothing any doctor prescribed to me helped. One day, I collapsed in the kitchen because my pain was so bad that I couldn't stand, and it was then that my father decided to do something. He found some left-over oxycontin from a dental surgery he had a few months previous, and gave two pills to help me.</p><p>Surprisingly, the pain washed away. It was a slow gradual relief that I barely noticed, but I just remember waking up for the first time in over a year and not being in pain. It was the most amazing experience of my life. I started taking oxycontin daily, merely as a way of literally being able to get out of bed in the morning. Every time I felt pain coming on, I would take two pills. I fell into the general pattern of taking two pills once I got to school in the morning, two at the end of the school day, and sometimes two at night if the pain was so bad I couldn't sleep.</p><p>I had read countless reports of oxycontin being used recklessly, but surprisingly I never thought the drug affected me that way. I never felt as thought I was 'high' or that my reactions were anything but what they were normally. I felt euphoric, but I simply related my feelings of euphoria to the fact that for the first time in years, I was able to go to school without having to come home two hours later because of my pain.</p><p>It took five years and two surgeries for my pain to finally go away, and I took oxycontin on an almost regular basis for that entire period. Surprisingly, I never got addicted. I even refused morphine while I was recovering, something my friends told me I was crazy to do. Once I had fully recovered and no longer needed painkillers, I gave my leftover oxycontin to my friends.</p><p>A few weeks ago my friend gave me two oxycontins, and asked me to try them with her. After taking the pills, she was extremely euphoric, and was enjoying watching a TV show. I, on the other hand, felt nothing. I had no feelings of euphoria, and none of the sensations described by others who have taken oxycontin recreationally. It has been two years since the last time I took oxycontin for medical purposes, so my tolerance was not increased, yet still I felt nothing. It will always remain a mystery how people can take painkillers recreationally. They have absolutely no effect on my other than taking some of my pain away.</p>"
}
