{
 "title": "Alone and Scared",
 "author": "dont eat dumbkane",
 "citation": " dont eat dumbkane. \"Alone and Scared: experience with Morning Glory (Heavenly Blue and Pearly Gates) (ID 58065)\". Erowid.org. Sep 8, 2008. erowid.org/exp/58065",
 "substance": "Morning Glory (Heavenly Blue and Pearly Gates)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "1997",
   "58065",
   "Male",
   "",
   "Not Given",
   "Sep 8, 2008",
   "3811",
   " "
  ]
 ],
 "report": "<p>Back in my junior year of high school, I smoked marijuana a lot, but I didn't dare go beyond that because of the stories I had heard about people who had had bad trips with hallucinogens. I finally decided in June of '97 to get as close to LSD as I could since this drug interested me the most. I read as much information as possible on the Internet and even spent some time at the library. One of the things everyone always stresses with trips is having someone with you as a babysitter or someone that is tripping too but more experienced than yourself to bring you down in case something happens. I read about how some varieties of Morning Glory seeds and just plain Baby Hawaiian Woodrose seeds had some of the same active components in them as LSD. I found a recipe for the Morning Glory seeds and also found the same concoction in other areas of the web.</p><p>It just so happened that I worked at a plant nursery. And it just so happens that it was that time of the season for seed packets on the shelves. So, I bought 2 Heavenly Blue and 4 Pearly Gates seed packets. I told my parents that I was going to be staying over at my best friends house for the night. He had no idea what to expect, nor did I, but he had never smoked marijuana or done anything else. The night before this big night, I soaked the seeds in simmering boiling water to rid the seeds of the chemical that the seed companies put on the seeds so people wont consume them. </p><p>7:00p - We get two plastic baggies and put all the seeds in one baggie and that baggie inside the other one so that when we crushed the seeds, they would not punch through. His parents have already gone off to bed by now, so we take a hammer and smash up the seeds on the concrete floor in his laundry room.</p><p>7:05p - After making sure the seeds are good and mashed, I take out my recipe and follow the simple directions. Take ground seed and mix with orange juice. I guess the citric acid or the Vitamin C is supposed to help with the uptake of the chemicals in the seeds. So, I already have a bottle of Sunny D, we divide the seed mash in half, then we mix the mash with the Sunny D and gulp it down. Both my best friend and I gag, but Im determined, so I add some more juice to the seeds at the bottom of the glass and slug it down.</p><p>7:10p - 8:00pm - We watch TV and keep asking each other if either of us is feeling anything. No dice. Continue watching TV.</p><p>8:30p - I look over and notice my friend fell asleep or passed out or I dont know what. I just let him sleep and continue to watch the same channel.</p><p>8:45p - Some comedy/love story movie comes on that I have never seen nor heard of. Probably because of the fact that at the time I didnt have cable TV. I get a little intrigued and get off the couch and lay on my stomach in front of the TV.</p><p>10:30p - I know the title to this movie (Id rather not mention it) and Ive never seen it since, but it has a very climactic ending that Ill never forget, even for a B or even C movie. Im glued to the television and when the climax of the movie hits, I get this full body rush and I start bawling. Totally uncontrollably crying. I look over at my friend and he is not waking up.</p><p>10:45p - I flip the channels for a bit after the movie ends, but I am not interested. I turn off the TV and look for his cat. I love his cat, but his cat hates everybody. People always say animals, but especially cats and dogs, know, just know when something is wrong or different about you. This was right on. I find his cat underneath the dining table. I start calling the cat, Here kitty kitty, even though I know the cats name.</p><p>10:50p - The cat hisses and claws at my hand when I reach out to pet her and exactly when this happens, I see Satans face in the cats face (or at least what some people think Satans face looks like). Lets just say it was devilish and scared the crap out of me. I jumped back and not really caring about whether anyone hears me, I kick the chair that the cat is under and she runs out from under the table and then upstairs.</p><p>11:00p - At this point, I really want to talk to my friend bad, especially about what just happened, but I didnt want to wake him up and start a commotion.</p><p>11:05p - After pacing about his basement, trying to decide what to do, I figure that I will go to bed. So, I climb in my sleeping bag, get all comfy, and close my eyes. I start seeing colors when I close my eyes which kind of alarms me since this has never happened before. So, I open my eyes (after this point, I lose all concept of time until the following morning). I just stare at the ceiling, not really thinking about anything. Then, I slowly start seeing colorful patterns on the ceiling. This is kind of alarming as well. But, I just go with it. Then, my mindset takes a turn. I start thinking negative thoughts, like some of the horror stories friends had told me about some kid, who probably doesnt even exist, that tripped so hard, they never woke up from their trip. I start wigging out and thinking that when my mom or dad comes to pick me up the following afternoon, I will still be tripping and I wont know whats real and whats not. I start thinking thoughts upon thoughts and my mind is flowing with negativity and paranoia.</p><p>Following day:</p><p>12:00p - I hear my friend making some not-so-good noises and wake up. Then, I realize that I am awake and I am not seeing colors and its almost as if nothing had ever happened. My best friend was sick as a dog. I asked him if he had funky dreams or nightmares or anything and he said no. He said he slept like a rock and had a hard time waking up. He said he felt like throwing up. I told him I felt fine. I was never big about praying, but the moment I woke up, before I went to see about my friend, I got down on my knees and thanked God for getting me through that bad trip.</p><p>In conclusion, to this day I dont know if the bad trip had to do with the fact that I was alone and vulnerable to letting my mind wander to negative thoughts or if it had something to do with not getting all the chemical off the seeds when I boiled them the night before. I promised God and myself I would never mess with legal drugs or otherwise again. Didnt happen. I just cant stress enough about being with someone who will be able to calm you down if you start wigging out. Ill never forget that night. I dont think about it all the time, but when I do, its just something I wish had never happened.</p>"
}
