{
 "title": "A Touch of Sleep",
 "author": "imruu",
 "citation": "   imruu. \"A Touch of Sleep: experience with Diphenhydramine (Benadryl) (ID 5808)\". Erowid.org. Feb 4, 2002. erowid.org/exp/5808",
 "substance": "Diphenhydramine (Benadryl)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 tablets",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 5808",
   "Male",
   " ",
   "Not Given",
   "Feb 4, 2002",
   "Views: 31251",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nDrug: Benedryl (diphenhydramine)</p><p>Dose: 4 regular pills and 4 dye-free pills.  </p><p>Time:  A month or so ago, ingestion began at 12:50am</p><p>Place:  The most comfortable place I know, my room.</p><p>The Trip:</p><p>After doing some pretty intense reading, I decided to glance into the old medicine cabinet, where I found some Benedryl.  I was actually looking for Dramamine, but according to the Marezine-Dramamine website, these are inherently the same, and the trip reports were pretty much equal.  So I got 8 pills, not a heave dose, but its what I wanted to start with.</p><p>At 12:50am I ingested all 8 pills with water within the period of a minute.  I drank approximately 16oz of water.  I ate 3 hours earlier, and at the time I was not hungry.  I also ate a piece of bread, because its just something I do whenever I take any drug.</p><p>After this I got my cds and everything I needed for the trip ready and got my laptop on got onto my bed.  At this time it was 1:13, and I wasnt feeling anything.</p><p>At around 1:22 I felt something this is most likely anxiety though, since this is the first time I took diphenhydramine.</p><p>2 minutes later at 1:24 I feel some slight head pressure, like a sinus buildup, whether this is from the drug or just me, Im not really sure.</p><p>1:32 I notice the walls are slightly breathingthough again I cant really tell if this is my imagination or a drug starting to take effects.</p><p>1:39  I got REALLY tired, the quote from my log was.. shit Im tiiired, must fight.  head kinda hurts...must fight tiredness</p><p>1:52  I put some music on and tried to relax with my eyes opened, which was quite hard because at this time all I wanted to do was go to sleep.  I start to feel some slight euphoria, and the head pressure went away.</p><p>2:00  Around not I start to notice some slight Open Eye Visuals.  I see some colors when I move my eyes looking into darkness.  Kinda the same effect I get on DXM.  I was also not nearly as tired, just kinda drowsy.</p><p>2:02- This is where it really began.  I had my headphones on, and I was talking to my friend online.  Suddenly I start to hear some rather LOUD talking through my headphones.  This slightly freaked me out for a min, cause I didnt know what it was.  Then I quickly regained my composure.  </p><p>After this everything is a little sketchy.  From what I remember is seeing the most realistic visual in my life.  I remember rolling over and looking towards window.  (I also remember being VERY heavy at the time), and when I looked over I saw thisthing.  It was kinda blobish shaped.  It was quite beautiful actually, had no symmetry at all.  Looked a little like the predator did, but had a slight purplish hint to it.  As I tried to figure out what it was, it began to move.  It moved towards me quite slowly, but at a steady pace.  Finally it was right next to my hand, then I reached out to touch it.and woke up 9 hours later.  I guess the drowsiness turned into sleep ;)</p><p>After trip:</p><p>After I woke up I was feeling heavy and hungover.  The same feeling I get from sleeping pill induced sleep.  I kinda lay there for awhilethinking.  For the rest of the day I felt odd, not all mentally, and physically there was something different about my sense of touchI cant really describe it.</p>"
}
