{
 "title": "Awakening to Face a True, Morbid Reality",
 "author": "Doc",
 "citation": "   Doc. \"Awakening to Face a True, Morbid Reality: experience with Cannabis (ID 58136)\". Erowid.org. Aug 2, 2009. erowid.org/exp/58136",
 "substance": "Cannabis",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58136",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 2, 2009",
   "Views: 12188",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is an experience I had about 3 months ago now, and right now I am 16 years old. I have read other reports of marijuana induced hallucinations and trips, but this one has deeply affected my life.\r\nMy friend Alex is a bit of a stoner, and has tried many different hallucinogenic drugs, but he is always smoking marijuana around me, even now. I first tried marijuana with him at his house before going to see a movie. I took a couple tokes from a waterfall bong and was completely unaffected for the entire day. I tried it yet again about 3 days later, the only thing I got out of that attempt was a couple giggles. \r\nFinally, convinced that marijuana was too mild to mess with me I was confident to try it during lunch at school one day. I was hanging out with Alex and Zach (2 friends I trust) and a kid named Ryan, who I did not know. We went into Alexs room, which is a little dirty, and contains a bathroom of its own with a window that Alex blows marijuana out of. I took a SINGLE hit from a waterfall bong, 1 toke, a huge one, and I held it in for at least 15 seconds. Then I exhaled and coughed. I looked at myself in the mirror and as I coughed veins of red pulsated into my eyes heavier and heavier each time I coughed. I looked stoned out of my mind, and I went to sit on Alexs bed.\r\n*The rest I can only tell by how my mind perceived it at the time, please bear with the description*: My blood stopped dead in my veins. Weight surrounded and pulled at my feet, and a wave of light, non-gravitational sensation rose from my feet and swam through my veins all the way up to my head and repeated. I felt as though I was stuck in the floor, but inertia wanted to send me off into the ceiling. On top of this I felt extreme light headedness, and walking straight was completely impossible. I got into Alexs car and immediately began spilling out my emotions. Ryan (kid I didnt know)  laughed and claimed Youre just really stoned, calm down. Alex and Zach seemed a little concerned, and just recommended that I relax, but I knew that they were not going to be willing to really help me.\r\nI felt extreme fear, and I wanted nothing more than to be in a hospital, with my mother and father beside me to comfort me. Inside massive paranoia was consuming me. I began believing I was going to be on TV, be the first person to die of marijuana overdose. I thought of myself as weak, and I saw myself as being that strange kid who overdosed on drugs. There was no denying it, my world was coming to an end.\r\nI knew that I could not go to class, so I told Alex to let me sleep in his car during the last 2 periods. He parked off by the football field and made room in the car for me to sleep. All 3 left and promised to be back after it was all over. Finally, I was alone to think and come to terms with myself. I laid over and let the trip consume me. When I closed my eyes, purple and blue geometric figures laced my eyelids. The more I thought, the more vivid my imagination grew. I felt as though I had opened a new set of eyes deep inside of my skull, and I was watching sequences and patterns play in my head. I was imagining all possible rationalities, and explanations of the universe at light speed. All possible answers to the meaning of life and death were calculated and presented in my brain. I could not hold onto one thought for more than 10 seconds, and I immediately forgot it once it presented no use to me. Finally I came to one emotionless conclusion: We are all here in the universe as a product of laws, physics, and mathematics. There is no meaning to life, there is only its ability to carry on.\r\nThe geometric patterns on my eyelids started to form cartoon like creatures. It was like I had seen them as child, but I knew they never existed. It was at the point that I hit the slow motion barrier stage (this is the best way for me to describe it). A strange, alien music (frightening!) rose up and got increasingly loud. A repetitive monotone rhythm repeated over and over again, it was like an extraterrestrial African chant that changed only after playing for what seemed like eternity. I went into slow motion. I had the urge to open my eyes and I looked at my hand as I attempted to grasp a fist. It made a horrible sound as it was in motion, an echoing gunshot type sound, and this sound left behind it a tracing, following trail of ethereal bits of my hand and fingers. It was as if all sounds and images were linked together.\r\nTo escape the sound I used all my force to break the barrier. I felt like I was in a bubble of anti-reality. I jumped up and was back to my early stage of the trip. I was light headed, and felt like gravity was messing with my body. It was refreshing for a while, but paranoia was able to consume me in this state, as I was not able to block out my personal thoughts with universal thoughts. I laid down again and returned to my geometric fantasy world.\r\nI blacked out at some point, and woke up to the sound of the school bell ringing. I went home with my grandpa, and ran to my bed to try to sleep. I entered the same ridiculous world, the insanely vivid visions returned, and it was worse now. My parents were home. My dad came in, oblivious to my condition and told me not to sleep, as I wouldnt be able to sleep later. I said, Im really tired, but I should be fine. Luckily, he was leaving for work.\r\nMy mom knew something was wrong as soon as she saw me. She assumed it was drug related almost instantly. And I was too scared to lie. I began to cry and told her that I was going insane. I told her all my fears, all my assumptions, and all she could do was comfort me, she had no hate or disgust. She sat by my bed and rubbed my hair, assuring me that tomorrow would be fine. She soothed me, and finally, after telling someone all my feelings, I entered the only pleasant part of the trip, the coming down. I fell asleep, and did not dream or think.\r\nCannabis made me have this extremely hallucinogenic reaction And because of how I reacted to the drug, I have unwillingly revealed to myself a logical explanation of the universe. Now, I am not completely conscious, as my explanation of the universe reveals my insignificance. I constantly question reality, and I have developed a sensation that Ive heard to be called: derealization, Its  been months but finally, Im starting to believe Im recovering. Hopefully I will be awake again soon, perhaps with a greater, more beautiful understanding of everything.\r\nI do not blame marijuana or anyone I know. I made a choice, and I now live with it. If anything, I have developed a greater respect of drugs, and theyre potential to help, and traumatize a human being. However, I will never smoke marijuana again. I plan on using a heavy hallucinogen later in my life (DMT, LSD), but not until I am emotionally prepared and ready to do it.\r\nThink for yourself, question authority,\r\n                    David\n\n\n"
}
