{
 "title": "'To Be Continued...'",
 "author": "Jamshyd",
 "citation": "   Jamshyd. \"'To Be Continued...': experience with Syrian Rue & Diplopterys cabrerana (ID 58177)\". Erowid.org. Jan 2, 2007. erowid.org/exp/58177",
 "substance": "Syrian Rue & Diplopterys cabrerana",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.75 Tbsp",
   "rectal",
   "Syrian Rue",
   "(tea)",
   "  T+ 0:20",
   "5.0 g",
   "rectal",
   "Diplopterys cabrerana",
   "(extract)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Ginger",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 58177",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 2, 2007",
   "Views: 9271",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my second experience with DMT, and the first beyond threshold effects. </p><p>I have not tripped for a long time, and havent been considering it, even. Yet, for some unknown reason, DMT decided to get into my system today. I thought, alright. Im in a good mood  certainly better than a few days ago since my depressive episode suddenly lifted yesterday. </p><p>So I went on and measured out just a bit less than a tablespoon (like 3/4 of it) of Syrian Rue, as per Shulgins suggestion in TiHKAL. I wanted the bare-minimum of MAOIs in my system (also remember that I will be taking it rectally). I ground them up and boiled, reduced, and then strained, to produce an orange liquid that stained yellow everywhere like turmeric. I then set this aside. As I did the above, I chewed and swallowed some shavings of fresh ginger root, just in case. </p><p>A couple of hours later, I had the house all for myself, and I decided that it was time. So, I loaded the abovementioned Rue-juice in a needle-less syringe, and up went. </p><p>I then set out to prepare the DMT half. I had a bag that contained about 20g of ground up Diplopterys cabrerana. I eyeballed (oh give me a break!) 5g and boiled in water + lemon juice for a few minutes, with non-stop stirring. By now, about 15mins had passed, and I was feeling the very subtle light-headedness of the Rue. I let the DMT-juice sit for a bit and then strained to produce a foul-smelling muddy liquid. </p><p>Now that 20mins had passed, I was certain that the MAOi was in effect, and so loaded up the syringe and, once again, up it went. Unlike the rue-juice, which I pretty much did not feel down there, this stuff felt alien. There was some push to evacuate, but I resisted, and it subsided after a few minutes. I then went to unplug the phone (my worst enemy), and put on some music (Enigma  for reasons that youll see in a minute). </p><p>The come-up was, as expected, full of doubts. Did I take enough? Did I take too much? and other related anxieties that my fellow trippers are probably familiar with.  Not much later (Id say 10mins), the reply came as colourful tracers/trailers. At this point, my mind was still quite clear, and my body unaffected besides the light-headedness described earlier. </p><p>Over the next 20mins, the OEVs did not intensify, but that was ok, since I hardly get any OEVs from any drug. Meanwhile, more interesting things were happening behind my eyelids. There was a lot of colour, but no light (those who took DPT or LSD know what Im referring to). It was actually closer to mushrooms than anything else, but much less dirty. The same went to the body  no electricity (again, DPT, LSD), but feelings of random vibrations and extreme alterations between warmth and shivering (a la psilocin). And again, although sometimes a bit alarming, the bodyload never became uncomfortable as it did with mushrooms. At one point, a bout of diarrhea became unbearable, and seeing that ½ an hour had passed since ingestion, I thought it would be safe to evacuate without losing any drug. And so I visted my old trip-buddy, the bathroom. Surprisingly, there was no nausea at all, leading me to expect that it is a very specific reaction in the stomach rather than the CNS. And yet, it seems that regardless of which orifice in my body I decide to purge from, a purge is inevitable. After the deed was done, I felt incredibly light and cleansed. Behind my closed eyelids were huge orange snowflakes of infinite complexity floating in endless blackness</p><p>I went back to my bed (I had spent the entire thing lying down under covers, as I prefer to do with most trips), and continued listening to Enigma. The choice of music was because Enigma is one thing I have been continuously listening to since a very young age, and so every song is capable of activating several memories from my past. And so memories were revisited. I will not lie to you, there was no immense revelation. I did visit some recent disturbing memories and, in DMT-space, the disturbing connotation was all but gone. I am hoping that this is a kind of psychoanalytical untangling of unnecessary disturbing memories. I certainly do feel like a small load has been moved off of my back. </p><p>Anyway, at around 40mins, I figured I had reached the peak, I definitely felt physically uncoordinated. There were a couple times where time would seem to stop and Id fall into a black-hole of some kind. I was feeling waves (more watery than the winds of LSD) ofDMT, I guess, moving me through a sequence of visuals. There were glowing reptile-like things crawling around at high-speed. Eventually one of them plunged into my body and I could feel it =). </p><p>As I approached the 45min mark, I was transported through rapidly-changing landscapes (lots of sky and stars involved), until it fixed upon one landscape. It was actually a familiar one that I visited several times in my life  a place in the middle east (Jordan, to be specific) where one could see the great rift where the Jordan river runs. Standing on the Jordanian side, one can look across the flat valley onto the mountains of Israel/Palestine on the other side. I was standing amongst a gathering of one-legged people, all pointing in bewilderment at something. I followed their pointing to find that the sky was cracking up and the stars were falling through! A light started exploding from within the crack in the horizon... a picture of Jesus was lowered (as if it were hung from a machine from above) in front of the light to cover it, but it was shattered by the explosion! Another picture lowered - that of the king of Jordan! (I giggled) - and it too got shatterd. Then time seemed to freeze for a bit, and...</p><p>Click, click. My ears popped. </p><p>The whole thing disappeared. I opened my eyes. I was back in reality. Within 2 minutes I felt the drug largely gone. 15mins later I am totally sober and writing this.</p><p>So I guess this one has a sense of humour. I have no idea what would have happened if the light exploded all the way. </p><p>To be continued ,). </p><p>Note: I strongly believe that the rectal administration contributed to the shortness of the experience (no more than 50 mins) and the abrupt return to baseline (I wish all psychedelics did that!).</p>"
}
