{
 "title": "A Total Flop",
 "author": "Alforn",
 "citation": "   Alforn. \"A Total Flop: experience with Ayahuasca (B. caapi & P. viridis) (ID 58296)\". Erowid.org. Mar 13, 2007. erowid.org/exp/58296",
 "substance": "Ayahuasca (B. caapi & P. viridis)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "50 g",
   "oral",
   "Psychotria viridis",
   "(tea)",
   " ",
   "100 g",
   "oral",
   "Banisteriopsis caapi",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 58296",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 13, 2007",
   "Views: 21992",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So the plan was that I would brew up some Ayahuasca on the solstice, go out into the woods that night and maybe meet God.</p><p>I had 50g of dried P. viridis leaves and 100g of dried B. caapi vine, the latter of which I shredded into quite thin strips the night before brewing.  I woke up at 7 in the morning, had a small breakfast (my only meal that day) and started brewing at 8.  I used Brita-filtered water to which I added lemon juice (maybe not as much as would have been ideal - I was kind of winging it), and brought the pot to just below boiling.</p><p>My original plan was to just keep adding water as it boiled down, but I quickly decided that the 'standard' method of multiple washes would be better.  So after about an hour, I ladled about half the tea into another pot and set that to a low boil in order to multitask.  Later I would switch to replacing all of the water rather than just some of it.  I repeated this numerous times through the day, until around 5 I had three pots full of tea.  Over the next two and a half hours, at a low boil, I brought this down to only a quarter of a pot, or about 40oz.  It was now 7:30PM.  I filled a thermos with the tea and put the rest in a water bottle, then set about gathering my things.</p><p>At about 9PM I set out into the woods, and found a good spot around 9:30, whereupon I had my first drink, about 15oz.  The taste was so vile I had to fight against vomiting, but I managed to keep it down, and settled down to wait.  For awhile, nothing happened.  After about 30 minutes the purge began.  Mainly it was diarrhea, I felt waves of mild nausea, but only really burped, never vomited.  I thought, ah ha!  Once we get through the purge, the trip will REALLY start!</p><p>Well, the purge ended about an hour and a half in.  Two hours in, still nothing had happened.</p><p>I was beginning to get distressed.  I had poured everything into preparing for this, and had built up my hopes.  How could this be happening?  I pleaded with the spirit of Ayahuasca.  Eventually, I choked down another 10oz.  20 minutes later, still nothing had happened.  It started raining, for which I was entirely unprotected.  I became frustrated, and then enraged.  I cursed the gods, etc., then stormed back home, stopping a couple times along the way for a bout of diarrhea.  At home I stayed up another couple hours, and still nothing but diarrhea.  I went to bed.</p><p>I'm really not sure what I did wrong.  Maybe I should have brewed the vine and the leaves separately and drunk the former before the latter, but traditionally the two are brewed together.  I don't think my dose was unreasonable either, though I may have a high tolerance or something.  Either way, the whole ordeal was very depressing.  Part of me never wants to try Ayahuasca again.</p>"
}
