{
 "title": "All the Love in the World",
 "author": "Mika",
 "citation": "   Mika. \"All the Love in the World: experience with Salvia divinorum (20x extract) (ID 58305)\". Erowid.org. Jul 25, 2009. erowid.org/exp/58305",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58305",
   "Male",
   " ",
   "Not Given",
   "Jul 25, 2009",
   "2725",
   " "
  ]
 ],
 "report": "<p>I had tried salvia once before, at a beach party, two years ago, while I was home from my first year of college, and had recalled enjoying myself immensely during that initial trip.</p><p>I am not a huge advocate of drugs, or pyschedlics, as Ive found that my inability to get past my own fears and apprehesnions stops me from doing anything but marijuana. I have tried mushrooms, once, and had such a train wreck of an expereince that under no circumstances will I touch the stuff again. Salvia, though, had seemed different, I had been taken so far out of my own head, into a world where I truly believed in everything that was happening to me, that the concious ability to feel fear or terror did not exist. I felt powerful, and at peace with myself and the earth as a whole.</p><p>This December (2006), my girlfriend (Lorraine) and I had just completed our Christmas exams, and had been sitting around the house for about a week or so, smoking joints, and chilling out. We had been talking for a long while of doing salvia together, as she had never tried it, and I was more than willing to give it another kick at the can. On December 16th, she went to a store downtown, and picked up a gram of X20 ground salvia in a small blue baggie. There were no leaves, just a dusty black powder that looked ashen. We decided that we would trip seperately, with one of us sober sitting the other while they tripped out. We drew straws to see which one of us would try the stuff first, and I drew the short straw, meaning that I was going to play guinea pig to this very potent batch of salvia.</p><p>We emptied out our water pipe and filled the bowl, I sat in a small reclining chair in the living room, facing Lorraine, who was on the couch, and lit the bong up before I had a chance to second guess myself. The chamber flooded with milky smoke, and I remember thinking as I took my finger off the choke, 'there's no going back now.' As I held the smoke in, I could immediately feel the drug's effects. My heart began to trip hammer in my chest, but I refused to give into my fear. I held a hand over the beating muscle, and forced myself to become calm, to get zen, and accept what was going to happen to me. My head was swirling, and as I let the smoke out, I remember telling Lorraine, 'Here it comes.'</p><p>There was an almost immediate sense that everything in the room had shifted and melted away, that my world was evaporating before my eyes, and that I was entering into some kind of unknown realm. I remember at that point having an intense desire to stand up and interact with the sudden rush of power that had begun flooding through my veins. In the center of our living room, I began to move my arms up and down, bracing them against an invisible pressure that had started creeping through my legs and arms. I stared up at the celing, and as I watched, an entity, something translucent and shifting, entered the room from the hall. Our walls are lined with Christmas lights, and I remember watching the energy pass through the lights and illuminate the room in a brilliant spectrum of colour. At this point, the energy forces bled down both sides of the room, forming a wall of static that I could see and hear. I remember that I was afraid, but again, I reminded myself that I had indeed taken a drug, and that now I was just expereincing the effects. This calmed me down significantly, and I continued my interaction with the drug and it's power.</p><p>Lorraine had stepped up to meet me, and as she moved, the energy wall engulfed her. I moved to touch her arm, to try and move her from it's path, and upon doing that, the power overtook me, literally taking hold of me from both walls, front and back, until I felt like I were divided, sectionally right through the middle. I was picked up and moved around the room by my jaw, as though magnetic forces wanted to pull me towards a destination unknown.</p><p>And, then, all at once, the energy let go of me, leaving my body in separate intervals.  It started in my arms, which drooped to my sides as I felt the power leave me, it seemed as though I were becoming sober in stages, and that the drug were wearing off, but that was not the case. My legs came next, and as my power dwindled, so did my balance, and I fell to the floor, watching as my energy bubble rushed back out towards the ceiling and down the hall.  At this point, I became convinced that the walls of our house were what was containing the power, and that each room I passed through would be a divider that eliminated the drugs hold on me as I passed through it. I could still feel the magnetic pull yanking me by the jaw, and I told Lorraine to follow me, that it wanted me to go to the kitchen.  I was led to the fridge, where I was certain that the power would be cut off, I placed my head against its cool surface, but still, I felt this yearning to go further, like the drug wasnt done with me yet, and I announced to Lorraine, no, no, it wants to go outside. It wants to go outside.</p><p>There were a pair of shoes by the back door of our kitchen, and I threw them on, dashing out the door, not caring if Lorraine followed or not, and ran into the backyard, into the night.  Here, the air was cool, and clean, and I felt like I had entered into some far reaching, never ending landscape.  The power started to fall out of my head, and as I watched, the beam of energy raced out into the night sky, cascading majestically down the street, until it flew out of view into the blackness and clouds.  I remember feeling a very intense, very real, sense of loss and mourning at its passing, and could actually remember standing in the yard, morose, staring after it, as Lorraine finally got her coat and shoes on, and came to meet me.</p><p>At this point, I realized I was starting to come down, because I started to have rational thought again. I understood why I was outside, and that none of what had happened was real.  I knew that I was still tripping, but the high was coming in mild waves now.  Lorraine and I walked to front porch, sat down on the railing, and shared a cigarette.  I looked wonderingly at the lights strewn above our house, and stared down the road at streetlights, and passing cars, in awe of how suddenly awake, and aware I felt to all the power of the world.  In every gust of wind, I could feel that energy that I had touched blistering through me, and the desire to walk around, and experience this new found clarity was very strong.</p><p>Together, we walked up and down the streets, as I slowly began to come down to baseline. the psychedelic reality began to fade in slow waves, giving way to the real world once more, but even through this, I could not shake the feeling that I had tapped into something very real and very spiritual, like all the power and love and good vibrations that the world had to offer, those things that we can sense, but cannot touch, had come into my home, and into my body, if only for those few minutes.</p><p>After about a half an hour, I felt nearly one hundred percent again, I smoked a small joint, and sat on the couch, and talked with Lorraine about everything I had seen and felt, understanding that I should feel blessed for the experience that I had the privilege to be a part of.</p><p>Some call this drug the nightmare leaf, but in the two times I have experimented with it, both times with very high potency stuff, I have had no adverse effects.  The only negative aspect I came across was a feeling of fatigue and that slight, druggy aftermath that comes from doing anything that so readily alters your perception.</p>"
}
