{
 "title": "IV in Hospital",
 "author": "Colin",
 "citation": "   Colin. \"IV in Hospital: experience with Diphenhydramine (ID 58309)\". Erowid.org. Jan 6, 2007. erowid.org/exp/58309",
 "substance": "Diphenhydramine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Diphenhydramine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58309",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 6, 2007",
   "Views: 13044",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I thought I would submit this experience because it is different than any of the other diphenhydramine/Benadryl experiences I have read. It is unique because it isn't a 'recreational' experience, and it is unique because the effects I experienced are so different from those experienced in other reports.</p><p>Background:</p><p>I was 19 years old but for whatever reason had extremely enlarged tonsils which had to be removed at the local hospital in Novato, California. In retrospect, I wouldn't stay at this Hospital again if my very life depended on it.</p><p>Post-op I was allowed a shot of morphine every three hours, after the first shot I had a bit of a red flush around my right arm that itched a bit. This is completely normal and not something to worry about, it happens to virtually everyone who receives a shot of morphine the first or second time especially, but the nurse decided I was allergic and that is why before my next shot of morphine she decided to give me a dose of diphenhydramine intravenously.</p><p>My experience:</p><p>Immediately, even before she had finished giving half the shot, I felt a sharp, cold sensation climbing up my vein which was rather unpleasant. I then felt a coldness throughout my entire body and my teeth began to chatter rapidly. I felt very uncomfortable and within about 15 seconds my entire body began to shiver uncontrollably. A few seconds later I was experiencing the extrapyramidal symptom 'akathisia' meaning I felt an irresistible urge to move my body.</p><p>In my subjective experience the nurse was enjoying my suffering because she had a strange smirk on her face, and delighted in telling me that in fact she wasn't going to give me the pain medicine I needed. I became very frightened and then had the sensation that someone had hit me with a baseball bat with the word 'Depression' marked on it. I felt panic and sadness wash through me. The head nurse came in and relieved the fat smirking psychopath nurse of her duties. Eventually, the shivering stopped and I fell into the typical Benadryl-induced stupor and passed out.</p><p>Interestingly, the head nurse later confessed that this was the second time she had seen someone experience this exact experience after IV Benadryl, which she described as: 'similar to delirium tremens'.</p><p>Note: I never actually received the second, intended shot of morphine, if you were wondering why I didn't list it.</p><p>Thoughts</p><p>I have thought about WHY I had this reaction. Perhaps the route of administration made all the difference. I have wondered if there is an antagonist effect of diphenhydramine on opiate receptors and perhaps the symptoms I experienced were just a form of 'kicking' my last dose of morphine. Also, like I said: working with the nurse I noticed there was something 'off' about her even before this incident, so I have to be open to the possibility that whatever she gave me was not Benadryl at all!</p><p>~Colin</p>"
}
