{
 "title": "Rocket Fuel For the IQ",
 "author": "DMM",
 "citation": "   DMM. \"Rocket Fuel For the IQ: experience with Nutmeg (ID 584)\". Erowid.org. Sep 14, 2000. erowid.org/exp/584",
 "substance": "Nutmeg",
 "bodyweight": "127 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Nutmeg",
   "(powder / crystals)",
   " ",
   "2 Tbsp",
   "oral",
   "Nutmeg",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 584",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Sep 14, 2000",
   "Views: 28363",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nYesterday I experimented with nutmeg for the first time after reading quite a few reports and articles on it.  What I did was put 2 tablespoons in a cup and add water, I then proceeded to choke down this vile drink (made me gag and make some WILD faces).  Within 20 minutes I began to feel light headed, dizzy, relaxed and in somewhat of a euphoric state, but it wore off much sooner than I had expected (from user experience reports I had assumed longer, more intense results) thinking I had taken too small a dose I proceeded to take another 2 tablespoon dose, again the same result, which intensified when i decided to go to sleep.</p><p>Upon waking up I had no hangover and felt quiet open and creative, I was also very talkative and may have annoyed many people, oh well. Along with this wired, hyper, talkative sense of alert readiness I also experienced a sense of hightened intelligence which allowed me to hold an intelligent conversation bringing me somewhat closer to someone I can now consider a 'personal' friend and believe she thinks the same way too. All this without fear of being ridiculed or made to look like a nut, thanks to a wonderful spice called nutmeg.</p><p>I do encourage at least one experience with nutmeg to everyone, but after reading all you can on it, and know the risks.  I am going to discontinue use in hopes that I can live like this without aid of any substances, with a new sense of maturity and trust.</p>"
}
