{
 "title": "Yes, I Am",
 "author": "Journeyman",
 "citation": "   Journeyman. \"Yes, I Am: experience with LSD (ID 5842)\". Erowid.org. Feb 5, 2002. erowid.org/exp/5842",
 "substance": "LSD",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "300 ug",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1967",
   "5842",
   "Male",
   " ",
   "Not Given",
   "Feb 5, 2002",
   "13385",
   " "
  ]
 ],
 "report": "<p>\nIn 1964 my mother, a devout religious person, died of a debilitating disease. She had raised me in her religion, but on her passing I was stripped of all faith. If there was a God, how could he have deprived me, and the rest of the world, of the benefit of the most angelic person I have ever encountered? I was bitter and confused, and stayed that way until 1967. Then, on leave from military duty and visiting a friend in California, I had occasion to try LSD for the first time. I knew about Timothy Leary's experimentations, and the term 'religious experience' had loomed in my mind for some time. I was in need of a sort of restoral of faith, needed to know that there is some reason and rhyme to life. </p><p>I was given a tablet to swallow by my friend, and sat back against a pillow to wait for the onset of I knew not what. Ravi Shankar's sitar music flowed from the stereo, the room was decorated with tapestries and oriental rugs, mellow lighting made the room warm and comfortable, and incense burned in a wooden holder. My friend and I were dressed comfortably in Indian gauze shirts and loose bell-bottoms and talked softly of times we had shared and things that we'd experienced since we'd been apart. Conversation eventually dissipated into a peaceful silence. As I sat there the room slowly faded from my vision, being replaced by visual memories of the day. Then I was remembering the day before, and the day before that, and every day of my life in vivid brilliance. Memories were not cluttered by experience. On the contrary, they were exact experiences of the original occurences. Emotions were repeated and the sensorial memories were in full detail. I relived every day of my life in reverse order. </p><p>The sorrow of Mom's passing was replaced by the joy of her presence in life. I once more felt her gentle caress in my hair, heard her soft words of encouragement. I remembered being a small boy with a skinned knee whose pain dissolved with a kiss to 'make it all better.' I remembered her holding me in her arms and pointing out dewdrops on rose petals in the sunshine of a morning in 1947, the year I was born. I remembered the shock of coming into a world of cold and noise at birth. I remembered the pink and purple abstract swirls of light filtering through her flesh as I floated inside her, and the undecipherable sounds of softness and harshness that had been her and my father talking. I remembered the awareness of being. I remembered a little 'ding,' the sound of a chime, and a spark of light that was my transference to physicality. I remembered being free in the universe, stars and all of space around me, and I had the capability of being anywhere or everywhere all at the same time. </p><p>I picked a star and focused on it, and found myself approaching it. You've all seen Star Trek's introductory scene. I don't believe the show was out yet, at least I'd never seen it. That star loomed larger the closer I got to it, and it dawned on me that I may crash into it. But somehow I knew that was the ultimate point, and with that, actually entered the star. I found myself in a place of pure light, a place where all power was centered and all souls were one. I was a creature of light, sharing light and love and power with all the universe. I was an individual part of the all, as a drop of water in the ocean. I was home. I knew that I was a part of the universal energy, love, and power. I had found God and knew that we all, and everything that is, are one. It is said that God is everywhere and in everything. Yes, I am. Yes, we are. Yes, all is. We are tendrils of light intertwining to gather pure experience for that to which we are all tethered, and so the universe is in constant expansion. Profound revelation! The first of many to follow. </p><p>The room faded back into my vision, and I was cleansed and illuminated. My friend didn't understand all I tried to relate to him, but did listen intently and tried to fathom where I had been. We both slowly came down, munching on grapes and cheese. I had found the religion that I needed. I continued to take the sacrament (LSD) into the early nineties, and continued to have the cosmic experience, much more than distorted reality, the truly transcendental trip, until I had explored all the dimensionality of the universe. My last trip took me beyond seeing the galaxies merge into cosmic beings, to the point where all creation merged into a little pinpoint of light in the void. I realized that if I went further than that, I would lose sight of creation and be lost in the void. That's okay, if you want to be a lone God and create a new universe, but, hey, I got a life here. And a Purpose. You. I now live a serene life, have taught my children well, and cherish my faith and my memories. Maybe one more time, when I'm ready to check out of this hotel. I want to enjoy my grandchildren a while longer.</p>"
}
