{
 "title": "Compulsive Nature",
 "author": "Supercharged",
 "citation": "   Supercharged. \"Compulsive Nature: experience with Methylone (ID 58453)\". Erowid.org. Jan 8, 2007. erowid.org/exp/58453",
 "substance": "Methylone",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "IV",
   "Methylone",
   "(liquid)",
   "  T+ 0:25",
   "250 mg",
   "IV",
   "Methylone",
   "(liquid)",
   "  T+ 0:40",
   "250 mg",
   "IV",
   "Methylone",
   "(liquid)",
   "  T+ 1:00",
   "50 mg",
   "IV",
   "Methylone",
   "(liquid)",
   "  T+ 0:00",
   "  repeated",
   "IV",
   "Methylone",
   " "
  ]
 ],
 "footer": [
  [
   "2006",
   "58453",
   "Male",
   " ",
   "Not Given",
   "Jan 8, 2007",
   "13677",
   " "
  ]
 ],
 "report": "<p>Aquired 1000mg of Methylone (bk-MDMA) previous experiments with this compound promoted a friendly euphoria, so this time I will inject 1000mg in the space of 5 hours. Obtained 1cc syringes , filters, swabs and a spoon.</p><p>T+ 0 hours.. Prepare 200mg of Methylone, dissolve in sterile water and filter accordingly. Methylone dissolves very well in water and I can saturate a solution which appears a shade of yellow. I mainline solution into middle arm.. the time to blast off has arrived !</p><p>T+ 5 seconds.. Solution has entered bloodstream, I am dizzy and lightheaded, this feeling is replaced by intense euphoria and rapid heartbeat.</p><p>T+ 1 minute.. I am laying on the sofa, I am aware of the intoxication and I am into it. This is intense exactly like MDMA but with more speed like effects.</p><p>T+ 20 minutes.. Much of the euphoria has subsided and I am left with the feeling of energy and alertness. I prepare another syringe for injection.</p><p>T+ 25 minutes.. I prepare a solution in syringe of 250mg Methylone, repeat injection again the feeling of dizziness returns and is replaced by intense euphoria once again. I am complete once again. Now I remember why I do this, this is totally awesome, this is what life is all about ! I am there.....  bliss !</p><p> T+ 40 minutes.. Again I prepare 250mg solution of Methylone. This  compound is addictive. I am chasing that intense feeling I found with the first couple of injections. Seems to me that the feeling has diminished slightly and an urge to inject more repeats itself.</p><p> T+ 1hour.. It's time to inject again. This time I divide the 300mg into approx 50mg doses. I can make this substance last if i want but the urge is still there. I use the remaining 300mg in the space of a few hours with not the same type of intensity that was exhibited with the first few trials. The compulsive nature of this compound presents a problem, it's just too damn nice ! If I had 5 grams I think it would be gone within a few days.</p><p>Conclusion :</p><p>Methylone acts like MDMA in all respects when injected, the only downfall is that reinforced injections have to be maintained in order to fully substitute that unique feeling I have with injecting MDMA. On the positive, I did not have any harsh comedown as with MDMA, even after 1 week no real side effects presented themselves. I would like to compare this compound with a trail of bk-MBDB when I have the chance. Until then safe injecting !</p>"
}
