{
 "title": "Fabrenzio's Batch",
 "author": "BK",
 "citation": "   BK. \"Fabrenzio's Batch: experience with LSD (ID 58457)\". Erowid.org. Oct 19, 2007. erowid.org/exp/58457",
 "substance": "LSD",
 "bodyweight": "224 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58457",
   "Male",
   " ",
   "Not Given",
   "Oct 19, 2007",
   "3939",
   " "
  ]
 ],
 "report": "<p>It was late after one of my favorite bands played in a small venue in Philadelphia, PA. It was about 1am when me and my best friend Matt were walking to my car as I heard the words being whispered 'doses doses' We approached the young lady, and she led us to her fearless leader Fabrenzio. We purchased 20 hits from Fabrenzio, and he quickly ripped us a strip of 20 off of his sheet.</p><p>As soon as we got into the car we called some friends to find the hotel we would be staying with for the trip, and I was handed a nice sized square of the colorful blotter paper and quickly administered it my mouth. As we arrived at the hotel destination, our friends told us they would be going to bed, and we would be forced to make the hour and a half drive home now.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>After about 40 minutes I began to feel the start of what would be the most intense tripping experience of my life. The first hour was quite pleasant. I felt a nice glow start to take over my body and made me smile very largely. We listened to some trancey music, and some TOOL. We both agreed that we had heard and felt parts of the music that we had never heard in the countless hours of sober listening before. I began to notice my speedometer to start the breathing effect and other various objects in the car. We engaged in very deep conversation of how much we appreciated the acid, and how it made us think of the world in many different ways. </p><p>The second hour is where it got interesting. As we arrived to our home town, I decided that a discount store would be an interesting location to walk around and talk since it was the only thing open early in the morning. As I pulled off the highway, and arrived at the stop light, the world melted. The first time we had stopped in approx 2 hours was at a stop light in front of a food store, where we had realized that the dose we had administered had been much larger than previous times. I had never experienced heavy melting and visual distortion like this before. All my previous trips had been only a hit or two, the most being 5 hits where I experienced a very mental experience, rather than a visual one.</p><p>I quickly realized that driving was very strange, and seemed dangerous, so we quickly arrived at the discount store. As we exited the car, we were encountered by men with leafblowers blowing garbage out of the lot, and large street sweepers floating across the spaces, which frightened me at first, but managed to keep my head remembering the potential of this drug. Our entrance was amazing, the lights and aisles and cash registers all glistened and morphed beyond the most vivid movie depictions of LSD trips. As we moved throughout the store, I was very disturbed at the people we viewed. Many of their faces scared me and I questioned the moral stability of these people. I even recall a small demon girl running down the cereal aisle, her face was disasterous, it made me naucious to look at her disgusting expressions and horrible body shape.</p><p>We began a deep conversation about LSD and movies we thought were influenced by it, and we had wondered if Fight Club was at all involved so we decided to look for it. Strangely enough, after searching the large section of DVD's, and not finding our movie, we began to walk away from the area where we saw a small stand of mixed DVD's where the bright pink soap bar held by Brad Pitt on the cover of the movie stood out to me. We quickly snatched the last copy on this stand and made our way to the registers. Checking out was a complete disaster. I could hardly keep my composure as the old woman took our money and her face melted and her smile raged with her crooked yellow, monsterous teeth.</p><p>The third hour to the 5th hour is where it all began to go wrong for Matt, but was the most intense part of my entire evening, and most visual. We started the trek back to Matt's house about 25 minutes from the discount store. The drive was difficult and intense. The road would not maintain shape or perception, it altered constantly from being wide and short to long and narrow. The surrounding trees grew taller with the long narrow roads, and fat and colorful with the wide short ones. Stop signs changed there consistent shape, passing cars reminded me only of the cars in the animated classic Roger the Rabbit movie with their flowing shapes and inflatable appearance. We arrived at Matt's house where I could hardly park my car reasonably.</p><p>We made our way to the front door where we quickly realized that the door had been locked, and he was without his key. Now, this situation was sticky because his mother was sleeping and we wanted not to wake her and have her find us tripping out of our minds. We couldn't report to my house because my mother was already up, and I did not want to face her either, so we decided to sit at a diner and enjoy the trip. We made the drive to a local diner and as we arrived I had noticed that Matt had began to act strangely and had been talking about recent rough times he had been going through and was very upset about the situation he had been in, but I convinced him that everything would be fine and we made our way into the diner.</p><p>This place was really strange. The patterns, and shapes were plentiful and had made for quite a visually fantastic spectical.  The workers, and the owner which we had known from the many times we had visited before, had looked like complete circus animals. Their smiles widened and intensified with every movement, and made me uncomfortable. I kept convincing myself of the drugs powerful stimulation and that I could handle this powerful batch of acid. Even though I wasn't hungry, nor was Matt, we ordered mozarella sticks and water. The water tasted like straight pool chemicals, and made me sick to my stomach. I tried my hardest to keep the sick feeling out of my mind, but it persisted for many minutes. I calmed the feeling with a few bites of the mozarella sticks, but then shortly after realized that the cheesy sticks had been another bad decision. I felt even more sick now than ever, and it took my every inch of strength to hold back a sickening display in front of the employees. Matt had been answering most of my questions with other questions and seemed very distant from my focus but I paid no mind until these next events.</p><p>Matt and I had been talking quietly about acid at the diner as to not make it public that we were completely out of our heads. We both agreed that the two young female employees seemed very strange and they disturbed us both. When Matt suggested very loudly that we give them some acid to help this situation, I decided it was time to move on. As we attempted to leave, the display continued when Matt tried to pay our bill with his new Digital Camera. When the waitress refused this seemingly great offer, he quickly produced some money which the horse-faced monster accepted and let us go. The walk to the car is when I realized that something had gone astray with my best friend. He removed the camera from his pocket and clenched it in his little skinny fingers, or wait, are they fat and chubby?? Anyways, he raised the camera high in the air, and quickly thrust it towards the ground where it skid many feet. He added to the display by trowing his cigarettes and lighter away into the parking lot. I quickly ran to the camera and shouted 'What did you do, that was your camera.' He just looked at me and shrugged his shoulders with his hands out with a large smirk. His scruffy face annoyed me, and I knew that something was not right now.</p><p>Even though I tried to convince him he would be mad about this action in the parking lot, he didn't give a shit and we made our way to the car. Since we could still not goto either of our houses, and had no safe haven to play this trip out, we began our next leg of this trip in my car. We spent the next several hours driving in my car where I had discovered that Matt had been developing a 'Bad Trip'. He quickly became very confused and disoriented with himself. He was unable to keep a constant thought, and was very annoying to me. He would ask several questions to me, completely out of the blue with no real meaning or good answer. I can still remember the most amusing phrase of the evening which spewed out of his mouth more than a dozen times in that ride 'Am I alive, am I dead - or is this backwards?' I didn't know what this comment meant, or how to respond so I calmly tried to talk him out of his bad experience, where I think my words just played worse into the madness in his head. I had many thoughts that we had taken too much, or the doses were contaminated, or that we would be stuck in the trip forever.</p><p>After a while of driving, I could not sit in the car any longer with this madness, so I quickly started thinking of solutions that would help me, but none of them were logical, including the one were I drop him off at his house and leave him for his mother to deal with, which seemed the most amusing to me at the time. As I continued our drive around town, circling many of the same streets over and over again, Matt seemed to be coming out of his head trip and I began to realize that he was becoming coherent again. We decided to make our way back to his house where we could end the day by sitting in his basement. His mother was still sleeping but after ringing the doorbell, she quickly arose to let us in. She had discovered something in her son's face that made her believe we were in some sort of trouble and asked us many questions when we arrived that made me severely paranoid. We made our way to the basement finally where I put Fight Club and began to watch with my friend.</p><p>Matt turned to me several times asking what was going on, and repeated the previous funny phrase of 'Am I alive, dead, or backwards?' I had found that he was still in this bad trip partially and it took me many minutes to coerse him out of his dying head trip. He was still pretty out of it when his mother announced that she wanted to use the treadmill in the basement. So I decided to remove him from this potentially disasterous situation with a breakfast invitation that he quickly took and followed me to his front door.</p><p>When we reached the car he had snapped out of it completely when he saw his camera. Yeah it was bad. He attempted to turn it on and it just squeeled in agony from the broken components trying to move. We drove around a bit longer where for me the visuals were still very exotic and colorful. We discussed the previous nights events and both agreed to make our way back home for some sleep and food. I spent the next several hours awake around my house where I was still having very vivid hallucinations and a hard time getting the motivation to sleep. I finally slept around 4pm and made it out until about 9pm. </p><p>I could only think as I wrote this experience out, of how absolutely amazing the trip was, and how I had really been blown away with how powerful and long lasting the doses were. I don't know where this batch came from, or even how much we took but I do know that if you find a crazy mother fucker named Fabrenzio walking around with some crazy acid - give him my email :-)</p><p>P.S. - We discovered the next day we ate approx a third of the 20 hit strip (we're assuming) and we had surprisingly put about 125 miles on my car in just driving around the city after the diner. Crazzzzzzzzy</p>"
}
