{
 "title": "Purpose of Life?",
 "author": "coolguy",
 "citation": "   coolguy. \"Purpose of Life?: experience with Salvia divinorum (5x extract) (ID 58450)\". Erowid.org. Aug 5, 2009. erowid.org/exp/58450",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58450",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 5, 2009",
   "Views: 2520",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSalvia Experience 2<br>Last night I got really high and then took one hit of 5x salvia. <br>The horrific nature of true nihilism is unparalleled by anything else. First it takes a very strong mind to withstand the blinding despair caused by such a scenario. Nihilism in the sense that nothing exists except us, the egos. And the existence of us, the egos, is completely futile and purposeless, thus everything is a cruel joke. This computer that Im typing on right now isnt really a computer at all, its a figment of my imagination designed to distract me from the true nature of myself, which essentially is nothing. Because what is an ego, an idea, or anything, if everything part of that entitys conscience is filled with the knowledge of nothing. The very fact that Im able to type all this right now on this computer is what differentiates this existential moment in time from the salvia induced time period. I am aware of this nothingness and the nothingness in the world around me but am contented with it. <br>Last night was quite the opposite where my ego was screaming against the pointlessness of the world, but it was because my ego was one that composed something out of nothing for those other non aware egos. Imagine a row of dominoes a million dominoes long, but they arent dominoes, theyre egos. And each ego, it has a voice, and with that voice it is declaring the existence of what it is. So we have a million egos in a line each declaring that it is a book, a book on a shelf, a book on a shelf in a room, a book on a shelf in a room in a house, etc... Yet I am one of those egos, and when I said no, thats not what I was, I started to fight the alternate reality that salvia had created for me. Salvia wanted to root me down to one location (though this is the second real trip induced by salvia, my first was very similar even including the domino-like egos and the central motif of purpose of life as well as a sense of lockdown, couchlock) and feed me psychedelic bullshit about the world, and I fought it. Paradoxically I ate it right up, and so ends this trip report.<br>Add on after 3rd experience, I mistook my struggle for identity and purpose as those of the others, but they were placid and compliant, thus we were not egos, rather slaves, but to ourselves, for I see no master at the controls and no head dominance to which we serve. Thus I was the ego and the one who had to struggle.\n\n\n"
}
