{
 "title": "It Comes in Waves",
 "author": "Indelibleface",
 "citation": "   Indelibleface. \"It Comes in Waves: experience with Piperazines - mCPP (ID 58459)\". Erowid.org. Dec 31, 2006. erowid.org/exp/58459",
 "substance": "Piperazines - mCPP",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "oral",
   "Piperazines - mCPP",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58459",
   "Male",
   " ",
   "Not Given",
   "Dec 31, 2006",
   "Views: 17633",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having just moved back to Los Angeles after being significantly farther north in the boonies for the past six months, I decided to see one of my good friends, N, that I had not seen since I left. After reminiscing for a bit, we came to the topic of what we were going to do that night. I suggested that we try the last bit of mCPP that I had on hand. We decided to go for a modest dose of about 120mg, mostly because we already had two capsules conveniently filled with around that amount. We drove off to a nice, fairly expansive park (plenty of hills, trees -- the park actually stretched off into a lengthy state nature preserve), and took a capsule each while sitting in my Chevy Tahoe.</p><p>N started feeling effects before me at around the 45 minute mark -- she described herself as particularly sensitive to drugs in general. The first effects for her were a pleasant mood lift and a shimmering of light sources. I soon got effects as well similar to these -- a grand euphoria, not quite on the level of, say, MDMA, but it was markedly close. I was getting powerful color enhancement, but no fractal imagery like with mushrooms or stronger psychedelics.</p><p>At this relatively high dose the MDMA comparisons tend to be drowned out by the more significant psychedelic effects, which N described as feeling like a light dose of LSD or mushrooms but with a different, more serotonergic body high. I agreed. I'm used to taking around 30-50mg of mCPP, and at this dose, it felt more like a psychedelic than an ecstasy imitation, which I had described it as in earlier trip reports.</p><p>N got the giggles a lot during our trip -- something that is more of a psychedelic symptom than a trait of an ecstasy experience. At the park, we basically sat around in my car listening to music with my iPod (through the car stereo), which was very pleasant. Music sounded really good and immersive like on other psychedelics. We listened to everything from Porcupine Tree to The Flaming Lips to heavier music like Fall Of The Leafe's black metal material (which I think might have been the source of the giggles -- she found the growling funny!) I discovered that I can listen to any kind of music on psychedelics (including mCPP) and find it fascinating, whether it be atmospheric piano music or grating noise. Each has a purpose and a certain flavor to it. I think this really shows that sound itself is an interesting concept, and psychedelics help me find the inherent beauty in any form of music.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>We soon went home at about two hours into our trip (I obviously don't recommend driving while under the influence of any drug, but my home wasn't too far away, and the area is fairly calm and remote). At my house, the visual effects took a big upswing, but not in the sense of warping or heavy distortions of objects. I think the brighter environment of my living room allowed us to more appreciate the level of color enhancement and sparkling that we experienced. Everything just looked alive and glowed with a beautiful aura. I had trouble looking at a particularly psychedelic CD cover (King's X's 'Ear Candy'). The contrast between the colors just jumped at me and began almost staring back at me. It was tremendously captivating. Watching visualizations on Winamp was awesome as well. </p><p>At this point it felt, again, like a psychedelic as opposed to ecstasy. I believe that with small doses of mCPP, only the body high really manifests, while at larger doses the psychedelic effects take over, at least with my experience. MDA is like this with me as well. N got the giggles again when we were watching some random classic Jethro Tull videos online. I love Ian Anderson! I can tell he really believed in what he was doing.</p><p>Pretty soon, N went home, and I lounged around for a bit, ate a few bits of mint chocolate (I find no anorexic properties of this drug -- I'm able to eat just fine), and soon went to lay in bed. I had some disturbing closed eye imagery and a few strange thoughts, but a mixture of psychedelics and exhaustion tends to do this to me in any case. I fell asleep about an hour after I crashed in bed.</p><p>A few notes:</p><p>- I felt little to no nausea during my entire trip. On the comeup, I temporarily felt that I needed to spew, but after walking around the park for a bit, I felt fine, and decided I only needed some fresh air. N also felt temporarily nauseous, but never threw up either -- she tends to not vomit during psychedelics anyway.</p><p>- The effects do come in waves. I read this before my first experience with the drug, and I experienced the waves on the first try, but I assumed afterwards that I had implanted that idea in my mind and expected the waves, and thus experienced them, if that made sense. This time, I definitely felt them again without thinking about it, and I can confirm this happens. The only problem is that between waves, I felt a little uncomfortable and almost anxious, but not to a severe degree. Walking around seemed to alleviate that. The waves can be strong though, and are awesome -- it's almost like a second comeup rush, and then a third, and a fourth, et cetera.</p><p>- The comedown was unremarkable, except for a bit of a throbbing headache, which a lot of people apparently experience, and some fatigue. Compared to ecstasy, the comedown is practically non-existent.</p><p>After finally trying a significant dose of mCPP, I can say that this is an interesting drug in its own right, and it's definitely no imitation. It's like having mild psychedelic effects without a significant mindfuck, with an excellent, serotonergic body high. There are side effects that are less than desirable, including the aforementioned weird feelings between euphoric waves, some uncomfortable hot flashes, and a low-level nausea that crept in occasionally. All in all, this is not one of my favorite drugs, but it's definitely interesting. I may or may not try mCPP again, but I'm glad I finally realized that it's more than a cheap and legal ecstasy impostor. It's definitely got it's own character.</p>"
}
