{
 "title": "Extended Use Leads to [X]",
 "author": "Billie B.",
 "citation": "   Billie B.. \"Extended Use Leads to [X]: experience with Absinthe (ID 58461)\". Erowid.org. Jul 8, 2009. erowid.org/exp/58461",
 "substance": "Absinthe",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 glasses",
   "oral",
   "Absinthe",
   " ",
   "  T+ 24:00",
   "1 glass",
   "oral",
   "Absinthe",
   " ",
   "  T+ 0:00",
   "1 glass",
   "oral",
   "Absinthe",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 58461",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jul 8, 2009",
   "Views: 14506",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At the time I choose to begin experimenting with absinthe I was a student at a private art school in Washington State. I had been reading Emerson and studying the Impressionists: absinthe was mentioned as one of the 'substances of inspiration' used often heavily at the time. I did extensive research on the history of wormwood and absinthe, varied methods of consumption, and results. I painted a piece in tribute to the Green Fairy before ordering 'the bottle' from a site that had bottles shipped from all over Europe, but was centered in New York City. My package was expected to arrive the day before a large Halloween party, but ended up delayed until a week afterward, on a day that fell right before a vicious, violent breakup with a first love. While I had not consumed any absinthe before or during the ending fight, I had been, at the time, a habitual marijuana smoker for over 3 years, and even had a plant of my own growing the the closet, it should be noted that my blood was pre-saturated with THC. </p><p>After the fight, coming home bruised and broken, I saw the bottle, which I had planned to share with my ex-love, and thought 'Well, it musn't go to waste.' Use of mind altering substances at a time of mental upset and turmoil seemed logical.</p><p>I had found within the silverware I inherited from my hippy parents, a spoon perfectly suited for a 'traditional method' of preparation, though I used honey (as I dislike processed foods) as a substitute for a sugar cube. I poured cold water over the honey, through the silver spoon, into the emerald liquid, and watched it cloud. I drank it slowly, listening to my computer library of music set to random. </p><p>One drink produced minimal effects, a minor euphoria that set upon like a warm wave of tepid water, to where I would hardly, if at all, notice being overcome or coming down. With a second shot, more massive results procured, and a stream of poetic thought overtook my mind. When I went outside for a breath of fresh air, I witnessed an Aurora Borealis (which was confirmed by local news reports to have actually happened). I saw it as a sign that the night was not lost, even though my love was. However, the euphoria passed, and I was left morning come in a pit of manic heartbreak. </p><p>The coming night, my obvious choice: consume more absinthe.</p><p>In some of my readings the experience of absinthe was described as a three-fold journey. The first stage is the initial surface euphoria with minor hallucinations. If one keeps drinking, the second stage would be akin to a bad, but not excessively severe trip on mushrooms. If one makes it through, and keeps drinking (slowly and not to excess), upon reaching the third stage, the drinker experiences a kind of euphoric enlightenment. Through my extended slow usage, I experienced a variation of these three stages. </p><p>The surface euphoria stage was pretty much shot after the 3rd day. I was only drinking one drink a day after my initial night (if my memory serves me), but was doing so with regularity, keeping a certain amount of it in my system at all times and adapting and learning to function on the high. Slowly, I began to shift in and out of hallucinations, to where I would not realize I had been hallucinating until after the fact: 'How did I end up on the other side of town with two different shoes on and a giant walking stick?' </p><p>The media I was surrounded with only furthered the depth of my experience, I would turn on the T.V. and it would be a colorful documentary on String Theory. I was given a gift of the works of Joseph Campbell: I sought my bliss, myths were all around me.</p><p>In brief moments of grounded lucidity, I would attempt to redirect my will and 'come back to earth', only to take flight again, to slowly slip back into the warm green and now more tumultuous waters. It was at times very frightening, but with a great sense of fantasy, and allegorically so: it felt  as if I were a character in a fairy tale. I was afraid of the trolls and the witches, lost in the dark woods, but at the same time knew I would come out on the other side. This does not mean I was not incredibly lucky with how the 'bad stage' of my trip went: at times I was talking in clicks and walking the same square block of street in circles, with the impression I was some how climbing a mountain. I nearly got hit by traffic, twice. I cut off all of my hair. There was a painful restlessness consuming me.</p><p>The slip into the third stage was just as gradual as the slips into the earlier phases of the hallucination, but ending far more intense than anything I could have expected. I cannot be sure of the exact times of the stages throughout, time slowly disappeared.</p><p>I found myself out of body, witnessing my body dance in uncontrollable bliss. I found myself in three places at once: watching myself watching myself. I found myself watching myself as 'The Morning Star', pleading with God for forgiveness for challenging 'the throne'. I found myself as God comforting myself, explaining why what happened needed to happen, welcoming myself back to heaven. I felt such brightness and bliss, I lost time and myself. I was everything and every creature. I was the stars, I was the soil.</p><p>But, though I had been studying and practicing meditation techniques and was familiar with many different forms of 'self awareness' in many different cultural settings (from Shamanism to Buddhism to Christian Mysticism), I was unprepared for the psychological and spiritual come down. Perhaps it was the circumstances surrounding, with my recently failed relationship, but for at least a month after the trip was over, I was beyond shattered, and continued with varied forms of grandiose thinking. I had flown too close to the sun: my wings melted, I crashed. Luckily, a strong support group of family and friends helped me piece myself and 'basic reality' back together, though for me it required complete sobriety. When I was finally pieced, I had gained a great perspective to of the heights and depths of human experience. Still to this day, I cannot be shaken and everything shakes me: I have no ground and I am always grounded. There is no ground, and with every step I can not but walk the path.</p><p>'To see a world in a grain of sand,  And a heaven in a wild flower:  Hold infinity in the palm of your hand,  And eternity in an hour.'</p><p>-William Blake</p><p>[Reported Substance: 'Absinthe, residual marijuana from habitual consumption']</p>"
}
