{
 "title": "2C-B Dosage Comments",
 "author": "anubis",
 "citation": "   anubis. \"2C-B Dosage Comments: experience with 2C-B (ID 5849)\". Erowid.org. Mar 24, 2001. erowid.org/exp/5849",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "1996",
   "5849",
   "Male",
   " ",
   "Not Given",
   "Mar 24, 2001",
   "37497",
   " "
  ]
 ],
 "report": "</p>\nBecause of the sometimes very unpredictable nature of 2C-B, trying to describe what dosages might be like for someone is difficult, but here is my input based on much reading, experience and talking to others:</p><p>[erowid note: Its extremely important to realize that each person reacts very differently and requires different dosages, some people react to 5 mg in the way he describes 15mg, and others report requiring 25mg to feel much of anything.]</p><p>5mg - A feeling of things being slightly `different', a mild sort of buzz and generally quite relaxing. Thoughts remain pretty logical and rational. This dose is quite nice as a general pick-me-up or something to take before a social occasion. </p><p>10mg - One definitely knows that the world has changed. Colours seem slightly brighter, thought processes become more trippy. Music sounds much better. All very manageable. I wouldn't of course recommend driving, but I have found myself quite capable of doing so at this dose.</p><p>15mg - Multiply the last paragraph by two. Slight morphing and patterning starts to become evident. Objects start to seem much more rounded and organic. Various physical symptoms such as a slight rise in body temperature, slight thirst, increased heart beat. Sensuality starts to get quite pronounced.</p><p>20mg - Approaching the true shores of psychedelia. Strong patterning effects (though these tend to decrease the more one uses this compound). Body often feels really great, sensual, and co-ordinated, but not a good idea to drive a vehicle in this state. With eyes closed there is much shifting colour, internal imagery and a general state of pleasant reverie. Excellent empathogenic interaction with others.</p><p>25mg - A true psychedelic state that could be aptly described as a sort of blend of a comparatively low dose of mushrooms (2 grams of dried cubensis) and 75mg of Ecstasy (ie half a conventional tab).</p><p>30-35mg - Very Powerful psychedelic effects. With eyes closed one enters into all sorts of visionary realms, however one's sense of time is not terribly affected as is usually the case with most other major psychedelics. However at these doses the general body load starts to become problematic with slightly unpleasant amphetamine symptoms starting to become apparent (jaw clenching, and towards the end of the experience, a feeling of physical heaviness and lassitude).</p><p>I personally would not recommend going beyond a 35mg dose. Some postings have spoken of doing amounts in excess of 100mg. I'm not a medical man, but my gut reaction is that these ultra high doses are ridiculously and immensely risky - even if it does take this much to create an effect in very resistant people. If you are one of the minority of people who are unaffected by the accepted empathogenic/hallucinogenic dose of 2C-B (put at 15-25mg by Shulgin) then try and find something else to get you off.</p><p>As I have commented before on this forum, the effects of 2C-B can vary considerably not only from one experience to another, but also within the experience itself. If you are lying motionless on your bed you may experience one set of effects; if you get up and go for a walk you may suddenly feel that you are on a completely different drug altogether.</p><p>I think that this is certainly the easiest to handle psychedelic around - probably because one's ego stays pretty well intact, thus enabling one to cope with most things, such as unexpected visitors, phone calls etc. If one has never taken a psychedelic, this is the one that I would recommend that a person takes for their first experience - with a dose of about 15-20mg. Call this a nursery slope drug/dosage for first-time psychedelic explorers. However at dosages above 25mg the nursery slope analogy definitely starts falling away.</p>"
}
