{
 "title": "Insect Wars",
 "author": "Melter",
 "citation": "   Melter. \"Insect Wars: experience with Mushrooms (P. cubensis) (ID 58502)\". Erowid.org. Jan 30, 2007. erowid.org/exp/58502",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58502",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 30, 2007",
   "Views: 2638",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nFirst of all, I want to emphasize that this was not in any way what I would consider a bad trip. Intense, bizarre, terrifying? Certainly. But it was also one of the most illuminating experiences of my life. It occurred soon after a mystical hitchhiking journey across Canada. My psyche was charged. Heres what I wrote about this trip to a friend soon after it occurred:<br>This past weekend, me and my brother Drei and 2 crazy Chileans were in Whistler, a white fat-ass-rich ski resort a few hours from Vancouver into the Rockies, white and rich the way mounds of cellulite are when they're green with stuffed dollar bills. We were staying at a friend's house, a modernist villa with a jocose. The 2nd night we were there the boys and I decided to cook a magick mushroom omelet. I don't know exactly how many of the logos-gnomes settled into egg yolk country, based on my previous experiences I assume that it was something around 4 grams, which is not a big dose for me since I usually eat more than 5 grams. As the boys took off into town, I laid on the couch while the gnomes swung the doors wider and wider, soon unhinging them altogether. Things got weird, again.<br>Chronology and description, as always with such experiences, is at this point scattered and vague. Yet here is what distortedly and fractionally transpires into baseline and it's incompetent language at present:<br>I begin to feel 'the other'. There is at first hallucinations of insectile membranes accompanied by the distinct chirping of alien insects all around me. I feel something formless, something undefined and undefinable trying to break free from inside my flesh, something of enormous energy, ripping thru from within, thrashing.<br>An elastic hyperfrequency tubular trunk descends from up above straight into my head. This wormhole-like thing passes thru itself and into me some kind of other-dimensional matter, as if laying an alien egg into me. My human/monkey-mind and body increasingly feels like a larvae from which an entity begins to hatch, ripping apart this physical larval membrane. It is hatching into an altogether different space densely inhabited by alien sentience.<br>At first this newly-hatched being is terrified and powerless, hissing and clawing like a frightened kitten, as it is held by something vast and infinitely more powerful. Even though the hatchling is in a state of primal fear and predatory self-defense, that which is holding it seems benevolent and friendly, compassionate even.<br>Soon however, this other-dimensional hatchling that I've become bursts open, like a poison-thorned flower of doom, into a colossal insectile juggernautic war-machine with a vast and exponentially increasing number of insect legs that resemble a praying mantid's spiked raptorial graspers, the mantid's front legs which it uses to grab and hold prey and from which it gets its name. The end segments of these legs are razor sharp blades, many of them spinning and vibrating in various deathly manners. This enormous monstrosity, abysmally horrifying yet slick and stealthy, finds itself surrounded by a swarming army of dark demonic entities. And before I, now this creature, know anything else, I charge at them.<br>I don't recall, as a human ego, ever being both so terrified and enraged. In my new transcended form I am now fully engulfed in a nonhuman war trance, hacking slaying impaling ripping apart battalions of entities in this nightmarish carnage-macabre, this ghastly feast of destruction, a great battle against diabolic darkness.     <br>Anything that dares move anywhere in my perceivable vicinity is immediately torn to pieces by my infernal forest of thousands and thousands insectile sabers. Yet at the heart of this killing machine is my 'higher self' (for lack of a less kitschy word), a humanoid warrior of clear light and pure intent, calm and focused on the path towards Absolute True Freedom of All, his war-shell violently reducing to mere shreds anything that dares to obstruct.<br>In my human form, I feel like an entranced samurai, both fists clenched around ethereal swords, every thought and feeling a glimmer, a blood streak on these swords which are directed completely as graceful instruments towards the art of war.<br>In human time, this continues for hours. There's much concern for my human form. Did I rip open the veil too wide this time? Will I be able to shut away my larval human self from this frightening world in which such a self is so vulnerable and defenseless?<br>Eventually I came down of course, exhausted. Yet the so called 'occult hangover' persists. What was this realm, so terrifying yet so beautific and empowering, that the sacred fungi ushered my awareness into? Interestingly, even in the middle of this battle, the not fully obliterated geek in me was still able to conceptually define this experience in words that were roughly such: 'This so called 'occult realm' that I am currently experiencing seems to be, to the best of my interpretation, an alternative (to the baseline human/monkey-mind) quantum holographic matrix cocreated with whatever other ungraspable forces of the universe with our archetypal psychic material. Yes, I think with this the geek in me was satisfied.\n\n\n"
}
