{
 "title": "Very Mild",
 "author": "Zam",
 "citation": "   Zam. \"Very Mild: experience with 2C-B (ID 5852)\". Erowid.org. Mar 24, 2001. erowid.org/exp/5852",
 "substance": "2C-B",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-B",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1996",
   "ID: 5852",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 24, 2001",
   "Views: 23468",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAuthor: male, medium psychedelic tolerance, ingested 25 mg 2cb. Female, low tolerance, ingested 12.5 2CB.  This was my second time trying 2C-B and was almost enough to not try it again.</p><p>2CB form: small reddish tablets, bitter tasting.  'Ubalawu Nomothotholo'</p><p>Male: T+0.  Started bottling home brew beer. At 40 mins, mild, unpleasant stomach feeling (not nausea) start feeling of impatience, nervous tension, with the psychedelic cold feeling.  Finished bottling beer and layed down in front of a fire and noticed pronounced star-auras around candles in room.</p><p>Female: started to get anxious feeling and wanted company away from the busy work of bottling beer.</p><p>I had some mild sensation changes, touched my lips and noticed that the feeling of pressure took several seconds to go away.  My hands felt like they were merging slightly with the things they touched, but this was extremely mild and would go away unless I was concentrating on it.  Slight confused feeling, but otherwise no changes in thought patterns.  Smoke a bowl of KGB.</p><p>At 2+ hours, we both noticed interesting aural effects.  While we were lying on the ground about 8 feet from the stereo, we noticed that very slight head shifts changed the apparent direction from which the music was coming.  We lay on a blanket and played with this and discussed it, as it was pretty much the only thing that was a noticeable effect.</p><p>T+2.5 Hours, headache started.  Somewhere before 3 hours, feel 'over the hump' and start to feel hungry.  Ate some nuts and fruit.</p><p>T+3 hours, continue to feel toxified.</p><p>T+4 hours, headache gets a little worse.  No serious perceptual distortions.  During the entire course, I tried to notice positive sensual effects and tried to use the weird energy to produce sexual energy, but never found anything that would qualify as particularly 'good' about the effect.</p><p>At about 6 hours, started restless sleep, normal to slightly high dream activity, woke up at about 15hrs and had a severe headache (I never get headaches, normally) that pounded when I moved.  Ate fruit.  Took 200mg Ibuprofen and watched a movie.  At 17+ hrs, took additional 200mg ibuprofen. Felt very low energy, 'cranky', abnormally edgy, movement made headache worse. At 27+ hours, headache reduced slightly, still felt mildly 'muddled' and foggy.</p><p>The female's time course was very similar, but she experienced more anxiety and 'nervous discomfort' than the male, although she got only a very mild headache during comedown and none the next day.</p>"
}
