{
 "title": "Stat Treatment for Breakthrough Depression",
 "author": "The Blank",
 "citation": "   The Blank. \"Stat Treatment for Breakthrough Depression: experience with Carisoprodol (Soma) & Clonazepam (Klonopin) (ID 58523)\". Erowid.org. Nov 17, 2008. erowid.org/exp/58523",
 "substance": "Carisoprodol (Soma) & Clonazepam (Klonopin)",
 "bodyweight": "157 lb",
 "header": [
  [
   "DOSE:",
   "700 mg",
   "oral",
   "Pharms - Carisoprodol",
   "(pill / tablet)",
   " ",
   "0.25 mg",
   "insufflated",
   "Pharms - Clonazepam",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58523",
   "Female",
   " ",
   "Not Given",
   "Nov 17, 2008",
   "19388",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm a certified pharmacy technician in a hospital with rather shoddy inventory control, at least with unscheduled substances such as Soma. Occasionally I'll also come across a stray controlled substance -- in this case, 1 mg clonazepam.</p><p>I suffer from major depression and panic disorder, and take 40 mg Prozac a day, plus the occasional mg of Ativan as needed.</p><p>One fine evening, I felt like shit. Really, really depressed. I had to do something to cheer myself up before I just crawled into bed and cried all night. I figured this combination could only help. I'd used Soma in the past, but this was my first experience with Klonopin. After eating something to prevent stomach irritation I tend to get, I took two 350 mg tabs of Soma. As for the Klonopin, I started small, approximately 1/4th the tab, crushed and snorted over the course of several minutes. Not unpleasant. Shortly after, my nose felt very cold, almost as if I had snorted snow. Odd, but not painful or worrisome. I would guess it was local vasoconstriction, and thus would not recommend snorting this regularly. Any drip was virtually tasteless.</p><p>From my original, unexpurgated report at the time, approximately 45 minutes post ingestion:</p><p>'Dancing to Goldie. Feel great. Getting a nod of sorts.hard to stand up. whee. spinning on my chair is a lot of fun. Felt the urge to put on some makeup, so I did. basically random scribbles around my eyes.' </p><p>Then my sister and her boyfriend came over to take me to a party I forgot about. Was a relatively boring party, but I had fun. I'd definitely call this a party drug combination. Not overly sedating, felt like dancing, everything silly. I probably wouldn't attempt to drive under the influence, but otherwise, I was normally coherent and cognisant. I felt very inspired, artistically, and probably would have ended up painting or drawing if not for the party. </p><p>I wouldn't recommend this as a chronic treatment for depression, but it snapped me out of a near-suicidal mood. Similar to good marijuana, life was magical and interesting, the world my canvas to create upon.</p><p>I took another .25 mg of the Klonopin days later, when I went bowling with some people and had to be surrounded by rude, prissy teenagers and their horrid music. The Klonopin quickly erased any anxiety, and I felt more outgoing and cheerful. I'm a benzo fan for life and recommend them highly to anyone who needs them.</p>"
}
