{
 "title": "Struck",
 "author": "Dullard",
 "citation": "   Dullard. \"Struck: experience with 2C-I (ID 58535)\". Erowid.org. Jan 15, 2008. erowid.org/exp/58535",
 "substance": "2C-I",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 58535",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2008",
   "Views: 2579",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThat was unexpectable,</p><p>I just ordered, in some drunken haze, this crazy chemicals from japan 100mg of both 2c-i and 2c-e, and was to be shaken by the way that stuff arrived so fast. You know I have lot experience with ordering trips from the internet (mushrooms and salvia-d) but this one was fast, especially when considering the distance.</p><p>So I eyeballed a 20mg dose of this 2c-i thinking it would be like these low-dose-cacti-trips I have had,... stupid me. [Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article]</p><p>Not that it was dangerous nor nauseating, not in any case, but It was an ultrastrong, clean and true psychedelic feeling and headspace. It didn't feel very different from mushrooms, but was definitely lighter on my body in this strength, which aficionados would rate a +++. It didn't cause schizophrenic ego-splitting or -loss what an equal intense trip on shrooms would have done at least in me. Thoughts were at some times so fast that I would understand a concept before even formulated to the end only to forget the meaning of it all again and go on with a new theme. Mood was cycling from blissful to depressed with in seconds. But it was still a worthwhile time, because I learned about some negative threads in my personality which should be removed. Oh and TV is so goddamn shallow - I will dissolve my cable-contract within the next days. </p><p>I can't comment on visuals because I always get very limited visual effects compared to other companions who I sometimes trip with, no matter what substance and dosage. Just some little movement here and there, but this time in an other way than mushrooms which I have vast experience with, not flowing but morphing. Interestingly I never can keep my eyes shut on a trip. </p><p>Electronic music was superb on this drug while rock was distracting. I would have loved some company for this trip, but all my friends don't want to mess with artificial chemicals. After 5hrs in the trip when thought patterns returned to almost normal, an overwhelming sense of satisfaction struck  me and I felt really, really good. I am writing this on that afterglow.</p><p>What to learn from this? All these trips from mushrooms to LSD and 2C-x are at least for me exact the same thing, with varying mental and physical side effects and duration. This chemical is a good one, and could be the acid of the future, IMHO, because the schizophrenic confusion is something most people don't feel enjoyable. I still got insight from it and there is always room for personal growth. Furthermore no nausea or stomach knots can distract one from thinking. Unfortunately it's getting successively banned in all the states around me, but it IS a true LSD, mush, mesc analogue at least in high dosage. </p><p>regards, a dullard</p>"
}
