{
 "title": "The Dark Side of Who's Razor",
 "author": "razor",
 "citation": "   razor. \"The Dark Side of Who's Razor: experience with LSD & Cannabis & Ketamine (ID 58559)\". Erowid.org. Sep 13, 2009. erowid.org/exp/58559",
 "substance": "LSD & Cannabis & Ketamine",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "3 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2 g",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58559",
   "Male",
   " ",
   "Not Given",
   "Sep 13, 2009",
   "2978",
   " "
  ]
 ],
 "report": "<p>I experienced insanity on LSD 3 months ago, and I still have trouble piecing together the events of that night. It was the day I had finished my final school exams, and in celebration myself and 3 other friends decided to have a bit of fun with some mind altering substances. It was roughly 6 months since we had discovered hard drugs (starting with ecstasy and moving on to LSD, and finally ketamine). Apart from these, we had been smoking pot for about a year. It was my second time taking acid.</p><p>The day started off with us driving to our dealer to buy 8 blotter tabs of acid. We'd had experience with the same blotters before and knew that they were very potent stuff (in our opinion). On the drive back we each dropped both of our tabs.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  20-30 minutes later the tingling sensation began along with that unmistakable sense of excitement.</p><p>We arrived at another friends house (he disagreed with hard drugs and was only joining us to smoke pot) and smoked a joint of chronic. This is where it all began... the hallucinations, which were very slight at first, began to become increasingly more intense. Sounds/sights/smells intermingled, and I was overwhelmed by the amount of information rushing in at me at an alarming pace. I sat back on my couch and it seemed as if my conscious and subconscious minds had swapped positions, as my conscious could not deal with the overwhelming amount of hallucinations. My friends tell me I was conscious at all times throughout the night, but it was as if they were talking to a person who was half asleep.</p><p>In the utter confusion and fragmentation that was my mind I completely forgot who I was, where I was, what drugs I had taken (what drugs were for that matter), who my family and friends were, and in my mind I ceased to exist. The utter terror of floating in limbo without form or sense is indescribable. It was as if I had gotten off at the wrong stop and was now stuck here for all eternity, and indeed it felt like eternity - even though the experience lasted only 6-8 hours.</p><p>Somewhere about 3 hours after the first joint I surfaced, and my friends, scared of the point to which I had lost sanity, offered me several lines of ketamine in an attempt to sober me up. On the contrary, the ketamine seemed to numb my body completely, meaning that I was lost in my mind and in my body and had no anchor to hold me down to reality. I slipped back into the dark hole of my mind.</p><p>My mind acted on the utter and complete terror I was feeling and in my insanity I was being ripped apart and crushed, dying, being stabbed and tortured for endless hours.</p><p>When I finally surfaced from my mind I refused to believe that what I was seeing was real. I was convinced that all of the things I was seeing were another trick played on me by my mind. I searched for ways to disprove that what I was seeing was real.</p><p>The sense of loss of reality lasted for about 2 days, until I forcefully stood in a rainstorm and soaked myself to the bone.</p><p>I have taken LSD several times since then and have had some very good times. The warning I am trying to communicate is to be aware of the possible downside to smoking pot on the comeup of an acid trip. My friends have all experienced insanity (although not to the degree that I lost it) when they have smoked on the comeup. Smoking 3-4 hours after taking the acid renews the trip and is an enjoyable experience.... </p><p>Acid is a valuable learning tool and allows you to look outside the box, however I would advise anyone seeking to try it to be very careful and do as much research as possible.</p>"
}
