{
 "title": "Look Back After My 6th Trial",
 "author": "Zam",
 "citation": "   Zam. \"Look Back After My 6th Trial: experience with 2C-B (ID 5855)\". Erowid.org. Mar 24, 2001. erowid.org/exp/5855",
 "substance": "2C-B",
 "bodyweight": "210 lb",
 "header": [],
 "footer": [
  [
   "1996",
   "5855",
   "Male",
   " ",
   "Not Given",
   "Mar 24, 2001",
   "Views: 15396",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hey all,</p><p>I had my first really positive experience with 2cb recently, at 18mg (I think this was my 6th trial of 2cb).  It was mildly disorienting and body-painful as it came on (first 1+hr), but settled into an interesting experience.  This is described elsewhere.</p><p>I had a single mildly positive experience with 7.5mg 2cb and rue, but 2 were _negative_, bad body feel, headaches, low BP, and 2 were not positive at all.</p><p>My understanding of 2cb now:</p><p>1) Its effects can be subtle and vary significantly with trial (based on my and several other VPL'ers experiences).  I've had the opportunity so far to only work with drit's tablets.</p><p>2) It seems to reduce my blood pressure to the point of getting motion-based headaches, as it comes on, as I come down, and for the next 24 hours.  There have been two papers which have shown 2cb's bp dropping effects (I was told this after my last experience because I was talking about the bp lowering effects)... (Refs given at bottom)</p><p>3) For me and a couple people I've talked to, the initial stages of 2cb are quite hard and I realized on my last trial that I really needed to try to relax into the experience and let the body and mind hard stuff go by... headaches and other body discomforts are common.</p><p>4) There might even be a 'learning curve' with 2cb for some people. I'll have a better idea about this when I try it again (prolly not too soon).  Another VPL'er has said that he needed several attempts before he was able to get through to something good.</p><p>On a personal note, my body has low BP normally.  If 2cb lowers BP, I may be more prone to the negative effects of this than others.  Is it possible that the rue + 2cb would increase BP to compensate for 2cb's action of relaxing the valves? For me, the next 24 hours after 2cb, I experience motion-sensitive headaches and get dizzy and vision-fadey when I stand up quickly.  I associate this with low BP.</p><p>I am considering trying some BP increasing herbs with 2cb next time.. ?</p><p>Refs:</p><p>Saez, P. Borges Y. Gonzalez E, Cassels, BK (1994).  Alpha-adrenergic and 5ht2-serotonergic effects of some beta phenethylamines on isolated rat thoracid aorta.  Gen Pharm 1994,25,pp211-216.  I apologize that I haven't read this, but was told by a reliable VPL'er that it discussed a relaxation in the aortic system.. and a drop in BP.</p><p>Lobos M, Borges Y, GonzalezE, Cassells BK (1992) the action of psychoactive drug 2cb on isolated rat thoarcic aorta, Gen Pharm 23, pp1139-1142)</p>"
}
