{
 "title": "Maintenance",
 "author": "Jeff F.",
 "citation": "   Jeff F.. \"Maintenance: experience with Clonidine & Methadone (ID 58552)\". Erowid.org. Aug 28, 2009. erowid.org/exp/58552",
 "substance": "Clonidine & Methadone",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "1.2 mg",
   "oral",
   "Pharms - Clonidine",
   "(daily)",
   " ",
   "70 mg",
   "oral",
   "Methadone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "1984",
   "ID: 58552",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 28, 2009",
   "Views: 15440",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Some years ago when I was a patient on a methadone maintenance program at a daily dose of 70 mg. of methadone.  I used clonidine to potentiate my dose and also as a sedative at night.  Clonidine was easy for me to get since I suffered from mild hypertension at the time.  My experience was this:</p><p>A dose of four 0.3 mg. tabs seemed to about double the effects of my daily 70 mg. dose of methadone and the same dose, for me, was a fast acting and powerful sleep aid.  At that dose, however, the side effects were considerable.  I would regularly experience positional hypotension (I would pass out sometimes if I stood up quickly) and I had extremely vivid visual hallucinations those times when I would awaken during the night.  </p><p>Also, after taking clonidine at the dose described above for a couple of months, I ran out of the stuff and thought nothing of it until mid afternoon of the first day when I began to experience classic opioid withdrawal symptomology - even though I had had my usual methadone dose at about 10:AM that day.  After a couple of hours feeling the symptoms getting worse and worse, I figured that my discomfort might have something to do with a lack of clonidine and ran to the pharmacy to get a refill.  Taking the clonidine again relieved the withdrawal symptoms in about 20 minutes.</p><p>Today, I am drug free for the last 20 years and work as a chemical dependency counselor in a behavioral health treatment center where the psychiatrists sometimes use clonidine in off-label ways.  One of them told me that he has prescribed cloindine (I don't know at what dose) for nightmares associated with PTSD.  I think it is also sometimes used to treat the symptoms of Obsessive Compulsive Disorder in some patients.</p>"
}
