{
 "title": "One Big Warm Hug",
 "author": "Giggly",
 "citation": "   Giggly. \"One Big Warm Hug: experience with Dihydrocodeine (ID 58607)\". Erowid.org. Jun 16, 2007. erowid.org/exp/58607",
 "substance": "Dihydrocodeine",
 "bodyweight": "11.5 kg",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Pharms - Dihydrocodeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "58607",
   "Male",
   " ",
   "Not Given",
   "Jun 16, 2007",
   "Views: 28478",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently Ive been stressed out with work and fancied trying a different approach to winding down rather than drinking myself into oblivion or smoking herb until I became a paranoid wreck. I also didnt have access to my usual drug contacts so decided to find an alternative way of getting high for the weekend.  I had heard through friends that a nice time can be had on codeine. Bearing this in mind, I asked round my circle of friends to look through their medicine cabinets in a bid to find some. The best I managed was twenty-five 8/300mg codeine tablets, the kind one can buy legally in the UK at the pharmacists in the form of co-codamal. </p><p>A mate explained to me the cold water extraction process that filters out the nasty paracetemol. However, I just couldnt be arsed with what seemed like a load of hassle and decided not to bother. At this stage I was thinking about forgetting the whole thing and was on the verge of just going to the pub to get rat-arsed when my girlfriends mate called. Her best friends dad had shattered his knee-cap five years ago playing football and was given a load of dihydrocodeine for the post-op pain. Turns out he took his first dose and felt sick on them so never bothered with them. The pills were tossed away into the back of the bathroom cabinet and forgotten about for the next five years. Apparently nobody would miss them and no questions would be asked as to their whereabouts. Perfect!</p><p>The pills arrived within the hour. This gave me time to read up about the stuff online. The thing I noted was that many users took a fairly high amount (120mg-270mg) in order to get wasted. However, I didnt fancy getting rushed to hospital to get a weekend stomach pump as a result of ODing. I started out with just one 30mg pill. Prior to ingestion of the substance Id eaten lightly (toast and cup of tea) and had smoked one weed joint. </p><p>Twenty minutes after the first pill I felt a very slight feeling of warmth and well-being. I didnt really feel the desire to do anything apart from watch TV. Smoking another joint increased the effects lightly and I decided to listen to music to see what effect DHC would have on it. Instantly I felt very into it and was nodding along to my favourite tunes quite happily. After an hour of this I decided to cuddle up to my girlfriend and felt quite contented. Eventually I fell asleep (mainly due to tiredness, not the DHC) and enjoyed a solid 8 hour sleep. </p><p>The first trial with DHC had gone well. However, I decided that the next time Id up the dosage and attempt to achieve the euphoria reported by some users. The next day I took three 30mg pills and went out for a walk alone in the winter sun. Again after a short time (20 mins) I felt the same warmth growing in my body but this time it was more intense and pleasurable. Right way I was relaxed, in an excellent mood and felt at one with the world. The more I walked the better I felt. I swear I could feel the warm blood in body pumping from my feet to my head and round again. The beautiful colours in the afternoon sky seemed even more dazzling than usual. Any time I passed by someone they seemed to smile at me and say good afternoon. It was like DHC created a positive bubble around me that radiated out and touched those around me. Everything seemed so pleasant. </p><p>At one point the muscles in my legs seemed so loose that a couple of times I felt I was gonna fall over. The buzz I felt was comparable to the nice part of an MDMA trip, where everything is just so mellow. The difference was that there was no harshness to the trip as I sometimes get with MDMA where one minute Im nicely relaxed then the next I get a full on speedy rush. DHC felt like one big warm hug. </p><p>Eventually I tired of walking around and decided to head home for a smoke. My girl commented on my pinshot eyes when I got in the door. You look fucked she said with a grin on her face. I am I replied with an even bigger comedy smile. She rolled me a fat one and we went to bed where we kissed, cuddled and eventually had sex. This surprised me as Id been led to believe that painkillers such as DHC can render the user impotent. This was definitely not the case. If anything it increased both the desire and the pleasure. Maybe I just got lucky! Anyway, I really enjoyed my DHC high those two times, especially the second occasion. I was only given the four pills or else I would have done some more. Maybe it was just as well as these pills have the ability to be highly addictive. I can see why people get a DHC habit and end up taking stupid amounts of the stuff to get fucked up. </p><p>Before I end this report there were a couple of minor negatives worthwhile mentioning. I noticed the second time I got quite an upset stomach afterwards. Not that this should be a surprise. Codeine is notorious for giving users constipation especially in larger doses. Secondly, I noticed a slight sore head the day after. Im not sure if this was directly the result of DHC or not but thought I should mention it.</p>"
}
