{
 "title": "I Became Gumby",
 "author": "Brad A.",
 "citation": "   Brad A.. \"I Became Gumby: experience with Salvia divinorum (10x extract) (ID 58600)\". Erowid.org. Sep 19, 2009. erowid.org/exp/58600",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 2:00",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58600",
   "Male",
   " ",
   "Not Given",
   "Sep 19, 2009",
   "Views: 2379",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background:  I am a daily marijuana user and had never tripped before so I was very excited to take the journey into the unknown. I had tried the same salvia 10x a few days prior but the only effect was loss of speech and uncontrollable laughter.  I had smoked marijuana about 2 hours prior to smoking the salvia.  I chose to do it in a friends room where I am completely comfortable.  I removed the water from the bong so I could get an even bigger hit (I was worried I wasnt going to trip just like the first time). I packed a small marijuana bud at the bottom of the bowl for a good base and packed about 4 pinches of the salvia into the bowl.  I had two of my good friends in the room watching me and everything felt right.</p><p>I lit the bong and ripped all the smoke I could possibly fit into my lungs, put the bong back down and sat back into the chair seeing if anything was going to happen, I dont even recall exhaling smoke.  Everything just seemed to blur like if I was looking out into the trees while driving on the highway.  Suddenly I felt as if I was sliding deep down inside the chair and falling through to emptiness.  I climbed up a little bit but when I moved something felt funny.  My body felt like it had melted into rubber and was flattened out just like Gumby, even when I moved I could feel myself being rubber.  The only thing bad about feeling like Gumby is that I wasnt smooth like him, it was rough like the bottom of a combat boot.</p><p>Suddenly I didnt care because I knew that I was supposed to be this way anyway, I am a flat rubber man and always have been, this is my life.  I looked up toward the wall because I could see movement and when I looked I saw that everything was the same rubber I was but different colors, everything seemed to be connected as well.  I focused on a piece of the rubber and saw that it was the number 10 but it was alive, it had eyes, right next to the 10 was a blue piece of rubber and as I stared at it I saw that it was a pair of pants and it was connected to the 10.  Suddenly the pants started to unzip but it went all the way down to the ankles and it was so clear to me that it wasnt just a 10 with pants, the pants where its mouth and the zipper was its teeth.</p><p>Everything started to close in at this point, I could feel the rubber pushing me, almost as if it was taunting me.  The 10 monster started communicating with me telepathically but in a language I didnt understand.  My friends told me at this point I started saying the pretzels and the 10s!?.  I tried getting up so I could find a safe spot because the rubber was getting too close and it was uncomfortable on my body. I got up and looked toward the 10 and saw more stuff start to unzip, once something unzipped it became alive.</p><p>I remember when I got up I saw the bed but it didnt matter what it was, I didnt know what a bed was for, I didnt know what anything was for.  I jumped onto the bed and it felt like an atomic bomb had exploded under me and the mushroom cloud that hit me was the softest material in the world and it engulfed my body, I was no longer rubber, I was the softness.  At this point I could no longer move but just stare.  I looked toward the tv and it unzipped and became alive.  The tv was just like the 10 and could communicate to me only this time I understood it and it wanted me to look at it, but what was it?  at this point everything had no meaning, everything in the universe was nothing and I knew it.  I knew that I was on something soft but to me it didnt exist.  It seemed that I had solved the question of what life was, it was nothing, and as I decided that more things started to unzip and fall, only when it hit the floor it broke through, and through the holes that were left was just an abyss.  </p><p>After finding the abyss I saw the door open out of my friends room and the craziest thing happened, I saw myself climb out of my body and walk out the door, but I could still see out of my real self, it was like I cloned myself and could always watch me from the 3rd person while I could still see out of my real self in the 1st person like normal.  I watched with double vision as my other self walked out of the door, it was so bright from the room that I couldnt really make out what was out there until I crossed the doorframe.  Once I was out there it was like reality was ran on a computer and it had glitched because everything was the same pattern of clouds and bright blue sky.  I was so curious I wanted to see and touch everything.  At this point I started to hear my friends voices from the other end of a tunnel, they were talking to each other, everything started to make sense again.  As I was coming down the open eye visuals began to cease and my 3rd person self disappeared, but when I closed my eyes I could see myself, the tv, and a chair just floating in that abyss, and I could feel my body being encased in the abyss, it was a nice calming feeling like I blended with the universe almost.  For the next 45 minutes or so I felt incredibly high and everything seemed to make more sense and everything was cool to look at.</p><p>I told my friends of my journey into the rubber world and they were freaked out, I was too at first, but I absolutely love seeing what my mind is capable of.</p>"
}
