{
 "title": "A Glorious New Year",
 "author": "Kryptonite",
 "citation": "   Kryptonite. \"A Glorious New Year: experience with LSD & MDMA (Ecstasy) (ID 58609)\". Erowid.org. Jul 19, 2009. erowid.org/exp/58609",
 "substance": "LSD & MDMA (Ecstasy)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:00",
   "2 drops",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 2:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 4:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 6:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 7:30",
   "4 drops",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 8:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "58609",
   "Male",
   " ",
   "Not Given",
   "Jul 19, 2009",
   "Views: 4761",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took a bottle of liquid acid to a friend's new year's eve party.  I usually take MDMA with halucinogens as it can help to reduce anxiety if things go pear-shaped.  I was very fortunate in that I had managed to procure eight very clean* pills and took five of these at roughly two-hour intervals starting two hours before the first dose of acid.</p><p>I took two drops of the acid under my tongue at around 10:30 pm with the intention of starting to trip after the new year had started.  The timing was perfect and shortly after midnight I started seeing bright colours and experienced the happy confusion that acid always brings to me.  At around 4:00 am I decided to take more acid as the trip was proceeding well and I wanted to trip harder.  I took another 4 drops.  Within half an hour I was tripping very hard indeed.  I had chosen an elevated location in the corner of the room where I could look down on the whole room and observe everyone within it.  I was aware that movement was becoming harder and that soon I would not be able to move at all so this comfortable location was something of a neccessity.</p><p>At the height of the trip I had the impression that I had two minds. My personality, which is never affected by acid, was looking in on my rational mind which was very strongly affected.  I could feel thoughts passing through my rational mind very slowly and these thoughts were always recursive.  I cannot recollect the precise nature of these thoughts but they were something like 'I could go across the room but in order to do so I must first move half way.  In order to go half way I must first move half of half way...'  I was also aware that no one else in the room was moving so I assume that these periods were actually very short in duration although they seemed to last for hours.</p><p>At the end of each period I would see people start to move very slowly and I had the impression that I was willing them to move and that they could not move without my will.  I concentrated on each person that I could see moving and they slowly gathered speed and would eventually move at normal speed.  After following this procedure with some five or six people the rest of them them started to move of their own accord and I no longer needed to 'help' them.  Another recursive effect was where the room seemed to expand from a point within itself.  The 'parent' room would be squashed by the expanding 'child' which would eventually fill the parent and take its place.  The precise mechanism of this effect is lost on me now but it seemed that this expansion was taking place in some external dimension beyond the usual three dimensions of space.</p><p>The entire room was decorated with UV reactive hangings and these provided me with the most glorious visual effects.  Everything shimmered with bright colours although there were no gross visual distortions and everything in the room was clearly recognisable.  In particular there were none of the gross distortions of faces which I have experienced with psilocybin**.  For the entire trip I was happy, relaxed and most of the time, utterly euphoric.  The euphoria was almost certainly due, in part, to the MDMA.</p><p>During the most intense periods the party room was the entire universe.  I was not aware of anything outside of that room and I had no concept of any geographical location.  This is a feeling that I deliberately cultivate when I go to an outdoor festival (the whole point being to leave one troubles in the larger world behind) but in this case it was not a choice or even a feeling that I tried to induce.</p><p>In my more lucid moments I felt very close to nature and at one with everyone in the room.  It is hard to describe this oneness, I was always located in my own body but I somehow felt that my body or mind incorporated the others in the room.  In contrast, psilocybin can induce a dramatic loss of self, both physically and mentally which can reduce me to a point of thought floating in empty space.  This is somewhat disturbing and annoying since it effectively removes me from the party.  Acid had never made me anxious, even when I have been anxious in anticipation of the trip when I first started to use it.</p><p>After the peaks had passed I spent many more hours experiencing strong visual disturbances of colour and light, although my rational mind was relatively clear.  The music at the party was especially enhanced.  The DJs were playing deep house and progressive house but I heard sparse, minimal techno.  I love this style of music and the transformation was very welcome.  These effects continued until around 5.00pm when they stopped rather abruptly.</p><p>The next day I awoke expecting to feel the body load that acid normally brings but there was none.  I felt fit and alert and there were no detectable residual effects at all, not even from the MDMA.  This was the most acid that I have ever taken at one time and it was clearly very strong, the strength was noted by others that had taken it and several of them said that they had had their hardest trip ever. Despite the strength no one reported any unpleasantness and many who had taken it said that it was their best trip ever.  It was certainly my best trip ever and a highly satisfactory way to see in the new year.</p><p>* By 'clean' I mean that the pills had the effect of pure MDMA with no side effects.</p><p>** I have previously tried psilocybin in doses from threshold to overwhelming (12 * dried psilocybe cubensis) and I find it too unpredictable and, at times utterly horrific.  I have had good trips on psilocybin but when your friends faces decay and worms crawl in and out of the holes in their flesh it is difficult to retain your composure!  I have since decided that psilocybin is way too unpredictable and I no longer indulge.  I have taken LSD on about eight occasions over approximately six years, usually small doses and the experience has always been entertaining and controlled.</p><p>Note: I am an atheist in the true sense of the word.  I do not believe that there is any mystical significance to halucinogens and I consider it the height of stupidity to make any significant decisions as a result of any drug induced mental state.  I take drugs for entertainment not for enlightenment.</p>"
}
