{
 "title": "Withdrawal Hell",
 "author": "Pea",
 "citation": "   Pea. \"Withdrawal Hell: experience with Duloxetine (Cymbalta) (ID 58611)\". Erowid.org. Jan 6, 2007. erowid.org/exp/58611",
 "substance": "Duloxetine (Cymbalta)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Duloxetine",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Pharms - Fluoxetine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 58611",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 6, 2007",
   "Views: 56148",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI'm on attempt #2 to get off Cymbalta and have had to go to a psychiatrist to help me get off it.  Unfortunately his help in getting me off it hasn't worked yet either.</p><p>What happens when I try to stop? Let's see.</p><p>I couldn't drive because when I turn my head I get a 'brain shock' that could cause dizzyness, distraction, etc.\rI would have a brain shock literally every 30 seconds to 1 minute apart.\rObvious nystagmus every few minutes\rTwitchy facial sensations and muscle spasms in face.\rNightmares, electric shock (brain zaps) constantly\rTerrible judgement\rPoor short term memory\rEmotional freakouts that wind up from 1- 10 within minutes and then dissappear if i recognize them and intentionally bottle them up.\rExtrememly debilitating nausea and diarrhea\rdrooling, weakness, dizzy coupled with extreme anxiety</p><p>\n\nThe first time I tried to get off it, I tapered over two months.  Three weeks after the last dose, I was still extremely affected.  I almost lost my job (doctor-level position), I almost quit my job.</p><p>I had about two months of hell trying to get off it. </p><p>So I'd be trying to pick up my clothes to get dressed in the morning and it was like zap zap zap grip wall zap pick up shirt zap zap nausea zap sit back down zap.  Then I'd be talking to someone at work and i'd have the zaps and want to say 'oh just dont mind my nystagmus, nothing to worry about'</p><p>I started taking it again to relieve the symptoms of the withdrawal / 'discontinuation syndrome'.</p><p>On my second attempt to quit it, the shrink put me on Prozac, a drug with a longer half life than Cymbalta (which like effexor has a short half life and SNRI effects).  The idea of Prozac low dose + Cymbalta low dose for 6 weeks was that when I withdrew both, the Prozac would still taper off more slowly with its active metabolites.  Now I'm up to day 17 after stopping the drugs and I'm still experiencing the brain shocks.   The psychiatrist put also put me on 0.5 mg clonazepam every 8 hrs and that helps but does not fully stop the symptoms: It doesn't cover it up but it helps.</p><p>The first time when I was trying to get off Cymbalta on my own, I was drinking at least 2 drinks a day and taking a couple vicodin a day to reduce the symptoms, but it was still barely tolerable.  The hydrocodone helped with the motility issues (reduced diarrhea) and made anxiety issues more tolerable.</p><p>I think that if the first, really BAD withdrawal period hadn't happened, I probably wouldn't be as keyed into noticing the signs now that they're blunted by Prozac, but when I get a brain zap now, I just acknowledge the little monkey on my back rather than freak out and almost vomit.</p><p>I don't feel that pissed off about it all right now, I just wonder if it's going to be 17 days  or 170 days before the brain zaps go away for good</p><p>I think i might donate some money to some organization this year that lobbies for more disclosure to patients about this shit because my dr who first prescribed it to me said 'Really? It causes vertigo in you? I am on it too and I get that too--I wonder what's up with that.'.</p><p>Followup: I'm up to about 6 moths since i was taking Cymbalta every day and i still have weird effects like those described above.  It has gotten to be kind of a joke now and mostly I just get the weird vertigo zaps.  I wonder if it is 'permanent' a lot. </p><p>It is a very distinct 'zap' and it feels way more sketchy and scary than the depression that caused me to go looking for an antidepressant.</p>"
}
