{
 "title": "Chaotic Potentiation",
 "author": "Debaser",
 "citation": "   Debaser. \"Chaotic Potentiation: experience with 2C-B & Moclobemide / MDMA & Moclobemide (ID 5862)\". Erowid.org. Mar 24, 2001. erowid.org/exp/5862",
 "substance": "2C-B & Moclobemide / MDMA & Moclobemide",
 "bodyweight": "150 lb",
 "header": [],
 "footer": [
  [
   "1996",
   "5862",
   "Male",
   " ",
   "Not Given",
   "Mar 24, 2001",
   "Views: 10830",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Since this was written in 1997, there is more evidence that Moclobemide in combination with MDMA can be dangerous and potentially fatal.  One paper (Vuori et al 2003) describes several deaths which they attribute to this combination.  MAOIs and MDMA (or any amphetamine-class stimulant) can be extremely dangerous when taken in combination.]</p><p> someone wrote:</p><p>> After reading and experientially confirming a colleague's praise of </p><p>> moclobemide as an effective potentiator of 2C-B , I became quite </p><p>> intrigued by the prospect of using it as the MAOI in an ayahuasca </p><p>> In my dogs dreams moclobemide approx. doubles the effects of </p><p>> P.cubensis and potentiates the effects of 2cb with about 50%.</p><p>> So it seems to be working better with tryptamines than with</p><p>> phenethylamines at least in this case. Moclobemide is said to be quite</p><p>> safe (whatever that means... :) )with 2cb, but is a dangerous</p><p>> combination with MDMA.</p><p>There is no evidence that moclobemide has any dangerous effects when combined with MDMA, although there are good theoretical reasons to be worried.  I tried the combination of moclobemide and MDMA but found very little potentiation if any. There was no blood pressure rise, using an arm-cuff at several points.</p><p>The potentiaton of 2cb by moclobemide is weird. Soemtimes it does, othertimes it simply decides not to. Sometimes 10mg of 2cb feels like 30, other times 30mg 2cb feels like 5mg. There is a very strong correlation between set and setting when it comes to 2cb. It really is a substance where these factors are of incredible importance. Talking plants generally say 75mg moclobemide and 10mg moclobemide lengthens the experience and alters the character a little.</p>"
}
