{
 "title": "Psychedelic, Religiously Enlightening Trip",
 "author": "McGrupp",
 "citation": "   McGrupp. \"Psychedelic, Religiously Enlightening Trip: experience with Mushrooms & Cocaine (ID 58637)\". Erowid.org. Aug 3, 2009. erowid.org/exp/58637",
 "substance": "Mushrooms & Cocaine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:00",
   "2 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "  T+ 2:00",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58637",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 3, 2009",
   "Views: 3376",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my third trip on mushrooms, but without a doubt, the best. I decided to take a personal day off from school on Thursday January 4th just because we had gotten back from a vacation and I didn't feel like going to school. My parents were both going to be out of the house from morning till night and I decided that it was a perfect time to trip and really test my mind and body.</p><p>At around 8 in the morning, I ate the mushrooms, put my blanket on my floor, lit an incense, and played my sitar for a good half hour. I have recently gotten into a lot of eastern culture and philosophy and taking sitar lessons which I love. I felt it was worth it to experiment with mind altering substances. Afterword, I went downstairs, still not really tripping, but feeling pretty good. I popped in the Phish dvd, Bittersweet motel and went into another world. Watching Trey fly through solos during Down With Disease, Waste, and others was just mind blowing. I couldn't figure out how he did it, or how the band sounded SO great together. I noticed before the movie started, that the color of the tv (the actual frame of the tv, not the picture) was fading from dark to light and visa versa. I knew I was in for a good ride.</p><p>Before I popped in the dvd I did 2 lines of coke to chill myself out. Then I went outside for a cigarette and had my first revalation. Everything has life, no matter what you look at, everyone and everything has life and a spirit to it. As I sat on my step outside, at about 9:45 in the morning, the sun was shining very brightly. The grass took on an almost yellowish-light green color, and started to bubble and swirl around. The wood chips at the back of my yard appeared purple instead of their normal brown. The sun had a piercing white light that lit up the entire sky as if god was shining down on the earth. It was amazing, and I sat there for a good half hour working over in my mind how everything can have life to it.</p><p>After, I went back inside, did another line, and continued the movie. While watching, after experiencing what I had outside, I had come to the conclusion that I wish I had someone to share all of my thoughts with. Someone who was on the same spiritual level as me. I don't mean it in terms of a soul mate, so either a guy or girl would be fine, just someone to share the communal spirituality with. As I watched the dvd, my sight drifted over to my door, which has glass designs on it. The sunlight was being projected through the glass into amazing swirling patters on the wall which just amazed me for the entire trip.</p><p>After the movie finished, feeling so connected to and in love with Phish and just music in general, I decided that it was time for some Beatles. I went upstairs and got my iPOD and quickly came back downstairs. I got back onto my couch, covered my entire body including my head and face with my blanket and started Sgt. Peppers Lonely Hearts Club Band. Oh my, this was THE MOST amazing experience I've ever felt in my life. The music carried me into another universe, where only music mattered. Music was the only thing that was important to me. When Lucy In The Sky With Diamonds hit, I freaked. Listening to the way all of the instruments and harmonies blend together to create the sound, and just the amazing musicianship of the band floored me. When Getting Better started, I began having recurring thoughts. Once, Paul McCartney said that if all the politicians of the world took LSD, there would be no wars. I finally understood what he meant. I really thought that if politicians and people in positions of power could just test their bodies with psychedelic and mind expanding drugs everyone could understand what I felt at that exact moment, and the feeling of community I felt with everything around me (even though I was the only person there... and my dog snoopy).</p><p>Throughout the next few songs, thoughts about school kept popping up. Things like 'Why do I bother going to school? What is it doing for me? Should I drop out?' But I eventually realized, that already being halfway through my senior year, it would be pointless to drop out. When Within You Without You came on, I had my most religiously enlightening experience yet. Thoughts about my sitar lesson the previous day kept coming up, and how amazing the sounds were that these Indian instruments could create. Ideas of reincarnation and spiritual rebirth also popped into my head during this song. Afterword, the rest of the album is pretty hazy in terms of thoughts and feelings I experienced. But one thing remains clear, the melody and the music of that album is just amazing and just trounces pretty much everything else. The odd thing was, during the entire trip, I had not said one word, everything that happened went on in my head, and it really amazed me, that the mind can come up with such complex thoughts.</p><p>After what seemed like an eternity in another world led by the Beatles, I did another line, and went outside for another cigarette, half of the reason being I wanted to experience the movement of the earth again. I did that and had another blast. I came back inside with my headphones still on, listening to more Phish, and just laid on my couch and watched the movement on the ceiling. This went on for a while until I realized that all my buddies would be coming home from school soon (1:30), so I went up to my room and changed into some nice respectable clothes and invited some friends over for a blunt.</p><p>At around 3:30 or 4 we all smoked a blunt and the sticky icky out of my friend's bat and I reverted back to tripping for a couple of minutes. Everything was spinning and I had to sit down on my couch and just chill out for a minute. After words at around 5, me and another friend had to work on a take home test for my government class. I wasn't really tripping anymore at this point, but I could still feel the after effects. I'm still waiting to see what I got on that test, but I feel it actually went pretty well :)</p><p>But yeah, that was my amazingly religious experience with mushrooms.</p>"
}
