{
 "title": "Love/Hate Relationship",
 "author": "Biglost2008",
 "citation": "   Biglost2008. \"Love/Hate Relationship: experience with Cyclobenzaprine (Flexeril) (ID 58668)\". Erowid.org. Nov 11, 2009. erowid.org/exp/58668",
 "substance": "Cyclobenzaprine (Flexeril)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 58668",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 11, 2009",
   "Views: 49437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nHere is a little background info: I first discovered Flexeril (Cyclobenzaprine) one day when I was in my parent's room looking for pills to use. My step-father had recently went to the doctor's with back problems, and the doctor had prescribed him Hydrocodone and Flexeril. After the codone ran out, I began looking at the Flexeril. I was skimming and saw the words 'muscle relaxant' and decided to try it.</p><p>This is my account of my first experience, but since then I have tried it several times and I can go back now and see that most, if not all of my experience with this drug are pretty much identical.</p><p>+ 00:00 - I take the four pills with some water, and watch TV and wait for the effects to kick in.</p><p>+ 00:20 - I can feel the effects to start kicking in. My body feels weak and tingly and there is slight mental cloudyness. Every time I make a fist my hand goes really weak and it is hard to keep it.</p><p>+ 00:45 - I feel really good. Something as I can only describe as a weak Hydrocodone buzz.</p><p>+ 01:30 - Something has irritated me and now I seem angry and pissed off at everything. When I make a fist it is now shaking uncontrollably a little bit. </p><p>+ 01:45 - I still feel agitated and now a little depressed. I start lashing out at my friends about the most inane things.</p><p>+ 02:00 - I decided I have had enough of this and go to bed. Sleep seems to come more quickly than usual.</p><p>+ 02:30 - 12:00 - I found myself waking up every hour, hour and a half and with a horrid case of dry mouth. One of the ups is I keep having the best dreams, livid and full of detail, that not even reefer could create.</p><p>+ 12:00 - I wake up, feeling more down and depressed than angry, with a groggy feeling and I still have dry mouth. I decided that this drug is not for me and decide not to do it again for a long time. I end up doing it everyday when I come home from school for a week.</p><p>Most of the times I have been on Flexeril have been like this. The mental/physical relaxation, the drowsiness, the 'naps' that last anywhere between five and nine hours, the depression, the anger, the drymouth, and the cool dreams.</p><p>Overall I do like this drug. After the week long 'binge' I decided not to do it for a long time, but I am tempted to do so as my friend gave me a bottle of about 20-25 10mg pills the other day. Maybe if I prepare myself for the future I can skip the anger/depression bit. There was a warning on the bottle though, to stop taking it after two weeks.</p>"
}
