{
 "title": "An Accidental Trip",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"An Accidental Trip: experience with Melatonin (ID 58670)\". Erowid.org. Jun 21, 2007. erowid.org/exp/58670",
 "substance": "Melatonin",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58670",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2007",
   "Views: 19420",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy husband and I regularly take sleeping aids such as Tylenol PMs and melatonin (in the recommended dosage), but we noticed that both werent working as well as it used to.  We thought it would be ok to take more than the recommended dosage of melatonin.\r\nWithin 15 minutes of taking it, I fell into a semi-dream state and was feeling drugged. It was a feeling that I normally dont get with melatonin. I was able to sleep but not very deeply. Meanwhile, my husband did not fall asleep right away and was even able to watch a full movie.  When he did fall asleep, he claims that he had very intense dreams.\r\nThe strange thing happened the morning after. I was at work and my husband called me from home and said in a very calm voice that spiders were coming out of his head, mouth, ears and pores and asked if I was feeling the same way? He continued to describe that there were spider webs all over his body and was trying to catch the spiders! He was so convinced that he was being attacked by spiders that he tried to get the help of our poor cat.  I couldnt believe what I was hearing! I thought that my husband had gone crazy!\r\nLong story short, I came home and the spiders and their webs had gone. I assumed that my husband had started hallucinating due to lack of sleep. I researched on the net and found that some people have hallucinated due to melatonin.  We found this out in a very strange way.\r\nAlso take note that my husband is under a lot of medication such as, Keppra (anti-convulsant), Seroxat, and beta blockers. I dont know if these other medications played a part in his hallucinations ...maybe they did.  \r\nI didnt feel what my husband did but from how he described it, it sounded like an acid trip. I asked him if he would do that again and he simply said, No.\n\n\n"
}