{
 "title": "Doggy Diner Underdose",
 "author": "Zam",
 "citation": " Zam. \"Doggy Diner Underdose: experience with DOC (ID 58692)\". Erowid.org. Jan 10, 2007. erowid.org/exp/58692",
 "substance": "DOC",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "DOC",
   "(blotter / tab)",
   "",
   " ",
   "",
   "MDMA",
   "(powder / crystals)",
   "",
   " ",
   "",
   "2C-B",
   "(powder / crystals)",
   "",
   " ",
   "",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58692",
   "Not Specified",
   "",
   "Not Given",
   "Jan 10, 2007",
   "13125",
   " "
  ]
 ],
 "report": "</p>\nMaterial: DOC in the form of blue-print on white background 'Doggy-Diner' diptych blotter.  Some lack of clarity on the dosage per unit, but it was the understanding that a single 1/4' blotter square (half the doggy-diner image) was a solid dose and two was strong and could last a long time.</p><p>Setting: New Years Eve party, small apartment with a group of 13 people.  One note taker who did not take DOC (me).</p><p>Psychoactive Drug Choices:  There were 3 doggy-diners, thus 6 quarter-inch blotters available.  We had takers for 5 of them.  Three other people planned on Champagne and MDMA, two others planned on GHB, two chose 2C-B, and one other decided on LSD.  The DOC people talk about the possibility of adding in MDMA later in the trip.</p><p>Preparation: DOC experiences read by several members of the party, including those who were not planning on taking it.  The theory was to let the DOC people have 3+ hours to come up before anyone else took anything, to see how it went for them.</p><p>People: DOC takers include Gn, Sp, Ek, Iv, and Mi.  </p><p>7:00-7:15  Everyone reports that the DOC blotter tastes strongly.  Descriptions include 'tin-y' and 'not terrible'.  'It is better than Sinar artichoke flavor apperatif.'  The LSD-taker starts here as well.</p><p>7:14 Rama chant/song by Sp.</p><p>8:05 Mi 'no distinct effects'.  Gn: 'Nothing clear, but first tingeys.'  Sp says he's doing 'woozily'.  Ek says he feels a little 'amphetaminey'.</p><p>8:20 Iv 'not coming up yet.'</p><p>8:25 Mi describes an increased awareness of the hot stove, a clear Shulgin +. Mi described that lights have extra flicker, sees some flashes and blurring along with very slightly moving walls.</p><p>8:25 Gn is also a definite +, with a 'telltale back of my head-- I took drugs' effect.  Also, a 'back of nose mucus sensation'.</p><p>8:40 Ek says he has no visual effects he can detect. </p><p>Sp describes having a 'nervous tummy', but nothing else.</p><p>8:45 Gn has clearly increased sweating.  Mi felt cold, now feeling warm.  Sp now feels cold.  Clearly the group is experiencing transient shifts in temperature perception.  Hands feel warm and slightly damp.</p><p>9:00 Ek describes that something is going on, but not much.  Ek says he is 'feeling good'.</p><p>9:15 Ek 'the effects are mild with no trippy cognitive weirdness.'</p><p>9:25 Gn continues to have temperature regulation issues feels cold and put on warm sweatshirt and is now feeling overly warm.</p><p>9:30 The 5 DOC takers are all babbling quickly, talkative, chatting now.  No obvious profound effects, they don't seem very psychedelicized, just a bit stimulated and off baseline.</p><p>9:45  Gn babbles and runs out of room, clearly a bit 'high'.  Sp describes that the 'body high is similar to mescaline', coming in 'slow waves'.</p><p>Ek describes more sharp edges around things visually and cognitively.  Iv puts on 'performance fabrics' to help wick sweat and keep temperature regulation a bit more moderate.</p><p>9:56  Gn says he is feeling higher. He seems higher.  </p><p>10:00 Iv begins smoking cannabis, although Iv had smoked earlier in the day.  No one else joins Iv.  She describes a 'salty sensation', but does not go on to describe what this means.</p><p>Around this time, the DOC-gang is getting a little bored waiting to come on.  They decide that they are about as high as they're going to get and are thinking of adding MDMA into the mix.  Although this will make it hard to follow the course of the DOC, the effects seem to be 'going nowhere'.  Iv, the lightest of the group, is clearly having the strongest effects, but is still not very high.  The person who took the LSD is quite high and is somewhat non-verbal. </p><p>10:15 The champagne group takes moderate doses of MDMA (60mg, 90mg, 130mg) </p><p>10:20 Mi (on DOC) takes around 100mg of MDMA.</p><p>10:33 Sp says that 'chanting sita raam made me more high'.</p><p>10:34 Gn and Ek each take about 15mg of 2C-B.</p><p>Gn comments that the DOC caused 'an exceptionally light amount of tummy'.</p><p>11:30 Mi and the MDMA group feel high and are enjoying themselves.  Gn and Ek are quite high.  The rest of the gang is a mix, the LSD-taker is still </p><p>non-verbal.  Nitrous oxide cartridges make their appearance and many are cracked and consumed.  Gifts are exchanged.</p><p>1:00 Mi describes that she's feeling dizzy in a not-very-nice way.  Mild vertigo causing very mild dysphoria.  She says that the nitrous oxide probably contributed to the dizzy effect.</p><p>2:30 Mi says that the dizzy continues.   Sp describes 'body disorientation' and 'intense energy'.</p><p>Over the next couple hours, Mi continues to feel very nauseated and spinny.  She tries eating a little, drinking water, and chewing Tumms.  Tries taking a bath, tries to vomit.  </p><p>4:12 Sp describes feeling 'sleepy'. Nitrous starts to run out.</p><p>4:30 Mi feels spinny and disconnected.  Mi takes 0.5mg alprazolam and quickly feels better and falls asleep.</p><p>5:35 Gn: 'Feels like the point in the morning when you're coming off the acid when there are still vortices and you stare at the ceiling and there are tracers been that way for hours.  It is like AMT with a sense of a long plateau.'</p><p>Between 4:30am and 6:00am, the DOC gang seems a bit tired.  Although they still describe light visual effects and internal head-space, they also describe that they feel softly-tired and without the lingering stimulant brain-zappy effects of LSD.  Alcohol is consumed,  more nitrous is consumed.</p><p>5:30 to 6:30am, most of the group starts heading off to sleep.  Some additional alprazolam is taken.  Gn takes alprazolam and tries to sleep, but fails.  </p><p>Overall, the DOC was not as strong or as long lasting as expected.  In hindsight, the person who acquired the DOC blotter assumes that the diptych was supposed to be a single dose.   The group agreed the next day that the physical effects were pretty smooth, although Mi's experience with the vertigo was an outlier and Mi felt that it was probably related to the MDMA or the nitrous.</p><p>Most would try the DOC again at a higher dose next time.</p>"
}
