{
 "title": "Good as Medicine",
 "author": "Anon",
 "citation": "   Anon. \"Good as Medicine: experience with Olanzapine (ID 58711)\". Erowid.org. Aug 28, 2007. erowid.org/exp/58711",
 "substance": "Olanzapine",
 "bodyweight": "82 kg",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Olanzapine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "58711",
   "Male",
   " ",
   "Not Given",
   "Aug 28, 2007",
   "9846",
   " "
  ]
 ],
 "report": "<p>Olanzapine / Zyprexa I wouldnt say has recreational potential, but it's good as medication. When taken regularly, same time every day, for 4 weeks, it gives full effect, not like anti-depressants, its very diffirent. I feel a constant feeling of slight euphoria, it helps with anxiety, nervousness, stress etc. It's very sedating, and it works right when I start on it, 3 days after I started I noticed all its effects. </p><p>Zyprexa elevates my mood, lets me worry less about things, it also stabalizes me so if I drink or take anything else I barely notice the comedowns. It doesnt make anything weaker, it amplifies almost everything that's intoxicating, benzo's, cannabis, and even mdma.</p><p>It has cons though, especially at beginning of treatment, in the beginning I was constantly tired, I could sleep forever, whenever. I am always hungry, and my metabolism works worse so I gain weight even if I eat less then before, and due to its sedative aspects making me extremely lazy and tired all the time it's hard to work out. I use uppers for school and work, I cant imagine anyone working or studying on a 5mg+ dose of this medicine alone.</p><p>I really recommend this, with anything, but only as a normal medicine to take as directed, it doesnt make a big diffirence after 10mg, I tried up to 35 a day and it didnt make a diffirence. It softens crashes, interacts positively to everything. And most importantly, it helps me keep my mood stable so I have no extreme downs, only ups, diffirent to other antipsychotics, I tried them all. People mistake that u dont get downs at all, I do, I just dont feel them and am slow and not thinking, hence avoiding confronting the problem.</p><p>Hope this helps, and stops people trying to abuse it, its a very powerful medication that needs to build up and doesnt reach its full potential til 4 weeks+. It's a great aid but not recreational on its own at least.</p>"
}
