{
 "title": "Morning After Trip",
 "author": "Letting_Go",
 "citation": "Citation:   Letting_Go. \"Morning After Trip: experience with DXM (ID 58720)\". Erowid.org. Dec 19, 2007. erowid.org/exp/58720",
 "substance": "DXM",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 58720",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 19, 2007",
   "Views: 5943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have acquaintances that do drugs such as marijuana, acid and ecstacy but I had never personally tried anything of the sort, due to lack of money. So when I heard from one of these people about getting an easy trip from Robitussin I immediately jumped at the chance to finally feel what it was like to be drugged.\r\nI bought a large bottle of Robitussin after school. Later that night, I went to the kitchen and poured a glass of apple juice to mix it with. I did this until the (large) bottle was almost empty. The taste was excruciatingly bad, and of course I felt like vomiting. A few times I felt it rise in my throat but swallowed the bile back down. When I went to bed, my head felt airy, and the glow from my stereo screen seemed to dance around my room. Although eager to see what else would happen, I fell asleep.\r\nThe next morning I went to school with the same airy feeling, as though I was floating along the ground. Through the front gate, down the drive I glided. I tripped over myself as I went to greet my friends. My first class was Maths. I found I could not concentrate at all, the sky outside seemed to call to me and all I could manage was to stare dreamily out the window. The light effect lasted until about midday. It was difficult to walk to my different classes, and I kept tripping over, well, nothing.\r\nOverall the trip was a positive experience, pretty tame. Drinking the tussin was certainly the large negative factor.\n\n\n"
}