{
 "title": "The Deleterious Effects",
 "author": "Bughouse",
 "citation": "   Bughouse. \"The Deleterious Effects: experience with Salvia divinorum (10x extract) (ID 58770)\". Erowid.org. Aug 10, 2009. erowid.org/exp/58770",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2003",
   "ID: 58770",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 10, 2009",
   "Views: 3519",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As a sophomore in high school, I was unusually attracted to psychedelic substances. I also had somewhat of an intellectual and maybe even elitist temperament. I considered high school a waste of my time, and I would in fact enter early college the next year. At the time, however, I was desperate for mind-altering substances as they seemed to offer an escape from the mundane day to day grind of high school.</p><p>As a result, I was surprised to find that salvia divinorum was not only a powerful psychedelic, but was also legal and available over the internet. With some deliberation, I decided to purchase a small amount of 10x extract, figuring it was the best bang for my buck. I put in my order and the leafy mixture arrived shortly thereafter. My fellow teenage psychonaut and I decided to smoke the salvia soon after it arrived, and to my memory we decided to smoke it after school.</p><p>In the comfort of my friends bedroom, I attempted to have a psychedelic experience from the salvia extract. I packed some of it into a short pipe and took a long drag. It was smooth, yet had a very distinctive taste. Perhaps more than distinctive, it was simply pungent, and it would make the pipe essentially unusable for anything but salvia from then on. I noticed that the salvia made me feel slightly different, though I could not particularly say how. I tried taking a hit several times. Each time I would feel some vague sensation that would last for about five minutes.</p><p>Finally I decided that I had to just try to take a bunch of hits to see just what this plant was all about. My buddy went first, and after about four hits, he slumped into his chair and seemed to loose coherence. This did not faze me, and in my determination I quickly took the pipe from him and did the same.</p><p>What followed, I can only describe as a total delusional experience. I felt that my sum total of experience had been some game I had been playing, and I had just given it all up. The sensation was more emotional than rational, though I could pinpoint that my desperation was due more to a belief that I had destroyed the universe by inhaling salvia than anything else. As extreme as that may sound, I soon regained enough composure to begin frantically warning my friend how powerful salvia was, and to be very careful with it. As I regained the ability to move about, the afterglow of a complete artificialness with everything lingered. We walked to the nearby city square, a place that I go often. It had been utterly torn up in a way that I had seen before. We were both utterly convinced that wrenching salvia experience had destroyed the square.</p><p>Instead of throwing my remaining mixture away, I smoked salvia again for the next few days. Two experiences are worth mentioning. In the first, everything seemed to be the same, but it seemed like my same friend had become truly alien, as if I had never seen anything like him before. It was as if I was a newborn child and everything was new to me. In the second experience, the entire room morphed into a sort of spiral that was linked together by gingerbread shaped men. The features of the room remained, but the spiral took precedence with a constant fluid motion, a loud accompanying noise, and a strong unpleasant force as if I too was a part of the spiral. After this strange vision started to subside I found myself laughing completely inappropriately. Given my mild fear and discomfort a moment earlier, the laughter seemed at best unbecoming and at worst demonic. </p><p>After this very odd week, I never tried nor wished to try salvia ever again. The horrible afterthought was when I tried to smoke pot a week later. At the time I had smoked pot only a few times. After taking a few hits out of a pipe, I felt nothing. I was in a very strange setting: outside far away from everything in a ditch with some heavily rusted abandoned cars. Suddenly I realized the worst case scenario was happening: it was exactly like salvia. At this point I completely lost everything and had to be comforted by my friends parents, and later my parents. It was an odd experience, and it really did feel like a salvia trip that was going on for hours rather than minutes. I remember specifically that it felt like daemons were entering my head and that the world was being reduced to no more than thirty or so pixels. I should add that I am not religious, yet daemons were what came to mind for whatever reason. I was also shaking insistently, and I was utterly confident that I was going to die.</p><p>Of course I recovered, although the experience did seem to linger on for about a year. I would have spontaneous panic attacks at seemingly random times. Each time I could recognize their similarity to my salvia and strange pot experience. It was only with extreme trepidation that I gradually began to smoke pot again, and it seemed to be more to battle my own fears than for any other reason. Smoking would trigger panic attacks very quickly if I was not careful. Gradually however, the attacks subsided and I even found myself acquiring a habit with smoking weed.</p><p>Yet eventually even this subsided, as I found that no matter what the possibility that I would smoke too much and have a panic attack seemed to always be present. Now, it is almost four years later and I do not do psychedelics or smoke marijuana. Connecting all this to salvia may seem like a stretch, but it is not. I can say with certainty that many of my unpleasant experience seemed to be outright flashbacks to salvia. Now, I do not think this is negative, on the whole. It certainly pushed me to examine my life in completely new ways. Obviously many other things have affected me over the last four years, yet salvia seemed to have been some sort of trigger that awoke something strange inside of me. I find my later encounter with a description of salvia as a hallucinogenic diseuphoric both telling and accurate. </p><p>In a nutshell, smoking salvia killed my affinity for psychedelics and altered my relationship with pot. I can not really say that I think about salvia much any more, and I certainly do not get panic attacks in the way that I did the year after I took it. However, this does not stop me from completely avoiding salvia divinorum to this day. My friends descriptions are invariably negative as well. I understand that I am probably I particularly sensitive person to have such a long-lasting reaction to salvia. Still, that person could be you too. In short, salvia sucks.</p>"
}
