{
 "title": "Alien Trouble",
 "author": "Christmas",
 "citation": "   Christmas. \"Alien Trouble: experience with Salvia divinorum (ID 58821)\". Erowid.org. Sep 24, 2009. erowid.org/exp/58821",
 "substance": "Salvia divinorum",
 "bodyweight": "57 kg",
 "header": [
  [
   "DOSE:",
   "1 tsp",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2001",
   "58821",
   "Male",
   " ",
   "Not Given",
   "Sep 24, 2009",
   "Views: 4036",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is an account of my last Salvia experience. Since this experience I have not tried using this plant again and it's been about five years since my last time. I had used the plant before on several occasions with remarkable results, these experiences were all characterized by finding myself seemingly switching identities with other people in other places. I found these experiences hysterically funny (I laughed out loud the first time). When aware of my ordinary surroundings I also experienced a lot of spatial distortion, in particular an incredible increase in my perception of the scale of the depth of things (folds in fabric, carpet fibers, uneven walls etc).</p><p>On the last occasion I used Salvia I did not increase my dosage, I used the same amount and method as on previous occasions - a heaped teaspoon of regular leaf, chopped up fine and smoked rapidly through a waterpipe. I sat down in a quiet room with the door shut and smoked my home grown plant material. As the effects took hold I quickly found my attention tuned in on the sound of a voice, this was the voice of a newsreader in a nearby room from a TV tuned to the news channel that I neglected to turn off (I immediately regretted this). The newsreader began to describe what I had done: 'This evening a young man smoked a quantity of Salvia Divinorum. He has been removed from his world and will not be permitted to return'. The voice explained to me that I had done something very wrong by using Salvia. It seemed to me that the voice was that of an alien being and that Salvia Divinorum was their technology and I had been caught using it without their permission. As a punishment I had been permanently removed from my world and would now have to go and live in a new world for the rest of my life.</p><p>I became aware of a kind of wheel that was rotating. Along the edge of the wheel were certain stops. At each stop there was a different reality. I looked through one of the stops and saw a different world, there was a long street lined with houses that all looked the same, the sun was shining and there were a few people walking about, some of them standing on their driveways. This place looked exactly like our own world except for the fact that absolutely everyone in the new world wore identical overalls of a plain grey/green color. I decided to try and begin a dialogue with the alien, something like, 'You can't just remove me from my world. Everyone will notice that I've gone'. It seemed to me that my removal from the world would constitute a breaking of some fundamental law of reality and that my sudden disappearance from the face of the Earth would be going too far, even for them. They answered me, 'Who will miss you? What world?'. I tried to remember but my world and everyone in it was gone. It seemed to me then that they had really completely erased my world from existence.</p><p>Realizing then that I couldn't coerce them into sending me home I tried adopting a more polite and humble approach and pleaded politely for them to send me home. They told me then that I would be permitted to return to my world only on the condition that I would acknowledge that my world was no more real than any of the other worlds. I readily agreed to their demands and then I watched as a fridge, a bike, a chair etc. (the surroundings of the room I had left some while ago) formed themselves around me and I saw that it was actually the aliens that were themselves assuming these forms to build my usual environment back around me. I got up and headed into the lounge. The newsreader was now talking about some war somewhere. Momentarily I saw a huge bomber aircraft superimposed through the room. Then I was back to normal. At no time during the experience did I form any visual impression of the aliens, even as I watched them transform into the elements of my usual environment.</p><p>Whilst this experience was difficult and extremely intense at the time, I felt elated and thrilled with it immediately afterwards. I was pleased with myself at having negotiated what seemed like a dangerous situation and glad to have been on an adventure. Rationally, I can dismiss the whole thing as a hallucination, but just in case what the alien said was true, I haven't used Salvia since. There remains a part of me willing to entertain the notion that the information gleaned from my experience was true (the alien made me agree to this after all) and that by returning I might risk running into a similar situation. Perhaps this world would be erased forever.</p><p>I have wondered about my last Salvia trip over the last few years. I've thought about the way many different kinds of creatures use camouflage and deception within nature, for their own ends, and I've wondered if perhaps we ourselves really haven't been living unawares in the company of other creatures, perhaps more intelligent than ourselves all along. Perhaps we are all victims caught in webs whose existence we don't even suspect. Perhaps I should try returning again.</p><p>It seems rather vain to assume that we are aware of most of what is going on on this world, that we occupy the number one role on this world in terms of control and intelligence. The fact that all this sounds like mere science fiction will prevent most anyone from taking these ideas seriously. Perhaps that's no accident either.</p>"
}
