{
 "title": "A Wonderful Extraction",
 "author": "Del",
 "citation": "   Del. \"A Wonderful Extraction: experience with Morning Glory & Alcohol (ID 58861)\". Erowid.org. Jun 10, 2007. erowid.org/exp/58861",
 "substance": "Morning Glory & Alcohol",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Morning Glory",
   "(ground / crushed)",
   " ",
   "2 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 58861",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Jun 10, 2007",
   "Views: 4410",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nAfter experimenting with Morning Glory extracts for sometime now, I finally made a batch this past weekend that was extremely pure and psychedelic. I started with the untreated Pearly Gates variety from an internet supplier and ground them with a coffee grinder. Not happy with the consistency of the grind, I've since purchased a burr grinder but haven't had the chance to try it yet. Anyway, I mixed the grind with Everclear (about 3 grams to 1 ounce ratio), sealed the container, and stored it in the refrigerator for what ended-up being several months. Not sure how the length of time may have affected the process, I was just waiting for the right time to trip :) </p><p>When that time came, I shook up the mixture for a few minutes and then strained it through a gold mesh coffee filter twice. The resulting morning glory liquor was very pure in that there was little to no seed residue remaining. I then measured out 2 ounces and mixed it with enough grapefruit juice to make it palitable. </p><p>Before I even finished the drink, within minutes, I was feeling quite 'electric'. The peak occurred a couple of hours later and included some amazing closed-eye, mind-morphing visuals. There was no significant nausia, only waves of bliss that kept me laughing most of the time. When my stomach did tighten-up a bit in the beginning, smoking pot was the perfect remedy. </p><p>The night's entertainment consisted of several songs from the George Harrison Tribute concert, the 1st Woodstock DVD, and then part of Saturday Night Live before I got tired and fell asleep about 5 hours after drinking the concoction. It was the first Morning Glory trip I've had that didn't make me feel sick in some way and I attribute that to the extraction process I used. Happy trails!</p>"
}
