{
 "title": "Creatively Disturbed Trip",
 "author": "Eddie",
 "citation": "   Eddie. \"Creatively Disturbed Trip: experience with Salvia divinorum (35x  extract) (ID 58900)\". Erowid.org. Jul 24, 2009. erowid.org/exp/58900",
 "substance": "Salvia divinorum (35x  extract)",
 "bodyweight": "69.8 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Anadenanthera colubrina",
   "(ground / crushed)",
   "  T+ 1:30",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 58900",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 24, 2009",
   "Views: 2609",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was in my front room with 3 friends watching TV. It was evening and I was a little tired, another friend came round with some legal highs he had just bought, the first he gave out was cebil, some brown fine powder. I took a pea sized amount not really knowing what it was meant to do exactly. About 10 minutes later I was feeling somewhat more awake but no really noticable effects came, for the following hour he went on to roll a joint containing the cebil not adding more than a thin layer above the tobacco, and a salvia one also adding the same.<br>I cant say I felt anything, I got a slight head ache but felt no euphoric or abnormal side effects, he then after about an hour and a half left with a friend leaving me and one friend in the room, he even offered me the salvia extract as he said it made him trip out a little too much (he said the lights became bright and everything things just felt too wierd for him, he has only smoked weed previous to this.) <br>I gladly accepted this and was very pleased as I had nothing to smoke myself and was happy to try a new drug, even a legal one. A friend of mine had done salvia at a festival trying an extract of 20, he compared it to the glowing feeling of mushrooms with the light being somewhat brighter and distorted. <br>Not really knowing how much to put in and not expecting much after the let down of feeling nothing from the cebil, I got my bong and put about 2 peas in filling it 3 quarters, I then took the bong holding it in and drinking some water before breathing out. Straight away I felt a rush close to a nicotine hit, then my friend asked if it did anything as the room started to tilt, I cant say I have ever seen a room tilt on any drug so much without moving my head, I laughed and couldnt really reply just look around, everything seemed intense, it came on so fast that I cant say I can describe my initial reaction, like the glowing/coming up of mushrooms, but my mind couldnt work out what it was feeling.<br>I dont remember how I got into it, I felt I was leaning forward, off the couch, and then I wasnt myself, I have never felt anything like it in my life, I cant compare it to seeing stuff on mushrooms however intense because I still know I'm seeing it or feeling it and know I have taken mushrooms. I basically felt like I was suddenly unbound, I was part of a grid, I had just been released or awoken and could see to my left and right, I was in an endless grid of basically square blue cubes, each slot into each other connected to make a mass of interlinking never ending mass of living cubes................ <br>I.....I say I, I wasnt me though, I mean I was me as in it couldnt of been you however I wasnt a human I didnt have arms or feet or a fully biological body for that matter, I straight away felt distressed. I wasnt meant to be up and able to look around, I could feel from the start a constant force pushing over my back, which was a bendable slab of metal. The force was a sort of electrical water stream going over everyone forcing them down to stay down and providing was the current that connected us all, <br>I knew I wasnt supposed to be able to be up, the force was pushing me down and I knew I was soon going to put back into the grid as I, the problem, was being fixed. The thing to my left was the only thing I looked at, its slabbed back was connected to all the other grids squarely. I felt as if my eyesight was upside down somewhat, say as if were leaning off the couch :)<br>I could see we were arches underneath, the thing to my left had not an eye, but it was staring at me, it was in panic and shock that I was up and was saying that I shouldnt be up, but there were murmurs all around that I shouldnt be awake or out of sync with the others, I felt so much fear of being put back into reality but I craved to feel normal again, I was in fear of being fixed yet didnt want to stay released because I was basically a thing that only felt instinct, a being 90% mechanical. I couldnt feel anything that I could feel if I went back into the system, I would be alone and destroyed was a thought that passed in one of the few thoughts I actually had. I only felt primal feelings, fear, impending doom and a huge level of stress.<br>I dont remember coming out of this, the next thing I remember I was lifting myself up and looked to the right at my friend and then to my left at my speakers. My mind was blank, I didnt know what I was looking at, where I was, I was trying to work out what was happening, I looked to my right again and saw my friend and remembered that I had recognized him, I then looked to my right again, at which point my friend asked if I was ok, at this I laughed. I tried to talk, but could only give a feebly shaky yet sincere laugh, I tried to talk a few times in the following 5 or 6 seconds as I turned and just stared to my left but all I could not do anything but give a laugh. Everything was an intense yellow glow, I still didnt know it was a speaker but I knew our straight green couch was the very very curved goldeny green couch I was sitting on. Then after about 10 seconds I got a few thoughts back and breathed heavily. I couldnt remember what happened when I tripped out, but after about 10 seconds after sitting up I managed to say something. <br>I was shaky and felt pretty messed up, but knew I was getting in control and on a drug.<br>I was focusing on seeing normal and cant really say I took in time to focus on my experience but I felt like my skin was lighter than I should be, and I felt an intense rush. I kinda ran around the house in a daze going OMG! While doing so I remember what I had just experienced but only at a small level, I only remembered that I had tripped I was something else. Then the more I thought about it the more disturbed I felt. Every time I tried to remember more I felt as if I was experiencing the distress I felt. I had instantly repressed it. I told a friend what I had just felt, but didnt go into much of the emotional detail, just I was being woken up. <br>Then the next day, (today as I'm writing) I told a friend about it, in as much depth as I could, as I did I felt a great emotional rush come over me, a feeling of it being just upset with flashes of the trip intensely mixed with the distress as I recalled it.<br>The trip lasted no more than 7 seconds I'm told, before I sat up straight, the disorientation of not knowing anything about 10 seconds before quickly disappearing, and the comedown rush lasted about 4 minutes. <br>I have never been so mentally out of it with any combination of recreational drugs, it was an intense trip totally out of body and only a primal mind being first woken like a man coming out of a coma he'd been in since a baby. It has put me off the drug as this is something I never wanted to feel again but understand it was just a trip at the end of the day. I probably will do a lower leveled extract next time AND/OR not holding in and drinking water as I think one of these two made it a bit too real and creative to enjoy.\n\n\n"
}
