{
 "title": "A Gift and a Curse",
 "author": "Egor",
 "citation": "Citation:   Egor. \"A Gift and a Curse: experience with 4-HO-MiPT (ID 58913)\". Erowid.org. Jan 30, 2007. erowid.org/exp/58913",
 "substance": "4-HO-MiPT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "4-HO-MiPT",
   " ",
   "  ",
   "oral",
   "Various"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58913",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 30, 2007",
   "Views: 13184",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFrom my earliest studies of exotic tryptamines, 4-ho-mipt and its acetate ester 4-aco-mipt had sounded very appealing to me. I continued my research on this one for a few more months, until one faithful day, it was in my possession. Even though the first hand reports in Tihkal did not make it sound all that special, and I could not find any other trip reports on the substance, I had a gut feeling it would be good. Finally, after 5 years of waiting, I had finally obtained miprocin. \r\nTrial 1 - 8mg 4-ho-mipt, cannabis:\r\nTwo days later, it was time for a test run. The setting was walking up the street to go see Charlie and the Chocolate factory in the theatre. Seemed perfect. I was with a large group of friends, and ingested 8mg of miprocin. I was shocked to find effects manifesting before we even got to the theatre. While waiting in line for tickets, surrounded by small children and parents, one of my obnoxious friends decided it would be a good time for a loud debate about anal sex. I was struggling not to burst out laughing, given the absurdity of the situation. Still, paranoia was non-existent. \r\nWe got in to the theatre and found seating. The color enhancement was marked and amazing. Throughout the film, I found myself getting deep insight into the lives of the characters who blew their shot by being asses and ignoring Mr. Wonkas rules. Even at this low dose there was some visual patterning, and cool multiple after image trails. After the film, we returned to my apartment to smoke some fine cannabis. The effect of even 1 hit was a significant strengthening of the effects. After the bowl went around 4 more times, I had achieved a weak +3, after being comfortably +2 the rest of the evening. A few Easy Street Wheats later, it was time for bed as I had to work in the morning.\r\nTrial 2 - 15mg 4-ho-mipt, 10 mg 2c-e, cannabis:\r\nWith the excellent first trial, the week went very slowly to the weekend, when I could finally see what miprocin could really do. That Saturday, Me and my roommate, B decided to have some fun with miprocin. We each dosed 15mg, just dumped in our mouths. The taste is foul, but it is no 4-ho-dipt. We were again feeling alerts within 15 mins. Miprocin works quick. Half an hour later, we were both getting some significant visual distortion, and laughing hysterically.  There was no real side effects to be noted at this dose. We decided to see how it would synergize with 2c-e, our favorite chemical at the time. 10 mg each down the hatch. The visuals soon began to increase to surprising intensity. Within another 45 mins, we were in an intense visual trip rivaling 500 mics of lsd easily. This did not last long, however as the miprocin soon began to wane. About t+ 5 hours after dosing the 2c-e we were both close to baseline, and decided to smoke a bowl and get some sleep.\r\nTrial 3 - 15mg 4-ho-mipt, 15mg 2c-e, 6mg 5-meo-dmt , cannabis and alcohol:\r\nAfter the last trip with miprocin and 2c-e, we decided to see what the combo was about when taken at the same time. We were on a steady climb within 20 mins of taking the caps. We both knew this was going to be crazy very early on. We went to our neighbors house for cannabis and Jaegerbombs. Normally I prefer not to drink while tripping, but 4-ho-mipt really makes me friendly for booze. After a bowl of mid grade weed, we each did 3 bombs. We were VERY high, and still not even at peak effects. There was surprisingly no nausea from the alcohol. Miprocin is something special. It is all the good qualities of lsd and mescaline, without the side effects. \r\nAt around T+2:30 since dosing, B decides to smoke some 5-meo-dmt freebase. I was in total agreement. He went first. He smoked about 5mg. After the hit, he let out some uninteligable vocalization, and layed down on the couch. As B was lost somewhere not in the room, I took the liberty of loading the pipe for myself. I inhaled and the room disappeared from in front of me. I was in some sort of static electricity tunnel headed god only knows where very fast. My friends tell me I was repeating holy shit, holy shit for about 3 straight minutes. The tunnel soon faded into what I can only describe as purgatory. My ego was intact, but entirely separated from my physical being. I was in total darkness, total isolation from reality, with nothing replacing it. I began to ponder if I had just died from the 5-meo-dmt. Then, small flashes of light turned into basic geometries. The world began to slowly and randomly piece itself back together right in front of me. Soon I was able to begin to recognize the room I was in. \r\nI felt totally in awe of what had just happened. After we returned from 5-meo-dmt space, the trip had lost much of its previous intensity. (Sorry about the shoddy description of what happened after the 5-meo-dmt. It is not easy to describe total disassociation from the physical world, then watching the world piece itsself back together). We spent the remainder of the night smoking cannabis and pondering the experience we had just survived.\r\nTrial 4 - 20mg 4-ho-mipt, 2g psilocybin mushrooms:\r\nAfter several intense experiences with miprocin with other manmade chemicals, I decided to try it in combination with good quality psilocybin. The mushrooms were ground in a coffee grinder, and placed in a mixture of chocolate syrup and peanut butter, the miprocin was added, and the mixture was frozen overnight. The next day I went about my usual errands to prepare for the trip that night. The frozen shroom and chemical cake takes on the flavor of a peanut butter cup and masks the flavor of both shroom and chemical nicely. \r\nWithin 20 minutes, I was again rapidly on the rise. Contrary to what was expected, this trip took on a much more recreational, laugh your ass off type feel. Dennis Learys Merry Fuckin Christmas on the secret stash (comedy central) was so funny, I got abdominal cramps from the riotus laughter. The highlight of the experience was thinking there was someone pounding on my door at about 2:30am. I thought I was fucked. Soon, however, the pounding began to quickly increase in frequency, and I realized it was the couple above my apartment fucking frantically!! The laughter was once again uncontrollable. I spent the rest of the night amused fully by the movie Me, Myself, and Irene and fell asleep shortly after it ended. I was amazed at the relative lack of visual distortion provided by the combo.\r\nTrial 5 - 40 mg 4-ho-mipt, cannabis and 2mg klonopin:\r\nI decided to see how the character of the chem was on its own at a high dose. \r\nI weighed out 40 mg of miprocin and put it in a gelcap. I smoked a bowl of kind bud after taking the cap and awaited effects. As always, I had effects manifesting within 20 minutes. The trip took on a somewhat sinister tone. I had decided to do this trip solo, and was now regretting the decision. Through some act of cosmic kindness, my roommate got out of work early that day, and arrived just as I began to get in very deep. He was nice enough to hand me a 2mg klonapin, seeing I was in need. This was the only time miprocin truly got the best of me like this. I dissolved the klonapin under my tongue, and was pleased to start to feel better within another half an hour. The odd part was, the visual distortions became far more prominent with the adjunct of the benzo. \r\nLuckily for me, there were very few visuals with eyes closed, so I had a sanctuary when they got too intense with eyes open. We had some very good discussions about the nature of reality, and why we choose to alter it. The effects waned much more rapidly with the benzo and no other substances in my system, I was baseline, minus the klon within 6 hours, though not at all disappointed to be there. \r\nA warning about the godhead effect and delerium:\r\nThere seems to be a very fine line between the proper dose and disassociated delirium with miprocin. B was the first person to experience it. He was on a dose of about 30mg of miprocin. He was having a good time at first, but he soon became delusional and thought he was god and was in control of all that happened around him. He was having a hell of a time being god for about 2 hours, but has complete retrograde amnesia and no recollection of this part of the trip. Our neighbor C was the next person to be struck by the godhead. It was almost identical to what happened to B, but at a dose of only 15mg. Unlike B however, he did not return for quite a while. He was speaking and making no coherent sentences or thoughts. He would choose words from the conversations around them and incorporation them into his babble. He did return to reality about 6 hours later with no after effects. I was the final person to experience the total delirious disassociation. On my last miprocin trip (35mg and beer), I came to think of myself as god. I was telling Bs hot female friend to blow me every 10 minutes or so for hours. I told her I was god and she had no power to decline me. I also have no recollection of these events. Be careful with high doses of miprocin.\r\nConclusion:\r\nThere are several other experiences I chose to omit from this report as they are worthy of full trip report write ups in the future, especially the combo with 2c-i and 2c-tfm.\r\nOverall, I was very impressed with the quality of the miprocin experience. Far preferable to psilocybin any day. I did, however, stop my studies of this chemical after the delusional trip, I feel it is risky to persue further given the frequency of this effect.\n\n\n"
}