{
 "title": "My notes on This Poppy",
 "author": "FooL",
 "citation": "Citation:   FooL. \"My notes on This Poppy: experience with California Poppy (ID 58926)\". Erowid.org. Jul 3, 2009. erowid.org/exp/58926",
 "substance": "California Poppy",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 tsp",
   "oral",
   "Poppies - California",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 58926",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 3, 2009",
   "Views: 14697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHerbs had been my hot topic for a little while now and through my many searches the california poppy popped up. It looked like a drug that could potentially replace my sleep aids and with that in mind, I set off to gain a supply. Upon receiving it from an online vendor I preceded to make a tea out of the red flowers. I used about 2 teaspoons in a coffee mug of water. I let that sit for about 30 mins along with a tea bag of apple cider flavoring. This resulted in a very dark red liquid that stained anything that it touched.\r\nThe taste of this liquid was not enjoyable. In fact it was rather unbearable seeing on how I could only finish it after holding my nose shut and drinking all of the liquid at once. It took about 30 mins for the stuff to kick in and I started to feel the sedating effects. The effects seamed to max out around the 1 hour mark and it stayed there until the 1.5 to 2 hour mark when I started to feel the effects subside. I could of at any point during this event fallen asleep but I wanted to 1st know the full limits of the drug.\r\nIn conclusion it has great potential for a sleep aid. It could also maybe help flush some stuff out of your system if your were in going in for a drug test at work since it makes you go to the bathroom frequently. I really dont see any addictive qualities that I could find since it would be a worthless recreational drug.\r\nEffects\r\nPositive\r\nMuscle relaxation\r\ndream like experience\r\nSedation\r\nNeutral\r\nPupil dilation\r\nSleepiness\r\nTime distortion\r\nNegative\r\nFrequent use of bathroom\r\nLoss of conscious\n\n\n"
}