{
 "title": "Fun Fun Fun",
 "author": "Buttercup",
 "citation": "   Buttercup. \"Fun Fun Fun: experience with Salvia D (ID 58940)\". Erowid.org. Jan 21, 2007. erowid.org/exp/58940",
 "substance": "Salvia D",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "  T+ 2:00",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2007",
   "58940",
   "Female",
   " ",
   "Not Given",
   "Jan 21, 2007",
   "2909",
   " "
  ]
 ],
 "report": "<p>My husband (we'll call him M.) and I decided after some research to give Salvia a try. I have had experience with LSD and shrooms in the past (many years ago) but my husband has never tried anything like this. We are not even regular pot smokers though we have both loved doing it in the past. We bought a starter pack with Salvia 5x, 10x and leaves from an online distributor. We decided to try it on a Saturday afternoon - no plans for the entire weekend except for the Salvia. The idea was that I would go first and then he would go so that one of us would have our feet on the ground during the ride. We decided to try this in our living room - put on a music channel on the TV, turned off all the lights and drew the shades. We used a home made water bong that we made with instructions from the internet. Taking out the Salvia 5x I packed the bowl and was the first to go. I took 3 hits and had a feeling of euphoria and a bit of the giggles but not much else. We waited 20 minutes and after we decided that I wasn't getting much further my husband was anxious for his turn. What a totally different reaction. We repacked the bowl and he took 3 large hits in a row. Immediately I saw his face change - he said to me 'You were doing this ALL WRONG!' and laughed with a huge grin stretching from ear to ear. He said 'I see the sun' and then 'You know that first cup of coffee in the morning - well this is like 57 of those in a row!' He was no longer looking at me but instead looking past me. We were just laughing so much. For whatever reason (probably because I don't like to let things go to waste) I decided to inhale the rest of the smoke in the water bong as he was clearly going into his trip. I immediately felt a difference this time and started laughing uncontrollably. He said to me 'I feel like I'm falling' and leaned back on the couch. I felt I was on the precipice of going over the edge but inside I was extremely hesitant about 'letting go' as I knew that it was a bad idea for both of us to be out of it. I started pointing to one of our cats which was nearby and saying 'Look at the cat' and my husband was like 'Who cares about the cat I'm in another dimension'. It was pretty comical. He tried to explain to me what he was feeling was 'Being like water in a bucket that's being spun around and around and gravity is just holding it in place.' All in all the peak of the trip for both of us lasted about 15 minutes. We cuddled together afterwards and both commented on how relaxed and content we were. About 2 hours later we decided to do another round. I went first again and this time I saw his face stretch so that the corners of his mouth extended almost to his ears. I was giggling and he asked me what was so funny and I said 'It's all funny - all of it' (yes very deep). My center of gravity was very much a concern for me and I felt myself first being pulled backwards and then being pushed forward while I was sitting.  I again did not break through but it was great fun. M went again and this time he went a bit slower - at first it did not hit him but then he was looking past me again and said that the shadow of the flowers on our bookshelf looked like a dinosaur, then a poodle, and then Mickey Mouse. He was clearly somewhere else again. We both laughed and then just cuddled on the couch while listening to the music. It was a great time. I totally reiterate what has been said before here that Salvia is not a party drug nor is it a replacement for cannabis - it is a totally different and unique experience unto itself and should be respected. We are going to try the 10x next weekend.</p>"
}
