{
 "title": "The Day I Watched Myself Fall Apart",
 "author": "Erika",
 "citation": "   Erika. \"The Day I Watched Myself Fall Apart: experience with Salvia divinorum (ID 58948)\". Erowid.org. Aug 10, 2009. erowid.org/exp/58948",
 "substance": "Salvia divinorum",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "58948",
   "Female",
   " ",
   "Not Given",
   "Aug 10, 2009",
   "2762",
   " "
  ]
 ],
 "report": "<p>I wrote this report about 5 days after having the experience. Keep in mind that I've been hard at it with psychedelics enough to feel experienced about close to everything out there. Saliva changed everything. It redefined everything I ever thought to be tripping, to be reality, and I honestly couldn't imagine being more fucked up, humiliated or devistated in my life.</p><p>I was sitting around at my friends house in his room, Zak, smoking some bowls of marijuana out of his bong.  After we grew bored playing guitar hero on the playstation, Zak flashed a small baggie with what I knew to be salvia in it. I had tried salvia several times, never really getting any results from it. Ive also watched people do salvia time after time, and no one Ive witnessed smoke saliva has ever gone where Zak and I went this day. </p><p>I put a small pinch of marijuana in the bottom of the bowl, and put a decent sized pinch of salvia on top of it. I only know this was the highest you could buy at a local head shop, labeled purple. </p><p>Zak went first (keep in mind this is about a 3 foot tall bong) and I took the remains of the bowl and held it in for 30 seconds. I didnt feel much, so I picked up the guitar and put it on. I asked Zak if he wanted to play with me, to which he stared blankly at me as if Id just asked him something he couldnt possibly answer. I sat there a little longer, thinking it was strange how he was acting but not assuming it was the salvia. He sat like this for a few minutes, unable to pick up his guitar and play. Finally, I asked him Are you okay?. It was quiet for a minute and his response was Do I look okay?. I explained to him he looked very worried but that was the only thing. A few more awkward minutes went by and then suddenly he picked up the guitar, and we played a song like nothing had just happened. I decided to take another hit, I like the simple body high was getting from the first hit.</p><p>This is when my world was shattered. I loaded the bowl again, took the biggest rip possible and began to count in my head. The last thing I remembered was second 28. By second 29, I was in a completely different position. The details of what was actually happening arent all there, but I still distinctly remember the feelings I had. The first feeling was overwhelming pressure, like 10,000 pounds were on top of me. I felt like I wasnt getting the big picture and I needed my friend to help me figure out what I was seeing, because I couldnt make out what I was looking at, but I was very very scared of whatever it was. </p><p>I felt as if I had done something horribly embarrassing in front of Zak, and our friendship was always going to have that awkward memory, much too awkward to actually get over or let alone forget. Comparable to shitting your pants in front of someone, making things so horrible you want to cry. While I was feeling this way, I had no idea that I had smoked anything at all, this was my life and it wasnt getting any better. I can only explain the feelings I had as going through the very worst part of the very worst day of my entire life, while it continually got worse. I had to ask Zak what was going on, why was this happening? The words Why is made it out of my mouth, and thats when I realized a little something. The image I couldnt make out was in fact my own mouth, up close. I watched myself say those 2 words and it was so intensely freaky I couldnt dare talk anymore. </p><p>Things zoomed out a little. I was still looking at myself, but I could now see my entire head from a strange angle. This is when things got crazy. Imagine a head being cut right down the middle and then in half again, making 4 whole parts that when combined made up the head. The lower left chunk of my head fell onto the floor, for the entire world to see. I had a feeling the whole time that I was somehow involved in a fucked up reality show and that everyone was waiting for me to figure out the big joke, the whole time the audience laughing randomly, although I never saw any other people except my friend Zak. I was also laying down on his bed when I lost the section of my face. I could reach the floor easily, and instead of wondering what to do with this part of me on the ground, I picked it up and put it right back in. I wish I had the words to explain how utterly disturbing that moment was for me. </p><p>Something strange happened next but Ive forgotten exactly how it went. I just remember the image of my body laid flat and my skin peeling off, sticking to the ground and then in an instant being put back on perfectly. </p><p>By this time, I was so emotionally destroyed I wanted nothing more than to kill myself, which is what I figured they wanted anyway, I must have done something I could never take back or be sorry enough for. I now know how to describe the last minutes of my experience as being thrown viciously back into reality. Zaks room had just been picked up by them, and they were slowly turning it completely over. I tried my very best to crawl up Zaks bed frantically towards  the upper corner of his room. I decided this was the end, my life had become too miserable and someone was ending it for me, being as I was too pathetic to do it myself. </p><p>Right before I left this place that I was thrown into, I was laying on Zaks bed and I felt like I had figured it out, I was almost to that point of realizing what everyone wanted me to realize and it all being over and one big joke. There was a blanket and some jeans folded on his bed making an arch around me (the clothes were really there and really did look like an arch on his bed) and I lifted the bottom of the arch, which was the first time I had actually moved the entire 5 minutes, and the arch flew up into the air. </p><p>I looked down and realized I was sitting on Zaks bed, although I knew a split second earlier I was most definitely laying down. I screamed I UNDERSTAND WHAT JUST HAPPENED TO YOU! but what came out of my mouth not what I told my brain to say, it was laughter. Loud, hysterical laughter. I didnt know why I was laughing, but I couldnt stop either. When I could actually talk, I began to explain to him everything that had just happened. He then let out a huge sigh of relief, and admitted he had a very similar disturbing experience. We were both so extremely mind-fucked by what had just happened that we could barely grasp that it was possible and that it had in fact happened to both of us. He was just so relived he wasnt crazy and we began talking. And talking. And talking. </p><p>We did this around 9, you know.</p><p>Really? What time is it now?</p><p>It was 11:30, and since I had come back to reality we had just been sitting there bug eyed and shaken talking about it for 2 and a half hours.</p><p>The weird thing about it all was during those 5 minutes it was the worst 5 minutes I could ever imagine going through, but afterwards the way it was just over and I could look back on all the crazy shit that had happened and actually be okay it just made me want to do it again and again just to know I can survive that kind of an experience. However, I decided not to do salvia for a while, just because it was such a traumatic experience, but I know that I will eventually try it again. I want to write books about this, I am amazed that a legal substance could be so powerful. I also think the next time I do it I will be more prepared for such madness, not having a clue of the possibilities made it quite shocking to go through. </p><p>The next time someone asks me about the craziest drug Ive ever done or the craziest experience, I will talk only of salvia and the night I watched myself fall apart.</p>"
}
