{
 "title": "On the Good Ship Lollipop",
 "author": "Matt Himself",
 "citation": "   Matt Himself. \"On the Good Ship Lollipop: experience with Fentanyl (Actiq) (ID 59235)\". Erowid.org. Feb 26, 2007. erowid.org/exp/59235",
 "substance": "Fentanyl (Actiq)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "600 ug",
   "oral",
   "Pharms - Fentanyl",
   " ",
   "  T+ 3:30",
   "1 cup",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 59235",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2007",
   "Views: 32640",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Substance: Fentanyl (Actiq lollipop)</p><p>Experience: very experienced</p><p>Setting: My home</p><p>November 3, 2005</p><p>It has been nearly two years since I wrote my last report. My life is quite different from what it was only two years ago. Being a full time student and still working thirty hours a week consumes most of my time. This has made me stray from using psychedelics for some time, as I simply have not had a long enough period where I could dedicate to using them.</p><p>In this time my preference of chemicals has shifted some. I still have the most reverence for psychedelics, as they have shown me countless things about myself, and Im sure in the future, will show me even more. Yet at this time in my life, I have found myself enjoying opioids more. They allow me a pleasant relaxing experience without forcing me to take time away from my daily routine.</p><p>I had hesitated writing a report on opioids for the simple fact that I did not think there would be much to report. There would most likely be no profound revelations or ego shattering experiences. Still, as my fascination with chemicals the same as it always was, and I like to share information, I felt compelled to finally do this.</p><p>I recently acquired an Actiq brand fentanyl lollipop. They were the 1200ug strength ones, which I believe are the second strongest, only next to 1600ug. I always found the concept amusing, a lollipop that would relieve pain, or get one high.</p><p>So the stage was set. It is November 3, 2005. Im at my house with my girlfriend R and we are watching TV. As my favorite news program, the Daily Show (yes, I know its a satire) I cut open the container and look at the chalky white end. In tiny letters it says Fentanyl 1200ug. I take another look at the clock, it is 11:05, and here is where we begin</p><p>11:05 PM - I put the lollipop into my mouth and start my timer. In past experiences I have found that the pop can be sucked on for roughly ten minutes, give or take thirty seconds depending how vigorously one twirls it. I want to ingest around 600ug of fentanyl tonight so I leave it in my mouth twirling for 5 minutes. I know that it wont be exact, and I could probably have anywhere from 550ug to 650ug, but quite frankly with fentanyl, Im not sure of a more accurate method.</p><p>11:10 PM - I remove the pop at exactly five minutes to the second. I put it back in the casing, and place it in a zip lock bag. Im not sure if air will deteriorate the lollipop or not, but I would rather be safe than sorry. My mouth has a strange taste in it now. The pops dont taste bad, but over 800ug the medicine flavor is noticeable. It tastes somewhat similar to the aftertaste of chewable childrens Tylenol.</p><p>11:12 PM - I notice the first sign of the fentanyl. There is a warmth in my stomach growing, and I feel noticeable calmer than I did seven minutes ago. It always amazes me how fast they kick in.</p><p>11:20 PM - By this time I am feeling quite nice. I have a steady warm feeling flowing through me. My eyelids feel somewhat heavy, not much unlike how they feel after smoking marijuana. My thoughts have slowed way done now. I am still watching the Daily Show and laughing along while I watch R studying on the other end of the couch.</p><p>11:45 PM - By now I am fully immersed into the opioid world. My thoughts have shifted quite a bit. Im feeling quite comfortable right now. I would not describe this as euphoric, though I can see why some would say it is. It is more just a state of complete contentment. The way I feel at this moment can be compared to coming out of the cold on a winter day and sitting by a fire wrapped in a blanket. It creates a feeling of perfection, like I cannot be touched, and that nothing could disturb this peace.</p><p>12:00 AM - R leaves. I walk her out to her car. It is a rather nice night out, but I am walking barefoot through wet grass. This doesnt even register as something that could bother me right now, Im just too content with not letting little things get to me. I kiss her goodnight, and send her on her way. I then walk back inside, and use the bathroom. Afterwards I make a point to look in the mirror. My eyes are actually white tonight, though they tend to get redder as the night goes on. The main thing that stands out though is the miosis present. My pupils look like they are simple dots marked with a pen.</p><p>1:00 AM - I have spent the past thirty minutes are so writing up to this point, and from here out I will be writing as I go. I have been alternating between reading message boards on the internet, chatting on AOL Instant Messenger, playing Playstation, and playing my guitar. I feel the same as I did one hour ago, except now I am wearing pajama pants and slippers, which add to my comfort level.</p><p>I am now however faced with two predicaments. First, while I am quite comfortable, I am nowhere near a point of being sick. Through experience I have found that drinking one alcoholic beverage will increase the effects some. I am debating drinking one beer to increase the effects slightly. For the record I do not recommend drinking alcohol after having ingested pain killers to anyone. It can be dangerous, especially if you do not know your limits, or how your body will react. I am still thinking about whether or not I want to have a beer.</p><p>My second problem is that Im feeling a bit hungry. Some people have no trouble eating on opioids. I unfortunately, am not one of those people. If I eat anything heavier than something like toast or a bland soup, I will be hugging the toilet to get it out shortly after. So it becomes a question of whether or not I want to chance it. For the time being, Ill decide to go against both these ideas, but being the insomniac that I am, that could change as the night goes on.</p><p>2:00 AM - The past hour was spent reading some more and talking to an old friend whom I hadnt spoken to in some time. Mentally, I still feel the same, very calm and sedated. I find myself yawning more and more, though I dont feel all that tired. I decided to have that beer to try to boost the experience slightly, allowing me to slide a little deeper into the little safe haven Im in. I find that usually around 3 AM I feel a second peak, which I attribute to being tired (I usually take opioids late in the evening). I find myself wiping my face a lot, just like rubbing my hands over my cheeks. Fentanyl makes me much less itchy than other opioids tend to.</p><p>3:00 AM - I am wondering if Ill regret drinking the beer. Its only half gone, but I feel my head getting heavy. Im not in a full on nod, but Im quite close. Im sitting slanted in my chair, with my head titled back, with what I imagine is a completely blank look on my face. Im still playing Playstation, but Im finding it harder to focus. This is not because I cant, but because I just cant be bothered with it. I feel too nice just sitting still to be bothered with the effort involved with sitting up. I also have to keep reminding myself to write more to this, as I keep drifting off. Right now I think its actually fairly cold in my house, but I still have the blanket by the fire feeling I described before. And I am definitely feeling that second peak I described. Whether it is the beer or being tired, Im not sure.</p><p>3:30 AM - I just made a trip to the bathroom and took a look in the mirror. My eyes have gotten significantly worse from earlier. My pupils have gotten even smaller, and my eyes are now quite bloodshot. Now that Im sitting back down, I notice my eyes falling shut inadvertently. My eyelids have simply just become too heavy, and I just dont care. However, Im burning a DVD on my computer, so I need to stay in my seat about twenty more minutes. Then I plan on lying down and resuming a movie a I started earlier.</p><p>4:00 AM - I heading to bed to lay down now. I probably wont fall asleep for about an hour, but lying under the covers of my warm bed is sure to be a very comfortable experience. This concludes tonights experiment.</p><p>2:00 PM - I wake up to be at work for 3 PM and I feel fine.</p><p>------------------------------</p><p>So there you have it, my first opioid trip report. I should note that to me fentanyl is very different from all the other opioids. Most feel very similar but seem to have their own signature. Oxycodone tends to make me more euphoric and somewhat stimulated. Hydrocodone tends to leave me with a goofy grin on my face with a much more sedated feeling. Morphine makes me calm but sloppy. Fentanyl doesnt make me euphoric, it just makes me perfectly content. It seems to create a little bubble which nothing can penetrate. Its a nice little six hour vacation to take from time to time.</p><p>I hope this hasnt been too boring to read. I tried my best to make this a somewhat interesting report rather than just saying I felt nice. I again dont recommend drinking on opioids, nor do I recommend going to sleep if you are nodding too hard. But if used carefully, these can be quite the treat.</p>"
}
