{
 "title": "Is This My Life?",
 "author": "Onward",
 "citation": "   Onward. \"Is This My Life?: experience with DXM (ID 59323)\". Erowid.org. Jan 8, 2008. erowid.org/exp/59323",
 "substance": "DXM",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "240 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "59323",
   "Female",
   " ",
   "Not Given",
   "Jan 8, 2008",
   "11136",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been experimenting with DXM for about 3 months now, and have been using somewhere around 460 mg each time I have used it. I have been noticing that I keep craving it, and I don't really know if it's an addiction or not, because my life seems to be going normal while I am doing it, and also when I'm not.</p><p>In a moment of weakness, at about 11:00 PM, I braved the cold and trekked all the way to the convienience store to get something to get me high, Anything. I felt I needed it. So I bought a bottle of Robitussin Honey Cough, which was 4 oz. and 10 mg per 5 mL. I got back home, freezing, and drank down the bottle with a Monster energy drink.</p><p>I later realized that this was significantly less than I was used to taking, but I assumed it would be enough to get me through. I started feeling a slight buzz after a half an hour, quicker than usual, but not as strong. This feeling continued, slowly getting stronger, but not by much, and I noticed that other than feeling slightly 'altered' nothing else was up.</p><p>It was a bit disappointing, but also a bit of an eye-opener. I have become tolerant of lower doses now, and soon enough it will happen to my usual doses too. I'm thinking about taking a break from it, but that's easy to say when I am not craving a high. I know that tomorrow night I will be like 'man I need my dex' and perhaps go back to the store and buy more dex. But for now I consider myself taking a break.</p><p>I love dexing. It's a very peaceful experience, even at this low dose which I've become mostly tolerant to, it was nice.</p>"
}
