{
 "title": "Be Careful What You Wish For",
 "author": "Chaotic",
 "citation": "   Chaotic. \"Be Careful What You Wish For: experience with LSD & Cannabis (ID 5935)\". Erowid.org. Feb 6, 2002. erowid.org/exp/5935",
 "substance": "LSD & Cannabis",
 "bodyweight": "66.6 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 5935",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 6, 2002",
   "Views: 13482",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis may be a little hazy.  I'd had a few mushroom trips and much acid before, but this time things got too crazy and started interfering with real life (altered it forever).  I went with a couple of girls I knew up to a winter solstice dance party north of Auckland.  We went in but it turned out to be more of a club thing, lots of people drinking so we went out to the beach.  Teresa put a tab on my tongue.  Driving down the hill it started coming on like the adrenaline you get from falling on a rollercoaster.  \r\nGet out to the beach.  It's a full moon and beautiful the sand's glowing.  I'd been reading books and developing an almost obsessional interest in telepathy and psychic stuff and spiritual stuff.  I am convinced there's some truth in everything.  Anyway, along with the feelings of unity and realising the interconnectedness of everything I started noticing the barriers being blurred too much.  I was getting my usual hallucinations of these changing geometric beautiful patterns.  And the girls I was with (who I didn'Teresa really know that well at the time) started describing what I what seeing.  So I changed the patterns.  It seemed to me they described that too.  Wow.  This was amazing.  It made sense that our thoughts could be connected in some way...other people had told me about telepathic experiences while tripping.  Both of the girls kind of looked like witches under this desert moon, One of them turned to me and said 'your mind is like a jumper, it's unraveling and it won'Teresa stop until it's all gone'.  I mean I can tell between what's real and what's not I try to be real scientific about it.  I started having these telepathic conversations with them.  Everything that was spoken was directly in synch to the 'silent talking'.  \r\nWe drove down to another beach while the sun rose.  We had a smoke to send us off to sleep.  Before Teresa fell asleep she laughed this maniacal laugh and said 'only normal people sleep in their cars don'Teresa they'.  They fell asleep but the pot just made my mind go faster.  Anyway 10 minutes later I hear this guy in the carpark, hell rough and swearing at his little dog -- hecomes over to the car  stares in and says 'Only normal people sleep in their cars don'Teresa they!'.  And me who's not tripping but mind racing's thinking what the fuck....I mean cooincidences happen...but did she make this happen? I'm trying to make sense of all these connections.  I start seeing/noticing more and more connections.  I went walking and tried to centre myself.  \r\nBack to the city I'm dealing with life but my mind's going fast.  A few weeks later I go away with some friends to a bach near the mountain. I'd been reading a lot of Zen stuff and thinking about the problems in the world.  I concluded that basically what was wrong with the world was that people were selfish, too egocentric, so (this is so naive and stupid in retrospect) I went and practised this yoga breathing technique I'd read about where I'd hyperventilate then hold my breath until my body would shake.  This technique in the book I was reading was supposed to result in union with the divine.  I intended to throw my ego away.  I heard this roaring wind and I was getting closer and closer to something, except it seemed cold and harsh, I was about to jump off into nowhere when I saw this flash in my head of me and Teresa in bed together (we'd been playing these mind games with each other for a while but I was more interested in a friend of hers). I got up walked out of the room and all the lights were out.  The others were lighting candles and checking the fuses, which were alright.  15 minutes later the lights came back on spontaneously.  Weird.  \r\nThe next morning I went outside and tried to channel this universal energy through me.  All these little birds came and flew around me.  For real... I went back inside and others were playing cards, I focussed my energy and won round after round after round, it was unreal, like these extra parts of the universe were being revealed to me.  I guess I had a bit of a messiah complex, without taking things literally.  To cut a long story short I ended up hooking up with Teresa, went back to Auckland, found out she was a junkie and tried to make her stop, one night she'd taken some more maybe too much and she would pass out from pain withdrawing, I tried to use my healing powers (cause I thought the mind can do anything) and tried to take the pain out of her into me cause I could handle it.  Me whose mind's been speeding for the past two months.  Anyway it was at this point I started hearing voices.  Evil destructive shit.  Trying to convince me I was evil and twisted.  Despite my meglomania I'm real peaceful and nice mostly.   These voices would try and take me apart.\r\nThe relationship ended up being codependent and unhealthy and lifeless as my world got progressively warped.  I stopped going to art school and stayed home to help her get through withdrawal and that.  Heroin is fucking evil, I was curious before but having seen the bad side I'd never do it...anyway from somewhere I got this crazy idea she would die without me and being the stupid martyr I was , I have no regrets but I could have sorted it out if it weren't for my cerebral madness.  Ended up going to the psychiatrist, on medication for 6-8 months.  Pot brings the voices back.  They are like fully-fledged humans (if humans had wings) I mean totally unique personalities.  I still hear voices sometimes.  Mostly they accentuate doubt and fear.  But there are good ones as well.  When I was younger I always wanted some kind of tragedy but when faced with it life is too precious and beautiful to discard.  The relationship ended on New Year's Eve 2000.  I lost a lot of my self-respect, cause I clung on a little too long because I was losing my mind and everything else. \r\nI miss tripping.  Psychiatry doesn't really know shit, but if I was to trip again I could be opening myself up to a lot of trouble.  On the upside I've learnt a lot, and there's this whole spiritual growth thing.  Some drugs can help, others can hurt.   And be careful what you wish for.  I've experienced enough to be completely humbled and in awe of the universe, and convinced time and again in all the psychic stuff.  Many layers of reality. These are things that will come naturally like a flower unfolding.  If you try and force it open like I have done you can get a whole lot of pain.  One good thing I've learnt from tripping is that you can feel really alive, everything sparkles with a kind of newness, vitality.  But you can take this from your experience and cultivate it in the rest of your life.  To receive the next moment fully you have to let go of the last moment fully.  \r\nKia Kaha.  Kia Maia.  Kia Kahawanui.\r\n(Stand Strong. Elevate your spirit.  And hold firm)\n\n\n"
}
