{
 "title": "Adam-everything",
 "author": "Adam-thinking",
 "citation": "   Adam-thinking. \"Adam-everything: experience with Mushrooms (P. cubensis) (ID 598)\". Erowid.org. Sep 25, 2000. erowid.org/exp/598",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 598",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2000",
   "Views: 13996",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nPlanned for months I was going to take a friend on her first trip.  It was her birthday and I thought that maybe it would lead to some amazing bonding between the two of us.  Her stressful life opted her to not do it and so, behest her having paid for her share, I gave them to some other people to do with me.  Of the two people one was also a first time tripper.  The other was a many time tripper as I was.  I agreed to meet them at an apartment complex after I did some much necessary tasks of collecting people.  </p><p>We finally congregated in an apartament and watched a little TV while talking.  The sad thing was that the two were already tripping and were both scared out of their minds to be without me as I was experienced with taking care of tripping people.  I didn't trip until later.  We decided to get out of the shady claustraphobia that was enveloping us and to go for a walk to a near-by bridge.  I started tripping and just feeling good.  Usually when I eat mushrooms I hit hard and fast and delve into the nether realms of my own mind only to find nothing inside rolling around.  </p><p>I am Adam-thinking, by the way, and that is all that I can tell you.  Being with these people and not knowing them all that well was an entirely new experience for me.  We walked through the woods and all over observing the warm and beautiful state of the shrooms.  Inside my head was no shroom like feeling yet.  We encountered a friend on a path while we were wandering half lost in the woods.  He was also an experienced tripper and knew how to talk to us and handle us.  We walked and talked with him for a while.  I was still not really tripping, although I had some of the feelings that I was coming down and in reality I was peaking, hard.  I was lost inside of my desires, not knowing anything truly, but only feeling.  </p><p>On the way back home we walked through campus and it hit me.  I was walking in thought, almost spacing, and the person that was still with it but was also tripping asked me if I was alright.  That sent my trip to its purpose.  I had been merely walking with my head down in thought.  That is Adam.  I had to explain to them that since they were not the normal people that I trip with that I had to dub myself something, so I said, 'That is just Adam-thinking.'  That is me.  The people I normally trip with are close friends and they know me and they know that walking with my head down in thought is who I am.  These people needed a title so that they understood that I am Adam-thinking.  </p><p>The rest of my trip was only an extension of that.  I realized that the entire trip I had been feeling like I had no group or hard description for who I am.  Some people are from a place like Arkasas.  I am from nowhere.  Some people are part of something or can be described as something like a skater or a punk.  I used to be, but now I am not.  Well, I am, I am Adam-thinking.  I have parts as does everyone else.  Some people are Person-expressing, such as artists.  Some are Person-faking, there are lots of these.  Some are Person-understanding, like Siddhartha Guatama-understanding.  </p><p>I am Adam-thinking.  I have parts of me that are Adam-understanding, which is led to through Adam-thinking, and I have Adam-expressing which is how I show that I am Adam-thinking, and there is, of course, an Adam-feeling, although he is distant.  All in all I found who I was for the first time while tripping.  No, things didn't swirl and melt.  Well, sometimes they did, but that was not my trip.  There were the inevitable and playful reality changes through my eyes, but those were no big deal.  I was focused that I am Adam-thinking.  Above and beyond that I was Adam-understanding too much about what Adam-thinking should do with Adam-expressing.  I would be the perfect expresser, but Adam-understanding would hate that People-understanding would not be understanding what Adam-thinkig really was.  Like Jack Kerouac I would end up drinking myself to death if I were a writer.  Well, I recommend it very much.  Very, very much.</p>"
}
