{
 "title": "Magic!",
 "author": "the good doktor",
 "citation": "   the good doktor. \"Magic!: experience with Salvia divinorum (6x extract) (ID 5980)\". Erowid.org. Jan 18, 2002. erowid.org/exp/5980",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "0.66 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5980",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2002",
   "Views: 5950",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLet me start off with some personal history: I have had a rather full array of psychedelic experience, including the god-like terror and insane paranoia (including the 'realization' that I was dying, the conversion of 'normal reality' into to complete black and white) that come with bad mushroom and heavy-dose acid trips.  So, perhaps, I was ready for the power of the heaviness of the salvia experience. </p><p>This is exactly what I wrote as I was coming down:</p><p>Under Salvia - A second ago, literally a second, I was in 'reality', and then I was SUDDENLY in WONDERLAND, like I had been there for hours. You (I) seriously don't remember the peak you reach when that hit sinks in (the full essence of the peak). I can only write this now that I am fading back out. In an instant my body went cold, I was SERIOUSLY a ghost, I could do anything WONDERLAND would let me. But WONDERLAND was questioning me, questioning my stance, testing my strength of spirit. The rappers I was listening to in my headphones (Mos Def and Talib Kweli) were talking directly to me; guiding me; asking me to 'come along' so they could show me what they knew. Salvia throws you (me) DIRECTLY into the full MAGICAL/MYSTICAL/ NON-HUMAN place where you can do and think things you could never do in the human realm; anything. Salvia throws you directly into the full-fledged experience of the peak which your (my) normal brain can never remember when it fades back to 'reality' (or, normality of existence). I went to a place physically impossible, and stayed there for only a few minutes. I met MAGIC, and it sent me back to the ordinary. I am still amazed. It is a full trip, an ENTIRE trip, yet abbreviated. It is a WHOLE good-mushroom or good-acid experience, put into a few minutes. The only difference is, with salvia, you start at the PEAK. It BLASTS you into the PEAK. I am FLOORED by the POWER OF THE MAGIC.</p><p>- as I said, I am rather well experienced in the flavor of the psychedelic experience, and thus, it takes quite a bit to impress me in this realm. Also, as I said, I have experienced the terrifying flavor of the 'bad trip' more than twice. And, having gotten past this is, perhaps, what helped me from being terrified by the immediacy and power of the salvia experience. So, when trying this, I am aware of its total and absolute power on me. And hold no fear in my heart. Because any fear I have (as experienced psychonauts will tell you) will be exaggerated a million-fold, and dropped back on top of me. Salvia has something to teach. And if Im not willing to learn, it COULD turn on me.</p><p>- I don't mean to sound like a visionary, or like I know everything (or even a lot). I am simply conveying my own personal/subjective experience. And be sure to take this into account--if my telling of my experience sounds overly-dramatic, it is only EXACTLY how I felt, and that was pretty damn dramatic. Keep the love flowing kids.    - the doktor</p>"
}
