{
 "title": "Voices, Languages, Enlightenment",
 "author": "RoyceNips",
 "citation": "   RoyceNips. \"Voices, Languages, Enlightenment: experience with Mushrooms (ID 5995)\". Erowid.org. Feb 6, 2002. erowid.org/exp/5995",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 5995",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 6, 2002",
   "Views: 5594",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had recently been in search of magic mushrooms for quite some time now. I tried going through one of my friends to hook me up, but that never happened. So... I eventually recieved 1/8 from one of my friend's boyfriends.<br>It was a Thursday night and I had just finished eating supper with my mother and father. I was never so anxious to finish a subway sandwhich. I practically skipped up my stairs and retreated to my room. I had stored the mushrooms in a box in my cabinet that my parents never check. It was time.<br>I sat down at my computer, made sure I had plenty to drink, and proceeded to eat the foul tasting shroomies. It was about three handfuls, on the second i found myself almost gagging. I took a sip of water. With the mushrooms ingested, all i could do was wait and get ready for the journey I was about embark on.<br>I knew the early signs on what to look for before tripping. I was very anxious, and a chill came over me, like a cold metal foil was wrapped around my body. I was starting to see auras around lights and reflections of glasses started to show off rainbow colors. This was only the beginning of it all. <br>I decided to move to a more comfortable place and prepare for my trip. I layed down on my cozy bed, more anxious than I have ever felt. I found myself starting to stare at inanimate objects and household furniture. I layed on my back only to realize that my ceiling had become a black ocean with white mountains protruding from its underneath. This amazed me, I was in awe. Patterns in the mountains started to come about. My eyes were tearing now, which scared me. I was thinking maybe I took too many and it's having effects on me. Maybe my brain was leaking!! nah... but I know I was scared when this started to happen. I was freezing now, I dont know what had come over me.<br>I sat upright on my bed and began staring at my closets and the space between the two. A small deer's head was perched in the middle of the closets. It was an ominous and overpowering figure to me. I thought I heard him speaking to me, as to worship him as a God, for he was so high above me. I got on my knees and started to pray... but why? I got up and smacked myself. 'This isn't happening', I repeated. I sat back on my bed to only find myself staring at the closet space again. Now patterns and colors were taking effect in my mind. The space turned a bright orange, and shots of spirals spewed through the wall. My eyes wandered and hit a lamp. The lightbulb in the lamp seemed to have an alien face of sorts on the inside. It was telling me, 'Come fight me, you can't so anything, you weak fool, Come fight me now!'... 'Fuck you!!', I yelled out. I was going nuts. This was pure insanty. I layed down on my bed, mouth to my pillow, proceeding to blow warm air into as a relief. As I did this, the ground ballooned up. I sucked the air in that I blew into the pillow and realized I was controlling this phenomona. wow! <br>Later that night, in the peak of my trip, I proceeded to draw what was on my mind. As I drew, my arm moved itself. My hand was not drawing this picture, it was my mind. The pure energy of my mind had been moving this pencil the whole time. <br>Voices, many voices could be heard now. So many languages. Different cultures speaking in a trance-like melody creating music as it went along. I could not understand a word of it, yet it was beautiful and enlightening. I started to realize, 'Why am I here? What is this place I call home? What is this place we call earth?' The thoughts kept coming with the answers only being more complicated than the last. I sat down once again. My hands had become the largest things around. Kind of like the Foo Fighters - Everlong song. I outstretched my hand and realized I had hawk like vision. Every crevice could be seen in my hand. It was an amazing thing to see, every detail which couldnt never be seen by the naked eye was all exposed to me right now.<br>Visions were everywhere, patterns forming on the floor, only to stay there and always be there. Not moving, yet I couldnt take my eyes off of them. Animals were forming from thoughts, and mostly, a reoccuring red fox, found in the right hand corner of all my visuals, like a trademark.<br>This is the most I can write of my experience for now. Alot is a blur, yet alot is beautifully clear.\n\n\n"
}
