{
 "title": "Tesselations",
 "author": "Ryan",
 "citation": "   Ryan. \"Tesselations: experience with Salvia divinorum (5x extract) (ID 6004)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6004",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "  T+ 4:00",
   "30 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "  T+ 12:00",
   "60 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6004",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 8, 2002",
   "Views: 7043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLast night, I had the chance to try salvia for the first time, and overall, I'm very impressed.  I was pretty anxious to try it out after I first recieved it in the mail, but decided it was best to wait until I had a sitter before trying anything besides a very small dose.</p><p>I settled with 15 mg to see how I reacted to the smoke.  I had been sneezing heavily since sorting out dosages, and was worried I was allergic.  Loaded 15 mg into a 12-inch waterpipe, and smoked in my darkened living room.  At this low of a dose, I noticed a feeling not unlike a typical cannibis high, but extremely clearheaded.  Thankfully, no allergic reactions or anything of the sort, and I actually found the smoke to be much more pleasant than anything I had done in the past.</p><p>Later that day, my girlfriend stopped by, and we decided we would both give it a try.  She's rather unexperienced with smoking out of a waterpipe, and it was decided I'd try a small dose to show her how to use it.  Around 4 hours after the original 15 mg dose, I loaded and smoked 30 mg, and layed down on my bed, in a completely darkened room.  Barely tangible closed eye visuals lasted for a few minutes, mainly blue patches moving about.  Around 10 minutes later, a very sensual feeling overcame me.  Touch was elevated, almost like MDMA, but with a more electrified feeling.  Also, my voice sounded much lower, and somewhat congested. </p><p>After my girlfriend tried a small dose, we had to run, so a larger dose was put off until later that day.</p><p>12 hours or so after my initial experience, another opportunity arouse to try it out, and since I didn't want to have a breakthrough yet (I like to experience an entheogen on all its levels, not just as far as it can take me), 60 mg was decided on.  I returned to my living room, girlfriend by my side, and prepared by turning off the lights, and putting on some light background music.  Loaded 60 mg, smoked in 1 hit, and held for around 30 seconds.</p><p>I felt it before I even finished inhaling.  It was like the upper half of my body instantly weighed thousands of pounds, and gravity had switched itself to a position behind me.  I was pulled back down onto the bed, but still felt like my body was being pulled torwards the wall behind me.  Like something was trying to pull me away from myself.  Closed eye visuals were largely spiraling tunnels, however, it was the open eye visuals that were the most interesting.  Everything around me was patterned in green and purple, with yellow streaks running through here and there, and the largest, brightest objects all had tesselations of marijuana leaves in alternating green-purple-yellow patterns.  It was one of he most strikingly clear visuals I've ever experienced, compared to the usually muddled and blurry visuals I've experienced while on acid.  Everything seemed to release energy, which would meld together, flowing from one object, out into space, and interacting with and changed the energies of all of the other objects around me.</p><p>After around five to ten minutes of this, I came down to a plateau where I just felt incredibly heavy and hot, and where I had a really hard time articulating the experience.  I was covered in sweat, which kind of scared my girlfriend, but after another 10 minutes I was fine in that regard.  20 minutes after dosing I was able to get up and walk around.</p><p>The effects lasted several hours afterwards...  While giving my girlfriend a massage, I could feel the energies running through her body much more effectively, and it was if I was engrained with a knowledge of how those energies needed to be manipulated.  I couldn't help but to think of the chakras, and making love around an hour after the experiance also had a very Kama Sutra feel to it, that I still can't really put into words.  Both probably due to the fact that the background music had a very traditional Indian feel to it.  It's as if I took on the part that the music portrayed for a few hours.</p><p>Overall, very positive experience.  I can't wait until I have a chance to try her again, at a higher dosage.  I definitly felt the power in this plant, and can't wait to learn what she has to teach me.</p>"
}
