{
 "title": "Observations on Dosage",
 "author": "Thyrfing",
 "citation": "Citation:   Thyrfing. \"Observations on Dosage: experience with DOI (ID 60176)\". Erowid.org. Jun 14, 2007. erowid.org/exp/60176",
 "substance": "DOI",
 "bodyweight": "162 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DOI",
   " ",
   "  ",
   "smoked",
   "DOI"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 60176",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2007",
   "Views: 15286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHello. Let me tell you about one drug that took a city by storm. A while ago this substance popped up. No one knew what it was, it was never offered as LSD, but simply Dr.Eye. Now, it went from being completely unheard of to one of the most popular party substances, and myself, the casual observer, should note some effects on dosage, as Ive witnessed massive overdoses that turned out fine and normal doses that went whack.\r\nAll of these are with 99.9% Lab Grade DOI\r\nFirstly\r\nWeight 132lbs, Male, Martial Artist\r\n8.4mg. Time to effect was 4 hours administered in solution. Reported excellent time yada yada. Light, upbeat body load, high visual and traces of audio hallucinations were found. Trip length 30 hours. Clear Headed trip.\r\nNegative effect on body: Stomach pain, gas.\r\nSecondly\r\nWeight 150lbs, Male, Professional.\r\nConsumed 14 DOI sugar cubes (weight 12mg). Reported a very speedy feeling, looked jittery. Time to effect 3 hours. Visual distortion, audio distortion and visual hallucinations. Trip length almost 40 hours. Clear Headed trip.\r\nNegative effect: Stomach discomfort, Vomiting, Gas.\r\nThirdly\r\nWeight 114lbs, Male, Deadbeat\r\nConsumed 3.4mg in liquid. Time to effect 4 hours. Intense visual, audio and mental distortions. Pleasant body load. Became confused, but never irritable. Trip length >48 hours.\r\nNegative effect: Cannot remember parts of time. Was very pale the following days.\r\nFourthly\r\nWeight 123lbs, Female, Stripper.\r\nConsumed 2.4mg in liquid. Time to effect 6 hours. Very pleasant, went into deep introspective thought and commented minor visual disturbance and no audio. She was able to correct and come to terms with several parts of her life. Trip Length 30 Hours.\r\nNegative effect: Reported none.\r\nFifthly\r\nWeight 162lbs, Male, Martial Artist\r\nConsumed ~8mg insufflated. Time to effect 2 hours (slightly faster) Very weird sensation in nostrils, not a burning or anything, but plastic sensation. Intense visual [Geometric figures], no audio, increased heart rate. No vomiting, no stomach problems. \r\nConsumed 5mg Smoked [Vaporizer, DOI HCl]. This was just a test to see if it would work and I do not believe anyone has reported on this method before. It was added to the vaporizer, it produced a grey, chemical cleaner tasting smoke. Possibly did damage to throat as during the exhale it began to hurt a severe amount. No speedy effect but rather a slight stoned feeling with the visual disturbances of maybe .5mg of it during the peak. I do not believe this substance is meant to be smoked.\r\nSixthly (The strange one)\r\nWeight 134lbs, Male, Telemarketer\r\nConsumed 6mg that was stored identical to all material mentioned previously.\r\nNo Effect. No pupil dilation, no nothing. It was tested and confirmed that it had not degraded or been damaged and he had ingested.\r\nA possible explanation would be that this gentleman is a frequent 2c-i smoker and no longer receives effects from even up to 30mg of that substance as well.\n\n\n"
}