{
 "title": "Still Shocks Three Years Later",
 "author": "W",
 "citation": "   W. \"Still Shocks Three Years Later: experience with Venlafaxine (ID 60232)\". Erowid.org. Mar 6, 2007. erowid.org/exp/60232",
 "substance": "Venlafaxine",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Pharms - Venlafaxine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 60232",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2007",
   "Views: 8640",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn 2004 I was diagnosed with Bi-Polar disorder and prescribed Effexor. This is a plea to anyone who is in any way ever going to take this drug to please be careful. <br>The withdraw effects that I had:<br>Shocks- I mean the most annoying, painful, debilitating experience ever. It would start at my head and shoot through my entire body and out of my fingers and toes. I told the Dr. about this multiple times and they (multiple different dr's) said that I was making this symptom up. This was by far the most lingering of the symptoms that I still feel  today after 3 years without it. THEY DO GET BETTER JUST GIVE IT TIME.<br>Disoriented- This lasted for about 1 week after coming off. Cant move, cant walk, cant talk, cant focus my eyes, cant wake up, cant go to sleep, FUCKING SICK SHIT. <br>Dull/Not 'myself'- Yeah I wasnt depressed, but I wasnt anything else either. Zombie is the word that comes to mind first. <br>I feel that this drug is the reason for the loss of contact with my family, near loss of my wife, and a week in a mental institution.<br>Weaning myself does not make it any better. I tried to quit at least 5 times. 3 of which I tried weaning and going to different drugs (Zoloft, Welbutrin, Devacote, Risperdal, Prozac, Seroquel all of which had their own little quirks but nothing like Effexor). None worked. The way that I finally quit was to just let my boss know that I wasnt coming in for a week and laid in bed screaming at the top of my lungs until I could move again. <br>Cannabis helped me. It seemed to be the only thing that made it more subtle and bearable until my body could actually rid itself of this poison. <br>It is now 2007 and I am completely free of all pharm. drugs. I smoke cannabis on a daily basis to help with the bipolar ups and downs. It keeps me at baseline far better than all of the other drugs that Dr.'s gave me. I still feel the shocks about twice a month. I have just gotten used to them now. <br>Be careful everyone. I would never want anyone to go through anything like this because a Dr. thinks that it is what they need. Everyone is different, and I do believe that some of these drugs help some people.  Judge for yourself, do your research,  and stay as natural as possible. God gave us ways to heal ourselves naturally, and I know that I didnt pick Effexor from the ground.\n\n\n"
}
