{
 "title": "Rolling for 2",
 "author": "mike",
 "citation": "   mike. \"Rolling for 2: experience with Ecstasy, LSD & Pregnancy (ID 6025)\". Erowid.org. Apr 3, 2001. erowid.org/exp/6025",
 "substance": "Ecstasy, LSD & Pregnancy",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 6025",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 3, 2001",
   "Views: 17956",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nRecently, upon stumbling into the 'Ask Erowid' section, I found a question that had greatly concerned me last June up until recently.  Does LSD and/or MDMA affect an unborn fetus?</p><p>I suppose this could be listed under experiences or generally anywhere the question is concerned.</p><p>In my conclusion, LSD and MDMA has not harmed my son in any way.  Here is the story/description of what we discovered.</p><p>We live in a mid sized city with just about nothing to do other than get drunk or experiment with friends....clubs are boring here and raves are horrible.  My no fiance and I had rolled together for our first time the first weekend of February 2000 at a house party.  We decided we wanted to the next weekend, but just the 2 of us together.  That night turned into the first night we slept together and the start of that type of relationship.  About a month later, we decided to do it again....just for the hell of it.  Time goes on.....a week or so later, more X.  It comes to the end of the month and I am informed that she has not had her period for the end of March.  We were concerned thinking she might be pregnant and halted all drug activity.  We waited 2 weeks and bought 2 different pregnancy tests....both came out negative.  We were relieved.  We go about our old ways again rolling now every weekend in April.  the way we consumed it though, 5 apiece throughout the course of the night.  2 to start, 1 hour or so later....snorted 1...and based 1 in a bong or joint etc....Come mid april, we come across some acid.  We have a night of just tripping....along with the following night.  The next weekend, we decided to candyflip.</p><p>Over the next week, I decided I was going to get set up as a dealer since we could get good cid in large quantities. I started with 10 100 hit viles per week.  I always kept 1 for my personal use and sold out the remaining 9 in vile or on candy.  Every weekend for the next 6 weeks, we were doing anywhere for 10-75 hits each.  I would make 50 sweet tarts and take a fresh vile with me when we would trip.  We would start out just squeezing sweet breath into our mouths and leave hardly anything in the bottom of the tube.....as normal nights would progress, we would eat sweet-tart after sweet tart until there were only 5-10 left in the baggy....on many nights.....we would eat our usual 5 hits of x each.....and on almost every night of the activities, a quarter ounce would be reduced to a nickel.</p><p>What turned us after a while:</p><p>We went on a vacation to Orlando....fun for about 5 days.  On the last night there, we decided to go to Epcot while we rolled and tripped.  We at about 10 sweet tarts each and started with the usual 2 rolls each....after firework and laser shows died down, we headed back to the room to smoke and finish the rolls. We crushed up 2 of them, snorted half of one each.  We decided to go ahead and eat the other half.  Old girl was afraid though...she started to say she had not been feeling well, but decided to push on anyway.  She 'BC-powdered' the remaining half.  Immediately upon swallowing it, she vomited profusely. we had never, ever vomited on a roll or cid before.  this was our first sign of concern.</p><p>On our drive back home, we didn't talk much about what happened the night before.  By the time we got back to our town...we were ready to rest.  We talked later in the evening and revealed that we were scared that she might actually be pregnant now....both of us in disbelief, but there wasn't much to it....we had the same rolls the week before....they were awesome.</p><p>We tested the following saturday night. The results were positive on 2 tests.</p><p>What more can we say....you think for the worst.</p><p>We went to see a doctor specializing in high risk pregnancies.  The first ultrasound was done.  We had a boy....he was 13 weeks and 4 days old....active....healthy....and right on track.</p><p>We decided against abortion despite all the risks.  the months that ensued were wonderful.  the due date, December 8, 2000.</p><p>The night of November 26, 2000...labor begins....2 weeks early.  We had not done any recreational drug together since the first ill fated night.</p><p>Labor ensued for what seemed like weeks.  Finally, at 2:30pm on November 27, 2000....we had our son, as healthy as could be.</p><p>Now, he is 4 months old and 1 week....today on april 3, 2001.  He is developing at an above normal rate.  He has no health problems of any kind and he is the happiest baby we have ever seen....he can be crying for hunger, but as soon as he sees your face or hears your voice, he stops and smiles.</p><p>I am NOT saying it is ok to do these activities during any stage of pregnancy.  I am merely putting out a story telling all that our son was 100% healthy.  PLEASE, don't abort any baby just because you may have rolled a couple times during the first trimester or tripped a time or two in the first few weeks.  We probably had 70 hits of X and over 300 hits of cid in a few month period and we have a perfectly normal, if not above normal, healthy beautiful son.  Also, neither of us are mentally insane from that much acid.  Neither of us have experienced a flashback either.</p><p>We have rolled 3 or 4 times now that the pregnancy is over and I have tripped once.  We are much more conservative now and can appreciate life to the fullest.</p><p>-mike</p>"
}
