{
 "title": "Only Remember A Little Bit",
 "author": "Blurred",
 "citation": "   Blurred. \"Only Remember A Little Bit: experience with Mushrooms & Cannabis (ID 6026)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6026",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6026",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 8, 2002",
   "Views: 6800",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've always wanted to try shrooms, so when the opportunity came up, I had to jump on it. I live in an area where it's pretty hard to get shrooms- they only come around every few months. So I bought a bunch and got together with my girlfriend and two friends. We were at my house, so the location was comfortable. I read that this was very important. I also read that a good positive attitude was important. So we all did our best to stay happy the few days before d-day.</p><p>D-day came. We measured out around 1.5g for each of us. I wish I had used a better scale, because I think that I might have gotten more (like 2-2.5.)</p><p>After smoking a few bowls to chill out and get the munchies, we were ready to shroom!</p><p>We put them on a peanut butter sandwich with honey and chowed down. The honey was a big help. I was told that they taste and smell like shit, but this was from a person who hated NORMAL fungi. They were so dry that they didn't really smell like anything, let alone taste bad. All I knew was that the pot wanted me to eat the yummy honey and peanut butter sandwich. </p><p>I've read a lot of bad things about these types of drugs, and plenty of stories (on this site even) about people going nuts from one trip. So needless to say I was DAMN nervous, despite my positive mood.</p><p>It only took 20 minutes for me to start feeling it. The drapes started to flow. I pointed this out to my companions, and they just laughed. I started describing everything that was happening, and they told me to be quiet.</p><p>(Note: most of this is but a very vague memory. I have trouble remembering dreams, and most of this felt like a dream.)</p><p>For whatever reason, tears started to come out. Just as I was starting to peak, my friends felt their onset.</p><p>I got pretty upset and my girlfriend led me to my room. I lay on the bed and started salivating on myself. I couldn't even talk -- all that would come out is moans. I remember simply wanting it all to go away.</p><p>It was like each and every part of my brain was thinking in overdrive. Every aspect of life was being processed at once. I thought of myself as millions of atoms. I looked up at my clock and couldn't understand the concept of counting. Nothing made sense.. it was horrible. I called my girlfriend in and she lay down with me. She turned the lights out.</p><p>Big fucking mistake. My brain was going 1000mph and demanded things to process. So what happened when we took away all the cool shit to look at?</p><p>All kinds of crazy thoughts. GF summed it up when after 20 minutes she sat up and said 'I think I just went to another dimension.'</p><p>After that everything was fine. We joined my friend and concluded that 'you make your own reality. we should be celebrating!'</p><p>Life couldn't have been better- we all were in some sort of europhoric happy-ville. Things looked neat. I remember looking at some art book and loving it, but that's about it. The rest of what I remember is very small fragments -- My dog looking like a painting, the TV being in 3d, the walls flowing and breathing. Lots of cool visuals!</p><p>But that's about it. I don't even remember having sex. :(</p><p>I think the first half of my trip was bad because I was the first one in. Nobody there had ever done it before, so they really didn't know what to say to me when I was freaking out. The peak was REALLY overwhelming..information overload. I had definitely lost all control to the trip and sat in the back of the bus. 6 hours went by after my peak and I only remember maybe a collective minute of it.</p><p>We DID smoke some more, though. I do remember that. I forget a lot when I'm stoned, so I'm betting that's what did it. (That's something to consider when thinking about having a first trip. I definitely recommend NOT doing any other drugs.)</p>"
}
