{
 "title": "Welcome to the Freaky Forest",
 "author": "Shoe",
 "citation": "Citation:   Shoe. \"Welcome to the Freaky Forest: experience with DMT (ID 60278)\". Erowid.org. Mar 10, 2008. erowid.org/exp/60278",
 "substance": "DMT",
 "bodyweight": "9 kg",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 60278",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 10, 2008",
   "Views: 3793",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI write this to inform you that the socalled 'elves' described by numerous DMT trippers can also play tricks on you.\r\nI'd used DMT, which I extracted myself, several times before, with varying degrees of success but all generally positive. This was my first negative experience.\r\nMy girlfriend had just left and was due to return in an hour or so, I told her that i'd be doing some DMT while she was gone. \r\nSo I sat on my bed, arranged some cushions and packed the pipe up. I decided that this time i'd smoke up without any music - to see if I could hear any alien music, (Im a musician, and thought that this might be valuable).\r\nAs I smoked, the experience felt different. I knew it wasn't going to be too good as I smoked it up. Instead of a colorful, kalidoscopic interplay of happy elves, what I got can only be described as a self-folding freaky forest of infinity... \r\nI could see alien trees and canopy, gnarled and ominous (though i'd hesitate to say evil) and certainly freaky, but not terror inducing. Scary. unsettling. \r\nThe forest folded itself over and over, in several dimensions I can't possibly describe. all the while I could hear the elves communicating to me 'were the happy little elves... happy... happy... HAPPY little elves!!!' \r\nI got the impression that they loved me, as usual, but were communicating to me that DMT wasn't a toy to be played with as I pleased. It was a useful tool, and should only be done with plenty of time to spare and a prepared setting. \r\nLater that night, we went out and had some red wine with friends, which was enjoyable. I told them about my negative elf experience, which ulthough frightening, had left me with a more accurate outlook on the DMT experience. It is a learning mechanism, not a toy... \r\nMuch later that night, after the red wine, I woke up in my bed to see a wall lamp (with a sumbraero that i'd put on it) transfigured, It looked as a hideous corpse head with putrid white skin stretched over its boney face. I vomited a little in my mouth. And then, Snap. no vomit. I tried to roll left or right in an effort to make the hideous face go away... It stared at me unblinking. horrible. And then, after what felt like an age, the face was gone. I looked around for the vomit, there was none. \r\nVery odd. I rolled over and went to sleep.\r\nLater again that night, I heard the front door open. My flatmate must have returned. Then, at my bedroom door there was a knock. It was my flatmate, he poked his head in, and came into the room. 'its too late, its really late' I slurred, sleepy and still slightly drunk. 'I just need this for work' he said, proceeding to take something from my desk. \r\nIn the morning, I woke up, and wondered what he had taken. I went to the toilet and found his room empty. He must have left, I thought. Later that night, he returned. I questioned him on the late night disturbance, to which he replied that he hadn't returned home yet. 'very weird' I said to him... \r\nThere was also nothing valuable in the area of my desk that he apparently took something from.\n\n\n"
}