{
 "title": "The Utilitarian Quid",
 "author": "Gonzo",
 "citation": "   Gonzo. \"The Utilitarian Quid: experience with Coca Leaves (ID 60303)\". Erowid.org. Jan 30, 2007. erowid.org/exp/60303",
 "substance": "Coca Leaves",
 "bodyweight": "193 lb",
 "header": [
  [
   "DOSE:",
   "15 leaves",
   "sublingual",
   "Coca",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60303",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 30, 2007",
   "Views: 20414",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was able to obtain a chuspa, 140g of dried leaves and a small ball of llipta from Peru for a relatively low price.  <br>On the night of my initial test, I had been suffering flu-like symptoms including respiratory difficulty and an upset stomach. I had read how the coca leaf can be beneficial with both symptoms.  <br>I made a quid of around 15-20 medium sized leaves and smeared about 1/4' round ball of llipta inside it and placed it in my cheek.  It took a minute for the leaves to rehydrate from my saliva before I slowly started chewing.  I would chew a few times then let it sit in my cheek for a minute or two until my mouth was full of an astringent and numbing saliva.  I continued this process for about an hour, swallowing a little of the juices but harboring most in my mouth and cheeks.  I've read reports that say both to swallow and not to - but I believe that swallowing some of the juices helped strengthen the effect.<br>After the hour the leaves were mostly pulverized and I finally spit them out.  The effect that had been generated was a rather noticeable energy w/ an underlying twinge of paranoia.  For the greater part I was at ease and alert.   I did notice that it was considerably easier to breath and that my stomach was feeling better.  The effect gradually faded over the course of an hour after chewing them.<br>The experience was not that of drugs, but of a medicinal herbal nature.  Coca leaves make an excellent and nutritious alternative to coffee whether chewed or drank in tea.  They can aid in minor illnesses such as upset stomach and work as a bronchial dilator.  I have added coca leaves to my outdoor supplies as I spend a lot of time in the mountains over 9,000ft.  They will come in handy for hiking - allowing me to breathe better in high altitude/stressful situations and to ease or prevent altitude sickness.\n\n\n"
}
