{
 "title": "Chicken Puke for the Soul",
 "author": "Catfish Rivers",
 "citation": "Citation:   Catfish Rivers. \"Chicken Puke for the Soul: experience with H.B. Woodrose Seeds (ID 6033)\". Erowid.org. Feb 6, 2002. erowid.org/exp/6033",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "11 seeds",
   "oral",
   "H.B. Woodrose",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6033",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 6, 2002",
   "Views: 14617",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI have had several encounters with HBWR, usually amounting to a pleasant, albeit subtle, LSD-like activation. The dosage for these experiences varies, but most often was between 15-30 seeds. I figure that those batches were pretty weak. This particular batch of seeds, however was claimed to be 'super-potent.' They were still covered with the brown fuzz, which I did my best to scrape off while trying to keep my eyes from crossing. What a pain in the rear it was, but I tried to make a meditation out of it. Next I washed them off with hot water and started to chew them very thoroughly. Eleven seeds were finished within ten minutes and washed down with a glass of water. \r\nI had eaten chicken earlier. That was a mistake, I decided as I was sweating back waves of nausea. I was certainly intoxicated. I was feeling pretty sedated lying on the cool bathroom floor, wanting to nap. But then I had to bust a gut, the pressure suddenly rising in my stomach. My mind grew chaotic, bizarre thoughts forming and unforming in a haze of nausea, where am I? Blargh. Blargh. Whew. A little more blarghing. Brown froth punctuated by bits o' chicken filled the toilet. I can see the little masticated seed husks floating in the toilet. But man do I feel on the other side of the coin! I am energized at this point. I feel as if everything has a positive blue tinge overlaying it (even the brown puke is covered by the glow). MJ smoked at this point completely wipes away lingering nausea, and boosted me to a +++. Tracers a' plenty, breathing walls, swirling eddies of psychedelic geometry. \r\nI hid in the basement and played guitar, watching the sun set through a tiny, shoe box sized window. It reminded me of a diorama. A tiny world view. I leave the spider webs in there, even though spiders freak me out. I am feeling too much empathy to squash anything right now. I have never really experienced anything I would call synesthaesia, but I swore that the sunlight falling across my face was dictating the melody I was noodling with on the guitar. I felt like a rock god, Queztoguitahro. I rode this wave length for about 7 hours, playing guitar and drums, until I was back to baseline. Drank some GBL, 4 ml mixed in juice for sleep. No hangover next day. I feel somewhat lighter, with less of a burden on my mind. Puking usually flushes out my spirit...blargh.\n\n\n"
}