{
 "title": "Extreme Pain with Octave Shift",
 "author": "Sunny",
 "citation": "   Sunny. \"Extreme Pain with Octave Shift: experience with Heimia Salicifolia (Sinicuichi) (ID 60354)\". Erowid.org. Feb 23, 2010. erowid.org/exp/60354",
 "substance": "Heimia Salicifolia (Sinicuichi)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "Heimia salicifolia",
   "(plant material)",
   " ",
   "2.5 cups",
   "oral",
   "Heimia salicifolia",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 60354",
   "Male",
   " ",
   "Not Given",
   "Feb 23, 2010",
   "Views: 6544",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been 'involved' with psychedelic plants and compounds since my early teens but never til now have bothered to experiment with Heimia Salicifolia aka 'Sun Opener'. I ordered 10 grams from a reputable source which arrived within a week.</p><p>The first thing I did was rolled a gram joint to experience its effects prior to injesting the rest as a tea. Smoking the leaves gave me a mild buzz similiar to marijuana but more drowsy feeling. Music was slightly enhanced and a noticable feeling of euphoria was also experieced. As I got up for the bathroom, I noticed my balance was slightly off similiar to the result of a few beers. A darkening of surroundings is noticed while on the toilet. Effects wear off around the 3 hour mark as I began to pass out from the drowsy effect. I awoke the next morning with the worst headache I've ever had (Aspirin did nothing for it). At this point I should have taken this as a sign that perhaps I should think twice about injesting this stuff. But instead, I brushed it off as a symptom of smoking and that it could have been a combination of the change in weather pressure as well. </p><p>A week later I decide to brew the tea. I boiled it in about 5 cups of water for 10 minutes on High. Then I let it steep for about 20 minutes, letting it cool down. I poured about 2.5 cups into a large pint glass and proceeded to add some cream and stevia to sweeten the taste. It took quite a bit of stevia actually, this stuff is extremely bitter but not quite as bad as Calea Zacatchichi. Next thing I sat comfortable browsing the internet drinking the tea as I would any other tea and after I had drank about half the glass, I began to notice a tensing up of all my muscles and jaw in particular. Then I noticed I was complete crouched over and about as unrelaxed as I've ever been. I wondered why and immediately stopped drinking the tea. I began to feel this tightening in my entire body, head included. At that point I knew I was having an adverse reaction. The tenseness developed more and more into a very painful sensation as if I had been beaten all over my body and was healing from bruises. I could barely walk 5 feet. When I moved I felt extreme pain and wished I had some pain killers kickin around but all I had was some lousey aspirin which I took but it seemed to do little for me. The remainder of the night was me trying to sleep it off and hopefully feel better in the morning. </p><p>In the morning I woke up still in alot of bodily pain (even my balls hurt when I went to take a pee!) Then the worst part happened-I remembered people speak about this stuff as an auditory hallicinogen and decided to check if this out for myself. As a music lover, I would have loved to have listened to music during the evening if I wasn't in so much pain. But I couldn't think of anything else but how to stop the tightening adverse reaction. Anyways, I put on some music that I was very familiar with and to my utter surprise, the entire thing was pitched down exactly 1 octave. This troubled me as it had already been the next day and it didn't particularly sound great that way. It seemed to take with it the essence and I couldn't even bop my head to this. It was simply bad sounding. I wanted my audio to shift back to normal. It's still the next day so I won't know for a day or two if my hearing is permanently mangled from this stuff. </p><p>I threw the remainder of the tea down the toilet and will never touch this stuff again! I hope this message saves a few people from trying this and having a similiar reaction.</p><p>Wednesday January 31 2007</p>"
}
