{
 "title": "Cardboard Mind Heart and Loins",
 "author": "Cashcowscapegoat",
 "citation": "Citation:   Cashcowscapegoat. \"Cardboard Mind Heart and Loins: experience with Risperidone (Risperdal) (ID 60366)\". Erowid.org. Jul 12, 2010. erowid.org/exp/60366",
 "substance": "Risperidone (Risperdal)",
 "bodyweight": "83 kg",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "IM",
   "Pharms - Risperidone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60366",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2010",
   "Views: 7213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nImagine you had to eat cardboard. It would become for you a little bland, methinks. This is how life is becoming stuck on a risperdal treadmill.\r\nI got trapped amongst the mental health regime due to my parents demanding that I see a psych, after condemning my trying recreational drugs.  I love most dopamine, serotonin, and phenylethylamine substances.  I had stated plainly that I liked methamphetamine a bit, mushrooms alot, and when I had research chemicals sent to me (2cp and 5meo-dmt) my family all came down on me like a tonne of angry dirt.\r\nSo, I have a meeting with a shrink arranged for me, and I think the mention that I used speed, pot, and what not made him think I was a candidate. He orders that I be reviewed in a mental hospital. When in hospital a few chicks came on to me, I got labelled as inappropriate by the docs, I had a few interviews the outcome of which was that I was 'grandiose and amused' which somehow in some wierd strange incomprehensible to me and judgemental way proved that I had psychosis- hence the 50mg shots in the bum and 6 month community treatment order. \r\nNow it is interesting to note they gave me a 3 months sickness claim, meaning I could have an allowance as they had deemed me unfit for work. The medication kept on coming after I was discharged, but after the 3 months I was back to independence. My beliefs had not changed a bit, I had less I wanted to share with others, I was suffering somnolence (sleeping for 12-15 hours a day), my empathy had trailed off to something vague and brittle and my desire to do anything about it was diminished moreso. I rationalised that patience is all I could rely on and the treatment order would be over soon enough. \r\nFor some reason the treatment order has been renewed, and renewed, and renewed, and is imminently set to be renewed once again. I know that I have anger about this, but the risperdal ensures that my emotions are shut tight in the cardboard box so to speak, and feeds me more shredded cardboard, which leaves me morose and sullen, and a bit sick.\r\nThe cost of a shot is in excess of $700. It is given fortnightly. 2 people are travelling 30 mins each way in a company car to administer it to me. Add the cost of wages and petrol. I have never paid for this. I really wonder how society is structured in that war, for instance, is so destructive yet makes big money, and in a similar fashion risperidone, which is so unpleasant and destructive to the appreciation of life, can be making money by its sheer distribution and implementation.\r\nLet me just say I think the force is a sham and the outcomes insidious. Reduction in transmitter activity is akin to brain damage. The longer I'm stuck on this hampster wheel for no other reason than that I retain the right to take recreational drugs, the more I think Im a victim of the argument of institution versus freedom. I do have a strong spiritual belief that all the bad stuff is temporary, and if I persevere in doing the right thing God will do an accounting and I will inherit what I really deserve.\n\n\n"
}