{
 "title": "An Odd Occurrence",
 "author": "Xorkoth",
 "citation": "Citation:   Xorkoth. \"An Odd Occurrence: experience with Cannabis & Kratom (ID 60371)\". Erowid.org. Mar 2, 2007. erowid.org/exp/60371",
 "substance": "Cannabis & Kratom",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "9.0 g",
   "oral",
   "Kratom",
   "(plant material)",
   "  T+ 2:00",
   "1 repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "1 repeated",
   "inhaled",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60371",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 2, 2007",
   "Views: 28695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis will be a pretty brief report, but it was abnormal and interesting so I will relay my experience nonetheless.\r\nFor the sake of completion, I should mention that two days ago, I ingested a combination of 2C-T-21 and 2C-C. I don't feel this had anything to do with my experience, but I thought I'd mention it.\r\nAt 7:00pm, I ingested 9 grams of kratom after not having had it for longer than usual. I took it not out of a mental craving but because minor withdrawal was starting to creep in and I'm currently weaning myself off, primarily to save money so I'm not poor for the rest of my life. Anyway, the kratom hit me much harder and with greater euphoria than it has in a long time, another perk to cutting way back. I settled down with my girlfriend to watch some TV. As it happens, I was watching a Roseanne marathon (again).\r\nAt about 9:00, or T+2:00, I decided to smoke some cannabis. I had smoked it once earlier that day, around 6:30, but it had mostly worn off. The kratom was still in effect but no longer at peak. I took three vaporizer pulls as well as shared a bowl with my girlfriend, in rapid succession. Both devices had a mixture of very high quality White Widow and L.S.D. (a very good newish strain by BOG seeds) in them, and the bowl additionally had a thin layer of pure kief on top. I hit the vaporizer first, and after finishing the bowl next, I laid back and continued to watch TV.\r\nI noticed that I was becoming extremely high, moreso than usual. I find that kratom adds a very good element to marijuana. The combination of the two can be pretty psychedelic. Kratom primarily enhances the physical buzz of cannabis by making me more able to feel my field of energy. Cannabis on its own causes this effect moreso than almost anything else I've used, which is in my opinion why it is so synergistic with psychedelics and almost any other drug. It is a very physically psychedelic substance, even after I become used to it and the mental elements become routine. With kratom added, it feels as if waves of electrical energy are running up and down my body and leaping outward, forming loops which reconnect with my body elsewhere. The patterns of energy roughly form the visual of a group of closed rings of energy that sprout from my body randomly and reconnect somewhere else, surrounding me in a sort of cocoon.\r\nAnyway, I felt so good and psychedelic that I closed my eyes for a bit, as doing so, I've found, can dramatically increase the physical and mental aspects of any high by dissociating me from my surroundings and focusing me entirely upon the aspects of my high. This time was more dramatic than it has ever been without being in a partial sleep state.\r\nI quickly dissociated from where I really was. The body high grew and grew exponentially until it felt nearly salvia-like, with points of great gravity or pressure running around my body, especially my legs - down, down, down, light speed, even faster. I gradually lost awareness of the sounds of the TV and began to realize I was somewhere else. At this point I was unaware I had taken any drugs, but wide awake. I was still aware I was laying down. I began to feel a great pressure on my chest, and I began struggling to breathe. It felt like my throat was extremely narrow and I had to force air to pass through it into my lungs. I was slightly alarmed but I was able to continue breathing so I rode it out. And besides, this was my reality at the moment and I felt I had no choice.\r\nI knew I was me, but I didn't know who 'me' was other than this nexus of perceptions I was experiencing. I became aware of some sort of entity that was communicating with me. I can't remember what was being communicated anymore, although I was very aware at the time and right after I regained awareness of my surroundings. It felt very important though. We were in disagreement but the entity was clearly a figure of authority of some sort. My feeling was one of wariness and sheepish acceptance of what the entity was saying. I was not able to actually physically see anything during this experience, as I had my eyes closed, but nevertheless I was able to perceive information about where I was. I was in some sort of room, laying down on my back (in reality I was on my side). I was unable to move but was fully conscious and awake. I felt no fear but the experience was not really enjoyable either. It felt very serious and slightly alarming due to the difficulty in breathing effectively.\r\nAfter some communication and some other significant events that I cannot recall anymore, I felt as if I was receiving energy from somewhere. My body felt charged and was buzzing extremely strongly, to the point of producing a soundless but still very loud 'noise'. I was buzzing so hard it tickled, and at that point I became aware once again that I was laying down with my eyes closed, and that I was this guy named Xorkoth and so forth. I opened my eyes and immediately I was totally out of the state I had been in. I looked at the clock and realized I'd only been away for about a minute. Subjectively it felt longer, but only maybe about 10 minutes long, not an eternity or anything. I immediately told my girlfriend about it in more detail than I was able to here, since I had more of it in my memory then.\r\nThe experience was very odd and similar to another experience I had with kratom and weed a while back, where I was repeatedly thrown into lucid dreams that were indistinguishable from reality in every way, where I was embedded 3 to 4 layers deep in those dreams. I then woke up and had sleep paralysis for several minutes where I couldn't move at all and found it very hard to breathe. This experience was similar, but it was a total removal of consensual reality into a very psychedelic state, whereas the previous experience was just like reality, only it wasn't. The difficulty breathing was identical, but it seemed to be a perceived difficulty in breathing rather than an actual one, because in both cases, the instant I snapped out, I was able to breathe normally. \r\nThe speed and total removal of the state really took me by surprise. It reaffirms to me the psychedelic power of marijuana, when used properly. If one wills themselves into altered states with it, it's possible to have some pretty profound experiences with it, even when you use it every day like I do.\r\nWhen I get home later today I'll ask my girlfriend what I said to her about it right afterwards, and perhaps she'll be able to refresh me somewhat. If that's the case, I'll add to this.\r\nJust wanted to share because I found it interesting. Has anyone else had any experiences like this?\n\n\n"
}