{
 "title": "Withdrawal Ruined My Life",
 "author": "Tyler",
 "citation": "   Tyler. \"Withdrawal Ruined My Life: experience with Venlafaxine (Effexor) (ID 60392)\". Erowid.org. Jun 27, 2007. erowid.org/exp/60392",
 "substance": "Venlafaxine (Effexor)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Venlafaxine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 60392",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 27, 2007",
   "Views: 10090",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Approximately 10 months ago, I was prescribed Effexor XR for a sudden anxiety problem that developed seemingly overnight. I was 21 at the time.  </p><p>As the months went on, my doctors continued to increase my dose from  37.5 mg to 225 mg/day.</p><p>My main reason for adding this report is to describe how coming off Effexor has affected my life.</p><p>After about 5 months I started to experience severe jaw pain on the left side, which over the next few weeks moved to the right side as well.  I also had night terrors nearly every night for weeks, to the point where I was afraid to sleep.</p><p>At this point, and after reading several similar reports online describing similar symptoms relating to Effexor, I decided to slowly wean myself off of it.  My stomach had been upset the entire time I was on Effexor (very very badly), but even more so when I was coming off it. My doctor had warned me that if I wasn't careful coming off of it, I could end up on IV's in the hospital, unable to eat etc. She was taking Effexor as well, so I trusted her.</p><p>Eventually it took me a total of probably a month and a half to get to get down to 37.5 and from there I opened up the capsules and lessened the amount each day until I was completely off it. (this was suggested by my doctor as well)</p><p>Now the fun part.</p><p>Ever since I came off Effexor I've experienced 'brain shivers' 'zaps' whatever you want to call them, constantly (about 15 times a minute, literally).  The feeling is similar to an electric shock that originates in the brain and quickly spreads to the outer limbs, many times it comes in threes and fours.   It also seems to make a zapping noise, or the feeling of hitting my funny bone, but in my brain.  I also lost about 15 pounds.</p><p>This has continued, unrelentingly, for more than a month now.</p><p>I used consider myself a relatively well adjusted person.  I had great grades, and I attend a very reputable university.  But I have never felt so disconnected from life.  Nothing that used to amuse me does anymore and I have absolutely no desire to finish school. </p><p>I cry at the drop of a hat, mostly when I'm by myself.  And it takes only the slightest inconvenience to completely set me off in anger.</p><p>I know exactly why it's happening, but it feels like there is nothing I can do to overcome the feelings that Effexor has left me with.  </p><p>I'd also like to note an experience that happened to me when I was taking Effexor.</p><p>I had some visitors for the weekend, and we decided to go out to the bars and have night on the town.  Around 10 pm, despite having company, I felt so sick that I had to leave the bar and go back to my apartment.  I had about half of my first drink before I left.</p><p>From about 11pm until about 7am I vomited uncontrollably, and I couldn't understand why, because I hadn't been drinking.</p><p>At about 7:30, I clued into the fact that with all of the hustle and bustle of company arriving in the morning, I'd forgotten to take my Effexor.</p><p>I took a gravol to try to alleviate the nausea but quickly threw it up.   </p><p>Eventually I was able to get my Effexor pills down, and lie in bed until everything subsided. This chemical is grossly misunderstood and understudied.</p>"
}
