{
 "title": "Where Has My Body Gone?",
 "author": "Cleo the Cat",
 "citation": "   Cleo the Cat. \"Where Has My Body Gone?: experience with DXM & Cannabis (ID 6042)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6042",
 "substance": "DXM & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "360 mg",
   "oral",
   "DXM",
   "(liquid)",
   "  T+ 0:30",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6042",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Feb 8, 2002",
   "Views: 28041",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOur story begins around midnight, on a cool spring evening in Florida. There I sit at my computer, reading trip stories and the DXM FAQ as I drink from a 4oz bottle of Robitussin Maximum Strength Cough. The blacklight in the corner is reflecting on the screen as Enigma, 'The Screen Behind The Mirror' plays softly in the background. This is to be my first trip on DXM. Prior to this night, my only exposure to the DXM experience was a story by Jim Hogshire entitled, 'The Electric Cough Syrup Acid Test,' a throughly entertaining and hilarious account of a first-time on DXM. (Before I go further, I would like to note that I was in the beginning stages of a head cold on this night). That story, as well as the experiences of others, were enough to spark curiousity about DXM and I decided I wanted to try it for myself.</p><p>Twenty or thirty minutes pass, I am finished with the entire bottle, and my roommate announces she is going to return her movies to the video store. She was originally going to take this DXM journey with me, but stomach cramps changed her mind. While she was gone, I experienced a little nausea, but not enough to worry me; I knew that I would not get sick. I somehow knew that before I took the first swallow. Nonetheless, I decided to smoke a little weed to calm my stomach discomfort, and since I wasn't really feeling anything other than a little numbness in my mouth, I figured it might jump start the effects of the DXM. </p><p>After I finished smoking the bowl, I felt an urgency to brush my teeth so I ran to the bathroom, grabbed my toothbrush and started scrubbing away and by the time I was done, I was leaning my head in the sink splashing cold water on my face because my skin felt warm and a little dry. At that point, my roommate returned and I bounded down the hallway, smiling and giggling, to meet her, telling her that I was really happy she came back (I had the feeling I might want her there; An excellent prediction on my part). </p><p>I don't recall at what moment I started tripping...all I know is, somehow, I had anbesol all over the parts of my mind that control my body. I was completely detached from myself, yet fully aware that I was one being. I attempted to write down what I was feeling in the journal I had thoughtfully laid out on my bed. Phrases like 'floating heat' and 'swollen numbness' found their way onto the paper, but without my consciously putting them there. I picked up the notebook, which had the texture and weight of a marshmallow, and I tried to look at what I was writing but my head did not want to face in the direction of the notebook. My arm seemed to be bent in some crazy, wavy, inhuman fashion. In fact, I discovered, any action directly involving my body was next to impossible unless I did it without thinking. I noticed a dull numbness in my mouth and tongue, but found I could speak quite normally and fluently, though perhaps a little loudly. The words sometimes came out incoherent to me and they had the tendency to bounce around in my head for a while after they had been spoken, much like an echo.</p><p>I found walking, and moving in general, to be the most fascinating activity of the evening. I must have walked from my bedroom to the living room, out to the porch and back about 73 times. But walking is not exacly the verb that describes what my body was doing. Soaring or floating might better describe it, but even that fails to capture the feeling of separation I had with my body. It was more like I would move from one place or one position to another but the actual moving part seemed not to even occur. I was just there-here, here-there, standing-sitting. Much like a Bobo doll, I felt that if someone would have tried to knock me over I would have simply sprung back to a standing position with no effort at all. </p><p>For much of the time I felt like I was stuck in a funhouse. Either I wouldn't feel the floor under my feet at all, or the floor seemed to be at a different height with each step. I thought I was staggering but my friend assured me I looked normal, aside from the fact that my eyes were closed all the time. Were they? I could still see my surroundings just fine. Well, fine enough to know that they appeared extremely messed up. She also said, if anything, I looked like I was 'testing out my new legs.' As I said before, I was glad my friend was there and that she was sober because I was talking non-stop. I felt the need to verbalize immediately all my new sensations and realizations. She seemed to be okay with this. She was really great. She sat with me, not just listening to me talk, but actually participating in conversations with me, even if I was not always coherent.</p><p>I was excited as hell to experience music but I was sort of disappointed to find that it seemed very one-dimentional and thin...no substance at all.  But I was still getting into it. I had taken off Enigma early on and replaced it with some trance music set to repeat itself.</p><p>I came to many understandings during my DXM experience. I found that there is no one 'normal' state of consciousness, but many, many different states of being. Just as there are many different layers, or planes, of reality. I was involved in more than one layer of reality at any given moment throughout the night. I also found myself with no inhibitions, wanting to say every thought that passed into my head. I can only compare this to being on ecstacy when I say things because I feel like, without even thinking about it, everything is good and 'acceptable,' only with DXM, it seems it's not a lack of inhibitions, it's a lack of identity. I changed clothes about four times. I found I was very indecisive and contradicted myself a lot. I kept feeling light and heavy, or spinning but stable. I'd want to be outside, then I'd want to be inside. But I was never uncomfortable, I just kept changing my mind. I also had no conception of opposites. I had to ask if I was talking loudly or if the music was loud because everything just seemed equal. </p><p>DXM is like no other drug experience I have ever had, and I have experimented quite a bit with different types of drugs. It was on of the best trips of my life and I am going to experiment more with it.</p>"
}
