{
 "title": "A Good Beginning",
 "author": "Jude101",
 "citation": "Citation:   Jude101. \"A Good Beginning: experience with 2C-E, Methylone & Nitrous (ID 60437)\". Erowid.org. Oct 24, 2007. erowid.org/exp/60437",
 "substance": "2C-E, Methylone & Nitrous",
 "bodyweight": "161 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 1:00",
   "100 mg",
   "insufflated",
   "Methylone",
   "(powder / crystals)",
   "  T+ 1:00",
   "1 repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 5:00",
   "13 mg",
   "oral",
   "2C-E",
   "(powder / crystals)",
   "  T+ 7:00",
   "1 repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 13:30",
   "2.5 ml",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60437",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 24, 2007",
   "Views: 3262",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is a quick note on my first 2C-E trip, last month.\r\nI had not planned to trip at all on the night in question. I had recently come into 500mg of 2C-E from a pretty reliable supplier and had been planning to wait until it felt like the right time to use it.\r\nI finished work at 8pm and took a taxi to a nearby courier depot to pick up some whippets I ordered earlier in the week. Once I got home, I ate a pizza and took around 200mg of Methylone while listening to an aphex twin album at a decent volume. In doing so I reckon I upset everybody who lives within 200 yards of my flat! Fuckem if they can't appreciate some good noise though.\r\nAfter an hour or so I was beginning to get a good buzz from the methylone, and redosed with another 100mg, insufflated. I also did some nangs over this period. By about 1am most of the pronounced effects of the Methylone had faded somewhat and redosing was not really taking it much further. I was very clearheaded though, wide awake and feeling good.\r\nAround this time I took a walk to the shop and picked up some cigarettes and Orange Juice. By the time I returned I had decided to have at the 2C-E, so I took my scale and measured out 100mg or thereabouts, 100mg being the smallest measure my scale will take. I really should have dissolved this in water, but instead I eyeballed a tenth of the powder and drank what I reckon was 10-15mg of 2C-E with some orange.\r\nThen I settled down on the sofa, intermittently inhaling nangs while I posted on one of my favourite forums and half watched 'Drawn Together'. After half an hour I had almost forgotten I had taken the stuff, but after 50 minutes or so the text on a comic book sequence on tv was expanding and contracting, and the room seemed bigger than usual. I also noticed some pictures on my wall were sort of misty.\r\nOnce I had those first alerts the trip came on really quickly. Open eye visuals were not too much at first, the room was lot brighter than usual and the computer screen became too much to deal with. I put on some random chill out music and lay back on the couch with my eyes closed.\r\nI could hear the music that was playing but was not really processing the sounds. Instead I was seeing these fantastic angular shapes and colours rotating and floating inside my eyelids to the tune and beat of the Aphex Twin I had been listening to earlier on. I had no real anxiety or thoughts to speak of, I just let my mind follow the lights and colours for what felt like an eternity, but was probably more like 30 minutes. Occasionally during this time I was vaguely conscious of my thighs and hips vibrating and thrashing somewhat.\r\nLater, I inhaled some more whippets and switching off the lamps moved to lie on my beanbags, just inside the window. There is a wooden slat blind on this window and green and translucent shimmers of light flitted in from between the slats. I don't remember a huge amount from the next while, but at one point I opened my eyes and there were two celtic patterns, like triangles with rounded corners rotating in opposite directions on top of each other on the ceiling above me. For some reason I found this really reassuring, and made some sort of connection between them and my heritage which made me feel really warm and this set off a very nice fantasy.\r\nMoving back to the sofa, I had at the nangs once again, and this time after a few cartridges I had this incredible sensation of electricity on the right side of my head, just behind the temple. It felt like I was projecting through the side of my head so I looked in that direction, towards the window where it was like some sort of cosmic breeze/flame had caused the top few feet of the blind to be blowing into the room with a shimmery purple/blue colour. Looking outside, everything was bright purple and pulsing energy. The room seemed to be closer to me on all sides, brighter and was humming/buzzing. For a while I felt like I was floating! It was fucking amazing.\r\nEven the air in the room, while still transparent, could be seen curving and bending into these fantastic shapes and angles.\r\nI was in heaven, past thought. I did try to post online, but it was impossible to put anything into words or thought coherently. \r\nI went to bed at some point, my memory of bed is not really there, I was restless, got up a few times to take a leak. At around 9am I was more or less down, but still awake so I dosed 2.5ml of GBL which gave me a fitful sleep until 12 or so.\r\nThe next day was been pretty ropey. I had a bath, did some shopping for food and cleaned the house but only after 24 hours I feel 'normal', whatever that is.\r\nI didn't really have many meaningful insightful moments that I can recall. I made a conscious decision when I felt the first alerts to just let the drug take me and not to impose myself on it and succeeded in doing that. Maybe that's my lesson, if there is any.\r\nI am definitely going to use this again. It's one good psychedelic.\n\n\n"
}