{
 "title": "Unexplainable",
 "author": "Trend",
 "citation": "   Trend. \"Unexplainable: experience with Mushrooms (ID 6045)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6045",
 "substance": "Mushrooms",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:30",
   "1.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 6045",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 8, 2002",
   "Views: 6224",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nNight before New Years eve, and me and 5 friends decide to go for a nice trip.</p><p>We all dropped at our friends house at about 10pm, in the middle of a party. We all dropped somewhere between 1g and 1.5g of dried mushrooms. I didn't notice anything happening by 10:30, so me and a friend decided to do everything that was left. I'm not exactly sure how much it was, but it was about the same as what I had taken at 10. By 11pm I was starting to feel the initial effects, mostly just an unexplainable feeling that something 'big' was about to happen. Like the feeling I get outside just before a huge storm. Everyone else left for a bar at about this time, leaving me and my 5 friends alone.</p><p>In the next hour my storm broke. I should mention that this was only my second time trying any drug other than pot, and it was at least 2x the shrooms that I did the first time I tried them.</p><p>By 12am I was well and truely tripping. It was far beyond anything I experienced my first time, nearly 9 months earlier. We (everyone on shrooms) were all sitting in a circle in my friend's living room, talking and sharing what was happening to each of us. I didn't share too much, as I was barely conscious at times. I remember listening to my friends talk about trees, colors, dogs. I kept laughing, and each time I started laughing I would stop to find myself laying on the floor with my friends lauging at me. I decided to go hide in the corner, beside a little tree that looked peaceful to me.</p><p>I can't say what time it was, as I had lost all concept of it by now, but eventually we all decided to go downstairs and listen to a CD my friend had brought with some trippy music on it. We went downstairs, but most of the guys couldn't stop talking or laughing, so they abandoned the music and went up stairs. I was the last person in the room, and I remember trying to walk towards the stairs but I kept forgetting why it was I wanted to go to them. So I just stood there with my head back and my eyes closed.</p><p>While I stood there, I began to notice the clouds and blobs I could see with my eyes closed begin to take on definate shapes. Colorful and intricate fractals started to appear and 'dance' to the music. I was amazed at the power of my mind to create these things that my computer struggled to produce. I watched with awe as the fractals moved and zoomed in to reveal new and wonderful shapes. I couldn't control what I was seeing, but that didn't bother me at all. About this time a few of the guys came downstairs and found me laying on the floor with my eyes closed (note that I don't actually remember how I got there). They tried to bring me upstairs, and I tried to tell them to just leave me. I couldn't talk. One or two words would come out and suddenly the sentence would change and another one or two words of a different thought would come out. I remember KNOWING that it was because I was only partially in this world and this reality. Eventually the guys just decided to leave me down there, with the music.</p><p>With my eyes closed and the fractals dancing to the music, I hit what I can only describe as the peak of the experience. Suddenly the music faded away almost to infinity, until I could only barely hear it. The fractals dissapeared from my view and I was floating in an empty void. Remembering back on it, I couldn't even feel my body. I couldn't remember life, being alive, or the concept of existence. I just WAS. Presently I understood that the blackness I was 'seeing' was an empty sky. I waited for what seemed an eternity as blue and red 'stars' appeared in the blackness to keep me company. The sky filled with these stars and a blue cloudy mist that looked much like the Milky Way on a dark summer night. In an instant I could feel myself again, but not where I once remembered being. I was laying on a bed of soft grass. My arms were spread out to each side of me. Above, and around me, statues appeared. They looked like the kind of statues you would see in a church, with serene faces and hands against their chests in prayer. They were all positioned around me in a circle, and seemed to be looking down at me. Suddenly the stars in the sky exploded in showers of red and blue dots, much like fireworks do. As the exploding stars faded from existence, so did the rest of the world. I was, for the moment, back in reality staring at my friends basement ceiling.</p><p>I started to get a little depressed about losing the vision I had just been treated to, so I decided to go upstairs. Everyone was watching TV, so I just layed down in front of the TV and tried to enjoy the rest of the night. I didn't have any more visions, but I kept slipping in and out of reality. I remember gasping for breath for no other reason than being able to.</p><p>The rest of the night, and my trip, was extremely enjoyable. I woke up the next morning feeling great (despite sleeping on the floor) and can honestly say the experience has changed my life for the better.</p>"
}
