{
 "title": "Healing by God",
 "author": "Fayhe",
 "citation": "   Fayhe. \"Healing by God: experience with Mushrooms (ID 60491)\". Erowid.org. Jan 11, 2008. erowid.org/exp/60491",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60491",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 11, 2008",
   "Views: 4908",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was reading up on the history of mushrooms this evening, and i came accrossed some information concerning the treatment of cluster headaches and migraines through psilocybin and LSD.  I have only eaten mushrooms 4 times, all in the past month.  I have eaten various doses of them, from a little over three grams, to less than to grams.  I have eaten them in various settings, from a concert, to a home, to a small apartment. The particular experience I would like to talk about was at a friend's home. We had blacklights on, and The Doors, the greatful dead, and some drum and bass house music is what we choose to listen to.  Two out of four people present ate mushrooms.  We had a good time.</p><p>what i really wanted to talk about was my bodily experience.</p><p>I experience terrible headaches of the migraine sort.  The only type of headache i have ever had are migraines.  I often pop my neck and back to relieve tension.  I find when i am on mushrooms that i am very easily able to pop my neck several times in each direction without any pain at all.  I'm not really sure this has much to do with anything, but I figure for research purposes, anything helps.  I will definitely keep track of my frequency of headaches since i have used mushrooms.</p><p>I have found the last two times that i have used mushrooms (less than 2 grams of penis envy mushrooms) that i have had an eye opening spiritual experience.  I discovered a lot about myself, and I learned a lot about the world around me this past weekend.  To me, using psychoactives is a very rich spiritual journey.  I have had scary trips too, but in the balance of the universe, there is no positive without negative.  I want anyone who reads  this to be very careful and extremely responsible when using drugs of any kind, Take care of yourselves, and thank whatever God you pray to for these wonderful gifts he/she has given us. Oh, and don't think too hard or you'll have a crappy trip.</p>"
}
