{
 "title": "One Gets What One Puts In",
 "author": "Nate",
 "citation": "   Nate. \"One Gets What One Puts In: experience with Salvia divinorum (ID 60511)\". Erowid.org. Sep 8, 2009. erowid.org/exp/60511",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2007",
   "60511",
   "Male",
   " ",
   "Not Given",
   "Sep 8, 2009",
   "Views: 1890",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Up until experimenting with Salvia I was not a drug user at all on any regular basis.  No tobacco smoking, only the occasional beer and nothing else aside from over the counter antihistamines and pain killers.  About the best feeling I ever got from drugs was morphine during a hospital visit.  But that was because I was in genuine pain.  Although it felt incredibly warm and relaxing, like being back in the womb (I imagined), I had no desire to take it recreationally in the future.  Philosophically I am very much opposed to drugs being illegal.  That power junkies and control freaks would sanction what other people do with their own minds and bodies seems to me a gross hypocrisy.  However, I was still working from the perspectice that drugs were a risky thing that one should generally avoid if possible.  But not having taken drugs myself I felt it was important to see things from the drug user's perspective.  But where should I start?</p><p>After reading about Salvia it sounded like something to try.  I am not a party person and something that allegedly lended itself to a quiet evening seemed right up my alley.  The other factor is the legality.  I would rather have tried marijuana first.  Even though it's absurd that any plant be illegal the fact remains that some are and the cops don't care about my personal political views when they're slamming me to the ground and handcuffing me.  So with salvia I could actually buy the stuff online and not worry about the State.  But the real reason is that despite the commonly held belief that drugs are everywhere and that pot is easier to get than alcohol for teenagers, I quite frankly haven't the first clue about where to get pot.  I'm 33 years old fer cryin' out loud, am I supposed to go hang around high school kids and ask to score some weed?  Are there shady characters walking the streets to get it from?  I haven't a clue.  Call me a backwoods bumpkin, but in my town the source for marijuana just wasn't clearly evident to me.</p><p>I watched some videos online about Salvia, namely the Sacred Weeds BBC show.  This was excellent.  Instead of the usual image of drug users as a bunch of college-age goofballs acting crazy this was a bunch of stuffy scientist types in some posh English country manor waxing ponderously about drugs.  Much more my speed!  See, not everyone who does drugs needs to be an empty-headed frat boy moron!  It was possible that earnest, intelligent folk were also part of the picture.  This was the type of approach I was looking for.</p><p>Eager to give this stuff a try I got all the equipment you need for smoking it and purchased some plain, un-enhanced leaves for starters.  The most objectionable thing was inhaling smoke.  My little sissy-boy, pink, non-smoker lungs just weren't used to this at all!  But I sucked it in as best I could.  Practice makes perfect, right?  The effects I would describe as dizziness and disorientation.  But where are my hallucinations?  Where is the profound connection with the 'spirit world'?  Where is the uncontrollable giggling and euphoria?  Where's the goddamn visual patterns and traffic reflectors!? Did I do this wrong?  Did I get bad stuff?  I felt completely disappointed.  At no time did I leave my physical body and go off on psychedelic trip.  No visual distortion whatsoever.  I was just really dizzy and out of it for awhile and then I went to sleep.</p><p>So then I bought some 6x stuff.  Same deal there, except the effects seemed to last longer.  I would say that it felt like my body was being twisted like a large screw, but I hate to even say that because when someone else reads that it comes off as more impressive than it really is.  Who knows, maybe I have completely cocked this up.  Maybe my inability to keep a lungful of smoke in for more than 2 seconds is the problem.  I tried chewing some of the leaves but the taste is very bitter and awful.  What does a guy have to do to see one lousy hallucination around here?  I have tried it about four times in total and not felt any of the things I've read about or watched regarding salvia.  Not so much as a single laugh escaped my lips.</p><p>The realization I came to is that the drug experience is only as good as the person taking it.  One has to have this fancy stuff in one's mind before going in.  My problem was that I expected drugs alone to provide the profound experience so many others had described.  Maybe it just doesn't work that way.  I must be too objectively minded for this to affect me in a positive way.  It also made me even more convinced that drug illegality is a pointless thing.  I can't imagine why salvia would be made illegal.  It seems that this drug at least, has no power to take control over a mind and offer otherworldly experiences, much less make the body do nasty, property-rights-violating things that might be grounds for illegality.  I doubt such a substance exists.</p>"
}
