{
 "title": "Synchronicity, Ghosts, and Earwax",
 "author": "Balloon Eye",
 "citation": "   Balloon Eye. \"Synchronicity, Ghosts, and Earwax: experience with Nitrous Oxide (ID 60559)\". Erowid.org. Mar 10, 2010. erowid.org/exp/60559",
 "substance": "Nitrous Oxide",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 60559",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 10, 2010",
   "Views: 6082",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I no longer use nitrous, but when I did it was for four enthusiastic months.  I was in my mid twenties and teaching at a university, and I realized how incongruous and potentially retarded such dabbling could be.  Nonetheless, beercans and vaporized weed had become routine, and I wanted something accessible, intense, and cognitively interesting.  Psychedelics were difficult to come by, so nitrous chargers seemed like a good fix.  I preferred huffing them in a balloon (inhaling, exhaling back into the balloon, then inhaling again, recycling like this 5-6 times, or until it was enough) although I also used a pressurized canister intended for making whipped cream and/or sparkling drinks (if you use soda chargers, CO2).  </p><p>The effects are well noted, though Ill offer a sketch of its more notable aspects: reverberations that slowly become tactile lead to a paradoxical sense that my body is pulsing organically while numb.  With eyes closed, a singular clarity relieves all pain, anxiety, or confusion even as I am in the midst of an utterly dis-associative state.  Moments of profound insight, though later unusable or un-recallable, often accompany a sense of synchronicity (déjà vu, or alreadiness): as though Ive finally recovered a memory that has eluded me forever, yet all along that memory was simply the experience itself, now, in the present, memory and anticipation fused into a recursive continuum (if you wanna hear me get fancy).  Also, I definitely concur with the reported phenomenon of nitrous ghosts: frequently, the bodily and temporal disorganization was such that I would find myself as though in another room with other people, often unidentified.  I would come out of the experience with my eyes still closed, and upon opening them I would be shocked to find myself where really I was and that I was alone.  If friends actually were present, they often reported that I would be gesturing toward non-existent people while in the middle of the experience, and that they thought I was losing it altogether until they had the same encounters while on nitrous.</p><p>Ultimately, other than the way in which it focuses me on utterly impossible modes of time, coincidence, and memory, nitrous can be very boring.  However, it is deeply, deeply relaxing, and without the negative experiences Im about to relate, I would probably still occasionally use it instead of alcohol.   </p><p>What went wrong for me was simple: foolhardiness.  I thought, Fuck it.  I can do this stuff and still think.  Lets see how far it can go.  Well, Not far, was the resounding answer.  On appx. 10 occassions, I would use 12 chargers.  On 5 occassions I used a box.  These nights were somewhat closely strung together and eventually it all culminated in a night of 2.5 boxes (I wrote a previous report called My Tinnitus which Ill be updating in what follows).  Ive never talked to someone whos done this amount, although Im sure there are many.  The things is, I need to be able to rely on my brain all the time, and if you know anyone whos done such an amount to cap off a week long binge, chances are they were less than eloquent about it.  Fortunately, Id read enough to know that taking in enough air while using a balloon is important, although not enough to keep oxygen levels stellar  </p><p>To the point: tinnitus developed, which I thought was fucked up.  Then, after two weeks of ear-ringing, I went swimming, the pressure clogged my ears, and I found out that earwax build-up was to blame.  An easy cure, and so maybe tinnitus was a mere coincidence.  However, it may have had something to do with the nitrous use since huffing with a balloon leads to frequent, intense changes of pressure in the ear canal and that can promote wax build up.  Therefore, if youve done nitrous and have tinnitus, just plain get your ears cleaned by a doctor.  It helps a lot.  The safety of home cleaning kits is suspect, but Im sure they work too as long as you know what youre doing.  </p><p>However, that was just a prelude.  After the wax episode, I called it quits with nitrous.  The minor scare of permanent damage made me cautious.  But then, I began to notice slight numbness in my extremities and an insane twitchiness and tremor, especially while falling asleep (FAR more pronounced than that jerking feeling you get as you doze off: the myoclonic jerk, as its knowna good band name perhaps).  It wasnt enough to derail my life, but it bothered me and seemed unhealthy and, more than that, reinforced an ugly idea that Ive struggled with before: that somehow, the damage Id done was irreparable and that, in being foolish, I deserved it.  That idea seemed so juvenile and puritanical that I was pissed for even entertaining it.  Still, I worried, blamed the nitrous, and decided to go after some B12.</p><p>A short bit of reading let me realize that normal vitamins just werent going to cut it, and that what the nitrous had done (if the nitrous truly was to blame) was sort of short circuit the whole system by which B12 gets absorbed and used.  I suspect that I would need something like a B12 shot to reboot my system.  Still, lining up a shot with a doctor seemed tricky, so when I fond out sublingual B12 tablets (dissolved under your tongue) had been developed, I went for it.  The results were immediate and surprising (and certainly suspect as placebo effects).  Nonetheless, nitrous use, abuse, and recovery is a murky, superstitious area, and the fact that this worked at all was a blessing.  My twitching and numbness went away, and eventually I felt great.</p><p>Im done with the gas.</p>"
}
