{
 "title": "Content Emptiness",
 "author": "Gary",
 "citation": "   Gary. \"Content Emptiness: experience with Heroin (Black Tar) (ID 60628)\". Erowid.org. Jul 21, 2009. erowid.org/exp/60628",
 "substance": "Heroin (Black Tar)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "smoked",
   "Heroin",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60628",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2009",
   "Views: 27197",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHello, over my short life, I've tried several drugs. Starting with caffeine, nicotine, and alcohol, I moved onto marijuana, which I smoked regularly for about one year. Because I lived at home at the time, and I was a careless teenager, I got caught by my parents. After that, I kept things quiet for a few months, and then I started doing E, acid, ketamine, nitrous, and various amphetamines.\r\nHowever, I had always been interested in smoking heroin (needles aren't my thing). So, when the opportunity presented itself to score some h from a local dealer/friend of mine, I jumped on the opportunity to buy twenty dollars worth. I took it home, got some tin foil and a small glass tube to inhale the smoke. After trying unsuccessfully to get it to smoke over a candle, I got out a simple bic lighter, which worked much better. It took a while to completely burn up, but by that time, I was pretty damn faded.\r\nI felt good. It's not what I would call 'euphoria' but was more like a content emptiness. I put on some Coldplay and just chilled, watching the candles flickering in the draft in my room. Life was good. I didn't care about the problems in my life, and work seemed like something completely pointless, I see how people become addicted to this. Now, it's been about an hour and a half since I smoked and it's starting to wear off. I feel itchy and tired. Overall, this has been a great experience, but I won't do it again because this is a habit that could ruin me financially.\n\n\n"
}
