{
 "title": "Suicide Prevention",
 "author": "Xdefeatsy",
 "citation": "   Xdefeatsy. \"Suicide Prevention: experience with Quetiapine (Seroquel) (ID 60641)\". Erowid.org. Jun 26, 2007. erowid.org/exp/60641",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "450 mg",
   "oral",
   "Pharms - Quetiapine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60641",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2007",
   "Views: 13719",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter a traumatizing, drug-infested experience with my first semester of college my brain was an emotional wreck. I was extremely depressed, including daily thoughts of suicide -- I felt as though my only option at the time was to self-medicate with every drug I could get my hands on. Although I had experienced several drugs before college, my mental state forced me to amplify my use. It eventually got to the point where in a single day I would have used cocaine, amphetamines, psilocybin mushrooms, and oxycodone all on top of a few beers and a pack of cigarettes. I had become a mental wreck and I knew that I needed to get out of the situation I was in and seek help.\r\nAfter the most traumatizing four months of my life at college and severely damaging my mental state with different chemicals to cope with suicide and anxiety, I transferred back home and went to see a psychiatrist. He diagnosed me with Severe Major Depressive Disorder and prescribed me 450mg (400mg before bed and 50mg during the day) of Seroquel to be taken every day. The goal, he said, was to reduce my anxiety and social phobia as well as prevent me from having suicidal episodes.\r\nIt is now a month later and I feel as though Seroquel is helping a little bit. If I had to rate my anxiety before the medication, it would have been a 10 on a scale of 0-10. After Seroquel it is more like a 4 on the same scale. I am able to function somewhat normal in most social situations, it helps to take your mind off of negative thoughts. However, I feel as though it does not do enough during the day for depression. I still get suicidal thoughts and feel hopeless and confused a couple times a week. However, the Seroquel has reduced the intensity and the length of these thoughts.\r\nThe feeling I get from Seroquel is not so pleasant. About an hour after taking my 400mg nighttime dose I feel thoroughly sedated, almost like being drunk. I have trouble moving and difficulty speaking, my body also buzzes really hard. It also stuffs up my nose, makes my legs restless, and makes my eyes really red. But since this is the nighttime dose, it's no big deal, eventually it just knocks me out and I get some great un-interrupted sleep. \r\nThe daytime dose of 50mg is nice, but not quite strong enough. The nighttime dose (taken around 10pm) wears off at about 1pm the next day. The 50mg taken at 1pm usually makes me feel like I just smoked a bowl of cannabis (a bit aloof but still able to function, feeling somewhat happy, suppressed).\n\n\n"
}
