{
 "title": "It Has Its Ups and Downs",
 "author": "Starslight",
 "citation": "   Starslight. \"It Has Its Ups and Downs: experience with Buprenorphine (Suboxone) (ID 60664)\". Erowid.org. Apr 4, 2007. erowid.org/exp/60664",
 "substance": "Buprenorphine (Suboxone)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(ground / crushed)",
   "  T+ 1:00",
   "2.0 mg",
   "oral",
   "Pharms - Buprenorphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 60664",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 4, 2007",
   "Views: 31858",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One night I was snooping through my fathers medicine cabinet, and viola! There was a bottle of about 50  Buprenorphine pills. I decided to take about 6 or 7 out of this nearly full bottle, in hopes that he would not notice. I had heard of the brand name of this drug before, (suboxone), so I went onto the internet to do some research, and found that it is a very long lasting opiate, used to get people off of heroin. And was generally taken sublingualy, or placed under the tongue until dissolved. </p><p>I read another report that said the pill was crushed and placed under the tongue so I crushed one 2mg tablet and placed it under my tongue. Right after I did this, I hopped in the shower and waited for the effects to come on. About 15-20 minutes into the shower I noticed that I started to get very 'spacey' and out of it. I remember my eyes drifting from one tiny water droplet to another, and focusing on how the light hits each one. After that I got this strange urge to just sit down. So I sat for about 30 minutes and then decided I was bored of that.</p><p>After my shower, it was about 11 PM, and I went into the other room to watch some television. I was sort of expecting a more intense high, more like when I tried heroin, methadone, and oxycodone. With this in mind I decided to take another 2 mg tablet. At this time I did not want to be bothered by crushing up the pill again and holding it under my tongue, so I just took it with some water. I wasn't quite sure whether it would work this way or not, but I didn't think that it would have any negative effects.</p><p>About and 2 hours have passed now, and I am really feeling a strong body high. Everything was numb, and almost vibrating. I was having trouble walking from room to room. Although I wasn't doing anything at all, other than watching television and going onto the internet, I was very content and happy. At this time, I noticed a little bit of nausea coming on, so I went into my room with my ipod, and lied down on my bed for a while.</p><p>So lets say that about 4 hours have past now, and I am really feeling that normal opiate high that I know and love. I ended up staying in my bed for about 3 more hours just listening to music, not necessarily awake or sleeping. All I can describe my feeling were being in 'heaven' for the rest of the night. That is until I decided to get up for whatever reason. As soon as I got out of bed, I was so sick to my stomach I couldn't take it. I ended up getting a drink the going back into bed. As soon as I lied back down I felt fine, and my nausea went away. I fell asleep some time after that, just to wake up in about a half an hour. This cycle went on for the rest of the night. </p><p>So at about 7 AM I got out of bed to go into the living room to watch some television. The nausea was still very prevalent whenever I moved. I was still pretty high and remember thinking to myself: wow, this drug last forever! Throughout the rest of the day, the effects slowly tapered off, but the nausea stayed all the way untill the next night, about 24 hours.</p>"
}
