{
 "title": "The Subtle Creep",
 "author": "Swamp",
 "citation": "   Swamp. \"The Subtle Creep: experience with Tramadol (ID 60685)\". Erowid.org. Jun 26, 2007. erowid.org/exp/60685",
 "substance": "Tramadol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60685",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2007",
   "Views: 5486",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I tried codeine once (codeine plus acetaminophen, processed using cold water method), and really didnt enjoy it at all. It just made me feel sick. Tramadol caused no such unpleasantness, but it wasnt the euphoric bang I had expected. My first experience was three 50 mg pills taken on a full stomach. This is what I wrote at the time (provided as an unvarnished perspective on what I felt at the time):</p><p>***I took three 50mg pills of Tramadol this evening around 7:42. Its now about 9:40, and the effects became pronounced only about 15 or 20 minutes ago. I feel lethargic. My body is somewhat numb. It feels like being very drunk, but without the dizziness or wildness. I wouldnt describe it as euphoric. Not comfortable and not uncomfortable. I broke into a sweat as I finished typing the previous sentence. Definitely uncomfortable. I drank two glasses of water and then laid down on the floor to read my homework. I quickly began to feel much better. Still, this is a very mellow and muted high, with none of the exuberance and rush of being drunk.***</p><p>Now that Ive had a little more experience with it, I offer the following summary:</p><p>Mellow, relaxing and comfortable, but no sweeping feeling of euphoria. Ive never tried other types of strong pain medications (other than codeine, as mentioned above), but some people say that the Tramadol experience compares favorably with Oxycontin, etc. If thats the case, then I cant imagine what all the fuss is about. </p><p>Tramadol is not an addictive, euphoric rush. Its much more subtle. I compare it to the feeling I get after having stood in the cold rain for twenty minutes, I go inside, take a nice hot shower, and then relax in front of the fireplace with a cup of hot cocoa. </p><p>All aches and pains and such disappear. I get a pleasant numbness of the body, especially fingers, toes, hands, feet and legs. Im neither dizzy nor sleepy. The best thing about the high is the lack of stink and sloppiness that I get from drinking. Tramadol is a very clean and gentle. I dont notice any loss of coordination or sloppy speech. Itchiness is not a problem, at least not anymore than I normally feel when the air is dry. For me, onset is affected by whether Ive eaten or not. On a full stomach I dont feel anything until an hour and a half after I take the pills. On an empty stomach, the numbness hits after about forty minutes. </p><p>AlcoholI like to drink a little when I take the pills. Slowly drinking beer (about one can per hour) really augments the high, by which I mean that it increases the mellow, comfortable feeling. In instances when I have taken Tramadol by itself without drinking, Im left feeling like I need a little boost to the experience, even when I know I should be feeling the peak effect. Maybe Im just a booze hound. On the one occasion that I drank too much (several stiff drinks in short succession), my head started spinning and I felt even more terrible than I might have if I had just been drunk. I woke up the next morning with nausea and a lingering headache. Ive never had a hangover with Tramadol alone. </p><p>Peeing At high doses Tramadol seems to numb whatever muscle handles the urination function. Not impossible to deal with, but I end up standing in front of the toilet for several minutes while my pee dribbles out.</p><p>ToleranceDefinitely a problem. After a week or two of abstinence, 150 mg will do nicely, whereas after several daily doses the effect is hardly noticeable. Daily doses require more like 300-400 mg to get a good high, and even then it tapers off. Ive never taken Tramadol more than three days in a row. The most Ive ever taken is 400 mg to start and then a 150 mg boost about five hours later. Instead of producing greater intensity, the boost only prolonged the plateau.</p>"
}
