{
 "title": "The Caffeine Fiend",
 "author": "stenza",
 "citation": "   stenza. \"The Caffeine Fiend: experience with Caffeine & Cannabis (ID 60755)\". Erowid.org. Sep 4, 2009. erowid.org/exp/60755",
 "substance": "Caffeine & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 cups",
   "oral",
   "Caffeine",
   "(daily)",
   " ",
   "2 hits",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "60755",
   "Female",
   " ",
   "Not Given",
   "Sep 4, 2009",
   "Views: 12946",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For a little over a year now, I've been obsessed with caffeine. I never drank it for enjoyment- there were no caramel macchiatos... no peppermint lattes... </p><p>'I'll take your strongest black. Do you offer Venti espresso cups?' </p><p>And the whole thing would by downed in a matter of moments. I made very strong brews at home (about 5 tablespoons per 2 cups of water) and sucked them down as if they were my only source of hydration... and, to be honest, they pretty much were. I'd go on binges of 4 cups in the course of two hours or so, and this would go on for about a week until I got too jittery to walk straight, or suffered too intense of a panic attack to keep playing with my life.</p><p>I also really used to enjoy the habitual smoking of pipes, bubblers, bongs, joints, blunts etc. etc. I was really into it, and  it was enjoyable. But! Caffeine FUCKED IT UP! I didn't smoke for a while, and so supplemeted the boring day to day reality with my massive caffeine intake. And then, I began smoking again. Daily. And it was alright at first.. I'd feel a little naseous, though, and I'd get hyper sensitive and have a very high awareness, very unlike my friends who sat, stoned, for hours. I had to move. I had to clean. It was weird, and I bet all my friends thought I was insane for sure. And then, one day, I just snapped.</p><p>I had had a BooKoo energy drink, my typical four morning cups, 2 lunch cups, and a lot of sugar earlier that day. We were driving, smoking, and I got this awful tight feeling in my chest. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] I HAD to move- maybe the music was just too intense, but I could not stop jiggling and wiggling my limbs everywhere. My breathing became labored and difficult. It felt as though my throat were swelling. My heart also began to beat at an erratic and almost ridiculous pace. I could barely differentiate the separate beats! I made my friend pull over so I could get outside and walk. </p><p>I bought a Twix bar because I thought I just needed some sugar and the little caffeine that was in the chocolate. I devoured the whole thing in a matter of seconds, and it helped for a little while. But, then it got worse. I had to keep opening windows, changing positions, massaging my muscles, massaging my sternum and the flesh over my heart. </p><p>I had to get out, I was having a full on panic attack or SOMETHING. I popped my head in between the two front seats and said in a quiet voice with 0 conviction: 'Not to sound weird or anything, but I really need to get out. If you could just like... pull over... it would be awesome.' So I grabbed my schoolbag and jumped out, with the other passengers saying shit like, 'Um... ok. Whatever, dude.'</p><p>My friends, I guess, just assumed I really was going insane because they did not try to help me at all. I ran to a doctors office (even though I couldn't breathe... it seemed to help bring down the panic aspect in that I felt my heart was racing for a reason) and asked for something to dilate my lungs. My brain was not communicating with my mouth, I guess, because the nurse told me, ' I don't know what you mean by... dilate your lungs!' I have not been diagnosed with asthma, and I'm not 18, so they couldn't do SHIT to help me! I decided to just call my mom, to have her pick me up. This whole time I was going through hell, unable to breathe or form coherent thoughts or sentences. </p><p>I honestly attribute this whole ordeal to my caffeine intake, and my anxiety and possible lung problems I think were heightened by the marijuana.  If you have a lot of stress, a lot of anxiety, or anything like that... I would NOT recommend </p><p>taking lots of caffeine pills (like, over 6), or ingesting more than 3 servings of an energy drink + coffee in just a few hours, and THEN smoke a lot of pot in a hotboxed car. The whole incident I have jsut described has happened to me about 3 times... and it's terrifying! Just know yourself and your limits!</p>"
}
