{
 "title": "Lavender Burps",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Lavender Burps: experience with Propylhexedrine (Benzedrex) (ID 60776)\". Erowid.org. Mar 12, 2007. erowid.org/exp/60776",
 "substance": "Propylhexedrine (Benzedrex)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 mg",
   "oral",
   "Pharms - Propylhexedrine",
   "  T+ 5:10",
   "250 mg",
   "oral",
   "Pharms - Propylhexedrine"
  ]
 ],
 "footer": [
  [
   "2006",
   "60776",
   "Male",
   " ",
   "Not Given",
   "Mar 12, 2007",
   "17472",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend J told me all about Propylhexedrine, saying it was his favorite drug out of MJ, alcohol, salvia/amanitas (ha! - he got 'trapped in the 5th dimension'), and various pharms.  Anyway, I got a Benzedrex and capped up the cotton part.  Smelled like lavender, but it wasn't bothersome yet.  Took them just before 1st period. </p><p>An hour later, I experienced an intense euphoric peak.  There were these great pleasurable shivers that ran through my body.  It was as if I was so fast at everything that everything seemed to slow down. I felt speedy all day (very very speedy) and it felt great to do anything.  I took four pages of notes in English on a 20 minute presentation - very out of character for me.  I discovered that scratching or rubbing my scalp produced very pleasurable waves of euphoria.  </p><p>After school, I had a few cigarettes with some buddies and picked up another benzedrex, as did M.  At J's house, M ate his, and I gagged mine down, dry heaving every time I tried to swallow.  Up until now, the smell of lavender on my breath and my burps hadn't been too bad.  Suddenly it was the most nauseating smell in the world. This time I tried just eating it in 3 pieces - bad idea. This stuff tastes very very bad.</p><p>I felt weird and kept burping, but coming up was fairly enjoyable.  I played with J's dog and had a nice conversation/'rational discussion' about Christianity and 'Organized Religion'.  </p><p>I began to feel intense nausea just before every burp, but figured out that holding my nose tightly eliminated most of the lavender part of the burps.  I said 'let's get some MJ so as to relieve this awful nausea.' and immediately threw up into an iced tea container.  That was very conveniently located.  Getting the cotton out of my throat was rather difficult - I had to undergo many throat contractions to get it out.  I felt a lot better, but still a lot of nausea, that's some sort of paradox.</p><p>After this, the crash was not great. Until I ate some Spaghettio's at 9:30 (first food all day, only drank some water, iced tea, and Gatorade, all of which were lost when I puked), I felt horrible nausea.  I still feel it, but as the Spaghettio's have taken over the lavender scent, it's bearable.  I believe that my weight may have something to do with my negative reaction to the second dose.  I am 6'1' and 135 lbs, so most drugs affect my body much more than the average individual.  300 mg DXM causes a 6 hour 3rd plateau trip for me.  It was not very wise to take a second dose on the first day I've done a new drug.</p>"
}
