{
 "title": "Incredible",
 "author": "ktrent00",
 "citation": "   ktrent00. \"Incredible: experience with Inhalants: Duster (ID 6080)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6080",
 "substance": "Inhalants: Duster",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "10 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6080",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 8, 2002",
   "Views: 35245",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] <br>My friend introduced me to getting high off computer duster.  He said that the chemical was harmless so I tried it on good faith.  I quite enjoyed the experience and every time we got together drinking we would cap the night with some hits.   The normal experience was just a head rush type feeling with pulsating sounds and darkened vision.  The good thing about it was it was a quick rush and didn't last too long.<br>Today I was off work and bored so I bought a can to enjoy at home by myself.  Holy S**T.  I took a deep hit held it in, then let go.  The pulsating noises started.  I took another deep hit and started to drift away.  Suddenly my friend was there (not really) but I really thought that he was.  He said 'look how you feel now, imagine if you do another' so I did.<br>Into another reality I went.  It was like a paranoid dream and my imaginary friend was really messing with me.  I came back to reality and was so facinated although a little horrified I felt that I must try it again.  Deja Vu, same exact dream took place.  I repeated this about four times trying to figure out what it all meant but as I would come to I would forget most of the event although it seemed to be the same.  I couldn't figure out how I could be so insane as to forget that I was just hallucinating again after each hit.   I really would think these things were happening in a matter of seconds.<br>I called that same friend at work and we did a few together over the phone.  Nothing, just the head rush.  It seemed like only when there was nothing to concentrate on I would fade out.  But I figured hey why not try this with some porn.  Now there is about 1 hour of my life that I really don't remember.  I was so into it I don't think I would have stopped exept for the fact that I threw up on my living room floor.  The can was almost gone and I was pretty screwed up for several hours fading in and out of reality.  I became rather depressed and almost suicidal but after talking with some friends I seem to have snapped out of it now.<br>I am just glad I waited to get home before I started.  I really think it should be avoided all together because anything that could do that to me so fast must be doing some damage.\n\n\n"
}
