{
 "title": "Fun and Simple Euphoria",
 "author": "Norwegianwood",
 "citation": "   Norwegianwood. \"Fun and Simple Euphoria: experience with Nitrous Oxide (ID 60810)\". Erowid.org. Jul 21, 2009. erowid.org/exp/60810",
 "substance": "Nitrous Oxide",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2007",
   "60810",
   "Female",
   " ",
   "Not Given",
   "Jul 21, 2009",
   "Views: 12697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Around 12:40AM, I was puttering about my kitchen, and, after reading about Nitrous, decided to inhale the air out of two whipped cream canisters.  I sucked in as much as I could from the first canister and held my breath as long as possible.  I breathed out and immediately felt giddy.  My mind was fairly clear, I could easily think.  My body felt sort of drunk, I was stumbling, and I found this very amusing.  Talking to a friend online, typing was very difficult because my fingers kept hitting the wrong keys.</p><p>I breathed in some more Nitrous from the other can, and this is when the strongest effects started.  My body and lips instantly felt tingly and numb.  I was once again stumbling.  I felt completely Euphoric and laughed at everything.  Everything my friend said I thought was hilarious.  When he said things that normally would make me concerned, I was able to respond normally and express concern, but in reality I was laughing uncontrollably.  Hence the name, Laughing Gas.</p><p>The numbness went away within a couple minutes, much sooner than I wanted it to.  Unfortunately I was out of Nitrous.  I can see the addictive potential of the drug, the high is short and very nice and I definitley want more soon after.  I felt euphoric and giddy for about twenty minutes after, and then I felt a sort of hangover.  My head felt very heavy and it was hard to hold it up.  I felt very slow and typing was difficult.  I no longer felt euphoric, but I didn't feel bad, the hangover was actually a bit enjoyable.</p><p>As I type this the next morning, I have a light headache, but no other problems. I'm glad I tried Nitrous and I'll do it again, but with caution to avoid addiction.</p>"
}
