{
 "title": "Wavyish",
 "author": "Lelekuglamo",
 "citation": "Citation:   Lelekuglamo. \"Wavyish: experience with Wormwood  (ID 60838)\". Erowid.org. Jul 22, 2009. erowid.org/exp/60838",
 "substance": "Wormwood ",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Wormwood",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 60838",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 22, 2009",
   "Views: 4149",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAround two years ago I got interested in absinthe, and all the 'green fairy' tales. After researching Absinthe, its active substances, etc... I decided to try and smoke wormwood, to get a 'thujone' high.\r\n(first time) \r\nI did the 'thujone hash', and rolled it in a joint: the wormwood hash mixed with tobacco.\r\n- didn't really feel anything.\r\n(second time)\r\nI made more of the hash, but this time I smoked it almost pure in a joint.\r\n- no effect whatsoever\r\n(third time)\r\nThis time I made around the same amout of hash as in the first time, but decided to smoke it in a pipe.\r\nI was convinced that nothing would happen, but here it goes.\r\nT+0:00\r\nI put the hash on the pipe and off I went. The smoke was light and barely noticeable\r\nT+0:05\r\nstopped smoking and went to the bathroom. When I open the door, the whole toilet looked like a sauna, it looked as if I had smoked in there.\r\nT+0:07\r\nI turn on some music and lie in bed just mildly appreciating the music, and the curtains which appeared to move in a wavyish way. I felt really comfortable with the whole atmosphere.\r\nT+0:15\r\nI sit on my chair to turn the music off, but the bass box seems to get larger, so I just stare at it trying to convince myself it's not growing.\r\nT+0:25\r\nI feel normal again.\r\nMy experience was pretty nice, but very short. I think that it worked better on the pipe rather than rolled.\n\n\n"
}