{
 "title": "Making Tea",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Making Tea: experience with Poppies - Opium (ID 60858)\". Erowid.org. Oct 16, 2007. erowid.org/exp/60858",
 "substance": "Poppies - Opium",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "8 oz",
   "oral",
   "Poppies - Opium",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2006",
   "60858",
   "Male",
   " ",
   "Not Given",
   "Oct 16, 2007",
   "34307",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been using poppy seeds for approixmately nine months now. My use has ranged from every day for a few days in a row to once every two weeks. I have extensively experimented with a wide range of drugs and almost all commerically available opiates, not including heroin. Poppy seed tea is no joke. The first time I read about it, I managed to make a mess, spend 10 bucks, and get nothing out of it. I tried it again using seeds for a different store, and got a noticable but fairly insignificant buzz. After narrowing down which suppliers have the best poppies and the correct recipe, I have managed to get seriously high for approximately $2 a hit and not make a mess in the process.</p><p>To make poppy seed tea I get between 8 oz to 32 oz (.5 to 2 lbs) of poppies per person. I put the poppy seeds in a trash bag and pour water over the seeds untit it gains a soupy texture (I can feel it through the bag). The optimal mixture is just enough so the poppy seeds can freely move through the mixture but not so much that I'm forced to drink a pitcher full of tea. I massage the mixture for about one minute or two, and then get a needle or earring and a pitcher. I poke holes in the bag so that the water can escape without allowing the poppy seeds to escape. A slow drip is preferable to a fast one. If I want to accelerate the drip, I put air in the bag, seal the bag, and use the air to push the water out. T shirts are o.k but 1) the shirt absorbs some of the alkaloids, 2) you lose the t-shirt, and 3) it tends to make a mess. I don't add lime juice unless I want the taste, it has no effect on the potency of the mixture.</p><p>The two indicators of strength are color and taste. In general, the darker, the stronger, and the more bitter, the stronger. Bitterness is always 100% correlated with strength, color I would say 90% of the time. I would liken the effects of the tea of 8 oz. of strong poppy seeds to eating 20 mg of oxycontin, with the added 'trippy' effect of morphine. The effects can last a long time, up to 12 hours per dose. It calms my nerves, numbs pain, makes boring things more interesting, and allows me to socialize with more warmth. The risk of psychological/physical addiction is the same as any other opiate. </p><p>If your seeds don't work, you probably got bad ones. I would say that at least 50% of store bought seeds don't work. My experience is:</p><p>1) If they are expensive, they probably won't work.</p><p>2) If you can only buy them in 4 oz or 8 oz packs, they probably won't work</p><p>3) Co-ops and health food stores typically don't have good seeds. I have only gotten high potency seeds at farmer's markets. </p><p>4) Seeds follow a 'when it rains, it pours' pattern. Every store might have great seeds for a month, and then all of the sudden, you can't find any anywhere. I'm sure this is due to regional distribution and supply patterns.</p>"
}
