{
 "title": "Cactus Lemonade",
 "author": "Hero",
 "citation": "   Hero. \"Cactus Lemonade: experience with Cacti - T. bridgesii & Cannabis (ID 60897)\". Erowid.org. Sep 9, 2007. erowid.org/exp/60897",
 "substance": "Cacti - T. bridgesii & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2.5 cups",
   "oral",
   "Cacti - T. bridgesii",
   "(liquid)",
   " ",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2006",
   "60897",
   "Male",
   " ",
   "Not Given",
   "Sep 9, 2007",
   "Views: 20431",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After scouring all available resources, I have realized that while millions of people have experimented with mescaline found in San Pedro and Peyote cacti, there is little to no information on the cactus trichocereus bridgesii, a cactus as equally abundant and possibly more mescaline laden than it's famous sister, San Pedro.  In his book Psychedelic Shamanism, Jim DeKorne suggests 3 different preparations for San Pedro: the ingestion of a dried powder form, the boiling of the cactus into a tea, and the preparation of a spagyric tincture.</p><p>For the sake of expediency and ease, I choose to go with the dry powder form, substituting t. bridgesii for t. pachanoi (San Pedro).  The two of us, P and myself, each purchased our own 12 inch cuttings of t. bridgesii and returned to our respective abodes to prepare.  Rather than bothering to de-spine my cutting, I decided to chop it as one would a carrot or green onion, and then went back and cut these star-shaped pieces into smaller chunks.  These chunks were placed in the freezer overnight and thawed the next day in order to aide in the breaking down of the cactus's cell wall.  Although probably not necessary, I repeated the process of freezing and thawing another 2 nights.  Next, the now slimy chunks were placed in a blender a handful at a time and blended on liquify until a light green slime that reminded me of avocado frosting was achieved.  This part was particularly painstaking, owing to the ancient blender I was using.  Ideally a high quality food processor would have ben employed.</p><p>At this point, P and I decided to combine our efforts, due to the fact that I own a dehydrator.  Next, the sludge was placed in a food dehydrator and dehydrated at around 130 degrees Fahrenheit for around 24 hours.  Had I not had access to a dehydrator, the next option would have been to place the sludge on sheets of plastic wrap in a well-ventilated room in direct sunlight for a few days until it was completely dry.  Once it has dried, the slime takes on a light brown to yellow coloring and looks a bit like dried cannabis sativa when bits are broken off of it.  Some areas, where the substance had been piled thicker on the dehydrator, were a much darker brown and looked almost burned.  The sheets of dried cacti were then easily broken into chunks that I placed in a well-cleaned and dried coffee grinder in order to form a powder.</p><p>Our 24 inches of trichocereus bridgesii had now been reduced to about 105 grams (3.75 oz) of powder.  Owing to clumsiness along the way, I believe we probably lost upwards or 10 grams of material to carelessness (dropped raw material, spilled slime, and scattered powder). </p><p>At this point we got a little experimental with the preparation.  After attempting to make a drink using the powder and water and realizing the resulting mixture was perhaps the most ungodly bitter taste known to man (worse than ayahuuasca in my opinion), we took the entirety of our powder and mixed it into a large jug of lemonade.  The lemonade made the drink slightly more bearable and theoretically the acids should help pull the alkaloids out of the powder, making it more potent.</p><p>I managed to drink somewhere between 2 or 3 cups of our bridgesii-lemonade and after about 2 hours of disappointed waiting decide the mixture was bunk, smoked a bowl of cannabis sativa, and went to bed maybe 30 minutes later.  No sooner had I turned off the lights and laid down, I began to trip harder than I had ever tripped to date.  I could see someone/something moving inside of my ceiling, causing it to bulge and morph and saw technicolor flashes of light.  I seem to remember one or two occasions when I was convinced there were demons in my room and refused to open my eyes lest I see them, but it's hard to tell how much of this was happening consciously and how much was subconsciously created.</p><p>To be honest, my body was exhausted but my mind couldn't possibly go to sleep, putting me into a hellish limbo of half-dream hallucinations and severe disorientation to the point that I would forget that I wasn't actually standing up but in fact laying in my bed.  Had I been better prepared, I believe that this drink could have provided me with a great journey into Inner-space, but at the time I was exhausted and even more naive than I am now when it comes to that sort of exploration and utilizing such a great learning opportunity.</p>"
}
