{
 "title": "A Long Night",
 "author": "Jerry",
 "citation": "   Jerry. \"A Long Night: experience with LSD (ID 6091)\". Erowid.org. Feb 12, 2002. erowid.org/exp/6091",
 "substance": "LSD",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(liquid)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6091",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 12, 2002",
   "Views: 9952",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had recently purchased a 100 hit bottle of liquid acid. </p><p>Preparations: I spent two days fasting and meditating to clear my head of a lot of mental baggage.</p><p>9:00 pm: I dosed my first hit in the break room of my job, it is about half an hour before work is over. I cleaned up and sat on the steps waiting for the store to close down. The acid was just starting to have its preliminary effects when I left the store about 1/2 hour later.</p><p>T+1 hour: I felt 'out there' but not fully tripping, I decided to take a walk up  to an apartment that my two friends live in. We go for a walk to the wharf to smoke a blunt and the sights, sounds, and smells of the city are nearly overwhelming to my acid-addled senses. I find the urban environment is very provocative when I am tripping... there are so many stimuli I can easily become lost. The walk back seems very surreal, we had a conversation with a man walking his dog and I couldn't tell if the dog was real or imaginary.</p><p>T+4.5 hours: I take another hit of liquid. At this point I noticed a peculiar feeling of being a 'pilot in a ship.' That is my mind and body seemed to be separate, I had a sensation of existing within my body rather than it being a part of me. This is not the first time I've noticed this effect, a very dramatic demonstration of the mind/body interface.</p><p>T+8 hours: I leave an apartment with friends after smoking heavily for several hours. My psychedelic effects are at their most intense, everywhere I look I can see rainbow auras shifting and glimmering. We decided to do a walking tour of Boston and set off to explore. We took a path leading through Beacon Hill's historic architecture down Commonwealth Avenue towards the campus of Northeastern. Along the way we admired huge glistening skyscrapers, temples, churches, and all the other idiosynchratic architecture of Boston. I felt my mind was primed to appreciate beauty in its rawest forms. The early morning breeze was extremely refreshing and as the sky began to gradually get lighter all the birds began to chirp. This feeling of nature awakening from slumber filled me with a good feeling, I reflected that after a tough New England winter the glories of spring were nearly upon us. At this point my mind turned inward and the rest of the trip I walked in silence contemplating the simple pleasures of life. I began to go over elements of my life and sifted through what is important to me. It was then that it dawned on me how my life is oriented and grounded through the relationship I built with my girlfriend. This filled me with an intensely pleasurable feeling of peace, serenity, and love. The world seemed to beam with an inner light, everything seemed wonderful. </p><p>T+10 hours: I returned to my building with my friends and we went to watch 'Caddyshack.' The movie was simply hilarious. I mean, it's a funny movie but the whole vibe of the acid was so overwhelmingly positive it just seemed like everything was extra enjoyable.</p><p>T+12.5 hours: I crawled into bed and took out 'Obedience to Authority' which is a psychology book about an experiment conducted by Dr. Stanley Miligram at Yale. I felt like my mind was devouring the information and encoding it into my brain with ease. </p><p>T+16 hours: I awoke from a doze to find myself still lightly tripping. There was a slight feeling of things being just different. My carpet continued to have shifting patterns but otherwise there was no more visual element to what had been a decidedly visual trip. After eating a light lunch of salad I felt very good. My mindset was extremely relaxed and upbeat, and all the overwhelming problems from prior to the trip took a new and less dramatic perspective. The trip gave me a chance to really prioritize and think about what makes me happy. I felt it was an excellent introspective journey, as well as giving me astounding visuals at some points, and a greatly enhanced appreciation for the city around me. </p><p>Well, the effects have more or less completely subsided now at 3:45 the next day. I still have slight distortions in my visual field when I unfocus my eyes, but they are diminishing. This trip was a rare treat and I only wish most of mine could be so wonderful. I've never had a bad trip, but then again I don't always have SPECTACULAR trips like this one either.</p>"
}
