{
 "title": "I Heard the Ocean Singing",
 "author": "Ripples",
 "citation": "Citation:   Ripples. \"I Heard the Ocean Singing: experience with LSD (ID 60915)\". Erowid.org. Mar 28, 2007. erowid.org/exp/60915",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 60915",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 28, 2007",
   "Views: 4498",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI dropped my first two tabs right as my mom was going out. I held them in my mouth and sucked on them for a few delicate moments. They didnt taste like anything, just like paper. I waited and I waited for effects, but didnt feel any. I felt a bit happy though. About an hour after dropping the acid I saw these little yellow bubbles on the wall, nothing pronounced, just moving patterns. It was pretty, but not very strong. I dropped two more tabs. It felt like I was dreaming. I was laughing alot and just felt good all over. \r\nAbout 15 minutes after dropping the other 2 tabs I looked over at this painting of two sailboats on the wall. I was in the living room on the couch. they seemed like they were melting, like the water was blending together, like it was all just merging. It wasnt truly hitting yet. When it hits, I discovered, you just know. I kept staring at the picture trying to see, something.\r\nThen it hit. It hit me so fast and I wasnt truly ready for it. My mom had been home for a while and was upstairs asleep. I looked around the room. Everything had changed. My world had changed. The way sound traveled had changed. The way light moved changed. My world was turned upside down. I felt like I had reached something I could never recover from. It was completely black, with no steps back to reality. I was more scared then I had ever been in my life. But I realized I was on drugs, and that I would be fine in a few hours. I wanted to run upstairs to the arms of my mother, to be close to her. and im a 17 year old boy. We just dont do that.\r\nI tried to calm down. I laid on the couch and hid my head in the pillows. If I had a benzo I would have taken it right then and stopped the trip. I laid there. I heard all these loud noises from upstairs. Like someone was moving things or breaking things or some shit. It was very odd. I was wondering what the fuck was going on up there. But I didnt move. I felt like those pillows were a bottomless pit. I felt all different sensations on my hands. I was feeling textures and fabrics that werent there, and the sound on the tv sounded so weird. I sat up. It was almost hard to move. I didnt feel like moving at all, yet I really wanted to. I pulled up my shirt and touched my chest. I felt like an alien. I was cold, I felt lifeless. I decided to walk around, outside and smoke a cigarette. I was just standing there next to the box I keep my cigs in for a long time.\r\nI put on my shoes and walked outside. I felt like all I needed to do was protect myself. Anything to care for my body. I wondered if I was gonna be ok. I tasted the cigarette. It didnt taste like smoke at all, just clean air. I continued on my walk and realized that no matter what was gonna happen that night, I still had people who loved me and they would love me no matter what. Love was the most important thing in the world. I looked up at the stars through the trees and they had never looked so brilliant. They were beautiful colors too. I thought if I stared at them too long I might fall into them so I looked away. \r\nI wondered why everything I did was to hurt my loved ones. I then went into the bathroom and the wallpaper produced moving patterns. I was very intoxicated. I didnt want to have sex like I usually do, just hug and be close to someone. The shower curtain morphed into a Victorian dress. I then went to my room to try and sleep. I could hear the cat rolling around on the floor, and the faraway ocean purring and the waves crashing right in my room. I could never hear the ocean like that before. Then I went into my moms room and slept next to her.\r\nAcid can be beautiful, I know it.\n\n\n"
}