{
 "title": "First Dissappointed Then a Believer",
 "author": "Anonymous",
 "citation": "   Anonymous. \"First Dissappointed Then a Believer: experience with Piperazines - BZP (ID 60941)\". Erowid.org. May 21, 2007. erowid.org/exp/60941",
 "substance": "Piperazines - BZP",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Piperazines - BZP",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "60941",
   "Male",
   " ",
   "Not Given",
   "May 21, 2007",
   "13779",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is going to be a telling of two trips on pure BZP. The first trip is 250 mg and the second was 500 with a 200 mg kicker.</p><p>First Trip, Friday evening, 250 mg</p><p>Basement suite, my girlfriend (120 lbs) and I (she took the same amount as me) Didnt have anything to do.</p><p>T+0:00 </p><p>Ate supper 1.5 hours before. Mixed the BZP into chocolate milk.</p><p>T+0:10 </p><p>Started to play Oblivion on my home theatre PC. Feeling anxiety because I have never used BZP before.</p><p>T+1:10 </p><p>Still playing Oblivion, getting pretty bored, wish something would kick in, because nothing has, not at all. Been drinking water due to slight dry mouth, and have already gone to pee like 3 times.</p><p>T+2:10  </p><p>Pupils very dilated, feel kind of funny, almost like taking antihistamine cold medication. Still thirsty, still peeing, palms sweaty. 2 hours in and not feeling much at all.</p><p>T+4:10 </p><p>Getting super bored, can't play Oblivion anymore, need to try something else. Turn on TV, gf started playing solitaire on my pocket pc, and then she hopped on her computer to check email. Definitely NOT ROLLING!</p><p>T+6:10 </p><p>Nothing on TV! Bored as hell, sure wish we were feeling something! ANYTHING! But we feel nothing...</p><p>T+6:40 </p><p>Tired, been yawning since 12:30 am, decide to say f*ck it and go to bed. Fell asleep no problem, but woke up often, almost every hour.</p><p>Next day, feel totally fine.</p><p>Second trip, Saturday evening, total of 700 mg</p><p>Same setting as before. Basement suite, my girlfriend (120 lbs.) and I (she took the same amount as me) Didnt have anything to do.</p><p>T+0:00  </p><p>Ingest 500 mg of BZP. Turned on TV to see whats on. Watched part of an Eminem concert, then got really bored of it. I thought maybe listening to and watching some of my Trance Energy videos would help us out. We did this in the dark, because the light shows are pretty fantastic on my plasma.</p><p>T+1:30  </p><p>Felt like NOTHING was happening. Pretty damn disappointed. Sweaty palms, peeing, thats it. Decided it was time for a scenery change, so turned on the lights and got up for a stretch.</p><p>T+2:00 </p><p>Decided to go to the bar, this got me excited, and I think that helped the BZP on its way. Danced a little bit in the living room while gf got ready. She says she isnt feeling anything. It is then that we decide to do another 200 mg each.</p><p>T+3:00  </p><p>Driving to the bar [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] . I am definitely feeling pumped. Something is kicking in, and I am liking it. Speedy, slightly euphoric, and talking like crazy. Gf wasnt feeling anything. Luckily we make it safely to the bar.</p><p>T+4:00 </p><p>At the bar and I was loving it. The DJ could play pretty much anything and I was getting right into it. Definitely feel the need to dance, and to be around other people dancing. Great euphoric feeling, lots of energy, lights are tripping me out. The feeling of my gf touching my neck and whatnot while dancing is fantastic. She unfortunately, still has not felt anything. I am loving it. Reminds me of E for sure. Euphoria, love, empathy, energy, the whole nine. Just not QUITE as powerful.</p><p>T+5:00</p><p>Last call for alcohol. Gf and I have been drinking nothing but water though. Gf is finally starting to feel some effects, she says she is 'more happy'. We saw a sad looking girl sitting near us. Felt an overwhelming need to make her smile. And we did. Empathy. Soon started to feel tired, didnt want to dance anymore, but still feeling great. Really wishing the DJ would play some electronic music.</p><p>T+6:00 </p><p>Left bar, hopped in my ride, finally some trance music! It puts me in the best mood. We decide to simply drive around and listen to music, and talk as we are both feeling very high. Wide awake.</p><p>T+6:30 </p><p>Arrive at home, sat on the couch, and decided to write this! I'm coming down now, it still feels great, no problems, nice and smooth, a little tired. Gf is definitely still rolling. Now we are just gonna see how long this will last! Going to take some 5-HTP before we sleep. Will we even sleep? Who knows? But I don't care right now.</p><p>Next day, feel pretty crappy, super empty stomach feeling, but dont feel like eating. (does that make sense?) Overall restlessness and hung over feeling. As soon as I eat food, I feel much better. Im guessing this is because I was up until 7 am, and then only slept for 3-4 hours.</p><p>Overall Thoughts</p><p>I was very very very disappointed the first time. Nothing happened. I have a feeling our environment may have played a roll in the poor experience. As for the second night, nothing happened for around 2 hours while we were sitting on the couch chilling, and then as soon as we got up and made plans to go out, my mood and feelings start to steadily rise and then I peaked for around 2-3 hours. Fantastic. Not quite as overwhelming as E, but similar speedy and euphoric effects, along with the need to dance and move and talk a ton. Definitely better than the feelings available from alcohol.</p>"
}
