{
 "title": "Paranoia Strikes",
 "author": "Cris",
 "citation": "   Cris. \"Paranoia Strikes: experience with Zoloft & Cannabis (ID 60946)\". Erowid.org. Sep 4, 2009. erowid.org/exp/60946",
 "substance": "Zoloft & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1500 mg",
   "oral",
   "Pharms - Sertraline",
   "(pill / tablet)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "60946",
   "Male",
   " ",
   "Not Given",
   "Sep 4, 2009",
   "Views: 6640",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 1500 mgs of sertaline is considered an extremely high dose] </p><p>I was at my friend 'Clarks' and we were smoking some bud and he said if you take Zoloft it will enhance the effects of the pot.  Being the dumass I was I took 15 100 mg pills in the space of about 2 hours.  This was around 8 pm.  I didn't feel anything for awhile, just high from taking bong hits.  I stayed the night there and it was the worst night of my life.</p><p>I woke up and I saw my friend Clark standing on the steps with a device that I thought he was trying to kill me with.  I looked up at the ceiling and a giant net was coming down over my head, controlled by my friend of course, and I started waving it away.  I looked over and Clark wasn't there anymore.</p><p>The next day is still a blur to me.  Apparently I started rambling about how everyone was out to get me and I wasn't safe anymore.  I was smoking lots of pot to try to calm down but it wasn't working well.  Clark called a doctor and he said I was suffering from schitzofrania.  Later that day I calmed down enough to go home.</p><p>I have never been the same since that night.  I hear voices in my head and sometimes I'll see someone and then their not there.  I hear people calling my name all the time, but their not.  I have the symptoms of a paranoid schitzofranic and I blame the zoloft.  I wish I could go back and undo that terrible night, but I can't.</p>"
}
