{
 "title": "A Loss of Desires",
 "author": "Sjshroomer",
 "citation": "   Sjshroomer. \"A Loss of Desires: experience with Mushrooms & Cannabis (ID 60966)\". Erowid.org. Oct 5, 2009. erowid.org/exp/60966",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "255 lb",
 "header": [
  [
   "DOSE:",
   "2 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 60966",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 5, 2009",
   "Views: 2670",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI should begin with a brief history of my drug experience, I've done salvia, coke, adderall, and ambien, all only once and am a daily smoker of marijuana.  This report is on my first experience with Mushrooms.<br>I began the day by listening to positive vibe music, Sublime, Bob Marley, etc.  My friend G had told me that a lot of how your trip will go depends on your state of mind.  By the time my friend s R and J came over I was on very good vibes.  Any negative experience in the past few days was gone and I was in the perfect mood.<br>R and J came over around 1ish. After this point time is pretty much lost because I didnt keep a clock on me.  The following report takes place between 1 and 6pm.  We discussed the plan of attack, which was to take a walk in the woods near my dorm.  For winter it was the perfect day outside, around 30 degrees and sunny with a little wind.  We ate our mushrooms, each taking about 2 grams, in my room and then headed out into the woods. <br>Ive heard a lot of people say they get a little nauseous but I felt fine.  Maybe I was focused on what was going on around me or something but I noticed no ill effects.  We took a walk on the paths going through the schools woods and just talked about random things, past mushroom experiences etc.  We decided to find a bench we knew of in the woods to take a break.  As I sat down on the bench I noticed one tree a head of me seem to expand and contract very slightly, almost unnoticeable.  I asked R and J if they noticed it but they said no, so I think I can claim this as the beginning of my come up.  I decided to lie down on the ground.<br>As soon as I did my entire perspective changed.  I could really see the clouds and see the different shapes presented by them.  The shifts in appearance were slower than normal.  I felt so wonderful to be looking up at the sky.  I felt like if everyone could take this perspective all the worlds problems would be solved.  I told R and J to lay down but they didnt believe me.  I kept insisting and laughing at how good it was.  Finally I got up, and then they both laid down immediately.  They had it planned all along.  Just to spite them I laid back and we all discussed the worlds problems and such.  We all agreed that if everyone in the world stopped what they were doing and laid down on the ground like we were everything would be all right.<br>After awhile we decided to walk again and came up on some relatively deep snow.  R said something about how cool it might be to just fall backwards into it.  Having no fear at this point I looked at her, turned around and I just let myself fall backwards.  Words cannot describe the feeling of falling and the gentle cushion of snow.  And to follow it all up the new perspective I felt before hit me as soon as I looked up and saw the sky.  I felt completely and utterly content.<br>Somehow during my fall my arm got underneath the snow.  R and J repeatedly asked me (semi worried which told me they were coming up too) where my arm was.  Somehow I got the idea that slowly moving my arm out of the snow would look really cool to them.  As I did it they both laughed at how weird and creepy it was.  We were all feeling pretty good at this point.  I convinced R to take the fall into the snow.  She agreed that it was defiantly a worthwhile adventure, but J didnt want to because he figured if he laid down again he wasnt getting back up.<br>At this point we were getting kinda cold because our cloths got a little wet.  We decided to head over to our friends on-campus apartment and chill out there till we warmed up.  This is really where visuals started to kick in.  There was a poster on the wall with a gnome smoking a pipe underneath a small plant.  I could see the smoke rising from his pipe and occasionally he would tap his foot.  Although the gnome looked really sinister I wasnt freaked out by him at all, in fact I was almost comforted.  I wanted nothing more than to join the gnome and share the pipe, which I assumed was full of marijuana.<br>At this point our friend G and L came in.  They had eaten their mushrooms slightly after we did so they were still coming up.  I remarked to G how much I wanted to be the gnome in the poster.  He responded with You are him dude.  This was my first major breakthrough of the trip.  I realized that no matter what we are all connected in the universe.  When I closed my eyes I could see the connection.  It didnt matter if the distance spanned a few inches or a few light years, we were all one in the same.  All our energies flowed together, both everyone in the room and the entire universe.<br>After I came to this realization I decided to just sit there and think for awhile.  At first I drew a blank.  I didnt really know what to think about.  I stared back at gnome poster.  While I thought I wanted to be the gnome it dawned on me I was completely content where I was.  I then looked around the room and realized there was nothing in this world I wanted, I was completely and utterly content.  This was my second major breakthrough, I realized that wanting things was purely selfish and that only brought around suffering.  Yet here I was free from all desires and I felt completely euphoric.  I seriously couldnt be happier.  I laid on the couch just laughing and realizing how good I felt.<br>Then L asked a simple question: she wanted to know if we wanted to smoke a bowl.  Laying there I looked at L and wondered if I did want it.  I realized I didnt, that regardless if I wanted it actually achieving it didnt really matter.  And the feeling of selfishness returned when I contemplated actually wanting the bowl.  At this point I announced to everyone that I couldnt want anything in the world and that the actual word want bothered me when it was used.  I couldnt possibly want anything.<br>Everyone laughed about this, and though I felt a little out of place, I didnt mind the laughter.  I was still so content.  We smoked one bowl and just chilled out for what felt like hours.  We all did different things during our trip and here are just a few in no particular order, because to be honest I completely forgot the order they occurred in:<br>In the gnome picture there was a drop of water barely clinging onto the leaf above the gnomes head.  While all other visuals were occurring, that drop of water refused to fall.  For all of us it would drip down lower but never actually fall.  I looked away for a little bit and notice R holding a large glass of water.   I realized what was needed and told R to dip her finger in the water, place the finger in front of her face over the drop on the leaf.  Doing this R actually saw the drop of water finally fall and we were all relieved.  R commended me on my good idea and thats where I came to my final breakthrough: sharing was the best way for me to escape feelings of selfishness and continue to be content.<br>In the room there was an origami ball that one of the guys had made.  I picked it up and admired the colors.  I saw how glorious it was and knew I had to share it, I passed it along urging everyone to take a look.  Shortly after that I realized that my necklace would have to look really sweet at this point.  I took it off and looked at the center pendant, which was a small mushroom inside a larger glass mushroom, with some really cool dragons on the outside cap.  It looked so amazing that once again I had to share it.  Sharing everything I could just felt amazing.  It itself was a drug and I had to get more.  Yet I knew there would be no negatives to sharing and that made it all the better.<br>At one point G and L left the room.  R, J, and I suddenly heard L yelling at G that she couldnt handle him anymore (she was laughing hysterically so we knew it wasnt serious).  She came into the room grinning and told us if we wanted to know what that was about just to spend 10 minutes with G.  We all sorta looked at each other, and then I decided that G, being the most knowledgeable about shrooms would be the perfect person to hang out with for awhile.<br>I went into the other room and just layed down on the floor next to G.  We discussed the uselessness of language and that to try and communicate what we both were experiencing was useless, we both knew what was going on and too actually talk wasnt needed.  I closed my eyes and got swept into a dark vortex.  I felt like I was falling down a long shaft, yet I wasnt scared at all.  It just felt like I was growing longer and no bottom would come.  I opened my eyes and just played around with opening my eyes and closing them, experiencing the shifts in visuals.  After a few minutes of this I left, knowing that the group at this point was the better choice then to be off doing my own thing.<br>As we began to peak I realized that I just needed to hold something.  Not that anything bad was happening, but I just knew I loved the feeling of holding something.  I grabbed the nearest pillow and just cuddled with it.  I felt so wonderful, nothing could take me away from the cloud I was on.  The pillow wasnt so much a security issue as it was just good to hold on to.  Id say I just sat there holding onto or playing around with the pillow for a good hour.  At that point we were all out of it so we each were doing our own thing.  Some of us were playing with water and some were just staring at the visuals we were experiencing, it was really quite fabulous.<br>As I felt myself comedown I found I wanted to be by myself more.  Not that the group was negative, I just wanted some time to myself.  I took off and laid down in another room and just experienced everything I could.  The music was flowing from the other room and just added to my general well being.<br>The comedown wasnt too rough.  Not till I was completely sober did I really feel any effects.  At that point I felt like I had gone on a camping trip and came back: I was really tired and a little brain dead from all that had happened.  Looking back on it R and I realized that the only thing we had done that day was take a walk and then lay around, but it had felt like we had done so much.<br>After it was all over I was really confused.  I wanted to tell someone about all that had happened, but when I tried to think about it I really couldnt form what had happened into words.  I also didnt want to be around anyone.  Not that I was in a bad mood I just needed some time to think about everything.\n\n\n"
}
