{
 "title": "Nothing Unusual, Just A Blue Sun",
 "author": "MunkyJuce69",
 "citation": "   MunkyJuce69. \"Nothing Unusual, Just A Blue Sun: experience with Morning Glory (Heavenly Blue & Flying Saucers) (ID 60972)\". Erowid.org. Jun 6, 2007. erowid.org/exp/60972",
 "substance": "Morning Glory (Heavenly Blue & Flying Saucers)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "42.5 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 60972",
   "Male",
   " ",
   "Not Given",
   "Jun 6, 2007",
   "Views: 6057",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Here's a biggie, but very juicy in details. I have done morning Glories many times. My friend was a newb, only having done marijuana and alcohol, so I decided to prank him after he wanted to try LSD but couldn't get any by giving him a first time dose of 400 seeds. Bad move. I thought he had small packs with 5-10 seeds apiece, so I tell him about 35 packs will be enough. Only not till I get home I realize each pack contained 65 seeds.\r[Erowid Note:  2275 morning glory seeds is considered an extremely high dose, see morning glory Dose Chart] </p><p>No wonder he thought our teacher was purple and shit was trying to eat him. Me and two friends had to hold him down on the floor for him to clam down! He also tried swimming in the toilet and uncovered the meaning of life, though he wasn't quit able to tell me. His pupils were fucking bigger than his iris!! I stayed up all night praying to God he'd be alright. He just fell into slight psychosis for a few days.</p><p>ANYWAYS...me being the dumbass druggie I am and feeling bad about what I did I decide to do the same myself. In second block at school I decide to pop about 25 packs of heavenly blue and flying saucers seeds.\r[Erowid Note: 1625 morning glory seeds is considered an extremely high dose, see morning glory Dose Chart] </p><p>Shit was alright for awhile. Soon I started getting a 'poisoned' feeling like I get with diphenhydramine HCL. About 45 minutes after consumption (~11:30AM) colors are flashing, I'm having slight talking trouble, tachycardia, same shit as usual. I feel like I'm about to puke my ass out.</p><p>Around 12:30PM after eating lunch I go to ISS - In school suspension. The very reason I picked this day for the experiment as the teacher is a dickshit. About this time my hands are red when I hold them below my heart and white when I hold them above my head. When staying still for a few moments the tips turn blue. My mind was getting very loose, and I was going into deep thought. Seemed similar to an LSD trip. About 1:45PM (T+2:15) walls were purple and occasionally had a watery 'ripple' effect. Like they were crying. I would giggle at the stupidest shit like a fly landing.</p><p>Soon enough the bell rang at 3:40PM and I got on the bus to go home. I felt completely fine and sober. I mean, all that was happening was me seeing light flashes. Along with trees being golden, the sky purplish blue, and grass being cut into perfect 1x1 foot blocks. I get home and go to my room to put on some Hendrix. This shit was awesome. Shit I never really noticed before stood out. Little screeches in the background, whispers, that shit. So the Star Spangled Banner at Woodstock track comes on and this is where the real fun begins. I COULD FUCKING TASTE THE MUSIC!! AND SEE IT TOO!! My senses kept switching over and stuff, I can't explain it at all. Kinda like my tongue was vibrating to the music but I deciphered it as sound.</p><p>Soon that got old and I decide to do one of my favoritest things to do on drugs, have sex. Unfortunately no girls were around and I'm not into guys, so I pull out the 'ol lotion and a wad of tissue. It felt fucking great, like first I could feel every part of my dick and balls and shit. Then it got weird cus I started thinking about how were just animals, wads of cells cooperating for survival. What's the purpose of life? I was sure there was a God, but in a way it didn't make since. Then I snapped back to realty and realized I wasn't jacking it. So I start thinking about my hot girlfriend and then thought about life came back again and how basically she was just a monkey out for survival. Talk about turnoff. If I wanted that I might as well pick up a picture of Barbara Streisand. Fuck that.</p><p>So I turn on the TV and stare at info ads about bodybuilding and how cool it was. But then I was like this is gay, and it's fucking sick how humans will try to take such advantage of others especially when it comes to religion and self-confidence. I think about how much I need to change the channel, but my body was too lost in time to reach for the remote. So I reach for my dick again. This time instead of my dick feeling it the feeling went to my feet, then face and spread to my whole body. Then I started hearing the feeling. I keep spankn the monkey and soon the normal relaxed feeling came over me, just reeeeally extreme, until I splooged, then it felt like my eye was splooging.</p><p>After laying on my bed for what seemed like a few minutes, I look at the clock and its 8 PM!! I go outside and sit in my car and think how lucky I am to be alive and prayed and thanked God for letting me be alive. I noticed my heart flying, I couldn't count straight but estimated about 230 bpm, and it wasn't even beats either, but I paid no heed as I remembered my friend who did about 500 more seeds than me, plus I've been in far more shit than this.</p><p>I look out the window and I see the sun high in the sky, blue at that, and am amazed at God created. Around 9PM I realized it was just the streetlight reflection on the other cars window, but am still marvelled at it. Around 8:30PM I look at my hands and am happy I have them and never realized how big they were or that they could move they way they did. Then I realized I DIDNT KNOW I HAD HANDS!!!! Especially ones that changed colors. I looked in the mirror and saw my pupils were about the size of a pencil eraser. I touched my head and it felt like I had just fallen out the sky and landed unharmed on the ground standing on my feet. My coarse hair felt incredibly soft and long.</p><p>A friend came over, along with two other friends to watch over us, and he and did the equate shit and we smoked some 'dro. Shit started getting scary here. My heart felt like it was about to give up and kept skipping around to really fast to dangerously slow, and it was always uneven, constricted beats. I thought the trees were gnomes out to get me, and I reassured myself that it wasn't like that, the trees were normal, it was the gnomes behind the trees that wanted to eat me. Peoples' voices sounded orgasmic, and I felt really, really happy when hearing music, especially positive trippy shit. My friend was freaking out thinking the devil was out to get him and how the walls were crying (he took like 15 50mg Equates and the weed) and how he seriously needed to get home before 11PM or he'd be in trouble.</p><p>I go inside to get a snack, but was disgusted when I saw the hamburgers, thinking about how meat was animal organs, flesh carved out of a cows side. So I settled for iced tea. I did forget to mention I had cotton mouth like a mother fucker. All day and the weed made it almost unbearable, in fact my spit tasted like blood. So I'm in the car with my friend and 2 watchers, and they're saying I'm good to drive. I'm saying I'm seriously fucked up and can't drive, and they convince me to try, chiefly after one offered to drive, the same kid who drove off the rode when my other car broke and we were pushing it to a service station at like 1mph, but that's another story.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>So I start backing out straight, and they yelling STOP! STOP!! And I'm like chill man! Then I hear a THUNK! And look behind me and saw I hit they're fence, meaning that rather than backing out directly straight, I went at about a 90 degree. And it was at about 30mph when I thought I was going 5. So we chill a little longer and half an hour later (11:45PM) I slowly back out again, this time to success. overall I was alright, I just drove slightly off the rode once.</p><p>When we got back (me and the 2 watchers) at 12:12 AM, I went directly to lay down on the bed. The ceiling was spinning and the popcorn paint was dancing and popping around. Television screens and monitors flashed a lot and had lines running through them, and my body felt like it was 3000pounds yet weightless. Soon enough I passed out and had weird ass dreams I can hardly remember.</p><p>Overall, it was pretty fun. I tripped incredibly hard, and it's a damn good thing I had watchers. The next day I had a small hangover from when I woke up at 9AM to about 11AM, and sporadically saw light flashes and colors for about a week after. Also I couldn't shit for 2 days then it was massive diarreah that was hard to get out.</p>"
}
