{
 "title": "The Scoop",
 "author": "Kmfdm2357",
 "citation": "   Kmfdm2357. \"The Scoop: experience with Buprenorphine with Naloxone (Suboxone) (ID 61038)\". Erowid.org. Oct 10, 2010. erowid.org/exp/61038",
 "substance": "Buprenorphine with Naloxone (Suboxone)",
 "bodyweight": "211 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Buprenorphine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61038",
   "Male",
   " ",
   "Not Given",
   "Oct 10, 2010",
   "Views: 9533",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Here's the scoop on bupe from ernie poop.</p><p>First, I am a junkie, straight up needle-loving loser. Second, I am smarter than your average junk head. I read up on pharmacology and other scientific aspects of drug use. Third, I have been two rehab five times in my short life, and have cross-referenced my experiences with others.</p><p>The first time I took the stuff, I had a modest habit. I could handle an oxy 80, I could handle almost half a bundle of dope (that's 5 bags). I put 8mg suboxone under my toungue, melted for half an hour, and got wasted. I was nodding out while I was standing, for christ's sake. I never barfed, as I had grown such a tolerance to the nausea by then.</p><p>The strange thing about bupe, it's bioavailibility via the sublingual route seems to be subject to change based on environmental factors. It appears that smoking or chewing tobacco before the melt process hinders absorbtion. Also, talking durring administration seems to have a negative affect.</p><p>Suboxone doesn't give me much euphoria. Especially after the first dose. Taking bupe every day makes the euphoria disapear. I was on the clinic, and after the first or second day, my buzz left..Snorting the tablets works, and much much better. I never beleived it until I tried it. I thought the naloxone would make me sick, but it didn't. I prefer to snort this drug, despite it's icky taste.</p><p>Injecting the bupe works. Again, the naloxone does nothing. I've tried it, many many times. I watched others do it first, and could not beleive it. I thought for sure the naloxone would give me withdrawals.\r[[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.] </p><p>Here's a story of what not to do. I was on the bupe clinic for 9 months. At the end, I had relapsed on oxies. I had peddled some bupes away to get drug money, and was short on my pills at the end of the month. I went four full days without the bupe and was sick as hell. I knew that all the bupe was out of my system, so if I took some, the euphoria would come back. I got my refill, and I proceeded to take 5 8mg bupes (snorted one and melted 3) and I mixed it with 10 mg of klonopin. I got really high, so high in fact that I nodded out for the first time in years. I almost puked. I got heartburn from respitory depresstion. I got the opiate hiccups. I could actually feel how shallow my breaths had become, and it scared me.</p><p>I feel as though my use of the drug lead to me having a more viscious habit.</p>"
}
