{
 "title": "Therapy in the Amazon",
 "author": "Energy Cloud",
 "citation": "   Energy Cloud. \"Therapy in the Amazon: experience with Ayahuasca (ID 61083)\". Erowid.org. Feb 28, 2007. erowid.org/exp/61083",
 "substance": "Ayahuasca",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 oz",
   "oral",
   "Ayahuasca",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 61083",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2007",
   "Views: 3815",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My partner and I spent a month in a Shipibo village along the Ucayali River in Peru undergoing 'therapy' for a variety of health issues.  I'll focus only on my own experiences during our stay because to try to detail how it was for both of us would be far too much.</p><p>The first few times that I took Ayahuasca myself I didnt have strong visions, and only light, passing body highs, although I threw up like there was no tomorrow (an experience that was rather enjoyable while under the influence).  My trips would be interrupted by mosquitoes, conflicting energies that I sensed in the people around me, and most prominently my worry for my partner, whos first trip consisted of rolling about on the ground screaming and crying for over an hour.  The Ayahuasca manifested itself to me as a feminine spirit and a definite other that got inside of me and went to work on cleansing the toxins out of my body through vomiting and diarrhea and lots and lots and lots of peeing, not only when I was on it but all the time.  Ive never peed so much in my life.  I saw the plant spirit in many incarnations, most notably as a snail moving through my innards.</p><p>The second half of our stay I had been physically cleansed enough for the plant medicine to reach my mind, and I began to experience powerful visions and intense body highs.  For the most part they were exceedingly personal and dealt with the symbols that had been prevalent over the course of my life that created my poor self-image.  The Ayahuasca seemed rather impatient to me, and would metaphorically slap me in the face telling me to forget forget forget forget forget everything that I had ever, ever been told, and to start completely from scratch, listening to no one and nothing but my instincts, and to trust trust trust trust trust that the universe was going to provide for me and all I had to do was to not fight against its natural course, which spoke through my instincts, and all would be well.  I would get this sense of things while being shown very crystalline images of quite beautiful things for the most part, as my body was smashed into the earth and stretched out and I was left as a formless being.  I swam in the ocean with sea creatures, with the sky as some untouchable, noisy dome above me, pressing down upon me hard, feeling as though I was gestating in the warm womb of the goddess.  </p><p>Even when on my last experience I completely abandoned my body as it was divided into many little pieces and scattered about the room.</p>"
}
