{
 "title": "The Slipping Wheels in My Head",
 "author": "Stoned Rafiki",
 "citation": "   Stoned Rafiki. \"The Slipping Wheels in My Head: experience with Mushrooms - P. cubensis & Cannabis (ID 61099)\". Erowid.org. Oct 7, 2009. erowid.org/exp/61099",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2005",
   "61099",
   "Male",
   " ",
   "Not Given",
   "Oct 7, 2009",
   "1719",
   " "
  ]
 ],
 "report": "<p>Take heed and bear witness to the truths that lie herein. For they are the wisdom gained from a mind that had slipped and made its own track. </p><p>In the lazy summer days after ninth grade I learned that a friend of mine had come into possession of three ounces of Psilocybe Cubensis, and a rather potent strain at that. I had to work at the time I learned it, and after a 6 hour shift I sped quickly down the road in my 92 Oldsmobile (I call it the Grandma model). I rang the bell, he let me in and found he only had one quarter left! I bought the lot of them, he just gave me what was left, it rung up a little over a quarter, 7 ½ grams and only $40. I also bought a small quantity of Pot from him for $20, that was also rather potent.</p><p>I had to plan my trip though, I was no novice at the time. I had read all the literature my grubby little paws could find on hallucinogens in general, but specifically mushrooms. Also I had a wonderful experience with an unknown strain my Sisters friend had come across. Some admirer was hooking her up for free and she sold pot anyway so she hooked me up with an 1/8 free. I swallowed it by myself in some blue Kool-aid (it was all powdery, like the bottom of some HUGE bag). All I can remember is LAUGHING. It seemed hours! Somehow I ended up in my shed smoking pot with my friend, trying to explain why I was laughing so hard, I just told him to call the girl and hook him up. Boy we had fun.</p><p>Anyway, I digress. I waited a few weeks, worked and such, I smoke pot everyday and had for 2 years at the time, so I went through the pot I bought far before I took the shrooms. I was a busser at a local diner. The one with loud clapping and singing for birthdays ,) you know the place. God that job sucked. But I had money to keep pot around. </p><p>One day I got impatient and just ate the shrooms in the woods between my neighbors house and a gas station. BIG MISTAKE: I was sort of nervous, and by myself. I ate about 4.5 grams, more than Id taken in my single previous experience. I sat there for awhile and got the urge to smoke some pot, but my lighter was dead. I walked tot he gas station and as soon as she rung up the lighter I felt the anticipation. Like I was waiting for something bad to happen. It was odd, but I read it was fairly common, even in good experiences.</p><p>I went through the woods again back to my street, but the walk felt wrong somehow, like the woods were no longer my beloved haven but its very spirit was displeased with me. Still I ignored it and walked to my house, I just remember looking back down the empty street, it has a few small hills and the seemed like waves sort of, but stuck, frozen in some static field. UH OH: My mom was home, I sort of had a panic attack, for no reason either, she doesnt mind that I smoke pot, and wouldnt be too pissed about some shrooms. She was a hippie, and did acid a few times, my father taught me not to trust the stuff though. I went inside just long enough to tell her I was going for a walk. I knew she knew something was up, I looked in the mirror and my pupils were huge.</p><p>I floated through my backyard to a neighborhood behind it and sort of walked to a local ghetto where I knew Id find some of my friends. To this day I dont know why I knew Id see them. It was such an off chance. I kept looking behind me the whole walk, like paranoid, like something or someone may be stalking me elusively. I went up and rang the doorbell to the house of a friend who had long since moved out. I rang the bell, thinking the person still lived there, and when someone else answered the door, I remembered they didnt. </p><p>I apologized and the person looked at me in such a way, I just burst out laughing in their face. I quickly ran a ways down the street, realizing what I had done and having another little panic attack, those kept happening though the whole thing, just like my chest was expanding to wide, or it was caving in, or I wasnt breathing right or something. </p><p>I stopped at a corner for some reason and looked up the street, it was a pretty steep hill and something dark was tumbling at me. I thought I was just hallucinating, but it got closer, and I realized it was a person right before it sort of hug tackled me, I NEARLY DIED, I thought I was being mugged in my estranged state, but I soon realized it was my friend! Somehow the cosmos had flung us together at this time. Behind him walked my previous shrooming buddy! It was serindipity sure. I just laughed and tried to tell them I was tripping, but they knew as soon as they saw me, were all sort of hippies. We walked to the nearby forest to smoke some pot. We crossed a field and although I kept freaking out, it was the most beautiful sight of my life. I still remember with sparkling clarity how blue the sky was, each insect, the butterflies and bees, even mosquitos and gnats, and the grass OOOOHH. SOOOO GREEN. </p><p>Smoking pot just intensified my paranoia, and the bowl would wiggle and misshape when I brought it to my face. It was weird, my buddies were sort of awkward, like watching me trip, they knew my experience was going badly, but neither offered help. I had not made a nice home for the shroom spirit, and it didnt like me in this trip. I thought for some reason, when we reached my friends house and got water Id be all better, it was very hot after all. It was a 15 minute walk from where we were and everything was steaming, people seemed to know I was tripping, like everyone was watching me and hated me. I kept thinking when we got to My buddys house, Ill be fine.</p><p>We got in and it seemed ICY cold, his blue plush rug was waving like trees in the wind from 1000 feet up I drank some water, didnt feel better and REALLY started freaking out. I just started saying, I have to go, something is telling me to go, I walked out his door, didnt close it, and I still had the water filled cup in my hand. I made it about 100 feet without notice, ran back, said something like,  I forgot this and threw the water over my head, threw the cup at my friend on the couch and ran away, without shutting the door again.</p><p>A ways down the street I forgot that I had poured the water on my head and another panic attack hit cause it felt like there were two giant boulders on me, one on my chest and one on my back. I finally lifted my shirt in an attempt to breathe, and all anxiety would leave for a moment when the wet shirt wasnt touching my skin. So there I was, walking down the street, with pupils the size of nickels holding my soaking shirt from my quivering body. </p><p>I look like a stoner to begin with, Ive got long curly brown hair that goes in my eyes all the time. My eyes are that washed out green color most of the time, but they turn grey, blue, and when Im on drugs they are green near the pupil and have a blue ring around the edges.</p><p>I got in my house, and immediately ran up to my room, my other haven, and locked the door. I sat on my queen size comfy ass bed and tried to watch good ole Spongebob. I swear I couldnt follow the story line for the life of me. And I tried too, hard. Id just forget what had happened in the previous scene in the midst of re-explaining it in my mind.</p><p>My brain was a separate entity from me. Random thoughts would just pop out, and anything my sane mind would try to come up with would just slip out of my head in mid-thought. I layed and tried not to move but I was so nervous it was impossible, I kept sitting up, or jerking my leg or something. When I would sit still it felt like my muscles were relaxed, but my bones were tense, it was the weirdest sensation.</p><p>My body was light as a feather, then everything was so heavy even my hair and my teeth weighed my face down. I tried to calm down in a cold shower, but I just felt every drop and it seemed I was tripping harder. Somewhere around the time I got out of the shower another one of my friends and his little brother came by. I opened the door and a circular rainbow covered the little guys face and his older brother wanted to see the rest of my mushrooms or something. Man word spreads fast about those things. I just sat down and the cracks in the concrete formed pictures. I showed him my other bag and said I was troubled and had to go in.</p><p>The feelings started to fade, but every time I smoked pot for days I started tripping again. Even though it was horrible, I really learned a lot about myself, and hallucinogens.</p>"
}
