{
 "title": "Does It Work?",
 "author": "Zultone",
 "citation": "Citation:   Zultone. \"Does It Work?: experience with Catnip (ID 61091)\". Erowid.org. Oct 14, 2009. erowid.org/exp/61091",
 "substance": "Catnip",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 cig.",
   "smoked",
   "Catnip",
   "(plant material)",
   "  T+ 6:10",
   "1 glass",
   "oral",
   "Catnip",
   "(plant material)",
   "  T+ 6:40",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 61091",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 14, 2009",
   "Views: 10029",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had heard about this catnip stuff, sounded interesting, and it's cheaper than pot.\r\nPurchased a 2oz container for a few bucks at my local supermarket, a little excited about what could be in store for me, but not expecting much. My mindset most of the day was pretty melancholy, just another day.\r\nWent home, rolled a few joints of it, smoked one before going into work around 11pm.\r\nThe first joint didn't do much except give me the feeling *something* is different, images seemed a little sharper, and a few minutes later I felt like I was coming down off a small pot buzz.\r\nWell, after work, I decided to try making it into a tea. Emptied out a rather large teabag, (made quite a mess) filled it with about 2 or 3 grams of catnip, I don't have a scale so I couldn't measure it, but it was a pretty good bit of 'nip. Used a 24oz glass to pour the water into & make tea. I boiled the water, poured it in the glass, put the teabag in. Let it seep for a few minutes while I made food, since it was too hot to drink, I put some ice in it, along with sugar to sweeten it up, and chugged it at 6:10am\r\n6:15 am - Noticed a calm chilled out feeling, quite nice, it's getting stronger.\r\nGot the idea to write a report while I'm going through this catnip trip, and so I did.\r\nReminds me a bit of chamomile tea.\r\n6:20 am - Effects getting stronger. Noticing a slight headbuzz coming on, feels like something is pulling me up to the top of my room. It's quiet in here, so I'll turn on some nice relaxed music, and finally get started on eating this food. I keep typing slower and slower.\r\n6:30 am - Images almost seem sharper, and lights brighter. I feel a bit up now, but relaxed at the same time, it's an odd feeling. Definately feeling anxious, like the feeling you get after taking acid, before the tripping starts. Feels like SOMETHING is going to happen, but it's not quite happening yet. Maybe it's time to smoke a bowl or two of catnip?\r\n6:40 am - Smoked a bowl of catnip. Effects seems to be intensified only slightly. I feel a slight tingle sensation on the inside of my right arm, warm and chilled out on the rest of my body. Seems like it's taking a lot to get a little bit of effects, but they're not unpleasant at all, kind of nice. I feel pretty lazy now, but at the same time, I feel more up, a bit more anxious.\r\n6:50 am - Started talking to my ex over instant messenger, the conversation went well, and I was pretty talkative. Feeling very bored though. The effects are slowing down, maybe I'm just cruising on them, or I've hit the peak, unsure. My sinuses are nice and clear though. All of my motor functions seem fine, though it's slightly harder to type than usual. I feel a little itchy now, it's a bit annoying.\r\n7:00 am - I feel chilled out, slightly stoned. But it seems like I'm starting to come down now, seems so soon. Wondering if it was all just placebo, or if it's just not strong at all. I think its time for bed.\n\n\n"
}