{
 "title": "A Nasty Drug Gurd Yuk...!",
 "author": "Traven",
 "citation": "   Traven. \"A Nasty Drug Gurd Yuk...!: experience with Caffeine (Coffee, Coca Cola) (ID 61119)\". Erowid.org. Oct 3, 2009. erowid.org/exp/61119",
 "substance": "Caffeine (Coffee, Coca Cola)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Caffeine"
  ]
 ],
 "footer": [
  [
   "19942007",
   "ID: 61119",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2009",
   "Views: 8151",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had two seperate problems with coffee/caffeine. When I was seventeen and eighteen I would drink many cups a day of coffee. I was young and I thought it was a good feeling to have the energy buzz, not to mention trying to avoid the crash that came if I didn't drink. But I noticed I got insomnia and had horrible sleep, and I tried different methods to combat it, including meditation. What worked the most effectively was quitting coffee and caffeine. For five years I didn't drink caffeine or coffee. Then by a fluke in trying to relieve stress, I started drinking caffeinated sodas again.</p><p>I was still aware that I didn't want to become addicted to caffeine, so I limited my intake to about one caffeinated buzz every month. I was able to avoid coffee, because I knew that would hook me the most, so it was either cokes or teas. So this went on for two years. And then I moved to LA, and I was working in the film industry. For whatever reason of conformity I began drinking coffee daily and getting caffeinated daily, too. I was trying to get an 'edge' to help me get a job, because it was swimming with sharks out there. But once again, I noticed that I was getting insomnia. Another thing I noticed was I would get edgier and was easier to aggravate, which was a quality I had seen in my family members all the years I had been caffeine free, and it was a quality I saw which repulsed me and helped me stay away from caffeine. So, in LA I got further and further away from my lucid calmness and more and more into a driven thoughtless machine. </p><p>So, after a couple months I gave up caffeine cold turkey, which made me crash for three weeks. I would sleep for 18 hours a day for three weeks. I couldn't stay awake. I figured it was from the months of insomnia and probably some depression mixed in there as well. So since then I will go for weeks drinking coffee or caffeine, and then maybe last three weeks without it. I have been smart in one respect though, which is I usually don't drink caffeine or esp. coffee, after 12 noon, and almost never drink it after 4pm. I try my hardest not to drink it, it feels gross to be addicted to something. Which is how I would describe my relation to caffeine. I would prefer to be slower, think slower, and have that peace than to drink coffee, always be in motion, always think I am right, etc.</p>"
}
