{
 "title": "True Appreciation",
 "author": "TD",
 "citation": "   TD. \"True Appreciation: experience with Hydrocodone (ID 6114)\". Erowid.org. Feb 6, 2002. erowid.org/exp/6114",
 "substance": "Hydrocodone",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6114",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 6, 2002",
   "59241",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n  It was a saturday night and I was feeling like getting high off of something or another, and since the parents were home, i knew that a nice joint or two was out of the question.  I recently had gotten into Hydrocodone and Codeine as a nice alternative, so I figured one of those would do me up right.  I went to my little pill bottle and looked at the contents.  Noting that I had quite a few 7.5mg Hydrocodone tablets, I decided to pop a few.  I threw down two of them at 10:20pm, and just waited.  I have done Hydrocodone and Codeine(usually 90mg) about 15 times, so I knew just what to expect, except this time was different I knew right away.  </p><p>I considered it the standard that the mellow buzz would kick in at about 30 minutes, but this time I was surfing the web and at about 20 minutes I all of a sudden felt like I was reclining in my chair like it was an automatic dentist's chair.  I was very pleased, so I just sat back and watched the screen saver.  I very soon lost all knowledge of my limb's presence and the sore throat I was experiencing was completely gone.  At 10:50-11:20 came the peak. It was unlike any opiate experience I have ever had.  I got an intense 'strobing' effect in my vision like from pot, but without any paranoia or mind-clouding at all.  I certainly wouldn't want to do any important thinking (or driving), but if needed I could confront my parents I think no problem.  I felt absolutely perfect and warm, and the good buzz lasted until 12:30am.  </p><p>The only problem is, you don't come down slow at all you just all of a sudden realize it's gone.  Kind of a bummer but well worth it.  This is by far one of the great drugs. I see some people on here taking extremely high doses (I've seen 37.5mg and up)  and I don't think it is necessary for me at all.  15-20mg is enough to get me feeling great without feeling like a glutton.</p>"
}
