{
 "title": "Relief from IBS",
 "author": "android70",
 "citation": "   android70. \"Relief from IBS: experience with Coca (teabags) (ID 61167)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61167",
 "substance": "Coca (teabags)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Coca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 61167",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2007",
   "Views: 15243",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRoughly a year ago I purchased a box of pure natural coca leaf tea bags from a respectable company in Peru. I was pleased that the result was a pleasant, energized feeling without any feeling of being under the influence of any drugs. Indeed, the feeling was much better than caffeine without jitteriness or upset stomach. <br>Over time, I typically drank 2 to 4 tea bags (2-4 grams) per day and noticed several health benefits. I fruequently suffer heaches, fatigue, and painful bowel syndrome including IBS and diverticulitis. What I noticed afeter several days of use was that my symptoms of discomfort were gone. I eventually finished the box of tea and suffered no cravings or rebound irritability. I felt fine, so I forgot about the coca tea. Obviously this tea had no addictive effect whatsoever for me, although there is supposd to be a very small amount of natural cocaine alkaloid in the tea. <br>This year I again had a severe case of diverticulitis treated with heavy duty antibiotics and prescribed narcotic painkillers. Although I minimized the dosage of the vicodin to last a while, when I ran out of Vicodin I became irritable, with headaches and moderate to severe Irritable bowel Syndrome, which I assure anyone who has never experienced, can be excruciating. Instead of getting more vicodin, I decided to take regular tylenol and order coca tea once again. <br>Two days ago I received the tea bags and began with 3 bags (3 grams coca leaf) followed 5 hours later with two tea bags. I followed this again today and my internal pain is 90% relieved and I feel less irritable and less exhausted. It seems obvious to me that coca leaf tea in its natural state is safer and more beneficial than coffee, tea, or even Vicodin for that matter. This herbal medicine ought to be more fully respected and seen as a completely different substance from the purified drug cocaine.\n\n\n"
}
