{
 "title": "Irritating Twitches",
 "author": "Zorro",
 "citation": "   Zorro. \"Irritating Twitches: experience with Yerba Mate (ID 61188)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61188",
 "substance": "Yerba Mate",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Yerba Mate",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61188",
   "Male",
   " ",
   "Not Given",
   "Mar 6, 2007",
   "8513",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ive been drinking Maté for about a year now, as a better alternative for coffee (which gave me stomachaches). Browsing online, as I often do, I read about another way to prepare my mate, grinding it and pouring it through a coffee filter.</p><p>I had about five doses left, so I grinded it all up, put it in a mug, which was filled for about a quarter with the powder, added boiling water and left it to soak for 5-10 minutes and I poured it through the coffee filter. The tea was brown instead of green-brownish and smelled very strong. I drank it all up in about a minute or so, five minutes later I felt that the caffeine started to have its effects on me. What struck me as odd was that I didnt get a shaky sensation as I usually do, not a lot of physical energy, but my fingertips and toes started to get numb. My heart rate didnt increase as I expected, but the strange thing was that I started to have muscular spasms: painful cramps in my shoulders and lower back as I stretched out, as I walked up the stairs my legs hurt I cant think of any other reason why this happened, but the mate. </p><p>Ive never believed people claiming that they got high on mate, but Im having second thoughts, since I felt some tickles in my toes and fingers, felt relaxed, yet alert and awake. I wasnt really high as in another state of mind, or extremely happy, but I wasnt quite myself either. Time did seem to pass slower, and I was more productive. </p><p>I guess all I can say is that grinded maté really is more potent, but if I take to much, there is a downside.</p><p>On the plus side, compared to coffee, a mate overdose doesnt make me feel sick, nervous, sweaty and trembling, if you have the choice, choose wise, choose mate!</p>"
}
