{
 "title": "A Million Laughing Heads",
 "author": "Mitch P",
 "citation": "   Mitch P. \"A Million Laughing Heads: experience with Sertraline, Cannabis & Nitrous Oxide (ID 61226)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61226",
 "substance": "Sertraline, Cannabis & Nitrous Oxide",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Pharms - Sertraline",
   "(daily)",
   " ",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 61226",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 6, 2007",
   "Views: 13769",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My name is Mitch.  I was introduced to mind altering substances when I was 14.  I had not been introduced to anything besides marijuana until I was 16.  I am writing this to warn readers of the dangers of mixing drugs with anti-depressants and taking anti-depressants in general.  Let it be known that these drugs have different effects on different people.  Here goes......  Me and my friends had been experimenting with various drugs throughout high school.  We all had done nitrous several times before this particular night.  In the days before this night, I had been sent to see a counselor for depression.  I was high constantly and not eating or sleeping, so my parents sent me there.  </p><p>The counselor advised that I start taking a prescription anti-depressant.  I was against it, but my parents were for it, and to my everlasting regret, I agreed.....to make them happy.  I was prescribed Zoloft.......I now tend to refer to it as lucifer.  Nothing changed in the immediate days after I began ingesting the Zoloft, but when I started smoking pot with it, everything changed.  The first time I realized that the combination was messing with my mind, I was sitting in my room alone.  I had smoked my usual four or five bowls and got ready for bed.  My television was on and I could see all of the lights blinking on my walls like strobe lights (this is where it gets weird, bear with me).  I looked over at my door and it started getting smaller and bigger (I was very disturbed at seeing this).  I watched my door for an hour or so until the trip wore off (if you would call that a trip). </p><p>Little did I know, I was soon to experience a trip that I had never heard of or read about in my life.  These mild hallucinations went on for a few weeks and I continued using and experimenting while on the Zoloft.  Here is where the Nitrous comes into play.  My freind bought me a box of whippits (nitrous cartriges) for my 17th birthday and we started inhaling them at his house.  We left his house to go to my house because my parents were gone.  There were four of us at my house in the downstairs livingroom.  My freind cracked me a whippit and I inhaled it.  This first one was like any other nitrous trip,  short and very cool.  The lights swirled around me and I felt a happiness that I had not felt before.  After the first round of whippits, we all went and smoked a few bowls (we were all very heavy smokers).  After getting high, we decided to take some more nitrous.  We all filled our own balloons and turned on some Pink Floyd or something.  I remeber watching as my friend inhaled and exhaled into the balloon. I also remember me being the last one to put down the balloon. (We would breathe in and out of the balloon to increase the effect, very dangerous).  </p><p>That's when it hit me.  I was focusing on my friend laughing and suddenly his head separated from his body. His head then turned into a million heads and they were all floating around me laughing. I remember thinking that I had finally pushed it too far.  That I had died and gone to hell. I had no body and felt nothing.  All that made up my world were these floating heads, laughing at me.  The fear that I felt was indescribable.  I would not wish this feeling on anyone.  It was a life changing fear....  I finally came down (after what seemed like an hour in hell).  I felt fine for the first 20 seconds or so after it was over. But then I felt the most radical sickness that I have ever felt.  I felt like every bit of energy and water and thought had been ripped out of me.  I felt like my soul was gone and that I would never be the same.  My other freind went and got me a glass of water.  This didn't help much.  The flower design on the carpet was blooming and the fireplace was opening and closing.  I was experiencing paranoid insanity firsthand and I hated every second of it.  I couldn't sleep that night.  I remember feeling like I was floating out of the room every time I closed my eyes.  The next few days were like a horrible hangover with a bad trip thrown in the mix.  </p><p>I have been in a haze ever since and I think it was because of the Zoloft.  I don't recommend taking any anti-depressant if you use any other drugs.  Nitrous in particular.  But that is just me...... fair warning!</p>"
}
