{
 "title": "The Perfect Combo",
 "author": "Jake",
 "citation": "   Jake. \"The Perfect Combo: experience with Tramadol, Buprenorphine & Naloxone (ID 61286)\". Erowid.org. Jun 27, 2007. erowid.org/exp/61286",
 "substance": "Tramadol, Buprenorphine & Naloxone",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 mg",
   "sublingual",
   "Naloxone",
   "(pill / tablet)",
   "  T+ 0:00",
   "8.0 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(pill / tablet)",
   "  T+ 0:30",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 8:00",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 8:00",
   "8.0 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(pill / tablet)",
   "  T+ 8:00",
   "2.0 mg",
   "sublingual",
   "Naloxone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 61286",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 27, 2007",
   "Views: 39884",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am relatively experienced with all drugs(save hallucinogens). I have been able to control my use of all the drugs I have used except opiates. I have been addicted to opiates for 7 years now. Because of my addictions I decided to try Suboxone (buprenorphine and naloxone) to help me with my addiction. It has been a lifesaver! I no longer have the overwhelming desire to use opiates on daily basis. </p><p>However, I have tried to take painkillers like oxycodone and kratom with very little results while on suboxone. I have found a substance that does seem to work while taking suboxone and that is tramadol. For some reason the suboxone does not block the tramadol from working. The high I get from the combination of the two drugs is quite euphoric! I take 8mgs of suboxone in the morning at about 9:00 followed by 200mgs of tramadol 30 minutes later. One hour later I am in heaven!</p><p>The two drugs seem to work so well together. I am taking high doses of each of these drugs so I have a very high tolerance. The high doesn't seem to diminish very much day after day either! The high will last until about 2:00 in the afternoon. At that time I feel a little tired. I usually redose at about 5:00pm with slightly weaker results.</p>"
}
