{
 "title": "Not Nearly as Mindblowing as I Thought",
 "author": "Dolores Haze",
 "citation": "   Dolores Haze. \"Not Nearly as Mindblowing as I Thought: experience with Ecstasy (ID 6128)\". Erowid.org. Apr 10, 2001. erowid.org/exp/6128",
 "substance": "Ecstasy",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6128",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2001",
   "Views: 107437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n[Erowid Note: to date, heroin has seldom, if ever, been identified as an ecstasy adulterant, as alluded to in this otherwise well written report]<br>I had been wanting to try ecstasy since I was 17, but never quite got around to it. I'm now 25, a grad student and teacher. For information, I have never done any drug except for pot and nitrous. A friend of mine does E quite regularly. She was coming to visit and had two tablets of MDMA (rolling stones) for me and my fiance. She likes pills with small percentages of heroin in them, but I told her I wanted pills as pure as possible. She tried the ones she gave us before we did them, and said they were very pure. My fiance and I were very nervous before we took the pills. I thought that there would be a sudden head rush, and that it might be a very intense experience. I'd heard that people got nauseous and just felt like it was 'too much' when the effects were coming on. In reality, it was nothing like this. We made sure our living room was dark, lit aroma therapy candles, put on music..it was a calming environment. At 9:45 my fiance and I each took one pill. My friend and her boyfriend split another pill and each took another different one (a green one which had some heroin in it). <br>I didn't really begin to feel anything for about 45 minutes to an hour. We just hung out and played a game while waiting for the effects to begin. About 45 minutes later I began to feel a little jittery and yet relaxed at the same time. My friend encouraged me to stand up and move around, and this did feel nice. I felt a little dizzy and movement just felt...fun. I petted our cats and smoked. My friend suggested menthol cigarettes, saying that non menthols just wouldn't taste good. She was right. They didn't. The menthol just tasted nice in my mouth. I also chewed a lot of peppermint gum and drank water. We just sat around and talked.<br>About the effects that I'd heard of...I heard that touch would just feel FANTASTIC! I heard that I would feel incredibly loving and just feel at peace with myself-like I could see what was wrong in my life and just accept it and move on. I also expected to feel sexual in some way. Well, touch did feel nice. I gave my fiance a backrub, and I did enjoy the way his skin felt. He gave me one, and it was also enjoyable. His touch felt warm. I did feel comfortable with my friend and her boyfriend. I felt open, but not extremely open. At one point we were sharing embarrassing stories, and I was conscious of the fact that I could censor some of my thoughts. I felt nice, but the experience was not nearly as intense as I expected. In general, I felt mellow and relaxed. We all talked a great deal about going somewhere or doing something, but no one really had the energy or desire to actually go somewhere or do something. The farthest we got was walking around our apartment looking for nice things to touch and play with. I took several sweaters out just to touch them. I also did not really feel sexual at all. I felt totally asexual, actually, just enjoying being a human being. I would compare the feelings to a nice beer buzz without feeling unable to think or move clearly. My fiance wanted  chocolate at one point, and really seemed to like the taste, but I desired no food whatsoever. We talked about various kinds of drinks we might like, and when someone mentioned milk, this seemed like the most disgusting thing in the world to us all. <br>Before my fiance and I went to sleep, as the effects were wearing off, we all smoked some kind bud, which definitely seemed to bring back the effects. I got very silly, and I was not sure if this was because of the pot or the ecstasy or both. This was about 2:30 in the morning. (We took the pills at 9:45, so the effects lasted about 4 hours for us.) We went into our bedroom, got into bed and started to touch one another, and then we did feel sort of 'sexual.' We really enjoyed the way each other's skin felt, and we started to mess around, and soon had sex. But this seemed to be a rather pointless exercise (sort of) because though the sex felt good, there was no way either one of us was going to have an orgasm. I'm still not sure I really felt aroused. Touching just felt good. Not really arousing like on pot, just warm and pleasant on the skin. I liked the closeness and intimacy. Eventually we just stopped and went to sleep. <br>I'm writing this the day after, and so far I feel no after-effects whatsoever. No jaw clenching (I did chew a lot of gum.) No back pain. No nasty feelings or depression. My friend says that I may expect some tomorrow. I noticed no side effects when on ecstasy except that I had to pee a lot. I probably peed 6 times in 4-5 hours. I drank a lot of water to prevent dehydration, so maybe that's why. There must be a long line for the bathrooms at raves!<br>Overall, I would have to say that though the experience was pleasant, I still much prefer pot. I would not really be tempted to try ecstasy again. It was not the 'life changing' experience I thought it would be. I did not really learn anything about myself or my friends. Though I was lucid, I had no real desire to think intensly about anything. Even talking for too long about serious things seemed to bore me. I did feel close to my friends and my fiance, but I usually feel close to them. I simply was not judgemental. I felt eager to please them and make them happy. I found E to be a very mellow relaxing experience, but I enjoy the sensual intensity that pot provides to be much more enjoyable. It makes touching much more pleasurable than E did. <br>I just wanted to write this, because I've been looking at these experiences while researching E, and I wanted to contribute my own experience so others might benefit. My friend says that any experience on E is different because of different circumstances. She seemed to have a much more powerful roll than me, she said because of the contents of her pill.\n\n\n"
}
