{
 "title": "It's Underrated",
 "author": "jeremi",
 "citation": "   jeremi. \"It's Underrated: experience with H.B. Woodrose (ID 61349)\". Erowid.org. Apr 17, 2008. erowid.org/exp/61349",
 "substance": "H.B. Woodrose",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "8 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "2007",
   "61349",
   "Male",
   " ",
   "Not Given",
   "Apr 17, 2008",
   "3143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>All my life has corolated to last night, it felt like my whole life reached a crescendo last night, cacaphony became harmony.  The most intense experience in my life.  Like LSD, but I feel much cleaner.  This drug is very well balanced which I loved, I had to fight for the rewards I got.  I felt completely balanced, my life was made up of extreme lows and highs, the highs were soo beautiful, I felt like I was enlightened and I would disapear if I so wanted to.  </p><p>The onset was 4 hours for me, extreme body at first, we also hiked for those four hours, got rid of all the poisoned, I though I would fall asleep in snow after I threw up because I though it was the end of the trip, little did I know it was a mountain of ever increasing peaks, wow. We got back to an apartment and layed on beds until 9 am, where it was pure visual and out of body travels.  I cannot emphasize the strange ever rising aspect of this drug, being very ambivalent at first, thinking only 8 seeds, whats the big deal, I was not expecting the most powerful experience of my whole life's existence. I have only done this dose, but if felt very high, although not out of control, but very intense, the right amount for a powerful experience.  The poison was hard to deal with, I drank a lot of water, so much that I though I was drowning myself.  We came out of this being more clear and refreshed then ever before, a true purge.  Now having slept and woken up at 5 pm, I feel better and ready to do good deeds and become an active part in changing the word.</p>"
}
