{
 "title": "The Symbiotic Relationship Between the Physical, the Aural and the Visual",
 "author": "Joel",
 "citation": "   Joel. \"The Symbiotic Relationship Between the Physical, the Aural and the Visual: experience with 2C-B, Ketamine & Cannabis (ID 61368)\". Erowid.org. Apr 12, 2007. erowid.org/exp/61368",
 "substance": "2C-B, Ketamine & Cannabis",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "2C-B",
   "(pill / tablet)",
   " ",
   "250 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   " ",
   "200 mg",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 61368",
   "Male",
   " ",
   "Not Given",
   "Apr 12, 2007",
   "Views: 9741",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is the third time I have taken 2CB and it came in pill form as opposed to the stronger capsule form of previous experiences. The effect was not nearly as intense as on other occasions, and the predominant sensation was one of nausea with subtle visuals, i.e. shimmering colour hue and slight kaleidoscopic patterns appearing 'on top of' rather than 'inside' objects (as in lsd / psilocybin etc). Feeling somewhat unfulfilled, I administered a substantial line of ketamine (perhaps 1/10g), smoked a couple of cannabis joints and tripped out nicely watching Braindead.</p><p>My out of body experience, however, occurred whilst in bed about 5hours after ingesting the 2CB. In bed I snorted a large line of ketamine and about 5 minutes later became aware of a tinnitus-like noise in my ears, which could have been there a while but only entered my consciousness at this moment. The ringing then began to fluctuate musically, creating the most intense and beautiful, sometimes frightening, noises imaginable. Accompanying this, were equally intense fluctuating illuminations, starting as flashing waves or sheets of light, and eventually transforming into vivid moving images of everything and nothing.</p><p>I have experienced these sensations before, but this time I became aware of my body moving, when it was actually stationary. I encouraged these feelings and allowed myself to suspend reality becoming a floating consciousness, free to travel where and when I wished. The defining characteristic of this trip was the control I had over my own sensations. I could will my self to fall infinite distances at speeds so incredible that I felt my flesh being ripped, almost dissolved, off my body,but not in a frightening way, as I retained the ability to instigate or cease such motions. I can only compare the physical sensations with those of experiencing extreme g-force, so my lay-analysis would be that I had somehow interrupted the nerve endings so that they no longer responded to external stimuli, but to my conscious will.</p><p>As much as I want to share as much as I can of my experience, I dont want to bore you, and I am bound by the limitations of the English language in my descriptions. I most definitely felt I had gone somewhere unusual: I have had similar experiences but the amount of control I had this time meant I was able to actively partake in my journeys rather than simply view them as some kind of passenger might. </p><p>One particular vision/sensation, which was more fun and entertaining than mystical and divine, was watching  and encouraging - the walls of my bedroom disintegrate, leaving the frame of my room suspended in an infinite void. Using my imagination I was able to make myself think my whole room was swinging, pendulum-like, in massive sweeping circles, my body felt as if this was actually happening. At one point, a feeling not dissimilar to that of sand giving way beneath ones feet at the sea-side became apparent inside my back and legs. It actually felt as though I was dissolving into my bed until I was nothing but pure consciousness.</p><p>What made the whole experience (around 3 hours of going in and out of different trips, with ketamine top-ups) special was the symbiotic relationship between the physical, the aural and the visual. The music would change dramatically if I opened my eyes, or if I decided to move in a different direction. The visuals would alter if some external sound entered my consciousness, and might send me flying of at the speed of light in the opposite direction. I remember opening and closing my eyes to hear the music dramatically speed up with eyes open and slow to a triphop pace when closed. </p><p>Felt fine the next day, though slightly withdrawn and thoughtful. If anyone has similar experiences or know different techniques for this I would greatly value their views.</p><p>Age 24</p>"
}
