{
 "title": "First Good Story",
 "author": "Tom",
 "citation": "   Tom. \"First Good Story: experience with GBL  (ID 61374)\". Erowid.org. Nov 3, 2007. erowid.org/exp/61374",
 "substance": "GBL ",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "1.4 ml",
   "oral",
   "GBL",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61374",
   "Male",
   " ",
   "Not Given",
   "Nov 3, 2007",
   "Views: 13134",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Preface:</p><p>Last night I had 1.5 gelcaps (1.1ml) of GBL at approx 18:30, with a full stomach (felt full, couldn't eat any more food). I felt it, after about 30 mins, but it was very mild and not what I would consider fun as such, although it was by no means bad.</p><p>Tonight:</p><p>I shall do my best to disregard placebo, but this may be difficult</p><p>T + 0 - 09:44 - 2 gelcaps swallowed, no food eaten since 18:00 yesterday.</p><p>T + 3 - 09:47 - feel slight more relaxed, cant be sure its nothing more than placebo though.</p><p>T + 9 - 09:56 - not feeling it as expected, slightly disappointed.</p><p>T + 12 - 09:58 - feel mentally a bit slowed, and a *tiny* bit dizzy, nothing amazing though, not like I was last time I done 2 caps (bouncing around like a mad man), got some tunes on which hopefully will help.</p><p>T + 13 - 09:59 - here it comes, I think, really feeling this music now and feeling nice and dancey. I'd like to say at this point I mentally feel like Ive had about 5 pints as far as general happiness and loss of inhibitions go, but theres none of the usual alcohol fuzziness, I feel as if I could sit and do some work fine. Vision is a little bit retarted, I can focus fine but it seems to take my brain a *tiny* bit longer to register what things are and my eyes feel a bit heavy.</p><p>T + 16 - 10:01 - feeling it a bit more intensely now, feels more like 6-7 pints, but still with the mental clarity. Basically, think of it as being drunk but with the bad things (blurred vision/difficulty focusing/mental fuzziness/arrogance) greatly reduced. Of course I can feel the bad effects that alcohol would give you, but VERY mildly, it seems GBL gives me 100% of the good things of alcohol at any set dosage and 20% of the bad ones. This is not to say GBL is all fun and games though, the dose-response curve is very steep and if I had taken 4 gelcaps chances are I'd be out cold right now.</p><p>T + 19 - 10:04 - Feeling more dancey and happier now, nice euphoria and general 'life is really good' attitude, I love GBL, gonna let it do its thing now. Oh, one thing I'd like to add - GBL can make some people vomit, the taste of the chemical or the irritation it causes to your stomach can make you dry heave or full on vomit, I am lucky though and I have never even felt nauseous (slight stomach discomfort maybe) on GBL with a full stomach, but I have a friend who projectile vomits on it sometimes. I think of GBL as a mix of the good things of alcohol + the good things of caffeine, but better.</p><p>T + 23 - 10:09 - Eddie Halliwell is r0x0ring my panties at the moment, got the tunes up loud and headbanging to the tuneage, loving it :), a plus 1.8 on the schulgin scale, not quite as intense as a 2, cos theres no adventure as such, but I can feel it right now, but I could continue with a normal day's plans if I wanted to (expect drive of course). I feel as if I could drive, but I know I couldnt, not quite like alcohol in that respect where I imagine enough to feel this :) would make me pretty certain driving would be a very stupid thing to do.</p><p>T + 31 10:17 - Nothing new to report, feel the effects in waves, currently not feeling it too much, just worried GBL will be banned soon, I hate this government :(, planning on buying a litre or 2 with a friend in September, just hope its still available.</p><p>T + 50 10:35 - Feel pretty much back to normal now, vision is still a *tiny* bit drunk like, but I think its worn off pretty much</p><p>12:19 - meh all gone now, it was good, but Ive had better GBL experiences.</p><p>As you can probably tell by all my waffling, the GBL was making me very talkative</p><p>Would like to add this:</p><p>Today I had 2 gelcaps (1.7ml) with a nearly empty stomach and had a wonderful time, focusing was hard, I was wobbly and speech was slurred, but I felt fully in control and mentally fine, with a nice dose of euphoria. I have had enough to be knocked out cold before and when I woke up I felt fine. It seems that if GBL/GHB is used responsibly it can be a fantastic social drug, I have ordered larger size 000 caps and hope to try 1.5 when they arrive.</p>"
}
