{
 "title": "A Burning Nose",
 "author": "Eratosthene",
 "citation": "   Eratosthene. \"A Burning Nose: experience with Piperazines - MeOPP (ID 61380)\". Erowid.org. Mar 12, 2007. erowid.org/exp/61380",
 "substance": "Piperazines - MeOPP",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Piperazines - MeOPP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 61380",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 12, 2007",
   "Views: 7599",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active as such a small dose, eyeballing is particularly unwise. See related article\r\nI decided it was worth a try to procure a bit from an online retailer and try it out. I originally ordered 1 gram of MCPP from a site in New Zealand, deeming that compound the best bang for the buck. After three months of waiting, and pretty much giving up hope that I'd ever see my precious little baggie of powder, a package finally arrived. I'm not sure what happened, but they ended up sending me 5 grams of MeOPP instead.\r\nNot having a scale, I divided the entire bag up into gelcaps, which after calculations ended up being about 150mg per cap, with a little left over. Curious to see the effect of snorting it, and wanting to get the experience started quickly, I lined up a little (estimated about 50mg) and proceeded to inhale. About half the line went into each nostril.\r\nOh my God, it burned worse than any substance I've ever put up my nose, and there's been more than a few. Seriously, I teared up immediately, and every time I inhaled it burned more. There was no way I was gonna get an active dose in my body this way, so after an hour or so of waiting, I downed one of the caps.\r\nMy friends and I were sitting around smoking some good hydro, and about an hour passed before I really felt anything above and beyond the weed high. Initially I felt kind of speedy, like I just drank four or five cups of coffee. My hands were quite shaky, and this persisted the entire length of the experience. The come up was in waves, not unlike MDMA, but much milder. I also became alternately hot and cold, with each wave bringing a change in temperature.\r\nBy about the hour and a half mark, it seemed to plateau, and I settled into a nice, comfy feeling of slightly speedy calmness. That sounds a little contradictory, but it's the best description I can think of. My head and body were buzzing, and I was definitely not tired, but it felt really good to just lay down with a blanket. My pupils were a little dilated, and stayed that way for an hour or so.\r\nAt about two hours I could feel the effects waning, but it was a very slow, graceful comedown, not at all like the abrupt crash I usually feel with stimulants. I was pretty much baseline after about four hours. Peak rating was a solid +, maybe ++. I feel like perhaps it's just a dosage related issue, and I plan to try the substance again at 300mg to see if the effects are heightened.\n\n\n"
}
