{
 "title": "Big Things Come in Tiny Packages",
 "author": "Drug Bucket",
 "citation": "   Drug Bucket. \"Big Things Come in Tiny Packages: experience with Oxymorphone (ID 61473)\". Erowid.org. Mar 27, 2007. erowid.org/exp/61473",
 "substance": "Oxymorphone",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Oxymorphone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 61473",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 27, 2007",
   "Views: 18999",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend offered me this pill I never heard of before. He said it was a painkiller, which I love so I happily accepted it. It was a very small pill, about the size of an oxycottin. It also had a lime green coating on it. </p><p>At about 2 in the afternoon, I crushed it up and snorted it. I immediatley felt a head rush, not much of a head rush but it was significant enough to know I was gonna have a good time. Approximately 20 minutes later my body felt very good like I was floating, very much like a heroin high. I felt very blissful and euphoric. I was very itchy the whole time it lasted. About an hour after I ingested the pill, my eyes began to feel heavy. I wasnt quite nodding off, just sleepy I guess. The body feeling kept progressing as time went on. Out of nowhere my stomach felt upset for a few minutes and I puked, very very little though, but once it came up I felt great. Puking didnt decrease my high one bit, it actually made it better. About an hour after that I was in the car going for a ride and I started to nod off a lot. I couldnt keep my head up and when I did I would have double vision untill I shook it off, but it would start again once I could see straight so I just kept my eyes closed, mind you I was still feeling euphoria. I then passed out at about 10pm sitting at my computer. Lol. It was very fun and I will definitely be doing it again.</p>"
}
