{
 "title": "Purple Vision for a Good Time",
 "author": "Sir Moses",
 "citation": "Citation:   Sir Moses. \"Purple Vision for a Good Time: experience with Sildenafil (Viagra) (ID 61480)\". Erowid.org. Jun 20, 2007. erowid.org/exp/61480",
 "substance": "Sildenafil (Viagra)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Olanzapine",
   "(daily)",
   " ",
   "200 mg",
   "oral",
   "Pharmaceuticals",
   "(daily)",
   " ",
   "20 mg",
   "oral",
   "Amphetamines",
   "(daily)",
   " ",
   "200 mg",
   "oral",
   "Pharms - Sildenafil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2004",
   "ID: 61480",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 20, 2007",
   "Views: 16688",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirst, a little background info on me. I am a 22 year old male. When I first used Viagra I was 19. I am taking the following prescription medications. Zyprexa 20mg, Minocycline 200mg, and Adderall XR 20mg, a day. Through some research and talking with my  psychiatrist and therapist, I have come to suspect that the Zyprexa is the culprit for causing my Erectile Dysfunction and Decreased Libido.  From what I can tell. \r\nFrom personal experience, I can say that other drugs that are also used for treatment of Erectile Dysfunction do not work as well or as fast. For example Cialis. I took cialis one day, waited a half an hour, then two hours and I wasnt even able get an erection after physical stimulation. Viagra has worked the best for me. After taking two 100mg Viagra pills, I was able to achieve and maintain an erection when physical stimulation was used. This affect with me usually takes anywhere from fifteen minutes to a half hour. \r\nAfter the stimulation was stopped, my erection went away in about five minutes, and didnt come back until sexual stimulation was applied again. This happened for a good four hours. So for four hours I was able to have sex with little time in between to recuperate. I must add, along with the physical part of it helping with my erection, it also gave me greater sexual appetite, and sex was more enjoyable and pleasure was increased. I have used Viagra many times since then with the same affects and benefits.\n\n\n"
}