{
 "title": "There's no escape",
 "author": "SS24",
 "citation": "   SS24. \"There's no escape: experience with Mushrooms (Psilocybin) (ID 61492)\". Erowid.org. Apr 8, 2009. erowid.org/exp/61492",
 "substance": "Mushrooms (Psilocybin)",
 "bodyweight": "196 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 6:00",
   "1 glass",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 61492",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 8, 2009",
   "Views: 2714",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n'M' and I decided after such a fun experience last time, we should try shrooms again, but this time do a whole 8th each. We bought a half gallon oforange juice, picked up the drugs, then headed to 'M's house like last time. With a smile, we downed the drugs and chugged our drinks. Remembering how long it takes to kick in, we decided to go for a walk. Not wanting to get too high too far away from 'M's house, I felt a little uneasy, but shrugged it off.<br>We walked until we came to a shady boondock apartment complex. Around twenty minutes had passed, and all the talking from the apartments seemed to be very loud and echoing all around me. 'M' seemed to be beginning to feel his trip too because he started laughing and saying how we should head back Now! With a laugh, we ran all the way home, and on the way I began to notice a bright shining on everything around me. A yeild sign looked like it was glowing, and this strong an effect so early startled me a little, but I pushed that negativity away and we settled into 'M's room.<br>I pulled out my iPod with a playlist that was made for a trip, but the scrolling text on my iPod began to look strange. It appeared similiar to the language of Predator's in the film. The thin wire from the headphones felt strange against my arm and neck - almost like chewed gum. I felt it sticking all over me. I sat down on the floor and felt the hairy rug with my hands, but everything felt sticky. I felt like there were loose hairs on my lips and tongue so i kept picking at them. 'M' seemed to be enjoying himself on his computer, and the disconnection between us made me feel very alone. I had a horrible feeling that things were going to get way worse since barely an hour had gone by and effects this severe were beginning. Fear ripped at my chest and I felt that my only escape was to try to resist it.<br>Big mistake. I held on to my ego and my sanity with clenched teeth and closed eyes, and in the dark I began to see patterns. Subtle at first but then extremely vivid. Fractal shapes and colors spun around infinity and flashes of objects appeared. I saw a man in a ringleader outfit beckoning me to go deeper into the wormhole. Strange creatures and faces appeared but then melted into new ones, most of which were startling and threatening. I opened my eyes but the bed I had been in was flowing and the ceiling looked a like a huge smooth crater. It pulsated and churned while dripping sounds and colors onto me and the bed, which now looked wide and infinite. <br>'M' was talking to me but he sounded miles away. Every time I blinked I was sucked into that dark world again, only for a moment, but it lagged into my open eye visions. 'M' jumped onto the bed and started playing Grand Theft Auto 3. He offered me the controller, but I couldn't understand what it was, or where I was. I poked it and noticed I could control my body, but then I didn't understand what my body was, or why I had one. I then realized I was a human, but I couldn't understand why, or what my name was. I was absolutely terrified by this. I tried despirately to sleep, and finally I drifted into a constant nightmare. The closed eye visions became reality and I was pulled, pushed, and thrown through a world of colors, shapes, and strange creatures. I was spoken to, but I couldn't understand. I would be me in this world, but then a moment later I'd be the ground, or the wall, or the air. Neon lights flashed and zipped by, all while I was still moving through this fractal tunnel.<br>The audio of the game 'M' was playing filled my world, and the shouts, songs, and hum of cars sped up, slowed down, stretching and contorting all around and within me. 'M' would talk to me but his words were jumbled and didn't feel as if they were directed to me. Occasionally I'd drift back into a very twisted and warped normal reality, in which I'd say a word or two that I can't remember to 'M', and interact with him or an object briefly, but the constant terror and loss of sanity was too much for me. I'd fall back into the bed and be sucked back into the insanity.<br>'M' sprayed a cologne in the air and the smell became overpowering and I felt like I couldn't escape it. I then realized that despite losing myself completely, one part of me remained, the voice that said to KEEP BREATHING. I had been focusing on my breathing the entire time. When I fell back into the trip world, I lost touch with my body and couldn't tell if I was breathing.<br>My halucinations became more vivid and I began to absolutely panic. I remembered that I had taken a drug, but that filled me with more fear. I didn't think anyone could handle what was happening to me, and I was certain that I had taken too much, or had an allergic reaction to the shrooms. Either way, I felt that I was dying. I looked at the posters all over 'M's wall and they were moving so fast they were blurring. Eyes would stare at me, voices would tell me millions of things at different speeds. Throughout all of this, 'M's computer was playing Dub music off an internet radio program. The pitch of the songs along with the tempo would slow down until it was unaudible, but then would shoot back to normal speed and pitch.<br>I wanted to tell 'M' to  take me to a hospital, but I had no idea how to say it. Communication didn't make sense to me, and I couldn't understand what language my thoughts were in.<br>Then I entered a phase that I can't even begin to describe. Reality as I had come to know it was being swirled around me at lightning speeds. Words, songs, sounds, and voices would all be thrown at me in different volumes. I heard a cat meow, a man scream, a laugh, a trumpet blast, a car alarm, just about every sound I had ever heard in my life. All of these spun around me and I couldn't do anything but let it wash over me. I tried to form a thought but it would get sucked into the vortex. I'd try despirately to cling to something, some small fragment of myself, but every thought would go into this whirlpool.<br>The swirling entity turned and formed into the wall opposite the bed. I was being slowly pulled into it and I looked around, but could see all of it. I was omniscent in this void. I'd look up and down as I went through the tunnel, but it was almost like someone shot a hole thorugh a book and was flipping the pages. I was moving through thousands of walls with a hole in the same spot. As I moved through these layers I realized I could start forming thoughts. I began to think of a class I had earlier in that day, and of the people in it. I felt that just hours earlier I was in school, learning, being productive, making a difference in my life.<br>I thought I was such a fool to leave that sanity behind for this new, and seemingly endless nightmare reality. I thought of my father, and my friends, all living their lives healthily. I began to long for my sanity again, so bad that I almost cried. Soon after this I could feel myself breathing again, and the walls weren't moving as severely. I remembered my name, where I was, and what I had just done. I sat up and took huge breaths, realizing I was coming down.<br>I rolled out of bed and talked to 'M', who was on the computer. I couldn't use even a fraction of my normal vocabulary, but I wanted, NEEDED, to talk about what just happened. When 'M' turned around I was startled to see his face was pulsating and morphing as if he was a character in a game with bad, glitching graphics. I was still very high but didn't feel the sense of falling or being sucked in, so this type of visual hallucination wasn't overwhelming at all. In fact it was kind of humourous. I looked at my hands and they were pulsating and morphing as well.<br>I sat down and opened a beer, drinking it deeply and trying to go over in my head what had just happened. I was covered in sweat and apparently had been chewing gum earlier, which was now all over my shirt. And speaking of my shirt, I had a completely different one on somehow. A large portion of this trip is completely unexplainable, and there are things I can't remember. My heart was racing for hours after coming down, and after around 40 minutes, the pulsating visuals went away and I was somewhat sober.<br>This experience was life-changing. I had never been more frightened, vulnerable, and helpless in my entire life. This has scarred me deeply, but I'm learning to think of it as an educational experience, not a nightmare. I don't regret it at all.\n\n\n"
}
