{
 "title": "A Fine Antidepressant",
 "author": "Moc",
 "citation": "   Moc. \"A Fine Antidepressant: experience with Syrian Rue (ID 61527)\". Erowid.org. Sep 22, 2007. erowid.org/exp/61527",
 "substance": "Syrian Rue",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 g",
   "oral",
   "Syrian Rue",
   "(liquid)",
   "  T+ 4:00",
   "1.0 g",
   "oral",
   "Syrian Rue",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61527",
   "Male",
   " ",
   "Not Given",
   "Sep 22, 2007",
   "Views: 5445",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently life has been more negative than positive, with many old wounds being reopened and a lot of personal work taking precedence over school and career. The specifics of these things are unimportant, but can be summed up with the word 'anxiety.' I have been on a number of antidepressants, including Celexa, Paxil, Effexor, and Wellbutrin, but currently I am off all of these.</p><p>Yesterday I was bored, but in a good enough mood. I had ordered some Syrian Rue long ago, but had never really tried it out. I have read quite a bit about the stuff, and I was somewhat worried about what it would do to me if I was not careful, but as I had not had much to eat during the day, I felt I would be okay experimenting with a low dose.</p><p>So I took about 3 grams of the seeds and ground them up in a coffee grinder. The resulting brown-red dust and seedbits were then gathered in rough thirds. I took one of these piles and put it into a glass of orange juice, and stirred the mixture with a spoon. I then drank down the mixture, trying to swallow most of the thicker bits. I then went about with some stretching and walked around the house.</p><p>A little while later, I noticed myself staring at things for quite a bit longer than usual. I also felt a fair bit of indecision, but it was not uncomfortable. I talked to my brother, and things seemed to go as normal. Looking in the mirror, I looked very normal. However, at this point I had a sense that things were more 'okay' than usual, and that they might be more 'real' than usual. I do not know if these are mere placebo effects, but they may be, as they were quite subtle, and I do not think I have read of harmala having this effect on others.</p><p>Anyway, a little while later, I decided to take in another orange juice mixture, and did so. The results were similar to the first try, and I ended up going to a neighborhood hangout down the street. </p><p>The warm, moist weather was nice, and I took great satisfaction from watching the people on the streets. When I arrived at my destination, I found some old friends and talked to them. Also there were some folks who I am usually quite annoyed with, but in the state of mind I found myself in, I was far more patient than usual. I found it very pleasant to just be silent and listen to people. Admittedly, I am a sort of quiet person most of the time, but that aspect of myself seemed to be very much enhanced.</p><p>I ended up heading home at around midnight, still feeling quite pleased, quite calm, but certainly not euphoric. I felt then that this was what I had wished antidepressants to be like in the past. A detachment that is subtle, so that I do not become someone else or become unfeeling, but yet is powerful enough that I do not get enslaved to minor anxieties. Of course, as I have said, this might have been a placebo effect, and beyond that, the antidepressants I took in the past may have done such a thing in their early days. But what I remember of them was a coldness, a limiting of affect to a narrow range, and a great discomfort with who I was as a result of said limiting. I realize that many are helped by antidepressants - I think I was one of them, at one time. I just disagree with the 'life sentence' approach doctors seem to take with them.</p><p>Speaking of which, I feel that Syrian Rue, though it gave me a good experience would be too risky to take all the time. An MAOI has too many dietary restrictions, and possible interactions with other drugs. But to refresh myself, get a new perspective - it seemed to do this job well, and I do not believe I will have to do it very often to keep myself from Churchill's 'black dog'.</p>"
}
