{
 "title": "Life Altering Experience",
 "author": "Violet",
 "citation": "   Violet. \"Life Altering Experience: experience with 2C-E (ID 61584)\". Erowid.org. Apr 10, 2007. erowid.org/exp/61584",
 "substance": "2C-E",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "16 mg",
   "oral",
   "2C-E",
   "(liquid)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 5:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61584",
   "Female",
   " ",
   "Not Given",
   "Apr 10, 2007",
   "8639",
   " "
  ]
 ],
 "report": "<p>My boyfriend purchased some 2C-E online, not really knowing what we were in store for. We are both experienced users of psychedelics though, and came to the conclusion that 2C-E should never be used for recreational use. This substance gave us a wonderful, powerful trip that will never be forgotten.</p><p>We did not have a proper scale to weigh out the doses of 2C-E, which can be very a dangerous situation. So we decided to mix the 200 mg with an even amount of water so we would be absolutely sure we were taking the correct dose, basically 1 mg of substance to each milliliter of water. We read that 10-12 mg are recreational, but we were looking for something much more meaningful than that, so we decided to take 16mg each. It was myself, my boyfriend, and one other friend of ours. We drank our carefully measured water around 10:30 pm and smoked some cannabis while waiting for the effects.</p><p>It is difficult to remember the onset, but I remember feeling connected to the natural world. My boyfriend lives in a college town, and we decided to take a walk through the huge campus, which ended up being the best idea ever. My first visuals kicked in while walking. There was a full moon and many clouds. The clouds took the shape of huge faces that seemed to be looking out for us, there were definitely faces that I had seen during previous trips. We walked under through this long tunnel that took us to the main part of campus and it really took off from there- the ultimate rabbit hole. </p><p>Every thing around us took on a new meaning, a whole life of its own. Statues and sculptures and trees were becoming living creatures. The visuals were very melty, slow moving, similar to that of mushrooms. Also, energy fields were very pronounced and certain places called to us more than others. We would sit and meditate in these places, and came out with some very fruitful discussions. </p><p>After walking for a couple of hours, I started to feel very disconnected from my physical body. The only things reminding me that I still had a body was some mild nausea and jaw clenching, easily fixed by some weed and chewing gum. I did not understand why I felt trapped in this weird thing called a human. I felt like I could be everywhere at every moment. It was unnerving at first, but I got used to the feeling and grew to like it despite how restricting it felt.  I definitely felt like I was an alien life form, put into this body for the night on earth, and it was as if I was looking at earth for the first time. Everything was fascinating. I could walk up to a tree and become extremely curious, touch it, and melt into it. At one point we went into the library to use the bathroom, which was very odd. Seeing other people was really weird because we felt so non-human. It was in our best interest to stay out in nature I believe. I also felt very disconnected on a physical level from my boyfriend and friend, but extremely connected on a spiritual level. </p><p>There is so much more to all of this than I can actually describe. Our experiences through this magical journey prompted really amazing discussions once we got back to my boyfriends place, after about 5 hours of walking. Being inside was too much, so we packed a bowl and went to the park to smoke. Still tripping, but with the difficult, heavy part of the trip complete, we sat on a bench in silence. I felt my head and shoulders being massaged by unknown presences, which I had experienced before. I was told they were benevolent 'shadow people' that mean no harm. This was about 4 am, and the trip was wearing down, mellowing out a bit. We relaxed in the house, listened to music, talked some more, took showers, and eventually fell asleep around 7 am. </p><p>The whole experience was even more incredible than anything I can remember to write down. The entire next day I was very disenchanted with the real world. It took about two weeks to integrate the experience into my life. Overall, this chemical is not for the inexperienced user. I highly recommend this for those who are searching for a profound experience. I would use 2C-E again, and maybe at the 17-18 mg level, but not for a very long time from now!</p>"
}
