{
 "title": "Journey To Another Dimension",
 "author": "Mem",
 "citation": "Citation:   Mem. \"Journey To Another Dimension: experience with Salvia divinorum (10x extract) (ID 61637)\". Erowid.org. Sep 12, 2007. erowid.org/exp/61637",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "136 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2002",
   "ID: 61637",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 12, 2007",
   "Views: 3139",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I took Salvia was a huge turning point in my life. It was the summer of 2002, I was with my then-partner Dave and our regular trip companion Iggy. We were coming down from a night of especially good ecstacy, and Dave made the suggestion that we round it off with some Salvia. It seemed like a good idea at the time.\r\nIggy went first. He'd done it once before, and as he exhaled he muttered 'I remember this. Oh yes, I remember this.' whilst bringing his hand to his mouth as though he was trying to smoke a pipe. Then it was my turn.\r\nThe part that I remember most clearly was the foul-tasting smoke that felt like it was tearing the back of my throat to shreds. I held it in, and held it, nothing was happening. I exhaled slowly, and the last thing I remember seeing was Dave's face, his eyes staring into mine and a smile on his lips. I felt safe.\r\nThe entire room melted like one of those crazy Winamp visualisations. Everything in my field of vision just dissolved and liquidised and started to swirl around each other. I started to panic, and as soon as I did the whole thing froze as it was. A soft, warm female voice came to me, a voice that I felt like I knew. I have come to believe that this was the voice of the plant. 'Don't worry,' she told me, 'It's supposed to happen like that.' I was filled for an instant with a kind of calm joy, then as far as I can remember I ceased to exist. I was not a person, I was not watching any of this happen, I was simply a part of it.\r\nCrisscrossing lines appeared across the frozen image in front of me, marking out the shapes of interlocking jigsaw pieces. One by one they began to spin away, until all that remained was darkness. Pure, thick, tangiable blackness, but it was so very alive. What I saw next, I was not able to describe up until several years later during an especially pleasant journey on mushrooms. Dominating my field of vision was a huge Aum, shimmering and glowing in colours that don't even have a name. Gorgeous bright orbs orbited around it and I was one of them, and at the same time I was observing from a great distance away. At the time I had no idea what it was or how to interpret it, and when the trip was over that's the part that frightened me the most.\r\nI was torn away from that place quite abruptly, and some version of reality started to take shape in front of me. And then another, and another. Different pictures, all seen as though through my own eyes flew through my field of vision; sitting in a field, sitting in a bedroom, sitting in some dark corner of a nightclub. I didn't recognise any of the scenes that I saw, but I knew that if I did not choose one and return to it then my life would be lost. This was not in any way frightening, but at this point my sense of self was starting to return and I remembered that I was alive, and that I was not yet ready to abandon the physical world.\r\nThe pieces of reality started to drift away, and once again I began to panic. I reached out and grabbed the closest one to me, and within an instant I found myself sitting on the floor of a room I did not recognise, clinging desperately to a man I did not know. I tried to ask him who he was but I couldn't remember how to speak. My entire memory had been erased, all I knew was that this man was to be trusted. I thought, for a few horrible seconds, that I has ended up in the wrong place.\r\nAs my memory started to return, I recognised the man as Dave and the surroundings as his bedroom. It seems I regained the power of laughter before the power of speech, and everything became immensely comical. At some point, Dave handed me a pen and paper to try and aid in my efforts to communicate, but the two repelled one another like two same magnets. Whatever was in my head clearly wasn't ready to be let out. The night drew to a close, Iggy left, some version of sleeping happened.\r\nThe next day the problems started. I couldn't stop wondering, what if I had ended up in the wrong place? What if the memories that returned to me were different for each of the different places I could have ended up in? It was on that day that I began to seriously question reality. It is only in the past year that I have felt comfortable enough to stop.\r\nIn retrospect, perhaps 10x extract was not the wisest way to take my first tentative steps into the world of shamanic herbs.\n\n\n"
}