{
 "title": "If You Go Chasing Rabbits...",
 "author": "Lyle ",
 "citation": "   Lyle . \"If You Go Chasing Rabbits...: experience with LSD & Cocaine (ID 61697)\". Erowid.org. Feb 17, 2008. erowid.org/exp/61697",
 "substance": "LSD & Cocaine",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   " ",
   "  ",
   " ",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "2007",
   "61697",
   "Not Specified",
   " ",
   "Not Given",
   "Feb 17, 2008",
   "22967",
   " "
  ]
 ],
 "report": "<p>This is a journal entry I wrote the day after my boyfriend had a seizure in the middle of what was supposed to be a Christmas party. I didn't know until afterwards that he had taken four hits of the acid (which was very strong), and I had never seen cocaine before. We got it from some cokehead friends and followed their advice on how much to do, which in retrospect wasn't exactly a good idea.</p><p>What I wrote the next morning (names have been changed to protect the guilty):</p><p>Last night could very well have been the most terrifying experience in my life, and if not, it was definitely in the top five.</p><p>Jay had a seizure and ended up in the hospital.</p><p>I was right next to him when it happened. He suddenly looked blank and... weird. I asked him if he was okay, and he said no and started to shake. I didn't quite manage to catch him fast enough to stop him from falling, but I think I at least kept him from hitting his head as hard as he would have otherwise. Someone managed to call an ambulance quickly, and then I was trying to keep him on his side. Luckily, I had recently read some information on seizures. Crazy coincidence. I had wanted to know for a game we were playing in English, 'two lies and a truth.'</p><p>Anyway, when he came to, he was totally disoriented. He didn't know what had happened, and he didn't even know his own name. For a while he couldn't even speak or respond to us, and when Forrest told him to blink once, it looked like he was trying to, but he couldn't.</p><p>The paramedics brought him out to the ambulance on a stretcher with a collar to keep his neck from moving in case it was hurt (they had to cut off his sweatshirt to get it on).</p><p>Police searched the house, but I didn't see it (it happened after we left), and I managed to dispose of the evidence so to speak. I ran into Kei's room and licked up the last line of cocaine.</p><p>I didn't get to ride in the ambulance with him, but I rode with his parents to the hospital. (I was with Kei's mother at first, and she was not the least bit comforting. I was sobbing and she didn't say a word about. Nothing. She did tell me that Jay wouldn't be in trouble about the drugs, though, and they would be looking for the dealers instead.) When I finally got in to see him, he was still really disoriented. He later said he was having trouble seeing people's faces, so that would make sense why he mixed me up with his mother a few times, and even with his father and the nurse. He told them his name was Alice when they asked.</p><p>I was standing next to him for hours, kissing his face and stroking his cheek, and he was much more relaxed and happy with me there. He kept smiling, which was crazy, but it definitely calmed my nerves and I managed to smile back and keep it positive.</p><p>He got caught in a loop at one point. It reminded me of the way people's voices looped in one of my first bad trips, but much much more so, and in a different way. His memory was worse than mine was last time, not just churned but gone in a minute or less. He kept saying 'I love you,' and 'you're so beautiful.' At first just to me, but then to everyone, even the nurse (who was a man). Then he started startling and saying 'OW!', but saying nothing hurt when we asked him, and then sobbing loudly. It was really frightening. (He told me later that he felt pain shooting though his head, and thought or saw something about needles, and somehow that was related to the crying.) He was hitting his legs on the bars of the bed, and would sometimes jolt upright suddenly. We couldn't get him to relax, probably partly because he couldn't remember us telling him that he could come home with us if he relaxed and his blood pressure went down.</p><p>The loop he was stuck in was in his head, not outside like it was for me. I heard and saw the same things over and over looping (which is why getting up and moving around helped). He thought and felt and said the same things over and over. After a while he did realize he was repeating himself, and he said 'I must sound like a broken record.'</p><p>The loop: first he would say 'I love you,' and 'you're so beautiful,' and 'I love you, baby girl,' to just about anyone. Then he'd sit up and cry out, startled by something. Then he'd say he wasn't in pain, but he'd burst out crying. We'd calm him down, he'd relax, then he'd say 'I love you' and start the cycle over again. Anyway, he finally went to sleep when we left, and they at least let his father stay sitting just outside the curtain.</p><p>I stayed home from work, partly because I was a zombie from staying up all night, partly because I was still nervous and scared, partly because I wanted to wait in his room for him to get home.</p><p>We ended up sleeping all day. I don't remember much of my dreams, but I know in one I was trying to go around a narrow balcony to get somewhere. I was holding hands with a line of people, and when someone (him?) spun out of control and fell, we all did. Nobody could keep hold of the balcony. By some miracle, as we were hurtling towards the ground, we stopped and started floating gently. I was telling people that they could fly, and they should keep thinking that it was possible, and that would make it work. We touched ground gently. The only thing that had kept us from hitting the ground was our willpower, and my idea.</p><p>I think later in the dream, someone was searching everyone for drugs. I was a ways away, checking my pockets to make sure I didn't have any. I just had the broken cap of a pen and some other junk, so I walked back to where everyone else was (in some big room or hallway). Someone made a comment about how it had been such a wonderful party, clearly sarcastic. Everyone was standing around a table with little squares of assorted cakes, and I was just finishing one and thinking of having another when I woke up.</p><p>So Jay is grounded, in a lot of trouble, and his parents want him to never do drugs again. I can see where they're coming from, because he hasn't been very smart about it, but I think it's impossible to get him to do that. It would take a miracle. I'm sure I can get him to cut back and be more careful, and to take a break, but no amount of nagging from his parents or from me will get him to do a 180 degree turn. It's too much to ask for.</p><p>I did some google research, and I found out that it was most likely caused by the combination of cocaine and acid and the high dosage. Cocaine-induced seizures can result from concurrent ingestion of other drugs, apparently, so it was probably the four hits of acid that caused it. An empty stomach and dehydration probably also contributed to it. He had only had one bowl of ramen that day.</p><p>So that's about it for now. He seems to be doing better, but tired and drained. He's sane, his memory is back, and he of course is not seeing things any more. He's very quiet and didn't protest anything his parents said about having a serious talk about his lifestyle, or about being grounded, or about giving his credit card back to them.</p><p>Uhm... Jay is asleep, and so deeply that he might not wake up when I go in and get into bed. I woke him up to tell him about what I had found out on google, and he was barely awake enough to understand that, and he fell back asleep pretty much the second I stopped talking to him.</p><p>-------</p><p>So, that happened about one year ago, and now I have decided to go straight. 100% straight as a razor. There were many other contributing factors, but this was one of the biggest ones. Jay kept getting himself hospitalized time and time again, each time for different reasons. Most recently, he took bad acid and it made him think he was having a heart attack. He called me at 3:00 am to say 'I think I'm having a heart attack, and I'm going to the hospital. I just wanted to call to say I love you.' I'm amazed at how long it took before I decided to stop doing acid.</p>"
}
