{
 "title": "The Forgotten Spirit of the Earth",
 "author": "The Fox",
 "citation": " The Fox. \"The Forgotten Spirit of the Earth: experience with Cannabis (ID 617)\". Erowid.org. Dec 12, 2000. erowid.org/exp/617",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "0.75 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "617",
   "Not Specified",
   "",
   "Not Given",
   "Dec 12, 2000",
   "10176",
   " "
  ]
 ],
 "report": "<p>Duration: Six hours</p><p>First off, I must note that my tolerance to cannabis is very low; usually 4 or 5 hits will be enough to keep me in a state of bliss for 4 to 7 hours. I regard it as a very powerful and religious experience, and thus treat herb with respect.</p><p>This happened when I lived in Arizona not too long ago. I was walking around the mesa behind my house at about an hour before sundown, enjoying the view of the Earth and open sky. Before I headed home, I decided to smoke a joint I had with me.</p><p>Sitting cross-legged in a sandy wash, I smoked most of the joint before deciding to head home. After the intense sensory 'strobing' started, I noticed the small, fine details around me, all the tiny wonders that we usually overlook. The feel of the fine sand, the crisp purity of the desert air, the simple pleasure of watching a lizard dart among the rocks. I had just read the Tao Te Ch'ing, and reflected on the wisdom of the sages in urging us to be more appreciative of the little joys in life.</p><p>As I walked back down the dirt road that went near my house, the sun setting behind the mesa created a gorgeous mix of red, purple and orange, whose richness I found to be very peaceful. I reflected on the myriad beauty of nature. The small desert plants all around seemed more alive than I had noticed before, and I could hear dogs barking in the distance. I stretched and moved my body in various directions, marveling at the complexity of the human body. To think that mere electrical impulses from the brain could dictate the actions of this vessel! I began to think of the soul, how we fit in with the 'cosmic scheme of things.' I contemplated God, who could surely not be a physical entity. If so, s/he/it would be bound by some laws and forces. I thought of what we know as God to be some universal concentration of incomprehensible energy, directing all things from the scurrying of an ant to the slow, majestic wheeling of galaxies. My body was crude and puny in comparison, relying on material sustenance and physical manifestation. The thought kept recurring through my head 'We Are Machines Compared To God,' as if our idea of 'Organic' pales in comparison to the raw life-essence that is God.</p><p>The moon was already high and the vivid blue of a Northern Arizona sky framed it perfectly. I stopped and looked around, my eyes tracing the red soil out to the horizon. Standing there, the Earth seemed suddenly vast and wondrous. I could feel through my boots how solid and eternal was the skin of our Mother, how truly great She was. Far off, the Tsaile mountains loomed, the air was still and clear, the Moon was silver and awesome. I began to view the world as some hunter of the steppes must have viewed it in the Pleistocene, as it must have appeared to humans before electricity, before cars, guns, 'civilisation.' All the long centuries of Human existence are but a tiny blip in the life of the Earth and the Sky, which shelter us and whose songs we have forgotten in our modern dedication to money, convenience and noise.</p><p>The old Australian legends of the Dreamtime gained a newfound sacredness; I could see reflected in the Moon how our ancestors danced beneath her bright face ten thousand years ago in the stillness of the wilderness. All the cycles of life on Earth were perfectly meshed, like threads in a tapestry: even our species' recent trend toward destruction and rape would soon come to an end and we would once more come to love God, the Earth and Each Other.</p><p>I felt very peaceful, serene even; I suspect that if a pair of coyotes had come upon me and decided to rip me to shreds, I would have offered my nourishing body to them, for truly, what is death but a change in worlds, in planes of awareness? The Earth, Sky, Moon were immortal--and so was I. It was a simple, joyous, eternally patient feeling.</p><p>This was one of my most enlightening voyages into the mind; the sense of Oneness with nature cannot be lost by Us but only forgotten. That day I found it again.</p>"
}
