{
 "title": "Queasy Feverishness, Oh Dear...",
 "author": "mattski",
 "citation": "   mattski. \"Queasy Feverishness, Oh Dear...: experience with BZP & TFMPP (ID 61765)\". Erowid.org. Nov 9, 2007. erowid.org/exp/61765",
 "substance": "BZP & TFMPP",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Piperazines - BZP",
   "(pill / tablet)",
   " ",
   "75 mg",
   "oral",
   "Piperazines - BZP",
   "(pill / tablet)",
   " ",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 61765",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 9, 2007",
   "Views: 13596",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI'm getting on these days, really I am. \r\nThe whirl of everyday life stops me from recognising it but when I do occasionally emerge from the fug of work/study/relationships I find that it's true: I just don't enjoy chemicals in the way I used to.\r\nPartly this is because of lifestyle and the fact that my peer group no longer spends every weekend clubbing or out in the countryside communing with nature. There are fewer opportunities to indulge. But I think that I have also grown away from the need for these experiences, maybe they have taken me as far along the road as possible.\r\nSo, when I do find time to dabble in something new I get quite excited at the prospect of an interesting evening experiencing different sensations.\r\nOpening the newspaper last week I came across an article on party pills and how they are about to be banned in the UK. So, quick as a fox I jumped on to the internet and found a local supplier who happily got a box of BZP/TFMPP pills over to me in just over 24 hours. Excellent, I thought. In retrospect, perhaps, there was a reason for the quick delivery.\r\nWhen I was younger I often made the mistake of taking various substances in entirely inappropriate circumstances such as LSD when hanging out in a rough part of town, ecstasy at a works function etc. So, I prepared a relaxed environment in which to settle down and enjoy the ride. A glass of wine, a small dinner and then half an hour later 150mg of BZP with 75mg of TFMPP at home with my wife. \r\nSurprisingly, within 30 minutes I could feel a fuzzy, incoherent but quite definite feeling similar to the come up on magic mushrooms. The feeling got stronger and stronger until after around 2 hours I felt really quite unstable. Strangely, the feeling was much more akin to psychedelics than any stimulant Ive had before and had the unfortunate side affect of making me feel really antisocial. \r\nI used to be partial to a trip every now and then but I used to enjoy the visuals more than the physical or psychical dimensions. I was really quite disappointed that the only feelings I got was one of queasy feverishness. Not an especially pleasant feeling when expecting a MDMA/amphetamine type buzz. \r\nOf course, much of this can be put down to the hype created by salespeople to market the product as a legal alternative to Class A drugs. And maybe I expected too much. But I was left with the feeling that perhaps this is only an option for those whose access to the real stuff is limited by supply or cost, such as people in New Zealand, or as a one off experiment.\r\nSo, on to the next day. Well, if the hangover could match the ride it would be all fine and dandy. However, the insomnia that it caused and the poisoned feeling that remained for the next 24 hours really wasnt worth it.\r\nAlternatively, perhaps my time has passed and its slippers and pipe only from here on in. Maybe I am too old after all\n\n\n"
}
