{
 "title": "From Pleasantries to Regrets",
 "author": "Birdseye",
 "citation": "   Birdseye. \"From Pleasantries to Regrets: experience with 5-MeO-DMT (ID 6179)\". Erowid.org. Apr 11, 2001. erowid.org/exp/6179",
 "substance": "5-MeO-DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "13 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 6179",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 11, 2001",
   "Views: 9436",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThese experiences occured two weeks apart, but both in the same setting. I was in old growth redwoods in California during these trips, resting against old logs covered in mossy blankets.</p><p>7mg, smoked</p><p>I felt a very pleasant rushing sensation. Pleasantness pulsed through me, and I had visions of a girl I knew from a long time ago that I had felt disappointed at being unable to pursue. Except now, in vision, she changed into a idealistic altruist in my mind, dancing amongst my thoughts. I couldn?t see her, but I thought of her as in a daydream, and was comforted. I had a friend to my left, and when he asked me how I was doing, I was surprised when I had trouble spitting out words. The experience did not seem very intense at all, but I was speechless.  I rested my head on the log, closing my eyes to drift in the pleasantries of a dream state. It lasted no more than 10 minutes, though the first 3 were the strongest. I felt almost completely normal in 20 minutes.</p><p>13mg, smoked</p><p>I was ready for it to be strong, but still similar to my previous experience. I thought I would be able to handle this dosage quite well, although a friend who had done slightly more told me of nothing but terror. I smoked it anyways, and this time really got some of 5-meo-dmt?s harsh chemical-plastic taste. I barely finished the material, and right after I exhaled the smoke, I was sucked into a rushing tactile vortex (nothing I could see, only feel). The body rush proceeded to rise, rise, rise, peak, fall and slam into me over and over, escalating repeatedly and enveloping the world. I could not believe the pure intensity and explosion of the 5-meo peak was actually real, I was baffled and overcome with destruction. The climate had been slightly cool, and somewhat damp. I could no longer sense temperature, and could surprisingly utter more words than last time. The fear had set in. I thought to myself ?Why do I do drugs? and ?I should never ever do this ever again.? I looked over at my friend to my right, and his facial features morphed and gurgled. I didn?t get any visuals at 7mg, but I certainly saw them mildly at 13mg. The fractal patterns of tree leaves and branches in the woods provided an enhanced visual display, even now as I remember how they shuffled during this experience. I saw the symbolic girl of the previous trip again, and priorities quickly flushed my mind. I learned then what I would regret if I had died that day. I have finally admitted to myself what has been a persisting personal disaster in my life, and understood how much it was limiting me.  I was really only able to use the experience about 3 minutes into the experience, able to think dreamily and quickly. </p><p>After the experience on the hike back, I was awestruck, but elevated. I was happy on one level because I was definitely approaching the future instead of looking back at the past, but on another level distraught at the effort I now had to put forth in order to heal myself. The immersive nature of this experience was difficult in stages, but necessary for growth.</p>"
}
