{
 "title": "Sleep Paralysis",
 "author": "neutopia",
 "citation": "   neutopia. \"Sleep Paralysis: experience with GBL & GHB (ID 61802)\". Erowid.org. Apr 3, 2007. erowid.org/exp/61802",
 "substance": "GBL & GHB",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GBL",
   " ",
   " ",
   "  ",
   "oral",
   "GHB",
   " ",
   " ",
   "  ",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 61802",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 3, 2007",
   "Views: 15093",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been using GBL and occasionally GHB for most of the past year.  My doses range from constant use for a month or two, a few days of decreasing my dosage, followed by a few days to a couple weeks of abstinence.  I'll try to be brief. This particular report is about a physical symptom that I get that is not-so-uncommon in me, yet I cannot find another person who has experienced it.  I have read of this side-effect manifesting in patients who are taking GHB for narcolepsy, though I have never read a first-hand report.  I am not narcoleptic and have no idea why this is happening.</p><p>It sometimes strikes when I take GBL before bed and watch t.v. or close my eyes, it has happened during the day as well, but under those same conditions.  It has never happened while I was active or standing or sitting up, in fact it only happens when I lay on my back, not while I'm on my stomach or side.  Usually I will try to shift my position or scratch my face, etc., and it will quickly come to my attention that I cannot move at all.  My mind is perfectly alert, but it is trapped inside a body in which I have no control.  Total sleep paralysis.  It's pretty frightening, both for me and my girlfriend, who is almost invariably the only person I'm with when it happens.  The only muscles that I can control are my eyes and some weak control over my breathing.  I then channel all of my concentration into willing myself to move.  It takes many tries while regrouping my energy in between each before I break through that wall of paralysis and suddenly have full control of my body again.  The movement of my limbs by my girlfriend can greatly quicken the process.  Unfortunately, it is exceedingly difficult to get her attention whilst in this state.  The best I can muster is the sounds of deliberate and labored breathing to signal that something is wrong.</p><p>No harm has come from it nor have I ever read of any inherent danger in sleep paralysis.  This, coupled with the relative infrequency that it occurs and the fact that laying on my side or stomach almost always prevents the occurance, is weighed against the benefits that I derive from this drug and in the end I choose to continue to use it.  It is very infrequent now.  I do wonder why it happens to me and no one else without narcolepsy.  It could be affected by the anti-depressant, welbutrin, that I take.  It is the only variable that I can think of that might seperate me from the bulk of users of this drug.  perhaps an interaction prompts this response.  </p><p>I have also experienced a bit of sleep paralysis in my childhood without any drugs involved, getting frightened very suddenly in a dream and not being able to scream, waking up and having a 10 second trail on being able to move again, or just waking up very gently out of a dream and trying to move before the natural paralysis was gone.  Perhaps I am just predisposed to this paralysis and GBL promts the response.  The response does make some sense.  As we know, our bodies produce a chemical at night that cuts off efferent transmition to our motor nerves to prevent us from acting out our dreams and getting very hurt.  GHB is a chemical that is endogenously released when we sleep.  It is not, therefore, a huge jump to swallow an equation that includes a drug that is part of the chemical processes of sleep, a calm situation where there is little counter-action of the drug from my body, and a product called sleep paralysis... but why me and why does it occur only when I lay on my back.  I don't know if anyone else will be able to relate to this, but I wanted to contribute a report of my atypical effect from GBL/GHB.  Thanks.</p>"
}
