{
 "title": "Nice Synergy",
 "author": "Lemmiwinks",
 "citation": "   Lemmiwinks. \"Nice Synergy: experience with 2C-E & DMT (ID 61809)\". Erowid.org. Jan 18, 2008. erowid.org/exp/61809",
 "substance": "2C-E & DMT",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "insufflated",
   "2C-E",
   "(powder / crystals)",
   " ",
   "50 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61809",
   "Male",
   " ",
   "Not Given",
   "Jan 18, 2008",
   "Views: 4511",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just wanted to report an extremely pleasant synergy that I have found between phenethylamines and DMT.  This will not be a lengthy recount of my experience, nor anything of the sort- it is simply an account ...</p><p>I have found (and confirmed this by having my girlfriend and roommate try this too) that while under the influence of a phenethylamine (in this case 2C-E, but I've found mescaline works in a very similar way) that if one smokes/vaporizes n,n, DMT it almost completely takes the mental part of the DMT trip out of the equation and allows me to use large doses and watch the effects as if watching a movie.  This is very hard to explain, but I find that large smoked doses of DMT can be very mental at times and sometimes so overwhelmingly so that I don't remember much of the visuals, etc... while on 2C-E, I have found that a dose that would normally blast me off to another dimension, instead it leaves me right where I'm at and some of the most intense and intricate visuals I could ever experience unfold before my eyes- all the while staying completly clear-headed and coherent, its as if I am watching a movie of this, yet I am in the movie and it is really happening, this is most enjoyable!  </p><p>In fact, the only reason I would not be able to carry on a perfectly normal conversation during this time is because I am in such awe of the majesty of what I am seeing before my eyes....the experience seems to last a little longer while in conjunction with a phenethylamine as well, I once stayed up much longer than anticipated just to smoke DMT another 4 or 5 times during the experience because it was such a wonderful experience.</p>"
}
