{
 "title": "Project: Flying Cats",
 "author": "EuFiHel",
 "citation": "   EuFiHel. \"Project: Flying Cats: experience with Cyclizine (HCl) (ID 6182)\". Erowid.org. Jan 18, 2002. erowid.org/exp/6182",
 "substance": "Cyclizine (HCl)",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Cyclizine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6182",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2002",
   "Views: 16195",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n[erowid note: these doses of cyclizine are quite high for the level of effects described.]</p><p>These are the notes of my recent project, which was with cyclizine. I got the idea of trying the substance from my friend, who described it as definitely hallucinogenic, but also (in some strange way) frightening experience.</p><p>I read some information about the product (Marzine, Dramamine etc.) and came to a conclusion. That it would be quite OK, to try it out and make my own notes about the stuff. So, I bought 1 gram of cyclizine from a local drug store (about $9) and prepared myself for the experience(s). These two experiences have five days between them.</p><p>Test 1: 250 mg of Cyclizine Hydrochloride</p><p>T+0: Feeling OK. I ate some lunch etc. </p><p>T+1: Feeling a bit tired. Decided to take a nap.</p><p>T+2: Woke up and fell back to the bed again, feeling tired.</p><p>T+4: Baseline.</p><p>Test 2: 450 mg of Cyclizine Hydrochloride</p><p>T+0: Feeling OK. I ate some tacos and drank some water.</p><p>T+1: Disorientation. Feeling tired and jumpy. </p><p>T+2: Mild panic. Decided it would be better to sleep it off. I kept my eyes closed. Because I had the feeling, that if I would open my eyes something scary would appear. When I opened my eyes I saw some sparkling dots and flashing lights. </p><p>T+8: Woke up. When I opened my eyes I had a mild panic. It seems that I wasn't aware, that I was sleeping. </p><p>T+9: Almost baseline. Back to bed.</p><p>After my two experiences with the substance, I decided not to test the substance again for recreational purposes. It caused somewhat a panic filled state of mind with me. I was scared of seeing hallucinations, although, I have gone thru hallucinations before. Also, the drug made me tired, which I think as a bad sign. Also, I noted that before I fell asleep my body temperature was up and my pulse was more than 120. Somehow, that combined with the fact that it made me sleepy, doesn't sound so good. The substance has little psychedelic effects. Actually, I didn't note any, besides little light-headness. Maybe that was the reason I was just a bit jumpy, it takes some courage to go thru hallucinations that seem to be real, with tired state of mind and without any psychedelic effects.</p><p>Would I suggest the substance to someone whose interested about seeing things? It's your call, but I have to say, that the experiences I went thru were not worth of the panic etc.</p><p>Have a nice day!</p>"
}
