{
 "title": "Looking Through a Magnifying Glass",
 "author": "subz",
 "citation": "   subz. \"Looking Through a Magnifying Glass: experience with Eszopiclone (Lunesta) (ID 61858)\". Erowid.org. Oct 17, 2007. erowid.org/exp/61858",
 "substance": "Eszopiclone (Lunesta)",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.0 mg",
   "oral",
   "Pharms - Eszopiclone",
   "(pill / tablet)",
   "  T+ 1:00",
   "1.5 mg",
   "oral",
   "Pharms - Eszopiclone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 61858",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 17, 2007",
   "Views: 18710",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n+0::3mg\r\n+1::1.5mg (1/2 pill)\r\nTook 3mg at 8pm and another 1/2 (yes it tastes bad) at around 9pm ET.  At 1st no noticable effects. by +15m things start to seem weird.  Thoughts are slightly different maybe a little more interesting and laid back, altho not psychedelic.  This drug hit extremely fast.  I can prove this by dropping one into a glass of water (that I plan on drinking. lets not abuse drugs here) and watch how quickly it dissolves into the water.   Within 40 seconds the entire pill is gone. dissolved. you get the point.   Ive read this drug causes amnesia. I have not experienced this too bad. maybe slightly, however It does cause me to act clumbsy and be a little too 'open' with people .  Last time I took lunesta i said some things to an exgf that i totally regret now, and it seemed perfectly fine at the time.\r\nIts almost hitting full on now and i am getting sleepy, however nothing too special. it raises body temp. a little.  this drug is not something to do recreationally by any means.  It is great for coming down  (many many hours after those have warn off!).  \r\nMental mood:\r\n (+)\r\n * Calm\r\n * Slightly Aware\r\n * Happy\r\n * Slight euphoria\r\n * feel very social prior to full onset of lunesta.\r\nNegatives:\r\n (-)\r\n * Somewhat clumsy\r\n * coordination lacking\r\n * same negatives associated with any benzo or hyptnotic (if you consider them negative)\r\n  * HORRIBLE taste in mouth\r\nI cant get rid of the taste in mouth, its there no matter what. especially the next day.  This drug does not produce a 'warm fuzzy' feeling like opiates do.  I would not suggest combining it with other downers or DXM (bad bad idea).  \r\nmoral of the story:\r\nwhen I 1st tkae it withint he hour I will feel tired.  Fight it, as hours 2-3 are the most interesting and music sounds the best.  Then I will sleep wonderflly for the entire night ,)\r\npropz to pla \r\npe@ce and be@tz\r\nsubz\n\n\n"
}
