{
 "title": "A Skeptic Turned Believer",
 "author": "Roger",
 "citation": "   Roger. \"A Skeptic Turned Believer: experience with Yoga (ID 61872)\". Erowid.org. Apr 2, 2007. erowid.org/exp/61872",
 "substance": "Yoga",
 "bodyweight": "145 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 61872",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 2, 2007",
   "Views: 4212",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nSo like most people I was pretty skeptical of yoga. I mean it appears to be... I don't know, slow, feminine and gentle what's that going to do for me?\r\nRegardless, I had begun losing weight like crazy and I had tried many different types of exercise. I mean I got into everything, including but not limited to kickboxing, running, walking, jogging, weight-training, tumbling and calisthenics. I was shedding the pounds and just getting used to and loving my new thin frame. So of course I wanted to keep this going.\r\nSo I'm at the Sport's Authority or one of those places, and I decide to pick up a yoga video called Strength and Flexibility. This video has two sections with emphasis on different areas and so the first one I tried was the Flexibility one. I know I didn't execute all the poses properly, but I tried my best to follow along and I was physically able to do everything on the video.\r\nIt was hard to 'go inward' and focus on my breath or gaze but for most of it I did this without trying, and even though I did catch myself thinking about things during some of it I mostly didn't. Then again I wasn't trying to meditate, which is much harder btw. \r\nFive minutes into it I began to sweat profusely. Not like I would when running on a treadmill, more like one or two beads of sweat rolling down my forehead aggresively. I didn't really notice it I mean it didn't bother me like it does when I'm doing cardio or something, but I noticed that I was sweating insanely and in a new way. I had the AC on in my apt and everything, it was a very nice and temperate setting. \r\nTowards the end it already started to calm me. In retrospect this could have been a placebo effect from when he said 'feel the nervous system quite from the forward bends' but whatever I felt good. \r\nI had a good, slight buzz but I wouldn't really call it that, for the next 20 minutes or so. I felt energized and yet calm and peaceful. I guess you could say I was 'centered'.\n\n\n"
}
