{
 "title": "Social Me / Robot M.",
 "author": "E. Kale",
 "citation": "   E. Kale. \"Social Me / Robot M.: experience with Amphetamines (Adderall) (ID 61886)\". Erowid.org. Apr 2, 2007. erowid.org/exp/61886",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61886",
   "Male",
   " ",
   "Not Given",
   "Apr 2, 2007",
   "5126",
   " "
  ]
 ],
 "report": "<p>I started taking adderall a year after graduating high school. I found myself after high school, landing a job as a pot smoking janitor cleaning up after parole officers and lawyers. I noticed all of these people who were making 5 times more then I was, had one thing in common, bachelors degrees. So I knew I had to get back in school.</p><p>I joined a commmunity college and my room mate introduced me to a 20 mg pill of adderall. At first the experience was great and made test taking and writing 20 page papers a breeze. After I was paying my room mate 5 dollars a pill I found it much easier to obtain a prescription myself. I saw a doctor and succeeded in obtaining 60 mg a day. </p><p>Taking adderall gave me the ability to never go to class, cram for 3 days straight on adderall, and get an A on the test. I'm working on my second degree now. However before thinking that this is some sort of fairytale drug. There is an ugly downside. </p><p>First issue is tolerance: before a 20 mg pill would have me goin all night writing a 20 page paper. Now to get that effect, it takes me at least 100 mg. Which is not a big deal for me.</p><p>The ugliest side of this drug is that, while I may become a super genius, it takes away the part of me that is social. Making me an empty robot of a man. (It takes away the ability to make jokes, talk to the pretty girl sitting next to me in class, the ability to make friends.) I often feel paranoid attending class, feel as though people are talking about me or not sitting next to me on purpose. And when a teacher calls on me, I will just say something rather agressive. </p><p>However when not on the drug for a week or so, and its out of my system, I talk to people around me, make friends, and joke about teachers with surrounding students. But, then when finals come around and I have to start taking the drug again, the same people in class who are expecting 'social me' get quiet paranoid 'robot me'. </p><p>In keeping this secret from my girlfriend, she wonders why I'm 2 completely different people week to week, she wants to break up with me when I'm 'robot me' cause thats who I am half the time.</p><p>Even my parents see two different people and notice me ignoring them and now think I'm an asshole. </p><p>I feel as though now I cannot pass a class without the use of the drug. And at the same time I cannot have valid relationships while on it.</p>"
}
