{
 "title": "Tweekin Out",
 "author": "Horrorbznss",
 "citation": "   Horrorbznss. \"Tweekin Out: experience with Escitalopram (Lexapro) & Cannabis (ID 61926)\". Erowid.org. Apr 21, 2010. erowid.org/exp/61926",
 "substance": "Escitalopram (Lexapro) & Cannabis",
 "bodyweight": "95 lb",
 "header": [
  [
   "DOSE:",
   "1 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "50 mg",
   "oral",
   "Pharms - Escitalopram",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61926",
   "Female",
   " ",
   "Not Given",
   "Apr 21, 2010",
   "9887",
   " "
  ]
 ],
 "report": "<p>I'm pretty small for age, short and skinny, but my tolerance for most drugs and alcohol is pretty high. I am a daily marijuana smoker and have taken countless amounts of pills in my life time. My friends mom had a lot of left over prescriptions so she gave em to me to see if I could do anything with them. I don't have a problem testing out new pharms because of the experience and educational knowledge I have already. Of all the pharms I had obtained the Lexapro seemed to be the best test subject, a SSRI and anti-anxiety med. I started the night with a burger from Carls Jr and bought a dub sac from my homie. Then we traveled to my brothers house were we began to smoke. I pulled out a bottle of Lexapro and proceeded to hand out a few to everyone. I took a couple my self, then halved one with my friend.</p><p>Sat out in the garage for an hour or so when I began to feel something kick in. I was feelin slightly inebriated and very awake. The marijuana was superseded. I could smoke but it didnt do anything to me at this point. My jaws began to clinch and I saw small tracers. My anxiety was highly increased. I felt like a tweeker. In my experiences I've concluded that I much prefer downers to uppers, so I hate anything speed/tweek related esp tweekers themselves. It was such a horrible experience, and all I wanted was to sleep but couldn't. I tried, I might have passed out for lil periods of time, maybe a 30 min nap then I'd be awake again trippin. I didnt want to get off the couch because of nausea.</p><p>Then next day, very sleep deprived, I felt like shit! I didnt want to do anything and I couldnt eat til the following day. Even then it was difficult to want to put anything near my mouth. In conclusion, fuck lexapro.</p>"
}
