{
 "title": "Everything About Withdrawals",
 "author": "Fredrick",
 "citation": "   Fredrick. \"Everything About Withdrawals: experience with Tramadol (ID 61954)\". Erowid.org. Jun 23, 2007. erowid.org/exp/61954",
 "substance": "Tramadol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "61954",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2007",
   "Views: 8366",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok, The road I took to achieve this information was long and very painful. But with my pain and suffering, came out alot of information and study. The first time I started using Tramadol was for about a year straight, from June 2005-July 2006 non stop, at 200mg in the morning, 200mg Afternoon, then 200mg at night. It was the 'perfect drug'. When I woke up in the am I felt like a million bucks!! Got dressed went to work Cheerful like never before, full of energy, just happy as hell, like the world was just a perfect place. Tramadol did decrease my appetite but I was able to eat a light lunch & regular dinner and in return I lost 30 pounds over the course of that year with out even knowing it!! So I thought to myself this is a super drug, why stop. I live 10 minutes from the Mexican border so I have a never ending supply and very very cheap!! So my Tramadol experience continued until July 2006. After a year I thought this has been going on long enough I cant keep taking this for the rest of my life, so I decided to just quit cold turkey!!! BAD IDEA!!!</p><p>Friday Day 1 of Withdrawls. No sleep at all!! Anxiety, very shakey, stomach cramps. Felt like I had just been kicked in the groin. I couldnt keep my leg from twitching. Skin felt like it was on fire!!</p><p>Saturday Day 2 of Withdrawls: High anxiety. Stomach burns a little more, skin went from burning to a feeling of a bunch of needles poking all over my body. Hallucinations, and I mean some crazy hallucinations, just wierd pictures of objects and colors flashing before my eyes, even when I closed my eyes same thing. Nope no sleep again. I had to go out at night and walk. Just walk around because I couldn't sleep I was in pain my head and brain felt like it was being ripped apart. I thought I was going to die, I was thinking about turning myself into the hospital but I can't because I am military and I can get into alot of trouble for abusing substances. So I just told myself one more day, I can do it.</p><p>Sunday Day 3: Very high anxiety. Everything stayed the same as day two. I even told my self I can't handle anymore of this, if it feels like this on the morning of day 4 I am going to the hospital and bite the bullet.</p><p>Monday Day 4: Alright I fell asleep last night for about three hours off and on but much better. The needle feeling in my skin was fading away, no more hallucinations and flashes, still a nice stomach cramp but manageable, I was able to think straight again. Started to feel like myself again.</p><p>Tuesday Day 5 : Back to normal. No more cramps, I feel like my old self again, dragging ass in the morning, not cheerful like I am on tramadol, But I was sober!!</p><p>I was sober for about four months, because like I said I am military, so I had to go overseas for that four months, and everything was fine. I totally forgot about Tramadol. But when I returned home I ended up in Mexico with some friend, and I stopped at a pharmacy and picked up a bottle of 50mg Tablet Tramadol. Why? Because I like the way I felt when I was on them. So on I went back on my Tramadol life, Cheerful, happy, I even got a promotion, because when I worked on Tramadol, I was able to concentrate, happy go lucky, and loved to work on my projects. So I continued for about three months. Well it came that time again, for me to go overseas for six months. I didnt want to go buy a half year supply of Tramadol so I decided to cycle off it again. So what I did was taper.  Before I started the taper I was using 600mg a day.</p><p>Week 1: 200mg in the A.M., 200mg in the P.M.</p><p>Week 2: 100mg in the am, 100mg afternoon, 100mg P.M.</p><p>Week 3: 100mg A.M., 100mg P.M.</p><p>Week 4: 50mg A.M., 50mg P.M.</p><p>Week 5: 25mg A.M.,  25mg P.M. I just stayed at that level until I ran out of pills which was about 8 days.</p><p>No withdrawals!!! I didnt notice or feel anything!! </p><p>Yeah this took a while but I was able to work and have a social life while I was kicking the habit.</p>"
}
