{
 "title": "How Am I Still Alive?",
 "author": "Alcoholconsumer666",
 "citation": "   Alcoholconsumer666. \"How Am I Still Alive?: experience with Alcohol (ID 61960)\". Erowid.org. Feb 12, 2009. erowid.org/exp/61960",
 "substance": "Alcohol",
 "bodyweight": "137 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "61960",
   "Male",
   " ",
   "Not Given",
   "Feb 12, 2009",
   "18880",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I write this story about a rather extreme experience I've had with alcohol last year, at age 17. It was my first experience, and hopefully the most extreme I'll ever experience, because I know if I had drank more i would be dead.</p><p>It all started at my friend M's house. We were sitting in his basement bored and he asked if I wanted something to drink. Suprisingly, I had never drank before, but decided I would anyway. So he got a bottle of Irish cream and some glasses and we each took a little. It tasted aweful, but I chugged it down easily anyway. We decided to have another. And another. And another. After about 4 we walked up the stairs and noticed we were light headed, and had the famous 'buzz' everyone raves about. So we got some Jack Daniels whiskey and started going at that. Eventually another friend R came in and had a few shots. I kept saying we should stop, but was enthralled by the fact that more felt better. The more I drank, the better and happier and more giggly I felt, and my friends and I kept chanting 'one more.'</p><p>Soon the rancid acidic taste of the hard liquor vanished and we were chugging out of cups rapidly. We went to get more. I remember walking up the stairs and going to the bathroom and noticing I seemed to have no feet whatsoever. I was flying! Wow that was strange. Tried to piss in my friend M's toilet but urinated all over the seat and wall, but laughed saying to myself that I was so drunk that the urine contained enough alcohol to actually disinfect his bathroom. I nearly fell down the stairs and then decided to run circles around my friends pull table. Then there was a blackout. My friends claimed M and I became so drunk that we stopped drinking out of cups. We just chugged hard liquor right out of the bottle for a while, until I got so drunk that I started pouring it into my eye. In a quest to get more I tried to go upstairs, but ended up falling down the stairs trying to get up. </p><p>Afterwards I fell into the pull table, and with blood running down my face I ran over, fell over again, and started vomiting. For around 2 hours M and I vomited nearly continuously, constantly choking on pieces of food in our vomit. I had long since stopped responding to any outside stimulation including screaming and slapping. My friends panicked. I was completely unconscious for quite a while. I finally woke up to my friend A jamming his hand down my throat to pull out chewed food I was choking on and bit him and punched him. Eventually the vomiting subsided.</p><p>I woke up later in a state so miserable I cannot describe it. I've had severe cases of the flu and skipped sleep all night but NOTHING could compare the the feeling the next morning. Immediately upon waking I noticed wiping my face there was dried blood all over it. M's little brother came down to notify me my mother wanted me to come home, but as soon as I looked up I barfed my guts out. Apparently from moving my head fast after nearly drinking myself to death. I dragged myself upstairs to take a crap, only to find crapping also made me vomit. It was wretchedly gross. After somehow getting home I immediately went to sleep. I tried to eat but couldn't I threw up. I tried to drink cause I was very dehydrated, but couldn't I threw up. I couldn't eat until 11:30 that night and that was only half a bagel. It was miserable.</p><p>Since then I've been drunk plenty of times and smoked plenty of weed, mostly with good outcomes. It comes to show though, if your drinking with your friends in private, just make sure you wait between each drinks and try to stop. I know if I had drank anymore I would have gone into a coma. I basically was in one at the time and would estimate my BAC to probably have been somewhere around .30</p>"
}
