{
 "title": "And Then Things Folded Up Around Me",
 "author": "Walking Thomas",
 "citation": "   Walking Thomas. \"And Then Things Folded Up Around Me: experience with Salvia divinorum (5x extract) & Cannabis (ID 61964)\". Erowid.org. Dec 20, 2009. erowid.org/exp/61964",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 61964",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 20, 2009",
   "Views: 2248",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I used to be a pretty experienced psychonaut, having done fairly heroic doses of both psylocybin and lsd in my glory days.   It had been perhaps 7 years since I had done any hallucinogens when I tried the salvia.  This was written three days after the experience.  Still trying to integrate it.</p><p>My best friend, D, is a guy I have known for 20+ years, and was/is my tripping buddy. We have done a lot of unwise things together.   He was bound and determined to try salvia after watching some pretty funny youtube videos.  He had gotten some 'incense grade' salvia a few weeks back.  We are both heavy weed smokers, and I was not at all impressed with the plain salvia.  I thought the high was kind of like paint thinner, and did not smoke any past my initial trial of it.</p><p>D got some 5x extract a few weeks later.  He and his girlfriend, P,  of several years tried it once earlier that day, and said they just basically laughed their asses off.  D and P came over to my house that evening.  I smoked it twice during their visit.  While I am still not sure if I liked it, I am certainly impressed now.</p><p>We are all good friends and have known each other for years.  The setting was relaxed, we smoked a little weed first. It was daylight outside, and the lights were off inside.  The TV was on low, for background noise.  D, who is a pretty huge guy, and has a bad hip, was sitting in this old, high-sitting office chair I have in my living room.  Its easier for him to get up from.  His girlfriend and I were sitting on the couch.</p><p>The first time, I took one stout hit, and then a fairly half-hearted one.  I did not want to take of my pants and run around nekkid or anything.  The effect was sudden and very intense.  I had a physical sensation of some sort of field or membrane passing over/through me.  The effect was kind of like an electric shock, very buzzy and quite physically unpleasant.  I muttered I dont like this.  Soon, all the planes in the room, like the flat parts of the couch and the table and the walls all pixilated and broke apart into very brightly colored hexagonal tiles about the size of my thumbnail.  I could still see the table, but the flat parts of it were made of tiny colored tiles, slightly offset from one another.  I looked at my friend D, and I could see a sheet of tiles intersecting him where he sat in the chair, looking very much like wings.  I was still together enough to know I was sitting on my couch, at home.  </p><p>I had something that seemed to be made of jello that was the color of Coke all over me.  I was able to very easily wipe this stuff off me, it disappeared into the air as I wiped it away.  I was wiping it off my whole body, kind of like you sluice the water off yourself after a shower.  My friends were watching me do this, and asked, What are you wiping off?  Without a moments hesitation, I said, Failure.  This amused them highly, and they were laughing, and I was laughing a little  but it felt very weird and mechanical at first  becoming more natural after that.  After a few moments, I felt pretty normal, except for general giddiness, which went well with the weed high.</p><p>D and P had their turns, and they basically just laughed through their trips (and said I was weird because I didnt laugh during mine), and we smoked some more weed.  After a couple hours, we all decided to have another round.  This time, I resolved to pay better attention.  I took two MONSTER hits and quickly put the bowl down.  The effect was again very quick and this time extremely intense.  When passing through the membrane/field this time, it was even more uncomfortable than the first time.  It felt like a sustained electric shock passed me wherever I passed through the field.  It was fortunately over pretty quick.  The tiles came back, but this time, were not limited to only flat areas, but quickly covered everything.  The tiles were all brightly colored.  The colors of the tiles were reminiscent of the Aztec/Inca/Toltec art I have seen in National Geographic.  The way things were made up of tiles was like that sort of Aztec/Inca style too, only far more detailed.  I remember thinking they were like scales or something.  It was very, very beautiful.</p><p>After that, the wall behind me disappeared.  I could feel the warm sunlight, and could turn around and feel/see the countryside behind me.  Without transition, I was sitting with my back against this tree that is out in my front yard, but I was still in the living room.  I cannot adequately describe what happened next.  I believe it is described as total ego loss and synesthesia (sp?), but I am not sure of the technical terms.  As I was sitting there against the tree in my living room,  the entirety of creation folded itself around me and blended together, and I lost myself in it.  That sounds all melodramatic, but I cant think of any other way to put it.  I totally lost all awareness of everything for some indeterminate time.  I had no idea who I was or what I was or where I was.</p><p>The first recognizable mental process I remember was the sensation of being trapped in something that was moving in a slowly revolving pattern.  For some reason, I remember the tree from earlier  it was somehow part of this pattern that seemed like it held everything.  I also remember seeing my mother and sister (versions from when I was about 6-7) all swirled in there, in ways that did not make sense.  It was somewhat like those dreams I have about work, when I am doing the same horribly tedious task in an endless loop, never accomplishing anything.  Only weird  very, very weird.  It was not pleasant at all.  One oddly clear moment in it, is that the guy in the TV looked right at me and Oh man, you are fucked, and looked at me with disgust and pity.  Then he said, Well, I guess you wont die and turned away.</p><p>I felt like I was falling deeper and deeper into this loop. Then, somehow, it felt like a wise and benevolent being was peering at me from a great distance.  I reached out my hand, and the benevolent, shining being took it.  That was actually the thing that broke the loop for me  it was P that took my hand when I reached out.  It felt to me like she literally pulled me back though that membrane I had passed through earlier.  I was still tripping pretty hard, but I knew I was me, back on my couch, in my house.  Over a few minutes things got back to normal.  </p><p>They said I just stared into space for a while, then started leaning slowly forward.  I put out my hand as I leaned forward, and P grabbed it, and I sat back up.</p><p>Then P took 3 big hits, and she pissed on my couch. :(    Yep, she did.</p><p>I am still trying to figure out what I should learn from this  apart from putting down a towel for P next time. I have always felt like I have learned profound, if not easily explainable, truths on my previous heroic trips with shrooms and acid.  The Salvia trip was so alien and bizarre that I am not sure what to take from it  but I do feel like something is there to be learned.  Despite how this article might sound, I probably will smoke Salvia again.  There is something to learn back there behind that membrane.</p>"
}
