{
 "title": "Mania and Depressive Episodes",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Mania and Depressive Episodes: experience with Medical Condition (Bipolar) (ID 61965)\". Erowid.org. Apr 3, 2007. erowid.org/exp/61965",
 "substance": "Medical Condition (Bipolar)",
 "bodyweight": "179 lb",
 "header": [],
 "footer": [
  [
   "2007",
   "61965",
   "Male",
   " ",
   "Not Given",
   "Apr 3, 2007",
   "5229",
   " "
  ]
 ],
 "report": "</p>\nThis website talks about drugs and also states of mind, caused by either chemicals entering the brain and doing their thing or by natural things such as meditation. Well I am bipolar, which was called 'manic-depressive disorder' which means I have manic episodes and depressive episodes. Mania, to me, can be described as the ultimate 'natural high'. Less stronger than cocaine, much more stronger than caffeine. I will attempt to explaine my mental state, emotions, thoughts, actions, etc. etc. so you can dive into my gift and curse of bipolar.</p><p>+Mania+</p><p>Onset-</p><p>Probably the best part of mania. What I normally begin to feel is</p><p>Mood Lift</p><p>Excessive Self Esteem</p><p>Energy</p><p>Creative Thought</p><p>Spending Sprees</p><p>and even a decent degree of Euphoria.</p><p>I become talkative, cocky, erotic, I tend to smile alot, I can sleep for 3 hours and feel completely rested, basically I feel supreme.</p><p>Day 2</p><p>After a night time sleep at 3am, waking up at 6am and feeling like a morning bird, going outside to see the beautiful Arizona sunrise during spring brings even more moodlift. I become task oriented, thinking of nothing but achieving my goal, I even help my dad changing the tires which he had to take a break and I continued on uninterupted. Visual flow of artistic ideation is swirling in my head, I usually draw a scale with all my manic feelings on the right side, weighing down the right side of the scale. To me that represents my skewed emotional balance.</p><p>Day 3</p><p>I don't get any sleep, I go on shopping sprees, buying hats, shirts, pants, candy, games, flowers, markers... Buying something always makes me feel good during mania.</p><p>Day 4</p><p>Usually everything becomes less fun, I become irritable, inattentive, like if I have adhd. This is when mania takes its toll</p><p>Day 5</p><p>I'm coming down, this is when I usually start feeling tired and depressed. My depression can be more accuratetly desribed as apathetic. Basically I just start not giving a fuck. This is usually the end of the manic ride and I go into the depressed state.</p><p>-Depression-</p><p>Onset</p><p>After becoming exhausted I begin to feel sort of neutral to apathy. I basically have somnolence throughout the day. I feel</p><p>Fatigue</p><p>Apathy</p><p>Forgetfullness</p><p>Irritable</p><p>Gloomy</p><p>Everything seems darker..</p><p>Day 2</p><p>Apathy then transforms into guilt and worthlessness. Suicidal ideation begins to creep into my thoughts. In this point in stage I think 'what would happen If I shoot myself' but I rarely attempt suicides on Day 2, if ever.</p><p>Day 3-Day 6</p><p>Depression always lasts longer in bipolar, I feel like shit, tired, basic feelings of depression</p><p>Day 7 and plus</p><p>I never know how long this state will last but it usually lasts for 2 weeks where I just have suicidal ideation and such.</p><p>-Neutral+</p><p>Onset</p><p>Depression slowly fades away into what I perceive as 'normal'. I can never fully understand what 'normal' is but I know just what it feels like, or what I would think it is.</p><p>I decided to share this because bipolar, to me, is both a gift and a curse that about 3% of the american population is affected by. This place is meant for Mind and Body, drugs or not, but anyways I hope this gives you an understanding to the simple but complex mind of the human being.</p><p>PeACe</p>"
}
