{
 "title": "Violently Ill",
 "author": "Rawr",
 "citation": "   Rawr. \"Violently Ill: experience with Morning Glory (ID 62014)\". Erowid.org. Nov 9, 2010. erowid.org/exp/62014",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "130 seeds",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62014",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Nov 9, 2010",
   "Views: 2584",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I read up on morning glory seeds a lot before I actually even bought some to try out. It was probably months and months since I found out about it, and I decided to try just recently. And here's what happened. </p><p>I purchased a bunch of packets of MG seeds from Wal-Mart one night when I was with my friends. A few nights later, I took about 130 seeds, and without washing them or anything, put them in a coffee grinder, and drank down the powder with a glass of iced tea. It was pretty late, maybe 11 or 11:30. An hour and a half later, I really didn't feel much besides my body feeling a little tense, yet still nice. I sort of felt a body high coming on, I just felt kind of light and giggly also. I remember getting a grapefruit and eating downstairs, because I fucking love grapefruit and that's what I do all the time... I was on the computer for a bit after that, and had to get offline because my concentration wasn't what it should have been, and my game of spider solitaire was going miserably. So I lay down on my bed, and I just kind of smiled and rolled about for a while, because it just felt so comfy and nice to do so. But not too long after that, I began to get stomach cramps, and an odd dull pain around my belly button. I felt a little nauseous, and I wouldn't have been able to sleep through the night if I tried my damndest. So I ended up trying to sleep, but instead I'd doze off a little, only to be woken up again by sharp sickening stomach pains, and having to run to the bathroom a few times an hour. I didn't throw up, but the diarrhea was fucking rediculous. It sucked so bad. I felt like I had a bad case of food poisoning. </p><p>Next morning, I got up a little late for school, probably around 7. I felt a little sick, but not too bad. I was actually gonna go to school, but I ended up staying in bed a bit, and going to the bathroom a few times. But this is where it really kicked in, and I mean the sickness. I began having horrible stomach cramps and pains again, and spent a while on my toilet with my head over my sink, just letting the saliva drip out of my mouth, because I was secreting so much, and it tasted of the morning glory seeds so much it was making me sick, on top of the nausea I was already having. I kept getting these odd painful sensations of weakness in my legs and back, and I started to feel really hot, and even sicker. I got off the toilet and went into the shower, and as I was turning the shower on, I started to feel like I was going to pass out. I was swaying a little, and everything started to fuzz up and get black, so I had to lay down in the shower before I fell down. I pretty much lay there in the shower until the water ran cold. After this I went back to bed. I felt kind of crappy all day, and had diarrhea all day too. </p><p>That's probably the sickest I've ever felt, and I'm always god damned sick. I'll probably try it again, but next time wash the seeds, and use a different method of preparing them. And if I get sick this time, hell, I give up. I don't think it's worth getting that sick to trip, or to experiment with that crap. </p><p>I'm not saying don't try it, everyone is different. Just start off small, and try different methods. I only had 130-something seeds, and look what happened to me.</p>"
}
