{
 "title": "Just Getting My Feet Wet",
 "author": "SuperCommie7",
 "citation": "   SuperCommie7. \"Just Getting My Feet Wet: experience with Salvia divinorum (10x & 40x extracts) (ID 62037)\". Erowid.org. Feb 27, 2010. erowid.org/exp/62037",
 "substance": "Salvia divinorum (10x & 40x extracts)",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE:",
   "5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62037",
   "Male",
   " ",
   "Not Given",
   "Feb 27, 2010",
   "Views: 2286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm not really sure where to begin with this trip report. Salvia is definitely not like any other hallucinogen I've ever encountered, and produces some very bizarre hallucinations.</p><p>First let me tell you about my set and setting: It was an uneventful afternoon and I decided that it was as good a time as any to have a go with some salvia. I started by first preparing one bowl of 10X extract, which I suspected would be a perfect starting dose. I was sitting alone in my room staring out of the window, getting myself mentally prepared for the experience to come. After about 15 minutes of quiet meditation I decided I was ready. I lit the bowl and took a nice, deep hit, comprising about 20 seconds of constant intake. I closed my eyes and held it in for 30 seconds, as instructed. After I let it out, I waited for it to take effect. I waited for about a minute until I realized not much was happening. The only really noticeable effects were a general heavy feeling throughout my body and some vague patterning. Naturally, when I opened my eyes, I was rather disappointed to still be in my room.</p><p>I continued this same pattern through another 5 bowls of this 10X salvia, and was similarly disappointed. Here is where I made my big mistake: I let myself become irritated and frustrated, thus disturbing my positive mindset.</p><p>I decided 'to hell with it, bring on the 40X!'(my second big mistake). I loaded up a large bowl of this stuff and did the same as before. About 5 seconds into holding my breath, the effects began. It took me totally by surprise and I actually didn't realize that I was starting to trip. First, the afterglow of my room on the backs of my eyes spun away from me and a glowing, 3-D text field appeared. The text seemed to spell out whatever I was thinking, which happened to be 'What the hell?'. As I observed the text, each letter came towards me and I saw each one in close detail. The letters were actually comprised of people! As the letters became closer and clearer, I realized that these people were all me! There I was, 10000 times, staring back at myself. </p><p>The only difference was that these letter people were not happy. In fact, they looked downright insane with anger. I recall myself frowning back in the 'real world' and then everything in my field of vision totally shattered. Everything fractured and spun out of control everywhere and I was looking down on my body back in the real world, except I was a little different. On my left forearm, there was a zipper. I got closer to the zipper and it began to unzip and inside, where I expected to see my muscles, tendons, veins, etc., but instead, saw something much different. </p><p>My extra-body self continued to get closer to my now unzipped arm, and eventually went inside completely. After I was inside my arm, I turned around and looked back to see that my skin and body no longer seemed to really be a part of me. My arm zipped itself back up and my field of vision began to magnify again. I zoomed in, unimaginably close to the zipper track itself and realized that the zipper was not actually comprised of the normal zipper teeth you might expect to find. Nope, instead, the zipper was made out of the same people as the text that I had seen earlier. These people seemed to be even more agitated than the last group, and they were chanting something. A louder voice rang out yelling 'there are too many of them!' in a very dramatic voice at which point the zipper people began to enlarge and get louder. At this point my physical body twitched several times, causing me to spill some bong water on my leg. </p><p>This little spill seemed to bring me back to reality because, everything in my field of vision seemed to decompress and expand. With the visuals becoming too incomprehensible, I opened my eyes and looked at my body, thinking that the trip was over, but I was wrong. While the visuals were gone, the accompanying feelings were not. At first I felt primarily confusion, which gave way to fear and then panic. I couldn't figure out what I was freaking out about when I saw a tiny drop of spilled water on my desk, and what I felt afterwards is hard to articulate. I suddenly felt EXTREMELY, unimaginably filthy. I seriously couldn't stand being in my clothes and body, and this feeling of dirtiness only served to amplify my panic. </p><p>I sprang up and hit my head on my loft bed. All I could think about was the filthiness. It was unbearable. I tore off my cloths and tried to rub the invisible muck off of my skin, but to no avail. I stumbled my way down the hall to the bathroom, where I turned on the shower, but realized I couldn't get in until the water warmed up, and I felt several waves of nausea flow over me, but I didn't throw up. I paced out in the hall, realizing that I had to get a hold of myself. Walked all over the house doing my best to ride out the remaining effects for another agonizing 10 minutes or so. Finally, I returned to my room and sat back down where I started. I took a deep breath and began to wonder what to make of what had just transpired. I heard the shower running and remembered my original decision to bathe, so I turned it up nice and hot, sat down, and let the steamy water wash over me. </p><p>I was totally stunned at the power of this stuff, and I felt somewhat embarrassed about my panic. I've used several hallucinogens, including LSD, Shrooms and DXM, and none of them came anywhere close to producing any similar effects. While most people seem to think of LSD as being 'the most powerful hallucinogen', I'd have to say that LSD is nothing compared to salvia. During my LSD experiences, I always felt as if I were in control and even when things got a little weird, I was able to maintain my cool. Salvia, on the other hand, totally overpowered me. </p><p>In retrospect, while this was probably the most difficult trip I've ever had, I would consider using it again. I've still got plenty of the 40X leaf left and I'll have to find something to do with it. I'm lucky no one was home when I did this, considering that I stomped around the house totally naked.</p>"
}
