{
 "title": "The Overlooked 2",
 "author": "Thee-O Fan",
 "citation": "   Thee-O Fan. \"The Overlooked 2: experience with 2C-T-2 (ID 6205)\". Erowid.org. Apr 12, 2001. erowid.org/exp/6205",
 "substance": "2C-T-2",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:00",
   "5.0 mg",
   "insufflated",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "6205",
   "Not Specified",
   " ",
   "Not Given",
   "Apr 12, 2001",
   "Views: 18379",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI decided to write this because there wasn't a lot of clear information about 2C-T-2 and the reports I've seen have only been about taking this chemical orally.</p><p>I've tried it orally before at a dose of 21mgs and it was just a horrible experience.  It was 6 hours of vomitting and severe muscle discomfort.  I didn't have a chance to enjoy the hallucinations at all and I felt like I'd been hit by a bus the next day.  Having plenty of this left over I began to ponder seeing if I could get anything useful out of it.  Having read reports about insufflated 2C-T-7, I decided to give it a shot.  My first time trying this was with about 10mgs.. too much.  I didn't puke but felt like I was going to all night and my body was heavily discomforted.  All my muscles tightened and the next day I had a horrible headache.  The hallucinations were outrageous, though.  At one point I had put on some goa trance and I got sucked into the headphones.. not only did I see the music, but I was actually floating through it like it was a whole dimension of sound.</p><p>Again I tried this substance, again by snorting, but only taking 5mgs.  This was perfect.  The hallucinations were still out of this world.  Ever shifting like LSD, but more intense like mescaline.  It seemed like a pretty good cross.  Mentally I didn't feel very strange at all.  If it hadn't been acting as a stimulant, and I hadn't been seeing and hearing weird things, I would have forgotten I had taken anything.  Incredibally vivid colors and sounds.  I stayed up all night taking short walks around my neighborhood gazing at the stars and watching cars drive by.  I was in enough control that I wasn't too afraid of anything going wrong.  But I was tripping quite hard.  At one point I remember watching the branches of trees fight each other.  There weren't really any profound or deep thoughts, however.  In my case, I was happy about that.  This is more of a substance that'd be useful to just enjoy the visuals and listening to music.  Since I was alone, I couldn't tell you if it made me feel any harmony with others.. but I doubt even if others had been around, it would have been much of an empathetic tool.</p><p>On another occassion I had ingested a tablet of MDMA 2 hours prior to snorting 5mgs of 2C-T-2.  These drugs interact in a most incredible way.  The first 2-3 hours after taking the 2C-T-2 seemed to amplify the effects of the ecstasy as if I had taken at least 5 tablets.  As the ecstasy wore off I started hallucinating like I was on another planet.  Everything was so incredibally distorted I couldn't make out what anything was if it was farther than 20 feet away.</p><p>On a final note, I would add that this is probably not the safest of chemicals.  In the low 5mg dose, it seemed alright.. but again.. it SEEMED that way.  From the effects I got from higher doses, it seemed as if my body didn't like it AT ALL.  As well, when I mixed with MDMA it was out of this world intense, which might not neccessarily be a good thing.</p>"
}
