{
 "title": "Two Fast Years",
 "author": "Geneharding",
 "citation": "   Geneharding. \"Two Fast Years: experience with Alcohol & Various (ID 62111)\". Erowid.org. Nov 2, 2007. erowid.org/exp/62111",
 "substance": "Alcohol & Various",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "  repeated",
   " ",
   "Various",
   " "
  ]
 ],
 "footer": [
  [
   "200507",
   "62111",
   "Male",
   " ",
   "Not Given",
   "Nov 2, 2007",
   "Views: 5819",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report isn't really a warning to anybody, because as bad as it might sound, I really don't feel that it is. Its as much for the people reading it as it is for me to get things together and organized in my somewhat confused head.  I'm 16 years old right now.  I have been smoking pot just about every day for the past year an a half, maybe a little more.  I took my first drinks about two and a half years ago, but didnt get more than a buzz till about this time two years ago, over spring break of my 8th grade year.  I had just turned 14.  I remember I drank a few shots of whiskey and a few shots of cherry vodka.  Keep in mind that I was probably about 115 pounds and only 14 years old.  I had the most amazing time of my life, up to then of course.  I kissed a few girls that night, and had fun.</p><p>This started my pattern of every weekend drinking, then summer came, and I started drinking at least twice a week, but normally three to four times.  At the time a good drunk was 4-5 drinks.  I tended to drink with one kid most of the time, and occasionally a few others. Throughout that summer I felt the need to drink all the time in order to have fun.  That summer I also tried smoking grass for the first time.  My first time I smoked a shitty joint out of regular paper and didnt feel much.  The next time I tried it, about a month later, I smoked a gram of KB to myself rolled up into a joint.  I remember running to catch up with my friend and it all falling right on top of me. Laughter, light headedness, euphoria, music was rolling through my head that I had no control over. Rain was coming down unbelievably hard and everything was blurry.  All of the sudden the sun came out, I was soaking wet, really stoned for the first time, and had to walk probably about a mile to get to my friends and dry off.</p><p>It was only two months after that that I started smoking pot regularly with a kid who I would be spending most of my time with up until now, which is over a year and a half later. Im not the most popular kid in school, I cant say that I have to many real friends cause I get ditched by them a lot of the time. I stopped drinking for a while when I got into heavy weed smoking.  But that didnt last long. Five or six months later I drank a lot again.  I started experimenting with more drugs about 8 months after I became a regular smoker, and a year after I got drunk for the first time. I tried mushrooms.  I ate some of them, I dont really know how many, and me and my friend smoked bubblers most of the night.  I cant say it was a 'life changing experiance', but it was a start to my experimenting.  </p><p>Over the summer of 2006 I tried more drugs. I moved into acid and tried some pills like vicodin and ritalin.  I took acid regularly for a few months, then stopped after realizing it got me down pretty bad.  Once I was crying for no real reason the day after I tripped, I didnt know what it was, but something was really bringing me down.  I had problems with depression in the past, but this was differant.  I stayed away from acid for a little while after that.  The fall of my sophmore year I tried a vast amount of pills.  And I fell in love with my next problem drug, Amphetamine.</p><p>The first time I took adderall I had no idea that it was a cousin to meth.  I thought meth was a drug only for hard core addicts.  Ampethamines are wonderful. They give me so much influance and euphoria.  I enjoy creative things like writing and drawing, and on amphetamines I could never stop coming up with new ideas.  I was so happy and the world seemed like there was nothing wrong with it. Once I blew a 30 mg and a big line form another pill, Im guessing it was about 35-40mg of the stuff.  I summed up my ideas about God and religion in a notebook, all in all it was about 5 pages long.</p><p>I also tired things like xanax, percocet, more vicoden, a lot of ritalin, and ambien.  There are probably a few more in there that I cant think of now.  That winter something new came along. Cocaine.  I never thought I would be blowing a line of cocaine. Ever. But I did. It became pretty big at my school and I thought why not try it.  I did it probably about 7-8 times in a period of a month, and I loved it.  I spent over a hundred bucks on it in only a short period of time, and got probably about a gram for free.  I didnt wanna get hooked though. I gave it a rest for a while.</p><p>In the past few months, to start 2007, I have started drinking more, and a lot of people are saying I am drinking pretty heavily.  I know I am, and I care about it, but I love drinking and I always have.  I care, but I dont care. I think about alcohol every day and have been smoking pot every chance I get since I got out of rehab. I was in an outpatient program for about 2-3 months because of my parents, I still smoked, I failed almost all my tests but refused to go back, and it worked somehow.  I have also been taking amphetamines and any uppers I can for the past few months once a week if not more.  I always think about them, and cant write without something to put me in the right state of mind.  Even now, I felt like I needed to sum all of this shit up earlier today, but I wanted to wait to drink more, and get to smoke too before I wrote it, on the basis that it would be a better story if I was high...right?  So as of now I am smoking heavier than ever, drinking more than ever, and always snorting or popping some kind of upper or downer.</p><p>This may sound like complaining about some sad slow process of slipping into addiction.  I dont know if thats what it is really. I know we are all going to die one day, and Im going to live while I have the chance to live.</p>"
}
