{
 "title": "I Thought 25mg was Supposed to Blow My World",
 "author": "KoolAid",
 "citation": "   KoolAid. \"I Thought 25mg was Supposed to Blow My World: experience with 2C-T-7 (ID 6215)\". Erowid.org. Apr 13, 2001. erowid.org/exp/6215",
 "substance": "2C-T-7",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 3:30",
   "5.0 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 6:00",
   "5.0 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6215",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 13, 2001",
   "Views: 17892",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nT + 0:00  We consumed 15mg of 2CT7 on a somewhat full stomach of pancakes.</p><p>T + 1:15  I began to notice slight effects, very similar to those of weak paper acid.  There is a very similar body sensation to that of somewhat dirty acid.  Some mucus production.</p><p>T + 2:30  Much of the dirty feeling has subsided.  The character of the experince has also changed.  It it less like acid now and has more of its own charater, although im not sure what that is at this time.  I'm feeling fairly confident that the experience is not going to get any stronger.  We decide, however to hold off on eating more because many people note taking more and then the first batch kicking in and regretting it.</p><p>T + 3:30  We eat 5mg more each, since the effects haven't gotten much stronger.</p><p>T + 6:00  We eat 5mg more each.  still no effects from the last 5.  I like this substance a lot from what i can tell, i just wish it would fully hit me already!  IT has a very distinguishable character, one that i believe can provide a variety of experiences even among the same person.  One of our fellow trippers is incredibly hilarious.  He started out with 20mg and has been laughing histarically for hours now, he hasn't paused for more than two seconds at a time (literally), so apparently it has worked very well on some people.  WE hope the last 5mg will blossom.</p><p>T + 9/10  Beginning to come down now, never fully went up.  the last 5 mg never hit us.. the last 10 only really extended the experience we had.  Next time we'll try more.  why is this stuff so expensive?</p>"
}
