{
 "title": "Mild Open Eye Visuals",
 "author": "The Code",
 "citation": "   The Code. \"Mild Open Eye Visuals: experience with Skullcap (ID 62166)\". Erowid.org. Jun 16, 2007. erowid.org/exp/62166",
 "substance": "Skullcap",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Skullcap",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Kratom",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 62166",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2007",
   "Views: 17818",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The other night, I wanted to try out some scullcap.  I recently had purchased an ounce. when I received the sample it smelled very nice and fresh.  I read somewhere that having a fresh sample makes all the difference with scullcap.</p><p>I went outside, and packed a large bowl into a classy looking sherlock pipe.  It has an extremely large bowl, it could be equivalent to 2-4 bowls in a glass pipe.  Possibly more.</p><p>Each time I took a hit, breathed in air, and then held it for a long time (about 15 seconds).  The smoke was very sweet, almost sugary.  I read that holding in herbal 'highs' makes them much more potent, I think it's true. The smoke was harsh on my lungs and I almost coughed.  This is significant because my lungs are fairly broken in.  I smoke cigarettes (maybe 1 every other day) and they rarely even tickle my lungs. The bowl stayed burning reasonably well, but I did have to relight it often, especially because I was holding the hits for so long.  </p><p>After I had finished about half the bowl, I could definitely feel it, it was surprisingly similar to marijuana.  I easily could have mistaken the high for that of a milder strain of marijuana, especially considering the difference in effects between different strains.</p><p>I was only at what I thought was half way through the bowl and beginning to get tired of smoking the stuff, but I made myself smoke the rest.  This time I didn't hold it in nearly as long.  Although, I had scraped the bowl earlier it could be possible that there was still a very small amount of kratom resin still at the bottom.  By the end of the bowl, I was definitely more than twice as high as I had been earlier.</p><p>By the time I had finished the bowl, I was feeling 'it' very strongly.  It was incredible!  I went inside, and looked in the mirror, and I could see vague distortions in lighting.  There appeared to be light lines on the side of my face, outlining my face and chin in particular.  These lines were the most pronounced in places that changed suddenly from light to dark.  I am somebody who gets visuals very easily, even from marijuana, but even so this was never anything I would have expected from a ~$10/oz un-extracted legal drug!!  I looked in the mirror and smiled goofily at myself, very pleased.  The effects consisted of much more than simply visuals.  I was very relaxed and calm.  The feeling is not as easy to describe, but I remember thinking at the time that it felt exactly like another drug I had tried, but I wasn't sure which one.  At the time I felt the high had an odd similarity to nitrous oxide, but now thinking back, I'm not so sure it did.  It was probably closest to a strain of marijuana I had tried.</p><p>It did not last very long, in less than 10 minutes there were no more of the mild OEVs.</p><p>I have two friends who also smoked the same pack, and got no effects what so ever.  I have smoked scullcap on two other occasions and experienced an effect, but never as good as this one.  I also smoked less the other two times.  I think this is still an exceptional an bizarre experience.  Other times, I was pleasantly surprised that it had effects, but not very impressed by the effects that I felt.  Certainly not a replacement for ganja.  At least not anything more than a temporary replacement.  The worst thing about the drug was how short the effects were... it reminded me of tobacco in that sense.</p><p>And for the record, the amount of kratom that I theoretically could have smoked, would never have produced effects anywhere near this potent or shot-lived, in fact I doubt they would have produced any effect at all.  The same friends to whom I gave the scullcap, I also gave kratom.  They stupidly decided to smoke it (it is much better as a drink), and didn't get any effects from kratom either.  The kratom was an extract, and it really didn't burn very well.</p>"
}
