{
 "title": "Magic Carpet Ride",
 "author": "user",
 "citation": "   user. \"Magic Carpet Ride: experience with Lagochilus inebrians (ID 62213)\". Erowid.org. Apr 16, 2007. erowid.org/exp/62213",
 "substance": "Lagochilus inebrians",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "20 g",
   "oral",
   "Lagochilus inebrians",
   "(tea)",
   " ",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  repeated",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "62213",
   "Male",
   " ",
   "Not Given",
   "Apr 16, 2007",
   "Views: 25757",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm experienced with a lot of drugs and herbal highs for a long time. I'm 42 years old and in good health, my main concern being my tobacco chronic abuse. I'm currently using Cannabis (once or twice a day, no more), Tobacco (around 30 /40 cigarettes a day), Kratom (once a week), and sometimes Catuaba and Bacopa monnieri when I'm tired. I tried low amounts of Lagochilus some time ago with light results. I didnt take any for at least 6 months. </p><p>I had taken Kratom (moderate amount) on the eve's night. I wanted to feel a relaxing effect, but didn't want to take Kratom again, as it depresses me sometimes, and is an addicting substance. I remembered that I had some Lagochilus (a mix of what remained of that I bought on the net, and of homegrown plant material)left.</p><p>I made a tea using 20 grams of stems, leaves and flowers. I let it boiled at a low level (in order not to vaporize the terpenoïds) for 30 minutes, covering the pot. I drank the resulting three cups of bitter tea with some sugar. I like the taste, but it leaves a long lasting after taste wich reminds me yellow pamplemousse [grapefruit]. I've drunk the three cups over the course of an hour. I smoked a cigarette of pot during the first cup, and another one during the last. </p><p>The effects were very nice. I felt sedated, but it was not the main feeling. the effects get stronger as time passed and I was feeling on a flying carpet. It was nearly stronger than Kratom, without the stomach discomfort that Kratom often brings and without the 'opioid dimension' of the mytraginine experience. My thougts were a bit foggy and slowed down, but I was quietly flying. I didnt experience any hallucinations, the pot effects were greatly modified by the Lagochilus tea. The flying feeling was from time to time nearly overwhelming, stronger in the minutes following pot smoking. I spent time watching the walls as if I've never seen them before. It was not like the fascination for visual textures that hallucinogens give (like, for example, a moderate dose of Salvia, Iboga or Mescaline cacti, the only entheogens I've tried), it was a more distant feeling, I didnt think anything special, no 'connection' with the things. I was a bit stuporous, but not deeply. The lazy feeling of pot was somehow enhanced, but I was able to move. My motor coordination was a little impaired, but not heavily, I was just moving a bit slower and more carefully. My perception of time was't modified, compared to baseline.</p><p>The effects gradually wore off: I was more likely to move and, in fact felt a bit 'speedy'. The most intense effects lasted something like 3 or 4 hours after the last cup. Even with the somehow 'speedy' feeling I was experiencing at the end of the 'trip', I fell asleep without having conscience of it. </p><p>I woke up this morning feeling very lazy, but not particularely tired (in fact I'm often lazy early in the morning). I'm clearly feeling some kind of after effect when typing this, aroung 16 hours after the experience. I'm relaxed, a bit lazy, but perfectly able to do what I've got to do. I'm feeling fine. In fact some sedation persists : problems are not threatening. I had an appointment this morning about which I would be a bit worried normally, and I got through without any problem, and rather efficiently.</p><p>It might not be related to my Lagochilus use, but I woke up with urticaria on the legs and a little on the arms. It wasn't cool, but the itching gradually subside rather quickly. I haven't have any urticaria since I was a little child. </p><p>Strong Lagochilus tea produces nice effects, the sedating one being not the most interestings. I'm likely to take more soon. </p><p>Respect the plant. Lagochilus is an endangered species. I highly recommend to grow your own, it's rather easy. It needs a sunny place, deep pots and a light soil. when growing it indoor, do not let the soil go completely dry. There are a lot of seeds in plant material sold on the Internet, so buying a low amount is enough to start your own culture. And the plants smells just great!</p>"
}
