{
 "title": "Trapped In A World Of Geometry",
 "author": "Corvid",
 "citation": "   Corvid. \"Trapped In A World Of Geometry: experience with Salvia divinorum (10x extract) (ID 62219)\". Erowid.org. Oct 17, 2009. erowid.org/exp/62219",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62219",
   "Male",
   " ",
   "Not Given",
   "Oct 17, 2009",
   "Views: 2053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It had been a hard week in school, and my friends and I decided that to celebrate the weekend, we would leave school on Friday and go to my friend C's house to smoke salvia.  I had picked up a gram of 10x extract earlier that week, and was I ever itching for a chance to try it out.</p><p>We laid a matress on the floor in C's bedroom, then put a blanket over it.  C then let her pet rabbit out of its cage, permitting it to run free in the room.  I sat down on this matress, loaded my pocket-sized glass bowl with salvia, and took a herculean hit.  The smoke was probably the thickest, hottest, worst-tasting shit I've ever subjected my lungs too, but I inhaled as much as I could, and held it for 10 seconds.  To the best of my knowledge, you could hold it longer, but I felt like taking another hit.  I inhaled deeply, trying to supress my gag reflex, and then handed the bowl to C.  C's friend J, who was there to observe, left to go get snacks.  I laughed, expelling the rest of the smoke painfully through my nose.</p><p>'Feeling it?' asked C.  I was laughing too hard to respond.  My head was spinning with a sensation similar to marijuana, but my mind was completely somewhere else.  No matter how hard I tried, I couldn't seem to stop laughing.  Everything was humorous, this whole situation--crazy kids smoking dried out herbs in hopes of seeing things that weren't there..  Wow.  That was a funny concept.  The humor was broken briefly by my realization that I was very hot.  I took off my sweatshirt, and felt a little better.  That was when the trip turned really weird.</p><p>I looked down at the matress, and was struck by how angular it was.  Surely, the blanket was only put over the matress to prevent me from realizing this.  It had failed.  I knew.  As I looked around, I saw that every inanimate object in the room was drably colored and angular, but that the two people still in the room were made of curves, and were brightly colored in pastel shades.</p><p>'Everything's angles!' I informed C, trying to explain the room we were in.  'But you're not.  You're trapped in a world of angles.'  My friends laughed, which made me laugh.  But I was still serious.  'You have to understand it and escape it,' I told my friends.  'Otherwise, you'll all be angles too.'  I didn't fully grasp what that would entail, but I knew that it would be bad if people became angular.  At about this time, J returned with a box of crackers--exactly what I was going to need to make my friends understand.  I swiped the box out of her hands and pointed to the matress.  'The matress is the box,' I tried to explain.  'But you guys aren't.  You're like me, not the box.'  C cut me off.</p><p>'What about the bunny?' she asked, pointing to her free-roaming pet rabbit. I stared at the rabbit for what seemed like hours.  The rabbit stared back at me.  I burst out laughing.</p><p>'That fucking bunny!' I exclaimed, pointing at it.  'Why the fuck?  It's fucking bunny-shaped!'  I laughed for the next five minutes or so until I came down.</p><p>Overall, I would say that the experience was a very positive one.  The more I think about the trip, the more I realize how metaphorical everything I saw and felt was.  I hope to do a higher potency salvia in the future, and possibly experience more intense visual hallucinations.  That being said, the thoughts and feelings I had were very alien, and I could understand why some people would not enjoy the experience.</p>"
}
