{
 "title": "Melting Into Nothing",
 "author": "UniversalTraveler",
 "citation": "   UniversalTraveler. \"Melting Into Nothing: experience with Oxycodone, Cannabis & Meditation (ID 62242)\". Erowid.org. Nov 7, 2007. erowid.org/exp/62242",
 "substance": "Oxycodone, Cannabis & Meditation",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   "  T+ 8:00",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 62242",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 20843",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI purchased two 40 mg Oxycontin time-release pills from friend.  I have tried oxycodone before about 7 or 8 times but this time I was interested in trying my highest dose yet, 60 mg.  First, let me tell you my drug history. I have used a variety of different substances including cannabis, cocaine, nitrous, mushrooms, salvia, adderall, alprazolam, diazepam, and alcohol.  Truly though, my favorite category of drug is opiates.  I have tried opium in its raw form once, hydrocodone, and oxycodone numerous times.  My favorite opiate that I have had the pleasure to experiment with has been oxycodone, most likely because it is also the strongest.  As an aside I do not take any prescription drugs and feel that I have a very stable mentality. <br>I owed my friend P 20 mg because we had made a trade earlier in the week.  I didnt plan on doing the full 60 mg but the day ended up that way.  I brought the two yellow pills back to my room and called my friend to come over.  When he arrived I took one pill and sucked off the yellow outer coating.  This coating is not the time-release and is only used to distinguish the dosage of the pill. It is still better to suck it off though.  I put it in my mouth and sucked on it for 30 seconds and then wiped off the remaining coating on my shirt.  I could see the indentations on the pill and it was white.  Next I crushed the pill up and separated the white powder into two 20 mg lines. P did one and I did the other at approximately 1:30 pm.  I like to do oxycodone early in the day so that I can enjoy it all day.  If I do it at night then I feel like its somewhat of a waste because I cant enjoy the feeling for long enough.  <br>The first rush I felt from the 20 mg dosage was absolutely wonderful.  I felt the oxycodone about 5 minutes after snorting the line and oddly enough felt it in my arms first. They seemed to take on a weightless feeling and then I knew the rush is coming.  The feeling next runs up to the mind and wraps it in a nice warm blanket of drugs.  All worries are lifted and the world takes on a glowing look of positive energy.  I cant help but smile.  Next the feeling runs down my spine and encompasses the entire body.  Once the rush takes over my body, I lie back in my chair and exhale deeply.  When I take oxycodone, I look around at other people and think I feel so much better than everyone else.<br>The feeling of oxycodone alone is great.  Euphoria, relaxation, pain relief, everything one associates with opiate use.  However, I prefer to smoke cannabis when using oxycodone.  This increases the euphoria and sends me into a blissful state.  My friend P and I smoked cannabis soon after consuming the lines.  After smoking we listened to some music.  When using this combination of drugs, music sounds wonderful and is extremely relaxing.  Time flew by as I sat back and watched the snow fall outside.<br>By 4:00pm I was coming down from the peak euphoria and decided to do another 20 mg.  I prepared another pill and blew another line half in each nostril.  I bounced back up again to peak effects.  This was great I said to myself I think Ill stay like this all day.  At dinner that night I commented that I thought I was going to spill something because I felt so clumsy but man did I feel good.  <br>After dinner I went back to Ps room and played some Xbox 360.  At 7:00 I was coming down once again but still feeling relaxed.  I smoked some more cannabis and prepared to go to my meditation class.  Meditating on cannabis does help me concentrate but this was the first time meditating on oxycodone.  I must say it allowed me to calm my mental state down and helped me to concentrate.  I almost fell over once while nodding but caught myself and regained focus.  During the guided meditation relaxation I was in complete bliss and felt rejuvenated and the effects of the oxycodone were almost nonexistent.  <br>After my meditation class I went back and blew the last 20 mg line at 9:30 pm.  I returned to euphoria but it was not as intense as the first 20 mg at 1:30.  Nothing is ever as good as the first line.  I chilled out and watched some television and smoked some more cannabis.  Went to bed at 1:30 am and had a wonderful relaxing sleep.  <br>Oxycodone is a great substance and probably my favorite drug.  The feeling I get while on oxycodone is the best I think a person can feel.  The only real side effect of the drug when used alone is addiction.  Oxycodone is powerfully addictive and the next day I did have cravings for the drug.\n\n\n"
}
