{
 "title": "Space Party",
 "author": "Yuri_gagarin",
 "citation": "   Yuri_gagarin. \"Space Party: experience with Mushrooms (ID 62276)\". Erowid.org. Oct 7, 2009. erowid.org/exp/62276",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "4 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2007",
   "62276",
   "Male",
   " ",
   "21",
   "Oct 7, 2009",
   "Views: 2296",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>background: I'm 21 years old, male, and I consider myself a relatively experienced drug user. Substances I've tried include mushrooms, lsd (25 times or so, my favorite), MDMA, marijuana, mescaline, cocaine, 2c-fill-in-the-blank, DMT, various multicolored pills, you get the idea. This particular occurance involved 4 grams of psilocybin mush at an IDM/glitch rave in Mountain View, CA, and was written in retrospect the following morning.</p><p>11:00pm - Gobble 4 grams of shrooms in the back of friend's car (driver is sober)</p><p>11:30 - me and my 3 roommates grab will call tickets, enter the massive NASA hangar that the event is being hosted at. Feeling lots of energy tingling in different places around my body, similar to past mushroom come-ups. I guess they call it 'coming out of your skin'. Very quick come up, I can tell this is going to be one hell of a trip</p><p>1:30am - The main act Plaid finishes, absolutely incredible. I had been dancing and enjoying myself, feeling like I smoked 10 blunts although no marijuana had been ingested. In fact, I did not smoke the entire evening, since the event was on federal property. The owner of this NASA facility comes on stage with a tall black wizards cap and a staff and starts talking about how we're going to the moon and mars soon. At this point I start to notice that I'm tripping harder than I ever have in my life, as the guys face on stage is distorting and I can't understand a goddamn thing he is talking about. I hear mostly gibberish with relevant words spliced in as brief moments of clarity, similar to past LSD experiences.</p><p>I look at my friends face and I see 3 eyes where each should be with 3 on his forehead. Many things around me break into prismed patterns, and the music beings to completely overwhelm me. We're standing in the front next to the god knows how loud sound system. I try to dance but everyone around me beings to change in frightening ways. This one character wearing a pink fuzzy suit looks like he has 4 arms and no feet and is cartwheeling around me laughing hysterically. People's skin starts melting off their faces and limbs, exposing multicolored bones that look very translucent as if looking through the skin. These skeleton ravers were being sucked into me and spit out behind as I got close, although I think I was just bumping into everyone like a dumbass. Just as a person would pass me I would see their bodies sprout limbs or start degenerating or aging rapidly in front of my eyes.</p><p>2:00am - The next DJ's are a hip hop/glitch outfit that totally blow my mind. I start stumbling around the back of the hangar I guess, not really in control of my body by this point. I feel no sensation in my body, although I can feel pressure in my stomach because I have to urinate. The problem is that I cant conceive of the idea of peeing or toilets so I just deal with the discomfort. I feel like my mind is being carried off and chopped into pieces by the glitchy clicks and cuts coming from the main stage. I feel like I'm being sucked into a big vortex as I stumble in a circle around the place. As I look at anyone their bodies change and morph, melt and change colors. Things start to get pretty scary as most people look like multi-armed skeletons, but I keep telling myself I'm just tripping hard and try to deal. I can also stop the hallucinations briefly by simply changing the direction of my wandering around, as it seems to take several seconds for things to start getting really freaky in my field of view.</p><p>I lose track of time and any idea where I am. Peoples transparent bone arms start to form into knives and sharp points as I walk past them, and I can see liquid goo in all the trash cans. There is some metal robotic NASA stuff around that completely looks like weapons or demonic torture devices, but I stear clear and am not afraid. Every surface is covered in kaleidoscopic circles bending into each other. The vividness of this candyland I've found myself in can only be compared to the single time I smoked nn-DMT, with patterns not only moving along the surface but also appearing to wobble towards or away from me like liquid. I spend a great deal of time staring at these surfaces, trying not to look at people to prevent them from changing into frightening abominations.</p><p>I keep thinking I see a huge swarm of police officers coming towards me, and then they rise up in into the sky and float away. At around now I experience the peak of the trip, and lose all concept of my body or where I am again. I feel my mind traveling all over the place at high speeds, being absolutely assaulted by the music and taking each sound as a stimulant to push me in several directions. I find myself staring intently at the night sky, with a full moon and clouds undulating. This loss of self brings me immense indescribable pleasure, but something keeps driving me to look down. Each time I distract myself from the perfect open sky I see dancing jesters and knife armed clowns. I lay on the ground and close my eyes, feeling as if I melt or sink into the ground and lose all concept of time and space.</p><p>3:00?? I come to with one of my friends shaking me. I say I'm tripping harder than I ever have and keep asking him if he's real. As I stare into his familiar face I feel dragged back into reality for a brief moment, before it starts melting and changing. I can't deal with this and start wandering around some more. I find a large area of couches and collapse, staring off into the swirling ground in utter disbelief and awe. I feel like I'm coming down a little bit.</p><p>4:00 - All patterning has stopped, but I'm still unable to believe that what I'm seeing is real. I cannot integrate the experience at this point. My friends drag me to the car, but I think that they are strangers in the hallucinatory guise of my friends and might be tricking me. I get really tired on the way and stop caring who I'm going with, get in the car, and fall asleep. This was the most intense spiritual experience of my life. I felt like the entire area I was inhabiting represented my mind, and several characters I encountered seemed to correspond with inner fears and thoughts. I haven't tripped in 8 months, and feel like I've learned a great deal in the time between. Perhaps this mental change caused the intensity, but either way I feel like I just got back from Mars and it was absolutely shocking and awesome.</p>"
}
