{
 "title": "All This Nausea, It's Not Worth It",
 "author": "MrNorway",
 "citation": "Citation:   MrNorway. \"All This Nausea, It's Not Worth It: experience with Ethylmorphine (Cosylan) (ID 62287)\". Erowid.org. Oct 25, 2007. erowid.org/exp/62287",
 "substance": "Ethylmorphine (Cosylan)",
 "bodyweight": "82 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Pharms - Ethylmorphine",
   "(liquid)",
   "  T+ 1:30",
   "  ",
   "oral",
   "Pharms - Ethylmorphine",
   "(liquid)",
   "  T+ 2:30",
   "  ",
   "oral",
   "Pharms - Ethylmorphine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 62287",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 25, 2007",
   "Views: 9289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been having a pretty lousy day, and for the first time in a long, long time, I dont have to drive or be in public tomorrow. Life's been harder than usual lately. I've got a bunch of important exams coming up, but have a hard time studying. I might be getting on ritalin soon, as I apparently have adhd. Which is killing me and I haven't told anyone (seriously, not even my parents)\r\nAnyway, I had a leftover bottle of cough syrup with ethylmorphine (more potent than codeine, less than morphine), and decided to empty it (200mL left, which equals 340mg e.morph., medical dose is 17mg).\r\nI've had some limited experience with opioids before, but never this big a dose, and never with this particular drug. I'll be logging the effects, hopefully remembering to write them all down.\r\n+ 00:00 Dose taken orally. Didnt taste too good, but not that bad either, didnt feel like throwing up or anything. Just somewhat nauseous, due to the sugary syrup.\r\n+ 00:30 I'm getting quite itchy, very dizzy and abit sleepy. The itch is really quite bad, but I somewhat successfully manage to suppress the need to scratch it. I feel somewhat more at peace, but defineatly no euphoria yet. Gonna start watching a movie now.\r\n+ 01:00 The itching was horrible about ten mins ago, but now it's subziding. Instead I'm feeling at peace, relaxed and feel like just lying in the couch just doing nothing. Not feeling like doing anything! Its a  great feeling, I ususally feel like doing, well, everything.\r\n+ 01:30 Took, another 50mg. No status change. Definetly feeling high, yet not quite as much as I had hoped.\r\n+ 02:30 Took another 50mg, which brings me up to 320mg in total. \r\n+ 03:00 Finished the bottle, last 30mg. Getting really sleepy now.\r\n(The rest is written the following morning)\r\nI think I went to bed around + 05:00, fell asleep instantly, woke after sleeping 7 hours, feeling absolutely great. But when I got up, I got extremely dizzy and nauseous, felt like throwing up, but managed to get back to bed. This happened like five or six times, waking up feeling great, then feeling horrible. It's + 18:00 now, and I still feel pretty bad, kind of like an alcohol hangover. Might still throw up..\r\nAll in all, definetly not worth it. It felt good for a while, but with all this nausea, it's not worth it.\n\n\n"
}