{
 "title": "No Longer Here, But Still Present",
 "author": "Pypebomb",
 "citation": "   Pypebomb. \"No Longer Here, But Still Present: experience with Salvia divinorum (ID 6229)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6229",
 "substance": "Salvia divinorum",
 "bodyweight": "11 kg",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6229",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 5720",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently got hold of a free sample of Salvia.  I was anxious to try it so that night I decided to use it. I took three hits from a large bong and held the last one back for about 20 seconds. It was very hard to distinguish the exact moment but at some point I realised that everything seemed quite different. My arms seemed 2-D and when I closed my eyes, the rounded base of the bong which had been warmed by my hand reminded me of a kind of energy ball. It all seemed very real. Then, when I opened my eyes again I was no longer in my room. I was but everything was different. Im sure you know what I mean if you are experienced with salvia. I couldn't tell how far away anything was. I looked In my hand at the lighter I was holding which seemed very strange. I didn't know what it was for but all I knew is that I just HAD to put it on my bedside table. God knows why. </p><p>While my hand was on the way there I suddenly forgot why I wanted to put the lighter there. I sort of froze, looking at my outstretched arm which seemed to stretch into infinity. I just dropped it to the floor, thinking about the physics involved as it fell. Everything seemed simplified and extremely complicated at the same time. My room is in the converted loft of our house and there is a hole in the floor to get in and out of. I looked at this hole and it seemed to have surface. Its hard to explain. I 'heard' a voice telling me hole=bad. The 'voice' was telling me to stay away from it. I didn't know why at the time but It was because I didnt want to fall down it. It was like a real strong emotion telling me to stay away from it. The next thing that happened was strange, probably the strangest experience of my life so far. My brains associations got extremely 'crossed' . Like one thought would be connected to a completely irrelevant one. </p><p>At this point I didnt know where I was, who I was ,or what I had taken and didnt really give it much thought at the time. I would look at an object and random thoughts would come flying at me. Then I could barely distinguish different objects, just shapes that the straight edges of the table legs made with the floor. Like an L shape. This L shape brought images of the icon of a local TV station. Why this happened I can only explain as a total state of randomness and confusion. Totally random thought rushed past me, but apart from the very strange TV icon, I couldnt catch any of them in my memory. I began to return from salvia world. I looked at the TV which was switched off at the time, although I didn't know it as I didn't even know what it was. My mind seemed to regard the TV as a Teacher. I got the impression that it was trying to teach me something important, but I couldn't understand it. I experienced a really strong sense of the 'truth' being very near. As I became more and more sober I felt as if the TV was shouting louder and louder, desperately trying to make me understand, but I couldn't.  The whole experience lasted about 20 minutes but it seemed more like 2 or 3. </p><p>This was one of the strongest drug related experiences of my life, even though I think it was only a 2 on the S-A-L-V-I-A scale. The experience itself was neither pleasurable nor negative, but the thoughts it provoked were definitely positive and very interesting. It has given me an insight into the power of this plant. Anyone doubting the power of this legal herb should tread cautiously.</p>"
}
