{
 "title": "A Calm Introspective Night",
 "author": "Omni",
 "citation": "   Omni. \"A Calm Introspective Night: experience with LSD & Cannabis (ID 62438)\". Erowid.org. Jun 29, 2007. erowid.org/exp/62438",
 "substance": "LSD & Cannabis",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "62438",
   "Male",
   " ",
   "Not Given",
   "Jun 29, 2007",
   "3601",
   " "
  ]
 ],
 "report": "<p>Let me start off with basics about myself,</p><p>Gender, Male</p><p>Weight, 240 lb </p><p>Height, 6'1</p><p>Age, 17 (DOB 89')</p><p>No current medication(s) that could possibly interact with substances ingested.</p><p>Previously used Substances - Cannabis (daily), LSD (several times), LSA (twice), MDMA (over a 100 times), Heroin (period of depression for me, 20 or so times), Cocaine (not sure, on and off with addiction), DMT (twice), and Opium (countless times, usually mixed with cannabis when around)</p><p>Recently inquiring to a friend of mine, T, he notified me that some tabs have found there way around where I live on the east coast. This is rare around here recently. I have used LSD several times before, about 2-3 years ago it was in ready supply around here (east coast of US). Jumping on this chance, I drive up to my friends house and grab a 10-strip of tabs from my friend T. I only planned to eat one but one of my friends who wanted a tab bailed on me, so I ended up ingesting two. My friend T told me his dealer told him they were 100 ug each but, as we all know, this is probably not true, and just an estimate. [Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.] Getting T and his girlfriend A into my car, we drove to my friends and we sit around Ms (another friends) house, and dropped around 7:00 pm (we were waiting for everyone to get out of work).</p><p>7:00 pm: I ingest two tabs, letting them sit in my mouth for about 15 mins. Myself, my friend T and his girlfriend A go to papa ginos to grab a bite to eat, leaving M and the rest of my friends behind, with a promise of return.</p><p>T+15: I can feel energy running through my body, particularly my spine and chest. I am excited like always before any psychedelic experience. The anticipation is great, I ate about 2 slices of pizza and 4 cheese bread sticks. This is all I had eat all day. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>T+40: Driving back to my friend Ms house to relax, I can definitely feel and sense a difference in my pattern of thoughts and the way things feel. Lights glow on the road, much brighter than before. As stupid as I am, I have driven on many substances, and I was driving through out the entire night with no problems, but I am experienced. This is still not a good idea and everyone reacts differently to different substances please be careful.</p><p>T+45: Arriving back to my friend Ms house, everyone has dropped at least 1 or 2 tabs of this acid. We can all definitely feel it coming on, and we are all taking turns playing Xbox 360 playing Tom Clancy Rainbow 6 Las Vegas. I start to notice slight visual distortions during the game and a faint visual of a fractal pattern, at the time it reminded me of the Golden Spiral, on my friends face. This makes me excited because I know its starting to kick in and Im still coming up.</p><p>T+1:12: The videogame has become too much and I cant understand it anymore. I remember the controls, but my mind doesnt want to understand it or play the game anymore. I sit back while everyone else plays it and gets to the same point. Eventually the game is turned off. </p><p>T+1:30- The group goes outside Ms house to smoke cigarettes, Im the only one who doesnt smoke cigs, but I light up a bowl after everyone finished, and 3 friends match me. Cannabis definitely enhances and sets off the LSD. Everyone said it kicked in way more and that their senses were overwhelming. A couple of my friends said they had to sit down. The sun had already gone down and we were kind of disappointed about it, but then we immediately had a realization that the moment we were in was just as beautiful as well. I remember sitting outside, and thinking about living in the now and enjoying everything that we have, and how lucky and fortunate we are.</p><p>My thoughts are full of ancient Greek and Roman times, how they used to live and how far we have come from then, our similarities and differences and what we have borrowed from them and etc. I have an interest in Greek and Latin, and studied both for a couple of years, but when I thought about it outside, and I was discussing it with my friends, we completely got into it and we were focused, it was almost like a Socratic seminar, where we all took turns talking and posed questions and gained further insight. Strange how acid works like that, my group of friends are usually happy with cracking dumb innuendos and puns, and now that we dropped acid, we are all talking and gaining deeper insight about our history, about our civilization and ourselves. Strange...</p><p>T+2:00- Ms little brother stops by with his girlfriend and his friend. They are all clearly drunk, and we help him out of his car. This freaked out a couple of the girls who dropped acid, thinking about the horrible things that could of happened if he was to get into an accident. Once hes inside, we took his keys away and I gave him some of my grass to make him content. My thought was, who would want to drive anywhere when youve got your girlfriend, drunk, house alone, and some grass? </p><p>T+2:30- We need more green. Its about 9:30 (I remember looking at the clock when I got in the car). I call my friend P and drive to the next town with my friend T to grab about two zips of green. No particular thoughts stand out in my mind about this moment- no great insight. Still- General euphoria, laughing and giggling. T and I talk of memories and great things to come, and how much we both care for each other and how we're good friends. I put on Fantomas (first cd, forget the title?), which proves to be too harsh and crazy for my friend T so I end up with the usual Boards of Canada.</p><p>T+3:10  I meet up with my friends at a convenience store, Ms parents have come home and kicked everyone out, and took all of Ms beer (two 40 racks) away. This causes negative vibes when I arrive at the convenience store. There are about 10 kids tripping off LSD, a couple arguing about loosing money on the beer, a couple spacing out, some giggling. We all look ridiculous and I know it, but I dont care at the moment. I tell everyone to hop into my car and thiers, as M has his own truck and we go off to my friend Js house to smoke more green. </p><p>T+3:35?- We all quietly sneak down stairs to not piss off Js parents and go into his heated garage, I remember counting 13 kids now. The setting is calm and comfortable which makes it much easier on everyone as we are all comfortable around everyone. I do not remember or recall at all how much grass we smoked but it was large amount. I think we smoked 4 blunts and at least 6-7 bowls, and a couple of joints. We were all incredibly ripped and twisted. Everyone was smoking cigarettes and all we could do was say stupid statements. I remember my friend T saying So were going down, and uhm, so the beach is cold- but whos driving this damn bus? I could understand that he was trying to say 3 things at once but they all came out and got jumbled. Everyone was either studdering or at least, paused and had difficultly articulating their thought process. T just laughed and I understood him when he tried to speak. We proceed to head to a beach near by Js house, about a 2 min walk down the street, after the garage got too filled with cannabis and cigarette smoke.</p><p>T+4:00-4:10?- We arrive at the beach only to realize there is a couple there, no one can even tell if theyre real or not (its a bit foggy), some of my friends in the group yell at them and ask stupid questions like Are you real? Are you both girls or guys? Or both?! The couple is obviously real and understands that were on something. I feel like I have to explain to them whats going on and apologize but when I go up to explain everything the kid just stares at me blankly and walks away mumbling to his girlfriend Stupid fucking hippies and their drugs. Which makes me sad, not upset as Id usually be, cause it made me think that he had no idea what LSD can do for some people, or drugs in general. It set off a train of thoughts and insights on people and ignorance.</p><p>We all sit around and look at the stars, and watch the water ebb and flow. I forget and don't care about the couple anymore, thinking it wasn't important, that in time, all things change, and people will realize what we see someday. It amazes us and we all talk about different insightful things. I feel a slight tinge of enlightenment when I realize- or rather feel this sense of, being able to look at things in a very large manner, seeing how everything fits together. I feel like I can connect with everyone, and be one with them. We all sit in silence for a little bit and feel out this great vibe.</p><p>T+5:00- its about 12:00, and I arrive at Ts house to chill out for the night, the rest of the group either has other places they want to go, or decide that they want to be alone with their spouse, as everyone was there with their girlfriends, besides me, she was out of town at the time with her family. I sit on the couch and write poems and play music (bass guitar), while T and his girlfriend experience psychedelic sex, which is one of the best ways (At least, for me, Id say.)</p><p>At this point Ive only had minor visuals, melting- ebb and flowing visuals. Distortion of proportions and brightness of lights and such, since I have used LSD before I know that being in the dark greatly enhances the vividness of the visuals. I put on Tools Lateralus as my soundtrack, and turn off the lights. I smoke a joint and invite T and his girlfriend A out to smoke but they refuse saying they dont need any more. As I lay on Ts couch, I stare at his ceiling and see fractals, they are not extremely vivid, but still much more vivid than before. I enjoy this very much, and I proceed to stare at his ceiling for about an hour and a half, enjoy the subconscious, and metaphysical geometrical shapes. The most notable one that I saw again was the Phi (golden ratio) spiral. I saw it, and it came closer, growing ever closer, and finally encompassing my view. I closed my eyes and it stayed there, I just simply enjoyed it and let it flow through me. I felt universal energy.</p><p>I flipped open my eyes. I had the sudden realization and reaction to lay on Ts roof. 'This is the first time weve had great weather, its 65 outside.' I remember thinking to myself. I rush to the window and I remember being so incredibly happy, I grab a pillow and thick blanket. The roof is right by one of the windows, and I can lay right on it, its flat. I sit for a very long, long time, just rolling joints, smoking them and thinking about the universe. I am very into philosophy, metaphysics and other subjects that are not very down-to-earth I guess you could say. I am not sure how to describe it. I will talk about insights I remember at the end of the report.</p><p>T+8:00- I go back inside, and roll another joint, making tea to sooth my extreme cotton mouth. My friend T and his girlfriend A are watching TV which I suggest is a terrible idea, but they do it anyways and watch some mindless infomercial for a long time. I go into the other bedroom and enjoy my tea, putting on more music to block out the mindless chatter of the infomerical. I put on The Grateful Dead, Axomoxoa? I finish my joint and put the roach in my chillum for later. I lay in bed, very tired at this point, thinking about the night and how long its been, and all the things Ive done. Visuals are still present and I contemplate smoking more grass to chill me out but I decide I have to just stay away till I can sleep, the Acid wont let me. Its about three in the morning, and I dont fall asleep for, what feels like forever, but I think about an hour I finally slip into a dreamless sleep.</p><p>T+15 hours- I wake up at 10:30 the next morning, getting about 6 or so hours of sleep. I am exhausted as all hell and take an Excedrin to sooth my headache. I drink juice. I can still feel my LSD slowly moving energy around my body. I smoke a joint and my chillum pack, call up my buddies and say happy 4/20. The entire crew that took acid the night before goes to Ts house to celebrate the holiday. After we all smoke, we realize that smoking activates what little left of our trip was there. We all notice this and talk about it, not really minding it. It is a beautiful day, we spend the day outside smoking and have a big cookout, but 4/20 is a different story though.</p><p>Insights through out the trip,</p><p>The idea of dualism- How things need to return back to one, and will always fight to go back there. All things try to become equal and that is the way of the universe. We are only trying to go back to the one- God. Which I realize, is us. We are all part of God, we all want to have equality in our life, even if were greedy or generous. Were simply filling in the parts of ourselves that make us happy- and feel whole. Love does this. Love binds all. I look at the stars and realize- we are stars. We are from stars, we are all part of this one, beautiful giant chaos. We should be happy for what we have and enjoy every moment of our lives, what is there to waste? I contemplate these thoughts and my other thoughts over and over again after the trip. I have more thoughts, but this report is quite long as it is.</p>"
}
