{
 "title": "Much Better Extraction",
 "author": "Rhaven",
 "citation": "   Rhaven. \"Much Better Extraction: experience with Lactuca spp. (ID 62455)\". Erowid.org. Sep 14, 2007. erowid.org/exp/62455",
 "substance": "Lactuca spp.",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "smoked",
   "Lactuca spp.",
   "(extract)",
   " ",
   "5.0 ml",
   "IV",
   "Lactuca spp.",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 62455",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 14, 2007",
   "Views: 22055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nContrary to another experience report here, I do not believe the active components (lactucin, lactucopicrin, and possibly lactcic acid)  of L. spec. are not effectively extracted by acid-base extraction used for most alkaloids.  All of these active components are at least slightly acidic containing one or more carboxyl groups, so they are more solubable in water as a basic salt than in their acid state, thus they are in a way the opposite of alkaloid which are alkaline.  All are also soluable in water in their acid form, so base-acid extraction also doesn't work.  \r\nSeveral sources claim lactucerin to be the primary inactive ingredient in lactucarium(the dried form of the milky liquid that flows from the stem).  Liturature, most of which dates from the turn of the century, states that lactucerin is insoluable in water, lactucin, lactucopicrin, lactucic acid are soluable in water and alcohol to some degree, and that lactucin can be isolated by extraction with cold alcohol.\r\nProcedure:\r\n1. about 50g of fresh L. spec. were placed in blender with 5g of baking soda and 2 cups of water and blended until of even consistency with no peices much larger than a grain of rice.  This should yeild a mix of sodium salts of active components.\r\n2. The mixture was thouroughly filtered through cotton and coffee filters, the solids were returned to blender and extracted with 1 cup of water.\r\n3. Water portions were combined and extracted with mixed petroleum distilates which were discarded.\r\n4. Water was evaporated on low heat over 36 hours, yeilding tan, crubmly solid.\r\n5. Substance was smoked off aluminum foil with a toilet paper tube, produced signifagant sedation but little euphoria or other thought alteration compared to opium or heroin, smoked.\r\nProcedure 2:\r\n1. 12g of fress L. spec. was placed in freezer with .5 cup anhydrous alcohol, made using MgSO4, this was allowed to sit for 2 days with occasional shaking, yeilded almost clear liquid.\r\n2. this liquid filterd and allowed to evaporate at near room temperature until dry, yeilding off-white clear crust.\r\n3. this was partially redisolved in 1/8 cup anhydrous alcohol at near 0C which was evaporated at room temperature to yeild pure white crystals\r\n4. these crystals were disolved in 5 mL hot water and injected over 5 min. as 3 shots(the water had to be kept hot for it to remain in solution, it became cloudy immediately after removing from heat).  Produced sedation and a good warm fuzzy fealing, fell asleep soon afterwards, but with sufficient willpower could have remained awake.\n\n\n"
}
