{
 "title": "Rush Isn't That Great",
 "author": "Starcraft",
 "citation": "   Starcraft. \"Rush Isn't That Great: experience with Morphine (ID 62501)\". Erowid.org. May 4, 2007. erowid.org/exp/62501",
 "substance": "Morphine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "IV",
   "Morphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62501",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "May 4, 2007",
   "Views: 36320",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: Im a college student, science major, second year community college, always been curious of the altered states of consciousness. I hold a job, as well as maintain a 3.0 GPA, and have hobbies, so drugs are not my only hobby.  I have many experiences with many psychoactive substances. I started during my junior year of high school with marijuana. Then proceeded with experiment with nitrous, dxm, MDMA, LSD, mushrooms, DOB, 2C-I, mescaline, amphetamine, methamphetamine, cocaine, Ritalin, valium, xanax, k-pins. etc..Then finally my favorite class the opiates, having tried darvacet, hydrocodone, codeine, hydromorphone, oxycotin ,heroin, morphine. This is the first time Ive ever decided to IV a drug. </p><p>Mindset: Ive been recovering from a flu for the last week, and almost fully recovered. My parents is gone on vacation for a month, so nobody is here to bother me. I was at home bored in my room with a philosophy paper due later that night. I figured I may as well try something new. </p><p>Preparation: I took spoon and heat sterilized it, I learned this technique in microbiology class. Then farther added alcohol to ensure its germ free. I then washed my hand with alcohol so its clean. I took 1ml of tap water, and placed it into a spoon, then added half of  a water soluble morphine pill, the ones without wax. I heated the pill under a lighter flame and brought it to boiling for 15 seconds. I wrapped a small cotton ball into a insulin syringe, then proceeded to suction the solution. The shot is ready. </p><p>Injection: I disinfected an area on my right arm, and inserted the needle into the arm. I did hit the vain, but due to anxiety, I pulled it back out. I did not intend on injecting my right arm. I located my left arm, and the vain. I proceeded a second time, this time I missed the vain, and produced a small bump. Frustrated I located another vain, inserted again, and didnt hit the vain. I finally took another try, aiming the needle in a horizontal manner. Finally blood started flowing into the syringe, I knew I hit the vain, I pushed the plunger and relaxed. </p><p>Experience: Within 30 seconds I feel a gentle wave of warmth wash over my body. The rushing sensation feeling I hear about when injecting. Although I expected more. In less than 15 minutes the rush disappeared and Im left with a morphine high. Describe as warmth, euphoria, apathy, serenity, peace, calmness, etc</p><p>Im 2 and a half hours into the experience, and I can tell that the morphine high is still here but isnt as strong. </p><p>Conclusion: I wanted to conclude that IV morphine isnt that great after all, the rush wasnt what I expected to be. I describe it as a little stronger than snorting 100mg of morphine. It was not worth the trouble of having to go though all the preparation, then the missed shots, and so forth. Your better off snorting a high dose of morphine, plus it last longer. I dont intend on touching the needle again. </p><p>Be careful as opiates are known to be highly addictive chemicals, its easy to overindulge.</p><p>~SC</p>"
}
