{
 "title": "Late Night Parties and Everlasting Cigarettes",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Late Night Parties and Everlasting Cigarettes: experience with Datura (ID 62502)\". Erowid.org. Jun 14, 2007. erowid.org/exp/62502",
 "substance": "Datura",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "150 seeds",
   "oral",
   "Datura",
   "(fresh)",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "62502",
   "Male",
   " ",
   "Not Given",
   "Jun 14, 2007",
   "45249",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The first encounter with the all to evil substance known as Jimsonweed was in March of 2005. My brother and a neighbor girl were running around the soybean field eating various seeds and the like, so I followed them and took part in this childish act of eating anything that they come across because I was very intoxicated. While in the midst of this game I came across an evil looking plant. This plant had an amazing aura about it. It gave me the chills looking into this four paned orb from hell. It can only be described as satan's rattle. A large brown orb covered in wicked spikes and opened with small round black seeds with a curious dimple in the middle. </p><p>I stood in awe at my new discovery it made me feel so awkward just to be standing in front of such a demonic looking plant. It made me want to turn and run from it, yet I was strangely being pulled into it. The next thing I know I am gobbling down these seeds and going from pod to pod and devouring all that the plant had to offer me. I thought nothing of it and moved on with the game. I went back to the house and smoked a joint and drank a can of Budweiser, and then lay down to go to sleep. I awoke in a cold sweat at 4:15 am and my body was on fire. </p><p>I looked at the foot of my bed and my two best friends were standing there. I started laughing hysterically at the fact that they would stop by and wake me up at such a late time. I preceded to have a little party in my room with them they came up and sat on either side of me and we had a great time passing joints and smoking cigarettes. I paused the little shindig and went to the bathroom. I used the bathroom and while washing my hands I looked in the mirror and my face contorted to an impossible shape and I shook myself off and splashed some water on my face, still none the wiser to what was happening. I walked back to my room where at my door my mother was standing. I greeted her and informed her that my friends had stopped by for a late night visit. She gave me the weirdest look I think she has ever given me. I re-entered my room and my friends were no where to be found. </p><p>Suddenly I went into a panic and started to tear my room apart. I searched high and low expecting them to be hiding, but of course they were not. Then out of no where I just blacked out. </p><p>I awoke the next morning and I was naked on the living room floor with a blanket over me and the house had been destroyed. My parents were sitting on the couch together looking at me and talking. I looked up and I couldn't understand a word that they said though. Every word that they said sounded like they were speaking in reverse. Suddenly I sat up thinking that my parents had gone insane. I tried to stand up but failed horribly and just flopped back onto my back. In my mind horrible thoughts began to swirl around. Thoughts that my parents had slipped my some drug while I was asleep and where speaking in a secret language so that I wouldnt be able to know what else they had planned for me. </p><p>I don't believe that I have ever felt that scared in my entire life. I felt so alone and empty, like I was deserted on some horrible little island and that it was slowly sinking. I lay their for some time just thinking and soaking everything in. For some odd reason I always had a cigarette in my hand that would never go out or need to be ashed. After a while I drifted back to sleep.</p><p>When I awoke I was in my father's car and we were driving down this dark road that seemed to be covered in oil. It felt like we were floating above the road and sliding from side to side. I looked at him and tried to say something but it came out as an inaudible squeak of unintelligence. He looked at me and his beard seemed to grow longer as he looked into my eyes for eternity. It seemed as if time had stopped dead in it's tracks and for a minute everything seemed to be fine. Then all of a sudden I hit reality again and hard too. It was like time had been still but then had to fast forward to catch up with it's self. Then smack back into the car and back to my insanity. I turned and looked into the mirror and my reflection looked at me and started laughing at me. My reflection had this maniacal grin as it laughed in my face seemingly mocking me and my tortured reality. This sent me into a rage that I could not hold back. </p><p>I lashed out at the mirror trying to tear it off the side of the car. My father just hit the automatic window and up it went and I couldnt see my reflection anymore. It was like staring into a mirror and no one is there to stare back. So my attention went from the mirror to my hand where a freshly lit cigarette sat waiting to be smoked. This made me feel all warm and fuzzy inside. I smoked and smoked and smoked and again the cigarette never burned down any. </p><p>Eventually we arrived at our destination, The Asylum. We got out and I looked up in awe at this towering structure, it seemed to go forever up into the heavens above. I felt a strange sense of omnipotence, like I was capable of doing anything, walking through walls, flying, etc. I walked tall into the hospital babbling about the higher power and how I was returning home where I belonged. We walked in and sat in the waiting room for what seemed like days. Finally this nice angel lady came out and whisked me away to what I believed to be my rightful place on the throne of the heavens. Well I was wrong because before I knew it I was being sedated with halidol.</p><p>When I awoke again, I had some of my senses back and I realized where I was. Everything just felt like a dream, it seemed like none of the events of the last two days had even happened. I guess I was in shock at the fact of being in a hospital and why I would even be in such a place. Well I ended up spending the next two weeks in the inpatient psychiatric program being evaluated and medicated. Eventually I completely came back down and seemingly stabilized. Since my insurance wouldnt cover any additional time for diagnosis I was released with and incomplete diagnosis. I eventually put one and one together and realized that the evil demonic plant that I had ravished had been the culprit in this horrible turn of events.</p><p>Since then I have experimented with Datura several more times. Once more I ended up in the hospital off a much larger dose and after that I learned a more correct dosage of datura and how to deal with the alarmingly realistic hallucinations and delirium.</p>"
}
