{
 "title": "Wonderful Synergy",
 "author": "tomber",
 "citation": "   tomber. \"Wonderful Synergy: experience with Adderall & 5-HTP (ID 62545)\". Erowid.org. Dec 15, 2007. erowid.org/exp/62545",
 "substance": "Adderall & 5-HTP",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Amphetamines",
   "(daily)",
   " ",
   "100 mg",
   "oral",
   "Tryptophan",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 62545",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2007",
   "Views: 22276",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHere are my initial findings regarding the pair up of 5-HTP with my Adderall scrip.\r\nI am an adult male, 38yo 185lbs., and have moderate experience with Meth (10 times) a few years ago. I was recently diagnosed with ADHD, and Adderall has made a huge improvement with my ability to function in an adult-like manner.\r\nThe Adderall is great for my thought processes, but horrible on my body. My PDOC put me on Dexedrine for 1 month, but those were like sleeping pills to me! I have been on the same Adderall 20mg dose for over 1 year, and I have found that my body is suffering. I get shaky, achey, and a general pseudo-alertness that does not compare to a great night's rest.\r\nI read info about 5-HTP, and decided to give it a try. My hope with the 5-HTP was to help with relaxation, since the addy's make my body tense. After 3 days of 100mg 5-HTP taken in the mornings, my mind and body opened up. The synergy I feel between my thoughts, emotions, and full body energy are wonderful. Whereas on Adderall alone, my thought processes are improved over no drugs, yet my body feels disconnected at times. There are times when the Adderall makes me feel great, however I never know what I am going to feel from day to day. Maybe that has something to do with excess Dopamine flooding, which leaves little room for Serotonin action?? I know Meth acts in the same way as Amphetamine, with the added bonus of some minor Serotonin stimulation, so maybe this is a connection??\r\nActually, I started thinking about how much my new combo feels like Meth. On Adderall alone, I would get a loopy, drugged feeling at times. With Adderall + 5-HTP I feel crisp, alert and energized. I remember this same feeling from Meth. Not high, just perfect, sharp, mentally focused (the part I need for ADHD) and full of energy. So, it must be that Dopamine flooding alone is not such a good thing, and having a Serotonin boost from the 5-HTP helps the Adderall to mimic Meth.\r\nOne other thing to mention. If I ever ran into a night with little sleep (less than 5 hours) I remember Meth would get me through the day feeling normal. I have found Adderall to be woefully inadequate in this regard. The fake body stimulation is really draining... unless you take it along with 5-HTP!!! Got me through the day with only 4 hours sleep. =) Honestly, Adderall should not be scripted without 5-HTP IMHO!\r\nAlso, with the 5-HTP, my mood is better, I am MUCH less prone to agrivation, agitation, and I sleep deeper and dream more. An added bonus is I don't have the nasty comedown from the Adderall at the end of the day. I'm keeping my fingers crossed that this combo will remain through the weeks/months.\n\n\n"
}
