{
 "title": "Death, Epiphanies, Then Stupor",
 "author": "Jammin Wheat Bread",
 "citation": "   Jammin Wheat Bread. \"Death, Epiphanies, Then Stupor: experience with Mushrooms & Cannabis (ID 62603)\". Erowid.org. May 20, 2007. erowid.org/exp/62603",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 2:25",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:50",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 62603",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 20, 2007",
   "Views: 4330",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nGreat mushrooms first semester freshman year of college.  They were large and obviously well grown, with streaks of blue, and the top of the cap was bumpy, only slightly convex and was a light brown which got darker towards the top.  About ¾ up on some of the bigger stems was what I think is called a mycelin ring.  My friend pointed out what he called an elephant foot formation at the bottom of all the stems, because they did look really different and resembled a paw or foot or something.  The smaller ones were closed caps.  That probably doesnt help for ID purposes, but he said he thinks they were cubensis.  He boasted that these were his prize shrooms, and told me that he never had anything so potent, and warned me to be careful with them.  I got a half ounce.  I got pulled over on the way down, wreckless driving on highway 74, and saw my life flash before my eyes which may have contributed to bad vibes that would come later.\r\nWhile driving I kept thinking about how good the shrooms looked and called my friend who well call S who had been wanting to try it for a long time, and said he would when I got back.  When I arrived on campus, I met up with S and we went off to the cafeteria to eat the shwaggity food.  I just made myself a small salad.  I had done shrooms 4 times before this, smoked daily, and had done dxm and diphenhydramine countless times and thought I could handle the shrooms with an almost empty stomach.  I never got visuals on shrooms even though my friends had after eating the same amount.  They would get visuals and still be functioning more normally than I would be.  Anyways I wanted this to truly change my life.  \r\n6:00 - So we go back to the dorms, and I make ramen and take out the noodles and throw in the shrooms. I do an 8th, S does a 1/16.  Worst tasting shrooms Ive ever eaten. S thinks they taste good and I think hes lying.  Im feeling a little bit on edge, probably from the events that had happened before I got into town.  Im tired because road trips always take a lot out of me, and I only got 5 hours of sleep the previous night.  I write a brief note of my intentions for this trip.  Its meaningless looking back on it, something about exploring my inner self, some timothy leary wanna be shit.  Really I just wanted to have full on visuals.  I write down the time with a sharpie on my right hand for future reference. I knew that I wasnt in the best mindset for tripping, but thought Id be okay because of my experience and the fact that I was so in the mood.\r\n6:15  Im starting to feel nauseous, uneasy, and uncomfortable. I cant really think. S seems confused because hes never even done it before and he doesnt feel anything so he keeps asking me tons and tons of questions which is starting to annoy me.  \r\n6:30  I feel either too hot or too cold, and have the chills.  I continuously put on and take off my jacket.  I have trouble catching my breath.  I am starting to worry a little bit, and Ss continuous questions about how Im feeling are not helping the situation at all.  My stomach is churning, and I feel weak.  I lie down on Ss bed, and his roommate looks at us strangely because he doesnt do drugs and thinks that were destroying our brains, which adds to my anxiety.  \r\n6:40  we go outside for a change of environment. Bad idea. All S wants to do is talk with people, and is very open about the fact that hes on shrooms, telling random people.  Im not comfortable with this at all.  I begin to suspect that people are making all kinds of judgements about my drug wisdom, my mental capacity, my sanity, my benevolence.  I feel very on edge, and almost snappy.  I most certainly dont want to be talking with these people, as I am a more natural introvert, especially on shrooms. \r\n6:45  I see some friends and they look concerned because I am visibly distressed.  My friend Z is especially concerned and is tending to my needs and gets me water and tells me everythings gonna be cool.  I find myself extremely attracted to her, I feel like Im in love with her.\r\n6:55  Z has left, MK stops by.  He had offered earlier to drive us around to smoke a blunt, and was seeing how we were doing.  A few people are hanging out in my room, and some chill music gets put on.  I lie down in my bed and tell everyone Im going to go to sleep, because I feel tired.  Its only been an hour and Im already tripping balls, and Im scared.  Im starting to get slight trails off things, And my posters all have an evil look to them, even my bob Marley poster.  One of MKs friends comes by who is extremely experienced with all drugs, tells me to induce vomiting, because I say Ive never been this sick in my life.  \r\n7:00  I wrap toilet paper around two of my fingers, and stick them far down my thoat.  I gag hard, but I dont vomit.  I look down at my hands and theres blood on one of my fingers.  I start freaking out.  Maybe I scratched and cut my throat with my sharp tooth bitten finger nails. I look in the mirror and theres a miniscule bit of blood smeared down from my lip.  Somebody else also sees it so Im not just hallucinating.\r\n7:10 - Im pretty sure Im dying now.  My suitemate, M, comes in because he hears that Im not having a good time. Hes talking to other people in the room, who hes not really friends with and mentioned once in a subtle way that he thought they were sketchy.  Im getting more and more scared, as I lie in bed under the sheets, feeling like a mental patient.  I think I cant control my emotions, and I mention Zs hot and I like her style.  At the same time Im thinking why did I do this to myself.  Maybe Im never going to get my brain back.  Ill never be able to write a novel (thats my goal).  Maybe Im dying!!\r\n7:15  S is having a great time, and continues to piss me off with questions.  I feel embarrassed for getting so knocked on my ass after my previous experiences, and its only his first time.  But also he keeps saying how awesome everything is which is making me feel worse like I got cheated, and he keeps trying to compare his trip to mine.  I ask M to please call X (they dont know each other at all) because Im afraid I cant converse with sober people, and I want to make sure the shrooms arent poisonous, which of course they are not.  I feel dumb about this, and this only made me more embarrassed.  I keep saying that I feel like Im going to die, and M keeps saying you dont want to die and youre not going to.  I took this as he thought I was suicidal, which made me more paranoid and anxious because I didnt want him to think I was faking all of this for attention.\r\n7:20  The auditory effects are really kicking in, everything kind of drones and echos, and it feels like my heads under the water in a bathtub, feeling all of the vibrations and sounds.  Music sounds otherworldly, it was Piper At the Gates of Dawn by Pink Floyd. I notice how all the sound effects, different time signatures, and all those intricate little details they put into their music are made for people like me.  Its not instant gratification, its something you have to sit down and listen to carefully to appreciate the entire work.  Im just blown away at how good they are at tripping me out.  Then Im afraid maybe Ill end up like Syd Barrett, crazy, living with my mom, the sad byproduct of artistic genius, and then at some point Ill die a lonely person.  I keep thinking about Z and about how Im too shy to really talk to her much.\r\n7:40  Apparently Ive been babbling with a distressed look on my face (ha) about how I want to fuck Z this whole time (learned afterwards), and M says, you should tell her that you like her.  I convince myself that maybe this is why Im having a bad trip, because Im holding everything back.  Im holding back from all social situations, and using weed and my strange musical and movie obsessions as a crutch to avoid real bonding between people.  I always feel like a chameleon in a group of people.  Im always afraid to get too close because Im afraid that if they really get to know me, theyll see me for the scared and insecure little boy I am.  I dont want people to think Im clingy,desperate, a loser, or an emotional nutcase.  If they see all of this, they wont accept me.  Thats it, I have attachment issues!  Wow.  I wonder if Ill still feel the same way about Z the next morning.\r\n7:50  M has to go but asks if I would sell him some mushrooms.  He never really said anything special, but his words were so calm it really grounded me, and I really appreciate that.  I eyed out a generous 1/16 making sure that it was more rather than less. I later found out it was actually about an 8th, but never brought it up.  Not just because I was grateful, but because he would be more understanding of my momentary trainwreck of a trip if he ate what he thought was a 1/16 and tripped twice as hard.  I felt extremely intelligent with my reasoning, sneaky and kind at the same time.  I tell my friends Im going to be fine, and that I just want to chill for a second and to leave me alone. \r\n8:00  After hiding under my covers for a little while, and focusing on the sheets which have a life of their own, I am suddenly no longer nauseous at all.  I am hesitant to get up and leave the security of my bed, much less the possibility of leaving my room, or the dorms.  But then I realize that there is nothing to be afraid and all of a sudden I feel fine, not great, like S and his shit eating grin, but I feel more clearheaded.  Midnite Vultures by Beck is now on and Im feeling the groove.  I stand up, jump off the bed and say with a forced smile, Lets go smoke that Blunt.\r\n8:10  As MK is giving us a ride to Js flat in downtown Wilmington, my thoughts are flying at 100 thoughts a second with epiphanies.  Im glad I got out of that freaky funk.  \r\n8:25  J tells me about a few bad trips hes had, and I can relate to some of it from what I had just experienced.  I had a funny taste in my mouth the whole time, I think it was the taste of shrooms.  Whenever I burped I could taste them and it sent shudders down my spine and made my slightly nauseous again.  I have cotton mouth which is weird because Ive been drinking tons of water this whole time to try to get the shrooms out of my system.  I get another glass for the blunt session, and then spark up, Im peaking now so its perfect timing for the blunt.  Its a tight, evenly rolled bob Marley cone of a blunt, pretty good weed, great weed for Wilmington, and S and I eventually both have to pass on it.  \r\n8:50  Then they load up Js massive reverse shotgun for some reason, as if we arent high.  I guess we forgot that we had just passed on the blunt.  S is in another world and saying one second how were midgets and the next that were ogres.  He starts freaking out for a little while, sinking back in his chair, I guess being chased by something.  We try to calm him down, but he seems like hes having a good time jerking back and forth.  He goes from seeming scared one second and saying NO! oh shit! to laughing hysterically seconds later.  Mk is kind of a dick, and he kept fucking with him, and saying what the fuck did you say, that doesnt make sense.  Are you insane?!! And other things, like he kept convincing him that he had pissed his pants.  This was funny, but I tried to get him to stop and he did eventually.  S was a good sport and was eventually like FUCK YOU to anything Mk said for fear of trickery.\r\n9:30  We converse about music but everything I say is unintelligible, Im in a stupor.  I look at the ceiling and can see balls of color swirling around.  I think I can feel my brain sizzling.  The weed dulled the stream of consciousness.  But there are a few thoughts still cycling.  One thing I kept pondering was my attachment issues, the implications of my introversion, and my main goal in life, to write a best selling novel.  I always thought I wanted to be an artist, but why should I care if my shit sells.  But I do.  Is it to pass my name on for the same reason others would have a child, is it to change the social subconscious.\r\nSure, but Im actually a fucking sell out business man just like my dad.  The irony, what Ive been against forever, not selling out and not being like my old man.  Im marketing a book to a demograph of rebellious teenagers, and it will sell when I finish it because I know what they want to hear and I know what theyre interested in.  Whats more is Ill be making fun of them and their emotions and their idealistic views on life with subtlety, and only my most perceptive and intelligent fans will see that.  It will be a kick to the balls for all of the pseudo intellectuals I have come across in my years, and those to come.\r\nThe song those to come by The Shins had been stuck in my head that whole week and during the entire blunt session, and I had been contemplating the meaning, and it matched up perfectly with my views of life, what I was thinking at the time, and my artistic goals and it put an existential twist on it.  \r\n10:00  From here we watch the Salival Dvd at full volume.  I am mesmerized.  S says screaming music is a buzzkill, but then decides its awesome. Were all zoned out.\r\n11:30  the effects have been gradually wearing off.  I still feel something, but the crazy thoughts are gone.  Everything still feels symbolic, but Im more stable emotionally.  Residual tripping effects last until about 1:00 until I try to go to sleep because Im exhausted.  I didnt get to sleep until 3:30 or so. \r\nThe next day I was drained.  I felt withdrawn, which was disappointing because I couldnt let myself open up like I promised myself Id do somewhere in the trip.  I felt disconnected.  I didnt feel the same way about Z, which was weird because I felt it so strongly the night before. \r\nThis trip surprised the hell out of me.  I wouldnt call it life changing because most of the things I learned I wouldve learned in a short manner of time anyway, or I already knew them.  I dont do drugs anymore, not even alcohol.  However I learned after this that its dumb for me to trip when I havent gotten much sleep.  When I dont eat much it makes the effects more intense, but I get extreme nausea which puts me on edge and can ruin the trip at points.  So always eat a good meal 2 or 3 hours before tripping.  Since Im an introvert and naturally uneasy around new people, its dumb to trip around them, too unpredictable.  The blood in the bathroom probably came from a popped zit.\n\n\n"
}
