{
 "title": "Glimpsing infinity",
 "author": "Nate",
 "citation": "   Nate. \"Glimpsing infinity: experience with Salvia divinorum (40x extract) (ID 62637)\". Erowid.org. Oct 15, 2007. erowid.org/exp/62637",
 "substance": "Salvia divinorum (40x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62637",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 15, 2007",
   "Views: 3297",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Date of experience: April 28th, 2007</p><p>Past experiences with psychadelics: </p><p>Psylo. Shrooms - roughly 6 times</p><p>Acid - 5 times</p><p>Salvia (10-20x) - 4 times.</p><p>I have experienced the wonders of salvia many times before, but never to the extent of what I encountered just this year, mainly because I had only dabbled with 10-20x. I in no way mean to look down on these lower grades, for they can be just as powerful. So, I guess its safe to say that I had sort of a 'Eh, whatever, I've experienced it. A few grades up won't be a problem for me at all. Let's buy this shit!' when we went to the local smoke shop to purchase 40x salvia leaves.</p><p>It was me and three other guys, one had his girlfriend with him. We were at my friend Andrew Mark's house. His mom was out of the house and his dad was leisurely watching television inside. He's one of those real 'layed back' types, having experienced it all, he would say, 'I don't care what you do, as long as you don't go outside of this backyard.' He didn't know we purchased salvia, though. We packed up a bowl of it, enough for 2 or 3 of us to smoke. The others were just smoking pot, which was what they wanted to do, and that only, I don't blame them. I was, and currently still am on probation, having to endure weekly UA's and a husky probation officer breathing down my neck. This was the main reason why I was the lucky candidate to hit the pipe of Salvia first.</p><p>It's amazing how fast this drug can sneak up on me, even more amazingly how easily it makes me forget that I'm even on a drug. About 20 seconds after I inhaled, I let go of the hit and awaited what was approaching with a smirk on my face, as four other individuals watched me. It's hard to recount exactly what I felt, because the brain has magnificent ways of helping me 'forget' tramatizing experiences. But what I can remember was nothing short of bewilderment. We were all sitting at a table, and from my perspective there were three of the four friends sitting in my line of view.</p><p>First came the physical body effects. I felt a very strange and new feeling that I had felt before but not in this extreme. Most people refer to this as the Salvia gravity. I felt like my organs inside my body were being subtly pulled and stretched different ways, and it was quite uncomfortable. I started to sweat and become very uncomfortable, a side effect I still have trouble accepting when on salvia to this day. Before I could center myself and remember my inner strength, the forgetting ensued. I forgot completely that I had smoked anything. I couldn't even remember what 'smoking' was, let alone who I was or what I was or where I was or when this was happening. I had no sense of what anything was, and in a way that opened me to be able to sense the wonderous beings of salvia. If only I was ready. How could I be ready? I had never felt anything like this before. This surpassed my most intense acid/shroom experience by far. </p><p>Simultaneously while all this was happening, the objects in my line of sight began to split in two, then into fourths, then eighths, like aomebas, multiplying and oozing apart. Chairs, my friends, the wood on the house, everything was changing and re-arranging subtly. What really freaked me out was that I wasn't actually seeing them split, at best I only got a glance, because once I turned away from an object, my eyes would return to it and it would be something completely different, like little workers in league with salvia were building this new reality right in front of my eyes, completely out of control, and I had no power to stop them. They were taking everything and anything that I had the slightest clue about, and with the purest swiftness and invisibility, changing them to let me see a completely new and amazingly different dimension.</p><p>I felt comfort and awe for about 2 seconds. Then emergency mode kicked in. From the deepest corner of my brain something was yelling: HEY! WAKE UP! THIS ISNT NORMAL. WHAT THE HELL IS THIS YOU'RE EXPERIENCING? ARE YOU FORGETTING YOUR FRIENDS? THEY'RE ALL STARING AT YOU. JUST LOOK AT THEM!'</p><p>Damn that voice. I guess we all have it somewhere in the back of our mind. Foolish was I to recognize it and do what it asked, for the moment I looked at them, I realized that they were still part of my old reality, the one I knew so well. The only problem was that everything else was still changing and re-arranging, like two realities clashing uncomfortably in front of my own eyes.</p><p>Panic ensued. I started to shake my head vigorously to try and make the new reality disappear. No avail. I looked back at the dart board to see if it had changed. Aye, it had. I looked at the sky, Figures sweeped and waved with hands they didn't have, but I still recognized it as a greeting. This still didn't comfort me. After all, I was on the edge of one reality looking into another, how could I bear this? At this point all I wanted to do was go back to the comfort zone of my old reality that I knew and cherished so well. This is where I made my most dire mistake. I should have just let go and continued to roll with whatever the Salvia goddess had in store for me. But I didn't. I resisted. I resisted with all my might.</p><p>Laughter. I heard it along with voices, the voices of my friends, laughing at me. I could care less. I was on the brink of hellish confusion beyond words and I was beginning to lose the feel of my body completely. Yep, gone. I had no recollection that I had a body whatsoever. It was just my conscious thought and the hellish churn of change that was sweeping over my being, or what was left of it. Still, I resisted with great effort. Not like it mattered, I was staring down the rabbit hole and I couldn't turn back. I heard my best friend out of the group say:</p><p>'Its all right guys, he's okay.'</p><p>I should have taken his words to heart, but I didn't. I couldn't. I didn't have that ability at that moment. I tried to talk back to him, but my lips had been lost in a vortex of dis-reality eons ago. So I just 'thought' to him.</p><p>'No. No I'm not.'</p><p>At this point the panic lever had been pulled full force. With great percision and speed I manuvered between two of my friends towards the door to go inside. It was a wonder I could even make use of my legs. One friend would later tell me that I had some weird posture but I could easily manuver between everybody to reach the door. Odd how your brain can make use of your legs when you don't even know you have them. This was the brink, I thought. I had gone completely insane and I realized it. Crazy people don't really know their insane, but somehow I had actually grasped that I was nuts, and there was nothing I can do about it. Utter dismay.</p><p>My friend's girlfriend ran in after me, looking uneasily at the Dad on the couch staring at me. I never even noticed he was there, how convenient, but he did nothing. He just commented later that I seemed pretty 'Fried'. She looked at me with uneasy eyes and with what seemed to be fright. I was still on the edge of one dimension looking into the other, but she was able to coax me back to the previous dimension somewhat, although I still had no idea who she was or why she was looking at me with such fright or how I had gotten through the door and what the hell was a door anyway?</p><p>Regardless, I still knew that there was something I lost before, I had no sense of time still but I realized that there were things that had changed from before, so that I had somewhat of a grasp on the previous. This is when things started to return to normal. At this point Sandra asked if I wanted to go sit down and relax in Marks room. Sit down. Relax. These were words I remembered faintly. I eagerly took up her advice and stumbled to his room, where I collapsed on his bed. It felt good not to have judging eyes upon me and the safety of the room. I closed my eyes for a good minute or two just focusing on letting go. It was about now that I had realized I was on a drug. Never before had salvia, let alone one hit, allowed me to lose myself so completely. I opened my eyes and saw her still standing there, looking at me with bewildered eyes. I asked her quite honestly, 'So, wait, everything isn't in infinity?' She just laughed and shrugged it off, thinking I was going to be okay, then walked out of the room.</p><p>I blinked a few times and allowed myself to come back to reality, taking deep breaths and trying to control my heart rate, more importantly trying to make sense of it all. I later returned outside to my comrades and could only stare off into space in awe. The moment had passed and it had been about 7-10 minutes worth of tripping, but it felt like a lifetime. I realized as I was driving home that I definitely needed more of this. I knew I had the strength to get past the transition of reality/dimensions, and after I did I would peek a grandoise that surpassed anything I had ever experienced before. I have a new profound respect for this plant, and the entities that dance within its leaves. It has potential beyond any other type of drug I have ever come in contact with.</p>"
}
