{
 "title": "Bad Taste, Drunk, Shortlived Trippy Effects",
 "author": "Jewish Matzah Bread",
 "citation": " Jewish Matzah Bread. \"Bad Taste, Drunk, Shortlived Trippy Effects: experience with Absinthe (Homemade) (ID 62656)\". Erowid.org. May 2, 2007. erowid.org/exp/62656",
 "substance": "Absinthe (Homemade)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2005",
   "62656",
   "Male",
   "",
   "Not Given",
   "May 2, 2007",
   "14031",
   " "
  ]
 ],
 "report": "<p>This kid at my highschool bought mass quantities of wormwood and was distilling his own absinthe and selling it at school.  Hed have several different kinds going at one time.  It was 50 dollars a bottle, but it was the real deal, 3 or 4 shots, and you were tripping a little bit and drunk off your ass.  It was made from everclear.  He had several different flavors, such as liquorice, vanilla, and Lavender.  He also had more expensive bottles containing different drugs such as weed, salvia and opium (he grew the opium and the salvia himself).  I had one that had all three extra substances and I wish I had heard how that turned out.  Very quite kid, had no idea he was doing drugs, much less selling obscure drugs in bulk.  Saw him at a party, I was quite intoxicated, and he offered me a couple shots.  </p><p>I already had 7 beers and smoked somewhere between 8 and 12 bowls.  I did not need the absinthe, I was out of my mind.  When I took the first shot it felt like I had been hit upside the back of the head with a shovel.  I made sure this was real absinthe, and he assured me I would trip, so I chased the shot with some beer and did the second shot right afterwards.  I couldnt handle anymore and he laughed as it took me nearly 10 seconds to recover.  I winced and held my stomach, and shook my head, eyes nearly closed, trying to get the taste out of my mouth.  I was a super lightweight and drunker than I wanted to be at this party stumbling around.  Somehow I did not black out.  When cops came to break up the party I ran out the backdoor like a dumbass, and jumped a spiky iron fence.  False alarm, they said to turn the music down.  </p><p>When I got back inside my friend commented that my pupils were quite large.  I was definitely tripping.  Colors were enhanced, I had a strange not-alcohol like body buzz. Felt kind of trippy like weed except less paranoid and happier, and everything was just brighter and more full of life.  The dimly lit living room was full of shadows that seemed to slightly move around in impossible ways.  The hallucinations were not that direct, Id look away and then look back again and everything would seem a little different.  I had just switched to glasses after wearing contacts for a very long time and was experiencing a slight peripheral blur, and the absinthe momentarily increased this strange phenomenon, and things in my periphery seemed more bent and stretched than they were a little earlier.  This lasted about 30 minutes, and then it went back to just being shitfaced drunk.  </p><p>However I really wanted to try this again.  So I set up an appointment to buy some.  Fucking weird kid dude, haha, drinks it everyday.  I bought a bottle and he told me a little bit more about how he made it.  Everclear, he went on line and put in twice the recommended dosage of wormwood, and then he put in several different types of herbs.  Mine had no extra drugs in it because it was more expensive and was mainly a mixture of Lavender and Vanilla and he said that he hadnt tried it yet but that this would probably be the best tasting.  Wrong.  This was the worst tasting filth I have ever had in my mouth, but the last batch of absinthe takes a close second.  Just think about it, that doesnt even sound good together Lavender and Vanilla. </p><p>Anyways, I had several experiments with my friends.  I always found it was best to take 3 or 4 shots at the most back to back (otherwise your prolonging the torture because the taste sticks with you, its better to get it over with), and smoke a few bowls to get the full effect.  Drinking other alcohol does not bring out the hallucinogenic effects.  One of my friends took 3 shots and waited and said he didnt feel anything, and kept taking shots until he reached 6 total over about a 20 minute period.  We then started smoking and he informed us that he was definitely feeling the trippy effects, and then puked in a trashcan right afterwards.  It was funny and shocking.  He had a good night though after that.  </p><p>The best experience I had with absinthe was when I went to see the Aquabats live after taking 4 shots on a pretty empty stomach and smoking the best weed I had smoked all summer.  All of their stage props were hilarious, and they used so much dry ice to create misting effects, I felt like I was in goofy ska land.  The mist smelled exactly like maple syrup, and the lighting made the mist purple.  They all dressed as super heroes and I laughed my ass off the whole time as they made jokes that werent really that funny.  I got up and started skanking (which I never do because I feel stupid) and trying to sing along like a jackass, even though I didnt know most of the words.  It was a great time.  </p><p>The rest of the bottle was really syrupy so I guess all the wormwood was in the bottom and I was excited to drink the last couple of shots hoping to get the trippiest effects.  Then my mom raided my room and found it and thought it was either freebased meth or pcp and poured it down the toilet and grounded me like a bitch.  Oh well, I dont think Ill ever do it again, but this stuff is really fun.</p>"
}
