{
 "title": "T2 is Impressively Visual",
 "author": "Fat Man",
 "citation": "   Fat Man. \"T2 is Impressively Visual: experience with 2C-T-2 (ID 6265)\". Erowid.org. Apr 27, 2001. erowid.org/exp/6265",
 "substance": "2C-T-2",
 "bodyweight": "300 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6265",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 27, 2001",
   "Views: 15125",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt was about 6 months ago or so that I first tried 2C-T-7. I really was impressed with it, and since have done it a little under ten times or so due to difficulty getting it. In any event, I recently had a friend get me 250 mg of it, but accidentally ended up getting me 2C-T-2 instead. I was not at all fimiliar with it, and until then had not even heard of it. I read up on it, and despite the fact that people were saying its shorter and makes you sicker I was still looking foreward to it. </p><p>Once I got it I took out about 20 mg of it, put it in a little pile and snorted it up at about 7:30 or so. It had a similiar burning to T7, which I expected to last at least for a good few minutes like the T7 does. I was mistaken, due to the fact that it apparently sets in QUICK. I hardly had time to sit down before my head began spinning. I looked around and could almost notice a progressive difference in how fast the visuals were setting in. It takes a good amount of any drug to make me feel like I'm overpowered by it, but my parents were home and as much as I am used to interacting with them when very fucked up, I was almost instantly to the point where I was concerned that if they wanted to talk to me I would not be able to handle myself. Two friends of mine were with me in my room and so I told them I was going to the bathroom until my parents left which was supposedly soon as to avoid conflict. </p><p>Walking to the bathroom seemed suprisingly difficult, but once in I was overwhelmed by how suddenly I felt like I did. I put the toilet cover down and sat there to gather myself. I had many mixed feelings hitting me quickly and didnt know what to think. Aside from the fact that the whole room seemed to be moving, my nasal passage still burned some, and my stomache was beginning to feel queasy. Gradually it got worse, and by maybe 7:40 I was puking up the pasta I ate about an hour and a half before which was a bad choice because I had it with tomato sauce and the acidity of the tomatoes gave me bad acid indigestion and a terrible taste in my mouth.</p><p>Once I was finished in the bathroom I returned to my room, and by now the visuals had almost fully set in. They were impressive to say the least. They were by far better then any visuals I ever got from acid, and looking back on it I decided even surpassed those of T7 which was no small feat. </p><p>Later in the night my friends did it as well, and both had very similiar reactions. Both puked, one multiple times. It also seems to give you an uncomfortable feeling for a while. One that I have trouble trying to explain and wont even attempt to because any words I think of simply aren't accurate.</p><p>It was, like I heard, much shorter than T7. The peak I would say lasted no longer than an hour or two, and after effects maybe till 4 or 5 hours later at most. It is a drug I reccommend to anyone looking for hefty visuals, however it certainly isn't for the faint of heart because it is rough to handle at first.</p><p>My last comment is a bit of a tangent from what I have been saying, but it is what may be somewhat usefull insight. The last time I had used T7 I got a strange sharp, cramping feeling in my chest/upper stomache area. It was a pain I am unfirmiliar with. I was concerned with it, and hadn't done T7 for a while after. When I did the T2 now, I felt it again. I am speculating that these are both unhealthy drugs. Anything that hurts that much going up your nose definately isnt naturally supposed to be there, and I think could potentially cause later problems. I am still quite uncertain what this pain is, but am concerned with it. One hypothesis I have on it is that it may POSSIBLY cause decay in your lungs once snorted. If it burns that much in your nasal passage for such a short time, imagine what it does sitting in your lungs.</p><p>Just some thoughts, I dont mean to turn people away from it, but just be careful when you use either of these two intense drugs.</p>"
}
