{
 "title": "Chemical Abduction",
 "author": "Spike",
 "citation": "   Spike. \"Chemical Abduction: experience with DXM (ID 6266)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6266",
 "substance": "DXM",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2000 mg",
   "IM",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6266",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 19987",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI saw the experiences section of erowid and I thought I'd share a small warning with all of you on the value of moderation, and how you really shouldn't let emotions cloud your judgement with regards to the extent of the drugs you abuse or use.\r\nMy experience was in January 2001, near the end of the month, and my girlfriend of six months to whom I had become very attached split up from me. My mind was a complete wreck with confusion: 'why me?', 'what did I do to deserve this?', 'what did I do wrong, was I too caring, too loving?' and a whole train of similar thoughts and questions.\r\nMy weight had dropped drastically because I'd become anxious and depressed, through my job and relationship. I wasn't eating, and I was abusing other drugs quite heavily (namely shooting codeine & heroin intravenously - a source of great contentment and solitude on my part, injecting ketamine and drinking & smoking heavily)\r\nThis is where my mistake began - I hadn't eaten anything for 2 days so I was quite tired and lethargic, and I'd previously drank half a small bottle of whiskey.\r\nAt around 6pm I looked in my 'box of tricks' (my cute personal name for my small box where I kept all my drugs and paraphernalia) and all I had were some codeine I'd extracted and prepared for injection, and around what I thought was 6 grams of DXM powder in a little baggie, some lemon juice and around 5 .28g insulin syringes.\r\nI took around one gram of DXM in a spoon, added the lj and cooked it up, sucked it into the syringe and put it onto my coffee table. I did the same and lay the two syringes side by side. I gave my ex a call because I felt so upset. Her mother answered to the call and told me she was in the bath, and she said she'd get her to call me back.\r\n'She won't call', I thought to myself. I shut my bedroom door and turned on my lava lamp, took the first syringe and spiked my left shoulder. I waited a minute for the burning to subside and spiked my other shoulder. I sat on my sofa for what must have been 20 minutes before I felt the drug kicking in, and gave up on the notion that there was even the slightest chance my ex would call, so I took my clothes off and went to bed.\r\nAll seemed to be going ok for a while - I lost my grasp of time and place and completely forgot my misery. I felt very drowsy and light as I always do when I do robo.\r\nI entered the world I'd left last week and the flora and fauna were there to welcome me.\r\nTere was one more entity there. I'd given it the name 'keeper of the gold'. I had to take its gold. It would make me a complete and happy person, not needing love for a while. I saw myself as a group of blue, four armed reptiles and touched this keeper.\r\nI connected with the world, I was everywhere and I was everyone - I had all I needed inside this place and as I circled the planet absorbing enlightenment from all life, there was a very sudden interruption.\r\nThe telephone rang.\r\nHaving a caller display can be a good thing. Not now. I'll let mum downstairs answer it and I can go back to my world and forget everything.\r\nShouting from downstairs 'pick the phone up, it's your ex'\r\nOh christ. What do I do?\r\nShouting again.\r\nOh I'll just answer it and get rid of her. Yeah. Fuck what she thinks.\r\nI can't remember what she said. For the months previous she had no knowlege of my drug abuse and I kept it very secret. All I can remember her saying was 'are you sure you're alright'\r\nMy reply was 'yeh fine. Bye'\r\n'Bye'\r\nOk now where was I?\r\nBack to space I go..\r\nI couldn't relax again. This was bad. I realised I'd taken way too much. My arms and legs were completely numb & my hands were twitching.\r\nAm I going to vomit?\r\nNo I' fine. Lie there and relax a bit, you'll just have to sweat this out. Once you're capable of moving again take a paracetamol and the fever will go.\r\nI got up and went to the window. My stomach was completely empty but I still managed to vomit and get rid of that awful pain in my stomach. My sister I think came in at that time and said 'hey, you've vomited on my window' (she was on the floor below).\r\nAll I said was 'go away' and she left.\r\nThe next thing I can remember was being forced to get dressed by my um and her boyfriend. I remember seeing my bedroom lit up with an air of righteousness, thinking of how this reminded me of my childhood and how mum always made me get up and get dressed.\r\nFlashback...\r\nAll I saw was swirls for a few minutes. Fascinated by geometric patterns and the three witches who lived at the cliff (my ex, her mum and her sis).\r\nBack to maladjusted reality.\r\nI was in the car, looking around and I asked if I could have a cigarette. I was refused by the alien. It said 'DON'T FALL ASLEEP. STAY AWAKE, WE'VE GOT TO GET YOU TO A...'\r\nBlackout again...\r\n'What did you take, spike?'\r\n'Leave me alone'\r\n'We need to know'\r\n'Dex-tro-meth-orph-an' 'robo' 'dex'\r\nHesitation from these unidentifiable plebians, what the hell was going on?\r\nI dozed off again, but not a dream, not a single vision. Not a thing, just quiet and solitude. 'Now that's what I wanted. I've got the gold. I've never felt so happy. Where is everyone, I have to tell them, to spread my happiness at least just a little, even to the people I hate. Everyone deserves to be happy like this, even if they've hurt me. I love my family, I love everyone I know'\r\nI woke up to a strange being on a seat.\r\n'Spike? Can you hear me? You're in (unnamed) hospital, you've injected some sort of weird drug and I found you lying on your floor in your underwear having convulsions and choking on your own vomit.'\r\n'Did (my ex) call?'\r\n'Yes she called at half past seven'\r\n'Mum, I'm sorry about this'\r\n'Why did you do it?'\r\n'I was sad. I just wanted to feel better, please understand'\r\n'I do'\r\n(I remembered how my mum & dad had smoked cannabis in the past, how they'd once tried LSD and how my father in his younger days was constantly stoned. Maybe this would be justified in their minds)\r\n'I'm going outside for a cigarette, now that you're awake. (my mother's boyfriend) can you keep an eye on him please?'\r\n'Yeh' was his reply.\r\nSlept again...\r\nWhen I woke up, I asked 'where's (my mum's boyfriend)?'\r\n'Out having a cigarette'\r\n'Can I have one?'\r\n'Wait three hours', was the reply\r\nI had another thought. Was this the end of my hedonistic days? It was inevitable that I'd be rumbled sooner or later, because a life devoted to pleasure only holds so much before someone stops caring for that aspect of their lives and gets careless about keeping it a secret. I've been busted. Oh crap.\r\n'I'm going to change. I need your help. I know it's a big favour but wasting my life, or any life for that matter is a big sin and I couldn't live with myself knowing that I'd done that. Please?'\r\nI was told that yes, I was going to change otherwise both my parents would wipe their hands clean of me.\r\n'Why am I so drowsy?'\r\n'The doctors gave you some diazepam and paracetamol. It's the only treatent they could administer'\r\n'When can I go home and have a cigarette?'\r\n'Soon'\r\nThe rest I can't remember for the life of me.\r\nFor the next 24 hours I had to put up with both parents taunting me and saying how I'd fucked up, poisoning my body to escape from my problems. How pathetic I was.\r\nAnd indeed it was true.\r\nFor the next 2 days I slept pretty much all the time, refusing food, pissed off because those idiot doctors had prolonged the effects by giving me a fucking valium. Not their fault. Poison centers should have better resources I guess.\r\nIt's now 3 months later and I'm glad I've changed. I have a nice girlfriend I can take it slowly with, I haven't found a new job yet but things are looking hopeful there. When my parents said 'spike, you're a waste of an intensely clever mind', she was absolutely right. I was a waste. But no more. Now's the time to turn my life around and I can return to drugs later.\r\nSo what's this taught me? Well after much introspection, this is my conclusion:\r\n1. Drugs are a good thing. If used right. If abused they're still a good thing. It's the abuser who is the idiot.\r\n2. NEVER 'eye out' your drug doses, especially when under the influence of another drug. It's at that time the drug becomes a poison.\r\n3. Try first to deal with your problems in a sober manner. Escape is not the best way to do things but sometimes it helps.\r\n4. Don't let drug use interfere with your day to day life. That road leads to one bunch of things: rehab (not nice, I was put into opiate detox and forced to subside on 60mg of methadone a day), counselling, which in itself is intrusive, unpleasant and upsetting, and sickness, I was told I had anorexia as well, which meant I was given marinol to try and increase my appetite. Lay your trust in me, methadone and marinol do not make you feel nice in combination, because you can't do anything else apart from lie around feeling tired and depressed. Methadone in itself is extremely efficant and marinol seemed to double the nausea for me, meaning that eating was still difficult but constant hunger got to me in the end and I put back on 10lbs at least, although I'm still underweight by a long shot.\r\n5. Things don't stay bad. If you've reached your darkest hour then you have two choices - die, or get better: one of these will eventually happen.\r\n6. Anything can be addictive. Anything pleasurable or contenting because people want to do it again and again.\r\nI really hope this gets published. And I hope that whoever reads this if they think on my wavelength will take heed and learn moderation. This is needed because drugs especially are everywhere, from the stressed suit who needs his coffee at 2-hour periods, to the tripped out hippy who's lost touch with reality, to junkies whom I completely sympathise with because my philosophy used to be 'keep on going, shoot up get high, come down, steal, buy more drugs and do it again.'\n\n\n"
}
