{
 "title": "Absolute Bliss to Absolute Hell",
 "author": "Alexander F",
 "citation": "   Alexander F. \"Absolute Bliss to Absolute Hell: experience with Tramadol (ID 62694)\". Erowid.org. Jun 23, 2007. erowid.org/exp/62694",
 "substance": "Tramadol",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 1:30",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 2:15",
   "50 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "62694",
   "Male",
   " ",
   "Not Given",
   "Jun 23, 2007",
   "51686",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am 16 years old, My friends mother had a condition in which she was prescribed tramadol, 50 mg tablets. So my friend leant me 5 tablets knowing I enjoy experiencing with whatever drug it is... now to explain my experience.</p><p>I had finished any outstanding school work so I had nothing on my mind, cleared my room of clutter 'clear room, clear mind' and sat by my computer.</p><p>11:00 pm - I ingested 2 pills and continued on the Pc</p><p>11:30 pm - I started to notice slight changes in thought processing, the sort of feeling when IM not thinking of anything, just staring and daydreaming... It was so minimal that if I focused on the computer screen I would not notice any of this,</p><p>12:00 pm - I started feeling quite relaxed and content, I felt like I wanted to lIe in the garden wrapped in a quilt staring at the sky. Although if I focused on the computer this feeling would disappear immediately. I felt the effects were not very significant though roughly equal to drinking 5 beers.</p><p>12:30 pm - I ingested 2 pills and continued on the Pc.</p><p>1:00 am - I feel the same as I did 30 minutes ago, so I decided to get up and grab a drink of water... as I stood up, oh my gosh. I couldn't walk straight, for love nor money, I was so incapable of standing upright that I collapsed onto the floor. The feeling was amazing, extremely euphoric, I felt as if I was floating, my legs had gone relatively numb, and I couldn't help but smile. </p><p>When I closed my eyes, the feeling was much different, in fact the feeling changed immediately, it was just as pleasant as when my eyes were open though, it felt as if nothing existed, I wasn't thinking of anything at all, I didn't have a care in he world. It also felt as though I was spinning backward, this was extremely pleasant but for some reason I could not keep my eyes closed for long. </p><p>1:15 am - I managed to get up, stagger toward my desk, grab the last pill and swallow it, by this point focusing became rather difficult. But I felt extremely relaxed, as if someone was carrying me around, the feeling of having no control over my body and having no sense of direction was extremely entertaining.</p><p>1:30 am - I have no trouble brushing my teeth and decide to lye in bed and relax totally. The lack of co-ordination with my body has stayed the same and I managed to walk to my room throw myself into bed.</p><p>With my eyes closed I could feel myself spinning backward at great speed, this created a churning feeling in my stomach whcih was very intense, It did make me laugh though. I had the same feeling as I did 30 minutes into the trip but much, much more intense. </p><p>I hadn't a care in the world.</p><p>Suddenly without warning my right leg started to shake and my muscles were contracting uncontrollably, this then finshed, and I was getting rather worried, athough shortly I stopped worrying and just fogot about it.</p><p>1:45 am - again... Only this time it was my cheast that started to contract, my cheast was contracting, pulling my arms forward. Again this stopped shortly afterward and I started to worry about my health, I was checking all parts of my body were functioning and I hoped to God that I wouldn't have a seizure. </p><p>Whilst focussing on my body, I noticed I had stopped breathing, I have had a similar experience before but not as scary as this. I really wasn't breathing, I could breath but only voluntarily. I started thinking maybe I'd stop breathing in my sleep and die but I realised that it's the bodies reaction to inhale if you stop breathing, so I tried sleeping with that thought.</p><p>2:00 am - I sharply awake when I gasp for air, I realise that my heart has seriously slowed down and I cannot breath well unless I force myself to. I am now so worried that I refuse to sleep and try and stay awake until I am capable of breathing without focussing myself. I still feel very euphoric but I am still worried.</p><p>3:00 am - I calm down and try sleeping again. </p><p>2:15 pm - I wake up feeling very refreshed and can fully recall the events of the night. As I get up I am still very disorientated but can walk better than the night before, my head is alot clearer now, I feel sobre. There is absolutely no unpleasant come down.</p><p>Two days after my experience I felt emotionally and mentally unstable, I couldn't focus at school and I became rather paranoid. At one point I was taking a shower and felt so confused and mentally unstable that I actually sat in the shower shaking, my mind felt so clogged, I couldn't process information, I felt so lost and confused, it was unbelievable. In other words, I had a mental breakdown.</p><p>I do find it significant though that when my eyes were closed I fell into a world of confusion and mental discomfort more than when my eyes were open.  </p><p>1 week, 3 days after and my mind is now clear, I can happily say that 'Tramadol' is a very euphoric drug with a lot of characteristics... the feeling of euphoria, relaxation, and loss of body control is very strong and enjoyable, I would take them again, only I'm worried about the seizure part and emotional discomfort after the come down.</p>"
}
