{
 "title": "The Gateway to Higher Consciousness",
 "author": "Ford",
 "citation": "   Ford. \"The Gateway to Higher Consciousness: experience with 2C-I & MDMA (Ecstasy) (ID 62691)\". Erowid.org. Jun 25, 2007. erowid.org/exp/62691",
 "substance": "2C-I & MDMA (Ecstasy)",
 "bodyweight": "290 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   " ",
   "2C-I",
   "(powder / crystals)",
   " ",
   "2 tablets",
   "oral",
   "MDMA",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62691",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2007",
   "Views: 5358",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My wife and I have had the privilege of experimenting with 2C-i on 8 occasions since first being introduced to this substance in October of 2006.   I can speak for both of us in reporting that this chemical has positively improved our lives in a more profound way than any other experience either of us have ever encountered.</p><p>I did not think too highly of this substance when first trying it.  I have been quite the connoisseur of Ecstasy for the past few years and enjoy the physical and mental effects that they give me.  I have also had multiple experiences with various psychedelics including LSD and Psilocybin all of which I considered to be disappointing at best.   My first experience with 2C-i brought the same disappointing results on the first experiment.  However, my opinion would change drastically once I altered my environment.</p><p>2C-i is a cool experience in combination with Ecstasy at a Club or Rave, however, to truly experience the full effect of this substance (99% of what this stuff can really do) one should find a comfortable environment to meditate in.  We find darkness to be better suited for 2C-I (despite the fact that we have a full Rave Club in our house). The music of Soundscapes, Ethnogenic Relaxation, and New Age seems to improve the journeys drastically over Progressive Trance, Breaks or Drum N Bass.  Although the Journeys are peaceful and mind-blowingly profound they can very quickly be interrupted by talking and even the slightest outside disturbances.  </p><p>Being alone is typically okay, however the experiences, visuals and new understanding are routinely so profound I feel the need to share the experience with my partner or loved one even if they can't 'see and feel' what Im experiencing.   On one occasion however, we are both convinced that we shared the same journey telepathically, recalling the same visuals and experiences in our discussions after words.  </p><p>Like Ecstasy, this chemical too is an empathogen and undoubtedly improves my communication with friends and a spouse.  My wife and I are closer than we have ever been and our appreciation for life has never been stronger.  We take 2C-i in combination with Ecstasy because we have found that the Ecstasy brings on more of a 'body experience' in combination with 2C-i's mental and emotional mind expansion.</p><p>2C-i is accompanied by an awful nausea side effect.  We are happy to report finding a solution to this.  2 tablets of Dramamine 30 minutes before the ingestion of 2C-I seems to eliminate this side effect even on a full stomach. My wife reported an additional side effect of Kidney pain the following day which is said to be pretty common even though I do not experience this.  She has since bypassed this side effect as well by taking the substance rectally in a liquid shot.</p><p>The experiences on 2C-I have changed my life forever.  I am not the same person I was before I took this substance and would never want to be.  My mind is wide open and my comprehension of the meaning of life has been significantly improved.  In my wildest imagination no chemical substance could have compared to the highs I have experienced in my reality.  My imagination has since been expanded to understand that the daily experience of our reality, even our most profound moments, are merely the tip of the iceberg.</p>"
}
