{
 "title": "Peace Relaxtion and Equilibrium",
 "author": "AtommicallyInclined",
 "citation": "   AtommicallyInclined. \"Peace Relaxtion and Equilibrium: experience with Hydrocodone (Vicodin/Lortab) & Cannabis (ID 62708)\". Erowid.org. Aug 1, 2010. erowid.org/exp/62708",
 "substance": "Hydrocodone (Vicodin/Lortab) & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "Hydrocodone",
   "(extract)",
   "  T+ 1:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "62708",
   "Male",
   " ",
   "21",
   "Aug 1, 2010",
   "35995",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experience with pharmaceuticals has been a limited one yet fun nonetheless.  To date Ive only dosed with DXM, Triple-C and Vicodin.  They are not my favorite drugs of choice but occasionally when Im bored I like to experiment with cheaper and easier to obtain substances. The other night I thought Id try my hand at a hydrocodone extract from my last three 5/500 (hydrocodone/acetaminophen) pills that I had received because of a sprained ankle.  I wanted to try this because acetaminophen is hard on the liver and in liquid form the hydrocodone kicks in quicker than in pill form.  Backround - I am 21, 145 lbs, and have extensive experience with psychoactives, hallucinogens, and recently a little with amphetamines.  </p><p>After a little research I got a general idea of what needed to be done and started scrounging for materials.  I gathered some ice water, ice cubes, some warm water, crushed the pills as finely as possible, but failed to locate a coffee filter for the filtering stage.  I found some teabags that would have to do the job and emptied them out.  I cut the top quarter off of a 12oz water bottle and fixed two backs tightly yet draping around the opening (drinkable side).  Alright, ready to go.</p><p>First, I put the crushed pills in a shot glass and dissolved them in warm water stirring occasionally.  About 10 minutes later they were fully dissolved and I added an ice cube and a little ice water then placed the glass in the fridge.  I stirred every five minutes and added a little more ice over the next half hour until very chilled.  I filtered the milky liquid into another glass using the teabags and the result was a double-shot of fairly clear hydrocodone liquid.  I downed it and chased with some soda, put on some tunes, then checked out what messed up event was happening in our world via the often disturbingly educational World Wide Web.  This was at 11:00pm.</p><p>Ten minutes later I start to feel a little different.  It sort of felt like I had just downed a beer  my joints as well as my arms and legs felt loose.  Shine On You Crazy Diamond was next on my playlist and I was amazed at how full and emotional it was.  It was like the sound was wrapping itself around my head and penetrating me at the same time.  I felt euphoric, relaxed, stoned.  At 11:20 I decided to get up and go out outside for a cigarette and as soon as I stood up it hit me.  My body felt light and tingly as I walked out my door into the cool night air.  My balance was somewhat offset and I stumbled a bit but nothing too overwhelming.  Everything around me was slightly moving and swaying.  I could best compare the visual experience to drinking several beers but I didnt feel drunk at all.</p><p>Despite this, my mind was very clear and focused.  The full moon blanketed the yard in cool blue light and I just stood there for a while with my cigarette observing my surroundings.  Birds were nesting softly in the trees, the traffic from the freeway hummed steadily, and the wind whisped gently across my ears.  This was a good night.  I felt content and steady when I thought about my life and situation which is really pretty good for the most part.  I noticed the back pain I was having lately was completely gone and my feet werent sore from the walking I had done that day.  I went back inside and chilled out to some more tunes.</p><p>About a half hour later I felt the affects slightly dissipating and decided to smoke a bowl.  I turned on what I consider to be Hendrix best performance as well as the purest rock song ever played  Machine Gun (live at Isle of White).  My head gently began to rock and my eyes closed, focusing completely on the masterpiece Hendrix painted so elegantly.  I had to struggle to keep my eyes open after the performance and decided it was time to rack out.  I laid in bed and let the spiraling laser light show in the back of my eyes spin me to sleep.  </p><p>The fun factor was more than I had expected in my earlier states of boredom so all in all, this was a worthwhile experience.  The next morning I woke up with a mild headache but it went away shortly and I felt great the rest of the day.</p>"
}
