{
 "title": "As the Spirit Wanes the Form Appears",
 "author": "Gangleri",
 "citation": "   Gangleri. \"As the Spirit Wanes the Form Appears: experience with Inhalants - Glue & Paint (ID 62719)\". Erowid.org. Sep 23, 2007. erowid.org/exp/62719",
 "substance": "Inhalants - Glue & Paint",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Inhalants",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 62719",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2007",
   "Views: 17103",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] <br>This is an account of several trips with inhalants. <br>Philosophical babble:<br>I took my philosophy degree at the university with the theme Creativity and Language. At the time I was finished, I was convinced that creativity appears as a shift of a form or an image from one common use in a language system to a new one. And the process is not logical, as in being capable to describe all the steps, but it appears as a sudden jump. That jump is a synthesis not made consciously. For example: I took a bath and I watch as the water flows on my watch. I suddenly come with the idea to draw a liquid watch.<br>Ive read Jungs works on archetypes and decided that the best way to find out if archetypes existed and had something to do with creativity is to try to experience them. The obvious choices were hallucinogens. I decided to use acetone after Ive read an article about it. <br>First trip :<br>There I was sitting with a tube of glue and a plastic bag. All my work had never prepared me of what I was about to experience. After several huffs the sounds start to repeat in a loop. And there it was. It risen from deep inside of me. An ancient being, and it looked at the world around, took a deep breath and laughed. It was happy to live again. In Jungs concepts this would seem to be the shadow. It is important to make the notice that at that time I have not read the Jungs publications about the various archetypes only a general account of what an archetypal image is. I on the other hand was afraid that I was caught in an endless helix. <br>But the shadow said No problem, we are in loop universe. No worry. Here youll meet yourself and leave yourself. And it started talking to me how different types of drugs catch people in different persons (the persona). The trip was over in 15 minutes.<br>Second trip:<br>Next day I decided to continue. The shadow again welcomed me. It was more clear an image this time. It had a nice sense of humor (The trickster or the fool). It resembled at the same time a fool or a very organized man. It was not within me but as a different persona. As the trip was getting to its end all the hallucinations centralized as an upside-down echo that returns to its center or maker. The trip was 30 minutes.<br>Third trip:<br>This was more extreme. I was listening to Bjork at the time. The shadow showed me an empress or a goddess (The anima). Ive read the chapter on the anima but it concerned mostly females so again it appeared by itself not from what Ive red. Of course the song of Bjork was the raw material with witch the image developed. <br>The goddess is very fair and cruel, everyone who tries to marry or kiss her dies. Only a magician can trick her.   said the shadow .<br>Im a magician said I.<br>Ohh you fancy yourself a trickster. Can you reach me, can you kiss me? Echoes the voice of the goddess from above. <br>Yes I can said I. Then two ghosts appeared - red and blue. <br>They manifest in reality only with an automatic gesture or a phrase. They are at war with each other. Wins whoever manages to express himself the most in the world.  said the shadow.<br>The empress said : There are different levels of being, a simple phrase repeated is one. A gesture another, much like a human being. But it lives in the lives of others without considering consequences.<br>The flesh is a thought put in a fact a thought that passes within and trough flesh to become a fact. Its both the lowest and the highest. A free thought is such that needs no flesh to appears.  Said both the queen and the fool as a choir. With their words I saw colors, abstract shapes and geometric forms. <br>The biggest pain is to live with consequences. Was the final echo from the drug. <br>The trip was 40 minutes long.<br>Before the forth trip:<br>I discovered the formal resemblance between hallucinations and mythology and fairy tails. I decided to use some method of magick to concentrate myself within the trip. I read extensively different mythological texts. I had an important dream : Horus appeared as a number both 3 and 4. Again I read about the mythological meaning of the numbers afterwards. At the time a woke the only thing I could put up was that they equal 7.<br>The forth trip: <br>I sit on my knees and try to focus. Im like Alice in wonderland changing size. The shadow appears and shifts to a monk who will teach me now. He shows me an image of a flower on the flour. This is the most important thing. Said he. Afterwards I read about Mandala and how it corresponds to the blossoming flower of the rose. This trip was 40 minutes.<br>Fifth and last trip:<br>The goddess and the shadow present me in a grand golden amphitheatre. There are all the gods from all the grades and levels of being. <br>You have been chosen to be an emperor. Said a golden figure - old man sitting in a throne (the old man).<br>I cant. Look at me. Im nobody. Said I.<br>Stop acting as a spoiled child. You have being chosen. Youve passed all the tests. A choir of all the beings echoes. <br>The trip lasted 2 hours. <br>At that point I was afraid of the megalomanic structure (Im not sure how to spell that in English) of the hallucinations and stopped experimenting. <br>Conclusion:<br>The archetypal origin of the hallucinations was quite obvious. But there were a lot more than a display of old mythological figures. The way different ideas were presented with shapes and colors, was a proof of my concept about creativity. At last there was one thing which lies beyond my logical means of explaining: these experiences changed my conscious perception of the world and myself, the only way to describe them now is as a synthesis between spiritual and rational thoughts. In the broadest possible meaning of these two words.\n\n\n"
}
