{
 "title": "Easy and Consistant",
 "author": "Jonas",
 "citation": "   Jonas. \"Easy and Consistant: experience with Kratom (ID 62727)\". Erowid.org. Jun 6, 2007. erowid.org/exp/62727",
 "substance": "Kratom",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Kratom",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "20057",
   "62727",
   "Male",
   " ",
   "Not Given",
   "Jun 6, 2007",
   "44316",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've taken Kratom many times. It is a very versatile 'incense'. With a little know-how and some patience the 'Premium Commerial' Kratom can be made into any most of the common preparations. This information is readily available, and I'm not writing a cookbook. In the experience of this researcher there are a few distinct experiences possible with Mitragyna Speciosa, when taken as a powdered leaf. Please note that these are my own doses. I'm a big fella, 6'1', 240lb, and fit.</p><p>I. The low dose - 1 to 2 tsp - 4 to 8 grams - powdered 'PC' kratom</p><p>  A. Effects</p><p>\t1. Mental</p><p>\t\ta. mild stimulation</p><p>\t\tb. mild euphoria</p><p>\t\tc. increased focus</p><p>\t\td. longer attention span</p><p>\t\te. anti-addictive effects(?)</p><p>    \t2. Physical</p><p>\t\ta. medium-strong analgesia</p><p>\t\tb. feeling of warmth\t</p><p>\t\tc. loss of appetite</p><p>\t\td. increased stamina</p><p>\t3. Undefined</p><p>\t\ta. Lack of desire for tobacco</p><p>\t\tb. Desire to be around others</p><p>\t\tc. enhanced enjoyment of music </p><p> B. After Effects</p><p>\t1. less than mild fatigue</p><p>\t2. slight desire for more (could just be me. ,) ) </p><p>In small doses, kratom feels to work like coffee or tea, without the 'jitters' produced by caffiene or amphetimine-like stimulants. I often take a tsp of powder before breakfast, instead of coffee. I have also found that small doses are a wonderful addition to a pre-workout snack. The additional stamina kratom seems to provide allows me to push my workouts harder than with a vitamin/caffiene stack alone. Quite possibly the mild euphoria helps me push myself. The painkilling effect may also contribute to this, allowing me to work through some of my joint pain.</p><p>II. The medium dose - 1 to 2 tbsp - 15 to 30 grams - powdered 'PC' kratom</p><p>  A. Effects</p><p>\t1. Mental</p><p>\t\ta. mild MENTAL stimulation</p><p>\t\tb. medium-strong euphoria</p><p>\t\tc. increased focus, with periods of being spaced out</p><p>\t\td. anti-addictive effects(!)</p><p>\t2. Physical</p><p>\t\ta. strong analgesia</p><p>\t\tb. physical sedation</p><p>\t\tc. mild nauesa</p><p>\t\td. feeling of warmth</p><p>\t\te. mild muscle relaxation</p><p>\t3. Udefined</p><p>\t\ta. NO desire for tobacco(see II.A.e)</p><p>\t\tb. definate opioid-like effects</p><p>\t\tc. 'Zoning'  into a piece of music or literature.</p><p>  B. After Effects</p><p>\t1. mild fatigue</p><p>\t2. slight headache/desire for more</p><p>At this dose, Kratom gets more interesting. It really becomes more of a very clear opiate high.  I have been spaced out thinking about the mechanics of the solar system many times with a 2 tablespoon dose, and I'm a big guy. Sometimes if I work out without kratom, near the end of the day I will take a dose of this size to help me 'come down' from the day. It's great, because I am still clear headed enough to handle home business. If I had to make a dose to dose comparison I'd say 1 tbsp of Kratom = 10mg hydrocodone, for pain relief. It's very close to the same in terms of sedation also.</p><p>III. The Heavy Dose - 3tbsp -4tbsp - 30g + - powdered 'PC' kratom</p><p>  A. Effects</p><p>\t1. Mental</p><p>\t\ta. mental sedation</p><p>\t\tb. euphoria</p><p>\t\tc. inability to focus</p><p>\t2. Physical</p><p>\t\ta. strong analgesia</p><p>\t\tb. strong physical sedation</p><p>\t\tc. nausea, with occasional vomiting</p><p>\t\td. feeling of warmth becomes body buzz.</p><p>\t\te. strong muscle relaxation</p><p>\t3. Undefined</p><p>\t\ta. can't smoke</p><p>\t\tb. feels just like an opiate, but a little more sick to the stomach</p><p>\t\tc. almost total loss of focus</p><p>At high doses is when Kratom becomes unpredicatable. While I would suggest it as a substitute for opiates during a controlled withdraw, it is not the recreational plant I hoped it would be. In larger doses, vomiting has been common enough for me that I wouldn't suggest large doses for anyone. The positive effects of the plant are mostly captured at low doses.</p><p>Summary:</p><p>In low doses, Kratom can be beneficial. Only in higher doses is this plant </p><p>unpleasant. When taken responsibly, Kratom could be just the 'spice of life'</p><p>your looking for. It will give you that extra pep and care of joint and muscle pain.</p><p>It's not one of those things that gets better the more I take. The higher</p><p>the dose, the more chance of unwanted sedation and/or nausea. When taken in </p><p>medium doses for pain, it is a good natural replacement for opiates. That does</p><p>not mean that NSAIDS shouldn't always be your first line of defense against common day to day aches and pains. Kratom is an excellent supplement to those drugs for extra pain relief.</p><p>When it comes to recreational use, kratom is a different story. I have found that SMALLER doses work best with most other drugs to enhance the experience. Kratom will provide the little extra boost so I don't feel tired smoking pot. It also helps ease the muscle tension from most psychadelics, without any noticable sedation. Kratom's euphoric effects, while strong on their own, don't hold a candle to any pharmecutical opiates. It is a good buzz while the pills aren't around, but any serious pillhead won't be satisfied with Kratom.</p><p>Drinking alchohol and taking kratom should be always done carefully. Small doses enhance the drunken buzz, but large doses and their trademark sedation should be avoided. Also, if you have a weak stomach the two shouldn't be mixed. The nausea alone is not worth the trouble.</p><p>It is worth mentioning that after a full breakfast, Kratom does help hangover symtoms greatly. As a hangover remedy adding a teaspoon to my tea works well. I have even tried adding it to my coffee filter in the morning. While it definately changes the flavor, I find the brew to be almost mystical in its restorative properties. </p><p>Mitragyna Speciosa is a wonderful plant. In small amounts, it stimulates without the side effects of caffiene. Even in small doses it provides also provides a powerful adjunct to modern medicine's approach to pain relief. Kratom is facinating because of how different dosages effect my body in vastly different ways.</p><p>The bottom line is that I like Kratom, and would suggest its use for many</p><p>different conditions.</p>"
}
