{
 "title": "Relaxing Herb and Good Tea",
 "author": "Juno",
 "citation": "   Juno. \"Relaxing Herb and Good Tea: experience with Leonotis leonurus (ID 62754)\". Erowid.org. Jun 23, 2007. erowid.org/exp/62754",
 "substance": "Leonotis leonurus",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "5 ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 cig.",
   "smoked",
   "Leonotis leonurus",
   "(flowers)",
   " ",
   "1.5 cups",
   "oral",
   "Leonotis leonurus",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 62754",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2007",
   "Views: 17043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was happy to find my packages in the mail today - 1 ounce of Wild Dagga flowers & 1 ounce of Damiana leaves I purchases off of the internet for about $10 each.\r\nI immediately wanted to try the Dagga after reading so much about it.  I am on probation so I can't smoke pot anymore (without the risk of going to jail).  \r\nAfter getting home from work I found myself alone with nothing to do except pop open a cold one & watch Bladerunner which was on TV.  Hmmm.....time to try out the Wild Dagga.\r\nI rolled a cig of the flowers & made some tea.  I've heard the moderate euphoric state comes after ingesting around 8 grams of leaves so I eyed 8 grams of flowers out judging from the size of the ounce & put that into medium boiling water with about 2 grams of Damiana leaves.  I had had about 4 or 5 beers by then but I drink every day so I only had my normal mediocre buzz which I'm use to.  I smoked the cig I had rolled while the tea lightly boiled for about 15 minutes.  \r\nI strained the liquid out which yielded about one & a half cups.  I drank the first cup down without any trouble (I'm very accustomed to herbal teas).  After about 5 minutes I could feel the relaxation start to pour over my body - my eyes changes & felt comfortable.  I started to have slight visual hallucinations (nails on the wall looking like crawling insects, blurry spots, enhanced colors, things looking profound or meaningful).  I won't lie, I know it wasn't a placebo & it definitely felt good but not too good.  People are right when they say that it doesn't compare to marijuana.  But the price is right & it was even a good enough buzz that it made me forget about going to grab another beer after the tea was gone.  The buzz is still tapering off now 3 hours later but the best effects were in the 30 minute to 1 hour range after drinking the tea.\r\nI'm going to experiment more maybe even with larger quantities.  Its definitely a good alternative to marijuana but I wouldn't classify it as a substitute.  It isn't nearly narcotic enough (at least at the quantities I ingested) to be compared with a couple of hits of marijuana to the non-daily smoker.  I am one of those people that didn't get high the first few times I smoked marijuana though (I know it was real pot  thats not the issue) & have talked to other people who say the same thing.  This makes me curious if my body needs some getting use to the chemicals in Wild Dagga before I can get its full effects.\n\n\n"
}
