{
 "title": "Everyone and the Band Were Wired In",
 "author": "Bailey",
 "citation": "   Bailey. \"Everyone and the Band Were Wired In: experience with LSD (ID 6288)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6288",
 "substance": "LSD",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6288",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 6600",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMe and some friends of mine went to ekoostik Hookah's 10th anniversary concerts, and being hippies, we thought acid would probably be the thing to do. We had all tried it before, but none of us were really experienced. We were camping beforehand, so we'd smoked a lot of marijuana earlier, and a couple some of my friends had drank some beer, but we were all fairly sober by the time we got the concert.</p><p>First step, find some acid. No problem! We asked a couple people, and got directed to the right person. He told us 2 hits would have us seeing visuals within an hour. I took 2 hits at $5/hit, as did most of my friends, 2 of them took 1. This was apporximately 9:15 or 9:30, I'm not real sure of the time. A couple minutes later, I heard the guy we bought it from telling someone else about it '2 hits will send you to the cosmos.' Wait a minutes, didn't I just take 2 hits?</p><p>About 10 minutes later, I could feel the acid starting to work. I started to feel jittery and anxious and had problems keeping still. Fortunately, the music started not too long thereafter, and I got up to dance. </p><p>I had been daning for about 10 minutes or so, a song or 2 into the first set, when a hippie chick who had put a sticker on my face earlier walked up to me. I spent almost the entire first set making out with her, and didn't find out anything more about her than her name. I must say, that was probably the best way to come on to acid that I could ever imagine. It's difficult to say how much the LSD was really affecting me at this point, as I was rather busy, there was something odd happening. Things were starting to get WIERD.</p><p>During the break, I met back up with my friends who had dissappeared. After talking to them, I realized a good portion of the audience was tripping on the same stuff. This is when I realized how hard I was tripping. Talking in coherent sentences was extremely difficult, I could see trails off of almost everything. When I went into a different section of the music hall, the light was a more yellow color, and everything looked dirty all of a sudden, and everyone's eyes were red (probably from pot) and everyone looked sickly. So we got out of there and went upstairs to the back where we could relax.</p><p>The setbreak seems to last forever (so did the first set) and it was almost agonizing the way it dragged on. I gave up looking for the chick because I was just tripping too hard. Finally, Hookah came back out. I realized not long thereafter, that one of my friends wasn't having that good a time. He was usually weary of crowds and I think it was just too much for him. Almost everyone else in the group was around dancing and having a good time, but I sat with him through most of it. He was really quiet most of the time, but would occasionally say something about him being dead and asking for answers. He had 5 or 6 sentences he more or less kept repeating. I knew it would be really difficult to get him out of there, so I just kept hoping that the set would last longer. By the time they got to the encore, all I could see of the band members were giant blurs when they played their instruments or otherwise moved. It felt like everything and everyone in the plus was wired in, even the band and the music. </p><p>At about 2:00, 2:30 in the morning the show ended. We managed to get my friend who was having the bad trip outsite, although it took a lot of work. We hung outside the music hall with a big group of hippies until we found my other two friends. One of them had started having a bad trip and they had left before the show ended, but she had been talked down by my other friend. </p><p>At this point, we piled into our cars, we had 2 drivers, both of whom took 1 hit. I don't advocate driving on LSD, it was probably pretty dumb, don't do it, but we had no choice, it was that or hang out by the car and risk getting arrested. The guy who was freaking out went in the other car, while I went with 2 of my other friends. I tried to get up back to the campsite, because I was the only one who knew the area, but I just couldn't find it. So we made it back to my house, I had to wake my dad up unfortunately, but he was so tired, I don't think he noticed. From there we called my friend's at the campsite. The guy who freaked out was coming around, so we hung around for an hour so we could come down a little. At about 5:00 AM we left for the campsite, we arranged a meeting with someone who knew where we were going and he led us back to the site. We stayed up and talked past dawn. The visuals were still with us, but our thought patterns had returned to normal. If I thought about it I could still see some mild trails and other faint visuals until about 7:00 or 8:00 the next day. </p><p>A very interesting time. The most intense trip I could ever imagine having. I had a good time, despite my friend, who returned to reality shortly after returning to the camp, though I don't think he will ever try LSD again. I'm sure I will, but it's gonna be a while, this trip had given me a lot to think about, especially musically and about the connections between band audience, and other things of that nature. It reminded me very much of what I'm imagining the acid tests were like in the '60s. Always check to make sure you know the potency of the acid you're taking, this stuff was amazingly strong, and really did send us to the cosmos. I almost lost control a couple times and my friend did. Never ever ever underestimate acid, that's the only advice I can give to anyone. </p><p>Peace</p>"
}
