{
 "title": "Unusual Experience",
 "author": "Yellow Archer",
 "citation": "   Yellow Archer. \"Unusual Experience: experience with Melatonin  (ID 62900)\". Erowid.org. Jun 11, 2007. erowid.org/exp/62900",
 "substance": "Melatonin ",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1.0 mg",
   "oral",
   "Melatonin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62900",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 11, 2007",
   "Views: 34710",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For about a month, I was taking 1mg of melatonin every night about an hour before going to sleep. It assisted me in falling asleep earlier than normal very well and did wonders to fix my sleeping schedule. Before taking melatonin, I would stay up until at least midnight and I had to sleep until noon to feel rested (no matter when I fell asleep), but once I started taking melatonin I could fall asleep at 10:00 and wake up at 8:00 feeling rested. When I first started taking the melatonin it would wake me up repeatedly through the night, but after a while this was no longer an issue. The issue came later.</p><p>A couple of weeks into taking it nightly, I started having minor trouble understanding people when they spoke to me and often had to ask them to repeat themselves. I noticed that it was happening fairly frequently, but I did not think it was a big issue and I certainly did not attribute it to melatonin. This continued for about a week, and it only kept getting worse.</p><p>Around the end of that week, I suddenly had a really disturbing experience. I was riding the public bus home from my community college after a day of classes. The day had been fairly normal without anything out of place or unusual. On the bus ride, though, I couldn't understand anything that three of the people on the bus were saying. I could occasionally pick out single words, but as a whole, nothing that they said made sense to me. I was beginning to wonder if I was somehow metabolizing some cannabinoids that were just stored in my system or if perhaps I was having a flashback to an experience with psilocybin mushrooms (which I didn't think was possible), but I felt clearheaded and physically normal. The entire bus ride proceeded this way, and I was very alarmed. When I got off the bus and went in to my apartment, I told one of my roommates about my experience and he was fairly weirded out by it.</p><p>Later that same day, I was sitting on the couch with my boyfriend talking to him and he gave me a concerned look and told me I wasn't making any sense. I tried to explain to him what I had just said and he still seemed quite confused. I said some other stuff and apparently I was still making very little sense, so he asked me if I was alright and if he needed to call a doctor. At this point I was feeling really scared. I told him that I was fine, hoping that it was just temporary. This is when I considered the possibility that all of this might be caused by the melatonin. I immediately ceased using it, and within two days I wasn't having trouble understanding people anymore.</p><p>I still do not know for sure if it was the melatonin that caused all of this, but I certainly believe it was. I've tried finding similar experiences online, but to no avail. Hopefully this was just an isolated incident.</p>"
}
