{
 "title": "Legoland",
 "author": "Wallabee",
 "citation": "   Wallabee. \"Legoland: experience with Salvia divinorum (20x extract) (ID 62903)\". Erowid.org. Nov 7, 2007. erowid.org/exp/62903",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62903",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 7, 2007",
   "Views: 3052",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Today was good Friday. At midnight, we decided to smoke some salvia divinorum to celebrate the death of Jesus. We went behind my house and trudged along the ditch. The mud was perceived as puddles in the moonlight even before we were high. At the end of the ditch, we came to the bayou and the large lake. On the other side, a wobbly bench sits facing the lake, deformed, uprooted, and elevated. That was the infernal chair on which we sat, it toppled and teetered. The actual act of inhalation began with me. Kris, our sitter, had us guess his colour, like drawing straws, to see who would take the first hit. I picked maroon, which was the nearest color to red, Kriss assigned colour.</p><p>I sucked in the salvia, which was horrendous in taste, and held it for thirty seconds. Upon exhalation, I had about one second before I blacked out. I didnt know how long I blacked out, but for several minutes I was sitting silently on the bench. Then, the world began to appear to me as lego pieces. I was unable to question my environment, unable to appreciate my environment as an alternate reality, unable to recognize a self differing from the environment. I was a monument of lego pieces, built into a wall of lego pieces, the kaleidoscope of small and distorted geometric patterns constantly churned and morphed before me.</p><p>The air was lego pieces, the ground was, and I was not truly seeing anything, because the pieces were all around me, obstructing vision, but I could feel the pieces and could even feel their color. For an eternity I lay encased, feeling like a titan imbedded into a mountain, banished by the gods or some binding authority, however, I had no true recognition and my thoughts at this point held no language, held no similarity to conscious thoughts, and I had no recollection of any prior state of existence, this was an eternity for me.</p><p>The legos were swarming at a faster rate and I noticed patterns to their movements. I next recognized a few things. I was stuck. Because I could only move as a lego and was of the same contours, I could not escape and shake off the legos. I was trying to breathe but was drooling and spitting out legos, probably a side effect from the agitation of my throat and lungs from the disgusting taste of salvia. I noticed soon that I was stuck in this wall and that there was no escape, however, I was not yet self-aware and, indeed, to me there was only an infinity of geometry, the surroundings indistinguishable from my individual. </p><p>There were certain forces of authority that I soon came to recognize. They spoke to me in an anonymous tongue that I understood not as a language but as a natural law to the universe. They explained to me that I was simply a part of a pattern. I looked around myself and perceived a hall of endless lego patterns. These bricks of color can be best described as vibrant, however, the grout in between each brick was somewhat dark and spooky, the only word that comes close to describing the prison and all of its existential implications. The pattern authorities, who seemed to dominate the other patterns in a sort of evolution, explained that I could not escape.</p><p>I noticed that the authorities were involved in some sort of construction of new patterns and, in retrospect, these patterns may have been my friends on the bench with me, but I was not at all aware of the existence of friends at the time. At this, I became in need of escape, although I was not completely aware of myself as a different entity yet. However as I began to question the pattern and as I began to fight the authority, I began to fully feel the place where my body ended and the rest of the legos began, although I still was not aware that I was a human. I had never been a human before then and I had only then been born into this geometric reality.</p><p>I then perceived myself in the third person struggling to release myself from the onerous bricks. I felt the clutch that fits one lego into another, although this was all over my flesh. I forced myself to detach from the wall of legos and became immersed in what were effectively the gaseous legos that still detained me (thus hopping from the bench). At this point, I was on a plane of endless geometric pattern and shaking excess legos off of me, trying to release my true form. I began screaming and running back and forth across the plane, attempting to discover some sort of end. Only a hazy darkness stretched around my body. A geometric darkness though, and a vibrant darkness, if this is not contradiction.</p><p>I continued to scream and shake legos from my body, like they were living beetles or something. While in this condition, I could not make this metaphor, for beetles didnt exist. I rushed back and forth in front of the bench several times and eventually, because of a declivity in the soil that I had not expected, I collapsed to the ground. The feeling was intense and horrifying. My nerves were experiencing reality, not in a smooth feeling, but in quanta, specific units of sensation. Each lego that I stepped on was lodged on me and when I fell over, surpassing the gravity was intensified for all of the lego notches were stuck in my own bodily legos.</p><p>While laying on the ground, I was effectively (as I later found out) eating grass, and I noticed the shapes of flowers and leaves, but they were square and completely geometric. Then, I rose and began to stick my hands in my mouth to get rid of the legos that were materializing inside of it. At this, I noticed my sitter, Kris, who described me as a gremlin at last released from hell to destroy the earth. I screamed Help me, there are legos in my mouth! and continued running. Eventually, I came upon a little city that I found glowing in the moonlight. I was a giant before this little golden city. At this point of reference, I began to analyze the structures. The metropolis had fairly advanced little buildings and a fairly reasonable city-plan. However, as I stared at it, I became aware of its actual shape in reality. I called to the others, who I had just become aware of, Come and help me crush this little village. No one came, and I soon realized that the village was actually a tree branch with orange-yellow foliage.</p><p>After this, I became much more cognizant of my environment and the darkness and the legos slowly blinked into the moonlit scenery that had prior existed. Then, I became aware of Faiz, my friend, and his own attempt to take a hit of salvia. I did not want the legos to engulf him, so I began to grab him and try to seize the salvia from him. After several attempts, he pushed me and I began to roll down the hill. He did not push me very hard, but it seemed to be an immense impact. While tumbling, I thought at first that the rolling would be very easily prevented, but I built up momentum and began to roll at an increasing rate. Near to the bottom of the hill, I completely blacked out and woke up at the bottom an instant later, finding myself in the lake. I was cushioned by the reeds and the water.</p><p>I began to climb back to the top shouting Im wet! Im wet! very sadly. I had to spit out a lot of weeds. Then, I sought revenge on Faiz. Standing at the top of the hill, I grabbed him by the neck and we looked out over the lake. I pointed at the moon with my hand and whispered Look at the moon. Its swirling, Faiz, Its swirling. See the swirls, Faiz? I see them. I was merely seeing the glowing rings around the full moon. My whispers apparently hypnotized Faiz for a moment, he eventually broke free of my hand. So concluded the climax of the night.</p><p>The rest of the experience was the drudgery of a return to reality, with the slow realization of all of the minute details anew. Although I sat on the bench and fell over and then trapped myself beneath it, this was intentional and simply the delirium causing me to do stupid things, not truly interesting from a subconscious psychological perspective. Later in the night I mistook a piece of dog poop for a dead toad, this was not a hallucination, but a susceptibility to mistakes. However, I was able to convince all of my friends that it was a toad also, which was believed until further inspection. Even later than this, I was talking to a friend Patrick when I had a very strange time distortion. I was asking Patrick do you want to go watch the movie Sphere? However, in my perception, he replied to this question Yah, lets watch it before I was even able to ask him, thus, I was under the firm impression that he had predicted my words. After verification with other friends, I found that he had responded to the question after I had said it and I was merely confused. I attribute this effect to my own subconscious anticipation of his reply, and thus my hallucinatory assumption that he had replied, and thus my confusion between the hallucinatory assumption and the actual delivery and response.</p>"
}
