{
 "title": "Well, It Did Not Work",
 "author": "Amateur Chemist",
 "citation": "   Amateur Chemist. \"Well, It Did Not Work: experience with Poppy Seeds (extract) (ID 6291)\". Erowid.org. Feb 14, 2002. erowid.org/exp/6291",
 "substance": "Poppy Seeds (extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Poppies - Opium",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6291",
   "Male",
   " ",
   "Not Given",
   "Feb 14, 2002",
   "Views: 76736",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nBeing of the curious type, i always wondered what drugs i could produce for the cheapest amount of money, so i decided to try and extract Opium from poppy seeds.</p><p>I went to my local grocery store and bought 220g of bulk poppy seeds, which costed 7.96$CAN. I then dropped this in a glass mason jar and covered it in Isopropyl alcool ( i had already extracted hashish from cannabis using this method and it worked very well). After shaking it periodically over a period of about an hour, I poured about half of the liquid from the jar into a white porcelain saucer. I let this dry out and was left with a brownish black coating all over the saucer. Using the same method i had used with the hash, i scraped this with a razor blade and let it dry on a clean aluminum sheet. Since it was my very first time with opiates and i did not particularly want to die this evening, i took about the size of a pencil eraser of the dark gooey material which smells of poppy seeds and put it on a brand spanking new pipe.</p><p>SETTING: my room, I am safe here, and it is my usual place of consumption for illicit materials ( i have tried Alchool and Marijuana, both at a rather large dose on occasions). I am currently taking no other drug/medication and am in a normal state of health.</p><p>MOOD: relaxed, it's monday and i'll be starting school tommorow. My ICQ is open and i've been chatting with friends. Both my parents and my brothers are in their beds so no fear of them bursting in.</p><p>INTAKE: T=00 I inhale my first hit. It tastes flowery and rather good. A good thing it doesn't hurt like MJ. I then took 2-3 more hits and held them deeply into my lungs.</p><p>T+2 minutes. I start to feel warmth in my face and neck, as well as a pulsation. it could be placebo, though.  </p><p>T+5 minutes. taken 3 more hits. my lungs hurt a bit. I am definetly feeling more relaxed than usual. my pupils are pretty much dilated and my eyes are red. However i think i could still go about my daily activities, since the high is not really strong.</p><p>T+10 minutes. i have decided that i might as well take the rest of the tar, approx. the amount i had already taken went in the bowl and was heated from underneath. it made about 5 hits. Music is starting to sound somewhat cool, but not like when i smoke MJ.</p><p>T+20 minutes. Pretty much nothing happening... feeling relaxed a bit, but not really. </p><p>T+60 minutes. Very disapointing, nothing happened worth of mention</p><p>CONCLUSION: well, it did not work :- i think i'll stick to booze now + the occasional bowl of weed.</p>"
}
