{
 "title": "Meditation and Lucid Dreaming Aid",
 "author": "Morpheus",
 "citation": "   Morpheus. \"Meditation and Lucid Dreaming Aid: experience with Calea zacatechichi, Salvia divinorum & Mind Machine (ID 62927)\". Erowid.org. Aug 21, 2007. erowid.org/exp/62927",
 "substance": "Calea zacatechichi, Salvia divinorum & Mind Machine",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Calea zacatechichi",
   "(extract - 10x)",
   " ",
   "2 leaves",
   "buccal",
   "Salvia divinorum",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 62927",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 21, 2007",
   "Views: 11036",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me state right off the bat that tripping is never my goal. I have never dropped acid or used any 'hard' drugs because I like to stay in control. I have smoked a lot of weed in the past, but quit for several years now because more often then not I have been hit with extreme anxiety (rapid heart rate and feelings of impending death). I realize I am not of the proper mindset to go into a forced intense altered state and thus very careful with salvia.</p><p>I have been into meditation, astral projection and lucid dreaming for years but it was always rare and hit or miss. For me, astral projection is a cool experience, but I do not believe it is real, just a illusion produced by the mind. I am of a pure science mind set and have no religious or occult beliefs.</p><p>Using a mind machine for a 30 minute-2 hour meditation cycle and this combination of Calea zacatechichi capsules (taken before starting the salvia quid) and 2 large salvia leaves chewed for 20-30 minutes (probably approx 1 gram?) has produced some intense results.</p><p>Without meditation, the effects of these plants are usually hardly noticeable unless I close my eyes. Salvia does scare me sometimes because the same dose chewed will occassionally give me visuals and the onset of a trip even though the dose is extremely low. I suspect salvia builds up in the body. When this happens, I delay meditation because I do not want to be thrown into a full blown level 4+. Just with non-noticable effects, meditation with a mind machine usually takes me to a state that sounds much like a level 2 to 3. I can also occasionally achieve an astral projection from a meditative state which before I could only do from a restless sleep state.</p><p>My dreams are much more vivid, easily remembered and much more often I have lucid dreams that are longer lasting. This is constant now, even going a week without a meditation and plant cycle which usually I am doing a few times a week to 5 times a week.</p><p>An ounce of salvia is cheap and lasts me a long time but the Calea zacatechichi are a bit expensive to restock on, but well worth the cost for me. I may get some Calea zacatechichi leaf in the future and try to make some homemade capsules to see if I can get the same effects for much less the cost.</p><p>This routine in my life has provided endless entertainment and a bit of insight into my psyche.</p>"
}
