{
 "title": "Some Words on After-Effects",
 "author": "Pablo",
 "citation": "Citation:   Pablo. \"Some Words on After-Effects: experience with Diazepam (ID 6295)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6295",
 "substance": "Diazepam",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Pharms - Diazepam"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 6295",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 98493",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI have recreationally used Valium on numerous occasions in doses ranging from 10mg up to 50mg.  Here are my conclusions:\r\n- In doses of 10-20mg, Valium generally produces a mild euphoric buzz with a sense of calm, relaxtion, sedation and mild muscle relaxant qualities.  \r\n- At doses higher than 20mg, I find that the buzz becomes too heavy & sedating to enjoy - I just have a tendency to want to go to sleep.\r\n- Using alcohol & Valium in combo seems to just create a greater depressant effect.  A couple of drinks with a low dose of Valium - 10mg - seems OK & a sensible limit to observe.  However, combining Valium with alcohol is a risky proposition.  LARGE quantities of alcohol & Valium in combination could be serious - coma or even death in some cases.\r\n-  One negative thing I would point out about Valium is the after effects.  I find that Valium, especially if used fairly regularly (several times a week), tends to build up in your system.  In technical terms, Valium has a half-life of approx. 40 hours and the major metabolite of Valium - desmethyldiazepam - has a half-life of 100 hours.  In laymans terms this means that Valium will hang around in your system, causing subtle active effects for several days after taking the drug.  What I find is that this causes a sense  of mild depression and a mild dulling of the senses which lasts for about 3-5 days. However, I know others who use Valium who say that they do not perceive any depressive/dulling effects at all. Your mileage may vary ...\n\n\n"
}