{
 "title": "Pure Fun",
 "author": "Birdseye",
 "citation": "   Birdseye. \"Pure Fun: experience with 2C-T-7 & LSD (ID 6300)\". Erowid.org. Apr 17, 2001. erowid.org/exp/6300",
 "substance": "2C-T-7 & LSD",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "38 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)",
   "  T+ 5:00",
   "1 hit",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6300",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 17, 2001",
   "Views: 13185",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI woke up fresh at 7:30AM on a Monday morning, my last free day before I returned to school, in order to consume 38mg of 2-ct7. I took the drug on an empty stomach. </p><p>8:30am - No effect</p><p>9:00am - I am beginning to feel a strange nausea; not like I am going to throw up, but as if my stomach is wiggling. </p><p>9:30am  - I am beginning to feel negative. The physical effects, specifically the stomach discomfort, are beginning to make me second-guess my dosage level. I decide to lay down on my bed with my calico cat, but not before cranking the heat up to 75. I am cold. Sonora is helping me relax, and I begin flipping channels on the TV.</p><p>10:00am - My negative energy is being slowly replaced by elation. Television begins becoming extremely comical, so ridiculous that Bob Barker is absolutely the most hilarious person on television. The Price is Right does not seem real. I watched TV for another thirty minutes, changing channels incessantly. I was able to criticize and laugh at each program quickly, and my imagination was running rampant. </p><p>11:00am - I begin wandering the house in my underwear. Thoughts are coming quickly, but in a friendly manner. The house is warm, and it is raining outdoors. Strangely, I feel utterly un-sexual on this drug. I am spending way too much time viewing the human race objectively, as just another animal species to even dream of lust.</p><p>Noon - I hop online briefly to talk to some friends. I feel very social, though I am more than content to experience this trip alone. Having so much fun on a psychedelic, I convince a friend of mine to come over and dose himself with some LSD.</p><p>12:30pm - I expected massive visuals by now, but I really am not getting much other than color enhancement, some typical light swirling of patterns and some breathing effects. This is very mild. I keep forgetting I'm on 2-ct7 and not acid. Oh, LSD, sounds like a good idea! My friend arrives, we chat briefly, and he?s off on his own journey. I decide to take a hit myself in order to boost my experience.</p><p>1:15pm - I am walking around naked in my backyard. Although it is drizzling lightly, I am not bothered. My garden is saturated, and looks absolutely gorgeous. I am beginning to feel the acid synergize nicely with the 2-ct7. Still only mild visuals, though an exciting thought process. I spend some time in mirror making faces and laughing. </p><p>2:30pm - I get a call inviting me over to a good friend's home. He picks me up, and upon arrival I began dancing around like an idiot, parodying bad rave tricks and moves. My friend's house is a mansion filled with beautiful Indian designs and Eastern themes. The combination is thoroughly enjoyable, and I am not out of control in the least bit. </p><p>3:30pm - More friends arrive, and I am beginning to feel the 2-ct7 drop in intensity by a large magnitude. Additionally, I am beginning to feel a harsh, grinding headache. Finally I figured out I hadn't drank water all day long, and after a couple liters I was back in perfect shape. </p><p>The experience began to trail off, becoming more about the social interaction between myself and my friends rather than a psychedelic trip. I suppose I am not very sensitive to 2-ct7, because from what I've read it is supposed to be extremely visual at this dosage, and I would expect even more so combined with LSD. However, I guess this is an excellent example of how every person is different, and how greatly sensitivity varies. </p><p>Fun!</p>"
}
