{
 "title": "Freeware Entrainment",
 "author": "Krin",
 "citation": "   Krin. \"Freeware Entrainment: experience with Device (binaural beat generator) (ID 63066)\". Erowid.org. Dec 17, 2007. erowid.org/exp/63066",
 "substance": "Device (binaural beat generator)",
 "bodyweight": "190 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63066",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 17, 2007",
   "Views: 12896",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n3.9 to 4.1 Hz, 73 minutes +<br>I have experimented with auditory frequencies in the past and have found them to be useful for getting over 'morning fog' the headspace I encounter on lack of sleep. I have read that the Hz setting I use, or low end 'theta' entrained waves, help to regulate sodium/potassium levels much like good old sleep. I find that it clears the head in any case. I just downloaded Brett Logans WinAural program, yeah freeware, and have been using the beatwaves for the last couple days on and off. <br>Today: began listening about an hour after waking. I was a little groggy from surfing all night on the web. A few seconds after putting on the headphones I began to feel calm and sedately refreshed. I like to listen to music while I use the beatwaves so I run media player and turn the waves down low to barely perceptible. Extended moderate sound level listening can cause the wah-wah effect in the ears akin to rapidly covering and uncovering the ears while listening to loud music. As of about an hour and a half of listening I feel calm, and meditative. My mood is slightly elevated. As a comparison I would say one strong beer's worth of euphoria without any feeling of being on something. A crystal clear state like waking up to a beautiful day after an excellent nights sleep. <br>Just to note: When I use the beatwaves while playing 1st or 3rd person games If the character falls from a great height I get a feeling akin to being on a rollercoaster. I think this might have to do with inducing a dreamlike brainwave. I find myself more impressionable when asleep and dreaming. Also movies are a little harder to follow but seem more intense while listening to theta waves.<br>I hope this is interesting, for those who know about binaural beats, no, I have not experienced OBE because of it, but that doesn't mean you won't! ,)\n\n\n"
}
