{
 "title": "Saved from Addiction",
 "author": "Lightofiboga",
 "citation": "   Lightofiboga. \"Saved from Addiction: experience with Ibogaine (ID 63089)\". Erowid.org. May 28, 2007. erowid.org/exp/63089",
 "substance": "Ibogaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "Ibogaine",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63089",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 28, 2007",
   "Views: 29162",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nBACKGROUND:<br>This past Friday, I initiated myself into the iboga tribe with a dose of 800mg pure ibogaine, with a trusted friend watching over me to make sure that nothing bad happened.<br>The purpose: to rid myself of a vicious addiction to alcohol and stimulants, and to stabilize a mood that fluctuated between suicide and euphoria every 10 minutes.<br>PREPARATION:<br>Kept myself sober for 48 hours prior to taking the ibogaine. Took these two days off work to calm my mind, walked around in the woods on Toronto island the day of the experience, and meditated on my intent: to free myself from substance abuse, and to learn to enjoy the natural highs in life that I had never before been able to appreciate. I prepared myself for death, in case the ibogaine decided to kill me, but I had extensively researched the subject and thought that I would quite likely survive.<br>THE EXPERIENCE:<br>I dissolved the ibogaine in water and drank it slowly. Took some gravol and a tiny amount of marijuana to ward off nausea. The ibogaine hit swiftly, first with an MDMA-like euphoria and mushroom style visual hallucinations (closed eye fractals, etc.) I remember at about the half hour point exclaiming 'Hey, this is fun - I'm going to get high and detox at the same time.'<br>Then it REALLY hit me. The whole room started vibrating with a bizarre strobe light effect - it was like plugging your monitor into a 50Hz European outlet and having it go all funky. I started to get dizzy and retired to the darkened bedroom put aside for this purpose. I lay down and my whole body started shaking and twitching. It felt like being electrocuted, and I was convinced that I was going to die. Then, I felt myself rocketing upwards - quite unnerving, but because I had read about this in other people's reports, I began to relax.<br>I closed my eyes, and I was floating in space past various orbs, some with dancing gods and goddesses, others with video screens replaying various scenes from my life. A beautiful naked woman came towards me. I welcomed her. But as she approached, beckoning me, I saw that she was covered in sores and grotesque scars. I sent her away. I knew that she represented the seductive temptation of alcohol and drugs, and I would not have it.<br>Then I came face to face with a young black man. He said he was the spirit of the Iboga plant. I asked him if he would rid me of my addictions. He said he would. I started shaking violently and I asked if I was going to die. He said no. I became nauseous and begged him not to make me vomit. He winked and me, said 'we'll see,' and disappeared.<br>I saw the inside of my skull, dim and gray. Then, with a tremendous rush, it started to light up, from bottom to top. My vision zoomed in to four colour coded tubes. I knew that these were receptors for different neurotransmitters. They were filled with garbage. As the top of my skull finally lit up, a stream of little roto-rooter like nanobots went into the receptors and cleaned them out. Then some other nanobots filled each of them up with a cement like material, to varying levels. This was the ibogaine working to stabilize my brain chemistry to fix my addictions and make me happier.<br>With that, the visions stopped abruptly, as did the shaking, the nausea, and the inability to move properly. I got up and went to the bathroom without assistance. Though it had felt like days, it had only been four hours.<br>Unfortunately, at this point, my friends, realizing that I was out of any potential danger, started to make noise and turn on lights. This irritated the fuck out of me, as I was having a bunch of lucid dreams that they were interrupting. I took a cab home, lay down in my own bed, and proceeded to dream / think about living a sober life.<br>12 hours after ingesting the ibogaine, I got out of bed. I went over to my parents' house next door. They were very relieved that I had not died, and we discussed addiction recovery for a bit. For the next twelve hours, I lay in bed, half dreaming, got up, read a book, went back to bed, etc. My brain felt extremely slow and hollow, like part of it was sleeping, yet I was awake. Though I was pleased to note that my depression seemed gone as did my craving for a drink, I was worried that I had permanently damaged my brain.<br>At the end of the second 12 hour period (24 hours post-ingestion), I fell asleep for an hour. When I woke up, whatever brain systems had been offline before suddenly came to life in blazing color. I felt happy, centered and alive. I took a walk outside, and was able to appreciate the smell of the spring air - it gave me more euphoria than any drug ever had. That night, I slept very little, which was annoying, but I felt really good, and I had expected this insomnia.<br>THE DAY AFTER:<br>The day after (which was today), was amazing. I went to the gym and actually enjoyed working out (something I had previously stopped doing in favour of drunkenness.) I cleaned my apartment and bought some healthy groceries. Then I met up with my ex-girlfriend for lunch. Now, whenever I hang out with her, we get into some kind of argument and I get upset. Today was no exception, the difference being that I was able to tell my brain to just accept the breakup and be happy being her friend. And so I was. And tonight, I went to a movie with another friend, and really enjoyed the sober pleasure of a good movie for the first time in years.<br>CONCLUSION:<br>Used with proper intent, iboga(ine) is a life-saver. <br>May your lives be filled with light.\n\n\n"
}
