{
 "title": "Herb Trippin",
 "author": "Road Tripper",
 "citation": "   Road Tripper. \"Herb Trippin: experience with Kava Kava & Cannabis (ID 6310)\". Erowid.org. Feb 14, 2002. erowid.org/exp/6310",
 "substance": "Kava Kava & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 capsls",
   "oral",
   "Kava",
   "(capsule)",
   "  T+ 1:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6310",
   "Male",
   " ",
   "Not Given",
   "Feb 14, 2002",
   "35534",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was up in the campus library getting my daily education online when I decided to walk to the local Smiths and get some food. On the way out of campus I discovered a cool little secluded cove back in some trees and bushes. It had a little rock patio and two benches. I decided it would be a coll place to go eat shrooms some time.</p><p>When I got to Smiths to my utter delight I found a much larger supliment section than they had back by the pharmacy. I had wanted to try kava for a couple of weeks and now I had the time and I found some. So I bought my kava soft gells, delux lunchable, and some orange juce to wash it all down.</p><p>I walked back to the little cove I descovered earlyer and ate 20 140mg soft gells with 55% Kavalactones, ate my lunchable, drank my juce, and went back to the library to do a little research.</p><p>From what I read I had taken a pretty heavy dose so I was all excited to trip out. At about T+:30 I felt relaxed and calm but nothing too dramatic. At about T+1:00 nothing new was happening. I thought mabe the soft gells were not disolving so I drank a pepsi to help it along. At T+1:30 I still felt calm and relaxed, about as much as getting mome second hand marajuana smoke. My legs and arms felt a little heavyer also. I felt a litte ripped off so I decided to go home and smoke a little herb. I read It helps out and boy were they right.</p><p>I took the shuttle home (don't drive) and lit some insence. I decided to take 10 more kava soft gells as a booster. Then I broke out the herb and rolled me a nice joint of some choice greens. Put on a my a perfect circle cd and burned one down. Down towards the bottom I got into the nice zone where I feel every hit getting me way higher. I'm kind of a pussy when it comes to smoking so I was rather proud that I finished the whole thing. Then I just laid back on the floor with my head between the speakers and let the ride begin.</p><p>Music was totally amazing! It gets cool when I am high but this was incredible! I can hear every note, every beat, of every instrument separately, but they sound so good together!</p><p>Then I went and took a shower wich was awesome. I love a good, hot, long shower and this was heaven. Showering was a totally fitting part of the experiance. Totally relaxing and cleansing. Then I went back and listened to some more music. At one point I remembered my head phones and got totally excited. Music with head phones would be so much better!</p><p>Listening to music was a total trip. I was playing all the music with my body. My feet, one hand, and a corner of my lip would play the drums. My other hand would play lead guitar. My eye brows and forehead would play bass and violin. My eyes would play rythm guitar. And then I would sing along. What a trip!</p><p>I did have a few closed eye visuals. I call them black background visuals. Light colors, random paturns that change into othe random paturns. Pretty cool.</p><p>Whenever I get high I have to call my friend J and see whats up. He couldn't tell I was high wich was weird because I was the highest I had ever been. It was really clear though (not hazy) which was good. Then talking got boring so I turned my phone off and listened to some Shakira. It was kind of funny. Shakira is some Mexican dance pop/rock star. I don't speak a lick of spanish but good God, that voice! She's increadible!</p><p>I fell asleep some time after that and slept like a baby. I woke up this morning and I feel really good. It was a great experiance.</p><p>In summary, for me, the key to Kava is Herb. The sum of them together is much greater than their parts. They totally enhance each other and make for a great time. I think I'll keep some kava around and pop a couple every time I smoke the Herb. Do the math, be safe, have fun, and live!</p>"
}
