{
 "title": "Pleasure and Death",
 "author": "VrIgHtEr",
 "citation": "   VrIgHtEr. \"Pleasure and Death: experience with Inhalants - Duster (ID 63148)\". Erowid.org. Sep 4, 2007. erowid.org/exp/63148",
 "substance": "Inhalants - Duster",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "inhaled",
   "Inhalants",
   "(liquid)",
   " ",
   "3 hits",
   "inhaled",
   "Inhalants",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63148",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 4, 2007",
   "Views: 23355",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.] \r\nI was at home one day, and my parents were out, so I was alone. I had nothing to do. At the time I was feeling quite relaxed, as that day I had just finished one very difficult assignment for school, so I didn't care about anything at the time. My dad had a can of duster near his computer, so I went and got it. I shook it, and sprayed it onto a piece of tissue until it was soaked with duster liquid, and then put the tissue to my mouth and inhaled hard. \r\nAfter holding it in for about 10 seconds, I felt the usual pulsating sound in my ears, as well as a rippling feeling in my whole body. It was a great feeling, so I sprayed some more, and inhaled it. I did this for about 3 more times. With that I felt as if I had gone into an alternate reality, parallel to this one. Things remained the same, but yet they seemed so different. I felt that I could be both the child I were long ago, and the person I am right now at the same time.\r\nWhat amazes me is the intense realization that 'There is no beginning' that swept over me all of a sudden. I kept feeling that no matter how far back I go, I can never reach the beginning of everything. Another interesting feeling that I had was that there was two of everything. Two lives, two myselves, even simple things such as two alphabets. I then realized that some weird memories were popping up in my head. Memories, that were obviously false, such as remembering seeing a big giant bird coloured like the rainbow, made of flames. However, although knowing that these memories were not true, at the same time, I believed them whole heartedly. \r\nRight about now I came to, and found myself in the kitchen, with the tissue and can of duster in my hand. I huffed again, this time feeling a light tingling feeling in my throat. I didn't take any notice of that at all, and huffed again. Random thoughts were entering my head again. I tried huffing a third time when I felt death. the tingling feeling in my throat turned into a feeling like about 20 long sharp needles, piercing from under my throat, into my brain. I felt I could actually taste the metal piercing through my tongue. I felt like I couldn't move at all. Like everything had ended. A realization came over me, that although the beginning can never be reached, the end can come quite easily. I was really afraid at the time.\r\nAfter about some time, I came to, and found I was lying on the floor. I capped the can of duster and put it back where I had found it, threw away the tissue, and vowed to myself never to do that again. It was a great experience at first, with a lot of things I still think about to this day, but its ending was horrible. I remained freaked out for about thirty minutes afterwards.\r\nIt was a memorable experience, and somehow, it changed the way I think about life. However I do not want to try it again.\n\n\n"
}
