{
 "title": "Consciousness Undulated",
 "author": "Fer",
 "citation": "   Fer. \"Consciousness Undulated: experience with Capsicum spp. & Alcohol - Hard (ID 63208)\". Erowid.org. May 23, 2007. erowid.org/exp/63208",
 "substance": "Capsicum spp. & Alcohol - Hard",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "3 glasses",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "1 fruit",
   "oral",
   "Capsicum spp.",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 63208",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 23, 2007",
   "Views: 23429",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>We traveled to Oaxaca, Mexico to participate in the 2004 Mind States conference and I wrote this report a couple weeks after we returned home for the November 2004 issue of Erowid Extracts newsletter.</p><p>http://www.erowid.org/plants/capsicum/capsicum_article1.shtml#fer</p><p>I drank a lot in Oaxaca, and that meant eating a lot of peanuts. As a standard practice, bars serve free plates of salted Spanish peanuts mixed with garlic and whole dried chiles, accompanied by wedges of lime to squeeze on top. I enjoyed one of my first plates of peanuts sitting in the zocalo (main square) on the eve of Mexican Independence Day, a festive unto chaotic free-for-all of rowdy partiers blowing cardboard horns and spraying shaving cream.</p><p>With eight of us crowded around a table meant for two, I launched into my third hearty glass of mezcal, reaching again for the peanuts but instead picking up a chile. I examined it closely-- whole, dried, red, seeds still intact--and touched my tongue to its surface--ouch! Wow, thats hot! Then I nibbled the end. Wow, damn! Thats really hot!</p><p>Chalk it up to the mezcal, or the riotous atmosphere, or the siren song of the altered state, but thats when I determined to eat the entire chile. Another small nibble, and sweat began to bead on my forehead. A third, and a fourth, in quick succession, crazy spicy capsaicin heat spreading through my mouth, rendering me unable to speak. My friends noticed Id started to drift off into some distant world of my own, realized my intent with the chile, and laughed heartily at the red-faced shock into which my face had contorted. My mouth on fire, tongue numb, lips burning, water only a reminder of the lava-like intensity permeating my entire consciousness, I realized that the only path toward achieving my goal lay in quick, decisive action. And so--chomp, chomp, chomp--I finished the thing off before my reasoning mind took hold.</p><p>Everything shimmered, the world a chimera, like watery looking heat rising off midsummer too-hot-to-walk-on concrete. My consciousness undulated painfully, and the raucous, festive scene, my friends conversation, and the bustling restaurant faded into the distance, there but not there. With the edge of my awareness, I knew that my friends watched and laughed, knew the revelry continued around me, knew a world existed outside the inferno in my mouth.</p><p>Sitting as still as I possibly could, lips rounded, I blew quickly in and out, attempting to circulate air through the fiery tidbit of hell Id created, that action and the shimmer of internal heat my only points of existence. After several minutes (or was it years?), I felt the outside world returning in slow, pulsating, burning waves. Almost as painful as leaving my body, returning meant feeling the chiles full force again.</p>"
}
