{
 "title": "Playing Games with My Brain",
 "author": "Thedormouse",
 "citation": "   Thedormouse. \"Playing Games with My Brain: experience with Zolpidem (Ambien) (ID 63219)\". Erowid.org. Feb 13, 2009. erowid.org/exp/63219",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 63219",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2009",
   "Views: 43746",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently visited my doctor because of some bad insomnia, and he prescribed me ambien, to be taken at 10 mg each night. I'm a psychoactive substance enthusiast, so I was pretty thrilled to be getting ambien, about which I had heard some very interesting reports. This was during a break, two days before I was to return to an out-of-state college, so I stuck with this small dose at night right before going to sleep. Nothing noteworthy. Once I got to college, though, I waited until a Wednesday night (no classes the day after) to finally test the potential of the drug. </p><p>+0.00 I took 1.5 pills (15 mg) in my room, and did menial tasks while waiting for it to start.</p><p>+0.15 I started to get a euphoric, sociable buzz, very similar to the point where you're just beyond tipsy and starting to get drunker. My roommate came in, and I very excitedly showed her some wind-up toys a friend had sent me, insisting we race them right then. She suspected I was drunk, but as that's nothing unusual for a Wednesday, she played along. I was very bouncy and happy.</p><p>+0.30 I began to notice that it was really, really hard to walk, it was like my internal sense of balance had been completely disrupted, and I had to make a concerted effort to walk straight and upright. Things generally seemed distant and silly, but I only really noticed that when someone tried to talk to me, it was as if my perceptions and senses, the machinery connecting my brain to the external world, was incompatible with everyone else's. Half of the things people said, I flat-out would not understand. Like, I registered the sounds they were making, but my brain couldn't glean any semantic value from their words. </p><p>+0.40 I went to my friend's dorm, where the lights were all turned off and people were cuddling and whatever, and felt exactly as if I were in a cabin in the woods. There was this very definite aesthetic shift from what I normally experience in the room. This all had me very confused. I clumsily stumbled to a bed, and someone asked me a question, to which I either laughed or just couldn't respond intelligibly, so they all asked me how much weed I'd been smoking and blah blah, and apparently I couldn't stop giggling. They all seemed to understand when I explained the actual situation, so people quieted down, and I was just lying in the bed when the green light on my friend's printer caught my eye. I thought it had moved, and when I kept staring it slowly morphed into a dragonfly, then a really delicate fairy. I asked if anyone else thought this light was weird, but they all just laughed at my tripping self. The movement then shifted to my friend's desk, from which I saw a bunch of doll's heads rise and dance around before disappearing. All of these hallucinations were novel, yet subtle and in no way unpleasant, I would describe them as kind of charming. </p><p>+1.00 I eventually decided to leave the room, and go to the next floor to visit my good friend who has taken an interest in hallucinogens. He unfortunately wasn't there, but his roommate was, he saw me staggering in, all confused looking, and asked if I had been smoking or dropping acid, and I told him the truth. He made some comment like 'Wow, it's late' and I looked over at his clock, only to realize I couldn't read it. He tried to explain what time it was to me, and I finally understood it, but was very confused about how an hour had felt like maybe ten minutes. He was also making a 'to-do list' for the next day, on which I (apparently) scribbled 'go outside' and then left, which makes no sense to me at all.</p><p>When I saw my friends the next day, they told me all sorts of things I had done that I barely remembered: stumbling into my friend's room to see if she was awake, running all over to get pop and water and tea (the drug gave me this weird thirsty/hungry sensation that I couldn't quite get rid of), and I'd barely remembered any of the conversation with my friend's roommate. </p><p>All in all, this particular experience was quite fun. I've since taken a similar dosage before going to a party, which I don't recommend, I became too uncoordinated to be around so many people and bottles of alcohol. Also, being on Ambien ultimately made me less social, because of the perceptive 'block' I described earlier. Nonetheless, fun for a chill, slightly trippy night with a few good friends.</p>"
}
