{
 "title": "Hitting a Tree and Knocking Myself Out",
 "author": "Simp",
 "citation": "   Simp. \"Hitting a Tree and Knocking Myself Out: experience with Mushrooms (ID 6325)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6325",
 "substance": "Mushrooms",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6325",
   "Male",
   " ",
   "Not Given",
   "Feb 18, 2002",
   "17245",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt was my and my best friends first time to try shrooms. We had our other best friend over, but he didn't want to try it with us. Which we thought would be a good idea to have someone not hallucinating with us. Our plans at first were to share a 8g bag between the three of us, but now since it was only 2 of us who wanted to try it, we just split it in half.</p><p>We decided to go camping out in the back of my property, therefore we wouldn't have to worry about anyone seeing us and us getting some deep shit.  We got out there and set up the tent and built a fire. We didn't want to have wait much longer, so we soon started getting at the bag of shrooms. By god, they were about the nastiest things i've ever tasted, but i really wanted to try them, so i just ate them as fast as i could. </p><p>It took about 15-25 min. for them to start kicking in. The first hallusionations were simple, like colors getting brighter and out hands and feet stretching out and stuff. I realy cant say how long it was until out peak started, cuz our friend that wasn't goin to be takin shrooms with us was drinking, and we couldn't tell because weren't able to keep up with time. But when we peaked, really weird shit started happening. First, my friends that was taking them with me started to melt and i was like, OH SHIT!! So i layed down on the ground and i started seeing the sun coming up and it being day and then like 1 min. after the moon come up and be night and it continued for about 5 minutes until i looked up and saw my friend that had melted earlier's face hoovering above the fire. I turned around and started hauling ass down the pasture and i started seeing trees moving from about 50 meters away from me to right infront of me in a blink on an eye. It wasn't to long before i hit this great big tree and knock myself out. </p><p>Next thing i know, both my friend who had just recently melted and the one that was supposed to be keeping me from doin stupid shit like that was shaking me and my foot was in a big pot-hole, my ankle was sprained, and i had big contusion on my temple from god knows what (there was probably a rock on the ground or just hard ground, i dont know which 'cause there was both around me). My expierence is a prime example of what u dont want to do for a first time trial, buy high quality shit and take too much of it!! Always have someone there completley sober that you can trust to protect you from runnin off and getting hurt!</p>"
}
