{
 "title": "A Child, a King, a Genius, and a Cereal Bowl",
 "author": "Godfrey",
 "citation": "   Godfrey. \"A Child, a King, a Genius, and a Cereal Bowl: experience with Morning Glory & Passionflower (ID 63263)\". Erowid.org. Mar 10, 2010. erowid.org/exp/63263",
 "substance": "Morning Glory & Passionflower",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 cups",
   "oral",
   "Passion Flower",
   "(tea)",
   " ",
   "150 seeds",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63263",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 10, 2010",
   "Views: 8594",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter wanting to try LSD/LSA for a long time, I was given a chance to when my parents left for a weekend. I bought a coffee grinder, four packs of Morning Glory Seeds, and made up my mind. I wasn't sure how I'd react to this stuff, and 100-200 is a common dose, so I took the mean of that.\r\nCounting these little mexican jumping beans is a bitch and a half. I made 15 little piles of ten a piece. These things have a way of looking like a lot, and then looking like not much at all a few minutes later, as though its an optical illusion. Even though the package had no warnings to indicate the seeds might have been treated, I shook 'em around in warm water with some dish detergent anyway. The water was not discolored, which gave me mixed feelings, but I just rinsed them in a strainer with cold water for a few minutes and set them on a paper towel to dry. The next day I woke up bright and early, did what little chores I had to do, drank a double dose of Passionflower tea (the box said it had 'calming' properties. I assumed it would help me with my first trip and maybe 'calm' my stomach), ground up the seeds into a fine powder, mixed it with water, and gulped it down with an orange juice chaser.\r\nNone of the reports seemed to be quite on when it comes to the taste of MG seeds. It wasn't gag-inducing or even bad (or good for that matter). They don't taste 'nutty' either. They taste kind of spicy-burnt. Almost like chipotle, only not as pronounced.\r\nAfter all this, I went and got dressed, came downstairs and did the crossword while I waited for the effects to come on. Within 20 minutes I felt kind of nauseous, but it wasn't unbearable. I went outside and laid down to wait for it to pass and for the trip to come on.\r\nMaybe it was the passionflower, but I was soon washed over with an incredible lethargy. The most simple of tasks, such as scratching an itch on my leg, seemed like monumental endeavors. Within about twenty minutes I started to feel cheated. I was seeing nothing. I did all this work for nothing. I closed my eyes to see if I could get any sleep back after waking up early for this. After closing my eyes and not really noticing small patterns on the inside of my eyelids I opened my eyes thirty minutes later and saw that the roof of the back porch had blue streaks on it. I jumped up, excited, only to find that that's the only thing that happened. Soon the nausea hit me again and I went inside to make myself throw up. Dejected, and unable to get back to sleep, I went inside to jack off.\r\nAbout an hour later (it took a while), I went outside on the back porch again, and sat out on the patio and watched the sun rise up through the treetops. Lovebugs were buzzing around me, leaving trails where they were flying. It seemed brighter outside, and everything looked beautiful. I decided to go inside and eat a bowl of honey nut cheerios, as I was feeling kind of hungry. Bad idea. The nausea hit me again like a ton of bricks. I emptied the bowl into the sink and went back outside to watch the sky some more. I went inside again and noticed my whole body was buzzing. I was exploding in smiles, and I felt orgasmic. Everyone talks about the visual aspects of tripping but no one told me about my whole body being enraptured in a giant orgasm. It was a beautiful day, and I decided to go for a walk. \r\nI must have looked like an asshole, wandering around with a huge grin on my face, looking at everything like Ive never seen it before. But I didnt care. Everything was so amazing, and every breeze on my body only further heightened the euphoria. I decided to go to my friends house, but I decided against it as I was surprised to see that it was only 11:00 AM. I figured she wouldnt want me dropping in on her so early in such a state. So I walked the other way and began to notice that my ego had fragmented into two separate pieces. One was a small, curious child, and the other was narrating what was happening in the first-person past tense. These two psyches worked independently and never conflicted with each other. \r\nI walked down the street and started picking fruit off a tree. Its a south American fruit whose name I dont know. Its from one of the Portuguese-speaking South American countries. It looks like a small tomato with ridges and has a spicy-sweet-tart taste. If anyone knows what this is called, Id love to know although Ive never seen it in stores. I Had about five of them and started walking back to my house, eating the delicious, juicy fruit and grinning again like before. Before I got to my house, I sat on an electrical box underneath two trees and watched the sky again. For a moment I was King Of The Universe. I created this. Everything in the world is here because I willed it to be. Time is not a factor because time doesnt exist. I created time.\r\nMeanwhile, my narrating ego kept a sense of irony about all this. I went back to my house, and let my two dogs out to go outside. The screen door was broken. I wasnt mad or annoyed, as I normally would have been. I saw it as a puzzle. A riddle put forth to me as a challenge. I messed with the latch for nearly half an hour until I opened the bar where the latch meets. When I let the dogs back in, I realized I needed to turn the pool on, so I went out andslam. The door was closed I was locked out. I was saddened more than I was angry. I walked across the street to see if a friend of the family happened to have a spare key given in case of this situation. But I turned around before I got to the street. He cant see me like this. And besides. This is just another challenge. To ask him would be cheating. So I scoped out possible ways to get in before I walked around the screen room in that three-foot-wide space between the fence and screen room and came to the other door. \r\nI put on some music (The Apples In Stereo Her Wallpaper Reverie for those curious) and caught a glimpse of the pool. The patterns on the bottom seemed to move in time with the music, and shadows from ripples would go all the way across the pool, up the walls, and up into the sky. I laid here for an hour, watching the water, until I got restless and started to come down. My two egos slowly began merging into one, and I came down easily and with only a slight headache as a hangover.\n\n\n"
}
