{
 "title": "Cured My Bipolar?",
 "author": "BillyPilgirm",
 "citation": "   BillyPilgirm. \"Cured My Bipolar?: experience with Mushrooms (ID 63269)\". Erowid.org. Jun 12, 2007. erowid.org/exp/63269",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "5.0 mg",
   "oral",
   "Pharms - Risperidone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63269",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 12, 2007",
   "Views: 12697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I remember buying the shrooms from my dealer and as I was leaving he said 'be careful man, 1 gram of this is like 3 grams liberty' I thought yeah right and resolved to take all 4.5 grams as the sun came up over my farm.  </p><p>Anyway a little back-story, a couple months ago I was diagnosed with atypical bipolar, it was hell, I wouldn't sleep for 4 days at a time and as a result I would get all sorts of messed up paranoid hallucinations, no fun.  Anyways, ever since I'd been taking 5 mg of Risperidone a day and they had disappeared, but I digress.  The next day at 4:30 a.m. I and a friend got together, I took the shrooms and he dropped about 3 hits of acid.  I knew I was in for a royal asskicking when I was having full blown visuals within 15-20 minutes, I mean hieroglyphics in the sky, pissing blue, the whole spiel.  I decided this was some serious shit and went in my room to lay down and experienced what I can only describe as complete ego death, I was melted into a big pile of goo as I reexperienced everything that had happened to me in my short 17 year life. </p><p>I saw beautiful alien landscapes where the inhabitants lived in a harmonious perpetual dance of life and death.  One of the aliens came over to me and took my risperidone dumping it on the ground where the hundreds of pills turned into spiders and scurried away.  The whole time I was experiencing full blown auditory hallucinations and was covered in sweat, not exactly pleasant.  I struggled through the experience, rolling with the hits and letting my ego be shattered over and over again.  </p><p>When I was finally coherent after about 3.5 hours I awoke completely calm, I had never felt so at peace, I resolved to stop taking my meds and have been off them for 2.5 months with absolutely no relapse, mushrooms truly are mystical beings.  Oh yeah, the next week I found out from a good friend that those had been legitimate flying saucers, which explained the intensity.  I had done several Ayahuasca trips prior and they didn't hold a candle to this. It certainly helped me.</p>"
}
