{
 "title": "The Jungian Shadow",
 "author": "Uv1",
 "citation": "Citation:   Uv1. \"The Jungian Shadow: experience with H.B. Woodrose Seeds (ID 6328)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6328",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "7 seeds",
   "oral",
   "H.B. Woodrose",
   "(extract)",
   "  T+ 2:30",
   "0.15 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "0.15 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 6328",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 14430",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was one of my most interesting and frightening experiences. At eight O'Clock in the morning, I begin by drinking the extract of 7 HBWR seeds. The seeds were crushed and soaked overnight in tap water. (Note that Finnish tap water is much cleaner and has less chlorine than in most other countries) In just about half an hour since this, I feel an upset in my stomach. I set still, and the discomfort never gets too distracting. During the first hour I have many associations in my mind, most of them provoked by the music, Peyote by O Yuki Conjugate.\r\nAt about half eleven (T+2:30) my thoughs were 'lost', as when the two halves of the brain are submitting different signals and fighting over  which one to process. I get bored, the seeds don't seem to be having any significant effect when they should, and I smoke some cannabis at this point. It was a small amount of Indica hashish, perhaps 0,15-0,2g altogether. Very soon I noticed the heavy physical feeling, and was a bit surprised how fast it hit me. I went back inside and first started reading a book, then watching tv but I could not concetrate on neither of them.\r\nI moved to sit in front of the mirror to look at myself. There was myself as an old person, very different from what I am now. There was bitterness, conservatism, dislike of many things I have loved. Still manageable. Then I saw the Nazi propaganda chief Goebbels. I terrified because he and I were too so similar. Only the outlook made me realize the ideological connection. There was a fascist in me, and had always been, but only working in my subconcious. I could not run away from what I saw. I sought comfort from everything, hoped that something would offer me a safe glimpse of normal reality. But no, there was fascism in every single object and thought I had.\r\nI smoked more pot a while later (at T+3:30). I let loose of my thought and set to dwell on the vivid scenery the music created. All this while the image in the mirror had been troubling in the back of my mind, but it no longer was an acute crisis. I decided watching Rocky Horror Picture Show was just fit for the comedown phase. It was a bit disturbing, after all, but I enjoyed it as always. The altered state slowly faded by 4 O'Clock (T+8:00). \r\nI do not know in what relation the entheogens attributed for my insights. I hardly can say if I'd sat down and looked at the mirror totally sober those same things had been seen there. I have taken LSA seeds, from this batch and with this exact same preparation method several times before, with good response. Cannabis seems to have good synergy with LSA. The dominating substances were the cannabinoids, but the lysergic acid amides contributed the 'trippy' aspect for the experience. What it has made me afterwards? I got in contact with the parts of me that I've often overlooked. In the long run this has been a positive improvement.\n\n\n"
}