{
 "title": "Concentrated Decoction",
 "author": "Azerty",
 "citation": "Citation:   Azerty. \"Concentrated Decoction: experience with Poppies - California (ID 63290)\". Erowid.org. Jan 21, 2010. erowid.org/exp/63290",
 "substance": "Poppies - California",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Poppies - California"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63290",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 21, 2010",
   "Views: 18693",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI discovered california poppy, about three month ago, as I was experimenting sleeping problems. The red, corn poppy (papaver rhoeas), has been a great help, some nights, so when I heard of another plant of the same family, I decided to try it.\r\nIt was easy to get capules of it. I took, during the day, in order to experiment the effects, two caps of 300mg of the powdered dried plant. I felt relaxed in about 30min, and I noticed that the effects were quite enjoyable, and that I could have called it a high. I took two other caps before sleeping, and had no problem for that this night. The next morning, I felt a little bit mellow. From this day, I was sure that this plant had a recreational potential, and experimented it. I found various way to use it.\r\nThe effects are sedatives, like a mild opiate, (as I can remember, years ago, the effects of smoked opium poppy extract, and of codeine). The plant is also a painkiller and an anti-anxiety, and (of course) anti-insomnia. It will some times give me a mild euphoria. It can also send me to a half awake/half asleep state, with a lot of eye-closed visions, if I go to bed when I am on the maximum of the high.\r\nIf taken while drinking a lot of alcohol, it will stabilize my emotions, and prevent me from being sad, agressive, violent, and so on when I drank to much.\r\nSo, let me expose the three ways I take it:\r\n1) Tea\r\nIt is the prefered way for medicinal use: sleeping aid, painkiller...\r\nUse one to three teaspoon per person in infusion or decoction. I may experience the high this way, but for these purpose, the others methods are better.\r\n2) Smoked\r\nI have smoked the dryed herb, in a pipe or water pipe. But the herd is some times sold with the stems, witch, when burned, gave a very aggressive smoke, so I remove them, and smoke only leaves and flowers. California poppy can be mixed with weed, to obtain a more sedative effect. The powder contained in capsules can be smoked, mixed with tabbaco for example, I use about 250mg per joint.\r\n3) Concentrated decotion\r\nA sort of opium-like substance can be obtained from california poppy, even if I have only the dried plant. In France, we can find a drug, called 'rachacha', witch is a sort of low quality opium. It is obtained not by recolting the latex of papaver somniferum, but by concentrating a decoction of the plant. In short, the decotion-concentration is just a water extraction (some might use ethanol or ether but never tried it on CA poppies). And this can be applied to california poppy. I get something witch looks like opium, smoke and taste like it, but the effects are of course milder. It is by smoking this extract that I obtained several times the 'half awake/half asleep' state.\r\nThis requires that:\r\ni) get a large amount of CA poppies. I get 10g off extract with 50g of dried plant.\r\nii) put if in cold water, and boil it, when it is boiling, wait 5 minutes, and stop. Wait several minutes for the plant to infuse then filter, and press the plant, in order to extract all the water in it. Or I may boil plant+water mixture *very* softly, during 10 or 15 hours, adding water if needed. It is a good idea, if I have the time, it usually gives me a stronger product. A third, way, is to let the decoction macerating for a night before filtering.\r\niii) I have now obtained a brownish to black liquid, that I must transform in an opium-like substance. I then boil it, until all the water is gone.\r\nThe substance obtained can be smoked, pure in a pipe (an opium pipe is better), or mixed with tabbaco in a joint. Sometimes I eat it. I take the extract little by little and, let it melt in my mouth, instead of just eating it. I can also let the entire dose melt under my tongue. The effects are present, slowly declining for hours, with medium doses, I can feel them for 6 hours.\r\nThe same process can be applied to corn poppy (papaver rhoeas) petals or to mexican prickly poppy (argemone mexicana). The p.rhoeas extract is dark redish and have a very floral smell. Smoking it gives me a very pleasant effect, superior to CA poppy extract, but it will not last more then 30min. The a.mexicana extract is darker than the CA poppy one. The effects are different, and stronger, not so relaxing, more euphoric, lightly psychedelic in high dose. But with a very high dose of this stuff, the effects will stand for a long while, maybe one or two days, and it is not always a good thing.\n\n\n"
}