{
 "title": "My Awakening",
 "author": "Liam",
 "citation": "   Liam. \"My Awakening: experience with LSD (ID 6329)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6329",
 "substance": "LSD",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6329",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 18, 2002",
   "Views: 8102",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThe following is an attempt at describing MY new beliefs of reality (with the English language as my toolkit!):</p><p>------------------------------------------------------------</p><p>Oh no! This cant be!</p><p>During this trip, I had the realization that what I think of as our life in this universe is merely the dreaming of our potentially higher state of consciousness. This is presumably similar in the way that our normal dreams are of a relatively lower state of consciousness. In this simpler dream, physical reality doesnt exist. This also appears to be the case in the psychedelic state of consciousness. It is not necessary for it to.</p><p>Relative representation of states of consciousness:</p><p>-</p><p>Psychedelic</p><p>-</p><p>Normal</p><p>-</p><p>Sleep</p><p>-</p><p>There may be states in between, above and below these. Who knows!?</p><p>The differences I observed between these states are:</p><p>1) Perceptions become increasingly complex at higher levels. (Keep in mind that it would be daring to draw conclusions from statistics of just 3 cases!)</p><p>2) Time is perceived very differently at each level.</p><p>3) Events that have occurred at levels of consciousness below that which I am at seem to have small significance to the bigger picture of the relatively higher level.</p><p>4) Yet events that have occurred at levels of consciousness above that which I am at, do significantly affect my future thoughts at the relatively lower level.</p><p>5) Sleep appears to be solely my imagination whereas this state (and the psychedelic state) are shared with other life forms.</p><p>One of the (pleasing?) implications of physical reality not existing at different levels of consciousness is that physical death is extremely unlikely to be the end of the line. While I can give no rational argument to back this up (if there was, you would have already heard it from somebody else), I can tell you that in the psychedelic state it is as intuitively clear that consciousness transcends physical confines as it is in the normal state that, say, other people have their own consciousness too.</p><p>This sounds pretty rosy and might appear to be a good reason to take LSD so I can reassure myself that I dont have to spend my life worrying about running out of time. But after this life could just as well be something unimaginably bad. Permanent death would be an absolute blessing if after physical death our consciousness perhaps shifted into a permanent psychedelic-like state where we couldnt cope, and leading to eternal hell. Nobody can know, lets be optimistic!</p><p>For the moment, I have no further reason to take more LSD. I honestly feel I have discovered that consciousness does not end at physical death, and this knowledge is all I need to enable me to relax and enjoy this life to the fullest. I can see only two other reasons for taking LSD. The first is psychotherapy and the second is recreation. To me, however, neither of these are worth the wager of insanity. Perhaps after physical death, there maybe reason (should it be possible), to explore consciousness further, but for now I cant justify putting sanity on the line. It could well be the most important thing we ever have.</p><p>Ahhhhhhh, yeeeeah! Its nice to be back.</p><p>------------------------------------------------------------</p><p>After all this, Im not saying that science is invalid or pointless, but in the grand scheme of things it can only examine a subspace of the whole picture and therefore it cannot discover the whole truth.</p><p>No matter what happens, respect your well being, respect other peoples well being and do your best to tackle EVERYTHING with a positive attitude.</p>"
}
