{
 "title": "Pleasant , then unconsciousness.",
 "author": "Grad Student",
 "citation": "   Grad Student. \"Pleasant , then unconsciousness.: experience with GBL (ID 63305)\". Erowid.org. Dec 18, 2007. erowid.org/exp/63305",
 "substance": "GBL",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "5.0 ml",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63305",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 18, 2007",
   "Views: 13755",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After purchasing a quantity of industrial degreaser (99.9% GBL), I settled down on a quiet Sunday evening to experiment with it.</p><p>At 8:30 pm, I measured out 5 mL of GBL and poured it into a small juice glass. Unadulterated, the GBL had a moderate chemical odor, and smelled vaguely like gasoline, airplane glue, plastic, or turpentine. When I placed a small drop on my tongue, the taste was similar to the smell, and burned slightly - the same way hard liquor does.</p><p>I then added 2 small ice cubes and filled the remainder of the glass with pineapple juice. The taste of the GBL was still strong in the mixed product. Together, the GBL & juice tasted like a fruity mix of bathtub gin and pineapple  only more chemical and kerosene-like. While not pleasant, it was palatable.</p><p>Immediately after drinking, my face flushed and my heart sped up. This was likely due to nervous excitement, though I mention it in the interest of completeness.</p><p>However, within minutes (T+0:05), I began to experience mild intoxication. The onset of symptoms was rapid. By T+0:07, my face was feeling flushed and there was a general skin tingliness. At this point, I felt mildly dizzy, drink, and happy. It was a happy, loving feeling.</p><p>Symptoms continued to increase over the next ten minutes. I remember being amazed at the speed at which GBL acted. By T+0:15, it was extremely difficult to keep a written record of events, but my thoughts turned to food and sex. I felt the urge to stand and spin around, despite the lack of TV, music, or other people. Euphoria, dizziness, and intoxication continued to increase.</p><p>Events from T+0:20 onwards are extremely blurry. At T+0:30, I passed out.</p><p>At T+2:00, I woke up, feeling nauseous. While I was still intoxicated from the effects of GBL, there was slightly more control to the feeling than, say, being drunk from alcohol. I made my way to the bathroom and vomited several times.</p><p>I had previously eaten a light snack of carrots and dip. In retrospect, I would not recommended consuming anything prior to use of GBL.</p><p>After emptying my stomach, I settled back down on the couch and passed out within 15 minutes or so. (T+2:15)</p><p>At T+4:25, I woke up again. I was mildly hungry, and almost completely sober. Because it was late (1:15 AM), I decided to go back to bed, though this was more of situational decision than one brought on by the GBL. That is, I had more or less completely returned to baseline by this point. I had some difficulty getting back to sleep, though I often suffer from insomnia and cannot be certain whether this insomnia was a rebound effects from the GBL.</p><p>In retrospect, GBL strikes me as a drug with a great deal of potential, based on my limited enjoyment of the effects. Before passing out, symptoms were pleasant and had the potential for recreational enjoyment. It is clear, however, that even mild overdoses can lead to drowsiness and nausea. In the future, I will attempt a smaller dose.</p>"
}
