{
 "title": "Moral: Leave it in the Baggy",
 "author": "Hakushon",
 "citation": "   Hakushon. \"Moral: Leave it in the Baggy: experience with PCP (ID 63397)\". Erowid.org. Jul 21, 2008. erowid.org/exp/63397",
 "substance": "PCP",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "4 lines",
   "insufflated",
   "PCP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1972",
   "ID: 63397",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2008",
   "Views: 36386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt's a long time ago, but I can remember it as if it were this morning. More so than most other substances that I ate, drank, smoked, hotknifed, balooned, snorted or injected during my twenties - it was a busy time for psychon(a)uts. I, and practically everyone I knew, was routinely hoovering up anything that came along, and as much as there was, until it was all gone. Anyway, this day someone happened to come round to my place toting a baggy full of Angel-dust. It looked like cocaine, but more...er...dusty. I was mad keen, having not tried it before.\r\nThe four of us present proceeded to snort a few lines each, in rotation. We probably would've done the whole bag, which had been dumped out on a little tray in the middle of a low table, had not one of the assembled, whose inherent asshole-nature was coming to the fore somewhat, and whose nostril was over-stimulated by heavy snortage, suddenly sneezed, blowing the entire remaining contents of the tray onto the shag-pile beneath the table. To say I was a mite miffed would be an understatement  I was livid, apoplectic already. I started yelling at him and calling him everything I had always wanted to call the many cunts I had encountered in my short life, but had hitherto always been too meek to squeak.\r\nNext thing I knew I found myself groveling on the rug, trying to snuffle up the diffused powder from among its jungle-like fibres. Now who was the asshole? As suddenly as the sneeze had burst from the hapless guys nozzle, the realisation imploded upon me that I was more fucked-up than I had ever been in my life, in the sense that I was totally out of control and in a psychopathic state of mind. Much more out of control than when I had taken hefty doses of LSD, hash-oil, opium, intra-veinous cocaine, or cough-medicine (well, maybe not the cough-medicine). This psychic bombshell froze me in my tracks. Mr Hyde in da house as the youth of today might have it.\r\nI felt humiliated and humbled as my co-dusters hurled dagger-looks of deep contempt at me. One of the women, whom I had for weeks been trying to coax back from the ledge of Lesbos, expressed her utter horror at my behaviour, and stormed out, never to return. The others just sighed and split slowly and sadly into the San Francisco afternoon fog. All I could do was smoke some reefer and try and mellow out. But I was down to seeds and stems again too to quote a popular beat combo of the time. Nothing else for it, Id have to lie down and have a wank, and maybe take a shower too, preferably cold. The comforting slosh of the waterbed (yeah ok I know) quickly lulled me into a reverie, and I drifted off into a floaty high.\r\nI thought the PCP was all over, dissipated by my unpardonable outburst and show of macho aggression. How wrong could I be? As I meditated ever deeper upon the volatile nature of my oh-so-human mind I felt profound tears welling up from the very depths of my being. I began to weep with body-wracking jolts, the resulting waves of the waterbed rocking me like a newborn baby. I just cried and cried, at first for all my own fears, insecurities, and deepest disappointments, then gradually expanding into a feeling of empathy for all, including the clumsy guy who had sneezed so many centuries ago in the next room.\r\nEventually I was all cried out, and my body and I-sense had melted away leaving my awareness centred in an apparently infinite sky-like blue void. I had forgiven myself, you see, and what was left was a pure unmodulated consciousness. I never would have expected it from a few hits of a nasty chemical. I never had such a feeling of freedom and bliss before, even from my most beloved sacrament, acid. This state lasted for an eternity, wrapped up in a few seconds, or at most, minutes. I can still almost taste it as I write, 35 years after. Somebody who knows more about such things than I later told me that I had seen The Blue Pearl. All I know is Ill never forget, even if I live another 35 years.\n\n\n"
}
