{
 "title": "Ideal for Manual Labor",
 "author": "seaborg",
 "citation": "   seaborg. \"Ideal for Manual Labor: experience with Kratom (10x extract) (ID 63393)\". Erowid.org. Aug 9, 2007. erowid.org/exp/63393",
 "substance": "Kratom (10x extract)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "Kratom",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63393",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 9, 2007",
   "Views: 5824",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter 2 very good, moderate dose experiences, I decided to try a low dose kratom buzz at work.  I've read reports of Thai kratom addicts using the drug primarily as a supplement for hard labor.  My job as a full time produce stocker is very physical and boring...I'm usually drained and grumpy all day at work and then for a few hours after.  After a 1 gram dose two days before, I tried 3/4 of that, mixed in warm water and downed in a gulp on a half empty stomach.  <br>The initial effects of stimulation and good cheer came on in about 10 minutes and lasted for 2 hours.  It felt like a very strong but clean coffee buzz combined with a 'polite' and scaled back MDMA euphoria.  When customers wasted my time with obvious/rude questions, I answered cheerily, and volunteered to stock watermelons.  It made a day at work about as fun as a day off without drugs...I felt a lot more outgoing than usual.  After about the two hour mark, I felt a slow transition into the more sedate, vicodiny side of the herb, which lasted another two hours...subtle, but very noticable analgesia was prominent.  My hunger was slightly less than usual as well.  At the end of the shift, I felt groggy, but quickly rebounded after it totally wore off (4.5 hours after drinking)<br>From the perspective of a person who doesn't like the idea of becoming addicted to something, it's scary how closely this drug meets my wants checklist for a substance.  I guess I'm addicted to coffee and don't think much of that...this is kind of on the borderline...I'm not afraid of any negative health effects, and the cost of the drug is within my reach...it just seems to good to be true.  I feel like Johnny Cash discovering uppers for the first time.\n\n\n"
}
