{
 "title": "Vitruvian Helix",
 "author": "Robinhoody",
 "citation": "   Robinhoody. \"Vitruvian Helix: experience with Salvia divinorum (tincture & 5x extract) (ID 63469)\". Erowid.org. Dec 26, 2007. erowid.org/exp/63469",
 "substance": "Salvia divinorum (tincture & 5x extract)",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "2 drops",
   "sublingual",
   "Salvia divinorum",
   "(liquid)",
   " ",
   "200 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 63469",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 26, 2007",
   "Views: 2943",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Prior to this experience, I had used salvia extracts a half dozen times or so, but never really achieved any effects aside from being lightheaded and giggly. I had recently won a contest on a message board and received a vial of an ethnobotanical vendor's newest product, a rather strong salvia tincture.</p><p>Hoping that the tincture would finally be what was needed to break my salvia hardheadedness, I took two dropperfulls at 6:00PM. As I put them under my tongue, the alcohol burned horribly. The burn lasted 2 minutes, and subsided. I held the tincture in my mouth for 15 uncomfortable minutes. The burn wasn't that big of a deal, but I found my mouth filling to the brim with saliva. I could barely keep my mouth shut for the whole 15 minutes. But when 6:15 rolled around, I allowed myself to swallow.</p><p>Nothing.</p><p>I was disappointed by the lack of effects, and decided that I would try smoking a bowl of 5x extract. I fetched my bowl and the salvia, and packed roughly 1/5 of a gram into my pipe. As I was preparing, everything felt normal, but that was about to change.</p><p>I could feel something different from the moment I put the pipe to my lips. Halfway through the inhalation, it began to hit me. I could feel my body pulling back, and my vision growing dark. It was as if my body were staying in place, but my mind and vision were pulling back inside of me, causing my vision to be shadowed by my physical body. My coordination was shaky at best, and I hurried up and finished inhaling and quickly put the pipe and lighter down on the table beside me.</p><p>I barely had time to put the pipe down before I completely lost it. I don't even remember holding the smoke or exhaling. I just remember putting the pipe down and being shot up and around through an increasingly dark and empty cosmos.</p><p>My body began spiraling upwards like a helix, and as I looked beside/behind me, I could see thousands of copies of myself where I had just been, like trails. My body was spiraling higher, and the copies of myself were left in place where I had passed, each standing with outstretched arms and legs, like the Vitruvian man, and each connected to the copy on either side of it at the hands and feet, much like those paper chain people. And wherever the copies met, they met in a point of bright orange and yellow light, radiating out wards, and outlined in red.</p><p>And as I spiraled up and up, I heard a chanting from all around me. The voice was hard to identify, but it was a group. A chorus. And the voices were high. I could only make out part of what they were saying, though. It was some short rhyme along the lines of 'You must [something]/Stay and play'. And it repeated over and over and over. It never grew loud or uncomfortable, though, and I was perfectly content to 'stay and play', but I felt my physical body pulling me back, and I lost my grip on the void and found myself spiraling back downward, passing through my Vitruvian copies, absorbing them one by one, until I was back in my body.</p><p>But I still wasn't completely baseline. For some reason, I immediately felt as though I had to clean up my area. There was this overwhelming pressure for me to clean up my salvia and pipe and stuff, even though I could barely stand. And while I knew I could barely stand up, I still proceeded to do so.</p><p>And while I stood there, hunched over and swaying, emptying the ashes from my bowl, I felt a distinct shift and a conversation began. I don't even remember the specifics of what was said. I just remember that my body stayed in place, cleaning out the bowl, but my mind shifted 3 feet to the right. It was like an out of body experience, but instead of floating above myself, I was floating beside myself. And my physical body continued my work. It was still there, emptying the bowl out, and packing up the salvia, and rinsing out the pipe, as if on auto pilot. And as my mind stood/hovered/floated beside my body, I found myself having a conversation with someone. I don't know who it was, but I know it was a woman.</p><p>My mind, hovering to the right, would say something (though, since it wasn't in a physical body, it was mental communication), and then my physical body would respond, audibly. I could hear my physical body speak, and it was in my voice, but it was a woman speaking. I don't know how I know that, but I know that it was a woman speaking with my voice, through my body, while I carried my end of the conversation mentally.</p><p>And when my body had finished cleaning up the immediate surroundings, I felt myself 'reabsorb' into my body. It was an immediate absorption, with no gradual 're-entering' of my body. It was like the exact opposite of the shift that originally cleft my spirit, an instantaneous shift of perspective.</p><p>And then it was over.</p><p>I was back in reality, alone, with a clean pipe and a head full of confusion.</p><p>By my best estimates, being absent a clock, the entire experience from packing the bowl to being reunited with my body, took only six or seven minutes, but it felt like an hour at least.</p><p>I still don't feel as though I broke through completely, but I'm grateful that I was able to experience what I did, and look forward to going further in the future.</p>"
}
