{
 "title": "What is She Seeing?",
 "author": "Ohmy",
 "citation": "Citation:   Ohmy. \"What is She Seeing?: experience with Zolpidem (Ambien) (ID 63488)\". Erowid.org. Sep 28, 2009. erowid.org/exp/63488",
 "substance": "Zolpidem (Ambien)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Pharms - Zolpidem"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63488",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 28, 2009",
   "Views: 7753",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy mom has been taking pills since high school, but after a traumatic experience she began falling back into her habits. After the trauma, which involved my dad breaking into our house (drunk) and lighting himself on fire, my mom took advantage of people who felt bad - and gave freely of their pill stashes. He survived, which probably makes the anniversary a little more painful for her.\r\nI was only 4 years old and I don't remember much about it. More clearly, I remember long nights when my sister and brother would call an ambulance for her. They are both now married with children, and it is only her and myself living here.\r\nSo now, 18 years after the trauma - to the day, she has taken Ambien because her other sleeping pills were not due to be refilled. Mind the fact that she knows Ambien makes her nuts - sleep eating, unsteady walking and breathing, falling, sleep smoking cigarettes and burning holes in her sheets.\r\nHowever, at this point in the evening (2:06am) I have seen her put chopped melon on a tortilla, call me Alex, ask for Kate, speak of my dad, talk about us kids getting pizza. She nearly fell into an end table, staggering. I asked her to stay in the living room to smoke her cigarette and she would have passed out with it lit if I did not keep her in conversation. Needless to say our conversation was all over the place.. every sentence out of her mouth - drifting off into nowhere, having no point. And not a single sentence connected with the previous. She said she loved me and she said my correct name but honestly, she is not in reality. She asked me where my babies were, told me that her 'brother sure did like me.'\r\nSo I don't know what to do or who to call or when to call. I don't have her therapists number, and I've already spoken with her psychiatrist twice. I love her very much.. but I have to get up for work soon, and I don't know how I can sleep so worried.\r\nAs for Ambien, grr.\n\n\n"
}