{
 "title": "Fifteen Minutes of My Life",
 "author": "Plzdntdothtsht",
 "citation": "   Plzdntdothtsht. \"Fifteen Minutes of My Life: experience with Salvia divinorum (10x extract) (ID 63538)\". Erowid.org. Aug 23, 2007. erowid.org/exp/63538",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2007",
   "63538",
   "Male",
   " ",
   "Not Given",
   "Aug 23, 2007",
   "11242",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me make this introduction relatively brief.  I havent really done that many different kinds of drugs.  My repertoire basically includes Cannabis, Ecstasy (MDMA), Salvia Divinorum, Amanita Muscaria, Morning Glory Seeds, and probably something else that escapes me now.  Now, of these, I have found Salvia to be the most interesting.  It certainly isnt the most pleasurable, as many before me have noted.  That being said, Id say its safe enough for most people, provided you can respect the power of this hallucinogen.  If you are looking for a fun high or interesting visuals, youre curious about the wrong substance.  Expect to do some deep reflection following your experience.</p><p>What follows is a description of my most recent Salvia experience.  I wont go into detail about how to smoke Salvia because there are many guides out there.  However, I will attest that holding the smoke in longer greatly increases the effect.  Having smoked Salvia about twenty or so times, I generally can judge how quickly Im coming up.  It is almost certain that the first time you attempt to smoke Salvia, you will underestimate the rapidity of the onset.</p><p>Setting: Clean dorm room, all clutter put away, a lot of space to move around in, if necessary.  Quiet, some music bleeding through from the neighboring room, well-lit, warm.</p><p>Sitter: No.  I wouldnt recommend trying Salvia alone the first time.  Some people emphasize this much more than I feel is necessary, but it is true that there is no way you can predict how you will react to Salvia beforehand.</p><p>Time of Intake: Roughly 8:25 PM.</p><p>End of Major Effects: Roughly 8:40 PM</p><p>Type of Drug: Salvia Divinorum - 10X Standardized Extract [Purple Sticky Salvia]</p><p>Amount: Uncertain, but doesnt really matter because everyone reacts differently to the same amount.</p><p>Method of Intake: Water pipe</p><p>Other Relevant Information: I was sitting in a desk chair in the center of my room.  The door was closed.</p><p>Narration:</p><p>I began, sitting on a desk chair, by inhaling the smoke from one entire bowl of extract in one hit.  I sat still, not really counting seconds, but trying to hold the smoke in for as long as I was able to.  I decided to breathe out after what was most likely fifteen or twenty seconds because I was felt that the come up was occurring very rapidly.</p><p>I cant say I remember what happened immediately after I exhaled.  The first thing I can remember was suddenly becoming immersed in a bizarre but blurry world that was made up of living entities.  I didnt see these entities with my eyes, but I felt their somewhat sinister presences.  Each had the same mocking personality, and I definitely could hear voices.  I think the best way to explain it is to say that there were voices in my head, taunting me, and that I was able to formulate a mental picture of the entities/spirits faces.  I am totally unable to describe or draw these faces.  What were the taunts about?  As far as I can recall, the spirits were saying things with meanings along the lines of, Youre stuck here, Theres no way youre getting out of this, This is the REAL world, so theres no going back, or Look!  How can you deny this is real?  </p><p>I would say that I generally have a pretty strong mind, and I am not easily overwhelmed.  Therefore, even though the world I seemed stuck in was right before my eyes, my fighters instinct was alive and kicking.  So I yelled back, telling these entities that I was leaving, that I wasnt going to believe in whatever it was they wanted me to.  Wherever I looked, my world appeared strange and blurry and filled with taunting presences.  By this point, I had gotten up and was walking around in circles, trying to look for any cracks in this world to show these spirit-like beings that I wasnt going to be stuck with them.  Every way I turned I ran into more proof that I was really in this place, and that the spirits were right, but that didnt make me give in.  I only yelled louder, telling these fucking spirits that I would not fall for their games.     </p><p>Finally, I reached the absolute peak of my trip, at which point I was virtually forced to confront indisputable evidence that I had entered a hidden world.  I was in Salvia land (or whatever you want to call it).  This was when I realized that through Salvia, one could reach this secret realm.  No longer were those entities taunting me, I was past that.  I could see that all things connected.  At the center of everything was this high-deity, Salvia.  I did not see this deity with my eyes, but I knew it was really there, at the center of this Salvia world.  Lets just say that wanting to look for/at this deity did not cross my mind.  It was probably as far down on the list of things I wanted to look at as Saurons eye was for Frodo.  In addition, I felt that the only way for a person to enter this hidden place was to take Salvia.  I remember thinking something along the lines of: Oh, wow, I wonder how many people have discovered this secret, and simply did not understand it.  </p><p>I guess what I mean by that is that I got the feeling that everyone who has done Salvia has been to this place, yet perceived it differently.  In other words, since everyone sees things differently, I assumed that anyone who had been to this place misperceived it, and that I finally knew the truth.  It is also important to note that, by this point, I must have known that I had done Salvia.  It is extremely common for users of Salvia to totally forget that they have consumed any substance.  I am certain that I did not think (or possibly didnt even know) about having taken Salvia until that point in my trip.</p><p>At long last, I had a sudden awakening in which I realized that I had taken Salvia, that my door was open, and that I had been yelling at my walls and out into the hallway.  Luckily, as it turns out, my next-door neighbor was blasting his headphones and hadnt heard a thing.  At this point, I wasnt even reflecting on my experience, rather, I was hoping my neighbor would not think I was psychotic.  After recognizing that he was unaware, I began to pick up the pieces of my trip.  I was still feeling Salvias effects quite nicely, but my mind had finally overcome the delusional power of the drug.  I wondered 1) when I had gotten up out of my chair, 2) why I had forgotten that I had done Salvia, and 3) why the fuck was the door open?  When did I do that?</p><p>But before I get to the reflection segment of this, Ill describe how I enjoyed the lingering effects of the hallucinogen.  I again sat down on the chair, and this time closed my eyes.  I began to feel like the chair was slipping out from under me.  It wasnt a very overwhelming feeling, and actually, just thinking harder about it just made the sensation disappear.  Opening my eyes, I glanced at my bed, only to notice that my comforter appeared to be wavering slightly.  Basically, it was just a visual distortion, which was more amusing that fascinating.  Following this, I began to write down what I could remember.</p><p>I have no memory of what occurred immediately following exhalation, but since I later realized that I had done Salvia, I guess that means I had to forget that at some point.  Therefore, I assume I must have had a short memory blackout, during which my short-term memory was obscured.</p><p>I also found it interesting that the door was open.  I guess I must have been planning to walk out of it and leave things behind when I suddenly snapped back to reality.  It may have been that seeing the bathroom mirror, or simply opening the door, awakened me.  Or, perhaps the effects of Salvia were just rapidly diminishing.  Up until that point however, I was totally unaware that I had been yelling at walls and out into the hall.</p>"
}
