{
 "title": "Beautiful, But Difiicult",
 "author": "Explorer_Child",
 "citation": "   Explorer_Child. \"Beautiful, But Difiicult: experience with Salvia divinorum (10x extract) (ID 63547)\". Erowid.org. Jul 22, 2008. erowid.org/exp/63547",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 63547",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 22, 2008",
   "Views: 2700",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Set & Setting</p><p>I am quite focused on unearthing the roots of emotional baggage in my subconscious memory. Hoping to 'break through' and have a big revelation about memories I'm not even aware of. This is basically the reason I am taking Salvia, with a little basic human curiosity mixed in. I'm in my room, soft, relaxing music playing. Lights are off except for the computer screen with my media player running. I take a few deep breaths and relax before I feel ready to depart. I get a little nervous but ignore it and put the lighter my bowl. Here goes.</p><p>My trip</p><p>First movement is that whatever the contour of the object in front of me is, becomes the contour of the other realitys characters, who always have a sesame-street muppet type look to him. The character is multiplied by four or more and the image rotates like a snowflake with the four character images linked by hand or foot. They almost always are a primary or secondary color and the almost always have this white painter suit on. Theyre really conscious entities too, though not at first. </p><p>I always come to them in a bright white grocery store aisle, which becomes the hall at my first church, the shelves morphing subtly into the walls on either side of that hall. It was downstairs with the nursery on the right and the bathroom and preschool rooms on the left as you exit under the outside stairs. I sweat at this point. Theres an almost unexplainable feeling in my jaw/mouth area. Its like some strange form of pressure against the front of my teeth, through my lips. The pressure has a kind of texture to it, like waxy crayons the same color as the character thats in my field of vision. I smell the pressure too, even as I see the characters spin in front of me. A very subtle synesthesia, but definitely noticeable. </p><p>I feel like this place somewhere Ive been, where I am family. The characters are welcoming me back, and taking it for granted that I am staying to play. But when I realize that my reality misses me, I return to it while at the same time convincing my other friends in a different reality that Im really just going back home. They dont get it, and encourage me to try to take them with me and integrate them into my reality. I really want to introduce my new/old friends to people Im close to, and to explain the other world to them. The more I try to do this, the more real the other world becomes, and the less I am able to put it into words. This is a very strange feeling. </p><p>Everything my strange new world takes on the style with the simple colors and the paint suits, and it seems very important that I stay with the other-world entities. They are quite stern about it now. They are a family, a father and mother at least. The mother is not quite so upset about me not hanging out with them as the father. For some reason they are more like the human characters on sesame street now than the muppets. They are all young and pretty like theyre in a supermarket ad for what ever the object is that they represent, not sure what that really means. They dont really stem from visual aspects of my surroundings now, completely disconnected from the reality I live in. </p><p>Its so important that I stay now. I cant! I have to go back to my world and their world isnt that great anyway, all white and colored like cookie monster and big bird their white painter suits. Every time my mind wanders, my whole perspective rotates so that the floor of the new world rotates back down to meet me and I kind of pop up from the floor as if someone were turning the page in a pop-up book. </p><p>When I close my eyes, the light from the computer screen(The one in my reality that Im writing this on) forms a shapeless entity which becomes a three-dimensional shadow of one of the characters ironing something. Sounds are pretty much unaltered. These characters are so familiar though. Like a subconscious mixture in my head of big bird, cookie monster, and that painter guy from sesame street in some kind of white and primary colored world, with very clean lines and borders, like cutout stickers. Theyre so annoying, nothing of substance to offer me, just playful carelessness. </p><p>When I let their images drift away, I see that hallway at my church again. And especially the bathroom, I remember inside, the hot water heater, the smell, the crappy light and the bathroom was so unfinished. Not considering a lot of other stuff that may have gone on in that room, I remember one particular event. </p><p>When I was very young, I shit my pants really bad in there. I yelled for dad as it ran down my leg. He came and was sort of shocked how bad it was. He tried his best to be all normal about it and helped me over to the toilet. Embarrassment washed over me like a warm tsunami. I think my underwear were sesame street. I think the earlier characters originated from the fabric of my sesame street underwear. I was looking at them as I sat on the toilet and waited for dad to come back in with mom who was very loving but they were both sort of weirded out and patronizing towards me. They kind of whispered about me I thought. Light was coming in from the open door under the staircase. Someone else had walked in and left, they were embarrassed to see me like this. Or maybe my mom came in that door or something. Embarrassment was so hard on me that I sort of blocked it out and became numb there to deal with the situation. It was time to go eat lunch and I had myself all messy and smelly. I dont remember much after that but I know this is significant.</p><p>This revelation of memory was exactly what I was looking for in Salvia, but the trippy, weird characters and environment I had to push through were confusing and quite annoying. I did not find the experience to be mystical or spiritual at all. I keep thinking that maybe my dose wasnt high enough to be catapulted through that first menagerie visual stuff, and get down to the really deep, inner stuff. But it was 10x standardized extract I took, and I know I got three good hits of it, maybe four. I was very intriguing, but a little disappointing in that it took a lot of effort to travel thru the psychological jungle of images to get to what I was looking for. Maybe Ill try it again, maybe not.</p>"
}
