{
 "title": "Tons of Energy",
 "author": "Frank",
 "citation": "Citation:   Frank. \"Tons of Energy: experience with DOI (ID 63719)\". Erowid.org. Jun 14, 2007. erowid.org/exp/63719",
 "substance": "DOI",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DOI",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63719",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2007",
   "Views: 7740",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn the city I am living in, research chemicals such as DOB, DOI, 2c-e, 2c-b etc are fairly easy to get a hold of.  Of these, I have only used DOI and only once.  \r\nAnyhow, a friend and myself purchased a 30mg liquid bottle.  I am not 100% sure about the active dosage because the liquid is not completely DOI.  But we mixed a little less than half of the bottle into some juice each.  I will continue with a timetable.\r\n6:00pm We both drink it down.\r\n6:30  8:00 We make our way to a music store to look at speakers and keyboards.  We plug in an iPod and listen to some music in the store.  No effects are kicking in yet, the music sounds normal, we feel sober.\r\n8:00-9:00 We walk towards a café, expecting that we will start feeling it soon.  We just want to sit down and talk and see what will happen.  During the walk we both start to feel anxious and slightly shaky.\r\n9:00-10:00 We are in the café and talking.  Effects start to hit in a pretty strong wave.  We are having trouble looking at the menu and deciding, our conversation is like weed conversation, and we are laughing a lot.  I basically feel like I just smoked a bowl.\r\n10:00 At this point the only visual effect is that things are skewing.  What I mean is that when we walk straight down the street, corners and objects appear to jump and angle in different directs.  There are no colors and no textural blending.\r\nNow it is probably 11:00 pm, we lose track of time, and keep getting hit in waves.  We are laughing a lot, being very cynical of what we observe.  More than anything we are shaky and cannot sit still.  \r\nWe decide to eat so we go get a big plate of French fries at another café.  In the span of 30 minutes, we probably eat 5 french fries each.  The taste sensation is insanely intense and we basically cant stop laughing or fidgeting.  Outside the window, the night sky looks bright, and then inside of the room seems to be broken up into different colors.  One side of the room is intensely purple, another green etc.\r\nWe take the train at about midnight out to another part of the city.  The train ride is about 6 minutes but the feeling of being surrounded by people is uncomfortable and we just want to get off.  Once of, we walk towards hidden little bar/café and get some alcohol.  We just keep talking enthusiastically about an assortment of topics.  There are no hallucinations, but sometimes textures blend.  Wallpaper with patterns looks like its moving and our minds are pretty slow.  The best way to describe it is that our minds are slow, but bodies very fast and fidgety.  \r\nAt about 1:00 am we head to a new area, in an effort to change our scenery and hopefully our high.  The streets are dead (because it is Sunday night).  The few drunk college kids look really sloppy to us.  We are very content to just sit and talk and observe what is going on around us.  Our observations seem very clear, but our perception of it is more detailed than normal.  \r\nAll in all, we are still cracked out.  Walking feels good now, and each time we look at something different a new wave hits us.  \r\nAt about 2:00 am we start walking home.  I wanted to take a taxi but walking sounded more fun.  It was about a 2 hour walk but we don't feel tired or sleepy at all.  At about 4:00am the sun starts to come up and the sky is impossibly blue.  The city looks beautiful and we are still laughing and focused on our conversation topics.\r\nWe try to pass out at my apartment, but this is impossible.  My friend leaves at about 8:00 am and I cannot go to sleep until about 12:00pm.  Even in sleep I still feel very awake and my mind is running fast now.\r\nTo conclude DOI is a very cracky drug.  A higher dosage my increase the visuals, but in general it is an energetic drug, not a visual one.  We experienced no nausea except for some caused by hunger.  I had fun because our conversation was very focused and funny, and we both made weird new observations that became funny convo topics.  \r\nI don't think I will use DOI again anytime soon because more visuals and less energy would be preferable (personally).  It was about a 10 hour trip with the after effect lasting for a while after that.  With a few hours sleep I felt totally recovered (but really hungry!)\n\n\n"
}