{
 "title": "Hawaiian Madness",
 "author": "Danamiks",
 "citation": "Citation:   Danamiks. \"Hawaiian Madness: experience with Mushrooms - C. Cyanescens (ID 63723)\". Erowid.org. Oct 16, 2011. erowid.org/exp/63723",
 "substance": "Mushrooms - C. Cyanescens",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1.2 g",
   "oral",
   "Mushrooms - P. cyanescens",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63723",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 16, 2011",
   "Views: 2615",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI acquired 250 grams of dried Copelandia Cyanescens/Hawaiians and sweet mother Mary Jesus and Joseph - they were strong. The following is a report of the 3 or so hours I spent in some kind of super dimension and the rippling after affect on my mind.\r\nKieran and the rest of the goons were going out. Whilst they were chalking up lines and scuttling around the blue room, spraying aftershave and listening to Eksman full blast on my monitors, Neil and myself were downstairs waiting for the mayhem to end before we cracked on and caught a mushroom ride to the beyond. Eventually the door slammed and we heard that familiar drunk and drugged banter slowly marching away down the street until the house was completely silent.\r\nOut came the shrooms.\r\nThey were laid out on two little plates in my front room. One for me and one for Neil. Neil was on his second plate as the first one smashed and sent the shrooms flying over the carpet. Maybe we should have took this as an omen? A sign of the potentially mind shattering night that lay ahead... but we didnt. Instead we quickly munched them and flushed them down with a pint of water. Neil even licked the plate. Good god - how were we supposed to know. \r\nIve experimented with shrooms a few times and also mescaline but this was Neils first trip. He seemed to place some kind of irrational comfort in me being there, as if I knew what I was doing and would help him out if things got difficult. This couldnt have been father from the truth. As what I realised is that Id never really tripped before. I had experienced different states of mind before but nothing like the place we were about to go.\r\nAfter only about 15 mins I felt the effects kick in. The room got lighter. I was sitting on the floor with my back to the sofa and noticed that Neils side of the room was yellow due to a yellow lampshade that he was sitting next to and my side of the room was red due to a red lampshade near me. The table in front of me started morphing and became elongated. The speed of which these effects came on startled me slightly. I remember we went into my garden and I was feeling pretty much as shroomed as I had ever been before but knew things were gunna get a lot wilder. I had the distinct feeling of being on a roller coaster that was making its way up the hill and could sense that it still was only a few measly feet from the ground with a long way to go. We went inside. Neil wasnt feeling the effects yet. I remember him saying these mushrooms are really mellow and I nodded my head in agreement as it seemed the path of least resistance and least concentration needed. All my concentration was now focused on the man in my head telling me Dan your fucked mate. \r\nI noticed something on my right. What was it? I couldnt work it out. I turned my head to see and realised it was my jumper. I found this extremely funny and whaled with laughter. This sent tears of joy running down my face. Why? I dont know. It was only a fucking jumper! My laugh turned into a hysterical scream! A scream of a mad man.  \r\nThis is where I stepped into the super dimension. I cant find anyway of saying this to justify what I saw but It was as though our 3 dimensions became insignificant. The room seemed to unfold in dimensions I cant describe. It was the equivalent to me peeling General Johnson off of the front of his album cover that Im looking at now and seating him next to me in our 3d world. He could still see the place he came from but it now looks like a flat, lifeless piece of nothingness compared to our world. He cant even perceive how he used to fit in there. Hes fucked up man. In my case I was peeled from the fabric of our 3d world and flung into this other place. What was in there? I dont know. Weird moving colours. The colours were amazing. It was like the effect of shitty CGI in a film. Everything looks clean and clearly alien to the rest of the picture. \r\nI managed to focus on the living room and I was back, albeit to a seriously mangled and fucked up living room. Neil was there, staring at a calypso wrapper like he had just met god. His eyes were massive!! Then I was gone again - then I was back - then I was gone. At this point I started freaking out. \r\nOut from behind the TV I perceived some kind of humanoid shape with long arms. He was made of energy? shiny Smokey stuff? I dont know! But he popped out and his arms stretched out towards me and made some kind of triangle shape. Amazingly for some reason this seemed to calm me down and I decided to lay down on the sofa and close my eyes. That was a bad idea. It was just complete mayhem on the back of my eyelids. I quickly opened them and made a move for the  kitchen to tryn flush my body with orange juice/vitamin C.\r\nA I made my way there all of a sudden I was standing holding the orange juice? As I went to get a glass out of the cupboard all of a sudden I was pouring the orange juice on my foot and a glass was rolling across the floor? As I went to pick the glass up all of a sudden I ended up in the front room holding the orange juice but my foot was completely dry? \r\nI tried again!\r\nI went out of the kitchen and poured the orange juice all over my face? Why? I was drenched and went in to show Neil what I had done but when I told him he informed me that I wasnt wet and the orange juice wasnt even open. thats right. I was seriously fucked up. As I played this back in my mind I became convinced that I must be hopping between alternative dimensions. The fact that Neils face kept turning into my dead granddads wasnt helping me to rationalise the situation. \r\nThen, back in the living room the phone rang!!!! Neil passed it to me but I didnt see his arm. It was as though the phone appeared in front of me. I answered it and to my shock it was my Dad. Whilst trying my best to understand what he was saying I became very uneasy about the fact I could hear my dads voice in my head had I gone schizophrenic? Why was I holding the phone to my ear? of course I thought with momentary relief, Im speaking to my dad on the phone. I was so relieved. But the relief wasnt to last. He informed me that his girlfriend was on some kind of hell bent revenge rampage to my house! NO! dont let her in what ever you do, shes dangerous he said!\r\nNow, this may seem like a scarily bizarre and disastrous scenario to be in but it gets even worse. A few weeks ago me and a couple other friends did some shrooms in my living room and at the peek of that trip the phone rings and my dad tells me the exact same thing!!!! How weird is that? This lead me to believe that I really was dimension hopping and somehow I was existing outside of linear time. Again, fear set in. I needed to get outside, away from the house, away from the lunatic woman on her way round to the house and away from my MIND!!!\r\nThe woods I said,\r\nYES, the woods said Neil. Suddenly it was like we were going on the best holiday of all time. A holiday - to the woods!\r\nWe put our coats on and made it out the door. I bought the orange juice with me and still continued to believe that I was poring it over my face. Neil had to keep reminding me I wasnt. We stumbled down my road laughing hysterically and occasionally trying to stay calm as people walked by. God only knows what they thought. We had beanies and sunglasses on (one pair) and couldnt walk straight. Neil was talking some crazy shit? What was he saying? I have no idea. I dont think he did either but we both knew it was hugely profound and if only it made sense and had a point it could have been brilliant. \r\nThis is the time I started to move beyond my mind. My mind could no longer think for its self. I had to say all my thoughts out loud. I was just saying words with no intention of making a sentence. Neil was still talking. What was he saying? I was talking? what was I saying? We were both rambling at the same time. People were crossing the road in fear they would be infected by our strange madness. I dont blame them. \r\nFinally, we made it to the woods. But these were no ordinary woods. It was a fantasy land full of ore mystery. Quickly we got completely lost. I was so glad I wasnt on my own. But then. I was! Neil was there but I thought I was him? I thought I was everyone and that the whole universe is just one thing. Were all one thing living in the illusion of separation so we can experience our self. This was when the trip went bad! I felt a loneliness unparallel to anything Ive ever felt. \r\nBack at the house and after walking around the woods this mind state continued but got a lot worse. I became separate from my mind. Thinking back I suppose this is the ego loss people talk about but at the time I thought I had gone mad. My mind was thinking its own thoughts and I was watching it think them? This continued for a while. Neil was on the phone talking to some people he called and was saying that he was fucked but I thought he said I was fucked? This lead me to believe that he had come round to watch a DVD or something, only to find me completely nuts and he was ringing for help or something!! I forgot I had eaten the shrooms and panic set in. It was like my memory was only 3 seconds long and I kept forgetting who I was, what I was doing and what I was about to do. \r\nEventually I started calming down and I wanted to go and meet my brother at a drum n bass club where he was MCing in Croydon. Thank god we didnt. He came home covered in blood that night with tales of a fight that had broken out and some nut case with a gun. Eventually we started coming down and watched some TV in silence. After about 15 mins we looked at each other and tried to work out what had just happened.\r\nIt was a few weeks later when all my memories started coming back. It was like my mind was to scared to think of some parts of the trip. I think Ive been as far over the hallucinogenic rainbow as Im willing to go now and Im giving it a rest. Indefinitely!\n\n\n"
}