{
 "title": "Shooting It Is the Devil",
 "author": "LLamarama",
 "citation": "   LLamarama. \"Shooting It Is the Devil: experience with Methamphetamine (ID 63759)\". Erowid.org. Jun 15, 2007. erowid.org/exp/63759",
 "substance": "Methamphetamine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "5.0 mg",
   "IV",
   "Methamphetamine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 63759",
   "Female",
   " ",
   "Not Given",
   "Jun 15, 2007",
   "Views: 32231",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>-The Day</p><p>It was a Wednesday night and I had just gotten off work. I was walking down the street when I'd met some kids from the neighborhood. Theyd asked me if I needed a drink and I absolutely did. We all hung out and drank and talked and shit was going well. Then we decided to try and score some meth. It'd been a year since Ive done it and I was feeling so fatigued and had a day off so it was all 'whatever'</p><p>-The Beginning</p><p>We met some guy off the street who seemed perfectly normal. He said he could hook us up. They needed to drive home because one friend was vomiting and needed to rest. I was left with this stranger, completely inviting and cool nonetheless, to score some dope.</p><p>He got me a baggy and I did a line. I was already hammered off of vodka. We went to his house and smoked some bowls of speed too. He told me I should be sober by now. I was still really drunk.</p><p>-The Plan</p><p>We started talking about shooting up. For some reason, after being against shooting up for so long, I thought it could be cool. Then again, I was drunk as hell.</p><p>-The Syringe</p><p>He was cleaning a syringe off with bleach and I said, 'hell no, you're getting me a new one' so he got me a new packaged one and found my vein.</p><p>-The Shot</p><p>I told him to only inject half of what he had in the syringe, I'm so sensitive to speed and I already had so much in my system. he tried injecting the full thing and I pushed the needle away as I lost the ability to breathe and stumbled on to the bed. I couldn't breath for what seemed like hours but was probably a few seconds. I felt more than I'd ever felt in my life. Euphoria like none other. Then I felt like I'd pissed my pants. I ran to the bathroom and peed what felt like a gallon of clearness, alcohol maybe? I looked in the mirror and my eyes were huge. I looked like an insane tweaker pokemon. My eyes were opened so wide that I could see the whole iris (or mostly pupil) and the white all around it. </p><p>-Sexual</p><p>When I got back from peeing the Mississippi river, he was there, unclothed. I told him I wasn't going to sleep with him and honestly, I was in no mood to make out. He tried convincing me but I needed to just lie down and relax. Being in someone's house shooting up speed was freaking me out. I'd definitely reached my peak and kept mumbling 'this is too much of a feeling too much of a feeling... can't take it this is more than I've felt in my whole life'. I had to lie down and keep moving so I was rolling around with this euphoric rush everywhere.</p><p>-The Decline</p><p>Here come the cold sweats. The air conditioner was on 66 degrees and I was sweating my ass off. I was clenching my jaw and biting my nails to the bone. My eyes were still too scary to look at people with. I was too uncomfortable to be active, and too inactive to be comfortable. I started with illusions.</p><p>-The Illusions:</p><p>Spiders everywhere, regular objects turning into cameras, random objects getting wavy, bottled waters breathing, People in the windows, shadows moving. Horrible short nightmares of the cops and people with guns coming in and shooting at me. I was no longer euphoric. now I just felt like a paranoid tweaker and I looked like one too. I was also in the constant paranoia of pissing my pants so I would make runs to the bathroom every minute.</p><p>-The Aftermath</p><p>That was all Wednesday night. It's Friday night now and thank god for sleeping pills and benzodiazepines  otherwise I'd probably have had a heart attack. My pupils are still a bit large but what bothers me the most is the slight paranoia that I still feel in the comfort of my own house. I hope that if I take a sleeping pill now, everything will be ok in the morning.</p>"
}
