{
 "title": "The Most Chill I've Ever Been",
 "author": "Doobie",
 "citation": "   Doobie. \"The Most Chill I've Ever Been: experience with Tramadol (Ultram) (ID 63831)\". Erowid.org. Jun 28, 2007. erowid.org/exp/63831",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   "  T+ 3:05",
   "50 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 63831",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2007",
   "Views: 32736",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First of all I have been experimenting with many substances this summer and when one of my friends told me about painkillers it sounded interesting to I wanted to try it. I had some hydrocodone and instantly fell in love with the immense Chill feeling that painkillers gave me. One day I had some friends over and my parents werent home. </p><p>We really wanted some painkillers but non of us had any so I was looking thru my medicine cabinet to find something I could get a buzz off of because both of my parents have had major surgeries in the past, researching every name I found on a prescription bottle online. I got nothing so far after lookin thru for about 20 minutes until I came across one of those sample packs labeled Ultram. I searched it online and planned on taking it. My friends didnt want to take it so I was the guinea pig. I took them and I fell in love with it. Since then Ive been trying so hard to get more. </p><p>Finally I hit my personal gold mine-180 Tramadol tablets all to myself. I decided to take a few the day I got them.</p><p>T+0:00  I am at my friends house just chillin and I decide to ingest 4 50mg tablets of Tramadol with a little food to pad my stomach.</p><p>T+0:15  I go outside with my friend to have a cigarette with my friend. He had some Tramadol 2 hours earlier and is already chill as fuck. We enjoy our cigs and talk about life and stuff like we usually do only he was so mellow.</p><p>T+0:30  I have to leave my friends house to go home, I still have not felt any significant effect.</p><p>T+1:00  I begin to feel a moderate Hydrocodone feeling. Im very excited because I have done this before and I know whats coming is awesome. Nothing is bothering me except for very slight nausea, but it may just be there because Im thinking about it or Im moving too much.</p><p>T+1:30  The feeling is slowly getting stronger and I just got hit with the itches.</p><p>T+2:40  The feeling is very strong now. I am not nauseous at all and I feel so happy. Im walking around the house looking for something to do and just smiling and the setting of my house just seems so perfect. I am not hungry. I feel like taking a shower because Ive herd it feels good when one is on Tramadol.</p><p>T+3:05  The shower was utterly amazing! As soon as I stepped in I was flushed with an immense Euphoria as the water runs down my body and thru my hair. I am so incredibly happy and decide to take another 50mg tablet of Tramadol.</p><p>T+4:05  I decide to get on the computer after watching T.V. for what seemed like wonderful hours and hours but was only one hour. I started talking to people on AIM and Listening to some Music and it is so much fun, I feel like talking so much and Im getting into the music. I love these people that Im talking to and I let them know that, I feel like loving everyone and letting them know that. Im so happy and I cant keep a smile off my face Im enjoying myself so much.</p><p>T+5:15  This is the strongest Ive felt! I am so indescribably happy!! At this point I am more chill than I have ever been in my life. I literally can not stop smiling as I continue talking to people and listening to music. Everything is so enjoyable I never want to stop feeling this way. Listening to the music is so euphoric and Im getting so into it because it feels so good I feel like the music is a part of me.</p><p>T+5:40  I have started to feel kind of tired, I decide to get off the computer and watch more tv. Its a relief and it feels so good to lay down on my couch and just relax as I sink into the soft cushions and enjoy some late night television.</p><p>T+7:00  It is now midnight and I stop watching tv because I feel completely exhausted, yet I still feel incredibly happy and wonderful. I feel like I will sleep well tonight. I am out almost as soon as I hit the pillow.</p><p>The Day After  I still feel pretty good, Im tired but I still feel energetic. I think Im just tired because my fucking dog woke me up at 6:30 barking at squirrels (damn dog). I feel sort of a pressure headache, but its not enough to even bother me I can just forget about it. I also notice I am a little bit irritable but since I was expecting to be I can control my anger and just relax. I am still not as irritable as I would be off hydrocodone. Other than that I dont really feel any kind of hangover but I still feel like just relaxing. I LOVE THIS DRUG!</p>"
}
