{
 "title": "The Day I Was Possessed By Gum",
 "author": "Bob",
 "citation": "   Bob. \"The Day I Was Possessed By Gum: experience with Cannabis (ID 6384)\". Erowid.org. Feb 21, 2002. erowid.org/exp/6384",
 "substance": "Cannabis",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6384",
   "Male",
   " ",
   "Not Given",
   "Feb 21, 2002",
   "Views: 6247",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt was a boring Thursday night, and me and a friend were looking for something to do. Having scored some weed the day before, we came up with the bright idea of punching some cones at another friend's house. Little did we just how potent this weed would turn out to be.</p><p>We arrived and got straight down to work at about 11pm. For a setting, we chose the shed out the back, which was only about 3m by 4m long and 3m high. Perfect for some dutch oven action. Everyone was relaxed, we had all done weed many times before, so we were looking forward to a cruisy night. I packed up one cone of half tobacco half weed and punched it through ...</p><p>Nothing. Well, not much, anyway. I felt kind of dreamy but disappointed as the other packed their cones, i didn't think the weed was strong at all (but it smelled *very* good). The bong was passed back to me after a few minutes, so i packed a fresh cone, but before i could even find the lighter, BAM. It hit me. It was as if i had taken 3 cones all at once in one breath and knocked myself out. I couldn't believe that just one cone could be this good!</p><p>All my friends looked equally stoned, and we were laughing at everything, getting freaked out by strange noises and generally doing all the stuff you do on pot. I got the munchies REALLY bad, but the best i could do was some bubble gum, lime flavour. So i popped in the gum and proceeded to chew...</p><p>Then things got really weird. My head became disconnected from my body, and my mouth felt like it was somewhere across the room. I couldn't feel it at all, and i had to keep hold of it to reassure myself it was still there. As i chewed, it felt as if i wasnt chewing the chewing gum, but as if it was chewing me! That little lime flavoured gum was moving my mouth up and down, and i couldnt control it! I started laughing, and then i couldnt stop that either! But it wasnt like hysterical laughing, i just physically couldnt stop the motion of opening and closing my mouth, it had a mind of its own. It became so bad that i couldnt talk or anything, just chew. I couldnt even tell my friends what was going on, or get them to stop it! I felt totally out-of-control and panick set in. In the end i had to put my fingers into my mouth and take out the gum but my jaw just kept on biting into my fingers. It hurt, but i got the gum out, took a deep breath and was alright. </p><p>I warned my friends about how stoned i was, and how out-of-control i felt, and kept reassuring them that we were all fine. This worked well, and it turned out that one of my friends had a similar experience that his jaw was connected to rubber bands that were controlling its movement. The trip went on regardless, and thanx to some cafe del mar, the worst it got was the usual flying/sinking that i would associate with being normally stoned. </p><p>We all passed out into our own private trips one by one, and i woke at abotu 2am feeling better and ready for some true sleep. The next morning we all agreed that that was the heaviest pot we've ever done, and ever likely to do.</p><p>Some things i learned: </p><p>- i felt nothing for at least 5 mins after the first cone, thank god i didnt take a second or i dont know whgat that gum would have done to me.</p><p>- to take a deep breath and keep in control </p><p>- *not all weed is the same* - be prepared for anything with new pot, no matter how experienced</p>"
}
