{
 "title": "Relief",
 "author": "C. Segura",
 "citation": "Citation:   C. Segura. \"Relief: experience with Pseudoephedrine (ID 6387)\". Erowid.org. Feb 21, 2002. erowid.org/exp/6387",
 "substance": "Pseudoephedrine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "oral",
   "Pseudoephedrine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6387",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2002",
   "Views: 52821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt is almost a habit of mine to experiment with different levels of this particular substance to see what it will do to me. I was heavily interested in seeing extremes a couple of years back, but recently with more research and experience I have been exploring relatively lower doses and analyzing their effects on my existence.\r\nUsually the setting will be somewhere public, such as in class or at work. I have the attitude that no one really knows for sure what is going on inside you unless you tell. \r\nIf I do this habitually, I will deplete whatever chemical it reacts with in my brain and the pleasant effects go away, and are replaced with irritability and dry mouth, if anything at all. \r\nThe last time I explored what this would do was last night, in April. At 9:30 I only took two maximum-strength pills (60 mg pseudoephedrine each) - through experimentation I have found that this is the dose that heightens the positive effects and minimizes the negative effects. At higher doses, I have seen an increase of nausea (240 to 420 mg) that overruns any 'body high' feeling I may get. 180 mg would sometimes make me too listless to function. However, remember that everyone's body chemistry is different and what works for me may not work for you.\r\nWithin thirty minutes, I was beginning to feel dissociated. I took a very lax attitude toward my work and would try to accomplish tasks with the least amount of effort possible. All I wanted to do was sit in my chair and stare at my computer screen. Words were slow to come. When I would be asked a question, I would have to think it over in my mind before producing an answer. Even then, I would pause and have to think...'what's the word I am looking for' many times. Co-workers were none the wiser, having known that I had not acquired much sleep the night before. \r\nBy the time I left work at midnight I had gotten quite a buzz. I  felt a pleasant sensation and driving home seemed effortless - probably too effortless. Please be careful when driving, as it seems like I was just playing a video game. I had to remind myself that cars are real and that I was not just floating home. I found that I could breathe more easily and sing higher and better than I had before. I am not sure whether that was just a shift in confidence or if the decongestant effects of the pseudoephedrine really caused the improvement. \r\nFinally, I got online and really wanted to chat, but by then I was peaking - it was about 1:00 by then. I could not really think straight and I wanted to lie in my bed. Lying there, I knew how wonderful it felt to be here, I could feel how my blankets were wrapped around me and I felt dissociated from almost everything, alone in time and space. It was a wonderful, relieved feeling unlike with anything else I have ever done. \r\nIt's the type of thing that makes me want that feeling, all the time, and it is difficult to accept that I cannot do this every day or it will not be the same. When it's gone, it's gone.\n\n\n"
}