{
 "title": "An Alternative Life",
 "author": "Jjinsanejj",
 "citation": "   Jjinsanejj. \"An Alternative Life: experience with Salvia divinorum (leaves) (ID 63900)\". Erowid.org. Feb 7, 2008. erowid.org/exp/63900",
 "substance": "Salvia divinorum (leaves)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2007",
   "63900",
   "Male",
   " ",
   "Not Given",
   "Feb 7, 2008",
   "4543",
   " "
  ]
 ],
 "report": "<p>Hi, I'm a 19 year old male who is choosing to write about my last salvia experience solely because I believe that it has been the most mind altering experience that I've had with the herb. Over the last few months I have become extremely experienced in the usage of salvia divinorum. I have used the herb at least two hundred times. Yes, that's a lot more times than most people probably think I should have used it, but I really consider this herb as something that accepts me with open arms every time. Sense I turned 17 to the age that I am now, I have tried mushrooms, acid, cocaine, ecstasy, dxm, salvia divinorum, wild dagga, etc. When I do drugs I'm usually either trying to learn/realize something or I'm just trying to get high. Haha. But really it depends on what I'm using. With salvia I feel like I'm trying to learn about the possibility of things beyond our own reality.</p><p>Now, on to the experience. About three days ago I was in my bed at about 9:45 PM. I decided to wait until 10:00 PM to take my dose of salvia. I loaded my LARGE pipe with salvia leaves. During this time I filled my head with calm thoughts and then I waited for my starting time. I knew that I would only need to take 3-4 hits of regular leaf to reach the level 4-5 range. This is because my tolerance to the herb has tremendously dropped over the hundreds of previous usages that I've had. At 10:00 PM I took 3 large tokes and saw that there was still a little more, so I finished it with one small toke. After taking the dosage I knew I was in for something that was going to be powerful.</p><p>I sat and waited for about 20 seconds. Then I was immediately in the experience, and when I say 'in the experience' I mean that I had completely gone in a level 5 experience. My reality was completely gone. I was in a new reality. I've had this happen many times before, but this is basically what happened again. In the reality that I was now a part of I was a newborn alien baby, I'm not exactly sure if I started out as a newborn, but during this experience I literally went through almost the whole life of this alien. This is a very hard thing for people to understand when they haven't had an experience like this, but I basically lived a whole other life in just 3-8 minutes, although I literally experienced this whole other life from the beginning to the end. It felt like it lasted around one or two hundred years. In this life there was no connection between the real me and the me that was an alien.</p><p>As this new alien life form, I lived in a world that consisted of green people that were made of skin that felt oily and slippery. We communicated in a way that was without words. It was like we were all psychic but we were allowed to choose what thoughts we wanted to send to one and another. A funny thing about this community was that we all interacted with each other to gain higher knowledge, to make a living, etc. but there was no sense of emotion in this world. We felt that it was important to be important, and to live, but the idea of humor, revenge, anger, etc. didn't exist. It sort of felt like everything was just business with one and another.</p><p>Now I've already explained a lot of how this world worked, but I really feel like I haven't even begun. This world was similar to ours, but in many ways completely different. Some things like family still existed in this world. I actually had an alien family in this world. It consisted of my mother and three other beings that lived with me. This was a family of five. Now after the experience I think back and it scares me. This family of five WAS, real or not, a family that was loved by me. The emotion of love comes somewhat weird in that reality, but in that reality it was understood that you stay with your family and they were like the other parts that made you complete. Sort of like how things are in real life. I had a name in that reality, in that world, in that extremely mind altered state, whatever you want to call it, but the point is that that reality was to me just as important as the real world. There were a lot of events in this reality that I found to be important moments of life and I really feel like writing about them, so I'm going to.</p><p>There was one moment in this reality that I remember being elected as one of the important aliens. I don't like to say important aliens, but I don't know how to exactly say what I was elected as, this is just basically what it meant sort of. I was an alien that was considered to have some importance. There were some aliens in this existence that were also considered to be worthless. I imagined that it would be hard being those aliens, but I wasn't that low on the chain. Although my importance was quite sad in this life, because I was supposed to accomplish great things and I was respected by most aliens, but the problem about this life was that I wasn't able to actually accomplish as much as the other aliens expected me to. For this I eventually ended up not having respect from the other aliens of this planet at all. Being thought of as special and important in this existence was good in the beginning, but after I basically failed at this life I was ridiculed by the others of this planet for being unsuccessful. Although in this life you're life was still worth living even without any respect at all, but the thing about being unsuccessful was bad to some degree. </p><p>Eventually after I had literally lived for about one or two hundred years time, which felt like the same pace of time as the real world. I suddenly realized that I had taken some sort of drug. This put me in a HUGE state of shock. My mind from the real world was suddenly being put in front of me like it was the truth and this alien life I was living was all just a short span of time in another reality. Then I had some really awkward moment of suddenly finding myself in my bed where I had originally taken the salvia. I sat there for about an hour in fear that I would suddenly realize something else again, like I had taken part in some sort of experiment or something that made this happen to me. This is to say that I STILL thought I WAS the alien life form. After about an hour though I was able to accept that I wasn't going to slip away from reality again, and I realized that I was under the influence of salvia when I had my alien life experience.</p><p>Days after the experience I still seem to feel like this reality seems somewhat fake though. I like being here though, and I'm glad to be alive, but nothing seems real. After the experience I've noticed that eating seems like a brand new thing, and that I can't stop looking at different things everywhere I go. In the alien reality that I was in everything generally was green, grey, and black. I think there were other colors too, but they were rarely seen. Although there is an extreme fakeness and 'newness' to how I perceive reality now, for some reason being here seems amazing. I was satisfied with life before this trip, but now I feel like I was born again at the age of 19. Everything is new, but I still know the knowledge of my past 19 years. I feel ecstatic about being alive now.</p>"
}
