{
 "title": "It Has Leapt to the Streets",
 "author": "Redeemer",
 "citation": "   Redeemer. \"It Has Leapt to the Streets: experience with Bromo-Dragonfly (ID 63921)\". Erowid.org. Jun 24, 2007. erowid.org/exp/63921",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "Bromo-Dragonfly",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2007",
   "63921",
   "Male",
   " ",
   "Not Given",
   "Jun 24, 2007",
   "8310",
   " "
  ]
 ],
 "report": "<p>Strange blotters appeared on the streets and my very experienced friend got his hands on these, he immediately announced that this surely wasnt LSD, and he had heard that it actually is bromo-dragon fly.</p><p>Rumors told that they would sustain up to 900 micrograms in one blotter but thats just a rumor.</p><p>My friend  wanted me (as much as I wanted too) to test these with him and study what these blotters were made of. He had few weeks earlier tried, unfortunately with a MAOI, and things were going too disorientated I was  in phone with him for several hours and he actually just repeated that how fucked up he was..</p><p>Our setting was great everything was fine night was warm and our little experiment started we had like arsenal of chemicals if we need to 'cool down' actually came handy but after the experience.</p><p>I took 2 blotters and was kind of worried of the outcome. Onset took very very very long time, I didnt watch the clock but I assume  that it took apx 3 hours. Feeling was something I couldnt expect, It certainly wasnt tryptamine like at all, more like phenetylamine with stimulant like effects but it like crawled on the background and I was fully capable of taking part in highly intelligent conversation, visuals were nothing like 2c-b nor LSD, (funny thing is that I have had similar visuals after staying up for 48h with amphetamine)</p><p>At least this amount of substance didnt take the best of me but the long lasting effects took... time passed fine, I had very interesting conversations with my friend and was a part of an amateur study, but after like 18 hours I certainly knew that it emptied my neurotransmitter storages, I didnt get depressed nor anything like that I just were mentally tired. effects were fully ended apx 22h after ingestion. Very interesting experience because it lasted so long without any wave-like up and downs. Very stabile effect.</p><p>Other thing is MAOI, combined with bromo-dfly is risky business, effects changes dramatically even at very low dosages, I consider it very dangerous. Third thing which worries me is OD´s I had two blotters and wouldnt even want the third. Cant imagine what could happen if someone old-school acidhead thinks to have hardcore trip with LSD and takes several blotters, and later finds out that it was bromo-dragonfly, ending up to very very long and horrible experience.</p><p>Interesting thing is that it actually felt very normal even tough I wouldnt be able nor wouldnt want to operate heavy machinery it felt like it passed all the defense barriers of human body and hit  straight to the bulls eye... commando attack to my brain, like my body didnt try to do counteract because of the substance.</p><p>In my opinion the feeling was like: stay up for 24h then take a little amount of amphetamine and normal amount of 2c-i, doesnt sound like dragons flying over my head but after 18 hours I dont mind. With greater amounts (or with MAOI but I dont consider that as an option) I have heard of experienced users that visuals were something they havent ever seen. Would like to have this in powder form and with laboratory scale have few experiments with certain dosages, didnt like the idea of research chemical in a blotter.</p>"
}
