{
 "title": "In the House of the Horse Lover",
 "author": "Nihil",
 "citation": "   Nihil. \"In the House of the Horse Lover: experience with Salvia divinorum & Cannabis (ID 63924)\". Erowid.org. Aug 24, 2007. erowid.org/exp/63924",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 63924",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 24, 2007",
   "Views: 5233",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe world is charged with the grandeur of God.<br>It will flame out, like shining from shook foil,<br>It gathers to a greatness, like the ooze of oil<br>Crushed. Why do men now not reck his rod?<br>Generations have trod, have trod, have trod,<br>And all is seared with trade, bleared, smeared with toil,<br>And wears mans smudge and shares mans smell: the soil<br>Is bare now, nor can foot feel, being shod.<br>And for all this, nature is never spent,<br>There lives the dearest freshness deep down things,<br>And though the last lights off the black West went<br>Oh, morning, at the brown brink eastward, springs-<br>Because the Holy Ghost over the bent<br>World broods with warm breast and with ah! bright wings.<br>-Gerard Manley Hopkins (1844-1889), Gods Grandeur<br>Introduction<br>Allow me to introduce myself, for no other reason than that the visions and teachings brought by the sacred plants may only be understood in relation to the one who receives them. For according as I am, so the gods or demons shall address me. I am twenty-four years old, a catechumen in the Orthodox Church. Recently my religious life has been crumbling to pieces like old, rotten wood, and so I have been seeking to be taught by the sacred plants, since the teachings of men, so varied and contradictory, avail me not. It is indeed the case that on this occasion, the Shepherdess put the fear of God in me anew, and I have gained a new respect for all things, and for the religion that I had grown lax in. How long this will last I know not. <br>I have had a schizophrenic break before, not too long ago, in fact, and while it might not be wise for me to be experimenting with entheogens, I do it nevertheless, desiring to find wisdom and insight to which the mind unaided is blind. I am also an artist, with an inclination towards the anime style, though I have found that I am a terrible painter, having no clue what to do with all the different colors that must go into a good oil painting.<br>Be that as it may, what I am offering you is an account of what actually happened that night, although I now question what is actual and what is not, and after this I will provide you with a poem which the Shepherdess inspired. I am by no means a poet, and I have heard that it usually takes many years to write a truly good poem. Nevertheless, I wrote this poem over the period of two days, yesterday and today. It is the 24th of June, so you know. Assuredly though, I feel that many years of my life and experience, however short that may be, went into the writing of this poem. You may judge for yourself. I would suggest that you read the poem first, and then my account of what actually happened, as the poem is enigmatic and interesting, while the real life that inspired it is, well... ordinary. You may, however, do as you like. The whole experience lasted a few hours, although I may be changed for life.<br>One of my friends, lets call him Jeremiah, invited me to smoke with one of his friends, lets call him Sanjoe, east of where I live. I agreed, desiring to try my Salvia Divinorum leaves in combination with Cannabis. We drove to another friends house, Dedalus, and waited for Sanjoe to arrive. While there we watched some of the Fifth Element, a favorite of mine, and the preview for the new John Rambo movie. Heaven help us, Stallone is old! After a while Sanjoe arrived driving a behemoth of a vehicle (this is the flying mountain in the poem), and we went to his brothers house. His brothers name I will not say, although if you read the poem, you might be able to guess what it is. He wasnt there, but had allowed us to use his house. Very kind. He is married to a woman, I think she is from Kenya, if I remember aright. She wasnt there either.<br>There was a drawing on the wall that looked like two shamans dancing. I am greatly interested in shamanism, and asked how much Sanjoes brother might want for the art, but Sanjoe told me it was not for sale. Once Sanjoe had found and cleaned his brothers bong, we smoked some good Cannabis and then some Salvia leaves. I took three hits of each, and then things became strange.<br>We were playing Guitar Hero, which I suck at, and I quickly noticed that the image on the screen looked like a colorful Maian ziggurat. In it there were patterns or images that flowed downward, along with the colorful circles or stars that one had to hit in time with the proper note on the guitar looking control, as soon as they met one or more of the five corresponding circles at the bottom of the temple. This reminded me of the myth of Maia, the colorful illusion that comes when the rain and the sun are in the sky together, called a rainbow. It also reminded me of the first time I smoked Salvia extract. For then I saw nothing but a blur moving to the right in stripes, similar to Sanjoes carpet. But I also felt the strong sense that I was looking at a video game.<br>Now I became convinced that the first time with Salvia had in fact shown me this time smoking Salvia, with the carpet and the game. Only I had not physically seen the game. Now, several years later, I felt a strong sense that I had seen this game before, only I had not. Thinking, for someone who has schizophrenic tendencies, brings great ideas, but it also brings insanity. Things I remembered in the past now became mixed together in the present, forming my life anew.<br>I looked at my watch, and it seemed that for an instant the second hand went backwards, though I quickly turned my attention back to the game. The ancient Greeks had two understandings of time: Chronos, which is ordinary, chronological time, and Kairos, which is God-time, or time fulness. I am now skeptical as to whether chronological time is not merely an illusion. It seems to me that Salvia reveals things in a disjointed fashion for this reason. It is not acting chronologically, but according to Kairos, in which things in the future may in fact shape the past. That is why my experience with Salvia this time was vaguely revealed to me the first time I smoked Salvia, several years ago. And that is why my memories mixed together in what might seem to a normal person an illogical fashion. Everything and every moment is bound inextricably together. I suffered as a child for sins I have committed as an adult.<br>Things became stranger. It occurred to me that Jeremiah and Sanjoe might be gods or angels of some sort. I even concurred that Jeremiah was God, or Azathoth, for I had seen this name on his Myspace account, and that he was the Metatron, the visible incarnation of the Godhead, or the Angel of the Lord. I thought they were going to kill me for my sins, and justly so. This did not bother me too much. I was resigned. I also thought the Maian temple in Guitar Hero was giving me signs. The game had programmed images of Peace signs into the flowing pattern in the ziggurat-shaped thing behind which the band was playing. Later there were skulls with strange signs on their foreheads, and a winding, endless spinal column. Then there was a Cross coupled with a scorpion, which I thought to signify that the Cross brings both life and painful death.<br>Think it cant get any weirder? Think again. I then saw or thought that the temple and the stuff inside it was directly related to my own life-force. The rhythm of the music corresponded to my heart, and if I did not concentrate on the meter of the game, I was going to die! I began to breathe deeply and tried to focus on the game. Although I was not playing, I thought that the success of the person playing depended in part on how well I payed attention to the flowing circles and stars. But it was too much in some places for me to keep up. Sanjoe was very good at the game, as was Jeremiah. Fortunately I didnt die, and I began to feel that I might be okay, because I was in good hands. The game in the television screen, I concluded, must be a heart moniter, and I must be in a hospital. I then asked Jeremiah if he was a doctor. He said he was, and this confirmed my suspicion, as well as the suspicion that he was Azathoth. Earlier, when I smoked and began a coughing fit, he said, Live!, as he always does whenever I have coughing fits. Again, this only confirmed my suspicion. The delusions of the schizophrenic mind are amusing and terrifying at the same time. I also thought that I was Sanjoes brother, I suppose because his name is the same as my middle name. Confusion was a common theme when I was having my schizophrenic break, and this was reminiscent of that.<br>Finally, we wrapped things up and went home. I wrote an outline of my experience when I was back, so that I wouldnt forget. But as it was about four in the morning, I went to bed. Some strange dreams came that night. In one, I died in a car crash on a road in my hometown. I was just driving along, and suddenly I went spinning out of control. But I was resigned. In another, I was at some old womans funeral, and I wept from time to time. I think it was the funeral of the wife of one of my teachers, who died recently. Then in another I was driving with a friend, lets call him Merrel. He was driving, and suddenly I saw tornadoes forming on the left side of the road. We jumped out of the car and went down on the other side of the road where we found some rocks and grabbed onto one. For some reason, at this point we were handcuffed together. As I awoke I remember thinking the rock must be Peter (I used to be Roman Catholic), but of course it could just as well have been Christ. That is all that I have a mind to tell.  And now for my poem.<br>In the House of the Horse Lover<br>By Nihil<br>Azathoth came, with single intent,<br>His eye upon my folly bent.<br>The Nameless One he shook his spear<br>And called aloud his name to hear:<br>Call me Jeremiah. he said, and beckoned me near.<br>There is his door, I pass the threshold,<br>Shamed but bold I cross the wold.<br>We sit and talk till day grows old.<br>I wonder where my childhood went,<br>And if I shall to hell be sent.<br>I shall carry you East, into the plains<br>Where towers come not, and the trains<br>Mournful wailing cant be heard.<br>So spake Jeremiah, and I wondered at his word<br>That came like the voice of a bird.<br>Through maze I come to twilight stair<br>And to nightmare, unaware,<br>See the terrible boon of care.<br>Soon will come the rains,<br>Making rivers of the lanes.<br>A mountain comes, and draws nearby.<br>I see it driving cross the sky.<br>Sanjoe is there, and takes us up<br>To roam the oases, to buy a cup,<br>A cup for showing up<br>To the hidden palace of the Kenya queen<br>And the Horse Lover who cannot be seen<br>Save by potent magic sacred green.<br>The Shamans Dance you cannot buy<br>But only offer them your eye.<br>What rite is this? We pass the pipe<br>Round, of every friendship bound the type <br>That makes our sight draw near to death<br>And smoke borne up on wings of breath,<br>The wind he sighs oer smoky Leth. (Leth': Lethe)<br>There Maias Mirror shows a rain<br>The like of which Ill see again<br>When once in dust my dust has lain.<br>O sacred pipe! O sacred pipe,<br>The fruit divine of star grows ripe.<br>I shout and stare as colors dance,<br>Enmeshed in patterns enter trance.<br>A temple formed of dewdrops bright,<br>Swirling rainbows in the night<br>Show Peace and Death, and healing Blight.<br>I perish! I say, and grow afraid.<br>The rotting putrescence has not been stayed:<br>In soil entombed my flesh decayed.<br>A heart is pounding in sacred dance,<br>Stamping soil in Necromance.<br>A flame goes up with every beat<br>To join the stamping of the feet,<br>But life inside me wanes away<br>To meet the waxing of the day,<br>And oer all Azathoth holds sway.<br>Time moves back and forward now,<br>To escape it he cannot allow<br>For tis the very Breath of Tao.<br>But let this Lord my loss entreat,<br>For life not lost is surely meet.<br>My breath is gone, my flesh is coal <br>My youth is withered, my bones pay toll.<br>In the house of the Horse Lover sits<br>One whom horses hate. He spits<br>Upon himself and curses his lack of wits.<br>Dead, dead, dead hell say<br>As Sin before him Azathoth lay,<br>For now the time is come to pay.<br>Memory Eternal, lay Thy stole<br>Over the empty, ghastly hole,<br>And chase the shadows from my soul,<br>The light to fill till more than full,<br>And every lie shall flee and hide<br>Beneath the rising of the tide,<br>So in collision shall they coincide.<br>A skeleton I have no nose<br>To smell the perfume of a rose,<br>Nor eyes or ears to follow the crows.<br>Was I born only to inhabit Sheol,<br>Or as sport for fancy of the troll?<br>Live! now comes his final command,<br>And though deceased I now do stand<br>Naked and ashamed, ever blamed, ever maimed,<br>But clothing is brought and I am named<br>Anew as newly I am claimed<br>Horse Lover, and brother of Sanjoe,<br>Wedded to the queen of No<br>In the zodiac of the Scorpio.<br>The Doctor gives me now his hand<br>To shape the mystery of the sand.<br>Good Sanjoe is his brothers heart,<br>Gives part to those who have no part.<br>With Maia does he play at times,<br>Gaia he does shape with rhymes<br>As Musics ladder he timely climbs.<br>A light is hidden in his eye,<br>And but for this I surely die,<br>Brothers bound by inseparable tie.<br>Now take me to the very start.<br>The end of all is endless art.<br>The angels with their fatal sword<br>Gave terror me with one accord.<br>But though they sent me far away,<br>They drew me nigh to hear them say,<br>My brother, as I turned to clay.<br>O living pattern in the weaving,<br>O Way of Music gently breathing,<br>Shepherdess oer me silent grieving,<br>Let down for me the Golden Cord<br>To cross again the Spirit Ford.\n\n\n"
}
