{
 "title": "The Storybook and Dryad",
 "author": "KarmicNoose",
 "citation": "   KarmicNoose. \"The Storybook and Dryad: experience with Salvia divinorum (15x extract) (ID 63967)\". Erowid.org. Sep 12, 2010. erowid.org/exp/63967",
 "substance": "Salvia divinorum (15x extract)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 63967",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 12, 2010",
   "Views: 1674",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me first tell you a little about myself. I've smoked pot a few times in my life. Other than that my drug history is quite boring if not nonexistent with the exception of copious amounts of alcohol (that's what college is all about, right?). In any case recently I took a job that is deemed a 'safety sensitive' position, meaning that I can get random drug tested, so out went my ability to smoke pot. I turned my attention to legal drugs that would give me a unique experience. Not immediately, but ultimately my attention was drawn to the Shepherdess herself. I did my homework, I read up on the effects, doses, good trips and bad alike. All that was left was to get my hands on some. A head shop that I knew in the heart of Baltimore was the perfect place.</p><p>That night a few curious friends and I gathered at a friend's house. Pulling out his newly acquired bubbler, we discussed what was about to go down. In retrospect, this being the first time for a few of us, we should have assigned a sitter or sitters, but we ended up being any way. The friend that I had split the cost of the salvia with took the first hit, we all watched intently as he held that hit for as long as possible. Just as I was thinking that we had gotten ripped off and I began to take my hit he began laughing hysterically and wandered away, presumably back onto the deck where we had set up a TV. </p><p>As I held the smoke in my lungs and held the pipe out for my friend to grab I was overtaken by a wave of laughter. I reached up, grabbed the supports of the deck and swayed back and forth and side to side trying to regain my composure. It snuck up on me. It took me a minute or so to even realize I was feeling anything.</p><p>Simultaneously I had the feeling that I was on a train and in a pop-up book. It's hard to explain, it didn't feel as if I was on a train in a pop-up book in a train or a train in a pop-up book, but rather I was simultaneously on a train and in a book. As I stood the world seemed so strange as if I had never been where I was before, as if I had gone somewhere completely different and alien. Interestingly, the duality continued. It seemed as if I was simultaneously tripping and sober at the same time.</p><p>As I continued to sway, gripping the deck firmly, I began to have a conversation, nay an argument within my own head, the kind of introspection that occurs when you have to make a difficult decision and are weighing the options. The debate raged as my friends torched the rest of the bowl, I remember thinking to myself how real things felt which contradicted how weird things looked not trippy or weird, I wasn't hallucinating but everything was fuzzy, smoky, hazy, and fragmented. As I felt the deck my mind raced. Completely forgetting about the effects of the drug I was overtaken by the question of how things could appear both real and unreal at the same time. As my friends left the shelter of the deck, I followed almost instinctually, all the while feeling things as I walked up the stairs which to my eyes seemed ethereal but to my hands and feet were as grounded as ever. Finally reaching my seat I relaxed, took a deep breath and seemingly feel out of this state.</p><p>My friends particularly those at the tail end of the first rotation were anxious to pack another bowl. As I sat and tried to respond I felt drunk. My eyes seemed to sway although I could feel that my body and particularly head were completely stationary. In any case we made our way back down under the safety of the deck. As I packed the bowl again, we enthusiastically discussed what we had each individually gone through which in hindsight probably wasn't the greatest idea from the view point of originality for our second trip. As I lit the salvia, I listened rather bored to my friend's tale of the adventure he had been on. The taste was terrible, for whatever reason it took a while to hit me this time. So long in fact that I basically acted as a sitter as one of my friends stared unblinkingly intently into the windows of his house, saying nothing, standing slouched. </p><p>Finally it kicked in, once again it's difficult to explain. I felt as if I was in a video game. At least that's how I felt as the ground appeared computer-generated, my brain was still working. I was afraid that my experience would be the same as the first so I wandered to a different part of the yard. Pushing my way between the branches of a willow tree that seemed like a jungle, I made my way to the trunk, where I was overtaken by the sudden urge to relieve myself. As I did so, I began looking around, rather late to see if anyone was in the vicinity. Shocked to the point of completely forgetting about peeing, a dark figure stood across the fence from me.</p><p>Surprisingly I wasn't afraid. I stood for a minute, blinking and confused, trying to revisit the normal version of the backyard to see if I was looking at a tree. The figure stood unmoving, dark but tinged with green on the edges. For whatever reason I was convinced that this creature was a dryad. It didn't seem angry or hostile towards but curious towards my presence just as I was to its. After a minute of complete silence, I managed to speak. 'Hi,' I said as normally as possible.</p><p>It remained silent, looking at me, even though I couldn't know from looking at it that it even had a face much less eyes. As I stood I don't know if the salvia was wearing off, but I got scared. What if it was the neighbor, I thought. Stupidly, I asked, 'Do you live here?' Still nothing. Finally regaining my composure I zipped my fly back up and began to walk away. As I walked back through the branches that brushed gently on the ground, chills went down my spine as I could feel the creature's eyes staring into me. Eyes that went through more than just my body but to what was I thinking. Uncomfortably I walked back up the stairs to the deck and sat down heavily in my chair, trying to figure out what just happened. All the while knowing that I could never truly explain it, but knowing that it meant something. Something that I still have yet to decipher.</p>"
}
