{
 "title": "I Have Been Such a Fool",
 "author": "Micwool",
 "citation": "   Micwool. \"I Have Been Such a Fool: experience with Salvia divinorum (40x extract & tincure) (ID 63968)\". Erowid.org. Feb 12, 2008. erowid.org/exp/63968",
 "substance": "Salvia divinorum (40x extract & tincure)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "5.0 ml",
   "sublingual",
   "Salvia divinorum",
   "(liquid)",
   " ",
   "150 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "63968",
   "Female",
   " ",
   "Not Given",
   "Feb 12, 2008",
   "6143",
   " "
  ]
 ],
 "report": "<p>I've wanted to experience salvia the great level 4 and five.' I trying to reach these great doorways using tincture, plus 40X using a standard lighter, and also recently by boosting salvia tincture with 40X extract. I have also been almost dissing the power of lady salvia for so openly rejecting my continuous knocks at her mysterious doors not knowing why she would deny such a fine human specimen as me, whilst letting other people through on a meagre 5X extract.</p><p>Anyways I did the usual pre-trip preparation of cleaning my bedroom, preparing soothing new age tracks to listen to on my journeys and the like. Tonight I also was looking forward to trying the booster method since I have had previously had only mild lv3 experiences when using tincture alone. This was prepared using two 2.5ml tincture doses to be taken write after one another at 5 minute intervals plus my water pipe filled with 150mg 40X. </p><p>I was desperate to be let in on the big secret behind salvia after reading people's reports about traveling to other places and times, meeting strange creatures and the like. I also like a fool thought to myself whats wrong with these stupid people reaching level 5 and then complaining about becoming energy, an object like a picture, one with nature and the like. I considered them one of the lucky ones for being able to breakthrough taking a backseat from are hectic lives we as humans lead, just having the unique experience of being a beautiful painting on the wall. Anyway I guess youre ready to hear about my trip.</p><p>I had waited for the perfect night to achieve my perfect level 4 trip and had done all the preparations days before to guarantee that nothing stood in the way of me and salviaspace. These included purchasing the potent salvia 40X extract, a torch lighter to burn the salvia strongly, and a cool water bong necessary to cool the harsh smoke which would be generated by the super hot flame.</p><p>The long awaited night had come. I sat comfortably on my bed holding the remainder of my 2nd salvia tincture dose I would be taking under my tongue. The 10 minute holding phase had then passed signaling me to swallow the bitter tasting elixir. I was already well on my way into a trip, by this point as my fine motor skills had gone, making it difficult to swallow the tincture. The loss in control caused me to gag and choke on the last drops as they went down. I rushed to the bathroom to take a quick sip of water to hastily remove the choking fluid in my throat. I simply brushed this aside thinking that it had been because I had not felt the burning sensation of the tincture in a long while. </p><p>I then resumed with my plan to breakthrough as many people call it, so I now perched myself on my comfortable bed and began to roast the 40X extract sitting in my water pipe with my brand new torch lighter. I took the first toke on my pipe smoothly but deeply, and held it for 25 seconds. I thought let me take one more rip on this pipe as I will not be denied again, thats when it hit me. I lost all knowledge of holding my breath or even putting down the bong, and now was part of a moving network in salviaspace. Imagine how a cell must feel, on its own it is just a unit without a mission, but if it combines its expertise with its partners it builds an organ capable of carrying out a great job. First and finally its only reason for being available is to work as a whole with other cells enabling that organ to function.</p><p>I had become a building block, part of something. I am not sure whether it was a house being formed or a complex object. I was a single unit of this pattern I had a simple blue human figure, complete with simple arms and a central frame, and it was my job to +hold hands with countless other blue men to arrange ourselves into patterns, architecture and more complex forms like scenery. We were the builders of an alternate dimension. I thought to myself THIS IS MY LIFE, I was meant to be here from the start but somehow from conception onwards I had become human and adopted human ways, like free will and an ego. I have somehow been living a lie and have only now returned to my past life.</p><p>It was at this point that I realised I was rapidly losing my identity and now forced myself to determine whether the reality I had previously known was real or whether this had been where I should have always been. I just was not willing to except my new life, being a tool forced into constructing forms. My fellow units where happy to live their lives being moulded and intertwined they had not known anything better than that, but not me. I regarded myself as special as I was the only unit which had experienced another meaning of life. In my previous life as a human, life was not easy, it was filled with pain and grief and some of us where annihilated by are own species through wars and other crimes. For a lot of people it was by no means fair, people lived and perished. But as humans we also experienced Love the emotion of being wanted and cherished. As a human I also had a mother and father, a team called parents that actually produce people from their own composition. They showed concern and watched over their young and would even terminate their life if it meant their offspring would live on. My new life could never match up to my past life as a human.</p><p>I yearned to return to planet earth characterized by the ability to think individually, emotions and the ability to make choices. At some point during the trip I put two fingers up to this new world, the one falsely created by salvia which persuaded me to believe its existence over the world I developed in. If this is what life is about then I did not want any part of it. I decided I WANT TO BREAK FREE. I mustered up all the courage to gain my true identity which had long been shattered by Salvia. I ripped myself from salvia space tearing apart the delicately balanced forms which had been weaved. I was not willing to ever return to this dimension I had unwittingly wished upon myself by indulging in large quantities of tincture and purchasing overly concentrated extracts. I now felt as though I was in a middle of a war between my ego trying to bring me back to what I thought of as the truth and this strange new Tran dimensional world I had become a part of. The dissociation was exceedingly strong. As I pushed salviaspace out of my mind I jumped of my bed and ran across the room, feeling the friends I had made split from my face and eyes. The blue men did not want to see me go, they had welcomed me with open arms after my belated return and were by no means willing to let me leave without a struggle. In my attempt to exit I spilled bong water all over my bed and broke my headphones. </p><p>I was now more in touch with reality and realized I had to do what ever it took to stay in consensus reality. I could feel salviaspace still strongly in my presence and closing my eyes was enough to immerse me back in that otherworld. I stood calmly in the center of my room and thought about how I could end this trip. Hmm...Mushroom trips are ended with Benzos. Salvia however can be suppressed naturally with distracting stimuli such as light and sounds. I will turn the tide on this war I thought. I jetted to the light switch lighting up my room, simply enough salvias pull eased up.</p><p>The trip was now more controlled, so I decided to pop on a comedy DVD, to distract me from the trip and began writing this report while the memory was still alive. This Laptop I am sitting at is like my rubber ring it is keeping me afloat preventing me from falling back into the otherworld drowning in transdimensional space. I count myself bloody lucky that after the amount of salvia I ingested tonight I was able to regain control and terminate my trip so easily without panicking or screaming for help. Even when I remembered that being human was my true identity I thought the blue men would reclaim me as theirs. </p><p>In conclusion - I really do not know whether I am going to use salvia again. I guess I finally got that grand breakthrough I was after. Like they say a true breakthrough can end the honeymoon period with Salvia. I probably will use this plant again but this time use a more humble dose. One positive aspect about the salvia experience is that it could be aborted wilfully simply by seeking out a source of grounding such as lights, T.V, music. Even at the peak of my level 4 trip I could manage to pop on a DVD, and turn on the lights to bring me back to this 'true reality. If this had been a strong mushroom experience, lights and a DVD would not have been enough to ground me, I would have had to deal with it or have a strong tranquilizer ready.</p><p>Wow this really is the Diviners sage, never in my life have I been forced to confront two conflicting realities at once and decide which one I belonged to. As explorers of consciousness we aim to experience alternate realities but once we are transported there we may want to run back home to what we know and love. The degree of Dissociation this herb precipitates. When I was in the otherworld and trying to escape I did not care about making a scene or potentially destroying my bedroom because I thought of my real life as a fabricated lie, including my family and the people on planet earth. On salvia my memories are a distant feeling. I lose so much control over what is real and false as I did its phenomenal.</p><p>I still do not class this as a bad trip however because I generally feel enlightened to be shown lessons from lady salvia. I now can relate to people when they talk about experiencing overlapping realities and becoming objects. Before I simply could not grasp the feelings associated with these ideas. I also understand the anti-addictive nature salvia can impose. When I was coming down I swore of doing any psychedelic agents again. I have learned my boundaries as far as the dosage it takes me to reach these levels and also how a true breakthrough on salvia feels. I came out of this experience feeling illuminated and having a totally different respect for salvia.</p>"
}
