{
 "title": "The Emotional Trip",
 "author": "Joe",
 "citation": "   Joe. \"The Emotional Trip: experience with Hydrocodone with Ibuprofen (Vicodin) (ID 64015)\". Erowid.org. Feb 9, 2010. erowid.org/exp/64015",
 "substance": "Hydrocodone with Ibuprofen (Vicodin)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64015",
   "Gender: Male",
   " ",
   "Age at time of experience: 16",
   "Added: Feb 9, 2010",
   "Views: 17620",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Age: 16</p><p>Height: 5'6'</p><p>Mindset: Content, relaxed, focused.</p><p>Dosage: 4 (four) pills were taken broken in half and ingested over the withcourse of 30 minutes.</p><p>I am not very well experienced with a wide range of drugs, but I have used a fair amount of alcohol and marijuana in my time. I got my hands on 5/500 vicodin pills as the result of seriously injuring my back on a playground.</p><p>I had never used any more than 2 pills at a time, because I experienced hallucinations when trying to fall asleep. These hallucinations were completely random and very mild. For example, I saw a digitally modified foot in front of my face, it seemed just simply pixelated. Another hallucination was the feeling of being smothered by sasquatch, or something with rather large hands. I felt as though the hands were pushing on my back, but when I abruptly awoke, I was sleeping on my back.</p><p>Anyways, the 4 pill dosage was spent with my friend, who smoked 1 bowl of weed from a pop bottle pipe. I finished all the pills as we sat down to watch Robin Williams Live On Broadway. About 1 hour in to the movie I remember feeling very emotional all around. There would be a mean joke said, and I would tell my friend how I felt about it. We also talked about existence and the universe for a little while, but we drifted off that subject.</p><p>After the movie, we decided to surf the web. I kept on the very emotional side of things as I always do on vicodin, but I also felt everything needed to be in the right place. If something was imperfect or something wasn't meant to be, I would throw a fit. For example: my friend was in a playful stoner mood, so he swiped the mouse from me and was using his leg as the mousepad. He was using the laser mouse by moving it around on his thigh. I immediately was furious with him for not using the mouse correctly. I wanted to fight him. I then forgot about it soon afterward. </p><p>I went to sleep not too long afterwards. I had many dreams that night, but I do not remember any of them.</p>"
}
