{
 "title": "My Addiction Self-Treatment",
 "author": "Jack",
 "citation": "   Jack. \"My Addiction Self-Treatment: experience with Alcohol (ID 64061)\". Erowid.org. Sep 24, 2010. erowid.org/exp/64061",
 "substance": "Alcohol",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Pharms - Chlordiazepoxide",
   " ",
   " ",
   "  ",
   "oral",
   "Pharms - Clonidine",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64061",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 24, 2010",
   "Views: 12548",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My Detoxification  June 2007</p><p>BACKGROUND</p><p>There's a history of alcoholism in male uncles on both sides of my family, some are still functional, but the older, chronically addicted uncles died by age 60. I drank alcohol responsibility for about 20 years (15yr to 35yr). I started drinking most nights about 10 years ago, but rarely exceeding 6 drinks per night -- mostly beer. My drinking escalated to 12+ drinks per night, including sake, and vodka, early this year. I have never consumed alcohol during the day, or when my duties required a clear head. Interestingly, according to my observations, and testimony from relatives, this daytime sobriety and duty before drinking ethic is pervasive amongst the functional alcoholics in my family.</p><p>HIGH BLOOD PRESSURE</p><p>After a visit to the ER in 2002, I was diagnosed with high blood pressure. Note that my drinking at that time was frequent, but not excessive. Since then, I've been taking blood pressure meds daily, and significantly reduced my salt intake. My diet has always been excellent, low fat, low cholesterol, low refined sugar, and a good balance with fruits and vegetables. Notably however, until recently, I was a chronic couch potato. After the BP diagnosis, I found out that my hypertension might be inherited on my mother's side, my mother was diagnosed with essential (no clear medical cause) hypertension, and her grandfather had hypertension, and died at an early age after multiple strokes. Both are/were otherwise in good physical condition. Presenting with elevated BP in early June 2007, I was prescribed a diuretic, to add to the other BP medication.</p><p>On Sunday, June 10, 2007, after more than usual alcohol the night before (20+ drinks), my BP skyrocketed, I measured 226/124. I took additional BP meds (Not blindly:  I'd previously studied safe dosage schedules for both BP meds.). The extra drugs had no effect. Lightheaded, arms tingling, and distinctly feeling each beat of my heart, my wife drove me to Capital City Urgent Care. BP measured by Urgent Care was similarly high  Because I reported no heart attack symptoms, I waited an hour before treatment.  Eventually, a doctor administered Clonidine 0.2mg, which brought my BP back down to the 160/100 range.  They released me with two 0.2mg Clonidine tablets for use if systolic BP exceeded 200, because I had an appointment with a doctor the next day.</p><p>SEEKING ALCOHOL DEPENDENCE TREATMENT</p><p>After much research, utilizing advice from the online professional medical journals, and credible testimony from past-addicted friends and family, my wife and I decided that outpatient treatment was the best solution. I'd done behavioral homework as well, experimenting with alcohol cessation, to assess the severity of the dependence, and determined that I was mildly dependent: Stage I (shaking, elevated pulse, increased blood pressure, agitation). I went to the doctor appointment the next day with my wife, having decided to ask for help to treat my alcohol dependence as an outpatient.</p><p>Dr. 'Howser' (MD since 2003!) listened to our plan, and at first recommended inpatient treatment (rehab), which we politely declined. The doctor then responded with warnings about the risk of DTs, seizures, and death. This upset my wife a little, but I was unmoved. After a 15 minute conversation, the doctor agreed to help us. He advised that I wean myself from alcohol before total abstinence, and prescribed Clonidine 0.2mg 2x daily and Librium 25mg 3x daily as needed. </p><p>DETOXIFICATION</p><p>During detox, I continued to take my BP meds, additional meds are listed below. I weaned myself off alcohol for 6 days before quitting, drinking in the last two hours before bed, like so:</p><p>Day 1</p><p>6 drinks (half usual)</p><p>0.2mg Clonidine 2x daily</p><p>Almost no sleep, and profuse sweating</p><p>Day 2</p><p>6 drinks</p><p>0.2mg Clonidine 2x daily</p><p>25mg Librium 3x daily</p><p>Difficulty sleeping, profuse sweating</p><p>Day 3</p><p>4 drinks</p><p>0.1mg Clonidine* 2x daily</p><p>~12.5mg Librium* 3x daily</p><p>Incomplete sleep, light sweating</p><p>Day 4</p><p>4 drinks</p><p>0.1mg Clonidine 2x daily</p><p>~12.5mg Librium 3x daily</p><p>Incomplete sleep (\n</p><p>Day 5</p><p>2 drinks</p><p>~0.05mg Clonidine 2x daily</p><p>~8.67mg Librium 3x daily</p><p>Full, restful sleep</p><p>Day 6</p><p>2 drinks</p><p>~0.05mg Clonidine 2x daily</p><p>~8.67mg Librium 3x daily</p><p>Full, restful sleep</p><p>Day 7</p><p>0 drinks</p><p>0.05mg Clonidine 2x daily</p><p>~8.67mg Librium 3x daily</p><p>Full, restful sleep</p><p>* As treatment continued, I reduced the doses of Clonidine and Librium to the minimum required for relief, eventually 1/4 of the Clonidine, and 1/3 of the Librium  at the prescribed doses, those drugs made me unsafely clumsy and frustratingly stupid. The Clonidine tablets are easy enough to divide with a pill splitter, but it became necessary to break open the Librium caplets and divide them among 2, and finally 3 gel caplets to get a low enough dose. Note that I appreciated the availability of the full prescribed doses, just in case my BP became difficult to control.</p><p>CLOSING REMARKS</p><p>It disappointed me that outpatient treatment was discouraged, at least by the 'king' of all HMOs, seemingly as a matter of policy.  Highly motivated, mildly addicted persons like myself can be treated, with family support, for very low cost in terms of physician face time and drugs prescribed.  Because Doogie effectively functioned only as a drug gatekeeper, I was forced to research mild alcohol self-treatment myself.  The best relevant document I found is this:  http://www.aafp.org/afp/990915ap/1175.html#table%202</p><p>Please seek professional medical advice before starting any self-treatment program, even if your alcohol withdrawal symptoms are as mild as mine (shaking, elevated pulse, increased blood pressure, agitation).  Also, be aware that it is not usually recommended to combine alcohol with some of the drugs I used in my self-treatment.  Again, consult your doctor before proceeding.</p><p>Thanks for reading.  I hope this helps others seek treatment before it gets out of hand.</p><p>Cheers!</p>"
}
