{
 "title": "All of Everything is Golden",
 "author": "ThreePieceSuit",
 "citation": "   ThreePieceSuit. \"All of Everything is Golden: experience with Mushrooms (ID 64068)\". Erowid.org. Oct 7, 2010. erowid.org/exp/64068",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 64068",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2010",
   "Views: 2354",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA little about myself: I am 5'10', 135 lbs (skinny!) and quite good natured. I live a happy life, and am usually quite relaxed and laid back. Prior to this trip I had not experienced anything, including pot or alcohol.\r\nMy first mushroom trip began on a Friday evening in the comfort of my own home. Previous to the night of the trip, I had been fasting, and had limited myself to only drinking water. I was excited and a little nervous about the trip, but, at any rate, optimistic. A friend of mine was present, who we'll call Tim, and we were relaxing in my basement. I decided to ingest the mushrooms at 7:00 pm, so I'd be able to sleep after the trip had ended, while still having enough light outside if I wanted to explore.\r\nI tipped the contents of my mushroom bag onto a spoonful of honey, took a deep breath, and shoveled them in. The honey did a good job of masking the taste, but I wasn't really able to chew them, so I swallowed quite soon after. Immediately after I took 1000 mg of vitamin c, or four tablets. I'm still not sure whether this enhanced the effect or not.\r\nI was told by most of my experienced friends to 'chill out till it hits,' and to take it easy in case of nausea. The Simpsons had just come on, so I settled in and watched. My friend who was using the computer seemed somewhat interested in my condition at first, but fifteen minutes or so after dosing, became bored with my response of 'nothing yet.' I explained to him that the effect probably wouldn't begin for a while, because I hadn't chewed them much and the stomach is slower to absorb than the tongue. A half hour after dosing, with the Simpsons over, I asked my friend to come outside for a walk with me. I was excited to leave the house, because some odd feelings had begun to manifest in my face and arms. I ran up stairs quite quickly, and upon reaching the top, noted that even though I had stopped moving, I still had the sensation of ascending. I told Tim about this excitedly, and he was slightly amused. We left my house and walked around my neighborhood for a while, and I began describing some odd feelings. For instance, at times, my head seemed to become extremely narrow, and as if it were trying to compensate, extremely tall as well.\r\nI looked around at the leaves on the trees. They seemed to be more delicate and intricate than usual, but it wasn't too drastic. The sky was overcast and it began to rain, so we headed back for my home. As I looked skyward, I noted dim rainbows forming on the curve of every cloud. I asked my friend if he saw them also, because I found it difficult to believe that the mushrooms could cause such a realistic hallucination, while my state of mind remained so clear. He gave me a look that said 'You're mental' and reminded me that he hadn't used any drugs that night. I laughed harder than I should have.\r\nWe returned to my house 45 minutes after dosing, and descended to the basement. I sat in a large comfy chair, and allowed my arms to find the armrests. I noted that they no longer seemed to be entirely under my control. Looking around the room, I also noted that the corners and ceiling seemed to stretch and pull away from me, like taffy. I giggled. The giggle seemed to propel my face into a back flip into my own mind, which only added to the hilarity. I spent some time looking at objects strewn around the room. An Aztec calendar I had seemed to form stairs, which was a big hint as to my current state.\r\nFor the next twenty minutes or so I felt myself getting progressively beshroomed. I kept trying to explain things to Tim, but I was giggling quite hard, and leaving words and entire sentences out. He became slightly irritated with me, and left the room to talk on the phone. I shut the door, turned off the lights, laid down on the couch, turned on some Shpongle and the electric sheep screen-saver, and fell into my peak. The couch sank away from me, and I was floating and falling at the same time. I closed my eyes and saw bright fractals composed completely of mushrooms! They glittered and flashed in a pattern. I was exalted.\r\nDuring this time, I realized that I should write some of my new knowledge down. The marker I picked up seemed slightly rebellious, but I was able to control it to the point that 'Battle Axe Toads' could be written. What an odd sentence. My next attempt yielded the words 'All of Golden.' Rereading this showed me I hadn't finished it, so I tried again, this time managing to relate my thoughts to the paper. 'All of Everything is Golden right now, and I'm loving it.'\r\nAt this point, my sense of time was completely shot. I haven't any idea of how much later Tim returned, but I began speaking very rapidly to him. He understood very little, but he did catch the fact that I had just became the glass of water I was sipping from. 'What was it like?' he asked. Even now, I find it difficult to convert the feeling to words, but at that point, it seemed like he was asking me my life's story. For the sake of the report, I'll do my best to explain what becoming a glass of water was like.\r\nIn the instant it happened, I saw nothing except the glass of water, except it wasn't from my own perspective. Surrounding the glass, where the room would normally be, was nothing but glittering mushroom fractals, which somehow explained all the awareness of the water. In my beshroomed state, being asked to relate this coherently was dumbfounding. Tim noted my confusion, and let it drop. Instead, he handed me a skateboard. 'Become this,' he said, jokingly. I accepted it, and, within seconds, I had become the skateboard! I had known of every inch of it, had remembered everything the skateboard had experienced, and had known the feeling of being a skateboard. 'Did you do it?' Tim joked. 'Yes!' He asked me to become other things. I explained to him that I had to be touching what I wanted to become. He then suggested I become the house. I stood up to touch the wall, but lost balance and leaned against a broken Mac computer. I instantly became the computer. Tim must have guessed this, because he began to laugh. 'That was the worst thing I have ever been.' I mused.\r\nLater still, I was taken upstairs to my bedroom. Walking through the hallways of my house was incredible, and I seemed to glide from room to room, traveling with unchecked speed. I laid on my bed again, and some time later I was given a tribal mask by another friend who had come over, and she also brought me some licorice. I ate it and noticed that it seemed to exist in every part of my mouth at once. As I cleaned my teeth with my tongue, I was thrilled to discover that they seemed to form a complete circle, instead of the normal U shape. I smiled broadly. My friend left me to think. As I listened to Shpongle while lying on my bed, I heard the phrase 'I am a Shaman,' and it occurred to me that I was a shaman, and should don the mask. I did so. Later, my friends came in to check on me, and when I looked up at them I was still wearing the mask. They laughed and left me again.\r\nSomewhere around 10 o'clock, I felt ready to walk downstairs again. I did, and decided to eat a bowl of sherbet. As I scooped it out, I noticed the arch created. It fractalised in front of me, which seemed to mark the end of my visuals.\r\nBy 11, the trip was coming to an end. I felt somewhat sad that it had only lasted 4 hours, and that I hadn't spent more time outside. It was fairly intense overall, but I felt I could have handled more.\n\n\n"
}
