{
 "title": "Bicycle Day",
 "author": "Bubba",
 "citation": "   Bubba. \"Bicycle Day: experience with LSD (ID 64112)\". Erowid.org. Jun 11, 2010. erowid.org/exp/64112",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(cookie / food)",
   "  T+ 2:00",
   "1 hit",
   "oral",
   "LSD",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64112",
   "Male",
   " ",
   "Not Given",
   "Jun 11, 2010",
   "5466",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the past 5 years of my life I have learned everything I could about LSD.  I have a very focused interest in drugs, there use, and abuse.  While not much of a drug user myself, only cannabis a handful of times in my life, the aspect of the chemical interactions produced in our brains fascinates me.  LSD has always seems as the epitome of the near life experience psychedelics offer and Ive wanted to try it for a long time.</p><p>I dont know the type of people you need to know to get LSD these days, its not easy in my area.  Cannabis is not an issue, but LSD is nearly non-existent and has been from what I have learned sense about 2003 or so.  Slowly I made some contacts that would eventually lead me to writing about my experience today.   </p><p>Two weeks ago I got the phone call that its a go.  I did not just want a few hits, I intended to purchase a very large quantity so I might keep it in cold storage for a very long time (hopefully my whole life) to use every year or so.   My buddy came though and in my freezer vacuum sealed is some 100 sugar cubes with LSD in them. </p><p>This past weekend I dropped acid for the first time, and I must say it lived up to every expectation and everything thing I had read in the past few year about it.   My experience was extremely positive.  Here is a basic recount of it:</p><p>5:30pm</p><p>Downed 1 sugar cube, at this point I dont know if Ive been burned on the deal or not, and I have no way to test to see if its real or not.  I dissolved the sugar cube in a glass of water, and drank it all. I must say I was extremely nervous about what I was doing, it was very very unknown to me.</p><p>6:00</p><p>I took a walk, no effect that I could tell, very nervous still.</p><p>7:00</p><p>I felt extremely anxious, but I truly though the feeling I had and generally restlessness was a placebo effect and not the drug, at this point I had begun to think I got burned. (100 hits of acid these days is not cheap!)</p><p>7:30</p><p>Same feeling as at 7:00, I decided to take another hit, thinking maybe there were very old or not well stored and had very little LSD that was active in them.  I knew the threshold effects take place somewhere around 25 micrograms so my skewed logic at the time was I may have not passed this threshold.  Effects were suppose to set in, in the 60-120 minute mark, but seemed they had not.  So another glass of water and another cube was downed at this time.  Looking back I think the effects had started I just did not really realize it, and taking another cube was poor clouded judgment.</p><p>7:45</p><p>Extremely nervous, very warm and I started to think this was no longer a placebo effect, and that taking that second cube may have been a bad idea.</p><p>7:50</p><p>I went to my living room window, and looked out into the garden.  I noticed my reflection in the glass of the window, it was very blue even though my shirt was tan in color.  I stared for a bit and noticed my vision started to flicker like a low refresh rate on a CRT computer screen. I then looked at myself in my bathroom mirror to see if my eyes were dilated, they were not yet, or at least it did not seem as such.  The reflections in my eye were amazing, it was like staring in to my soul, and seeing the universe for what it was for the first time ever.</p><p>8:00</p><p>Sitting at my computer listing to music I was amazed at how the room looked, it was like I was a child again, everything felt new and unknown.  Time was starting to slow down a lot, it seemed like 15 minute intervals were 1-2 hours, while 1 hour intervals were 2-3 minutes, almost a giant expansion and then compression of time.  I closed my eyes and started to noticed some very very intense CEVs, very pretty and much more complex then what pot gives you.  And none of the memory loss pot has either!  I can recall everything in such great detail.  </p><p>9:00ish</p><p>I remember looking around and thinking this was amazing, but still had yet to see any real visual effects, then suddenly I looked at the carpet (I thought of fear and loathing in Las Vegas and what it looked like when they were tripping on LSD) then all of a sudden the carpet started to swirl and then to my absolute astonishment the entire floor in my office was a beautiful sea of plants pulsing to the music.  Looking at my computer screen the white space in the itunes program widow was flooded with amazing colors and shapes, complex paisley patterns and geometric shapes.   </p><p>9:30ish</p><p>My girlfriend arrived, I found talking extremely hard, and the amount of intense thoughts I had was so incredibly overwhelming.  I asked for her to walk about the neighborhood with me. I will never forget that walk as long as I live, it was amazing. The sensory cross over I experienced, the motion trails, the colors, sounds, and the sunset was probley the most amazing thing I have ever seen in my life.</p><p>Later that evening after she left I had some very intense visuals, I watched TV for a bit and every pattern on the TV was on the walls around it as well.  Some other highlights were seeing my kitchen sink in neon colors with patterns all over, and the titles in my bathroom morph into various shapes. While the visual aspects were amazing, my thoughts were so profound.  I leaned about about myself in the next 10 hours or so.  </p><p>At 5:30am I went for a walk as the sun was coming up, the bird sounds I heard I experienced visually, the walk was very nice.  I took a shower around 8:30 and went downtown by car feeling that I could drive at this point.  Breakfast tasted great and the rest of the day was great.  From going to the mall, to having sex later, everything was intensified.  I went to bed around 9pm having been up for well over 24 hours.  </p><p>I slept great, the next day I needed a lot of caffeine to stay awake, and I was in a generally poor mood, probley do to serotonin levels in my brain being all out of whack.  I could go on and on about what I learned about life that night, I think its sufficient to say that it was the most life changing experiences I have ever had in a 24 hour period, and I hope in a few months to repeat it again.</p>"
}
