{
 "title": "Not Sleeping Just Plain Sucks",
 "author": "Ham On Bread",
 "citation": "   Ham On Bread. \"Not Sleeping Just Plain Sucks: experience with Melatonin & DXM (ID 64131)\". Erowid.org. Jul 6, 2007. erowid.org/exp/64131",
 "substance": "Melatonin & DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "8.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "30 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64131",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 6, 2007",
   "Views: 19180",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently, Im having trouble getting regular sleep.  I work, do summer school, and have other extracurricular activities. Lead a relatively stressful life, but mostly eustress, not distress. Its still frustrating when Im having trouble functioning at work, or interacting with others because of sleep deprivation.  Its even more frustrating when I cant sleep while this tired.  I often take anywhere from 1-3 mgs of melatonin to help me sleep.  Usually I masturbate before sleep which tires me out, makes me feel Ive accomplished something, idk.  I drink some milk.  Maybe even do some pushups.  </p><p>I did all of that last night, and took 8mgs melatonin.  I even drank some wretched cough syrup which contained DXM (had about 30 mg).  This all made me feel like shit, because Im trying to live a sober lifestyle, and I feel like I abused mind altering drugs, even though they were just otc meds.  I found myself awaiting the effects with bittersweet apprehension, and it felt all too familiar.  I just got pissed and kept taking more, one by one, until about 4, then I popped three just to be sure.  Reminded me of my pill popping days and was tempted to chug the whole bottle of cough syrup and stay up smoking cigs all night.  I didnt even get much sleep, although I got unbearably drowsy.  </p><p>From when I went to bed at 12:45 I woke up at 3:30.  I vaguely remember dreams and thinking how weird they were cant remember now, but I believe they were violent, felt like I was being chased, very stressed.  I was hot and sweating.  I get up and turn on the air conditioning, drink some warm milk, and take another melatonin.  I also turn on the fan because the sound is comforting.  I try to sleep but my eyes wont stay shut.  I have my insomniac periods, and Im entering one right now, when I cant sleep it makes me physically angry, likes it's not fair.  Thinking of all those happy people who dont even have to try to get sleep, totally comfortable, cutting zs and such.  Bastards.  </p><p>I wake up again around 5:30, this time Im too cold. I turn the ac down, leaving the fan on.  I dont know how much sleep I got from there on out, because although I felt more relaxed and ready to sleep, I was mostly tossing and turning.  Id say I got to sleep every 30 minutes or so and woke up every fifteen minutes during that sleep.  The whole night I had superstitious thoughts, like, oh no, dont think about her, it will only make you anxious and harder to get to sleep.  No dont think about your upcoming courtdate.  No dont think about work tomorrow, etc.  I wonder if I had extremely disturbing dreams, because my whole body is sore, especially my neck, I presume from tossing and turning.  </p><p>This soreness could also be from the sedative effects of the melatonin, and I just fell asleep in strange positions.  But I dont think that could not account for my jaw aching, as if I was clenching my teeth all night.  Its very possible I had the reoccurring dream where I run over a little girl and run from the cops, and die or commit suicide.  It usually gets me every time I start driving in a dream, and it often becomes lucid towards the end and I remember it in detail unlike this experience.</p><p>This was a very frustrating experience, and today was a struggle.  I am about to try to get to sleep earlier around 12.  I go to sleep around then because I am accustomed to sleeping 4 and 5 in the morning. I also plan to get my 3 mgs, pushups, and uh  some warm milk.  Wish me luck.</p>"
}
