{
 "title": "Stuck in a 24 Hour Trip",
 "author": "Bigfella",
 "citation": "   Bigfella. \"Stuck in a 24 Hour Trip: experience with DOC & Cocaine (ID 64158)\". Erowid.org. Sep 22, 2010. erowid.org/exp/64158",
 "substance": "DOC & Cocaine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   " ",
   "DOC",
   " ",
   "1 line",
   " ",
   "Cocaine"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64158",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 22, 2010",
   "Views: 6151",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done DOC before but have always limited it to 3 hits and hadnt taken it with coke before the other night. A bunch of my friends got together and a new friend said he wanted to try it, so we whipped it out, him taking 2 hits and 240 mg DXM, and me taking 4 hits with 1 line of coke. We go to a different house and start tripping about an hour later.</p><p>About two hours later we go into a house and just chill and listen to music. A new kid comes over and just totally fucks things up. He starts changing the music, and just giving off really bad vibes. So I go to a different side of the house and just sit there playing with the lights and listening to jazz until the sun came up.</p><p>Throughout the night though I would go on these little conquests where I would completely devote myself to fix, get, or setup something. A few were finding the music I wanted (wisp), which required downloading it and extracting and a lot of effort, then I needed gum, then a phone charger, and just a ton of different little things that I felt must be done before I could move on.</p><p>I went into the other room where the other kids were and the one that did the DOC/DXM said he was terrified the entire time but stopped tripping about an hour ago and was fine now. He said he just did not know where anything was or what was going on. I think it would have been a lot better for him if his first time was at his own house and with only a couple close friends. </p><p>I was still tripping and had to go home in a while. My friend took me home, and to my surprise my parents were home! So I just tried to play it cool but I was definitley acting strange, eyes darting around, that type of thing. Later that night my family told me to come watch dreamgirls with them, haha, weird expereince. The entire time I thought my family was talking about me, but I did not want to risk anything by asking them, cause I had been hearing voices all day. Anyways, in this movie, whenever it got to a concert, and specifically one with Eddie Murphy, the entire room I was sitting in lit up with disco lights and I just felt really good.</p><p>Finally 24 hours after the trip started I was able to fall asleep, still having an intense trip.</p>"
}
