{
 "title": "Enjoyable and Long-Lasting",
 "author": "Guru Sigma",
 "citation": "Citation:   Guru Sigma. \"Enjoyable and Long-Lasting: experience with Tramadol, Alcohol & Cannabis (ID 64219)\". Erowid.org. Jul 6, 2007. erowid.org/exp/64219",
 "substance": "Tramadol, Alcohol & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64219",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 6, 2007",
   "Views: 63148",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs a personal input, I consider Tramadol to be very beneficial to my mood. I typically ingest 100mg doses at least three times a week with occasional 2-week breaks in which I don't crave it and don't experience any withdrawal symptoms. Being very cheap in Costa Rica, I'm surprised to have never found anyone who has ever even heard of it despite its powerful mood-lifting effects, specially when combined with alcohol.\r\nFrom my experiences, I gather that Tramadol in 100mg dosages gives me a very nice and positive mood lift, makes movement feel very pleasant (dancing to electronic music on Tramadol feels almost like a light dose of MDMA). I have also experienced with similar states induced by Codeine - typically ingesting 60mg of Codeine along with 1g of Acetaminophen which I have so far not tried to separate from Codeine since I've read on Erowid that the resulting liquid is bitter-tasting and difficult to measure, whereas the tiny green and yellow caps are found in any pharmacy with no questions asked\r\nand for very cheap.\r\nI commonly experience a significant reduction in my sex-drive when under the influence of Tramadol, specially after 4 hours into the experience. However I have managed to have sex in these experiences, although I would definitely say the relaxed state doesn't favor pumping of the blood into masculine sexual organs and therefore erections aren't very stiff and sometimes a little difficult to achieve.\r\nCombining the drug with marijuana and alcohol commonly results in a very funny mind state in which I lose inhibition and it stimulates my irreverent mind into a very creative and entertaining experience. I find it difficult though to concentrate these creative energies into a project like music-making or writing. I have a little difficulty keeping a steady pace of speech and I commonly find myself side-tracking into jokes, funny expressions or faces when trying to tell a story. I have also found that the thresholds for alcohol and marijuana to be effective while under Tramadol\r\nare considerably reduced: when I would typically smoke 3-4 bong hits to get high when sober, it only takes one puff / toke / bong hit to send me to THC-land, and its effects are 'foggy' and shorter.\r\nI cannot judge its addictive potential (if any) but I can relate to Tramadol being very different than Codeine (its opiate analog) addiction. I have experienced severe itchiness on the body, specially in the morning, from Codeine usage but never from Tramadol. The only negative effects I have ever felt have been mild lethargy the day after a typical 100mg dose and occasionally nausea / vomiting after a 100mg dose of Tramadol accompanied with marijuana and alcohol.\r\nAs a painkiller, no doubt. Tramadol is a very effective way of 'anesthetizing' dental pain, muscle aches and skeletal-related discomfort like bruises and joint aches but it's not as effective for headaches or stomach aches. In fact, I have found it to slightly make headaches stand out and forcing me to use analgesics like Aspirin or Acetaminophen.  I don't take the tramadol tablets that also contain Acetaminophen to avoid possible hepatoxicity issues.\r\nSummarizing, Tramadol is a very enjoyable and long-lasting drug for me. I usually can't experience its comedown since it makes me very drowsy towards the end, requiring me to lay down and fall into a deep, relaxing sleep state. I haven't found any effects on dreaming, save perhaps more difficulty from remembering my dreams, though this could be caused by marijuana.\n\n\n"
}