{
 "title": "Total Chaos",
 "author": "Aric",
 "citation": "   Aric. \"Total Chaos: experience with DXM (with CPM) (ID 6431)\". Erowid.org. Feb 27, 2002. erowid.org/exp/6431",
 "substance": "DXM (with CPM)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "26 tablets",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6431",
   "Male",
   " ",
   "Not Given",
   "Feb 27, 2002",
   "6796",
   " "
  ]
 ],
 "report": "<p>\nFirst off, anyone reading this should be very careful with any form of DXM, and should probably consider a sober sitter for their first time.  I have had many good experiences with DXM, but all people react differently.  Here's my accout of over 1 1/2 boxes of the triple C's.  </p><p>After restraining from eating dinner, I downed my whole box of the little red pills in one big gulp.  One of my friends, however, didn't want all his tonight.  I guess he had something to do later, who knows.  So, being pretty sure that my many experiences with DXM would allow me to handle myself, I quickly snapped up all of the extras.  Twenty-six pills in all.  For an extra little kick,'and a hopefully succsessful plan at avoiding the nuasea factor,' I laid down and set my alarm for about an hour later.</p><p>'oh my god!'-I awoke from sleep to find the world in utter confusion.  Nothing made any sense.  Flashing lights, people dancing, super-slow motion?  I failed to realize that we often invite friends over while on DXM, and the many light accessories: strobe lights, disco ball, glow sticks and black lights; were all common distractions.  But now it was different.  My brain was flooded with all this info, all at once.  Making sense of it all was impossible.  My first acid-like melting visuals occured at this time.  The soft carpet seemed to roll or flow from one side of the room to the other.  All this time I'm laying face first on the floor.  I'm not in pain, or feeling sick, just struggling to take it all in.  </p><p>Walking becomes possible after the initial shock wears off,and the real fun begins. The visuals are still there, and tracers are fantastic.  Talking is a trip!  I would say stuff, but it wasn't at all intelligeble.  Words seem to flow together, mesh into one big long word, in some alien language.  Amazingly, my friends were able to understand me, and much fun was had.  The most memorable moment of the evening was the making fun of those affected by the lsd.  You know, when the music is up and there is so much going on, you turn to the chemically enhanced...and continue to converse with out speaking a word.  Moving your mouth, but no sound comes out.  This will never be forgotten, for we had people geeking out all night just by looking at them.</p><p>After hours of chaos, maybe 7 or 8 of them, I started coming down.  Standing outside in the morning light, with that warm and fuzzy mind numbing after effect is peaceful.  The chaos is over.  Time to relax, and go to sleep.  But before I can get to my warm and cozy bed, I must inhale a cig or 2.  With that warm feeling, the grit tastes almost heavenly.  Definately the best cigarette I have ever smoked.  </p><p>To try and desrcibe my rants during this whole ordeal is impossible, for I cannot remember most of it.  But, I am told, many were in awe of the sheer knowledge I spit out for almost 2 hours straight.  I have been known to go off on rants before, but all involved said they now saw me much differently than before.</p><p>I was somewhat suprised to find so many bad reports on the experiance of Coricidan users online, until I introduced more of my friends to the drug.  It is to my knowledge a very picky drug, affecting almost everyone differently, and, to some, very adversly. If you have never used it before, please heed my warning and find a sitter.  Enjoy the choas, I know that I sure as hell did!</p>"
}
