{
 "title": "Hillbilly Hash",
 "author": "Jlaff",
 "citation": "   Jlaff. \"Hillbilly Hash: experience with Cannabis (ID 64322)\". Erowid.org. Sep 25, 2009. erowid.org/exp/64322",
 "substance": "Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64322",
   "Male",
   " ",
   "Not Given",
   "Sep 25, 2009",
   "Views: 6477",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There was a time when I enjoyed the simple luxury of growing my own 'very special' indoor garden.  Like many people who have such an indoor garden, I had lots and lots of excess leaves which I was constantly pruning off as I continuously topped the plants (to conserve space and increase yield) and trimmed off big top leaves so that light could reach branches at the bottoms of the plants.</p><p>For a long while, I smoked the leaves (using a bong) and enjoyed the freedom of toking up without having to pay for it.  This was great but sometimes I wanted to puff in places where having a bong was impractical so I looked for a way to process the leaves into something more potent and more palatable.  After trying a few different things with varying results, I got the bright idea to put the leaves in a juicer to extract what I could.  I have a very good juice machine that can extract juice from about anything.</p><p>I fed several handfuls of fresh leaves into the machine which yielded a very small amount (maybe 1/2 fluid oz) of nearly black liquid that smelled very similar to grass clippings (the type that stick to the bottom of your mower).  The liquid was very dark green and permanently stained my white juicer.  I added enough leaf pulp (from the strainer of the juice extractor) to make a juicy paste, then formed the paste into a 'cake' or 'bar' on some wax paper.  Over a few days, the little bar dried and shrunk somewhat.  It still smelled like grass clippings.  The resulting bar of 'Hillbilly Hash' was easy to smoke in the same method as hash and produced an equivalent high to smoking the same amount of decent buds.  When smoking Hillbilly Hash, I can still taste the grass clipping flavor but it is actually pretty pleasant and is far and away better that smoking plain leaves.  That's my recipe and I'm sticking to it!</p>"
}
