{
 "title": "Xanaxish?",
 "author": "Omalley",
 "citation": "   Omalley. \"Xanaxish?: experience with Amphetamines (Adderall) & Modafinil (ID 64355)\". Erowid.org. Jul 12, 2007. erowid.org/exp/64355",
 "substance": "Amphetamines (Adderall) & Modafinil",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   " ",
   "200 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64355",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2007",
   "Views: 16238",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been taking adderall for about 2 months for depression and it of course like most people say 'instantly cured my depression' and gave me loads of energy. I was suppose to take 20mg twice daily but I have an extreme tolerance for stimulants and 20mg did nothing so I went as high as 120mg once daily. This had the usual pleasent 'feel the power' effects speed is suppose to have. I also don't like to overdo it with drugs so I had to stop taking it before I got to that psychotic state of mind and feeling worse than before. So I stopped for a little while and when I talked to my Shrink in my next appointment I told him that the 20mg twice daily wasn't doing anything anymore because of my high tolerance, so he immediatley went to his cabinet and gave me two sample packs of provigil (modafinil).</p><p>Today I decided to see what Provigil and Adderall together could do and what it does is very nice for me, but I know this too will have to stop because its unhealthy and I care about my health. I decided to take 5 20mg adderrall and 1 200mg Provigil, about 1 hour later I begin to feel unusually mellow and sleepy and time seems to be going by slowly like I had just taken some Xanax bars or Smoked some nice Dank, which really comes as a shock to me because I thought 2 Stimulants would equal something very speedy, but instead I'm feeling drowsy and Xanaxish, it's probably just how the two affect me though. Anyways its a very nice high, but thats just me, I strive to not to overdo it and become helplessly addicted and depressed. Anyway's I feel like napping right now.</p>"
}
