{
 "title": "Motor Skill Problems",
 "author": "Former CCC user",
 "citation": "   Former CCC user. \"Motor Skill Problems: experience with DXM (with CPM) (ID 64351)\". Erowid.org. Feb 25, 2008. erowid.org/exp/64351",
 "substance": "DXM (with CPM)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   " ",
   "40 mg",
   "oral",
   "Chlorpheniramine Maleate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64351",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2008",
   "Views: 6739",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: This report includes a second-hand mention of heart injury attributed to Coricidin, which was submitted with no verifiable details, no contact information, and no way to confirm it. Erowid is choosing to publish this report to invite public comment and to allow anyone who knows about this event to submit details which can be verified. Email sage at erowid.org.] <br>I experimented with Coricidin as a teenager under the recommendation of a friend of mine. All I had ever done was habitually smoke pot and upon trying Coricidin approx. 4-6 pills I felt good eventually building an immunity. Having increase the dosage with each use I eventually got up 15 pills for the effects and by then I had grown sick of this disgusting high so I quit taking them. My friend on the other hand wasnt as apt to being sober as I was and continued taking them, quickly building an immunity till he had to take at least 30+ to feel the effects. <br>He suffered severe heart damage and now requires medication to correct the effects of the damage. Now at six years later I was stupid enough to try it again due to no available pot or pills and much to my dismay i took 10 pills and felt like I was a tweeker my jaw muscules went haywire flexing erradically and I was senseless for about 6 hours. Finally it wore off and I went to sleep then for the following month and a half I felt retarted with slower motor skills inability to think straight or for a long period of time and when I smoked weed these effect seemed to amplify finally after about 35 - 40 days later I was back to normal. This is a caution to any one thinking that coricidin is worth taking for a trip....it most sertianly is not.... No trip is worth your life or your health\n\n\n"
}
