{
 "title": "Empathy for Frankenstein's Monster",
 "author": "OCD",
 "citation": "   OCD. \"Empathy for Frankenstein's Monster: experience with Amanitas - A. muscaria & Green Fairy Mixture (Alcohol, Wormwood, Kava, Lagochilus inebrians & Cannabis) (ID 64356)\". Erowid.org. Nov 9, 2007. erowid.org/exp/64356",
 "substance": "Amanitas - A. muscaria & Green Fairy Mixture (Alcohol, Wormwood, Kava, Lagochilus inebrians & Cannabis)",
 "bodyweight": "325 lb",
 "header": [
  [
   "DOSE:",
   "0.4 g",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)",
   " ",
   "0.2 g",
   "oral",
   "Wormwood",
   "(extract - 10x)",
   " ",
   "0.1 g",
   "smoked",
   "Wormwood",
   "(extract - 10x)",
   " ",
   "2 capsls",
   "oral",
   "Kava",
   "(extract)",
   " ",
   "1 cig.",
   "smoked",
   "Lagochilus inebrians",
   "(plant material)",
   " ",
   "0.5 oz",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)",
   " ",
   "0.5 oz",
   "oral",
   "Various",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "1993",
   "64356",
   "Male",
   " ",
   "Not Given",
   "Nov 9, 2007",
   "17878",
   " "
  ]
 ],
 "report": "<p>'VERY green fairy?'</p><p>(an ethyl alcohol based concentrated tincture)</p><p>Uses, sleep aid, local anesthetic, and morning to mid-day recreational narcotic.</p><p>WHAT'S IN IT???</p><p>Wormwood 10x resin (3 grams)</p><p>Kavalactone 84% (10 grams paste extract)</p><p>Lagochilus inebrians (intoxicating mint, AKA turkistan mint)</p><p>Tetrahydracannabinol (strains vary, I used 3.7 grams of very potent buds that packed quite a physical body stone. More (or less) certainly could have been an order, but I wished to focus on the offerings from the other constituents. I wanted a good balance and I think I've achieved that. More trials to come to test for additional or replacement synergies and potentiators. So far so good, I'm fortunate to have pursued this and discovered what I think could have a focused range of medicinal value to enlightened social circles.</p><p>ONSET: 1-5 seconds</p><p>PEEK: Varies with strain of MJ used, generally 30-45 minutes</p><p>DURATION: Effects gradually and gently let me come down without any ill feelings, or anxiety.</p><p>I'll start peeking as soon as I swallow the tincture, it comes on in an instant, and could be compared to being slightly drunk. Lightweights and non-drinkers will notice this considerably more than after work or regular drinkers. Also, effects similar in (partial) ways to opium. </p><p>This is (probably) not going to be your new favorite thing to get 'messed up' on as the effects are not as strong as most of the rec. drugs out there. What it is, however, seems to be up to the user, whatever his/her needs may be.  Certainly worth exploration IMHO. For me it's a highly entertaining way to enhance a boring afternoon, and my seemingly incurable insomnia seemed to be curbed very effectively. </p><p>TRIP REPORT</p><p>Mushrooms used are amanitas muscaria, washington grade A++ (prime harvest time-all caps)</p><p>First, my test dosings:</p><p>.4 grams of amanitas muscaria, eaten. </p><p>.2 grams wormwood 10x (resin) eaten</p><p>.1 grams wormwood 10x (resin) smoked </p><p>2 capsules full of kavalactone 84% paste extract (about 7x suggested dose)</p><p>one (regular sized) lagochilus inebrians cigarette</p><p>didn't need to test the MJ, but have not yet smoked any</p><p>To my surprise, I was very aware that I had taken something. My first time with amanitas so I had no basis for comparison, but I rarely notice any changes from test dosing. MJ time. Now theres something.</p><p>After a mind opening (very clear) 'mini-trip' while sitting outside watching the trees in the wind, I found myself pleasantly tired and able to rest my thoughts (rare for me). I soon found a couch and was out for three to five hours in a deep sleep. I don't think any one of these substances by themselves were capable of this, though I have no real basis to put amanitas in that category, just seems illogical that others aren't 'passing out' from unheard of miniscule amounts of shrooms, and I can handle my kavalactone just fine, wasn't that (alone) for sure.</p><p>Shortly after I awoke, I decided I was ready. I ate a half ounce in streched intervals spanning several hours. Dried tangerines work wonders for the bad taste btw. I 'slurped' approximately a half fluid ounce of the VGF tincture, and very quickly started peeking on that. (*synergy smiles*) Any physical discomfort was either neutralized by the V.G.F. or it just didn't bother me. I rarely get 'sick' on anything within reason.</p><p>Things were brighter, more interesting. Almost fascinating-I laughed my butt off at very trivial meaningless things. It was really very entertaining to me, and probably some others as well. It felt good to laugh like that, even if I started laughing because the thing I was just laughing at wasn't funny enough to warrant such hysteria. Hahahaha.</p><p>My history with visuals is nearly non-existent. My brain chemistry must be unique. I've taken relatively large doses of high quality acid, stuff my friends were frying balls on with little to no effects. Same story with psilocybins for some reason, although (a-typically) I noticed more visual effects with psilocybin than acid. That said, here is what I saw:</p><p>These visions occurred in a split second. Though I seemed to be able to process them in my mind, and fully understand with great ease what they were. I'm talking to my buddy when suddenly, I see in great detail, a perfect 'fireplace, without the place'....um...imagine a fireplace with a peaceful flame. Now just imagine the flame itself. It seemed to be fueled [or contained] by unseen elements, and all of that I was able to discern in an instant. Very, very strange. This is unlike amything I've tried in this respect. The 'Tour De France' why??? I have no clue. I did manage to get 'something' from my experience, though anyone could find a suitable way to rationalize their experience, but I found meaning in the 3rd vision.</p><p>An empathetic P.O.V. of a very vivid terrifying loveless scene of Frankenstein's monster being cruely pursued with intent on his life, a life that he did not want nor could he change. I saw a violent mob, fire, crude weapons, and a most shocking glaze of hatred in their eyes. This vision was incredibly detailed and left nothing to 'wonder' about what just happened.</p><p>A time loop was experienced briefly: my buddy asked me a question, I was about to answer confidently, when he asked it again. I was about to answer confidently, when he asked it again. I was about to answer confidently, when he asked it again. I was about to...(see where this is going?) Glad this part only lasted a seemingly short time and did not re-occur. Well not exactly.</p><p>Physical displacement was evident to my field of perception. My buddy was talking to me, when he'd suddenly 'jump' about 1-2feet to the left (this happened three times, always to the left). I knew immediately that he could not have moved that fast or fluently, and when I asked, he confirmed my suspicions by sayin' 'Wwhaaaat duuuuude?'</p><p>Overall a shining experience, due in big part to being around my family and friends on my B-day, and just having a great weekend. And though I probably got the wrong message, if there was one to 'get' in the first place, it is one that can be applied to my life and hopefully for the betterment of myself and all included.</p><p>Aftereffects. In the morning I felt great and was excited as to what transpired, and that I could remember it! I was not hungry or thirsty until about 30 minutes after being up, then I felt like crap. It could have been my blood/sugar or any combination of things. Too many variables that I did not consider in regards to this. Once I ate, and drank lots of water I started feeling 'normal' (or close to normal) again.</p><p>The sleepy effects associated with amanitas muscaria (for me) came on without warning, and I was very quickly out cold seconds after I felt drowsy. Lucky that I was at home. Perhaps I missed a full blown trip. Perhaps I was supposed to. Although mine was a good trip, I don't plan to revisit, I feel satisfied with my experience and will let it rest as long as it's content with doing so.</p>"
}
