{
 "title": "Lego Bricks and Loss of Existence",
 "author": "Artelis",
 "citation": "   Artelis. \"Lego Bricks and Loss of Existence: experience with Salvia divinorum (20x extract) (ID 64365)\". Erowid.org. Apr 6, 2010. erowid.org/exp/64365",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64365",
   "Male",
   " ",
   "Not Given",
   "Apr 6, 2010",
   "Views: 3707",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first time with salvia was last night. I used .2 grams of 20x and a bong/torch lighter. The setting was in friend A's basement. There were two other friends there as well, friend B and C. The initial plan was to do it all at different times, mostly because we wanted to see each other and have sitters.</p><p>Friend A was going to take the first hit, so he used the torch lighter to fill up the bong, but when he went to inhale all of it he started coughing hard, so I quickly covered the top so the smoke wouldn't all come out. Friend C ran upstairs to grab some water, while I thought it would be a good idea to take all that smoke for him. As I was holding it, friend A and B were counting to twenty out loud. At about eleven, I let it all out because the room started going black. I remember saying 'are you serious?' sitting back, and putting the bong on the ground.</p><p>This is where I started tripping, but looking back on it, it now just feels like a strange and distant dream. Time suddenly stood still, and I was trapped inside a single frame of existence. This singing frame was then inside of a flip-book-like existence of bricks. As in, everything around me, including my body, was built entirely from bricks, or large pixels, or something like that. And the flip-book-like feeling was the fact that these bricks kept being fanned to the left, and then to the right, but in an arc motion, like if you set a book flat on a table and let the pages flip from cover to cover. I could actually feel the bricks ripping across my body, like they were sticky. I got extremely nervous and felt like I would be trapped inside of this flip-book existence forever, so I started jumping (as my friends describe, when I tried to jump into the ceiling). I knew I was reaching the edge of the book, so I started thrashing forward, but something was holding me back (my friends holding me down in a rocking chair because I was screaming 'I have to get out of here!')</p><p>Then I started to come back to reality. My friends were telling me it was ok, that I just had a bad trip. I could still feel the ripping of the brick pages in my legs, and I thought that if I left the room, than the book couldn't get me. So I pushed them all out of the way and ran for the edge of the room. I began pacing in the living room portion of his basement while someone gave me a glass of water. I sat down on a futon and began thinking about what had just happened. At this point I realized that nothing existed and that everything was a lie. There was no life. My past had been a dream, and my future would never come. I was arguing with myself. This didn't make any sense to me, and I knew it seemed insane, but I couldn't possibly imagine how anything outside of now could be possible. I started sweating profusely and I thought I was about to fall back into the flip book, so I stood up and started pacing.</p><p>There was water all over my body (a normal feeling, I know, but I really thought it was there). My friends kept telling me I was dry, but I didn't believe them. I just kept pacing, and friend A made the mistake of saying 'Well, you'll be like this forever. See you in heaven.' I just freaked out and told him not to say things like that. Friend B told me it was fine and I would feel better in a few minutes. The pulling was such an unbearable feeling. I was jumping around like an idiot trying to get it to go away. At one point I wanted to cry, and at another point I wanted to call my mom. I knew that my mom had to be a connection to reality and existence. Finally, the feeling started subsiding, so we decided to go upstairs to chill for awhile. I started to relax as I told them all my trip and how I had felt hopeless and that it didn't make sense for life to exist. I felt extremely existential.</p><p>Friend C than drove me home so I could go to bed. She walked me to my room to make sure I would be all right. She waited around awhile to make sure I felt comfortable with the idea of going to sleep. Once she left I was still feeling fine. There were still slight feelings of pulling, but they were entirely bearable compared to earlier in the night. The problem became when I started nodding off. I was afraid that either A) I would fall back into the flip book, or B) I would get up and start doing things in the middle of the night without realizing it. I ended up putting on all of my clothes in case I wandered outside. It took nearly five times of nearly nodding off and about two hours to fall asleep. But now that it is morning, I feel much better, and I'm glad I had my trip.</p>"
}
