{
 "title": "This was Supposed to be a Light Dose",
 "author": "Mickey",
 "citation": "   Mickey. \"This was Supposed to be a Light Dose: experience with 2C-T-7 (ID 6437)\". Erowid.org. Apr 24, 2001. erowid.org/exp/6437",
 "substance": "2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6437",
   "Male",
   " ",
   "Not Given",
   "Apr 24, 2001",
   "13721",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n8am Woke up-Drank 2 glasses Cranberry juice with 2 Centrum Mental clarity. Nothing to eat since 11pm last night</p><p>10am Drank 1/2 liter Water - Mesured out 100mg 2ct7 and divided into 8 even parts.</p><p>12pm 12-17mg Oral 2ct7  - 1 glass Cranberry</p><p>12:15pm 1 glass water</p><p>12:45 No noticable effects</p><p>1:15 Silght Visual and Audial Distortion (like 1/2 hit lsd) Slight Stomach discomfort</p><p>1:30 Strong visuals 5+hits lsd  - Not as sick anymore</p><p>1:45 Vomit for 5 minutes</p><p>2:15 - 6pm Visuals so strong I cannot see what is acutally infront of me. I know that my wife is there but when I look outside it appears like the visuals I have in the dark when on acid. I cannot hold thoughts for more then a few seconds. I cannot comprehend letters. Everytime I look at my wife and my dog I cry. Nothing matters except them. I feel as though I have taken an ounce of mushrooms. I gag every few minutes. Jesus Christ, 1mg should have been enough. This is in no way, shape, or form, a light dose. I feel that if I have taken more then this that I would have died.</p><p>7pm everything is still moving like 5 hits of acid, I am calmer, but all I can do is apologise to my wife. I party maybe once every 5 weeks or so (somtimes not for 3-4 months at a time), but I have conviced myself that I have a drug problem. My wife explains to me that everything is going to be fine, I do not have a problem, its just that this drug blew my mind and fucked with my emotions. It takes me several hours to realize that she is right, but until then I have this fear that I fucked up and her and my dog would be taken away any second.</p><p>9pm light visuals, much calmer then ever an hour ago. We sit down to watch the Sopranos.</p><p>10pm - I try to sleep. My head feel like I have be hit with a hammer (kinda like when you hit your head on an open cabinet) I take 2 pain killers, ever an hour later the pain does not subside. </p><p>1am After not being able to sleep, I get up and take a shower. Where my kidneys are, is sore.</p><p>2am I watch TV and have a chicken sandwich.</p><p>3am Still light visuals - Very annoying at this point, MAKE IT STOP AND LET ME SLEEP. +15 hours</p><p>4:30am I lay down in bed to try and sleep. I lay there for an hour before I finally do, feeling pain like I haven't feel like since the day after my last 2 week heroin binge.</p><p>8:00pm +32 hours Still disorented, still tracers. Maybe tomorrow morning everything will be normal.</p><p> I'll stick to shrooms not that the rainy season is comming. 2CT7 is too much. Had I know that was what was going to happen a such a light dose I would have never taken it. I cannot believe that someone would snort 3-4 times what I took orally..</p>"
}
