{
 "title": "Losing the Magic, Gaining the Afterglow",
 "author": "Cardinal Flip",
 "citation": "   Cardinal Flip. \"Losing the Magic, Gaining the Afterglow: experience with MDMA (Ecstasy) (ID 64386)\". Erowid.org. Sep 22, 2009. erowid.org/exp/64386",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64386",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 22, 2009",
   "Views: 7775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have used ecstasy for nearly 5 years now. Sometimes in bursts with as many as 40 tablets a month or sometimes with 6-8 months in between individual rolls. I would just like to comment now on the 'losing the magic' as I feel I have a different experience than most people.\r\nI noticed around my 8th time that ecstasy was not the same magical drug that it was for me those first 7 times, however I still found the effects quite pleasant and continued to take it repeatedly. Often on the tail end of ecstasy binges I would find that it would take at least 4 tablets to get me 'rolling' but given a month off my tolerance would drop down to a more acceptable level.\r\nAlso when I first started using the depression after I would use would be intense, sometimes lasting weeks. However now, despite the fact that even with pure MDMA, with a booster, I only roll for at most 2 hours before I am more or less completely off of it, I have next day depression, or suicidal tuesday. If anything now I have more of an afterglow each time I use MDMA, with heightened sensory, especially olfactory, for about a week after, as well as mood elevation.\r\nThough by no means does ecstasy do what it used to do for me, I still find myself able to enjoy these shorter, less intense rolls, though I may not get the push anymore, I still get a mood lift and increased sense of empathy. I have also found that my own usually diminished effects can be increased by being around others who have not lost the magic or are rolling for the first time. The positive energy from them feeds my own roll.\r\nIn conclusion, Just because I have 'lost the magic' of ecstasy doesn't mean that the drug no longer serves a purpose.\n\n\n"
}
