{
 "title": "This is Going to Feel REEAAL Uncomfortable",
 "author": "steve",
 "citation": "   steve. \"This is Going to Feel REEAAL Uncomfortable: experience with Datura inoxia (ID 6441)\". Erowid.org. Apr 24, 2001. erowid.org/exp/6441",
 "substance": "Datura inoxia",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "20 seeds",
   "oral",
   "Datura",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 6441",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 24, 2001",
   "Views: 33297",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLast october, the day before halloween actually, 2000 is when I made the biggest mistake in my life.  You see, I wanted to get high on some sort of halucinogen and so went with the strongest one I could come up with.  I managed to get ahold of some datura inoxia seeds online, which is full of atropine.</p><p>Not wanting to kill myself or anything I decided to only eat 20 of the seeds, now this was at about 11:00 AM.  I proceeded to choke down the god-awful tasting things and went to watch some television on the big screen in our living room.  At about 12:00 I got slightly dizzy, just like you would feel after spinning in circles for about 5 seconds.  Then I became incredibly tired and had to urinate like you wouldnt believe.  </p><p>I went to the toilet and try as I might, I couldnt manage to pee.  I think within the next fifteen minutes I got out of bed about 10 times to head to the bathroom in another useless attempt  at relieving myself.  I finally just gave up and decided to go to sleep.</p><p>I went unconcious at about 12:30.  By unconcious i dont mean a coma or sleeping, I mean I slipped into sort of a sub concious state, where everything still worked, but I didnt know I was there.  It felt like one big dream.  I dreamt about various things like people repeating my name and saying 'If you don't hold still I'll have to poke you over and over'.  And people shoving me to the floor.  I remember dreaming about tripping and hitting my chin on the corner of the clothes dryer.  </p><p>At about 5:00 PM I woke up completely rested and was ready to go do something, but was completely annoyed when I found I couldnt move my arms or legs.  It was like they weighed a ton.  Then I heard a guy repeating my name saying'Steve, Steve you need to calm down. Do you know where you are?'.  </p><p>'Yes', I replied 'I'm in bed and I want to get up'.  </p><p>'No your not Steve.'</p><p>'Ya right'</p><p>'You're in the hostpital'</p><p>Oh shit.  Something was terribly wrong.  I fell asleep and now I'm in the hospital, this isnt right.  I looked around and found my self surrounded by nurses and doctors.  'This is going to feel REEAAAL uncomfortable Steve', and in went the catheter.</p><p>Ok, this is taking too long so lets wrap it up.  I stayed in the hospital until about 4:00 PM the next day, almost 24 hours in ICU.  I had to have about 3 IV's.  Plus a couple more because I kept moving around when they put them in, 'If you don't hold still I'll have to poke you over and over', ya, that really happened.  And you can bet that the scar on my chin came from when I fell on the dryer.  Being shoved to the floor happened when I was beating the living daylights out of the police and paramedics who were trying their hardest to restrain me.  I had to have a catheter, and drink a pint of charcoal (YUM?).  I ended up wetting myself.  I called the nurses and doctors various choice words.  Overall I ended up really messing up my health and pissing off a lot of people, I am very very lucky I didnt kill myself when I was in that subconcious state.</p><p>This is not what happens to most people who try to trip on atropine.  It isnt this bad.  But of all of the people who have taken atropine and survived, I have one of the worst experiences.</p><p>So, I say, do not ever abuse atropine for it is 100% certain you WILL regret it, just look at my $10,000 hospital bill.</p>"
}
