{
 "title": "One Large Cappuccino With Anxiety, Please",
 "author": "wingz99",
 "citation": "   wingz99. \"One Large Cappuccino With Anxiety, Please: experience with Caffeine (ID 64480)\". Erowid.org. Apr 12, 2010. erowid.org/exp/64480",
 "substance": "Caffeine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64480",
   "Male",
   " ",
   "Not Given",
   "Apr 12, 2010",
   "Views: 6696",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>When I entered middle school, I had a tough time adjusting to the early wake-up times, so I drank coffee every morning. It was never a problem. I loved the taste and it always woke me up a bit. After a year, though, I got used to waking up early and decided to stop drinking coffee since I figured it probably wasn't very good for a growing kid.</p><p>I did not drink coffee again until my sophomore year in high school.</p><p>When I started my sophomore year, I joined the rowing team. The fall season went fine - we had practices in the afternoon that ended soon enough for me to get home and do homework while still being able to get a good amount of sleep. Unfortunately, the spring season was worse.</p><p>In the spring, the district decided to make the high school begin one hour later every morning - meaning crew practice would now begin at 6 am every morning. Fuuuuuuck. So, naturally, I started drinking coffee again, but only after practice - right before school started.</p><p>At first it didn't seem to be causing a problem, although I did notice that after one cappuccino I would feel really wired unlike back in middle school. Of course, I thought nothing of it, figuring that if I can smoke weed and get drunk, caffeine shouldn't be a problem.</p><p>However, one day, after a particularly grueling day of practice, I decided to go with a large cappuccino instead of a small. Again, everything seemed fine at first - until a few hours later. In the middle of my global history class (fourth period), I started to feel funny. Suddenly it occurred to me that I had been acting strange all day. I had been talking a lot more than normal (not to say I'm usually quiet, I'm just not overly talkative) and even twitching involuntarily. Suddenly I had this feeling that all the blood in my body was flowing inwards - like I was about to implode. While my teacher droned away, I started to have a panic attack.</p><p>I was overwhelmed by this completely unreasonable feeling of extreme anxiety, agitation, and energy. It was as if all the caffeine from that morning suddenly exploded in my brain. I couldn't hear at all, I felt completely cold despite the fact that I was sweating like crazy, and I couldn't work up the nerve to speak either. I was terrified that if I told someone what was happening I would be mocked. After about twenty minutes the feeling passed, but I felt a little shellshocked for the rest of the day.</p><p>Naturally, I've decided to never drink coffee unless I really need it (and even then only in small amounts). While I do not in any way discourage drinking coffee, I would like to mention that although most people drink coffee regularly, some people can have very bad reactions to the caffeine. Just be careful.</p>"
}
