{
 "title": "A Shamanic Experience",
 "author": "PieOPah777",
 "citation": "   PieOPah777. \"A Shamanic Experience: experience with Salvia divinorum (Tinture & Extract) & Cannabis (ID 64498)\". Erowid.org. Oct 9, 2007. erowid.org/exp/64498",
 "substance": "Salvia divinorum (Tinture & Extract) & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6 drops",
   "sublingual",
   "Salvia divinorum",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64498",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 9, 2007",
   "Views: 9851",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n_______ and I started off with a 'Major' dose of the Salvia Divinorum tincture distributed, which is 6 droplets of Sage Goddess Emerald Essence. We had two sitters, one for each of us. They would be trying it after us. As we held the tincture in our mouths (which is scalding) _______ seemed to flow right into the process. My psyche battled itself, which is interesting considering I am the one with experience using psychedelics over her. Fear set in and I became vulnerable. But, that's what I wanted. I wanted to unveil the deepest terrors in my mind, expose them and (hopefully) fix them. When the Salvia started taking hold, reality did not warp as I expected. Consciousness did. Because of that, everything happening in my environment affected the way my consciousness processed it. </p><p>I had to lay down as panic set in. My heart was racing. One little sound made by _______ or _______ (our sitters) crackled across the room in solidified resonance. The room crushed in, like the room itself was squeezing me out of it. I tried to fight it at first, because the only thing I could think of was missing _______, _______, and _______. My environment was collapsing in on itself. I felt like I was sinking into the couch, sinking so deep into consciousness I was scared I would never return. I laid on the floor and asked _______ to lay down with me. I thought I was going to die. She curled up next to me and rubbed my face, telling me everything was going to be okay. She told me to let go, to give in. I closed my eyes and let the experience take me. I saw images from House on the Rock. I saw images of giant hershy-kiss looking turbines churning substances I couldn't understand. The experience then 'peaked', I became calm and woke up, feeling very refreshed. I was glad to be back. I was glad to see _______ and _______. I wanted to stay in my world. I felt like I had woken up from a nightmare.</p><p>The effects lingered. After _______ and _______ took the tincture, we all smoked a little Salvanorin A Enhanced Leaf and some cannabis, and the experience continued on a lighter note. We all laughed and listened to music together. I drew a picture of a leaf/snail goddess stuck in my mind's eye. I went to bed with _______ and as soon as I laid down to close my eyes, the visionary experience I had been anticipating and yearning for finally began. But, it wasn't terrifying. My panic from the tincture before set-up my consciousness for this experience, thrust my being into the sensibilities of unfolding reality. I saw globules of faces swarming and morphing in and out of a sludgy liquid essence. The faces were so real and tangible, and looked at me with wayward eyes. The hum of the fan above reminded me of being on the tincture before: the fan, the air-conditioning, the music, every noise flowed into one system, one machine churning life essence, churning reality into an intricate whole. </p><p>I was reminded further of my experiences on LSD, where reality seemed to be based on the idea of imprints. Visually, this was being revealed to me. Every second of every person's memory becomes imprinted onto one's retinas, onto the fabric of reality. Every memory! That means reality is nothing but stacks and stacks of memory, layers and layers of imprints. What Salvia did, and why my psyche panicked, was that it thrust upon me a MAJOR imprint, a very powerful and potent one. The same thing happens to someone with Post-Traumatic Stress Disorder, which I was diagnosed with a couple of years back. This became significant to me, because I learned how the PTSD affected my consciousness, affected my ability to disintegrate my relationships through fear and anxiety.</p><p>I saw as these stacks, these layers of imprints in reality flowed in to cords. Long, flowing cords (chords) that seemed to look more like tentacles warping and tangling in and out of each other. When tentacles make contact, it it is two disparate imprints interacting at those particular points. That is the nature of relationships of all kinds. Sometimes the imprint on one part of a tentacle (which is one form of consciousness) interacts with an imprint on another part of a separate tentacle and does or does not mesh well. Experiences, imprints like Salvia or PTSD, can send a sort of shockwave through the tentacle, a reverberation which affects all of the other imprints. This shockwave or reverberation may not mix well with the other imprints and may cause discourse among interactions with other tentacles. Sometimes, though, sometimes the imprints on the tentacles during the interaction are synchronized just right, that a positive realtionship can be formed. </p><p>I felt like this was an explanation of my relationship with _______. Our imprints matched at our time of meeting, and the tentacles of our consciousness have decided to stay interacting, intermingling, meshed with each other because there are enough imprints to sychronize that match. It is about a communion of unity. It was revealed that my negative imprints are still reverberating through my psyche and trying to deconstruct the interaction taking place between _______ and I. Through recognizing this, I felt I had a better grasp on how to make this particular relationship last.</p><p>The experience grew, and my psyche pulled back from my own tentacle and saw the whole world, a network of tentacles all flowing and mingling like underwater plants in an ocean of cosmic mesh. The very ends of some tentacles were reaching a globe above it all, a globe of pure substance that all tentacles were stretching toward but sometimes not able. That was the point of all the tentacles, to reach the perfect roof of roundness above us: whether it be classified into terms of God, Goddess, Spirit, whatever. It cannot really be classified, except through the concept of unification. Because, in essence, we are all 'it', we are all tentacles reaching for the great unifying body that is One Thing. This was the great thing I was shown. </p><p>The visions carried on and sometimes became terrifying but overall satisfactory. They lasted all ngiht. At one point I almost panicked again because I thought my consciousness would never return, that maybe I was stuck in this loop of psychedelia and everything I experienced in the last few hours was false and I would wake up on the couch with _______ and _______ still watching me. But, I gave in and said 'Fuck it'. The event carried me forth into more visions, mostly morphing forms I cannot explain. After finally getting to sleep, I woke in the morning calm and happy, refreshed. I feel like I underwent some heavy psychotherapy, which is what I was aiming for. I am ready to make the relationships in my life better, especially in always striving to be a better father to my son. It's not that I didn't know all of this before. It just became re-affirmed, imprinted heavily on my psyche so that the negative influences can be drowned out and eventually pushed away.</p>"
}
