{
 "title": "Why I'm Still Alive",
 "author": "Thanos9760",
 "citation": "   Thanos9760. \"Why I'm Still Alive: experience with H.B. Woodrose (ID 64575)\". Erowid.org. Sep 3, 2008. erowid.org/exp/64575",
 "substance": "H.B. Woodrose",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64575",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 3, 2008",
   "Views: 3009",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wrote most of this report as it happened. Alot of it had to do with the Star Wars game I was playing at the time. I will pare that part away for usability.</p><p>T-0. Seeds arrive. I scrape the hulls of 4 seeds and eat them, chewing well. I scrape due to reports of nausea causing compounds in the hulls. I believe this false, I think they're in the seeds themselves, but why take the chance? I only eat 4 seeds, because although I consider myself a high ranking tripper and veteran of the psychic wars, most of my experience is decades behind me. I no longer drink (alcoholic), don't smoke pot, (paranoia, and drug tests at work). Basically a LSA experience only.</p><p>My mood is good, the setting is good. I am alone, and my wife, who does not get high anymore, has reluctantly agreed to my eating these seeds. I wish we could do this together, and hope she doesn't give me a bad trip. There are no stupid people around, except for me. HAH! All is good. I am now anxiously awaiting another peak into the doorway of innerspace yet again. Who and what will I find there? What will I learn, and how will I handle the powerful Juju now coursing it's way to my synapses? Will I be OK, or will the potent psychedelic leave me babbling incoherently, wandering the planes of existence outside our own forevermore? </p><p>11:20 Nothing yet. Feeling lightheaded, but surmise this a placebo effect and result of expectation. T.V. annoying. Turning it off.</p><p>11:30 Strangely lightheaded now. Minor difficulty writing, not bad. Stomach churning? Can't tell. I am wary. Pupils now dialated. Vaguely LSD-like feeling down my spine. Light from the blinds irritating. Shit! It's on, now. My puppy (not a hallucination) is chewing on an electrical cord. I yell at him, and then feel very bad. I tell him I love him and it's OK. I somehow feel that an electrocuted puppy just now could possibly be detrimental to my trip.</p><p>Absolutely now doubt now. Penmanship bad. Can't remember how to spell, concentration, no bueno. Stomach good. Head good. Plan proceeding along expected parameters. I have been playing a very colorful Star Wars game, and suddenly realize that if I don't dispatch this upstart rebel force soon, I will be front and center on the command bridge of an Imperial Star Destroyer, TRIPPING BALLS. Somehow I find that amusing, and grin. Pressure in head growing. Dog sleeping at my feet, I feel much empathy for this creature who trusts and depends on me. Trying to finish the game, but I have climbed aboard the trippin' train, and it has left the station with me aboard. I cannot escape - I must embrace the forces upon me.</p><p>12:30 I think I am feeling the full effects of the seeds (turns out, NOT). Stomach not so good. Need to lay down.</p><p>3PM awoke (was I sleeping?) from powerful visions and wild psychedelia. Breakthrough revelation - I must take care of my wife, that's why I'm still alive (writers note, I was a junkie on the streets for many years, and have wondered why I am still alive, consider it a miracle). I must be a better husband. Stop listening to negative headbanging music. Get up and do what Pam wants to do more often, don't worry about yourself so much. CEVs more powerful than expected. Truth learned: the dog's life is important and tied now to ours. Nothing more to learn except salvia is like a foriegn invader, not a good psychedlic.</p><p>4Pm eyes wet - must have been crying, reason unknown. 4 seeds very powerful. Now wishing wife would come home to help me - holy shit stomach bad now.</p><p>That is the end of my real time journal, and I apologize for the strange writing, but, hey, I was tripping. After that I wanted to call my wife to tell her to come home (she was in a meeting with some company big shots) but high as I was, I had enough sense to not interupt that meeting to tell her I was bugging out. She came home, gave me 10 mg of valium, which helped tremendously, and sat with me for the rest of the night. She was very kind, and made the trip OK. It easily could have gone the other way, had she been a bitch, but that's why I married her. I started to come down good about 8 PM, but was sick to my stomach for a good while. Hurled a couple times, but nothing unexpected. Took some pepto, that helped. I got no real sleep that night, and struggled at work the next day, just tired, and slightly confused. Didn't want to call in sick, 'Cuz, after all, veterans are expected to hold their shit together, right? I had some very powerful revelations, just crystal clear.</p>"
}
