{
 "title": "Tears of Joy",
 "author": "LifeisGood",
 "citation": "   LifeisGood. \"Tears of Joy: experience with 2C-T-2, Mushrooms - P. cubensis, Cannabis & 5-MeO-DMT (ID 64611)\". Erowid.org. Sep 6, 2007. erowid.org/exp/64611",
 "substance": "2C-T-2, Mushrooms - P. cubensis, Cannabis & 5-MeO-DMT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "17 mg",
   "sublingual",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 1:00",
   "1.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 1:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "3.0 mg",
   "insufflated",
   "2C-T-2",
   "(powder / crystals)",
   "  T+ 3:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64611",
   "Male",
   " ",
   "Not Given",
   "Sep 6, 2007",
   "Views: 5200",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a 16 year old male, I live in Utah in an undisclosed location, and recently, as well as not so recently, I have been doing some experementing with psychedelics. In the past year and a half I have experemented with Mushrooms, LSD, 2C-E, 2C-I, LSA, DXM, 5-MeO-DMT, 2C-T-2, and I even tried, and regret, diphenhydrinate. A couple of nights ago I decided to go on a solo visionary journy which ended with very good results.</p><p>My family life is a little hectic, divorced parents trying to get me into therapy and such. They even had a perscription for prozac for me which I refuse to take as it gives me nausea and makes my very uneasy and anxious. So when everything was going smoothly, I decided to take some of the psychedelics I have in my possesion.</p><p>11:30 PM</p><p>T+0:00 Sublingual ingestion of about 17-18 milligrams 2C-T-2, saved remainder or insufflation boost later.</p><p>T+0:20 First sign of slight nausea, nothing much maybe a slight rumble in stomach, take 2 tums.</p><p>T+1:00 I decide to eat 1 gram psilocybe cubenis mushrooms and smoke a vaporizer bowl of cannabis. I noticed that the cannabis really brings on the effects of the drug, especially more than mushrooms where it almost dulls the effects, it was making me come up quite rapidly and in about 30-45 minutes I felt the peak approaching. The Tums I took completely killed the nausea and nothing was felt of this for the rest of the trip.</p><p>T+2:00 At this point in the trip I was feeling very uplifted and having deep thought about the problems of the occupation in Tibet, from where I returned 2 days earlier, I realized that I would probably never again have the opportunity to return to this beatiful place again in my life, so I decided to insufflate the remaining 2C-T-2, and pondered some more.</p><p>T+2:45 This was about where the peak was at, I was having the time of my life, I was enjoying myself so much and realized what an increadible experience I had in China and Tibet and I actually noticed myself begin to cry tears of joy. At this point the visual and tactile sensations were astonishing, a 3D pattern of unimaginable beauty crawled across my carpet and onto the walls with unbeleiveable grace a glow, I could almost perceive the dimension of the air as it was folding and changing colors ever so slightly in from of me, the whole entire room was traced out.</p><p>Everytime I would move my head there would appear to be a second fuzzy layer on top of the tesselation I was already seeing on every possible surface of everything. As I was listening to Mad Conductor I also noticed that everytime a low note would sound, by body would quiver and I would nearly pass out or fall, I was litterally having the wind knocked out of me from the music. Quite interesting, but too much too handle, off with the music.</p><p>T+3:30 I decided to smoke another bowl of green, once again abrubft but pleasent accent into hyper space.</p><p>T +4:00 Well now that I can walk without stumbling perhaps it's time for a little bit of a crazy experience, quick turn on vaporizer, fill with duff, dump 10 mil. 5-MeO-DMT into the mix, put screen on, and as soon as I inhaled the hit, I was immediately blasted from sitting on my bed, into forming into the fabric with a beauty that cannot be described with words, I have sat here for a while trying to describe it, wait time for 2nd hit, back up into the world of bliss where all objects melt into one supermass of psychedelic entropy and back through my bed into the floor in the potola palace I vistied earlier in tibet and open my eyes and stop.</p><p>T +4:10 The last 10 minutes were spent out of my body in what I would beleive to be a 4++, it was as truley beautiful experience but the overwhelming bliss and euphoria (not to mention intense body high) drwarfs the importance of any visual component I have have acheived due to already being tripping, I went from having an enjoyable 2.5+ trip into a 4++ out of body experience in less than 30 seconds it was absolutely astounding.</p><p>The next few hours were spent in complete awe enjoying the remaining colorful visuals steadily coming down contemplating what I had learned from my experience. Overall a truely spellbinding experience.</p>"
}
