{
 "title": "Withdrawal - Mild, but Real",
 "author": "The Monkey Mantra",
 "citation": "   The Monkey Mantra. \"Withdrawal - Mild, but Real: experience with Phenibut (ID 64633)\". Erowid.org. Mar 6, 2012. erowid.org/exp/64633",
 "substance": "Phenibut",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Smarts - Phenibut",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64633",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2012",
   "Views: 12799",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm a 22 year old male with experience with pretty much any ol' thang you can imagine. I've lived with a pretty constant generalized anxiety for most of my young queer life, and anything I find that will temporarily allay said youthful agitation has the potential to be trouble for me.<br>I've played around with GABAergic agents before, from zolpidem to zaleplon to zopiclone to Xanax and GHB. Never really picked up much of a habit in any of them, aside from heavy nighttime Ambien use a good five years back. I've made my mistakes with GHB/GBL, but G intoxication is simply too... intoxicating to make for a good anxiolytic, and it's too short-acting, at that. I probably messed around with Phenibut for the first time about three years ago, when it had *just* hit the bulk supplements market. Never impressed me much. The inability to focus my eyes and the general wooziness made phenibut usage unattractive. I realized recently that these negative effects had more to do with overdose - proper, sane dosing allowed me to avoid these effects, and phenibut became, for a couple two-week periods, a daily habit. Between these two-week periods I'd give myself a good break of a month or so, and then some stressor would find me standing in the supplements aisle of some health food store grabbing the 500 mg Phenibut caps again.<br>My first phenibut withdrawal was completely unexpected and totally subtle. I'd say I'd been using about two to four grams a day, divided dosing. I'd feel the initial effects of the withdrawal maybe two days after my last dose. I'd probably gone through it *many* times without putting a finger on what was actually going on. The withdrawal was like a sensation of all-over activation. Nothing dramatic - no hairs standing on end, no shakes, no seizures - just an over-all sense of being 'on' in an uncomfortable way. Restless anxiety. No pain, in contrast to, say, hydrocodone withdrawal. The first couple times I went through it I thought it was just some bizarre, inexplicable anxiety. It took me a while to actually associate the phenibut with these seemingly domestic symptoms. This restlessness would last about a week, and would be accompanied by a sort of depression and primal fear. After a week and a half I'd be back to the normal me - easily excitable, someone anxious, but also quite happy and energized, the upshot of my peculiar little-dog syndrome.<br>Conclusion? Phenibut withdrawal is real. I've been through it a couple times, and each time, I forget about it and never really see it coming. Two to four grams of phenibut a day, for me, is barely noticeable and always has been. These are not large, intoxicating doses for me. Fair warning, though, that while phenibut might not pack a huge wallop in its initial effects, the subtle UGH of its withdrawal is a bitch. If you recognize it for what it is, you can ride it out in confidence that you'll equilibrate eventually. If you don't know what it is, it just feels like everything's wrong and you have no idea why. Good luck, and be careful!\n\n\n"
}
