{
 "title": "Once Upon the Sea of Blissful Awareness",
 "author": "Patriknark",
 "citation": "   Patriknark. \"Once Upon the Sea of Blissful Awareness: experience with LSD, MDMA (Ecstasy) & Cannabis (ID 64630)\". Erowid.org. May 25, 2008. erowid.org/exp/64630",
 "substance": "LSD, MDMA (Ecstasy) & Cannabis",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:45",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:30",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 2:30",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 6:00",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64630",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 25, 2008",
   "Views: 6637",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off, I'll start with an overview of what substances I've tried and my experiences with them. I've smoked weed and hash for some years now, and while this is my drug of choice, I'm not afraid of experimenting, and have tried MDMA (crystals and pills), opium, alcohol, shrooms, acid, ayahuasca/DMT (didn't work), valium, cocaine and amphetamine at least once. I do not like pure stimulants (coke and speed) very much, as they inflate my ego too much. I've always considered acid and MDMA my favourites for special occasions, but have never tried them together, or even tried acid around many people.</p><p>This experience took place during an electronic dance music festival in England, the summer of 2007. It was the second day of the festival, and me and my friend (from here refered to as P) had got our hands on some 'The Da Vinci Code' blotters of acid, and shit loads of pills and mdma crystals. None of us had tried acid and mdma together, but both had wanted for some time, as we both considered these as the most rewarding psychoactives to our knowledge. We dropped the first blotter around noon and went to eat. We had read quite alot of the combination, and had the impression that the trip could be quite chaotic and troublesome, so we were in a little nervous set of mind. Therefore we decided to let the acid take effect first, and then swallow the pills and see how it got. We walked around the festival, talked with some random strangers, ate our food, listened to some concerts and waited for the acid.</p><p>As we had been tripping the day/night before, the first effects, which came after around 45 minutes, were quite mild, and the trip felt warm, so we decided to drop the first pill (a white bomb, very good pills with much MDMA). We continued walking around, drinking water, watching concerts and chatting about everything. We tend to have very deep conversations when tripping, and the MDMA added very much to this, as we were very sociable throughout.</p><p>About two hours after we dropped the first blotter we decided to go back to our tents to chill out a little, drink some water and take some more acid. On our way back we got hold of circa one gram of skunk which we would very much like to smoke. We went back to our tents, still having quite mild effects from the acid, and medium effects from the pill. We lay down in P's tent, dropped one more blotter of acid and one more pill. This was approx [+2:30]. We started making some spliffs, while listening to music from a psytrance concert fairly close to our tents. We both had a feeling that the air, us and the music was liquid, and that everything flowed 'through' us. It was very pleasant, and added a weird feel to the music. We both enjoy psytrance btw :)</p><p>After about half an hour I had to take a dump and went to a shop to buy some toilet paper. Before, I've always had problems with standing in queues when tripping, 'cause I often feel people look at me weirdly which makes me somewhat uncomfortable. This was not a problem at all now. The pills was kicking hard, and I felt warm, pleasant and very sociable. I was constantly grinning, dancing to the music and having a blast, but the best thing was that I always was consciously aware of what I was doing, and full control of my mind and body. Usually when I'm on MDMA I drift off all the time, forgetting what to do, what to say and stuff like that. With the acid in addition, I felt so goddamn sharp all the time.</p><p>When I was walking back towards P's tent, I remembered the name of a Shpongle tune, called 'Once Upon the Sea of Blissful Awareness', and found that it matched my mindset perfectly. I was floating around on a sea, there was mud all over, I had wellies on, but I didn't give a flying fuck, the world was beautiful, I was beautiful, all the people on the festival was beautiful, the music was beautiful. Simply put, everything was bliss, and I was so extremely aware of it. I finished taking my dump and came back to P's tent at about [+4:00].</p><p>Now the second blotter was kicking hard for me, and for P as well, he told when I asked. Our nervousness for tripping on a festival had completely disappeared (the last day we had just taken a quarter of a blotter each, so we weren't very trippy that day). We both were enjoying it fully, and lo and behold! P had three perfect coned spliffs ready for consumption, and our favourite artists were going to play concerts from now and throughout the evening and night.</p><p>We smoked a spliff and suddenly we heard some BADASS thunderstrikes not far away. My tent wasn't completely waterproof, so I took on my poncho and went out of P's tent to attend to mine. Suddenly it started raining like fucking hell, I've never been out in that heavy rain before, but it was very enjoyable. It was thunder, it was rain, and I was tripping on acid, rolling on MDMA and grooving on cannabis. It felt so good, and while I was holding my tent to shake it dry once in a while, I was dancing to the music from the psytrance tent! It must've looked hilarious. As most people were trying to get away from the rain, I was standing there, letting it pour over me like it was the fountain of youth, dancing all the while :D The rain only lasted a short while, and at about [+4:15], P came out of his tent, I left my tent and we headed into the psytrance tent to watch Benji Vaughan (Prometheus) play a DJ set before Shpongle should enter the stage. The liquid feeling we had gotten before, was intensifying, and we were dancing and raving like madmen to the music, taking some pauses to drink water, converse with people, catch some air or smoke some cigarettes.</p><p>Although we were tripping very hard, we still didn't get any of those 'thought-tunnels', which often can drive my mind into when I'm tripping. We were both very sharp, very concentrated, extremely ecstatic and at all times sociable. We had loads of rewarding conversations, met loads of interesting people and still got time to dance in the mud. I had some pretty powerful visual and auditorial (hearing-related...) effects, while P just had audiotorial. But that's the usual deal when we're tripping, I'm kind of more visually oriented than him.</p><p>At circa [6:00], Benji went off stage and Shpongle was getting ready to play. As usual, I wanted more MDMA and went with P to our tents (40 seconds walk:P). I took two white bombs at once, while P only took one. We went back into concert tent, and Shpongle started. Shpongle is one of my favourite artists, and I've seen them live once before (rolling on MDMA). This time though, my condition was perfect. I was still tripping hard, feeling liquid and very floaty, infinitely aware and when the two white bombs kicked in, I had a constant spiritual experience. It was pure ecstasy (mental ecstasy), combined with an awareness which just was sublime. I was dancing, making sounds, having shivers, interchangably or all at once, all the time, the entire concert. It was without doubt the hallmark experience of my life, and I've had quite an array of experiences throughout my life.</p><p>When the concert was finished, me and P hooked up by our tents. We had lost each other during the concert, but none of us got stressed out by that. We both had enjoyed it thouroughly, and went back to P's tent to chill out and recuperate. </p><p>It was now around [7:45], and suddenly all the energy left me. I was chilling out, freezing a bit, having no energy left to move at all, but still feeling quite good. We had quite a lot of concerts to see this night, but I couldn't gather any more energy. I didn't want to take more mdma, since I felt my brain had worked enough and was afraid it would burn out if I raved any more this night. So at about [+9:00], P went out to see more concerts, raving more, and eventually end up doing ketamine for the first time, and so on, while I went back to my tent, lying in my sleeping bag and listening to the music that blasted out of the psytrance tent (called the Liquid stage), feeling absolutely exhausted and still quite trippy. </p><p>The pills had completely gone off, and I gathered that was the reason for my exhaustion. I really wanted to party more, but my brain just said plain no. I had reached the peak of my life, now it was time to chill out, relax, recuperate and let it sink in. I fell asleep at around [+10:30] and slept for about ten hours.</p><p>I'm sorry if I couldn't add enough depth to this report, but it was just so much that happened this night that I can't write in detail about it all. But all in all I had a killer time, and would like to recommend the combination of LSD and MDMA to everyone who believe they have a mind for it. For me, it's the perfect festival combination. It gave me the best from both worlds :)</p>"
}
