{
 "title": "The Tunnel of Light",
 "author": "36fuckin5",
 "citation": "   36fuckin5. \"The Tunnel of Light: experience with Mushrooms & Cannabis (ID 64650)\". Erowid.org. May 8, 2010. erowid.org/exp/64650",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:55",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:15",
   "  ",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:15",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64650",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 8, 2010",
   "Views: 2013",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dose: near 5 grams of an unknown strain cubensis.</p><p>About 2.5 grams of mid-grade pot spread out throughout the day.</p><p>It started out with a bunch of people wanting some LSD. I made the call to the usual people and everything was supposed to be good. The guy was getting it that day. So I made the 2-hour trip to pick it up. I show up at the guy's house, and chill for a while. I ask what kind of acid he's got this time. 'None,' he said with a smile. Right at that moment, he reached under his couch and pulled out what must have been 3-4 oz of obviously homegrown mushrooms. A smile twice as big as his came over my face as I counted my money. 'How much is an oz?' I asked. 'I can do it for $200.' 'Sounds good.' 1 oz of mushrooms, weighed and bagged. 'How much do you suggest I eat at once?' was my next question. He replied 'How much do you normally eat?' 'About 3-4 grams dry.' 'Start with 1.5. An eighth is a brave dose.' I didn't believe it.</p><p>So I hang out a little bit more, as we've been friends for years now. We listen to some music and just talk about whatever comes up. A bowl or 2 of some very fine marijuana is smoked between a few people. Everybody starts to get the munchies. 'You guys wanna help me cook some dinner? I've got some vegetables in there we could cook up.' 'Fuck yeah we do! What do you have?' To the kitchen we go. We decide we're going to steam a bunch of different vegetables (broccoli, cauliflower, asparagus, spinach, jalapenos - all fresh, of course) and put it over some rice. What we didn't know was that he has pretty much replaced using regular butter with cannabutter. He throws a huge chunk in the rice. Everybody in the room smiles on the inside.</p><p>We finish cooking and sit down to eat. Goddamn, was it good. Some of the best shit I've had in a long time. Now that we've eaten, he decides we need to smoke some BubbleBerry. It's great knowing growers. He packs up 3 bowls and his friend packs 3 or 4 more of some different but near equal pot. By the time we finish smoking, the canna-butter is kicking in. Finally, I look at the clock and decide that it's time to go</p><p>home. I gather the couple friends I brought and we depart. Everybody's had their fun, but now it's time to get back. I have other peoples' money.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>We get back on the interstate and my car starts acting funny. It keeps overheating. And doesn't stop. I end up taking an extra 3 hours (on a 2-hour trip, mind you) to get back home. Needless to say, I was pissed.</p><p>The next day comes and everybody that threw in comes over. We decide that we want to put some in chocolate and save some whole. A girl picks up some chocolate and some digital scales and brings them to my trailer. We measure out 12 grams of mushrooms, split them between 6 bars and wait for them to cool. Eventually, everybody went about their day - work, responsibilities, etc. However, since my car was broken, I had no way out of the house. This means no work. I decided I'd wrap the chocolates. I start to cut them out of the mold when I realize that they're sticking a little bit. Not too bad, but it's leaving a little bit behind on each one. I get them all wrapped and figure 'What the hell, I'll eat the leftovers and a little stem.' And that's what I did. Time: ~4:30 PM.</p><p>Right after I dose, my friend shows up. He bought an eighth as well and I have a decent bit more, so we decided to go out to a lake and trip. The only catch is that he needed to go home and change. He does and comes back around 30 minutes later. By this point, I'm feeling giggly and have light patterns and tracers. He's still sober, so we hop in his Jeep. Time: ~5:00 PM.</p><p>It's a decent drive to the place we went, and there is no way a car could ever make it. An ATV would have trouble with it. Not his Jeep, though. He eats his eighth about halfway there so that he'll just be getting butterflies in his stomach by the time we get there. I chew a couple caps, too. The final road we drive down is basically an overgrown dirt road, barely passable. But we get there. Time: ~5:25 PM.</p><p>By this time, I'm tripping pretty well off the little bit I ate. It was between 3-4 grams in total. It was then that I realized I was in for a ride on the best mushrooms I'd tried to date. It made me tickle inside to think of that, so I ate another stem. By now, I was almost completely peaking. The visuals were going strong - very colorful and inviting. Not so harsh like acid, but very flowy and serene. We decide to smoke a bowl of some pot. Time: ~5:45 PM.</p><p>As soon as the bowl was gone, it hit both of us like a ton of bricks. All of a sudden, everything was dancing, time ceased to matter and communication was impossible. For about 30 minutes after I had fully peaked, I had complete ego loss. Everything had ceased to exist, in my mind and in my eyes. I was staring at the trees behind the lake when all of a sudden, they started dancing so hard that they all came together, along with everything else I could see to form one giant kaleidoscope. There were no individual objects anymore, including me. All I could think was 'What the fuck?!' I was completely mind-fucked. My thoughts were racing so fast that there is no possible way to begin to keep up with them. It seemed like they were a laser cutting right through my brain. This whole section of the trip was very DMT-like, and I wish I'd had some, although I don't think I could have hit it properly. At this point, I could not keep track of time anymore. It didn't exist for me, or what was once me.</p><p>Soon enough, I finally was pieced back together and had somewhat of a normal thought process back. Everything separated again to what it was before, although I was definitely still peaking. I remember sitting in the Jeep for a long time, not being able to come up with anything to say except 'What the fuck?' and 'Wow.' At some point during this phase, I was staring straight ahead and saw a faint, gray dot coming toward me. Something communicated with me and asked 'Are you ready?' I asked it back 'Ready for what?' and the dot came a little closer. Now I could tell that this was a tunnel of some sort. Once again, it asked 'Are you ready?' 'Yes,' I replied, 'but please take it slow. I've never been here before.' 'That's fine. Just remember you're safe.' was it's answer. Very slowly, I started to enter the tunnel. I had no idea what was at the end, except for the fact that it was something of great power.</p><p>Finally I start to see a light at the end of the tunnel. 'I want full speed! Please, I'm prepared now!' All of a sudden, I was skyrocketed into the light. What I saw can only be definied as perfection. It was the great energy that drives us all. The Buddha-mind, if you will. If I had the ability, I'd have cried. You cannot see something this glorious without being moved to tears.</p><p>After this, I came out of the tunnel, going past perfection and came back to my body. When I 'woke up' I was having visuals harder than when I went through. EVERYTHING was dancing and full of energy and love. I felt in tune with everything in the world. I was at Nirvana, there was no doubt.</p><p>By this time, we were both sober enough to talk, although neither of us could describe what we had went through. The best we could manage was 'Are you tripping like I'm tripping?' And yes, each of us were. </p><p>This was when shit went a little bad. We heard a boat on the lake. Most people out there will not tolerate people tripping. Cops would be called instantly. We talk about it for a few minutes and decide we need to leave. My friend was still tripping hard, as was I, but we took back roads and made it home safely where I ate another 1/2-3/4 gram and gave the rest to a girl.</p>"
}
