{
 "title": "Is This Withdrawal?",
 "author": "Ff",
 "citation": "   Ff. \"Is This Withdrawal?: experience with Cocaine (ID 64666)\". Erowid.org. Sep 25, 2009. erowid.org/exp/64666",
 "substance": "Cocaine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64666",
   "Male",
   " ",
   "Not Given",
   "Sep 25, 2009",
   "5149",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have occasionally used cocaine over the past six or eight months, never more than once in a week and very rarely more than once in a month.  I have never had any experience of a crash or depression after using, and coming down has never left me with any feeling more intense than a 'would-be-fun-to-do-a-little-more' twinge.</p><p>Recently I had taken it a few times a day for two days in a row.  All of the individual doses were low: a key-bump or a smallish line.  The day following these days, I noticed a mild but perceptible 'edginess' which I attributed to caffeine and irregular diet.  However that night when I got into bed, I got a bit of The Fear.  It was very much like panic, with all of its unfocused dread and fear of the mindstate itself more than any thing in particular.  I got up and walked around a bit, went to the bathroom, and focused on slowing my breathing to relax my heart rate.  Over time this worked, and I went back to bed.</p><p>The following morning I woke up with The Fear, right from the start.  It was marginally less intense but impossible to throw off.  It was all I could think about, and thinking about it makes it more intense.  I would occasionally notice that I was thinking about cocaine-not exactly an urge to take a stimulant in this state, but the thought was there.  Is it possible that withdrawal feels like this?  Have never been in a withdrawal situation.  It persisted all day and night with hour-long bouts of relative normalcy.  The following day it was gone, and hasn't returned.</p><p>I haven't taken any drug at all since then (a week ago now), excluding two beers two nights apart.  It seems absurd that this could be withdrawal after such light use, but the fact that the symptoms are gone following a 36-48 hour period of discomfort seem to support it as a possibility.</p>"
}
