{
 "title": "Increased Brain Power and Sex",
 "author": "Mike",
 "citation": "   Mike. \"Increased Brain Power and Sex: experience with Skullcap (American) (ID 64679)\". Erowid.org. Sep 8, 2010. erowid.org/exp/64679",
 "substance": "Skullcap (American)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Skullcap"
  ]
 ],
 "footer": [
  [
   "20052007",
   "64679",
   "Male",
   " ",
   "Not Given",
   "Sep 8, 2010",
   "7702",
   " "
  ]
 ],
 "report": "<p>I began noticing unexpected beneficial side effects when using a standard detox regiment several years ago, and since then I have been randomly testing effects of the popular 'nervines/nootropics' or nerve support herbs.  Of all these herbs (St John, Hops, Valerian, Passion Flower, Skullcap etc) I have found American Skullcap to be both the most powerful and consistent herb for its use in improving thinking, energy and especially sex.  I have gone as far as having relatives give me skullcap among placebos for several weeks to verify that its effects are true, and they were for me.  After two years of use, on every two weeks and off for four weeks, my doctor found no abnormalities in liver tests and suggested continuing the use if it doesn't bother me.  </p><p>The effects of skullcap kick in gradually over several days.  To improve the rate at which the herb takes effect I start with 3 grams each day for 3 days and for the remainder of the 14 days I use 1.5grams.  </p><p>After about 2 days I begin to notice a very specific kind of depression, followed by brilliance and creativity and improved sex.  I feel that the depressive episodes stem from overanalyzing situations and becoming more aware of problems that I have somehow been ignoring.  These episodes usually come once a day for about 20 minutes, and afterwords I immediately realize it was the skullcap but somehow I always forget that they are related during the episodes.  On the 4th or 5th day the depressive episodes disappear and brilliance kicks in:  </p><p>I notice the MOST stunning changes in mental ability such as improvements in pitch control when singing, putting my hands in the exact position a ball is going to land when the thrower is halfway into the throw, the ability to flip a light switch with a small object such as a chopstick without any doubt that it will work, and the ability to sit behind a computer for hours without ADD and processes documents with speed that annoys and stuns the coworkers!  Moreover I feel better able to remember facts and see the 'big picture.'</p><p>Between days 4 and 7 I notice improved energy, in the sense that I jump up and down with the ease and energy of a little kid again.  Between days 4 and 21 (even a week after the regimen is over) I notice an UNQUESTIONABLE improvement in sex drive.  I have no erectile difficulties but find that with skullcap I can simply have more sex, more times a day, and that it is more enjoyable.  Even my partners have been able to notice the difference in performance.</p><p>I have not observed any clear negative side effects other than the brief transitionary depression mentioned above.  I have noticed that the skullcap of one company is particularly stronger than that of the others.</p>"
}
