{
 "title": "Past, Present, Future: Tripping",
 "author": "la Guitariste",
 "citation": "   la Guitariste. \"Past, Present, Future: Tripping: experience with Mushrooms (ID 647)\". Erowid.org. Sep 25, 2000. erowid.org/exp/647",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 647",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2000",
   "Views: 20605",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nBeware: This takes a while to get there...One friday evening, I made plans with a friend to go to a Ben Harper concert.  We planned to smoke a great deal of herb, but were looking forward to the likely consumption of mushrooms as well.  As can so easily happen in the uncertain world of illegal chemicals, we were unable to obtain the fungus.  The concert was very fun, but overlaid with the feeling that we SHOULD have had shrooms there, to complement the expectatory rush that looking forward to hallucinogenic experience usually engenders.  </p><p>While leaving the concert, feeling tired and a bit down (our marijuana had run its course, and we had foolishly neglected to bring any to the concert with us), my friend spied a guy who he recognized, and asked him if there were any shrooms to be had.  After some fiddle-faddling, we ended up in possession of a half-ounce of shrooms, to be split amongst three people (1.3 eigths apiece).  Now, by this time I was somewhat internally conflicted about the afair, as it was already pretty late, and I was thinking seriously about waiting until the next day to take the Flesh of the Gods.  But my two friends and I mutually convinced ourselves that we were young and sound, and could handle anything.  We downed the fungus at 12:30am, with no more grandiose plan than to trip in my dorm room, and then head out to the campus at some point to be amazed, and smoke more herb.  </p><p>After a good two hours of gummy, fantastic fungal frying in the room (everything seemed like a video game, but all quite lighthearted at this point).  At this point I think it worthy to note that on tuesday evening earlier that week, I had taken three hits of acid, and experienced an endlessly long stream of memories proving to me with hallucinogenic absoluteness that I was a terrible person.  That trip had yet to finish evolving within my brain (acid never really finishes with you), and I am at any rate a person constantly questioning who and what i am, and what I'm doing with myself.  Such questions can lead to scary places on hallucinogenic drugs!  </p><p>My shroom trip began to accelerate as soon as my two friends decided to go to campus and smoke.  I knew I was too fucked up to go, but somehow tripped myself into going along, despite deep misgivings.  I took my guitar along to ground myself.  I recall nothing of the walk to campus; I suddenly found myself on campus, very worried, and being hounded by my friends to get myself together, and go smoke.  I blanked out another stretch of time, and woke up to find myself in the midst of a seemingly endless forest of eucalyptus trees.  I had never been there before, and was absolutely lost.  </p><p>My friends once more began to hound me to smoke (I had the utensils in my pocket).  I was so far gone that I couldn't even comprehend wanting to do that, but I couldn't communicate with my fellow trippers at all.  One of them just thought I was fucking with him, and after a period of screaming at me, he wrestled me to the ground and got a lighter out of my pocket.  All I could comprehend was that the course of my life was taking me furthur and further away from who I wanted to be, and that there was no hope of stopping the process.  I lay down in the middle of the eucalyptus forest, clutching my guitar to my chest, watching my whole life reeling by me.  I saw my innocent childhood idiocies progress to less innocent idiocies, I saw every time I'd ever done what I knew to be the wrong thing when faced with a choice.  I watched all the porn I had ever seen gradually and cumulatively polluting my mind and spirit.  At some point I rose to my knees and began pitifully crawling, desparately trying to find something to connect my mind with my body.  </p><p>All of a sudden I was out of the eucalyptus (my friends had vanished; I didn't see them again until after the trip) and walking through campus, my guitar slung across my chest.  My mind had not slowed down one whit, and began to race forward, endlessly forward into the future.  I saw myself carrying out various interactions with complete strangers, all the while operating with values completely unrelated to all that I (whoever 'I' was) had ever known.  My future self lived countless lives in my head, each furthur disconnected from my sober reality. </p><p>Meanwhile, I walked.  I walked endlessly, playing guitar,  sure only that I was lost to all hope, doomed to walk the earth in isolated madness.  One of the most frightening aspects of the journey was the repeated instance of swirling blackouts: I walked for the most part with my eyes on the ground before me, but whenever I looked up, my vision spiraled out ahead of me, widening from the narrow scope of my shoes to the infinite world dissolving all about me.  My vision would then telescope back in upon me, swirling like a cartoon into nothingness. Then my vision would unwind out into a new scene, leaving me no remembrance of the ground I'd walked in between (later, reckoning the distances between those effectual blackouts, I was aghast to find that I would often go miles before refocusing my conscious vision). </p><p>Still I walked, and played, and saw my future, horrifying and alien, spin out before me.  The only continuity was that, in every bizzare movie of the future that I watched, I had my guitar, it was all I had to remind me that I had not always been the madman I felt myself become.  Finally, I reached a crossroads in the middle of campus from which I could not repair.  I tried to leave in each direction, but was unable to walk beyond the reach of the piercingly bright streetlamps outside a wholly unfamiliar building.  I was too scared to leave, and lost myself in abject despair.  I lay down finally, unable to walk and fight my mind any more.  I laid myself down to die.</p><p>After some time of pure oblivion, I realized that I was not dead, and that i was freezing cold, and bone-wearyingly tired, in body and soul.  I picked myself up, and walked resolutely out of the crossroads, clutching at my sanity like a drowning man at a life-preserver.  I knew only that if I kept moving I would eventually find a place to sleep, to cast myself down and sleep until I knew that all this ravening chaos was but maya, illusion.  When I finally returned to my room, it was 6:30 in the morning.  My roomate (who had taken my lighter from me earlier) asked if I was all right, and I said 'Yeah.' My other friend was sleeping on my bed, so I put a piece of cloth beneath my head and lay down on the concrete floor.  I was too numbed by the wreckage of my evening to do anything but thank the god I don't believe in that I was myself, and still alive to fight another day.</p>"
}
