{
 "title": "Sedation and Relaxation",
 "author": "tomo17",
 "citation": " tomo17. \"Sedation and Relaxation: experience with Chamomile (tea) (ID 64716)\". Erowid.org. Mar 20, 2010. erowid.org/exp/64716",
 "substance": "Chamomile (tea)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 teabag repeated",
   "smoked",
   "Chamomile",
   "(ground / crushed)",
   "",
   "1 teabag repeated",
   "oral",
   "Chamomile",
   "(tea)",
   "",
   "5 teabags repeated",
   "oral",
   "Chamomile",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64716",
   "Male",
   "",
   "Not Given",
   "Mar 20, 2010",
   "15230",
   " "
  ]
 ],
 "report": "<p>After reading that Chamomile was used as a herbal remedy for anxiety, I went out to the store and bought a box of Chamomile tea.</p><p>My experiments have been:</p><p>1. Making Chamomile Tea, consuming it in small, then large quantities.</p><p>2. Eating the actual Chamomile Tea</p><p>3. Smoking the plant matter</p><p>My results are as follows:</p><p>1. Tea: Makes me drowsy, somewhat realxed, but anxiety is still present. This is only a mild sedative but helps aid sleep, I would not recommend drinking the tea as a remedy for anxiety, its effects are not profound.</p><p>2. Eating: This was disgusting and did not do anything, I ate 5 teabags worth before bedtime and still had trouble sleeping. I guess eating only works with some psychoactives (nutmeg)</p><p>3. Smoking: The smoke isn't too harsh (unless you take a big hit) and the effects are body relaxation, drowsiness, and reduced anxiety. The experience of smoking the plant matter produced notable stress reduction  effects, with a pot-like odor. So if you have anxiety problems and are looking for a quick fix, try this. If you have severe anxiety, this won't help much.</p><p>Overall, I respect the Chamomile flower. I make the tea when I want to sleep, and I smoke it when I want to relax and enjoy a very mild buzz.</p><p>Try it for yourself and see what happens!</p>"
}
