{
 "title": "You Maketh My Body Tingle!",
 "author": "anonymous",
 "citation": "   anonymous. \"You Maketh My Body Tingle!: experience with Salvia divinorum (ID 6471)\". Erowid.org. Feb 26, 2002. erowid.org/exp/6471",
 "substance": "Salvia divinorum",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "7 hits",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6471",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2002",
   "Views: 6374",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAs I type I'm finishing my 3rd experience with Salvia.  This time I tried it by myself (I know about sitters but my dosage was small).  During 4th or 5th hit from a one-hitter I could feel the effects coming on and started to see little 'vortexes' in the corners of my eyes.  I took a couple more hits and decided to lay down and close my eyes.  I had a live version of Thelonius Monk playing at The It Club.  My lights were turned off, and no one was around to distract me.  </p><p>As I closed my eyes I started to see circles here and there and they started flashing and moving around.  Then I saw a greenish circle that sort of resembled a head of lettuce, then it turned into a kind of greenish moldy orange or something, then it turned into a round watermelon, and continued to shift through different food type looking circles...eventually that started to disappear and the flashing circles continued.  At that point I opened my eyes and looked at the ceiling....again a 'vortex' here and there.  I looked over to my window where my venetian blinds were half open and i could see part of the tree top outside my window.  The sky looked slightly purplish-blue and it kind of looked like there were branches there that really weren't (they began to fade in and out of focus).  </p><p>Next, I decided to come over to my computer and enter this little message of experience.  As i turned it on and was waiting for it to load, I could feel a slight erection beginning to develop and my head was still feeling a little tingly.  Right now I'm still coming down as I type this.  This nice little plant seems to actually do the trick, although that's not what I expected when I first heard about it and the first time I actually tried it.  Salvia O Salvia, you maketh my body tingle!</p>"
}
