{
 "title": "Modulation of Effects, Reduced Aftereffects",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Modulation of Effects, Reduced Aftereffects: experience with MDMA & Modafinil (ID 64710)\". Erowid.org. Jul 30, 2007. erowid.org/exp/64710",
 "substance": "MDMA & Modafinil",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   " ",
   "50 mg",
   "insufflated",
   "Modafinil",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64710",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 30, 2007",
   "Views: 11181",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I crushed up 1/4 of a Modalert 200mg tablet and mixed it with 50mg of MDMA (very high quality crystal/powder form). The motivation was not to boost the E-High with another stimulant but to reduce the pain associated with MDMA insufflation.</p><p>However, I expected an interaction since they are both serotonergic and dopaminergic and Modafinil is a mild dopamine reuptake inhibitor whist the main action of MDMA is to release massive amounts of serotonin and supress its reuptake.</p><p>I cut and mixed until it was a fine powder, split it in two and took one line up each nostril.</p><p>The first signs of coming up started immediately (as normal with insufflated Modafinil) and the first rush occured within approximately 10 minutes followed by successively more intense rushes over the next hour. At this point it plateaued and began to recede after another 90-180 minutes.</p><p>The comedown was slower than usual and there was no sign of a crash. The following day I felt pretty much normal if a little tired.</p><p>I repeated the dosage orally on another occasion (crushed and placed in a gel-cap) and found the onset to be quite delayed, roughly 2 hours, the intensity of the rushes lower and less frequent and the duration of the experience (from onset) equivalent.</p><p>To sumarise, mixing Modafinil with MDMA is effective for insufflation and reduces the pain associated. Modafinil also seems to modulate the experience positively and reduce the after effects.</p>"
}
