{
 "title": "Food Increases Absorption",
 "author": "Bran Man",
 "citation": "Citation:   Bran Man. \"Food Increases Absorption: experience with Gabapentin (ID 64733)\". Erowid.org. Jan 10, 2011. erowid.org/exp/64733",
 "substance": "Gabapentin",
 "bodyweight": "180 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 20062007",
   "ID: 64733",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 10, 2011",
   "Views: 12217",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nFirst and foremost, it is important to remember that Gabapentin's (brand name Neurontin) absorption is increased by taking it with food, though it still has a low rate of absorption  It is similar in structure to the neurotransmitter GABA, though I've heard it's not believed to act on the same brain receptors.\r\nAbout a year ago I was coming off of Venlafaxine (brand name Effexor), and Quetiapine (brand name Seroquel), which I found were both very addictive, and was feeling pretty awful in general, so I went to a psychiatrist and got a prescription for 90 600mg capsules of Gabapentin each month, with 4 refills.\r\nI'm a big fan of this drug as an alternative to benzodiazepines (Brand names: Ativan, Klonopin, Valium, Xanax, etc.), Seroquel, alcohol, or Carisoprodol (brand name Soma) as it is not physically addictive like these these are, and thus more easily prescribed. (though it is habit forming)  It is also less expensive, I have an ordinary Health Advantage Insurance Plan and pay $10 for each bottle of 90 generic brand 600mg Gabapentin Tablets. (manufactured by Ivax)  It's probably a good idea to buy a pill cutter/container/crusher from Walgreens for $5 - $10 if you plan on dividing the high dose tablets into quarters or smaller.  You should probably call it a tablet divider when asking for it, as they might frown if you ask for a pill crusher.\r\nIt does have a fairly delayed onset, up to an hour before I start to feel any noticeable effects, depending on how much I take, whether or not I crush the tablets before swallowing, (I suggest wrapping the powder in a piece of toilet-paper) and how long I've been taking it. (I never felt any effects in less than 45 minutes until I had been taking it daily for a while, and become dependent) It does however, take 3-4 hours for the full pleasurable effects to kick in.  I've read different statements about the half-life of this drug, which for the most part range from 4-7 hours.\r\nAt doses of approximately 37.5 - 150mg I observed minor anti-anxiety and mood stabilizing effects. (I only used these doses after becoming dependent)  \r\nAt doses of 300 - 900mg I feel general relaxation, good anti-anxiety and mood stabilizing effects, moderate sedation, muscle relaxation, a very nice 'body high' similar to that of Soma, Benzodiazepines, or alcohol, and I also feel more able to socialize and communicate.\r\nAt doses of 1200 - 4800mg I get the previously mentioned effects in greater intensity, as well as a very nice psychedelic feeling, and mild to vivid closed eye visuals (CEVs) of a very unique quality, similar to the closed eye visuals one might get on moderate doses (20 - 50mg) of Zolpidem (brand name Ambien).\r\nI should also mention that I smoke very high grade Cannabis several times a day, which tends to intensify the effects and make it much more pleasurable and psychedelic.\r\nGabapentin can also help with withdrawals symptoms from addiction to, and use of, alcohol, benzodiazepines, cocaine, methamphetamine, (and other amphetamines) and even opiates. (Tramadol, Codeine, Vicodin, Percocect, Oxycontin, opium, heroin, methadone etc.)  I would imagine it would probably help with the withdrawals from most any Central Nervous System Depressant.\r\npeace brothers and sisters\n\n\n"
}