{
 "title": "Killed My Inner Self",
 "author": "kt",
 "citation": " kt. \"Killed My Inner Self: experience with Ephedrine, Baclofen & Diazepam (ID 64736)\". Erowid.org. Feb 15, 2011. erowid.org/exp/64736",
 "substance": "Ephedrine, Baclofen & Diazepam",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "857.5 mg",
   "oral",
   "Ephedrine",
   "(daily)",
   "",
   "80 mg",
   "oral",
   "Pharms - Baclofen",
   "(daily)",
   "",
   "20 mg",
   "oral",
   "Pharms - Diazepam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2003",
   "64736",
   "Female",
   "",
   "Not Given",
   "Feb 15, 2011",
   "10331",
   " "
  ]
 ],
 "report": "<p>I am sick.... my hands are numb and swollen this time. I have intermittent piercing cramps in my stomach. it is so hot I want to rip off my shirt. so I do. It is freezing. my body twitches with a sudden abrupt spell of the shivers. I am in agony.</p><p>I start digging through the garbage to find the package of ephedrine I threw out yesterday. I was going to stop, and I felt a false sense of security that I would never need them again. However I was euphoric from the 40 pills I had just taken an hour before. 35 pills of ephedrine and four 20 milligram pills of baclofen (a muscle relaxer.) The baclofen took away THE EDGE of the ephedrine so all I felt was the euphoria and the energy but with out the jitteriness and agitation. The Valium allowed me to sleep despite the insomnia ephedrine usually causes.</p><p>After waking the next day I was so tired and dead I felt like a useless peice of nothing.  Eating was out of the question because the very thought of it made me throw up. The solution? take the pills, drink the coffee, and start all over again. </p><p>I couldn't stand even one day of feeling dead. I am a mom and a wife and my family needs me. My son is waiting for me to bake cookies, make blanket forts and take him swimming. My husband is wanting me to kiss him tenderly on the lips and tell him I love him. Making breakfast is out of the question unless I can find the damn package I threw away. God help me I am digging through a garbage filled with cat litter and remnants of spoiled food I had thrown out when I cleaned the fridge the day before. I found them. I tasted the familier bitterness on my tongue and felt like I was on top of it all again. Cleaning, caring for my son, cooking, doing bills and all at the same time. But  After about a week of pill popping I start to get sick from the pills, and I need to start the withdrawal process for about 4 days so I can get the same effect I wanted from it in the first place. During those day I pray and promise god I will NEVER do it again. Just take away the pain. My husband thinks i have the flu yet again. My son calls me crabby. And I feel like I want to slit my throat.</p><p>You tell me, how does it feel to be 'normal' to exist without a drug induced self. I watch the news and wonder how the anchor man can smile sober. I see my neighbors cutting the lawn and I am jealous of their natural energy.</p><p>I can't remember what it was like to be a person with out umm... supplements. Tell me. How does it feel to be free. to be happy without ephedrine that was supposed to be a harmless over the counter drug. I could die. Every day I overdose. And every tommorow brings me closer to my death. I blame myself first, but the FDA deserves a personal thank you from me for helping me to fuck myself. 4 pills too start, and 4 years later two boxes a day and an afficial happiness to last a life time.</p><p>After the physical pain leaves I am still exhausted. I am 'fuzzy headed' I can't concentrate. I feel sad. Crying over everything I get overwhelmed and nostalgic for that 'super mom' feeling and I want to be that person with the contagious smile. So I cave. I go to the nearest marathon an start the process all over again.</p><p>..</p>"
}
