{
 "title": "Such Horrid Thoughts",
 "author": "rye catcher",
 "citation": "   rye catcher. \"Such Horrid Thoughts: experience with Dimenhydrinate (ID 6474)\". Erowid.org. Feb 26, 2002. erowid.org/exp/6474",
 "substance": "Dimenhydrinate",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6474",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2002",
   "Views: 17710",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was going through a wierd time in my life and was in need of a new experince.  At first I thought I was just going to drop some LSD again.  But the town was incredibly dry.  <br>A 'friend' told me that I should try tripping off of dramamine.  Usually I research chemcials througly but I was so out of control with differnt situations that I thought, 'why not'.  I purchased a tube of the horrid motion sickness chemical.  I took 12 pills before heading to a larger city, to look for apartments,  that was 2 hours away.  BIG MISTAKE!  About 45 min. into the drive I started feeling all sorts of 'bad weird'.  I felt as if though I was choking on my own saliva or tounge; I couldn't decide which it was.  My breathing started to quicken it's pace. Then I felt the starting signs of a panic attack.  I turned to my friend who was driving and told him I wanted to go back.  He ingnored me and kept driving for a bit.  'Calm down. You've handled intense acid trips before, just relax.', these were the words I slightly told myself but it didn't do much good. <br>Soon I was in a full blown panic attack and the chemical was taking hold.  My friend told me he'd stop at a hardee's and get something in my stomach.  I freaked out hardcore in the drive through line and told him to head back.  Seeing how utterly frightened I was he turned back towards my house (An hour away).  He gave me an ice tea which I tried to sip.  The rest of the drive was pure and unrelenting hell.  I was on the verge of total insanity.  I tried throwing up but that didn't help at all.  I only mumbled a few frightened phrases as the car sped on.  I kept thinking that all my existence was completly worthless and that I was nothing more than chemicals that were now going haywire. I have had similar thougts on LSD at times but they were not this scary, I usually found acid intropection very intersting and sort of fun. I started worring about my heart. I could barly move my mucles.  Circulation was slowing down.  I begged him to take me to the ER but luckily he refused.<br>When we finally reached my house I gathered up all my strengh and stumbled inside.  At first I started to look for my charcoal tabs to soak my system, but the chemical was already in my blood stream.  I laid on my bed while my friend got me some water.  If I stood up then I would get insanely dizzy.  Visuals much like a twisted evil mushroom trip may give a person.  Things would twist and surry about.  Usually I love those when I am on LSD or mushrooms.  But this time they only added to my fear.  I would see my friend in another room only to have him come from a differnet hallway. I started to make phone calls on an imagenary cell phone.  This all seemed very real to me at the time. <br>After two intense hours I finally calmed down and watched television.  I could feel blood rush thoughout my body if I would stand to sunddenly. I was inceridbly greatful to my friend who stuck by me during this time. It took few days to get back to 100%.<br>I will never touch this chemical again. I still believe that experimenting with chemicals is worthwhile and benifitial if done responsibly.  And if it's available at wal-mart, it's probably best left on the shelf.  Now I know a fear that I never want to revisit again. This was pure hell for $3.99.\n\n\n"
}
