{
 "title": "Wow...I Love This Stuff",
 "author": "Kratom",
 "citation": "   Kratom. \"Wow...I Love This Stuff: experience with (15x extract) (ID 64819)\". Erowid.org. Apr 25, 2010. erowid.org/exp/64819",
 "substance": "(15x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 g",
   "oral",
   "Kratom",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64819",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 25, 2010",
   "Views: 5972",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have not had a great deal of experiences with drugs in my past. In fact, besides alcohol, the first time I ever tried any drugs was only a few months ago, near the end of my senior year of high school (i'm 18 now).</p><p>My drug experience includes weed and vicodin, but sadly I've only done those with alcohol, so I admit I can't verify the actual solo effects. Then recently, me and a couple friends have done cocaine. We get nearly pure stuff and it's great, but we only do it 2-3 times a month. It's an okay drug, just something I do when I'm gonna go to a party, GREAT for social events. Anyways...kratom.</p><p>I had researched a lot about legal drugs after doing cocaine, because I wanted something I could get my hands on because altering your state of mind is simply fun. Two herbs definately caught my eye in my extensive two week research. Salvia divinorum, and Kratom.</p><p>I was on the brink of ordering salvia, but it seemed like the more i researched, the more I found salvia to be an extreme trip, with lots of negatives. I didn't want the risk of having a bad trip...so I looked into kratom. Kratom had everything I wanted: relaxation, euphoria, and it lasted long (cocaine is fun and all, but damn it ends quick).</p><p>So i decided to order some a couple days ago and it got here fast from on online vendor (ordered on monday night and got it thursday in the mail). Aside from that, it came at the perfect time because I was off work that day and my parents were out of the house.</p><p>I read that mixing with applesauce or pudding was good, but I had none. So, I decided to heat some water in the microwave and mix it in that, but it didn't dissolve very well. So then, I poured the water in to some oatmeal i discovered and ate up. Here's the details:</p><p>0:00 I mixed my two grams of 15x extract in a cup of heated water. Didn't mix well so I put in some oatmeal, and that worked great. Also, I don't know why people have complained about the taste, I licked some that i spilled a bit while mixing and it tasted fine. Actually had almsot no taste.</p><p>0:10 took my about 10 minutes to finish it all, at this time I was just watching some DVR shows I had recorded.</p><p>0:20 I go up to my room and feel mellow, i guess more specifically just kind of tired. I figure it was because I just woke up about an hour ago and not because of the kratom, but i decide to get on my laptop for a bit.</p><p>0:30 I definately start to notice things happening. I feel warm, and relaxed and definatly euphoric. Just as I had read, I have a very dream-like experience. As I look around my room, things are just chill and slow and...dreamy. it's hard to describe it any other way than dream-like.</p><p>0:45 I start to just smile in approval of the kratom. I think to myself, wow i love this stuff. I decide to listen to music and it's so awesome. Just a relaxing enjoyable experience.</p><p>1:15 I still feel the effects almost in full, I would have to say my peak seemed to be at around 30 or 45 minutes, but i don't feel like I'm coming down now at all either... i play some videogames and enjoy my experience further.</p><p>2:00 Not a care in the world. The euphoria is diminishing a bit, but i still feel so good, and happy, and relaxed. I can definately look forward to using this stuff in the future if I'm stressed out about something, though to be sure not to turn to it every chance I get, as I've read that it can be habit forming.</p><p>3:30 the effect of the last hour and a half were basically that relaxing warmth. I still feel great now, but the euphoria has completely gone, I can't say if i'm relaxed from the drug or from my aprroval of using the kratom, but I feel good all the same.</p><p>Conclusion: Kratom works. And works great at that. I definately want to try different things such as higher doses, and possibly higher extracts but I am very content with my experience with the extract I have. I just hope this drug stays legal, it is extremely relaxing and doesn't seem to have any negative effects at all. I can't wait to try it when I'm hangin out with people either, seems it can be used quite well socially. Just remember people, this drug only stays legal as long as it isn't abused! So be smart and be safe, keep legal drugs legal!</p>"
}
