{
 "title": "Dream-like",
 "author": "Someone!",
 "citation": "Citation:   Someone!. \"Dream-like: experience with DOI (ID 64828)\". Erowid.org. Oct 31, 2008. erowid.org/exp/64828",
 "substance": "DOI",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "DOI",
   "(liquid)",
   "  T+ 8:15",
   "60 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(pill / tablet)",
   "  T+ 9:30",
   "2 ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64828",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 31, 2008",
   "Views: 7277",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had a chance to try DOI while staying with some friends out of town. A buddy of mine who had also come down for the occasion had some in liquid form, contained in two vials. He told me each of these was one hit, but couldn't specify the exact amount. I decided I was going to try it after a few days, as kind of a climax to the trip. I was in good spirits the day that we dosed, having had a satisfying mushroom experience the day before. Here's how it went.\r\n1:45pm - We drop the contents of our vials into separate glasses of orange juice. In both our cases it was just a tiny little drop. Bottoms up.\r\n3:00pm - After coming back from a short walk, we smoke. I have a couple of bong and pipe hits.\r\n4:00pm - My friend had been saying he could feel it for about a half hour, but this was the first time something really registers for me. I felt very intense rushes of energy and euphoria as I sat on the couch staring at the television. They come sporadically at first, but then their frequency picked up to a steady rhythm. Very pleasant.\r\n4:00-10:00pm - This was definitely the peak of the trip. I found myself incapable, for the most part, of keeping up any sort of thoughtful conversation. It seemed like all my energy was being directed towards a nonstop stream of thought that required intense amounts of analysis. My mood was not down, however, simply very contemplative. The visuals were kind of neat, with moving walls and a chair covered in bright flowers (which were rotating) keeping me entertained. Patterns superimposed themselves on the walls behind the TV, and when I went outside on a few occasions for some air, the passing cars were leaving tracers behind them. I noticed these when I moved my hand through my field of view as well. Shadows in the house looked very intense and dramatic. By 10 we had been smoking pot pretty much all day, which was providing a steadily increasing sense of confusion to the mix. At this point (around 10pm) I decided to take 6 Amitryptaline I had, as we were about to go out for a walk.\r\n11:00pm-12:30am - We go out to a park, which was very cool. The world seemed very surreal and hazy. The park was huge with many trees and felt like some imagined place to me. There were no real visuals present here, just a really painting-esque look to everything. I drank two beers while we were there, and we smoked a few pipe bowls and a joint. I remember thinking that I could feel the Amitryptaline because it was becoming really difficult to will myself to walk, and I was starting to zone out pretty frequently. We hung out for a bit, then toured back, as our host had to work the next morning.\r\n12:30-3:00am - When we got back the bongs went around again. We stared at the TV and didn't say too much. Everyone was pretty tired by this point. My friends gradually went to bed until I was sitting on my own, quite inebriated, smoking a hookah. The DOI visuals had pretty much worn off by this point, but the body buzz was still there, aided by this point by everything else to a pretty hard to ignore feeling. I stayed up for a bit longer and then eventually just went to sleep, which took a couple of hours. The next day I felt a little funny when I woke up (after a LONG sleep), but nothing too major.\r\nI found DOI to be an interesting substance, if not as intense as I'd hoped (but then, I don't know exactly what my dose was). I'd never felt the kind of introspection it forced onto me, and I'm not sure how much I enjoyed that element of it because I *wanted* to talk and be social, but didn't feel I could do anything more than sit and think very hard about everything. I liked the dreamy look it gave the world, and the haziness of the whole experience. It was more interesting than straight out FUN, though. I'd want to try more if I do it again, though.\n\n\n"
}