{
 "title": "Combatting Withdrawals",
 "author": "methamphibian",
 "citation": "   methamphibian. \"Combatting Withdrawals: experience with Oxycodone (Opana ER) (ID 64831)\". Erowid.org. Aug 9, 2007. erowid.org/exp/64831",
 "substance": "Oxycodone (Opana ER)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64831",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 9, 2007",
   "Views: 13049",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have used various opiates/opioids in my life, and I have been dependent on them for the last three years.  I have a pretty high tolerance, it takes me 120mg of morphine sulfate just to get out of withdrawal, and around 150mg to get a good nod.  </p><p>Over the last few months, I've been unable to get a decent euphoria out of morphine, oxycodone, or even fentanyl, so I decided to give Opana ER a try.  My mindset was terrible (I was in WDs) but I was in a comfortable setting and I was really anticipating the relief.  I had read that oxymorphone is ten times more potent than morphine, so a 20mg pill should have done the trick, but it didn't!  I had taken the pill orally and chewed it up, but I was still in withdrawal two hours later!  I gave up and took my daily morphine.  </p><p>The next day I read [?] that oxymorphone is only ten percent bioavailable if taken orally, but it is around 45% bioavailable if snorted, so I bought another 20mg ($60.00), scraped the coating off, crushed it and then snorted half in each nostril.  Within 20 minutes a wave of euphoria hit me that felt like my first oxycontin, it was even better than heroin!  So the moral of the story is that I find that oxymorphone is not very satisfying orally but it is very strong insufflated.  The little green hexagonal pills of just 20mg feel like at least 100mg of oxycodone.  Oxymorphone is by far the most euphoric opiate I've ever tried, but I would not recommend it for inexperienced users, for that matter, I wouldn't recommend any opiate for anybody.</p>"
}
