{
 "title": "Some Notes",
 "author": "wink",
 "citation": "   wink. \"Some Notes: experience with Methylone (ID 64830)\". Erowid.org. Aug 7, 2007. erowid.org/exp/64830",
 "substance": "Methylone",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "64830",
   "Male",
   " ",
   "Not Given",
   "Aug 7, 2007",
   "Views: 9467",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nA couple weeks ago I was at a party and Methylone came up in discussion, and I was surprised at how few people had even heard of it, much less tried it (only one person had), esp. given the people in attendance and the type of party it was.  So I wanted to post some of my thoughts about dosage and effects.</p><p>First, from watching people take this chemical, this stuff is so variable that even the standard chart format really might not be able to really represent what I consider the high variability between different people even at same doses, same delivery method, same injection time, etc.  One interesting thing was that a 210 lb male, heavier and w/a slow metabolism, had a shorter duration than the female, very thin, just over 100 lbs. due to a very high metabolism, lasted at *least* an hour longer.  Very non-intuitive!</p><p>The male required 200mg to get even threshold effects and the duration was very short.  When he tried  180mg over the course of an hour, 60mg every 20 minutes, that led to some possible 'alerts' and then sluggishness, but definitely did not cross threshold into the full effects others experienced.  Next attempt was 200mg at once, and maybe a couple of alerts over the first hour, then maybe some threshold effects, but again, mostly sluggishness, and at least a definite feeling of relaxation similiar to taking a benzo.  It took 250mg to get close to a 'common' level effect, and 300mg was found to be about the 'just right' dose.</p><p>I should mention this was ingesting orally, water-dilution method, 10ml/10mg, very carefully pre-measured.</p><p>As for bumping (orally), after the first hour, oral bumps of 50mg worked 'so-so' and 100mg definitely extending things by an hour, but after three 100mg bumps, an</p><p>hour each apart, the sedating effect completely took over, and left 'him' in a very pleasant state that was almost exactly like the feeling after smoking opium, and he just laid in bed enjoying that for another 2-3 hours (lost track of time) until falling into a very deep and restful sleep.</p><p>Not even the slightest hint of after-effects upon awaking about 7 hours later. All three subjects in my notes agreed completely that there was absolutely no</p><p>sign of effects after sleeping, and if anything, all felt really well-rested and 'energized' as one put it.</p><p>The body load is definitely not made much worse by additional usage, in fact it seems to just add to the sedating effect and leads to a deeper, more restful sleep.</p><p>Whereas when I've bumped MDMA or MDA before, usually insufflated, it's really been a bad trade-off - maybe an extra 30 minutes of duration but definitely a</p><p>couple of points on the body load scale for each time and many more hours of 'wiped-out' feeling over the next days.</p><p>Duration / Effects Course : </p><p>I think the duration is best described as two to four hours, although four hours is probably a little longer than most people feel 'high'.  I think one female who's very thin/low weight lasted that long, but I guess it depends on how one looks at it: it seems to go through two very distinct major phases during the main duration:</p><p>Phase 1. Very much the open, loving, talkative, empathic feeling much like MDMA but without much, if any, of the body high and load, so basically all the good / fun parts of MDMA use but relaxing instead of 'amping' (maybe since it's lacking the 'MA' part of 'MDMA' if that makes sense?)  That can last 2-4 hours depending on dose, 4 hours mainly with a base dose and then at least one bump.</p><p>Phase 2. The comedown seem like it can last anywhere between 1-3 hours itself, and is very much like an opiate high that slowly gets stronger until it becomes very sleep-inducing and at some point, it just makes sense to get comfortable and go to sleep for the night.</p><p>In any case, I would definitely say Methylone is:</p><p>1. Not a 'club drug' - it definitely doesn't give one more energy, in fact, it really quickly brings on a desire to lay down somewhere right after the main peak.</p><p>2. Best enjoyed in quieter settings - loud and/or frenetic music is actually very distracting and even annoying.  It took quite some time to find the  right kind of stuff to have on, and it was pure Eno-style 'ambient'.   Shpongle and any other type of 'chill' music w/beats of any type were distracting and as said, even annoying.  Can't imagine listing to something really active and crazy like psy-trance but might have to give that a try.</p><p>3. Best enjoyed where the person can take it in the place where they're going  to end up sleeping - when the second phase hits, it really kills any motivation to do *anything*.</p><p>4. Best insufflated, as that cuts the dose needed down, but then again, also cuts the duration down.  It's a trade-off: insufflating requires about half the dose, but lasts half as long, so there's a desire to keep bumping.</p><p>Usage via distilled water dilution (10ml/10mg ratio) required about 300mg to get to a good place with it, but 150mg insufflated lead to bumping 50mg at least 3-4 times to get the same duration (measured with mg scale.)</p><p>This stuff is very interesting and I found it doesn't really follow the usual course.  But it's also wonderful, because while one really, really wishes the first phase ('open & emphatic') would last a lot longer, the sedating phase is so much like opiate use that it's totally enjoyable and fantastic that way as well, and at least in these notes, all three subjects reported that the sleep after was *extremely* restful, after only 6-7 hours, and very re-energizing.</p>"
}
