{
 "title": "The Good the Bad and the Very Unpleasant",
 "author": "serpico009",
 "citation": "   serpico009. \"The Good the Bad and the Very Unpleasant: experience with LSD (ID 6486)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6486",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "6486",
   "Male",
   " ",
   "Not Given",
   "Feb 28, 2002",
   "6580",
   " "
  ]
 ],
 "report": "<p>\nI've been telling this story for awhile now. I think i want to write it down too.</p><p>It was a hot Friday night in July, and my friend Victor had a connection for good acid. I had tripped more than four times prior to this, and Victor and our other friends were fairly experienced as well. It was me, Victor, and a third friend, Benny, with 11 sugarcubes of acid in front of us. This was the beginning of a night that was amazing and yet very unnerving.</p><p>I recommend using far more caution with large amounts of unknown-potency acid than we did. Yet it was one of the most profound, life-altering experiences i've ever had.</p><p>At about 8.30pm or so we ate our cubes. I ate 3. Benny ate 2. Victor ate four (victor, please note, was also on anti-depressants at the time of this trip. zoloft, i think). We decided to go to a friend's graduation party. We picked up Victor's girlfriend and another female acquaintance and headed out. </p><p>At T+30 min. Benny ate another sugarcube. I, on the other hand, was already feeling effects of the acid. Whoever dripped these cubes must have had no idea what they were doing, becuase these things had to have been soaked. Anyway, i was driving, which was stupid to begin with, so i had to pull over and let Victor's girlfriend drive. When we arrived at the party it felt neat to get up and walk around. I looked over the fence and some hedges and saw a huge property with an olympic swimming pool and horses. 'Look at the horses', i said to everyone. wow. When i entered the yard, it was nothing more than an inground pool surrounded by concrete:) and this after not even an hour! The party, unfortunately, was terrible. There were parents there and a terrible band was playing dave matthews songs and old friends from high school whom i didn't want to see were there. i was 20 and my friends were in their mid teens. It was terrible. </p><p>i stumbled back to the car and waited for the others. When everyone came out of the party i demanded that Victor's girlfriend (Donna) drive us back to Victor's place. I proceeded to crawl into the passengers seat and lock my seatbelt. That party had scared me, and i was very small and afraid. As everyone piled into the car it was so hot that i rolled down the window and leaned out babbling 'we have to go, we have to go'. So Donna puts the car in reverse, and instead of backing out, slams on the gas and plows into a huge bush, which smacks me in the face. I cannot describe the terror i felt. I began to cry. i was so lost and afraid. I balled while Benny and Victor laughed and Donna apologized. Later on, in the car, Victor was describing how as a child he couldn't pronounce the letter R. I immediately began to laugh hysterically, completely coming out of the hole i was in. We decided that the other girl, Kim, would stay with us for the duration of the trip. We had no idea what we were getting into.</p><p>When we arrived at Victor's house i sat on his back porch. Spotlights were shining down from the sky and i could see monsters and spirits in the leaves in the trees. I was still afraid. When i entered the house the tiles in the foyer shifted and gave way beneathe me. I did not regain my composure until i was upstairs on the couch, Mark Farina on the stereo. This is where the most amazing experience began for me, a complete 180 from what had just occured. </p><p>Kim was laying on the floor, and as i stared at her (she was very attractive, young with incredible breasts) she morphed into a little girl sitting in her room, who shifted into a black girl with an afro listening to a record player. The entire room around her shifted right along with her through different time periods. She had an incredibly tight shirt on and it had a picture of a ninja turtle on it. Victor and i laughed for at least twenty minutes, because the turle seemed to bulge and dance on her shirt. 'God i love being a turtle!' we screamed:) I stood in a corner of the room, and found that by pressing down with my foot i could bend the room. I made dust levitate with my hands and spun it around in mid-air. I lay down on the floor, and i found myself instead lying on a creek bed, looking up through the water at the sky. There were clouds and blue sky and a bright sun, no ceiling at all. I could see reeds jutting out from the river bank. Fish swam by. Kim threw her leg over the edge of a chair to my right, and the chair morphed into a long wooden dock, with kim dangling her legs down into the water. I felt so cool and relaxed. i felt at peace there underwater. i could breathe normally and watch everything without the least bit of fear. i began to play with kim's feet, rubbing and massaging them. I began to see planets orbiting around her toes, tiny meteors and stars and her feet became the universe and i got closer and closer and closer.</p><p>I began to feel as though i needed to be alone. so after convincing everyone that it was fine i went out onto the second floor porch. I looked over the railing and saw a hole dug into the garden below, a body in a sack curled up next to it. At first i was afraid, but then i realized what was going on. That was my old self, my old body before this amazing trip. I had reached a new level of awareness and this old self was being cast back to the earth. it was a very beautiful moment for me. I watched the body enter the grave and plants grew up over it. A river appeared before me and i washed my hands in the river. AS i had experienced this, a shaft of light had flashed in the sky repeatedly. I am not religious, but i reached an inner peace with part of myself because of that vision.</p><p>After retreating to the computer room and chatting online for a bit, i found a pen and began to write. i was still touched by my experiences outside, and i began to write 'thank you' all over the desk with a purple marker. Soon i could see tiny fuzz balls spinning on a grid inside the ink, and i flew down close and close as the ink swirled and formed patterns. I cut up a board game, producing a piece of cardboard that read 'the original memory game'. Kim came to visit me and after flirting with her for a bit we went back to join the other two. I hung my sign on the wall, where it remains to this day. Victor and Kim went off and Benny was watching Fantasia, so i sat down on the floor with Benny and we started to analyze the film. I have never seen anything more amazing than 'fantasia'. Never. 'A night on bald mountain' blew my mind. Benny and i bonded and began to get philosophical.</p><p>I should mention at this point that time had no meaning. I know the experience began about 9pm and only truly ended at 2pm the next day. We were lost in a globe out in space, our experience was completely detached from human convention. I really believe that now. </p><p>It was then that we learned from Kim that Victor had taken a fifth sugarcube (remember that extra one?)while we were outside smoking. Its amazing how little impact that had on us. we figured that he was having as good a time as us. Benny went into Victor's room with Kim while i squeezed myself behind a chair and began to fantasize as 'some things come from nothing' began to play. The music that entire night became a perfect soundtrack, following our moods to the letter. It is a beautiful song and i saw tiny people on the tops of the chair throwing things down to me on the floor. Benny came out and laughed, then changed the cd to medeski martin and wood (combustication). </p><p>Victor emerged from the room and sat down with a cig while we bugged him about taking the last cube. He was acting weird. Apparently he had been in his room with the light off, headphones on, and the door shut. He had been trying to hook up with Kim as well. He would only say 'oh'. we couldn't get him to say anything but 'oh'.</p><p>yes, this is where it got bad. Benny began flipping out, demanding that we tell him in detail what had happened during the night. I was completely cool by contrast, saying everything was fine. I didn't trust Kim. I was convinced she had taken some acid. I was fucked up but had convinced myself i was rationale. I told kim to take benny out of the room to talk. Meanwhile, Victor had curled up at my feet (i was sitting) and was stroking himself through his pants, chanting 'oh' in rhythmic patterns. i couldn't help but laugh. it was repulsive yet so brutally stupid that i had to laugh. Then the worst thing happened. Victor raised his head and plunged his hand into his mouth up to his wrist. i pulled it out quickly, but to this day i still don't know if that really happened. he says he was trying to kill himself because he thought he was insane.</p><p>Victor had a true bad trip. We had to call his brother, who arrived and brought us all down to his house five minutes away. We watched 'the big lebowski' and gradually Victor came back to us. He grabbed my leg and said 'douglas is that you? are you really there, right now?' i assured him that i was and he laughed out of sheer relief. we stayed  for a little longer and then made our way back to Victor's house to collapse from fatigue. At 12.30pm saturday i awoke and went home still in a daze. I went back to sleep.</p><p>There are two things i will say about this experience. </p><p>1/ BE RESPONSIBLE!!! despite my good times, alot of bad shit happened. best to be prepared. Have a COMPETENT sober aid if the trip is a big one. Have an emergency plan, like someone you can call (luckily we did). and above all PLACE YOURSELF IN SAFE, COMFORTABLE SURROUUNDINGS. also....if you are taking an unknown amount of acid, try a small does first or ask around about the hit you got. I have never had sugar cubes as completely potent and saturated with LSD as those. I had tripped at least four times prior to this experience. had i known better i might not have taken all three at once.</p><p>2/EVERYONE SHOULD TAKE ON SUCH A HUGE TRIP AT LEAST ONCE. with the right environment and support you can completely expose your soul and rearrange your life in a positive and real way. i became much more sure of myself and socialable than i had been. many of my burdens from the past were lifted from my shoulders and thrown away.</p><p>While i was tripping on that back porch i had believed that i would never come down and that i had reached a new and permanent level of conciousness that would stay with me forever. Sometimes i really do believe that is true.</p><p>Thanks for reading.</p>"
}
