{
 "title": "Never the Same...",
 "author": "Dionysus",
 "citation": "   Dionysus. \"Never the Same...: experience with Diphenhydramine  (ID 64889)\". Erowid.org. Oct 28, 2009. erowid.org/exp/64889",
 "substance": "Diphenhydramine ",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 64889",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 28, 2009",
   "Views: 18734",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAnother night just like the rest. Depressed, tired, and basically pissed off at the world. Unfortunately this night would be the beginning of a totally new problem. <br>I had been using Diphenhydramine (DH) twice a week, for almost a year. I never expected any major side affects, I could deal with the insanely dry mouth, and constant urination (which hurt like hell). What I couldn't deal with, and am still having a trouble dealing with are the permanent hallucinations. At first 'seeing shit' was fun, you know 'life's being a bitch, why not go trip on DH, escape reality for a little while'. I didn't mind the hallucinations, the spiders, mice, cats, dogs, people, even Pinhead from 'Hellraiser' (yeah, I thought my mother was Pinhead one night). I did not mind them because deep down I knew they would be over once I overcame my mind and assured myself they weren't there. But now, sitting here at my computer afraid to look outside the window, not knowing what will be looking back at me... Well, that my friends is not fun. <br>Remember hearing your parents say 'It only takes one hit'? Well believe it or not they were right. Like I stated above, I had been taking DH some time, and in that time I never had any side affects, aside from the minor ones which are normal. All it took was one hit, my regular dose 1000mg, after that everything changed. [Erowid Note: 1,000 mgs of Diphenhydramine is considered a very high dose, see Diphenhydramine Dose Chart.]  I still see things. Not all the time, but a lot of the time. I walk around people who are not here, avoid benches which are not actually in front of me, hear voices when I am alone. And now recently I have been blacking out, not knowing what day it is, and not being able to tell what was dream and what really happened. I had a nightmare about my girlfriend being raped and murdered, and spent nearly a week wondering if it really happened. It drives me mad. <br>Unfortunately I have not stopped taking DH, I have cut down to about once a month. But as stupid as it sounds, it has become a crutch for me. It helps me escape the shitty reality I am living in and takes me to a place where nothing matters. I won't lie, I love it.\n\n\n"
}
