{
 "title": "An Night of Epiphany",
 "author": "A Spiritual Pirate",
 "citation": "   A Spiritual Pirate. \"An Night of Epiphany: experience with MDMA (Ecstasy) & Cannabis (ID 64954)\". Erowid.org. May 17, 2010. erowid.org/exp/64954",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64954",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 17, 2010",
   "Views: 2805",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This weekend offered me a chance to have a little bit of time to myself, and offered also the opportunity to ingest MDMA for the first time. I won't go into the first night (I'd gotten two nights of being able to experience) as the first night does not compare in knowledge learned.</p><p>On the second night, after getting home from a long road trip up north, I took a shower, changed clothes, then turned on the tv to relax. I'd packed a fair sized bowl and had my second pill sitting by my side. First pill had a 'W' on it, this one had a star. Couldn't tell you what that difference meant, but the star was a more intense punch, and I'd been told as much by my friend (let's call him D). Ingesting the pill and smoking the bowl, I immediately became relaxed. I turned off my computer and put on the movie 'The Cell'. I'd been debating over what movie I could watch that would be good as I've a lot of movies, so I went with that one.</p><p>During this time, my trip starts to become more body intense. By intense I just mean a whole sensation of feeling all over, but not feeling really anything. Like a sensation of floating, but you know that you're still in contact with something. As I'm watching the movie, it starts to become clear to me-I need to become a dream therapist. I know it may sound a little different, but as I watched the movie, I understood everything in such a more clear picture. I understood how it was signifying I should be getting into what I want to do, something I'd truly be interested in. So I made that decision that night and said the next day I'd look up what colleges that offered something like that. I found a place and have info on the way...</p><p>As for my second epiphany, I laid down after the movie was over, as nothing else was on tv worth watching at 3 am. I was on my back with pillows under my calves so my feet don't have pressure on them, and I do the same with my hands. Before I laid down, I said a prayer out loud to my dream catcher above my head, to catch and let me have beautiful dreams of being in the astral world. the sensation on my fingers of touching the feathers felt like little gusts of concentrated air being blown on the tips, it was truly interesting. So I lay down, close my eyes, and start letting my mind do what it does. I sensed something different in my visuals behind my eyes (usually star light images or fractal patterns) but tonight it was as though the patterns and stars were constantly turning into thinly-lined neon tubing.</p><p>While all this is happening, my ex shows up into my consciousness. Now I've thought of exes before, but this wasn't of my doing. She spoke exactly like she would have, not by my own influence, and it was then that she explained I've found a way to open my mind to get to the gatekeeper, which she was. She said the gatekeeper won't always be her, it's just the best image my mind could come up with to get my attention. I was told that I can't be lied to by the gatekeeper, as they are to be wholly honest with me, no matter what the instance. As we talked on, she become other people or beings I'd known or thought of, all telling me something or other.</p><p>I say this truthfully in that I had no responsibility with my thoughts. I could think for myself, and these people/images were thinking for their self. Almost as if my mind took everything I knew, and everything I knew about them, and would allow the answers to flow with truth instead of being skewed from my point of view. That probably sounds strange but it is the best way I could explain such an impression. After it had shown me enough or told me enough, the image (as I can't remember which person it was) told me to let my mind know I am taking control of my dreams from now on. That every night I will choose how my dreams will be, and my mind will be forced to fall under my will, as opposed to being under its will.</p><p>With this, I remember falling asleep to a degree, and the most amazing things happened. It felt as if my eyelids were made as a sheet of smoke, that started opening slowly but surely. What I saw was all kinds of electrical sparkles all over my field of view, which I realized was my immediate space around me in normal time. I was seeing through my eyes, but was clearly asleep. I knew that was the case. And I almost managed to 'roll out' of my body to get up, but I think my apprehension stopped me. I remember then floating up to my ceiling, and I could hear myself telling me to turn over so I could see me lying there. I did and it was really hard to see me, but I managed to make out my form. Looked almost like if the skin of my body and face were always blurred or out of focus. I think maybe again it was from my own apprehension of thinking I could see my own body and I achieved what I did. That's pretty much the last I remember of that experience.</p><p>It's now roughly 36 hours of so since I last took the MDMA. I was very nervous at first for doing it, because I'd experienced my last drug and it had a very bad trip that came with it. This time though, I've felt a sense of clarity in my life. I know it seems odd, but it does feel that way. I've read how people can have a better realization about their lives after doing certain things, but I didn't know it would happen to me. Nothing should be illegal if you are responsible to self, responsible for your actions, and responsible for your consequences. I freely chose to partake in these experiences, and I believe with due diligence, substances can help open up my mind to it's greater self. I am not a loser, I am not a threat to society. I simply ask all to allow my life to be mine, and your life to be yours....</p>"
}
