{
 "title": "Felt Like a Hybrid Human",
 "author": "Herr Mannelig",
 "citation": "   Herr Mannelig. \"Felt Like a Hybrid Human: experience with H.B. Woodrose (ID 64963)\". Erowid.org. Feb 27, 2008. erowid.org/exp/64963",
 "substance": "H.B. Woodrose",
 "bodyweight": "224 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   " ",
   "4 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 64963",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 27, 2008",
   "Views: 2972",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well I recently had bought 50 H.B. seeds from a reliable vendor. And me and my friend (we ill call him MR. T) had made plans to use them that day. So when he was on his way I threw 4 seeds in my mouth chewed and swallowed. Now I have taken morning glories before 300 seeds to be exact (nothing happened...nothing at all) and they tasted like shit. So much so that the next time I wanted to try them I couldnt the taste made me gag . The H.B. didnt taste bad at all the chewing part was a little difficult they seemed rock hard.</p><p>By the time MR. T got to my house I felt pretty ill. (probably because I didnt wash the seeds off) but it wisent to bad I could steady it just by breathing. But when we got to his house about 10 mins later the sickness was pretty much gone. Then I took the bag out and divvied up 4 seeds for him and four more for me. This time though we washed the white shit off of the seeds. I wasnt rely keeping track of time but about 10 minutes after he took the seeds I could feel it coming on. It was similar to MJ but rather different (if that makes sense). Things took on a new perspective, colors seemed different and my pupils were fully dilated almost no cornea at all. We decided to go swimming. By that time I was almost at the peak of the trip.</p><p>When we got in the pool the water felt very strange. Felt like jello. When I closed my eyes under water I saw multi-colored swirls thats seemed to move around each other. When I came up I looked at the sun there was a small cloud over it and it was setting a little bit. Its was changing color green blue red orange ect. Mr. T I guess wasnt experiencing the drug yet and besides he only took 4. But he was getting angry with me because I was in the pool and not spending time with him. But I was tripping to bad to care. When he was trying to get me to come inside I was looking at him and there seemed to be a yellow aura around him it was very strange. By the way this whole time I rely didnt say anything to him. I guess he got angry and headed inside I must have been outside for at least a half an hour. I felt that I was like a hybrid human I went underwater, it felt like I could hold my breath forever (but I didnt chance it) every time I closed my eyes I kept seeing the same swirls of color....magnificent. </p><p>When I decided t get out if the pool I sat down and stared at this tree....it think it was trying to communicate...I walked up to it and touched a leaf....I dont know how to explain it. Then next thing I know Im on my hands and knees staring at the wood porch. I felt like something was watching me (not in a bad way like paranoia or anything) I asked who are you who are you and kinda came to the conclusion that it was me...but not.... I came inside and watched some TV (kinda brought me down) and we d3ecided to make some food it was like one of those bags with some noodles and veggies with like no nutritional values at all. Just pure MSG. After it was done we had a big bowl each I could barely pick up the fork it was odd I felt 'weak' but I knew I wasnt. But anyway we both fished eventually. Then we got to talking (this is like 2 hrs later still peaking) about the universe life death god hell heaven. And the TV was on and I was like.....dude...urn it off. So he did. Then we were talking about space and where we go after death. I picked up a broom, and looked at the handle it seemed to like grow and crawl (looked exactly like shit dose after staring at a spiral for awhile then looking away)...also his couch seemed to change hue...then he asked for the broom. </p><p>And...well he explained the universe.....we think that when u die u reach the end of the universe (or at least what we know as it) because we as humans cannot comprehend nothingness  so once u die u are instantly reborn...may not on earth again but reborn. Like on the old Mario game when u go to one end of the screen u pop up at the other. After that we sat on the couch and kept talking about shit like that. And people drugs and why we feel and such.</p><p>All in all I would say this was a very good trip I plan to do them again very soon.</p><p>Thanks for listen</p><p>Peace, love, drugs, Terrence mckenna And bill hicks....and black metal</p>"
}
