{
 "title": "A Little Happiness Stayed With Me",
 "author": "Anonymous",
 "citation": "   Anonymous. \"A Little Happiness Stayed With Me: experience with Ecstasy (ID 650)\". Erowid.org. Oct 9, 2000. erowid.org/exp/650",
 "substance": "Ecstasy",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 650",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 9, 2000",
   "Views: 6717",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've done my share of drugs in the past, after laying low from to many bad trip of LSD I put the mind games aside. I've told myself that I'd never do drugs again after a long battle with depression a bunch of other personal crap. So I dont know what came over me, I ended up at a outdoor gathering with a bunch of close friends and decided I should see what the hype was all about. After a half hour or so of taking the small pinkish pill with a mickey mouse face on it, I started feeling a tingling sensation run through my body, eventually things turned sensational. I felt as is my arms were floating, I kept reaching for the sky and taking the most incredible deep breaths I've ever taken, everything was perfect. </p><p>A few hours later a friend came over and handed me another, we had to feel that rush again. This time it was intensified, I sat by the fire the whole time, total sensory overload. Again my arms reached for the sky, I could not speak and could only mumble words when spoken too. Touching and hugging was like something I'd never done before. The full moon, storm filled clouds rushing by and occasional lightning strike made me realize how beautiful and amazing life really is. I felt so connected to everything and everybody, something I've never felt before. </p><p>Now, the third pill... again the same friend came and gave me yet another. I think I should of stopped at two, this time i felt nauseated and nothing more for quite awhile, thats until the ride home a few hours later. It hit me like a truck, but this time I was cornered in a vehicle spilling my guts out to someone I deeply care for and love. I said things I probably should of kept to myself, but there was nothing I could do under this truth syrum of sorts. I turned into an emotional wreck on this third pill of X, and it almost destroyed a friendship that I cherish dearly. The following week I felt very tired and dizzy, a little depression would set in but thats just the normal me. </p><p>But now there's something that's stayed with me, a little happiness, I still can take a deep breath and feel the wonders of the world that I've taken for granted even in these messed up times. I will never forget that night, I'm not sure if I'll take X again, but if I do I hope I stop at one.</p>"
}
