{
 "title": "The Craziest Plant Ever",
 "author": "Mike",
 "citation": "   Mike. \"The Craziest Plant Ever: experience with Salvia divinorum (ID 6505)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6505",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6505",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2002",
   "Views: 4492",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI recently express ordered a half ounce of Salvia from an internet company. I was very sceptical about the whole idea that a legal hallucenagen could exist.  </p><p>The first night I recieved it I was so excited.  I got out my shotty and packed the bowl.  I hit it as hard as I could several times and felt nothing.  In fact, I smoked a quarter ounce on the first night and felt nothing. Finally, out of desperation, I decided to look on the net to get some tips.  I found that the only truely effective way to adminster this leaf is through a bong.  After I relized this, I tried again.</p><p>This time the most profound experience of my life occured.  I was sitting on the edge of my futon and had just taken my second hit from the bong.  I remeber thinking that I had better take another hit when suddenly I noticed that the floor in my room had risen up to my knees and my legs were stuck inside the tiles.  I became overwhelmed with fear.  It was like being in a nightmare.  I tried to convince myself that I was sleeping but I knew I was awake.  After about a minute of terror I saw the bong in my hand and relized that it was the Salvia.  I began to calm down and decided to sit Indian style. </p><p>After sitting there for a minute, I started to feel as though my soul was trying to exit my body.  I became frightened again and had to fight to keep it in my body for about five minutes.  It finally wore off and I was fine again.</p><p>In retrospect, the memory of it is really cool.  I can't believe that it actually had me convinced that my legs were stuck in the floor.  Even if a sitter was there, I don't think that they could have convinced me that it wasn't so.  As for my soul, next time I will use a sitter and just let it go.  This drug is for real.</p>"
}
