{
 "title": "Papers Can Hit Harder Than Gels",
 "author": "TripleStacked2k",
 "citation": "   TripleStacked2k. \"Papers Can Hit Harder Than Gels: experience with LSD (ID 6506)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6506",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6506",
   "Male",
   " ",
   "Not Given",
   "Feb 28, 2002",
   "4728",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis was about my seventh time Tripping on LSD. After doing many purple geltabs, which i found to be very powerful, and not tripping off the papertabs I've taken, i thought papers were useless. But I was wrong, I just hadn't found the right ones yet. That is until this weekend a month ago.  A friend of mine had a little house party in which 10-15 people come, drink, smoke some maryjane, and socialize. He throws these get-togethers often. Well.. I am 17 and was almost a full blown alcoholic, so I eased on it and got into LSD, MDMA, etc... So me, and 3 other friends decided to get some Acid, while everyone else drank. (Something we do quite often)</p><p>Me and JB road over to a friend of his, getting a total of 20 hits. (10 were for money-making purposes to pay for ours.) This was Jonathon's first time tripping. While at the dealer's house, he specifically said, 'I don't care how much you usually take, do NoT take more than two of these.' This means alot coming from him, a daily tripper.</p><p>Well, I'm not one to follow standards, so i took my 5. Derek took 2, and Jonathon took 1. We lost JB somewhere along the way. I went to a bedroom alone and turned on the strobe and some techno. Regular house shot mostly. I waited a half hour and just had that queezy feeling I always seem to get in my stomach before I trip. I was trying to make myself trip, by staring at things in the room hard, and zoning out(when will I learn to just sit and be patient). Well after that half hour i got up and went to the living room where everyone was watching 'body shots' a clubbin' flick. Although i didn't like this atmosphere of no music or pretty lighting effects, i layed on the floor and watched on.  Then the shit hit me so hard, I haven't ever felt like this before. For the first time in my life I got the thought for a split second, 'maybe I took a few too many'. But that thought disappeared within about a minute. Things in the house that usually only became visual for certain periods of time were constantly flowing and moving. The carpet was seemingly alive, and I found myself to be doing odd things. </p><p>This Acid was so different to me, It gave me a very strong body trip and mental trip, along with more visuals than the other acid I've done.  My body was feeling very weak yet so amazingly tingly. Like a shiver, but constant.  The sky became a flat purple color, and trees were flat black and cartoony. I am not used to this, but I was enjoying myself. We ended up having to leave ( drunk people need sleep) around 2am.  Driving was so scary yet completely amazing. I've ridden while tripping before, but this seemed different. We landed at an abandoned trailer on a backroad right behind a wild animal park.  The sounds of peacocks were so odd to hear while tripping.  Then my vision became completely altered, I was seeing things in like a purple writing, but shaped the way they really were supposed to be. Like comparable to the writing in the film 'MATRIX'. I was stunned, and this made me and LSD a closer companion. The night went on till about 7:30am, which started at about 11pm. The outcome was, we lost Derek along the way, and it was me and Jonathon at a gas station about 45 miles away from home. We had the ridiculous idea to follow a semi on the interstate to see where he was going.  After it war off, I had no come down, or even a burned out feel. I was amazed, and because of this I love LSD more than ever. </p><p>Ever since my first trip I had a different outlook on everything. Ever since this trip, I didn't have a comedown at all. So, I found a great companion.  Enjoy your LSD everyone, and please be safe. Driving is not a good idea and we shouldn't have done it. Thanks.</p>"
}
