{
 "title": "Over and Over Again",
 "author": "Sasquatch",
 "citation": " Sasquatch. \"Over and Over Again: experience with 2C-I (ID 65069)\". Erowid.org. Sep 6, 2007. erowid.org/exp/65069",
 "substance": "2C-I",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "65069",
   "Male",
   "",
   "Not Given",
   "Sep 6, 2007",
   "3553",
   " "
  ]
 ],
 "report": "<p>Setting: Close Friend's Apartment</p><p>Set:  I was in a good mindset.  Thinking about what was to come.</p><p>To start out, my experiences with Psychedelics was very limited at this point.  I had done Acid once, DOC twice, and Peyote once.  We had decided to do 20 milligrams but G had forgotten the ratio that he measured out for this certain substance.  We later learned that it was 30 milligrams we had ingested.</p><p>Soon after we had taken the drug my sister showed up still drunk from a bar.  She asked what we were doing and we informed her.  She asked if she could join and we told her that we didn't think it was a good idea.  But if she still wanted to when we decided to do it again that she was more that welcome to join us.  So she dropped it and we packed a bowl.  By that time I was starting to see some patterns on the wall.  I was coming up a little faster than I had anticipated.</p><p>For the next little while it continued to come on faster and faster.  I looked over at my buddy G and asked how he was doing and he told me he was doing good.  I was fine with the intensity level I was at and I kept telling myself that it wasn't going to get any stronger.  I was wrong.  My sister kept bugging us to have some also so we finally gave in and gave her what we thought was 15 but turned out to be around 20.  We threw on some Pink Floyd and just let the time pass.  By the time the Pink Floyd album was halfway through I had gone from a ++ to a +++ and was still coming up.</p><p>I told G that I needed some air so I walked outside.  He came out with me and asked me if I was ok and I told him I think so.  He also asked something to the effect of why did we give your sister drugs.  I told him it was probably a bad decision but that was nothing we could do about it because it had already been done.  We walked back inside and I was greeted by my sister asking what she could do to get the drugs out of her system as she was not having a pleasurable experience.  I told her she would just have to ride it out.  It would be over in about 8 hours.</p><p>The next think I remember is sitting on his floor playing with a slinky just chillin.  I looked up at geoff and had the realization that there is a force that no one can control called gravity.  Then I dropped the slinky on accident and exclaimed 'Gravity sucks'.  My sister was sitting on the bed when she said for the first time that it had been 7 minutes since she looked at the clock last.  She said this for no apparent reason and I just let it go in one ear and out the other.  Then sure enough seven minutes later she said it again.  This time I looked at the clock and it was 3:30 in the morning.  About 3 hours after we had dosed.  This was the last time I can remember comprehending time that night.  G had gone to the kitchen to get some water or something and when he came back in the room he waved his hand in front of his face and I saw the trail of his hand for what I thought was about 5 minutes.</p><p>The next thing I remember I was staring at his computer and the whole wall around the computer started to swirl around to the point where I couldn't tell what was wall and what was tv and dresser and so on and so forth.  I stared at that for a little bit then blinked my eyes and it was back to normal.  All the sudden when I blinked my eyes my sister had said it had been seven minutes again.  I looked up and the clock and didn't know what the numbers up there meant.  At this point I started to freak out a little.  I stood up and walked outside again.  When I came back in she had reminded us it had been seven minutes again.</p><p>At this point I thought time was in a loop.  I kept saying I need to do something I have never done before, and asking to talk about stuff we hadn't talked about already.  This went on for about 2 hours.  I had to watch the clock and make sure the numbers didn't repeat themselves.  I finally gave up and said fuck it and laid down on his floor and waited for the sunrise.  G who at this point I think was realizing that we had taken more than we thought we had was saying that the sunset was going to blow our minds and kept asking if we were ready for the most glorios sunrise we had ever seen.</p><p>For the rest of the night I just kept telling myself that when the sun rose it would all be over.  By the time the sun rose I was starting to come down a little and was regaining my sanity a little at a time.  I finally realized that I had just tripped out harder than I ever had in my life.</p><p>All in all it was the scariest night of my life.  But I made it through and I would do it again if given the chance.</p>"
}
