{
 "title": "A Very Good Pick Me Up",
 "author": "Psych0naut",
 "citation": "Citation:   Psych0naut. \"A Very Good Pick Me Up: experience with Sceletium tortuosum (ID 65080)\". Erowid.org. Feb 19, 2008. erowid.org/exp/65080",
 "substance": "Sceletium tortuosum",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "insufflated",
   "Sceletium tortuosum",
   "(plant material)",
   "  T+ 0:24",
   "100 mg",
   "insufflated",
   "Sceletium tortuosum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65080",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 19, 2008",
   "Views: 30209",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI wanted to have some more experience with different ethnobothanicals, the only ones I had tried up till now were cannabis, kratom and salvia divinorum. So a few days ago I bought a gram of Kanna in the smartshop. I am going to try it for the first time, hoping it will have some good effects, since I don't have to much faith in ethno's to be honest. Here is my experience with Kanna.\r\nT 16:33 I snorted 100mg of Kanna. Even though the stuff is natural, it just doesn't feel natural to me to snort crushed leafs, while snorting synthetically produced chemicals does. Probably just my weird nature. The stuff burns quite a bit, around the same intensity as amphetamine sulphate. It's a large volume of powder, so it's pretty hard to take large amounts the nasal way.\r\nT 16:36 I feel the first hint of a effect. I notice a really light feeling of stonedness.\r\nT 16:39 I am starting to feel a weird, though pleasurable electric tingle halfway down my spine. It's a buzzing feeling.\r\nT 16:43 The buzzing feeling has subsided and the stoned feeling hasn't increased either. I hope I'm gonna notice some effects or my faith in ethno's will be lost probably. We'll see what happens in the next hour.\r\nT 16:53 I still don't notice a thing except for the barely noticeable stonedness.\r\nT 16:57 I snorted another 100mg. This time it hurts much, much more. This is hell. It felt like snorting some 2C-x. Fortunely the burning pain only lasts a short while, it's gone in no time.\r\nT 17:04 Still not feeling any noticeable effects, except for a congested nose. This stuff is not worth doing again in my opinion.\r\nT 17:09 Still not feeling anything. I'm not very happy with the fact I threw away my money by purchasing a very expensive gram of rubbish herb.\r\nT 17:14 I'm only feeling a slight buzz, though barely noticeable. I don't feel any stimulation nor did I feel a rush during my whole trial with kanna. This is deemed for the rubbish bin.\r\nT 17:19 Now I'm thinking about it, I'm indeed feeling something. I feel relaxed and calm, and I feel a subtile though nice body buzz. It's still nothing to write home about, but I think it has more to do with the fact I'm spoiled by the experiences with strong chemicals. For someone with little experience with drugs, the experience will probably be apreciated more.\r\nT 17:24 Now I'm reading Erowid's experience reports about Kanna, I notice the true effect of Kanna much more. A mood lifter. I wasn't in a bad mood to begin with, but it has certainly improved by the Kanna. Though I haven't noticed any of the rushes other people experienced from Kanna, I certainly agree it's a very good 'pick-me-up'\r\nT 17:30 I have just read the wikipedia page about Kanna, and after I had read the effects I'm appreciating Kanna even more. It's a really nice subtile substance for after a hard days work, when one just wants to relieve tension or stress. It's very effective in elevating mood, as well as a really useful de-stressing agent. The only downsides are it's relatively high price, and the way of intake, snorting powdered herb is not pleasant, at all.\r\nT 17:40 The feeling of relaxation is still noticeable, though slowly subsiding. But I was in a good mood before trying the Kanna, so I probaply won't notice it very well when I'm on baseline, it'll be a smooth transition.\r\nT 17:50 The effects are still slowly subsiding. I'm going to try Kanna again in the near future, next time in a larger dose, and sublingually. I call it a day with my experiment.\n\n\n"
}