{
 "title": "Beware Before Stopping a Trip",
 "author": "mind mapper",
 "citation": "   mind mapper. \"Beware Before Stopping a Trip: experience with LSD & Quetiapine (Seroquel) (ID 65108)\". Erowid.org. Jun 26, 2009. erowid.org/exp/65108",
 "substance": "LSD & Quetiapine (Seroquel)",
 "bodyweight": "138 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 hits",
   "sublingual",
   "LSD",
   "  T+ 4:30",
   "100 mg",
   "oral",
   "Pharms - Quetiapine"
  ]
 ],
 "footer": [
  [
   "2007",
   "65108",
   "Male",
   " ",
   "Not Given",
   "Jun 26, 2009",
   "17536",
   " "
  ]
 ],
 "report": "<p>I have a good deal of experience with LSD and other mind-altering substances and have never once tried to intentionally stop a psychoactive with another medication.  This was my first time doing it, and the results were quite surprising.</p><p>T=0 I ingest 4 hits of quite strong LSD sublingually allowing them to move around for approximately 5 minutes before swallowing them.</p><p>T=2.00  I am having an excellent time, walking around in a park and eating ice cream, quite typical results from LSD, euphoria shifting distortions, time and perception change.</p><p>T=4.30  I realize I need to return home and wanting to discontinue my trip, I ingest 4 25mg pills of Seroquel which I had been prescribed about 7 months back.</p><p>T=4.45  My happiness is starting to get sucked away and is being replaced with feelings of fear and depression, the hallucinations/distortions  are even more pronounced and have taken on a less 'intelligent magnitude'.  I am seeing large color shifts in reality of my surroundings and a physical body load is getting very pronounced, riding my bike is no longer safe and I start to walk it back to my house.</p><p>T=5.00  I feel like shit and am experiencing temporary black outs,  movement is difficult and everything seems to have taken on a 'stupid' feel. Rather than having closed eyed visuals of fractal patterning mixed with mathematically irrational expressions, and exploded views of my mind with angelic tendencies, I now only see a single color.  Open eyed vision is heavily disrupted, yet my pupils have constricted back to what they would appear as when I'm sober.</p><p>T=7.00  Thank god the Seroquel's effects seem to be stopping, I still feel dumbed out, creative thinking is incredibly hard.</p><p>MORAL:  Seroquel did absolutely nothing to revert me back to baseline, although my pupils were no longer dilated.  I put a substance into my body I am in it for the long haul. I really hope they don't use this medication for people who are brought to the hospital suffering from intensely powerful trips.</p>"
}
