{
 "title": "Long-Term Auditory Problems",
 "author": "Boxarity",
 "citation": "   Boxarity. \"Long-Term Auditory Problems: experience with DiPT (ID 65122)\". Erowid.org. Aug 23, 2007. erowid.org/exp/65122",
 "substance": "DiPT",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 65122",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 23, 2007",
   "Views: 9909",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I gained a quantity of DiPT (around 2g) last year and took it at various points throughout the year experimenting with the audio effects.</p><p>The lowest doses (~15mg) produced entertaining audio effects, mild round-ish visuals and a mild body high. One thing to note is the taste. DiPT is in my opinion the most horrific-tasting chemical to grace the earth and I get a big shiver down my spine as a reaction to the memories of that taste.</p><p>The highest dose of just over 150 mg left me unable to move on the floor with the walls smeared red and voices in the corridor outside echoing into the distance and impossible to discern.</p><p>I spent a lot of time listening to the effects DiPT had on my perception of music, and found it followed exactly what has been described previously, pitch drop that varies dramatically depending on the original note. However I did note that a lot of songs I listened to on DiPT are now perceived by my brain to sound a semitone or so lower than 'before'. Speech seemed to obey slightly different rules, with additional factors such as humor entering my perception. Certain words would sound ridiculous, some would sound exactly the same pitch as normal, some would sound like a walrus, things like that. As if the effects on speech being interpreted were more pronounce. Music was just sounds to me, understanding and processing speech was different.</p><p>Since experimenting I've had a number of issues with my hearing, primarily concerned with the symptoms of King-Kopetzky syndrome. This condition causes a reduced ability to distinguish speech when background noise is present. The words are usally clear and easy to hear but the background noise such as other speech, industrial noise, traffic etc., means I have difficulties in processing the words into data in my mind and often have to ask people to repeat themselves two or three times. My hearing is completely unaffected when there is no noise present. This could suggest either damage or alteration to the Broca's area, or at least the conclusion I draw is that Broca's area is one of the major areas of the brain affected by this chemical.</p><p>I would be interested in any information or research that has been undertaken on DiPT and its effects on the auditory system.</p>"
}
