{
 "title": "Never Do It!!!",
 "author": "Shawn E.",
 "citation": "Citation:   Shawn E.. \"Never Do It!!!: experience with Datura (ID 65126)\". Erowid.org. May 1, 2010. erowid.org/exp/65126",
 "substance": "Datura",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 ",
   "oral",
   "Datura",
   "(leaves)",
   "  T+ 0:00",
   "3 Tbsp",
   "oral",
   "Datura",
   "(seeds)",
   "  T+ 1:00",
   "2 Tbsp",
   "oral",
   "Datura",
   "(seeds)",
   "  T+ 1:00",
   "  ",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65126",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 1, 2010",
   "Views: 5915",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIf any one is ever thinking of getting a cheap high and trying this datura, Think Again!. After I first heard of this plant I was very excited about trying it. Well finally my time came. I was by the Delaware in PA and stumbled across A couple plnts. I took 4 pods and a bunch of leaves and brought them home. \r\nI initially started off with eating 3 leaves and a tbl spoon of seeds. After an hour all I felt was a dry throat. So I ate two more spoonfuls and brewed 2 more leaves in some tea. After that I went to go lay down and wait for the effects. Next thing I know I woke up in a hospital with an IV in my arm almost naked in a gown. I was very delierous and stayed there for 2 days. When I got out my dad told me what really happened. He said he took me to the emergency  room  and I kept buggin out and talkin to people that werent there. He said I freaked out because I thought some lady got murdered. He tried taking me to the bathroom but I had no idea how to pee or where I was. We went back to the room and I peed all over myself and started talking all this crazy stuff. I then got transfered to another intensive care unit where I woke up very sick. I heard things, saw horrible images. I almost died that night. \r\nDatura is not a psycodelic drug. It is a very potent poisonous plant. I was lucky. Please anyone thinking about trying this, rethink it could be the last thing you ever do.\n\n\n"
}