{
 "title": "Fun Night",
 "author": "Mordack",
 "citation": "   Mordack. \"Fun Night: experience with Gabapentin (Neurontin) & Quetiapine (Seroquel) (ID 65123)\". Erowid.org. Sep 11, 2007. erowid.org/exp/65123",
 "substance": "Gabapentin (Neurontin) & Quetiapine (Seroquel)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2500 mg",
   "oral",
   "Pharms - Gabapentin",
   "  T+ 0:00",
   "100 mg",
   "oral",
   "Pharms - Quetiapine",
   "  T+ 3:15",
   "1000 mg",
   "oral",
   "Pharms - Gabapentin",
   "  T+ 6:15",
   "100 mg",
   "oral",
   "Pharms - Quetiapine"
  ]
 ],
 "footer": [
  [
   "2007",
   "65123",
   "Male",
   " ",
   "Not Given",
   "Sep 11, 2007",
   "Views: 34627",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was prescribed gabapentin (Neurontin) for a short while to try and stabilize my mood. Unfortunately, it didn't do too much. So they prescribed me quetiapine (Seroquel) for insomnia, and sedation throughout the day.</p><p>So, my trip begins when I get home at 4 PM, my initial dose was 2500mg of Neurontin at about 4:15 PM, I then take 100mg of Seroquel. I read on the forums that it takes a while to kick in, so I proceeded to clean my car out. Working furiously, I finally get it done around 7:30 PM. I was feeling no effects other than the usual haze that comes with Seroquel. I go inside my house and change clothes and take another 1000mg of Neurontin. I pick up around the house, sweep, do some dishes, and put a load of laundry in. If you can't tell already, I compulsively clean. I can't stand being in a 'dirty' house or car.</p><p>I finish all my tasks around 8:30 PM and sit on the couch, take a deep breath and things start to get interesting. I put on some groovy music and a some visualizations. I have a 50' HD TV, and I'm sitting 6 feet away watching WinAmp Visualizations. So I sit there and try and relax, then all of a sudden I start seeing flashes of light in the sides of my vision. I quickly turn my head to see what it was and it felt like it weighed a 1000 pounds. I blink a couple of times and it gets more intense, it feels like the beginnings of a robo trip, hands, feet and face are completely numb. I feel like I'm really drunk, but without the queasy feeling I get when I drink too much. Time is moving very slow, at about 9:00 PM I can barely walk, running into walls, laughing, dancing. I feel like I'm on top of the world. I have no drowsiness. I'm completely awake. </p><p>At about 9:30 PM, my wife calls. I tell her what I did and she laughs, we laugh together for what seemed like and eternity. So I sit and talk to her while smoking cigarettes on my front porch. It seemed since I was concentrating on the conversation I lost some of the effects for a while. Every time a car would pass, I'd see long white tracers and then long red tracers as it rolled by. These tracers were accompanied by the flashes of white light. I talk to my wife for about an hour, and tell her I'm going to bed. Yeah, right! like I'm going to waste this perfectly good trip by sleeping. </p><p>10:30 PM I take another 100 mg Seroquel, and sit and listen to Japanese pop music. this are really getting intense now. I can hardly stand up and the flashes of light are going every two or three seconds. Things start to move, the walls are breathing, the dvds are pulling them selves out and sliding back into the shelves.</p><p>11:00 PM I've lost all touch with reality, I sit like a zombie and stare at the TV and listen to music. I've lost the ability to walk or even stand, but fortunately I've prepared some essentials (Water, Cigs, Phone) next to the couch where I now lay with open and closed eyed visuals.</p><p>11:45 PM This is the last time I look at the clock, I can't move anymore. The ceiling is coming down to crush me. This is the last thing I remember. Next thing I know, it's light outside and I'm in a ball on the couch. My cell is blowing up from work calling telling me I'm late. I stand up still feeling the effects really bad. But after my shower, I feel better, more able to handle any situation. So here I am, writing down what happened.</p><p>Summery: I think the Neurontin was most directly responsible for the entire trip, and the Seroquel was an enhancer. It seemed that when I was doing things, it effects dampened some, but when I sat and relaxed it came on really hard. This is something to keep in mind if you take it and go to a party or something like that. All and all, I think it was really fun, and I'd do it again anytime.</p>"
}
