{
 "title": "Seeds On A Full Tummy",
 "author": "Mr.Interested",
 "citation": "   Mr.Interested. \"Seeds On A Full Tummy: experience with Datura (ID 65148)\". Erowid.org. Aug 16, 2007. erowid.org/exp/65148",
 "substance": "Datura",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 seeds",
   "oral",
   "Datura",
   "  T+ 2:30",
   "20 seeds",
   "oral",
   "Datura"
  ]
 ],
 "footer": [
  [
   "2007",
   "65148",
   "Male",
   " ",
   "Not Given",
   "Aug 16, 2007",
   "Views: 4030",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So, i've been interested in datura for a while now. I finaly got the seeds on a shaman website and I really researched it a lot. But so I decided one day I would take 5 seeds on an empty stomache. An hour or so later I was feeling wierd. Not seeing anything but I wasnt baseline. So after that went off I just decided I'll try a real dose when I have a sitter. But I just couldnt wait. </p><p>One night after my parents went to bed I decided this was the night. I had recently eaten almost a half of a pizza about an hour earlier. So I knew if the seeds worked at all it would be hours before they kicked in. I planned on taking 20 seeds. I chewed them in my mouth and swished them around a bit. After swallowing I was waiting. And waiting and wating, I waited. 2 1/2 hours later I was still feeling baseline. This was upset. I thought ah well I'd try again on the weekend. But I just couldnt help my self I ate 20 more seeds and waited an hour. I fell asleep. I was extreamly tired from being up all the previous night for a mushroom trip. I hate 2 large bottles of water next to me so if it does kick in during the night I can have a drink. </p><p>When I woke up this morning the water was gone. My shoes are in a different place, my clothes were off and I was laying in the middle of the floor. I bet I had a pretty mild trip. I am known to sometimes sleep walk so this could have just furthered that. Idk. If I did have a trip it would have been better to be awake for it. Oh well.</p>"
}
