{
 "title": "But, It Doesn't Hurt",
 "author": "Normal Joe Bloggs",
 "citation": "   Normal Joe Bloggs. \"But, It Doesn't Hurt: experience with Cocaine (ID 652)\". Erowid.org. Sep 25, 2000. erowid.org/exp/652",
 "substance": "Cocaine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 652",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2000",
   "Views: 9054",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt's not cool, it's not clever and it's expensive.  We all know the stories about drugs and how they fuck you up, but still you have to try it and you do deny it's doing you harm.</p><p>Last year I had a big pay off from my employer and I thought, yeah why not?  I'll buy some coke.  Three and half grams was a cheap deal so that's what I bought.  I didn't last long and me and my grilfriend loved it.  We always have loved it.  But when that had run out, I went again, every other I went for about three weeks.  By this time I had lost weight, me and my girlfriend were arguing about it constantly and money wasn't an issue, but my health, my work and my relationship were going down hill.  For three months solid I bought coke every week and there was not a  day when I hadn't had a line.  Money was still not an issue but my life was.  </p><p>I enjoyed it, but I just remember polishing off three and half grams in one day and being so fucked all I do was sit in front of the tv, my jaw going mad, sweating and trying to calm it down by smoking joints, but that was useless.  I couldn't face anyone, I was a recluse in my own home, scared to answer the phone and scared to answer the door.  So I stopped and all I could think of was calling my dealer and sorting out some more.  I haven't touched it for about 6 months, although I want to.  I did try and sort some out last week, but my dealer couldn't sort it out in time.  I saved money and I felt better.  Coke changes you, even if you don't think it does, or you don't care, it does.  It will change you and you won't like who you become.</p>"
}
