{
 "title": "Her Eyes Swirl With Color",
 "author": "LocalDrugDealer",
 "citation": "   LocalDrugDealer. \"Her Eyes Swirl With Color: experience with Mushrooms (ID 65213)\". Erowid.org. Aug 25, 2009. erowid.org/exp/65213",
 "substance": "Mushrooms",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65213",
   "Gender: Male",
   " ",
   "Age at time of experience: 17",
   "Added: Aug 25, 2009",
   "Views: 2377",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First I would like to give a little background information about myself. I am a 17 year old male with no job and no real life. I have severe depression and take some kind of pill for it. I am 64 and 235 lbs. Not fat but I got a little keg. Most of my days consist trying new drugs and getting as fucked as I can. I have tried drugs from weed to heroin, but through it all shrooms have given me the best experiences. I have done them about 20 to 40 times, I lost count to be honest. </p><p>Now I will get on with the actual trip. Cause that is what you would like to read I know. </p><p>It happened yesterday, my friend from Canada was in and we were sitting in my basement watching A Clockwork Orange with my girlfriend and my neighbor. My neighbor has little experience with psychedelics (only acid once) and the only drugs my girlfriend has done was xtc and speed. My friend from Canada never really did anything other than drink and over the counter pills (percs and shit). </p><p>It was a long week of none stop drugs though, from xtc to oxycontin. So we were all on drain and tired. But everyone wanted to do shrooms and as it is my favorite drug I couldnt say no. I made some phone calls and lucky enough there was an O in town for 220 dollars (which is pricey). Without hesitation I said we will take the whole bag. We drove there excited and with no worries. We totally forgot about being tired and worn. I told everyone this was going to be an experience of a life time. </p><p>I stopped in front of the house with the mushrooms and he walked out and said, These are as fresh as fuck. His eyes had no iris and there was a huge smile on his face. I knew then that they were going to be good shrooms.  We left and headed back to my house and my neighbor divided them into 8 piles. We parked in a parking lot and just looked at them. I made some more phone calls to get rid of the extra half. It sold within minutes after it was all said and done we decided to eat ours. We popped them and everyone complained about the taste. The taste was kind of like dirt. But they were fresh and had a good after taste. </p><p>After this we drove back to my house and walked into my basement. I turned off the lights and lit an incense. I then turned on an aphex twin cd and waited for the effects to kick in. I felt my stomach started to turn and decided I was hungry. We all piled back into a car, but this time my girlfriend drove. We drove to Wendys and when the voice came on my body started going numb and I could feel time slowing down. The ladys voice said, Can I help you? We ordered frosts and some fries and then a man came on and said, Will that be all? We all geeked out and started laughing. Everything was funny. And drove up to pick up window to get the food. We got the food and munched on it. All of our eyes grew in size and we knew we were fucked. We turned on the radio and took it slow. My body was buzzing and my emotions shot everywhere. I was happy then sad then mad. We drove home slowly and went back into the basement with the music. The walls grooved to the melody (odd distortions, bending and such). And the smoke of the incense danced to the beat, it formed smiling faces. The walls changed colored and we all couldnt stop laughing and were the happiest we been all day. </p><p>My girlfriend looked at the time and said she had to go. My neighbor and Canadian friend sat in the basement still staring at the wall. I dont know how they felt at that moment but my body felt like water and some kind of energy was running all over my body as I was an all knowing god. Before my girlfriend left she dragged me out of the basement to go up to my room. We started making out and all of my energy was rushing through my body at a booming pace. It was a constant orgasm. I felt totally connected to her as the walls started to melt and distort. She then said I really have to go (her eyes swirl with color) and I laid there staring at the ceiling. I am not exactly sure how long it took her to leave but it felt like she never left. I was still in the loving mood and my neighbor and friend walked in the room and I knew she was gone and I had been zoned out. </p><p>We said and talked about everything, we knew everything and couldnt be wrong. It was the most beautiful thing watching the walls spin and morph, patterns of art forming on the white walls. Speech flowed as we were all great song writers and every word was a note to a great composition. We finally moved back to the basement and got some firewood. We started a fire outside and watched it for what felt like days. The smoke danced in the air and formed faces and bodies. We didnt talk at this point so I laid in the grass. It was the most comfortable thing I thought and I stared at the sky and watched it turn into night. The fire burned on and my head felt funny I wasnt sure who I was but I knew I was me. It was an unexplainable feeling. I turned to see what everyone else was doing and my Canadian friend sat there smiling at a rock and my neighbor looked like he was in terror. </p><p>I didnt say anything I couldnt I just thought about dancing in the rain even though it was a clear night. The trip started getting more intense as I started to day dream into my head. The clouds faded into people I seen and finally to my grandmother. I watched her die and then I shook my head. I looked and the trees and watched them move I wrote a letter in my head. It was about what its like to be a tree then the leaves turned into skulls with butterfly eyes. I just laughed and shook my head. All of a sudden the world moved faster and I saw time zoom into the future. I was in school all of a sudden and I lived a day in the future and drove home. I went into the basement and found a gun in some old record boxes. I saw it had a bullet and shoot myself. I then got up out of the grass and thought I was going crazy, it was the most intense hallucination I had ever had. </p><p>I went back to the fire and put more wood in it. I then realized my parents were home and started to panic. I thought to myself everything is fine. I can do anything, I am in total control. I then became calm. I dont know how it was so easy but I just put myself in a trance. I sat there and stared at the fire. I then got a bottle of water and a cigarette and poured the water on my head. I felt totally refreshed and reborn. I lit the cigarette and smoked it till I got to the filter. It was getting late and my neighbors mom called his cell. He panicked and didnt know what to do he looked like he was dead. He didnt answer his phone and couldnt handle the drug anymore he cracked he thought he was me. And just started geeking out. I didnt know what to do so I just got him some tea and moved him inside to the couch. I talked him through to reality, I honestly dont know what I said or did but it worked. My Canadian was still outside now dancing, totally happy and content. </p><p>This is where I kind of blacked out but I remember emotions splitting with movements and depending on where I was I felt different. It was a total out of body experience and I knew at that point we ate too many shrooms for our head. I just remember laughing after this and my friend finally called his parents back and they told him to be home in 30 minutes. He said this is the worst drug the worst trip. I didnt know what to say but I agreed. I told him it will be ok and youll get home fine and be fine. I reassured him his parents wouldnt know and he would wake up in the morning back in his head. He said thanks and I walked him out because he said it would take him a while to find his house. I went back in and forgot the Canadian totally but when I went in the basement he was just sitting there. </p><p>This is where the trip finally ended. We turned on some rusted root and slowly fell asleep. I dont remember the dreams that night. I dont remember the depressions. I just remember grinning and saying everything will be ok.</p><p>Shrooms are the most powerful drug I have ever done. I saw it change people forever. I seen things I never thought I could see on it. I believe it is something everyone should try, that it's something everyone needs to do. Thanks for reading.</p>"
}
