{
 "title": "5 Methods of Use",
 "author": "Juvvyyy",
 "citation": "   Juvvyyy. \"5 Methods of Use: experience with MDMA (ID 65224)\". Erowid.org. Oct 22, 2007. erowid.org/exp/65224",
 "substance": "MDMA",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "MDMA",
   "(powder / crystals)",
   " ",
   "  repeated",
   "insufflated",
   "MDMA",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "MDMA",
   "(powder / crystals)",
   " ",
   "  ",
   "rectal",
   "MDMA",
   "(powder / crystals)",
   " ",
   "  repeated",
   "IV",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2006",
   "65224",
   "Male",
   " ",
   "Not Given",
   "Oct 22, 2007",
   "87553",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I take a particular interest into the administration of MDMA. It's wierd how a drug effects me differently when administered differently. For example eating it compared to smoking, or whatever. I never understood why this is, I have theorys, but it doesn't matter. As the title suggests I will talk about not 1, not 2, but 5 ways to use MDMA and details with them.</p><p>Before I start I want to confess that in college one of my buddies was a chemistry major. He got his a degree in chemical engineering, than went to a pharmaceutical chemistry school down to get his Masters. He's in a research position, and has been able to get his hands on a whole cabinet load of chemicals, which to the average man would be nearly impossible. He first synthesized MDMA (illegally of course) 3 years ago and we have been using %99 pure crystalline MDMA on average once a month since then.  </p><p>ORAL: The most common, obviously. It usually takes about 30-60 minutes to peak, and my typical dose was 120mg. The body high is best when used orally, however the comedown is the worst. I get all restless, and have this wierd crawly feeling in my legs. The days after usually have more negative mood effects than any other method of use.</p><p>INTER NASALLY: This is also fairly common in the ecstasy scene. My typical dose was 50-100mg I hate it though because with this dose I can take only like 50mg and have an intense, nerve wracking peak, while the duration of the high is almost completely unnoticeable unless more like 75mg is used. The MDMA doesn't drip like coke, but it lingers in my throat for 10-20 minutes for some reason, and I can taste the crap the entire time. </p><p>RECTALY: Haha, nasty, but it feels slightly different than oral use, I have to take the same dose, but the peak lasted like an hour longer. I dissolved the MDMA in like an ounce of water, than gave myself an enigma. It came on ten minutes faster too. Well, not too much else to say about this method, other than it's worth a shot.</p><p>SMOKING: Well technically he says we're vaporizing it, but it looks like smoke, so whatever. In order to do this my friend took 1 gram of MDMA hydrochloride, and soaked it in a solution of water/sodium hydroxide. Then put that in the blender with 1 ounce of Petroleum ether, put the blender on whip for about 5 to ten minutes, than after the two chemicals settled he filtered the Petroleum ether, and repeated the process with another ounce of Petroleum ether. He let the petroleum ether evaporate on wax paper, resulting in an oily looking semi-viscous fluid, or MDMA base.  This one sorta sucked also, we never weighed the dose out, but the final product was 887mg. It was hard to smoke this oily crap because you can't just load it up into a pipe. We did absorb some it into a small swab of cotton than put that cotton swab onto a pipe with a little plant material (some nasty spice from the kitchen) to hold it up. I didn't apply the flame but held it like 1/2inch away. A small amount of cotton burned, but I could see vapor being drawn into the chamber, than ultimately my lungs.</p><p>I only took this one hit, and blew out quite a large cloud of vapor. Within 3 seconds after I exhaled I felt a rush hit me, comparable to meth, but less speedy, direct, and euphoric effects. This rush went straight went straight to my brain. I felt a hot sensation flood my head, but my entire limbs got really cold. All I did was pour my heart out to my wife, who refused to smoke the MDMA. Sadly at the hour mark I plummeted downward, however it wasn't really a crash. I just was coming down softly, as with opiates, or wacky tobacky. I used this method after I injected it, so I expected the same effect.  :)</p><p>INTRAVENOUSLY: Yes a direct injection into my vein. I used this method before I smoked it so all I expected when I had the 25mg loaded syringe in hand was a very intense body high, with a rush, as if I were shooting speed. Well I got one of them right. Nevertheless this actually turned out to be my favorite for several reasons. First of all I know that when it goes straight to the blood stream it doesn't get all jacked up by the liver. Second its just sooooo much better man. </p><p>A good dose to inject MDMA is around 20-50mg. Like 35mg is perfect man. The onset is within 30 seconds. And it is more of a rush than smoking it, however I feel no empathic qualities when injecting it. Just a rush like I shot meth while I'm peaking on like 300mg MDMA or something, The peak lasts only 30-60 minutes. Another cool part was every hour or so I could inject booster doses of 10-20mg and re-peak with the exact same feeling as the inital dose. That's something I can never do any other way. This method raises my resting heart up from 60-130, higher than any other method. Any way of doing it, other than smoking I suppose, raises it only like 20 beats, this raises it 70. It raises my blood pressure about 20/10, same as any other method.  It did display a slightly discomforting comedown, but perhaps that's just because I had such a strong desire to keep doing more. I never did more than 100mg intravenously in a night. I always woke up feeling perfect, no lingering comedown crap as if I were to have used it  orally. </p><p>CONCLUSION: Well, I have to say as I write this it's been 3 weeks since I've used any MDMA. Haha. But within the next week, I shall call to get a few doses. All these methods of use are very special in there own way, they have helped me learn a lot about this drug, and how amazingly complex it's mode of action and effects are. So let us rise forth fellow researchers, and unite that we might unlock the secrets of the physical world we live in.</p>"
}
