{
 "title": "Friendly but a Bit Confused",
 "author": "Lennart J.",
 "citation": "Citation:   Lennart J.. \"Friendly but a Bit Confused: experience with Ephedra/Ephedrine (ID 6522)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6522",
 "substance": "Ephedra/Ephedrine",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "267 mg",
   "oral",
   "Ephedrine",
   "(capsule)",
   "  T+ 4:33",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 6522",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2002",
   "Views: 56859",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis is a little anecdote about my experience with ephedra. I'll try to be as precise as possible, but without becoming overly clinical.\r\nFriday night 18:45 \r\nI just took 4 ephedra supercaps with 833mg dried ephedra each, containing a total of 267 milligrams (about .009 ounce) ephedrine. I'm feeling pretty exhausted at the moment, since the previous night was 'queens night', which means I've been reveling in the streets all night long and have gotten only a few hours' sleep. I also drank a couple of beers earlier this afternoon, which can negatively affect the ephedra experience. I'm drinking a cup of coffee at the moment, because the caffeine in coffee intensifies the effects of ephedra. \r\n19:39 \r\nI feel a pleasant tingling, 'gooseflesh' sensation over my scalp, and I feel slightly restless. Furthermore, I don't feel like sitting behind my computer and typing anymore, so I pace restlessly around a bit in my room. But at the moment I feel great, and I'm no longer tired at all. I decide to put on some relaxing music (Enya) and clean up the mess in my room. \r\n20:05 \r\nThe tingling sensation is starting to become pretty strong now, I notice that I can make the sensation even more intense if I concentrate on them. The typing is getting a bit more difficult because of my trembling, sweaty hands. My tiredness has completely disappeared, one hour ago I almost fell asleep, now I feel very active and I would like to go and do something. Futhermore I feel a bit detached, as though someone else is typing this. \r\n20:40 \r\nThe phone rings, but I cannot concentrate very well on the conversation, and what the caller wants to say simply doesn't get through to me. When I hear myself talking, it sounds as if I am talking unusually slowly. I still feel wonderful, only a bit nervous and sweaty. I am still restless. if I were at a party, I would probably want to dance. \r\n21:05 \r\nI am bursting with energy, but I cannot find any activity to put that energy into. So I bounce between newspaper, radio, tv and computer - and also between teakettle and toilet, because this stuff make me thirsty. \r\n21:34 \r\nI still have the tingling, but I am more relaxed now, enough that I can sit quietly and watch television. \r\n21:56 \r\nI still feel a bit nervous, and it's hard to concentrate on the typing: I can think much faster than I can type. I also have problems concentrating on TV, I can follow the stand-up comedians, but with the news I become easily distracted. \r\n22:15 \r\nThe ephedra has been working for two-and-a-half hours now, the effect is still very pronounced and has not abated appreciably. Although the tingling sensation is tapering off a bit. Another effect of ephedra is that it makes me more sociable, assertive, and kinder. I just spoke to a housemate, and it felt as if I had a strong bond with him (in fact I hardly know the guy). If I were to meet someone who didn't know me, he/she would probably find me friendly but a bit confused. Confused because its hard for me to concentrate on anything for longer than a second. \r\n23:07 \r\nI still feel good, and not as nervous as before. I sit quietly watching the TV, a documentary about war victims and refugee camps that affects me much more strongly than it normally would. I find that I feel much more empathetic. \r\n23:18 \r\nNow and then the tingling returns. I think I must have drunk two litres (half a gallon) of tea. This ephedra makes me thirsty, and now I think its time to have a nice, cold beer. \r\nSaturday 00:17 \r\nStill wide awake, it appears that I won't be getting sleepy anytime soon, although it has been almost 5 hours since I took the ephedra. \r\n02:43 \r\nI'm back to normal now, although I still feel some light tingling in my scalp. I remain wide awake, but my body is beginning to feel tired. The 'side-effects' - the sweating, trembling, and detachment that I experienced earlier are gone now. \r\n04:04 \r\nStill no signs of sleep, this suprises me a bit, since I took the caps 8 hours ago! All other effects are gone now. \r\n05:38 \r\nI'm still awake. The ephedra is working much longer than I anticipated, about 10 hours now, but I think I should be able to get to sleep in an hour or so. Moreover, my appetite is beginning to return, which is not so strange since I've only eaten only a few slices of toast in the last 10 hours. My body feels exhausted at the moment. \r\n+/- 6:15 \r\nI finally fell asleep, with no problems. \r\n12:00 \r\nThe awakening. It has been a somewhat restless night, I awoke a couple of times for 15 minutes or so, and then fell back asleep again. I also have the impression I slept very lightly. Although I slept for only five hours, I feel wide-awake.\n\n\n"
}