{
 "title": "Very Pleasant",
 "author": "Brotherhood",
 "citation": "   Brotherhood. \"Very Pleasant: experience with Catnip (ID 65353)\". Erowid.org. May 3, 2010. erowid.org/exp/65353",
 "substance": "Catnip",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "760 mg",
   "smoked",
   "Catnip",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2007",
   "65353",
   "Not Specified",
   " ",
   "Not Given",
   "May 3, 2010",
   "103053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have smoked catnip a few times before, without noticing much difference. Today, however, I had a very pleasant experience with it.</p><p>I was walking to Starbucks to meet some friends for coffee, and I smoked a catnip joint along the way. The catnip I had was formerly in capsules, bought as an herbal supplement from a health food store. Around 1:00, I smoked about 760 mg (2 capsules' worth) of catnip. The smoke is pleasant, minty, easy to hold in lungs. Five minutes later, I noticed a garage sale and stopped to buy some cds. While I was paying, I dropped some change on the ground, and bent down to pick it up. As I did so, suddenly the whole world seemed extremely...warped, for lack of a better word. This was not a visual hallucination of any kind, it was just a general sense.</p><p>After that initial onset, I continued on my merry way, now feeling quite different. The heat (90 degree weather) did not seem so oppressive, I felt extremely optimistic, I felt suddenly that I had incredible luck, that everything was going my way. The remaining walk was only 5 or 10 minutes, but it seemed to take much longer. Everything seemed really interesting. I stared at the clouds, sun, people, passing cars, nearby fields, whatever. Heightened sensations, also: I suddenly became aware of my jeans rubbing against my legs, of the ground beneath my feet, branches and leaves that brushed by, etc. By the time I arrived at Starbucks, I was starting to space out. I ordered some coffee and sat in an armchair, lazily playing with the soft fabric on it, totally contented. </p><p>However, when my friends arrived, I started to feel overwhelmed, like bad vibes were all around. The music playing bothered me, and the place was becoming crowded, so I wandered around outside for a while. I then went back to chat with my friends, in a lucid and optimistic manner. By the time I arrived home at 3, any effects were gone. Overall, a pleasant experience. It is nothing like a marijuana high, but it's very nice.</p>"
}
