{
 "title": "Looming Bushes",
 "author": "Stevo",
 "citation": "   Stevo. \"Looming Bushes: experience with Salvia divinorum (ID 6540)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6540",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6540",
   "Male",
   " ",
   "Not Given",
   "Feb 28, 2002",
   "Views: 5592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHaving just expierienced a nice trip I thought it would be nice to come in and write about it. Yesterday I finnally recieved my long awaited 1/2 oz. of Salvia. Being my first time with this drug I decided to get the regular kind not the 5x. So yesterday I went over to my friends house and lit up a bowl of about 3 crushed leaves and inhaled most the bowl and held it in for as long as I could. While I was holding the smoke I packed another bowl then exhaled and lit the next bowl. I then started to realize I was feeling something. So I took the bong and went in another room by myself and smoked about 3 more hits. Then everyone started coming in and it basicly ruined the trip before it even started. I walked around the house with about 10 other people everywhere feeling super faded. I regreted smoking with so many people around it killed the trip. </p><p>After a while I deciced to get a ride home and just went about the rest of my night as normal. Considering I still had about 12 grams of Salvia left I awoke this morning I figured I would fix my crappy trip by having one I would enjoy and remember. So I called my friend and we went back in this wildnerness area by my house with a blanket and my bong. We found a nice place spread the blanket and I let her smoke first. She took 3 nice rips nd smoked about a bowl and 1/2. Then she started talking about how nice the plants are and everything. So I figured it was my turn. I loaded a giant bowl and lit up. Then I loaded another and lit that up. I started feeling really faded so we just sat and talked about the plant for a little and then she got up and said she was going to go to a guys house to tell him off so I just said be carefull and she left. </p><p>I loaded another giant bowl after she left and lit that up holding the smoke in for as long as I could. Then lit another bowl. All in all I ripped about 4 massive hits. I then put everything back in the bag and laid back. I cant really describe how everything was. All I know is I was laying back and the like tall shrubs seemed to be looming over me watching me, I laughed at this and decided to get up. so I got up and mindlessly dragged the blanket to This small incline and laid on that for a little just staring at things and thinking about I dont know what. Then I began to walk around staring at my feet stepping on the small fern things below and thinking how interesting it was. Then I walked back to my house and sat down and watched tv for a little as the effects wore off. All in all now that I look back on it, it wasnt the divine expierience I was looking for but it was interesting none the less. I now still feel a very small buzz an hour later but nothing special. I think in the future I will try some stronger Salvia and smoke in a dark room with a big chair all alone. That was what would have made the trip nice.</p>"
}
