{
 "title": "Transcending Asperger's Syndrome",
 "author": "Mercury in Aries",
 "citation": "   Mercury in Aries. \"Transcending Asperger's Syndrome: experience with Hydrocodone (with Acetaminophen) & Cannabis (ID 65438)\". Erowid.org. Sep 4, 2007. erowid.org/exp/65438",
 "substance": "Hydrocodone (with Acetaminophen) & Cannabis",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Acetaminophen",
   " ",
   " ",
   "1 cig.",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2004",
   "ID: 65438",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 4, 2007",
   "Views: 15246",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I experimented with hydrocodone a few times after stealing it from my parents' med cabinet, but never felt anything at all.  This report details not the first time I took the drug, but the first time I experienced any of its effects.  </p><p>I was in college studying theatre at the time and had just gotten out of a particularly long rehearsal for a show called 'Anton in Show Business'.  I decided to take one of the pills along with some marijuana just to see what, if anything, would happen. </p><p>10:00 p.m.--Took one hydrocodone 10mg. pill, Watson brand.  Smoked a joint of low-grade schwag cannabis.  </p><p>10:30 p.m.--Sitting on the lawn chairs my roommate and I used as furniture in our house (we were poor college students!), I began to feel the first effects of the drug.  It felt like a rush of optimism, like everything was right with the world.</p><p>10:45 p.m.--The full effects of the drug had really begun to kick in by this point.  I was talking up a storm and found myself unable and unwilling to stop.  Things that normally would have pissed me off or made me anxious seemed unimportant and even pleasing.  The lights were dim as my roommate and I chatted the night away.  My body felt warm, especially my heart and extremeties and my eyes were red and extremely squinted.  Laughter spilled out from my mouth at every turn.  I had the compulsion to put on music but ignored it to keep talking.</p><p>11:00 p.m.--Could no longer deny the urge to put on music.  We had no TV anyway, so I put on a mix cd I made.  The only song that sticks out in my mind from that night is 'She Lives in My Lap' by Andre 3000.  The music seemed to be pushing my brain further into ecstasy with every passing second.</p><p>11:30 p.m.--The effects were on the downswing by this time.  I was beginning to understand that hydrocodone was responsible for my amazing mood, which I'd failed to realize before now.  I decided to do some yoga, as I figured it'd be especially enjoyable while in this state.  I faced the color-changing ionizer in the corner of the room and did my poses with its cool mist falling on my face.  I let my mind wander...with each change of color, I imagined the changing of the seasons in different parts of the world:  red was winter in China, blue took me to summertime in the Pacific, yellow transported me to autumn in France, and green put me in the rainforest in spring time.  </p><p>11:50 p.m.--Near baseline with a tingling warmth lingering throughout my body and in my head.  I decided to smoke some more marijuana at this time in an attempt to bring back the euphoria of the last few hours.  It did not work.  </p><p>12:10 p.m.--Back to baseline.  I reflected on my experience and rejoiced that I had one pill left, which I knew would be taken the next night.</p><p>Since I suffer from Asperger's Syndrome, a high-functioning form of autism, I found the effects of hydrocodone to be especially helpful for the social aspect of the disorder.  It compelled me to talk openly without anxiety, which anyone with an autism spectrum disorder will tell you is nothing short of amazing.  I would like to say I reserve its use solely for social situations, but usually don't have the willpower.  If there's a pill left in the bottle, I'll convince myself that 'right now' is the right time to take it.  It's a double-edged sword, but I've managed to avoid excessive use, especially since it only takes 5 mgs. to experience a noticeable effect in my small body.  My love affair with this drug continues to this day and will unlikely ever fade.  </p><p>I do not recommend this drug to everyone.  Its potential for addiction is great due to the strong euphoria it induces and can wreck the life of a person who lacks the willpower necessary to use it responsibly...</p><p>...but I am in love with hydrocodone.</p>"
}
