{
 "title": "Kind Of Like a Really Bad Hangover",
 "author": "anonymous",
 "citation": "   anonymous. \"Kind Of Like a Really Bad Hangover: experience with Methylphenidate (Ritalin) & Cannabis (ID 6544)\". Erowid.org. Feb 28, 2002. erowid.org/exp/6544",
 "substance": "Methylphenidate (Ritalin) & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6544",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2002",
   "Views: 23459",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nT=0 minutes: 20 mg of ritalin crushed and snorted in four lines over 1 minute</p><p>my nose stung and I didn't feel anything.</p><p>T=10 minutes: roughly  0.5 of canabis smoked.</p><p>T=15 minutes: started to feel a little hyper and I started to feel the pot start to kick in.</p><p>I stood outside for about 20 minutes and began to have problems speaking, in that my thought process was a little muddy and I stuttered a bit.  At times I also felt as if I had so many things that I wanted to say and so many things that I wanted to follow these thoughts with that I couldn't bring myself to say anything.  It was as if I was wrestling with myself internally, struggling to decide what I wanted to begin by saying.  Also, I'm not generally an incredibly talkitave person, but I found that I had an infinite vault of trivial information, anecdotes, and stories to tell and I found I was almost completely monopolizing the conversation.  I also found that I could just barely sit still and listen to someone else speak, I just wanted to talk myself.</p><p>T=35 minutes: I went into the house and stared at this crazy coloured poster for a little while.  It is one of those pictures that you are supposed to look at while you're tripping out.  It had three black dots about an inch in diameter overlapping one another in the center and a bunch of coloured lines swirling off of them, so it almost looks as if you are spiralling down a multicoloured tunnel.  When I went really close to it I could see a faint reflection of myself in the black dots.  I also had odd feelings throughout my body and my heart was pumping very fast.</p><p>T=1.5 hours: at this point I had hit my peak and was starting to come down.  I began to feel incredibly jittery and couldn't sit still.  When I stood up my legs would shake slightly, but noticeably and all of my actions were extremely quick.  For example if I was pointing at something I would raise my hand really fast.</p><p>T= 2 hours: I started to feel at little naucious and I felt as if I had a lot of nervous energy but I was too tired to use it.</p><p>T= 3 hours: I began to feel very sick and tired.  All I wanted to do was sleep but I felt that I had so much energy that I wouldn't be able to.</p><p>T= 5 hours: all through this time I felt as if I had the flu and wished I hadn't taken the ritalin.  I also didn't have an appetite and couldn't bring myself to eat or drink even though I was extremely hungry and dehydrated.</p><p>T= 7 hours: my whole body began to feel heavy and I began to feel as if I was leaving my body every time I didn't concentrate on it.</p><p>T= 9 hours: I felt tired and naucious so I decided to go to bed.  I managed to force a couple of glasses of water down first.</p><p>T= 19 hours: woke up still feeling sick and ate only a small amount of breakfast and drank a lot of water, as I was feeling quite dehydrated.</p><p>T= 24 hours: I managed to eat quite a bit of lunch and although feeling moderately depressed I feel fine.</p><p>This is kind of an interesting drug, especially mixed with pot but I wouldn't recommend it because coming down off of it is terrible.  It was  kind of like a really bad hangover that lasted for a really long time.</p>"
}
