{
 "title": "All the Buildings Were Models of Themselves",
 "author": "Cookie-eater",
 "citation": "   Cookie-eater. \"All the Buildings Were Models of Themselves: experience with Cannabis (ID 65440)\". Erowid.org. Jun 13, 2010. erowid.org/exp/65440",
 "substance": "Cannabis",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "6 g",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 65440",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 13, 2010",
   "Views: 3027",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nProbably one of the most intense experiences of my life...\r\nI had been smoking pot pretty heavily for about three months up until two weeks before these events.  I had quit totally and hadn't had even a second hand buzz.  I found out that I was going to have to take a drug test in about two months so I decided that I would use up the last of my stash.  I measured it out, there were exactly 6 grams there, a little more, but I just left that in the bag.  I got online and found a recipe for peanut butter cookies and gathered all my ingredients.  I ground up the pot in a coffee grinder until it was completely powdered and added it to the batter.  I got six large cookies out of the batch.  I picked peanut butter because it has a lot of oils in it and I baked it at a very low temperature, maybe 200 degrees F.  I didn't use eggs or anything dangerous, just a really basic recipe for baked peanut butter cookies.\r\nI called up my friend who I had expected to zone out with and found out he couldn't make it that night.  Instead of waiting until he could join me I decided to just go right ahead and eat all six cookies.  I really like being stoned outside, and it was a wonderful October evening, light breeze, cool air, not exactly day but not really evening yet either.  I headed out on my usual walk, about 45 minutes long.  I figured I'd probably start to feel it by the time I was done with my walk.  I was very wrong.  About fifteen minutes into my trek I started to feel very stoned.  It was not the slow onset I expected from ingesting pot, but a very violent rush--as if I had walked through an invisible portal into stoner land.\r\nInstead of turning back at this point (which probably would have been wise) I decided to push on and finish my walk.  As I continued on my walk I got more and more confused as to where I was.  I recall leaving the path and wandering through a neighborhood looking for my apartment building-which, by this time, was on the other side of a large train switch yard.  This went on for some period of time which is completely lost to me, it may have been 20 minutes, it may have been an hour.  At some point I found my way back to the main bridge over the train tracks.  I have NO idea how I did this, I was so confused at this point that I thought I was still in high school and about four years younger, I constantly was looking around for my moms car, even though she was over 800 miles away.\r\nI think I stayed in this neighborhood for a rather long period of time.  When I got there it was just dusk, and by the time I had gotten back to the road it was full on night, but I have no idea what happened in-between those events.  I have flashes of walking past houses and trying to look in and realizing how fucked up that was and moving on.  I know that I walked behind some houses trying to get to a river (no idea why I was doing this, it was a terrible idea).  I think in the end I walked in circles for a long time and then managed to leave the way I came in...  I have tried to FIND this location several times since and have never managed to, so I don't actually know where I went for that time.\r\nBy this point it was getting very dark, all the cars had their lights on, the street lights were in full blaze, and I was stumbling across this bridge that seemed to go on forever.  At the far side of the bridge is a little retail district with shops and lots of pedestrian walkways.  As I neared this I realized that the shops weren't exactly right.  I had seen them almost every day for a year but now they were just a little bit off.  I stopped on the bridge and looked at them for what was probably far too long.  Suddenly I realized what it was, they weren't real.  I could look at them and see the people walking around and it wasn't real.  It was a model of the retail area that I had seen before, but it wasn't the real thing.\r\nI was now very freaked and and sorta stumbled/sprinted forward past this area and off the bridge.  I was now only about four blocks from my apartment, but it was through a busy bar district on a Thursday night.  Thursdays were big bar hopping nights in this town.  I tried to take a wide path around the bar area but as I walked I would see people up ahead under the street lights and every single one of them looked exactly like my boss's wife.  I would wave to her and try to say something sane sounding and would realize halfway through that this was just a random stranger.  This probably looked utterly ridiculous to anyone nearby.  Somehow I managed to realize this and rushed the rest of the way home.\r\nIn the mirror my pupils were massive and my eyes were bright bright red.  My roommate was coming home shortly and I realized that I probably couldn't keep it together if I had to interact with another person one-on-one.  By this point I was hearing voices from outside and believed strongly that they were inside my apartment watching me.  It was probably the freakiest experience I have ever had on pot.  When I heard his key turn in the lock I ran into my room and locked the door and blacked out on the floor.  I woke up sometime after midnight and realized that I was still high.\r\nIt was interesting, especially the part where the buildings looked as if they were models of themselves, complete with little model people walking around (but they weren't really walking, more like shuffling, it was very odd).  All in all it was probably a waste of pot, and I think there were lots of things that happened that I will never remember.  Probably the oddest part of the entire experience was that it was very un-pot-like.  Most of the time when I smoke I zone out and just enjoy being around and doing whatever.  This was much more intense.  Unlike regular smoking where I feel connected to everything and want very much to talk to people (even if I can't), with this experience I was incredibly lonely and confused the entire time.  It was too abstract to be really enjoyable or unpleasant.  The things that happened to my body did NOT happen to 'me' and vice-versa...  I don't have anything to really compare this too.  It wasn't a social experience (which is usually how I think of pot) at all, and probably being around other people would have made it much much worse.  I felt very self conscious the entire time, which is also not what I expect from pot.\n\n\n"
}
