{
 "title": "Not For Everyone",
 "author": "WhitePelican",
 "citation": "   WhitePelican. \"Not For Everyone: experience with Piracetam (ID 65459)\". Erowid.org. Sep 17, 2009. erowid.org/exp/65459",
 "substance": "Piracetam",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE:",
   "4500 mg",
   "oral",
   "Piracetam",
   "(daily)",
   " ",
   "144 mg",
   "oral",
   "Lecithin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "65459",
   "Female",
   " ",
   "Not Given",
   "Sep 17, 2009",
   "18684",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To briefly introduce myself - I am normally a mellow, patient person who does not let trivial things upset me.  I've had a short affair with meth and a year of using ephedrine for its rush-around effects, but realized that once I stopped taking it I felt listless, negative, and otherwise emotionally empty.  Having read some reports that Piracetam brought back the ability to notice and appreciate the natural everyday things that we normally look over, I hoped it might be the solution the help me experience things more fully again.  I've also struggled with anxiety in social situations my whole life and hoped that Piracetam would benefit me with that as well.  I wasn't really concerned about the proclaimed memory-enchancement and increased cognitive abilities, since I've always struggled more with mood and emotion.</p><p>I bought Piracetam (powder) through a US distributer.  Since I had read that effects are not noticeable upon initial doses of Piracetam, I started out with a small dose of 500mg one evening and just went to bed.  The taste is unbearable.  Capsules are a must.  There was a cool sensation in the back of my throat temporarily after the capsules released.  About 2 hours later, while in the stage right before falling asleep, I rolled onto my back and realized that my whole body was trembling, almost like a low blood-sugar shaking.  Occasionally this happens to me anyway, but I do have to say it was worse than ever before.  However, it didn't happen again while taking Piracetam so it probably was just a coincidence.</p><p>After assuring that I wasn't going to have any adverse reactions, I began taking 1500mg three times a day.  Onset was about 30 minutes on an empty stomach, and I immediately noticed that I became so pre-occupied with what I was thinking, looking at, or doing that I couldn't multi-task without making a conscious and strenuous effort to do so.  Normally I multi-task effortlessly.  It also seemed like my brain was unable to process many things moving around me and was not anticipating the normal patterns.  This was really only a problem while driving.  I felt very jumpy for no reason and seriously feared that I was going to get into an accident either from being distracted or over-reacting.  Very undesirable fuzzy feeling.  These effects subsided after the second day.  There was also a noticeable increase in sensitivity to smell and sunlight.</p><p>The third day was actually scary and I found myself wondering if it was just me or the Piracetam's effects on me.  I started to become extremely irritable, negative, depressed, and emotional.  I over-reacted emotionally to every small thing that went wrong.  For example, I found myself teary-eyed with rage at my miserable existence because the chick at the gas station wouldn't turn the pump on.  And like I said, normally trivial things don't bother me!  Every small thing that pissed me off would get me to thinking about my life, which caused so much anxiety that I was considering suicide in a serious way.</p><p>After taking my first 1500mgs on the fourth day, I started to feel like sh*t again, focusing on everything negative and convincing myself that nothing could go right.  That was it for me with the Piracetam.  I did, however, notice positive effects on my social anxiety even from the beginning.  I said more during conversations, but also didn't feel awkward when I didn't have anything to say to someone next to me.  The effects were much like taking a shot of hard alcohol, including the mindless rambling (because it still wasn't easy to find the exact words for what I was trying to convey, I just wasn't hesitant to say more).  No loss of coordination.</p><p>I really had high hopes for Piracetam.  I might try it again some day, maybe when I'm feeling really positive to begin with, or if I have to study for a test to see how it works with that.  However, I find that stimulants work better for me when it comes to focusing.  I might try smaller doses next time, considering the ratio to body weight, or take more Choline supplementation.  I wouldn't recommend it to anyone who is already content with their cognitive functioning as I was.</p>"
}
