{
 "title": "Less Anxious, But Suicidal",
 "author": "Dee",
 "citation": "   Dee. \"Less Anxious, But Suicidal: experience with Escitalopram (Lexapro) (ID 65659)\". Erowid.org. Apr 21, 2010. erowid.org/exp/65659",
 "substance": "Escitalopram (Lexapro)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 65659",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 21, 2010",
   "Views: 5885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm afflicted with a generalized anxiety disorder, and depression.</p><p>I went off of Paxil after 9 years, dosed between 20 to 40 mg per day, after a few months, I started getting really agitated anxious and depressed.  My doc suggested I try Lexapro because reports say it doesn't have the heavy sexual side effects of any of the older first generation antidepressants, and it's highly regarded in the anxiety disorder crowd.</p><p>I dosed at bedtime. The next day I felt better (relaxed), but oddly, everyone looked really unattractive and I began having weird thoughts about suicide.  For me, suicidal ideation has not really ever occured before, and I'm 47 years old and have been in and out of therapy for over ten years.</p><p>I kept taking it for a few more days, but cut the dose to 5 mg.  By the end of the week, I was really beginning to feel weirded out-like I was afraid to be on my own, afraid of my own thoughts and stuff.</p><p>By Saturday a.m., I felt compelled to go talk with my sister, and I had the oddest conversation about why people all shouldn't just end their own lives and stuff.  I knew it wasn't me.</p><p>Anyway, to make a long story short, I stopped Lexapro for a week and was okay, except my anxiety came back, so I gave it another try and had basically had identical results-suicidal ideation.</p><p>I reported all this to my doctor and she told me to go back to Paxil, and after a few weeks I stabilized.  But the suicidal ideations stopped within a couple of days after I stopped the Lexapro.</p><p>So, for me it wasn't a good med-it was a bad trip I don't want to go on again.  And by the way, my experience was that Lexapro does have significant sexual side effects similar to all the other older ssri's.</p>"
}
