{
 "title": "A Mental Roller Coaster Ride",
 "author": "Quetzlcoatl",
 "citation": "   Quetzlcoatl. \"A Mental Roller Coaster Ride: experience with Ayahuasca (ID 65706)\". Erowid.org. Jan 28, 2008. erowid.org/exp/65706",
 "substance": "Ayahuasca",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Mimosa tenuiflora",
   "(tea)",
   " ",
   "10 g",
   "oral",
   "Syrian Rue",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65706",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 28, 2008",
   "Views: 4117",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I purchashed the two ingredients for the Ayahuasca brew:</p><p>Mimosa Hostilis (high quality inner root bark)</p><p>Syrian Rue (oral activator)</p><p>I eyeballed about what is a normal dose, and ground the two plant materials seperately in a coffee grinder very finely. I placed the ground Syrian Rue in one stainless steel pot and the ground Mimosa bark in another. I put a couple tbsp of vinegar into each pot along with about a tsp of salt. I used tap water since the vinegar lowers the pH of the water. Now, I boiled the two pots and monitored very closely, stirring often or I risk burning it. Simply boil until I can no longer smell the sharp vinegar smell in the vapors coming off the pot. I strained the liquid and plant material through something like a coffee filter, as long as I got liquid and no plant material. I put the plant materials back into the pots, added water and brought to boiling, strained again. I don't mix the Syrian Rue and the Mimosa, keep em in different pots. Now that I have the colored liquid from the strainings, I put it on to boil and only the water will evaporate. I boil each down to about a shot of liquid. I take the Syrian Rue about 30min before the Mimosa. </p><p>My herbs came in the mail and I ground them up and prepared the Ayahuasca brew. The liquid was drank and the first effects came on very quickly. I found it hard to concentrate on anything, my thoughts were coming too fast, without warning I vomited for about 5-10 min. The purge is a spiritual part of the experience and it is pretty much inevitable if I get the good stuff. My friend says it rivals LSD in terms of visuals. Intriquite patterns are infinite. I was very disassociated with what was going around me and I felt physically lighter, like there was suddenly less gravity. </p><p>The visuals are very much like a heroic dose of magic mushrooms. It's very intense and I feel less control of my bodily functions, like I'm going into a trance. I put some music on, my friends were playing video games and I started shaking like the spiritual energy was working its way through my body. The way I would describe it is this: It's a roller coaster ride, I may get a lil sick and throw up but I'll have a good time and it's almost a guarenteed trip. It was really fun and I'm prolly doing it again rly soon</p>"
}
