{
 "title": "I Made a Mistake..",
 "author": "Emily",
 "citation": "   Emily. \"I Made a Mistake..: experience with LSD & Cannabis (ID 65728)\". Erowid.org. Jan 1, 2011. erowid.org/exp/65728",
 "substance": "LSD & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 65728",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 1, 2011",
   "Views: 28136",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So a few months ago, I went to P-town (A city about 45 minutes from where I live) to visit an old friend (J). I went with my friend (C) who I never really felt completely comfortable with but am in complete denial of (mistake 1). I don't know why. Anyway we were staying with her dad.</p><p>One of the nights, me, C, & J got way drunk. The next morning we all woke up completely hung over (mistake 2). We decided to go into town after moping around C's dad's house. We went to J's place because he had a few errands to run. That's where I met J's friend A. I have social anxiety so I wasn't feeling very comfortable with A, but I was trying my hardest to! Making small talk and whatnot.. But I was too hung-over to concentrate on anything. I dont think C liked A very much.</p><p>Once J was done, we went to a secluded area and smoked some pot. I dont know how much, probably like 6-7 bowls. This was about normal for me. Then we each got a little blotter piece with 3 hits of good LSD on it. I tricked myself into thinking 'oh what the hay, Ill be fine So I made the call, and put the piece of paper under my tongue, and we left. (Biggest mistake.)</p><p>When we left, I was still feeling pretty normal (well normal as I get..) But soon, A kept trying to talk to me and C but C wasn't talking at all and I felt a huge social indifference and couldn't really handle it so I just ended up not talking too. A didn't understand why me and C weren't talking to him. I think he took it offensively but I meant no harm, I'm just shy and scared of being social and what others are thinking. So him being frustrating by us made me feel even worse. I tried speaking a few times but just couldnt do it. So I stared at the trees and focused on how pretty nature is, the whole time. While J listened to music on mini loud speakers.. I tried catching up with him to listen to music, but felt bad about leaving C back with A. So I really didnt know what to do! So I just walked alone.</p><p>Well we walked for a good 20-30 before we got to the bus to take us to our destination. The bus ride was about 10 minutes. We got to our destination which was a secluded park where all the stoners sit and toke up. When we got there, there were 2 other people already sitting under a tree, tripping on acid. So we all just sat in a circle. By that time, I was starting to feel it. But I was scared from feeling social contractions, and anxieties. I wanted to be alone. I got really cold, and decided to just look at the sky. The clouds starting to turn into animals and looked fuzzy. That made me happier, but being cold distracted me. The sun was going away.</p><p>I remember sitting up and my phone ringing, it was my cousin (also my best friend). That made me smile, so I picked up. She was drunk, and walking back home. She said she was really scared because she was really intoxicated and had to face my uncle. I told her I was tripping and that everything was going to be okay but it really freaked me out. Once I hung up my mom called. I got really scared but calmed myself down quickly. I remember I didnt feel very comfortable. Not comfortable at all, actually. And everyone could tell. Which made me feel worse. I remember C was like Emily you look like youre mom which REALLY tripped me out. My mom has schizophrenia, and depression, and a bunch of other shit. I never want to be like her.  Youd know what Im talking about if you knew me.</p><p>So J & A were trying to calm me down, the other people had left and that made me feel better. I was shivering cold, and kept complaining about it. So we all huddled together in a little tiny circle, with all of our knees touching, around all of Js stuff. I dont remember if I wanted them to do that or something. They kept trying to get me to focus on things. But the only thing I could focus on was myself. Then the strong visuals came in and I went in and out of feeling really good to feeling horrible. </p><p>I felt like the four of us created a house. A house with warmth. Then these two other people showed up and wanted to sit and smoke some bowls with us. So I had to move to let them in our house. That upsetted me. I was the door, and I was letting all the warmth out for these strangers. They had big ugly scary faces and for some reason I just did not like them. We started smoking bowls and all I remember was people kept telling me to pass the pipe, because I kept forgetting I had it. And C was doing the same thing which lead into this weird mind connection thing with her. After those people left, a bunch of new people showed up. I didnt like that either! Everyone that formed my little house were all cartoons. And all those other people that showed up were all normal looking. I couldnt focus on them at all.  </p><p>Then I went through this trip inside my head. I couldnt focus on anything going on outside of my head.  I went through my whole life inside my head, and felt as if I was cursed with something. My trip was my whole entire life and throughout my whole entire life I was not able to speak ever again. I was stuck in my head for eternity, and at the end of my life I was allowed to SCREAM finally. So, while I thought I wasnt talking apparently I was repeating things like hello? Hello? Hello? A lot of desperate hellos. And Is anybody there? Where are you? I am an elbow. And then a lot of more hellos. Weird things like that.</p><p>Then.. I dont know how long it had been, I dont know what I did throughout that whole time but suddenly I came into consciousness again, while we were walking down a path and I apparently just screamed. Then said Im done! Its over Im done! Then stopped talking again. I was a ghost. Thats when I had an out of body experience. I remember watching myself and everyone walk down this path and I kept telling myself to go back because I had left my sanity at the park in a box! But I just kept walking, I was dead and could not do anything about it. I wanted to go back so badly, and go receive it. Then I came to acceptance that I had lost my sanity and will never have it back.</p><p>Suddenly I awoke, not knowing where I was or anything that had happened besides what had happened in my head. We were at a playground, and I was sitting alone while everyone else was playing on stuff and having fun. I sat there for a long time contemplating if I was dead or not. Until somebody talked to me. I was hesitant to answer because I didnt know if I was imagining them or not. </p><p>Then we left to go get on the bus. While we were waiting for the bus, and everyone else already came out of their trip completely, everything still looked like a painting. A tried talking to me again, tried talking to me about a lot of things but I still was completely unresponsive. All I would say was ..yeah and couldnt concentrate on anything he was saying. It probably looked like I didnt care. Me and C got on the bus and I remember looking at her and she still looked like a cartoon. That scared me. We got back to her dads house and I didnt know what to do. I sat in bed and couldnt sleep all night. Got up, and felt like I was on crack. I was scared and nothing felt normal. Everything felt weird in a bad way. </p><p>Everything has felt weird in a bad way ever since, and I completely regret doing that. </p><p>Im severely depressed ever since. Everything has gotten so much worse. I isolate myself in my room. My whole personality reflects my trip. J & A dont talk to me anymore, I dont even know how they feel about me. I dont talk very much anymore. I feel unable to communicate a lot. Its hard for me to feel relaxed. I cant smoke pot any more, I feel completely and utterly psychotic when I do. I cant get comfortable and everything I do feels extremely weird and I cant describe it. I get anxieties and shake and feel nauseous. I pretty much fucked myself up.</p>"
}
