{
 "title": "Pleasant Surprise",
 "author": "Jay",
 "citation": "   Jay. \"Pleasant Surprise: experience with Buprenorphine with Naloxone (Suboxone) (ID 65846)\". Erowid.org. Oct 11, 2010. erowid.org/exp/65846",
 "substance": "Buprenorphine with Naloxone (Suboxone)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "8 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(pill / tablet)",
   " ",
   "4 mg",
   "sublingual",
   "Pharms - Buprenorphine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "65846",
   "Male",
   " ",
   "Not Given",
   "Oct 11, 2010",
   "19075",
   " "
  ]
 ],
 "report": "<p>Approximately 2 years ago, I went into the ER with very sharp pain in my lower back and down my left leg and was told I had severe sciatica.  This was extremely painful and I was given some painkillers and told basically I would have this the rest of my life.  This was the beginning of my drug addiction to vicodin.</p><p>For a while, I got bye taking just one ES Vicodin for the pain and then was really liking the buzz on it.  Sure vicodin helped my back but the feeling I got warm and fuzzy from it was great too.  Currently my daily usage for vicodin is about 70-80mg and for me that signifies a problem.  Anyways, I heard about a drug called Suboxone that contains buprenorphine (sounds a lot like morphine doesn't it?) that helps people get off of vicodin.  I did research and found a local doctor who specializes in this and saw him today.  I was told to make sure I went into the doctors appointment in withdraws and I didn't take any vicodin for about 48 hrs and was feeling it.  Runny nose, ready to jump out of my skin.....you know the drill.</p><p>I was prescribed 8mg of suboxone per day (which is quite expensive without insurance) and went home as quick as I could and slid a pill under my tongue.  Within 40 minutes my withdraw symptoms were completely gone and I was in such a great mood!  I had so much energy BUT this sure did and does feel like being high on a nice dose of vicodin.  I got home and just grabbed the lawnmower and mowed the grass, came inside and said to myself 'now what' with all this energy.  I called my wife (not telling her how high I felt) telling her it's the greatest drug in the world my withdraw symptoms are gone.</p><p>I just took another 4mg about 2.5 hours ago and feeling very high.  Hard to concentrate and even type this and have read so much that this doesn't get you high.  A friend said it got him a little high the first time and then just felt normal afterwards so who knows........but right now this is unreal.</p>"
}
