{
 "title": "Ramadhan",
 "author": "Seyed al musawi",
 "citation": "   Seyed al musawi. \"Ramadhan: experience with Fasting (ID 65861)\". Erowid.org. Feb 13, 2008. erowid.org/exp/65861",
 "substance": "Fasting",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65861",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2008",
   "Views: 4393",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\nRamadhan is a month where muslims worldwide begin fasting with the new moon of the 9th islamic month. As soon as the new moon is sighted fasting begins the next day and no food (liquid, solid or otherwise) is allowed from 1 hour before sunrise till sunset time.<br>The month is a month of spiritual contemplation, reading of the quran, and letting go of all worldly attachments. Muslims believe that the human being is made up of two parts. One is the worldly body and the other is the spiritual body. Each one is inseparable from the other and what we do to one affects the others and vice versa. <br>For example when we eat a lot of food we feel very heavy and it brings us more in tune with the physical body but when we abstain and eat the bare minimum our bodies and minds quiet and we become more in tune with the spiritual. So its very much like a seesaw and the best is a middle path between the physical and the spiritual. This is the balance that helps to really progress.<br>So during this month by not eating muslims try to become more in tune with the spiritual side of life. The first three days tend to be somewhat difficult as the body adjusts to life without food or water but usually after the first few days hunger isn't even felt and it just becomes a state of being. Once that happens we begin to tune into the spiritual and see, feel, and understand things our food heavy minds are normally too 'busy' to feel and understand.<br>There is a lot to this month and it can't really be contained within a short article but mainly I wanted to just give a brief intro and also give some physical effects of not eating much:<br>One effect is sleep time is cut down considerably. 3-4-5 hours is enough and I feel so rested its unbelievable. When my body isn't digesting food its incredible how much energy it saves.<br>Two: I save an inordinate amount of time that I would normally spend eating, preparing the food, washing the dishes, buying the ingredients for food, downtime from digesting food, and even some time getting it out of the system. Its an incredible saving of time.<br>Three: energy and mood levels tend to be very high in this month. Its  a seeming paradox but thats how it works. <br>Four: Peoples Akhlaq (behavior and way of treating others) a lot of times improves. I noticed that I am more careful about what I say and what I do and think than in usual months. My mind is clear and I feel very light so I'm more conscious of my life, where I'm going, and what I'm doing with it.<br>That pretty much sums up some aspects of the Ramdhan fast for me.\n\n\n"
}
