{
 "title": "Cosmic Baby",
 "author": "evlove",
 "citation": "   evlove. \"Cosmic Baby: experience with 5-MeO-DMT & Salvia divinorum & Cannabis (ID 6589)\". Erowid.org. May 2, 2001. erowid.org/exp/6589",
 "substance": "5-MeO-DMT & Salvia divinorum & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(leaves)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 6589",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2001",
   "Views: 14666",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOne summer evening, I placed appoximately 25 mg of 5-MEO-DMT into a pipe with a salvia and marijuana mix in such a way that it was fairly evenly distributed throughout the pipe.  I had intended for this to be shared by three other dreamers, but things didn't quite work out this way.  I took the first hit and apparently I vaporized the majority (if not all) of the 5-MEO-DMT.  (The other dreamers reported threshold 5-MEO effects and some bad taste, but mostly only felt the marijuana.)      </p><p>Most of the following experience seemed to happen simultaneously and non-visually, non-audibly, non-sensually, however, I don't know how to communicate these features accurately with words, so please keep this in mind. </p><p>(3, 2, 1...)</p><p>Contact:</p><p>Before I let out my breath, I was shot up in the air about fifty feet and little bit back.  It was almost like standing on a ledge.  I was not using any of my usual senses and yet I was able to perceive clearly.  I was aware of my body and my friends and my life below, but I was really far away.  On my left side there was a being of light, an angel if you will.  We were standing outside of time and outside of space.  He began to tell me that, cosmically, I was like a baby. </p><p>Simultaneously, I began to experience being in the womb, floating in space (like 2001) at one with everything.  At the same time, I was nothing really, I was just a point perspective, but I could experience...I 'saw' myself growing and evolving from a cell into a fetus into a child into an adult and still I knew there was more to come.  Intelligences and beings beyond my grasp or former conception became known as the future me beyond this and yet happening right now.</p><p>I would converse telepathically and communicate with the being while all of this was happening.</p><p>and then, in real time, every so often, I would find myself back on the couch, my arms around my friend, my body curled in a fetal position...I would ask her 'Is it alright?' meaning both 'Is it alright for me to be wrapped around you?' and 'Is it alright for me to go back?'  She would reassure me and comfort me.  I would then shoot up back to the ledge, which I never left and continue to be taught.  </p><p>This happened many times with the portions of real time eventually taking over.  My friend had taken on a motherly aura and I felt as if I was a newborn being nursed.  I looked over and my other friend asked how I was doing and I told him, 'I'm still real far away.'  He told me it would be over soon and after that I didn't go back up.      </p><p>The whole experience took about ten minutes real time, but it felt like an eternity, not forever, but rather outside of time.</p><p>The remaining effects, trails etc. lasted another 30 minutes, although, I felt like I was back to baseline after I came back from my encounter.</p><p>Epilogue:  About three weeks later I picked up Stan Grof's 'The Holotropic Mind' and I was amazed at the similarity of my experience with Grof's perinatal matrixes.</p>"
}
