{
 "title": "Relaxing, Pleasant, Worthwhile",
 "author": "pillowz",
 "citation": "   pillowz. \"Relaxing, Pleasant, Worthwhile: experience with Kratom  (ID 65923)\". Erowid.org. Nov 5, 2007. erowid.org/exp/65923",
 "substance": "Kratom ",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 Tbsp",
   "oral",
   "Kratom",
   "(tea)",
   "  T+ 0:50",
   "1 Tbsp",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65923",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2007",
   "Views: 22600",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To preface this submission, let me first say that I am Mormon. Not the best in terms of rules, but very strong in the principles of the faith. This being said, I attend BYU, a mormon run university in utah. I have been experienced to many other drugs before, and am quite experienced with cannabis, MDMA, DXM, LSD, Shrooms, and cocaine. Like I said, I don't do well with the rules, but anyway. It's somewhat difficult to acquire any drugs of note out here, so I looked for legal alternatives and came upon kratom as being heralded as one of the better legal entheogens. I ended up convincing my roommate that it would be interesting, and he, being mormon, but somewhat open minded, got excited to try it. Now to the experience.</p><p>I ordered a company's 'private Reserve' leaf which was supposed to be about 3 times as potent as the premium grade most shops sell. We made 2 tablespoons of the chopped up leaf into a tea, doing the double steeping (steeping once, draining water into separate container, then steeping the same leaves again to get all the contents from them) method, and then added tang and honey, and drank it down. For the first batch we used probably 2 cups of water, which is a lot more than most, but when it came time to drink it, almost all the bitterness was masked, and the tea was somewhat enjoyable (to me, not my roommate). About 30 min later I started the second batch because my roommate was claiming that he didnt feel much, which I didn't believe because I was already feeling a need to be active.</p><p>To describe what I was feeling at that point, I felt very relaxed in my body, but felt the need to be active (physically) in my mind. It was a good feeling, and since I am usually very antsy and restless, the relaxation was a blessing for me. My roommate proceeded at this time to describe what he was feeling (I knew that his claim of nothing was a lie). He said that as he was sitting on the couch he felt as if his body was exhausted, like he had just stayed up all night (dont worry it got better for him in the end).</p><p>I was getting ready to go out with a girl who had started expressing interest in me, but I didnt want to leave my roommate in a bad position, so we made a second batch of the same amount of leaves, bringing our totals for the night to anywhere from 5-8 grams each.</p><p>I left, and went out with this cute half japanese girl, and the whole time I felt immeasurably relaxed, and my muscles were very uncoiled and relaxed. I also felt mentally at ease as if everything were right in the world. To make it clear, the effects are not as perception changing as say, cannabis. Cannabis highs involved feeling... not impaired, but I can tell that I'm high (cannabis is an amazing drug). (note: during the last year and a half before coming to BYU, I probably smoked 2-4 times a day,usually of dank headies kindbud =)</p><p>The timeline of this whole adventure was like so.</p><p>7:20-Drank first batch</p><p>7:45-feeling good, start second batch</p><p>8:10-drank second batch</p><p>8:45-feeling of relaxation permeating my body, and no anxiety or anything negative. Like I said earlier, everything felt 'right'. </p><p>8:45-3:00- Feelings of relaxation and ease persisted. The whole time I felt the opiate effects of slight muscle control strangeness. Not impaired, but moving and tactile sensory info felt strange and fun.</p><p>4:00- Before I left her apartment, she gave me a massage (she was gooood) but the effects had begun to wear out, aka, muscles werent relaxed, which is partly why I got the massage. </p><p>The next morning, today, my roommate said that towards later into the evening (I think around midnight) he had vivid waking dreams that were neither good nor bad (he is a lil strange, but I love him in that manly brother way). Overall I think he enjoyed it, but isn't being honest with me.</p><p>Overall I would recommend this to those who aren't really looking for a quick euphoric high. It takes time to prepare, and isn't overwhelming like other things, but for total relaxation and ease of anxiety without being overwhelmingly mind altered, this is a good way to go. As I said earlier I am very experienced with 'real' drugs, and know what it feels like to be totally gone in a variety of ways, yet I would and am still going to do kratom again. It was very pleasant for me, and not at all unpleasant (no nausea, no hangover) I might go higher dose wise next time.</p><p>Peace all, and no matter what substance you partake of, partake responsibly and knowledgeably.</p>"
}
