{
 "title": "Attending Church",
 "author": "Mchl",
 "citation": "Citation:   Mchl. \"Attending Church: experience with Ayahuasca & Cannabis (ID 65992)\". Erowid.org. Dec 16, 2007. erowid.org/exp/65992",
 "substance": "Ayahuasca & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "300 ml",
   "oral",
   "Ayahuasca",
   "(liquid)",
   " ",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 65992",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2007",
   "Views: 9272",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs a little boy, I was raised in a catholic environment that made me attend church regularly. Not once was I touched by words of the wise and was always counting the minutes before I could leave and play again. Not this time. \r\nIve experienced a thing or two with psychedelics. In fact, I owe my awakening to them, if you know what I mean. So Im quite spiritual and use the foods of the gods to communicate with them. However, in all of those travels I have been alone or with relative inexperienced co-traveler and had to find it all out for myself. Thats why I decided to go to church. The Santo Daime church that is. After a single email, I was welcome to attend. I live in Holland, and the Santo Daime church is a genuine religion approved by the government. I read some experiences on the net for preparation and I was on my way.\r\nI felt this was going to be quite something and so I smoked some marijuana before traveling and prepared myself for the experience in the bus/train by meditating and getting my mind clear. \r\nThe first surprise of the evening was that the ritual (or work as they call it) was actually in a church. I was expecting some sort of communal hall. I was a bit early, so no one was there yet. Then a 60+ woman with beautiful intriguing eyes came along opening the church. Soon the whole church was filled with about 60 people of all ages. I was expecting more like 20 hippies and shaman kinda creatures but the most normal people attended. I mean my mom could have been in the crowd (thank god she wasn't). They gave me a specific chair (sex and age was divided) and started singing. In the middle of the circle was a table with the five leaders of the ceremony, with one guitar and one flute player. On the table was a cross with two horizontal sticks and on the walls were pictures of great men. One guy with a long beard, one smiling lady and one black farmer. People who had done great things for the religion.\r\nSoon the first Santo Daime was served. Out of my experience with natural psychedelics, I expected it to be disgusting which was most definitely true: it tasted like vomit. Luckily, it was gone in tree zips. I sat down for about an hour, listening to the songs, feeling a bit of the ayahuasca affect me but I wasnt really impressed. The ceremony was too religious in my sense and I was pretty bored. Before the second sacrament was a twenty minutes concentration. In it, you ask the lady of the forest what you want her to show you. By that time people were already vomiting and started to act manically (you know) but I still wasnt impressed.\r\nOut came about 60 joints (Santa Maria, how they call it, is also a secret) and now we were all happily smoking together. Three hits: one for the sun, one for the moon and one for the stars. As my habits of smoking I was forgetting to pass it directly. The marijuana helped to kick it off and the second Santo Daime was starting to work. I stood up and went to talk with one of the supervisors to help me and teach me some things. There were about six supervisors there, but they were all messed up as well. \r\nAnd all of a sudden I was totally in it. I cant recall where or when it happened, but it did! It started with the good site and I was feeling the bliss I was familiar with from earlier experiences, I felt Gods energy shining on me. I was in the supposition that I could control the trip (like always) and tried to stay in the happy place. But not long after I was dragged into the darkness. The hymns were fast and powerful since about 40 people were singing. I was fighting it and frantically keeping on to my mind. Not to much luck though. \r\nAfter I had been in the mess for a lifetime (lets say about and hour) a decided I had to get rid of all this negativity. I made it my goal to vomit and do it in the church hall. It would be something I had to overcome and I would be cleansed afterwards. I tried and tried and went deeper into the darkness. But somehow I couldnt manage to vomit. Now I was really deep into the darkness. I had to make myself remember all the good things in my life like my beautiful girlfriend in order not to kill myself, because I was quite seriously thinking about ending all of it. It was too much.\r\nBut then I started to understand more, and I was thinking about all the things I read. For example the phrase what you pay attention to, you become aware off. So I looked God in the eye for the first time that evening (of course Im not talking about a sadistic, dress wearing puppet player) and started to fight my way out of the darkness. And from that moment on it became a group process. I realized we were communicating telepathically when I was realizing these things and people around me did at the same time. I felt the limitations of my body dissolve and we became indeed ONE. We fought the darkness together. People who had been on the floor acting like maniacs, came to their senses again and participated with us. We were winning. The light in the middle (what I call God) slowly started to fade which made me realize there was indeed an end to this madness.\r\nStanding up we sung and celebrated. I was acting like a child since spiritually seeing I am a child. And slowly the light went out like a candle. When it was over, it was over at the same time for everyone. We all cheered and laughed. It was so beautiful (sigh). It was then I realized five hours had passed, but I would rather say it was five eons.  Looking back, this trip for me was a test or practice in faith and patience and mindset. It was beautiful, but not totally me. I need to be outside instead of in a church, I need to play instead of listen and I need to help instead of ignore. Looks like South-America will be next.\n\n\n"
}