{
 "title": "Where The Wild Things Are",
 "author": "Scott West",
 "citation": "   Scott West. \"Where The Wild Things Are: experience with LSD (ID 6602)\". Erowid.org. Mar 10, 2002. erowid.org/exp/6602",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 2:30",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6602",
   "Male",
   " ",
   "Not Given",
   "Mar 10, 2002",
   "Views: 9037",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWhere the Wild Things Are</p><p>by Scott West</p><p>(all names have been changed including my own)</p><p>After a couple of months I have decided to write down my LSD experience so as not to forget it because it is something I might never do again, and also so I can easily share it with others.  It was some time in January of 2001, and I had always wanted to trip, especially after some of my friends had done acid and mushrooms a couple months before.  I think my attitude going into the trip was very influential in how good it was.  I was not afraid of having a 'bad trip.' In fact I wanted to have a freaky experience because I thought that sounded cool.  Little did I know I would have a profound experience that would last two days and far exceed the quality of any of my friends experiences.</p><p>I am a straight A student (a senior in high school) and also a very good artist and a very intelligent person, who's hobbies include computer programming and car audio.  I wanted to trip because I was confident that if acid could have cool effects with the weak burned out stoner minds and weak imaginations of some of my friends, just imagine what it could do with my brain and my vivid imagination!  I was going to be very disappointed if I didn't have some wicked visuals. There is one more thing I should mention.  Friday morning I took 2 or 3 pills of Gingko Biloba, because I thought maybe it would increase blood-flow to the brain and maybe stimulate better visuals and memory power, because I was hoping for some flashbacks (which I really didn't know anything about at the time.)  I didn't hear this idea anywhere I just thought of it all on my own and I think maybe it did some good.</p><p>It started at 10:00 PM on a Friday night.  I was at my friend's house where I spend the night all the time so it is like a second home to me.  I took 1 hit of blotter to start out with and my friend Nathan took two.  My other friend Brandon started getting drunk while my friend's Japanese exchange student took 4 hits.  My friends Brian, Evan, and maybe one or two others were there too but remained sober. At 11:00, Nathan had to drive to a party to pick up his brother and his friend.  I went along. While we were there, I saw my school principal and laughed as I thought 'if only he knew.'  We came back home and went down in the basement where we hang out.  At 12:00 I noticed that things seemed a bit different than normal, but I was not very impressed yet.  I went into a big walk in closet where it was dark and the magic began to happen.</p><p>I looked at boxes that were shelved along the wall, they began to ebb and flow to the light patterns of the furnace.  Then I looked at the furnace and its bright blue sparks, it was awesome.  </p><p>As I came out of the closet I got an overwhelming feeling that Evan was behind me, but when I turned around he was not.  When I came out Nathan was like 'are you tripping yet' and I was like 'kind of' then we laughed and I thought it was so cool.  About that time I started noticing sparks of light and the static was coming OUT of the TV.  I was also seeing some trails and random static.  Brian walked over to me, and I saw a bit of a trailing effect behind him, but I didn't know what it was yet.  I talked to Brian for a while and explained that what I was seeing was cool, but I wanted more!  Then he went home.  Then I asked Nathan for another hit of blotter, and he cut me off a big one.  At this point I don't think the first hit had even peaked!</p><p>I sat down on the couch and me and Brandon played some Tony Hawks Pro Skater 2, but mostly he played and I watched.  Nathan was sitting in a chair quietly tripping and Evan was getting drunk.  I looked down at the pillow next to me and noticed that it was 'breathing.'  I thought to myself, 'oh my god I'm tripping.'  Nothing could prepare me for what I saw when I looked up.  I think once you realize it is working is when it really starts to work.  I looked up next to me and saw Nathan watching TV, totally oblivious to the fact that his face was covered in eyeballs!  His skin looked it was painted with big brush strokes, or maybe clay with thumbprints in it.  His goatee/beard was growing like vines, and It became a vine and grew up his face.  I looked around the room and noticed that everything was flowing and moving but this time in broad day light!  All the textures were more detailed and dimensional.  Colors were going crazy.</p><p>A few minutes later someone turned out the lights.  I looked up at the ceiling and saw that the tiles had become a kaleidoscope that danced in the soft glow of the TV.  The ceiling tiles would be square, and then morph into other shapes and melt and flow in a full rainbow of colors.  </p><p>As I looked around everything was alive.  I laid back and just looked at stuff for some time.  Then me and Nathan played video games for a while.  One thing very strange that I remember was that when I played tennis it seemed as if I wasn't even playing, but my hands were moving on their own.  Somehow Brandon managed to beat me several times in tennis even though he was trashed by this time.  I had a few more mildly amusing visuals, mostly eyeballs in weird random places.  One time I saw a face in some rocks in a part of Pro Skater, which looked like Hillary Clinton.  I exclaimed and Nathan replied, 'you saw it too?!'  At one point Brandon was drinking some coke and jack (or something like that) and it made awesome gurgling sounds that swirled around my head and echoed in 3 dimensions. Sometime during this period,  Nathan's dad woke up and came downstairs.  I just tried to act drunk.  It was so scary I don't even remember what happened.  But he apparently didn't suspect a thing and went  back to bed.</p><p>Then Nathan and Evan decided to go upstarts and go to sleep.  I have no idea what happened to Nintendo (the foreign exchange student.) I think he may have been comatose on the floor or something.  Brandon decided it was time to pass out so he turned off all the lights and told me to go sleep in the bed that was around the corner (next to the closet.)  But I was not going to be sleeping that night.  This was probably around 2 in the morning.  I attempted to stand up only to realize I had a severe case of vertigo.  Everything was melting and I didn't know what was what.  Brandon helped me to the other bed and then passed out on the couch.</p><p>I took off my shirt and hung it on what I thought was the back of a chair.  It fell to the floor and I realized that there wasn't a chair there at all!  This was a little scary but I was amazed by how cool it was.</p><p>I laid there on the bed for a few seconds.  It was pitch black.  I thought to myself over and over again, 'this is when all the weirdoes come out.' </p><p> I contemplated how letting acid play with my brain was like a little kid playing with a big gun.  There were forces at work way too powerful.  Humans were never meant to have experiences like this.  When the room became bright again (my eyes adjusted to the darkness) I got up and walked around.  Everything reminded me of Alice in Wonderland (like the tiny little doors and stuff).  The pool table was little tiny and everything assumed weird proportions.  Sometimes it felt like I was walking up or down hill or the floor was moving.  One cool thing I liked to do was walk toward a wall that had some pictures hanging on it.  The pictures, which were constantly moving in a random vibration just like everything else, came toward me faster that I was moving toward them.  In movies they call something like this the Alfred Hitchcock effect, I have learned.  I would walk around and see simple visuals for a while.  There was a treadmill that had an LED display that showed random blinking red lights, and as I glanced in the blinking lights I could see patterns and letters.  Then I had remembered Nathan had told me it was fun to look in a mirror while tripping.</p><p>So I went in the bathroom and turned on the light. Oh my God!  If this is a movie, here comes the bathroom scene.  The first thing I did was pee.  This was very cool.  I could see it sparkling in an indescribable way.  The coolest thing was that there was smoke, or more like the distortion you see from the refraction of light through very hot air (like a mirage in the desert,) was rising from the toilet and off of the stream.  It made a cool metallic sound.  Then I turned around.  I leaned on the counter and my fingers melted into it as if they were made of wax and the counter was very hot.  My finger tips were shaped like suction cups suctioning onto the counter.  I looked at my reflection which was going crazy, it was distorting all over the place, and it was during this time that I realized I had control over my hallucinations.  It was like when you are dreaming and you suddenly realize you are dreaming and begin to control the dream.</p><p> I began to distort my face and made it look like that famous old painting 'Scream' where the guy has the big head.  I think it was by Van Gogh.  Anyway, I started thinking about the song by Disturbed, 'looking at my own reflection and suddenly it changes, violently it changes' and I wondered how far I could take my newfound abilities.  </p><p>I decided I was going to turn into a ware-wolf.  I stared into the mirror.  I scowled.  And then it happened.  My nose turned into a snout and hairs grew out of my cheeks.  For one brief moment.  I was a ware-wolf.  Then I started playing around with the 'trails.'  I was flailing my arms around and watching what reminded me of 'mouse trails' on a computer.  I then morphed my face some more and looked at the clock wondering what time it was.  As I studied the strange mechanical device for a few minutes I concluded that it was around 5 AM.  I went back out of the bathroom and walked around for a while. </p><p>Up until this time everything had been very enjoyable and I was thinking how much I wanted to do this again sometime.  I was thinking it was nearing over but what I didn't know was that it was not even half way through.  I sat on the bed and took off my glasses for a few minutes.  I stretched my arms out like the toy 'Stretch Armstrong' and noticed that everything had a strange wide angle lens effect to it.  I had the feeling I was a huge being a hundred feet tall and the glasses on the table were teeny tiny.  This really reminded me of more Alice and Wonderland stuff.  I took another walk.  Then I sat down and tried to go to sleep but the harder I tried the more it burned to close my eyes and the more awake I became and the harder I tripped.  I started writing poetry (none of which I can remember) and thinking about how I wished I had some paper and a pen so I could draw and write while on acid.</p><p>A few hours went be and I contemplated everything from Relativity to the Infinite String Theory, and how it is all connected.  Then I pondered how LSD works and what I was experiencing.  I became very mad that I could not go to sleep and very badly wanted to return to 'normal' and go to sleep.  I got very scared.  I tried not to think about that and just enjoy the ride.  I closed my eyes for the first time and saw strange neon bubble pattern accompanied by electronic noises that seemed to form music of some kind.  Also a line from a rap song that was popular at the time and I had listened to earlier in the evening, 'been so lo-ong, he's been o-o-on' kept running through my mind.  I got scared again and was mad at them for leaving me here by myself.  Then I remembered Brandon.  I wanted to wake him up and tell him of all I had seen and felt and heard.  I tried to wake him but every time I did he would just mumble something and fall back asleep.  This made me very scared and lonely.  I'm not sure where all the time went, but I do know I tried to go asleep again, and remember the bed breathing and moving and melting, and I was thinking 'it would be soooo cool to be having sex on acid.'  Melting into the bed and whatnot.</p><p>At about 10:00 AM I heard a noise and the light came on.  I was scared to death it was going to be Nathan's dad walking into the room, but it was just Evan and Nathan coming to wake me up.  Brandon had already gone home.  I told them I was still tripping but not as bad as earlier in the night, and they told me to sit in the basement and watch cartoons.  To make a long story short I took a very interesting shower and ate some very odd tasting breakfast rolls that his mom made and she asked me what I was going to do next year and I had no idea what she was talking about so I said 'go to Purdue I guess' which was apparently the answer she was looking for.  Then my friend Mark called and told me to come over to Brian's house and help him install his new car radio.</p><p>So I got in the car and drove over there.  Fortunately his house is only about a ¼ mile from Nathan's.  I had told my parents I was going to do this, and then go to work at 3:30, to make sure I would not have to come home at all the day after my trip.  It was all very well planned out.  As I drove to his house I felt like I was flying an airplane.  It was really cool. When I got out they were standing in his driveway.  Brian made the comment 'your car is making a lot of smoke.'  Then I realized I had been shifting at about half the RPMs I should have.  By this time I did not feel like I was tripping anymore I just felt very stupefied.  I was in a half awake half sleeping state of conscienceness that I could not escape from.  I felt very stupid, literally. This was a horrible feeling.  I was in my own personal Hell.  Especially because my brain is about all I have and I was scared I wasn't going to get it back.</p><p>'I suppose I might as well tell you guys, because I wont be able to hide it very longI'm fucked up.'   They assumed I meant I'd gotten an early morning start on potsmoking.  'NO, I took LSD last night, and I'm still fucked up.'  That morning and afternoon were one long funky adventure.  We never did figure out how to get his factory radio out of his Jap car, let alone get the new radio in.  One particularly interesting incident I remember was when I went inside after his parents left for work.  I asked him to make me a sandwich so he did.  He asked me whether I wanted white or wheat.  It was the hardest decision I have ever made in my entire life.  I was like 'just pick one I don't know.'  But just to antagonize me he insisted that I choose.  Finally I picked one at random.  White.  He made me a ham sandwich, but when I tasted it the ham tasted like bacon.  I found this to be an intriguing perceptual distortion.  I asked him if the ham tasted salty to him and he said 'no.'  The rest of the day just got more and more hellish within my head because I wanted to return to normal but couldn't.  Outside my head things slowly became more normal.</p><p>When you are awake, you can lay down and go to sleep.  When you are tired you can shake around and wake yourself up.  When you are drunk you can take a cold shower and feel good again.   When you are stupefied like I was, there is no way out of it. It sucked.  I didn't care whether I woke up or went to sleep, but I wanted to do one or the other. Then I went to work.  It was also within a ¼ mile of where I was, which was convenient.  I work at a retirement home and there are a lot of old fucked up people who I cant understand most of the time.  For once I was on their level.  I was communicating with them, I understood them, it was awesome.  But on the other hand I was messing up everything I did, ruining pots of coffee and such.  I kept expecting people to notice and I came up with an excuse in case anyone said anything.  I was going to say I had a headache and could not think.  But noone seemed to notice.</p><p>After work we had a meeting about safety.  It seemed to last forever and it was so-o boring.  I don't remember a bit of what was said, but I do remember I saw a few sparks of light like I had seen the night before.  When I got home I was scared my parents were going to notice something was up, but by this time I was pretty much back to normal, except I hadn't had any sleep for 2 days.  I acted tired and said I was going to bed early.  I curled up in bed and tried to sleep, but I still couldn't.  My mind raced and I was scared, but eventually I fell asleep.</p><p>The next day I woke up fine and went to school.  I told a bunch of friends about it and they were either like 'wow' or really pissed at me. That was an experience I will never forget.  I do not regret it.  However, I'm not sure if I will ever do it again, due to the fact that it may make you stupider.  I realized weeks later that my experience is perfectly modeled in the book, 'Where the Wild Things Are.'  Each page can be directly correlated to something that happened on the night of my trip.  The similarity is uncanny. I asked Nathan about what he had seen while on acid and he told me he had seen 'neon grasshoppers' jumping across the street.  When I asked Brandon, who has taken as many as 7 or more hits at a time, what was the coolest thing he ever saw, he said 'I saw the ceiling come down and touch the floor.'  So I am assuming that compared to other people this was a pretty damn good trip.</p>"
}
