{
 "title": "An Outrageous Combination",
 "author": "Aftergas Fog",
 "citation": "   Aftergas Fog. \"An Outrageous Combination: experience with DMT & Nitrous Oxide (ID 66034)\". Erowid.org. Sep 28, 2007. erowid.org/exp/66034",
 "substance": "DMT & Nitrous Oxide",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "smoked",
   "DMT",
   "(powder / crystals)",
   "  T+ 0:01",
   "2 repeated",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66034",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 28, 2007",
   "Views: 8499",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis report deals specifically with the smoked DMT/nitrous oxide combo and doesnt get into discussion on the effects of each material taken alone.  Im going to assume the reader is duly experienced in that regard.<br>I was speaking to a friend who informed me that he had been mixing DMT with nitrous.  He said that now he had tried the combo, he may never want to do DMT without nitrous again - it is simply, that, good.  Naturally it ended up on the top of my must try list.<br>Being a bit nervous my first time, I had decided to take it slowly.  However, my friend held the lighter up to the DMT pipe, and as Im inhaling hes saying, Go! Go! Take it, take it! More, more, more, TAAAAKE IT!  Im feeling unreasonably pressured, but respond by sucking in the largest lungful of DMT that I can manage and hold it in as my world slowly begins to dissolve.  As a storm cloud of DMT vapour bursts from my lips, the next thing I know hes jamming the nitrous dispenser in my mouth and saying Alright, now, suck it back and hold it in    I breathe in the nitrous as I feel the warm, oceanic shroud of DMT envelop me.  Im fighting off my nervous anxiety, but it quickly melts away as I slip into a thoroughly abstract psychedelic wonderland of indescribable complexity.  <br>I was completely disembodied and flying through hyperspace in what amounted to a sort of mental orgasmic bliss.  I sat upright, eyes closed, rocking back and forth with a smile from ear to ear, mumbling only the words thank you to my friend for encouraging me (pushing me?) to go in so far.  There was no sense of fear, anxiety, discomfort  just an insane melee of colours and flashing lights.  There is almost no point in trying to describe it  its like trying to describe the shape of a colour and the colour of a sound.  As an alternative,  I will try to highlight the differences over my experiences with DMT alone.<br>For lack of a better description, I find the nitrous smooths out the DMT experience considerably.  Some of the more intense physical effects of the DMT are tempered, like the heaviness in the chest, the sometimes overwhelming rushy feel, the shortness of breath.  These all seem to be rendered rather inconsequential with the addition of the nitrous.  Its hard to feel the body load when there is no real sense of having a body.<br>Visually it is more intense than DMT alone.  The usual kaleidoscoping fractals, clown images and flashing lights explode in a fury of incomprehensible madness, as if moving into a fourth dimension.  Sound, colour and shape become almost indistinguishable, blending together in perfect synethesia.  If there are sounds in the room, I may hear them, but I may not be aware of what they are.  While I like either silence or music with smoked DMT and find talking to be disruptive, I found the ambient noise to be less important with the nitrous.  My giggling and chattering companions actually sounded (sounded?) fascinating to me.  <br>Finally one of the more interesting effects from this combination is the tendency for the nitrous to prolong the effects of the DMT.  The linear curve of the comedown was much longer, with visuals still being present up to a half hour later.  <br>Ive since tried this combo many times and find the materials to be remarkably synergistic.   My experiments with others have resulted in fully positive results, with not a single person finding the experience to be anything short of wondrous.  That said, its bloody intense and one should know what they are getting into before they try it.  Im always very careful with my set and setting, and have a great deal of respect for these materials.<br>Yes  I just may never want to smoke DMT without nitrous again - it is simply, that, good.\n\n\n"
}
