{
 "title": "Touching the Infinite",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Touching the Infinite: experience with 2C-T-7 (ID 6605)\". Erowid.org. Jan 5, 2002. erowid.org/exp/6605",
 "substance": "2C-T-7",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-T-7",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6605",
   "Male",
   " ",
   "Not Given",
   "Jan 5, 2002",
   "12256",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy last 30 mg experience with 2CT-7 is without a doubt one of the most meaningful and significant events that I have been fortunate enough to share in.  While the surroundings of some bars and clubs is more informal than I normally prefer, somehow the night perfectly complimented all the amzing things that were revealed to me.</p><p>Many of my past assays have been alone in an attempt to gain better insight by not being distracted, but on this night I just wanted to have fun.  What I got was so much more.  I gathered a few friends who have never tried it and we drank a few bottles of funny tasting water.  The first hour was typical, not much effect, and then while we were sitting in the restaurant I was overcome with the most intense feelings.</p><p>Within minutes we were all launched into a psychedelic space of the most wonderful kind.  My body seemed to lose feeling and was almost numb, but I soon realized it was just the entire physical world becoming unimportant.  For a moment I was filled with fear... What have I done?  Why do I choose to use experimental chemicals?  Can I handle this?... And then I looked around me and I saw my friends in the exact same place.  There was a sense of peace that came with the knowledge that we are all in this together.</p><p>Over the next hour the entire world became an undulating, colorful, and wonderfully beautiful place.  As I slipped deeper and deeper I felt more and more sensitive and connected.  My thoughts merged with the thoughts of others and every perception was interpreted as one sense.  Not just the perceptions of sight, sound, smell, and touch, even my mood, intuition, attitude, and opinion became fused.  I saw feelings, and felt pleasure as a touch, and for a time I was content to merely take in all the activity around me.</p><p>I watched as other people acted out their lives.  I saw the connections between them, myself, and my friends.  All the motion, the colors, the blending of thought and sense filled me with nearly inexplicable joy.  The beauty of it all together was almost too much, and there were times when I questioned how perfect this world really was.  I knew and saw pain around me.  There is hurt in the world, and many other painful evil things.  I was quite aware of these as well.  They came to me in the form of physical pain, emotional distress, confusion, and sorrow.  Even though I do not desire things I am glad I kept a sense of them.  We do not live in a perfect world, we should not pretend it is okay.  We must seek out the activities that promote beauty and alleviate sorrow, the utilitarians out there will love it!</p><p>In the car again, all of us began to laugh uncontrollably, a child-like bliss of freedom, pleasure, and the sense that the world itself was somehow entirely new.  We listened to our favorite music and merged with it.  The emotions we felt became a state of living and not just feelings.  We ended up at a friends house where we slowly reintegrated into our right minds, happier but less satisfied.</p><p>Because on this night we were able to touch the infinite, to see with complete clarity the world in which we are so lucky to be in.</p><p>The beauty we saw that night wasn't drug induced.  The beauty, the thoughts, the happiness are there for the taking.  The only action required of us is to reach out like children: innocent, trusting, and eager.  Material such as 2CT-7 can aid us.  For a time it shows us the world which we often choose to ignore, but vital to our existence as passionate beings.  With each step we become more attuned to the World of Light and are better able to perceive the infinite as a continual presence, but it is not an end.  To touch the infinite is only the first step.  There are many more journeys to be taken and many more stories to be shared.</p>"
}
