{
 "title": "Pleasant Relaxation and a Perfect Sleep Drug",
 "author": "Zig",
 "citation": "   Zig. \"Pleasant Relaxation and a Perfect Sleep Drug: experience with Trazodone (ID 66052)\". Erowid.org. Feb 10, 2011. erowid.org/exp/66052",
 "substance": "Trazodone",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Pharms - Trazodone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66052",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2011",
   "Views: 25667",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have recently been looking for a sleep drug that would solve the problems I've been having due to use of methamphetamine and other psychostimulants.  After thorough research and testing of different substances, I am convinced trazodone may be one of the most underappreciated and most useful sedatives that exists.  I've tried several benzodiazepines (clonazepam and alprazolam), and also ambien (zolpidem) and while they usually sedate me in a pleasant way and allow me to get sleep, I find that I usually wake up the next day feeling less than refreshed, and I fear this is due to their negative effects on 'sleep architecture' (see published research).  Enough background information.  <br>I feel that I've been short on deep and satisfying sleep due to near daily stimulant use, so one night I attempted to deepen and enhance my sleep with trazodone 25mg.  The drug was taken a half hour before bedtime with a snack (significantly enhances absorption).  <br>I was surprised to begin perceiving the effects after about 5 minutes.  A heaviness in my limbs and a general feeling of physical satisfaction was noted.  My arms and legs felt very good staying put and not moving.  As the drug wore in I also noticed a bit of physical clumsiness and a tiny amount of mental slowness and disorientiation, which was a welcome change of pace from the frenetic daytime life of stimulants.  I proceeded to go to bed 30 minutes after dosing.  Lying in bed I felt like I could be comfortable not moving for hours - something I rarely if ever feel.  <br>I didnt fall asleep straight away because I wasnt used to the sort of spaced-out headspace that the trazodone was putting me in, but due to the fact that it removed all anxiety and because I was so physically comfortable, I enjoyed lying in bed for about a half hour until I fell asleep.  My sleep was definitely enhanced.  I woke up fewer times and fell back to sleep when I did wake.  My body wasnt nearly as restless as it normally would be, and my dreams were intensely vivid and memorable. <br>The next morning I felt the 'trazodone hangover' which consisted of continuing body buzz from the night before, and a bit of grogginess and physical slowness.  The negative effects disappeared by lunchtime, however, but the great feeling of physical refreshedness persisted!!<br>Trazodone provides me with a near constant physical 'refreshed' feeling of being comfortable in my body.  Whether this is due to refreshing sleep or the effects of the drug I do not know.  Either way I feel very healthy now and like my sleep has been restored.  One side effect of using trazodone is that I feel a bit more carefree and have less anxiety than normal.  I also do not know whether this is coming from the drug itself (25mg is a very small dose, however) or from the fact that I always feel refreshed and ready to go in the mornings. <br>Trazodone is one of the safest sleep aids (in terms of dependency) and seems to be one of the most beneficial in terms of effects on sleep architecture and mood.  I'd highly recommend it to people who feel like they cant get enough deep sleep or who deal with restless leg or middle of the night awakenings.  Dont take too much - I believe if I had tried 100mg or above the disorientation and strange feeling would have been severe.\n\n\n"
}
