{
 "title": "The Human Ripping Mechanism",
 "author": "Xodenx",
 "citation": "   Xodenx. \"The Human Ripping Mechanism: experience with LSD, Salvia divinorum (35x extract) & Cannabis (ID 66116)\". Erowid.org. Nov 28, 2007. erowid.org/exp/66116",
 "substance": "LSD, Salvia divinorum (35x extract) & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:30",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66116",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 28, 2007",
   "Views: 5170",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This story is not meant to be descriptive of my LSD trip, but more of my Salvia/LSD trip.  I have had many great trips on LSD and Salvia, but this Salvia trip was the utterly most horrifying, yet interesting experience of my entire life.  </p><p>I left school and went down to Charlotte, NC, where I had acquired a sheet of some extremely good blotter from a friend.  I decided to ingest some and tried it out with a friend named Cheese.  I was in the perfect mindset considering that my parents were out of town.  My mind was clear and I had no obligations for the next day.  However, Cheese was hesitant to indulge because he had work in the morning.  I practically bugged him into taking it because I did not want to trip alone.  </p><p>Time:0:00   We both took a hit knowing that the doses were powerful.  We waited for a while and smoked some pot with my other friend's mother.  We listened to Tom Petty and Bob Dylan for a while, smoking some delicious headies.  </p><p>Time:0:45   About forty-five minutes in, I started to feel light and giddy.  Chills ascended up my spine and my brain started to tingle.  We waited and waited for the doses to kick and finally they did.  Both Cheese and I experienced interesting visuals over everything we looked at, giggling and screaming with laughter the entire night.  Everything was going great, like every acid trip until...</p><p>Time: 4:30  About four and a half hours into the trip, I busted out some Salvia 35X.  I had never mixed the two before, and was extremely hesitant to do so because I knew it would be mindblowing.  I knew it would either make my trip more enjoyable or more frightening.  After debating and getting distracted by the acid for about 30 minutes, I packed up two seperate bowls of Salvia.  Neither Cheese nor I wished to go first so we decided to rip it at the same time.  We both exhaled, then inhaled as we torched the fuck out of the salvia.  I started counting to 30 and placed my cashed bowl on the TV stand.  It seemed like nothing was happening but then BAM!  I started getting sucked off the bed and on to the ground.  I was gripping the blankets and the mattress for dear life when all of the sudden, I fused together with the bed. Then, I became a blanket.  Our observer said we became extremely spaced out and silent, sparsely saying a word.  I physically could not talk.  Our sitters would ask us questions and I could not understand the alien (human) language they were speaking.  The words that rarely escaped our mouths were, 'Oh fuck,' and 'Holy Shit.'  </p><p>Suddenly, everything was transformed and gravity was pulling my body in a vortex.  I physically felt myself being ripped into a kaleidoscopic funnel and it hurt.  It felt as if my skin was splitting and I only existed as a skinny portion of human chunk.  I would try to move, and it would almost be that I would fall into a predetermined place, only to realize that Salvia is not a drug, but a force of extreme power and push.  Utterly frightened, I forgot that I had hit Salvia.  I thought that I was dead and I saw my entire family saddened by my death.  My soul moved out of the back of my head, through the ceiling, and into another voidful dimension.  I existed as nothing for what felt like eternity.  I was thinking, 'Why am I so stupid to mess with both of these powerful hallucinogens!?'  Before hitting the pipe, I knew that this experience could lead to heaven or hell.  I knew this experience would show me the depths of my brain that have never been observed before.  I can not describe the many parts of this trip because it was too confusing and horrifying.</p><p>When I started to sober up, my ego had been shattered.  I felt scared shitless and paranoid and I wanted to smoke a ciggarette.  No previous salvia experience had affected my mind this much and I was shocked by the synergestic effects of both the LSD and the Salvia.  I did not talk for about 10 minutes after I sobered up.  I did not feel like it.  All that I knew was that I had just been ripped apart in a spiralistic motion and that Salvia is the most intense drug I had ever tried.  I started thinking, and analyzing my trip, and slowly I began to laugh about how incredibly ridiculous the experience was.  I began to theorize how my brain can stimulate such incredible feelings, emotions, and thoughts.  Surprisingly, me and Cheese discussed our experiences and they were remarkably similar to each other.  This amazed us, possibly because the acid was still going strong.  </p><p>The rest of the night was spent in close company of good friends, laughing, joking, and being ridiculously spun.  I began to appreciate the horrifying way of life Salvia had shown me.  Overall, I honestly do not know if I will try this again.  Maybe, because now I know what to prepare for.</p>"
}
