{
 "title": "*WARNING* Rue / Phalaris and Methadone?",
 "author": "Jeff and Aja",
 "citation": "   Jeff and Aja. \"*WARNING* Rue / Phalaris and Methadone?: experience with P. harmala (Syrian Rue), Phalaris & Methadone (ID 6611)\". Erowid.org. May 3, 2001. erowid.org/exp/6611",
 "substance": "P. harmala (Syrian Rue), Phalaris & Methadone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "52 mg",
   "oral",
   "Methadone",
   " ",
   " ",
   "2 capsls",
   "oral",
   "Syrian Rue",
   "(capsule)",
   "  T+ 1:00",
   "2 capsls",
   "oral",
   "Phalaris Grass",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6611",
   "Male",
   " ",
   "Not Given",
   "May 3, 2001",
   "Views: 48967",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\naja: 140 lbs. female.</p><p>We are both on prescription methadone and have been for 8 months now. We mention this first because there were 4 people involved in the experiment and only the two of us got sick. After covering all the variables between us it seems the only difference between us was that we are on methadone.</p><p>The syrian rue was a home made extract made by our neighbor who has much experience with it, and indeed it gave us no problems at all. In fact in combination with the bowl we smoked we were allready in a mild psycadelic mind set when we swallowed the phalaris caps aprox. 30min after we took the rue.</p><p>The phalaris. We picked it our selves. It was our neighbor who first identified the plant, found in a large wetland park just outside of town. As to minimise the risk involved, as experience has taught us, by first we looked up the phalaris in a Flora and compared its attributes with the plant that he had found and it matched completely. He has prepaired phalaris many times before, but we are inexperienced with it ourselves and in fact we also came to your site to double check what he said about preparation and  dosage. He knew what he was talking about so we set to planning a trip to the woods.</p><p>First we dried the grasses, using the newest sprouts and only the leaves. We finely chopped the dried material and then boiled it on a low heat overnight. The next morning we strained the water and boiled it down into a resen that we then packed into the gell caps.</p><p>We ate very little the day before and fasted the day we hiked into the forest just outside of the community college we attend, washing down the syrian rue with a little OJ just before we started out. </p><p>Now that you should have an understanding about the setting, here's the experience: Like we said before we had been hiking into the forest for about half an hour when we found the perfect spot to spend the day. We set up a tarp to ward off the occasional sprinkles of a spring day in oregon, then sat down and smoked a bowl before swallowing the phalaris with a little more OJ. We all settled in and Aja got out a book of ancient mythology and begain to read a story. We never finished it.</p><p>Looking out into the woods, listening to her read, I was in a place were my every thought was revealing itself in vivid imagry passing before my minds eye. We felt serene, open, and surronded by the wonderfull lifeform that is nature.  Then the story was interupted by Aja suddenly jumping to the edge of the area to vomit. This was almost half an hour after swallowing the caps, and at about this time is when I started fealing nausious. It's also worth mentioning that our neighbor said that we started throwing up at about the same time that his started to kick in. The two of them (male and female, both smaller than us) took the same amount we did, but had no ill effects.</p><p>This was nothing alarming at first, because we understand that vomiting is often just something you have to get out of the way at the onset of drugs like this, usualy only once or twice but then it's out of your system and the trip begins. Not the case here, things just kept getting worse.</p><p>For the next two hours we vomited nearly every fifteen minutes. </p><p>Each spell was accomponied by profuse sweating. Tremmors and difficulty in coordination accomponied us the whole time. Between the first few spells the nausea subsided, offering blessed few moments of relief, but with each bout of dry heaving, swallowing water to rinse out our stomaches and instantly propelling it back outward again, our condition only worsened with every minute. </p><p>Hello, this is Aja, Jeff is tired of typing as it is 3:35 a.m..  Back to our story...We managed to get up enough strength to go home and treked back down.  We had to stop and puke a few times along the trail, but we had to get to the bus that would take us home to bed.  That's all I really wanted to do, was curl up in warm darkness and sleep it off.  Jeff had to stop in the bathroom and actually wanted to go to the hospital, as he thought he was going to die like the sheep.  But as the lady who he asked to drive him to the hospital declined (it's a sick world we live in), time took the worst of it off, and, after the bus ride we felt much better, as we actually got to get some sleep. Soft vibrations always help, like purring cats.</p><p>Now  I've slept, Jeff still has not been able to get a good sleep.  A loud buzzing sound accompianied him throughout the experience.  My head was open yet foggy and I had no thoughts (words), just feeling.  Body awareness was extremely heightened, I had never felt myself walk like that before and I do walking meditation all the time.!  Now that i have slept all I have left is overall achyness, a strong but dull pain in my legs, and a lot of confusion over why we got sick, as our friend has Never heard of Anyone getting sick from it before, so maybe it was the methadone.</p>"
}
