{
 "title": "The Wrong Choice",
 "author": "BEC",
 "citation": "   BEC. \"The Wrong Choice: experience with Salvia divinorum & Alcohol (ID 66218)\". Erowid.org. Dec 19, 2010. erowid.org/exp/66218",
 "substance": "Salvia divinorum & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66218",
   "Gender: Male",
   " ",
   "Age at time of experience: 24",
   "Added: Dec 19, 2010",
   "Views: 1939",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm a 24 year-old male college student with years of cannabis experience, a few 'shroom and cocaine experiences, and lots of drinking.  The only current substance I use is alcohol.  I was feeling comfortable in the surroundings I was although I was not familiar with them or half the people I was with.</p><p>I had been drinking a little bit while working, then played some quarters with fellow employees after hours.  So when I showed up at this house to see some of my favorite people, I was feeling relatively loose and comfortable (a far cry from my usually anxiety-stricken self).  Had a few more beers and we were just hanging out wanting to do something fun when some friends of the people came in.  One of them, 'G' said he had a little bit of Salvia with him.  My only prior knowledge of Salvia was anecdotal, a friend of mine said it was pretty cool, but just made you hallucinate for 15 minutes at most.  Well, I managed to get myself a hit of it, and was actually the first to do so.</p><p>As a recap, I'd had several beers over a period of 10 hours.  I sit down on the couch, the music is turned low, and I take a hit while 'G' is lighting the bowl of the bong with a torch.  He tells me to take it all in hard and hold it in.  I do just that and as I let it out, I feel nothing.  The rest of the people watching just kind of walked off because I showed no effects.  That was the end of the world for me.  </p><p>Next thing I know, I see pure bright white light composed of both nothing and everything at once.  I feel the presence of two beings.  Without them talking, or me hearing, I can SENSE that they're discussing something and it has to do with me.  I slowly realize that one is trying to show me that reality is hell, and that everything good and pure is in this 'over-verse'.  The other is saying that I won't listen and that none of us (I took that to mean humans) ever will stay there, we always choose to go back to our petty lives filled with trials and tribulations that we can never conquer.  And as they discussed this, the bright white light slowly became a fractal pattern of trillions of images: images of everything ever seen, past present and future.  I was seeing the futility of life.  And soon my 'being' was being sucked into the reality of me.  As I moved back into my body, I felt the that I had failed.  Not necessarily because I chose to go back to my life, but because I didn't choose at all.</p><p>Now that I'm back in my body, I realize what's going on around me.  'K' (one of the girls there) was kneeling in front of me with her hand on my shoulder asking me if I was okay.  I then realize that everybody is standing or sitting around me.  I panicked inside, but refused to show that on the exterior.  I had a lot of thoughts blowing through my mind and couldn't answer her.  I had to get out of being that centerpiece, so I stood up and slowly walked away.  They kept asking me how it was, so I finally said something like 'it was the chocolate factory.'  What I was trying to say was that our lives were contructs of our own minds and filled with all the knowledge we've had put into us, just like how the Everlasting Gobstopper is made in the old Willy Wonka movie.  That was the only explanation I could come up with at the time, but I couldn't say it right.</p><p>All the guys thought it was hilarious, with one of them, 'H', wanting to try it next.  One of the females, 'A', was asking me if she should try it, but I'm not sure if I answered her.  At the time though, I was thinking that there was no way I could say yes to her because I wasn't sure how I was even handling it.  'K' continued to help me to a chair, and my head was fuzzy for about another 10 minutes.  Now, because I have a strong unreturned attraction to 'K', I was really not wanting to be there, so I walked out and went home. </p><p>It was insane, and a purely philosophical thing.  It was a trip like none I've ever had.  I would not call it hallucinating at all.  I didn't know that it was all in my head at the time, because it WAS real.  I would do it again, because it was all about me exploring reality.  I was terrified, but not in a horrific fashion.  I have no idea how long I was in that vision-state, but I'd estimate it between 5 and 10 minutes.</p>"
}
