{
 "title": "4 Real!",
 "author": "Mendelt",
 "citation": "Citation:   Mendelt. \"4 Real!: experience with 4-Fluoroamphetamine (ID 66229)\". Erowid.org. Oct 8, 2007. erowid.org/exp/66229",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   "  T+ 3:00",
   "125 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   "  T+ 5:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66229",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 8, 2007",
   "Views: 39461",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThere was a techno party in a far away city, some friends invited me to come dance with them :)  I had a few experiences with pure MDMA while clubbing and I was told 4-fluoro would have similar effects. We had a crystallized/powdered form of 4-fluoro amphetamine in small 250mg bags. This would be my first time...\r\nWe took about 125mg each at the start (T=0) and went directly to the party.  The taste was terrible and very hard to wash out of your mouth. The coming up was very smooth and easy... The beat started to appeal more and more, while at the same time speaking with strangers went easier. The effects were a lot like with MDMA, except there was no 'kick' or a sudden feeling of the drug starting to work. \r\nAfter an hour (T+1) the 4-fluoro was doing its job... I was making my moves on the dancefloor and it was like the music was controlling my actions. It was easy to stand still and relax, but there was no way I wanted to do that. I had no jaw tension or chew reflexes, but I rarely have that while im on MDMA because I use my muscle power to dance and my mouth to smile :D  My pupils were dilated but not as much as while on MDMA and my mouth was constantly dry. The strangest thing about 4-fluoro was the complete control over the brain. There was no feeling of mental distortion, so it was completely a body thing.\r\nAt T+3 I decided to take the rest of my portion to party even harder, so another 125mg of 4-fluoro went down my throat. From that moment on I was dancing my legs off until the end of the party. That end was way too soon for us (T+5), we had the feeling we could dance 2-3 hours more if there was a beat. Too bad there weren't any afterparty's so we went chilling out in a home. There we smoked some joints and from that moment on I was completely disconnected to reality, I lost my will to talk and I couldnt listen to a conversation for more than 15 seconds before I lost it. For me it was not really pleasant compared to MDMA, but that's probably because I never had a comedown or serotonin shortage yet. It felt weird but not unpleasant since there were still beats going on in my head.\r\nWe skipped sleep and kept on smoking joints the whole day till we fell asleep (T+21) and slept like roses. The after effects were quite similar to a normal hangover, a kinda uneasy and lame feeling with goosebumps and waves of cold. The dry mouth was a constant factor and I had no appetite till about T+17. After all it was a very relaxing day, thanks to good friends in the same state of mind. Its hard to say which of the after effects were caused by the 4-fluo and which by sleep deprivation and cannabis. My friends told me its possible to use 4fluo days in a row without loss of effect or body functions... Its a great alternative to MDMA!\r\nCompared to MDMA:\r\nSlow coming up, no 'kick' when it starts working.\r\nCompletely sober, no loving&hugging feeling.\r\nI cant say much about the aftereffects because I haven't had a MDMA comedown or 'suicide tuesday' yet :)\r\nFrom my first experience I'd say, good MDMA alternative, I'll do this more often!\n\n\n"
}