{
 "title": "Unscheduled Opiate",
 "author": "Horse Doc",
 "citation": "   Horse Doc. \"Unscheduled Opiate: experience with Tramadol (Ultram) (ID 66338)\". Erowid.org. Apr 20, 2008. erowid.org/exp/66338",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 66338",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 20, 2008",
   "Views: 29714",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm an occasional user of various opiates: codeine, morphine, darvocet, fentanyl, buprenorphine, poppies etc.  I try my best not to take them too often, but it is difficult to do if they're available.  My prefered route of administration is oral, but I will give IM injections if the product is pharmaceutically pure.</p><p>The basic reasons I use opiates recreationally are:</p><p>1. The warm, happy feelings they produce -- like an internal hug.</p><p>2. The little problems & worries that cause anxiety tend to go  </p><p>   away (albeit for a short while).</p><p>3. The little aches & pains that remind me of my age go away and</p><p>   this makes me feel & act like a younger person.</p><p>Back when I was in medical school, circa 1995, I was doing my family practice rotation and noticed boxes of this 'new' medicine that we were told to give to patients who complained of aches & pains.  It was Ultram, and the free samples came in little blister packs of two, tiny 50mg, capsule-shaped tablets.  In the back room of the clinic there were drawers & bins filled with these free samples.  At first I assumed it was a new type of NSAID, or ibuprofen-like drug.  The first time I took some Ultram for a headache, I noticed something odd, this drug was tickling my opiate receptors.  The euphoria wasn't nearly as strong as that caused by codeine, but closer to darvocet.  </p><p>Regardless, it was a positive experience and I had access to literally thousands of the blister packets--for free!  I would never deprive a patient of pain meds, that would be horribly unethical.  But there was enough Ultram to go around.  I would stuff the 4 pockets of my short white labcoat full of these samples and hand them out like candy to my patients.  Whatever samples I did not handout, came home with me.</p><p>The nice thing about Ultram (tramadol) is that I never needed to increase the dosage, tolerance did not seem to develop.  Two, 50mg caplets in the morning carried me through (floated me through) the day, well into the evening.  It did not make me drowsy either.  I agree with others that it does lighten one's mood, and probably has value as an anti-depressant.  As I mentioned earlier, not feeling the little aches & pains of middle age helps me to feel younger and more energetic.  </p><p>I am a recreational user of opiates.  I know what an opiate feels like when its binding and activating my mu-opiate receptors.  There is NO DOUBT in my mind that Ultram (tramadol) is an opiate.  I am glad that after thirteen years on the market it still is not scheduled, BUT, by all rights, it should be CIII.</p><p>I enjoy Ultram.  I do take advantage of its availability.  Becoming addicted to it happens fairly often enough, and the withdrawals from Ultram have been reported to be worse than coming off of heroin.  I rarely take more than 150mg (3 pills) every 6-8 hours.  I tell my patients that its okay to enjoy this medication, but I do set limits that I myself follow.</p><p>Perhaps in 100 years, people will look back on the folly of the 'non-opiate' (wink-wink) Ultram, much the same as we look back on heroin's introduction & use as a 'non-addictive, morphine substitute'.</p>"
}
