{
 "title": "Understanding is Infinite",
 "author": "Alex",
 "citation": "   Alex. \"Understanding is Infinite: experience with Mushrooms (ID 66359)\". Erowid.org. Dec 4, 2011. erowid.org/exp/66359",
 "substance": "Mushrooms",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 66359",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 4, 2011",
   "Views: 1890",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I got out of school on friday, and me and my friends Joe, Cliff, and Lauren went to a headshop where I bought a nice glass bong. We hung out for a while and I was in a perfect mood. Joe and Cliff had to work, so they dropped me and Lauren at our houses. Lauren told me to call her if anything went wrong, and said just to call her for the hell of it if I wanted.</p><p>I got home around 5:30ish. I cleaned my room a bit, and took some posters down I thought might not be good for a bad trip (giant Jolly roger flag, posters of characters from warcraft, pictures of dragons, geek stuff ect.) I ate half of the eigth at exactly 5:48. They didn't taste too bad, only like slightly musty regular mushrooms. I ate them all within two minutes. I cleaned a bit more, and then sat down to play Guitar Hero 2 until they kicked in.</p><p>At around 6:15 they started to kick in. I felt almost weightless and like I was trancending into a higher dimension. I felt extremely relaxed, slightly nauseous, and somewhat anxious and nervous as this unique, but interesting feeling took over me. I decided to stop playing because I couldn't concentrate, and turned on the Tv, laid back on my bed and just relaxed. After about 5 minutes, the feelings became more intense. I started seeing patterns in my wall, and I kept seeing Ronald Raegan in my pants out of the corner of my eye. At this point I was very nervous, but not in a bad way, just excited.</p><p>About 10-15 minutes later I really felt like I was in another dimension. The walls started breathing, and the floor was kind of moving. My hands felt like they were stretching. I was not afraid, but very interested, and surprised that they kicked in so quickly. I decided now was a good time to call Lauren. I called her up and I think her aunt or a friend picked up. 'Lauren?' I said. 'Uhh no, hold on.' I heard her say that the phone was for Lauren, and it was someone who sounded very stoned. I found this very humorous.</p><p>We talked for about 45 minutes, just about random things, and what I was feeling. I paced back and forth in my room about 200 times. As the walls breathed, and the floor kept moving. Walking was tricky, but the floor wasn't trying to hurt me, it was only playful. She said her mom was calling her, and she had to go. I was a bit disappointed, but very excited to see what I could experience. I kept feeling like I could walk through walls, and I did try, though not running at it, just putting my hand up to it. Although I obviously could not. I decided I was hungry and went downstairs into the kitchen. Surprisingly the stairs were not at all hard to climb down, although I expected them to be. I made some oatmeal with a little sugar in it, and brought it upstairs and watched TV as I ate it.</p><p>After eating the oatmeal, I decided I was ready to eat the other half of the eighth. I have been reading many experience reports on mushrooms, and almost every one I read there has been some sort of 'spiritual awakening'. I was very excited for this, as this was the main reason I decided to do them (although tripping was very fun).</p><p>I ate the other half of the bag in about one minute, and decided to take a shower. The hot water felt ecstatic. It felt like when I was in the water, I was really in clothing that was as warm as they are when they just came out of the dryer. The shower curtain was breathing, and slightly wavy. I felt the other shrooms coming on, and I decided that the shower might not be the best place to be when they fully hit me. So I got out, put on a nice warm hoody, and laid on my bed. At this time my friend, Josh called me. He knew I was going to do them, and called me to see how I was doing. I told him of my experience, but after a couple minutes he said he had to go and he'd call back later.</p><p>I felt like talking to someone. So I went down to my aunt's room. Her room has a door leading outside, and one to the house, but the one to the house is blocked off because her cat learned to open it, and she doesn't want her to get pregnant by my cat. So I walked around my house, which was definatly the most trippy experience of my life. I have these giant bush-like trees, that looked like giant sculpted spiders. The leaves on my bushes looked like they were rippling. And the house across from me had a giant orange glowing tree in their front yard, that had never been there before. It was about 8-8:30ish. So it was quite dark, but I wasn't afraid, only curious.</p><p>I went to my aunt's room, and talked to her for a bit. She asked me how it was and everything. She has never done shrooms. She grew up in the 70's, so she has done just about every other drug ever, but she's not a druggie blowout. She would tell me stories about how she would take mescaline before going to school. Which turned out to be very funny stories. We talked for about 45 minutes. With her cat climbing on top of my shoulders and laying down. She does this quite often though.</p><p>I talked to her for a bit longer, said my goodbyes, and she wished me luck, and went back to my room. I had bought some incense at the same place I bought my bong, and decided now would be a good time to light them, as I was tripping quite hard. Everything had the three base colors surronding them. Like the kind you can see if you look really really close into the tv. Everything reminded me of a mushroom, and I could see a mushroom in almost anything. It seriously felt like I was in some kind of alternate demension, and that the shrooms had brought me there. The walls had stopped breathing, but they were just sleeping. Don't ask me how I know that, I just knew.</p><p>So I sat on my bed and lit the insence, and turned the Tv off. The scent was immaculate. And the smoke kept turning into mushrooms. I stuck the end of the incense stick (not the end that was burning, duh) in my mouth and started waving it around with my jaw. It was as if I was conducting some kind of shroom-smoke symphany. After a bit, I started to think about things. I started to get very sad. But I knew I was not going to have a bad trip. Which I didn't.</p><p>I only started to think about everything, about everyone I knew, and who I have been sort of an asshole to. I started regretting some actions I did, that I never thought of as a wrongdoing. I started getting very depressed as I realized all of this. And in one instant, I understood everything. Litteraly, EVERYTHING. I saw everyone whom I know's life. Not litteraly viewed, but I felt it, connected with it, and completely understood everything. I understood the actions of people, that I could not before contemplate. I understood everything about me, things I did not understand, and never knew why. As this continued, I got more and more depressed. But I knew this had to happen. It was a right of passage so to speak. That the mushrooms were showing me understanding.</p><p>I knew this would end eventually, and that everything would be fine, because i Understood everything. I knew that the universe would forgive me, and everything kept telling me it was ok, and that it all forgave me. I was still sad, but starting to get better, as I realized it really was ok, now that I had realized it, and found redemption. It was absolutely life changing.</p><p>After that I understood everything, I cannot explain how, or why. I just understood, and I knew that every single thing understands, even this computer that I am typing on. But in it's own existance, it just Understands. Everything understands, and forgives, and accepts, for they understand us. Understanding became everything to me. As if it were the key to life, to nirvana. As I started feeling better. I felt extremely, extremely wise. I felt I could connect with everything, because I understood everything. I went outside to see what was going on there. Not much had changed, still the same spider trees, and wavy bushes, and now the dumpster was smiling at me, because it understood.</p><p>I saw my cat, Binx, who is thee chillest cat ever, he reminds me of me, if I were a cat. I reached out to him spiritually, told him with my spirit to come over to me so I could pet him. And he came. This didn't surprise me at the time, because I Understood. I pet him for a bit, and then decided to come on the computer. I talked to my friend, Zack on AIM for a bit, and told him what it was like, because he has never done them before, but really wants to. I told him of my experiences, of my epiphany, of my Understanding. And he found it all immaculatly wise. He said my words were like poetry.</p><p>I started feeling the shrooms coming down, As it was around 11pm at this time, and decided to head off to bed. I called to my cat spiritually again when I saw him, and told him if he would like, he could follow me in my room, lay down with me and watch some tv. He followed me into my room. I laid on my bed, and he immediatly curled up between my arm, and torso. I pet him for a while until he fell asleep. He has done this on occasion, but never so affectionate. He understood, and I understood. We were one. I felt one with the entire universe. I realized that everything is One. It was a very odd feeling.</p><p>I brought up the blanket, turned off the light, and waited for sleep to overtake me. It took a bit, but it came gently. This experience has changed me for the better, and will stay with me for the rest of my life.</p>"
}
