{
 "title": "Testing the Waters",
 "author": "Ichiro",
 "citation": "   Ichiro. \"Testing the Waters: experience with GBL & Cannabis (Hash) (ID 66412)\". Erowid.org. Oct 11, 2009. erowid.org/exp/66412",
 "substance": "GBL & Cannabis (Hash)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 0:30",
   "1.5 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 1:00",
   "1 bowl",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 66412",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 11, 2009",
   "Views: 5213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Being continually interested in altered states, I came across some GBL and decided that I should test the waters. This particular evening was well suited for experimentation, seeing as I had just finished a midterm and had nothing to do. There was the possibility of a few friends taking a train from New York to see me in Montreal, but it was well past their time of arrival and I figured that they must be coming up another day.</p><p>I had a 5mL vial at my disposal, and decided to begin with 2 mL. I checked the time to take note of the effects, 8 PM. After dosing, I sat back and waited for the effects. After about 15 minutes, I got up to walk around. I found my legs wobbly and my vision somewhat choppy. I found the music enjoyable, but it was one of my favorite bands so Im sure a sober appreciation would have been just as good.</p><p>After about another 15 minutes of this (it is now 8:30 PM), I found the effects quite underwhelming, and decided that perhaps an extra 1.5 mL would give me a better idea of the effects for the substance. I put another 1.5 mL into a shot glass, and downed the toxic tasting liquid.</p><p>Over the next 30 minutes, I felt all of the afore mentioned effects escalating. I had very little coordination and found myself running into furniture and the sides of walls as I walked through the house. It was very easy to close my eyes, and Im sure I couldve fallen asleep if I had tried. When I would shut my eyes, there would be a tunneling effect, where the images I had just seen would disappear from my vision over the course of about 1 or 2 seconds, by the black outer edges of the image pushing inwards till the last thing I saw was whatever it was I was focusing on. My whole head felt very loose and rubbery, and I enjoyed rocking m head from side to side. My stomach felt upset, and there was a kind of chemical toxicity feel to my whole body. I decided that some hashish might help the nausea, so I broke off a chunk and smoked a bowl. Unfortunately, the nausea persisted.</p><p>An hour and a half had passed from initial dosing when I heard a few knocks on the door. I got up, excited, nervous, regretful of my inebriation, knowing that my friends from New York had arrived. I stumbled to the door and we exchanged hugs and words and I invited them in. I informed them that I had taken GHB, not wanting to explain to them that GBL is broken down into GHB in the body. </p><p>I was looking forward to engaging in the social aspect of the drug but found that my speech and thoughts were incredibly slow and drawn out. I felt good, but there was no distinct sense of euphoria, and I think my elevated mood was largely due to my friends presence, especially because they are, under sober circumstances, incredibly funny. I did notice, however, a type of slowness to my feelings of touch. If I were to touch my face, I could still feel the pressure of my hand once I had taken my hand away, similar to, but in no way as immensely pleasurable, the body high of MDMA.</p><p>We went walking down St. Laurent to go to a small sleazy bar where they could get a few drinks after such a long trip. I would refrain from drinking, knowing that GBL and alcohol shouldnt be mixed. The whole walk there, I kept wobbling, running into both my friends, nearly running into people on the street. My body felt much drunker than my mind. I knew how ridiculous I looked, but could not help stumbling along. I desperately needed some water, and felt that that might help alleviate some of my intense nausea.</p><p>We got to the bar. It was probably 10:15 or 10:30, around 2  2.5 hours after my first dose. I felt very sick by this point. My friends said theyd get me some water, and that I should just take a seat. I found a booth and lied down. I immediately began to fall asleep. I woke up a bit later with my friends by me and some water near me. One of my friends had been trying to wake me, shaking me, and I hadnt noticed. We left the bar, seeing how I was clearly too exhausted to stay much longer. I kept drinking water the whole way back, and felt a great deal of my nausea recede.</p><p>Back home, we ate some naan and hummus and watched Seinfeld. I immediately passed out.  And awoke at 1 AM by my friends, trying to get me off the couch, since it was where  they were going to sleep that night. I stumbled to bed and fell asleep.</p><p>I would not take this chemical again. There was a very clear toxicity to the whole experience. The effects seemed comparable to alcohol, but not as good. While alcohol seems to facilitate conversation, GBL left me struggling to piece sentences together. The sleepiness, nausea and lack of motor skills induced by GBL were all unpleasant. Two thumbs down.</p>"
}
