{
 "title": "Nearly 100 Percent Comparable",
 "author": "coffeeman64",
 "citation": "   coffeeman64. \"Nearly 100 Percent Comparable: experience with Spice Product (ID 66428)\". Erowid.org. Dec 15, 2008. erowid.org/exp/66428",
 "substance": "Spice Product",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2007",
   "66428",
   "Male",
   " ",
   "Not Given",
   "Dec 15, 2008",
   "Views: 49504",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Spice and Spice Gold are relatively new herbal blends that have recently become available in the United States.  The ingredients are: Baybean, Blue Lotus, Lion's Tail, Lousewort, Indian Warrior, Dwarf Scullcap, Maconha Brava, Pink Lotus, Marshmallow, Red Clover, Rose, Siberian Motherwort, Vanilla and Honey. As far as I know, dwarf skullcap (a rare desert species of skullcap), Lion's Tail, Blue Lotus, and Indian Warrior are the strongest substances present in the blend. That said, let me tell you about my experience with Spice!</p><p>00min: smoked a bowl with my brother (a total of about 200mg each), took about eight big hits total.</p><p>5min: we were still smoking at this point, starting to feel a pleasant relaxation, also felt as if the room was developing a sort of rhythm or pulse.</p><p>10min: the effects or Spice are reported to come on about 10 minutes after smoking, so we were both super excited.  I was sitting back on my couch when it hit me all of a sudden.</p><p>Effects ::</p><p>EVERYTHING in my body was vibrating, particularly my head.  Felt a pressure from above bearing down on me, but not unpleasantly so.  I felt a sense of utter amazement and euphoria throughout my body, making me want to laugh.  I could feel lines of energy running from my feet, up my legs and sides, and through my arms (it's a FANTASTIC feeling, I've also experienced this with marijuana).  I kept asking my brother if he was feeling what I was feeling, wanting him to understand it too.  After about five minutes of sitting on the couch, we decided to walk around.  Felt like everything was in slow-motion or stop-motion.  Almost like the air was thicker, best way to describe it is that everything had a groove and a rhythm and you can move right along with it!  Great feeling.  Definitely could not drive at this point, very very intense, pretty heavy high. We turned the lights off and listened to a very calming techno song.  </p><p>Closing my eyes and laying down, I felt like I was falling backwards off of a building, but never hitting the ground.  I could feel the vibrations and waves with the music, so breathtaking.  Overall, I stayed high for a couple of hours before going to bed.  Smoked more in the morning and stayed high all day (actually can't remember a whole lot from that day!). My experience with spice was nearly 100 percent comparable to my only experience with marijuana.</p><p>Side Effects ::</p><p>Like MJ, cottonmouth, dry eyes, munchies.  Up side is, no paranoia!</p><p>Spice Gold is just like Spice except in a higher extract.</p><p>It's 100% effective!</p>"
}
