{
 "title": "Mind Destroying Terror",
 "author": "Talniir",
 "citation": "   Talniir. \"Mind Destroying Terror: experience with Salvia divinorum (40x extract) (ID 66431)\". Erowid.org. May 23, 2008. erowid.org/exp/66431",
 "substance": "Salvia divinorum (40x extract)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 66431",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 23, 2008",
   "Views: 12057",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One of my good friends, I'll call her T, was moving to Colorado to a Buddhist colony and wanted to have one last night of drug usage with her good friends. We tried to get shrooms and lsd but were unsuccessful. 'Luckily' she was friends with someone who worked at a head shop and he had 40x extract salvia that he gave her as a departing gift. I heard this was the most pure form of it that could be rendered and until that point I had just done 10x. I was never impressed with it since I never had a real trip from it.</p><p>I get to the house we were going to party at and they were all already there. I knew 4 out of the 7 people there and we were packed into a pretty chill basement. One of the guys had already done a hit and they were all laughing and telling me about how he completely tripped out and jumped onto the couch, at which point he clung to the back of it like some sort of lizard for about 10 minutes. I was getting more enthusiastic at this point and she loaded a bong for me.</p><p>I then hit the completely full bowl and the chamber became opaque with smoke. I inhale the giant hit and feel as though my lungs are going to burst, but since I really wanted to trip I held it for about 30 seconds. As soon as I exhaled I got a feeling of uncomfortable and intense tingling all over my body. My vision tunnels and terror instantly takes over. I try to scream but don't even know how to anymore. I only have one thought left, to get the fuck out of there. As soon as I start trying to get up I feel something pushing against me and I fall back into the wall.</p><p>I start getting pulled into the wall and all my limbs are stretching, both in length and in width, until I completely become the wall. I see all the people around me become part of the floor and walls as well and their faces no longer bring recognition. The room becomes some sort of metaphysical wheel at this point. This is the part that becomes hard to explain because it was far too strange for me to put into words. The wheel begins to revolve and split off into millions upon millions of identical wheels made of myself and my friends. Instantly I was struck with a realization that life and reality is false and is just some sort of sick game. I never felt such complete and utter terror in my life.</p><p>After what seems like a lifetime of the wheels turning I begin to come down and the dimensions slowly regain their form, but my friends seem evil and mocking to me and I wanted nothing more than to flee from them. I stumble over the words, 'I.. go.. leave.. outside.' and then stand. Upon standing I feel like I'm a mouse in a giant's house and with much difficulty I walk outside. Once out there (it had rained a few hours before) my feet become wet and cold and the dark is unbearable. I stumble back inside and lay down in a fetal position, closing my eyes and trying not to sob like a little girl. The trip finally ended but I still had the feeling that life was a joke and was filled with a depression for most of the rest of the night. I also was drenched in sweat, it was as though I had just jumped into a pool.</p><p>T tells me that after taking the hit my eyes bulged out and I had a look on my face like I just watched a baby get beaten to death with a big stick. I didn't move for a minute and she didn't even think I was breathing and all of a sudden I started trying to get up. She said she was telling me, 'It's ok! It's just the trip.' and was restraining me against the wall (which was when I got pulled into it), and then said I started grabbing at my face and moaning for about 10 to 15 minutes. They didn't know how to calm me down. I was completely gone.</p><p>I with all my heart NEVER want to try salvia EVER again and I still feel changed for the worse since that trip. I have done most of the hallucinogens out there and nothing has scared the living shit out of me like this has.</p>"
}
