{
 "title": "Bulldozer Amoeba",
 "author": "Heroic Dose",
 "citation": "   Heroic Dose. \"Bulldozer Amoeba: experience with Salvia Divinorum (10x extract)   (ID 66462)\". Erowid.org. Apr 28, 2012. erowid.org/exp/66462",
 "substance": "Salvia Divinorum (10x extract)  ",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 66462",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Apr 28, 2012",
   "Views: 1422",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm not terribly experienced with hallucinogens, but I have done mushrooms three times.  The first trip was the best day of my life, perhaps I'll write about that soon, it's a wonderful story.  The second trip started off good and ended bad, and the third trip was the reverse.  I've been smoking cannabis since I was 14-15, and I'm almost 21 now.  I knew that after a few years of experience and research, I was a relative welter-weight with different substances.  I had been wanting to do salvia since sophomore year in high school.</p><p>Now, with that heavy stuff out of the way, I can get to my time with this wonderful plant.  To start off, I had smoked a tiny amount earlier in the day just to see what low dose effects would do.  I packed a bowl that was mostly marijuana with a sprinkle of salvia on top.  I got a severe body high with very mild visuals.  I remained aware of myself the entire time.</p><p>After going to see my housemates play, we all decided we wanted to do more.  One housemate took a decent size hit off of my bong and immediately lost himself in giggles.  He lay on his bed for about three minutes, staring around.  He 'woke up' soon after, having no recollection of what had happened.  We were all already stoned at that point, so I packed a bowl for myself, hit it successfully, then packed another one.  I lit the Salvia, taking in as much as possible and holding it for a little bit.  My lungs aren't in very good shape, as I am a heavy smoker.  I exhaled, coughing.  I tasted the salvia on my throat.  I tasted what was yet to come.</p><p>Then everything went black.</p><p>A million years later, I awoke on a new plane of reality.  In fact, I would say that I was above reality...the reality that I had created and was creating for myself.  From where I was, pushed against this corner, I saw everything that made up my life: memories, family members, emotions, etc.  I was aware of everything!  My whole existence, nay, the whole world's existence had been opened up in front of me.</p><p>Now, from reading the other reports on here, I couldn't understand why some of them had such a hard time reporting what they saw, but now I completely get it.  The best way to describe what I saw/what I was a part of would be to compare it to a bulldozer tread.  Everything was this constantly rotating, endlessly undulating mass of everything.  I was both spectator and showman in this blob.  The whole time I was in this place, I knew that this was the true way of everything.  I felt like I had been born into infinity.  I was still a small part of this machine-like whole, but I also existed outside of it.</p><p>Things started getting really intense, and I remember telling my three friends that if I stopped rotating, I would go crazy.  At this point, it physically hurt me to stay still.  I was rolling around my room, going from bed to floor, while my friends watched on in amusement.</p><p>Soon, this reality started to come back, and everything became one half of my room, and one half Bulldozer tread amoeba territory.  My body was broken fractals, and I could feel myself being put back together like a puzzle.  After 5 minutes of wobbling around, I gained enough of a foothold to lay down and go to sleep.</p><p>I didn't remember what had happened after I had put the bong down for the last time.  I asked my friends what had taken place.  Apparently I collapsed to the bean bag chair on my left, then I wound up on the floor laying on my side, shaking.  I was counting aloud, 'One-wich, two-wich, twelve-wich, thirteen-wich, etc'.  I do remember the counting vaguely, but I have no idea what it was supposed to mean.</p><p>The trip ran the gamut, it was intensely joyful, scary, and completely unlike anything I had done before.  At this point I don't know If I'll do it again, but I recommend to anyone that will listen that they try it.  As I've stated before, however, do not underestimate the power of Salvia.  There is no way to respect this plant unless you do it.</p><p>Happy tripping everyone, this site has really helped me out for a long time so I wanted to give something back.</p>"
}
