{
 "title": "Testing Positive for Amphetamines",
 "author": "BOOMERHIPPY",
 "citation": "   BOOMERHIPPY. \"Testing Positive for Amphetamines: experience with Cacti - T. pachanoi (ID 66463)\". Erowid.org. Feb 14, 2008. erowid.org/exp/66463",
 "substance": "Cacti - T. pachanoi",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cacti - T. pachanoi",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66463",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 14, 2008",
   "Views: 14819",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nShort Story:\r\nWhen I went to the doctor several months ago (an addiction specialist who is helping me overcome an opiate addiction) I was asked to submit a urine specimen for testing. \r\nI had recently been to a Roger Waters: Dark Side of the Moon concert where I had indulged in smoking marijuana as well as ingesting dried San Pedro (Trichocereus Pachanoi) cactus which is 1%-2% mescaline by volume.\r\nThe testing was done right there in the doctors office using what looked like several different over-the-counter testing kits that use multiple 'indicator strips' that change color and appearance when put in contact with the urine. \r\nI tested positive for most everything, which I expected, but I also tested positive for Amphetamines which surprised me.\r\nA month went by and steadily that positive indication on each new Amphetamine indicator strip test was slowly fading until I was finally negative for Amphetamines.\r\nThat same week the doctor confronted me with the results of my first urine which he had sent to a Lab for further analysis by GC/MS methods. By this time I had my own working theory that it was the Mescaline that 'flagged' my earlier positive amphetamine test. \r\nHowever, the lab results of the GC/MS testing showed no amphetamines were present in any detectable levels. The reason is because although the lab tested for 20+ drugs, 3,4,5-trimethoxy-ß-phenethylamine was not one of the the drugs on the list.. and they look for specifics.\r\nThe next weekend I coincidentally decided to have another mescaline experience. And on my very next doctor visit I tested positive again for amphetamines, surprise.\r\nThe moral of the story is, in my humble opinion, ironically it likely that mescaline will be detected as an amphetamine using low tech Over-The-Counter test kits and the NIDA-5 govt. standard test but the more high tech GC/MS testing methods often do not SPECIFICALLY check for the presence of mescaline unless requested/suspected by whomever is requesting the testing. \r\n[Reported Dose: 'threshold 200mg']\n\n\n"
}
