{
 "title": "Roller Coasters in the Sky with Diamonds",
 "author": "Blair Witch",
 "citation": " Blair Witch. \"Roller Coasters in the Sky with Diamonds: experience with LSD (ID 66475)\". Erowid.org. Jun 6, 2009. erowid.org/exp/66475",
 "substance": "LSD",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 1:20",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   " T+ 0:00",
   " repeated",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2007",
   "66475",
   "Male",
   "",
   "Not Given",
   "Jun 6, 2009",
   "3461",
   " "
  ]
 ],
 "report": "<p>The following is a recall of last Saturday.  Me and a friend did an experiment involving marijuana, LSD(acid), at Cedar Point.</p><p>7:30 a.m.</p><p>A vibration pounds on the side of my mattress, ripping me from my peaceful sleep. C calls and wakes me up.  Today is the day we do the adventure to Cedar Point on acid.</p><p>8:15-8:55</p><p>I get to D's house to pick up C and S.  S hands me a large bag of marijuana and gives me the box of blunts I forgot to take home the last night.  I understand without being told and split a blunt, empty the tobacco and refill it with marijuana. We then stop at the gas station to stock up on food (Doritos) and Drink (Dr. Pepper).  C steals S's spot in the front seat.</p><p>9:10-9:30</p><p>I have now been driving on the highway for about fifteen minutes.  Spencer pulls out the blunt I rolled earlier and we smoke it.  The blunt hits very harsh, there is more paper than marijuana and I'm slightly disappointed.  The blunt gets me pretty high nevertheless and the drive becomes much more enjoyable.  I even turn up the music and giggle a little bit.  I feel very excited and hopeful about the day that's about to happen.</p><p>10:00 - 10:50</p><p>In the past half hour we have gotten on a toll road and started to roll more blunts.  I decide that since I am driving I should let C roll the blunt because it's his weed and even though I've never really seen him roll a blunt, I figure he can do it because he rolls good joints.  The blunt he rolls is very odd looking and not very pleasant but it's definitely smokeable.  </p><p>I have my own weed and a very strong desire to have a good blunt available while at cedar point so I tell C to take the wheel and roll a very decent blunt that will hit good, stay tight, and even a nice little mouthpiece.  After we finish rolling the blunts we have a large open space to finish driving to ohio, about 40 minutes if I had to guess.  We have a bowl and marijuana but me and C agree that bowls will ruin the very nice blunt high we have going right now and decide not to smoke bowls until after the day is over.</p><p>11:00</p><p>We are about 15 miles away from our exit and the end of this terrible toll road.  This road makes you stop and get tickets then stop and pay money.  It confuses me and angers me as I've never been on a toll road before.  Since the driving portion is almost over me and C drop our acid.  He takes 2 and I take one because I'm driving.  S has no acid to take because he thought it would be a bad idea and took his the night before.</p><p>11:20  </p><p>T+00:20</p><p>We come to the toll road and the woman asks for $4.75.  I check to make sure she meant four dollars, then continue on towards cedar point, pissed off that I had to pay to drive.  Why do I have to pay money to pay attention, keep my car from going off the road, and not hit anything?  I think that I should be getting paid for doing it successfully.  The world doesn't make sense I decide.</p><p>11:45 </p><p>T+00:45</p><p>We have finally made it to cedar point and we are now waiting in line.  I can feel the beginning effects of the acid kick in.  S tells me that it took a long time for it to fully kick in for him, 90 minutes as he described it.  I don't believe him at the time, but I would soon find out he was right.\tI see a man walking around and talking to random people and wanting to know whats going on I ask him what he's doing.  He tells me this crazy story which I couldn't follow and then offers me 2 tickets for 25 dollars each.  I think wow that sounds good, they are 42 at the gate.  \t'Do they work' I ask him.</p><p>'Yea they should work' he states</p><p>Needing no further explanation Me and S buy the tickets.  I could tell that C was hoping he would get them and realizes he still has to pay 42 dollars.  His acid must be affecting him because he didn't give the man any money and he still tried to grab at the tickets. After walking in the gates C chews up the map and we are lost for the rest of the day.</p><p>12:20 p.m. </p><p>T+01:20</p><p>We have now journeyed to the first ride of the day, the power tower, because of the small wait.  While standing in line I break two more hits of acid off the strip, giving one to C and taking one myself bringing my dose to 2 and his to 3.  I knew that it hadn't been an hour and a half and my acid hasn't even started really kicking in yet but I figure if it's taking this long it must not be very strong acid.</p><p>Standing in line is fine right now, killing time is easy by just talking to C and S and taking in the scenery.  I feel very happy and still excited about the day.  I remember saying\t'I knew this was a good idea'.</p><p>12:30</p><p>(first hit)T+01:30</p><p>(second hit)T+T+00:10</p><p>Finally we are loading onto the ride.  The first hit of acid has gotten much stronger in the last ten minutes and as C begins to sit where I can't see him I protest and make him switch seats so that I'm sitting next to people I know.  We all take our shoes off and wait to be shot upward hundreds of feet.  It happens.  Going straight up that fast really confused me and I felt a huge adrenaline rush go through my body.  This felt different than anything I've ever done, but it filled me with happiness and energy and I ran from the ride sliding down the railing wanting to go ride more rides.  S was not tripping acid though and wanted to go to the beach to smoke one of the blunts that we rolled.  I couldn't argue that.</p><p>12:50</p><p>T+01:50</p><p>T+00:30</p><p>It has been a long walk ever since the power tower and we are just now passing the Corkscrew.  Exhausted and confused I tell S and C that we have to ride the corkscrew right now while the line is short.  The wait is perfectly fine with me still, just me hanging out with my friends, talking about stuff.  The ride is pretty fun, but nothing mind blowing.  The acid still isn't causing any obvious visuals, or audio distortions.  The acid is making me think different and enhancing my mood, but anything else was still very subtle.</p><p>1:00</p><p>T+02:00</p><p>T+00:40</p><p>The acid is getting stronger by the minute and I warmly accept it.  I am really completely fearless right now and willing to do anything.  We stamp our hands at the cedar point gate and walk along the sidewalk near the beach.  Suddenly I decide I want to be different from everyone else and jump the fence separating us from the sand.  I step back and with little warning run, jump, climb the fence, jump, and fall.  And fall.  Turns out there was a very big drop off from the sidewalk to the sand.  I collapse as soon as I hit the ground and roll onto my stomach. Luckily the sand doesn't hurt me and my friends follow.</p><p>After walking through the sand as far away from the park as we could get without getting wet, we light up the blunt and hope that a cop doesn't walk by.  People are everywhere and I kind of worry but I go for it anyways.  Maybe we can burry the blunt before anyone gets here and run for it.  Hitting the blunt makes me feel very different after the very first hit.  Everything seems so crazy all of the sudden.  I start telling my two friends how marijuana is such a big part of my life, even though they know that more than almost anyone.  I start to realize that ever since I took the acid I haven't felt the marijuana high very much at all, the acid was completely taking over the feelings of dumb happiness and making me think very rapidly.</p><p>Before taking my second hit I look over to the Lake.  (Or ocean I'm not really sure what it was, it was a large body of water).  The water goes all the way out to the horizon and merges with the blue sky, and I notice how incredible the clouds are.  I inform my friends that the clouds are moving, and I am just astounded.  I start walking towards the horizon, not knowing what it is I want to accomplish, only knowing that I want to be as close to this amazing spectacle as I can.  Before I step into the lake completely clothed my friends drag me back.  I turn to C and say guess what.  I hit the blunt and suddenly he remembers that were smoking a blunt in public and his eyes get very wide and he holds out his hand to take his turn.</p><p>1:30</p><p>T+02:30</p><p>T+01:10</p><p>After a while C becomes exhausted from walking through sand and sits down with the blunt.  S tells us that we are sitting right next to a path and we are only separated by the hill we are sitting behind.  The blunt is getting very small and I don't think it would be worth it to try to get C to stand up in his state of mind.  S walks off with the blunt and I chase him down and get it back.  I convince him to wait until we can get C up and we finish the blunt as C gathers his items and works his way to his feet.</p><p>1:40</p><p>T+02:40</p><p>T+01:20</p><p>I sit and gaze at my surroundings.  The acid has completely kicked in and I am tripping out of my mind.  I love the beach and want to continue sitting here for the rest of my life.  I stare at the seagulls and I see a small patch of land a little past the tide.  I run towards the water and jump landing right on the patch of land and scaring hundreds of seagulls away.  I'm sad that I scared so many lives away and negatively impacted them, but happy that I am completely surrounded by water.  It's a very peaceful feeling.  Suddenly S informs us that we have been at the beach too long and I begin to panic.  Do people know we're on drugs?  Is anyone going to tell on us?  Am I going to go to prison and be stuck in Ohio?  Terrible things start affecting my brain and the only thing I can do is ask S what we can do to fix everything.  He says we have to go back to the part and starts walking away from the beach.</p><p>'Wait!' I tell him 'I'm not ready to leave.'  S and C both leave and I am stuck either chasing them down or staying at the beach alone.  I chase down C and ask him why we have to leave.  S continues walking.  C gets confused and suddenly tells me that the sand shatters when you walk on it.  I look down and he was correct.  Every step we took caused the sand to create strange patterns all around us.  Seeing me have such a big impact just by walking was an incredible feeling and we started walking around very slowly watching the sand make patterns.</p><p>I realized that S was no longer with us and looked up to see if I saw him.  As soon as I looked up I saw the clouds and there were rainbows everywhere in the sky.  My vision was made up of a bunch of colored diamonds that were shrinking and enlarging rapidly.  I started to hear noises from people in the park.  I could hear everyone who was in about a quarter mile range and all the voices were echoed and distorted so I couldn't make out what they were saying but it started to scare me.  I begin to worry that this could be a bad trip.  I ask C if he wants to stay at the beach with me and he's confused and says we can't waste this trip by staying at the beach.  I agree for some reason and we make our way to the sidewalk.</p><p>Walking through the sand is now a very unpleasant feeling and suddenly I am seeing everything repeat itself in time.  I am watching myself do things that I have already done yet everything else continues on.  This worries me because I can't change my actions and everyone else can.  As suddenly as this wild feeling of deja vu kicked it, it suddenly left me as though it never happened.</p><p>Note:  I will do the best I can to remember the times of the following events, but at this point I was afraid to hold my phone because I thought I would break it so I stopped checking the time for about an hour.</p><p>1:55</p><p>T+02:55</p><p>T+01:35</p><p>Me and C have now made it back to the sidewalk and we sit down at a bench.  I am way messed up now and the acid is still getting more and more intense.  I wonder how C is doing because he took a hit more than me.  We decide that I should lead until we find S.  I try to call S and when I talk to him he sounds very confused and can't tell me where he is.  I hang up because I'm frustrated.  We try to call back and he doesn't pick up so we walk back into the park.</p><p>2:00</p><p>T+03:00</p><p>T+01:40</p><p>We are now wandering around completely helpless around Cedar Point hallucinating, disoriented, lost, and un-functional.  C suggests we ride a ride and I tell him we need to find S.  I try to explain that we just took someone from a different state and dropped him off at an amusement park.  C doesn't seem to grasp the idea and continues suggesting we just ride rides and don't worry about it.</p><p>2:30</p><p>T+03:30</p><p>T+02:10</p><p>I give up looking for S.  We walk into the entrance closest to us and get ready to ride a ride.  I walk through the metal thing that turns and get in line.  Suddenly I realize how long this line is and how long we have to wait.  I feel like everyone in line is staring at me.  I freak out and without saying a word to C I push about 6 people out of my way and squeeze through the metal thing and continue walking.  I realize a few people had shouted at me and suddenly consider the thought that other people have feelings too.  Up until this point I had completely forgotten the concept of the human being except for C and S.</p><p>2:40</p><p>T+03:40</p><p>T+02:20</p><p>I apologize to C for causing such an embarrassing scene.  It wasn't that I was afraid or anything, I just never considered the fact that other people wouldn't want to be pushed.  I could easily have stayed in line, I just didn't want to stay there that long with everyone staying with me, and it seemed perfectly logical to do what I wanted.  C asks where we are going and I say I don't know, maybe we should look for S.  He tells me that it's S's fault for getting lost and we should ride rides.  We see the corkscrew for the second time and I decide that this is the perfect opportunity to gauge how the acid effects the ride.</p><p>3:00</p><p>T+04:00</p><p>T+02:40</p><p>In what felt like hours of waiting (actually 20 minutes), Me and C finally made it to the front of the line.  A woman turned to me and asked if I wanted to go before her daughters so she could go at the same time as them.  This made me extremely happy and very thankful for the woman's kindness.  Minutes were taking eternities to pass and even knowing that we will get to ride a minute or two sooner than we would have originally was plenty to make me overwhelmingly happy.  After thanking the woman me and C stepped up to the gate where we waiting to be seated.  I noticed how the 3 men running the ride all had microphones and were talking to each other trying to crack jokes.  I noted how bizzare the human race is that we actually need to hire people to keep patrons entertained because the park is too boring otherwise.  This was a turning point in the trip and I started thinking about the people that own Cedar Point and how they are treating human beings like they don't have emotions or thoughts.</p><p>The man begins giving instructions after we are seated in the large metal contraption.  He says we have to fasten our seat belts and after fumbling around for a minute or two I finally figured it out.  C remained completely oblivious to all instructions.  A man came up to C and said please fasten your seat belt and pull on it.  C said nothing and continued staring forward in a stupor.  Confused the man just ignored C and cleared us to go.  C looks over me and says 'Oh, were we supposed to do something?'  </p><p>'Dude, think of how smart the guy who owns this place must be' I reply 'He convinces people from all over the world to pay money just to enter this giant park, then makes you wait in lines to be put into a quick ride.  People from all over the world.  Wow I just realized how insignificant we are compared to all of this.  Even if people do know we're on acid it's not going to matter because they all have better stuff to do than tell on us.'  I began seeing the world through other people's eyes and realize that in their eyes I am a nobody.  Suddenly my body is hurled up then I'm thrown into a loop.  The roller coaster seems to be moving extremely slow and all the sudden I just got really happy.  I start laughing uncontrollably.  The roller coaster does a corkscrew and while we are upside down I feel like I could just fly away.  The ride stops suddenly and I am very disappointed, wanting the ride to keep going.</p><p>We exit the ride and begin wandering around the park again.  At this point Spencer has called me multiple times but I stopped using my phone because I thought I would break it so it stays in my pocket.  The first thing I remember coming to as we left the corkscrew was a railroad with the gates down.  On both sides of the railroad tracks are huge packs of people, each wanting to go in the other direction.  As soon as the gates go up everyone pushes forward, me and C follow not wanting to stand out.  Everyone looks very sorry and hurried as we push through the bodies.  I see a woman pushing a stroller through the massive pack of people who looks very scared.  I feel sorry for her and want to stop pushing and just let everyone pass through me, but I know I will cause a scene if I do anything and just continue shoving.  This also pushed my trip in the wrong direction, making me feel like a terrible person, and making me hate Cedar Point even more.</p><p>3:30</p><p>T+4:30</p><p>T+3:10</p><p>At this point we are near familiar features such as the fountain and the arcade room.  C suggests we go play video games to try to calm our minds down.  Willing to believe anything to gain a bit of sanity I follow him in.  The instant I set foot in the arcade I knew it was a terrible idea.  Flashing colors were everywhere, and millions and millions of computerized sounds echoing off the walls, all merging together and creating one very strange and unpleasant hum.  I knew there were people in the arcade but I couldn't distinguish any bodies, I could just hear the voices echoing in my mind.  The first game that has a seat I plop down and stare at the screen in front of me.  I feel very awkward sitting inside the tiny car video game, but I feel that it's too late to change my mind.  I find quarters and put them in the machine.  C helps me start the game but soon he is playing a game of his own and I am left to figure out on my own.  I sit and stare like a retard until the game starts on its own.  I realize that I have to drive a car and press the pedal.  I'm moving but moving extremely slow.  The colors on the video game look extremely unrealistic and they start swaying and bubbling.  After about two minutes of staring like a retard I put the car into second gear.  I like going fast.  I start laughing very loudly but I can't stop playing the game because I haven't finished yet.  After about 10 minutes of me and C laughing hysterically playing a racing game we stumble out of the arcade and finally agree to look for S.</p><p>3:50</p><p>T+4:50</p><p>T+3:30</p><p>After sitting in one place for about 5 minutes (It seemed like hours, we even got up for almost a minute then remembered we were supposed to stay) S was able to locate us.  I'm happy we finally have found S and I ask him if he would like to ride some rides.  S seems disconnected from the world I'm in and I realize that communication is impossible.</p><p>4:20</p><p>T+5:20</p><p>T+4:00</p><p>Waiting in line for the 3d dissapator or something, suddenly I'm given new hope for Cedar Point.  I realize that we have already rode a few rides and done a lot of drugs.  I would rather have ridden more rides but maybe people will go home and we will have the park to ourselves I think.  Once we get inside the building waiting in line isn't such a chore anymore.  Before now, me and C were completely silent in the lines and just stared at each other to make sure if anyone was staring at us, at least we wouldn't be staring back because that's how I got myself into trouble on the ferris wheel.  The acid had me very paranoid and I had to gather myself each time before getting very close to people (like waiting in line).</p><p>The indoor section of the line was very dark lit and had a lot of bright colors and 3d effects everywhere.  It was very pleasant but my visuals had stopped and it was nothing too insane. After the line moved forward a bit there was a green substance splattered on the wall that appeared to be crawling.  I asked S if the green thing looked like it was moving around to him and a few people gave me sketchy looks.  I smiled to myself.</p><p>The ride itself was cool, but it was very dark lit and no strange visuals occurred.  The ride was fun, and probably scared me more than normal, but now the effects of the acid were mainly mental.</p><p>5:40</p><p>T+6:40</p><p>T+5:20</p><p>Me, S, and C have now all made our way back to the beach where we this time walk to a very secluded area to smoke another blunt.  After the 3d ride we got lockers and put our hoodies away.  At this point my jean pockets are extremely full and I am feeling very overwhelmed wanting to get my hoody back as soon as possible.  After smoking the blunt that C rolled earlier in the car I am unsatisfied and want a nice blunt to smoke.  C finds a new map lying in the sand and hands it to me in attempt to redeem himself for earlier.  I use the map as a tray and roll a blunt.  I then fold up the remaining pot inside the map, not realizing that I could have used it to find my way to rides. \tWe smoke the second blunt and this time feel much more paranoid.  Many people are staring at us and this time I don't feel happy.  The sky is starting to get darker and a mood of sadness sets into the park.</p><p>6:40-7:00</p><p>We walk back from the beach to the park.  We instantly go back and get our hoodies because of the freezing temperature.  After wandering for over an hour I vow to get in the next line I see.  After I get in line I change my mind and jump over the railing and we continue walking.  We have now reached the exit and getting angry I shout 'I didn't come here to walk, I came to ride rides!'  S leads us to the demon drop.  Suddenly I have intense flashbacks to when I was 8 years old and here with my parents.  </p><p>Almost a decade ago,  I remember getting on the demon drop.  The demon drop is a ride where you are sat in a large steel box.  The steel box is raised a hundred feet or so into the air and then you do a bar guided free fall.  As the box reached the peak and started moving forward to begin the plunge I immediately freaked out and started screaming.  'Wait stop the ride I don't want to do this!' Instantly the ride dropped and I felt like my body was being split in two.  I came back a few years after that incident and rode the ride just to prove that I was a big boy.</p><p>Anyways now I was back, and I started describing my past life to C.  I have a very strange past life as I used to live in a different state and moved when I was 10.  I was always open minded, but I had a complete different personality for half of my life.  Anyways I could tell I was freaking C out by telling him this while he was on acid so I just stopped and waited in silence.  After being seated on the ride C tells me to put my feet against the steel in front of us.  The man running the ride comes over and tells us to keep our feet off of it.  I am instantly angered.  Does he think I'm going to break the steel box?  Does Cedar Point treat all of their customers like that?  Before I can  protest the ride begins and our box starts its ascent.  Not at all wanting to ride the ride I once again think of my 8 year old self.  As the box begins moving forward I feel exactly as I did 9 years ago and It feels like my body is being ripped apart as we drop from the giant metal tower.  After the ride my heart is pounding and  I feel very excited once again.</p><p>8:00</p><p>T+9:00</p><p>T+7:40</p><p>We have wondered around the park looking for rides with lines less than 2 hours long and have been completely unsuccessful.  Once we ended up going into a room filled with fog and no light.  There were strange people coming up to us and trying to scare us, and it was working.  After leaving that part of the park all I can do is complain that we had to walk through a ride.  Giving up we decide to leave the park.  Only problem is I'm still tripping and can't drive yet.  I know that I won't be sober in time for the park to close but I know that waiting an hour or two will help a lot.  Willing to do anything to kill time we wait in line for the ferris wheel.</p><p>8:30</p><p>T+9:30</p><p>T+8:10</p><p>We have boarded the ferris wheel and it is interesting gazing at the parking lot. It's crazy how this many people will all come to one place to wait in lines.  It feels like I've been at Cedar Point all my life and I'm ready to leave it behind forever.  I tell my friends my decision to never return to Cedar Point and C for the time being agrees.  I start explaining what my day has been like and C tells me we need to stop talking until the acid wears off.  We have been talking about everything for the entire day and it seems logical to take a break.  At the moment I can't even describe how my day went, and just accept the silence.</p><p>9:20</p><p>T+10:20</p><p>T+9:00</p><p>The day is finally over I tell myself as I sit down in my car.  C breaks out a bag of chips and a 2 liter of Dr. Pepper.  I completely forgot about them and I start laughing.  I'm having much more fun in my car than I had at cedar point the past couple hours.  S immediately passes out in the back seat.  He didn't sleep the night before because he was up doing the acid that we were supposed to do at Cedar Point.</p><p>9:40</p><p>T+10:40</p><p>T+9:20</p><p>I have not yet put the key in the ignition and C points this out.  'Oh I just wasn't going to drive until someone made me' I reply. 'Drive' commands C.  I drive.  Confused I tell C that its his job to tell me exactly when and where to turn for the entire drive back home.  With much difficulty and confusion we exit the Cedar Point Parking lot.  I have almost no visuals anymore and just have a strange head buzz that makes me feel somehow 'different' but not very messed up.</p><p>10:30</p><p>T+11:30</p><p>T+10:10</p><p>C asks me if I'm going to stop at a gas station soon.  I ask him why I would do that when he told me he didn't want to go to one. 'Oh I meant I did want to go to one' he replies.  I see a sign that says 'Last stop in ohio!' I tell C he's in luck. It's pretty large store for being a gas station on the side of the highway and I'm pretty impressed.  As soon as I walk in I see a coffee mug with a red bird and the word 'Ohio'.  I know that this cup has chosen me and I bring it to the checkout.  C orders a pizza and a Coffee.  I then order the coffee with the longest name and it turns out to be a delicious frappachino.</p><p>After receiving our merchandise we successfully drove home and went to J's place to sleep.  Arriving at about 1 in the morning we immediately tried going to sleep.  Me and C still had acid in our systems and stayed up playing Super Smash bros. Meelee  until 2 am when he passed out.  I didn't fall asleep until 4 am. The next day my legs felt like they had been run over.</p><p>Stuff of interest that I left out</p><p>The entire day C wanted to get food but every time we saw the line we changed our mind.  On acid we couldn't convince ourselves to spend that much time doing nothing.  We ate out of vending machines the entire day.</p><p>Me and C only separated once for about 5 seconds when he left me at a drinking fountain.  He told me that everyone started moving really fast when he couldn't find me.</p><p>Stay away from mirrors.  They mess with your head.</p><p>All in all I have to say that it was a good experience.   I would never do it again purely because standing around doing nothing is boring and being on acid makes it even more intensely boring.  This is definitely the hardest I have ever tripped in my life and it has possibly changed a few things about my thinking.  I don't think I would really recommend this trip for anyone, as if I would've freaked out at all I think I would have gone insane.  We really weren't expecting the acid to be any good so we really just dosed to fast, so if you think you could pull it off go for it, but be careful.  Give your acid plenty of time to kick in.</p>"
}
