{
 "title": "Almost Died of Scare",
 "author": "Formaldehyde",
 "citation": "   Formaldehyde. \"Almost Died of Scare: experience with Morning Glory Seeds (Heavenly Blue) (ID 6648)\". Erowid.org. Mar 18, 2002. erowid.org/exp/6648",
 "substance": "Morning Glory Seeds (Heavenly Blue)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "320 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "2001",
   "6648",
   "Male",
   " ",
   "Not Given",
   "Mar 18, 2002",
   "18923",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOur class had french guests some days ago, and before they left we made a big party. It was on the 2th of may, about 20:00 when I ate 4 packets of Heavenly Blue seeds at home. Each of the packets contained about 80 seeds and had cost about 25 cents. They tasted like nut, and caused a slight stomach ache. </p><p>I started to feel some effects after a couple of minutes, slight happiness. My pupils widened after half an hour. About 22:00 we went to a pub with my friends and with the frenchies. The lights were very bright at that time and I was in a happy , relaxed and talkative mood. We made small walks near the pub with two of my classmates and talked about drugs and Morning Glory. They noticed that everything was interesting and beautiful for me, and they considered to try it next time. We had a great chat, they seemed very kind to me. Time passed and I had more and more strange and interesting thougts when I looked at the night sky. The moon almost blinded me, and I thougt about space, stars, aliens and such things, feeling that I was a wanderer in the universe. </p><p>Later the whole group went to a park, at that time my behavior changed. I became more nervous and less talkative. I started to feel worse and my happiness gone away when bad effects were experienced.  I had blurred and doubled vision, and everything became scary around me. The words of my friends weren't nice any more and I wanted to sit down somewhere. The night sky and the park seemed like an astral gate for moments but I coudn't enjoy it. My nose started running and I thought that breathing became difficult. Sitting on a bench for minutes didn't help so I asked my two classmates to go home. They changed their mind about tripping with Morning Glory.</p><p>I felt bad and thought I was poisoned and dying and I asked my friends to calm me down. Walking was a bit difficult but somehow we arrived home. My two classmates went away and I became lonely after I managed to send my mother back to sleep. I was really scared and this feelings increased more and more. The bathroom changed it's colors and fractals waved in the tiles. Sometimes the bad feelings weren't noticable but usually they were very nerving. I was afraid of many things at that time: death, my parents, the school tomorrow, etc. I lyed in my bed in the dark when the trip reached it's climax at about 3:00. Fractals whirled my mind with extreme intensity, thouhgts were flowing in my mind in many parallel channels. Strange noises sounded in my ears beside the visual hallucinations. Luckily I managed to decide things in my mind: I am not afraid of death.</p><p>After this I could come out from the paras and felt better. I started to think about the universe and being. My soul left my body and left this world. I travelled far away in the space and lately saw the Core. I can't write down all of my experiences, but it was a bright sphere-like thing. The Core of the Unity. I understood everything and understood my mission in this world. I don't know how much time I spent there but later I came back. I had visions of known and unknown landscapes and having sex with girls. Many orgasms came without ejacuation, my mind was blown up by hormons. I experienced a lot of other things, it was like a typical LSD trip. </p><p>I think the trip became dreaming because I woke up from sleep at 7:00. I had to go to school although the effects weren't over, my mind still worked very fast. I was extremely tired in school and it was hard to speak and sometimes things started to whirl. Many important philosophical questions were answered during the morning. In the 6th lesson I felt asleep, so the teacher sent me home where I could rest at last.</p><p>In few words, it was a very intensive trip and I collected lots of experiences. But there were points when I almost died of scare. I know that the set and the setting weren't good enough.  I advice to make an extraction of the stuff or trip with smaller amounts.</p>"
}
