{
 "title": "Good Shit for 1 Trip",
 "author": "iwonttell",
 "citation": "   iwonttell. \"Good Shit for 1 Trip: experience with H.B. Woodrose (ID 66481)\". Erowid.org. Dec 29, 2013. erowid.org/exp/66481",
 "substance": "H.B. Woodrose",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2007",
   "66481",
   "Male",
   " ",
   "Not Given",
   "Dec 29, 2013",
   "262",
   " "
  ]
 ],
 "report": "<p>My history with any drugs is only 1 year old. I started with alcohol. I was 15 years old and I'd be 16 that December. It was the end of summer and start of fall and I was out drinking for the 1st time, got bit addicted, I think (drank almost every day). Then started MJ got off alcohol and life started looking bright again. Tried nutmeg many times. It was hell of a fun (maybe lasted too long (usually 3 days)). Now It has been 1 year without alcohol so I think MJ saved me from what my family has gotten into. Now lets go to HBW.</p><p>Aah. I feel so good thinking about the 1st experience. I have had 3 experiences with this substance. All with 5 seeds. I am very very happy about having the experiences and very happy to think that they were my last experiences with HBW. I don't want to do it to my body again even tho it felt so good.</p><p>I ordered 50 HBW seeds from a entheogen shop site. They said it would take 20 business days for me to get them (10 days to send cash from here to there and another 10 to get the seeds to Finland) but it only took 8 business days and I was standing at home with the seeds in my hand. I was very exited. I had promised with my friends that we would try them together but they were all out somewhere and couldn't come. I didn't want to wait until the next Friday so I just ate 5 seeds. They were hard (really really hard) but I somehow got them crushed with my back teeth. The seeds didn't taste like anything so I just held them in my mouth with warm water for like 5 minutes and swallowed. I had read that warm water makes them more potential. No nausea or anything. Clock was about 12:00 (12pm). Its stupid to do drugs when alone!! I don't recommend it but at this point I was too exited.</p><p>Now it had been 1 hour from the consumption and no effects so I was like 'shit!'. I started listening to music.</p><p>After 3 songs (of Shpongle) I started feeling really really weird. The base of the music got me feeling bad so I turned music off and went to my bed. It was around 13:20 (1.20pm).</p><p>After I had laid down for something like 10 minutes I started feeling really good. I was so happy at everything. I just laughed and smiled and rolled around in my bed. The feeling was like I had never felt so bad but at the same time it was clearly the best moment of my life. I was terribly nauseous because I had rolled over the stereo remote and music had turned back on. I just wasn't able of turning it off again. Nothing had come even close to it. Not even the 1st time I got pussy. Or my 1st high on MJ. Or umh... Anything...</p><p>This was something that I had thought that MDMA would do to me. I'll never try that drug, I have reasons.</p><p>My girl friend called me during that period and her voice calmed me down so that I was able to have a good conversation. Her every word sounded really sexy and they kept bouncing in my head for after the phone call. And I started laughing and rolling around again after the call.</p><p>It lasted till 14:30 (2.30pm) and then I was finally able to get a hold of my self. I started cooking. Eating was the weirdest thing on the whole trip. It was close to the feeling when eating fruit candy while on nutmeg (crazy shit!!!) but much more intense. It felt like the food was alive and jumping around my mouth. After I got the plate empty the music (I still hadn't turned it off) started feeling good. My muscles moved around in the riddim and I felt very close to the music. At the side I saw the mirror in my room and my eyes were really fucked up. The black area had taken over the whole colored shit.</p><p>This continued till 20:00 (8pm). All the effects were still fully on but I had gotten used to it. I was waiting for the comedown. It didn't come.</p><p>21:00 (9pm) No comedown even tho the internet said it would take 8 hours max. This has happened with every other substance too. The effects last longer on me than my friends. The substances react differently on different persons!</p><p>21:20 (9.20pm) I was so tired even tho it was too early to go sleep. I usually go sleep 23:00. But I was too tired to stay up. When I held my eyes closed I saw weird Inca statues (very complicated looking structures) covering the whole sight. This continued until I was asleep.</p><p>No side effects at the morning. Woke up around 11:00 (11am)</p><p>The 2nd and 3rd experiences were almost the same. Only 2 things were different: the seeds started tasting very bad and I had problems with eating them (the 3rd time this point was very overwhelming) and the other thing was that I didn't get the good laughing part that I so much loved. </p><p>The 1st experience was really good and I think that it would have been good as a last experience. The 2nd was not so good and the 3rd didn't offer anything new.</p><p>The side effects were: blurred vision for 2 days after the 3rd trip and hardness on reaching orgasm. I noticed the last thing when I was with my girlfriend. It was not such a bad thing: she now gets orgasm far before I do so she pleasures me with her mouth to the end after she has reached hers. I like that thing :).</p><p>I still have 20 seeds and all of my friends that wanted to try have tried so I'll give the last of them to some random bum.</p><p>Outcome:</p><p>- too long lasting</p><p>-- blurred vision after 3rd trip (didn't see shit unless I was 10 feet away from the objects)</p><p>- nausea while coming up (more bad when music on)</p><p>-- bad taste on 2nd and 3rd trip</p><p>+++ Moodlift (much like I had thought that 'euphoria' would be)</p><p>+ Inca visions the eyes closed</p><p>+ cheap to buy and easy to get</p><p>+++ not addicting</p><p>++ free blowjobs :D</p><p>Grade: 4/5 good shit for 1 try!</p><p>That's all this time!</p><p>Peace, Love and Light</p>"
}
