{
 "title": "Weak but Long",
 "author": "Schitzo45",
 "citation": "   Schitzo45. \"Weak but Long: experience with Diazepam (Valium) (ID 66532)\". Erowid.org. Sep 28, 2009. erowid.org/exp/66532",
 "substance": "Diazepam (Valium)",
 "bodyweight": "206 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   " ",
   "30 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66532",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 28, 2009",
   "Views: 38901",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI recently purchased about 100 generic valiums (10mg) online. After three weeks of somewhat patient, well not really, waiting, they finally arrived. So, with great excitement, I opened the pack and took one right off the bat to properly test it. I noted some slight euphoria after ten minutes, but it seemed to pass just as soon as it came. No big deal, I thought, just too small a dose. After all, it was just a test run to make sure I hadn't been burned. So I took three more. Same exact thing, ten minutes of slight euphoria and an abrupt ending. I did note a feeling of exhaustion afterwards however, so I decided to sleep it off and try again later. However, and this is the weird part. <br>The next day, without taking any whatsoever, I noticed that while I had no physical buzz of any kind, I was having some difficulty walking, as well as slurred speech. This was pointed out by a co-worker. So no pills the next night at least I decided as a result of my obvious concern with the occurrence. However, the following morning, I had this newly found zombie-like state, like being medicated in a mental ward, complete with the previous walking and talking issues all night and into the next morning. All this from 40 mg three days prior.<br>I mentioned this to a friend of mine, We'll call him B, and for whatever reason he wanted to try some. So I gave him twenty mg. He said he reacted just as he expected, fucked up and happy. Oh well, I'll sell some to B and did notice that they may be useful as sleep aids in smaller doses.\n\n\n"
}
