{
 "title": "The Foxy Tightrope (a Retrospective)",
 "author": "Sorak",
 "citation": "   Sorak. \"The Foxy Tightrope (a Retrospective): experience with 5-MeO-DiPT (ID 6656)\". Erowid.org. Dec 13, 2001. erowid.org/exp/6656",
 "substance": "5-MeO-DiPT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6656",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 13, 2001",
   "Views: 14475",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nFor me, 5-meo-dipt, otherwise known as Foxy, is a mixed bag. I've had great times on it, I've had so-so times on it, and I've had awful times on it. Over a period of two and a half years, experimenting with it about 30 times, and seeing its effects on close friends, I have come to the following conclusions:<br>-High doses of foxy can amplify the negative side effects of this substance to the detriment of the positive effects. Doses from 4-8 mg work best for me and most I know. Some people, however, seem to really enjoy higher doses.<br>- Foxy has a tendency to produce varying levels of anxious energy, depending on the dosage. If I have a positive outlet for this energy, the experience usually is a fun one. Foxy is great, great, great with any kind of physical activity. It tends to bring out a certain level of intensity, an intensity that lends itself marvelously to sex, dancing, hiking etc...<br>- If my positive focus is not strong or sustained enough, foxy can sometimes turn into an unpleasant experience, especially at larger doses. Under such circumstances, I have found that focusing on deep rhythmic breathing works the best, and tends to refocus the energy which has been caught up in negative loops onto something life affirming. Medium doses of GHB have also knocked me and others out of teeth grinding and annoying foxy highs.<br>-Foxy often produces loose stools or diarrhea. For many users, myself included, the purging usually results in an even better trip thereafter, as if the body had gotten rid of a bunch of emotional ballast. <br>-Foxy can be empathogenic, but usually does not induce the innapropriate bonding that sometimes happens on MDMA.  <br>Any psychedelic can produce feelings of intensity, however i have found foxy seems to produce a unique brand of 'neurological noise' that can be quite disconcerting. For myself and those I know, tripping on foxy can be like walking on a tightrope. It all seems to be a matter of negotiating, or navigating, the surges of intensity, without losing one's center.\n\n\n"
}
