{
 "title": "Summer",
 "author": "Coatlxoxouqhui",
 "citation": "   Coatlxoxouqhui. \"Summer: experience with 2C-E & Benzodiazepines (ID 66669)\". Erowid.org. May 26, 2008. erowid.org/exp/66669",
 "substance": "2C-E & Benzodiazepines",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "2C-E",
   "(liquid)",
   " ",
   "  repeated",
   "oral",
   "Benzodiazepines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 66669",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 26, 2008",
   "Views: 7614",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast summer I decided to delve into a stash of 2C-E I had only really touched once prior, about 0.5 g ordered from an rc vendor, which was dissolved in dH2O to a concentration of 2mg/mL and taken generally dissolved in juice or just in more water at doses of 8 to 22 mg. Prior experience with psychoactives included: mushrooms, cannabis, dipropyltryptamine, ketamine, cocaine, 'ecstasy' (occasionally tested - usually reacting as MDMx and/or 2Cx (probably 2C-I, often not, in which case I really am unsure as to the quality), methamphetamine, kratom, analogues of ayahuasca, harmaline (on it's own and with mushrooms), benzodiazepines (diazepine, chlonazepam, bromazepam, alprazolam, lorazepam), barbitone, phenobarbital, codeine, opium, morphine, hydrocodone, dxm, lsd, lsa (Argyreia nervosa and Rivea corymbosa seed), datura (D. innoxia - seed, leaf and root), Salvia divinorum, nitrous oxide, amyl nitrite, kava, zopiclone, methylphenidate, Ephedra (various species), Erythroxylum novogranatense (fresh leaf), Erythroxylum coca (dried leaf, various teas), ether (largely accidental), hash, methcathinone, Catha edulis (fresh leaf) and also tobacco (cigarettes, cigars and snuff) and alcohol.<br>2C-E to me was most reminiscent of mushrooms or some of the 'esctasy' I had tried prior (tested once by colour reactions, probably 2C-I) but definitely had it's own flair. What was particularly notable to me was the intense difference between taking it solo or in the presence of friends. In the first case it took on a very psychedelic ambiance with a particular focus on the breathing of living things and visuals that were particularly characterized by disintegration of organic things into its constituents followed by reintegration into the organic being again in cycles. In the latter case the social aspect overwhelmed these ideologies and it became much more like a low dose of LSD, much more giggling and just 'neato' observations. My main problem with this substance is a tendency to get stuck in 'negative' head spaces, with visions and thoughts of my own age/aging and impermanence, as well as an unusual body load. My muscles all feel tense, stomach heavy and nerves are too sensitive, moreso than with other psychedelics and sometimes continuing on to the next day.<br>The following are a few examples of trials I recorded over that summer, mostly transcribed while in 2C-E space and unedited except to remove identifying people/spaces:<br>1) 15 mg 2C-E (oral)<br>t=0 ~ 15:15 - 15 mg 2CE - last ate ~ 13:30<br>Today I took most supplements including those with B vits and 5HTP etc. in the morning ~ 8 am, and drank lots of water and coca mate. Quite strong body load early on - very nice almost psilocybin like, but made me feel tired. I am currently also taking benzos for sleep/anxiety - might be side effect. I would fall asleep to music and dream that I was in the music, not just enjoying it - actually in it. I would try again at this level<br>2) 10 mg 2C-E (oral)<br>So once again the next day: 10mg with the usual breakfast shake and minor supplements.<br>Already I had shakes (not convinced this is benzos anymore) and the more I focus on typing the less problematic it is.<br>T+0~11:25<br>Went to C's seminar and talked to Dr. Y., interesting and scary initially, the seminar put me to sleep for a bit, D. woke me and shaking began in earnest now. Sitting in gardened area with wireless connections and little patio tables - today of all days they are working on my furnace so can't go home and don't see how that would help anyways.<br>T+1:14<br>Had similar problems to yesterday - shaking uncontrollably especially when writing - went to arboretum for awhile then coffee shop W - eyes dilated hot/cold tremors nothing really positive. I took 15 mg temazepam ~ 1.5 hrs in after first problems with shaking started.<br>3) 16 mg 2C-E (oral)<br>The prior night I took 40 mg diazepam and 45 mg temazepam - still only slept 3 hrs. Gross movements a problem, not going into work. I will work in coffee shop W. Fine motor control not really a problem. I skip most morning supplements (not sure of interactions) but still take neurotransmitter supplement, 1/2 evening primrose, lecithin (1/1), zinc and magnesium - also drink (slowly) sobe no fear - 473 mL.<br>t+0 ~ 10:50<br>11:28 - pretty sure I can feel it, not like sketchy post benzo feeling although that's there too.<br>11:38 - started some work made some coca mate but I think I might need to lay back down already!<br>11:44 - notable ataxia (is this the right word for shaking in specific muscle groups?) esp. in the lower legs - very strong urge to sleep, but don't want to for obvious reasons - spelling is a little off, thanks to this computer it doesn't look too bad - but it is getting worse.<br>11:50 - checked mirror - pretty sure pupil dilation is pretty strong but no other noticeable effects?<br>Now is 3:19 next morning, I had to leave to find a darker place which never worked and have ~10 pages of rantings, mostly chemical. L. was really helpful and so were the crowd in the right areas of K-town, but the light!<br>Notes written the next day:<br>Bad shaking was a problem off and on (mostly ok) went to coffee shop H where I felt dirty and people were wondering why I was there, so I went back to coffee shop R and sat for hours writing on coffee stained paper provided kindly by the beautiful barista, who also was kind enough to listen to me talk a little about how I was feeling and told me why there was no mirror in the washroom (there was, but small and on the door so I missed it). I said I was curious cause I had a medical condition that corresponded with the eye dilations and if she would check for me - apparantly they were.<br>Overall, these psychedelics cause me to enter into a nervous psychedelic state, including a huge urge to write or record ideas. The next day is always positive, but I get 'the fear' moreso than with other psychedelics during the experience.\n\n\n"
}
