{
 "title": "Pleasant and Warm Buzz",
 "author": "teknoshaman",
 "citation": "   teknoshaman. \"Pleasant and Warm Buzz: experience with Calamus & Alcohol (Vodka extract) (ID 66675)\". Erowid.org. Oct 29, 2007. erowid.org/exp/66675",
 "substance": "Calamus & Alcohol (Vodka extract)",
 "bodyweight": "79 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 0:00",
   "1 glass",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 0:00",
   "8.0 g",
   "oral",
   "Calamus",
   "(extract)",
   "  T+ 1:23",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 66675",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 29, 2007",
   "Views: 8288",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I consider myself a fairly experienced psychonaut, having had my share of psychedelics, pharmaceuticals, plants etc. One day I found a bag of Acorus calamus root powder which I had purchased from an online vendor during my university years (about 5 years ago). The bag originally contained 50mg of very fine powder but now seemed to contain somewhere between 30 and 35g. I can't remember when or how I had used the powder that was missing, but I had probably mixed it with other stuff, otherwise I would remember. The bag had remained sealed in a dry, dark place. The powder had formed hard rocks but looked otherwise unchanged.</p><p>I first crumbled the rocks to powder again, by applying pressure on the plastic bag. I took a 350ml bottle of vodka, emptied about 50ml to make space, and used a funnel to pour the powder into the bottle. I closed the lid and shook vigorously. I left the bottle stand for a couple of hours, shaking every once in a while. In retrospect, I could have waited longer for better results. Then, I took another, empty bottle. I put the funnel into the neck of the empty bottle, and a coffee filter inside the funnel. Then I started pouring the vodka and the calamus sludge into the filter, and watched as the honey-colored vodka started dripping into the empty bottle. I left the vodka filter throughout the night, although I suspect it didn't need that long. What I got was a bottle of honey-colored vodka.</p><p>At the time of the experiment, I was at my home, alone, with no immediate responsibilities and in good psychological state. I had been smoking pot since morning and by the time I started it was 6 in the afternoon. I had half a pizza a few hours earlier so I'm not hungry, I'm not feeling too full either.</p><p>18:08\tT+0:00 I poured about a quarter of the extract into a glass and had a small sip to taste it. The liquid had a mild warm/spicy taste that was not too unpleasant, but I mixed the vodka with orange juice so that the alcohol would go down easier.</p><p>T+0:01 I had a much larger sip, this time the orange juice masked the taste of the alcohol but not the calamus. Again, this was not an unpleasant taste, it is however strong and very distinctive. I can see how some people could find it unpleasant, but I'd say that it goes down fairly easily.</p><p>T+0:06 I am now half way through my glass and now the taste seems rather unpleasant. I feel a very slight irritation in the stomach, which could be attributed to the alcohol.</p><p>T+0:13 I finished my glass, by now the taste seemed very bitter and unpleasant. I am feeling mildly drunk from the alcohol, but I hope the main effects will wear off before the TMA-2 kicks in. [Erowid Note: The idea that a chemical in calamus metabolizes to TMA-2 in the body is pure speculation.] I drank a large glass of water too, to prepare for any dehydration that might arise from mixing an amphetamine with alcohol. My experience is that when using psychoactives, one must be careful to stay properly hydrated. Water helps everything get around inside you. I am not planning to drink any more tonight. If my rough estimates are correct (I really should buy a scale to use in my experiments), I have ingested the extract of about 7 to 9 grams of root powder, which I think is more than enough for a first try. And now, to play the waiting game...</p><p>T+0:26 I am feeling a buzz that I think is different from the drunkenness I am experiencing. The spicy taste that still lingers in my mouth, and the warm, fuzzy feeling both remind me of my nutmeg experiments, and this is something that takes my mind years back to my university days, when I must have purchased the root powder.</p><p>T+0:50 I am definitely feeling a distinct buzz. I am chatting online with a good friend, and I'm telling her about what I'm doing. My typing skill has not been impared.</p><p>T+0:58 I notice that my hands are a bit sweaty, and the buzz continues. Nothing special.</p><p>T+1:04 Now I'm not just feeling a buzz, but a happy sensation, also I'm slightly sleepy in an amphetamine-kind of way. I don't really want to go to sleep, I guess the word I'm looking for is drowsy. I am also feeling a pleasant pressure around my head.</p><p>T+1:16 I discover that I feel happy and content when I let my eyes slightly lose focus. This is something I have also experienced with drugs from the amphetamine family. I don't like the side-effects of the amphetamines (and that's why I gave up ecstasy/speed/etc a long time ago), but today I am experiencing none of the unpleasant side-effects.</p><p>T+1:23 I decide to spoil the experiment a bit and light up a J. It intensified the effects slightly.</p><p>T+1:50 Still feeling buzzed. Pleasant but nothing spectacular. I'm not feeling any of the nausea that is often reported either. Nor do I feel any other unpleasant symptoms. I'm beginning to think that the plant material might have degraded due to me storing it for such a long time.</p><p>T+2:24 Effects are subsiding.</p><p>T+2:41 Now I'm close to baseline.</p><p>Overall it was a pleasant experience, definitely not a placebo, and I plan to repeat it in a few days, maybe stepping up the dosage, since I still have three times as much liquid left as I drank today. But once I run out, I don't think I'll be in any rush to acquire more calamus. For me it was a mild experience but if you are planning to follow my steps keep in mind that the material I used might have lost some potency because I kept it stored for so long. Use caution and common sense and always be safe. Peace.</p>"
}
