{
 "title": "Suggestive of Mild Serotonin Syndrome",
 "author": "Karita Tähti",
 "citation": "   Karita Tähti. \"Suggestive of Mild Serotonin Syndrome: experience with MAOI (Tranylcypromine) & DXM (ID 66673)\". Erowid.org. Apr 28, 2008. erowid.org/exp/66673",
 "substance": "MAOI (Tranylcypromine) & DXM",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "MAOI",
   "  T+ 1:00",
   "10 mg",
   "oral",
   "DXM",
   "  T+ 3:00",
   "30 mg",
   "oral",
   "DXM",
   "  T+ 5:00",
   "60 mg",
   "oral",
   "DXM",
   "  T+ 5:30",
   "60 mg",
   "oral",
   "DXM",
   "  T+ 0:00",
   "45 mg",
   "oral",
   "DXM",
   "  T+ 12:00",
   "90 mg",
   "oral",
   "DXM",
   "  T+ 12:00",
   "30 mg",
   "oral",
   "MAOI"
  ]
 ],
 "footer": [
  [
   "2007",
   "66673",
   "Female",
   " ",
   "Not Given",
   "Apr 28, 2008",
   "27636",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>WARNING</p><p>I am not a medical professional.  The following should not be construed as medical advice, nor as a demonstration of the general safety of combining MAOIs with dextromethorphan.</p><p>Abstract</p><p>The interaction between monoamine oxidase inhibitors (MAOIs) and dextromethorphan (DM) is inconsistently described across existing literature.  Safe concomitant dose ranges are unknown.  I describe an experiment to determine whether DM can be used safely during treatment with the maximum approved dose of tranylcypromine (TC).  I find that subrecreational doses of DM produce no potentially life-threatening effects, including changes in temperature or blood pressure.  The interaction between DM and TC is observed to be partially consistent with mild serotonin syndrome.  Their combination appears to be mostly pleasurable with a potential for excessive sleep of high quality.</p><p>Drugs Used</p><p>Dextromethorphan (DM), 300 mg (2.5 times maximum approved dose), over the counter generic for Robitussin CoughGels</p><p>Tranylcypromine (TC), 60 mg (maximum approved dose), prescribed as Parnate</p><p>Background</p><p>I have undergone treatment for depression for roughly ten years.  During this time, antidepressants of all types have been prescribed, generally to little or no effect.  On one occasion a drug combination produced serotonin syndrome severe enough to require hospital monitoring.  TC has had the greatest beneficial effect, I was treated with it once previously for a few months, and currently have been taking it for about a month.  Recently, TC prevents me from sleeping for longer than two or three hours at a time, with forced periods of wakefulness of at least one hour, and prevents dreaming entirely.</p><p>I have occasionally taken DM (mainly DexAlone), using various dosages and schedules while attempting to determine the most efficient method of inducing prolonged lucid dissociation and other poorly understood states, such as 'plateau sigma'.  The discovery that my careful experiments were decreasing in reproducibility caused me to lose most interest in DM.</p><p>I am in good health.  My blood pressure is normal, at 120/80 or better.  My liver and kidney function is normal.  I take a daily multivitamin along with extra calcium and vitamin C.  I have a strong interest in medicine and pharmacology, especially as they relate to my health and psychiatric treatment.</p><p>Rationale</p><p>Although TC is helpful, its impact on my depression remains unsatisfactory.  I am interested in identifying an effective adjuvant, regardless of whether it is accepted as safe in combination with MAOIs.  The dubious quality of information about DM use with MAOIs suggests a deficiency in medical understanding of its true safety and a potential to be safer than drugs with more consistent warnings.</p><p>An interaction between DM and TC not mediated by competition for liver enzymes may produce effects not experienced from the use of either drug alone.  Thus, it may be productive to experiment with DM again despite extensive familiarity with its effects and previous rejection of its usefulness.  I can quickly determine whether the interaction is excessively dangerous for myself while simultaneously gaining insight into its nature and useful applications.</p><p>Literature</p><p>Claims about the interaction between DM and TC vary considerably except in terseness.  Typically, listed symptoms are ambiguous but one of several unique syndromes is implied.  The possibility of safe concomitant dosages is not acknowledged, and therapeutic doses of DM are occasionally stated to be dangerous.  The following descriptions of interaction dangers have been observed:</p><p>- psychosis or bizarre behavior (FDA)</p><p>- adrenergic crisis, collapse, coma, dizziness, excitation, hypertension, hyperpyrexia, intracerebral bleeding, lethargy, nausea, psychotic behavior, spasms, and tremors</p><p>- serotonin syndrome</p><p>- hypertensive crisis</p><p>- hyperpyrexia, hypotension, death</p><p>- has regularly been fatal (DXM FAQ)</p><p>Preparation</p><p>- extra vitamin C</p><p>- easy access to 20 mg nifedipine in case of hypertension</p><p>- easy access to 500 mg naproxen</p><p>- access to nicotine</p><p>- automated blood pressure monitor</p><p>- digital thermometer</p><p>Experiment</p><p>Roughly one hour after my morning TC dose of 30 mg at 9:00 AM, I began with an initial challenge dose of 15 mg DM and waited for two hours.  Temperature and blood pressure were monitored regularly.  Observing no obvious unusual effects, I followed with 30 mg DM.  A similar waiting period elapsed before the addition of 60 mg.  It seems likely hypomania was beginning to develop, as I mistakenly added another 60 mg within half an hour.  Realizing the mistake (somewhat nervously), I allowed another waiting period.  Having observed no alarming effects, I added 45 mg DM and shortly later finished with the remaining 90 mg at the same time as my 9:00 PM dose of 30 mg TC.</p><p>Interaction Effects</p><p>No significant increase in blood pressure or temperature was observed. Mood improved throughout the day, associated with increased alertness, attention, attention span, concentration, coordination, energy, reflexes, sociability, sweating, and talkativeness.  Insomnia, obsessive behavior, and minor controllable jaw spasms developed later in the day, along with mild diplopia typical of recreational DM doses.  Eventual tiredness near 4:00 AM produced immediate voluntary uninterrupted sleep lasting for fifteen hours with vivid dreaming leading eventually to nightmares which forced reawakening, likely due to TC schedule interruption and withdrawal.</p><p>Subsequent Effects</p><p>No continuing interaction effects are apparent.  TC withdrawal produced nasal and oral dryness as well as a prolonged unusual taste unresolved by food or attempts to cleanse the mouth.  Mood and energy remain positive but normal for TC treatment.  Attention span seems to have decreased, and distractibility increased, temporarily following waking.</p><p>Interpretation</p><p>It is obvious TC and DM produced robust hypomania beginning after the first supratherapeutic dose of DM and lasting for between seven and 22 hours following the last dose.  Effects similar to those of amphetamines are apparent.  Hypomania, sweating, jaw spasms, and hyperreflexia suggest mild serotonin syndrome.</p><p>Confounding Factors</p><p>- imprecise dose timing</p><p>- recent use of plant extracts, including chai, chocolate, coffee, ginseng, nicotine polacrilex, and Siberian root</p><p>Conclusion</p><p>Tranylcypromine (TC) and dextromethorphan (DM) interact.  In certain individuals, the interaction between approved doses may produce serotonin syndrome without life-threatening effects.  Combining TC and DM may be pleasurable but disruptive to normal activities, sleep, and medication scheduling.  Further study is needed, especially due to the potential to be misled by existing inaccurate, incomplete, and inconsistent literature.</p>"
}
