{
 "title": "What is the Godhead?",
 "author": "Neo",
 "citation": "   Neo. \"What is the Godhead?: experience with Dreams/Endogenous (ID 66672)\". Erowid.org. Nov 6, 2007. erowid.org/exp/66672",
 "substance": "Dreams/Endogenous",
 "bodyweight": "185 lb",
 "header": [],
 "footer": [
  [
   "2005",
   "ID: 66672",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2007",
   "Views: 5659",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nOK this is weird because this was only a dream but experienced the best feeling I have ever experienced in my life.  Let me explain.</p><p>It was a rather strange dream where I got shot. Rather passively or nihilistically, I accepted that I was going to die. Just as you're reading this right now through your little eyeballs, that perspective, first person, floated up and I was thinking 'Wow. I died.'</p><p>I can't relate what happened any other way than stating my human first person perspective was only a 'droplet' and I merged with something that was more like a plane of water. I thought I was 3 dimensional but in fact I wasn't.  It's paradoxical to state a 'plane of water' having more 'depth' than 3-dimensions but this 'Godhead', as I'm now inclined to calling it, was everything.</p><p>This plane of water was absolutely everything.  I was the sky, and the trees, and my dead body, and my killer.  Ceasation of 'thinking' or consciousness or ego altered to experiencing everything simultaneously.</p><p>I felt the most wonderful feeling at that moment.  Euphorea, and a memory that has affected me since.  A vision perhaps.  I question whether DMT was somehow involved, some people speculate it is released at the point of death.</p><p>We'll this opens a door for research and not just this report that I call a spiritual journey.  What if a human has a locked mind to a 'God Conscious'?  I'm more of a scientist than a hippie.  This vision has lead me to question the value and veracity of many things now (perhaps made me a bit more nihilistic).</p><p>I want to go back.  I love life but I'd rather be everything. I'd rather be you, me, trees and clouds of hydrogen that coalese into stars and die in gamma ray bursts. Then what is time?  An illusion.</p>"
}
