{
 "title": "Wow It's Amazing",
 "author": "Truly Madly Deeply",
 "citation": "   Truly Madly Deeply. \"Wow It's Amazing: experience with Modafinil (Provigil) (ID 66691)\". Erowid.org. Apr 19, 2010. erowid.org/exp/66691",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Modafinil",
   "(pill / tablet)",
   " ",
   "  repeated",
   "insufflated",
   "Modafinil",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66691",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 19, 2010",
   "Views: 20890",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was prescribed Provigil for my constant drowsiness that I seemed to have been succumbing to during and after my time on Prozac. My doctor told me to only take 100 mg due to my gender and lighter that average body weight for my height. \r\nSo the first day that I took it I swallowed the prescribed amount and I felt the effect about an hour later. I went to my therapists office and I could not for the life of me stop talking. It was like word vomit spilling from my lips. Later that day about 4 hours after I took the pill I went over to my sisters house. Within 15 minutes of being there she began shooting me strange looks. I'd been making strange comments and was constantly chattering, my hands were shaking, and I was happy for once. \r\nWhich is definitely new for me. I was diagnosed as disthemic and coupled with major depression my life has been a mix of mental anguish and various prescriptions for the past couple years. So this happiness was a total high for me. I looked in the mirror later and I saw that my eyes which are big and almond shaped were widened and had a round almost popping appearance, and my face and arms were kind of red from where I had picking and pinching my arms. I hadnt even noticed. Later my sister asked me if I was on speed, which I vehemently denied, and after a period she asked then if I was on cocaine. Ive never done drugs in my life so I have no idea any those symptoms of being on those drugs are. But my sister a hardened veteran was convinced that I was snorting something in her bathroom. \r\nLater that night when I got home I found that I wasnt the least bit hungry or tired so I spent the rest of the night reading other provigil testimonials. Most were by men, but the ones that I did find on women who are about my height and size were similar to my own. \r\nI was completely in love with the feeling of happiness and concentration that I got from Provigil but it was taking an hour to work. So I thought what the hell Ill snort it. I've heard from some of my friends who snort coke and various other substances that snorting drugs is faster than swallowing but it wont last as long. I thought what the hell doesnt matter if the high fades I still have a ton of Provigil left. \r\nSo 15 minutes after my epiphany I had crushed and chopped the pill into a grainy powder, and snort away I went. Ive never snorted anything before, but I found that its was the most addicting that I have ever done, and as major chocoholic I saw that no percentage of cocoa beans could compare the rush. Over the course of the next week Ive found that this pill was the only thing that worked for me, and although I might not be taking it the most healthy way its still the greatest medication Ive ever taken. \r\nProvigil has really helped to turn my life around without any negative side effects. It has helped me more that I can possibly imagine or express.\n\n\n"
}
