{
 "title": "Post-surgery Effects",
 "author": "unlucky",
 "citation": "   unlucky. \"Post-surgery Effects: experience with Morphine (ID 66708)\". Erowid.org. Feb 4, 2011. erowid.org/exp/66708",
 "substance": "Morphine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Morphine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66708",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 4, 2011",
   "Views: 4945",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was lucky enough to have contracted an infection in one of my hip muscles (and it didn't help there was a misdiagnosis, allowing it to get substantially more serious).  Anyway, after about a week of being in the hospital with pretty intense pain from the tightened, infected muscle, I required surgery.  For the period of time before the surgery, I was on a cocktail of vicoden and percocet that barely did the job.  I was actually looking forward to surgery at this point because nothing else seemed to be working.<br>Apparently the doctors planned to cut out the piece of infected muscle (and wash the area out with disinfectant, which we all know feels great).  So I go into the operating room, and pass out pretty quick.  Next thing I know, I'm awake.  I look around, confused, and start to notice that my eyes are wet.  It was really weird, and then all of a sudden the pain part of my brain turned back on, and the worst pain imaginable was burning from my hip and streaking across my entire body.  I realized the wetess was tears from pain that I hadn't felt yet.  I was literally sobbing and I've broken multiple bones before and this pain was probably about 20 times worse.  Apparently my dad said when the nurse asked what pain I was in on a scale of 1-10, I screamed 'A fucking 12 now give me something.'  Hopefully now you know what type of pain I was in, and I hope that I'll never experience it again.<br>The nurse gives me some weak stuff because of the anesthesia and they wheel me back to my room, and it no longer hurt so bad that I would cry.  Eventually, the drugs wore off and I was pretty much back to square one, with a 10/10 instead of a 12, except I was just resigned to being miserable.  The nurse came into the room and told me 'I'm going to give you some morphine'.  I remember thinking 'Well shit, that should definitely do the trick.'  She injected it into my IV, which was connected to a permanent line leading to my heart (so I didn't need new IV's every other day and it allowed for better drug dispersal).  I remember waiting about three seconds, and my heart started beating faster, and then complete relaxation.  No pain at all, and no cares at all, just extreme comfort.  It was very powerful and because I was weak, I fell asleep before experiencing many trippy effects.  I do remember the lights seeming more golden and the shadows were really dark, kind of like in a movie.  When I talked, I really needed to think hard to get the words to come out of my mouth, and it still seemed very slow.  <br>For the next 12 hours, I would wake up every hour and get a shot of morphine (unfortunately don't know the dosage) and each time was as amazing as the first.  I was going from by far the worst pain in my life to feeling like I was sitting in a hot tub with no cares in the world (pain scale from 10 to -2 you might say). When they finally stopped giving me morphine, I do have to say that I felt a little disappointment, but also felt glad to have something so powerful taken away again.<br>My main reason for writing this is that if someone is planning to try this drug recreationally, they better have some serious self control.  It's probably going to just make them fall asleep anyway, so it really shouldn't have much recreational appeal.  Think twice (or three times).  Morphine was so powerful and immediately gratifying that I understand why it takes over people's lives.  Be careful, please.\n\n\n"
}
