{
 "title": "Think Twice Before Selling",
 "author": "nvksmt",
 "citation": "   nvksmt. \"Think Twice Before Selling: experience with DXM (ID 6670)\". Erowid.org. Mar 19, 2002. erowid.org/exp/6670",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6670",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 19, 2002",
   "Views: 44849",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was selling pure DXM powder in capsules.  I know it wasn't smart... but I did it.  The main reason i sold it was I bought 100g of the shit, and got really sick of it.  It quit working for me somewhere around the 125th time I did it (95% of the time 3rd plateau or higher, 700mg+)  I had done robo, vicks, coro, and another smaller batch of powder.</p><p>I was packaging it up in 350mg caps and selling it to a kid I knew for about a year.  he knew what it was, and how much was in it.  I was doing this at school.  He was selling it at school to people he didnt really know.  He sold it to one guy who started puking and decided to go to the office, and passed out on the way there.  I know how stupid it is to take DXM at school, especially for the first time, but apparently the guy who i sold to didnt tell them this.</p><p>Well the kid woke up in the office and told them what he took and where he got it (the guy I sold to was telling them it was DXM, but they didnt know what DXM was).  The guy went to the office and told them where he got it (me) and told them EVERYONE he sold to.</p><p>I was taken to the office and the cops were called.  The cops had the bottle he had the pills in.  I have given him 25 350mg dxm pills and 3 pills of 350mg dxm + 150mg BZP.  They had 2 pills of dxm+bzp and that's it.  I told them what happened (because a lot of people knew I was the source, and I wouldve been in more trouble if I hadnt talked) and where I got it, and they went and searched my house (my mom signed the thing).  they found about 5g of bzp, 20g of dxm, 250mg 2ct7, 500mg amt, 1g 5x salvia, 6 vicodin es, some ephedra pills, a pipe w/ resin in it, and my deering 2g scale.</p><p>I am charged with 'Buy/possess drug paraphernalia' and 'Poss for sale/transfer of a simulated controlled substance' (for the dxm).  1 count of each.  I guess they couldnt identify anything else.  I'm going to end up going to some drug program probably.  I know I'd be in much more trouble if i was caught with ecstasy or something, but I still am gonna have to put up with the drug program.</p><p>I'm sure if I got a good lawyer I could get off the hook, but I can't afford that.  So everyone just watch yourself and dont sell chemicals, legal or not, unless you're prepared to pay for it.  I don't see anything wrong with selling small quantities to friends, but dont sell anything for people to sell to people who know nothing about the chemical.</p>"
}
