{
 "title": "Shootin' Bees Follow-Up",
 "author": "Thrip",
 "citation": "   Thrip. \"Shootin' Bees Follow-Up: experience with MDMA, LSD & 2C-B (ID 66813)\". Erowid.org. Nov 5, 2007. erowid.org/exp/66813",
 "substance": "MDMA, LSD & 2C-B",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "IM",
   "MDMA",
   "  T+ 1:00",
   "50 mg",
   "IM",
   "MDMA",
   "  T+ 1:00",
   "300 ug",
   "oral",
   "LSD",
   "  T+ 4:00",
   "5.0 mg",
   "IM",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 66813",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2007",
   "Views: 6143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI few days ago I posted a report on Intramuscular injecting 2c-b. The results from a 25mg dose were rather overwhelming and somewhat unpleasant.  I tried again with approximately 5mg (my scale only does 100th's of a gram so measured out 10mg and divided it in half). I then set it aside for later.\r\nI started the day with an experiment with an IM injection of mdma. I was listening to a lecture by Nick Sand where he talked about splitting a 120-140mg dose into two halves and injecting them 10 minutes apart. I decided to start small so Injected 50mg. the wave of euphoria was so intense that I waited an hour before doing another 50mg. As the second dose came on I took 300 mics of LSD.\r\nT 4:00  \r\nAfter going for a walk I mixed up the 2c-b shot (5mg) and administered it. There was an abrupt start in bright beautiful visuals. I hadn't gotten any the whole day, it was like hitting an 'on' button. \r\nThe 2c-b intensified the difficult emotional trip I was having. I went into this trip trying to work out some personal issues and this helped me confront the things that terrorize my subconscious.\r\n5mg is much more pleasant than 25mg. I still want to try an even smaller dose, and from a baseline. My muscles feel sore near the injection site. I think I was too blown away the first time to notice the next day.\r\nThis combination lasted a total of 14 hours. it's the next morning  and my serotonin feels a bit depleted. I've decided to take a break from my mind voyages for a little while.\n\n\n"
}
