{
 "title": "Into the Abyss",
 "author": "Fizzog",
 "citation": "   Fizzog. \"Into the Abyss: experience with Ketamine (ID 66870)\". Erowid.org. Dec 12, 2007. erowid.org/exp/66870",
 "substance": "Ketamine",
 "bodyweight": "8 kg",
 "header": [
  [
   "DOSE:",
   "700 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "66870",
   "Male",
   " ",
   "Not Given",
   "Dec 12, 2007",
   "9060",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 700 mgs of ketamine is considered an extremely high dose, see Ketamine Dose Chart] </p><p>My second, and hopefully last, experience with K came only about three days ago, me and a friend had intended to get a quarter ounce of weed, but ended up getting an 8th and a gram of K.</p><p>My first dose, a line about half as long as my finger, and about half as wide, was pleasant, didn't sting too much, and much fun trying to walk and feeling like I was floating. I was giggling at the fact that every time I looked at my friend it was as if he was miles away. The only thing that freaked me out a little bit was that every time I'd do anything, I instantly forget doing it, so I was constantly thinking 'Jesus, what the hell am I doing?'</p><p>The only thing that put my off from the beginning was the god awful taste of it dropping, 'UGH' is about the only word that measures up, although the taste of MDMA (I had tried powder MDMA for the first time earlier that night) tasted really quite repungnant. But, not unpleasant..hmm.</p><p>That dose wore off in about an hour, was left with a sort of confused but positive afterglow, so we smoked some more ghanja and then did a line each, he had dabbled in K a lot in the past and was racking up the lines, so he made mine slightly bigger, I would guess about 2.5 inches long. This is where the fun began.</p><p>I was sitting on the floor, and I felt the mechanical buzzing noise in my ears, which was nice, and then the next thing I knew, I was laying down, and I was shallow in the hole, because I could still speak to my friend, but would then fall back into the hole. At one point, I had the CEV's of one big geometric box, with the most complex mathmatical equations I could have possibly thought were impossible, and then the box split into two, then four, like an ameoba, and ended up splitting faster and faster until there were infinite numbers of these boxes, just stretching out as far as I could..err 'see'.</p><p>At that point they seemed to be sliding across themselves in layers, and I could see all the equations that took place on all of the fault lines where the layers where touching, I came out from my ego death a bit at that point and I remember asking my friend what dimention he was in, but I know that I meant 'What layer are you in?' and he just told me he was in the third dimention. I remember I felt like I was gliding at impossible speed across my carpet, then I was gone again, and I fell into the vast layers of these wierd boxes, which for whatever reason, now had these faces on them. But they were made out of mathmatical sequences. They were not actually conforming to any shape, but I perceived the maths to provide faces, and I remember talking to them. But when I 'spoke' my friends voice was coming out of my mouth, and then I was back in the 'real' world again, and was telling my friend to stop copying me.</p><p>That was the last K hole I went into that night, and I remember just coming down to finding nemo, and it was nice, but I was still a little bit mind mashed the day after. Lying, I was completely and utterly mentally in awe.</p><p>So he left, I smoked a wee bit more, roll on 5pm, I decided I would try a bigger line, because I still had 3/4 gram left, so I racked up what I remember was the length of my middle finger, and about half as fat, thought 'fuck that' and split it into two, got my water, and chugged some to stop the incredibly foul taste of dropping K. This time, it felt like I had been kicked in the face!</p><p>The first thing I remember is picking up the glass, taking a sip and realising that I couldn't feel my mouth at all, then My ears were full of the wierd screamy buzzing and I managed to put the glass down, but, to use the immortal words from fear and loathing 'I knew I was fucked.'</p><p>I remember thinking these exact words 'The louder this buzzing gets, the worse I will puke.' Then I think I must have blacked out completely, because I 'came to' on my bedroom floor just slightly aware of pink floyd playing in the background, and then I went again, although this K hole didn't have any of the stunningly awe inspiring CEV's it was totally mind buggering.</p><p>I remember I was falling backwards, just falling, falling into this glistening blackness, and I was being asked if I was dead, I answered 'Yes, I think so' and then I thought of all I had 'left behind' and I think it made me cry, obviously I couldn't feel the tears, but I think I was crying, but then it went down a very bizzare turn, I felt a moment of this extreme, and I do mean intensely extreme, HATE. The most blood boiling feeling of hate I can possibly imagine. Then I perceived that I was satan, and that I was judging myself into the underworld, but there was no underworld in my CEV'S only this blackness, and I remember saying 'You have thrown away the meaning of the meaning of the meaning of the meaning.' I then switched to and from myself as me and myself as satan, and it was like I was having this conversation, and I was punishing people at the same time, which was weird. I remember then I breathed fire at the human version of me, and I'm pretty sure this is when I puked, because then I was snapped back into full reality and I was standing looking at my mirror, and I tell you, looking at myself, I was seeing the most horrific demon I could have ever imagined, or I was seeing my thoughts as that demon.</p><p>At that point, I remember just saying 'Yes, you are gone now' and I fell forwards into my own puke, but to me it seemed like I was falling in slow motion. Honestly I perceived it to be something like years and years and years and years. I was thinking that I would be sacked from work and that my parents would never find me because I was trapped in between dimensions, and when I hit the floor, I just remember vaguely feeling my forehead touch the floor (vomit, ew) and then I completely slid into  cukooland again. This time it was just black with millions and millions of red lines which seemed to form the structure of the universe. I kept falling down these lines, and then I felt this pulling sensation, like my soul was being ripped out, and at that point I thought I was dead anyway so I let it be ripped out, and then I was looking at the red lines, and seeing every idea that can be conceived just floating down these lines.</p><p>From that point, it seemed like 100's of years just looking at these lines, then I touched one of them, and everything imploded, absolutely everything imploded. Then I was completely and utterly sober, laying in my own vomit, but so, so so so tired. Well not completely sober, still had the lagging vision, but I managed to look at my clock, and I had been in the hole for about 6 hours.</p><p>I am still very much mindfucked from this experience, and I do not intend to repeat it again. Being satan really did change me, it made me value people's worth more, I feel different now, but I also keep seeing the bad in people a lot more, and it's only been three days. To be honest, I'd rather be force fed five hundred liberty caps (mushy season is over!!!!:(:(:(:( boohooo!!!!) than ever touch this shit again.</p><p>It can't be denied that the trip is an incredible experience, but it's not worth it, I would use douglas adams's brilliant literative talent to describe this, as my friend and I both agree that it is like a killer dose of alcohol, so one can compare it to a 'pangalactic gargleblaster' 'The effect of which is like having your brain smashed out by a slice of lemon wrapped around a large, gold brick.'</p>"
}
