{
 "title": "Empty Stomach Blues",
 "author": "Maddoc",
 "citation": "   Maddoc. \"Empty Stomach Blues: experience with Cannabis (ID 6691)\". Erowid.org. Feb 25, 2002. erowid.org/exp/6691",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6691",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2002",
   "Views: 8463",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'm a 17-year-old male user of marijuana who smokes up (usually with a pipe) about every two weeks or so, although sometimes more than that, like in this case. It was the end of the school year and exams were coming up in just two weeks, and I knew that the next week I'd have to stay completely clean in order to pull of 5s on all my AP exams (I am a successful A/B student in 4 AP classes). So I took the week before that to get really, really stoned. I had already smoked up once over the weekend, and sat around having joints with some acquaintances of my friend that afternoon (just 2 joints, passed around). I also hadn't eaten any lunch that day, which I think is the key factor here.</p><p>After all this I bounced over to this guy who keeps us pretty regularly supplied and bought a quarter. My best friend expressed interest in using one of our supplier's large water bongs, and so we packed a bowl and tried 'er out. I had one, read one, humongous hit, but I coughed and then swallowed the entire damn hit into my empty stomach. I don't know how that kind of saturation works, but in a few minutes I was amazingly, freakingly stoned. Everything seemed like cutouts that were overlapping each other constantly, and I quickly became MAJORLY freaked out. I was unable to remember things that happened in the last few seconds, and was scared to be in enclosed spaces or near other people. Colors were amazingly bright and disturbed me; there was also the sort of 'clipping' effect one sometimes gets, like watching a movie clip online, all pixellated and jerky. Talking took so much effort I didn't want to do it at all. I told one of my friends to take me home immediately, which he obligingly did. All my other friends were fine, so I'm pretty sure the weed was too.</p><p>I went home, drank a lot of Ensure (vitamin-drink thing), and slept the entire thing off and was none the worse for wear in a few hours. But it was amazing to me that one fucking hit screwed me up that bad, even after smoking a little beforehand. I'm one of the people in my group with the highest tolerance for large amounts and normally smoke a lot without bad effect, even though I'm so skinny. My theory is that because I hadn't eaten anything, swallowing the water-saturated smoke into an empty stomach caused it to be absorbed a helluva lot faster than normal. My lesson from this is: DON'T SMOKE ON AN EMPTY STOMACH, especially if you have a tendency to swallow. We should all eat when we're hungry, anyway, and this was also a major lesson in how academic pressure can really fuck up my priorities.</p>"
}
