{
 "title": "Hole Opened in my Soul",
 "author": "Psyconaut onE",
 "citation": "   Psyconaut onE. \"Hole Opened in my Soul: experience with Brugmansia (ID 6694)\". Erowid.org. Feb 21, 2002. erowid.org/exp/6694",
 "substance": "Brugmansia",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "4 leaves",
   "oral",
   "Brugmansia"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6694",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2002",
   "Views: 16563",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nTwo nights ago I ate 4 angel's trumpet leaves making the typical 'nothings happening better do more' mistake.  I felt like shit so I went to go to sleep hoping to avoid the wrath of this bitch.  For whatever reason I got out of bed and took a shower.  Then having forgotten I had just taken a shower I took another one.  At which point I was tripping pretty hard.  Im not sure what happened next but everything I did for the rest of the night I did naked.</p><p>Cruised in my house naked WITH MY PARENTS HOME TRYING TO GET ME TO PUT SOMTHING ON.  Tried to put on a pair of pants that gradually turned into a towel.  (it stayed a towel after its transformation)</p><p>I went to the bathroom (very wobbly) and whipped it out to take a pee.  To my surprise (horror if I was sober) my step dad was standing in the shower looking at my cock as a took a pee I started to tell him to go fuck himself in a very loud voice when I realized he had disappeared.  The same thing happened quite a lot I would start talking to people who werent there and then try to figure out what the fuck was going on.</p><p>I went to sleep eventually and thats when shit got hectic I woke up about a thousand times screaming or having a conversation with someone who had just woken me up or seeing some monster or whatever and realizing that it was all a hallucination.  My dreams kept carrying over into my reality when I woke up.  (Too bad I didn't dream about fucking Heidi Klum)  I remember one time I woke up and I could here the moon shooting bright yellow light down on me.  I think it really was there actually.</p><p>The next morning my mom came in to wake me up at about four and explained why I had to get up (I cant remember but it sounded reasonable.)  Then she left my room off to start the car or something, I looked at my clock and at seeing that it was four decided to yell at her to ask why we werent leaving at six.  No answer.  It would have been hard for her to answer in reality because she was sleeping.  Various people kept coming in to wake me up for school until I started to disregard them.</p><p>When my REAL mom came in I explained to her she was just a hallucination and to please leave me alone then, assuming she might take it kind of hard that she wasn't real I tried to explain that I would like her to be real but I had no way of knowing if she was or not.  Her eyes got really big and she gave me a look that had me scared.  No school for me!!) But I couldnt see jack shit all day.</p><p>Today my vision is back and the hole that brugmansia opened up in my soul is healed but FUCK</p><p>DONT EVEN THINK ABOUT TRYING THIS SHIT!!! ##EVER##</p>"
}
