{
 "title": "Boarderline Psychosis",
 "author": "USER X",
 "citation": "   USER X. \"Boarderline Psychosis: experience with DXM & Cannabis (ID 6699)\". Erowid.org. Mar 19, 2002. erowid.org/exp/6699",
 "substance": "DXM & Cannabis",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6699",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 19, 2002",
   "Views: 11860",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI've been experimenting with certain drugs and happened to come across the DXM FAQ, and after weighing out the pluses and negatives i decided to try it. I knew someone in town that had gel caps filled with DXM, but he wasnt sure how much many mg was in each. Since I knew he had already taken one with not too much trouble, I wasnt too worried about it, although I would suggest seeking out a safer alternative. </p><p>At around 7:00 PM, my friend (we'll call him B) and I took the pill with some water. My expectations were high from what I heard and read, but B didn't know exactly what to expect. We had a designated driver, so we decided to cruise around and give it time to kick in. About an hour after taking the pill we smoked about a gram of weed, and in that 10 minute span I went from complete sobriety to complete annialation. I'm positive it was the weed that kicked it in a lot faster than the normal onset would have been. </p><p>We decided to go over to a friends house for a bonfire at about 10 PM, and of course it was pitch dark outside by this time. Well my trip down to the bonfire wasn't too difficult, but as soon as I sat there for a minute I realized I must be in some alternate universe. I could barely understand anyone outside of my own little reality, and trying to talk was useless. It just came out as mumbling nonsense. </p><p>I sat at the fire for what seemed like an eternity, and finally everyone decided to leave for the night. The only problem was it was a long, dark walk to the car and I couldn't function much less find my way up this now seemingly endless maze. With the flashlight at my feet, a friend that had only been smoking bud helped me to the car. By this time it was Midnight, and I was slowly re-entering the Earths atmosphere. B had what sounds to me like an identical experience, and even though we didnt say two words to each other after it started I think just knowing that one another was feeling the same way was comforting. I never felt sick at any point, even when I was experiencing delirium and traveling through oblivion. </p><p>Now in reflection on the experience, I wouldnt have done anything different. I liked the buzz but found that its more of an inner journey than social drug. Looking forward to my next trip with DXM, i'll be sure of the dosage i'm taking and maybe smoke a little more weed. This is an excellent buzz for certain types of people and for others i've heard it described as a 'night from hell'. All I know is I have a new found respect for DXM and whatever you decide to do, APPROACH WITH CAUTION!! This is by no means a kiddie drug.</p><p>Peace  USER X</p>"
}
