{
 "title": "Geometric Insanity",
 "author": "TheGust",
 "citation": "   TheGust. \"Geometric Insanity: experience with Salvia divinorum (level 3 extract) (ID 66994)\". Erowid.org. Sep 12, 2010. erowid.org/exp/66994",
 "substance": "Salvia divinorum (level 3 extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "66994",
   "Male",
   " ",
   "Not Given",
   "Sep 12, 2010",
   "5430",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX</p><p>Let me put this down as best I can remember and describe in words.  It is the next morning, and already the experience seems to be fading from memory</p><p>I had purchased a ½ gram box of Salvia Zone brand salvia from a local head shop.  It was the red box: level 3 of 4.  What they call Visionary Quest.  Although I wanted to buy only level 1 or 2, the guy at the head shop advised me to get level 3, because he didnt think the lesser-infused levels would be potent enough for me to feel anything.  I really should have started with level 1 for my first time as the indications on box advised.  </p><p>I waited till the weekend to try the Salvia alone after my wife had gone to bed.  I went to my home office room, where I have a small couch set up and made preparations for my vision quest.  I carefully measured out the contents of the box into 5 equal doses, and packed a single recommended 1/10th gram dose into the bowl of my newly-built water pipe.  I prepared the room, clearing it of clutter and dimming the lights.  I prepared my mind and spirit by practicing yoga and meditation for one hour.  I had no idea how ill-prepared I truly was for the nightmare which was to follow.</p><p>I sat down on the couch and hit the water pipe with a long, slow, inhalation, consuming the entire bowl in a single hit.  I was just preparing to clear the remaining smoke from the chamber.  This was the last rational thought I had.  Before I knew what had happened, the real world was torn away from me like the proverbial rug from beneath my feat.</p><p>For the next 5 to 10 minutes, I completely lost all perception of who I was, what I was, and where I was.  I was terrified, lost, and confused.  I must have been staring at a corner of the room where the floor or ceiling met the wall.  This defined the nature of my vision, and it was thus:</p><p>The entire universe consisted of a series of interconnected cubes, which rolled/folded/marched their way along through empty space.  Their movement was monotonous, ceaseless, periodic, and never-ending.  Each box met another at the intersection of two of its corners and criss-crossed into the space of the adjoining box like the Xs at the top of this post.  It did this in a way that somehow continued the surface of one cube/room into the next even though the two met at an infinitely tight fold or corner.  I had the impression that all surfaces were somehow made from the same long strip of 2d matter, folded like some sort of crazy origami mobius strip. </p><p>As the rooms marched along, the surface I was on folded from room to room such that I was pushed through the corners and carried with it. Each time this happened, my portion of the room was briefly transferred to the outside of the cubical multi-verse, and I could catch a glimpse of this rolling, folding cube-snake from the outside.  These moments were the scariest, for I could sense the presence of some Being or Force that pushed the whole works along from the outside, and I knew that it would never stop.</p><p>Then I was squeezed back into the interior of the cube-snake through another fold.  This inside-outside loop repeated perhaps a half-dozen times. The best real-world analogy I could give for this is like a folding mobius strip.  When I was a child, I had a toy that consisted of a chain of flat, rectangular wood blocks that were joined by a criss-crossing pair of ribbons.  You could hold the chain by the block at one end with the other end dangling downward and flip over the top block vertically.  This would cause a chain reaction, where each block in turn would flip over from top to bottom until the flat surfaces of each block in the chain were facing the opposite direction.    What I felt in my vision was like this except extended into three dimensions with hollow rooms between folded surfaces.</p><p>Each time I was squeezed through the folds between rooms, the sensation was like that of drowning in solid material. I could feel immense inward pressure distributed evenly across millions of points on my body.  This was the most uncomfortable and frightening part of the trip.  Another disturbing aspect was the repetition of some multi-syllabic word or phrase that echoed over and over in my mind.  Although I dont remember what it was, and I attached no meaning to it at the time, Im pretty sure it was in real English pretty sure.  There was also a vague anti-nostalgic feeling pervasive throughout.  I say anti-nostalgic because it felt vaguely like something from my distant past, but in a very unsettling way.</p><p>During this intense trip, there was only one brief moment I can remember where I had any inkling of what was going on in reality outside my mind.  It was like coming up for air while drowning in bog of viscous psychedelic ooze.  At that moment, I dully realized that I was lying on the floor on my stomach, and propping myself up on my forearms.  I literally gasped out for air.  I had a split-second to wonder what I had gotten myself into before plunging back into the depths of mental delirium.</p><p>The last time I was squeezed through the folds of reality, I must have been starting to come out of the trip, for I had the wherewithal to notice that although I was drowning into the folds of the cubes, I was still able to breathe.  I found this somewhat comforting, and clutched at something soft and skin-like.  This marked the end of my trip, for I realized that I was standing half-crouched in my office and clutching the end of my yoga mat in both hands.  I put it down and went over to the couch, where I laid down and began finally to relax.</p>"
}
