{
 "title": "Gave Me PTSD",
 "author": "ArmyofDavid",
 "citation": "   ArmyofDavid. \"Gave Me PTSD: experience with Salvia divinorum (80x extract) (ID 67000)\". Erowid.org. Sep 12, 2010. erowid.org/exp/67000",
 "substance": "Salvia divinorum (80x extract)",
 "bodyweight": "202 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "67000",
   "Male",
   " ",
   "Not Given",
   "Sep 12, 2010",
   "Views: 64085",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So after a little reading and a few videos of people 'tripping' on salvia, I decided to try it out. My sister and I went to the headshop and bought a can of 'sticky purple 80x' and a glass bong. Now, I've done well into 500 hits of acid, more than 20 lbs of reefer and more than my fair share of opium. Doing this was just something to do for shits and giggles. So, after getting back to my house we went out to my garage and prepared to try out a product that I expected to do little to nothing. </p><p>I packed my glass bong with ice and loaded a bowl as tight as I could get it. My sister being a little more hesitant than I said I should go first. I told her if I was going first, I'm cashing my bowl and she could reload. So, thats how it went.</p><p>I put the bong up to my mouth and took a rather large hit. I felt a sensation going over my body that no word could describe. It was like the first time I had sex mixed with the first time I broke a law. It felt good and terrible at the same time. I exhaled and quickly took another hoping for the pure joy being masked by terror would go. A few seconds into holding that hit in, I couldn't feel my legs. It was alarming, but I figured I had been this far down the rabit hole, I may as well 'meet Alice'. I blew out the hit and noticed it had an orange tone to it. I slowly took my last hit and drew it deep and large. I felt a large pop in my existance.</p><p>You may be wondering at this point what I mean by 'pop' but, as best I could explain it, it was like my soul was being pealed from my body like one peice of bread from another on a toast cheese sandwich.</p><p>Suddenly I'm in another world. I no longer existed, I was part of something much larger. I can't explain what that larger was, but I hated it. It was painful and trying to rip me apart. I was part of it, this large mass of vibrant colors. It was trying to tear me up and mix me into whatever it was. Much like taking 20 peices of chewed up gum and mixing them all together. I was only one color but the other colors were trying to make us one by destroying the singular forms. I could verbalize my thoughts and I said in this world 'What kind of cruel fucker does this? I was just born and now I'm going to be torn into peices? Are you fuckin kidding me?'</p><p>I tried to think of who I was, but I knew I wasn't a 'he' anymore and more of an 'it'. I had the thought 'if I can make it a few more minutes, help will be here to remove me from this mass that I'm a part of. Slowly the mass dissolved and I could see a face. I didn't recognize the face because it wasn't attached to anything. It was just a floating face. The face said 'Do I need to call an ambulance? Say something, for christ sake say something' I verbalized without thinking or trying 'Im back'. Minutes later after being helped to my feet I still couldn't figure out where I was at, but I did understand that my wife and sister where both very worried about something.</p><p>I finally figured out a few more minutes later that I was in my garage and with my wife and sister. I knew I had gone somewhere and what had happened there, but no understanding of exactly where that 'somewhere' was.</p><p>I decided I need to leave the 'crime scene' right now. So, we went outside on my deck and sat and smoked. The rain started but my head still wasn't there. Realizing I'm sweating like a pig somehow I understood that my sister was getting covered by my presperations and I was embarrassed by it, but could stop it. I couldn't stay outside either. I decided I'd go to my room for a bit and relax. after laying down on my couch and watching about a half hour of whatever weird shit was on my tv, I went down stairs able to speak of the world I went to. </p><p>After months of thought, and reading I've noticed the similarities between my trip and a near death experience to hell. My life really did change that day. I stopped smoking, started excercising, changed my diet, dropped 15 lbs and I'm in the best physical shape of my life. But, I'm also on xanax to help with the anxiety at night I feel thinking of that hell I was in. My physician said I have 'Post traumatic stress disorder' even though she has no knowledge of the trip I took. Its been 5 months and I'm still not feeling perfectly mentally healthy.</p><p>I've taken double dipped double wide acid, smoked a bowl of opium and some reefer in one sitting and had a 'bad' trip, but nothing like the Salvia. Salvia was the worst experience I've ever had in my life. Some people have reported good trips, and good for them. But, if I had a 1 in 99 chance of tripping like that again, I wouldn't take it. I felt like killing myself while I was comming down after seeing in to hell. I'd never had a thought like that before or after.</p>"
}
