{
 "title": "A Different Sort of Extraction",
 "author": "Lekt",
 "citation": "   Lekt. \"A Different Sort of Extraction: experience with Cannabis - Hash (ID 67027)\". Erowid.org. Nov 26, 2010. erowid.org/exp/67027",
 "substance": "Cannabis - Hash",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis - Hash",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67027",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 26, 2010",
   "Views: 10269",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The Prologue</p><p>A couple of months back, I upgraded from a Vapor Brothers vaporizer to a Volcano: The king of smoking devices.  Amongst its many incredible advantages, the Volcano makes it quite easy to save the weed I have already smoked as it vaporizes so evenly.  This duff, as it seems to be referred to colloquially, is still rather potent.  An ounce makes a batch of brownies that are highly narcotic and as strong as those made with any ounce of mids.  Having baked repeatedly, however, I became somewhat bored with these delicacies, and decided to try my hand at something more interesting.  Being a chemist, I decided to forge ground on a different sort of hash oil extraction:</p><p>The Extraction</p><p>I powdered 31.75 g of duff (primarily from good outdoors and headies) using a coffee grinder.  This was placed in a 1 L Erlenmeyer flask and covered with hexanes so as to be completely submerged.  Butanes are seemingly the gold standard of organic solvents for the hash-oil extraction.  Aside from having a much higher boiling point, hexanes are nearly identical in their solvent character and, as a liquid at room temperature, are far easier to work with.  They are dirt cheap and their main disadvantage is that it requires more work to assure that you have boiled off the toxic solvent.  The mixture was brought to a boil with a heat-gun.  It was then filtered through a fritted Buchner funnel.  The remaining solid was extracted twice more in the same fashion.  The last extraction pulled little material out (if color is any indication) and the organic matter was discarded.  What remained was a dark green hexanes mixture (approx. 0.75 liters).</p><p>Thinking for a moment, I decided that a little more purification was in order.  I spread a 1 cm layer of silica gel on the fritted filter and covered that with 2 cm activated charcoal.  A second layer of silica gel was placed on top, and my mixture was filtered.  I washed the filter with hexanes until the solution running out was colorless.  The resulting liquid was neon orange, and was set aside.  I termed this the first cut.</p><p>I figured there was a strong possibility more material remained in the filter, so I washed the filter again, this time with a more polar solvent: Ethyl acetate.  A great deal of colored solution was produced as a result: This time, a deep brown.  This was termed the second cut.</p><p>The two cuts were placed in different round bottoms and rotovaped.  A white, fiber-like precipitate began to crash out of the first cut, so it was cooled to -25 degrees Celsius and filtered through a normal paper filter.  It was rotovaped down and both cuts were pumped under a vacuum for several hours.  The first cut was an orange, transparent oil, yield: 0.3 grams.  The second cut was a tar-like, dark-brown oil, yield: 2.0 grams.</p><p>The Tests:</p><p>Being in a 50 mL round bottom, the first cut was tested by heating the bottom of the flask with a lighter.  The oil vaporized after only a short period of time, and it was inhaled through a piece of tubing.  The stuff is remarkably potent.  A serious pothead (how else does one accrue 30 grams of vaporized headies in a month?), several puffs were all that it took to get me very high.  The high is clear but relatively overwhelming.  Unfortunately, it is also very one-dimensional, like street-grade hash:  Sure it fucks you up, but there is little to appreciate by way of complexities, such those of good marijuana.  That said, it does the job: That third of a gram got me perhaps 10-15 uses.</p><p>The second cut most closely approximated the look of hash oil Ive seen on the internet.  This stuff was so tarry that I had no desire to apply indirect heat to it and smoke it straight.  Instead, we spread about a quarter gram on a blunt wrap with some decent sensimilla.  The first time we tried this method, the blunt was shared amongst five seasoned smokers.  The blunt had to be set down halfway through: The high was enormous.  Coupled with the marijuana, there was no feeling of a lack in quality, it was simply a bang-up blunt.  This stuff, if only due to its consistency and the much greater substance that resulted, pleased me much more than the bewildering first cut which I assume was just about pure THC.  It should be noted that in both cases it felt as though my lungs were coated with the stuff.  I got a bit of a smokers cough, and my daily runs became a bit of a burden, even a day or two after having abstained from any sort of smoking.</p><p>Conclusions:</p><p>The method is an extremely effective and interesting way to produce a secondary marijuana product with weed that would otherwise just be tossed in the trash.  The product is far more fulfilling (not to mention more fun to produce) than the mountains of brownies one might otherwise yield from the ounce of duff, but of course requires access to a chemistry lab.  The next step will be to do a GC/MS to assess purity, and perhaps give a whirl at the infamous THC-acetate synthesis.</p>"
}
