{
 "title": "Behold, the Psychedelic Power of Cannabis",
 "author": "DDsd",
 "citation": "   DDsd. \"Behold, the Psychedelic Power of Cannabis: experience with Cannabis (ID 67023)\". Erowid.org. Jun 6, 2013. erowid.org/exp/67023",
 "substance": "Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67023",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 6, 2013",
   "Views: 1237",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I feel that I must submit my recent experiences of the past couple of weeks with cannabis as they are truly profound, surprisingly intense, and mindbogglingly psychedelic. As a side-note, I have been smoking weed for a little over a year and a half and it has always been good to me. I've had some trippy highs, many intense highs, but nothing at all like what I've been experiencing as of late. I must also mention that about 2 months ago I had my first and only experience with psilocybin mushrooms - this remains my only real experience with a 'real' all-out psychedelic, barring some half-failed attempts at breaking through on Salvia. I mention the mushroom experience because I'm certain it must have had some effect on my cannabis highs, a theory backed up by just how high I have been getting recently.</p><p>It all started when I bought a gram of some 'Sour Diesel Kush' from my friend A, after once or twice of smoking it out of his bong with him and chilling at his place. What's odd about this is that it was only when I brought the weed home and smoked it by myself (from an apple pipe!) that I had my mind truly blown. It was a normal Thursday night, and like usual I made two perpendicular incisions into a nice crisp green apple, and proceeded to pack the top/bowl with bud. For the past few weeks I had been smoking weed that was average at best, so I was surely about to have a different experience, if you will. I packed what I guess was a decent sized bowl of this Sour Diesel Kush, went out back and lit up. I coughed immediately from the smoke, which has to be easily the harshest I've ever inhaled. I had to take a few moments to recover and take the second hit. I think I took two or so more nice hits before the bowl was either cashed or the weed had shrunk down into the center of the apple, rendering it almost unreachable by flame without practically burning my throat.</p><p>Upon coming back inside to the kitchen to dispose of the apple and have a drink of water, I realized I was already on my way to being very stoned. Random, quirky thoughts popped into my head as I filled up a glass of water, things I can't even recall but surely made no sense, as if I was having an imaginary conversation with someone that doesn't exist. Now, when I went to my bedroom to lay back and watch TV, the real high started. I gazed in awe, that familiar open-mouthed stoned look, at the television set, which seemed unreal. Unreal is the only word I can use to describe it, it was simply strange. It looked as if it was stretching apart at the seams or something. I laughed uncontrollably at Conan O' Brien as he made jokes while interviewing some dumb guest.</p><p>My head was pulsating strongly, and at the same time felt like all of it was on fire. I couldn't see my cheeks but suspected they were rosy red in color. I instinctively layed down on my bed on the opposite side with my feet by the pillow, and for some reason closed my eyes. I began to encounter a wordly array of images, feelings, scenarios, people, creatures, colors, and combinations thereof. This has happened every time I have smoked this weed since, and is beyond words because of its bizarre nature (and because much of it is later unrecovered by my best memory), but I will attempt to describe it all.</p><p>One of the first images beaming into my headspace with eyes closed was some kind of frightening storybook creature, blue and gruff, with big brows and leering eyes. The thing was a giant, peering past a tree into a deserted landscape of country lanes surrounded by picket fences on each side. Images like these would appear, and then disappear not long after, though if I thought of them specifically again, surely enough they would make a return.</p><p>As I began to peak and peak, more odd things appeared in my mind's eye. Even when I opened my eyes, I could still sense them, as if my third eye was beaming them out like from a projector. One of the more prominent images and recurring themes during the experience was this repeating image of some sort of 1990s kid's toy commercial. Often times I would see a cartoonish, vivid image like the storybook creature described above, and then everything would pan out as if a camera and I would see some outtake of a 90s-looking commercial with kids, filmed against a green screen or all-white background in some studio somewhere. It was not just an empty image, but also strongly tied to my memories of sitting home as a 7 or 8 year old, watching Nickelodeon and Disney, and all the cheesy ads that came with it.</p><p>More visions ensued. I clearly remember witnessing an oddball combination of a red pepper merging into a teapot, a lavish English one painted purple and white. Another image was that of a symmetrical Tudor-style house, but somehow constructed of retro skateboarding shoes and skateboards. Again, I would analyze this, and conclude it comes from memories of my neighborhood in New York, with all the Tudor houses that looked so much like the one in my vision. Moreso, I skateboarded as an adolescent for several years, and the skate shoes reminded me clearly of ones I used to wear. It is in this way that these images were/are so striking, as they seem to be a true manifestation of my subconscious, my memories, feelings, thoughts, combined with every image or color or creation I've ever seen in my life.</p><p>Some of these visions and images I saw with closed eyes were downright cartoonish, such as claymation-like figures moving about. Some of them probed the memory, such as repeated images of an old computer desktop screen my sister had back in the day, which I used a lot. Some were startlingly complex and intricate, easily rivaling the geometric patterns I witnessed on 1/8th of mushrooms. But all these were brief, no matter how vivid or amazing or psychedelic they were in fact. The high from this particular strain is fairly short, as well.</p><p>Overall, I think I've learned that cannabis is or at least can be a true psychedelic. I'd say it's a real probe of the inner subconscious - it can tell you a lot about yourself, past, present and future, when you examine these visions.</p>"
}
