{
 "title": "Intentional Overdose: Caveman in a Futuristic City",
 "author": "Radioethiopia",
 "citation": "   Radioethiopia. \"Intentional Overdose: Caveman in a Futuristic City: experience with DOC & Alcohol (ID 67058)\". Erowid.org. Sep 22, 2010. erowid.org/exp/67058",
 "substance": "DOC & Alcohol",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "12 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "12 mg",
   "oral",
   "DOC"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67058",
   "Male",
   " ",
   "Age at time of experience: 29",
   "Sep 22, 2010",
   "Views: 5706",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 12 mgs of DOC is considered an extremely high dose, see DOC Dose Chart]</p><p>Brief backstory: I have subjected myself to over one hundred hallucinogenic experiences, most frequently on LSD, psilocybin mushrooms, and 2C-E. I have also done (among other things) 2C-B once, 4-HO-DIPT twice, and DOC five times. I have experimented with every other class of drug imaginable, and all methods of administering said drugs to my body, to the degree that I would consider myself a meth addict, although I have been eliminating speed from my life for some time, with increasing success. Some of this experience has been harrowing, some enriching, and much of it neutral. All of it has been overwhelmingly selfish. I am 29 years old, male, white, and relatively poor (by North American standards). I have been wanting to submit experience reports to this site for several years; after my experience on DOC recently, my swelling ambition overcame my laziness.</p><p>About DOC: From my perspective on, DOC is exceptionally potent, as hallucinogens go; 3-4mg is a recommendable dose for an intense trip. What I have done, reiterated herein, is unquestionably foolish, selfish, and possibly physically harmful.</p><p>The dose: Arriving home after a few after-work beers/games of pool, I felt a sense of dissatisfaction with the state of things in my life. On a drunken impulse, I ingested some DOC I had been saving in a small baggie for months. It had originally been 24mg, but I had smoked a small amount - less than half - with a friend a few months ago (side note: vaporizing DOC worked, but requires a 'oil burner', or meth pipe, for efficacy; regardless, the dose is much higher when smoked and the duration of effect is substantially shorter), so the contents were diminished, though at least 12mg. I ate all the DOC directly from the plastic bag, and within an hour, began a walk to a friend's house to 'lose myself' - about 3 or 4 miles, through rough neighborhoods. I am not sure of the time, but by later corroboration of my roommates, it was no later than 1:30 A.M. I was inebriated, on at least 12 beers, when I began walking, so I may have too distracted to notice the onset of the drug. After traversing about two miles, my memory fails for some time...</p><p>The trip: The first experience I remember after the the 'blackout' is trying to figure out where I was, who I was, and what was happening around me. I remember a swelling groan of static across the spectrum of senses punctuated by flashes of swirling light and sound that seemed to cut through my body. I eventually realized I was sitting on the side of a street, on a curb, and that cars were passing occasionally. At one point, a car passed and the driver threw out a cigarette butt. I mentally froze the scene in its occurrence and observed the driver's face and the butt frozen in midair from all angles for sometime before realizing that I was somehow doing this, and 'letting it go'. As soon as I did, the car passed on. I am still shaken by the apparent, yet physically impossible reality of this image. Everything else from this time is nonsensical, at least in memory.</p><p>At some point I realized this was not normal. This sounds like a weird statement, but my disorientation was so seemingly sudden, and of such magnitude, that it had not yet occurred to me to be mystified by what was happening, nor question it. As I began to ponder my predicament, without the aid of memory or identity, I first assumed I was laying on the side of the road after a horrible car accident or head trauma. I tried to glance around for pieces of glass, or an overturned vehicle, but I could not control my eyes. Every object I could focus on, in a manner of speaking, seemed to be melting into neon dust under a blistering wind that I could hear, feel and taste...I wondered if I was dead. All of this must have been a slow process, as it became dawn at some point. Alot of my mental processes that I can remember are terrifying non-linear gibberish for long periods of time. By dawn I had regained at least a general sense of who I was and what I had done to myself. People had passed my on the street as I was curled up muttering in the gutter, but I could not bring myself to attempt interaction. Every time I stood up and walked a few steps, my surroundings were so distorted I couldn't bear the stimulation, let alone figure out where I was.</p><p>At least four hours in: An old model truck pulled up, loud loud engine, with a rough looking driver asking if I knew where I was or needed a ride. I got in, unable to reply beyond monosyllabic yelps and hand gestures at first; soon after engaging myself in conversation, my vocabulary, and much more, came back to me. I recalled an intersection close to my friend's house by name to this good samaritan. As it turns out I had walked at least half a mile past my target. On the way, the driver told me he had been watching me for a while, and I looked like I was 'having a real bad time'. I was. He dropped me off at the intersection; I knew this street well enough to know my friend's house, four houses down on the right side. </p><p>Upon reaching the house, I removed my boots and laid in her backyard hammock for minutes that felt eternal, unable to raise anyone to assist me, though I was embarrassed, and did not try very hard. I drank copious amounts of water from a garden hose. I required a restroom. The hallucinations I experienced, still with all my senses simultaneously, were alternately terrifying and enlightening, but I could not hang on to any one idea or emotion. It seems fruitless to go into the details here; like all tripping, you would have had to been there, and been me, on that. I would not call it fun. I also knew I had to begin the long walk home soon, through a perpetually twisting garish cityscape.</p><p>At least seven hours in: The walk home was what nightmares are made of. My mouth was gummy and tasted of cigarette rot and medicine. I had lost my socks and my feet seemed to be bleeding (they were not, only blistered). I had lost my hat and keys and some money. I was afraid to cross major intersections until all the cars were gone, because I could not accurately gauge the speed of them or myself - everything was moving. I had a recurring image of cavemen transported in time to a futuristic city, lost and confused. I also remember being comforted that this was a coherent image - sensible even, so I must be 'getting better'.</p><p>Upon arriving home - my roommate, awake for school, has told me it was between nine and ten in the A.M. - I used the restroom, fumbled around in a quick cold shower (bad experience), and found some soft old painter's pants to wear. I asked him to play music, but could not remember what I liked. He played My Morning Jacket's 'At Dawn' and the only part I remember is the first minute or so... As soon as the vocals began I entered an intensely colored tunnel filled with double helix patterns of glowing dots. I ate the dots, and remember very little after that for quite some time. It was my day off, thankfully, and I was alone in the house for hours. I was not scared most of the time, as I was so grateful to be home (where I had ironically been so dissatisfied and ungrateful less than an hour earlier).</p><p>The last half: Most of my day is irretrievable in concrete detail, but I remember being unable to withstand the onslaught of any visual or auditory stimulation until six or seven P.M. I laid on the couch in silence, fed myself fruit and water as I was able, and tried to remain centered. I remember being content to experience the rest of what I had done to myself, but do not wish to digress into the specifics of such, which are surprisingly brief. Every time a cat moved, the motion sent audible ripples through the air accompanied by reverberations in my muscles and nerves. An ice cream truck lingered around my block for a torturous duration. Guilt or joy or paranoia would come with every observation, all equally unsettling, but not to the point of a breakdown. At this point I was in vaguely familiar territory - I have taken too much DOC before.</p><p>In retrospect: I cannot conscientiously recommend this substance at this dosage. I did this to myself and I regret it. By all rights, I should have been taken to a hospital, if not police custody.</p><p>Aftereffects: My vision is still blurred, days later. I am mildly spastic, and somewhat scattered, but all seems to be subsiding. My roommates and family have been patient with my selfish mistake, and I am going to work tomorrow. What more could I want right now. I may never understand things to my satisfaction, but to ponder how much more confused, alone, sad and terrified I could be...many in the world are, with no end coming. There were amazing things somewhere in there, but the same can be said of a controllable experience had on a lesser dose and/or milder substance (I highly enjoy 2C-E) in a safe setting with no responsibilities subsequently rejected in the process. I am not going to do this again.</p>"
}
