{
 "title": "Beauty is Soul",
 "author": "Hyperion",
 "citation": "   Hyperion. \"Beauty is Soul: experience with Salvia divinorum (6x extract) (ID 6707)\". Erowid.org. Feb 21, 2002. erowid.org/exp/6707",
 "substance": "Salvia divinorum (6x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)",
   "  T+ 0:30",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 6x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6707",
   "Male",
   " ",
   "Not Given",
   "Feb 21, 2002",
   "15060",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had finally obtained a new water pipe as well as some powerful enhanced Salvia Divinorum leaf.  It was a friday night and I was eager to try the Salvia, so I turned out all the lights (finding darkness preferable), filled the bowl and put on some Crystal Method (my favorite trip music).  Unfortunately I had not smoked Salvia for some time and was not used to the smoke, so I was unable to inhale as much I should have, and the trip was interesting but little to write home about.  It was when I filled up the bowl again that things became interesting.</p><p>I decided to play Pachelbel's Canon, and see how this would affect the trip.  It is an incredibly beautiful piece of music, and I cannot stress how important music is to psychedelic experiences, especially with a substance as easy to work with and as malleable as I find Salvia to be.  To me music is an important part of my life, and the contribution that Canon made to the setting cannot be underemphasized.  It is not 'trippy' music, but as I said, it is incredibly beautiful.  I smoked the bowl of Salvia and just barely managed to put down the pipe before it took hold.</p><p>I saw people standing in front of me, and one of them was pushing something into my head, and I could feel it piercing my skull.  He continued until it was all the way in, and then the people vanished, and I was floating in black space above my head, and I realized that I was probably going to go back into my body at some point, and I thought this was a pity, because it was so sad that in this space I could be anybody, but soon I would be me again, and I realized that I did not want to be me.  After floating in this netherspace for a while, I somehow re-entered my body, and I thought this was where the trip would end.</p><p>Instead it was where it became interesting.  Up until now it had been a rather normal trip, enjoyable, different, but nothing special.  I opened my eyes and was back in reality, but when I rested my head in my hands (covering my eyes) I saw the most beauiful sight I have ever seen in my life, some sort of forest scene, totally in tune with nature, devoid of the ravages of man, and I felt so thankful to be able to witness this beauty, and I heard a voice whisper in my ear: 'You're Welcome.'</p><p>Eventually it faded, and as I sat there listening to the music, I realized how beautiful everything was, and I saw my soul, like clear glass, and inside it was everything that was beautiful in the world, and a phrase hit me: 'Beauty is Soul and Soul is Beauty.'  I hurried over to my computer and just wrote down a string of consciousness about the beauty of everything.  I remembered a quote I'd heard on a Salvia trip weeks before (said by a spirit guide when I asked who he was): 'The question is not what am I, the question is, what are you?' and realized how important that was, how in order to find beauty in the world, we must first look inside ourselves.</p><p>I took more from this experience than a few trippy visuals.  I experienced more from this trip after I came down than I have from any other source in my life.  I know it sounds odd, but I truly feel that I learned something important, a secret that stays secret in its obviousness.  Afterwards I went outside and looked around at the plants, the trees, the buildings, the people, and I realized that they were all beautiful.</p><p>I saw a cockroach and stared at it, pondering whether or not a cockroach had a soul.  Before this, I had always thought that the randomness of life was one cruel joke, and had been very into the Buddhist philosophy that life was suffering, but now I see that the act of existence is beautiful.  I understand that this is an extremely long report, but I felt that it was necessary to explain the totality of the experience, because it was more than a hallucination, it was truly an entheonation, contact with the divine within.</p><p>I leave you with my tripped out prose, with all its misspellings included (keep in mind I wrote this in one mad rush while still under the influence)...</p><p>'Beuty is soul and soul is beuaty beuaty is you and what is inside you listen to the beauty it is there it is beautiful when it is itself and then it is wonderful unpolluted soul is the essence of being and is inside of each of uis and the beautious rapture exists when we can find it and allow it to exist unspoiled and natural</p><p>Beauty is the acceptance and total all consuming joy that is each and every one of us and it is only through understanding that we find this beauty, we contorl it and we live it beacse we are it, that is the secret, the secret is us, because the secret is that we are the beauty in the world, THE QUESTION IS NOT WHAT AM I BUT WHAT ARE YOU?????????  DOn't you understand, that is the question, and each of us must answer it!</p><p>Exploration of the world can only come when we have fully explored ourselves, for there is so much more beauty inside even the worst person than there is in money or sex or drugs or anything else.  Beauty is us, and we are beauty and joy is knowing your soul and seeing it and being able to see through it when it is as clear ands pure as glass, spun glass containing all that is wonderful and good in the world.</p><p>Each of us is wonderful, in everything we do but most importantly in the fact that we are, we existing, and that simple existance is beautiful, it is a cosmic accident, a simple random occurrence, and yet, that randomness itself is beauty, just because a diamion is an accidental crystallization of carbopn does not change its beauty, so just as we are an accident in the cosmos, oops, a few srands of DNA got togehter and formed life, and billions of years later, us, this accident does not maek us less beautiful, for existance is wonder and that very existence must be celebrated lest we lose sight of it.</p><p>Do not fear to see yourself for what you are is wonderful, that fragile existence is wonderful, each breath taken, each thought composed, each and every time you look up at the stars, each time you take a step, that ability, that existence, that is so wonderful and we take it for granted.  Don't wonder how you will die, wonder how you will live, and manage your life accordingly.  Wonder what new things will happen every day, wonder what beauty you will find today, wonder what new beauty MUST be out there that you have not yet found!</p><p>Every sight of beauty brings the realization that there is so much more there, so much more that we haven't seen, yet how beautiful is what we have so far.  A few molecules dance, and we have life, the more complex the dance, the more beauty we find in its rhythms, each step of that cosmic dance is intricate beauty, and each thought we have is a part of that, we have the ability to find beauty, and we can start by looking inside ourselves.'</p>"
}
