{
 "title": "Reading In The Sun",
 "author": "Charliegibbons",
 "citation": "   Charliegibbons. \"Reading In The Sun: experience with Leonotis leonurus (ID 67071)\". Erowid.org. Feb 22, 2008. erowid.org/exp/67071",
 "substance": "Leonotis leonurus",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Leonotis leonurus",
   "(flowers)",
   " ",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   " ",
   "100 mg",
   "oral",
   "Caffeine",
   " ",
   " ",
   "  ",
   " ",
   "Valerian",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67071",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 22, 2008",
   "Views: 18509",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis summer, after researching it, but with low expectations of effects, I ordered several ounces of Wild Dagga flowers from an online source.\r\nUpon arrival: the flowers have a slight odor, but subtle...like, a really faint mix of earth and lemon.  They look very bright and fresh, and are quite fuzzy and prickly.\r\n3 P.M. \r\nSubject is a moderately heavy smoker (just under a pack a day), 3-5 time a week cannabis user, and weekend drinker, but fairly physically fit.   Subject had a full stomach, had consumed roughly 100 mg of caffeine about 3 hours before, and had smoked 3 cigarettes since awakening.\r\nI proceeded to take a walk out in the woods (where I always go to try new herbs), and loaded up a clean, fresh pipe with no thc resin in it whatsoever.  I lit it and slowly drew in a heavy lungful.  The smoke is VERY thick, and smells like a bonfire, but for some reason, isn't too incredibly harsh on the throat. I end up smoking the entire bowl fairly quickly, and lighting up a cigarette.\r\nT + 5 minutes- Starting to feel a little lightheaded, the same 'head space' cannabis gives me.  AND the euphoria of cannabis. But comparisons end there.  My mind is clear and grounded, and my thoughts are focused.  I feel very content and relaxed, but not 'impaired'.  \r\nT + 10 minutes- Walking back to my house,feeling a bit more tired now...much more potent than I had expected (remember, however, I had VERY low expectations...I was expecting an effect like I've gotten from blue and white lotuses, wild lettuce, damiana, kratom, etc....in other words, no effect at all.)\r\nT+ 15 minutes-effects are gently dissipating, and I'm comfortable and relaxed laying in the hammock, reading in the sun.  \r\nSince this first time, I've come to use Wild Dagga pretty much daily.  I have anxiety problems, and dagga seems to calm my nerves, especially along with valerian root.  The only downsides to this wonderful plant, from what I can see, are \r\nA: Smoking it is probably not very good for the body, and\r\nB: Even though Wild Dagga tea is good and effective(lasts longer), in my experiences, it takes a significantly larger amound of Wild Dagga to make a tea that is potent enough.  For this reason, I intend on growing and harvesting some of my own plants next season, to cut down on costs (and, of course, to enjoy the fruits of my own labor).\n\n\n"
}
