{
 "title": "The Whole Scoop",
 "author": "Marmot",
 "citation": "   Marmot. \"The Whole Scoop: experience with Methocarbamol (ID 67090)\". Erowid.org. Feb 11, 2008. erowid.org/exp/67090",
 "substance": "Methocarbamol",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Methocarbamol",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Methocarbamol",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67090",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 11, 2008",
   "Views: 97330",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recreational Usage</p><p>There is no high to be found in this drug.  It works wonders when high dosing for tense, spasming, or knotted muscles.  At dosages far exceeding the recommended dosage a disassociated stupor ensues of varying degrees.  I enjoy having a beer or two with it, avoid excess booze though.</p><p>WARNING  At my highest single dosage, read last experience below, I/my mind panicked when it felt that my involuntary functions (heart rate, breathing) decrease and potentially falter.</p><p>Personal Experience</p><p>Good</p><p>4 grams (8 500 mg pills) by me  Produced an hour long peak sedentary state where my mind was reduced to observation.  For me when on this dosage it is possible to move about, maintain a conversation, or follow the plot of a show, move.  After the peak hour there is a coming down time of a couple hours.  I regained motivation and was able to complete simple tasks with less effectiveness.  After several hours there are no remaining effects either wanted or bad (no hangover/crash).  For dosages in this spectrum I tend to like hottubbing (avoid at higher dosages due to potencial risk of drowning) or playing fetch and combing my dog.</p><p>Good</p><p>9 grams (18 500 mg pills) spread out over 2 hours by me  Produced 3-4 hours of intense, near catatonic, state.  I was not able to walk let alone even raise the motivation or coordination to scratch my face.  My mental functions were reduced to either watching the world go round or listening to an internal dialogue in slowmo.  When under dosages this high I like to plan it out ahead of time. And make sure I have several hours to dedicate to it.  I watch TV that is visually appealing (finding nemo is a fav) or start a controlled campfire out on my property and watch the sun go down.</p><p>Bad</p><p>5 grams taken over the course of half an hour by my girlfriend, 120 lb- She at first didnt feel any effects, thus she decided to increase the dosage.  Within an hour of final pill consumption she was a wreck: completely disassociated, little coordination, nauseous, heavy fatigue.  She spent the next 4 hours lying on the bathroom floor and booting into the tub.  She swears to never go near the substance again and doesnt know how I consume larger quantities and feel fine and even enjoy it.</p><p>BAD</p><p>7.5 grams (15 500 pills) parachuted (ground up and wrapped in a small square of tissue so as to have an expedited release into the blood stream once in the stomach) at once by me  An hour long very intense period of conscious sedation verging on what you might expect from a coma patient.  Throughout this hour I had to work hard to maintain consciousness, similar to when way over-opiated and one does sitting headbobbing of nearly passing out and jerking back into consciousness.  Also felt on the verge of an overdose.  Had a feeling that if I vomited my muscle contraction would be unable to expel the puke beyond my mouth and result in potentially downing.  Also, could have be panic-induced imagination, but I felt that my body would no longer breath for me and I had to consciously breath in and out through volition.  Also maybe imaginary, I think I could feel my heart flutter.  Within an hour the intensity wore off and I was back in control.  Personally, due to this awful experience, my recreational usage will never extend beyond 5 grams in an hour.</p>"
}
