{
 "title": "Chronic Euphoria Syndrome",
 "author": "Trama Dude",
 "citation": "   Trama Dude. \"Chronic Euphoria Syndrome: experience with Tramadol (ID 67121)\". Erowid.org. Jan 18, 2008. erowid.org/exp/67121",
 "substance": "Tramadol",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67121",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2008",
   "Views: 9488",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBackground: I am a 43 year old male.  I grew up in Northern California in the 70's and 80's near SF.  Needless to say, I had access to a whole cornucopia of substances in that place at that time, including many of Mr. Shulgins substances, especially DOB.  Drugs of choice remain marijuana and pharmaceutical opiates.\r\nCurrent Experience:  In 2006 I began to experience severe and disabling lower back pain.  Much to my relief, my doctor gave me a generous prescription of Oxycontin 40mg.  Over the following year, I underwent a 3-level spine fusion surgery, and developed a serious dependence on the Oxy.  My MD noticed this and encouraged me to taper off of the Oxy and begin taking a new medication called Tramadol.  He told me that it gave the same level of pain relief as opiates, without the physical dependence and tolerance.  So, I didn't have much hope that it would be a recreational drug and after a 3 month withdrawal from the Oxy, I began using Tramadol exclusively.\r\nWow! I'm dumbfounded.  I can't find words to describe this stuff other that Chronic Euphoria Syndrome.  While this will give me a good mellow opiate high, the high doses are usually accompanied by negative side effects, i.e. nausea, dizziness, itching, and insomnia.  Well, it is not that type of drug.  On the first dose, it comes on very slowly (1-2hrs) and lasts 6-10 hours. \r\nI do not use Tramadol as a high-dose one-time high, it's not good that way.  However, Tramadol does provide me with the most awesome perpetual mild high you can imagine. Basically, I only take 100-250mg twice a day.  In this manner I experience a very satisfying sense of well-being, mild euphoria, nice energy boost, no nods, no negative side effects, and the feeling is continuous.  I am able enjoy its effects at will.  If I am up and active, I experience a nice energy boost similar to a small bump of Meth.  If I am engrossed in something mentally stimulating, I experience an enhanced ability to concentrate and focus.  However, if I desire its euphoric effects, I just relax in a comfortable chair or lie down and a nice comfortable wave of euphoria washes over me.  I seem to be able to control the effects I experience at will.  No tolerance as of this writing.\r\nTramadol is quite possibly the 'perfect drug' for those desiring the effects I have described above.  The title that I gave this post says it all.  It's like walking around with a cozy fluffy blanket around me that you can put on or take off as I wish.\n\n\n"
}
