{
 "title": "Jarring Juxtaposition",
 "author": "T. Everscape",
 "citation": "   T. Everscape. \"Jarring Juxtaposition: experience with Mushrooms - P. cubensis & Cannabis (ID 67146)\". Erowid.org. Sep 19, 2009. erowid.org/exp/67146",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 0:05",
   "0.5 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67146",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Sep 19, 2009",
   "Views: 2261",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBackground: I am an 18 year old, 75 Kg male. Before this point, I have never tried any other mind-altering drugs outside of the occasionally smoking cannabis. I am an atheist, anti-spiritual, very rational thinker that believes in no particular doctrines, dogmas, or philosophical points of faith not linked in with everyday living. The effects of weed have been interesting to me ever since I started smoking (about 6 months ago), and becoming ever more fascinated with the mysteriousness of altered states of consciousness, and after reading McKenna, Leary, and many other views, sources, and reports on the drug, I have decided that its time for me to try mushrooms.<br>After a lot of deliberation, and a profound amount of thought and planning, a friend of mine, lets call him K, and I, decide that we are indeed finally ready to choose a date to embark on a journey with the psilocybin goddess. We pick a Saturday morning, one where we will have nothing that we need to do, that will be light, warm, and cheerful, in a setting that we agreed would be comfortable for both of us, Ks bedroom. We thought that we knew what to expect, and were fully prepared to be incapacitated, lying on Ks bed, tripping out for several hours. The trip that unfolded was a profoundly different, but very enjoyable ride, the events unfold as follows.<br>T  10 hours: We get back to Ks house after just picking up the mushrooms that we would consume the next morning. We cover up all mirrors that we think might induce negative effects on us, we clean up his room to make it a more habitable environment, taking all video games and other intense-imagery objects out into the hall. The room is set; we need only get a good nights sleep. I divide out the dried mushrooms we have into two equal doses, approximately 2 grams each.<br>T  1:30 hours: The alarm goes off, 6:20 in the morning; its time to get ready. I move up to Ks room, he takes a shower, and we spend the next hour or so getting prepared both physically, getting changed into comfortable clothes, and mentally, meditating for the last time in our sober-mindsets, reassuring ourselves that we would not have bad trips, and calming down as much as possible for the anxiety-ridden thrill ride that would become the next few hours. <br>T + 0:00 hours: We sit down on Ks bed with a plate full of Psilocybe Cubensis mushrooms in front of each of us. We silently ask the mushrooms to bring us through this safely, somehow expecting that the inanimate fungi will deliver our wishes. I begin to shove various stems and caps into my mouth. It tastes like I thought wood might, earthen, bitter, somehow still pungent, and not exactly what I would normally choose for a Saturday morning breakfast. Still, we get them down, raw, without too much of a hassle, and the deed is done, there is no turning back now.<br>T + 0:05 hours: We smoke a half-bowl of weed to calm the impending anxiety and nausea.<br>T + 0:15 hours: Nothing yet or is there something? I feel different, sure, its really hard to tell, even harder to remember. How much of this difference in feeling can we attribute to the pot we smoked? We dont know, but, alas, it doesnt matter.<br>T + 0:30 hours: THC has relinquished its control of my brain to psilocybin, Im sure of it now, I feel like walking, pacing, moving, dancing, almost the exact opposite of the constriction that I expected.<br>T + 0:45 hours: Im back down on the bed, although I dont yet feel unable to walk around, I decided at this point that it is probably best to sit down, K has been sitting on the bed almost the entire time while we let ourselves come up, jamming to the music on the play list that we had created the night earlier, which consisted of light, relaxing music, mixed in with some trippy stuff like Primus and Tool. <br>T + 1:00 hours: BAM! It hits it wasnt exactly as though I got hit with a ton of bricks and was jarred into the world of tripping, nor was it that it happened gradually. All I remember is that at some point, the ceiling was no longer real, and at that point, I could no longer subject myself to what sober reality meant to me, that reality was gone. K seemed content, and I was feeling absolutely nothing negative. The ceiling moved, distorted and spun, but not in the way that I expected it to from reading other peoples descriptions of the visuals. Its almost as if it became a picture of something geometric, and conformed to the patterns of what my brain expected it to do. The whole time this went on, I felt as though I could still put myself back into a non-distorted mindset, but looking back on it, Im not really sure that I could have. <br>T + 1:30 hours: Wow, this is nothing like what I thought it would be, K and I have been talking in perfect conversation almost constantly the whole time. We dont need to be sitting down, we need to be up, out, exploring. We head downstairs, and Ks mom, who we thought might be gone, is still in the house. At this point, I start to freak out, because she doesnt know that we are on mushrooms, she thinks we are just very high on marijuana, and, since I knew she had tried mushrooms in the past, I was sure she would be able to tell. But neither of us gave it away, and she left within the next few minutes. We were now free to trip out. To my complete surprise, not much seemed different, although, I knew that everything was. The world, to me, had a very superficial quality to it. Nothing seemed to matter, but I was amazingly happy to be alive. Colors and sounds were all very much intensified, and if I concentrated on any one thing, it would begin to warp and distort itself. K and I continue to keep talking about everything around us, everything that is happening, and everything that we feel.<br>T + 2:00 hours: Its time to pick out a movie. It took us a good ten minutes to browse through and choose one from his rack of DVDs; I could have watched anything, all of the movies looked good, even movies that I hated. I felt like I could have a good time watching any of them as. We chose Yellow Submarine, put it in, and sat on the couch. To my astonishment, it didnt freak me out at all, on a level, the visuals, animations, and sounds of the movie were crazy, and a tad bit overwhelming, but all I saw was flashing colors and incomprehensible dialogue. It was weird to know that at this time, while almost peaked, I was doing the exact opposite of what I expected our trip to be. I took nothing past its surface value, I had absolutely no philosophical insights or deep revelations that I had read about people having, my brain wasnt doing anything, and none of it mattered. <br>T + 2:30 hours: We choose to go outside, and start walking down the street towards the park near Ks house. I think about lots of things, but none of them particularly profound ideas. The world just looked good, the street looked good, nature looked beautiful. We had brought a tennis ball, and bouncing it on the ground back to myself was amazingly fun, I felt like I couldve done that for hours. The public environment, however, made us lose a lot of the control that we had over our actions and thoughts at the time. As we were walking down the street, I started to feel weird, unreal, like more of a non-existent, objective presence than of a body. None of this bothered me at the time; I was tripping out, and having a blast.<br>I look over at K.<br>Alright dude, Im tripping pretty hard right now, he says.<br>I couldnt do much but agree, the world was fantastic, life was fantastic, I couldnt help but think that we should be living like that all the time. <br>T + 2:40 hours: We reach the park, and start throwing the ball back to one another. We increase and decrease throwing distance, height, trajectory, much as we do while normally playing while sober or on weed. To my amazement, we are catching the ball most of the time, probably not as much as we normally would, but none of that was not to be expected, after all, we were under the influence of a very powerful hallucinogen. The ball is mesmerizing, intoxicating. All that matters is the ball, the ball was the reason for our existence at that time, and we were living to serve the ball, to be a part of nature, to frolic in this fantastic field. The feeling was truly indescribable, and both of us knew it. We sat down in the grass, and kept talking about us and our experiences. We couldnt stop analyzing absolutely everything we were doing, but it was good, it kept us in the real world. I decided at that time, that I would not write an experience report on our trip because everything that we had expected, everything that we felt, or could expect to be feeling was so vastly different from anything that could be described by words in the English language, that it seemed to be for naught. I still believe that it probably is, but here I am, trying my best.<br>T + 3:15 hours: We are back inside now. I look at the clock and realize that it has been 3 hours. Much to the antithesis of the time-distortion of the pot, the mushrooms make everything go super fast. How could we have done so much in the past three hours? It felt like we did nothing, like maybe an hour had gone by. We feel no need, like we did preceding the trip, to limit ourselves from any of the sensory aspects of the world, we are freely going to the bathroom and coping with the mirrors, playing music we said we would never listen to while tripping, and even watching the TV we said we wouldnt touch. We play some video games, I am able to completely assume the role of my character and focus all of my energy into the game. Unfortunately, my coordination was sub-par, and although I felt mentally able to take on the task, my fingers simply couldnt move the controller in the way that I wanted. Still, playing video games was one of the most intense things I had ever done.<br>T + 4:00 hours: We start to feel as though we are coming down, and so, to relax, cope with what we had just done, and ease ourselves out of the trip, we smoke another bowl of weed out of my pipe.<br>T + 4:30 hours: BAM! . Again. The weed seemed to bring the trip back on almost full-scale. The popcorn ceiling began to move again, the world began to distort as it did before, everything became extremely weird. K and I couldnt help but trip out at the visuals in silence for a good ten minutes. We would spend the next hour or so in his room, playing video games on his computer and TV, tripping out at the word, at the walls, at life in general. Time lost all meaning in this period, not because we didnt acknowledge time, but simply because we didnt care.<br>T + 6:00 hours: Wow, I cant believe we are still tripping, I wouldve thought wed come down by now, I say. We make a second journey outside to do what we did before with the tennis ball. But this time, we only play for a bit, we take a walk back to a nearby picnic table, and sit down. We begin to look at the lake, in its awesome beauty, and to finally talk about something philosophical.<br>Do you think theres anything outside of our perceived reality? K asks.<br>Actually, no, I say, to both of our surprise.<br>I would have expected to come out of this experience having a newfound perspective on the meaning of life, humans, and human consciousness, but I didnt. Its almost as if the mushrooms had confirmed for me that life meant nothing, perspective was everything, I was nothing.<br>But damn, it was still good to be alive.<br>T + 8:00 hours: I was back at home now, going out shopping with my mom. Somehow, I still felt a pretty pronounced effect from the mushrooms, although it was nothing to the degree of a full-scale trip, there was still a huge noticeable difference from everyday reality, it was much like being high on marijuana. My mother and I went to a Christmas-themed ornament and tree store to look for stuff for the upcoming holiday. It was then that the deep thoughts finally set in. <br>How could humans create such filth, such utter and repugnant shit that serves no purpose other than to amuse these people who think that their place in society is somehow of interest to someone? I thought about all of the wasted money, time, and labor that went into making all of these products. I thought of how many people in Darfur couldve been fed if that one stores resources wouldve been spent on something other than worthless decorations. It was disgusting. I listened to people talk about their lives, all of the utterly useless things that they do, how much they think themselves to be important over everyone else. Then I realized that I am no different. I finally understood what was going through peoples heads when they committed mass murder, or suicide. The world is nothing, life is nothing, we have no purpose.<br>I thought of religion, and how, through quarrels of doctrines and beliefs, it simultaneously works to keep society together, while keeping us unstable, fighting about meaningless ideas and dogmatic bullshit. I sure could use a vacation from this. The words of Maynard came to mind. Somehow, through all of it, still, its great to be living on earth; mushrooms made me feel connected with everything. Although, I sure hope Im here when it all comes to an end.\n\n\n"
}
