{
 "title": "Good Confused Fun",
 "author": "that guy",
 "citation": "   that guy. \"Good Confused Fun: experience with Brugmansia candida (Double White) (ID 67141)\". Erowid.org. Nov 21, 2007. erowid.org/exp/67141",
 "substance": "Brugmansia candida (Double White)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "1 flower",
   "oral",
   "Brugmansia",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2007",
   "67141",
   "Male",
   " ",
   "Not Given",
   "Nov 21, 2007",
   "11000",
   " "
  ]
 ],
 "report": "<p>Ive read a lot of reports from users of brugmansia and its brother datura. The many reports of people ending up in hospital and doing all sorts of outlandish shit were a bit frightening but I figured that if I ever had the chance, I would try it at a small dosage (1 flower), with a tripsitter and that this should minimise the risk a lot. I am an experimenter and have kept my eye out for this plant, and was astonished to find it growing in my college's gardens. I picked a whole lot of flowers (about 10), and brought them back. Told my fellow trippers what they were and suggested we take them. Me and 'jay' lets call him sat down with 'lisa' our sitter, and ate one large flower each. I'd heard that this stuff can make you want to retch, so I chewed it thoroughly before swallowing (I think this aids digestion). It didnt taste nearly as bad as I'd read, just like  bitter celery.</p><p>After about 1hr, we started to feel 'different' as we both said at the time. It was a bit like extreme drunkenness, except we only felt it when we tried to do something, like move or speak. When I tried to get up from the beanbag I was sitting on, I really had to put a lot of thought and effort into it, and then walking was just a pain (not really it was fun to be so uncoordinated) I had to hold on to everything around me to balance myself. I dont know if I actually needed to hold on to things to stay standing, as I didnt fall over even once that I can remember, so I might have just felt very off balance without actually being off balance, but I'm not sure either way. Otherwise it was very relaxed and mildly euphoric. I really enjoyed just laying back my head and letting this strange feeling wash over me. </p><p>Depth perception got truly mangled hahah. Putting my arms out to push open a door, then feeling around for with my arms like antennas to touch the door that looks like it should be where my hands are, only to find that I hafta walk another foot or so to actually come into contact with it is quite strange. The uncoordinated element of the high were very entertaining for me. My friend jay on the other hand, (who'd incidentally drunk half a bottle of whiskey before having his flower) was well and truly out of it. After a while he almost totally stopped responding to either of us, and when he did, he was talking total and utter gibberish. I was amazed to see him acting out some of the commonly reported effects of the drug, he was continuously bringing his hand up to his mouth and tipping his hand as if he was drinking from a cup, he also probably smoked about a half a pack of cigarettes that didn't exist! It was quite hilarious to watch, but also scary because it was as if he was in a totally different world, and was no longer reacting to us at all. We basically had to prod him in the right direction to get him to come with us anywhere. </p><p>At this stage I left the two of them, and went to sleep (it was about 6 in the morning). The next day, when I woke up, I had a kind of dialogue running through my head, to which I would occasionally respond out aloud (I counted three times). Every time I did this, I would be shocked immediately afterwards that I had spoken to myself out loud and try to remember what I had said and what it was in response to, and had absolutely no idea! I later heard from lisa that about an hour after I went to sleep, jay had been sitting on her bed having fleeting conversations with many people one after the other. I asked him about it once he'd woken up, and he told me that he was at times convinced that there were many people in the room, and then he would realise 'um, how the hell did these people get here??' And they would vanish. </p><p>I hope to gradually up the dose to achieve similar effects to those that jay had, because he found it to be an incredible experience. </p><p>My advice is: </p><p>1. If you're going to try this drug (and I suggest you familiarise yourself with a lot of other trip reports to understand the wide range of effects it can have) start small, dont assume that because its legal and free that its not probably the most powerful hallucinogen out there. 1 flower is even quite generous for a first time.</p><p>2. Because of the fact that the hallucinations can become strong enough for a person to totally misinterpret the environment around them, you must and I cannot emphasise this enough, must must must have a sitter. A sitter is the difference between a tripper crawling into the middle of the road, writhing on the ground because they think it's a swimming pool and a tripper being restrained from doing this, and thus keeping their life. Also, a trip-sitter can make sure other people dont call the cops on you (which is what most sensible people do when they see a person arguing vehemently with a pot plant).</p><p>Be safe</p><p>Be happy</p><p>Enjoy yourselves</p>"
}
