{
 "title": "Keeps Me Out of the Hospital",
 "author": "Joe",
 "citation": "   Joe. \"Keeps Me Out of the Hospital: experience with Zyprexa (Olanzapine) (ID 67183)\". Erowid.org. Feb 21, 2010. erowid.org/exp/67183",
 "substance": "Zyprexa (Olanzapine)",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Olanzapine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67183",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 21, 2010",
   "Views: 5910",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This isn't a report about one specific experience, as Zyprexa isn't really something I take for fun.  But I think this site could use more general information about self-medicating psychiatric conditions.</p><p>As someone subject to bouts with what they call 'mania' or 'psychotic episodes,' or what have you, I keep this stuff around to put me to bed when I am spinning out of control.  When my thoughts are racing and I can't sleep, and I know I'm going to have a nervous breakdown if I can't calm down, I take usually 5mg (more or less depending on the severity but never more than 20) and it knocks me out.  Better yet, I usually wake up feeling back together and in control.  If it's really bad, taking it several nights in a row does the trick.  This is basically what they do if you get institutionalized anyway, so why wait for somebody to cart me away and then hit me with astronomical medical bills?</p><p>I've been hospitalized 7 times, mostly for 'bi-polar with psychotic tendencies' (though I've also been diagnosed schizo-affective and even plain old depression and ADD, just goes to show you how much they really know).  I've never found it beneficial to go along with the daily dosage mood stabilizers, anti-psychotics, or even anti-depressants: the side effects are often horrible, and since I am not constantly psychotic, I don't need something EVERY day.  Taking Zyprexa every day makes me fat.</p><p>This drug has also come in handy for coming down off coke.  I once went through a few grams with a friend and then we both got a solid night's sleep thanks to Zyprexa.  I've also given it to friends trying to kick dope, and it's actually gotten them  through the night, and even worked for kicking in the long run in one case (so far).  How bout that?</p><p>So in summary, this is not a recreational drug, but a useful tool that I think people should know about.</p>"
}
