{
 "title": "Too Many Physical Effects",
 "author": "Drew",
 "citation": "   Drew. \"Too Many Physical Effects: experience with 2C-T-7 (ID 6721)\". Erowid.org. May 8, 2001. erowid.org/exp/6721",
 "substance": "2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6721",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 8, 2001",
   "Views: 9650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI ingested 10 mg of 2C-T-7 orally at aproximately 3:30 pm at a friend's apartment.  The onset took about 2.5 - 3 hours.  During the onset, about an hour into it, I began to feel slightly nervous, and tense.  My body temperature fluctuated, and I found myself sweating on a few occasions, and feeling cold at other times.</p><p>Once peak effects had begun we went for a walk around town.  I felt less body temperature irregularities, although I had tightness in my chest and stomach.  This tightness got worse when laying down, and when I sat up abruptly, it almost turned to nausea.  Sitting up for a while and walking around helped with this.  As far as visual phenomena, it was fairly mild.  I perceived some things to be closer than they actually were, and when staring at a ceiling, the surface of the ceiling appeared to shift around in various ways.</p><p>One prominent effect throughout the trip was a reduced ability to use higher reasoning functions (language, problem solving).  I felt confused on occasion, and wondered if things I was saying were making sense.  At one point, I was looking at a patch of tulips, and said 'hey, look at the pretty roses'.  Yes, I am usually fully capable of distinguishing between a rose and a tulip, and after being told that they were tulips, and inspecting them again, I realized my mistake.  This may not sound significant, but it illustrates the kinds of things that were disrupted in my cognitive abilities.</p><p>I was at baseline at about 7 hours after ingestion, and the only remaining aspect was a pounding headache.</p><p>The overall experience was mildly interesting, and had there not been so many physical side-effects, it may have been worth repeating.  I could deal with the body load, but I just don't want to.  Also, such a significant physical aspect to the chemical indicates to me that there may be something toxic at work.  So I'd rather not try my chances with it again.</p><p>I am not currently taking any prescription, over the counter, or herbal medications.</p>"
}
