{
 "title": "The Calmest I've Felt",
 "author": "Kyle Patrick",
 "citation": "   Kyle Patrick. \"The Calmest I've Felt: experience with Damiana (ID 67231)\". Erowid.org. Apr 13, 2008. erowid.org/exp/67231",
 "substance": "Damiana",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "4 joints/cigs",
   "smoked",
   "Damiana",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67231",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 13, 2008",
   "Views: 26803",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I still live with my parents and they do not approve of my marijuana smoking habit.  Im also rather broke and cannot afford to buy bags of marijuana as regularly as I once could.  Because of these problems, Ive been trying to find something to hold me off until I am once again in a position where I can enjoy my favorite psychoactive substance.</p><p>I ordered several legal mind-altering substances that I understood little-to-nothing of off of a website for a very affordable price.  One of the herbs that came was the leaf of damiana  a natural aphrodisiac that commonly grows in Brazil.  Today was the second day that I tried it.  I no longer have a pipe in my house so I used a cigarette packer to push it into some paper cigarette tubes.</p><p>After 4 of these damiana cigarettes, Im noticing that many of the effects are not unlike marijuana.  What Im enjoying the most is the tranquility.  Im not sure that Ive ever felt this calm.  The amount of focus is so great that I can concentrate on nothing but the rhythm of my breaths for several minutes.  I tried meditating for a short while (perhaps 15 minutes) and it felt nicer than it ever has.</p><p>I smoked the herb under an opening in my familys barn while it was raining very hard.  Ive always had a fascination and an appreciation for rain, and its beauty combined with the sound of it hitting the barn roof was rather stimulating.  Ill spare you graphic detail, but I completely understand why this drug is classified as an aphrodisiac.</p><p>In describing how much I enjoyed this psychoactive herb, I almost forgot to mention that it tastes like zebra shit.  Im serious people  it tastes awful.  Ive noticed that it helps the taste significantly if I smoke two cigarettes at once: one with damiana, one with tobacco.  Despite the vile taste, I am eager to make some tea out of it.  The smell did not appeal to me either.  Its not like it was putrid and disgusting, but it has an odor reminiscent of a very old persons house.</p><p>Of course the effects dont hold a candle to marijuana, but for the price and considering how simple it is to obtain, damiana is worth looking into.  Unfortunately, the high only lasted about an hour, but I paid a measly few bucks for an entire ounce so it was a steal for the money.</p>"
}
