{
 "title": "Synergistic Sedative",
 "author": "Hybridplague",
 "citation": "   Hybridplague. \"Synergistic Sedative: experience with Lactuca (Wild lettuce), Kava, Valerian & Magnesium glyinate (ID 67255)\". Erowid.org. May 6, 2008. erowid.org/exp/67255",
 "substance": "Lactuca (Wild lettuce), Kava, Valerian & Magnesium glyinate",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Lactuca spp.",
   "(tea)",
   " ",
   "2 Tbsp",
   "oral",
   "Kava",
   "(powder / crystals)",
   " ",
   "1 capsl",
   "oral",
   "Valerian",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2007",
   "67255",
   "Male",
   " ",
   "Not Given",
   "May 6, 2008",
   "Views: 12170",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm a 25 year old male in good health.  I've had problems with insomnia ever since I was a child.  My dad is a naturopath and I was brought up on almost exclusively natural treatments for problems.  In my teens I took a variety of supplements to help me sleep (my own choice; my dad actually tried to get me to cut back because of the cost, but since he had also suffered from insomnia growing up he didnt push too hard).  I used to take 5-HTP, melatonin, valerian, magnesium glyinate (acts as a muscle relaxant), St. Johns wort and a few others I cant recall every night before bed.  They helped quite a bit, but not always.  Over the years I stopped taking nearly all of it and for two or three years I was only taking the magnesium, largely to prevent the muscle cramps I would get if I didn't.</p><p>About a year and a half ago I started doing yoga, and within just a few weeks my insomnia was almost gone, and as long as I keep up with it my insomnia is absent.  Recently I got interested in dream recall and I had read that kava, especially in conjunction with valerian, can increase vividness of dreams and dream recall.  Kava is also supposed to improve REM sleep, and who couldnt benefit from that?</p><p>I bought some wild lettuce with the intention of smoking it for its purported opium-like effects.  Several attempts at this have yielded nothing, but on a whim I decided to try to make a tea out of it (I bought an ounce, which turned out to be a lot, and it seemed a shame to throw it out).  Surprisingly the tea has a very mild flavor and is quite palatable.  Its also quite strong.  </p><p>I put a tablespoon of the dried wild lettuce into a small French press, poured some boiling water in and let it steep for about ten minutes.  I mixed up 2 level tablespoons of powdered kava root in some hemp milk (if youve never heard of hemp milk, try to find it; its a great alternative to soymilk and tastes pretty good, and no, it cannot get you high) and drank that with 1 gel cap of valerian (a half dose according to the bottle) and one gel cap of magnesium (120 mg).</p><p>Half way through the cup I could feel the effects.  The internal dialogue that is usually going stopped suddenly.  As I looked around my kitchen I noticed a shift in my perception.  It isnt anything big, but it definitely changes.  After I finished the cup I went to bed.  I felt restless and couldnt stop moving around; it seemed to make it more difficult for me to get to sleep, although it put me into that half sleep/half waking state that gives you some quality of rest.  I havent had this problem on subsequent trials.</p><p>Ive tried the wild lettuce without the kava, kava without wild lettuce, double doses of kava with a single dose of lettuce, and once a double dose of each, always with the magnesium, sometimes with the valerian and sometimes without, though this never seemed to have an appreciable effect either way.  Both the kava and the lettuce on their own are relaxing and help me get to sleep, but together they make me feel almost drugged.  Ive only done double doses of both on one occasion, and it was like being fairly stoned.  I havent done it again for two reasons: I dont need that much to help me get to sleep so it seems like a waste, and also because if I drink that much liquid I end up having to get up an hour later to go to the bathroom.</p><p>Everyones body chemistry is different, so this may affect people in different ways.  I find that the kava alone is often enough to get me winding down before bed, but if its late and I feel a little too energized, especially if I have to get up the next morning, I mix the two and it puts me down pretty quick.  I also like that it doesnt seem to be habit forming (for me, anyway) and that I dont feel groggy in the morning.  I still use yoga and meditation to help me sleep, and I find that above everything these have the greatest impact, I always feel the most rested if Ive been doing yoga.  But especially for dream recall and inspiring vivid dreams the plants help a lot.</p>"
}
