{
 "title": "The Dark World",
 "author": "MadChemist",
 "citation": "   MadChemist. \"The Dark World: experience with Salvia divinorum (20x extract) (ID 67271)\". Erowid.org. Nov 21, 2011. erowid.org/exp/67271",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67271",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 21, 2011",
   "Views: 2262",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had heard alot of stories about salvia so I decided to make a little research on it (its potency, its possible effects and after-effects and, of course, the chemical properties of salvinorin A) and decided it would be an interesting substance to try. </p><p>So I invited 4 friends to my house and we got ourselves one gram of 20x salvia extract. We decided to take it one after each other, so if anything bad happens, there would be sober people around. Let me explain the setting: we had three rooms: the 'bong room', the 'trip room' (which was actually my room, all lights closed except for a purple lava lamp) and the living room, where we played Nintendo 64. </p><p>When my turn came, I went to the bong room, took a hit (the guy who sold it said one hit was enough), and I got to the living room. I must have done something wrong because I felt weird, but I was still able to play N64. So I got back and took another hit. This is where it really starts. </p><p>Instantaneously, my vision field seemed to shrink to a small spot in the center, the rest of it becoming a dense cloud of purple-blue haze. I immediately went to the trip room and lay down on my bed. I then closed my eyes, and they were not to be opened for at least half of the trip. I then felt myself enter a new world.  I was submerged in a sea made of some strange fluid which was moved by rapid currents, creating spirals and vortexes. This fluid was coloured, but its colours were really dark and indistinct. In contrast with this background, I was like a thing made of pure energy, with the shape of a human body, but radiating a bright, green light. The currents in the fluid were actually pushing me side to side, up and down, like if I was riding some crazy rollercoaster, and there was nothing I could do to resist them. I felt like a little dot in a dark, strange, powerful world, like a kayak in a storm in the middle of the Pacific Ocean. However, this did not feel bad at all because, as being an entity of pure energy, I could not be harmed or killed, so I just let myself float on the waves, feeling invincible, euphoric.</p><p>Then I heard my friends leave the living room, and that took me back to my real body. The currents stopped and I wondered if I could stand up in my bed. As I tried, a huge hand made of solid rock came down from nowhere and held me down firmly on my bed. It was not over, I became the green energy stuff again. At this point I started focusing on the video games music (It was Super Smash Bross menu tune) and it took control of me. The background turned completely black, and shapes (swords, lightning bolts) made of N64 graphics started dancing around, following the music. I was finding this really funny and I might have been laughing alone. </p><p>Then the visions stopped, and I started to feel a tingle in my right arm. I had broken that arm falling off a cliff 9 months before this and, as I looked (I did not move my head nor open my eyes) towards it, I clearly saw the two cracks on my bone, shining in a bright, blinding light. Then a current (the same type than before) started pulling onto my arm, gently, slowly, until it broke open again! It did not feel bad at all, actually it felt like a part of me, a part of my soul had dissociated from me to go discover more about this universe. </p><p>As my arm, still shining green, was drifting away in the dark fluid, everything faded and I was back in my room, my eyes opened. For the next 10 minutes, I felt incredibly relaxed, as is floating on a cloud, still a little bit disconnected to the world. After those 10 minutes, I got up and felt totally normal, as if this trip to the dark world had never happened. As I reread this text, I think that the words I used are definitely not enough to describe the way it felt. One interesting thing is that each time I took salvia after that, the dark world was never the same, but it still felt the same way, as if I was looking into a vast, unknown universe.</p><p>I would like to add an advice I learned from another trip: Trying to fight the trip, to stay into reality feels REALLY BAD. Dont do it, let yourselt go.</p>"
}
