{
 "title": "First Foray into Salvia Dream Reality",
 "author": "Marmar",
 "citation": "Citation:   Marmar. \"First Foray into Salvia Dream Reality: experience with Salvia Divinorum (20x extract) (ID 67366)\". Erowid.org. Jun 8, 2009. erowid.org/exp/67366",
 "substance": "Salvia Divinorum (20x extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67366",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 8, 2009",
   "Views: 2137",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had my first experience with salvia on a Tuesday afternoon after class. I used a bong and 20x standardized salvia extract. I smoked it in my friends room with a few other friends (names fictionalized), Jeremy, Kylie, Lena, and the only other person who actually smoked, Jake. None of use had any experience with the substance, but Jake and I both read up all we could on the drug. Due to my chronic marijuana habit I was also high at the time.\r\nI carefully packed a small bowl and smoked it in one rip, holding the flame on the leaves the whole time. As I was holding the hit, I slowly started to feel my surroundings gain a certain psychedelic air. I held the hit for 30 seconds, exhaled, and closed my eyes (as I had heard this made for the best salvia trips) I felt slightly off, although not tripping, so I was waiting for that feeling to intensify within the next minute.\r\nInstead, the sages psychedelic powers suddenly and violently blew me to a parallel universe, and I was so taken aback by both surprise and shock that I open my eyes. Although I could distinguish the scene in front of me as the one I just was in (in Jeremys room with Kylie and Lena on his couch, and Jake on the bed), I was, for some reason, absolutely convinced that the salvia had actually made me pass out and dream a scene that just happened to be inexplicably similar to the one I took the drug in. In retrospect, I think my mind was simply trying to assimilate this completely foreign experience with a more familiar one, and the distorted architecture geometry (walls at weird angles, distortion in room width and length, visual crazyness all around) most closely resembled that of dreams. Another very bizarre aspect of it was that it felt that years had elapsed since I had first taken the bong rip  or rather, it felt as if I had instantly teleported to a different point in time, which was very disorienting.\r\nStill thinking I was dreaming, I tried to call out to my real friends in reality. I called out hello? twice. My friends reacted to that by looking at me oddly, which paradoxically both grounded me and upset me even more  although I made the logical connection that I was actually just tripping balls off salvia, and that instead of calling out to my real friends I had just spoken to absolutely no one in particular, but part of my mind still refused to acknowledge this reality was just an altered state. I tried once more to see if I could travel back to the normal world by closing my eyes. \r\n(Sometime during this state I was struck by the classic fear that I would be in salvia-land forever, but although this appeared rational at the time, I knew it was wrong and tried to convince myself so. I should also note I was unable to move for most of the experience.)\r\nAs I slowly started to come down my thoughts became more rational and I was finally fully aware that the experience was caused by the drug. I was, however, still very upset. When my friends asked if I was still tripping I snapped at them and left the room. Outside, I could stare at the carpet and see mushroom-like pattern morphing (we have a really trippy carpet in our hall, and the movement was definitely not as well defined as on psilocybin) I was still in a horrible mood.\r\nAs the experience tapered off (it was totally done within 20 minutes) my negative feelings vanished along with it, and by the time I was completely done I went back in the room, briefly apologized for getting upset and shared my trip. I smoked a bowl of hash afterwards and reflected upon the experience.\r\nAlthough the experience wasnt pleasant at the time, it was so interesting to examine in retrospect that it made it well worth it. I will definitely keep exploring this frightening but awe-inspiring dimension that is salvia-land. I hope this experience helped you understand a little more what a salvia trip is like. If there is one thing that I wish I had been explicitly told is that my sense of logic and thought, although seemingly clear and rational, completely went out of my control. Although salvia trippers can explain how they felt like they were in a different universe, one can never understand how truly overpowering such a feeling really is until one tries it themselves.\n\n\n"
}