{
 "title": "Good for the Mood, But for How Long?",
 "author": "Ironic",
 "citation": " Ironic. \"Good for the Mood, But for How Long?: experience with Sertraline & Other Pharms (ID 67381)\". Erowid.org. May 1, 2012. erowid.org/exp/67381",
 "substance": "Sertraline & Other Pharms",
 "bodyweight": "94 kg",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "67381",
   "Male",
   "",
   "Not Given",
   "May 1, 2012",
   "4195",
   " "
  ]
 ],
 "report": "<p>I had a nervous breakdown 3 years ago, which apparently triggered a chronic depression. My heart could go to 150 bpm in rest state, I had no will to do anything but stay in bed with blinds shut. Could not enjoy things I loved, such as music. And I could not sleep at all. I had spent several days without a minute of sleep until I ended up at an ER - where I was administered diazepam and could sleep for 4 hours and that's what I could get then.</p><p>So I went to a psychiatrist, who prescribed paroxetine and alprazolam. Alprazolam worked for a couple of months as a sleep aid, while paroxetin didn't help me at all. After two months trial, we decided it was time to try another chemical. Sertraline was a hit in the nail. Started with 100 mg and after some adjustments it went to 250 mg. In abstination, the initial symptoms return accompanied with nightmares, indicating that either this is not the proper medication or I will have to take it forever. However, when taken as prescribed, I feel like myself again, with will and determination to do whatever I like.</p><p>Side effects were noticeable ejaculation problems and maybe have caused a metabolic syndrome (can't tell whether or not this was due to sertraline, as I have been on cigarettes for many years). I was told to have healthier habits, such as quit smoking, practice sports, reduce caffeine and so on. Wasn't able to do the whole list yet, but I'm exercising daily now.</p><p>Sertraline didn't help me sleep. Three years from the first visit, have tried alprazolam, diazepam, flurazepam, lorazepam, mirtazapine (too much sleep with this one with 1/8 of a pill), zolpidem, zopiclone. I still use clonazepam associated with a hypnotic in order to get to sleep, but it works for a while and then the medication must be changed. I can't tell if this is a side effect of sertraline, but insomnia is still an issue.</p><p>Good for the mood, but for how long is the question.</p>"
}
