{
 "title": "Use In The United States Air Force",
 "author": "Dustmundo",
 "citation": "   Dustmundo. \"Use In The United States Air Force: experience with Zolpidem (ID 67416)\". Erowid.org. Dec 1, 2007. erowid.org/exp/67416",
 "substance": "Zolpidem",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67416",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 1, 2007",
   "Views: 23783",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have had many experiences with the prescription pharmaceutical Ambien. When I was in the Air Force, I was prescribed the drug for occupational purposes.  I was an aircrew member, and as such, was required to work very irregular and long shifts. Ambien was prescribed in order for us to adjust our sleep cycles so as to be able and alert when we need to fly. That being said, Ambien was readily and plentifully available.</p><p>My illicit drug use before I joined and after I separated from the Air Force is fairly extensive.  Among the drugs I've taken are Marijuana (of course), extacy, mescaline, mushrooms, acid, salvia, and DMT (smoked).  During my time in service I can honestly say that I was completely abstinent of all illicit drugs except for alcohol, and towards the end of my four year tour, I didn't even do that.  Now that I'm out I regularly smoke pot and explore psychedelics. </p><p>My impression of the drug was that it was very powerful and definitely psychoactive. It's intoxicating properties were well known.  I have witnessed and participated in widespread Ambien abuse during my time in service.  When we were deployed to Iraq, alcohol was forbidden and many people, myself included, used Ambien as a recreational intoxicant. </p><p>A typical dose would be 1 or 2 10mg tablets taken on an empty stomach although I have seen people take as many as five at a time (not recommended).  The empty stomach is critical as it allows for quick and powerful onset of the effects, usually within 15 to 20 minutes.  These effects are usually manifested in the form of double vision, blurred vision, euphoria, and a deficit in attention.  Ambien, in my experience, does not cause drowsiness, but rather a dreamlike trance state that facilitates the sleeping process.  This being the case, it's really easy to keep myself awake to experience the 'Ambien Trip.' The effects are rather short acting though, lasting only about 60 to 90 minutes when I have an opportunity to catch the 'A train' to sleepyville.   </p><p>On a side note, I have noticed that people can act very bizarrely when on Ambien.  I have witnessed total inversions of people's character and personality.  Impaired judgment is very common as well as blacking out and not remembering doing things while under the effects of the drug.  The negative side effects seem to increase exponentially with increased dosage. For this reason, I would not advise recreational use of Ambien, and if you do, 10mg is really enough.  Anything more WILL get you in trouble.</p><p>Overall, I'd have to say that Ambien can be a helpful drug, but can be dangerous if intentionally misused.  Now that I'm out of the Air Force, I don't see myself seeking out the drug for recreational use.  There are other more pleasant drugs out there.</p>"
}
