{
 "title": "Legal Does Not Mean Weak",
 "author": "Summer22",
 "citation": "   Summer22. \"Legal Does Not Mean Weak: experience with BZP (Funk Pills) & Alcohol (ID 67418)\". Erowid.org. Aug 11, 2009. erowid.org/exp/67418",
 "substance": "BZP (Funk Pills) & Alcohol",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "Piperazines - BZP",
   "  T+ 2:00",
   "  ",
   "oral",
   "Alcohol - Hard"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67418",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 11, 2009",
   "Views: 19769",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This was my second experience with any kind of drug other than pot, my first was with MDMA. I saw an ad on the internet for 'funkpills' - legal alternatives to ecstasy - and couldn't help looking into it. At the time, I didn't know that what I was getting was BZP.</p><p>I was at my boyfriend's place - somewhere I spend a lot of time and feel really comfortable. I had brought the drugs with me because I was quite eager to try them. We both took 1, as was recommended on the package. He felt doubtful that anything would happen, since they were legal. T+1hr - I felt absolutely nothing. I thought he must be right, that they weren't going to do anything after all. </p><p>T+1.5h - we decided we may as well go to our local bar for a few drinks. As we were getting ready, I felt my head start to tingle. I got really excited. I came up really fast, and was in a state of disbelief that they were actually working, and that the feeling was stronger than the time I took MDMA. He felt the same. We decided to find a club to go to, because I really wanted to dance. We ended up finding a small bar playing hip hop music. Outside, we had a smoke. I felt super alert, and had to try really hard not to break my cigarette. I felt quite twitchy, and when I walked I was speeding along with almost no effort. </p><p>We went inside, and decided to start off with an alcoholic drink. I had some kind of martini. It turned out this place was really chill - no one dancing, just sitting and chilling to the music. We also sat down. I felt really annoyed that we had to sit, I wanted to move so badly. This was about T+2hrs. I started to feel overwhelmed by the drug - my head was buzzing so hard, I felt like I had so much energy and I needed to use it up, as it was making me feel nauseous. We left at T+4hrs, about 2am. Outside waiting for a cab, I started to feel paranoid. I felt like I must be this really annoying person who doesn't stop talking. </p><p>Got in the cab. Asked him to put some more hip hop on the radio. It was nice to have the music to distract us. All I could do at this point was focus on my breathing so I didn't start to panic. I also felt a bit like I was going to vomit. I managed to keep taking deep breaths, and got through it fine. At this point I was convinced that I simply had too much energy, and that I had to use it up in order for the drug to feel less overwhelming. We walked around for almost two hours, and headed home at T+6hrs. Just walking and feeling the rhythm of my steps made me feel better. I was still really anxious to come down, but I could handle it. I also still felt a little paranoid - I thought that the few people in the streets must think we look  really sketchy. </p><p>Back at his apartment, we're still feeling wired. We get into bed, and make an attempt to have sex. Neither of us could handle it though, as every little touch was so intense. We lay there doing nothing. T+8hrs: We both really want to come down, but it's not happening. At this point, the intensity is painful. My skin feels cold, I keep going to the bathroom but I can't pee. It was so unpleasant and frustrating. I just felt grateful that he was with me, so at least I didn't feel alone. </p><p>We fell asleep at T+10hrs. We had to keep getting up to try to pee, which was really annoying. We couldn't get out of bed until T+24hrs. We both had terrible headaches and muscleaches. The comedown was really awful. </p><p>I've tried BZP in smaller doses since then, and I find unless I take a bit higher dose, I don't feel the euphoria and the high, but I do still feel the awful comedown the next day. I am tempted to try it again, since it's legal and I know what I'm getting - and because the high is so intense. Next time I would definitely go dancing though.\r[Erowid Note: The reported dose for this report was '500 mg', but this would be unusually high for a commercial BZP formulation and may be incorrect.]</p>"
}
