{
 "title": "Differing Body States",
 "author": "Riddirk",
 "citation": "Citation:   Riddirk. \"Differing Body States: experience with Spice Product (ID 67444)\". Erowid.org. Dec 15, 2008. erowid.org/exp/67444",
 "substance": "Spice Product",
 "bodyweight": "13 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67444",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2008",
   "Views: 7259",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter finding out that my town was dry of any weed, I decided I would take my chance on a legal drug that replicates Cannabis. I went to my local head store to pick some up, and was a little surprised at the price. At £5.50 for 400mgs, it seemed a little expensive, but after buying copious amounts of Salvia in my time, I didn't complain. I also bought some king size skins, as it would be much easier to deal with.\r\nI was in town that day, sunny, and I was with good friends, which is always a good thing when trying out new stuff. I put all the 400mgs into a skin, rolled it, and then lit up. The taste was the first thing to hit me. It tasted awful, and made me want to throw it away. However, I got used to it and finished it. After a while, I felt a nice buzz, very similar to that of MJ, but it hits much faster. At about 5 minutes, I was laughing at everything, whether it was a sarcastic remark from one of my friends, or the facial expressions they made. This lasted for a good 15 minutes, of which we then decided to go shopping. The herbal blend was incredible, and was identical to that of MJ, I even got the munchies real bad. At about 40 minutes after smoking, my body felt very strange, but good. It was a hot day, and I was wearing my hoody, but I wasn't bothered and kept it on. Despite feeling hot, I could feel these nice streams of coolness run around my elbows, shoulders and knees, as if ice cold water was running in my veins. \r\nWhen I got into town, I decided I would buy a sports drink and a pasta pot to alleviate my hunger. The drink was gone before I'd left the store, but the pasta tasted unbearable after a while. After much walking around, I felt very lethargic, much more than I do off weed. I then had my first cigarette of the day. When smoking it, it felt very heavy on the lungs, and tasted slightly better than normal. \r\nApart from the first half hour after smoking the blend, I was hardly conversing with any of my friends, normally I'm the motor mouth with too much on my mind. I really didn't feel like talking, I was too busy enjoying my bodily feelings. I kept having memory lapses, and I didn't notice anything I would normally would, if that makes sense. \r\nI followed my friends into a clothes store, where they were trying on girls jeans. One of them who had just turned up said that my eyes were extremely bloodshot, and that they were barely open. I looked in the mirror and I had incredible red eye. They were actually salmon pink and my pupils were the size of pin heads. By then, I was on the come down, but despite previous come downs, I was rather enjoying this one. On the way back home my friends were talking to me more, and I was picking up on my conversations again. The effects were slowly wearing off, but had lasted a good 4 hours at least.\r\nOut of any legal drug I've tried, this Herbal Blend has got to be one of the best. I've just seen that the company that makes it has dropped the price by a few quid, so I'll be buying more in the future. When the stuff comes out of the packet, it looks very much like weed. The blend is actually made up of myriad plants and herbs, including Lions Tail, Dwarf Scullcap and Blue Lotus, that when combined, is a very worthy substitute for weed.\n\n\n"
}