{
 "title": "Social Lubricant and Increased Motivation",
 "author": "RevAaron",
 "citation": "   RevAaron. \"Social Lubricant and Increased Motivation: experience with Pregabalin (Lyrica) (ID 67515)\". Erowid.org. Apr 30, 2010. erowid.org/exp/67515",
 "substance": "Pregabalin (Lyrica)",
 "bodyweight": "340 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Pregabalin",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67515",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 30, 2010",
   "Views: 18411",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI obtained some of this via legal channels. I obtained a pretty signifigant effect from a single 150 mg capsule. \r\nAs is my habit, took the single-cap dose first, not expecting too much. At T+1h I began experiencing a nice and noticable anti-anxiety effect. It definately had some qualities similar to GHB or alcohol, though with more problems walking than I've ever had with either of them. It peaked and plateaued around T+2. \r\nAt T+6 the feeling was still going, and the fatigue and asthenia I was experiencing before was gone. I went to bed not feeling particularily sedated, and fell asleep quickly (as is normal for me). I don't have any chronic pain issues, but I did notice that the soreness I had earlier in the day was gone.\r\nThe very nice feeling the pregabalin gave me is pretty much what I had imagined what benzos would be like. I've not tried too many benzos, but diazepam, alprazolam, and lorezepam have all done nothing but reduce anxiety- which is great when that's the issue- and induce sleep at higher doses. The pregabalin was more stimulating than any benzo. Pregabalin produced a profound (as in, doesn't go away when you're not paying attention) and relaxed euphoria. I've not tried more than 225 mg (1.5 capsules), and haven't seen any need to yet. It was a definate social lubricator and increased motivation (to do housework, etc) in a way that phenethylamines don't, for me at least.\r\nPregabalin is about the best thing in the world to take with an opiate. After much opiate use, I've begun to get back stiffness and pain when using it, even though I've not used for ages. On the occasion I took 150 mg of pregabalin and 10 mg of oxycodone it was heaven- all of what I like about opiate agonists were still there but without any of the problems I have with them now.\r\nThe draw back was that it affected my coordination and walking in a way similar to a fair amount (~4-8 drinks) of alcohol. I had none of the uglier (and pretty common) side effects like blurred vision or slurred speech. Definately not something to drive on, even if you are taking the therepeutic dose- at least not (in that case) until you are adjusted to it.\n\n\n"
}
