{
 "title": "Something Fresh",
 "author": "Dreamguy",
 "citation": "   Dreamguy. \"Something Fresh: experience with 2C-I (ID 67543)\". Erowid.org. Jan 27, 2009. erowid.org/exp/67543",
 "substance": "2C-I",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67543",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 27, 2009",
   "Views: 4882",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over the past few months, I read every trip report I could find on 2ci.  I gained great insight into the 2CI experience which has been helpful in preparing to make the most from the experience.   I decided if I was going to write something about my 2CI experiences, it should be something fresh.</p><p>What Id like to do is give the curious minds an idea of what 2ci is like.  Of course, this must come with the usual disclaimer that everyone reacts to chemicals differently.  Ive sectioned off some key topics of interest.</p><p>Visuals:   2CI gave me all of, if not more visuals than any LSD experience.  The patterns tended to be complex and symmetrical.  I have had one closed eye experience which I could base an entire life time of art on.  2CI might be a powerful tool for visual artists. Visuals were strong for up to 7 hours and subtle visuals lasted longer.</p><p>Music:  This is one of the most musical psychedelics I have had.  I have been moved to tears on various trips listening to music (and I rarely cry on any occasion).  I use this psychedelic for broadening my appreciation.  </p><p>Legality:  We have a unique role in being responsible with materials like 2ci.  If we pass it on, we must be responsible enough to keep it among those of us who are ready for the experience.  When things appear out of control, the government comes in and takes control.  Weve seen this too many times with psychedelics.</p><p>Socializing:  It is fairly easy and enjoyable for me to socialize on 2CI.  During my first trip, my wife (sober at the time) noted she wouldnt have been able to tell I had taken 2CI if I hadnt told her.  In all of my 2CI adventures, there has been a definite pull toward meaningful conversation.  </p><p>Combinations:  MDMA and 2CI were an incredible combination.  Ive experienced passionate connections in ideas and emotions with others.  The experience has been artistic, visual, and extremely empathetic.  This is, in my opinion, a combination that will go down in history.  </p><p>Hangovers:  2CI produces very little in the way of hangovers for me.  I have only experienced slight fatigue and fuzziness.  Ive functioned perfectly fine at work the next day.  However, having the day after to reflect and relax can make the experience more enjoyable.</p><p>Sleep:  It is just about impossible for me to sleep.  It is very similar to other psychedelics in this respect.  I'm usually not able to sleep for 8 hours or more from the start of a trip.</p><p>Food:  Like most psychedelics, there is a lack of appetite.  I usually eat 2 hours before starting the trip.  This assures I have enough nourishment to last through the trip while not being too close to the start to upset my stomach.  My appetite starts to return 8 hours from the start.</p><p>I hope this report helps.  Happy adventures!</p>"
}
