{
 "title": "Blading in Beantown",
 "author": "Yemoss",
 "citation": "Citation:   Yemoss. \"Blading in Beantown: experience with Mescaline & Cannabis (ID 67567)\". Erowid.org. Aug 27, 2009. erowid.org/exp/67567",
 "substance": "Mescaline & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "Mescaline",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1993",
   "ID: 67567",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2009",
   "Views: 7768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy first and only experience with mescaline was during the salad days of college, which I refer to as the most expensive vacation Ive ever taken. Boston, as you know, is a Mecca of academia, and all those brain cells need time and space for retrospection, so you have an equally abundant supply of tricks and treats. A testament to the science of economics. \r\nFrom my understanding, there is debate about the availability of true mescaline, which is derived from peyote, a desert cactus. I am equally amazed at how such a substance can make its way points northward all the way to Boston, without the Greatful Dead in tow, but for my storys sake, lets just assume I had the real deal. Apparently it is difficult to acquire the genuine article and most of what gets passed around is synthetic.\r\nI want to say the year was 1993, and it happened to be the day of the Boston Marathon. What a beauty it was. City running, to me, is a sport for the upwardly-mobile, because you have to have wits about you to jog and weave throughout traffic, plus its highly competitive, just like the office culture from which it spawns.\r\nBostonians take their marathon seriously, as tradition, and as college students, we had the day off. I cant remember if its a statewide holiday or not, but the whole city seemed to be out supporting it (and not working), on the streets, hanging out of brownstone balconies, cheering and drinking; this sort of merriment. A mass-celebration, even for those of us not into running. \r\nWe were, however, into rollerblading, and loved getting high and wheeling around town. This day we went all around town! Three other good friends and I dropped our doses around 11am, all of us experienced trippers, but not hardcore users; we still had to attend classes and pass tests. During the week, maybe a few 40s, blunts and Wu-Tang, but we saved the weekends for the more time-demanding mindscapades.\r\nI cant remember if this was a weekend or not, but since we had the day off, it sufficed for one. We strapped on our rollerblades and started cruising around, beginning our normal route down Commonwealth Avenue. Lots of little ledges to pop onto and off of, curbs to jump and still early enough into our trip that acrobatics remained possible.\r\nAfter 15 minutes we stopped off in a little park to spark a joint amongst ourselves, one of several throughout the day. It was gorgeous outside, I mean shorts and T-shirt weather with a beaming sun. We ripped down Newbury street - always a fun run. Lots of hot mammas to ogle and Eurotrash drivers to cut-off. \r\nWhats awesome about blading is that you feel part human, part vehicle/machine; whipping in between people and dodging traffic is not only fun, but with the speed youre going, required. A little attitude and street-smarts also come with the territory - you have to establish your presence to avoid being knocked around, much like a city courier.     \r\nBy the time we made it to the Boston Commons we were all very mellowed-out, probably a good hour or two into our trips. In an off-the-path alcove of sorts, we saw these two older men smoking weed on a bench and got such a kick out of it. One of my friends suggested that one of us ask them for a hit so I volunteered. I approached respectfully, trying to control my balloon-headed smiley face, and greeted them. \r\nI asked them if we could share and they said they only had a little; sorry. Im not even sure why I did that because we had our own bag with us. I think just to push myself out of my comfort zone, and also so my friends and I could get their reaction. Plus I think it would have been really cool had it happened; a little pow-wow in the park.  \r\nThats whats amazing about psychedelics and life in general  the more you are willing to experience, both good and bad, the more enriching it becomes. Anyway, it was really cool seeing senior citizens getting down. We had a good chuckle then and there, glimpsing into our futures. Of course we would always be about the weed, just like these dudes.  \r\nAs far as effects go, what I had expected from word-of-mouth was very consistent with my experience. I had done acid several times prior to this trip, and had that down pretty well. Each time I get a little better at it, more comfortable, and am less prone to having situations or phenomenon flip me out. I climb aboard rather than try to control it. Manipulating it with other drugs is another story, hehe.   \r\nBeing outdoors all day helped a lot because of being unconfined. Being with three good friends who can also handle their trips helped out immensely. We had nothing to fear and every shining moment to revel in.\r\nMind you I am writing this almost 14 years since this excursion, so my details may be a bit fuzzy. However, with acid, I drop and then in 45 mins or so the trip begins, and generally stays that way for I guess 6 to 8 hours depending on the dosage. Its pretty intense throughout. On mescaline, its like climbing a pyramid, building in intensity slowly, then peaking, and then a gradual decline out. Very nice design, thank the Desert Gods for that. \r\nVisuals, general feelings of well-being, internal warmth and spiritual wisdom abounds. Unfortunately I cant unearth mental burial chambers gleaming with gold, as the proximity of the trip has faded somewhat. But if you get a sunny day like we had, youre gonna want to worship that star! \r\nJudging by the fact that four of us had enough wits about us to rollerblade throughout the entire trip, it wasnt a harsh, debilitating or paranoid experience whatsoever. It made us want to go out and explore  mescaline is an enabler. \r\nThe remainder of the day was spent exploring the maze of streets in downtown Boston, we would catch a nice one-way downhill here and there and end up along the waterfront at other times. Wed happen upon a water fountain every now and then, like a blessing, and pickup a snack and marvel at how it tasted. \r\nWe had no want for direction, and the streets were completely deserted  everyone was home celebrating the marathon. The city proper was ours and we felt like kings on little wheels for a day, minds melding with the sun. It was one of my best trips to remain forever hallowed in memory lane.\r\nBy the end of the day we were somewhat exhausted, physically and mentally, but in the best way possible, like after a great day of hitting the slopes. Or running the Boston Marathon.\n\n\n"
}