{
 "title": "No-One Dies",
 "author": "PsillyBoy",
 "citation": "   PsillyBoy. \"No-One Dies: experience with H.B. Woodrose (ID 6758)\". Erowid.org. Mar 24, 2002. erowid.org/exp/6758",
 "substance": "H.B. Woodrose",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "7 seeds",
   "oral",
   "H.B. Woodrose",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6758",
   "Not Specified",
   " ",
   "Not Given",
   "Mar 24, 2002",
   "16315",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There is no need for blind faith when you can experience that in which you believe.</p><p>We were to pay the Head a visit; before departing: two of us consumed a brew, carefully prepared a few days earlier:</p><p>I had taken 14 Hawaiian Baby Woodrose seeds and crushed them, leaving them to soak in boiled water before straining the liquid through an old t-shirt  Separating the none soluble, stomach-irritating fats, from the water-soluble psychoactive amide  being LSA, the naturally occurring precursor to LSD. Shared the tea with one other person.</p><p>I have some experience with the seeds and was expecting to peak in about three hours, to reach a mellow plateau from which I could soak in the surroundings.</p><p>An effigy of Buddha meditated on the brew as it brewed.</p><p>After a beautiful five mile cycle along the beach, we reach Hengistbury Head. We rise to the top as the sun sets deeper, casting fantastic reds & oranges into our atmosphere. </p><p>The third member of our group ingests roughly 80mg of MDMA.</p><p>In a place like the Head you could experience euphoria without ever adding extra chemicals to the swirling pool already you. We decide not to without ever making the decision</p><p>One moment rolls on, before our eyes the intense beauty of day morphs to a beauty more subtle.</p><p>In the moment.</p><p>We lie a top the Head, a mellow plateau, sitting one hundred and eighteen feet above sea level</p><p>Upside down, near the edge and all I can see is Sea,</p><p>And Sky!</p><p>And the curve of the Earth!!</p><p>In the moment.</p><p>The sky darkens, the wind chills</p><p>We cover ourselves in a blanket plenty big enough for three.</p><p>In the moment.</p><p>The curtains are drawn back and we are allowed to gaze upon the greatest show on Earth,</p><p>The Universe</p><p>We look out from a point.</p><p>We travel.</p><p>In the moment.</p><p>Three highs become one, then many.</p><p>I lose myself in the stars, the longer I gaze upon them  the more I see.</p><p>The only times I slip back from ecstasy are the times I tell myself:</p><p>Its happening</p><p>Response:</p><p>I dont need to know thanks, Im already there.</p><p>Sitting here, writing this </p><p>I am confronted by a memory in a different category to those recalling everyday experience. A memory less focused on what happened, more on what I felt. A memory that is crystal clear but open to suggestion, a living memory that I know still has the power to teach me</p><p>I felt what happened,</p><p>It felt a bit like this</p><p>LOVE</p><p>Im unreasonably happy.</p><p>Im filled with the most intense Love I have ever felt.</p><p>Mad, directionless Love that flows out of me as it flows in:</p><p>It blows through me as the wind blows over</p><p>And I have a feeling that, like the wind, its movement is circular.</p><p>As I lose consciousness of my body, I too become Love</p><p>And I move with it.</p><p>Having experienced such Love, and all it inspires. I cannot doubt that God exists,</p><p>For I have known God in his purest manifestation, God as Love: </p><p>And so I realise that God is Love, the very same force </p><p>That which inspires creation.</p><p>That which creates creation!</p><p>The Human experience of LoveGod, known to lie behind the words of the term Mystical experience, is both old & new, eternal & transient:</p><p>It is a fountain that human beings have been swimming in and drinking of as long as we have been apart  And we have always been a part</p><p>LoveGod:</p><p>The illicit truth of every Religion.</p><p>A muse that inspires the whole Human race.</p><p>The source of all existence  </p><p>As simultaneously spiritual and material beings, not only is our Consciousness born from it, Our Body as well.</p><p>My hand is inexorably linked to thoughts of my hand. </p><p>He is an expression of my consciousness, of its will to reach out</p><p>To Touch.</p><p>One cannot exist without the Other because: One and the Other are One and the same. </p><p>LoveGod is a paradox, being every word we utter and the gaps in between  </p><p>Explained equally inadequately by Good & Evil, Negative & Positive,</p><p>Simultaneously both and neither </p><p>It is being in the same moment as becoming, it never began and it still hasnt ended</p><p>And so we find The Human Condition:</p><p>I grow within</p><p>And on this strange world:</p><p>An impossible tapestry,</p><p>They try to unfurl.</p><p>Without knowing what to ask,</p><p>They question each thread:</p><p>Does it start when Im born?</p><p>Does it end when Im dead?</p><p>I grow within</p><p>And on this strange land:</p><p>An impossible tapestry,</p><p>Woven of its own hand.</p><p>Dont search for the answer,</p><p>For the answer will come.</p><p>Stand back far enough:</p><p>Two merge into One.</p><p>And so we find the Human race:</p><p>In our relentless search for the answer (which is so ridiculously simple no-one stands a chance of comprehending it) we have neglected the beauty of all that provokes question.</p><p>And so we find ourselves</p><p>There is nothing as perfect for now as the ecstasy of the infinite question:</p><p>The eternal involvement of self with other; finding out without asking a thing.</p><p>A passive exchange of energies, of information </p><p>If we concentrate on pursuing the answer, as opposed to cultivating a passive acceptance of the fact that the answer is immanent, we do ourselves no favours</p><p>First: We miss out on the ecstasy of the infinite question, in other words </p><p>We do not gain full enjoyment from our involvement with the outside and the inside worlds;</p><p>This involvement is to be marvelled at, celebrated, cherished and explored</p><p>Second: As we dream of the most sacred thing, we neglect the fact that everything is sacred.</p><p>This, combined with an unawareness of the inter-connectedness of all things, has contributed to the widespread destruction of our Mother Earth, Gaia:</p><p>She is our Garden yet we trample her plants and slaughter her animals, we suffocate her skin with a layer of concrete, pollute the air she breathes and the water she drinks with our foul concoctions</p><p>She is our Garden, the tree is our life  and we still forbid our children free run of her fruits</p><p>How I yearn for free run of her fruits</p><p>The Hawaiian Baby Woodrose seeds I consumed belong to a family of Gaias fruits termed Entheogen meaning God Within:</p><p>Many Entheogens having been helping Human beings find LoveGod since we first looked outside of meat for food. They are gifts </p><p>First from God,</p><p>Then from Our Planet.</p><p>There is nothing less human about looking to nature for Mind food than there is about looking to nature for Body food </p><p>Yet the former lies well behind in the acceptance stakes  At least in so far as many Societies, with their Governments and Religions, are concerned.</p><p>*  *  *  *  *</p><p>The drugs had worn off.</p><p>We emerged from the woods, into which we had retreated after our Mystical experience a top the cliff, and lay once more under the blanket.</p><p>The sound of the Sea, its partner the wind thankfully absent, soothed us to sleep.</p><p>I awoke cold & damp but energised & joyous.</p><p>Climbing back up the Head in order to reach the warming rays of the morning Sun, I was sent two messages  arriving as thoughts</p><p>The first, from God, said:</p><p>No-one dies.</p><p>The second, from Our Planet, said:</p><p>Its not too late.</p><p>copyright. Sam Ross. 2001.</p>"
}
