{
 "title": "Catalyst for Positive Change",
 "author": "ChuckSteak",
 "citation": "   ChuckSteak. \"Catalyst for Positive Change: experience with Cannabis (ID 67594)\". Erowid.org. Sep 29, 2009. erowid.org/exp/67594",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67594",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 29, 2009",
   "Views: 3771",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI spent about a decade of my life abusing alcohol and cocaine and generally being a super asshole. I pissed off friends, family and complete strangers. I was in a knife fight once and lost; spent a week in the hospital. I blacked out all the time and woke up with new scars. I spent time in jails, rehabs, AA meetings, hospitals and every shitty bar around. I lost jobs, stole, started fights, broke thingsyou get the picture. After a few unsuccessful attempts at quitting booze and coke, I hit a downward spiral that shook me up enough to finally grow up and quit on my own.\r\nDuring this stressful time, I started using cannabis again after a long absence. With cannabis being the only mind-altering substance I used now, I fully appreciated the effects: enhanced perception, deeper appreciation of nature and art, decreased aggression and stress, multiple model thinking, back pain relief, enhanced empathy for others. When stoned, I would experience overwhelming guilt for the bad shit I had done to people, but the feelings of guilt would be followed by forgiveness, self - acceptance and the drive to change. Long story short, I got my shit together, smoking cannabis the whole time. Two years later, I have a great life. Family, girlfriend, friends, house, career and a generally positive attitude.\r\nWhen I smoke, I stand face to face with my values, unable to lie to myself or justify harm done to others. I think that personal issues are greatly amplified while stoned and harder to ignore. If I am acting unfavorably to myself and/or others on a regular basis, it will let me know. In this sense, I use pot as a catalyst for self-improvement.\n\n\n"
}
