{
 "title": "Does Not Mix with Driving",
 "author": "Pseudo Nephren",
 "citation": "   Pseudo Nephren. \"Does Not Mix with Driving: experience with Hydrocodone (Vicodin) (ID 67612)\". Erowid.org. Jan 19, 2008. erowid.org/exp/67612",
 "substance": "Hydrocodone (Vicodin)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2005",
   "ID: 67612",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 19, 2008",
   "Views: 14621",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>My wife convinced me to take a Vasectomy operation.  My doctor told me to take Vicoden half hour before the appointment.  Now the office is only 15 minutes away from my office, and this would create a dangerous situation that I would experience.</p><p>I downed the medication, and waited for the required amount of time before starting my drive to the doctor's office.  As I was on the road I felt the drug's effect hitting me.  Very quickly I had difficulty focusing my eyes; my visions have become blurred.  At the same time I struggled to keep my concentration on driving, which proved impossible.  It felt my waking thought would become fragmented, and fuzzy.  Concious-ness seems to buzz in and out during each second, which I believed would not have been possible until that day. I fought to stay awake during the whole trip.</p><p>This was a nightmare like drive to the office.  Fortunately I made the trip in one piece without crashing my car.  The nurse had me wait in the doctor's office for one hour.  The drug's effect on me seemed to have completely gone by then that they gave me another pain medication for the actual operation.  I told my doctor to make a note in my record, to never order me any Vicoden in the future!</p>"
}
