{
 "title": "Setting is Crucial",
 "author": "Danny",
 "citation": "   Danny. \"Setting is Crucial: experience with LSD (ID 6764)\". Erowid.org. Mar 25, 2002. erowid.org/exp/6764",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1982",
   "ID: 6764",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Mar 25, 2002",
   "Views: 16357",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThe trip I will describe here occured when I was a college student almost 20 years ago.  I feel compelled to share this, because I believe a good LSD trip can be an important and enlightening experience for many people.  In fact, I believed then, and still do, that the world would be a better place if more people went on a good LSD trip. A bad trip, on the other hand, can be extremely frightening.  I hope this report will help travelers avoid the bad trip.</p><p>While in college, I took LSD at least a dozen times -- probably more.  Before embarking on that first trip, I read as much as I could on LSD.  Most interesting to me, for example, was the story of Albert Hoffman and his famous bicycle ride.  Also in my readings, I was very careful to note the advice on preparing a good setting.  Most crucial, I think, is to arrange things so that any source of anxiety can be avoided.  There are three basic rules: 1) If there are any particularly worrisome tasks you must attend to, take care of them *before* taking LSD; 2) the setting should be completely non-threatening, and devoid of any pressure on you to do things you wouldn't want to do; and 3) share the trip with people you trust -- people who would not criticize you or threaten you in any way.</p><p>Whenever I've followed these rules, LSD has given me some of the most memorable and meaningful experiences in my life.  The most consisent impression has been that love for all others makes perfect sense, and that hate and violence is utterly senseless and illogical.  I can still vividly recall nature outings with close friends, trips to amusement parks and the love I felt for others I saw there having fun, and seeing colorful fish while snorkeling in the ocean.  All of these experience were intense with the most pure and good feelings of love in a perfect world.</p><p>Having had such pleasant trips over and over, however, I got a bit reckless with the setting one night, and embarked on the most terrifying experience of my life.  Early one winter evening, I and 3 of my close friends each took one hit of 'Red Phoenix' blotter -- an imprint which probably no longer exists, but had provided us with very pleasant trips in the past.  Right off, there were a couple of things wrong that I chose to ignore.  First of all, we had no plan for the night.  We just chose to drop acid, and make up the rest as the night progressed.  Big mistake.  Always plan out a safe, and comforting setting for the entire trip.  Second, one of our fellow travelers was Gary -- a close friend who I loved, but who was abrupt , unpredictable and, I secretly felt, potentially dangerous.</p><p>Within one hour of taking the blotter, we suddenly decided to go to our college's Friday night free movie, which happend to be 'American Werewolf in London.'  Always at these movies, there's a long line waiting to enter the theater.  Cutting in line was, naturally, against the established ettiquette, but there were always inconsiderate types around who would screw everyone else so they could get ahead.  I always played by the rules, and accepted my place at the end of the line if I hadn't been thoughtful enough to arrive early for a prime spot. Gary, however, had no conscience whatsoever.  He spotted a pal of his toward the front of the line, and went to 'talk' to him, insisting that we all conveniently join him in cutting in front of all the others who were patiently waiting.  Standing there in the cold winter air, I could hear the grumblings behind me from those who were in no way appreciative our our blatant breach of ettiquette.  I kept my back turned to them, but could just feel the sting of the mental daggers pointed at us. </p><p>When we finally entered the theater, I didn't have that annonymous feeling I normally have in big crowds. When the four of us took our seats toward the front, I could still feel the daggers from behind.  I remember wishing the projectionist would hurry up and turn down the house lights so others couldn't see us.  When the movie started, so did the bad part of the trip.  If you've ever seen 'American Werewolf in London,' you may recall that the opening scenes feature pictures of hill covered countryside, that sort of blend into each other.  This seemed very weird, and I wasn't sure if it was really happening on screen or if I was halucinating.  Being a scary movie, 'American Werewolf'  had all the tricks to make you feel in danger.  Already uncomfortable, the movie didn't help me feel any better.  Little by little with each scene, I began to notice that the faces of the movie characters began to melt.  As a character would move, the pale color of their face would smear across the screen.  Everything else in the picture on the screen would look okay, it was just the faces that would melt and smear.  I began to worry that the real world would begin to melt just like the movie, and that if it did, I wouldn't be able to see well enough to leave the theater when the house lights came on.  I told Gary about the problem, and he said the faces were melting on him, too.  So, we both got up to leave.  As we did, I heard someone behind us say, 'Chicken Shit!'  I laugh at this now, but at the time the sarcastic remark only increased the chill of an already cold night.</p><p>The two of us went back to the appartment of one of the trippers who stayed in the theater.  The appartment was cold, but we tried to get comfortable by watching t.v.  Coudn't do it -- melting faces.  Then we tried music.  The music sounded completely garbled and I couldn't make any sense of it whatsoever, so we turned off the stereo.  With no music or t.v., Gary and I sat in the cold appartment doing nothing. Bored, Gary suggested we go to a frat boy bar to pick up sorrority girls.  Yeah, right, while on a bad acid trip!  There's no holding Gary back on anything, though, so he bolted and I stayed in the cold appartment alone -- no t.v., no music, no one to talk to...  </p><p>The only thing interesting to look at was the world map hanging on the wall.  Being a political map, each country was represented by a different color.  Also, the oceans had varrying shades of blue to indicate water depth.  All of these colors were sort of pulsating, growing and subsiding in intensity.  The map also looked like it was flapping against the wall, as though the bottom corners of the map were not attached to the wall, and a fan was blowing against it.  In fact, I was certain that by the looks of the map that was flapping around and the cold air in the room, there must be a fan on somewhere.  But, I looked and looked everywhere and could find no fan.  I went up to touch the map, and it was still, but when watching it from across the room it was blowing in the breeze.</p><p>These sensations, while they may seem interesting now, were terrifying at the time, because I was afraid that eventually everything would appear as a melting, pulsating, blob of color, and that people's voices would sound garbled and unintelligible.  If this were to happen, and I felt that there was a very good chance that it would, I'd be reduced to a pretty helpless and confused person unable to communicate.  I began telling myself that if I could just talk with someone I could prevent these things from happening.  So, I got on the phone, and after dialing number after number I finally connected with Mike.  Mike is a stable, intelligent, caring sort of guy.  We talked.  I shared with him the whole scene, and he understood and was comforting.  As long as we talked, everything was okay.  He spent 2 whole hours with me on the phone. You really must have friends like this if you're going to try tripping on acid.</p><p>Eventually, my other friends came home and we all talked.  They were considerate, and didn't play music or watch t.v. when I told them that I couldn't take it.  We all just talked and rode out my bad trip together.  If my friends hadn't been considerate, but had been assholes, I'd have flipped my lid.  I guess my best bit of advice is have good friends.</p><p>I think I did LSD once or twice more after that cold night, but it was never good for me again.  I didn't have anymore bad trips, but LSD ceased to have the benefits it once had.  To this day, LSD is over for me, and I have no desire at all to ever do it again.  The good experiences I had with LSD, however, are still with me, and I find that is all I need.</p>"
}
