{
 "title": "Things I've Learned",
 "author": "Older Guy",
 "citation": "   Older Guy. \"Things I've Learned: experience with Piracetam (ID 67705)\". Erowid.org. Dec 19, 2007. erowid.org/exp/67705",
 "substance": "Piracetam",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "ocular",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67705",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 19, 2007",
   "Views: 21478",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been using Piracetam for about three years and I've experienced a few things that I've not seen reported by others here, as well as many things that confirm what others have said.<br>My very first experience taking was unique, I took 1600MG, went down to a local tavern that makes an excellent Teriyaki fish and Ceaser.<br>It's an old cabin that has been there for 100 years, the wood is very aged and interesting.  However, on this day I saw subtleties in the color and texture I had never noticed before.<br>Upon entering, we sat down and ordered some food, and I found to my amazement that I could follow five different conversations simultaneously and recall each of them verbatim.<br>I had a sense of heightened awareness of my surroundings that I had never experienced before, no wired sense or buzz, just an absolute sense of being tuned in and connected to what was going on around me.<br>Unfortunately, the intensity of the initial experience was never to be totally repeated, nonetheless, in general it does heighten my awareness.<br>Other than the effect of the initial dose being more pronounced in this way, I have not noticed any decline in effectiveness or a need to increase dosage in three years of taking it.<br>I've read about possible neural growth stimulation but I have never read any specific reference to auditory nerves.  I don't know that Piracetam was the cause but I can't think of any other factor that changed.<br>I am 49, at 46 my hearing which was good to about 20 Khz in my youth had declined to where it was weak after 13 KHz and gone by 14 Khz.  Given that I've done commercial sound reinforcement work and have a great love of music, often excessively loud, this is not surprising.<br>What is surprising is that over the years of using Piracetam, my hearing has improved to where I can now hear up to 17 Khz.  I've never heard of high frequency hearing regenerating in an adult, I don't know that piracetam is responsible, but given its connection with nerve growth and no other identifiable agent it is at least possible which is why I am posting this detail.  I am curious if anyone else has experienced something similar.<br>Also, curious about effect on IQ, I took an IQ test before I began using it, another three months later, and went from approximately 130 to 141 or so and it has remained at that level since.  I didn't take the test between first starting and three months so I don't know how rapid that change was, but it's been flat after the first three months.<br>I've found that proper dosing is very critical for me and I suspect this is why so many individuals find relatively little benefit.<br>There is an optimal dose, below which the effects are minimal, above which the effects are even detrimental (makes me tired), but at that optimal dose the effects are considerable.<br>That dose isn't the same from day to day but I've learned to 'feel' where I'm at.<br>I'll take 800MG initially, another 800MG an hour later, until I feel things clear up, and then I won't take any more until I start to fade. Usually it's about two or three doses to get to that plateau and then two or three more to maintain it so in a day the total dose will be between 3200 and 4800MG.  That's been consistent over three years.<br>Hope this info is helpful to someone.\n\n\n"
}
