{
 "title": "Smoked Extract As a Stimulant",
 "author": "Aopocetx",
 "citation": "   Aopocetx. \"Smoked Extract As a Stimulant: experience with Salvia officinalis (ID 67711)\". Erowid.org. Dec 22, 2008. erowid.org/exp/67711",
 "substance": "Salvia officinalis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Alprazolam",
   " ",
   " ",
   "  ",
   "smoked",
   "Salvia officinalis",
   "(extract)",
   " ",
   "  ",
   "smoked",
   "Tobacco",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "67711",
   "Male",
   " ",
   "Not Given",
   "Dec 22, 2008",
   "9659",
   " "
  ]
 ],
 "report": "<p>I created an extraction by dissolving finely ground sage in a 40/60 mix of rubbing alcohol and water. I let this sit for about thirty minutes, shaking often. Then I strained this into a pot and set it to boil on medium. When the alcohol had evaporated away, I put the heat on high. When the majority of the liquid was evaporated I added a small amount of the finely ground sage to give this stuff form. When I say finely ground, I mean this stuff is a powder.</p><p>I smoked a total of one fat bowl of this stuff. First off, I was on 2mg alprazolam as I was making this. Xanax is a GABA agonist. Thujone, the main psychoactive ingredient in sage, is a GABA antagonist (opposite effect). I mixed the thujone extraction with finely ground tobacco to help it burn better (it's a bitch to light without mixing it!). </p><p>Before I hit it, I was feeling very chill from the Xanax. When I was done smoking the bowl's worth of material my state of mind took a 180 degree turn. I now felt stimulated and clearheaded. I no longer felt sedated. And to further prove sage's effect, I could not fall asleep no matter what until three hours later at ~2:50 AM. Consider that my bedtime is usually 11 or 12 and that I was on Xanax. I should have knocked out way earlier. Smoking this stuff also gave me dilated pupils (which persisted until I went to bed) and moderate euphoria.</p>"
}
