{
 "title": "Dissolved in Water, Didn't Burn So Much",
 "author": "Aa",
 "citation": "   Aa. \"Dissolved in Water, Didn't Burn So Much: experience with Cocaine (ID 67769)\". Erowid.org. Sep 25, 2009. erowid.org/exp/67769",
 "substance": "Cocaine",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "300 mg",
   "insufflated",
   "Cocaine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67769",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 25, 2009",
   "Views: 13901",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI needed to stay up all night to prepare for a final the next morning, and I have found that using cocaine while studying under these circumstances both keeps me awake and focused, and helps me learn information faster. I got about half a gram for $20 from my usual source, only to find that the stuff was terribly cut after the first bump I took. There was definitely a good amount of clumped-up coke in there, but whatever it was cut with was very harsh on my nose.\r\nI hit the stuff slowly for a while, alternating excruciating snorts with nosefuls of cold water. However, I only made it through about half of what was there when I couldn't take it anymore. My nose was constantly running, it hurt to sniff the snot back in, my left nostril was completely congested, and I knew it could only get worse. \r\nI set it aside for a while, until later that night when I took a break and went to this site, looking for an alternative method of ingestion. Not even considering the time and effort involved, there was no way I wanted to inject it or make crack. \r\nI came across 'Dugan's' experience report where he mixed coke with nasal spray and snorted it through the tube, and noticed an editorial comment suggesting that insufflation of cocaine dissolved in a liquid was probably much less damaging to the nose than the powder alone. This seemed interesting, so I took a soda bottle cap, filled it with water, and mixed in a small line's worth of powder. By snorting small amounts of the solution through the plastic tube of a pen, and by dripping a little into my clogged nostril, I was not only able to clear my nose and do the rest of the stuff painlessly, but it even helped alleviate some of the pain from previous irritation. Like Dugan, I have no idea regarding its potency relative to straight powder, although I wouldn't be surprised if this method is not as efficient. However, considering the low price and quality of the stuff I had, and the significant reduction of unpleasant effects, I wasn't too worried about how much I was wasting. I'd definitely do it this way from the start next time I get something that's been cut or my nose is already sensitive.\n\n\n"
}
