{
 "title": "Bad Time For A Caffeine Addict",
 "author": "Bryan",
 "citation": "   Bryan. \"Bad Time For A Caffeine Addict: experience with Caffeine (Vivarin) (ID 6778)\". Erowid.org. Mar 26, 2002. erowid.org/exp/6778",
 "substance": "Caffeine (Vivarin)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2000 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6778",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 26, 2002",
   "Views: 22269",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'd been drinking coffe since I was ten years old, and am currently fourteen. I never thought of coffee, Jolt-Cola, pr red bull as drugs because I guess I never really abused it. Recently I began taking pill versions though of caffeine like Vivarin because I was looking for more of a rush like I was getting on six redbulls and ginseng packs, but cheaper. I was enjoying it on a daily basis doing about 600 mg a day not including coffe or redbull.</p><p>One night I was with two of my really good friends and they wanted to try some Vivarin with me so we ran down to the closest 7-11 to pick up a 16 pack. K reconsidered so my other friend B and I split it. I decided to take all eight at a time while he saved his for when we got home. I wasn't getting a rush like I usually did in the first hour so I asked him for two more pills. I took'em and decided I wasn't feeling so good and went to sleep around 2:30 p.m.</p><p>When I wroke up I had to run home(I live right down the block of them) and everything seemed like a dreamish zoning in and out state. As I got home I took a shower and just felt like I could ignore it and it would go away. I ended habing breakfast with a good friend of mine called F who use to do this kinda stuff, but quit. We were driving in the car back to my house and I felt like I was gonna pass out. My vision was having little black dots appear, I was sweating, and mumbling to myself. My dad asked me if I was altight and I said I was fine. F and I ran to my room where I layed on the bed and started twitching and going in and out of reality it seemed as he played my guitar. He went and grabbed me an apple and for some reason the taste made me come down and I stopped tweaking out.</p><p>My dad asked me what happened and I told him about taking to much of the Vivarin and I told him I wouldn't take it again and I'd quit caffeine altogether. This was a thing I couldn't keep. Two weeks later got some pills from a friend was drinking coffe and taking Vivarin and trying this new stuff called black beauties that I was able to get my hands on. I tryed quiting today and I ended getting money from a friend to grab some Vivarin (which I'm on right now). The thing I learned though, and have read from other reports too, is that Caffeine isn't to be played with especially at 13/14 years old!</p>"
}
