{
 "title": "Dissapointing but Powerful",
 "author": "BlaineFire",
 "citation": "   BlaineFire. \"Dissapointing but Powerful: experience with Anadenanthera peregrina (Yopo) (ID 67785)\". Erowid.org. Sep 4, 2008. erowid.org/exp/67785",
 "substance": "Anadenanthera peregrina (Yopo)",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "4 seeds",
   "smoked",
   "Anadenanthera peregrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 67785",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 4, 2008",
   "Views: 5298",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have recently become interested in psychoactive substances as a way of escape and understanding. After much research on such substances I found that yopo seeds contain DMT as well as several other similar compounds. I knew DMT was a powerful hallucinogen and became quite excited when I found this out. Especially when I read other peoples experiences with them. I decided to try :)\r\nI bought a pack of 15 seeds and heated them up in a pan gently so I didn't burn them. I took the seeds out of the outer shell and then used a pestle and mortar to grind them into a powder. I have read you can mix them with lime and snuff it, but it sounded too painful so I opted for smoking it. I loaded my bong with about 4 seeds worth of powder using a very fine gauze. I took 3 big hits and stood back from my bong.\r\nI had immediate dizziness (alot like smoking MJ) and felt very dry, so I went to my kitchen to get a drink. I drank about half of a cup of orange juice when suddenly BOOM. About 30 seconds after I had bonged the powder I was instantly paralyzed standing in my kitchen. My whole body was tingling and I had an overwhelming feeling in my head of worry and fear, but since I have done things like this before I knew how to achieve inner peace and let the stuff do what it wanted. Unfortunately as suddenly as it came, this feeling passed. I was back to slight dizziness in about 20 seconds. And this is how it remained for about 40 minutes, till all effects were gone. In that time I played a pc game involving pressing keys in time to arrows and music and beat all my high scores somehow? Maybe this substance enhances senses as well as obliterating them?\r\nAs far I can tell I was thoroughly in the mood to trip and with a house to myself why not? My only guess is that this was simply not a high enough dosage, that or I need to consume a MAOI prior to smoking to enhance the effects. I have noticed when looking again that my body mass is more than alot of people who wrote these experiences which could also be a factor.\r\nI have read alot about yopo seeds and how intense people have reported trips to be but for me this was obviously not a high enough dosage. I expect I shall do this again soon at a higher dosage, I shall also report on the effects again.\n\n\n"
}
