{
 "title": "End of the Line",
 "author": "Syd",
 "citation": "   Syd. \"End of the Line: experience with alcohol (ID 67801)\". Erowid.org. Jun 27, 2008. erowid.org/exp/67801",
 "substance": "alcohol",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67801",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 27, 2008",
   "Views: 12241",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Alcohol is an insidious, life-destroying drug. The culture of booze is integrated and pervasive. Nuff said.</p><p>My own experience with alcohol is like many others, I wont bore you with the build up, suffice to say I was a weekend drinker, social drinker, for many years, starting in my twenties until my mid forties. I never considered it a problem, I saw others with problems, even saw a friend drink himself to death. It didnt hit home because, that wasnt me, I didnt have that kind of problem.</p><p>The final trip, which really killed my love affair with booze, and nearly killed me, started off normally: A weekend drinking. Nothing too heavy, but I continued to drink, everyday, getting to a certain point, maybe half in the bag. Once or twice fairly drunk, this continued for about ten days or so. By this time, with my years of abuse, it took quite a bit to get half in the bag, and a lot to get drunk. I was aware that something was wrong, I hadnt been to work in days, I told myself to stop, but I couldnt wean myself off. It just went on. Finally, I started to get scared, which made me drink more. I knew I couldnt go to work smelling like I did. I tried to stop, but encountered fierce withdrawal, finally I woke up one morning and my eyes were almost swollen shut, and I was terrified. I had to do something, so I called my employer, spilled my guts and checked into a rehab. It took hours to get in, at which point I was shaking badly, and on the verge of freaking out completely. I finally got in, and was given a Valium for my blood pressure. I was assigned a bed, and I laid down to sleep, and I felt that everything would be alright. I couldnt have been more mistaken. </p><p>I was jolted from a deep sleep by pure, crystalline, heart stopping panic. I had been asleep for maybe an hour, and no trace of the Valium remained. (I later learned that elevated liver enzymes can burn through sedatives in a flash) I am emetophobic, and I felt like I was going to die.  I found out that the nurses were not going to keep giving me Valium, and so I gritted my teeth and hung on. I hallucinated, I stopped breathing, I couldnt sleep for fear my apnea would cause me to die in my sleep, I sweated, I hallucinated some more. Horrible, mind-tearing visual and tactile hallucinations. I would fall asleep, and wake up screaming, my heart pounding in my chest. I was convinced that wild dogs were in the room, trying to tear me apart. At this point, seizures were a very real danger. I begged them to give me something, anything. Nothing. Not even a tums. Acid reflux was burning up my throat, my diarrhoea was so bad, bile was running out of me, burning my ass. All the while, the terrible fear. After six or eight hours of this, I couldnt take it anymore. </p><p>I checked myself out against their advice, signed a release, and got the hell out of there. The moaning, zombie like inmates, shuffling around, or puking blood in the washrooms, the worst smell I had ever smelt in my life. All my senses ridiculously heightened, smell, hearing, touch. If a mouse farted it would blast me out of a stupor.</p><p>Once outside, I breathed the fresh air, and felt a bit better. I discovered that walking, mile after mile, feet in agony, back muscles spasming, was a good therapy, especially for the panic. On and on. The hospital was ten miles away. I walked there. Waited in the ER for another eternity. Couldnt get in. </p><p>Walked home, maybe another five miles. Tried to lay down, trembling, awful terror, hallucinated that there were worms in my veins. I felt like I had to crush the bulging veins to kill them. On and on, fell asleep briefly near dawn, felt that the worst was over. It wasnt. Terrified all the next day, walked all over the city, trying to find someone to help me, a counsellor, a priest, anything. It was Good Friday and I walked to a large church. It was closed, I fell down and started crying on the sidewalk. Im not religious, but at that moment I prayed to God to help give me strength. I was a dirty, smelly, outcast, and fortunately there werent a lot of people around. I saw a notice for a clinic several miles away and walked there. I was completely exhausted, and looked right at home with the street people in the waiting room. The mosaic tile on the floor looked like devil faces and tormented souls writhing in agony. I held on to a thread  of sanity, I was ready to just step in front of a bus or train. </p><p>Finally a doc saw me, and gave me some electrolytes and some Ativan, and maybe Librium, cant remember. I told them I was suicidal, and a shrink saw me, I was sobbing like a child, and then the drugs took hold and I could pass out in an instant, but the slightest noise would wake me. Back in the waiting room. Back to see another counsellor, Drug addiction counselling. Help numbers, a leaflet on AA, and other groups. I felt so grateful. I walked home, spent three more days of rampant panic attacks, made almost bearable by the pills, and then the emotional and financial fallout. I was an emotional basket case for weeks afterward, and I should mention here that my employer was life-saving. They had put me on sick leave, and welcomed me back, and told no one. This act of kindness still makes me teary, I cant imagine what would have happened if I had lost my job.</p><p>The stupidity of alcoholism didnt end there. I did this twice more. Finally, I killed it. My romance with this seductive, deadly poison was over. I no longer crave it, or even feel any temptation or loss of social connection. It took me years to get to this point, but once I got there, it accelerated rapidly, it totally blind-sided me.  I dont care what anyone else does, I dont preach.  If you want to drink, drink. Not me brother, Ive had it.</p>"
}
