{
 "title": "Met myself",
 "author": "Andy",
 "citation": "   Andy. \"Met myself: experience with DXM (ID 6782)\". Erowid.org. Jul 1, 2001. erowid.org/exp/6782",
 "substance": "DXM",
 "bodyweight": "66 kg",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 6782",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 1, 2001",
   "Views: 12235",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA friend had suggested trying a substance called DXM found in two cough mixtures here in South Africa. I tried it and enjoyed the first few times. Normally chugging a whole bottle and reaching the second plateau.</p><p>The time in question I drank the bottle of Cepacol and went to sleep. The Cepacol is filled with anti-hystimines so it knocks you out. I awoke and had a momentary panic as I had no idea what was 'wrong' with me. Only when I glanced the empty bottle on the table did I remember and relax and start enjoying the trip.</p><p>Keeping one's eyes open after Cepacol is quite a mission so I lay there experiencing some amazing closed eye visuals. Nothing too wayout until......... </p><p>Suddenly I was walking through a narrow little dark alley. The ground was cobbled, the buildings close together and the air heavy with smoke/smog. I looked up and saw one window with a little light flickering behind it - candlelight. Then it hit me. I was in London sometime during the Dickens era. The time of chimney sweeps, filthy children working in the coal mines and pickpockets. This was no hallucination, it felt so real I could feel and smell and hear it. </p><p>I walked around the corner looking at everything, the detail was amazing, I could see the scuff marks on the individual cobbles, the dirty edges of the window frames........ everything!! There was this old man warming himself at a fire set in a drum or bin with holes punched ito it. I asked him if I could warm myself too. He was a decidely scruffy chap. Old top hat with the top upright, torn woolly  gloves and a tatty overcoat. Your typical movie bum.</p><p>He welcomed me telling me to sit on a box across from him, he said his name was Jafta and that he had lots of things to tell me. From there I can remember nothing about what he told me except that it was advice to me about my life, the people I should stay away from, the friendships I should make, the direction my career should go in, where I should look for happiness. It was unbelievable!! This old beggar knew everything about me, and many things I had never known consciously or admitted to myself. I am unable to remember any of the concrete details but I know that that conversation is stored in my subconscious and I have done some drastic life changing since then.</p><p>When he finally finished talking to me I asked Jafta how he knew so much about me, my thoughts, my life, everything! He gave me the most beautiful smile and said to me ' I am you........... We're all you. I looked around and saw about 8 men all sitting around us, on the periphery. They were all smiling at me with utter beauty even though very few had teeth and were all dressed in rags similar to Jafta. They varied in age between me and Jafta. I realised that they were me at various stages in life. I have never felt so at peace and content as that moment when I realised I was sitting in the company of 9 other me's and they had been through times that I have yet to come to. </p><p>I awoke from this experience, still quite UTI and without enough sense to try and write down what Jafta had told me. None of the detail remains but if ever I had a life changing experience it was that one. I have no idea how long it lasted in real time but it felt as if I'd been talking to him all night, about 6 hours. I got off the couch and went straight to bed.</p><p>The next time I took 300mg of DXm - about 6 months later, I had a horrific time. I remember nothing about the trip (thank goodness) but I 'came to' feeling filthy and revolted. Something bad had happened to me. I felt as if the drug/Jafta was telling me that I had got what I came looking for the last time, and that everytime I went back there it would be worse for me. </p><p>I enjoyed DXM and gained something I value very much and wish others could experience, but I won't go back for a while yet.</p>"
}
