{
 "title": "My Own Personal Clinical Trial",
 "author": "Ardkorjunglist",
 "citation": "   Ardkorjunglist. \"My Own Personal Clinical Trial: experience with Selegiline & Escitalopram (ID 67864)\". Erowid.org. Dec 20, 2007. erowid.org/exp/67864",
 "substance": "Selegiline & Escitalopram",
 "bodyweight": "68 kg",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "oral",
   "Pharms - Selegeline",
   "(daily)",
   " ",
   "10 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67864",
   "Male",
   " ",
   "Not Given",
   "Dec 20, 2007",
   "Views: 20273",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>BACKGROUND:</p><p>I've been on (& off) various antidepressants (all SSRIs) throughout my teenage & adult life.  I've been prescribed 10mg escitalopram daily for a few months now, for unipolar depression, with limited success.  </p><p>I have a mild autistic spectrum disorder which resembles ADHD more than anything else, although a previous diagnosis of Asperger's syndrome prevents the doctors from treating it.  </p><p>TREATMENT:</p><p>So I got hold of some Juprenil (selegiline), and decided (as I didn't have the time to wait the two week wash-out period from escitalopram) to trial escitalopram (10mg daily) + selegiline (5mg daily) concomitantly.  I take escitalopram in the evening/night time, before I go to sleep, and selegiline when I wake up.</p><p>EFFECTS:</p><p>So far, (3 weeks in,) this combination seems to have worked wonders, effective almost immediately, firstly on my depressive symptoms (elevated mood, increased sociability, lack of suicidal ideation, no more lethargy!), and secondly on many of the ADHD/Aspergy-type symptoms which have been holding me back all these years: Better concentration, enthusiasm & motivation to complete goal-directed activities and tasks involving long term reward have been greatly increased, and I feel more able to meet the demands of everyday life.  </p><p>SIDE-EFFECTS:</p><p>I can confirm that I have experienced very few (if any) side effects resulting from interaction between the two drugs that could not be attributable to either drug alone.  I have occasionally had mild yet pleasant euphoria, a little bit of a gurn (teeth clenching), mild tachycardia (and probably a slightly elevated blood pressure & temperature, though I haven't measured these yet).  All of these effects were noted in conjunction with each other, usually for no more than a couple of hours at a time, in the morning, and beginning between 1 & 4 hours after waking up. Most days these effects are not present.</p><p>FURTHER DRUG-DRUG INTERACTIONS:</p><p>It is worth noting that any drug that inhibits the breakdown of dopamine has the potential to amplify the rewarding effects of any recreational drug which causes the release of dopamine, including but not limited to: nicotine, alcohol, caffeine, cannabis, amphetamine, MDMA & other substituted amphetamines, and cocaine. Too much dopaminergic activity can cause a hypertensive crisis, so extra care should be taken when consuming any of the above concomitantly with selegiline.  </p><p>***SPECIAL WARNING*** :</p><p>I have taken some of the above substances whilst on selegiline+escitalopram, and have generally found I require less of the substance in question to have a comparable effect. A cup of coffee for example, goes a long way! </p><p>HOWEVER: Something which I was not expecting, was that after consuming \n</p><p>I have repeated this experience a couple of times, (benzodiazepines on standby!) and it always appears to be an effect of drinking black tea, normally known for its antioxidant & calming properties, but apparently not in conjunction with selegiline & escitalopram.  I was able to calm myself down by drinking a large amount of cold water, removing my shoes, lying down, and breathing slowly, deeply and calmly.  </p><p>I have noticed a very mild stimulant effect from drinking tea with milk in, but nothing like the black tea reaction.  Even black coffee has nowhere near the same effect.  I am presuming it is something to do with either the theophylline or theanine (or both).  </p><p>DOSING:</p><p>At the dose of selegiline which I have been taking, I believe that it has retained its selectivity for the MAO-B isoform, and is therefore not inhibiting the breakdown of serotonin, or of tyramine (I have not noticed any of the side effects associated with eating tyramine-rich foods, which should closely resemble having too much ephedrine) although I do feel a warm euphoria after drinking a mug of cocoa.  Whether this is merely due to the increase in reward of drinking a mug of hot cocoa or the absorption of phenylethylamine into the bloodstream I cannot say, because I love chocolate so much anyway.</p><p>CONCLUSION:</p><p>I decided to write this report as there seems to be very little information available concerning the effects of combining selegiline with SSRIs, and what little there is, is either conflicting, confusing, or merely based on theory (or 'professional opinion').  So, I have conducted my own personal clinical trial (n=1) to determine whether it is safe to combine these chemicals at the aforementioned dosage levels.  Since it works for me at the moment, I will not be changing any of the parameters, so this study will conclude that it is indeed safe for me to take this drug combination under careful self-supervision, and will go no further than to suggest that more research needs to be done into this treatment approach, whether for major depressive disorder, dysthymic disorder, ADHD, Autistic Spectrum Disorders, or simply for getting shit done!</p><p>Sincerely hoping this was useful,</p><p>Seb.</p><p>P.S. In response to a previous post, ('Wellbeing, Ruined My Sleep'), I would advise against taking selegiline with Zyban (aka Bupropion) as the two drugs inhibit some of the liver (Cytochrome P450) enzymes responsible for breaking each other down, which could increase either drug's plasma concentration after repeated doses to ridiculously high levels. Selegiline does however (on its own) seem to have some quite beneficial characteristics, being antioxidant & neuroprotective.  In some previous clinical trials, continued administration of selegiline was shown to increase the life expectancy of rats by up to 20%! That's the other reason I got some anyway...</p>"
}
