{
 "title": "Withdrawal",
 "author": "cootacatta",
 "citation": "   cootacatta. \"Withdrawal: experience with Caffeine (ID 67860)\". Erowid.org. Jul 16, 2011. erowid.org/exp/67860",
 "substance": "Caffeine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67860",
   "Male",
   " ",
   "Not Given",
   "Jul 16, 2011",
   "Views: 4632",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm going to describe my withdrawal experience to encourage others to quit taking so much caffeine. I got into a bad habit with studying in school, and developing a tolerance quickly, and suddenly realized that I had to take 2 caffeine pills and barely feel any effect. I've taken caffeine before and stopped, but never gotten past 100mg at a time, so I realized it was time to quit, at least for a while so my tolerance went down. </p><p>I quit cold turkey and made sure it was a good time. I was at home for break and had plenty of free time, and not many commitments. I took my last dose on Sunday at 2PM. I felt very tired and would sleep at least 10 hours a night, up to 12. I would also feel tired during the day and take naps of 1-2 hours. Headaches started after about only 1 day and got worse, peaking at about 3 days. I also felt no motivation, just like not doing anything important. At one point, after 3 days, I woke up feeling great, but then I felt really dizzy and light-headed. I laid down and tried to sleep for while, but even after I woke up after a short nap, I was still dizzy. It eventually went away, and what helped was not moving or turning my head quickly. </p><p>Anyway, after 4 days, now, I'm not getting headaches any more and I feel better. I was lucky that I didn't get nausea, and my appetite increased remarkably. I didn't realize before how much caffeine suppressed my appetite, because I'd still be hungry, just not as much. I found it fairly easy to quit. Just found time when I had like a few days  off, and slept a lot. It makes the headaches go away, and I couldn't feel pain while asleep. I used melatonin to help me sleep more often. I tried a couple headache medicines- ibuprofen and aleve- but they didn't help. Just took time.</p>"
}
