{
 "title": "Up Your Dose!",
 "author": "Moses Spice",
 "citation": "   Moses Spice. \"Up Your Dose!: experience with 2C-I & Toad Venom (ID 67862)\". Erowid.org. Jan 28, 2010. erowid.org/exp/67862",
 "substance": "2C-I & Toad Venom",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "2C-I",
   "(capsule)",
   "  T+ 4:30",
   "1 hit",
   "smoked",
   "Toad Venom",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "67862",
   "Male",
   " ",
   "Not Given",
   "Jan 28, 2010",
   "8938",
   " "
  ]
 ],
 "report": "<p>After taking 21mg (and then adding another 6mg after 2 hours) of 2C-I the previous day and having a mild but pleasant trip, I decided to take a single slightly larger dose to test the effects. </p><p>+0:00</p><p>I opened up my 30mg gel capsule and dumped the contents into water with the hope that the effects would come on more quickly. I poured the 2C-I into a shot glass full of water, downed the shot, and then refilled the glass two times and drank that as well. To make sure I got all of the 2C-I, I also licked the inside of the glass and swallowed the emptied capsule.</p><p>I hadn't really planned to have this experience, so the 2C-I was ingested on a full stomach.</p><p>+0:30</p><p>Begin to feel a very slight tingling down around my ankles. A bit fidgity. Some friends are heading off to the supermarket, so I decide to join them for the ride.</p><p>+1:00-1:30</p><p>From the time I entered the supermarket to the time I left about 30 minutes later, the effects of the 2C-I became obvious. I felt detached from the other people in the supermarket and avoided eye contact. Was looking for something and couldn't find it, but I was not prepared to ask a question with somebody working there face to face.</p><p>+2:30</p><p>Back from the supermarket, and I'm regretting having taken the 2C-I on a full stomach. I take the first of what would be 4 or 5 shits that night, each of which make me feel more relaxed. The stucco on the wall in the bathroom is lightly undulating in wavy patterns, similar to what I've seen on LSD in the past.</p><p>I get the sudden urge to listen to some good music. My choice of Sly and the Family Stone's 'Fresh' album was perfect. Sly Stone was definitely fucked up on something during the recording of his vocals. Very heartfelt.</p><p>+3:00</p><p>Still tripping, but also still chilling... this is a very smooth drug. I'm relaxed and warm with a feeling of radiant heat (but not as hot as what I've experienced usually on mushrooms before). When people move around I'm seeing some trails. Feeling thirsty, I remember that drinking water is of the utmost importance!</p><p>+4:30</p><p>I've been watching a spinning sun mobile (and it's shadow on the wall) for about 30 minutes now. The Dalai Lama chanting in the background is pretty intense, but also a bit cheesy. I feel like I've descended from my not-too-intense peak a bit, so I smoke a very small dose of toad venom in the hope that it will bring me back to a higher plane. The dose is too small to feel anything significant, but I do notice a brief alteration in my depth perception making it difficult to write clearly.</p><p>After this, people in the house I was in started fighting and I stayed out of their way. The 2C-I continued to fade, and I was able to attempt sleep by +7:30, although I probably didn't fall asleep until about +9:00. </p><p>I think that I will experiment with 40mg or 50mg of 2C-I next time. My feeling is that this would probably still be within my comfort zone. Of course, I've seen other people tripping quite well at 15mg to 25mg, so you'll just have to test 2C-I out for yourself!</p>"
}
