{
 "title": "Memory Exploration",
 "author": "Yakov",
 "citation": "   Yakov. \"Memory Exploration: experience with Mushrooms - P. cubensis & Cannabis (ID 67872)\". Erowid.org. Jun 27, 2008. erowid.org/exp/67872",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 2:00",
   "4 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67872",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 27, 2008",
   "Views: 16302",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background:</p><p>I am 17 and considers myself fairly well versed in psychoactive compounds. I had taken mushrooms about 10 times prior to this experience. At the time of ingestion I was not taking any supplements, vitamins, nicotine, or caffeine.</p><p>Set/Setting:</p><p>My friend J, his girlfriend A, and myself drove up to J's cabin in the mountains. It is a mid sized fairly nice cabin in a beautiful mountain setting. I felt very comfortable and was not feeling stressed or depressed at all.</p><p>The experience:</p><p>T=0:00 (about 12:00pm)</p><p>'A' measured out 3.5g of dried Psilocybe Cubensis mushrooms for each of us. I crushed mine to pill sized chunks, mixed in a big glass of orange juice and drank/swallowed the concoction (I can't stand the taste of mushrooms and have found this to be the proffered method of ingestion). J had a childhood copy of 'The Beatles, Yellow submarine' movie, which we decided to watch as we came up. If you have never seen this film, it can be a trippy experience without the use of psychedelics.</p><p>T=1:00 </p><p>The movie ended and as I stood up I realized I was feeling very different. The film had messed with my head quite a bit and I was eager to get outside with my friends for some reality reference (My mind had gotten intertwined with the movie and I was a little out of touch with reality). As I came outside to see the trees and mountains I was blown away by the beauty. The mushrooms enhanced my visual appreciation significantly, everything was so pretty I was literally ecstatic. After a short while of enjoying the forest and sun, J and A wanted to smoke a bowl.</p><p>T=2:00</p><p>I should note here that I seem to get more significant short term memory loss from weed than most people but nothing extreme.</p><p>I normally would have turned down the weed, but I was feeling so good I didn't think anything could bring me down. 'A' loaded a bowl of some of her best chronic. I was enjoying the visuals I was getting off the wooden ceiling and was offered the pipe. In all I took about 4 hits (this is enough to get me very high normally). As I exhaled the last hit I remember my visuals start to change very rapidly, my mindset got very narrow and I thought I was in some sort of early video game like asteroids or tetris. I started playing this game with the world around me. Soon after I noticed a strange smell. I quickly identified it as salvia. (note: there was no salvia with us or involved at all) This smell quickly made me analyze my surrounding and mindset. I felt as though I had tapped into the mindset I get with a strong salvia trip (Salvia has never treated me well). Here an indistinguishable period of time goes by similar to what happens between this world and the foreign realities I perceive on a salvia trip. </p><p>The next thing I remember I am sitting on the deck looking at the mountains with my friend J sitting next to me. (Time becomes a foreign topic and thus I can only estimate) I guess that only about 10 minutes have passed since I smoked the chronic. In the undetermined time my consciousness somehow separated itself from all my memory including many almost instinctual ideas inherent in being human. I had essentially returned to my state of mind at birth, with the exception of language. This is interesting to note because I could say things and not know what they meant. Often times I would say something and then ask what it meant. Its important to understand the severity of my loss of memory, I had no knowledge of my mother or her name, or what a mother was for that matter. I didn't understand the idea of the earth, or what a human was, or anything else that anyone else on earth would think was common sense or knowledge. I was an anonymous entity sitting next to a strange figure looking at some snow capt pointed things (but I didn't know what snow was). At this point J had no idea what had happened, however it quickly became apparent that something was different when </p><p>I began asking ridiculous questions. The first thing I asked was 'What do we do?'. This seemed natural to me since we were just sitting and I figured there had to be some sort of purpose or thing to do in this world. After a few confused responses and more questions J realized that something was wrong and just told me that we where supposed to enjoy the mushrooms and have fun tripping. The ideas of ingesting something and having effect from it where so foreign to me that this made no sense. He then told me to just sit down and chill out. So I lay and sat around in different location each time expecting something specific and interesting to happen. I was able to relearn things but at a slow rate, it will take about 4 hours before I start to be a functional human again. Soon I get help from J and A basically reteaching me everything I should know (We are your friends who you hang out with because you like us, we live on a planet called earth and are humans' etc.). Each time I learned/remembered something new I thought it was the most amazing experience. Like I was recovering rapidly from some disease. At times I thought I was back to normal again only to realize that I would have huge delusions based on the information I had remembered. </p><p>The biggest jump was when I understood the idea of taking a drug to alter your mind. This explained a lot of why I didn't know anything. I could go on and on with funny little things that happened in the process of regaining my memory, but I will only mention a few that stick out. At one point when J and A where trying to explain to me what a friend was I thought I understood that they where gods that had lifted me out of my other life to heaven. Although they where worried at first they got a kick out of my reactions and lack of knowledge as they nursed my mind back to its normal state. Sometimes they would quiz me, saying one of your brothers is named X, you have 2 more what are there names? sometimes I would do well other times not so much. By the next morning I had all the details worked out and my brain had recovered all its former knowledge (I hope :D).</p><p>Reaction:</p><p>This was a very interesting experience and I did not find it negative in any way. I felt a little bad for my friends but they had fun with my ridiculous reactions. I have not heard of anyone else having a similar experience but would be curious to know. I think that the perceptual distortions available from using mushrooms where all converted to memory loss by the weed acting as a sort of catalyst. I had perfect memory of the time after being reborn just no memory of my past life. I don't smoke weed on psychedelics anymore as it clouds my mind and makes me worry about a repeat experience. This was an interesting one time experience.</p>"
}
