{
 "title": "The Other Side",
 "author": "TwoIsOneTooMany",
 "citation": "   TwoIsOneTooMany. \"The Other Side: experience with DOC, DOM & Cannabis (ID 67895)\". Erowid.org. Feb 14, 2008. erowid.org/exp/67895",
 "substance": "DOC, DOM & Cannabis",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "DOM",
   " ",
   "4.0 mg",
   "oral",
   "DOC",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2007",
   "67895",
   "Male",
   " ",
   "Not Given",
   "Feb 14, 2008",
   "Views: 7718",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday I decided to mix two of my favorite new research chemicals. [Erowid Note: Having been a street drug in the 1960s, DOM is not currently considered a research chemical.] The decision came after trying them both out two or three times and figuring they might go together nicely. Id gotten a good nights rest before and hadnt tripped in a week or so. I currently live with my fiancé and her mother. I got ready for the experience by eating light. The DOC usually makes me as nauseous as a full dose of mescaline with the same dizziness and light-headedness right before the purge. Only if I have something in my stomach though. I dosed at about 4 A.M. </p><p>I laid back down in bed and closed my eyes and started listening to Nine Inch Nails The Fragile the waves of electronic distortion are always beautiful to me but after about three or four songs I noticed a shimmering quality to the room and a slight body tightness. Im used to this tightness on medium to high doses of Acid. Its similar to tension that I can either reject or get used to. When Ive become afraid or sensed it as the drug hurting me before it usually causes negative or perhaps nervous experiences, this time as many times have been now I felt more aware. Its weird how time seems to take on a different level with many chemicals, almost as if its perception was in reality directly linked to me and not the outside world. </p><p>The experience soon became overwhelming in that I could not lay still anymore. This was perhaps an hour after dosing. I got up. DOM is very smooth but DOC can leave a few negative body side effects as I said before very similar to mescaline, for instance: hands and feet like ice, overall sense of nausea to where even drinking water becomes impossible, complete loss of appetite (not present with just DOM) and an inability to remain very still. Although it sounds odd I would say that it is more possible to remain still when one accepts that stillness is in fact very alive and extremely intense. I smoked MJ once or twice early on but found its effects to be slight.</p><p>Something about the overwhelming quality of the DOC and DOM mixed just overpowered any noticeable effects until at least 14 hours in. I do however believe that the negative effects of the DOC were not actual in any sense. Moreso they were like the tension I had earlier, just me unused to the effects of the chemical. Since DOC is newer to me though I still have been quite overpowered by its visual quality when I have taken it. If I couldve gotten over trying to keep myself warm and covered (even though the house is quite cold) I might have relaxed into the experience a bit deeper. In my defense however I had never mixed these two before.</p><p>The experience made watching movies later in the day far easier than is normal for me and much more enjoyable as it usually does. Outside became a wonderful alternative about 6-12 hours in what I would call the peak. The silence was so overwhelming, it would be pointless to try to describe in words any of some parts of the experience but especially this one. The sound of Wind. The longing in your heart. Its all so amazing when you stop looking at or for it all. Its all still there.</p><p>Musically these chemicals are wonderful. Visually quite striking but indescribable. The overall feeling was one of happiness and change. One last note. I danced with my fiancé to Wild Horses our song by the Rolling Stones. If youve never experienced their music take a minute to let this song sink in. Never forget. I dont know you. I love you.</p><p>Childhood living is easy to do</p><p>The things you wanted I bought them for you</p><p>Graceless lady you know who I am</p><p>You know I cant let you slide through my hands</p><p>Wild horses couldnt drag me away</p><p>Wild, wild horses, couldnt drag me away</p><p>I watched you suffer a dull aching pain</p><p>Now you decided to show me the same</p><p>No sweeping exits or offstage lines</p><p>Could make me feel bitter or treat you unkind</p><p>Wild horses couldnt drag me away</p><p>Wild, wild horses, couldnt drag me away</p><p>I know I dreamed you a sin and a lie</p><p>I have my freedom but I dont have much time</p><p>Faith has been broken, tears must be cried</p><p>Lets do some living after we die</p><p>Wild horses couldnt drag me away</p><p>Wild, wild horses, well ride them some day</p><p>Wild horses couldnt drag me away</p><p>Wild, wild horses, well ride them some day</p>"
}
