{
 "title": "Sweet Joy",
 "author": "Annonymous Jock",
 "citation": "   Annonymous Jock. \"Sweet Joy: experience with Chloroform (ID 67893)\". Erowid.org. Feb 17, 2009. erowid.org/exp/67893",
 "substance": "Chloroform",
 "bodyweight": "100 lb",
 "header": [],
 "footer": [
  [
   "2007",
   "ID: 67893",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 17, 2009",
   "Views: 16791",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nIt has been five days since my last chlorofom binge.  This is by far the best solvent that I have had the pleasure of huffing! :)  </p><p>I obtained some CHCL3 sometime ago, analytical grade.  I have alot of it and I think I'm psychologically addicted!</p><p>The experience on chloroform is very heavy, but despite what ppl say, I have experienced no hangovers.  The only thing that I have noticed is after using chloro regularly for several nights (usually at weekends) my lungs can not comfortably take as much tobacco smoke as usual, this may be due to damage caused by this chlorinated hydrocarbon.  In fact it is usually rather unpleasant to smoke a cigarette on the monday.  If I stay off it for a few days this effect seems to subside somewhat.</p><p>The effects</p><p>Chloro is alot like ether, except you really can't go too far with ether.  With chloro you definately can, a useful analogy to bear in mind when using chloro is: its like mixing benzos and alchohol in that you have to strike a balance or you will end up loosing a couple of hours or even the whole night! Also you can taste ether on your breath for hours after a binge whereas chloro is gone when the intox. is gone.</p><p>After the first huff of the sweet stuff one does not feel anything.  However, after three good huffs and holds the intoxication sets in.  Your head begins to pleasantly throb as the intoxication washes over you.  There is a distinctive waah waah wahh in your ears that increases the further you go (unless you are listening to very loud music), your vision becomes grainy but detailed at the same time (I recommend watching some winamp or media player visuals).  </p><p>After a few more huffs the experience takes on a bodily turn, your midsection and face becomes 'pseudo-numb.'  It feels like jelly.  Despite this, the feeling in your centre and extremities is still present, if it is touched the stimulation feels as it would always feel.</p><p>After 15 or 20 huffs Im gone, not passed out but highly intoxicated, (ether does not come on so strong so fast and there appears to be a peak with ether,  point whereby you can go no further ,you end up using all of your ether and getting nowhere) this is where my psychomotor skills deminish rapidly, standing is almost impossible and manipulating objects such as the remote or a glass becomes difficult.  It feels as though I am in a box looking out on what my hands or legs are doing.  Its like taking a step back from life, my worries are gone because of the shear intensity of the experience, I cannot think of anything else because simple tasks take so much concentration.</p><p>When I come to the edge of consciousness i usually loose most of the feeling in my limbs (legs/arms) but its not the same sensation as when you sit on your feet for sometime and then try to walk, there is a little more feeling than that.  Its not like walking on knee stumps! :).  Time is majorly warped; 20 min to hours can be lost, my eyes are very heavy and jaw is very heavy, my whole body feels extremely drunk but instead of being depressed (like drunkeness) I am more surpressed, Im slumped in a chair but I feel like I could quite easily get up and walk somewhere (I prob couldnt, I have never been arsed to try when I have reached this level of intox.).  It is at this point that it is a good idea to glance over at everyone from your box of intoxication, make sure you have a rag full of chloro, make sure they are ok and everything is secure 'cos you're gonna be out for sometime (depending how many huffs you've had)! Time and social space is just about to be massively altered and often majorly mixed up :)</p><p>With me, the next morning feels fine, I am as awake as usual and there are no adverse effects until I smoke a cigarette (see above).</p><p>I have only lost it like this once where I lost 4 hours and I was apparently waking, huffing, falling unconcious, waking, huffing and so on during this 4 hours that I cannot remember!</p><p>Be warned, chloro is not for the faint hearted.  But, if used sensibly it is great !!! :)</p>"
}
