{
 "title": "Withdrawal after Daily Use",
 "author": "jonnyblades",
 "citation": "   jonnyblades. \"Withdrawal after Daily Use: experience with GBL (ID 67917)\". Erowid.org. Jul 24, 2009. erowid.org/exp/67917",
 "substance": "GBL",
 "bodyweight": "95 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 ml",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 5:00",
   "3 tablets",
   "oral",
   "Pharms - Zopiclone",
   " ",
   "  T+ 5:00",
   "1 hit",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 5:00",
   "1 shot",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 0:00",
   "3 tablets",
   "oral",
   "Pharms - Zopiclone",
   " ",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 24:00",
   "4 lbs",
   "oral",
   "Pharms - Zopiclone",
   " ",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   " "
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 67917",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 24, 2009",
   "Views: 5048",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ahhhhhh! So, the time has become, the time for the straight and narrow. I've had a 12 year drug habit and it is time I kicked it, after being sucked in by GBL binges... Recreationally of course ;). I joined or registered within a group called addaction. After necking my way through litres of GBL since March (which my habit became more so in past moons) my life turned into a complete arse. First of all, I lost one job, then my driving license, then a second job, then a second arrest....all on GBL and all through GBL. So, this is why I have decided its time for counseling and the 'straight and narrow'. </p><p>For the past three weeks I have been taking GBL 24/7 [125ml per 3-5 days, concentration not specified], to withdraw is to go into DT mode; shakes, paranoia, anxiety ETC (typical come down syndrome), the withdrawal to this evil shit has been compared to heroin. I aint on here to act big by speaking about this; this is for me.</p><p>So, I'm a fuckin coward, I want off this shite....I'm off it now. </p><p>First of all I arranged a doctor's appointment, 10 Zopiclone ordered! Or demanded. Then I bought myself 2 litres of whisky and a 8th of green.</p><p>Saturday, 12pm. I had approx 100ml of GBL left in a bottle. I measured one huge dose, 4mls, enough for one more trip into a GBL coma. Then in a ritual type way, I poured the rest down the sink, cursing the fuckin stuff. I necked my dose.....and off to noddy land for one more meeting with the chemical devil. I awoke from my coma around 3pm, I feel euphoric, liquid ecstacy.</p><p>It's now 5pm, the dose has gone and the tremors and shakes and clasps of thunder in my ears awakes me into normality. Here it comes, I'm a coward, so I reach for the zopiclone, 3, a quick bong and a large measure of whisky. BANG. I'm out.</p><p>BANG....BANG....BANG.....it's the door, my neighbour's having a heart attack....the only thing I could mutter was .....he'll be alright. What an arsehole I feel. But fuck me I could not even walk. BANG,three more Zop's some more whisky......</p><p>It's now sunday afternoon, my mother's dog lays faithfully, caringly by my side, it's like he knows what's going on.....god he does know. I kiss him, he licks me with affection as I eat the rest of the zops....my greeen has all gone....has the dog ate my stash?!?! I can't remember smoking it! I have 1 litre of whisky left......BANG I'm out.</p><p>Monday...11pm. My mum walks in. She panics bless her, but she knows the score with my addiction problems. I said to my caring mother 'I know I'm a mess, but this is me getting better, I'm off the GBL'. She cried her heart out hugged me and thanked the lord. I am off it, but cowardly it took me lots of other narcotics to bide my time.</p><p>Tuesday.....spent most of the day shaking, DT mode.</p><p>Wednesday................I started talking to ghosts</p><p>Thursday chanting in my ears, monsters after me</p><p>Heres a warning, dont cane it. It really isnt worth it.</p>"
}
