{
 "title": "Neutralized by Nootropics",
 "author": "The Monkey Mantra",
 "citation": "   The Monkey Mantra. \"Neutralized by Nootropics: experience with DXM, Aniracetam & Caffeine (ID 67972)\". Erowid.org. Dec 31, 2007. erowid.org/exp/67972",
 "substance": "DXM, Aniracetam & Caffeine",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "Aniracetam",
   "(pill / tablet)",
   " ",
   "0.75 ",
   "oral",
   "DXM",
   "(liquid)",
   " ",
   "1 glass",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "67972",
   "Male",
   " ",
   "Not Given",
   "Dec 31, 2007",
   "12152",
   " "
  ]
 ],
 "report": "<p>On Christmas day I decided to go for a medium-length run - about 4 miles, ending up at the only place that was open, a grocery store. I ducked into the store for water, warmth, and a caffeinated Jamba Juice smoothie, but found myself inexplicably (I'm a total head, but let's pretend I have *some* dignity left) drawn toward the cough medicine in the middle of my endorphin high. I grabbed a bottle of Daytime Cough, orange-pineapple flavor, thinking it might be menthol-free, and headed to the bathroom post-purchase.</p><p>After downing three-fourths of the bottle I began the long journey home. I did eventually feel effects from the DXM, but they got lost in the mellow stroll back up the hill to my house. When I finally got home, I headed to bed to experience the usual dreamy and physically distorting effects of DXM. They never developed. Even though I drank three-fourths of the bottle, I felt like I'd only had a third of that.</p><p>The only explanations I can come up with are a) exercise and bodily movement somehow prevents some of the effects of DXM or b) the 750 mg of Aniracetam I'd consumed in the morning really took a bite out of the effects. I don't really feel much from Aniracetam on its own. In fact, I'm not sure I buy into the whole smart-drug thing in general. However, I do know that the 'racetams have all kinds of weird interactions with glutamate receptors, so it's the best theory I have. Just thought I'd share this story in hopes of hearing the experiences of others with similar combinations. Thanks!</p>"
}
