{
 "title": "Salvia Caught Me Off Guard",
 "author": "Sun God",
 "citation": "   Sun God. \"Salvia Caught Me Off Guard: experience with Salvia divinorum (5x extract) (ID 6798)\". Erowid.org. May 1, 2002. erowid.org/exp/6798",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "230 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6798",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 1, 2002",
   "Views: 6232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI got my first job out of college in a new city.  After numerous failed attempts at scoring some weed, I got desparate and started looking around on the net for ways to get high legally.  I found this herbal site and ordered a bunch of stuff and I nonchalantly included a 1 gram bottle of salvia 5x in my order, since the ad said it would 'activate the dream centers of the brain...'<br>Without knowing what I was doing I started experimenting with the salvia to see what it did.  Since I was smoking it wrong (unbeknownst at the time) I wasn't really feeling anything.  I was just mixing a little bit with an herbal blend and casually smoking it out of a regular pipe.  I felt the mild effects of the herbal blend and nothing more.  I started to think this shit was useless.<br>Then one day I got cocky and thought 'this shit hasn't done anything yet, I'll just load the rest of my bottle into my bong by itself and hit it and see if I can get something.'  I did that and casually started smoking the extract.  Since it was in a bong I took a big, pure hit and held it in for a long time.  I wasn't really expecting anything so I went for another hit.  Then I paused for a minute, distracted by a tv program, not giving the salvia a second thought.<br>Out of the blue I was knocked on my ass and, since I wasn't expecting anything to happen, started to freak out a bit.  Out of nowhere the room seemed to pulsate around my head.  It was like the room was beating to a strange ryhthym.  I got up and tried to walk but I couldn't walk well and I felt as if something were forcefully moving my feet as I walked.  I started to panic and walked over to my computer (thinking I'd play a game or something).  I stare at the screen and it seemed completely fixed, but the room around it was like a 3D fabric and the screen seemed to become the center of the fabric.  I started seeing things in the graphics on the screen that seemed completely valid, but when I turned away and looked back at the screen they were gone and I couldn't find them again.  It was kind of like a puzzle that was taken apart and you couldn't put it back together.  Also I got a strong senstaion that my skin was being vibrated by forces coming from different directions, starting from the sides and very deliberately encircling my body until they were coming from the front.<br>Then just as quickly as it began it began to fade and it was over.  Then I was intrigued and got online and read about it and now it makes sense what happened to me.  Moral of the story, smoke the extract in a waterpipe, take huge hits and hold them in a long time and something will happen.  Just be ready for it when it does so you can enjoy it because it is awesome, though short-lived.\n\n\n"
}
