{
 "title": "Alleviates Nicotine Withdrawal",
 "author": "EggMan",
 "citation": "   EggMan. \"Alleviates Nicotine Withdrawal: experience with Melatonin (ID 68064)\". Erowid.org. Jul 19, 2011. erowid.org/exp/68064",
 "substance": "Melatonin",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Melatonin"
  ]
 ],
 "footer": [
  [
   "2007",
   "68064",
   "Male",
   " ",
   "Not Given",
   "Jul 19, 2011",
   "Views: 4839",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began taking 3 mg melatonin tablets after having trouble getting to sleep following a few weekends of parties and late nights out.  I had been experimenting with several new substances in the weeks beforehand and my sleeping and eating patterns were beginning to suffer considerably.</p><p>The bottle suggested taking a tablet in the morning to increase alertness, one in the middle of the day to continue stress relief, and one to five tablets at night to aid sleep.  I was originally only interested in the sleep aid, which initially was extremely effective, although I later found that the tablets were more significant in making me less stressed and anxious throughout the day.  On days that I couldn't afford cigarettes, when I took melatonin I had virtually no nicotine withdrawal whatsoever.  (I do not know if this would be the case with physical nicotine addiction.  When I attempt to quit smoking, I do not suffer any physical symptoms, but I have intense psychological cravings and can barely manage to think about anything other than having a cigarette for about four days straight.  As mentioned, the melatonin essentially eliminated this or reduced it to a very manageable level.)</p><p>I did not experience the lucid dreaming described by many.  I can however get this from having 2 to 4 beers or glasses of wine before bed, the intensity of the dreams increasing with the amount of alcohol consumed.  (I prefer the more relaxing, comforting lucid dreaming achieved with 2 glasses of wine rather than 3 or 4.)</p><p>The tablets did, however, drastically improve the quality of my sleep, and I was generally less prone to waking up at odd times of the night or waking up too early.</p><p>After several weeks of melatonin treatment, my sleeping problems returned, and I began taking 5 to 7 pills before bedtime, growing impatient when the pills became less and less effective as the weeks went on.  This usually did nothing, or made me slightly drowsier, but still unable to sleep.  As a result, I took to self medicating by staying up as late as my body would let me and living with the consequences the next morning.  Eventually my body clock got the hint and I've been able to resume going to sleep at a normal time of day.</p><p>To this day I may have a tablet or two if I'm having trouble getting to sleep, as I find they can be useful if used on an irregular basis.  For habitual use of this drug, I find it much more effective for stress relief rather than helping to induce sleep.</p><p>Also, a word of warning to those with addictive personalities; if you take the pills every night for a week and then stop taking them suddenly you may find it difficult to get to sleep.  I'm sure it's more psychological than anything else.  Indeed, I likely could have been given aspirin at first and told it was melatonin and it probably would have done the trick.</p>"
}
