{
 "title": "Traveling Without Moving",
 "author": "SkiBum",
 "citation": "   SkiBum. \"Traveling Without Moving: experience with MDMA (Esctasy), mushrooms, & Nitrous Oxide (ID 6807)\". Erowid.org. Apr 19, 2002. erowid.org/exp/6807",
 "substance": "MDMA (Esctasy), mushrooms, & Nitrous Oxide",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:30",
   "2 tablets",
   "oral",
   "MDMA",
   " ",
   "  T+ 1:00",
   "4 hits",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6807",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 19, 2002",
   "Views: 20740",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nFirst a little bit of background as to where I was living and the circumstances surrounding the experience. At the time I was living in paradise. It really was. A friend was having an intimate rave (50 people) in a small town just outside a major Canadian ski resort in B.C. and had been adamant that I go. She was an ex but also a very good friend with a huge maternal streak so I felt completely at ease with the idea. I knew I would be safe. The venue itself was perfect. She had somehow managed to persude the owner of a beautiful log home converted to a restaurant to clear out the furniture and voila. A few mattresses in the corner with some couches and we were set. The view was idyllic, one of the largest mountains in the province sat as a backdrop. The location itself bred awe and a sense of spiritual connectedness and wonderment.</p><p>As people began to arrive I decided to take some mushrooms and shortly afterwards I took the MDMA with the  the people I knew and had met. This synced us up quite nicely. I have always found the MDMA experience to be a little shallow. The mushrooms give the experience a level of profoundity that would otherwise be lacking. It didn't take too long before everything and everyone began to look perfect. It was then that I started talking with a women to whom I had only briefly been introduced. We ended up talking for what seemed an endless amount of time and when her husband sat down we all talked. The three of us were oblivious to the party for about thirty minutes. That's when she and her husband mentioned nitrous.</p><p>I said I had never experienced nitrous but was curious. That was when she and her husband led me to the back of their pick-up which was covered with a a canopy.</p><p>When we crawled in the back of the truck I was a bit taken aback at the state of the truck.  It was kinda gross really but damn the torpedoes. I had never tried nitrous and was at this point hyper curious. They had a soda spritzer that they filled with nitrous canisters. Really quite user friendly. I was already in an ultra content state of mind, purring to myself. When she passed me the contraption I put it to my lips, pressed the nozzle,  inhaled...</p><p>Fade out. Recursion. Everything was a mirror image of itself. I was experiencing something akin to traveling at the speed of light. Time had stopped and the environment I was in previously had disappeared. Dissolution really. I had dissolved into what seemed the infiniteness of space and energy. It seemed eternal and it was entirely pleasant. A profound moment of spiritual clarity. I then became aware that I was not alone and as I recrystallized into the present I realized I was no longer in the back of the pick up. The dingy surroundings had been replaced with a cross between a bedouin sheik's opulent tent and some maharaja's palace. It was so rich and vivid that it took me a moment to grasp where I was. There was somuch tecture and depth to the hallucination. What pulled me back was the sound of a truck driving by. It was a broken doppler echoing that was incredibly strange and only barely recognizeable. It was the auditory version of visual 'trails'. I temporarily felt closer to those two humans at that moment then to my own brother. All inhibition was gone and I found myself fiercely wanting to kiss this man's wife. She looked so beautiful and her husband so comical with his lips againt the nozzle. Instantaneously I was back in the truck. No fade in just there. The second inhalation....</p><p>Fade back in and I'm laughing hysterically. it seems contagious as the couple is laughing as hard as I am. He says something that I perceive so distortedly I laugh even harder. I feel like a yo-yo being flung into the infinite and spooled back into this ridiculous reality. Intense hilarity. A feeling of absolute contentedness. Time was blown to pieces. Stretched. What seemed like decades was only 15 minutes. I haven't tried it since but as long as you heed the warnings of people who have been there;  friends, anecdotes on the net etc. you should have a great time on nitrous. My word of advice? Make sure you environment feels 'safe' and all good things in moderation.</p>"
}
