{
 "title": "From Nothing to Nowhere",
 "author": "Lobster Cao",
 "citation": "   Lobster Cao. \"From Nothing to Nowhere: experience with 2C-B-Fly (ID 68125)\". Erowid.org. Sep 16, 2008. erowid.org/exp/68125",
 "substance": "2C-B-Fly",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B-Fly",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 68125",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 16, 2008",
   "Views: 5724",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was chilling at a faire when a most interesting animal approached me. I recognized the animal and it offered me a new treat I had not heard of before. It told me the tale of the 2c-b-fly and asked if I would like to pilot such a craft. </p><p>The gift came in the form of a drop of liquid and though I cannot remember 100% I believe I had 1 drop and not 2. This animal was a wise one and I have all the reason to believe that it used a rather standard dose. So though I do not know the dose amount for sure, I believe it to be in the 10mg range. I gladly accepted the gift and went on my way. It told me that the come up could take an hour or two and to be patient. </p><p>T+ 0h - I was a bit on the tired side, and from what I knew of 2cb, I thought the fly could/would have quite a kick to it. So I went to my tent and decided to lay down for a while and sleep through the come up, expecting the substance to wake me up in true psychoactive fashion. I always loved getting dosing when mostly asleep so that I could wake up into my experience. I soon fell fast asleep and awaited my kiss from the cosmic prince. </p><p>T+ 2 1/2h - I finally woke up at one point though for no apparent reason. I looked at my watch and about 2 and a half hours had passed. To my disappointment I didn't feel much of any activity going on. There was little to no breathing of my tent walls, colors seemed just about the same they did when sober. I had a very slight almost caffeine buzz of energy, but nothing out of the ordinary. No audio enhancement either.</p><p>T+ 3h - I decided to smoke a bowl of herb around this time and sit up and see if I couldn't kick start the experience. After a few bowls, and sitting around I grew tired again so I laid down. </p><p>T+ 3 1/2h - I fell back asleep and didn't wake up until 6 hours later. I felt no burn out or after effects, and was totally back to normal (though I was about 95% normal before anyways).</p><p>Reflections and possibilities:</p><p>I found the experience to be a major let down as I was excited to try out a new chemical that I had no previous experience with. It is possible that doses in the 10mg range are simply just not so effective when taken orally. [Erowid Note: The dose is actually unknown, as mentioned above.] From what I seem to read in other reports I have noticed that the 15mg range seems to provide people a much more active experience. Another thing I would like to see explored is the possibility of cross tolerance with other psychoactives like LSD. I had been using quite a bit of it the past week and days leading up to this night and it is possible that having such a tolerance interfered with this substance and its effects. I look forward to meeting up with this fly in the future and giving it further exploration.</p>"
}
