{
 "title": "A New Stimulus",
 "author": "Palmer Eldridge",
 "citation": "   Palmer Eldridge. \"A New Stimulus: experience with 4-Methylmethcathinone (ID 68150)\". Erowid.org. Feb 5, 2008. erowid.org/exp/68150",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "rectal",
   "4-Methylmethcathinone",
   "(capsule)",
   "  T+ 1:15",
   "200 mg",
   "rectal",
   "4-Methylmethcathinone",
   "(capsule)",
   "  T+ 6:42",
   "210 mg",
   "rectal",
   "4-Methylmethcathinone",
   "(capsule)",
   "  T+ 10:00",
   "5.0 g",
   " ",
   "Kratom",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 68150",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 5, 2008",
   "Views: 34084",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nComment: This material is somewhat like methcathinone, methylone or bk-MBDB, but shorter in duration. It is a euphoric stimulant with some empathetic qualities.<br>Set/setting: I have read positive reports about this material and am keen to try it. I am at home is a safe environment.<br>T=00:47 am: Not a good time for experiment but the only only slot available. (I chose rectal administration because I have found that the most effective with bk-x's.)<br>T=0 100 mg rectal (gel cap). A white powder which has a strong chemical odour, which also smells somewhat like stale urine!<br>T= 00:07 beginning to feel excited but that maybe just anticipation. (no burning sensation as with methylone!)<br>T= 00:17:00 I feel as if my heartbeat is going faster.<br>T= 00:27 Feeling some twinges of something. Feel fairly stimulated and slightly lightheaded but sill functioning on my PC sorting files. Im catching my breathe slightly as I do with methylone and other materials. How much is from what I have readand expect?<br>T= 00:30 Some euphoria now.<br>T= 00:34 Euphoria deepening. Feel good but not with a pushy feeling. I am somewhat nervous. Now I have an urge to write.<br>T= 00:39 Very positive, although I think there is more to this material than this. Yes, music sounds good. I like this. What is it like? The closest is methylone or bk-MBDB, but with a lighter feel, so far.<br>T= 00:44 Still building. Have that I feel good and complete mindset and want to keep it, but still wish for more!<br>T= 00:52 Certainly stimulated but in control. I think Ive reached a plateau now.<br>T= 00:54 Wearing off now? Thats quick!<br>T= 1:08 The impulse to take more is compelling. My mouth is very dry.<br>T= 1:15 200 mg rectal (gel cap)<br>T= 2:00 A feeling of excitement is growing now.<br>T= 2:37 Getting more deeply affected. My vision is slightly blurred and I am finding it hard to concentrate. This is a positive feeling. Less inclination to write now.<br>T= 3:08 This is pleasant. A smooth, relaxed stimulant. I feel very euphoric, looking at stuff on my computer, but frequently drifting off in to reveries, trains of thought. This is a satisfactory level. The material has definite erotic qualities, like other beta ketone compounds.<br>T= 4:03 Still working quite well, but tapering off.<br>T= 6:42 210 mg rectal. I gave in to the desire for more. The desire for more is always there-- typically for stimulants.<br>T= 6:57 Full euphoria returns, but the peak is only about 30 minutes or so, followed by a tapering off periods of an hour or so which is still fun.<br>T= 8.50 Still cant sleep. I have felt that I could sleep, but cant. Ive been up all night and have all the nervousness and disquiet you might expect. I wouldnt say that there were no after effects, but a lot that could be attributed to lack of food a sleep (I have no appetite). (Next time I will take some benzodiazepines at the ends of the experience.)<br>T= 10:00 (approximate) 5g kratom. This made my mood better.<br>T=12:00 onwards. Managed to get some fitful sleep. Slept on and of all day. Taking more kratom got me through and evening going out for a meal with some friends. I felt quite drained all day. I have every intention of taking this again. The short duration and euphoria make it a promising material to experiment with.\n\n\n"
}
