{
 "title": "Primal Union",
 "author": "Shire",
 "citation": "   Shire. \"Primal Union: experience with LSD & Cannabis (ID 68179)\". Erowid.org. Jan 16, 2013. erowid.org/exp/68179",
 "substance": "LSD & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2007",
   "68179",
   "Male",
   " ",
   "Not Given",
   "Jan 16, 2013",
   "1568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The experience I will relate took place in The Great Sand Dunes National Park of Southern Colorado. The setting of these Dunes was to me like no place on this Earth, I felt throughout as if I truly were a traveler on a foreign planet. The place was completely natural; massive dunes shaped only by the wind: the perfect setting for what I would experience. </p><p>My friends and I traveled to the Dunes specifically to camp for two nights and to have an LSD trip. The intention for this venture was to have a spiritual experience, not to use the LSD for recreation: to see crazy visions, or just get fucked up  but to truly use the drug to its potential as an entheogen. (I use this term now but at the time I was only aware that LSD and other hallucinogens could be used for spiritual reasons, but not aware of to what extent they actually were. I have since realized that my experience fits right in with what others have experienced with God.) In the time leading up to the trip, my friends and I had been in a class at university on spirituality and nature. We no doubt had been in the spiritual mindset for some time  and with such growing interest that we planned this adventure. In taking the class and reading the various literature, I became intently aware of mans connection to nature that seemed to be lost with almost everyone in the world. During the class we had visited some spiritual centers and had seen people who LIVED in that state of ultimate connection with nature, something I had never seen before or really even fathomed. It was in this spirit that we set out on the adventure.</p><p>For days before and right up to and through my entire experience I had been meditating on a passage from the Tao Te Ching that was shown to me earlier in the year  the only passage I knew from it as I had not read the Tao Te Ching. I will attempt to relay the passage:</p><p>----------</p><p>Those who know do not talk.</p><p>Those who talk do not know.</p><p>Keep your mouth closed.</p><p>Guard your senses.</p><p>Temper your sharpness.</p><p>Mask your brightness.</p><p>Simplify your problems.</p><p>Be at one with the dust of the earth.</p><p>This is primal union.</p><p>He who has achieved this state</p><p>Is unconcerned with friends and enemies,</p><p>With good and harm, with honor and disgrace.</p><p>This therefore is the highest state of man.</p><p>---------</p><p>And so to the experience itself. The first day we all took one tab, for some people it was their first experience with LSD. I had spent the previous summer experimenting and getting just glimpses of what I was to realize this time. The thing about the Dunes is solitude. Essentially a desert, we were cut of from any human connection (and really and animals at all). After spending some time letting the drug take effect, I attempted to do what I really wanted to do  to be alone in the desert. This initially proved unsuccessful as I could not really get far enough from my compatriots. As night fell, everyone returned to camp to eat. It was after this meal that I got my chance to be alone. I had seen the zenith earlier in the day  and could still see it as this whole experience takes place under a full moon. I decided to hike out to the zenith, the highest dune in the very center from which all other dunes seemed to be created. The hike proved longer and more difficult than I had expected, but I just kept repeating the passage over and over again  yearning to understand its meaning. Finally I reached the zenith and sat to meditate  totally alone, the most alone I have ever felt in my life. I instantly realized the joy of true solitude and its importance. I sat calmly there for I am not sure how long, just repeating the passage over out loud at first and then only in my mind. What I felt was my body ceasing to be my body, but simply an extension of the earth  of the sand, not different from the sand on which I sat. I felt that our bodies our mobile extensions of the earth  like moving trees. And because we move about we somehow feel ourselves to be something other than that which makes up all life  plants, even the sand. I felt that If I am this earth, then why would I do anything to harm it? Everything became so clear, so simple in that state. The trouble is translating that to everyday life. </p><p>At this point I was under full effect of the drug  and realized how much easier it was to meditate with LSD  and how much deeper I got. I felt as if I had experienced primal union. I was at one with the dust of the earth. </p><p>Now I decided to head back to my camp as my friends were possibly worried or at least wondering where I was. The walk back I spent reciting the passage out loud, while trying to maintain footing on the high dunes. I found that the best way to walk them was to stay on the straight line that was sometimes visible and sometimes not. Walking on the sides, which looked more inviting, proved to be much more difficult if not dangerous. The Middle Way. So simple. So so simple. When I finally reached my friends I felt some extreme separation from them, and I was struggling with the beginning of the passage: </p><p>Those who know do not talk.</p><p>Those who talk do not know. </p><p>How do I relate what I have experienced to them under these restrictions? All I could say was Go to the zenith. I yearned to tell them everything of my experience, and I am still caught as to what to do about telling people about the joys of what I know now is ego-death. I have obviously decided to relate them  mainly because I feel it will lift some of that pressure. </p><p>I finished out the trip that day by sleeping outside under that full moon and stars with my friends, indeed an enjoyable experience.</p><p>The following day was to entail the same as the previous. The mood that morning was serious and pensive. When I awoke  apparently the last to awake  I saw silhouettes of my friends far away each on top of a separate dune in meditation. We were having the spiritual experience we perhaps naively set out to have.</p><p>We chose to take the doses a bit earlier in the day this time so that we might experience the beautiful sunset. A few friends  those whom the day before had been their first trip  chose not to partake this time. So this time I took 2 tabs to start  I would take another late in the day. After our dinner this time the weather began to shift and a violent windstorm came through the dunes. Our tent was situated in a saddle  and the wind ripped it right out of the ground and broke one pole. So now came the peril of trying to decide what to do with out busted equipment during this crazy storm  at this point the LSD was in noticeable effect and only served to make the stress of the situation more stressful. After much debate we decided to move further into the dunes rather than hike out to our cars. We eventually found a beautiful bowl sheltered from the wind where we made a makeshift camp. After that was settled  I was itching to get back to the zenith and experience primal union again. I would not be denied  I had to get there no matter what. </p><p>This time three friends wished to join me, and I kindly obliged. We set out for the zenith through the powerful winds whipping sand into our eyes. At some point along the way we stopped to stand on the edge of a dune and lean into the wind, suspended in air as if lying down, held up by what one friend called the power of God. And it truly was. I have never experienced a force of nature so powerful  the very same force that shaped those very dunes from infinite particles of sand. We pressed on toward the zenith, and one friend decided to turn back. The three of us pressed on , and when we were in sight of the zenith  along the very top spine of the dunes with no protection from the wind  the other two decided to turn back as well. They wished me luck, and I asked them to shine a light later so that I might find my way back to camp. And so I walked along the Middle Way of the dunes toward my goal. I reached it, but under much different conditions this time. I got to the top and took another dose first thing.</p><p>When I sat to meditate, the violent wind was stinging my face, but I tried to continue regardless. After much struggle to attain this primal union again against the wind, I slid down the west side of the dunes in chase of my hat which the wind had blown off my head. I was incredibly surprised to find there to be no wind here. The dune itself shielded it. And so there I sat with the San Luis Valley before me. I sat for a long while while the third tab took its effect  and after struggling mentally to achieve the peace I had realized the night before, I decided I had better try to get back to camp somehow. I decided to take a wandering way back, not in any rush, I wanted to explore the dunes in all their mystery. In my excitement for my newly found quest  I ran down into a very deep bowl similar to the one where we had relocated our camp. Only once I was down there did I realize what I had done. I tried to find the wall with least slope for which to climb out of, and tried one unsuccessfully, realizing how deep I was and how steep the slope was. </p><p>I finally chose one I slowly made my way to the top, on my hands and knees, pulling myself up by digging my bare hands into cold wet sand. I felt myself reverted to basic instinct  I had to get out of that hole and this was the only way. My fingers found strength they never had, and eventually I made it out. But in the process I died  that is to say my ego died. And I was no longer in control of my own fate as I thought I had been my whole life. If I was to survive the rest of the night it was because God wanted me to, I was at his mercy. This feeling only intensified throughout my wanderings that night  during which I was truly lost in those dunes and thought that I might never make it out. I buried the remaining LSD once I realized that I did not now how to get back to camp. I wandered for hours, but somehow I knew that I would make it if I only kept going, if I submitted to Gods will over my own. When I came to this realization that I was nothing, I sat down and just gaped at the feeling. This is what it is to die I thought, And its not so bad. But then I thought about living and how that feels and then realized how precious life is  that we can feel and be hurt and be loved and everything. Nothing is nothing, and thats fine. But while we are on earth we get to LIVE. Living, feeling, something I will never take for granted again. About this time I came upon the only animal I saw the whole time  a rabbit or something which fled quickly when I saw it. Life. What was that rabbit doing out in the dunes? It was living  doing what it needed to do, not questioning its purpose. It was alive, and that is enough. Shortly thereafter I saw the holy beacon  the light from my camp my friends had set to guide me home. I was now very far away from that light  but now I knew the direction and eventually made it there. The journey from that point was an exhausting one. I ran out of water and had to make frequent stops. I felt the wind giving me breath  God giving me life. And just enough to make it camp. I got there, barely able to stand, turned off the light and crawled into my sleeping bag. One of my friends lying next to me said:</p><p>Are you back?</p><p>Yea, what time is it?</p><p>About 4 am, goodnight.</p><p>Goodnight.</p><p>And I slept so soundly that night I cannot even describe it. I had experienced primal union in two different ways over those two days. The first was because I sought to, and did so in a controlled way, and it was enjoyable. The second night I got greedy, in my ambitions to reach that point again as well as with how much LSD I consumed. That time my ego was killed (crushed) and I was forced to survive without it. I know now what is important (GOD) and what is not (ME). I got the spiritual experience that I sought, and I am grateful for it even if it almost killed me.</p>"
}
