{
 "title": "First Intravenous Injection",
 "author": "C.",
 "citation": "   C.. \"First Intravenous Injection: experience with Oxycodone (ID 68209)\". Erowid.org. Jan 16, 2012. erowid.org/exp/68209",
 "substance": "Oxycodone",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "IV",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 68209",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 16, 2012",
   "Views: 6795",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 40 mgs of IV Oxycodone is considered an extremely high dose, see Oxycodone Dose Chart] </p><p>Over the last few weeks I have been experimenting with opiates. Percocet, Vicodin, now Oxycontin. One of my co-workers is a diabetic, and he leaves a box of needles in a cabinet in our bathroom at work. 29 gauge x 1/2' 1cc insulin syringes, to be exact. I had dome some research on injecting Oxycontin, so I snagged a couple of unopened needles on my way out of the office.</p><p>It was Friday, I had a slight cold so I didn't feel like going out. I figured that it would be a great time to give this a try. I had tried heroin several times years ago, but I still knew the routine, and I knew how to find a vein. From the research I did online regarding injecting oxycontin, I knew that I had to be very careful to separate the actual drug from the fillers/binders/time release coating. I began by putting the pill in my mouth to moisten it a bit. Then I scraped off the time release coating with a broken cue tip. I then crushed the pill into a very very fine powder. I went and got a large spoon and placed the powder inside. I injected about 1 CC of previously boiled water into the powder solution and began to stir. Oxycontin does not break down with heat like heroin does, so I let the solution soak for about fifteen minutes. I then added heat with a lighter for about 20 seconds, making sure not to bring the liquid to a boil. At this point I took the spoon and placed it on top of some crushed up ice, in order to let the binders/fillers/time release crap re-solidify and float to the top. I did my best to skim all of this waxy stuff off from the top of the liquid before I tossed in a tightly compressed cotton filter. I sucked up about 1cc of the liquid oxy, tied off, and IV'd the solution. </p><p>After cleaning everything up, I went and sat down in my living room. The effects were hitting me pretty strongly.  The feeling was familiar, it was very very similar to heroin, but not quite as intense. It was enjoyable. It felt similar to eating the pill whole, but with a much more intense and body consuming twist. About fifteen minutes after injection I felt very tired. I think I napped for about ten minutes on the couch before going outside for a cigarette. </p><p>The high lasted about 5 hours, and the peak occurred for forty five minutes, roughly twenty minutes after injection. It was very very enjoyable. However, the next day I woke up really sick. As I mentioned before, I think I was getting a cold, so it may have just progressed into something worse. But I woke up with a fever and some sinus congestion. Everyone is sick right now, so I'm sure the oxy didn't really have anything to do with it.</p><p>Perhaps one day I'll try this again.</p>"
}
