{
 "title": "Final Breakthrough Experience",
 "author": "Sam",
 "citation": "   Sam. \"Final Breakthrough Experience: experience with Syrian Rue (4x extract) & Mimosa tenuiflora (extract) (ID 68203)\". Erowid.org. Apr 5, 2008. erowid.org/exp/68203",
 "substance": "Syrian Rue (4x extract) & Mimosa tenuiflora (extract)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 capsls",
   "oral",
   "Syrian Rue",
   "(extract)",
   "  T+ 2:00",
   "300 mg",
   "smoked",
   "Mimosa tenuiflora",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "68203",
   "Male",
   " ",
   "Not Given",
   "Apr 5, 2008",
   "Views: 29502",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having dabbled with a variety of synthetic and natural psychedelics, I recently have had access to large quantities of very good quality DMT extracted from Mimosa hostilis root bark.  </p><p>For this particular experiment, I was taking two mostly filled 00 gel caps of 4x Syrian rue extract and 40 minutes later I took another gel cap of DMT extract (around 250mg).</p><p>This was my first time using Syrian rue in quite a few years. Since my last time using it I had turned to using B. caapi as an MAOI, but because I use this when taking ayahuasca, I have now a natural tendency to purge when combining it with mushrooms. However, when I purge with this combination on mushrooms I end up feeling nauseous for a while, and then dry heaving, never actually purging (this also makes the trip a lot more intense quite suddenly). I usually feel better after this, although there maybe some transient nausea and uncomfortable stomach feelings for quite a while, which is annoying as I never used to get nausea on mushrooms and Syrian rue (apart from maybe some stomach awareness while coming up).</p><p>I also find the Syrian rue and mushroom combination quite interesting. In fact, the highest Ive ever been by an order of magnitude was on such a combination, and the only time Ive encountered an entity was on a combination of Syrian rue and 10g of fresh Hawaiian Copelandia cyanascens mushrooms.</p><p>I was also curious how Syrian Rue would mix with DMT. My last pharahuasca trip combining 20g of B. caapi tea with 300mg of DMT started off in an extremely intense fashion, but was quite short lasting.</p><p>Due to Syrian rue being a more potent MAOI, I thought this combination might be more intense if anything.</p><p>In fact, it was a much gentler trip. I felt distinct MAOI effects come on from the rue extract around 20 minutes after taking the capsules, and around 30 minutes after taking the DMT extract, psychedelic effects began, along with a subtle but growing nausea, along with a bit of stomach gas.</p><p>Im now of the opinion that caapi is the more powerful MAOI, although Syrian rue may be more potent (in a similar way to DMT being more powerful than the much more potent LSD).</p><p>Around 45 minutes later I purged, and as purges go this was remarkably easy.</p><p>Following this there was still a little nausea, but it was uncomfortable. Unlike the start of my previous experience, there were no uncomfortable feelings at all. I felt completely at ease, warm and content, and in a very wholesome, earthy way. At this stage visuals were gentle, and remained so for a while. </p><p>Around an hour and half later I decided to smoke some DMT extract from my newly discovered glass freebase pipe. </p><p>I have found that there is a considerable art to smoking DMT. Some attempts seem to misfire completely, while others produce only a threshold experience. I find it hard to smoke enough to get to a breakthrough experience-the more DMT in the pipe, the harder it is to vaporize all at once and inhale quickly. As a result I have only been what I would call close to a breakthrough a few times.</p><p>Tonight I wasnt optimistic, and smoked a little extract in the dark, with a poor lighter, so the odds werent exactly stacked in my favour. After heating it up for a while and taking several long, deep tokes, I still wasnt expecting much, due to the fact I couldnt tell if I was inhaling much or not, due to being in the dark, and the design of the pipe allows for an inflow of fresh air which makes it easy on the lungs.</p><p>I began to notice a subtle buzz, and a curious visual effect, where part of my visual field appears to ripple in a strange, liquid fashion. I have had this effect only once before, on an extremely powerful shroom/ayahuasca trip, so now I was thinking something might be about to happen.</p><p>And then quite suddenly the visuals went off the scale, and I seemed to depart my head into a utterly vast black space-quite a different environment to that enlargement of the interior visual field I get on other psychedelics. It felt like I had entered space.</p><p>This space completely engulfed me, and as it did so I was amazed at the feeling of complete bliss and ecstasy. I dont usually feel much euphoria when smoking DMT while sober, but the MAOI effects of the rue seemed to slow this trip down slightly making it easier to integrate, and the euphoria was incredible. Throughout the experience there was not a single moment of anxiety or confusion.</p><p>The visual aspect of the trip was quite incredible. I was being submerged and bombarded with extremely beautiful and complex abstract geometric hallucinations. Unlike the sometime meaningless chaos of fractals I can get a lot on other psychedelics, it felt every ounce of this was brimming with intense meaning  exactly what though I dont know.</p><p>After 10 or so minutes, it is hard to say, I gradually entered my head again, but the euphoria was still present.</p><p>When the results of the smoked experience had worn off I was back to the gentle wholesome experience previous to this. I felt very lucky to have experienced something so profound, and thought it was time no for sleep. However, an hour later, for some reason, the trip quite suddenly kicked off, but a different order of magnitude than before.</p><p>I also had trouble sleeping afterwards due to lots of energy and racing thoughts, I feel as a direct result of the smoked experience.</p><p>This was an incredible experience, and I am keen on trying this combination again sometime in the future.</p><p>[Reported Dose: '2x '00' gel caps 4x Syrian rue, 300mg Mimosa hostilis rootbark DMT extract']</p>"
}
