{
 "title": "A Unique Experience of 'Mate Culture'",
 "author": "Tim",
 "citation": "   Tim. \"A Unique Experience of 'Mate Culture': experience with Yerba Mate (ID 68320)\". Erowid.org. Feb 23, 2010. erowid.org/exp/68320",
 "substance": "Yerba Mate",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Yerba Mate",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2008",
   "68320",
   "Male",
   " ",
   "Not Given",
   "Feb 23, 2010",
   "Views: 5375",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over, my Christmas break, '07, I was fortunate enough to have the opportunity to travel to South America, specifically Chile and Argentina, with my family. My brother was, at the time, halfway through a year of studying Spanish abroad in Santiago de Chile and my family seized the chance to visit him during his summer break and at the same time visit a geographically and culturally beautiful part of the world.</p><p>I had acquired a taste for mate before we left for the travels and was accustomed to brewing it in my dorm room from Guayaki brand tea bags and came to enjoy the earthy tea flavor. Also, I found that I could get more or less the same mildly stimulating buzz from a few warming cups of mate as I could from a cup of coffee, so it became my preferred late night/early morning study enhancement beverage.</p><p>By the time my family and I met up with my brother in Chile, where he had spent the first part of his summer holidays backpacking, busriding and hosteling his way south towards Patagonia, he had picked up the habit of drinking mate in the traditional manner out of a gourd, often referred as a 'mate' and through a metal straw, called a bombilla, which filters the loose leaves of the tea, allowing only the brewed mate tea to pass through perforated holes on one end of the straw.</p><p>One day, while in Patagonia at the southern end of the long strip of land that is Chile, our family went horseback riding guided by a Chilean gaucho. The ride was windy, rainy, cold, and left me tired and sore assed, but none the less was rewarding as it afforded some amazing views of the Patagonian landscape and the Torres del Paine national park.</p><p>At the end of the ride, when we returned to the Gaucho's small estancia, he invited us into his home while we waited for our transportation back to the hotel we were staying at to arrive. Passing through the door, the six of us, plus the Gaucho filed into a small room that was already occupied by several members of his family. We were invited to sit or stand wherever we felt comfortable. The gaucho disappeared into the adjoining room briefly and returned with a mate and kettle of hot water. He drank his filled, added more hot water, and passed the gourd on to the person nearest him. The way that the gourd was passed from person to person, everyone drinking through the same bombilla, reminded me entirely too much of passing around a joint, and created the same sense of community and friendship that passing a joint often does. When the gourd was passed to my Dad, he promptly thanked the gaucho. It was then explained to us that you only said 'gracias' when you had had your fill of mate and didn't want anymore. I thought that this tradition was a unique expression of hospitality.</p><p>After the gourd had circulated the room a couple of times, everyone who had been tired after the horseback riding perked up a bit, and conversation became more lively. It occurred to me that that was the way that mate was intended to be drunk, as a community of friends. The experience was a unique one that I won't soon forget, and has changed the way that I drink mate.</p>"
}
