{
 "title": "First time with LSD",
 "author": "dilated_pupils",
 "citation": "   dilated_pupils. \"First time with LSD: experience with LSD (ID 68359)\". Erowid.org. Oct 27, 2009. erowid.org/exp/68359",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   " ",
   " ",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 68359",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 27, 2009",
   "Views: 6259",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Friday, April 28th, 2006 ingested</p><p>Trip report written Saturday April 29th, 2006</p><p>LSD - First time - Not exactly what I expected.</p><p>I have been trying to get ahold of LSD for quite some time now, and finally was able to acquire liquid acid on sugar cubes, which I had known to be decent quality. The night starts as I drive with a friend of mine to pick up our cubes. We each get one, as I didn't want to stock up on something I had not taken myself. The sugar cubes are wrapped in tinfoil, placed in a bag, and we're off to my house for a night I've been waiting for, for what seems like forever. The ride home is quiet, with the occasional conversation, usually starting by myself saying something along the lines of 'I have acid in my possession, I finally got it.'</p><p>When I got home it was around 9pm, and we got everything prepared for our trip. 10:10pm rolls around and we throw the cubes on our tongue, letting it dissolve and sit in our mouth. I sit quietly realizing this is what I've wanted for such a long time, and I don't think my mindset could have been any better.</p><p>Now I know a lot about drugs, acid included, and when I started feeling a bit off 10-15 minutes after ingesting the cubes, I just thought to myself 'Placebo...' But no, my friend was starting to feel it as well. My arms were getting lighting, colors at first were a bit of a faded color, and a slight glow was surrounding objects. Within 40-45 minutes I'm full into the trip, my friend seemed to have come up a bit faster then I, and at first I just thought he was acting a bit odd, but found myself in the same position soon after.</p><p>What is this though? What's going on? My head is clear, or so it felt, but yet my vision is pretty distorted at times, clear at others, and there is a lot of ups and downs. This is not what I expected at all! I've had LSA trips that had more of a mindfuck, why is this like this? I tell myself I was expecting too much, maybe the quality was not as good as I had thought, but no difference, I'm not going to allow my thoughts to ruin my first acid trip.</p><p>I start downloading random songs, everything from television theme songs, to techno (which I never listen to, but very much so enjoyed at the time). I'm realizing stages, where I will just drop down from completely having fun doing things I would usually find bored, to feeling sober for a couple minutes, then back again. I didn't expect things to be like that either...</p><p>What to do? For some reason I'm getting bored, but yet still having the time of my life, my friend and I both agree that this tops all drugs we've done, including ecstasy.</p><p>I was feeling pretty normal, distortions and visuals were non-existent, why not take a ride to get some whippets? I've never done whippets, but hell, I was bored, and thought maybe I could bring on some heavier tripping at the time by doing so.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I take a ride and pick up a couple whippets. My friend soon after takes a deep breath and starts laughing uncontrollably from the nitrous.</p><p>'What the hell am I doing? I don't want to act like a fucking moron, who the hell does whippets anyway?' Is all I thought to myself, but it was quickly followed by my urge to try it, and I proceeded to do so when I got safely back to my house.</p><p>The first inhalation of the nitrous I took was the biggest, within maybe, 7-10 seconds max, I just felt my world change, like going from one scene in a movie to another in a fading sort of pixelation. I fall to my knees and am in a weird state of mind, my mouth is open wide and yet I can not pronounce any words what so ever. This lasts for maybe 30 seconds, but it noticeably put my LSD trip back into a high range, which I enjoyed very much so.</p><p>I remember having a playlist made on windows media player, and having it on full screen. Every once in a while I'd call over to my friend and tell him to come look at it. At one point we were both staring, and all of a suddon the color scheme changed from light neutral colors, to firey orange and red swirls, which only got darker, and we both flinched in fear and shuttered. I found it completely amazing afterwords that we both had the same reaction. It just felt odd, hot and I guess we gave the media player visuals some life like qualities in our minds.</p><p>After laying around, having some weird conversations, listening to music, and attempting to dance around like a fool, I lay down and try and have a serious self examination time, but it's just not there. Focasing on anything just seems hard and pointless, whereas I expected there to be more of a mindfuck, and was highly dissapointed in the lacking of this area, but I don't blame the acid, just the low amount that I took I am assuming. I throw in Sin City, in a movie watching mood, so why not? It's probably around 2-3am by now (I don't quite remember), Sin City is not only a trippy movie, but the tv seems to have a weird depth too it, and a glow, or aura surrounding it, as does any other object that has light around it. I go to the bathroom and look in the mirrior, my eyes are dilated, and I stare in the mirror allowing my eyes to blur a bit. I did this on LSA and had some rediculously odd hallucinations of my face and thought I could pull off something like it with the LSD. I was right, but it was no where near what had happened on LSA, and it required what seemed like a bit of energy.</p><p>Anyway, I finish up Sin City, and go on the computer as I'm feeling pretty sobor now (even though it's been maybe 6-7 hours now, and I quickly realize that I'm no where near sobor.</p><p>The letters on the screen are drooping, the monitor glass seems to be bubbling, and I am seeing grass growing all over, wherever I look. My new job is landscaping, and last night was the first day I've had off in a week, maybe thats why? That's the only thing I could think of. I go to the bathroom again, and while I'm pissing I notice the toilet seat (it was down for some reason) was changing colors, purple to blue, blue to orange/red, and there was grass growing around the whole toilet. This all quickly fades within the next hour as I'm laying down, and I end up falling asleep around 6pm with Pulp Fiction on.</p><p>All in all, a great and completely uncomplainable trip, other then lacking some qualities I was so hoping for.</p><p>It's not 3:40pm, after tripping last night, I am still noticing visual distortion around whatever I am looking at, but it's minor compared to last night, but still noticable.</p><p>It wasn't the most eventful night, but I did have the time of my life, but also was hoping for much more.</p><p>And by the way, neither myself nor my friend got close to having a bad trip or even any mind fuck at all, so it would have been really hard to give us a bad time. The closest thing that could be considered bad was when we were looking at a picture that somehow, after staring at it, depictes Jesus when you look at a surface, and my friend wouldn't stop staring, and he freaked out for a minute or two because it wouldn't go away, but I quickly explained to him it's just an eye trick and it will fade, as it already had for me. And then he went and did it again? I don't get him...</p>"
}
