{
 "title": "Losing My IV Virginity",
 "author": "dilated_pupils",
 "citation": "   dilated_pupils. \"Losing My IV Virginity: experience with Cocaine, Heroin & Alprazolam (Xanax) (ID 68364)\". Erowid.org. Oct 30, 2009. erowid.org/exp/68364",
 "substance": "Cocaine, Heroin & Alprazolam (Xanax)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "0.4 g",
   "IV",
   "Cocaine",
   " ",
   "50 mg",
   "IV",
   "Heroin",
   " ",
   "50 mg",
   "insufflated",
   "Heroin",
   " ",
   ".5 mg",
   "oral",
   "Pharms - Alprazolam"
  ]
 ],
 "footer": [
  [
   "2007",
   "68364",
   "Male",
   " ",
   "19",
   "Oct 30, 2009",
   "Views: 58690",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>March 18, 2007</p><p>First time IV use - Cocaine and Heroin</p><p>It started out a normal day March 18, 2007, until I decided to hitch a ride to Philly with a friend.  Today was going to be the day I shot up any substance for the first time.  My friend had grabbed me a clean, unopened sterile needle prior to going to the city.</p><p>We leave around 3pm and are on are way.  We pick up the dope first, and at this point in time I have no intention of shooting that up, just was going to snort it to come down from shooting the coke.  We then go to the spot for some coke, and I just grabbed a dime bag.  I quickly get the rig ready and am on my adventure to a whole new world, its all happening really fast.  Almost like I didnt decide to do this, but more so it decided itself this was the time and the place, in the back of the car, to try this.</p><p>Oh what a mistake, I mean wow, that first shot registered and hit me like nothing Ive ever felt before.  The ringing in my ears and the eagerness to talk to everyone and anyone who would listen came after.  I soon realized my first shot had been somewhat missed since a little abscess built up, but quickly proceeded to go away.  The drive home included me not caring about anything, not getting stopped by the cops, nothing at all, it included me just talking and talking and talking.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]   I loved it, it was coke 10x snorting it, with no hurting nose, just a bit of a bruised arm and my IV virginity taken from me (which you cannot even begin to understand how much meant to me).</p><p>I saved one shot left for when we got home.  I arrive back at my friends house and I quickly prepare my last shot of coke, it was small and it barley did the trick, I am coming down now and I am not liking it.  I am now remembering why I quit coke in the first place and how far down it had gotten me, and anyway I have been doing opiates lately why did I even mess with the coke? Dammit.</p><p>So I decide rather quickly as well to shoot up half the bag of dope, labeled with the word Diesel on it.  Before I could finish asking what am I expecting here out of this shot woosh.. I feel amazing, an extreme opiate buzz, filled with extreme euphoria and a lovely body feeling I just cant explain.</p><p>This is what its like I think to myself.</p><p>Wow, thats all I can say.</p><p>I ended up snorting the other half, debating myself against shooting the other half as I was already nodding out a bit and I had taken .5mg xanax as well to help with the coke comedown (note I do have a benzo tolerance so .5mg xanax isnt much for me at all, in fact I highly doubt that even effect much of anything other than the nods I got).</p><p>So now, looking back on the whole experience, I am very very confused.  What have I done?  Now I am not going back to the city and copping bags every day, nor have I done it again yet (but its only been a couple days).  I dont even know anymore, Im somewhat afraid this may change a lot for me, while at the same time I am still amazed at how great it all felt.  I am now in between emotions on this subject as I dont know still how I let this happen to myself, I swore it would never happen.  Ugh, I dont know what to say about the experience as a whole, it was truly amazing, but at the same time, this is not my scene, in my head all I am thinking is What was I doing there? With those people? With a needle in my ARM?</p><p>Can anyone relate? Anyway, this is my experience with cocaine/heroin IV for the first time.</p>"
}
