{
 "title": "Uncontrollable Laughter...",
 "author": "Chacer",
 "citation": "   Chacer. \"Uncontrollable Laughter...: experience with 4-HO-MiPT & Mushrooms (ID 68385)\". Erowid.org. Nov 27, 2009. erowid.org/exp/68385",
 "substance": "4-HO-MiPT & Mushrooms",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 mg",
   "insufflated",
   "4-HO-MiPT",
   "(powder / crystals)",
   "  T+ 0:30",
   "1 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 0:45",
   "12 mg",
   "insufflated",
   "4-HO-MiPT",
   "(powder / crystals)",
   "  T+ 1:00",
   "12 mg",
   "insufflated",
   "4-HO-MiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 68385",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 27, 2009",
   "Views: 5666",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had obtained a 100mg sample of 4-ho-mipt. I have allot of experience with other substances, but I had heard allot of amazing things about 4-ho-mipt, so I was very eager to try it. I measured out 30mg on an accurate scale and placed it on a CD cover. The 30mg was split into 5 piles and a pile was snorted. There was no pain at all and the drip was not that bad. </p><p>T+30min: The first effects were noted. I felt happy and I felt a very nice energy flowing thru me. 1g of mushrooms was eaten.</p><p>T+45min: 2 of the other piles were snorted. </p><p>T+1h: Visuals started appearing. Both CEV and OEV. Looked a lot like mushrooms but it had a more chemical feel to it. Beautiful patterns started forming and colors started appearing. I felt very good. Me and a friend started talking about life and the universe. I became a little confused at times but we had a very deep conversation. The last 2 piles were snorted. </p><p>T+1h30min: I started to laugh uncontrollably. I almost couldnt breathe because I was laughing so hard. We decided to go outside and found a nice spot in the woods, with a net so you could lie down and look up at the night sky. It was beautiful. So many stars. It was almost overwhelming. We started talking about star constellations and concluded that the people, who originally saw/named them, definitely had been tripping on mushrooms or smoothing similar. At this point I was at a +3.</p><p>T+2h30min: 3 other friends arrived. They had eaten mushrooms. One of them for the first time. He was very confused and couldnt understand what was happening to him. I wanted to help/talk to him, but he was too confused to talk about anything. They took him back to the house so he could relax. I was still +3. Still having laughing outbursts because my friend was talking about weird stuff. I dont think I have ever laughed so much in one night.</p><p>T+3h: We started walking back to the house. On the way back we saw an old man. He was looking at us. As we came closer he started acting weird, he started turning around in circles. I couldnt hold myself so I bursted into laughter again. My friend went towards him and started jumping up and down screaming uga buga uga buga right in front of him. He was scared and turned around and quickly ran away. I was rolling around on the ground laughing. It was 4 in the morning, what was that old guy doing out in the woods? We went back to the house where the others were. Still +3.</p><p>T+4h: When we came back, I was in such a good mood. I opened my drug collection (DPT, DMT, 4-ho-mipt, LSD, DOB and 2c-b) and told my friends they could take anything they wanted. I wanted them to have as much fun as I had. They took some 2c-b and DPT. Except the guy who was on mushrooms for the first time. He was still a little confused. +2, I think I'm slowly coming down.</p><p>T+6h: I was almost sober +1. I started to get tired. We smoked some mj and a friend suddenly dumped in. He took some LSD and I decided it was time to head home. I tried to sleep at T+7h. It took some time to fall asleep even thou I was tired. But eventually I drifted off.</p><p>This was properly the most fun I have ever had. We laughed so hard almost all night. 4-ho-mipt is GREAT material. I love it. Mixing it with mushrooms produced very nice effects, but there was a little body load, properly from the mushrooms. I will definitely try it again. I was a little drowsy the day after, but nothing too bad.</p>"
}
