{
 "title": "Sensory Overload",
 "author": "Nuja",
 "citation": "   Nuja. \"Sensory Overload: experience with 2C-I (ID 68387)\". Erowid.org. Feb 15, 2010. erowid.org/exp/68387",
 "substance": "2C-I",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "27 mg",
   "oral",
   "2C-I"
  ]
 ],
 "footer": [
  [
   "2007",
   "68387",
   "Male",
   " ",
   "Not Given",
   "Feb 15, 2010",
   "Views: 2760",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So recently my friend Z was able to acquire a few 25-30mg 2c-i capsules. I, excited that I'll be able to get to try 2c-i alone(both substance-wise and socially) for the first time(I've done it once before; combined with acid.  I'd say the acid overpowered the 2c-i), decide that since I have the next day off, I may as well indulge tonight.</p><p>Few notes: It should be assumed that I am smoking Mary Jane during this entire night.</p><p>9:30pm (t - 0:00)</p><p>Orally ingested one 25-30mg 2c-i capsule.</p><p>10:30pm (t - 1:00)</p><p>Did I mention 2c-i's comeup takes longer than any other drug I've done before?</p><p>11:00pm (t - 1:30)</p><p>Having a few good convos with my roommate as I watch him play WoW, he decides he'll throw on some music for me.</p><p>11:30pm (t - 2:00)</p><p>I can feel the drug starting to take effect. To double check, I do a tracercheck. My roommate laughs as I stupidly wave my hand back and forth in front of my face, but my suspicions were confirmed.</p><p>I was beginning to trip.</p><p>11:45pm (t - 2:15)</p><p>I went to the bathroom to check my pupils, no heavy dialation yet. One thing I'd like to note is any time I'm under the influence of this drug, it throws my pupils offsize. My right one is ALWAYS atleast a quarter inch bigger than the left.</p><p>11:50pm (t - 2:20)</p><p>I sat back down in my seat, and grabbed a soft, warm coat. Closing my eyes and laying my head down, I zoned out to the music. My body was beginning to feel the physical effects of the drug(2c-i is visual, but its visuals don't compare to the euphoria/body high. The stimulation I receive while under the influence that can't even be rivaled by the warm fuzziness of opioids). The beginning onset reminded me of opioids, and the wrapped in a blanket feeling I get.</p><p>12:00a (t - 2:30)</p><p>My roommate turns around and just laughs; I've got a big goofy smile with my eyes half open and a very pleasant body high, I felt like I could've gone to sleep at that point. My roommate suggests we go watch a movie, so we trek upstairs and turn on the T.V. Don't Be a Menace to South Central While You're Drinkin' Your Juice in the Hood was the poison. </p><p>12:30am (t - 3:00)</p><p>I start to notice tiny circular rainbows around the outside of my lightbulbs upstairs(something I tend to only notice vibrantly when I'm tripping, I'm pretty sure I've seen them before while sober).</p><p>1:00am (t - 3:30)</p><p>This is where shit gets crazy. My roommate is asleep by this time. Every movement, every breath, every flexing muscle, every brush against the couch was like pure ecstasy. Sensory overload is the only way I can truly describe it. Orgasmic hardly even depicts it. Just any time one of my 5 senses were used, my head would almost explode in what I'd call a 5minute long 'mindgasm'.  EXTREMELY SENSUAL.</p><p>Every once in a while I would have a moment of clarity(tends to happen quite a bit on 2c-i).</p><p>2:30am (t - 5:00)</p><p>After writhing around for an hour or so, I finally gather the effort to get off the couch and go back to my computer. I was extremely dissapointed that I had no glowsticks at this time(big hobby of mine), as I'm sure the tracers would've been mindblowing. Either way, I decided it was time for some Floyd, and I threw in Dark Side of the Moon.</p><p>3:00am (t - 5:30)</p><p>Dark Side is starting to finish up; my CEVs for it were insane. I felt like I was some kind of floating music note that soared across sheet after sheet of music and outerspace. Truly was a journey to be experienced.</p><p>3:30am (t - 6:00)</p><p>Started to feel a bit empathic, played with my pet parrot for a while. A bit off topic, but that parrot is awesome. I was chilling with my cat in my chair next to me(who happened to be shifting colors between gray/white and golden), and my bird was on my shoulder. I took a hit from the bong, blew the smoke out, and the motherfucker climbed over to my mouth and tried to suck all the smoke up. It was at that point I realized I had a stoner parrot(quite the conversation piece :P).</p><p>4:30am (t - 7:00)</p><p>Put in some infected mushroom, and started to welcome back reality. My peak was definitely over, and I was on the slow way down.</p><p>5:00am (t - 7:30)</p><p>Put the bird back in his cage, took my cat upstairs, watched Katt Williams standup until I fell asleep.</p><p>7:00am (t- 9:30)</p><p>Woke up on the couch, went downstairs to my bed. I was still noticing a bit of visual distortion as I passed out.</p>"
}
