{
 "title": "Relieved My Addiction to Heroin",
 "author": "Opiate Fiend",
 "citation": "   Opiate Fiend. \"Relieved My Addiction to Heroin: experience with Tramadol (ID 68439)\". Erowid.org. May 19, 2008. erowid.org/exp/68439",
 "substance": "Tramadol",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Tramadol",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "68439",
   "Male",
   " ",
   "Not Given",
   "May 19, 2008",
   "11970",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been snorting Heroin everyday for about the last 4 months and I got to the point to where I knew I was addicted and I couldn't take it anymore. At first it started out as occasional use as I would buy maybe 2 or 3 $20 caps a week but soon within a month turned into a $40-$60 a day habit. If I went a day without it my nose would start running, my eyes would start watering and the 2nd day without it I would get severe diahrea, be extremely depressed and anxious, and would have extremely intense cravings for more Heroin.</p><p>About 4 weeks ago I was at the beginning stages of withdrawal when my friend gave me 2 50mg Tramadol pills. Within about 1 1/2 hours a sense of well being came over me I didn't really feel high but I felt content, my runny nose dried up and I really didn't crave Heroin much at all. After trying the tramadol I ordered 150 50mg pills off the internet for $75. When I got the pills delivered 3 days later I was a wreck, I was going almost 3 days without Heroin. I took 2 pills and within 2 hours it felt like the weight of the world had been lifted off my shoulders. The first couple of weeks I took 2 50mg pills of Tramadol 3 times a day and it kept my Heroin withdrawals at bay pretty well, it actually even improved my mood and gave me more energy then Heroin ever did. </p><p>The last week I weened myself down to 2 50mg of Tramadol twice a day and when I had only 6 pills left I only I took 2 once a day for 3 days. It has been almost 4 days since I've had any Tramadol and nearly a month without any Heroin and I won't lie, I do think about Heroin, but I'm not suffering from the crushing depression, anxiety and cravings that I always got and that's what always made me get more Heroin. I only used about 4 months and I only snorted it.</p>"
}
