{
 "title": "Uncomfortably Tranquilized",
 "author": "Kuriti",
 "citation": "   Kuriti. \"Uncomfortably Tranquilized: experience with Haloperidol (Haldol) (ID 68476)\". Erowid.org. Jun 10, 2008. erowid.org/exp/68476",
 "substance": "Haloperidol (Haldol)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Haloperidol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 68476",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 10, 2008",
   "Views: 10429",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was in the Peace Corps in 2001 and had experienced several psychoactive drugs previous to my leaving for overseas. As a healthcare volunteer I had ready access to the nurses pharmaceuticals. I had worked as a behavioral therapist before the peace corps and have a BA in Psychology, so I was familiar with Haldol as a psychotropic medication. Having raided most of the Diazepam (Valium) in previous months, I decided to try Haldol with a friend who was visiting.</p><p>We took either a 5 or 10mg dose in the early evening, I cannot say which with any confidence. The setting was what most people would think of as a grass hut; kerosene lantern lighting, about 85 degrees laying on a wood platform. We listened to music as the drug kicked in. It wasnt an overwhelming feeling at first, I was mostly drowsy.  I felt a heavy sedation that fluctuated with yawning and an inability to attend to conversation. Strangely my friend was little affected. Our conversation was one sided as I remember yawning a lot. A physical discomfort began to kick in towards the end of the evening and my friend excused himself, staying at another house, he left me because I was having a hard time staying awake.</p><p>Once he left I decided to go to sleep. That night was one of the longer nights of my life. I was extremely uncomfortable in my skin. Tight muscles and discomfort, not unlike that of poor quality LSD. I was in dire need of rest yet unable to get comfortable enough to sleep, with my mind very unfocused. I remember being somewhat paranoid that I may have done some permanent damage at the time. It was a paranoid fantasy, but very real at the time. </p><p>I never really slept that night and awoke still very tired, but a little less tranquilized.  The remainder of the next day was more physical discomfort and anxiety over when the experience would end.  A disturbing occurrence was a series of mild hallucinations where I felt as though something was coming at me from my peripheral vision.  It was equivalent to the shadowing that occurs if something was coming at you and all you saw was the changing of the light in your peripheral vision as the object blocked out the light source. The first time I winced, but soon realized it was a hallucination, though it continued from time to time. </p><p>The odd thing about the experience is that when I went to see my friend later the next day, he had none of the symptoms I describe. He said he was a bit tired, but that it had not affected him. He was a bit odd to begin with and I cant say if he was then on any other related medication that might have given him tolerance. I was on no other medication at all, including alcohol or marijuana for weeks.</p>"
}
