{
 "title": "Only for People That Need It",
 "author": "Greg F",
 "citation": "Citation:   Greg F. \"Only for People That Need It: experience with Ziprasidone (Geodon) (ID 68500)\". Erowid.org. Sep 2, 2008. erowid.org/exp/68500",
 "substance": "Ziprasidone (Geodon)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "Pharms - Ziprasidone",
   "(powder / crystals)",
   " ",
   "1 capsl",
   "oral",
   "Pharms - Ziprasidone",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 68500",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 2, 2008",
   "Views: 12806",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell I had a drug problem which landed me in jail. I spent 7 months in the county jail and was not done with drugs just yet so I would take whatever guys on prescription meds would get. Anyway we had this kid that would get up off his bunk and inch forward bent over about 5-10 feet here and there at odd times. Then he would inch backwards sliding his feet still bent over until he reached his bunk and either lay down or do it several times then lay down. He would spin in circles wherever he went like a little tornado lol. But he was still able to make sense of things and talk to people like he was normal. He was just f-ed up in the head. So I traded him a honey bun (pastry) for 2 pills which he told me were sleeping aids. I had been taking benadryl just to sleep for 12 hours to sleep the day away.\r\nI broke one capsule open and ate it then swallowed the other. I didn't feel anything at all so I went to bed after 1 hour. I woke up about 6-7 hours later feeling weird as hell. I felt boxed in my mind like I was being crushed. My vision was restricted to eye level meaning I couldn't see above myself very well unless I concentrated. I walked around telling myself it would be ok because I have been made mistakes like this before.\r\nSo breakfast came and I ate then I went back to sleep for an hour after laying there for about 2 hours. The whole time I was thinking that everyone had important things to do and I had nothing to do. Then I was thinking about how I was going to be a vegetable for the rest of my life. I went to sleep and my friends I had made were yelling at me while I was sleeping trying to wake me up knowing I took this kid's pills. They were in my ear yelling at me and I was just gone.\r\nSo I woke up and decided to just occupy my time until the pill wore off which freaked me out because it's about 11 am now and I took them around 8 pm the night before. So I played Monopoly with a homeless man named Stan who was quite nuts himself. I forced myself to play for an a couple hours while just walking around freaking out.\r\nFinally around 4 pm I called the nurses and guards and told them what I had done. Then I told them I was going to kill myself if it didn't wear off. So they took me up front to a single holding cell and stripped me naked putting me in a padded vest which smelled like it hadn't been washed in some time. The female sergeant guard kept talking to me throught the little window telling me to chill and it would be ok. I stuffed bread in the vent to keep the air out because it was at least 50 degrees in that room. Then around 5 pm it wore off but I had to stay in the cell for 24 hours freezing to death on a metal bed. This drug is for people with mental disorders do not ever take it for recreational use it's about the worst thing you can take.\n\n\n"
}