{
 "title": "Serious, Serious Stuff",
 "author": "The Green Jade",
 "citation": "   The Green Jade. \"Serious, Serious Stuff: experience with Salvia divinorum (ID 6851)\". Erowid.org. May 14, 2002. erowid.org/exp/6851",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6851",
   "Male",
   " ",
   "Not Given",
   "May 14, 2002",
   "Views: 23163",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI got my Salvia in the mail, excited but hesitant after taking the accounts in all of their seriousness.  I decided not to try it and let my potential sitter leave before giving in to the call of the new herb in my apartment. While I expected an intense experience, being both grounded in life and knowledgeable about the herb, it far exceeded any expectation in terms of how profoundly shaking a brief moment can be. </p><p>I took all of the precautions.  And more.  I moved the table from the middle of my living room to the wall to create more space even though I was smoking two rooms away in the bedroom of my apartment.  Had I not done this, later I would've probably hurt myself while hurtling uncontrollably about my apartment.  But more on that later. </p><p>So I settled in my bed with the bong and half of one small leaf.  I smoke and hold.  I sat back, relaxed, and watched the wall and doorway at the foot of my bed begin to wrap around me fisheye-like.  I am electrified and, though lying back and propped up against some pillows, I feel fully straightened, like a beam of energy is flowing through me.  I know this is just the tip of the iceberg, and go fire up a full leaf.  Just a 1-inch-by-2-inch leaf from Oaxaca. </p><p>Holding in the smoke, I began to lean back and felt a stretch as the distance to the wall in front of me seemed to increase drastically.  There was the sensation that the bed below me was stretching and coming apart metaphysically.  Think of the top of a candy bar that gets stretched out, except that in the gaps is nothingness.  And I can't see this, by the way, I just feel it. </p><p>Then I go into a feedback loop - a moment which repeats itself in which my psyche is torn in two.   Let me explain that a bit.  The trip involved a polar sensation which attracted my psyche and body with varying degrees of intensity during the trip. </p><p>In one direction, behind me to the right, was a roar of echoed sound, an unrecognized but too familiar voice, the echo making the roar a maniacal type of rhythm.  In the exact opposite direction was where a string of christmas lights on the wall took on the character of a zipper stretching to an unseen horizon.  This zipper was an active rift in reality, or so it seemed, with light and energy at the seam and the darkest void beyond.  Upon seeing the void I was immediately overcome with remorse, a deep emotional guilt at having trespassed over a threshold.  And guilt for desiring to pursue the void.  I was conscious of having wronged some sort of order and felt I could be held responsible for the trouble I'd caused. </p><p> It was a very profound moment which I will be trying to understand for some time to come.  I was very glad to have had a pen and paper handy for as soon as I stopped shaking enough to write.  I also shot some confessional video which I cannot yet characterize. </p><p>That was the first part of the trip.  I guess you'd call it a peak.  I look at it as a vision.  I understand why many people say it is like detuning reality, like seeing into another dimension which is very intimately related to our own, possibly even within it.  During this time (5 minutes), time ceased.  I think the emotional weight of the experience so exceeds normal existence that any awareness of time is completely obliterated. </p><p>But there is so much more. </p><p>I then had the violent awareness of being back.  One moment I was saying, 'whoa, whoa, whoa,' over and over again.  I was shocked and astounded at what I had just felt.  The next moment I was in silent, muddled shock.  Again I was asking out loud, 'what was that?', trying to interpolate the prior moments' peeling away of the texture of reality and such.  I found myself pulled out of bed through no will of my own and hurtled into the next room.  I was flitting in and out of touch with myself as I was pulled from room to room of my house.  I was conscious of all the stuff I'd read about Salvia and at this point was thankful to know that I would soon regain willpower over my wayward limbs.   I was glad the table was not there.  I was glad the door was locked.  Later, I realized I scared my dog so badly he wouldn't come out from under the bed for an hour. </p><p>While not as significantly thought-provoking as the emotional and psychological effects of the Salvia, the loss of physical control so completely, yet with a sense of self, will require me to do some serious reflection. </p><p>1 and 1/2 leaf, folks. I find it shocking that many are firing up vastly greater quantities for their first try.  Or trying extract before the leaf.  Beware.  This is not a recreational drug.  Be ready to have to think through serious issues of self immediately after the experience. </p><p>While on one level I was glad to have had this trip in private, I needed to express my feelings about the experience immediately afterwards and couldn't get my hand to stop shaking enough to write.  (In fact, at one point, while being pulled about the apartment, I grabbed the pen, wrote one word, and was pulled in another direction, dragging my pen off the page.)  I called a friend and gushed like a maniac about a void and feeling remorse about having crossed a threshold. </p><p>Don't be stupid like me and get yourself a sitter for the first try.  Then you'll know.  Or you'd likely be better off not to. </p><p>All the stuff about respect for Salvia is not a joke.  I doubt that those without experience tripping have any remote basis for understanding the way it can potentially derange your being.  Even experienced trippers don't.  I didn't.</p>"
}
