{
 "title": "External to My Own Self",
 "author": "Penguin Butler",
 "citation": "   Penguin Butler. \"External to My Own Self: experience with LSD (ID 6853)\". Erowid.org. May 16, 2002. erowid.org/exp/6853",
 "substance": "LSD",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "6853",
   "Male",
   " ",
   "Not Given",
   "May 16, 2002",
   "6588",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had recently bought four hits of LSD blotter when I was informed by someone who had done this particular batch before that it was really weak stuff, and you'd have to eat a lot to get really high.  I didn't pay too much for the blotter, so I really didn't care.  I decided that I'd trust what the girl had said, and I'd take all 4 blotters at once.</p><p>Well Friday rolled around, and I had just spent some time goofing around with some friends and I was feeling pretty good.  I was planning on doing the stuff Saturday but I was pretty happy now, and I had nothing important to do later, so I decided to do it then.</p><p>I dropped the stuff at about 6PM, I held it under my tongue for a few minutes then I swallowed it.  It left a strange 'fresh' feeling in my mouth.  I didn't really start to feel anything until about 7PM.  It started with a feeling that things were somehow different, and I started to feel slight sensations of joy running through my body. Soon after that things started to take on a dream like state.  I don't know how you dream, but it was like dreams that I have.  They're in color and everything sounds and looks a little bit hazy and '60's color t.v-ish'.  I felt like I was somehow external of my own self.  It was like I was inside myself but I was experiencing things in third person.  A strange but interesting feeling indeed.</p><p>I was riding in a car for part of the time when I was high, and this was great.  Whenever the car turned or bumped I would go into a pleasurable feeling that would encapsulate part of my body.  It was kinda like the body feelings I get when I take LSA (Morning Glory extract) except to a much lesser extent.</p><p>These effects started to die down at about 10PM, but I still had an off baseline feeling for the rest of the night.  I tried to go to sleep around 11PM, but found it very hard.  I eventually drifted off into sleep, but it was very restless.  I woke up around 5 or 6 times that night. I finally went into a deep peaceful sleep at around 3AM.</p><p>I woke up the next morning feeling refreshed and alive, as I usually do after taking a hallucinogen.  Given this was my first time with LSD it was a good experience, but it didn't have all the funky visuals and feelings I expected it to, so I was somewhat disappointed.  I attribute this to the weakness of the blotter.  I would repeat this again, but with better quality LSD.</p>"
}
