{
 "title": "Mysteria Eleusii",
 "author": "acidpanda",
 "citation": "   acidpanda. \"Mysteria Eleusii: experience with LSD & Hashish (ID 6856)\". Erowid.org. May 16, 2002. erowid.org/exp/6856",
 "substance": "LSD & Hashish",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:40",
   "  ",
   "smoked",
   "Cannabis - Hash",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6856",
   "Not Specified",
   " ",
   "Not Given",
   "May 16, 2002",
   "Views: 7107",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI was going to a rave party with other friends, but we called the infoline and they said police had arrived and all was fucked up, so we stayed in the city. Found four Condoms [LSD] (one each). taken and gone to a friend's house.There, after about 40 minutes, LSD started to makes the usual effects: distorsion of the meaning, sensorial waves, mild hallucinations etc... We filled (very hard to do) three chiloom with charas, smoked and keep tripping with charas in the lungs. But in a while i felt something wasn't going the right way, I became very paranoic and feared to make something wrong to my friends,'cause I was too much respectful, I was afraid to breathe, 'cause I tought it may steal the air in the room. Desperately I spoke about it with a friend who taken me not out the paranoia but through the paranoia just hangin'me on. And then I sitted and ZOOM!!! my two eyes closed and opened the third one.</p><p>I was feelin' in the same time good and bad Vibrations, hot and cold, I could not say what I saw,I may answer: White and hot. After I don't know what I remember I gone to the peak of a mountain, sitted there and start staring the sky with eyes i've not used. Then I stayed there for a lot and then became the mountain.</p><p>I saw, then became, the being which fill all of us. I was definitively in a state of trance, and I moved my body ( For ex.I went to the mountain walking) like I move it now or ever, but it was more 'live', I was nearer to the being, Iwas a better image of the being, Iwas near to God...... you can judge it as you like, one thing is real: my life has been changed by myself, now I am a man alive; I woke up after a 21 year sleep.  I felt like: 1 it was my first LSD trip; 2 I was born in that moment. </p><p>I took LSD before this one time but never happened what LSD allowed me to make it happen. I had a Mysteric (like the Mysteria in Eleusis. The ritual drink, the kykeon, was made with some grains hops or something like that on wich grew claviceps purpurea...you can read 'bout this in a essay written by Albert Hoffman; in Italy its name is: Mysteria of Eleusis)experience. When I was in school I studied those things, Mysteria too, and I knew before the trip but never expected. Anyway the key I used (I realized this later, when my eyes re-opened) to break the maya's veil or anyway you call it, was to walk trough my paranoias and my bad feelings, looking at any part of me of which I was afraid, looking my miseries I was able to connect to the being. and it helps me even now in any situation I feel more owner of my body and my mind. Anything that once before I could only see-from-away, now I enter in. I am more human. This happened 2 months ago. </p><p>One more thing I like to say is: LSD is, relatively, a safe substance. I think when you're going in a bad trip means that you are working with the alienated part of you, the part of you driven out of the human settings by anything...the state, police, Church, TV, violence, anything you like, because anyone is unique and each has his 'weltanschauung'(I don't know the word in English, it's something like how you see the world).You are working with this part, you are seeing the inside of you. That's enough I don't want to force you to interpretate my experience (if you are reading, probably you are interested, if not Why you waste your time?). Bad trips aren't things from which run away, they are important to face one's unhuman face. Thanks for the attention and excuse for my macaroni english.</p>"
}
