{
 "title": "First Experience - Low dose",
 "author": "Paul",
 "citation": "   Paul. \"First Experience - Low dose: experience with Morning Glory Seeds (ID 6858)\". Erowid.org. May 19, 2002. erowid.org/exp/6858",
 "substance": "Morning Glory Seeds",
 "bodyweight": "9.5 kg",
 "header": [
  [
   "DOSE:",
   "105 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6858",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2002",
   "Views: 8404",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI decided to take morning glory seeds for the first time, having read about them here before hand.  I bought 3 packets of 35 seeds each of heavenly blues; 105 seeds in total.  They were not coated in any pesticides, and I had no ill or side effects.\r\nI was going to follow a non-polar 'washing' with a polar extraction, but circumstance did not allow;  I washed the seeds in cold water carefully, but not for very long; about 15minutes, rincing 3 times.  I then simply ate the seeds, about 10 at a time, chewing and crushing them in my mouth before swallowing them.\r\nI had decided to take a fairly low dose - I suspect more than 250 would be needed to properly 'trip'.  I have never taken LSD or mushrooms so cannot compare my experience, but I never had any visual or auditaury hallucinations, which was the main attraction.  I started to feel effects about 50 minutes after ingestion.  I would describe the feeling as pleasant, and very much like the start of the end of an ecstasy buzz.  In some ways I felt like I had drank say 2 double vodka-red bulls; There was a strange (but very subtle) body feeling, like energy in the legs / unrestlessness.  My pupils became very large, and I enjoyed music and changing computer visuals.\r\nThe feeling lasted 6-7 hours, but was always very subtle.  The best way I can describe it is as a really long drawn out come down from e, but without the 'fear' of the comedown so to speak.  I didn't want to go to bed, but felt tired - my eyes particularly.  For the first couple of hours of the experience I felt like I had a lot of adrenaline pumping - which was probably the case as I was quite tense.  This was mainly because just after I ate the seeds I had an annoying argument with an ex girlfriend, and I was trying hard not too worry about the set and setting thing.  I'm sure that as with any powerful psychedelics, this could have been disastrous, but given the low dose, it wasn't a problem.\r\nI think that I will try this again, but will crush the seeds first, in a coffee grinder before performing a simple cold water extration.  I don't think that anything more is required provided that the seeds are not coated in any chemicals.  I will take 250 seeds this time, perhaps more.\n\n\n"
}
