{
 "title": "Old Fart's Notes",
 "author": "Monkey Mitts",
 "citation": "   Monkey Mitts. \"Old Fart's Notes: experience with DMT (ID 68598)\". Erowid.org. Aug 14, 2008. erowid.org/exp/68598",
 "substance": "DMT",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 68598",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 14, 2008",
   "Views: 12231",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDose:<br>After extracting two small batches of fairly pure DMT from mimosa hostilis bark, I have had the opportunity to trip on the spice many times. For me, DMT seems to be fickle drug as far as dosage goes. I figure an average dose is about the size of a regular green pea, or half of a regular aspirin tablet, but sometimes this can trip me off into total hyperspace, while other times the same dose will give a mere threshold buzz. It could be the sloppy eyeballing of dosages or my overall mindset prior to dosing, or the difference in batches from different root bark that cause the lack of consistency in trip experiences. So my rule of thumb when it comes to loading up the spice on the layers of screens on my bong is that more is better. I've probably wasted some spice, but it does seem to collect in the screens and remain available if not all consumed in one setting.<br>Setting:<br>I've found that sitting outside on my patio in the cool of the evening is conducive for a maximum experience. The best trips seem infinitely long, yet last only minutes. Shapes and patterns dance in open-eyed hallucinations. Indescribable closed-eyed visions pulse in the inner third eye. The trees and bushes warp into Picasso-like weirdness. Light and shadows play bizarre tricks. It can be quite enjoyable if one is comfortable and relaxed.<br>Fear and apprehension:<br>After a few initial breakthru trips that made me comfortable with DMT, I began to have some rather scary trips. These large dose scary trips began to be the norm until after a while I decided to just put the spice away for a good long time and try it when my life was more relaxed and my health was better.<br>DMT makes me feel really old. I am a 47 year-old, overweight (250 pounds), man on blood pressure and cholesterol medicine and I get this scary feeling that the spike in blood pressure at the beginning of a trip is going to stroke me out or something. The feeling of dislocation of a really profound trip is still something I have a hard time with. The lack of feeling myself breathe is hard to grapple with and I have felt as if I was going to die several times during intense trips. I have this reoccurring feeling that my family would just find me dead on the patio, bong in my hand, flies buzzing around my corpse. <br>To really do DMT in the future, I have to have all those sunny, good vibe feelings before spanking the spice with a gentle nearby flame. Health concerns, financial worries, any stresses need to cleared away because the DMT trip seems to amplify these negative feelings for me. Bummer. And getting rid of these things isn't easy. DMT isn't an escapist drug like weed or booze. It is a profound tool in opening other realms of perception. For me it seems to be telling me to clean up my act, get in shape and get happy and then come back for a ride later.\n\n\n"
}
