{
 "title": "If Only Reality Was This Pleasurable",
 "author": "RighteousDopeFiend",
 "citation": "   RighteousDopeFiend. \"If Only Reality Was This Pleasurable: experience with Oxycodone (ID 68639)\". Erowid.org. Dec 20, 2011. erowid.org/exp/68639",
 "substance": "Oxycodone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   " ",
   "20 mg",
   "insufflated",
   "Pharms - Oxycodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "68639",
   "Male",
   " ",
   "Not Given",
   "Dec 20, 2011",
   "35296",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Oxycodone provides the most glowing and rapturous high I have experienced in my very thorough career as a recreational drug user.  I have used many opiates throughout the years (morphine, hydrocodone, hydromorphone, fentynal, codeine,) but oxycodone has always been my personal favorite, particularly in the form of those beautiful time-released OxyContin tablets.  Recently, I have gone on a four month hiatus from prescription drugs to focus on getting my life in order, but several days ago I decided to have a little reunion with my favorite pill for old times sake.  I will describe the experience here for anyone who might be interested.</p><p>I procured an 80mg OxyContin tablet and hurried to my dorm room feeling as anxious and elated as a child waking up on Christmas morning.  I sat at my desk and proceeded to crush the pill, my hands sweating slightly.  After carefully picking the outer coating from the pile I divided the remaining powder into three lines.  I drew an excited breath and quickly inhaled the first two lines.  I then walked to the bathroom and sniffed a bit of saline solution to increase nasal absorption.  </p><p>Whenever I snort oxycodone, I immediately feel a growing contentment, though the high does not begin for another five to ten minutes.  The first indication of intoxication is always a slight numbing sensation and itchiness at the tip of my nose.  Feeling this, I knew it was going to be a great evening.  I went out to smoke.  As I lit my second cigarette I felt the first pronounced wave of euphoria.  </p><p>The oxycodone experience is difficult to describe to an opiate virgin.  Personally, I feel as if I have suddenly gained all that I want in life and no longer have anything to fear.  I am perfectly content both mentally and emotionally.  All the tension slips from my body and I feel warm and utterly comfortable, as if I were sitting beside a roaring fire, wrapped in a delicate cashmere blanket, rocking gently back and forth.  Communication is pleasant but unnecessary.  Under the influence of oxycodone, no companionship is needed.  I accept myself and the world just as we are, not begrudgingly, but eagerly, ecstatically even.  </p><p>I return to my room and spread out on my bed, smiling stupidly and rolling about like a dog being scratched on its belly.  I feel as though a warm liquid were moving through my body, as if sauna jets were buried deep within my muscles.  I am now itching all over.  This may sound unpleasant, but oddly enough it is my favorite part of the high.  Scratching is unbelievably satisfying.  When high, I can sit and scratch for hours and be perfectly entertained.  </p><p>After an hour or so of scratching and cuddling with myself I decide it is time to do the remaining line.  Its a bit smaller than the first two, just a booster, roughly 20mg.  I sniff it all up and go downstairs to see whats going on in the day room.  My peers are just starting a movie and I decide to join in.  30 minutes into the film the Oxy is really starting to kick in.  The funny thing about oxycodone is that it comes in waves, much like MDMA.  Just when I think I'm coming down I'm suddenly higher than ever.  </p><p>The movie is a blissful blur, and when it is over I decide to go to bed.  I love sleeping on Oxy because I dont actually sleep, but I still dream.  Even when Im dreaming I am aware that I am high and I notice every itch and every scratch.  This is the most tranquil and beautiful part of the high.  Strange stories and forgotten memories float before my closed eyes.  Though I would not classify them as hallucinations, they are strangely three dimensional.  I marvel at just how good I feel and catch myself wondering, if only reality was this pleasurable</p><p>In the morning I pop out of bed, slightly high but feeling refreshed and ready to take on the day.</p>"
}
