{
 "title": "Molding the Universal Energy",
 "author": "Alex",
 "citation": "   Alex. \"Molding the Universal Energy: experience with Mushrooms - P. cubensis  (ID 68630)\". Erowid.org. Nov 26, 2011. erowid.org/exp/68630",
 "substance": "Mushrooms - P. cubensis ",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 68630",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 26, 2011",
   "Views: 3847",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friends 'M,' 'B,' 'J,' and I decided to try magical mushrooms over Christmas break after our first semester of college. My friend 'L' was having a stoner kick back at her house, which was supposedly a great place to try mushrooms because it was next to a forest. We were sitting on her back porch with a few of my buddies that were only smoking(including my friend 'W' who is very experienced with drugs, so he watched over us). It was about 9 pm when we each consumed 3 grams of P. Cubensis. Although I was pretty nervous, I was also excited. As I looked into the stars, I could already imagine that this experience would change my life.</p><p>9:15 PM - Slight stoned feeling</p><p>I was chilling out with my friends on the porch as more of my buddies arrived at the house. As I greeted them, I noticed I felt a little bit different, as though I was a little high, but in a way that I had never felt before. I went outside to explain what I was feeling, but M, B, and J felt nothing. </p><p>9:30 - Coming up</p><p>As I entered the house again, the sound of the television consumed me. It was an extremely intense sound, almost too intense. All of my thoughts seemed to be building inside of my head as the trip became more intense. The experience was becoming very amazing. My thoughts alone are indescribable, as though I was thinking through a soul from a past life.  It seemed as though everything had its own essence. I felt strangely connected to my environment. Although I was amazed by my initial thoughts, I was also getting agitated by the fact that everything was happening so fast.</p><p>9:40 - Hell</p><p>I looked at my hand while it was morphing. While observing it, I noticed a red spot on my hand that almost looked like a blood clot that wasn't there before I started tripping. I asked my friend if it was actually there, he said 'yes.' This freaked me out. Suddenly, everything started to go haywire in my mind. All of my tranquil thoughts were disrupted. To make things worse, another one appeared 5 minutes later. My trip turned very bad very fast. The thought of death in such a beautiful state of mind was overwhelming. </p><p>9:50 - Rejuvenation</p><p>I asked 'W' what was happening and he said that I would be ok. He then massaged my shoulder to comfort me, which almost felt as though he was sending positive energy into me through his hand.</p><p>I went upstairs to be by myself away from all the overwhelming lights and sounds. My past girlfriend 'A' then walked into the room with her boyfriend 'E.' The sight of her immediately comforted me. Her voice sounded like angels. I've always realized how sweet she is, and that turned her into a biological angel. I then met 'A's' boyfriend, who told me about his shroom experience, and talked me out of my bad thoughts because of his happiness when he talked. We then went downstairs into a room with all of the trippers. </p><p>10:10 PM - The peak - Heaven</p><p>As I entered the room, I felt as though I was entering heaven on earth. I sat down on a bed with plants sewn into the comforter. Suddenly, the plants almost turned to life, the comforter gained extreme essence, as though I felt connected to it. I then noticed the techno music that was playing right outside of the door. It felt as though it was flowing through my soul. I then stared at my hand as I moved it. It was no longer morphing, it was streaming. Whenever I'd move it, thousands of hands would follow. It was gloriously indescribable. I then proceeded to look up at my friends. Everything was streaming and its beauty consumed me. Everyone also had glorious red auras around them and inside of them. These auras represented my love for all of them. The auras shined into my soul, creating a deep connection to everybody. My body high turned into golden energy inside of me. My soul felt like it wanted to fly away into the stars. Everyone looked beautiful. The more beautiful the persons soul, the larger and brighter their aura. 'A' and 'E' were gleaming because of the way they helped me. It was spectacular to look at them together, they seemed to symbolize love. I loved everyone in the room. I was feeling so many emotions on top of emotions and they seemed to multiply. Something that I did not mention before is that I had a hard time speaking before my peak, in which I was almost mumbling. Now I had a clear voice and extremely clear thoughts, maybe the clearest I've ever had. It felt as though I was awakened into a world of clarity. Everything seemed to make sense. I spoke to everyone generally saying that there is universal energy and how it is in our power to mold it into positive or negative energy. I then proceeded to explain that we live lives of caution. Caution for fear of failure, caution for fear of not belonging, etc. If we stop doing things for fear, and start doing things for the sake of molding positive energy, then I think that we can create an eternal happiness. We should stop blaming others for being different. I realized that EVERYONE has a meaning for everything they do, because EVERYONE is trying to create positive energy for themselves, they just might not know how to do it. What people may not understand is that if they create positive energy for others, some of that positive energy will transcend into their souls. I now know how to forgive. I then forgave myself for my faults, and only asked that I do everything I can to fix them. All of these answers were given to me as I thought, and all of those ideas plus more appeared within a split second. I felt extreme positive energy as I came down.</p><p>Then until now..</p><p>I feel more positive about life. Although some of the concepts I understood on shrooms can easily be created while sober, I understood their significance on shrooms. That's why those ideas have been applied to my everyday life. I guess that is what enlightenment is: seeing something so beautiful that it is instilled in your mind. For example, when I listen to the music that I listened to on shrooms, I still feel the sense of 'connection' to that music. I think shrooms is a very peaceful, enlightening medicine for the soul. If you're curious about shrooms, try them. While you're on them, try to find a purpose to yourself , and if you do, you will be enlightened. Also, be around people you love, they can save you, like 'A' and 'E' did, from a bad trip. I liked life before shrooms, I now LOVE life.</p>"
}
