{
 "title": "Next to Nothing for the Fourth Time",
 "author": "daytripper",
 "citation": "Citation:   daytripper. \"Next to Nothing for the Fourth Time: experience with H.B. Woodrose (ID 68693)\". Erowid.org. Apr 14, 2008. erowid.org/exp/68693",
 "substance": "H.B. Woodrose",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "10 seeds",
   "oral",
   "H.B. Woodrose",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 68693",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 14, 2008",
   "Views: 10927",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI cannot for the life of me understand what I have been doing wrong in any case this is my fourth 'experience' using the baby woodrose seeds. Each time after trying mostly the same form of extraction or whatever you'd like to call it I came up with minor threshold effects. Here is the general procedure I followed: \r\n1. Soak the seeds in an alcohol or ethanol \r\n2. Remove the outer coating if needed after dry\r\n3. Grind the seeds up (powder in some cases, small particles in others\r\n4. Soak the seeds again in a filter and water creating a solution of supposed LSA\r\n5. Ingest the liquid, not the seed junk\r\nIn each case I felt the effects within five to ten minutes. These included: a slight lethargic feeling, some tingling and minor light effect (brighter than normal). Each time I tried some variation on above mentioned process and each time after 30 minutes any effects went away. I must also state, that I took those on an empty stomach. \r\nI'm not sure if I need to buy some sort of specialized HWBR to get the higher LSA content in it or what, but I feel that people may have left out pertinent information in the reports I've read. I know there is a way to truly extract the LSA from these seeds, but feel that as a common psychonaut I don't have the ability or resources. \r\nMy only hint as to why this isn't working has to do with the fact that the first time I took them, all I did was swallow the seeds. In this case the effects were much more akin to that of a real trip. There was an onset, a peak and a coming down period. It was also much like some of the other reports I've seen. As far as I know the seeds should be edible as long as they have been properly clearned. Therefore after much trouble I'd say to obtain any noticable effects I'd need to eat the actual seed.\n\n\n"
}