{
 "title": "Welcoming Sedation",
 "author": "KompelZ",
 "citation": "   KompelZ. \"Welcoming Sedation: experience with Mirtazapine (Avanza) (ID 68780)\". Erowid.org. Jul 21, 2010. erowid.org/exp/68780",
 "substance": "Mirtazapine (Avanza)",
 "bodyweight": "85 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 68780",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 21, 2010",
   "Views: 12760",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>O.K. I'm a long time reader, first time writer. My previous history with drugs is the usual: cannabis, amphetamines, MDMA, regular binge drinking and a heap of pharms (mainly benzos and opiates). Enough about that though.</p><p>Let's get one thing straight; I can't stand SSRIs. I've tried Lexapro (escitalopram), Aropax (paroxetine) and Zoloft (sertraline) and have never been able to take one for more than two weeks due to side effects. For me, it's always been mild depression, moderate anxiety and bad insomnia. After doing a bit of research and speaking to my doctor, we both decided that Avanza (mirtazapine) might be my best option--here's how it went.</p><p>I was prescribed 30mg tablets to be taken whole right before bed, but after reading up more on the drug, I discovered that lower doses generally produce the most sedation. So after eating a small portion of lasagna and downing two glasses of red wine for diner, I took a half at around 8:30PM, played my fav Nile album and waited for it to kick in (which took around 30-45 minutes). Effects I noticed were as follows:</p><p>-High level of drowsiness and general 'urge to lay down feeling'.</p><p>-Very slight visual distortion, although (unfortunately) no hallucinations. </p><p>-Mild reduction of anxiety and feeling of calm--although not really euphoric. Akin to maybe a low dose benzo like temazepam.</p><p>-A little bit of dizziness.</p><p>-Vivid dreams although not as vivid as I expected from reading the experiences of others.</p><p>-Very long, deep sleep (from about 9:45PM-8:30AM). Best sleep I've had for weeks.</p><p>-Very dry mouth in the morning.</p><p>-A bit groggy upon waking up, although not as bad as what I get with Stilnox (zolpidem). A few coffees helped that right out.</p><p>Once it kicked in, I turned my music off (I was playing around on my computer at the time), got a drink of juice, laid back on my bed and watched T.V. Can't remember what was on, but it doesn't matter because I passed out not long after. I'd had about 4 hours sleep the night before so this may have also contributed. All in all, it wasn't bad. Best anti-depressant I've tried so far and hopefully, it will be able to help me in the long term as well. Tonight I'm going to try a quarter of a pill (about 7.5 mg) to gauge the effect. If this works, I may do a quarter for a couple of weeks, then a half for a couple of weeks before I move up to a full pill every night. The main purpose of this is to help my anxiety/depression but the sleep inducing effect is also very welcome. I may actually ask to stay on a lower dose for this purpose alone, not too sure yet. Depends on whether the sedative effect wears off over time and whether or not my depression and anxiety starts to get worst. Anyways, peace out and thanks for reading.</p>"
}
