{
 "title": "The Bearer of the Light of Love",
 "author": "AA2277",
 "citation": "   AA2277. \"The Bearer of the Light of Love: experience with Coleus (ID 68806)\". Erowid.org. Sep 5, 2009. erowid.org/exp/68806",
 "substance": "Coleus",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "60 leaves",
   "oral",
   "Coleus",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 68806",
   "Male",
   " ",
   "Not Given",
   "Sep 5, 2009",
   "Views: 36025",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before I write this report, I would like to note that I have been taking around 1.2 g piracetam a day in conjunction with soya lecithin.</p><p>TIME: 0:00</p><p>I took a plant that I had, one of the most healthy as well, and said a quick prayer for it. I then proceeded to wash out all of the soil, and take just the plant with the roots to my sink. I de-stemmed the entire plant, even the leafs (took out the mid section) and left the roots and the loose leaf material. I was left with around 60 leaves and roots. I then put this into one coffee filter *just BARELY fit* and proceeded to brew an 8 cup load through. Once it was brewed I put it back in and rebrewed. and did that again and again and again for 5 total brews. The brew was now down to about 5 cups, and was about the color of coffee.</p><p>The nice thing about coleus tea: it is tasty. it is fragrant. it is calming just drinking it. Its got a very bold flavor to it, thats almost nutty and a little fruity. It would be enjoyable just having the flavor to brew. Its a great end of the day tea at any strength, however when I am drinking it for its effects rather than its flavor, I like to have it considerably strong.</p><p>time: 00:30</p><p>I am drinking the first cup now. I decided to go for a walk and listen to Self Titled - tortoise all the way through, since it had been a while. I was sitting on a bench at a local elementary school at about 11pm, smoking cigarettes, and just relaxing. I had brought a small thermos with me full of the tea.</p><p>time: 00:45</p><p>Coleus plays with light. Thats almost always been the initial effect me. Everything begins to look like an impressionist painting of itself. I hear absinthe shares a similar effect on vision/light. Everything has a shimmering/reflection on the lake effect added to it, and becomes played out on itself just a tad.</p><p>I begin to gain a heavy appreciation for the street running next to the school. This street was made out of dirt and rocks (I live in a sort of small town sort of out in the middle of nowhere) until about 5 years ago, when they re-modeled the school. Few cars drive on this road. It was raining slightly a few hours before, and this causes the road to just shimmer in its virgin beauty. All of the lights loose brightness and gain something else, I cannot quite describe it, but god does coleus make me feel in love with everything....Coleus is truly the plant of love. Salvia always makes me feel taken back. Just bewildered by everything, and theres always a chance of having a horrible time with it, and ending up in a worse mood than before. Datura shares a few traits when smoked with coleus, but the negative side effects always overpower the positive ones. Coleus is subtle and beautiful, and truly speaks to the undercurrent of light and love that the entire world is pulsing with.</p><p>Time: 1:00</p><p>I realize that my ipod has died. It had probably been dead for around 15 minutes. I don't really care. I wasn't enjoying the music much anyways. I had been enjoying the feeling of the wet bench against my legs and the sound of the crickets. I begin to think about my life in general. The tea has made me removed from myself almost completely. Most times this amount of plant material is not this intense, if you could even call coleus intense in any respect. Maybe adding the root to the brew helped punch it up a little bit. My thoughts aren't flowing. They feel non existant. How long have I been sitting here? how do I feel about that house?</p><p>Time: 1:15</p><p>I finish my last cup of tea. I am the most blissful mood you can ever imagine. I fear I might just cum my pants walking home from the school (god forbid...) Nothing external or internal seems to matter right now though. I feel as if my core essence, my core being, my core light, has been stripped raw and is left in a plain of darkness illuminating the emptiness around me. It should be noted with that last statement that coleus is never intense, it just wraps its arms around everything. Adds a nice little touch to everything in my life.</p><p>I notice I am stumbling a bit, probably due to the fact that the strong brew has made me slightly sleepy. I begin to walk home. I feel strongly connected with the path that I took to get here. I can almost taste the heaviness of my footsteps leading to this place, and I can almost see them. Almost touch them. I must have been so uptight before. Why the worry? Should life be so intense that I have to leave a metaphysical skid mark wherever I go?</p><p>Of course not. No one should. Sometimes we get wrapped up in things and thats okay, but its important to never loose awareness of the undercurrent. There IS a force at work at here. It may not be intelligent, but it will be forever omnipresent. I feel extremely content with the realization that no matter what happens, love will prevail. </p><p>time: 1:30</p><p>This is the hour of our lives. All things flow. All things mesh. The coleus has not had too much effect on my body, other than making me slightly tired and sleepy. The mind is where it has hit. I cannot imagine how much work it would have taken to put everything where it is right now. So much fucking work. I wish I could appreciate just the random beauty that is going on around me, for just one second, in its entirety. I think if I did that, I just might die.</p><p>time: 1:45</p><p>I wake up on the couch. The tv is off and an empty cup is sitting in front of me. Guess I dozed off. I realize that the coleus wanted me to sleep, and was trying to show me something in my dreams. I fall back asleep quickly.</p><p>Time: -----</p><p>I remember almost nothing from my dreams, although I do remember it being highly natural in feel. Maybe I was on a mountain - I think maybe? Oh well.</p><p>The night that I experienced left me with an incredibly glowing mood for at least a week afterwards. I'm not sure if it has ever completely faded. Something about this 'trip' brought me so much closer to my own existence. I do not think that it was the trip that changed me. I think that the trip was just a vehicle to bring me to something higher and more complete, and something that is not chemically induced, which I why I think that it never really faded, and I don't think it ever will.</p><p>-----------</p><p>All in all, this was a great way to say my good byes to a plant. Coleus has always loved me. Always held me. Always cared for me when I needed him most (yes, coleus is a male). I will probably always care for at least one coleus plant, seeing as he has given me so much love and warmth I could never repay him even if I grew him and propagated him amoung friends for the rest of my life.</p><p>And after all why should it all be about the plant. I should pay my respects more to the undercurrent of love than the method with which I discovered it. I hope that I never forget what I learned that night.</p>"
}
