{
 "title": "How to Enjoy",
 "author": "Moe Dog",
 "citation": "Citation:   Moe Dog. \"How to Enjoy: experience with Kratom (ID 68846)\". Erowid.org. Jan 1, 2009. erowid.org/exp/68846",
 "substance": "Kratom",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Kratom",
   "(extract)",
   " ",
   "  repeated",
   "oral",
   "Kratom",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 68846",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 1, 2009",
   "Views: 31436",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been experimenting with Kratom for the past 6 months and I believe that I have two methods of ingestion that are worthy of sharing. In fact I feel that Im obligated to share my knowledge. This wonderful plant will only stay legal threw responsible and informed usage.\r\nThe following is my preferred method of alcohol extraction.\r\nI only work with 3-4 grams of commercial grade crushed leave. I prefer 1 part red vein Thai to 2 parts green vein Thai. I have tried a lot of expensive Super Grades but in my opinion they do not warrant the extra cost. I have never needed more than 4 grams to achieve the 2 Vicoden buzz that I enjoy. In rare cases that I want a heavier experience I prefer to re-dose in a controlled manner rather than take a high dose and hope for the best.  \r\nFirst I weigh my dosage on a reliable scale (1 gram red, 2 grams green). I then place all of it in a coffee grinder and grind it to a fairly fine powder. I then place the powdered Kratom in a small glass bowl and pour in 2 ounces of vodka. I then microwave the mixture for about 15 seconds, just until the first signs of boiling. I then remove the mixture from the microwave and add one more ounce of vodka and repeat the heating process. I then allow the mixture to cool off enough to handle and pour the entire mixture into a cup lined with a coffee filter. I squeeze out all of the liquid I can. \r\nThis yields exactly 2 ounces of brown opaque liquid almost every time. I prefer to drink the mixture like Im doing a shooter, chased by a swig of beer. I must admit the taste is so bad that I do not allow myself to taste it. \r\n(T+5MIN)  I will feel a slight numbing sensation from the tip of my tongue.\r\n(T+10MIN) I will start to feel a warm opiate buzz creeping up.\r\n(T+15MIN) I will feel very relaxed and mellow but mentally sharp and able to carry  on a conversation  with out a problem. I will experience a slight warming in my ear lobes and face.  \r\n(T+20MIN) I will reach the peak of the experience and enjoy it until returning to baseline approximately 2.5 hours later.\t\r\nI have read reports from other Kratom users that have negative effects from re-dosing such as nausea but I have never had this problem. I have re-dosed as much as 4 times in a 6 hour window with out a problem.\r\nIngestion:\r\nThere are times that having alcohol on my breath or in my system is unacceptable. I have refined this ingestion method for just such times. Once again I never need more than 3-4 grams of commercial grade. I begin by mixing and grinding the Kratom the same as if I intend to do a alcohol extraction but instead of using alcohol I use water. I mix my powder with about 4-5 ounces of water and heat this mixture up on the stove on low heat stirring lightly every 5 minutes. When the water has been reduced to about one ounce I add just enough flour to make a paste that resembles horse manure. There really is no better way to describe it. \r\nThen I remove the paste and tear off enough to make a small ball, about a 3/8 of a inch in diameter. I then roll the ball in flour on a plate. I continue this until I have about one dozen flour coated rabbit turds. These turds will last in the refrigerator for at least a week. This is my typical experience when ingesting the flour balls.\r\n(T+0MIN) I will eat one third of the yield.\r\n(T+25MIN) I will feel a slight numbing sensation on the tip of my tongue.\r\n(T+35MIN) Heart rate will increase slightly and breathing is slightly shallower. Also my jaw will tighten up similar to doing cocaine but not nearly as intense.  I will also notice a warming in my ear lobes and face. My energy level will increase noticeably and manual labor is much easier.\r\n(T+40MIN) I will peak out and enjoy until returning to base line approximately 3 hours later. \r\nThe first time I tried the ingestion method it became very clear to me why the locals  of Thailand would chew the leaves while performing manual labor.\r\nI have refined these two methods to the point of being able to amp my self up or mellow myself out at will. I have truly discovered the healing powers of this plant. I use the alcohol extraction as a pain killer and as a cough suppressant. I use the ingestion method for increased energy and as a hang over helper. \r\nThese two methods are not my own creation. I have learned these methods thanks to people sharing their experiences. Im grateful to those who have taken the time to share their experiences with me.\n\n\n"
}