{
 "title": "Im a Poolside Accordion Smothered Face Down!",
 "author": "bleedin cedar",
 "citation": "Citation:   bleedin cedar. \"Im a Poolside Accordion Smothered Face Down!: experience with Salvia Divinorum & Cannabis (ID 68855)\". Erowid.org. Jan 6, 2013. erowid.org/exp/68855",
 "substance": "Salvia Divinorum & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 68855",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 6, 2013",
   "Views: 3055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had always wanted to try salvia, so I was overjoyed when my package of 10 x Salvia extract came in the mail. I had read extensively about other peoples adventures and visions while under its spell, so I knew well that it had the potential to send me into a foul trip. I also was aware that it was wise to have a sitter to look after your meat vehicle while the pilot was abandoning ship, but I had no such friend available at the time. I decided that in the name of discovering new worlds of the skull that I must embark, even if alone\r\nI lay back on my bed and loaded a nugget of cannabis into the bowl and gently sprinkled a frugal pinch of salvia on top. Before I sipped the smoke, I calmed my body and heart-rate in a meditative fashion, preparing myself for the jade princess to whisper manna in my ear  I took a slow, deep rip on my pipe, and held my breath for nearly 40 seconds. I gently exhaled and immediately felt a menthol-like sageness flow past my lips as if a mint spirit were escaping. \r\nFrom out the corner of my right eye a miniature, silhouetted figure walked along an invisible platform, making is way slowly in front of me. It stopped its walk and started turning a lever just his size, almost like a jack-in-the box crank. Everything immediately in my right eyes vision turned 2-dimensional, while my left eye stayed normal. My 2-D right-eyed world started falling slowly backwards like a drawbridge as the figure turned the crank.\r\nI started laughing my fucking ass off it was so funny. Not normal laughs, but huge spasmodic joy bursts! Slowly the drawbridge raised and the figure vanished.\r\nThe fuzz lifted from my brain and I beamed a smile across the room and laughed out loud again.  WoW!!\r\nI immediately loaded another bowl, just the same as before, but before I did, I put on my headphones on and played a trippy mellow song for added effect. I lied back on my pillow and let er rip. I held the hit in, and felt the minty sage essence storming into my lungs. I exhaled and immediately melted slowing into the bed, as if it were quicksand. It made me feel like that dude on Trainspotting when he melts into the carpet on H, except all the colors of my world were smearing like a painting as my bed sucked me down into a pit. I noticed that the music didnt change at all in sound, nor seem enhanced one bit. Which was strange because, my entire world around me drastically changed. I looked up to see my feet sticking out the opening of the hole I was in, like my legs were growing and emerging out the top.  It was then that I noticed another silhouetted figure standing in my presence.  It peered down the sinking pit at me with a blank look on its bald electric head. It was like seeing swirling static manifest itself into a being. I then felt myself rising up back to normal. As I ascended out of the cavern the being vanished. I sat calmly on my bed as an invisible menthol current made of carbonated clay, floated across my face and chest like an invisible river. It all slowly faded as I drifted back to normal, the emerald fog lifting from my dazzled head.\r\nWOW!  What was that!!\r\nOf course I loaded one more bowl because these were the strangest most believable hallucinations Id ever experienced.\r\nI nearly doubled the next bowl and loaded no ganja this time. Strait extract. I thought I would just sit back and enjoy the ride behind my eyelids this time so I closed my eyes. I lit the bowl, inhaled, and held on tight. The smoke this time was noticeably harsher and a little more difficult to hold deeply. This, being the last thing I remember in realtime \r\nThat pit I talked about before opened again, except my whole being was smeared against the walls of the squishy Technicolor mud bog I was being sucked into. I instantly felt like I was being suffocated, either because the watercolor world around me completely engulfed me, or because I left the galaxy before I released the hit from my lungs either way I panicked big time. \r\nI felt a presence like something was trying to secretly smother me and hide my body in this psychedelic troll hole or some shit!  I started screaming: HELP ME!! HELP ME!! as the rainbow clay violently filled my lungs. I then totally flipped out, and my world began spinning like a pinwheel. I grasped for anything, feeling like an infant drowning in a pool of Jell-O, speechless! I continued to panic as my reality began to re-materialize, the nature of things finally swirling back to their proper place. I stood there panting, staring at a picture of Buddha on my wall, as the wall itself come back to form. I felt like I had escaped the jaws of hell, and barely survived! I was completely and insanely frightened! I then realized I was standing in the opposite side of the room, not recalling how I got there or how I didnt tip over my table or bookstand or anything! No more SALVIA I thought. At least for tonight  :  )\r\n1 month later.\r\nI finally raised enough courage (or boredom) to embark on another salvia excursion. I had recently purchased earplugs and a black sleeping mask that allows you to keep your eyes open in complete darkness, supposedly making the expedition more chill and manageable. I calmed myself by slowing my breath, easing the slight anxiety I felt for Sally D. I loaded a pinch the size of a pinky fingernail, into my pipe and lit up. The familiar cool haze tingled through my body as I held the hit. I decided to hold it as long as I could. I dont remember how long it was cuz, I rushed through the magic door before I could get a handle on it. -Black out-. Except there was nothing black about it \r\nMemory is kinda fuzzy on this one, probably because my mind is trying to block its existence out of my head! But, what I do recall was reliving either a trace of a past memory, or some kind of scene from a movie or something. Anyway, a very strong deja vu like presence permeated this vision.\r\nI was staring into a big, cement-like room. It echoed with sound, and felt a lot like a community swimming pool or some kind of warehouse. Nonetheless, there were two voices I overheard talking. One was a male the other female. They were talking casually and friendly, towards each other. & For some reason I had a feeling like they were closing the place down, cause I was getting a closing the shop for the day kinda feeling (whatever that is!)  But anyway, what happened next was too frightening to fully try to describe.  Across this big room, the wall started to crinkle into an accordion like design or almost like a book closing its pages. The people kept chatting, and at the same time, some how, closing the wall into an accordion rainbow dimension. Suddenly I was turned into the cover of the accordion book as it slowly closed, lowering to the ground. I continued unfolding forward as my face made contact with the ground. I immediately began suffocating, and had the feeling like these people didnt realize they were closing my accordion book existence into the ground forever. Layer upon layer of the accordion folded into my back, pinning me harder against the ground.  I was scared shitless and speechless!! Literally lost my voice in terror! I fluttered and struggled, strangling my existence into non-being. I new I was somehow fighting the Blob of tomorrows death. I barely held back some kind of constricting shadow demon multi-dimensionally, until I realized I was halfway back into the reality of my room. I flailed, pulling at my head and ears, making one of my earplugs come out. I literally thought I was pulling chunks of my earlobe off my face! Still feeling like I barely escaped alive, the wall began to swirl back to shape. I, at that time, had a strong impression to run over to my next-door neighbors house and tell them I fought the black angel of death and survived!. . .  luckily I waited a minute, finally deciding that would be completely foolish. I was drenched in sweat, and my body felt a twisting sensation, like a towel being wrung out. I dont even no what happened to the mask, lost in the accordion of time or something\r\nI slunk across the room utterly defeated, & slipped into my sheets quietly. I felt like a dog lying in the corner, sheepishly avoiding its abusive master.  I turned out the light & proceeded to not sleep for the next week\r\nAfter a straight week of insomnia I went to the doctor, and got prescribed some anti-anxiety meds so I could mellow out and sleep. It finally worked, and now Im somewhat back to normal.\n\n\n"
}