{
 "title": "One Bad Reaction Leads to Another",
 "author": "SlowRecovery",
 "citation": "Citation:   SlowRecovery. \"One Bad Reaction Leads to Another: experience with LSD, Risperidone (Risperdal) & Mirtazapine (Remeron) (ID 68888)\". Erowid.org. Jul 12, 2010. erowid.org/exp/68888",
 "substance": "LSD, Risperidone (Risperdal) & Mirtazapine (Remeron)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "LSD",
   " ",
   " ",
   "  ",
   " ",
   "Pharms - Risperidone",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Mirtazapine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 68888",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2010",
   "Views: 7129",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy nightmare began in late November of 2006.  I had had a bad reaction to lsd, and, after hallucinating and having other bizarre experiences for two months, I decided to check myself into a hospital for treatment.  This was in October of 2006, October 26th to be exact.  In the hospital, I was given 3mg of Risperdal to treat my *unusual* state of mind, along with a small dose of Remeron, a multi-vitamin, and the chance to take Restoril (to calm my nerves) as needed.  I was in the hospital for eight days total, and left feeling mostly stable and strong, with a prescription for Risperdal, along with a prescription for Remeron, in hand.  I returned to work the following day.  I had continued to work from the time I reacted badly to the lsd, up until the time I checked myself into the hospital.  \r\nIn terms of the meds and my mood, everything started out all well and good, for the most part, except the Remeron gave me weird dreams and restless legs at night, and the Risperdal made me feel overly blunted and sedated.  Then, one night, I decided to masturbate.  So I did.  Masturbate.  After a few minutes, the time came to...let things fly, as it were.  My muscles tightened in anticipation of the ensuing pleasure, my penis started twitching and...and...nothing came out.   Good god, what the f*ck?  Nothing came out!  What the f*ck!  I had an orgasm but didn't come!  Couldnt come!  What the f*ck?   This was a prelude to later and greater dysfunction, my first glimpse at some of the horrid side effects of psychiatric medications\r\nBut anyhow, moving along, somehow I knew the Remeron was responsible for my inability to ejaculate.  I stopped taking it, continuing only to take the Risperdal.  My ability to ejaculate returned.  Things went on from here.  I didn't miss the Remeron, and the Risperdal, though not pleasant by any means, did help tone down my mind, which was still overactive.  I felt productive enough at work, and felt like my overall condition was stabilizing.  Within two weeks, I dropped my daily intake of Risperdal from 3mg to 1.5 mg.\r\nFast forward to Thanksgiving.   Here, things get blurry.  I live in a major east coast city, and I traveled to visit my parents, who live in the suburbs of another major east coast city.  That much I remember.  I remember having the desire to masturbate, but not being able to get erect. I believe the Risperdal was responsible.  I remember being horrified that I couldnt get an erection.  I remember trying desperately, as hard as I could, to gethard, but my plumbing wouldnt cooperate.  No matter what I did, I couldnt get an erection.  Again, what the f*ck?   Whats going on here?  Fear.  Fear.  More fear.  I walked to CVS from my parents house.   I bought a bottle of Horny Goat Weed.   Took two capsules.  Waited.  My soldier wasnt being revived.  More fear.\r\nThings got worse.  Right around this time, erection issue aside, still visiting my parents (..I think.?.), f*ing Risperdal REALLY started clamping down on my nervous system.  With the force of one thousand bricks.   One thousand bricks.  Words cannot begin to describe the horror, the absolute and TOTAL horror, of what this was like (fear.confusion.chaosOh my god!Oh, my god!Oh, my god!Whats happening?What the f*ck is happening?Oh, my god!).  I felt a cold and lifeless chemical presence sterilizing the tubes attached to my testicles.  I became one-hundred percent impotent.  Fear.  INCREDIBLE ANXIETY.  Mental horror.  My insides annihilated.  Fear.  My libido deadened, decimated.  Terror.  My imagination completely and totally stripped away.  Oh my god, whats happening?  Make this stop!  Please!  Fear.  Terror.  Horror.  My emotional life destroyed.  Please!  My consciousness dislodged from my body.  Cant sit still, cant sit still.  Fear.  Fear.  Fear.  Everything blurry, my soul twisting, unimaginable torture  I became a lifeless wreck, a complete and total lifeless wreck.  I couldnt read, I couldnt think, I couldnt concentrate, I couldnt feel  I tried lowering the dose of Risperdal.  My mind would spin.  Up the dose again.  More horror, so less Risperdal.  My mind would spin.  Again.  And so on, and so forth.  Very unpleasant.  \r\nFast forward again.  Ive been off of Risperdal for thirteen months, but the symptoms Ive described, which started one month after starting Risperdal, have not yet completely gone away.  I still have virtually no libido, my erectile function is far from being fully intact, my emotional life is only a fraction of what it once was.  On bad days, I feel like theres a gaping hole between my ears, or like Im a walking spinal cord and set of frontal lobes.  Ive spent eight hundred some odd dollars on vitamins and minerals and herbs and amino acids and protein shakes and other nutraceuticals in an attempt to heal the damage.\r\nI am slowly healing, though, after all this time, slowly healing.  Sometimes I feel like giving up, especially when the lobotomized feeling is most salient, but somehow I manage to continue, in spite of feeling like an inhuman mess much of the timeYeah, somehow I manage to continue, and I am slowly healing\n\n\n"
}