{
 "title": "Label your Drugs!",
 "author": "Spasticfleisch",
 "citation": "   Spasticfleisch. \"Label your Drugs!: experience with Amphetamines & 5-MeO-DiPT (ID 68944)\". Erowid.org. Jul 23, 2008. erowid.org/exp/68944",
 "substance": "Amphetamines & 5-MeO-DiPT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Amphetamines",
   "(powder / crystals)",
   " ",
   "  ",
   "rectal",
   "5-MeO-DiPT",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 68944",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jul 23, 2008",
   "Views: 10853",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I recently got half a gram of very good quality amphetamine sulphate. I used it the night I got it and then continued the next day. I snorted a bit in the afternoon and then plugged what I thought was a booster dose.</p><p>So half an hour or so after I dosed I wondered why I was seeing some minor strobing but I assumed it was just my fluorescent light, recent trips, and stimulated mind. And when I felt my skin tingle, I thought I was just really feeling it. So when I got pitch distortion, time dilation, nausea, and extremely vivid visuals I was scared shitless. My heart rate was at 80-90bpm when I started to wonder what the hell was going on and when the peak had fully built, my pulse was in upwards of 140bpm. I was overheating and thank god it was the middle of January so I walked around outside. The visuals were so intense, I was scared that I wouldn't be able to see if they got much stronger.</p><p>I was scared, didn't know if I had OD'ed or went into speed psychosis. I felt paranoid and had to keep walking around telling myself that I am okay and to stay calm. After 3 hours I figured out I wasn't going to die but still didn't know what was going on. </p><p>My roommates got home and I told them what I thought happened but was okay, so they asked for a bump. I took out the bag I used last and tried to make lines but I was shaking too much, so they took care of it and then went out for a jog. This whole time I had a low orange light on because my main light was buzzing and driving me nuts. Huge mistake. </p><p>When a friend came in and asked for a bit I pulled back out my box of drugs and got my labeled bag of amphetamine. Wait, that wasn't the bag I just used! And then I realized why I was tripping - I mistakenly used my foxy. Even worse, I realized what I gave my roommates. I am really surprised they didn't note the burn but when the came back they called me into their room and asked why they puked. I cried, I felt horrible. I told them what happened, effects they will feel, how to kill the trip, etc. They said they weren't mad, that they did it voluntarily, they saw my labeled bag of amph and should have remembered but still, it was a huge mistake of mine.</p><p>So they smoked some bud to feel better and then went for a run and ended up meditating by a stream. I am really glad they were okay and I was too. I was sore, didn't have an appetite the next day, and really sleepy but that's it. It could have ended up much worse.</p><p>Always label your drugs IMMEDIATELY and take extreme care if choosing to mix amphetamine and foxy! I got really hot.</p>"
}
