{
 "title": "Strike Two",
 "author": "DannyBoy",
 "citation": "   DannyBoy. \"Strike Two: experience with Gabapentin (Neurontin) (ID 68948)\". Erowid.org. Oct 6, 2011. erowid.org/exp/68948",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "301 lb",
 "header": [
  [
   "DOSE:",
   "2900 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 68948",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 6, 2011",
   "Views: 10744",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt should be noted that my metabolism is relatively slow compared to the norm, so effects for most others would probably occur sooner than they had with me. This is my second trial with gabapentin, the first having been 800 mg and then 800 mg more at t=180 minutes with no noticeable effects during the trial. For this trial, I'm in my home, alone, and settling down to watch some TV and relax.<br>t=0 min:\tDOSED 2900 mg OF NEURONTIN (gabapentin) with food and a pot of coffee, as food increases bioavailability by 14% according to the drug's monograph.<br>t=160 min:\tI've begun to notice a sort of delay in perception when I turn my head quickly to one side. Otherwise, I notice no other effects.<br>t=185 min:\tI've begun to feel slightly tipsy, as with after drinking a couple beers in rapid succession. Nothing to write home about, though.<br>t=190 min:\tI'm a little disappointed at this point, and am wondering if alcohol will potentiate the gabapentin in my system, since the monograph warns against taking alcohol while on the drug. DOSED A DOUBLE SHOT OF EVERCLEAR, 190 proof, WITH 32 ozs OF ORANGE JUICE, approximately equivalent to 2.5 to 3.8 drinks, where a drink is defined as one 12-oz beer, or one 5-oz wine, or one mixed drink ranging from 100 to 151 proof.<br>t=210 min.\tI'm feeling even more tipsy (no surprise here) but I don't feel drunk or stoned.<br>t=290 min.\tThe effects seem to be waning now.<br>t=375 min.\tThat's all folks. I seem to be back to baseline.<br>Overall, I'm disappointed. I've heard great stories about gabapentin from others. Bummer. I'm a big guy, so things sometimes don't work for me at a lower dose range which others use. Overdose of gabapentin is said to be 8000 mg in a day, so I can still go up quite a bit. Once I get more gabapentin from the doc, I think I'll do a trial of 6000 mg. If that doesn't do anything, I'll give up. Thanks for reading! ;-)\n\n\n"
}
