{
 "title": "Really Does Work",
 "author": "j.b.",
 "citation": "   j.b.. \"Really Does Work: experience with Kratom  (ID 68968)\". Erowid.org. Feb 25, 2008. erowid.org/exp/68968",
 "substance": "Kratom ",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Kratom",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2008",
   "68968",
   "Male",
   " ",
   "Not Given",
   "Feb 25, 2008",
   "7599",
   " "
  ]
 ],
 "report": "<p>Background: I am a 20 year old 130 lb male. I have had vast experience with marijuana, cocaine, methamphetamine, mdma, as well as mushrooms and various pharmacueticals.</p><p>I decided to order a kratom resin 'pie' (cold water extraction resin) of 36 grams from a website that verified the authenticity with 2 outside sources. Upon arrival i checked my digital scales and proceeded to break of 3 grams of the substance. It was as hard as a rock and required a screwdriver to break, and it had a tendency to crumble or shatter into a powder as well as chunks. After weighing out my dose i crushed into a powder and took it like a BC powder or goodys. It had a horrible bitter taste. I then gave 4.3 gram chunk to my friend M for an experiment with smoking the resin. </p><p>M started smoking the resin out of a small metal marijuana pipe and after about 5 mins he stated that he felt like he had smoked a small amount of marijuana. Within about 25 mins i started to feel warm all over and a nice body buzz, nothing too powerfull just a nice warm feeling. I would compare it to maybe a 10 mg hydrocodone or oxycodone. </p><p>I had heard that small doses give the user energy but i did not feel this effect, rather slightly relaxed or drowsy.I also felt a little more talkative than usual rambling on about things with my friend. This feeling lasted roughly 2 hrs after which i had a slight headache but nothing major.</p><p>Overall I love this substance and plan on upping the dosage to maybe 5 or 7 grams althought I was quite surprised by the potency of the resin. My advice to people planning on ordering, be careful where you order it from and start at a low dose, because yes, it really does work.</p>"
}
