{
 "title": "The Star Wars BART Train",
 "author": "The White Knight",
 "citation": "   The White Knight. \"The Star Wars BART Train: experience with Mushrooms & Cannabis (ID 68985)\". Erowid.org. Sep 24, 2009. erowid.org/exp/68985",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 68985",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 24, 2009",
   "Views: 2503",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience was my third and latest time using mushrooms. My friend Dub and I bought tickets to a crazy Dan Deacon electronica concert in San Francisco and decided that being on mushrooms for the show would enhance it quite a bit. We each had an eighth oz from a quarter I had bought about 5 weeks prior. Two weeks before the show, we had both eaten an eighth a piece in Monterey, CA and the mushrooms for the show were from the same purchase. The Monterey trip was very serene and introspective. Nothing intense or overwhelming. I assumed that the mushrooms had lost some or most of their potency since they looked like they should have been pretty good (bluish stems, huge caps, gold flakes). What this dose taught me is that no trip is ever the same. You can never expect anything from a high, whether from marijuana, ecstasy, acid, or even alcohol. There are so many factors occurring in the body of the person on the trip that you can never predict exactly whats to come. That being said, into the story of the SF night.</p><p>I picked up Dub at the train station. He had smoked a few bowls of some high quality cannabis before getting on the train. I had worked all day. We left the train station for BART (Bay Area Rapid Transit - its like a subway above ground). In the parking garage we shared two bowls of more high quality pot in my truck to make the BART ride more fun. We had planned to eat the mushrooms somewhere in The City so we could come up at the show. We then realized how much of an effort and an inner-struggle it can be to eat mushrooms. Especially ones that smell and consequently taste particularly like cow shit (which ours definitely did). The two of us concluded that eating them in my car before going out into public would save a lot of shady glances from strangers. After a fierce battle, we choked down our psilocybin fungus, only to be faced with the hard truth that smoking all that tree probably made the taste far worse. Either way, we finished the shrooms, and, feeling quite high, went down the elevator and got on our train.</p><p>This is where shit gets crazy.</p><p>The train was fairly crowded. I wanted to sit somewhere so I could talk to Dub and get some feedback on the insanity of the mushroom trip that was sure to follow. There was nowhere open. We were forced to deal with the attack of craziness that was about to hit us without being able to console each other. It was me against the universe. I was still feeling super baked on the train when something sparked in my brain that reminded me of the mushrooms and that I should start tripping soon.</p><p>And thats when, with all the force in the galaxy, not 20 minutes after eating the mushrooms, the trip hit me.</p><p>There was no come up. At all. There was no warning. No strange warmth in the pit of my soul that alerted me of the experience to come. Within one second, I went from completely stoned to completely tripping. That bothered me a little bit, since it was a lot to handle so quickly. I soon came to embrace it, however. My goal had been met even sooner than I had expected. I tried to make hints of what I was feeling to Dub without drawing too much attention to myself. Thats when the trip went from contained to unrestrained. I was no longer in control of anything, anywhere, anytime. I never had been. The mushrooms took the wheel and I jumped in the back seat of existence. I had stood up, taken one big step out of the boundaries of my reality - the reality I had always known, always lived in - and stepped into this entirely new reality that had always been happening parallel to my own.</p><p>I was definitely on mushrooms. The best part was that now, even in this new reality, there were two places. There was the standard mindset, the one closest to sanity, that I was in if I looked anywhere (up, down, left, right, behind) besides directly ahead of me. If I looked over at Dub, I was almost sober. But if I looked forward, directly ahead, a new place appeared. It was the land of mushroom intensity. In this world, every sense and perception was amplified 100 fold. Every sound and color and nerve impulse was the most epic thing ever. The more sober state was like having your head above water. The more tripping state was like diving my head underwater and having every sense become distorted. I had no perception of time or space. I was there and I was not there. It was almost too much too handle alone. I looked over at my fellow fucked-up friend and wanted so badly to share with him what I was feeling. But I couldnt. We sort of had an unspoken understanding just with a particular glance. We had to keep quiet. Just til we got off BART. We didnt want to deal with security in a state such as this. </p><p>I decided I would brave the New Frontier of the Trip Straight Ahead. I stared straight in front of me. Suddenly my body felt like it was hit by a wave of energy; a warm, heavy, profound energy that would help me through the rest of the trip. I was grateful for it. Gradually, colors intensified in contrast. The whitish light from the lights on the train faded into a bold yellow. The ladys hair in front of me became purple with swirling lines of gray. On BART trains, there are double seats that face both directions on the train, so that its always possible to sit forward or backward, depending on the direction of the train. There are also seats that face to the side for easier access for the handicapped. On the sides of these sideways-facing seats is a false plywood panel added for aesthetic purposes. It was a solid brown oak sort of color when I first got on the train. It had now become an ever-changing plethora of four colors. It would fade from green, to yellow, to red, back to a deeper, more contrasted brown, and back to green. Over and over. The board had four symmetrical knots forming a square in the wood. These knots came to life. Gained a third dimension. They looked as though I could have walked over and grabbed them. The knots-turned-knobs were twisting and swirling completely out of sync.</p><p>I felt overwhelmed. I tried to stop focusing on the board and tried to broaden my sense of everything. I focused on the train as a whole. Suddenly noises I had no idea were even there came into my mind. I was aware of every sound being made everywhere around me. But there was no differentiation. Every female voice sounded exactly the same. They were all just ambient, senseless, meaningless sounds. Every creak and hiss and whistle and beep in the train sounded exactly like the one before it. The conductor said things over the speaker, but I couldnt perceive or understand them. I began to stare down the long corridor of the BART train. It was night time by now and I could make out street lights from the roads below the train. If I stared ahead long enough, the lights would vanish, and the windows of the train became solid, infinite black.</p><p>I then felt as though the train was traveling at extremely high speeds down toward the center of earth. I felt like I was being sucked into a black hole. Then the train hit a slight turbulent spot and I freaked. I felt like I passed through earth and was heading into hell. I thought I could see the blackness outside the windows begin to fade into a fiery red. I quickly snapped out of it and tried to enjoy myself. But I couldnt keep my mind off the Hell Train. I then tried to change my whole outlook on the train. Instead of it spiraling downward through a black hole into hell, it was my Star Wars ship zooming at light speed through space. At the speed of light, there is no time. That is where I was. Time no longer held me. I was a being constrained only by space. All the beeping and voices added up to form my Millennium Falcon, carrying me through space without time. This is probably the only thing that kept me from losing my sanity on the train. Had I continued to hell, the whole night would have been ruined.</p><p>We got off the train and headed out of the station. Dub and I were really fucked up. Using stairs had no familiarity in my head. Walking was almost impossible. It was like the mushrooms had flipped the OFF switch in my brain. Luckily Dub knew how to get to the show and we made our way there. En route, we passed the Bill Graham Civic Center and City Hall. On City Hall in San Francisco rests a massive Romanesque dome, sort of resembling the Capitol Building in DC. The lights from the dome were nothing short of magnificent. In the distance the light traveled from the top of the dome to my eyes, the rays danced and darted against a dark night sky. They werent photons anymore, but they had substance that could be bottled and saved for another time. I wanted to steal all this light and keep it for myself. I was actually quite disappointed when I realized I couldnt.</p><p>We finally made it to the show but had to stand in line outside for will call. Standing in line, Dub and I were approached by a fund raising man for some veterans organization. Under standard mental conditions, I would have been able to misdirect this man and avoid donating any money. But an uncontrolled compassion and sympathy rose up inside me. I was going to give this guy money. I had no other choice. The question is, How much am I going to give him? I reached into my wallet and (luckily) was able to overlook the 5 inside and grab out two 1s. I handed them to him and he was greatly obliged. I felt honorable.</p><p>Once inside, we checked our coats and made our way toward the front to meet some friends. The mushrooms had settled to a solid trip at this point. They had plateaued on the train and I was able to handle myself. Four friends were there and they were all drunk and/or high. I tried to conceive or perceive what it was like to be drunk; or high; or sober; or drive a car; or have sex; or talk to a family member; or eat an apple; or be alive; or experience reality. I had no perception of anything. My brain was receiving all these sensory stimuli but was unable to process and distinguish it. Normally on mushrooms, I sort of wave in and back out of reality. I have my momentary lapses of fucked-upness and sort of realize the severity of my state. This time, I had absolutely no idea what was real and what was imaginary. I wasnt waving back into reality. I was stuck outside of it. Are all the musicians swirling spirals of color? Did the first bands singer just crawl on the floor behind me? Is that guy hitting an electric drum set on the floor? I simply had to sit back and let this wave of senses engulf me.</p><p>I suddenly felt a burden left. An easiness creep over me. It was like a monkey on my back had kept me down for all this time. The monkey was me trying to make sense of everything that was happening to me. Once I was able to relax, I began to enjoy the show much more. I became one with everyone around me. I wanted the entire audience to crowd around me. I wanted everyone to be as close to each other as possible. I wanted everyone to feel this great love I felt for all of them. I suddenly was aware of the great fault of man. Our greatest weakness is that we distinguish each other as black or white or female or tall or fat or blonde or ugly or smart or bitchy or Muslim or any other of the countless labels we place on each other. I was aware that we are all one species, man, and we should treat each other not as a black man or a white man or anything else, but as a man who is black or who is white or who is anything else. Individual characteristics dont make us any less human, just more interesting.</p><p>Soon afterwards, Dub was unable to handle the experience any longer, and we left the show before the main attraction even came on. This marked the beginning of the end of the trip. I wanted to be open and free and energetic and Dub just wanted to get back to my truck to smoke a bowl and chill out. All in all, it was a phenomenal experience, filled with lessons I still adhere to to this day.</p>"
}
