{
 "title": "I Had Only Seen Sharks On TV Before...",
 "author": "KRM",
 "citation": "   KRM. \"I Had Only Seen Sharks On TV Before...: experience with Cannabis (ID 6899)\". Erowid.org. May 28, 2002. erowid.org/exp/6899",
 "substance": "Cannabis",
 "bodyweight": "71 kg",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6899",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 28, 2002",
   "Views: 6291",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nOkay, I had only taken weed 3 times before this experience. It might be weird but I don't know, somehow the first two didn't have any effects on me. Of course it had some, but at least it wasn't as I had expected.</p><p>I got a friend, E , who's been smoking pot for over a year. He would come to school so high, wouldn't listen to the teachers, and stare around foolishly. He would tell me about the experiences he had while smoking weed and finally these made me try it.</p><p>Before marijuana, I had only smoked cigarrettes and taken alcohol, so I was a bit anxious about what could happen to me. The first time I smoked one joint, and honestly NOTHING happened to me. As I didn't get what I wanted from marijuana I wanted to do it again. That was a bit better and I felt high. But again, not as I wanted.</p><p>And here it comes..One day, E told me that his friend had got some strong weed and asked me if I wanted to go over and get high :) I couldn't say NO, because I wanted to have that feeling of highness so much. So we went to his house, prepared the bong , and started hitting.</p><p>1.. 2.. and I started feeling strange.. I was acting so different, I realised. But I could say to myself that 'I'm not high' 'I'm okay'. But with a look at the mirror, I saw my eyes half open, and bloodshot. I was having so much fun, we were listening to rap, and dancing wildly. I felt a little tired and sat on E's bed. He was sitting beside me singing. I lighted up a cigar and it's smoke got into my eyes, it hurt me so much and my eyes were all watery. I kept them closed for a few seconds and as I opened them THE WHOLE ROOM WAS FULL OF WATER.</p><p>I could see bubbles around the room just like I was in a pool or a sea. Things were floating and so was E's hair. Suddenly a blue shark, just like a cartoon passed behind E. I stared at it for a few moments and tried to realise what was happening. The shark made a few curves and faded away and I blinked to see it again but as I opened my eyes, everything was gone. I was in the room again, E was sitting there and staring at me blankly.</p><p>When I told him what happened , he was in a kind of shock because he had told me before that he hadn't ever had any hallucinations before so he was kinda jealous. It was a great experience, but I can't say anything about whether it is good or bad to use marijuana as I'm new. I just can say that it's fun!</p>"
}
