{
 "title": "I Am Everything That You Can Imagine",
 "author": "Thrip",
 "citation": "   Thrip. \"I Am Everything That You Can Imagine: experience with 2C-B & DMT (ID 69023)\". Erowid.org. Sep 26, 2008. erowid.org/exp/69023",
 "substance": "2C-B & DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "rectal",
   "2C-B",
   "  T+ 5:00",
   "1 hit",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 69023",
   "Male",
   " ",
   "Not Given",
   "Sep 26, 2008",
   "Views: 5445",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I decided to try 2c-b rectally. The Burn from snorting it is so bad that it often starts my trips out in a bad mood. I mixed 20mg 2c-b with 2ml of water and put it up my butt with a syringe. It burned a little but not any worse than the day after  eating habenero peppers. I layed on my stomach for 15 minutes.</p><p>T 0:15</p><p>I can taste the 2c-b in my mouth. Something i noticed when i muscled it too. the burning is gone and i can feel a slight tingling in my fingers.</p><p>T 0:20</p><p>I'm starting to feel the nausea it feels the same as snorting, eating or muscling it. The duration of the nausea seems to last 20 minutes any way i put it in my body. I give my friend 20mg to snort. He started to feel the nausea in about 5 minutes compared to my 20.</p><p>T 0:45 </p><p>We sit around listening to James brown and wait out the nausea. when we feel okay we pack up some supplies (pot, carrot juice, water) and go to our rehearsal space. On the walk over the visuals start coming on. I see fractals more on 2c-b than anything else. which makes me wonder. Did i see fractals in books first or in trips first. It's one of those things i'll never know. </p><p>T 1:00</p><p>We arrive at the practice space and start setting up. We're having some great conversation. 2c-b helps me find the words i need and helps dissolve my social anxiety. I noticed this in past 2c-b trips, i think 2c-b is a great psychedelic for socializing. When we start playing I remember how 2c-b isn't the most creative drug. When i play guitar on acid, mdma, or mushrooms i amaze myself with  the vast amount of ideas i come up with that I've never thought of before. 2c-b however makes drumming much more fun, i can play drums like a madman on 2c-b. We roll a couple joints and take turns switching instruments.</p><p>T 3:30. </p><p>We start to come down and decide to walk home. </p><p>T 5:00</p><p>Im alone and almost ready to go to bed. I decide to smoke a some DMT to bring the night to a climax.  I'm propelled into hypersapce. This is one of the most vivid DMT trips i've evr had. The DMT said 'Listen to what i tell you even if it sounds cheasy' There was a quick flash like lightning and i say two people wearing purple and white body suits standing behind geometric shapes. Another flash and i was looking at oscilating colors that reminded me of stained glass. The dmt then said 'I am everything that you can imagine, try to prove me wrong.' began to think of every adjective i could and as i thought them the visuals changed to include them. Fuzzy, bright, grainy, smooth, etc. even some non-words that effected the visuals in ways i cant describe. The Dmt then told me not to be so hard on myself for not being as good as other people at certain things, my brain works differently than most people and i should learn to use that to my advantage.</p><p>t 5:30</p><p>I fall asleep fast and sleep like a baby. i wake up feeling refereshed and renewed.</p>"
}
