{
 "title": "Release - Come With Us...",
 "author": "senator",
 "citation": "   senator. \"Release - Come With Us...: experience with Salvia divinorum (5x extract) (ID 6903)\". Erowid.org. May 28, 2002. erowid.org/exp/6903",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6903",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 28, 2002",
   "Views: 6232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis was my first experience with Salvia Divinorum. I had been told about it by a friend and had read a lot about it on the internet. A friend who was travelling in Australia found some in an herb shop and sent me about a gram. He said that he had smoked it with some weed and had felt nothing.<br>Although I've tried most substances, illegal or otherwise, I was a little nervous about taking it as I really didn't know quite what to expect. I headed into it with a reverential attitude, knowing that the plant has been known to turn on the ignorant. I arranged for a friend to be my sitter, but really he was just in the room with me as he was busy playing video games. <br>I packed a bowl full in my regular weed pipe and sat down on the couch. I took a huge haul and held it in for as long as possible, exhaled, and took another smaller haul.<br>Immediately I felt something. A strange tingling sensation unlike anything I'd felt before. Somehow, the smell and taste of the smoke seemed oddly familiar, and not harsh at all (perhaps because I smoke weed daily). I felt really strange and had to lie down on the couch. As I was laying down I began to hear music in my head. I can't remember if I made it up or if it was a song I had heard before. At this point I closed my eyes and could see fractal type patterns dancing in sync with the music. They moved in a clockwise direction until they completely filled my field of vision.<br>During this, I could feel a distinct pulling sensation on the right side of my body, which would have been south. I sensed the presence of 3 beings as well, one male and two female. The male seemed the most dominant, and they were urging me to 'release' and 'come with us'. I couldn't hear them per se, but these words somehow came to me. They weren't frightening at all, but rather welcomed me into their world. They obviously wanted to show me something, but I was unable to 'release' due to being distracted; I could hear my friend tapping buttons while playing games (he had headphones on) and I could feel the couch pressing against me and was rather uncomfortable.<br>By this time, I realized that I wasn't going to be able to 'release' and I opened my eyes for the first time. I was a little overwhelmed and decided it was best not to move for a while. I closed my eyes again, but the visuals were waning and I was coming down. As soon as I felt comfortable, I opened my eyes and stood up. All this had lasted no more than 5 minutes, but wherever I had been, there was no time. By this point it felt like the comedown from shrooms, brain a little mushy, but everything pleasant. I felt an overwhelming need to step out into the sunshine and feel something 'real'.<br>One of my friends just happened to be coming up to my house, and we went inside and smoked some weed. This lengthened the comedown and I didn't feel sober for about another hour and a half. But even the next day I could feel something different. Hard to put my finger on, but different nonetheless. On the whole it was a positive experience. Salvia is truly like no other drug I've tried. I look forward to being able to 'release'. And I know there is much that can be learned from this plant.\n\n\n"
}
