{
 "title": "Poor Man's Paan Masala Preparation",
 "author": "tropein",
 "citation": "Citation:   tropein. \"Poor Man's Paan Masala Preparation: experience with Betel Nut & Various (ID 69096)\". Erowid.org. Mar 9, 2009. erowid.org/exp/69096",
 "substance": "Betel Nut & Various",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Betel Nut",
   " ",
   "  ",
   "buccal",
   "Various"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69096",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2009",
   "Views: 8045",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was traveling in India and Nepal about a year ago, and brought back a small bag of whole betel nuts that my sitar teacher in Banares got for me.  I had chewed 'bitter paan' or Paan Masala, I think, a few times with my friends I had made in India.  There's a few kinds of Paan (betel nut preparations) in India: Sweet Paan was used as a digestif in desserts and what not, some other sort, and bitter paan, masala.  \r\nThe basic preps that I saw of bitter paan were basically lime paste, 1-2 green cardamom pods, a few cumin seeds, something that looked like modified orange marmalade, a small amount of tobacco, of course a few little chunks of crushed betel nut, all wrapped up into a little quid using a fresh betel leaf.  There were of course variations on this mixture, as everyone has their own preference in such things, right?\r\nI took a single betel nut, wrapped it up in a piece of paper and shattered it with a hammer, then more or less powdered it in my coffee grinder.  The resulting rust colored powder was put into a shot glass along with the following:\r\n1/3 tsp baking soda\r\n1 1/2 tsp orange marmalade\r\ncontents of 6 peeled green cardamom pods\r\ntwo pinches cumin seeds\r\na dash of black pepper\r\nThis concoction was then stirred thoroughly, and about 1/6 of it was wadded up in some tea bag paper.  I have been sucking on it for about 15 minutes now, have spit bloody red-colored stuff a couple of times now (don't want to swallow this crap!) and am feeling a nice little buzz similar to caffeine, but a little more stupifying ;-)\r\nI think I'll walk somewhere to get food now, dunno about driving.\n\n\n"
}