{
 "title": "Steps on the Path to Hell",
 "author": "Hallucine",
 "citation": "Citation:   Hallucine. \"Steps on the Path to Hell: experience with Methamphetamine (ID 69105)\". Erowid.org. Nov 5, 2011. erowid.org/exp/69105",
 "substance": "Methamphetamine",
 "bodyweight": "123 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "IV",
   "Methamphetamine",
   "  T+ 19:00",
   "  ",
   "IV",
   "Methamphetamine",
   "  T+ 0:00",
   "  repeated",
   "IV",
   "Methamphetamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 69105",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2011",
   "Views: 6945",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nTuesday, March 3 5:58 AM\r\nHow long can a human body survive without food, and very little water? It has been three days for me. Maybe that's why I smell like I'm rotting from the inside-out? Since Saturday, been living like a weird, smelly, burnt-out, pimply, awkward, creepy addict loser, holing up alone in my house, wandering town only when I must. Soulless, zombie like. I became the walking dead.\r\nIT BEGINS\r\nSunday. At 6am, 10 units IV. Stayed in my bedroom, managed to have a 4 hour nap, was driven out of town, arrived to destination at 11pm. I picked at my face in the bathroom for an hour, showered, shot another 5 units 1am Monday. Felt immediately refreshed! More energized, but no euphoria. I felt... back to normal.\r\nMonday. I shoot about 2 points total. Spent the day in bed, writing about nothing, making sure windows were opaque, avoiding all phone calls. I tweezed my brows, went through my things over and over, obsessively handled my drugs, missed shots, I was very anti-social and strange. Today I spent 6 hours picking my face.\r\nTuesday. I walked to the Medical Clinic today, for the utter discomfort/pain I was going through, and I also had a horrible cough. I felt like a leper when the Dr. reacted to my answers. I almost cried while getting tested. (For all vitals, levels, tox report, ECG, blood, urine, all STD's, + blood borne viruses, etc.) The nurse painfully dug in my arm a lot before filling 10 vials. Hated the feeling of someone else's inexperienced hands controlling a needle in my arm. The whole experience was a vividly dysphoric mind-fuck. Decided to shoot a bit more because I was starting to feel horrid. Thought I overheard, 'She's shooting up in the bathroom!' A stranger offered me a ride home and there I, unexpectedly, fell asleep. Woke 90 mins later, alert, heart racing, fiending. Extreme dizziness upon rising. I white out for a few seconds, and return. Since I am out of drugs, I eat. Throughout the day, I had IV'd approx 3.5 points.\r\nFollowing are a summary of effects.\r\nMOUTH\r\n- a gross, plaque-y layer of gunk permanently stuck on my teeth no matter what I do.\r\n- tongue has lots of varying sores\r\n- yellower teeth with new white stains, visibly receded gumline\r\n- earlier, my jaw hurt, and I compulsively tongued my teeth.\r\n- weird, chemical taste\r\nSKIN\r\n- sweat + oil + speed bumps + already clogged pores = fucking hideous, infected, scabby, scarred acne sprouting within a few days.\r\n-has a translucent quality\r\n- greasy/sweaty odor always present.\r\n- i require two thick layers of makeup to barely look normal.\r\nWEIGHT\r\nSunday - 129\r\nToday - 122\r\nBODY \r\n- so sore and the worst hasn't yet begun. Feeling very achy and cold.\r\n- dizzy spells. sharply decreased strength\r\n- chest and head pains\r\n- blue, pale skin and bright, peeling red lips.\r\n- lots of intestinal gas.\r\n- sharp surges of ear pain\r\n- a permanent red patch of a swollen, bruised, practically non-functioning injection site in my arm\r\n- tingly, numb extremities\r\n- haven't had a shit in 2-3 days\r\nMIND\r\n- I don't really think, my brain feels as if it is on autopilot. Mixing up words and making silly mistakes. Extreme paranoia from the claustrophobia of living in a small town where no one is anonymous.\r\nPERCEPTION\r\n- I overhear/hallucinate? multiple conversations both about me (how I smell, look, and some gossip) and the drug methamphetamine. I hallucinate music, and whispers of my name.\r\n- Vision is blurred, wavy. A bit like acid, with 'lights floating on a different frequency'.\r\n- Things appear to dart across floors.\r\nI hope my children never experience anything even remotely related with this poison. It is an extreme waste of health, sanity and time.\n\n\n"
}