{
 "title": "The Droplet Epitome",
 "author": "The Enlightened",
 "citation": "   The Enlightened. \"The Droplet Epitome: experience with Cannabis (ID 69175)\". Erowid.org. Apr 25, 2012. erowid.org/exp/69175",
 "substance": "Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 69175",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 25, 2012",
   "Views: 1480",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a report of my first time smoking alone on a school night. I haven't experimented with many drugs before, just weed and pharms, having had a very good time doing them on all occasions.</p><p>8:00-I sneak downstairs to avoid the watchful eye of my parents and begin to pack a bowl with some good quality weed that has brought me some very good times in the past. After I've finished I watch some T.V. and wait until my parents go to sleep.</p><p>11:00-My parents have finally gone to sleep and I hurry downstairs to grab my homemade bong. I sneak out the back door, onto my porch, and into my backyard, but it is extremely windy outside, so I decide to return onto my screened-in porch.</p><p>11:05-I finish smoking and return to my house. I notice that the wind outside seems more harsh and it freaks me out a little. Inside, I notice haloish affects around lights and my hearing is dulled.</p><p>11:45-After watching some flash videos, very hilarious, I decide to go and take a shower to remove the smell and so that I wont have to do it in the morning.</p><p>11:55-The warm shower water makes my skin feel incredibly tingly and I feel very relaxed. While standing there, I have an epitome. I realize that this shower water is composed of thousands of little droplets, just like people in a society, and that these droplets are separated and become individuals when they are shot out of the shower head, just like being born. I also realize that their existence is short, just as ours is, and that they all rejoin each other at the drain, just as we all end up in the same position: dead.</p><p>12:10-I finish my shower and go to bed. I quickly fall asleep and dream of myself traveling through the world as a droplet of water.</p><p>I wake up the next morning, still remembering my experience. I feel as if I must try harder to make my existence worthwhile because I know that my time on this earth is short and if I don't do anything about it, I'll end up in that drain having wasted my time.</p>"
}
