{
 "title": "Mind Game",
 "author": "Brian",
 "citation": "   Brian. \"Mind Game: experience with LSD (ID 692)\". Erowid.org. Oct 9, 2000. erowid.org/exp/692",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 692",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Oct 9, 2000",
   "Views: 7273",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA couple of months ago 2 of my friends and myself decided that we wanted to take some acid over christmas break. I have used acid before in higher doses than the one we decided to take, so I was not worried or anything like that. We dropped the acid at about 10:00 P.M. at night. Within 20 min the acid was definately kicking in for me and my one friend (we'll call him N). We were all well aware that set and setting are essential when it comes to tripping so we all agreed that we felt comforatable at N's house. Within an 1 hour my visuals started to become clearer to me. It was a great trip for the first 2 hours. Naturally everything was moving. The walls were breathing , and the ground looked like a huge tidal wave that would always rise higher and higher but right before it would hit me it would shrink down to nothing. </p><p>A million thoughts raced through my head throughout the whole trip. I remember just wanting the trip to get more intense every second. My friends and I thought that there was no better way to do that than to smoke some dank weed. And to our luck we had just purchased 30 dollars a gram weed. We decided to smoke it out of the basement window. By this time i was totally out of it , but that didn't stop us from chiefing up. The bowl eventually made its way over to me. I remember taking a huge hit and as i went to blow the smoke out the window i lost my balance (because i was tripping so hard) and knocked one of the alarm bars off of my friends window. During that split second I remember getting the most paranoid and fearful feeling in my entire life. My one friend (we'll call him J) reacted quick to the situation and told N about what happened. At this time N went upstairs to turn the alarm off. But he thought it would be funny to say that the cops were on their way. When I think about this now, I realize that he didn't understand YOU DON'T MESS WITH PEOPLES MINDS WHEN THEY ARE TRIPPING BALLS!!! </p><p>So anyways I was trying to clean up and my friend was saying 'Fuck it we're caught, lets just finish smoking this bowl.' At this time I completely lost it. I almost broke down right there. I saw my whole life end at that moment. The thought of getting caught with acid , and dank weed by the cops terrified me. I thought everything hit rock bottom. Instead of panicking, because in the back of my mind I thought in some weird way this was just part of the trip or something else related to the drug, i didn't scream or run or do anything. Instead I sat in the corner of the couch with the most emotionless faces I have ever conceived. By this time, the smarter of my 2 friends J had calmed me down and told me that it was a joke. After I realized that my visuals of the trip became even more intense. </p><p>I think that somehow I got so scared it made me flip out hardcore in my mind. The rest of the trip I really enjoyed but I still will never forget that feeling of fear, and I will always remember to trip with only people I trust 100% and who know how to handle themselves with hallucinogens....</p>"
}
