{
 "title": "Mindful Inebriation",
 "author": "Poet",
 "citation": "   Poet. \"Mindful Inebriation: experience with Blue Lotus & Alcohol (ID 69228)\". Erowid.org. Oct 17, 2009. erowid.org/exp/69228",
 "substance": "Blue Lotus & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "0.5 oz",
   "oral",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(extract)",
   " ",
   "0.5 joints/cigs",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69228",
   "Male",
   " ",
   "Not Given",
   "Oct 17, 2009",
   "10069",
   " "
  ]
 ],
 "report": "<p>Preparation:</p><p>After much research, my brother and I decided we would like to try Blue Lotus, so we purchased 1oz of dried plant material from an internet site.  We had tried an extract in tea before but felt subtle, if any effects.  So this time we steeped the whole ounce (save enough for a joint) in a sweet red wine with an alcohol content of 12%.  We had to drink a glass or so of wine before we filled the bottle with Lotus in order to compensate for displacement.  We let the wine/lotus mixture steep for 7 days, shaking it occasionally.</p><p>After the 7 days, we re-uncorked the bottle and filtered the drink through a coffee filter, which we placed inside a strainer and allowed the liquid to seep slowly through the filter into a bowl with a pour spout.  The liquid was draining extremely slowly through the filter, so I took this time to roll a joint out of the plant material while my brother watched the pot boil, so to speak.  Eventually, we both got impatient and poked holes in the filter with a knife, and consequently some plant material got throughbut not much.  I also broke the wine bottle with a hammer in order to get the plant material out of the bottle, because the dry material soaks up a good bit of liquid.  We squeezed the liquid from it, as I think it is the most potent stuff.    </p><p>Experience:</p><p>We drank the mixture as fast as we possibly could, because we had heard that it is really bitter, but, much to our delight, it wasnt bad at all.  Immediately, I sparked a joint, and we sat back at the kitchen and enjoyed the quietness of the morning and the steady hum of the refrigerator.  The joint ran pretty bad; probably because the plant material is so fluffy and light, but it brought on a subtle feeling of inebriation, nonetheless.</p><p>Within 10 minutes the effect of the mixture was already hitting.  My brother and I were talking about religion and spirituality in an almost seamless conversation, that is, where I would leave off he would pick up.  At one point, we both stopped talking to comment on the effect of the drug.  We both agreed that there was no mistaking the high, which seemed to us very similar to the affects of a good absinthe.  We continued to talk for some time, say, an hour, but timealthough there was no time-loss like there is on LSDhardly seemed to matter.  The peak came after about 30 minutes.  At this point, my vision became clearer or wider, but this only made it more difficult to focus on any one thing.  The body high, for me, was limited to my face.  This is not to say I could not function on Blue Lotus.  I could function splendidly, but I wouldnt try driving.  </p><p>After about an hour and a half we were near baseline and becoming quite sleepy.  We chatted for a little longer before we went to our separate rooms and took a nap.  I woke up two hours later with a heavy headache, which I sometimes get from too much sweet wine, and my brother woke up shortly after me with no side-affects to speak of.  Overall, we had a pleasant mindful inebriation and will certainly try Blue Lotus again.</p>"
}
