{
 "title": "Uncontrollable Shaking, Paranoia",
 "author": "Zealot",
 "citation": "   Zealot. \"Uncontrollable Shaking, Paranoia: experience with Pregabalin (Lyrica) (ID 69221)\". Erowid.org. Apr 30, 2010. erowid.org/exp/69221",
 "substance": "Pregabalin (Lyrica)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Pregabalin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "69221",
   "Female",
   " ",
   "Not Given",
   "Apr 30, 2010",
   "Views: 12860",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began taking Lyrica for fibromyalgia, which is the main syndrome it is prescribed for. Over the course about a year, I have tried many different pharmaceuticals to try to treat fibromyalgia which causes wide-spread pain and insomnia (none of them working).  I thought Lyrica would be like the others, but I was wrong.</p><p>I was prescribed 50mg twice daily. Although, Im only 110lbs, I do tend to have a high tolerance for many analgesics.  Originally, I never took more than the recommended dose.  After a couple of days of taking it as recommended, I began to shake uncontrollably every day.  I became very paranoid and anxious, and the uncontrollable shaking made the paranoia worse.  However, I kept taking it because it supposedly takes about 3 months start working for fibromyalgia pain and other FMS symptoms (similar to other treatment for FMS).</p><p>Being unable to pour a glass of water gracefully due to the constant shuddering, it seemed like a good idea to stop taking it; however, stopping it suddenly made the side effects worse and made me have withdrawal-like symptoms (headaches and general feeling-like-shit).  I felt a horrible anxiety that I may have a seizure (which may have been the paranoia).  Also, I was having heart palpitations on and off.</p><p>Since then, Ive dabbled in using it recreational (which didnt work for me).  Ive never taken more than 75mg at once. But, when I have taken that much I didnt even feel the normal pain-killer high (or any high) from taking it, yet I felt really bad, paranoid and shakylike I took really shitty and weak speed, but with no positive feeling. Overall, this was a shitty drug to experiment with. I wouldnt recommend it, but then again its possible I just had a bad experience, and Ive never experimented much with it. Ive never snorted it but frankly I'd be scared to.</p>"
}
