{
 "title": "The True Nature of Humanity",
 "author": "Fractalbeat",
 "citation": "   Fractalbeat. \"The True Nature of Humanity: experience with LSD (ID 69278)\". Erowid.org. Aug 10, 2009. erowid.org/exp/69278",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2002",
   "69278",
   "Male",
   " ",
   "Not Given",
   "Aug 10, 2009",
   "3162",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The setting was a very large psytrance festival in Europe. Nearly 30,000 brave souls had gathered for 5 days in a beautiful setting on the shores of a lake. The festival featured a huge psychedelic temple, fire dancers from four continents, amazing multi-story light shows and art instillations, lazers that bounced off the clouds, and a troupe of stilt walkers with extremely intricate costumes who I made friends with the very first night. For four days and nights I had been partying hard. In the previous 48 hours I had consumed mushrooms, LSD, peyote, MDMA, MDA, 2CI, 2Cb, 2CT7, 5-meo-DMT, and Ayahuasca (the Ayahuasca wasn't that strong, everything else was stronger than I had ever had). </p><p>For the final night of the party I had decided to eat a ten strip of Albert Hofmann blotter that I had been saving. I remember dancing. I remember the lights. The sound of fire spinning around. The smell of the earth itself as thousands stomped the ground, raising a cloud of dust. At some point (I think it was around midnight) I asked a guy on the dance floor next to me if I could have a drink out of his water bottle. He told me to help myself, that it was in his bag that was sitting under the speaker next to us. I found it and took a very long hard swig, planning on refilling it for him at one of the water spigots that were set up. Just as I was about to finish chugging his water, he ran up and grabbed my arm, asking me 'does that water bottle have a black line drawn on it'? I looked at it and told him it did. This is when he began a low maniacal laugh that I will remember for the rest of my life. I asked with some trepidation what was in the bottle. His answer: 'Man, I hope you like LSD and speed!'</p><p>This in itself would have been fine, but the 10 strip was just kicking in, and I knew I was in for a bit of a ride. The next couple of hours were a bit of a blur. I remember trying to get a bottle of water at one of the bars and trying to jump over the bar. The guy running it was extremely patient with me. I think. Sometime later that evening I ended up sitting on a speaker box as the beat tore through me. BOOM BOOM BOOM BOOM at 138 beats a minute was rattling my soul. The world was an infinite latticework of energy, my consciousness a tiny node on a psychedelic shimmering net that stretched from alpha to omega. Time and space itself were my playthings. I could look at some person dancing on the other side of the dance floor and with the mere will for it to be, I could see into their souls. It was too much to keep my eyes open, so I lowered my head into my lap and began to watch the light show inside.</p><p>It was at this point that my stilt walker friends must have seen me, sitting on a speaker with my head in my lap, rocking gently back and forth, and known EXACTLY what was going on. The came up to me and formed a semi-circle around me. With stilts on their hands and feet. In gorilla costumes. With grunting speaker boxes hidden on their chests.</p><p>I opened my eyes and looked up. Directly in front of me were a half a dozen gorillas grunting with great apparent concern for my wellbeing. Behind them were thousands of people dancing under a huge psychedelic temple to pounding music. One of these two things could not be happening. I had to make a choice.</p><p>After a few seconds my gestalt shifted. My world view changed. Finally, I realized what was going on. Clearly I was on drugs. I must have eaten something funny. My pack was concerned for me. Oh, did I mention that I must be a tripping gorilla who had hallucinated the entire human race? I got down of the speaker box and left the dance floor. I climbed the hill behind the temple to have a better vantage point, and for at least the next couple of hours I sat their, watching the dance floor pulsing, marveling at the ability of my ape brain to create such a complex hallucination as mankind. It wasn't until just before sunrise that my peak subsided, and I realized what had been going on. It was, to this day, the most intense trip and comedown I have ever experienced. I wouldn't trade it for the world.</p>"
}
