{
 "title": "Interesting Effects on Sleep and Dreaming",
 "author": "Swami",
 "citation": "   Swami. \"Interesting Effects on Sleep and Dreaming: experience with Melatonin (ID 69353)\". Erowid.org. Jun 15, 2008. erowid.org/exp/69353",
 "substance": "Melatonin",
 "bodyweight": "131 lb",
 "header": [
  [
   "DOSE:",
   "9.0 mg",
   "oral",
   "Melatonin",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Alcohol",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69353",
   "Male",
   " ",
   "Not Given",
   "Jun 15, 2008",
   "44126",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My previous experience with psychoactive substances was mostly in the realm of hallucinogens.  Under my 24-year-old belt were: </p><p>-Caffeine (chronically, since age 8)</p><p>-Alcohol (hundreds of times...moreso recently than before)</p><p>-Marijuana (severe addiction to the stuff for a couple years...have since kicked it completely)</p><p>-Psilocybin mushrooms (about a dozen times...I now only use it once a year at the same time and place for spiritual purposes)</p><p>-Damiana (as a pot alternative, nice taste, no psychoactive effects noticeable, no longer use it)</p><p>-MDMA (once, last year, outdoor festival, 4 tabs, brilliant time)</p><p>-Salvia divinorum (a dozen times or so...rather nuts)</p><p>-Tobacco (smoked about the equivalent of 2 whole cigarettes in my life...hate them, can't see the point)</p><p>My decision to experiment with melatonin came on a whim last night after visiting my family.  My sister is severely autistic and as such, she takes a cocktail of prescription drugs before bedtime to help her get to sleep.  These drugs are melatonin, novo-clonodine, and risperidone.  After my sister had taken her meds, the rest of us got into a discussion about what she was taking.  My mom explained what the desired effect of each one was on my sister, and melatonin got my attention.  I had heard of the drug before, but was unsure what it was used for.  It's primarily a sleep aid.  Curious, I pocketed 7 of the 3mg pills and eventually went back to my apartment to do the appropriate reading on the substance.  </p><p>I spent about an hour reading everything I could on melatonin.  Dosage, possible side-effects, combination reports with alcohol (since I had various alcoholic beverages throughout the day, ending it with a glass of Wiser's Very Old rye on the rocks.  My sister takes only one of these 3mg capsules, so I figured I'd exceed that by a few times.  </p><p>As it turns out, melatonin has been hyped somewhat as enhancing the clarity and intensity of dreams.  This intrigued me because I typically have very vivid and realistic dreams in the first place.  Could melatonin somehow make them more realistic still?  Furthermore, if I had the good fortune to recognize such a dream and allow it to become a lucid one, would it be that much better with the help of melatonin?  </p><p>I decided on taking three of the 3mg capsules, for a total of 9mg of melatonin.  This seemed reasonable.  Shulgin had experimented with up to 10mg, and several scientific journals indicated that this is an above average dose, but was far from detrimental.  So, after reading for about an hour about melatonin, I turned off the lights (actually, I had done this earlier when I came upon that bit of information), brewed some peppermint tea, and ingested 6mg of the drug.  Within a minute or two I decided to up this to 9mg, so I had another capsule.  I wasn't expecting much to happen while I was awake, so I brushed my teeth, made my bed comfortable, fed my cat, and went to bed.  It was 11:20pm.  About 20 minutes had passed since I took the capsules.  </p><p>An interesting effect manifested itself as I was drifting off to sleep.  I would drift in and out of sleep fairly rapidly about 3 or 4 times before actually dozing off.  It felt similar to falling asleep on the bus or in a car, only for a few seconds, and then being jolted out of that sleep by a bump in the road or a sudden stop.  No outside stimulus was causing this.  My cat was elsewhere, the night was still, and my apartment is damned quiet.  So, being jolted out of the start of my sleep a couple times seemed out of place.  It was enjoyable in the sense that I do not regularly do this so I was content that melatonin was having some effect.  At least, I can only assume it was the melatonin kicking in.</p><p>My sleep itself was characterized by dreams.  Not particularly vivid ones...at least no more than usual.  I can recall that one of the dreams was slightly frightening, but nothing that I'd consider nightmarish.  Others were neutral in enjoyment.  I can, at this point, only remember the very final one I had, which was short and involved me calling my girlfriend from work to tell her the day's total sales.  This actually happens a lot in reality since we work at the same place.</p><p>What was most interesting about melatonin's effects on my sleep was the fact that I sporadically woke up throughout the night, unprompted by anything external going on.  Maybe once every two hours or so, I would just wake up for no apparent reason.  It was easy enough to get back to sleep, but I do not normally wake up throughout the night, unless my cat jumps on my face or something like that.  This is hard to explain, seeing as melatonin is considered a sleep aid.  So, come morning I did feel well-rested, despite the various wake-ups throughout the night.  No more or less well-rested than any normal morning.  So....I suppose my results are largely inconclusive.  </p><p>At 9mg, I had several average-clarity dreams, most of which I cannot recall in any detail the morning after.  I experienced a pattern of sleep-wake state a few times before finally getting to SLEEP, and that pattern was continued throughout the night, but in longer intervals.</p>"
}
