{
 "title": "A Persian Rug for the Gods",
 "author": "Drew Carlson",
 "citation": "   Drew Carlson. \"A Persian Rug for the Gods: experience with Salvia Divinorum 21x, Marijuana (ID 69460)\". Erowid.org. Jun 16, 2012. erowid.org/exp/69460",
 "substance": "Salvia Divinorum 21x, Marijuana",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cannabis",
   " ",
   " ",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 69460",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2012",
   "Views: 1861",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was around 2:30 am and there was already plenty of THC in my system. Salvia, a godess i've tangled with once before, just so happened to be in my presence. Just as any good patron of psychedic matter would do, I lit it on fire and inhaled the fumes. Roughly thirty seconds or so had gone by and I could feel myself slipping, I thought it would be best to sit down. Being watched by my girlfriend and having some previous experience I didn't immediately feel in great danger. It was only when my body unfureld itself across every plane of space and time, and dug itself into every peak and crevase in all sorts of realities. The amount of terror I felt was unimaginable, I was a smaller me, trapped on a persain rug made from my body, streched across the universe and more as if fit for a god. At that moment I knew I needed to reatach myself to my body and fold myself back up into exsistence or else I would be lost forever. Persecuting laughter and akward stares whirled around my head like some kind of audible only monster. Truthfully thinking I was trapped in a realm of discontempt and pure fear I tried to climb over myself, wich I found to be comprised of textureless layers blended together in feeling but differentiated by colors I previously thought unimaginable. I had to physically put my mind back together before the void of nonexsistence swallowed me whole. Gripping onto what I thought was the last crutch of reallity known to man (but in all actuallity was a couch) I steadily forgot who I was, where I was trying to get to, and why I was so afraid. Just let me fall, I supossedly said aloud. A weight of monumental proportions gradually increased on my chest. The only way to remove it, it seemed, was to vailidate my exsistence and return to the world previouly forgotten. I'm Drew Carlson, was all it took to launch myself back into my body which simultaneously was being rolled and folded back up by shapless beings with faint voices and vauge opinions. I swear I could have stayed there, they wanted me too and I knew it. My eyes (wich were apparently open the entire time) seemed to open again and I was greeted back into this plane of exsistence with a tantalizing spectical of kalidascope patterns and uncontrollable laughter, wich was generated by my relif of being conscious and remeberence of that first hit (wich seemed like a lifetime ago). Reawakened with a different perspective I immediately wanted to record my adventure.\n\n\n"
}
