{
 "title": "A Very Long Day",
 "author": "Connor",
 "citation": "   Connor. \"A Very Long Day: experience with LSD & Cannabis (ID 69470)\". Erowid.org. Dec 23, 2008. erowid.org/exp/69470",
 "substance": "LSD & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:45",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69470",
   "Male",
   " ",
   "Not Given",
   "Dec 23, 2008",
   "3590",
   " "
  ]
 ],
 "report": "<p>I have taken LSD a total of 5 times in my life. I took my first tab of LSD in September of 2007. Out of those 5 times I have really only tripped 3 because two times I got ripped off with weak/fake/bullshit blotter. The fifth time I took LSD was on February 25, 2008. This was my experience.</p><p>My friends and I had been looking for LSD in our area ever since our last trip together in December 2007. When we heard about a whole sheet (10 ten-strips, ie 100 tabs of LSD) that had come through, we were all over it. We bought a ten-strip for $100. The pricing was a little higher than usual for a strip, but since our area was unusually dry, we jumped on the opportunity. I was going to take two tabs of it before the Dark Star Orchestra concert that was coming through that night. I received the two tabs in tinfoil at school that day (Monday) and couldn't help but drop them right there in the bathroom stall. I hadn't tripped in two months, so I was incredibly anxious - my first mistake.</p><p>7:15am - Time of consumption. I tossed my head back and put the two tabs onto my tongue. I begin to suck on them and knead them between my teeth. After about 3 minutes, I swallowed them and drank some water from a water fountain.</p><p>7:20am - First period starts. I started to tell I was tripping at 7:40am - just 25 minutes after I dropped them. I usually don't feel it until about 45 - 60 minutes after consumption.</p><p>At about 7:50am, I was feeling uncomfortable. I knew I was starting to trip, but I started to feel slightly nauseous as well. I was starting to experience extreme visual trailing. Everything was trailing, more so than I have ever experienced.</p><p>7:55am - I began to think I wouldn't be able to handle the rest of the day at school. I tried for about 5 minutes to write a pass to go to the nurse, but I couldn't think or write clear enough. I started to get more and more intense visuals. The green and black blotches that I see on people's skin when I'm tripping are starting to show themselves, and they become extremely evident by now. I was about to experience the most intense visual trip I have ever had.</p><p>8:00am - I got a pass signed by my first period teacher to go the clinic to call my mom to come get me. I wasn't freaking out, but I felt that if I had stayed at school, I might have.</p><p>8:05am - I arrived at the clinic and told the nurse I was feeling nauseous, I might throw up, even though by this point I really didn't feel like I was, and I need to get my mom to take me home. I have a seat, and she tries to call my mom.</p><p>8:10am - My mom hasn't answered the nurse's calls. I figured it was because she doesn't answer for numbers she doesn't know sometimes. So I tried to convince the nurse to let me use my cell phone to call my mom because she would know it was me and answer. No. Didn't let me do that. All I wanted to do was talk to my mom to reassure myself that she would come get me, but when I realized I couldn't talk to her and she wasn't coming as of this point, I started to get pissed, slightly scared, and annoyed.</p><p>8:15am - The nurse said I couldn't stay and needed to go back to class. The bell for third period rang (block scheduling, so it's the second period of the day technically). I left the clinic and set off to find my third period - Latin III.</p><p>8:18am - I tried to find some of my friends in the hallways and tell them I was in a semi-bad way. I wasn't having a bad trip by any means at this point; it was just extremely discomforting and unusual - yet so intense and interesting.</p><p>8:20am - I experienced the most intense hallucination I have ever had. I was walking down the main hallway when I realized everyone was walking and talking like they were being sped up. It seems like an exaggeration, but I felt like I was watching an extreme time lapse of people walking to class. I couldn't understand a single thing anyone was saying. All I heard was the overwhelming voices of literally, backwards talking. It felt like I was standing in a river of rushing people and everyone was blurring passed me at incredible, unnatural speeds. I had always heard about people experiencing things such as this on LSD, but until this point I had never experienced something so unique/intense so I never fully understood or believed it until it happened.</p><p>8:24am - I finally found one of my friends who had paid for the ten-strip. I told him I took the two tabs before school and when I saw him I said, 'It's not good man! It's not good! I'm not having a bad trip, I just can't handle this here; it's too intense.' He reassures it will be ok. So after I see him I finally find my Latin class where I feel so awkward. Seeing these high-strung grade-grubbers while I was on acid was so unusual. They just looked weird and too different. The green and black blotching on people's skin was increasing enormously at this point.</p><p>8:25am - The bell for the start of third period rings. There is no teacher. A few minutes later, an extremely fat and black woman that talked like she had a mental disability walked in - our substitute. Everyone started chuckling, and as I would usually immaturely join in, I just looked at her. I thought, 'Wow, I can't even laugh - this is just too unusual to take as a joke - the one day I come in trippin, my teacher isn't there and there is an extremely comical figure before me. I can't handle anymore.'</p><p>8:28am - I looked around as everyone started working on our busy work assignment to do all class with each other. I just put my backpack on and walked out of the class without saying a word to the substitute. I told a few friends in the class that I was just sick and wanted to go home. They had no idea I was on LSD until the next day.</p><p>8:30am - I'm walking around the empty halls by myself. By this point, I believe my extremely long peak was starting. I was walking down the main hall as the walls, as they usually did for me on acid, were breathing profusely. I had no idea where the fuck to go.</p><p>8:34am - I wandered back to the clinic to see if my mom had called back. The nurse was being a total bitch and said, 'I told you to go back to class! We'll come get you if your mom calls back!' Fuck her. I just left and tried to find a place that my cell phone got reception in. I went to a secondary stairwell where I attempted to call my mom. It took me 3 minutes to dial the right numbers because the visuals were so overwhelming I couldn't see what I was dialing. I couldn't get a strong enough signal to continue the call, so as the phone is too my ear, a teacher comes up the stairs and looks at me weird. 'Is that a cell phone?' she asks. 'Oh yes,' being pathetic, 'but see I'm just calling my mommy!!!' I show her the phone to show that it says 'Calling Mom..' But she's like you still have to put it away. 'You're absolutely right. You know what you're right I'm sorry I'll go right back to class.' I turned around and ran down the stairs. I know I must have sounded like a schizo or a crackhead. It was just so unnerving because I was being restricted from talking to my mom.</p><p>8:40am - I found myself in the bathroom stall, not knowing what to do next. My visual hallucinations were increasing tremendously. My visuals by this point were very similar to the effect produced when heat is coming off of the road or a car. I kept tripping harder and harder as time went on. I remained in the stall for a few minutes, thinking of where to go. I go back to the clinic.</p><p>8:45am - Finally, the nurse says she'll try one more time to call my mom. She finally answers. I tell her I'm sick and want to come home. I started to feel reassured. I have to go back to class to get a pass signed from the third period substitute in order for me to stay in the clinic until my mom arrived.</p><p>8:50am - I went back to my third period where the substitute didn't even realize I came back, nor left in the first place. I told her I needed to go to the clinic. All I remember her doing is motioning her hand from her head outwards, and she said, 'Are you out? Are you leaving here? Are you GONE?' All I could think was that she meant I was leaving my mind or reality. Which I totally was, but how could she know? I realize what she said and let out a sigh of relief. She signs the pass and I go back to the clinic. The nurse looks at the pass and then the signature. The signature is literally just the capitals T.A.W. 'Did you even go back to class?' the nurse asks. 'Who's T.A.W.?' she asks accusingly as if I had forged it. 'WHAT THE HELL. YOU CAN SEND ONE OF THESE KIDS DOWN WITH ME I DON'T KNOW, SHE'S SOME FAT BLACK CHICK.' I blew up right in her face and she got scared. 'Well I just wanted to make sure she knew where you were.' Anyway, I laid down on the bed and listened to my iPod. My hands started to feel clammy and sweaty which lasted all day. I remember thinking, 'Wow, all these kids are here in the clinic because they are sick - I am here because I took LSD in school.'</p><p>9:10am - My mom arrives to come get me. I leave the school with the feeling of intense relief. On the drive home, however, I started to feel hot. I tell my mom, and then she turns on the A/C. I roll down the window where I find myself throwing up a small amount. I try my best to lean out the window as far as possible so as to not get the running boards dirty. My mom pulls over about a mile from our house while I finish. This actually worked out because it made it look like I really was leaving school because I was sick. It really wasn't that much, but right after I threw up, all of my unnerving feelings, uncomfortable feelings, and previous overall discomfort was totally gone. It was 9:30am and I began to have an amazing trip for the rest of the day. I believe the throwing up can be explained by my lack of breakfast or anything to eat that morning. However, I rarely have time for breakfast and that has never happened to me before.</p><p>9:30am - My mom dropped me off at the house while she left. I had the house to myself to trip in. I immediately laid down and watched TV for about 10 minutes. I felt like I wanted to sleep for a little bit because I was a little tired, but I never did. So after I realized I wouldn't be able to sleep, I listened to my favorite band, Radiohead. I listened to them all day.</p><p>~10:00am - I decided to smoke a little bit of pot to see what would happen. After raising one gravity bong, I took it without even knowing I took it - it just seemed like air, and there were no immediate noticeable differences in effects. What a waste, I thought.</p><p>After that I began to pay less and less attention to time because I was losing my sense of it. I was getting auditory and visual hallucinations until I went to sleep at 2am - a 17-hour trip. I had never tripped that long before. Although I don't know the exact dosing on these tabs, I believe it was extremely high because I took three tabs of different LSD before in December, and up until this time, it was the most intense trip I had - however, it wasn't extremely visual but extremely mental. I believe the acid I took in December was something called Purple Fluff, Pink Fluff, something like that? Something fluff. But this time I only dropped two tabs of this newly-bought LSD, and I was totally spun - way, way more than I had ever been.</p><p>Although I never stopped hallucinating during the 17-hour trip, the visuals came in big waves. I'd be sitting at my computer at about 8pm and just the text on the screen would start to move and float. But then, all of a sudden, the entire monitor would stretch and deform itself at extreme and dramatic rates. Then after about 4-10 minutes, I would return to the 'baseline trip' (not actually baseline). This similar effect continued pretty much the entire night until I went to sleep at 2am.</p><p>Throughout my trip, I tried to explain what I was experiencing to my friends who had never done it before - it was incredibly difficult. It is not only difficult to describe acid trips normally, but even harder to do while tripping. I would feel like what I said made sense, but then the person wouldn't understand and I would try to explain further and further until I had lost sense of what I was trying to say in the first place.</p><p>Throughout the comedown, which I deduced was from about 6-7pm to 2am, I experienced the effects (visuals) in waves. It was hard to tell when I was coming down because I'd be just getting out of a visual wave, and I'd think, 'Well, I took it at 7:15am - it should be wearing off by now.' But whenever I thought that, the effects would rush back and it felt like I was peaking all over again.</p><p>The next day, I felt amazing. I wasn't tired at all, just anxious to describe my experience to everyone. I felt out of it during the first part of the morning, getting slight visuals every so often. When I got home at 2pm, about 30 hours after consumption, I smoked some headies and was totally out of it. Then, I started to hallucinate again. The effects felt like they did at 3pm from the previous day (only about 8 hours after consumption). I was starting to trip again.</p><p>I did this throughout the day, smoking every 2-4 hours. This brought back the effects every time; however, they started to get less and less intense after each additional time I smoked trying to bring them back.</p><p>This was the most eye-opening experience of my life. I feel like I never even knew the full potential of LSD until now. Now where to get some more</p>"
}
