{
 "title": "The Living Dream",
 "author": "Worm",
 "citation": "   Worm. \"The Living Dream: experience with Belladonna (ID 69563)\". Erowid.org. Jul 13, 2008. erowid.org/exp/69563",
 "substance": "Belladonna",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "4.5 flowers",
   "oral",
   "Belladonna",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69563",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 13, 2008",
   "Views: 15808",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>(The Plan)</p><p>At approximately 7:30 pm I get a phone call from a friend (we'll call him GF) who told how he was curious to try belladonna and wondered if I would trip with him. So with my experimental personality I instantly agreed. We met up around 8 pm, acquired nine large sized flowers and recessed back to another friends house to boil it into the tea. Approximately one hour and three bong hits later the tea was ready for consumption. GF and I split 1 liters worth of tea in two and drank it on the spot. The tea oddly did not taste that bad, almost like an unsweetened green tea. Me, GF, and three other friends who were elected as our caretakers went to drop off GF's car at his house and planned to jump the fence into a park right across the street where are trip was to take place. At this point the initial affects began to surface, including a heightened sense of awareness and a disassociative feeling. </p><p>(The trip)</p><p>We then made our way over the fence and deep into the darkness of the park where I found a bench and sat down. This was my last memory of consciousness. Before I could give a second thought I found my self sitting on the ground of what seemed like the park and I was smoking a cigarette that just kept falling out of my hand or just float away. This little scenario kept repeating itself for most of my memory, until at one point I decided to take out my hair tie and let my hair down. As soon as my hairtie came off it fell to the ground and disappeared into a puff of smoke just as the 'cigarettes' did. At this point I had no idea that I was under the influence of belladonna.</p><p>Next thing I remember, I was walking toward one of the caretakers who was standing about 10 feet away from me with his hands raised. I was curious as to why he was standing in such a manner. But the closer I got to him the more he morphed into a tree. Soon after I found myself riding in a vehicle down a street and it was daytime and I remember looking at the houses fly by when I noticed a very deformed human being in one of the yards, so I screamed to the driver to stop because I wanted to know what was wrong with him. I made my way back to that house where I noticed him standing there as He was befor, I also noticed how badly deformed he was. He had disgusting, giant growths from the back of his neck all the way down to his ankles, and a VERY miserable look on his face, but when I made my way up to him he to turned into the tree that consumed my friend at the park. After this I found myself at my friend Jessies old house where she moved away from some time ago, yet there she was along with her grandfather who had passed away about a year ago. I remember that he spoke in the most horrifying, miserable voice and I couldn't bear to hear it.</p><p>(The next morning)</p><p>Finally, I woke up in my bed the next morning wondering how I got there and feeling that everything I had just witnessed was nothing more then a long vivid dream. I also realized that I was smoking a cigarette and that I dropped on my blanket, but when  went to fetch it, it was nowhere to be found, no smoke no burns, nothing. It was at this instant I remembered that I had drank belladonna tea that night, I then realized one of my friends (the one who turned into the tree) was in the room with me so we began having a conversation which lasted about an hour. My mother than walked into the room and asked me who I was talking to, it was then that I turned over, realized that she was the only person in the room and that I was still tripping. The imaginary cigarette phenomenon continued happening until I passed back out which was like a 20 min time frame.</p><p>(The Aftermath)</p><p>All in all, it was a very Different experience and iv never encountered any other drug that came within a mile of similarity. The only negative affects was the inability to read the entire next day, but thankfully that passed. Belladonna, by far the most intense drug I have experimented with, and I can't wait to try it again.</p>"
}
