{
 "title": "Everything to Expect From X",
 "author": "eXcellent23",
 "citation": "   eXcellent23. \"Everything to Expect From X: experience with Ecstasy (ID 696)\". Erowid.org. Oct 11, 2000. erowid.org/exp/696",
 "substance": "Ecstasy",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 696",
   "Male",
   " ",
   "Not Given",
   "Oct 11, 2000",
   "Views: 8280",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have been interested in E for many years, and finally reached the mindset to try it. I got two friends to come over who had done it before.</p><p>THE SETTING: My apartment, dark, some lights, pretty ones like Japanese laterns with colored bulbs, futura light, christmas lights, cold A/C on.</p><p>PREPARATIONS: I spread out velvet blanket on floor, got a seashell or brush or other textured object to rub with. Washed dishes, spilled about fifty drinks. Drank OJ it makes the E hit harder.Got pacifiers I wanted to chew up anything. Prepared soft pretty music or techno dance music. Cleared the floor of all stuff. Made sure I had next day(s) off from responsibility. Next day I was still half rolling. Everything is good idea, but still didn't want to do anything that is negative like go to work.Dropped at 10PM. Nothing hit til 12:30 except strange feeling of something going on inside, but that means its the best kind.Break tablet into powder, it'll hit harder & faster. </p><p>THE EXPERIENCE: T+3 to T+8 All soft things feel good, Dr.pepper tastes so good I refuse to believe its only soda. Must rub and move and squeeze own body and soft things. Hot bath is so good I could not speak, Cold water on head was angel annointing me. Music is divine and I bonded with it- use pretty stuff w/choir vocals, Talked about anything, no one was offended, wanted for everything to be well, violence and hate doesn't exist, me and my rolling kin are the only thing in the world.Happier than I've ever thought I could be. I bonded with rolling friends, objects have a message of love for you, you can speak to them, and they send you a message back sometimes.Others are evil, like am aztec skull decoration I saw. Not hallucinating but you feel like you can see heaven.  Literally you writhe in pure euphoric pleasure that is so wonderful I cannot begin to describe it. It lasts longer than it really does. </p><p>NEXT DAY: still feeling super, still rubbing things, talking, thoughts are simple and stress is gone. Sunlight on face is divine. Thinking changes. I'm more friendly, accepting, music is still super, I bonded with all the stuff we listened while rolling. No stress, thoughts like a child, why can't world be friendly? Can't watch violence, too hurtful.Couldn't stand being alone. That night I felt very sad, but still wanted to talk and have fun. Make sure you will be around friends for following two days. Don't drink on following two nights, it puts you somewhere between x come down and drunk, very strange and not good. </p><p>SECOND DAY: still feeling X at 1/8 power, sad, Can't stand being alone, still bonded to place and music and people of Roll, very much so worth it though. I'd be ok if I could just be around someone. Feeling sick like I have a cold, x reduces immune defense. final drop to reality a slap in the face. Take vitamins & 5-htp to reduce depression some, take prozac at PEAK + 6 to reduce depression and bad stuff happening to brain. I didn't do either of those. Very addicting mentally, like its the most worthy thing for me, worth time & money, job and priorites want to be pushed aside but I know I won't let that happen and its just a thought. </p><p>WHAT I LEARNED: Most important thing: X is priceless, wonderful, everyone should try it. We need to have less stress and craziness in our lives and world, and take time to enjoy music, and be more accepting of others. That feeling was tenfold while rolling, I expect it'll go away by T+4 days. I also expect to retain feeling of peace and gentleness, and slight acceptance of others, wish for nicer world, slightly more enjoyment of music. I feel really super friendly with people who have rolled or want to, I share a great bond with them automatically. Still kindof thinking about objects like they have hidden personality. I like that, it makes everything easier, hope it stays. Sad. Need company. It was totally worth everything.</p>"
}
