{
 "title": "A + A + A + A = 0",
 "author": "Psychedelic Magnate",
 "citation": "   Psychedelic Magnate. \"A + A + A + A = 0: experience with LSD, Amphetamines, Alcohol & Absinthe (ID 69602)\". Erowid.org. Feb 13, 2010. erowid.org/exp/69602",
 "substance": "LSD, Amphetamines, Alcohol & Absinthe",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:10",
   "  repeated",
   "smoked",
   "Cannabis",
   "(blotter / tab)",
   "  T+ 5:00",
   "20 mg",
   "oral",
   "Amphetamines",
   " ",
   "  T+ 7:30",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   "  T+ 8:00",
   "3 shots",
   "oral",
   "Absinthe",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 69602",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 13, 2010",
   "Views: 4079",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The combination that I tried on this day was a poor choice, but not for reasons you may think. The problem was that I had difficulty telling which effects were coming from which drug. </p><p>T-0: My friends and I each take two hits of high quality, 90microgram LSD hits.</p><p>T-10m: We smoke several bowls of marijuana to pass the time until come-up.</p><p>T-2h: At last, the acid has kicked in. This is the smallest dose of LSD Ive ever taken, so there are no hallucinations to speak of.</p><p>T-3h: I decide to go to rugby practice, knowing that because Im not tripping too hard, there will likely be no issues. Right as I get to the pitch, mild hallucinations begin, mainly due to cloud formations.</p><p>T-3.5h: This LSD, incidentally, is quite potent. Ive begun to grow very confused, but not to an uncomfortable degree.</p><p>T-5h: Knowing that there is a huge party tonight, my trip mates and I take 20mg of amphetamine salts each.</p><p>T-7.5h: In the past hour, my friends and I have begun to drink a very large amount of alcohol. LSD has always kept me from getting truly drunk, and I take advantage of this by drinking ~15 shots of tequila and ~5 beers. (Note: I DO NOT RECOMMEND drinking this much EVER, as it can have serious consequences.)</p><p>T-8h: Not outwardly drunk, my friends and I each take three large shots of Absinthe. After this point, I have a very detailed account of the evening, mostly because of the amphetamine salts but possibly also due to the Absinthe. I have no hallucinations whatsoever, but feel very good and free. Although it seems preposterous, from this point on is the LEAST weird Ive felt all day.</p><p>T-8h  T-14h: This period of time went on like a typical party. Plenty of drinking and merrymaking, but very little psychedelic activity. Im not sure what caused this to happen, but it most certainly did. Thanks to the large quantity of alcohol, Im able to fall asleep right away, something I usually cant do on LSD.</p><p>Epilogue: I felt incredible the next day, with no hangover but an appreciation for enjoyment. Although I wont do this combination ever again due to its non-psychoactive nature, I enjoyed it as a 'hard head' for a more infantile, basic high.</p>"
}
