{
 "title": "Kava Mmmmmm",
 "author": "mookie",
 "citation": "   mookie. \"Kava Mmmmmm: experience with Kava (ID 6963)\". Erowid.org. Jun 3, 2002. erowid.org/exp/6963",
 "substance": "Kava",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "0.25 cups",
   "oral",
   "Kava",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 6963",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 3, 2002",
   "Views: 30778",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nJust in case anyone was considering investing in some Kava and is looking for some opinions, here goes.  Don't go to the health food store. Its a rip off for low quality stuff (I've tried it). Its not cool to eat a whole bottle of pills to relax. Yesterday I recieved a 1/2 lb of 'awa' grade Kava from [a respected online vendor] and did the instant blender method with a little olive oil. First off this stuff doesn't taste nearly as bad as people say.  In fact it was pretty good in a earthy health drink type of way.  I think by compiling some recipes using coconut extract and things like that, and experimenting a little, some really good drinks could be made. Any way the flavor probably depends on the type of root...but the kind I got tasted good.</p><p>I drank down the concotion over about ten minutes.  I was impressed how numb it made my throat!  Reminded me of other things I used to do back in my day....mmmmm. (I thought people were exagerating about that part.) I read that this keeps people from over indulging...funny it may cause me to over indulge, becuase the numbness doesn't last too long and it feels cool.</p><p>The effects came on in about 30 minutes.  Mild euphoria and pretty strong muscle relaxation.  Almost as strong as a low dose of some perscription muscle relaxers.  As time went on it got more intense until I noticed some slight muscle incoordination.  Watching T.V. was nice.  I also noticed I was drowsy enough that I didn't even feel the need to smoke any special headache herb, if you know what I mean, though in the future I will.  I slept excellent, I might use this in place of my usuall melatonin for a change every once in a while.</p><p>All in all this is nice stuff.  A little pricey, so not too much bang for the buck, but enjoyable and most definitely very useful. I happen to be a pretty bad alcoholic.  I drank another big glass this morning, and it was just enough to get rid of some of that early morning beer craving that I so frequently give in to, which eventually leads to a ruined/wasted day. I really think this might help me kick the habit, not by being an every day substitute, just to get me through a time when I think im going to slip and have a drink (from nervousness, anxiety, and that irritable icky feeling that comes and goes), but i'm not a doctor, so thats not advice.</p><p>I'll definitly buy more, maybe a different variety, but same company. It's good to have around, especially at the end of late trippy nights. I think it would be great to drink a potent coconut full of this stuff on the beach at night and sit and listen to the waves.  This stuff is definitely not a placebo, and I do recommend it.  I just make sure I buy it from a reputable source.</p><p>Mookie</p>"
}
