{
 "title": "Life, Death, Art, and the Universe",
 "author": "Synesthesia",
 "citation": "   Synesthesia. \"Life, Death, Art, and the Universe: experience with Mushrooms (ID 6964)\". Erowid.org. May 31, 2002. erowid.org/exp/6964",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2.75 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6964",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 31, 2002",
   "Views: 17821",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nBackground:\r\nI used to take magic mushrooms for fun with friends once or twice a year when I was younger. I had a few 'bad trips' in those days, I didn't know the history of psychedelics, or understand the sacredness of these substances. The last time I'd taken a small amount of mushrooms was 2 years ago, and I cried through the entire trip.\r\nMy boyfriend had introduced me to DXM a couple months ago, and at 1st it blew my mind. I felt the spiritual possibilities of these 'alternate realities' at last. But it became something we did on weekends, for lack of anything better to do, a habit that did little more than gobble up precious hours of my life. Some kind of twisted logic or intuition (or denial?) in me decided that taking magic mushrooms this weekend would break me out of the rut!\r\nSetting:\r\nOur studio/condo in deep downtown (I would've preferred nature), Friday night.\r\nThe Trip:\r\n8:15pm - M and I split up a 1/4 ounce, putting aside a gram or so. I wanted to have a complete, deep experience, I had never taken more than a gram or so before. We chewed and swallowed the straight goods, and discussed our intent for the duration: healing and transformation.\r\nWe had a cigarette and discussed taking a quick walk. By the time we'd made up our minds, effects were apparent. The luxurious purring body buzz and slight visuals had begun as we walked out the door.\r\nI felt mischievously daring as we strolled past a security guard in the courtyard. As we walked by a lovely ivy-covered church, I was awe-struck by dusky clouds and stained glass windows. My voice rang in my ears briefly, and the atmosphere of our surroundings shifted abrubtly with each new sound or voice nearby. I wasn't overly alarmed, knowing this tendency of psychedelics. I allowed myself to focus on the natural beauty of the park we were entering, fairly successfully ignoring passerbys. I felt that if I stood still and stared at anything too long, I'd be swallowed up and crushed by the immensity of beauty. I feared the looming conspicuousness of falling on my knees before lilacs and blossoming trees.\r\nWe sat on a bench to have a smoke and comfortably stare at the trees. The lush leaves above were crystallizing into patterns, I could barely tear my eyes away. The joy rushing through my body was becoming too much to contain, and we agreed to head home. Walking back, the concrete was filling with mystical patterns.\r\nAs soon as we closed the door behind us, we were howling with laughter and 'Holy Shits!'\r\nThe next few hours are difficult to chronologically sequence. Part of the time was spent sitting at the table, more of the time lying in bed.\r\nAt the table, I was facing a 5' tall painting I'd done, and it completely came to life! Not only were beings appearing and endlessly moving and breathing within it, but 3-D prismatic patterns emanated all around it. It seemed to me that the only words I could enunciate were 'WOW', 'Oh my GOD', and 'Holy Shit!', but at times, I'd snap out of a period of 'daydreaming', ask M if I'd actually been speaking aloud - and the answer was always 'yes'! I realized that there was no distinction in this state, everything I thought I was just thinking, I was also saying, there was no separation! M was also speaking, though I only grasped fragments, which seeded into my own reveries.\r\nThe most unbelievable visions occured lying in bed, whether my eyes were open or closed. For the 1st while, an alien theme kept repeating. Aliens were questioning me, like reporters around a boardroom table, or attempting to examine me. I refused to be put into an inferior position, and felt that by laughing off some of their attempts, and casually humouring others, I retained a friendly equality. Eventually they went away. (As a child, I had re-occuring nightmares of everyone around me becoming aliens, they were always chasing me to make me one of them, and the only way I managed to make the nightmares stop was by giving in and becoming one of them. Is it possible my psyche has become strong enuf to stand alone?)\r\nAfter the aliens, mind-blowing artistic images appeared. I've been reading Alex Grey's 'The Mission of Art', and finally saw the grid-like nets of light that had inspired him and his wife during an acid trip. There were 3-D leathery black serpents woven like vines, colourful pen and ink etchings, and fantasy creatures reminiscent of Patrick Woodroffe's illustrations. Whenever I turned to look at M, I saw into his flesh, as if it was translucent and swimming with layers of underwater life. I began to nibble on his hands, and experiment with the feel and taste and strangeness. I made up words and laughed and laughed with my funny new language. I may have freaked him out a bit!\r\nThe intensity of this part of the trip was all encompassing. Several times I asked M, 'Who are we?', 'Where are we?', 'What are we?'. I struggled with the concept of others, and whether they ever came 'here', and why wouldn't everyone want to.\r\nThe 1st step down, after 3&1/2 hours of peaking, was an instantaneous knowing of Who, Where, and What. The effects were still very strong, and I began to want a break of normality. There were a couple more subtle yet instant 'drops', but each time I found I was still tripping pretty large. M appeared to be becoming paranoid about how he was coming across to me. We dealt with this uncomfortable phase for 1/2 an hour or so, then both seemed to reach a plateau of understanding.\r\nI was amazed at M's dish-sized pupils, and ran to the bathroom to see my own. I had always avoided looking in the mirror on psychedelics, since the 1st time, but now I was fascinated. I used to feel fear and revulsion seeing my face appear in stages of decay and unflattering mutations. But now, my massive pupils and glistening whites stared steadily back at me as I saw my flesh age, decay, rot, and repeat the cycle. This was deeply significant for me. I felt my fear of aging and death loosen its hold, lessening my attachment to this mortal possession, as I sensed that the divine energy/light within could never be extinguished, only transformed.\r\nA new view of life dawned on me. I've always been afraid that if I commit to one thing, I'll miss something else. Yet I realized I'll miss the truly important things if I don't surrender and commit to the paths my heart desires to follow. It's no longer so sad that I can only see and experience one version of my life, and that it feels so brief; it's eternal in the moments of true connection. I can only be the fragment of God/Universe that I am, no one else. Through commitment and caring, the deepest joys and sorrows and the truest aliveness can be accessed.\r\nWe lay in bed and embarked on the most incredible conversational, philosophical, healing journey. All our hang-ups, our relationship to each other and the world, the workings of the Universe, the nature of God, all of our questions seemed so much easier to process and communicate. \r\nI was surprised to notice how analytical, nearly scientific my outlook can be, and the unconscious nature of our belief systems. I realized how dogmatic I've been over certain issues, how blind I can be to my own nature! M's caring and beauty brought me to tears, and in a flash I saw the simplicity of unconditional devotion, and to me, it was the last straw of my fear of committing to him falling away, knowing a lifetime's choice was as simple as exhanging our soul-felt vows of devotion.\r\nThere were so many realizations I can't begin to write about them all. I mentally thanked the spirit of this truly magical mushroom for such a kindly-feeling space to objectively (?) and forgivingly view hang-ups, make intuitive leaps so effortlessly, and communicate nearly fearlessly. It took longer than we'd bargained for to fully come down, it was 6am before we were able to sleep, ~9&1/2 hours since take-off!\r\nPostscript:\r\nI've wondered if I'll retain the lessons I recieved during this unbelievably profound experience. So far, it's Sunday afternoon, 2 days since the trip, and my epiphanies still feel deeply embedded. I feel almost superstitious about going to that space again before I've seen if these understandings filter though in my day to day life, if I can be braver and truer to my intuition and life-path. I wouldn't treat this as something to get out of my mind on anymore, except in the most respectful sense! DXM has become quite unappealing by comparison!\n\n\n"
}
