{
 "title": "One Night of Hell",
 "author": "Trevor",
 "citation": "Citation:   Trevor. \"One Night of Hell: experience with Methylphenidate (Concerta) (ID 69654)\". Erowid.org. Nov 19, 2012. erowid.org/exp/69654",
 "substance": "Methylphenidate (Concerta)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "98 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 12:00",
   "98 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69654",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2012",
   "Views: 2473",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have been taking Concerta (Methylphenidate) for about two years now, taking 18mgs in the morning, and 18mgs at lunch to help me focus in class. I am 17 years old, turning 18 in three months, and I weight 175 pounds.\r\nMy first experience with abusing my meds happened at my friends house. I was very tired in the morning because we had been up with streetlights raving all night. I had heard from one of my other friends that Concerta helps you stay awake, so I decided to try it. I took 7 pills with about 32 oz. of water, and roughly a half hour later I was feeling great. The world became vivid: colors more intense, people seemed all around me, sounds were crystal clear, and even my friends cat was more interesting. On top of that, I felt very light, and I couldnt sit down.\r\nLater that day my buddies and I smoked a few bowls of weed, granddaddy perps, and we relaxed. The pot hit me like it normally does: short-term memory loss, giddiness, light headed, blood shot eyes, the works. I did not feel the Concerta before I began smoking, so I figured that a little weed wouldnt hurt. After all, if Im not already high on something, then nothing can go wrong, right? Right. I passed out from exhaustion between two and four hours later (thats guessing, because I really dont remember how long it was).\r\nAt around 8 oclock at night I woke up feeling rested and full of energy. I ate some pizza, and then I went into my friends room to dance the night away again. All of my muscles were sore, and my brain was still a little fuzzy from the weed. To combat this, I decided to take 7 more of my Concerta to keep me awake. For the first 45 minutes the Concerta had the same effect as it did earlier in the day, making everything intensely vivid. Then, I started to feel strange, and I dont know how else to put it. As I was dancing, I fell over because I became very dizzy. I didnt want to stand back up, so I pulled myself onto the bed and cuddled with my friends sister. Then, I stood up and started pacing. I dont know exactly why I was pacing, I just knew that I had to do it. It felt as if I was watching myself from above. I couldnt stop moving, or feeling myself. The touch of my hand on my skin was orgasmic. It was 11 oclock at night.\r\nAt 12 I started rambling. Now, I say rambling because I dont remember what I said. Most of what came out of my mouth was incoherent, and the only thing I actually managed to say was I am so fucked up, which I apparently said for two hours straight. I still felt good here, the same euphoria, only a lot better then it had been in the morning. From here things went downhill very quickly. I could not stop moving, for the life of me. I had to keep going or else I thought that I was going to die. I got an urge to smoke a cigarette, so I went out of my friends window and sat in the cold smoking a cigarette. While I was out there, my friend was trying to break into a safe that he stole (he is a Kleptomaniac). Every time he would hit the safe with a hammer, I jumped. The noise was so loud and so amazingly vivid.\r\nThree cigarettes later the hallucinating kicked in. The amazing noise was going to eat me. I had no choice but to hide behind a shed at fight it off with a lighter. I was so afraid that I was in tears. Things kept spinning out of the corners of my eyes (I attribute that to the rave lights now, that somehow the image stayed with me). I ran inside to hide and jumped in bed with my friends sister. For the next six hours all I remember is watching the ceiling change and telling myself how fucked up I was.\r\nThat was about three weeks ago. I dont know why the pills hit me like they did. I have taken up to 19 once (thank god I didnt die), but that was Euphoric the whole time, and I was paranoid. My only conclusion has been that the weed acted like weed should, and that I was speedballing and didnt realize it. From this experience, I really encourage anyone who wants to abuse pills to do the research first, and know exactly what you are doing and why before you take it. Ignorance led me to hell.\n\n\n"
}