{
 "title": "Fainting and Regaining Altered-Consciousness",
 "author": "CFCID",
 "citation": "   CFCID. \"Fainting and Regaining Altered-Consciousness: experience with Mushrooms & Cannabis (ID 69680)\". Erowid.org. Nov 17, 2008. erowid.org/exp/69680",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "188 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:45",
   "1.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 2:45",
   "0.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 23:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69680",
   "Male",
   " ",
   "Not Given",
   "Nov 17, 2008",
   "5293",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>**I do not attribute my chest pains to psilocybin mushrooms, but I thought I may as well post all that has happened to me after I ate them. I attribute my chest problem to smoking marijuana too quickly**</p><p>I am a 21 year old male (turned 21 in late December of 07) with no prior history of heart ailments and no family history of early stroke or heart problems in general before the age of 50. I am an athlete and have a resting heart rate around 45-55 BPM. I am 5'10' and about 185-190 lbs. I work at UPS and get a hard workout for 3 hours every night. This workout is primarily focused on the chest muscles. I am going to give you all some factors that may have to do with my current condition, but I do not believe really hold weight in terms of why I am experiencing the chest pain I have been feeling since February 17th, 2008.</p><p>At about 3:30 PM on Saturday (Feb. 16th) I ingested approximately 1.5 grams of psilocybin mushrooms (shrooms) - the day went well and I was comfortable enough to ingest another 1.5 grams at approximately 5:15 PM. When I returned to my house at approximately 6:15 PM I finally ingested the remaining .5 grams of psilocybin mushrooms I had. About two hours later I smoked a small portion of Marijuana I had set off for the end of my 'trip'. All was going well until I decided to go down to my kitchen and get some food. I assumed that my 'trip' was over because I was feeling a bit drunk the whole time but had no real hallucinogenic effects. As I was in my kitchen fixing up some food my field of vision started to get darker - so I decided to try to hurry up and get to my room before whatever was going to happen happened. I did not succeed. I was walking up my steps and went to one knee and it felt like a river of black was coming from both sides of my peripheral and I fainted. I was told my eyes went to the top of my head and I fell down about three steps in an alpine position. </p><p>Approximately 1 minute and 20 seconds later I regained consciousness. When I regained consciousness a bright white light came into my vision and I gasped a deep breath. Prior to this point I had a nice body high - my arms and legs felt light as feathers and I sort of appreciated nature more. At the point where I came back to consciousness I really felt the hallucinogenic effects and started to say 'I need to lay down, I need to lay down'. I went up to my room, laid down, and experienced what one would imagine taking hallucinogenic drugs would be like. Auditory & visual hallucinations, body high, the whole deal.</p><p>In about thirty minutes I calmed down and the rest of the night was normal with absolutely no chest pain or ill effects. The only reason I have stated these facts is that a person with experience may be able to link this drug use together with my current symptoms.</p><p>On Sunday the 17th of February at approximately 3:00 I decided that I was bored and would smoke some Marijuana. I smoked a bowl rather quickly and immediately after that my chest started to hurt. This is no uncommon occurrence as chest pains are a common result of smoking marijuana. The problem has been that this chest pain has not ceased since Sunday. Originally my chest pain was located on the left area of my chest by the ribcage and would float around my pectoral area.</p><p>On Thursday the 21st I went to my family doctor. I told her the story that I tell you now. She ran an EKG on me, took my pulse, and measured my blood pressure. All was fine. She prescribed me prescription strength Ibuprofen (600 MG) and told me to take this three times a day for the next week.</p><p>After a nights rest I woke up and started to notice that the pain was no longer on the left side of my chest, but rather the center. This worried me. It worried me so much that I went to the ER and again told them the same story that I am telling you now. The nurses & doctor (she was actually an assistant or something) at the hospital took blood from me, put me on an EKG, and took a urine sample. After laying around the hospital for ~5 hours the doctor came in and told me that nothing was wrong with my heart, but a blood reading was high for a musculoskeletal problem - so essentially they told me I messed up a bone or a muscle and that nothing was wrong with my heart.</p><p>Now that you all know my story, I will tell you my symptoms (the ones I am experiencing right now.):</p><p>A burning / sense of fullness on the left side of my chest and sometimes just below my sternum. The fullness when it is on the left side of my chest is primarily located from the right side of my nipple (the side closest to the center of the chest which if I press down on hard enough it seems to be sensitive) down to the bottom of my left breastbone/ribcage.</p><p>I remind you that all of this chest pain began after I smoked a small bowl of marijuana rather quickly on Sunday the 17th. I understand that this is an awkward post but hopefully someone will understand what I am saying.</p>"
}
