{
 "title": "A Real Smoothie",
 "author": "popshot",
 "citation": "   popshot. \"A Real Smoothie: experience with Kratom (ID 69703)\". Erowid.org. Feb 28, 2011. erowid.org/exp/69703",
 "substance": "Kratom",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69703",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 28, 2011",
   "Views: 4250",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI got my packet in the mail today of Kratom powder. It's an ordinary day, no unusual stressors at all. Very equable, mellow mindset, as per usual. Kratom, powdered, looks and smells VERY much like powdered henna... The smell is nearly the same.... Not pleasant or unpleasant, necessarily, just very murky/muddy and dusty and herbal-smelling. <br>I took about 26grams of powder (approx. A heaping tablespoonful, as I'm a big boy) [Erowid Note: Volume/mass discrepency: a level tablespoon would probably weight about 6-7 grams.]  and boiled it with four cups of water. I boiled it down until it was about a cup of liquid. I strained off the sludge and set it aside, as I would boil the sludge down THREE more times to eke every bit of power out of that heapin' helpin'. I drank about three cups of this infusion, each cup yielded from a vigorous boiling and steeping. It's a greenish-orange liquor, not nauseating as others have suggested, but not yummy either. Very bitter and leafy tasting. I kinda expected this, so I wasn't taken aback.<br>Within 20 minutes, the effects started to come on. I first noticed chills on the back of my neck and spine, due to a light sweat. Then a feeling of mild dissociation... That curious feeling one gets on some substances in which inner ideations seem momentarily as real as external sights. In about an hour the full effects were felt... Yes, it's an opioid feeling... Great calmness and relaxation, even a certain inexplicable mirth. A mild numbing feeling, not unlike the one cocaine produces, was felt on my lips and tongue. The feeling is much like an Oxycontin, though perhaps not as strong. The feeling is not at all like speed or coke, not like pot or LSD or shrooms. People seeking party drug potential will probably be disappointed. OTC Dextromethorphan is actually a good bit stronger, I'd say. As stated, it feels rather like a prescription opioid-based painkiller, though, frankly, not as euphoric. Quite pleasant, though not trippy or 'psychedelic' at all. Just very mellow and groovy and introspective.<br>The only senses that seemed heightened to me were the sense of hearing--- music suddenly seemed more sensuous and heartfelt, I could make out individual voices in a thick cluster of harmonies!-- and, believe it or not, olfactory-- the cologne I usually wear suddenly smelled brighter and more 'sparkling' or 'scintillating'. After about 1.5 hours, the effects subsided a great deal. As others have stated, this herb probably bears exploration as a conventional painkiller. I'll use it again, to further refine my impressions of it.<br>Something I noticed later seemed important enough to add as an addendum:<br>There seems to be a natural 'plateau' or 'saturation level' that I reached when drinking several cups of the tea over a 6-hour period.<br>Truly, the biggest high occurred about one hour into my experience. I noticed that subsequent drinking of the tea over the next few hours did NOT increase the power of my high. It prolonged the overall effect, but it did not get me higher, the more I drank.\n\n\n"
}
