{
 "title": "Not Like What I've Read",
 "author": "hmb",
 "citation": "   hmb. \"Not Like What I've Read: experience with Salvia divinorum (ID 6973)\". Erowid.org. Jul 9, 2002. erowid.org/exp/6973",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "5 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 6973",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 9, 2002",
   "Views: 7219",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA couple of weeks ago, I ordered salvia leaves from a popular site on the internet. There was a choice between Oaxoan and Hawaian strains, with the Hawaian strain marked as more powerful, and therefore a little bit more expensive. Because of what I had read on this site, I decided that the more powerful strain wasn't neccesary. I didn't want to spend a lot of money anyway.\r\nSupposedly, just a couple of pulls through a water pipe should take you to places you've never been before, but my experience was very different. My friend and I sat down at about 10:30 pm and packed our bong named Hoshi with salvia. The leaves were pretty dry, but they didn't crumble too much; we didn't need a screen. We were expecting to be really tripping hard really quickly, so we had a sober sitter with us. By the way, we had smoked a bit of pot earlier in the night, but we were definately not noticably fucked up when we started smoking salvia. We each took medium sized pulls, partly because we were scared we would smoke too much. It seems from what I'd read that too much can be crazy, and unpleasant. Both my friend and I have tried Acid, shrooms, E, and between the two of us, a bunch of others including K, coke, and opium. We were still a little nervous. After the first 2 rounds we thought we'd stop smoking for a minute to see if it just took a second to kick in. After a couple of minutes, nothing. We smoked more, nothing. More, well now we were stoned, and a little gitty. We laughed, but it almost sounded like a nervous laugh. I guess it was fun, but it wasnt much of anything\r\nWe smoked more, but nothing really impressive happened. We both expressed the fact that we felt stoned, but we were definately not tripping balls like we wanted to. We also didn't feel any pressure on our bodies. This effect had been written about in almost every account I'd read. After about 5 large bowls, we got bored and said fuck it, we'd try again tomorrow. \r\nWe went out, chilled, and smoked a joint and some cigarettes in the park. What I noticed at this point was that I felt a feeling that I'd never encountered. It felt a bit like coming down from being really stoned from good bud. I was very mellow. What was different from weed was that I felt almost unnaturally baseline. Not anxious  at all, but not exactly happy. I was very at ease, and everything seemed really smooth. We chilled in the park for a while, and I ended up really opening up to my friend about a lot of things in my life that I had never talked about. Like I said, life, and time seemed really smooth, but also really baseline. \r\nAfter about 2 hours (it was now about 1:30am), we came back to my house. We decided to smoke some more. We decided that instead of sharing bowls, we'd take one whole packed bowl and then pass the bong. We also decied that we should get the salvia really hot this time (I had read that it needs to get really hot for the psychoactive chemicals to be released) and take really big hits since the smoke wasn't harsh at all. We each got about 3 monster hits. At this point we started feeling something. I felt like there was something pushing the skin on my face down slightly, at first just my face, but then it felt like the skin on the whole front of my body was being pushed down towards the ground. I also felt like my fingers wanted to float up in the air. I sort of got crazed, and in a way sped. My friend felt pressure at his waist, he started to take his belt off, but I reminded him that salvia did that to you. We were both in this crazed state, where we laughed almost violently. So much that we almost woke my mom up in the other room. After about 2 mintues though, it was pretty much gone. My friend remarked that it was a lot like K, but I can't vouch for that as I've never tried K. We packed another bowl, and did it again, but it didnt work quite as well, so we just decided to go to sleep. \r\nI guess maybe we got weak leaves. Maybe they were dried/cured wrong.  In any case, I believe that salvia is probably very powerful in an extract, but as far as I can tell, buying the leaves is a waste of money. Honestly, the most interesting thing is its come down. I've smoked it since, and whether I trip or not, I always have that strange smooth, mellow, sometimes melancholy feeling for hours afterwards.\n\n\n"
}
