{
 "title": "Minnesota Vacation",
 "author": "Him",
 "citation": "Citation:   Him. \"Minnesota Vacation: experience with 2C-B & Alprazolam (ID 69745)\". Erowid.org. Aug 15, 2008. erowid.org/exp/69745",
 "substance": "2C-B & Alprazolam",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 repeated",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "1 repeated",
   "insufflated",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "1 repeated",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "1 line",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   " ",
   "20 mg",
   "oral",
   "2C-B",
   "(capsule)",
   " ",
   "10 mg",
   "insufflated",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 69745",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2008",
   "Views: 14100",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA little information on myself:\r\nI am a born and raised individual of South Dakota, an extremely boring, flat state, with a high rate of suicide incidents. I consider myself to be very curious, level headed, and a very experienced user of many psychoactive substances.\r\nThe setting:\r\nI had just driven for about 5 hours to go visit some friends for a week in a mid sized Minnesota town to get away from it all for a while, literally. I arrived at my friends house which consisted of seven roommates who I consider to all be good friends of mine. The house is a decent sized place, very lived in and very chill about one block from the campus of the local party college. \r\nThe Story:\r\nWell I had just gotten into the town around 10 am and the first thing I do is meet up with a girl I had contacts with and purchased 20 0.5mg peach football xanax from her. This I found exciting being from a boring place where fun things are pretty much non existent. I then proceeded to the house and greeted all of my friends and I was basically shaking with nervous excitement to see them all. I might add the xanax was a great tool for calming me down and just being able to calmly and euphorically bask in their presence. We go on through the day smoking bowls and taking xanax, sometimes swallowed and sometimes snorted but needless to say my short term memory was nonexistent for several hours and I also enjoyed myself blissfully a great deal. Then one of my wonderful friends boyfriend was able to acquire a nice amount of 20mg 2c-b in cellulose capsules. \r\nNeedless to say the majority of us purchased a capsule or two in order to prepare for the night in which we were traveling to a friends for a birthday party. So about five of us dropped a capsule and I continued snorting xanax pills. Right before we were about to take off my great buddy offered me some cocaine in which I traded him a xanny for and we proceeded to snort the two in succession. This is right along the lines of when the 2c-b kicked in. Now this wasnt my first time using 2c-b but by far my strongest trip on it. I began getting very social and euphoric and the sight of geometric patterns with my eyes closed and objects sticking in my vision and then tracing off with the lids open. \r\nI was enjoying myself thoroughly so then me and another dear friend decided to insufflate another 10mg each. It burnt something titanic. It was well worth it as we arrived at the party and seeing friends I hadnt seen for a month was great and socializing was very fluid and everything seemed so bright and stimulating. Although I felt stimulated I was not jittery thanks to those xannies. After about two hours of being there which seemed like twenty minutes, about seven of us decided to head back to the house to toke and drink a bit of liquor without having to worry about finding a place to crash. So we piled in a car (with a sober driver) although some of us were sitting on others laps which was a dumb idea because if we would have gotten pulled over it was easy to tell how absolutely drugged we were, we would have been in deep. \r\nIt felt like a snap of a finger and we had arrived at the house, it was nice being accompanied by some other lady friends who came with us from the party I might add (its nice to have chill understanding friends when you are out of your gord). Once we got to the house it was about eleven PM and I was absolutely tripping balls. Two of my friends who didnt come to the party but live at the house and have been dating for quite sometime seemed to be in what I thought was a fight. This upset me and I had extreme feelings of empathy and took them into another room and just started tearing up which I thought was pretty crazy! But in some way it just felt wonderful. \r\nAfter this I drank a few shots and my friends embarked on a journey of taking down a whole 1.75 liter of captain morgan. After a while things get hazy although I only had about two shots I fell into a strange mode of thinking where my thoughts would loop infinitely and I felt extremely confused and almost frightened. I went upstairs to try and fall asleep and was tripping extremely hard still, I was digging through my bag for some more comfortable clothes and whats this? I had forgotten I had four xanax left! I swallowed one and quickly crushed up the two others and inhaled them into my nostril. I felt like things smoothed out from there but I then receded into a disco nap of waking and passing out spells accompanied with pure confusion. I woke up the next morning at about seven AM with a massive headache and could not find a pipe to smoke some herb so I had to purge myself. After the vomiting I immediately felt better but was still seeing mild fractals and melting visions. I then crushed up the last of my xanax and snorted it, this made me feel much better but also made me appreciate the linger hallucinations. I went downstairs were my fellow trippers were all passed out in funny positions. Some sprawled out on the floor and using one another as pillows, I might add that the bottle of captain morgan was completely empty.\r\nRefection:\r\nNow that I look back on it this was an amazing experience and I felt like just being in my friends presence elated me. Although I dont advise mixing chemicals to such an extent like this it was the closest thing I have to a spiritual experience (I am atheist you could say). The spirituality of staying in my friends very comfortable house warm and with people I dont know how I go on without sometimes just put me into a state of trance like awe.\n\n\n"
}