{
 "title": "Pain in the Head",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Pain in the Head: experience with Diphenhydramine (ID 69742)\". Erowid.org. Feb 24, 2010. erowid.org/exp/69742",
 "substance": "Diphenhydramine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   " ",
   "450 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69742",
   "Male",
   " ",
   "Not Given",
   "Feb 24, 2010",
   "Views: 4009",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nBored. Decided to pick-up some benadryl as I've heard it gives the most realistic hallucinations possible. I was interested, misread the dose and took wayyy too little amount. (6 capsules at 25mg each - 150mg in all). </p><p>I was fatigued, numb - nothing big. The next day I was getting some weird sharp pains in my head, not like a normal headache, it was in one specified spot and only lasted for seconds and would repeat at random times of the day, barely noticable. Also, it felt more like inside my head, unlike headaches which feel more outside-ish, hard to explain. Anyways, I thought nothing of it.</p><p>A few days later. I decided to take the rest (18 capsules - 450mg in all).</p><p>Wasn't that amazing, was fun, but nothing mentionable. Would randomly stop talking in the middle of my sentences even though I would know what I wanna say, very minor open-eye hallucinations (just specs crawling around with no form, really).</p><p>Well, it's been 2 weeks later. I'm still suffering from this pain in my head (which feels more actually on my brain). The pain is normally in the top right side, but I've been getting different feelings elsewhere, not necessarily 'pain', maybe what I'd describe as a minor sharp pain elsewhere and a more constant pain to the top right. Anyways, this is happening more and more frequently it seems (unless I'm just becoming more aware).</p><p>I'm not completely positive; but I've been hearing things (again, maybe my brain just fucking with me?) my name being called when I'm in social situations when it's not (I'd respond because it's more realistic than anything else I've had), and once while watching TV I'd hear a random completely off-the-wall sound for a good 10 seconds. Maybe it's just me worrying too much, but the pain in my head is definitley there.</p><p>I'm getting worried but want to avoid a trip to the hospital at all costs.</p>"
}
