{
 "title": "Guided by Floyd",
 "author": "Bickoma",
 "citation": "   Bickoma. \"Guided by Floyd: experience with Mushrooms - P. cubensis (ID 69755)\". Erowid.org. May 2, 2010. erowid.org/exp/69755",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69755",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2010",
   "Views: 1963",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis would be my fourth trip, with my friend K and sitter J. The night before, we acquired 3.5 grams of psilocybe cubensis to share today between the two of us. At 10:55, we divided and slightly ground up a total of roughly five heads and a dozen stems. At 11:20, the true effects began to manifest.\r\nThe first physical effects began - the short, slight shag carpet began to take on a new physical feeling for me. Patterns in wallpaper, paintings, and tiles all began to grow and intertwine on their surface. Already, feelings of happiness and satisfaction are surfacing. Animals in the house take on a new, chimp-like noise - their chatter and communication through body language between themselves becomes more and more meaningful to me. At this point, we began to play Dark Side of the Moon. This is where my trip begins.\r\nThe beautiful atmosphere and setting we were in could not have been better. On a patio overlooking beautiful scenery, with plenty of colorful and interesting pieces of art to observe, the entire outside world began to appear in tremendous colors and tree branches began to intertwine in accordance to the music. I was very aware that each individual room began to take on a personality of its own. Around this time, I realized that I have had some inner anxiety hidden away. Currency began to lose meaning and money began to seem like a rather weird concept.\r\nAt roughly half way through the album, ecstasy began flowing through my entire body. I felt so amazing from both the scenery and the music that I broke down into tears for 20 minutes because everything was so beautiful. I was so content with life and the joy that I would be totally satisfied with simply surviving on food, water, and a minimal shelter.\r\nSoon after playing with the pets, at roughly 2 and a half hours after ingestion, we headed over to the beach. The music had been a major component of our trip, and I was worried that the lack of music would change the trip entirely. However, the drive to the beach turned out to be fascinating. Our only choice of music was now rap, but the beat manifested some intense visuals. Apartment buildings began taking on M.C. Escher-style - balconies would be flipped upside down, railings and steps would turn sideways, etc.\r\nThe walk from the car to the beach proved to be rather intense, but without anxiety. This is surprising, because usually anxiety is a very major issue with my trips, but I had no problem walking and interacting with a few people. However, once at the actual beach, everything became very weird and slightly hostile. At this time, at around 3:30pm, the trip was pretty much over. Some marijuana was smoked afterward, bringing the trip slightly back for a while, and maintaining mental clarity without the normal haze that it provides.\r\nOverall, this trip was incredibly beneficial for me. It was my first completely positive experience with psychedelics, and I feel that the environment for my trip couldn't have been better. I can safely say that mushrooms are now my psychedelic of choice. Beautiful scenery, plenty of fantastic music, and some comfortable chairs were all it took to have this beautiful experience.\n\n\n"
}
