{
 "title": "Soma Coma",
 "author": "Corinne",
 "citation": "   Corinne. \"Soma Coma: experience with Carisoprodol (Soma) (ID 69779)\". Erowid.org. Dec 30, 2010. erowid.org/exp/69779",
 "substance": "Carisoprodol (Soma)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Pharms - Carisoprodol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69779",
   "Female",
   " ",
   "Not Given",
   "Dec 30, 2010",
   "28154",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a journey from the first time I deliberately took Soma to the most recent time.</p><p>A few years ago, I was into all kinds of illegal drugs, but not yet into opiates.  I had read about Soma as the brainwashing drug in 'Brave New World' and was shocked to find there was an actual drug named Soma on the market -- with psychoactive effects.  I HAD to have some.  A man who wanted to date me bought me a bottle of 90 online as a courtship gift.  </p><p>The next afternoon, I took 2 (700 mg).  Within 5 minutes, I began to experience a dizziness that is as intense as dizziness can be while still being pleasant.  My muscles were so relaxed and loose I felt like a Gumby.  I stood up and found I could barely walk.  I was reminded of what they used to call the Jake Walk, when people drank something approximating alcohol called Jake and wound up with permanent nerve damage and a distinctively jerky walk.  It wasn't at all like the fluidity of extreme drunkenness.  Rather, it was jerky and twitchy, and I even feared I might be going into convulsions.  But instead, I just collapsed on the floor in a puddle of primordial goo.  I reached for the phone.  It was ringing, and it was my MOTHER.  </p><p>My memory at this point was failing.  I personally find Soma screws with my memory as much as Halcion and other strong benzos.  I don't remember at all what I was saying to my mother on the phone, but I distinctly remember her being horrified at my utter inability to talk.  Soma is the one drug I've ever taken that makes it absolutely impossible to talk.  I don't know if it messes with the left temporal lobe's language center or if it just detaches it from the muscles I use to produce sounds.  Either way, when I am seriously screwed up on Soma, I sound not unlike my deaf friend when he's drunk.  I was also reminded of a stroke victim trying to talk.  It's not just a slowing down but a total breakdown of speech, and it's the only drug I've ever experienced that with.</p><p>When I got off the phone, knowing I would feel terrible about alarming my mother the next day, but not caring at the time, I tried to look at things around my apartment to see if they looked prettier, but my eyes were so crossed I couldn't see straight.  The feeling of taking a good dose of Soma for the first time is somewhat akin to taking nitrous.  That said, I've known people who take it expecting all this and who get almost nothing but relaxation.  </p><p>These intense feelings of being whacked out of my mind only lasted about 20 minutes, and then I just passed out for about an hour.  I really experience a lot of amnesia with Soma, so sometimes I don't know when I actually pass out and when I'm still high and just having fun.</p><p>Something I've noticed about Soma.  I HAVE to be absolutely starving when I take it if I want to get off on it, and I can't take it with milk or juice.  Only water.  And yes, it does taste chalky and horrible and it sometimes makes me gag, but once it's in, it will relax any stomach ailment I might be having.  In fact, now, I sometimes take it for a stomach ache.  I wouldn't think of taking an antacid or something when I know Soma relaxes just about everything.  </p><p>Fast forward to now, a few years later.  There was a period when I had to stop ordering Soma online because I was taking between 2 and 8 (700-2800 mg) a day, and I began to pull muscles in my jaw just from chewing food, or in my forehead simply from having my eyes open -- muscles I didn't know I had.  I'd find it was extremely difficult and uncomfortable to lift my arms to my head to shampoo my hair in the morning after taking it, like I'd just gotten my arms out of a cast.  And when I went to the doctor for a checkup, my blood pressure, which has always been low, had dropped another 10 points!  The heart is a muscle, after all.  And every time I've been on Soma binges since and had my blood pressure taken, it's always a good 10 points below what it normally is, even though I may not have had any of the drug in my system for 36 hours.  It also makes me skinnier because my muscles wither away if I take it at high doses daily. It's very easy to pull all kinds of muscles when I take it regularly.</p><p>But after having gotten into opiates recently and then losing my source, I regrettably resorted back to Soma for a more intense high than I get from my prescribed Valium and Xanax, which are not really recreational for me anymore.  I immediately remembered the high of Soma, although it took 4 this time to do what 2 did the first time, even though it had been 6 months or more since I'd taken it.  A really good Soma high, when I haven't taken it in months and Im starving, is brief, but it's intense enough to rival any opiate high.  Unfortunately, that intense high only lasts the first time back on Soma, and even then, only for 20 minutes or so.  With opiates, it goes on and on, day after day.</p><p>The last time I took it, I took 6 of them, along with a couple of Halcion (.5 mg), and decided to hang up some paintings I'd done.  I was feeling great and listening to music way too loud and I stepped on an antique table that clearly could not hold my weight.  The table leg broke off, the Louis XVI chair I was standing on initially, which clearly was also not built to hold a 115-pound Gumby, flew out from under me, and I landed flat on my back.  In the seconds I lay there on the floor stunned, I waited for the pain, but it didn't show up till the next afternoon.  My boyfriend came running in the room at the noise and saw me on the floor holding the gilded table leg up like a trophy, wearing a vintage 50s petticoat and nothing else (Soma, along with other downers, always gives me an intense need to dress up in outrageous clothing and jewels and/or be half-naked), and asked me what my problem was.  </p><p>That was this weekend.  I much prefer opiates, but Soma is a glorious drug that just doesnt last very long.  It's not physically addictive in my experience at all, unlike opiates and benzos, both of which are HIGHLY addictive physically.  Soma does offer a unique experience from any other drug I've taken, and it has the coolest name of any drug on the market.  I even did a painting hanging in my kitchen titled, 'Soma Coma.'</p>"
}
