{
 "title": "Discovering the Unseen",
 "author": "Chickboy",
 "citation": "   Chickboy. \"Discovering the Unseen: experience with LSD (ID 6977)\". Erowid.org. Jun 10, 2002. erowid.org/exp/6977",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 6977",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 10, 2002",
   "Views: 6924",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy first time frying was a chance experience.  A lot of my friends had tried acid, and always had good things to say about it.  I was at a pool hall where all the stoner people hung out at night, and my friend Brandy (who was one of the more experienced people, having spent a lot of time in Berkeley) bought 40 hits off a friend of ours, and was more than willing to share.</p><p>I took one at about 8:00, and didn't feel anything a half hour later (although I've found with experience that this is total crap, I was told at the time it shouldn't take longer than that to kick in), so i asked for another one.  She gave me two.</p><p>While waiting for it to kick in, my friend Bit and i were wrestling in a grass circle, and she pinned me down, and i looked at her face in front of the black sky, and her pupils seemed to dilate inward, like a cat, and her long teeth seemed to grow like vampire fangs.  At this point, i think the people who talk about their bad experiences would have freaked out.  But i was ready for anything, so i laughed, enjoyed it, and told everyone how cool it was.</p><p>As it was coming on strong, i was feeling very hyper and happy, and i was sitting on a park bench (sort of) with my feet on the seat, and my head on the ground.  I was talking to my friend jeremy, and all of the sudden, his pupils blinked!  They were huge, of course, because by this time we all had the same dosage, and his eyes were suddenly completely hazel, and then all black again.  I took a double take, thinking about how wonderful it was, and went to talk to some of my other friends.  they were wondering around, staring at trees.  My friend cinnamon showed me a discovery that she called 'ganjaland', which was a group of trees that appeared to be huge pot trees.  it was beautiful.</p><p>Many details of the night can be skipped here for the simple fact that they are unimportant, but i will say that we hooked up with a friend who had a car, crammed 8 people into a VW golf, and cruised to a few different places to get more Sid (at one point i took my fourth and final hit of the night) and some weed and some OJ and so on.  Then we retired to Buchanon Park at about 12:30 or 1:00.</p><p>The park was beautiful.  The trees all swayed as if made of rubber, and it seemed like Buddha was waving hello at me.  Then one of the greatest experiences of my life occured.</p><p>It was windy (as it always is in the bay area), and there were sprinklers wattering a small island of grass.  I became somewhat hypnotized by the water, and started walking into it.  As i came into the middle of the flying water, i could actually see the wind.  There are no words to describe the feeling of being able to see the wind.</p><p>As a buddhist, I believe that i must have some good fuckin karma to have been witness to such a beautiful thing.  Throughout my entire first trip, there was never a time that i felt that i had lost control, or that it was too much.  I was not a buddhist at the time, but this experience was probably one of the biggest influences on my ability to believe that there is a spiritual world that we cannot normally see.</p><p>For just six hours, i was in a completely different world.  i felt like i had been in a completely different dimension, and felt so much more alive having seen it.  </p><p>I've fried about 7 times since then, taken more and less, even had one bad trip (motel room?  friends with weapons?  sex (which causes guilt for me, cuz i want to be celibate)?  all this added up to the more terrible set and setting possible), but i've never had nearly that much fun on a trip.  it opened my eyes to a whole new world, and although i do not in any way condone the use of lsd for people who can't handle it, nor do i think it should be legal or easy to get, i will always love taking my twice-a-year trips to a whole new world.</p><p>My future plans are to fry during the day for the first time, with hopes that it will open my eyes to more new great things, and that the lack of darkness and shadows will cut down on the paranoia i've felt every time except my first.  Acid is a connection to something we cannot understand or accept while sober, and for those of sound mind, an experience that cannot be substituted or replaced.  I'd recomend it to anyone who is honest with themselves.  I think that people who have problems with acid have too many skeletons in the closet.</p>"
}
