{
 "title": "A Splendid Evening",
 "author": "Landon",
 "citation": "   Landon. \"A Splendid Evening: experience with DET (ID 69804)\". Erowid.org. Mar 14, 2008. erowid.org/exp/69804",
 "substance": "DET",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DET",
   "(freebase)",
   "  T+ 2:00",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 3:00",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69804",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 14, 2008",
   "Views: 9597",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI started the night off at about 11:00 pm with approximately 300 mg of DET freebase which I took orally with water after having eaten a full meal approximately half an hour before hand. I should also mention that I'm on an SSRI (sertraline HCl, 50 mg) which I take regularly.  <br>There was little to no effect for approximately one hour, then slowly, while I was taking a shower (approximately 1.25 hours after ingestion) I started to feel it kick in.  It began with a slight euphoric feeling. The sensation of the hot water running over my skin was particulary enjoyable.  I found myself fascinated by the water rolling down my hand and the soft play of light in the room.  <br>I dressed and began to get ready for night out and as I did so I felt that every piece of sensory information was more robust and enjoyable.  Smells and tactile sensations seemed to be especially pronounced.  I felt extremely optimistic and energetic (but not energetic in the sense of caffeine).  I then left my apartment and went to a nearby party (arriving at about 2 hours after ingestion).  <br>Every aspect of the party, from the music to the conversation seemed to be enhanced and utterly blissful.  I drank a couple of beers, but nothing really substantial.  The play of light in the room was very enjoyable and there were minor visual distortions, especially in my peripheral vision. During the party I also started to notice some audio distortion, a shift towards more basic tones (my voice and the voices of others seemed to be deeper and more resonating). <br>I had a couple of good philosophical discusions with friends which I found very invigorating.  Throughout the night there were occasional periods of mild dizziness, but nothing I would complain about.  Higher order thinking skills seemed to remain intact (hence the philosophical discussion).  I left the party at approximately 2:30 am with a good female friend of mine.  When we got home we made love for about an hour.  The sex was incredible!  Every second of the experience was one of intense pleasure and euphoria and the climax was nothing short of spectacular.  <br>Afterwards, we spent a couple of hours discussing a variety of topics and I felt extremely engaged in every bit of conversation.  I could feel the effects wearing off at about 5 am and it was all over by 6 am.  The finish was so clean, almost like nothing out of the ordinary had occurred.  What an evening that was!\n\n\n"
}
