{
 "title": "Awesome Journey Into the Depths of Mind",
 "author": "Gl00r",
 "citation": "   Gl00r. \"Awesome Journey Into the Depths of Mind: experience with Morning Glory Seeds (Sky Blue) (ID 6980)\". Erowid.org. Feb 20, 2002. erowid.org/exp/6980",
 "substance": "Morning Glory Seeds (Sky Blue)",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "240 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "2001",
   "6980",
   "Male",
   " ",
   "Not Given",
   "Feb 20, 2002",
   "10284",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis is my first experience with seeds, I haven't (excluding hash)tried other drugs before and nor will I in the future. </p><p>It was this friday (18. May) when I tried the seeds for the first time. We had been planning on doing it with my friends for whole week and we were excited and stuff. I bought 4 bags of sky blue morning glory seeds from the local store, each bag contains 60 seeds. We went at one friend's home since his parents were away for the weekend and we would go on a trip all together. </p><p>So once we got there we opened the bags, and everyone took an empty bottle (preferably a 0,5 litres plastic) and filled half of the bottle with warm water, then putting one's seeds in that bottle, then adding a little of (dish)washing-up liquid, like just a few drops of it. After shaking the bottles for about 45 minutes, we took a strainer and ran the foamed water in the bottles trough it with seeds staying in the strainer so we could wash them well. After that we got ready for the experience, but made one mistake.</p><p>Well, the seeds were ready to get eaten and we started munching them down, biting hard and for long to get everything out of them for the best effect. - 'Hey wow you told me they taste bad, that's nonsense! They're just like sunflower's seeds!' - Errr NO! That was a mistake, what I was to find out later. So I ate like a quarter of the whole amount of seeds I had, making it around 60 seeds, just like that, munching them down. Then I just couldn't eat them like that, and I crushed them by a hammer and mixed with banana yoghurt. Wow, I had no problem getting the seeds eaten anymore.</p><p>What I later realised was that under the effect of this stuff (LSA) my memory sharpened up a lot and all the tastes and smells remained. I started feeling very sick and felt like throwing up. I had to get to the toilet, I was so positive I was gonna go trough the worst night for a long while and spend it in that toilet.  When the toilet-phase came and I was lying on the floor in the toilet, I couldn't get rid of that disgusting taste. Whenever I started to feel even a little bit better, some little piece-of-a-seed revealed itself from behind my teeth and I was about to throw up right away. This was all terrible and I swore never to touch those seeds again. </p><p>Well I started reading Winnie the Pooh which I found from the toilet and the rabbit started to seem mean at one point. I was excited cause I realised I must be freaking off for thinking that! So suddenly I felt great physically. I drank some water and it tasted amazing, then I went back to my friends to tell about the rabbit. I felt so good I started eating the rest of the yoghurt including those seeds. I finished it off and ewww.. there I was again, lying on the floor of the toilet, my mind reminding me of every disgusting taste and smell I had experienced earlier that day. This took a while again, but I never threw up. </p><p>When I got up from there next time I felt somehow weird. I don't exactly remember what I did in the meantime but suddenly I started running around the rooms telling my friends how I felt the effect. I touched walls, floor, carpets, tables. Everything felt so different and I was so excited about it all, I went to my friend and shouted - 'I understand! I can understand! I see it now!' - and stuff like that I saw it all whole. Well I spent the evening tasting candies and spices and drinking juice. Everything tasted so undescridably amazing. Tasting things was an adventure, everything was so beautiful and harmonic in my mind. </p><p>I was trying to get a 'bad trip' for I couldn't (and still don't) believe I wouldn't be able to control my own mind. I wanted to see scary things and then control them all. That didn't work, I saw nothing bad at all. I didn't see visuals until my friend told me: - 'Alright there I go.. nice visuals up there!' , I replied: 'Hmm.. I haven't seen any visuals yet.. but I'm feeling so GREAT I ain't even missing them.' - and in the same second I saw how his beard and hair grew up quickly and his hair became part of the pillow his head was on. It was amazing, I've only smoked cannabis before this and this was something different. </p><p>How it felt to be tripping is undescridable, anyways the seeds </p><p>worked perfectly and what I went trough I wouldn't call 'fun' as in 'having fun' but more like understanding my environment and the thoughts. I could easily leave a conversation, join another. I received all the information from a room with people in seconds after stepping into the room, and I could nicely join it in the right moment. I acted as real as it gets and me and my friend had some serious conversations. I can honestly say I've never been as clear from my mind as I was that friday. I could think so clearly. </p><p>Overall, a wonderful experience that made me confident of the existence of a higher world where one's thoughts are in harmony with the others'. This experience changed me, and in a positive way in my opinion. It helped me understand and it opened me. I'll definately go for it again, but will try to not do it too often, since the poisons in the seeds might harm you. In a certain way maybe, I don't know much about it. </p><p>I got my inspiration to try them from my friend, who got it from the internet. When I waited for that friday, I got the URL for this site from my other friend, and after every experience I had read, I felt more and more like I couldn't wait any longer to get to try these. I waited whole week and I can tell you it wasn't a disappointment. So if you've got your inspiration, I suggest you prepare for the trip well:</p><p>1) Friends. Do it with the best of your friends to maximize the feeling of sharing something amazing.</p><p>2) Feel like it. If you are aware of it, skip. You don't want to end up going trough a bad trip or anything, and any negative experience from that day or from earlier time still bugging you might get you on one.</p><p>3) Candies, lollipops. Yes, get some different candies and such, believe me you will want to eat them. Even if not, you should try.</p><p>4) Some brain. You're the one that uses the brain that creates the visual and other experiences. Understand it and remember it.</p><p>5) Good music. You will probably want to listen to some relaxing music. I don't suggest Pink Floyd or such, as my friend told from his own experiences that this kind of music is damn scary. </p><p>...or just forget about what I said and you know what's best for yourself. This isn't a thing for people who are just willing to 'have fun' and party around. It's in my opinion, for thoughtful people. Seeing hallucinations and hearing sounds etc. isn't nearly as incredible feeling as the feeling of somehow just understanding things.</p>"
}
