{
 "title": "Excellent Study Aid, Energy and Mood Boost",
 "author": "Tryptamine*Dreamer",
 "citation": "Citation:   Tryptamine*Dreamer. \"Excellent Study Aid, Energy and Mood Boost: experience with Levmetamfetamine & Piracetam (ID 69844)\". Erowid.org. Apr 13, 2009. erowid.org/exp/69844",
 "substance": "Levmetamfetamine & Piracetam",
 "bodyweight": "285 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Levmetamfetamine",
   "  T+ 0:00",
   "1500 mg",
   "oral",
   "Piracetam",
   "  T+ 0:00",
   "  ",
   "oral",
   "Vitamins - Choline",
   "  T+ 2:15",
   "10 mg",
   "oral",
   "Levmetamfetamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69844",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 13, 2009",
   "Views: 22695",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is my first time using l-methamphetamine. It is found in Vicks inhalers and some similar store brands. Ive never tried any form of meth. The L isomer is said by many to be pretty worthless as a recreational drug. Some disagree. It is time for me to find out.\r\nThe stimulants Ive tried are MDPV, propylhexedrine, modafinil, methylphenidate, ephedra, and one 30mg dose of amphetamine. The only ones I currently have available are modafinil, propylhexedrine, and l-methamphetamine.\r\nI really need something to give me some energy and wake me up. Propylhexedrine can be enjoyable, but is not much good as a functional stimulant. It seems give a pleasant mindfuck sometimes. Modafinil is not strong enough. That leaves l-methamphetamine, which I have never tried before.\r\nFor two nights, I had pretty bad insomnia. I slept between 4 and 5 hours last night, and less than two the night before. It is midnight, and I want to get a couple of hours of sleep. I have a calculus test in 8 hours, so I want to be studying by 4:00 AM. I try to sleep, lay awake for over 3 hours before getting up. My mind is foggy and tired. I cant concentrate and cant study in this condition. I have a l-methamphetamine inhaler to use for this situation.\r\n4:00 AM  I crack the inhaler and eat a little less than half of the cotton from the inhaler, about 20mg of l-methamphetamine. The smell is a bit unpleasant. The taste is a bit bad, but not too bothersome. I also eat some piracetam and choline. I go to the kitchen and grind up some poppies, which I plan to eat shortly.\r\n4:15 AM  I may be barely feeling it. My mind is still tired and foggy, and I have trouble thinking. I get out my calculus book and notes, getting ready to study for the test.\r\n4:50 AM  I am feeling it now. My mind is clearer and I have a bit of energy. My mood is a bit brighter. I am able to focus on my calculus now, and I am doing okay at solving the problems. I feel no side effects yet.\r\n5:30 AM  The effects are still building. I did eat quite a bit about midnight after not eating all day. I also had a bit to eat before eating the cotton. Maybe it is slowing the absorption. I am awake and alert, and feeling a light, gentle euphoria. My studying is going well. I am making good progress on certain things which I did not adequately understand. I just hope I am ready for the test.\r\n6:15 AM  I eat another 10mg of the l-methamphetamine. The effects of the first dose seem to have peaked. I am wide awake and feeling nice! It is better than I expected. It has definitely been a great tool for this study session. There is no way I would be able to pass the test in the state I was in earlier. I feel no side effects or anxiety.\r\n6:45 AM  I just finished with my studying and now I take a shower. I have a 42 mile drive to class. The shower seems more invigorating and sensual than usual. Perhaps it is because I am feeling good and awake, instead of the usual tiredness and stress I normally feel in the morning. It just feels really good this morning. I am starting to feel the second dose kicking in. I feel an ever so slight chill run through my body. It is pleasant.\r\n7:10 AM  It is time to go. I get my stuff together for class, get to my car, and drive off. I am now feeling very alert. I came a bit close to having a crash last night, possibly from the sleep deprivation. I know it seemed harder to drive and I felt like I could just fall asleep at moments. That is not a problem this morning.\r\nI am now feeling a stronger euphoria. I attribute it to the poppies I thought I ate after grinding them earlier. They are actually still in a cup at the head of my bed. Is the l-methamphetamine causing the euphoria on its own, or is it placebo from expecting the poppies to kick in? I dont know. I am feeling quite a bit of tingling feelings and chills running through my body. This is a very pleasant sensation. It is a bit like the feeling I got over my body when I tried MDMA.\r\n8:00 AM  I am at class, now the test begins. I am still feeling very good, but also anxious over the test. I spend the next 90 minutes solving calculus problems. I did terrible on my last test. I am definitely doing better this time. I think I will end up with a B or a C, not the A I was hoping for. The alertness and mental clarity I got from the l-meth has definitely been a great help though. I am sure I would have gotten an F otherwise.\r\n9:30 AM  It is wearing off now. Class is over. I still feel pretty good, but the alertness and energy are starting to subside. It doesnt matter now, it has fulfilled its purpose.\r\n10:15 AM  I am starting to feel tired. I decide to skip my next class. It will not hurt my grade. Now it is time to drive home. I have no trouble with driving home. There is still enough of an effect to keep me from feeling exhausted. The euphoria and pleasant body feelings are gone.\r\n12:00 PM  I got home a little while ago. The effects have worn off. I decide to go to sleep, and then get up at 3:30PM feeling a bit sick from missing that poppy dose.\r\nIn conclusion, I found l-methamphetamine to be a worthwhile and readily obtainable stimulant. For me, it was excellent as a study aid. It probably helped me with driving, considering I was so sleep deprived. I felt no side effects at all from this and would like to try it at a higher dose. I would choose it over any stimulant I have tried, with the exception of amphetamine(adderall). I could see this possibly being just as good as adderall at a higher dose. Ive only tried this and Adderall one time each, so it is hard to make a comparison.\n\n\n"
}