{
 "title": "Warning: Have Respect For This Substance",
 "author": "Pain",
 "citation": " Pain. \"Warning: Have Respect For This Substance: experience with 2C-I (ID 69910)\". Erowid.org. Sep 18, 2008. erowid.org/exp/69910",
 "substance": "2C-I",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2008",
   "69910",
   "Male",
   "",
   "Not Given",
   "Sep 18, 2008",
   "9299",
   " "
  ]
 ],
 "report": "<p>Yesterday I had my first experience with 2c-i. Boy was I in for a unexpected journey. To give you a background, I am an experienced user having taken LSD, MDMA (press pills and molly), Ketamine, Mescaline, Mushrooms as well as all your other standard drugs such as weed, coke, heroin etc. I am glad I handled such a journey as it has been awhile since I have tripped or used any kind of drug for that matter. </p><p>I received some 2c-i from a confidential source yesterday about noon. I carefully weighed out 20 mg and simply licked the scale. I chased it down with some coffee and began my day. In approximately an hour I started to feel the chemical take hold. The sickening feeling in my stomach was noted as the visual distortions arrived. This reminded me much of the onset of LSD and was quite similar but not exactly the same. </p><p>About 2 hours in I realized that there was no way that I could go out in public on this because I was thoroughly ripping hard. I started having thoughts of my childhood and was thinking of the first girl I had ever loved. At that moment the phone rang, it was Girl A that I have recently met and am very attracted to. I knew that we were supposed to go out but I figured she wouldn't call. But it was her. Knowing full well the condition I was in I let the answering machine get it. </p><p>By now approximately 3 hours in, I had to anchor myself to reality by watching and listening to music and music videos. I noted how I could understand every word they were saying and felt the individual style and flavor that each song and artist possesed. I was dissapointed that I threw away a date with someone whom I really wanted to be with.</p><p>At about 3 hours I reached a plateau that lasted a good 4 hours then slowly started to come down. The closed eye visuals were absolutely amazing, with sharp, bright waves and patterns of different colors occured. I felt emotional on this drug and at one point even cried over some unresolved issues that came to the surface. </p><p>I feel that this drug helped me to deal with problems that have been bothering me, however if I had it to do over, I wouldn't have gone this route to do it. At 8pm the phone rings again, this time its Girl B that had been over to watch movies the day before. Eight hours in and I still couldn't bring myself to answer the phone, so again the answering machine picks up. She leaves her new phone # and asks where I am. Girl B is a sure thing, but I find myself being selfish and not wanting to get involved with someone who has a daughter. I told her the day previous that we could only be friends.</p><p>I must stress that this is a most powerful substance and is not to be taken lightly. The incredibly small amount that I did, had me holding on to my sanity. If not for previous strong psychedelic experiences I don't know if I could have handled it. If I don't flush whatever I have left, I will definitely reduce the amount I took by half. This is not a drug to drive or operate machinery on and I suggest a friend be with you if you do try it.  I was to the point where I just wanted it to end. I have read that this lasts 6-8 hours, but for me after 12 hours I was still under the influence and managed to sleep.</p><p>Now writing this the next day, I am finally starting to feel better. I was completely nauseated the whole time and the next morning. Finally the nausea has left but a headache has taken its place. I was also sweating and then cold, never finding a comfortable temperature to be at. So use at your own risk,  be careful psychonauts! Happy Tripping!</p>"
}
