{
 "title": "The Pot-Luck Weekend",
 "author": "Trichotomy",
 "citation": "   Trichotomy. \"The Pot-Luck Weekend: experience with Cannabis (ID 69926)\". Erowid.org. May 12, 2010. erowid.org/exp/69926",
 "substance": "Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "5 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 69926",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 12, 2010",
   "Views: 3234",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have recorded this journal to chronicle a particularly fun weed-smoking experience, display a safe and fun way for novices to sample and experience grass, and demonstrate the diversity of modern marijuana.</p><p>I'm a relatively new toker of only about a year but, I've somehow managed to become my brother's and friends' resident reefer guru. I invite them up to my college dorm (smoking section, of course) a few times a month to sleep over, play some video games, walk the city, groove to music, have dinner, and of course, taste the cheeba. For this particular story, I'll refer to the three involved by their favorite foods; Chips, Ramen, and Burger.</p><p>One weekend, there was some confusion as to whose turn it was to provide the grass, and all of us brought our own baggies to my dorm. Chips and Burger chipped in and brought two dimes (about one gram each) of a dry cannabis that smelled strongly of oregano. Ramen had a dub (about two grams) of a scraggly but pungent cannabis we had bought from a city dealer a few weeks earlier. I had an eighth-ounce (about 3 grams) of a moist, seedy, faintly sweet-smelling cannabis Ramen and I had just picked up from a friend of the dealer. The end result was that we had a veritable buffet of cannabis to sample, which we jokingly referred to as a pot-luck. We decided to try each variety separately to experience the entire gamut.</p><p>The weed Chips and Burger brought up smelled intensely savory and herbal, to the point where we weren't sure if it was even real cannabis. We decided to test it first. I ground one dime, about a gram, in an aluminum grinder and loosely packed it into a clean glass pipe. It was surprisingly smooth to hit, and each of us extracted two decent tokes before the ash plunged into the pipe. I have a notoriously low tolerance and immediately felt a subtle buzz, but even after about ten minutes, my friends hadn't experienced even the slightest tingle. We decided to set off to McDonalds to grab dinner.</p><p>Under normal pot-smoking circumstances, I have a tough time stringing together even the simplest of sentences, but I was babbling on the walk. I'm not sure if it was because the grass was weak or I hadn't taken enough tokes, but I had a nice head rush and general positive feelings that subtly crept in and lasted for the entire walk. Chips and Ramen noticed the grass kicking in about halfway through the walk, and Burger seemed to be hit full-force midway through ordering, and bought two entire meals. We finished our food fairly quickly; I still had a decent sense of time and judgment.</p><p>While we walked back to the campus, we contemplated which variety we would try next. Chips, my brother, is younger than me but at least two inches taller and probably twenty pounds heavier, and takes a tremendous amount of weed to make significantly stoned. Ramen takes a moderate amount of weed to achieve a satisfactory stone but easily smokes too much and ends up in a silent, introspective mode with occasional weird mutterings. At one point, Burger smoked an absolutely astronomical amount of weed, eventually quitting after he was caught carrying three pounds of the stuff; he was still difficult to make significantly high. I drained my McDonalds drink and used the ice to assemble a frosty bong (water pipe) with a generous bowl of my aromatic grass. </p><p>I always test a small amount of weed after I buy it from my city connection, as the quality varies wildly and without explanation. This particular dealer has supplied me with everything from cheap, granular schwag that delivered a trashy buzz to authentic Purple Haze that literally glistened with trichomes and left Ramen and I with a stupefying high. The sample I tried gave me a unique high that rendered me a giggling mess for hours, and I couldn't wait to test it on the bong.</p><p>I took the first hit and was surprised at the sweetness and smoothness of the smoke. Ramen took the next one and coughed like a maniac; wheezing, he passed it to Chips, who drew off a large plume and also started coughing and belching. Even Burger succumbed, coughing like an asthmatic after he took a thick pull. This was particularly surprising; Burger was a guy who regularly smoked joints the size of carrots and carried his pipe more often than his wallet. I took another draw and was floored by the surprisingly scorching vapors. Soon, the room was literally rattling in a cacophony of coughing that drowned out Ramen's favorite electronic music.</p><p>Suddenly, Burger stopped coughing, sat bolt upright, withdrew his eponymous sandwich from his jacket, and started devouring it. Halfway through the last bite, he looked at the last morsel and started laughing his head off. Ramen, Chips, and I looked at Burger, then at each other, and burst into maniacal laughter as well. We clowned around for a while, making stupid faces at each other and watching Burger become progressively more stoned. At some point, one of us refilled the water jug and we passed it around; Burger held it in his arms and stuck his tongue into the bottle, apparently forgetting how to drink. Chips attempted to tug it from his arms, but Burger drew it closer and muttered, 'My baby!' </p><p>Amid our insane laughter, we managed to set up the movie Grandma's Boy on my laptop, and watched as we tried to think of a way to finish the night. Finally, the idea struck us as the movie reached one of its most famous scenes; the main character tells his pot-smoking buddy to roll his myriad marijuanas into one joint. We paused the movie, looked at each other with lunatic grins, laughed our heads off, and reached for the King-Size Rizla rolling papers, rolling machine, and grinder. We mixed up equal parts of Chips' and Burger's savory weed, my laughter-inducing weed, and Ramen's mind-numbing weed with a pinch of tobacco from one of Ramen's Camels, and rolled it into a long, chubby spliff.</p><p>I ignited and passed the potent composite cigarette in one direction and the water jug in the other; the wafting aroma of the mellowing mix, the atmospheric electronic music, the greasy but comforting scent of cheap college food, and the strains of great conversation filled the room as we lay back and let the marijuana's effects wash over us. After a while, the conversation unravelled, the album drew to a close, and the pot's power caused us to sway as we fought its soporific effects. Finally, I switched off the light, Ramen left for his dorm, and I drifted off into sleep. </p><p>We woke up late the next day, still mellowed, and spent at least an hour talking about our blazed shenigans, comparing and contrasting the different smokes. We decided that every time we toke together, we'll all bring a different flavor to the table. I can't wait to see what unique strains the next pot-luck brings!</p>"
}
