{
 "title": "Got Drunk With Less Alcohol",
 "author": "Daniiil",
 "citation": "   Daniiil. \"Got Drunk With Less Alcohol: experience with Oxycodone (Oxycontin), Alcohol (Vodka) & Amphetamines (Adderall) (ID 69966)\". Erowid.org. May 24, 2008. erowid.org/exp/69966",
 "substance": "Oxycodone (Oxycontin), Alcohol (Vodka) & Amphetamines (Adderall)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Pharms - Oxycodone",
   "(ground / crushed)",
   "  T+ 0:00",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 2:00",
   "20 mg",
   "oral",
   "Pharms - Oxycodone",
   "(pill / tablet)",
   "  T+ 2:00",
   "2 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "  T+ 2:30",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 2:30",
   "5 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 69966",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 24, 2008",
   "Views: 12689",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, the day started off with me mixing 10 mg of oxy into a 2 shots of vodka. It was fine, not feeling anything too special but being cautious I ended up waiting about 2 hours to see if anything happened. Well all it did was get me more drunk with less alcohol, and I have high tolerance.<br>After 2 hours passed I take 20 more mg of oxycontin and start to drink vodka, after about 30 min I'm feeling a mixture of drunkness and euphoria. I've had around 200ml of vodka at that point. At this point I take some adderall, don't really know what it did since it was the first time I tried it but I received an energy boost shortly after taking it. I continue to drink and ended up with around a half litre and being tipsy, which is a great thing for me since it takes much much much more alcohol for me to feel tipsy. <br>This was a great way for me to feel alcohol again and I loved and cherished every moment of it.\n\n\n"
}
