{
 "title": "Fine Line Dosing and AMT",
 "author": "Delicate Delights",
 "citation": "Citation:   Delicate Delights. \"Fine Line Dosing and AMT: experience with AMT (ID 7001)\". Erowid.org. May 24, 2001. erowid.org/exp/7001",
 "substance": "AMT",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7001",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 24, 2001",
   "Views: 27566",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nDose: \t\t50mg, Orally in Gel cap, 240lb male.\r\nTime:\t\t6PM on a Saturday\r\nOnset:\t\t9 PM\r\nPeak:\t\t1 - 2 AM\r\nVenue:\t\tA large party.\r\nWell kick my ass and call me Edna.  This was the 3rd time I've tried AMT, and the first time I've hit a dose that has had the effects all the kids have claimed for it.  And boy howdy, what a dose.\r\nAs per usual, the onset took a while.  I never felt ill during ramp-up, but I also took some non-drowsy Dramamine about thirty minutes prior to dosing, and that helped.  However, later on that evening I did feel a bit queasy, though this may have had more to do with the copious amount of water I was drinking than my reaction to the drug.  I would be interested in trying this again after a fast, as having a full stomach and, well, other lower organs did make for some panicky moments later on in the evening.\r\nAfter ramp-up and for the rest of the night, it was all I could do to maintain my hydration.  AMT worked my body extremely hard.  Muscle tremors, especially in the legs, kept me vibrating all night, as well as the occasional cold shivers.  As I got further and further into the trip, it became harder and harder for me to focus my eyes, and as the peak came on, I quit trying and just drifted back and kept them closed.  There was also the expected jaw clenching.  \r\nAs my heart raced towards the peak, so did my mind.  I found myself capable of very fast speech, with ideas and connections cascading through mind at rates that were bordering on unexplainable to the outside world.  After a certain point, about 1AM, I lost the ability to speak or track conversations at all.  I sat in the main room and drifted away completely from my surroundings, and only after persistent naming by those around was I able to come back.  Even then I would drift off again quite soon after.\r\nOn an internal mind basis I found it to be very ego lowering.  While I was concerned about how I was appearing to others, both in speech and action, it was more due to being worried about offending someone with stupidity than impressing them with wit.  It also made it very hard to respond to being hit on, as I was coherent enough to understand what was happening, but also detached from any kind of investment or overwhelming interest in carrying a playful entendre conversation to its logical conclusion.  Strangely though, at least until I lost the ability to speak, I found myself very gregarious, but unable to completely focus on the conversation occurring, so I would drift from place to place and conversation to conversation, but still found the act of speaking to be very enjoyable.  Not a bad thing to do at a party. But somewhat upsetting if one is trying to maintain a conversation with a specific individual.\r\nI did feel affectionate towards people, I was not struck with an overwhelming need to touch them or be touched, though when it did occur it felt really good, giving me goose bumps and a want for more.  But when you are sweaty and shivery its difficult to get next to people anyway.\r\nTowards the middle of the peak my motor skills definitely started to leave me.  Stumbling back and forth from the bathroom, the water faucet, and the couch became somewhat difficult.  I also began to notice how abjectly tired I was becoming, as each time getting up became harder and harder to do, with a complete body lethargy setting in after a while.\r\nIn conjunction with this is the fact that while I was able to maintain myself over the course of the trip, I was tripping much harder than I had expected to be from past experience with the drug at 35 and 45mg doses.  Since both of those trips were definitely threshold, I was somewhat surprised to find that 50 was so much more over the top.  Apparently AMT has very fine lines between threshold and trip doses.  Something I will keep in mind for future experimentation.  If I had known, I probably would have chosen a different substance, or at least a lower dosage, for a party venue.  As it was, it was very hard to get across to people that while I was tripping much harder than I expected, I wasn't tripping too hard.\r\nOn the other hand, it was intensely pretty.  All the colors and swirls you could expect.  No alien beings though, which, as usual, I found very disappointing.\r\nI did try and smoke some pot to bring down a bit of the tension I was feeling, but other than the great taste of the Dank, it seemed to have little effect.\r\nComing down was hard and sudden.  I was down and sleeping by about 4AM and slept till 3PM the next afternoon, but was also up and going to the bathroom about every hour or so.  I continued sweating very hard throughout the night as I slept and my body worked out more of the drug.  Even after I awoke I was very disconnected from my surroundings and the people within them.  I did not achieve real coherency or hydration again until Monday evening.  Though I did feel loose and at ease for the rest of the day.  Bordering on content, though that may have had more to do with a sense of 'I survived' than anything else.\r\nThis may or may not have a connection with the AMT, but both Sunday and Monday nights were very dream intensive, bordering on nightmare intensity, all involving people and places that I have not thought of in quite some time.  A few days later, I still find myself flashing on memories of events and places, quite clear and crisp, that have not surfaced in years, even decades.  So if that is related to the AMT, I can see how it might be a helpful tool to unblock the mind.  \r\nAll in all, it was a very interesting and intense trip, bordering, occasionally, on the overwhelming.  However, I wouldn't mind doing this again in quieter surroundings with fewer people and a slightly lower dose.  The sheer number of people around me combined with the noise and tumult of a party overwhelmed me in cyclic waves, and I found myself outside in the plain hallway much more often than inside at a the party, or on the dance floor.  Additionally, I'd prefer to do this early in the morning after waking, allowing myself to be fully rested before ramping up, instead of doing this at the tail end of a busy day.  \r\nAddendum:\r\nIt's now 2 days later, and as some others have mentioned, my chronic depression seems to have drifted away, though I can still feel it curled in the background.\n\n\n"
}