{
 "title": "A Strange, Strange Evening",
 "author": "Dredwright",
 "citation": "   Dredwright. \"A Strange, Strange Evening: experience with San Pedro & Cannabis (ID 7002)\". Erowid.org. Apr 28, 2002. erowid.org/exp/7002",
 "substance": "San Pedro & Cannabis",
 "bodyweight": "138 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cacti - T. pachanoi",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7002",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 28, 2002",
   "Views: 13765",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis account describes my first ever experience with San Pedro Cactus. I am relative beginner to strong hallucinogens, having taken LSD several times and psilocybe mushrooms once.</p><p>Me and my friend (who I shall call RH) decided that we would try San Pedro right after our hight school graduation and then trip at the all-night graduation party. So a few days before the event we went to Lowes home and garden center and each bought a San Pedro cactus, about 11 inches high and about 2 inches in diameter. After removing the skin and spines we cut off the green flesh and blended it into a thick liquid, and divided it into 2 bottles for drinking. After graduation we got well toasted and went to the park to drink the stuff down (in case we vomited). I whipped out my bottle and got most of the stuff (about a cup and a half) down in the first gulp. This stuff really does taste like shit. You have been warned. Unable to finish the rest, I just dumped it out. RH managed to get about 3/4 of it down, so we piled back into the car and headed off to the party. </p><p>The party involved everyone in our graduating class (many of whom I had never seen before) running around in the district 7th and 8th grade center, where I had never been before. I still had the awfull cactus taste in my mouth, but I was not sick and I was still too stoned to really notice any unpleasant sensations. So they shoved us through the turnstiles, and turned us loose inside. About an hour into it we began to feel some effects: mostly a slight euphoric sensation and very mild visuals like tracers and the familiar moving patterns and textures. These effects continued to intensify for about another two hours, along with what would become the most prominent aspect of the trip: a profound sense of stangeness in spacial orientation and social interaction. I felt like an invisible observer wandering from room to room of this huge school, and common situations all of a sudden seemed quite bizzare and hopelessly illogical. It was fun though, and me and RH just kept looking at each other and laughing. No serious visuals ever developed, but I experienced an abundance of tracers and after-images. For example, if I was looking at someone and I moved my head, I would see a fairly vivid image of the person standing right next to the actual person. </p><p>As the party wore on, I became more and more tired and gradually became delerious to the point where it was impossible to distingush the effects of the cactus from my own delerium. At 5:00 AM they released us from the party and I went home and slept for 8 hrs. I awoke feeling normal.</p><p>I plan to try this again, since I imagine I got a fairly low mescaline dose. My experience was not near as spectacular as LSD, but just as fucked up in its own special way. Definitely interesting.</p>"
}
