{
 "title": "Never Thought It Would Work",
 "author": "Standy",
 "citation": "   Standy. \"Never Thought It Would Work: experience with Phenytoin (Dilantin) (ID 70148)\". Erowid.org. May 19, 2008. erowid.org/exp/70148",
 "substance": "Phenytoin (Dilantin)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Phenytoin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 70148",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 19, 2008",
   "Views: 5634",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was recently prescribed phenytoin to control seizures that I had been having in the past year. It's worked perfectly for keeping the seizures under control and I've been seizure free ever since my first dose over a year ago. Upon some investigation of the drug I'd read that there were reports of it apparently helping with cognitive function, concentration, memory and IQ. I didn't really believe these reports since I hadn't noticed any of these helpful side effects in myself, so on my next trip to the doctors I asked him about these side effects and how realistic it was of me to hope for them to work for me. He said for those kinds of effects to be noticed I'd have to up my dosage from 150mg/day to 300mg/day.\r\nI did this, and after about a week or two I really noticed a huge difference. My concentration was at an all time high, I was doing far better in school work and was getting homework done faster with less studying and I was far more accurate in my answers. I haven't stopped taking the drug yet and it should be noted that there are some pretty negative side effects reported with this drug, none of which I have ever experienced, and while this drug has worked wonders for my problem with seizures and has supremely helped my IQ, it also carries the risk of dependency and every few months I have to take a month off from taking it (doctor's orders) and eventually I will have to stop taking it altogether. I have noticed some drowsiness and alcohol only increases it. Other than that, I've had zero negative side effects from this drug. For informational purposes it should be noted that I'm a 23 year old male and 160 lbs.\n\n\n"
}
