{
 "title": "Norco Withdrawal Worse Than Expected",
 "author": "ExPothead",
 "citation": "   ExPothead. \"Norco Withdrawal Worse Than Expected: experience with Hydrocodone (ID 70150)\". Erowid.org. Jul 28, 2013. erowid.org/exp/70150",
 "substance": "Hydrocodone",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "Hydrocodone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 70150",
   "Male",
   " ",
   "Not Given",
   "Jul 28, 2013",
   "Views: 1552",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Im older than a lot of the readers here and you would think that I would know better, but yes, I admit now that I am addicted to Hydrocodone. </p><p>Ive had a long and semi-successful life of drug use over the years. Ive tried just about everything from Methamphetamine to LSD, most all of them for a lengthy time and on each of them, stopping was never a problem. I just stopped taking them. Which was where I went wrong. I thought addiction was just a state of mine and that I could say no to just about anything. Ah, such hubris.</p><p>Opiates are different. I know now that I can never dabble with them. And I have been lucky in that I discovered this fact before I got in too deep. Deep enough to drown in them. </p><p>I work for a company with a strict drug testing policy and having been a lifelong pot smoker. I had to give up my one major vice that I truly enjoyed. I so missed that warm pleasant high and I decided the thing that I could do (besides quitting a good job that I liked and paid well) was to take legal pharmaceuticals if I wanted that loving feeling. I could get a prescription to keep the company dogs off my ass. I had done various opiates in small quantities over the years and enjoyed occasional recreational use, so I knew what I had to do.</p><p>By far the easiest way was to find a doctor that would prescribe something fun for pain. Pain was certainly no problem. I had rotor cuff problems in my shoulder and back problem from a work related accident, so finding a doc with a big script pad and a helpful pen was not a problem. Even easier than that, my town is full of doctors that do nothing but pain management, which in reality a front for a major imported pill operation. So I got a copy of my x-ray, and took a trip to one a dealer friend of mine recommended. $60 and you got a script for 120 10/500 Hydros and 120 Somas (a muscle relaxer that works very well with the Hydro). </p><p>This went on for over a year. Once a month like clockwork I showed up. Picked up my script and went down the street to have it filled. But all things come to an end and so it did for my doctor friend when the Feds showed up and confiscated all of his records, including mine. I expected a knock on the door but it never came.</p><p>That left me high and dry but before the sun set I had found a different doc that although more legit, would prescribe me 60 Norcos a month for the shoulder pain. Not really enough, but again what was important was the script. Because my company couldnt touch me when Id come up hot on their little drug test. </p><p>A trip to a local dealer in town kept my real supply going. Which as is so often the case with opiates, kept getting larger and larger. And thankfully as I look back at it now, it was my dealer that got me to wake up to what I was getting myself into. He simply started jacking up the price of the Norcos to a level I couldnt see myself paying no matter how good the pills made me feel.</p><p>And, yeah, they did make me feel great. I was never more happy, more sociable, more energetic than when I had my little white friends. I was always introverted and Im sure some shrink somewhere would probably diagnose me with some depression or social anxiety condition if I was to ever break down and go to one. My little white friends broke those barriers for me. I made friends easier. I got more work done. More quality work. I went out more. I just felt tremendously better when on them. The pain in my shoulders and back went away. The neuropathy in my feet vanished. I wasnt doing enough of them to be big time euphoric or sloppy, but enough to feel good. And at the end of a rough day at work Id do a few more to relax and enjoy the evening with a nice beer and a buzz. Almost like the old days when I could burn a joint a enjoy life. </p><p>Id eat them. Id snort them. I started off with 20 mg per day. Then 40, then 60. Sometimes more. And then thank God I realized what I was doing. Even 60 mg wasnt giving me that loving feeling anymore. I just decided I needed to dry out for a while. Id been doing this for over two years, but something just told me it was time to back off. And I figured, whats the big deal? Id had no problem quitting any other drug in my life. Meth, downers, uppers. I just quit them and went on my way. So I just stopped. </p><p>The bad news hit me within 4 hours. The jitters and shakes. The muscle pains. A runny nose that wouldnt quit. Nausea, Diarrhea. The insomnia was horrible. I went for days like this and Id break down and go back to my little white friends. I go a couple days and get to feeling a little better and try again. And again within hours the same symptoms hit.  </p><p>I was holding down a full time job and still I had to function, but it was as though I had the flu. I ached. I couldnt sleep and went for days with no sleep. Id get chills. Then break out in a sweat. Then back to chills. I just kept telling my coworkers I had the flu. The worst thing was the jitters. Like restless leg syndrome, except it was my whole body. Especially in my arms and shoulders. But the worst thing was that it wouldnt go away. It just went on and on. I couldnt concentrate. I couldnt think of anything but how miserable I felt. My work suffered. My wife suffered. My dogs suffered.</p><p>And you know what? I felt like a big baby. Here I was on a relatively low dose of Hydro compared to a lot of the stories Ive read here. This wasnt even Heroin or something like that. Id only been up to 6 or 7 Norcos a day and even that wasnt everyday, sometimes it was only 4 or 5. I was totally unprepared for the amount of unpleasantness this little white pill was dishing out and couldnt imagine what a real hard core junkie must go through. </p><p>Finally I decided to go back to my little white friends and try to taper off gradually. And that has seemed to work. When I cut to three, I still felt like shit. Same symptoms, but not as bad. I did that for a week. Im down to 2 a day and will probably be clean by the end of the week, God willing. Most of the bad feelings are gone as long as I stay active. Sleep is still a bitch and Xanax doesnt help me a bit. I lie away staring at the ceiling at night. The shoulder pain and the neuropathy have come back. My feet feel like they are on fire most of the time. But I see the light at the end of long and unpleasant tunnel. And my little foray into Opiates has taught me a valuable lesson.  The fun Ive had with them is not worth the level of unpleasantness Ive had to deal with to get loose of their grip. Ive been so lucky that I didnt have to learn this lesson on higher levels of Hydro, or heaven forbid some other stronger opioid.</p>"
}
