{
 "title": "Using DMSO for Transdermal Administration",
 "author": "Enesi/Xenonsion",
 "citation": "Citation:   Enesi/Xenonsion. \"Using DMSO for Transdermal Administration: experience with DMT & DMSO (ID 70238)\". Erowid.org. Sep 23, 2008. erowid.org/exp/70238",
 "substance": "DMT & DMSO",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "transdermal",
   "DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 70238",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2008",
   "Views: 6756",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe experiment-Evaluate DMT administration via DMSO application through the skin.\r\nTo start off, DMSO is a very unique chemical. It is a low toxicity commercial solvent that will dissolve a number of polar and non-polar substances. And has the unique ability to absorb directly through the skin, carrying with it other substances. You can learn more by an online search of course, I'll keep this brief.\r\nSo i acquired some 99.9% pure DMSO. And diluted it down to around 80%. This level has been found to work better then 99.9% pure. I started out with a low dose of freebase, 5mg dissolved into just a few drops of DMSO. Applied to the wrist, no effects noted. \r\nContinued all the way to 75mg with no effects being felt. DMT dissolves very easily in DMSO. Also it irritates the skin quite a bit. Leaving a red rash, or a sore arm for the rest of the day. This seems to subside as you use DMSO more and more.\r\nThe freebase did not work at all, so I made some DMT in the salt form and applied 50mg dose to the skin on the forearm. Slight irritation was observed, but less so then the freebase. The only effects I felt were a slight increase in heartrate after about 5 min. This could have been caused by either the DMT, or just normal anxiety. \r\nTo conclude, DMT dissolved into DMSO (freebase or salt) does not appear to be an effective method for adminstering the substance.\n\n\n"
}