{
 "title": "Vicodin Happy",
 "author": "Chris M",
 "citation": "   Chris M. \"Vicodin Happy: experience with Hydrocodone (ID 7039)\". Erowid.org. Jun 17, 2002. erowid.org/exp/7039",
 "substance": "Hydrocodone",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7039",
   "Male",
   " ",
   "Not Given",
   "Jun 17, 2002",
   "180097",
   " "
  ]
 ],
 "report": "<p>Summary:</p><p>Today I bought 10 Vicodin 5/500 pills for 10 bucks. I usually buy the generic 10mg of hydrocodone and 660mg of acetaminophen. Prior to taking these pills I decided to not eat anything for 8 hours and not drinking anything with acid in it (such as soda) to keep my stomach acid level low so the Vicodin would last alot longer.</p><p>Note: If it's your first time or are sensitive to opiates I suggest you take the Vicodin with a little somthing to eat to prevent nausea and vomiting.</p><p>Experience:</p><p>5:30pm: I took 4 of the vicodin breaking them in half and swallowing all the halves as quickly as possible (20 mg total) without choking. At this time I am sober and feeling great! No stress, no problems just ready for a great time!</p><p>5:42pm: The effects have kicked in already with no nausea. I am at the coming up part of this narcotic buzz. I feel an increasing euphoria, a little numb, im a little cloudy headed, and feel like talking a bunch to anyone even to the people I hate. I think i'll go talk to my sister and I will be back as soon as the peak arrives.</p><p>6:10pm: The Vicodin has peaked! I am totally blasted out of my mind! feel intense euphoria, slurred speech, I'm cloudy headed, numbness, orgasmic senses, relaxation, and I feel like I'm on top of the world. I'm going to go eat some french dip now for dinner, I'm so excited now! I LOVE EVERYONE!</p><p>7:45pm: I am now coming down with no nausea, no vomiting, no downer feeling, nothing! My mind is still swimming with joy, but a coming down euphoria, a slight feeling of drowsiness, and complete relaxation!</p><p>8:35pm: The Hydrocodone has worn off totally except for the relaxation that will last until the morning. This was another great experience one of the best since when I broke my leg and they shot me up with Morphine at the hospital. </p><p>Comparing:</p><p>Vicodin at the dose I have taken is compared to a low dose of Heroin or demerol. The peak of this experiance was a cross between Marijuana, E, and Cocaine. The hydrocodone high is like a cocaine high, the happy feeling and loving everyone is like the E's 'hug everyone' feeling and the cloudy and relaxation is like pot's.</p><p>Recomendations:</p><p>   I recommend that people trying Hydrocodone for the first time take it with a small meal and not redose within 5-6 hours of taking your initial dose. You should always start off with a small dose and gradually work your way up. If you do these simple things you have a better chance of not overdosing or getting nausea. Also if you break the pill in half and take them I find that the high last a little longer than normal. I would not recommend this drug for repeated recreational use because of how addicting it can be and how fast you can build up a tolerance to this shit. Anyway if you do try this be safe and have fun.</p>"
}
