{
 "title": "Not in Kansas Anymore",
 "author": "Jose Montano",
 "citation": "   Jose Montano. \"Not in Kansas Anymore: experience with Dramamine (ID 7042)\". Erowid.org. Nov 18, 2002. erowid.org/exp/7042",
 "substance": "Dramamine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7042",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 18, 2002",
   "Views: 12066",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had tripped dramamine the day before, and wasn't feeling the effects.  I met up later that day with my friend who was about to move, we'll call him Tone.  After some research to see the dangers of taking it 2 days in a row (it seemed safe enough), we decided on doing 24 each, for two reasons: (1) I had tripped 12 twice before and had tripped nicely but not as hard as of reported incidents and (2) Tone was moving and he wanted to remember (he can't...heh) this day.  </p><p>We got 48 Dramamine from CVS and took them all, 24 each.  It started FAST, much faster than it had previously.  I can remember the stages until hallucinations vividly:  My hands became numb, and I felt like I had just smoked a bowl.  My feet were numb next and I became very drowsy.  We had worked our way to Burger King and were just sitting...doing nothing.  We decided we should get somewhere calm and normal to trip at so walked back to my house.  My friend 'M' left at this time, but while we were walking home Tone kept having conversations with him, and asking me where he went when he dissapeared.  </p><p>Tone was feeling it much more than I was at the moment.  We both collapsed on my bed in my room and Tone's face begin to morph constantly (the only thing out of the entire trip I would compare to acid).  The fake clock on my wall begin to tick (both audibly and visually) and Tone thought a spider design was a real spider.  It took me and two other people quite a while to convince him otherwise.</p><p>As one of the side-effects of such a high dose is drowsiness.  I can remember only details of things and in no chronological order from here on out, because the tripping started hard now.</p><p>I remember talking to people and having them dissapear and having nobody understand a word I was saying.</p><p>Cottonmouth...the worst I've ever had...left me with literally no spit.</p><p>On our second trip to Burger King, 'K' convinced me to try and write a letter to myself, this is what it says: 'Hello I am dripping...I just bipping i mean tripping' and I then forgot I was writing.  I found this is my pocket a day later and can barely read it at all.</p><p>Muscle spasms were a constant annoyance, and I'm not sure how close to trouble I was getting with this high of a dose, but muscle spasms were frequent in the middle of the trip.</p><p>Tone kept losing things he never had in the first place.  I can't remember how many times he'd stop walking and stare at the ground mumbling 'where did it go?'</p><p>I talked to my parents about drugs and got onto the topic of football(!?).  Both me and Tone's sentences and thought processes were completely non-sensical.</p><p>I had a bit of a hangover the next day, and my hands started feeling numb when I smoked a cigarette that day, as did Tone's.</p>"
}
