{
 "title": "Nice, Mellow Combo",
 "author": "Wicca Princess",
 "citation": "Citation:   Wicca Princess. \"Nice, Mellow Combo: experience with Calea zacatachichi,  Damiana, Passion Flower & Red Wine (ID 70476)\". Erowid.org. Apr 17, 2008. erowid.org/exp/70476",
 "substance": "Calea zacatachichi,  Damiana, Passion Flower & Red Wine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Calea zacatechichi",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Damiana",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Passion Flower",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 70476",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 17, 2008",
   "Views: 9077",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLet me preface everything by saying Im not a prolific smoker of anythingIve never once smoked tobacco (hate the smell), so take my experiences with a grain of salt.  Im lucking if I can hold it in for 15 secs.\r\nWeekends are the one chance I have to relax after working news the whole week.   I became interested in Calea b/c I heard it would help induce dreams.  Although, honestly, I've never had that experience with it.  \r\nWithout getting overly technical about measurements, I basically just dumped all three into the bowl of my Hookah and chased it with some red wine since I have sinus problems and ANY smoke tends to set my sinuses (internal) on fire. I also put on some mellow new age music and found myself very relaxed after about 5 mins.  Occasionally, dizzy even (in a good way).  I'm can't vouch for the psychedelic effect others have had, but I did feel a nice, pleasing mellow buzz.  For all I know that could have been the deprivation of oxygen, but if it is, dont tell me.  I kinda like the mellow feelingputs a smile on my face.  But no sleepiness.\r\nNow, I'd been drinking the wine for about 30 mins. before and had my usual wine buzz.  But this definitely enhanced the feeling.  I could feel a slight motor effect, so fortunately I had no plans to travel.\r\nAll in all it was a pleasant mild high, with no lapse in mental clarity.  I think my typing may have even improved (badly needed).  Not to mention the smoke helped me hock up a bunch of nastiness collecting in my lungs all week. So Id give this occasional herbal experience a mild thumbs up.  Good for relaxing.\n\n\n"
}