{
 "title": "Feeling Good in a Very Real Way",
 "author": "NitrousAcid",
 "citation": "   NitrousAcid. \"Feeling Good in a Very Real Way: experience with 4-Methylmethcathinone (ID 70486)\". Erowid.org. Dec 18, 2008. erowid.org/exp/70486",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2007",
   "70486",
   "Male",
   " ",
   "Not Given",
   "Dec 18, 2008",
   "Views: 11519",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First a bit of info about myself:</p><p>I am a bit of a speed freak I often do speed to be more social and more concentrated I have tried pure MDMA a couple of times and ecstasy a few times and a lot of hallucinogens and opiates/opioids. I often do stimulants to enhance my social abilities and to have fun, my favorite type of drugs are psychedelics since they really helped me to see life from other perspectives.</p><p>The 4-Methylmethcathinone exprience:</p><p>After hearing lots of positive things about a substance called Mephedrone (Aka. 4-Methylmethcathinone or 2-Methylamino-1-p-tolylpropan-1-one) me and my friend decided to order some from one of the smart shops that sold it as a alternative to illegal drugs, they described the effect as a mix of amphetamine and mdma.</p><p>The same day I received the package containing the substance I felt very eager to try it out, I realized that the name 'mephedrone' was probably just taken right out of the air to sell better because I would probably call it 4-Methylmethcathinone anyways, I slitted up about a g each in to two zip locks and used a razor blade to clean out the knife used to move the powder, I noticed there was very much 'stones' (compressed powder) in the powder, so the chance it would contain something more than just 'mephedrone' was fairly small.</p><p>I started by snorting the rests of powder from the knife.</p><p>After about 5 minutes I started to feel the first vibes, it was a very amphetamine like upcome with a scene of total wellbeing, I was in a very pleasant mood and the music sounded better than ever, I had promised myself to study some because I had a test the very next day, so I tried to study but it was so hard to sit still I just wanted to dance, it was a very nice feeling.</p><p>After about 15 minutes the experience reached its peak, it was a very nice rush, it was a wonderful, by this time the rush was more of a mdma kind of rush, but without the very exaggerated feeling of well being, I was feeling very good but in a very real way. The time went on very fast and I had a very pleasant evening.</p><p>After a about an hour or two I took some more and went on for a few more hours.</p><p>I didn't feel bad afterwards which I usually do after taking amphetamine or mdma, I did feel very nice, a feeling not far from the one I get after a acid trip it feels almost that I was reborn, I felt very good.</p><p>I kept on taking it for a few more days, until one night when I took very much like 600-700mg the worst after effect was like a hangover I just felt a bit dried out.</p><p>No signs of abstinence</p>"
}
