{
 "title": "Initial Impressions (What the Hell is Going On?)",
 "author": "RWatson",
 "citation": "   RWatson. \"Initial Impressions (What the Hell is Going On?): experience with DMT (ID 70549)\". Erowid.org. Feb 17, 2009. erowid.org/exp/70549",
 "substance": "DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 70549",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 17, 2009",
   "Views: 10935",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was going through my notebook and found my personal notes on my DMT experiences, so I thought Id share.  I had made the DMT myself, and believed it to be of good quality (whitish-yellow shiny spiky crystals).  I was smoking out of a pipe on top of just enough cannabis (Tip #1: I use a bong.  Not only is this a superior delivery system, but also my pipe was infused with DMT, and from then on unable to deliver a nice smooth, relaxing cannabis high.)  I used the loop-end of a bobby pin as a scoop: two heaping scoops was one hit.</p><p>One hit: Held in until there was a visual fix, the frame of vision suddenly annunciated, locked for a pause. Visual field dances.  Back of neck, jaw, lymph nodes, inner ear hurts.  There is the distinct feeling that the body has layers, or that there is only a top layer and inside is one large, distinct middle one filled with void, where things are happening.  A kind of salvia scratch and it definitely feels invasive, like a thought coming into my mind which is already aware.  [I am] aware of heartbeat and breathing in particular.  Feels like mushrooms the way the ceiling sags and the knees go weak.  No red or gold tones.  If there is a presence invading my mind, I am more than likely anthropomorphosizing it.  </p><p>1 Hr. later, to test tolerance: Palms sweaty, body feels very thin, akin to mushrooms.  I could be on a low dose of mushrooms right now. Pressure on the body. It feels like the surface is all that is present of the body (except for face/neck/throat, which hurt.  The sense of being in a room(s) just watching visual laces and colors and motifs. The visuals have their own nature distinct from other hallucinogens.  Coming out there was a peculiar sense of pressure on the head and chest like it was being pulled, like gravity changed direction on very selective parts of me.  Often like being deep underwater, or under several atmospheres.  </p><p>After two hits:  The feeling of music, motion beside me, lighting, CE/OE visuals, and furniture in the room become indistinguishable.  Is that a different color? It might just as well be the noise outside, or else that noise is just the lingering smell of DMT.  Again, the feeling of moving from room to room.  The body is registered, but as unimportant.  It definitely feels hollow and unnecessary to carry this experience.  Sometime after it peaks there is a confusion in my mind, which, after some degree of prying, usually turns out to be my lips.  I cant help but feel like the visuals are getting in the way.  They arent nearly bright or grandiose enough on their own for me to endure the physical and mental toll.  If DMT is imparting any information, its on a level deeper than this.</p><p>Thats all I had written, but most of my experiences with DMT can be put like this:  What the hell is going on?  I think Imyes, Im looking at something.  What is it? Something is being built, pieced together, layer-by-layer.  It looks like a noise.  No, but there is a sound like the world is undergoing an audiometric test.  Oh, wait, those are my ears.  I can feel the couch now.  Oh, thats what was being constructed:  That and the lamp and the carpet and the walls and wind on windows and airplanes and breathing and moments in time and everything!</p><p>Afterwards, my face and brain always hurt, but its usually worth it.  DMT is as demanding as it is fascinating (but physically safe, as I understand it), so stay smart and happy exploration!</p>"
}
