{
 "title": "Hypersensitivity",
 "author": "Miker",
 "citation": "   Miker. \"Hypersensitivity: experience with DXM & Endogenous (Fever) (ID 70603)\". Erowid.org. Apr 18, 2008. erowid.org/exp/70603",
 "substance": "DXM & Endogenous (Fever)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   " ",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2008",
   "70603",
   "Female",
   " ",
   "Not Given",
   "Apr 18, 2008",
   "7334",
   " "
  ]
 ],
 "report": "<p>After hearing my girlfriend tell a series of strange experiences when taking cold medicines containing DXM while being sick, I suggested that she might be hyper sensitive to it. She responded in email a few days later, and I thought the online community might appreciate reading her experience on DXM while having a fever. I should mention that these sorts of things don't happen to her while simply having a fever, and that she is an occasional, but by no means regular user of psychoactives. She's also in good general health, mentally and physically.</p><p>'Okay, so remember when I was telling you about the dreams and shit I have when I have a fever, and you said it might be because I am super sensitive to dextromethorphan? Well last night I took some cold medicine so I could sleep, but my roommate was still up with the lights on so I wasn't in the dark like usual. Anyway, so at first my room is just bathed  a bunch of colors, yellow, green, blue, red, purple etc. in a sort of cycle. Then the walls slowly start to bubble out and retract, the pace of this picks up and the walls take on the appearance water or waves, washing back and forth and coming together rather gracefully at the top. While that's all happening, the colors and the waves, the surface of the walls begins to drip, oozing together all the images on them twisting around each other and running down the walls, adding to the water effect giving the feeling that I am perhaps underwater. After about ten minutes or so that all stopped and I passed out like a fucking rock. Hmmmm so yeah, that plus fever and bad dreams, probably explains alot of my weird sickness stories.'</p>"
}
