{
 "title": "Crisis Point",
 "author": "Zepster",
 "citation": " Zepster. \"Crisis Point: experience with 2C-T-2 (ID 70663)\". Erowid.org. Jul 25, 2008. erowid.org/exp/70663",
 "substance": "2C-T-2",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "2C-T-2",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2008",
   "70663",
   "Male",
   "",
   "Not Given",
   "Jul 25, 2008",
   "6499",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 150 mgs of 2C-T-2 is considered an extremely high dose, see 2C-T-2 Dose Chart. In addition, a volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See 2C-T-2 Dose.]</p><p>I am an experienced user of phenethylamines, tryptamines, LSD, mushrooms and Salvia Divinorum. My entheogen of choice is 2C-E but I decided to try another phenethylamine after I received 400mg of 2C-T-2 from my usual supplier. Unfortunately, I decided that the powder didnt look like 400mg and so took just under half of it. Yes  I know, big mistake.</p><p>I was alone in my house, my wife was in America, and took the powder at 18:15.</p><p>T+ 00.30  I come up  the usual tracers and nice billowing patterns in the living room. This seems quite gentle and Im enjoying the buzz.</p><p>T+ 01.00  I start tripping quite hard at this point, which surprises me because Im used to a slow coming up time on phenethylamines. I close my eyes and begin to have vivid internal imagery of a mother goddess figure. This is quite a common archetype for me and Im enjoying losing myself in the overwhelming sensation of a great nurturing mother. She is somehow connected to various women I know. The vision is beautiful.</p><p>T+ 01.30  But this is where it starts to go wrong. First, my whole body begins to spasm. I simply cant stop the spasms throughout my torso, arms and legs. Then I start to sweat profusely. Finally I realise that my heart is hammering away  I have visions of it trying to burst out of my ribcage. I realise that Ive overdosed.</p><p>T+?  What happens from here is impossible to convey in language but it translates like this: The sensation of leaving my body is overwhelming. I am simply somewhere else. It is dark and there are telepathic voices. I realise Im about to die, that my consciousness is about to be dissolved. I feel something like shock and explain that Im only 37 and that this cant be right. A calm, gentle (even loving) voice tells me  and this will stay with me for the rest of my life  that it doesnt matter; it is simply my time to go. My consciousness must relinquish my ego and join something else. </p><p>I am scared but Im ready to accept this. However, I have a massive, overwhelming urge to say goodbye to my wife and to tell her I love her and that Im so very sorry. This seems to put me back in my body, although I have very limited motor control. I lurch and stumble to the phone and call 999, blab my address and say overdose, then somehow dial my wifes sister in America. She answers, but my wife hasnt arrived at her place yet. I think I tell her to say that Im sorry and that to tell Wendy (my wife) that I love her. Next thing the doorbell rings, I pull the door open, the paramedics are inside the house and Im carried out to the ambulance with an IV in my vein. </p><p>I cant remember anything else until coming round in hospital. Ive no idea what the time is but Im still tripping wildly. Whatever theyve put into me has calmed me down but my heart still seems to be racing. Im hooked up in a cubicle in Accident & Emergency. I stay there for what seems like several hours, being monitored and watching the happenings of an A&E department whilst still under the surreal influence of the drug. I realise Im going to be ok and calm down a little. After several assessments and ECGs Im taken to a ward for the night. In the morning Im ok. Im disorientated and my heart still seems to be skipping but Im discharged by midday, the doctor happy that its more or less out of my system and that Im at no further risk. Im offered an interview with the psychiatric team but decline.</p><p>Obviously, taking such a large overdose was a pretty stupid thing to do. It could certainly have killed me and I certainly will not be doing it again. However, in retrospect Im grateful that the experience happened to me. It brought me to a crisis point where I was confronted with the imminent dissolution of my consciousness. It is an indescribable moment of epiphany where it is made clear that you are about to die and be made into something else, something lacking in individuality. It is at once, both terrifying and reassuring. But also, it made me see  for perhaps the first time  how much I love my wife and want to spend my remaining life with her. I know this sounds a bit trite and sentimental, but the all-encompassing love for her was all I could think about at the point of crisis.  </p><p>But please, measure your doses accurately.</p>"
}
