{
 "title": "Oops",
 "author": "Natty Dread",
 "citation": "   Natty Dread. \"Oops: experience with DOB (ID 70686)\". Erowid.org. Jul 25, 2008. erowid.org/exp/70686",
 "substance": "DOB",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "DOB",
   "(blotter / tab)",
   "  T+ 4:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 4:30",
   "1 cig.",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 10:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 70686",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 25, 2008",
   "Views: 8271",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: This report is marked as a DOB report, but readers should be aware that although the effects appear to be consistent with DO(X) research chemicals, the identification is speculative.] </p><p>Note: I am writing this partially to try to figure out exactly what I took. I thought I was taking two hits of acid on blotter paper. I have taken acid before a few times, and once even took like 6 hits and really reached a strange place. I had heard from a friend that this stuff was kind of 'different', had a really long onset, lasted longer, and was 'milder', but I didn't think much of it.</p><p>The onset was definitely longer. A friend (who had only taken shrooms before) and I took two hits each after we had both smoked marijuana. It seemed like it wasn't doing anything for a while, and it was kind of unclear when it was doing something. By probably 2 hours after, there was some patterny stuff happening when I looked at random things like flowers on the ground and grass. We were outside on a grass field for a while, laughing a lot at random things which shouldn't have been that funny. I saw this dog and I had this really strong urge to just run over and play with it even though it was someone else's dog. </p><p>About 3 hours after taking it, we decided to go to a friend's house. We got there and they were actually harvesting a marijuana plant. We offered to help. I was starting to get really restless, and I kept wandering around, wanting to lay down, wanting to get up immediately. I tried to help trim one of the branches and i just like cut off a few leaves and gave up. It was a lot more amped up (in an uncomfortable way) than acid was, but I kind of tried to ignore it. My friend who took it said she finally started to feel it setting in as well, and commented on how different it was from shrooms.</p><p>About an hour later we decided to smoke a little marijuana. It was pleasant, I didn't have much, but I was feeling generally good. The main thing I noticed besides the speedy restless feeling was a distinct lack of the intellectuality I'd experienced with acid. I didn't feel bad or overly confused, but I didn't really feel that much like thinking about interesting things, and I felt pretty numb emotionally.</p><p>Probably 1/2 hour later, another friend came over and 4 of us decided to smoke a really large joint. I kept up almost until the end, but I started to feel really weird so I didn't quite finish... but suffice to say I smoked a lot. We went into the main room and two other people showed up. At this point I started to feel really weird. I remember planting myself on the end of a couch and trying to just ignore everyone, but started just feeling waves of really strange 'physical' feelings (really more a distortion of the senses) that were uncomfortable. I walked around kind of agitatedly and then I told my boyfriend 'I am just going to lay on your bed for a while'. Everything going on was just too much, even though it wasn't that much at all, mostly people sitting on a couch not even talking to me. So I went into his darkened room and was laying on his bed and I just couldn't handle what was happening. The waves of sensory distortion were happening more often and were uncontrollable.</p><p>More about these 'waves', or 'flipping' as I named it at the time. It was sort of like getting the spins after smoking pot and drinking or something, except usually with those I can manage to kind of shake it off and stop it from happening, or getting too intense. These 'flips' I was having now were unstoppable and went past discomfort to a place that was just crazy. It started in my mouth and jaw. I was just sitting and suddenly all I was aware of was my jaw and how my tongue felt against the roof of my mouth, and I kind of 'spun' around that and felt like I really lost touch with everything for a moment. This happened mainly in the mouth for some reason. It became really dry, but when I tried to drink anything, it was almost overwhelming how it felt. </p><p>The feeling of air as I breathed through my mouth was also really weird. My body parts felt detached but at the same time so intense that it was really unpleasant. I remember the same feelings happening as my legs moved against each other, at that plane of contact, but it was mostly happening inside my mouth for some reason. My body in general felt very numb. My boyfriend asked if I was cold and I was just like, 'I have no idea!' But I got under blankets anyway. My boyfriend stayed with me and was being really nice and supportive, but I just kept writhing and feeling really uncomfortable. </p><p>One really weird thing was that I was stuck in this low-level sense distortion thing, but I also still had this narrative voice that was somehow over everything and knew that it wouldn't last forever and that I'd look back on it and think it was fascinating but at the same time the voice wasn't sure it would be OK. I was talking to my boyfriend and saying really rational, usual things, I was able to like chat with him and joke with him about random things... I am convinced I sounded extremely coherent... but then somehow that was totally detached from this entire other level that was the sensory distortiony agony going on below. </p><p>I tried to start attaching good things to the 'flipping', doesn't really make sense but I just remember closing my eyes and trying to just think 'I love you' or 'love' while it was happening... it kind of worked to make it less unpleasant. It was extremely weird, and I was operating on two levels at one time, but the top level wasn't able to convince me that it would be OK. The sensory mixup was strongest in the kind of physical, sense of touch way, but it also entered into other senses. I do remember staring at this painting in my boyfriends room that I had made and seeing weird things that I'd never seen before in it. I also remember that sometimes random noises would be amplified suddenly and scare me, before fading away again. Music also sounded really cool.</p><p>Finally after some period of time, it probably wasn't that long, the 'voice above' agreed with my boyfriend that I should get out of that room because it was kind of dim and cold and I was just laying there focusing on the weird uncomfortable feelings. It was also weird because I wasn't wearing my glasses and the blurriness was messing with me. I'm not even sure how but I got up and went into the living room, where two people were still on the couch. We decided I should play Halo to focus on something else. So we started playing and Halo truly became like my link back to reality in a really weird way. </p><p>I wasn't totally aware of what was happening that whole time, but I just kept playing until I started to feel more normal. I just kind of forced myself to focus on playing the game, saying 'normal' things to convince myself I was 'back', etc. I started to become a lot happier even though I still had some of the weird feelings, and I was completley OK with my boyfriend leaving us alone in his house for about an hour (which I almost freaked out completely when he left the room for less than a minute earlier). He ordered us a pizza while he was gone, told me where money was, and I successfully answered the door and paid for the pizza. Eating it was really nice. It was strange because the pizza had spicy sauce and green chile on it, but my other tripping friend and I noticed that it didn't taste spicy... however, after eating a slice or two we realied that our bodies were reacting to the spiciness, we felt hot and sweaty and everything, but our mouths didn't burn. We both noted a really pervading numbness at this point. </p><p>After my boyfriend came back, I was definitely 'coming down' a lot. I went outside with him for a little bit to see the last of the sunset and talk a little without everyone else around. I was still very numb, and couldn't really tell at all whether it was warmer outside than it was inside. Still believing I had taken acid, I told him even at the time that it was just so different than acid had ever been. I noticed that a lot of time had passed and it was now 8pm or later, which was officially almost 8 hours after we first took the drug. This alone was strange because I had seemed to get through the peak, but it was still definitely there (whereas with acid I would have been pretty surprised if it lasted that long). </p><p>My other tripping friend and I decided to walk back to my house. I was definitely OK with this idea, but suddenly as I was leaving I had this sudden twinge of wanting to stay with my boyfriend, even though he had to go to work. But we left anyway. We had to walk about 20 minutes to get to my house and I definitely noticed a lot of psychedelic things on the walk, but still with a different flavor from acid. I suddenly was getting tired and had no idea what I wanted to do... it's like I didnt' want to do anything. As we walked through campus and through the dorm area, I got really disoriented and luckily my friend knew where we were. </p><p>We made it to my house just fine. I noticed how warm it was when we got inside. My 'straight edge' roommate was there and started talking to us, seemed totally unaware that we were on anything. I was drinking a lot of water and chewing on the ice cubes, and this brought back some of the weird mouth feelings from earlier but in a much milder form. </p><p>The other tripping friend and I decided to watch TV, which was pretty amusing. Some weird Lindsay Lohan movie came on and it was just ridiculous. We smoked another bowl of pot probably around 11... it was pleasant and calming. I was expecting some friends to drop by but was getting really tired. Finally heard that they decided not to come. Tripping friend left to walk home, and I sat there for a minute just not knowing what to do. My boyfriend decided to come visit me shortly, so he came over... and despite my being in good spirits for quite a while, I started crying when he came over for some reason. I mean there was kind of a reason (he has been really busy, stressed out, and sick) but I normally woudln't have cried, and I felt stupid for not being able to stop. He left and I tried to do a little homework before giving up and going to bed. I kind of cried myself to sleep for some reason, but fell asleep without much trouble around 2am.</p><p>Woke up the next morning at 8am, had to do homework before class. Felt really tired and not very happy. I was really disappointed in how yesterday had gone, because I hadn't really experienced any of the really great things I liked about acid, but had experienced some things I wasn't really that excited about. I never ever had problems 'controlling' my acid experiences and always had the feeling that nothing could go wrong... never had anything close to an uncontrollable and slightly 'bad' trip, like I did this time. I also had never had so many 'physical' and sensory things happen, and never had that level of confusion and fear. </p><p>I tried to convince myself that it was just one time, and that I should be open to those experiences and try to look back on them just as reverently as other experiences. Then I convinced myself that it was probably just all the pot we smoked right before I went into the intense part, as I'd never really smoked that much pot with acid before. I was able to pretty much decide that I was ok with what happened, and tried to think about it and remember things and explore things, but I was still a little sad that it was so different.</p><p>It wasn't until later that I started to think I took something else, when I was reading some experiences for LSD... because I'd never really heard of anyone having things happen to them like what happened to me, and I'd talked to a lot of people who have taken a lot of acid and read experiences before I ever took it. I read about how DOB could be distributed on blotter paper too, and the descriptions of it seem to fit what happened to me so much better, both timeline-wise and as far as effects. I may never know for sure, but it seems likely that I took something DOB-like and not acid. </p><p>Overall, it wasn't a 'bad trip' or bad experience, but at this moment I have no desire to have an experience like that again. (I am only about 27 hours from first taking it at this point, and I still do feel a little 'weird'). It was really interesting in retrospect and I kind of wish I'd been able to get ahold of myself enough to explore it more and play with the sensory confusion more... I was able to a little after it started coming down, but for a lot of it I was really helpless. </p><p>But in general, there was really nothing about it that was like my previous acid experiences... Maybe if I had known I was taking something different, I could have been better prepared for handling a situation that was uncomfortable. I have never taken anything that is deemed 'scary' or 'uncontrollable' or that experienced trippers think has potential for a 'bad trip'. I have considered it, but would probably have wanted to prepare a lot more for something like that... I was expecting a lighthearted easy acid trip that would be totally smooth sailing and I got something different that I wasn't ready for.</p>"
}
