{
 "title": "One Strange Dream",
 "author": "Sam",
 "citation": "   Sam. \"One Strange Dream: experience with Banisteriopsis caapi, Syrian Rue & DMT (ID 70744)\". Erowid.org. Aug 9, 2009. erowid.org/exp/70744",
 "substance": "Banisteriopsis caapi, Syrian Rue & DMT",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 g",
   "oral",
   "Banisteriopsis caapi",
   "(tea)",
   "  T+ 0:00",
   "1 g",
   "oral",
   "Syrian Rue",
   "(extract)",
   "  T+ 0:20",
   "250 mg",
   "oral",
   "DMT",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 70744",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 9, 2009",
   "Views: 6775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had a strange experience a few nights ago, on Sunday April 20th on the night of the full moon, which I thought I would share with anyone who might be interested to hear such tales...</p><p>Me and my two companions drank 20g of slow brewed caapi, taken as a shot, following 1g of 4x Syrian Rue extract taken in a '00' gel cap. 20 minutes later a '00' gel cap of 250mg of very pure DMT extracted from Mimosa was taken.</p><p>I was a little apprehensive about using DMT extract again, I had used it twice before, but is much more keen on brewing with the plants the way nature intended, . However, this had been planned for a long time, and an opportunity had finally presented itself.</p><p>For me, the experience took a very long time to come on which itself was unusual. My friends were in quite a deep trance quite rapidly. One of my friends had an Indian looking down on him, which he said was providing some guidance.</p><p>Then, quite suddenly, around a few hours in, I was in a deep trance. It was literally like a switch had been flipped. 30 seconds after I was aware of this I felt this very powerful, slightly menacing electrical feeling creeping into my brain, and I knew it was time to purge.</p><p>However, this was a lot harder than it should have been. With caapi I always get a nice clean purge. With Syrian rue, I never purge. The few times I managed to take too much rue, I felt very nauseous but was actually unable to purge.</p><p>The caapi and the Syrian rue seemed to be clashing strongly - they DID NOT like each other. I failed to purge much at all, and the experience kept on building, and this is where feelings of terror made themselves known.</p><p>This was strange. I considers myself quite an experienced psychedelic adventurer, and there was nothing obvious producing these feelings, the experience was definitely intense but it was like a more basic, primal, animalistic part of my brain was screaming 'FLIGHT OR FIGHT', the foundations of the ego were being shaken, and simply overriding the more advanced parts of the brain.</p><p>Also during this trip I got to know the personality of the Syrian Rue a bit better. At times my awareness did seem heightened to near Jedi levels. Syrian Rue is a very powerful plant, and not one that should be taken lightly. I have heard caapi referred to as 'the light'. Well Syrian Rue is 'DARK', and I don't mean this in a bad way, but I felt this SO vividly. The 'light' of the caapi was also there, but much further off, while the rue was enveloping me, much closer.</p><p>The fact that the caapi and Syrian Rue were clashing, and the DMT was taken as an extract, not as the raw, admixture plant, meant the experience</p><p>HAD NO REAL GUIDANCE</p><p>There was a little, but for a good hour or more the experience resembled the chaotic intensity of a strong smoked DMT experience, I had no frame of reference or way of navigating. Music proved a good ally, and kept the experience moving. While peaking, everyone was in a very deep trance, and became aware of a humming, a bit like ommmmmmmmmm... Could the DMT act like a cosmic tuning fork, and this sound or vibration is the oscillation of all matter and energy... it was strange.</p><p>All in all, the experience lasted a good 5/6 hours, and was one of my strangest, and most interesting experiences.</p><p>My personal conclusions from the trip:</p><p>- I shall not be using Syrian rue when drinking ayahuasca in the future. It is a powerful plant in its own right, and belongs to a different part of the world, and should not be combined with ayahuasca. Just my opinion. I certainly wouldn't recommend combining it with Caapi.</p><p>- Extract is not the way to go. In this case taking a raw, purified chemical is very much a different experience to brewing the plants and drinking them that way. Au natural, brewing the authentic ayahuasca plants properly is the only way to go for me.</p>"
}
