{
 "title": "Achieved My Purpose in Trying It",
 "author": "Jonathon",
 "citation": "   Jonathon. \"Achieved My Purpose in Trying It: experience with Acacia spp. & Passion Flower ('Dreamtime' Blend) (ID 70868)\". Erowid.org. Aug 21, 2009. erowid.org/exp/70868",
 "substance": "Acacia spp. & Passion Flower ('Dreamtime' Blend)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Damiana",
   "(tea)",
   " ",
   "  ",
   " ",
   "Passion Flower",
   "(tea)",
   " ",
   "30 mg",
   "oral",
   "Codeine",
   " ",
   " ",
   "  ",
   " ",
   "Poppies - California",
   "(tea)",
   " ",
   "  ",
   "smoked",
   "Acacia",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Passion Flower",
   "(dried)",
   " ",
   "  ",
   " ",
   "Pharms - Ibuprofen",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "70868",
   "Male",
   " ",
   "Not Given",
   "Aug 21, 2009",
   "Views: 6063",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I prepared for this experience by first brewing some damiana and passionflower tea, followed by a very small (30mg) dose of codeine and a small cup of californian poppy tea. As of late I have been suffering worse than usual from clinical depression and anxiety, and have ceased my reasonably heavy 3yr cannabis habit. Thus, I wanted to be in a comfortable place before my experience. </p><p>I smoked the mix in a dark room, with incense burning and a ring of candles around me and my close friend. I felt an initial rush of anxiety as the smoke entered my lungs followed by a pronounced sense of calm. I was seeking to find out what has been plaguing my mind, as I have for a long time had the theory that alot of my personality disorder(s) is attributed to a repressed memory of some sort, as I have had problems before I experimented with any drugs. Anyway, I closed my eyes and then felt a feeling of intense heat, and saw brightness, much the same as if u shine a bright light on your eyelids when ur eyes are closed, but in this case the closest thing that resembled it was flames of a fire. I was back in my childhood and my mind was clear - not the fragmented collaboration it is today. I felt intense love and belonging, as if I was in the arms of my mother, the type of love I feel and associate with family. I then had a vision of a man, someone who closely resembled my father, but looked like he had looked before I was born. He was laughing and seemed to be very joyous. </p><p>At this stage I opened my eyes and experienced intense euphoria (and permi-smile :P) and experienced love towards my friend not unlike that of a heavy dose of MDMA. I saw shapes, but triangles for some reason came to mind and making a triangle with my fingers seemed to be the thing to do :S. This first time was for me to be able to let go and embrace the effects of this psychedelic. I have had some experiences with a few psychedelics but as mentioned before, was not sure if I would react positively in a fragile state. My state of mind continued to be altered, minor visual hallucinations for about 30 mins afterwards. The second time I smoked it, about 1 1/2 hrs later, I was in my friends room with another close friend nearby. I smoked one full cone and immediately sat back and closed my eyes. I had a birds-eye-view of a being (human, but not sure of the gender) walking through the Australian bush but also at the same time the smell and organic 'feel' one gets from being in it in first person. The being ran and came to a cliff edge that broke away into a lake of water, that was completely contained but overlooked a mountain range. 'I' dove in (a weird sense of being in third person and first person at the same time) and experienced a rush of cleansing calm through my body and took two huge breaths. </p><p>I swam down to the bottom, through relatively cloudy water and viewed the rock formations that were underneath the water; an organic, grounding feeling. I then opened my eyes and again felt intense euphoria. I was drawn to my palms where I again visualised triangles and felt compelled to poke triangles into them with my fingers. I also felt compelled to study my friends palms, an urging sense to grab them and just feel (unfortunately I didnt). Particularly stimulating was putting slight pressure in the dead-centre of my palm with my index finger. I awoke to a sense of calm and continued to be fascinated my mild visual hallucinations. I'm not sure what my visions meant, but I'm sure they meant something. I would love to learn more about interpreting these events. </p><p>Overall I think that this herb or collection of plants and herbs containing DMT can be very useful but I recognise that it is most useful in answering questions; it seems to tap into the unconcious - dreamtime is a perfect name for this particular mix. It is the next day as I am writing this and I felt pretty out-of-it through the day, with a bit of a headache. Nonetheless, uni was fascinating! I took a couple of nurofens and feel much better. Another thing I noticed was it made me extremely dehydrated. I diddnt really notice but when I finally had a drink of water I drank heaps. I hope this explanation of my personal experience, although brief, aids you in your spiritual journeys. I plan to experiment more with the substance later on, but I achieved my purpose in trying it- it gave a positive sense of the things to come. </p><p>[Reported dose: 'Less than 1 cone of a medium sized conepiece / Then 1 full cone']</p>"
}
