{
 "title": "The Afterlife",
 "author": "Hungry Joe",
 "citation": "   Hungry Joe. \"The Afterlife: experience with Mushrooms (ID 7086)\". Erowid.org. Aug 26, 2002. erowid.org/exp/7086",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7086",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 26, 2002",
   "Views: 6073",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHaving tripped on mushrooms several times in Amsterdam I decided try my hand at growing my own. The results were initialy dissappointing, One medium sized 'shroom and two very small ones, far less than I was used to dosing myself with. I assumed that the experience would be dissapointing, and though I had promised to share with a friend I almost didn't, thinking that there was barely enought for even one person. The result was a horror that I thought would never end. I'm incredibly thankful that I did not go into it alone.</p><p>We started by blending the 'shrooms with some orange and measuring out equal doses, a mistake since I was on MAOI inhibitors and should have had half as much as my friend. After consuming this foul brew we sat down to watch the movie 'Little Nicky' and wait for something to happen. Another mistake, watching a movie full of demons and such, even if it was a comedy. In very little time we were both tripping harder than we ever had and looking forward to the rest of the night. My friend wanted to go out and get an unlimited ticket and just ride the trains, I briefly argued that I didn't think I could function outside, but I eventually struggled into my coat and we set out for the train stop. On the way there a small voice in my head started whispering about poisonous mushrooms, but I was still having a good time so I ignored it.</p><p>We got on the train and went on the ride of our lives, at this point it was still fun and the train seemed like the great space coaster moving through the universe. We got off in unfamiliar territory, and that was when we entered hell. I started to take that little voice seriously, and I really believed I was dying. When I told my friend this he tried to persuade me otherwise, but I was convinced. The only thing I was unsure of was the means of death. For a while I was being slowly killed by a madman, for a while my body was melting, for an eternity I was at the bottom of the ocean seeing the stars through the water as I drowned. I went through many other deaths, none of them painful, but the raw fear was unbearable. I remember in between deaths running through an unknown town. Heedlessly crossing the street as cars came on, one time clinging to some metal object as my friend tried to talk me across an otherwise empty street.</p><p>I remember running through brush and thinking the trees were tearing me apart, and later struggling through some sort of muck until I though it was the only thing I had done for my entire existence. I finally found myself in an empty field, covered in mud, and repeating nonsense phrases over and over while staring at some shiny metal on the ground. My friend had dragged me some way, as I had finally given in to death and refused to do anything on my own. He tells me that he tried to kill me several times, partly because he thought I had deliberately poisoned us both, and partly because he no longer felt like convincing me to live. His own story is very different from mine as he believed we had descended to hell and what was muck for me was decomposing bodies for him. In his belief that I had killed him he deliberatley shit himself several times to ensure that when his body was found it's filthy state would show the world what I had done to him. In the end he found his way back to me (I can't imagine how) and pulled me out of the my loop, by picking the shiny metal up off the ground and saying 'Here they are.' as I repeated to myself for the millionth time 'Where the fuck are my keys?'. I'm thankful for that empty field, far away from anything that I could use to hurt myself. My friend and I spent the next hour or so looking for the train stop we had gotten off at, only to find that the next train didn't run for several hours.</p><p>And there we stood, in the middle of nowhere, covered in filth, freezing, and repeating to ourselves how lucky we were to be alive. Thank god for cell phones and GPS equipped taxis. As long as this story has become, I've left out more than I could possibly tell you. The fear of that night occasionally leaks over into my daily life and I have to convince myself all over again that it wasn't real. Ordinary life often seems like it's the hallucination to me now, though both effects are fading with time. Still, would I do it again? I already have, but thats another story.</p>"
}
