{
 "title": "An Irregular Substance",
 "author": "Telemachus",
 "citation": "   Telemachus. \"An Irregular Substance: experience with Anadenanthera peregrina (ID 70883)\". Erowid.org. Apr 14, 2011. erowid.org/exp/70883",
 "substance": "Anadenanthera peregrina",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Anadenanthera peregrina",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 70883",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 14, 2011",
   "Views: 4606",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been using the same batch of yopo seeds for a good year now, and let me tell you, it's one of the stranger drugs I've taken.<br>The pain, at worst, is on par with an slight headache, and certainly doesn't last long enough to spoil my trip.<br>Let me tell you exactly how I've done yopo.<br>First, I use about 0.8 seed for every 50lb (about 23kg) of body weight.  As a 150 pound (68 kg) man I use about 2.4 seeds.  It's been my experience that at just about this point, the nausea ceases to be a real problem, assuming I do all the things I'm about to tell you.  I don't have much experience with smoking the seeds, so I won't go into much detail about that, but I will say that about one third of a seed per 50lb or 23kg is roughly appropriate.<br>The first thing I do to minimize the pain-to-ingested drug ratio is microwave the seeds until they pop into an convex shape, like popcorn, except the kernel only expands.  This mostly has the effect of drying out the seeds, allowing the cell walls to crack and gush out drugs.  Yum.  I crush the yopo as finely as possible, and, following that, use a credit card or whatnot to fold a line on a plate, making a line of half that length of baking soda and mix them together, using a razor blade, or, ideally, a hammer (not on the plate!) to break up any large pieces.  Up the nose it goes.  <br>About eight minutes from snorting, I get a very distinctive heady feeling, not unlike the feeling I get from smoking pot early in the morning.  At this point, I wait about two more minutes and then blow the remainder of the seeds out into a tissue.<br>I distinctly remember the first time I did yopo.  It was about 3 in the afternoon, a beautiful summer day, and I had just gotten the seeds in the mail.  I stared at them excitedly, ripping open the package, and thinking in dismay, 'how the fuck do I snort these?' My question were soon answered with a quick trip online, and up the nose hole they went.  I was unimpressed by the initial effects, but soon realized that this was due mostly to the fact that I was sitting in an air-conditioned room with all the curtains closed.<br>I went outside and was absolutely stunned at the sheer saturation of the colors amidst the sky, the sun peaking through the leaves so as to say, 'perhaps I really do possess consciousness!' I laughed at him, that strange figure, and wandered over to my car, driving across town to a wilderness preserve with a notebook and paper.  A family fished at a nearby lake, so I went the opposite direction into a whole series of cornfields.  Out came the pencil, and let me tell you, I wrote some of the most surprising things I've ever read then.  New theories about poetry and prose arose in my mind, and indeed they lasted far beyond the duration of the trip - perhaps even possessing some validity, one may assert.\n\n\n"
}
