{
 "title": "Mellow Moxy",
 "author": "Schwag",
 "citation": " Schwag. \"Mellow Moxy: experience with 5-MeO-MiPT (ID 70897)\". Erowid.org. Jul 29, 2008. erowid.org/exp/70897",
 "substance": "5-MeO-MiPT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "5-MeO-MIPT",
   "(powder / crystals)",
   " T+ 1:30",
   "1 repeated",
   "smoked",
   "Cannabis",
   "",
   " T+ 5:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2008",
   "70897",
   "Male",
   "",
   "Not Given",
   "Jul 29, 2008",
   "15445",
   " "
  ]
 ],
 "report": "<p>I've decide to share my first experience with 5-MeO-MiPT, it was an enjoyable one! I have a fairly decent amount of experience with psychedelics, having tried the following, most more than once: Weed, Hashish, Magic Mushrooms, DXM, MDMA, PMA, Meth, Codeine, Salvia Divinorum, AMT, 5-MeO-DiPT, Ketamine, 2C-E, 4-AcO-DMT, 4-HO-MiPT, 2C-T-21 and LSD.</p><p>It was an absolutely beautiful day, the first beautiful day in a while. I decided to take advantage of the weather's beauty and ingest some 5-MeO-MiPT. I weighed out 9 mg, my Acculab was drifting between 9 and 10, could have been 10. I headed for my fridge, and grabbed a glass of juice to down it with (1:00pm). Not too bad a taste, one of the more benign tasting tryptamines, from what I have tried. I had planned to go spend some time at my friends house for a few hours, then head to a local nature spot we enjoy. </p><p>I grabbed my Ipod, and began walking to my friends house. I couldn't resist walking, sunny days don't come often here as of late. As I was about half way there, I found myself noticing aspects of my music or sounds in my music that I had not noticed before-hand. To me, this was the first sign of the drug taking effect. This developed more, as I got closer to my friends house. I arrived, to discover I had to wait an hour on his porch for him to get home. I wasn't bothered, by this time I was really enjoying my music. I found Moxy's music enhancement similar to MDMA, far from the same though. I find Moxy makes me more aware of the beauty in the music I'm listening to, as opposed to MDMA, which for me, seems to make music sound better by changing the way I perceive it. I also tend to have a lot more emotions about the music I listen to when I'm on MDMA, Moxy had less of that emotional depth.</p><p>My friend arrived home (about 2:30pm). By this point I found my self having mild visual effects, as well as a great deal of euphoria. The visuals where slight breathing of objects, accompanied by a visually overlaying, shimmering pattern. Nothing to interesting. I felt great, the world was my oyster. It was still a euphoria, just much less prominent than MDMA or Speed, more like a contentedness to be alive. Now that I had taken out my headphones, and was conversing with my friend, I discovered a nice impact on my overall thought process. I found it a lot easier to analyze what would normally be emotionally difficult or awkward situations, in the various things we discussed. Emotions were very easily expressed, luckily I didn't at all feel the need to over express at any point. I can say I may have been a bit to critical towards my friend at points. It was more of a constructive-criticism, though he tends to take things the wrong way. We smoked lots of Weed during the experience. This had more of an impact on the intensity of the 5-MeO-MiPT, as opposed to adding something different to the high.</p><p>We set out for the walk to our nature spot (6:00pm). It was great to be outside, even though my friend had difficulty persuading me. Tryptamines make me kind of lazy, once I do get going, I'm always happy to be out. Walking around outside, I felt like I was floating on a cloud as I walked down the street. There air was a cool breeze, rain was coming. To me, everything still felt great. The air was only cool as it was still really hot outside. We got to our favorite spot, I had enjoyed every aspect of nature along the way. We sat down to smoke a bowl. Enjoying the grand view, we sat for a few minutes... before it started to rain. Oh well, I had had my fun for the day. We decided it was time to retreat to our separate houses (8:00pm).</p><p>Conclusion of 5-MeO-MiPT:</p><p>I found this to be a smooth, and enjoyable drug.  I forgot to mention, I often found my self thinking about the opposite sex. Moxy re-created feelings of love, better than any other drug I have ever tried. It wasn't sexual thoughts. I simply felt a great love and appreciation for woman and all their beauty. I would like to try this drug in a more romantic setting, with a woman. I believe it would make for a great time with this setting. I also felt this drug could easily be passed off as Ecstacy if it were put in E pills. To me it was like the experience of MDMA, save for it was coming from a more psychedelic, less euphoric angle. All in all, an enjoyable and enlightening compound, I'll be back for more later. For now, I'm off to the realm of Ketamine, wish me luck!</p>"
}
