{
 "title": "I Was a Spirit Returning to Earth",
 "author": "Qwerty Uiop",
 "citation": "Citation:   Qwerty Uiop. \"I Was a Spirit Returning to Earth: experience with DXM (ID 7090)\". Erowid.org. Aug 27, 2002. erowid.org/exp/7090",
 "substance": "DXM",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "360 mg",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7090",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2002",
   "Views: 23336",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI had read and heard about DXM for years and really wanted to try it.  But I knew that me drinking a bottle of Robo wasn't going to happen.  I kept searching for DXM only pills.  Of course, they are very hard to come by, in the United States.  I had more or less given up until a few months ago when I found a product called 'DexAlone' at a small independent pharmacy, more or less by accident.  \r\nThe only active ingredient in 'DexAlone' is dextromethorphan hydrobromide (30 mg per gelcap).  There are about 9 inactive ingredients.\r\nI tried it early one morning (around 6am), after I had been up all night.  I did not have anything else in my system.  I took 12 gelcaps, on an empty stomach.  I broke about 3 of the gelcaps open before swallowing.  By the way, these pills were HUGE.  Don't expect to swallow them without water.  Based on the info I had on DXM, I was shooting for a 2nd plateau experience.\r\nWithin 30 - 40 minutes, my computer screen started to take a gel like appearance with wavy lines flowing down it.  (I had very similar visuals once on Benadryl.)\r\nI also, started to get a very 'heavy' feeling and room size was out of whack.  I also started to get VERY bad nausea.  I went to the bathroom and dry heeved several times but nothing came up.  Quickly after, the nausea passed, and for the first and only time during the experience I felt good.  It was not euphoria (believe me I have experienced euphoria and this wasn't close) or even a high.  It just felt 'better' than a few minutes before.\r\nAt this point, I lost track of time, so forgive me for not being able to give you a running clock.  I got into the shower to relax.  My body became extremely heavy, so I had to sit in the shower rather than stand.  How I felt was unlike any feeling I had ever had before.  It wasn't good mind you, just different.  \r\nI closed my eyes and I was at work.  It wasn't an hallucination per se but more like a lucid dream (something I have had quite a few of since childhood).  If I opened my eyes the visuals would stop but the second I closed them, I would be back at work.  In fact, I even had sex with a co-worker in my visuals, although I was 100% flacid in reality.  DO NOT EXPECT TO HAVE SEX WHILE ON DXM, FOLKS !!! :-)\r\nI felt like I weighed 700 lbs.  Any movement on my part required concious effort.  Finally I got out of the shower, which took a lot of effort physically.  Before, I went to my bedroom though, I had to take a very bad crap.  Apparently, DXM causes upset stomachs.  When I was done I headed to my bedroom.  Although it was hard to tell, I believe that I had a 'Robo-Walk'.  Gravity was totally messed up.\r\nAfter a certain point I do not remember walking anymore but rather seeing and jumping thru a cartoon-like 'warp tunnel'.  Something like a worm hole in Star Trek and it transporting me to my bedroom.\r\nIn my bedroom, I became very dizzy and had to lay down.  The whole room was spinning.  I closed my eyes and my bed was still spinning.  Within seconds I was laying on my bed spinning thru outer space.  I could see stars, galaxies, comets, etc.\r\nI ended up having all sorts of visuals (or maybe lucid dreams, I really don't know) about friends, work, life.  I don't even remember all of them.  The weird thing about it was the cartoon like quality of many of the visuals.  Many visuals were as clear and real, as everyday life, while others looked like something out of a Saturday morning cartoon.  Some were even mixed with realistic visuals.\r\nAt some point, I got back up and I was in a very DXM state.  I had no depth perception.  My side vision was gone.  And I could not seem to focus.  I also had the weird strobe effect with my vision.  Kind of like watching an old time movie.\r\nI tried to sit down and read some DXM articles on Erowid but my eyes couldn't focus, so it was hard to read.  I tried websurfing and had the same problem.  So I gave up on the computer.\r\nI put in a CD and listened to some music hoping the the quality would be enhanced but it was the opposite.  Music was totally uninteresting.  I tried a couple music genres and all were equally uninteresting.\r\nI tried watching TV everything on was boring to watch.  I even tried some DVD's that I love normally and they were equally boring.\r\nDuring all this, I had Howard Stern on the radio.  Even though, I could not get into him while on DXM, hearing his voice was reassuring because I knew that I had not lost touch with this world.\r\nI tried eating chips and drinking soda and I discovered that I had NO taste whatsoever.\r\nPhysically and mentally I did not feel good.  It is hard to pinpoint what did not feel right, though.  To be honest, I felt horrible.  \r\nMy mind felt totally disassociated with my body.  I could think clearly and logically.  But my body was just not working right or in unison with my mind.  I would try to talk but only nonsense would come out.  Even though I knew the experience would end, I had a nagging dread that it wouldn't and I would be stuck in this state forever.  I also felt very hot like I had a fever and a very bad headache would come and go.\r\nAt times I even felt like I had died and that I was a spirit returning to earth.  Or maybe more of a person who just died and their spirit had not gone to heaven yet.\r\nOther than a few rather mild open-eyed visuals such as a lit light bulb looking like a flame, there was not a whole lot of open eyed visuals.  I managed to have a few closed eyed visuals but mostly it was lucid like dreams that I experienced.\r\nI am not sure what plateau I hit exactly.\r\nI finally laid down and went to sleep.  When I woke up around 2pm I was completely sober and experienced no hangover whatsoever.  I did not seem to experience any ill effects on my body.\r\nDXM is not fun and is basically garbage in my opinion.  I never felt good.  I refuse to use the word 'trip' in regards to DXM because believe me, DXM is not a trip in the true sense.  I'll admit that the lucid visuals were interesting but were not worth the nausea, horrible feelings, and possible danger involved.\r\nMy recommendation is that if you have not tried DXM - DON'T.\n\n\n"
}