{
 "title": "How is This Herb Not Being Widely Used?",
 "author": "Jake",
 "citation": "   Jake. \"How is This Herb Not Being Widely Used?: experience with Rhodiola rosea (ID 70939)\". Erowid.org. Jul 21, 2011. erowid.org/exp/70939",
 "substance": "Rhodiola rosea",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1000 mg",
   "oral",
   "Rhodiola rosea",
   "(daily)",
   " ",
   "  ",
   " ",
   "Tobacco - Cigarettes",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 70939",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2011",
   "Views: 8978",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis herb is simply AMAZING! And it's really hard for me to understand how it is not catching on more quickly in mainstream society. I found out about rhodiola online and have yet to meet one other person in my real life who knows about this herb. At least until I started ranting and raving about it to them.<br>It's become obvious to me that taking the right dose is extremely vital in the effects I see from this herb. I naturally seem to have a high tolerance to things such as rhodiola, most likely because of my skeptical nature. I started off taking 500 mg/day and felt slight increases in stress reduction and I was able to exercise longer without feeling fatigued. <br>After one month I started taking a product that contains 500/mg of the standardized extract per pill (I take two pills per day) and also contains 200 mg of the actual root. After taking the new supplement I have noticed an absolutely unreal change in mental and physical state. I went running yesterday and was able to run much longer than in the past. The only reason I had to stop was fear that my leg muscles would be out of commission for too long as I have a job that requires me to be on my feet constantly. My respiratory system seemed to be working 10 times better than in the past. Note: I am a light/moderate cigarette smoker. I can imagine the possibilities if I were to give that up, and actually since started taking rhodiola I haven't had as much of an urge to smoke.<br>Mentally I have been going through a very stressful time in my life due to legal issues, a suspended license, and a possible pregnancy with my girlfriend. But somehow I feel an extraordinary sense of optimism. I feel like no matter what happens I will be able to accept it and deal with it. That's what life is all about right, change and adaption? I feel so much more resourceful and focused than I have ever before. Any time I have a problem pop up I am knocking it out right away without hesitation. My mind seems to be coming up with all kinds of solutions to all the little problems I have been facing recently. Honestly, and I don't want to glorify the use of this drug, but the way I feel is like taking a few hits of meth but without the dirty feeling and side-effects. I have so much energy I just don't know what to do with myself. Usually, I would never write this long of a report on something, but it has been effortless. The only side-effect I can think of is it's been a little bit harder to sleep at night. My body wakes up at 3 in the morning and is ready to go like it's the middle of the afternoon and I have to force myself back to sleep.<br>In summary this has been truly an amazing and life-changing herb for me. I am really surprised to see how little press and hype it has gotten in recent years. Give this herb to everyone in our population and this country would transform overnight.\n\n\n"
}
