{
 "title": "SAT Helper",
 "author": "Orange Floyd",
 "citation": "   Orange Floyd. \"SAT Helper: experience with Amphtamines - Lisdexamfetamine (Vyvanse) & Cannabis (ID 70937)\". Erowid.org. Aug 31, 2009. erowid.org/exp/70937",
 "substance": "Amphtamines - Lisdexamfetamine (Vyvanse) & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 2:45",
   "50 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 70937",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 31, 2009",
   "Views: 36513",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWith the SATs looming in site, I scrambled for weeks for some uppers. 'Find me some adderall man' seemed to be the phrase I was too often repeating at no avail. Finally someone told me their friend had adderall, but the kid 'forgot to bring them in' for about a month. One day my friend finally tells me the kids gonna have it the next day, but that it's not actually adderall, some stuff called vyvanse. Disappointed, I go online. I'm relieved to find out that it has amphetamine in it. I've done adderall maybe half a dozen or so times, at doses from 30mg (which had me going for maybe an hour), to 90mg (which had me tweaking out like crazy even after 7 shots and about 20 grams of regs smoked between me and a few others). Reports were vague as to the dosage, with one telling me that 200mg of vyvanse was roughly equal to 40mg adderall. Only having two 50mg pills, I didn't think it would do very much, but having nothing to lose I decided to take them.\r\n7:45(50mg)- Wake up and pop the pill the second I get out of bed. Go to school and I'm starting to feel it within an hour or so.\r\n9:00- Test begins, and I'm fucking flying! My hand actually hurt because I was writing the essay so fast. I breezed through two math sections, which previously I had only been able to answer a little over half of the questions. \r\n(about)10:30(50mg)- As per my friends description of it, the first hour had passed, which was supposed to be the 'end of the peak', so I took another one. Looking back that's funny, because I was going all day long. It's about 10:15PM now, and I'm still feeling it a tiny bit. \r\nBreezed through the test, smoked some nyc diesel, then went to work. The only really negative side effects were mild dehydration, and a ridiculously overactive bladder. Twice during work I had to stop in the middle of what I was doing to literally run to the bathroom because holding it in was impossible. \r\nThe buzz was very similar to that of adderall, but I was much less jittery, and the jaw clenching was much less pronounced. Sitting still for longer periods of time also seemed much easier, where as on adderall my legs would've ached way more if I had sat through a five hour test. As far as how strong it was, I found it to be way more 'bumpy' than eating an addie. Every two or three hours I would get a little pulse through my head, and my sense of smell would slightly increase as to smell the bag of weed in my pocket. Then I would go back up to where I was before I *thought* I was coming down again. I assume all these bumps are due to the staggered dosing and the time release mechanism. Next time I plan to dose all at once to see if this phenomenon still occurs.\n\n\n"
}
