{
 "title": "Experience the Gaba",
 "author": "Azlecs",
 "citation": "Citation:   Azlecs. \"Experience the Gaba: experience with Gabapentin (Neurontin) (ID 70987)\". Erowid.org. Jun 21, 2008. erowid.org/exp/70987",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 70987",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2008",
   "Views: 64318",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo, here I am, once again posting another Gabapentin experience. This one is intended for a simple outlining of all of the previous times I have done gabapentin as to provide any answers to those looking to experiment with my favorite drug and great friend, gabapentin.\r\nOver the past 3 years or so, I have taken Gabapentin (Neurontin) at low, medium and high doses for a recreational high, the ability to stay up and push myself, or the ability to create. The back story can be found within this vault, but long story short, my mom's now fiancée got into an ATV accident and is now prescribed gabapentin for nerve-damage in his left arm.\r\nI started with 300mg pills long ago, and then moved to 600mg, averaging 4-8 of the little capsules for each dose. The most I have done has been 4800mg of the 600mg pills whilst the lowest amount that I can take to get any effect seems to be around 900mg or more. But thats just me, and I have taken these for quite some time. \r\nTo classify this pharm is a near impossible task. It is everything and anything in one pill. The only downside to gabapentin so far as I can tell, is the onset. These little guys take upwards of an hour to really start to kick in, but luckily, they last for 4-8 hours it seems. After the waiting and the waiting, Ill suddenly stand up, expecting nothing to happen, but suddenly all the gaba-tainted blood just rushes to my head and BAM, I is fucked.\r\nNow I use the term fucked lightly, because many of you have many different definitions for our favorite word. When on gabapentin, I dont feel disoriented, yet I feel completely disconnected from my body. I feel as if Im on a super amphetamine rush and can tackle anything, yet feel so content its like Im on a fully-sedated opiate buzz. Im chatty and witty, deep and insightful. Im totally composed in my words and my movements, my thoughts are clear and well thought out. My skills and abilities are unmatched when sober. Attention to detail when doing any menial task is unreal, but not on an OCD level like speed. I feel fine doing anything or nothing.\r\nWhen I am entirely at peace and at the top of my game, there is a line that runs straight from the top of my head to the ground under my feet that represents my energy, or chi being in total sync. What my daily life throw into the mix, be it stress, anxiety, anger, sadness or pain, that line then becomes disconnected and warped. Almost chopped up and skewed, yet still going from top to bottom, but now in a slightly different route and I no longer function to our full potential as we are out of sync with our mind and our body. Gabapentin returns that balance. It almost makes me pure, as the way I was meant to be, without any debilitations or distractions.\r\nGabapentin is prescribed for many different ailments. Insomnia, epilepsy, tremors, nerve damage, pain and perhaps many other reasons as this drug is fairly new, yet its healing properties are mostly unknown. There are no known interactions with gabapentin that I have read or heard about, but again, it is new, and even to ask a drug-wise person if theyve heard about Gabapentin, they would most likely look at you cockeyed.\r\nI have had many, MANY great trips on gaba, and the only times Ive ever had any bad ones were because I became too emotionally overwhelmed. A very close friend of mine is now stationed in Iraq and having known him for the better 19 years of my life, talking to him via MySpace while on a 4800mg dose really got me overworked and I had a long heart felt cry over how much I missed him and how my life our lives are so much more different from how we looked at them as kids.\r\nWhile on gabapentin, its always good to be around others, listening to music and just doing something creative. Ive walked for almost 8 hours straight around my campus just because I could and it was the middle of the night. I love to play bass guitar or play a solid video game to see how my skills are greatly increased while rocking the gaba, as me and my friends have come to call this wonderful euphoria.\n\n\n"
}