{
 "title": "Won't Eat on it Again",
 "author": "Laramie",
 "citation": "   Laramie. \"Won't Eat on it Again: experience with 2C-B (ID 71022)\". Erowid.org. Feb 25, 2009. erowid.org/exp/71022",
 "substance": "2C-B",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 71022",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2009",
   "Views: 4656",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was at a spiritual retreat/gathering, and this year apparently was 'the year of the psychedelics' -- there were several different types of blotter LSD, X, etc, available.  About five days before this experience I did take 1/2 a hit of blotter acid and had a very mellow trip with few visuals but shamanic experiences -- exactly what I was looking for.  I'd had a fabulous time at the retreat, met lots of new people, and made some very good friends.</p><p>It was the last night of the gathering, and I wanted to have one more psychedelic experience.  A friend had purchased what was purported to be 2C-B, an orange tablet.  I have no idea of what the dosage was.  Others at the gathering had been raving about it, and he didn't want to take it on the plane.  I'd never had 2C-B.   So we dosed together, about an hour before dinner would be served.</p><p>I was very pleased that, as far as I can tell, this chemical was truly 2C-B.  It is possible that I was beginning to 'turn on' about the time dinner was served, because I changed my mind about not eating when I smelled the food -- it smelled divine.  I generally fast before any type of psychedelic because I have a sensitive stomach -- be it LSD, X, shrooms, whatever, I seem to puke.</p><p>About halfway through dinner, I realized I had definitely turned on.  And was very not hungry.  The food had tasted absolutely wonderful, and fortunately I was able to find someone who was late to dinner who was happy to finish my plate.  I let my trip buddy and my caregivers (those who were not tripping but were aware that I had dosed) know that I was departing for the privy, and hiked to the outhouse.  The retreat has outhouses with a view of the woods.</p><p>It was close to sunset and there was a very mild breeze -- the trees were not truly dancing, but watching them move was very interesting.  The guineas and chickens in the grass reminded me of tiny dinosaurs, so primitive yet so alive.  Colors were very intense, the green leaves on the trees seemed to glow.</p><p>I returned to the main part of the gathering and walked by the smoking area.  I am a tobacco smoker so usually smoke does not bother me.  However, someone was smoking a clove cigarette, and the smell was very intense, almost too much, and lingered with me even when I left the area.  I had absolutely no desire to smoke tobacco.  My sinuses were starting to drain, another commonality for me with LSD.  About that time I felt the same feeling I felt the few times I had taken psychedelics on a full stomach or had eaten on them -- I needed to purge.  My trip buddy was having a ball and dinner was divine to him as well, and he experienced no sick stomach issues.  I took my jug of water over to a private area and did the necessary.  I felt much better, and even the act of rinsing my mouth out afterwards felt good.  My very sweet trip buddy was fortunately not a sympathetic puker and stayed within hearing distance.</p><p>As darkness approached the event of the evening started -- a double-feature movie projected onto the barn, and everyone started to meander towards the knoll to get set up.  I retrieved my sleeping bag from my tent and set up.  By this time visuals were very intense -- faces were not quite morphing but certainly were not the same shape that they were normally, and there was a tiny bit of a strobe effect -- not the flanging of DXM but more of a flickering.  One of my caregivers had some very sweet hash and I availed myself of one toke to treat any residual nausea.  My sleeping bag has a silky exterior and felt especially soft and comfortable.  After some very cool 'previews' and a special performance by the artist who created the 'previews', the first movie started.  This was likely about two hours after I had turned on.</p><p>The first movie was a comedy, and visuals were still intense at the end of the movie. Some really sweet soul had brought candy to the movies, and I was able to eat gummy bears and chew some gum, which felt good and was not too much for my stomach.  The second was 'Harold and Maude', and it's possible that due to some of the content of the 2nd movie I may have started stepping on the visuals.  I was still experiencing tracers and mild visuals at the end of the 2nd movie, but I was coming down.  I wanted a cigarette but was only able to handle about 3 or 4 drags.</p><p>We then puppy-piled on the knoll and slept there.  Someone was kind enough to give me space on a futon that had been brought down to the knoll, and cuddling was very nice.  I did not feel any desire for sex, but my partner was not with me at this gathering and I am very into monogamy.  Cuddling with friends, however, was the perfect ending to a great night.  That morning, I woke up, and there was a rainbow -- it started drizzling a bit later, but everyone was thrilled to see a gorgeous rainbow.  </p><p>All visuals were very friendly, the realization that I needed to vomit was something I was able to accept casually and I didn't even feel self-conscious about someone hearing me.  (Then again, it isn't my first rodeo with my sensitive stomach -- I always feel better after if that's what needs to happen).  I felt as though I could sleep after the 2nd movie.  I did not feel the same type of shamanic, introspective feeling that LSD brings -- this is a drug that I would take to have fun more than one I would utilize as an entheogen.  I hope to experience it again.</p>"
}
