{
 "title": "A Trip Too Terrible for Words... WARNING!!",
 "author": "illegal faerie",
 "citation": "   illegal faerie. \"A Trip Too Terrible for Words... WARNING!!: experience with H.B. Woodrose Seeds (ID 7105)\". Erowid.org. May 29, 2001. erowid.org/exp/7105",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "13 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7105",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 29, 2001",
   "Views: 36844",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nmy boyfriend and i, who have been tripping for years, and are very experienced with many different kinds of hallucinogens, have never been freaked out by a trip before, encoutered the worst night of our lives three nights ago.  i wanted to leave this as a warning for anyone who is looking for cheap legal trips like morning glories or hawaiin baby woodrose seeds to proceed with EXTREME caution.  from taking 12-14 seeds, soaked, peeled, ground up and swallowed (as we have done many times before and had pleasant, normal, acid-like trips)... we experienced the kind of trip you would imagine getting from eating a sheet or two of acid.  </p><p>the first tripping sensation was that my eyes would not stay still.  it felt like coming out of a k-hole, or DXM, not a hallucinogenic feeling but a dissasociative effect... although the room was quickly becoming unrecognizable i could not focus on any visuale because my eyes were darting uncontrollably from side-to-side.  i then went into a strange trance- a computer access database that was arranging my subconscious into categories... the chronology of the trip is impossible to get straight but i can remember fragments of what was happening.  there was a  black hole sucking in fractals of light, i felt myself going into the black hole with the rainbows and then it sucked the rest of the room away and dropped me back on the bed.  i was in vivid childhood memories, in mid-memory it would turn me upside down and drop me into another memory.  some were normal and pleasant and others were frightening parts of my subconscious that i honestly cannot decipher even now whether or not they are true or false memories.  i thought i was a create-a-card machine for a long time and recall saying aloud 'its writing all over me', its a hallucination that was recurrent over the night and even into the morning.  the last thing i remember before the peak is feeling like a 2-dimensional line that was part of a series of lines.  i cannot recall anything from the peak which lasted approximately four hours.  the only thing i can say is that i came out of it terrified and feeling the worst mentally and physically that i have ever felt in my life.  i was terrified.  it was the first time throughout the night that i realized the trip was going wrong.  i had tripped three times on the same dose of the same seeds and had wonderful and pleasant trips.  the peak i cannot recall or explain in any way that makes sense, i remember purple, and circles and the rest of that was not solid or coherent in any way.  it was so frightening,  i was crying.  i noticed that my boyfriend had gone into convulsions and i tried to ground him, all he said was 'im trying to come back', he's not sure if he meant he was trying to come back from the peak or if he thought he was dying.  as i was coming down (still tripping harder than i ever have before) i noticed my heart was beating so fast i thought i was going to die.  i threw up thick red blood, and so did my boyfriend while still tripping.  for three hours we felt like our insides were being shredded up and that we were definitely going to die, i thought if i moved i would have a heart attack.   we went through self-blame and self-loathing and thought every bad thought it is possible to think- for 48 hours we could not move or eat.  it was been almost four days now and we still feel like some major damage could have been done.  If you decide to do this- please be careful.  if you are not experienced with tripping- DO NOT DO IT.  Do it inside under safe circumstances with people you trust and try to have some thorazine or compazine (it is kind of easy to get a prescription of compazine- its for nausea and i take it for migraines but i did not have any of it on me that night- and i was too fucked up to know i was tripping anyway until after the peak ended)... that can bring down the trip if it goes wrong.  I am certain that if we had taken a higher dose we would be dead.  Should you do it- start off with a low dose (7 or 8 seeds) and move up, never past 12 seeds!!  Overdose of this even under normal circumstance can result in hallucinations (not just visuals), convulsions, coma and death!  Use extreme caution.</p>"
}
