{
 "title": "The Fog",
 "author": "Retro",
 "citation": "Citation:   Retro. \"The Fog: experience with DXM (ID 71097)\". Erowid.org. May 13, 2008. erowid.org/exp/71097",
 "substance": "DXM",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "550 mg",
   "oral",
   "DXM",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 71097",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 13, 2008",
   "Views: 4493",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was born and raised in Detroit, a place where hope doesn't really seem to float very much.  It is for this reason that I started using DXM.  My entire childhood and teen years were spent in a mostly solitary existence with no friends and two parents who submerged themselves more into their professional lives than anything.  Last Christmas I started to use DXM.  I was on probation and it seemed like the only substance that I could do without testing positive on my drug screens.  No one around me knows that I use DXM and frankly, I'm too embarrassed to say anything about it to anyone.  \r\nI'm not really particular about what I take to get high off DXM, mostly I'll just pick whatever product has the most DXM with as little to no other nauseating ingredients.  I take DXM before I go to work, school and basically before I go to do anything.  I've always been a very depressed person, and have been on several antidepressants and other drugs they use to treat social anxiety.  Before I started taking DXM I wore all of my emotions on my sleeve, I was such a sensitive person that I often failed in the workplace or in any situation bound to become mildly competitive.  I found that with a bottle of soft gels or a smooth syrup, I could surround myself in just the right amount of fog to make the outside world not matter so much to my heart and soul. \r\nThere really isn't much more to say about my history with DXM.  I haven't been taking it for more than a year, and I can't say that it has really helped me as much as it has made me unaware of what ails me emotionally and physically.  While I'm on DXM, negativity and physical ailments such as migraines, which I used to get on a daily basis, seem to melt away into a space I can't quite put my finger on.  Sometimes when I'm exceptionally high I feel as if my entire soul might melt away into that very same space.  The person that I used to be has hidden herself way down in here somewhere, underneath the fog, where things just don't hurt as much.\n\n\n"
}