{
 "title": "We Are All One",
 "author": "Gabriella",
 "citation": "   Gabriella. \"We Are All One: experience with Salvia divinorum (ID 71107)\". Erowid.org. Oct 4, 2013. erowid.org/exp/71107",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2007",
   "71107",
   "Female",
   " ",
   "Not Given",
   "Oct 4, 2013",
   "605",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I bought a one gram bag of what looked like tobacco at an adult book store and took it to a friend's house, where we had prepared by having a small water pipe and a butane lighter ready. I took a very small pinch out of the bag, loaded it into the bowl, and took my hit without hesitation. Little did I know what was about to happen, and it all began within seconds of letting out the smoke. My experience was spiritual and mind-blowing. I have spent the last eight months reviewing the experience and I still come away with new insights on a daily basis. My rendition of my experience is written as I experienced it, mostly in bits and snatches, which is why it is written more like thoughts rather than formal writing.</p><p>It began with a side view of a book, and I could see the pages being turned...though it was more like they were fanned out...perfectly spaced...then, I pulled forward...into the pages...I had become part of the book...integrated, fully....and that was when I noticed that the pages were made of flesh...or it was like the book was one huge block of biomass...and when my friend began to talk to me...outside the vision...he began to rise from the biomass...but the pages never stopped turning...and as each page turned...it would tear a layer of flesh from each of us...each page seemed thick, almost six inches deep...I say 'us' because there were so many living beings...at differing depths within the the flat plane of the page surface...and that we were all 'one'...</p><p>and as each page turned and tore away at us...it would leave me feeling raw, exposed...vulnerable...but without any real pain...just fear...at what I was seeing...and the huge realization...within moments of watching...that the turning pages were eternal...and would never stop...and my feelings of fear, horror, wonder, awe, helplessness, being part of something so huge and overwhelming...were magnified and expanded by the feelings of everyone...because we were all connected...</p><p>My instinctual reaction was to fight it...to try and escape...then I began to sense that as each page turned...that I was being freed...even though it was in a way that exposed me and made me scared...I was being released...slowly...with the turning of the pages...and I reached out to my friend...who I could see just out of my reach...to offer him my hand...thinking that I would help to release him...and when our fingers touched...the sensation rippled through the whole of us all....</p><p>Thank goodness my friend was there....I could hear his comforting words...telling me that it was okay...that I was just fine...to just relax...so I stopped thinking about the huge force that seemed to be pounding away at my being...pushing me down, before pulling me up...as the next page ripped part of me away...and finally, I consciously released my illusion of control...which, in turn, evaporated my fear...</p><p>So the pages kept turning...and I turned to look behind me...and realized that the book was as tall as the sky...and I was miles away from the surface of the earth...which disoriented me for a moment...</p><p>Then, I began to pull away...like an out of body experience...pulling back and upward...so I could get an aerial view...and I could see that the book was really a huge set of words....but only three words...as tall as the sky...and reaching into infinity...the words were... 'IT'S LIKE THIS'....which seemed nonsensical at the time...but which I later understood completely...my mind is so simple and straight-forward...that it really couldn't have said anything else...lol...</p><p>When I finally came out of it...I was so freaked...I instinctively grabbed for the bag of Salvia...to keep my friends away from it...protectiveness...or something...most probably because I needed to impress upon them the power of it before they ever considered touching it...like I needed them to know what a huge thing they were about to touch on...</p><p>For about 20 minutes afterwards, I stumbled around the living room, trying to get my faculties back. I realized right away that Salvia shut down my physical being and took me to that place that could only be found inside my mind. Things seemed to go in and out of focus, so I made my way to the bathroom and splashed water in my face, which really seemed to help. I remained in an elevated state of awareness for roughly two hours after, which made the world seem clearer and more sharp in contrast. For days and weeks afterward, I regarded the world with new eyes, realizing all the things I had taken for granted. I did not find the use of Salvia to be pleasant at all, but I did find the experience to be enlightening. All in all, this experience was positive, but I don't wish or find the need to repeat it for a good, long time.</p>"
}
