{
 "title": "H. B. Woodrose Can Kill You... Use Caution",
 "author": "Almost Poisoned",
 "citation": "   Almost Poisoned. \"H. B. Woodrose Can Kill You... Use Caution: experience with H.B. Woodrose Seeds (ID 7110)\". Erowid.org. May 29, 2001. erowid.org/exp/7110",
 "substance": "H.B. Woodrose Seeds",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7110",
   "Not Specified",
   " ",
   "Not Given",
   "May 29, 2001",
   "Views: 86668",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>argyreia nervosa seeds- or hawaiin baby woodrose- those are what we've eaten to trip... this may be why they are bad.  the bark on the outside of the seeds contains cyanogenic glycosides- which even if peeled can leach into the seed during the soaking process or can exist within the seed itself naturally.  i really suggest not taking these and if you do, be sure to boil them in hot water and peel them while they are still moist( this can kill the enzyme that initiates the poison- but not always entirely successful in doing this) get ALL OF THE BARK AND HAIRY STUFF OFF!!  I still don't suggest trying this. i don't know why they websites that tell you how great they are don't warn you about this kind of thing:</p><p>CYANOGENIC GLYCOSIDES- Most people have heard of cyanide at one time or another, but few ever realize that such a deadly compound can be very easily derived from innocuous appearing 'natural' sources. Basically, cyanide and cyanogenic glycosides are proof positive that although something is natural, it still can hurt you. This is a group of chemicals found naturally in about 2050 plant species. These are glycosides of plant origin that specifically affect the heart. The ingestion of these chemicals can lead to cyanide toxicity. Effects include abdominal pain, diarrhea, bloody diarrhea, hypertension, tachycardia, tachypnea, respiratory distress, cherry-red blood, vomiting, bloody vomiting, lethargy, hallucinations, seizure, coma and death.</p><p>Members of the rose family, Rosaceae, often contain compounds called cyanogenic glycosides. These compounds, when broken down in the body, liberate cyanide, one of the most toxic substances known to man. It's lethal dose is only 1 mg/kg body weight. Luckily for us, the concentration in these plants is usually far below the toxic dose, and the breakdown of the cyanogenic glycosides is often not complete. However, several species in common cultivation do have high concentrations of the glycosides in their seeds, and eating these seeds can (and has been) fatal. These toxic seeds include apple seeds, argyreia nervosa seeds, cultivated cherries, peach and apricot pits, almonds, and pears, which are all members of the rose family. It is only in the crushed, moistened seed which releases an enzyme can the hydrolysis of amygdalin be effected.  Soaking and grating release the enzymes that can turn cyanogenic glycosides to active cyanide inside the body.   The leaves of wild cherries will also contain the poison. Some other common plants which can generate cyanide include hydrangeas, tropical lima beans (not the white american ones), bamboo sprouts, sorghum shoots, and cassava tubers. Cassava, in particular, is very toxic, and cannot be eaten raw; this is important since large parts of the world use cassava as a main carbohydrate source.</p><p>Seek medical treatment immediately on any suspected case of poisoning.</p><p>*these seed have caused myself and some others a great deal of mental and physical pain, as well as a near-death experience, please post this, it could save someone's life*</p>"
}
