{
 "title": "Lowly Thoughts",
 "author": "Lizardking",
 "citation": "Citation:   Lizardking. \"Lowly Thoughts: experience with Kratom (15x extract) (ID 71110)\". Erowid.org. Jun 13, 2008. erowid.org/exp/71110",
 "substance": "Kratom (15x extract)",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.0 g",
   "oral",
   "Kratom",
   "(tea)",
   "  T+ 11:30",
   "1.0 g",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 71110",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 13, 2008",
   "Views: 18690",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLegal highs have had my interest for the last several years since I first came across an article on Salvia (More so now that my employer does drug testing). Once I purchased and tried Salvia I was mesmerized and have wanted to continue finding new and interesting legal highs. I finally ordered several different types of Kratom and the first came today. A 5 gram bag of 15x extract that to me resembled true Snuff, snortable tobacco for anyone who doesnt know. \r\nWell after my girlfriend left for work I decided to give this stuff a whirl and see what its all about. I have read numerous amounts of information on the internet that lead me to believe that smoking it is a waste of time and that a tea is the way to go. I sat down and not having a scale measured out 1 gram as I like to keep doses low when I havent tried anything before. I took the Kratom and mixed it will just a little bit of water in a coffee mug. Id say about an 1/8 of a standard coffee cup. I put it in the microwave and heated it up. I let it cool for several minutes and got a soda from the fridge as I have read that the taste is anything but pleasant. \r\n11:30 am:\tBegan drinking my tea mixture\r\nThe tea is bitter but I didnt find it terribly bad, especially when chasing with soda. Tried a bit of honey as some suggest, and this helped counter the bitterness.\r\n11:45 am:\tStarting to feel what I think is the effect. I seem to be more awake than I had been.  \r\nI get up and clean out the coffee cup and realize that I may want to use something clear rather than ceramic and black as I see that there is still quite a bit in the bottom. I put just a bit of water in the cup and stir and drink to get the rest out. Still feeling normal for the most part with just a hint of energy. I surf the net some and think about getting some food in my stomach but decide against it as I dont want it to have an effect on the Kratom. \r\n12:15 pm:\tEffects of mild sudation felt and oddly still energetic though but mind is narrowed. Better focus on thoughts.\r\nI had been contemplating taking some more but I went to the restroom and when I was coming out I realized that it had hit me. Kind of a stoned feeling without the intensity that I usually felt in the past from MJ. My mind is still pretty focused and energy seems to be there but not all at the same time. I want to sit and run all at once. Maybe a Speedball effect.not sure as I have never tried that. \r\n12:30 pm:\tDefinitely euphoric. Great mellow feeling. Starting to wonder if it will get even better but this is nice. \r\nIm enjoying myself.contemplating cutting the grass but opt for Guitar Hero 3 instead. At the very first moment I start to play I cant get my fingers coordinated but once I concentrate I seem to do just fine maybe even slightly better than normal. I realize soon that I can think deeply about something yet still play the game just fine almost like my eyes and hands are doing one thing together while my brain is off in the distance..kind of odd. \r\nI take a break from the game after about a half hour and remember reading that Kratom usually lasts several hours but I would really like to see if I can make the effects stronger as they seem to have plateaued. \r\n1pm:\t\tBegin to brew another 1 gram.\r\nThis time I brew with the same amount of water but add plenty of honey to it as soon as I pull it out. Grab my soda as well. Didnt let it cool this time as I wanted to see if it might be better warm. To my surprise it wasnt that bad. Dont get me wrong though, its not something I would want to drink without knowing that it was going to have an effect on me.  I drink it down and definitely realize that I will be preparing this in glass as there is more stuck to the bottom. \r\n1:30pm:\tNo boost yet. \r\n1:50pm: \tSensations getting stronger. I feel warmth and a swaying feeling. Very much sedation at this point as opposed to energetic. \r\nI realize that at this point that Kratom is pretty good for a mellow high. \r\n2:15pm: \tNausea\r\nIm starting to feel the nausea that a lot of people talk about. I probably shouldnt have eaten the sandwich that I did. I was fine till then. Its not terrible nausea but its there and slightly unpleasant. \r\n2:30pm:\tNausea fadingstill very euphoric and mellow.\r\nAll in all I would have to say that my experience with Kratom has been a good one.\n\n\n"
}