{
 "title": "2D Cartoon and All the Colors Washed Out",
 "author": "Trendal",
 "citation": "   Trendal. \"2D Cartoon and All the Colors Washed Out: experience with Cannabis (ID 7114)\". Erowid.org. Sep 27, 2002. erowid.org/exp/7114",
 "substance": "Cannabis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "0.5 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 7114",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 27, 2002",
   "Views: 6895",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI should start off by mentioning that pot can have a WIDE range of effects on me. Anything from a light stoning affect, to a three hour long 'trip'. I call it a trip because I DO hallucinate off pot sometimes.</p><p>A friend of mine asked me and my room mate if we wanted to go toke with her. We both said yeah. We walked down to the river by campus and sat on one of the park benches to smoke. It was night, about 10pm, and very windy. Pretty cold, too.</p><p>I took a hit of the first joint and held it in as long as I could, about 30 seconds. I exhaled and immediately took another long toke and held it in for the same ammount of time. By the time I passed the joint to my room mate, I could already tell it was going to be one of 'those times'. After coughing for about five minutes while my head buzzed like crazy, I settled into a strange dream-like state. It's the same feeling I get coming down from shrooms. It feels like I'm waking up from sleep every 5 seconds or so. Or like I'm not actually part of time. I can remember everything that happened, but nothing that happens regisers with me UNTIL I remember it. It's hard to explain. I don't know how long we were out there, but it felt like hours. The wind was blowing my face off, and I felt like if I turned my head I would see my flesh blowing away with the wind.</p><p>Eventually (what seemed an eternity, was really only 10 minutes) my friends were done and got up to leave. I was very cold by this time, and my heart felt like it was beating in rhythm with a hardcore techno song. It didn't feel good. So we started walking back to rez, and I ended up walking a few steps behind the other two as they talked. I still couldn't get my mind to work 'in the moment', I just kept remembering everything that was happening. Then I snapped back into time, but my vision went all funny. Everything looked 2D and all the colors were washed out, just like in a cartoon. It looked like I was watching the Simpsons. The walk seemed to take forever, but eventually we got back to our friend's room and sat down to watch TV. The next few hours are a complete blank to me. I apparently went to the other end of rez to visit a friend, but I don't remember that at all. The only thing I can remember is all of a sudden realizing that I was in my friend's room, watching the Simpsons.</p><p>This has happened to me at other times, but not nearly as strong as that.</p>"
}
