{
 "title": "Fox Hunt",
 "author": "Croc_HunterDM",
 "citation": "Citation:   Croc_HunterDM. \"Fox Hunt: experience with 5-MeO-DiPT (ID 7124)\". Erowid.org. Jul 15, 2002. erowid.org/exp/7124",
 "substance": "5-MeO-DiPT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "5-MeO-DiPT",
   " ",
   "5.0 mg",
   "insufflated",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7124",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 15, 2002",
   "Views: 6699",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nTrip report: 20mg 5meoDIPT, oral dose, ~10mg \r\ninsufflated.  Subject, male, 21, 160lbs, lots \r\nof psychedelic experience.\r\nHello!  I'm a brave chemical researcher, always\r\ntrying to push the envelope for the good of everyone.\r\nEh heh.  Actually, what I did last night resulted in\r\na great trip, but the route which I took was quite \r\nreckless!  Don't mess around with research chemicals \r\nunless you have a scale that can measure the usually\r\nvery small doses which you need.  A friend of mine, a\r\nvery magic lady, lent me some 5-MeO-DiPT\r\nand I decided it was a must-try!\r\nAt 10pm I took what I had eyeballed to be a twenty\r\nmilligram dose of 5-MeO-DiPT, in a gelcap.  The amount of\r\npowder needed was very miniscule, and I must take this\r\nopportunity again to warn that these small amounts\r\nreally should be weighed precisely.  At about midnight,\r\nI shook out a small amount of powder and divided it into\r\nwhat I 'thought' 5mg looked like.  I got two very small\r\nlines, those of you into regularly snorting things would\r\nnot be satisfied with the size of these lines, but this\r\nwas no narcotic, this was a potent psychedelic!  The \r\npowder didn't burn much at all, and the small amount\r\nof chemical taste in my drip was more than tolerable.\r\nI had noticed effects begin to start a mere half hour\r\nafter dosing.  I had fasted the entire day except for\r\none or two light snacks, so I attribute the rapid onset\r\nto this.  There was little nausea, just barely \r\nperceptable, but this soon faded as the trip began.\r\nI determined to boost my effects and thus insufflated \r\nthe small lines two hours after dosing.  Normally if\r\nyou redose on this chemical, the literature says you\r\nhave to take more, but I think that up the nose results\r\nin a faster onset and better bioavailibility.  \r\nAt 12:30 the effects fully came on, with first a set of\r\nlow-hued visual distortions, followed by bright, \r\ncolorful tryptamine hallucinations, very like what\r\none would see on the traditional trips, acid, shrooms,\r\nmorning glory, but much cleaner and more intense.  The\r\ncolors were really something, it was a continually\r\n shifting spectrum, the whole of my range of site\r\ncycling the colors in response to some rhythem I could\r\nnot comprehend.  During this come up and plateau of \r\nthe drug, I felt a few mind effects of tripping,\r\nbut overall I was very much in control at all times.\r\nI am pretty experienced with psychedelics, and moreso\r\nwith with the OTC favorite DXM, so this may have \r\nsomething to do with the amount of control I maintained.\r\nThe visual distortions were really something else, fully\r\n3-D bumps and ridges appearing out of no where, objects\r\nswinging and flexing, etc.  At one point I stared\r\nintently at my beige carpet, and was amazed to see it \r\nturn into flowing sand dunes!  \r\nAt about 3am I noticed a definent decrease in the\r\neffects of the 5-MeO-DiPT.  At about this time I started\r\nto smoke a lot of weed, and also began to feel the\r\nbody load come on.  I got a few cramps up in my abdomen,\r\nlike near my belly button for some reason.  That was \r\nthe worst of it, other than a general achey feeling all\r\nover, cleared up easily by ibuprofen. \r\nAt this point, I actually started eating food!  The bong\r\nhad made me hungry, so I made several trips to the \r\nkitchen.  Because I think vitamin C always helps trips\r\nalong, I grabbed and orange and a slice of bread and \r\ndevoured both in no time flat.  Then I went back and\r\ngot a pear, and then a banana; luckily we eat a lot of\r\nfruit in my family!  I think my body preferred this\r\nhealthy snack over anything else I could have eaten, \r\nalthough maybe the majority of fruit contributed\r\nsomething to my cramp, who knows.  \r\nAt 5:15am I was still tripping a little bit and getting \r\nmild visuals, so I decided to turn in, figuring I was\r\nsleepy enough from being awake so long that I wouldn't\r\nneed a sedative.  I expected tryptamine insomnia tho,\r\nand got my share of it.  The hallucinations with only\r\nnight lumination coming through my shaded windows were\r\nvery cool, with my shadows 'freezing' in my line of\r\nsight.  I tossed and turned a lot, mostly to try to\r\nappease my cramped abdomen.  However by about 7am I\r\nfell asleep, and woke up at 11:30am with the aid of\r\nmy alarm clock.\r\nIt's now almost two the day after,\r\nand I still feel kind of muffle-headed and dizzy. \r\nLuckily I don't think that I really overdosed on this \r\nsubstance, and if I did, the OD wasn't harsh or totally\r\nbad.  Since I weighed out my doses just by eyeballing,\r\na very risky way to do things, there's no way really to\r\nsay how much I took, although in my research I see\r\nthat the average dose is at the high end 20mg, and\r\nat the insane end 40mg+.  This was a very enjoyable\r\ntrip, and I've never had visuals this good!  This was my\r\nfirst real experience with a research chemical, and I\r\nmust say that I'm really impressed.  My hat goes off\r\nto our country's chemists, always preparing new and \r\nexciting (and legal!) substances for the exploration\r\nof conciousness.  I'd like to throw in my voice and\r\nsay that 5-MeO-DiPT is very enjoyable, and I'd like to see\r\nmore work done on this and other chemicals so that they\r\nare more mainstream and safe and no longer need to be\r\n'reasearched.'\n\n\n"
}