{
 "title": "Heroin Overdose",
 "author": "Laikalover",
 "citation": "   Laikalover. \"Heroin Overdose: experience with Heroin (ID 7125)\". Erowid.org. May 31, 2001. erowid.org/exp/7125",
 "substance": "Heroin",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "IM",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2001",
   "7125",
   "Male",
   " ",
   "Not Given",
   "May 31, 2001",
   "Views: 93287",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first OD.</p><p>I had been using heroin for about 7 years and had recently started on methadone treatment. Methadone combats the effects of Heroin, meaning that while on methadone you will not feel the effects of any Heroin you take. This is because the methadone saturates your Opiate receptors and the Heroin cannot fill them.</p><p>[Erowid Note: We believe this statement is not really correct.  From what we understand of the issue, people on methadone maintenance sometimes do use heroin and get effects from it.]</p><p>When I first started on my methadone treatment I did not know this. Several weeks into the treatment I decided to buy some Heroin. I bought 10 bags. I decided to inject three bags as that was what I precviously needed to get high. But it did nothing for me at all. I knew it was Heroin, it was real, so I came to the wrong conclusion that the methadone must have made my tolerance higher. So I decided to take five bags, cooked them up and injected them. I felt something strange, it wasnt a high but rather a blood rush to the head, I felt itchy all over.</p><p>This was a wrong feeling. I knew from experience that if I had taken a little too much heroin that I should get up and walk around, try to find people. So I got up off my bed and started to walk around, within five seconds I knew that I was in serious trouble. I fell to the ground. My vision started to collapse, I could see, then I couldnt, this happened in waves. My chest felt very tight. So tight that I couldnt breathe. I was making all sorts of noises trying to breath. I tried to get as much oxygen as possible but I could only take very short breaths because my chest was so tight. So I breathed quickly. During this time I was trying to keep myself awake, I was trying to get to my feet, trying to pull myself up by holding the bed and the wall, falling all over the place, my legs like jelly, my chest tight, my vision collapsing. At this time I was convinced I was going to die and said a prayer, I am not usually a religious person, in fact I am of no religion, only that of love, kindness and happyness. But as with all people in a circumstance like this, when faced with what you believe is certain death I think that you automaticaly pray, its just something that you do.</p><p>Eventually I managed to get over all this, it lasted about 10 minutes. A very bad experience. What I feel so scared about is that I resigned myself to the fact that I was about to die. This is a frightening thought to me. I only hope that this never happens again. People be carefull and always when taking heroin plunge only half of it in first, just to make sure you know the strength and your tolerance.</p>"
}
