{
 "title": "Widescreen, High-Def Afternoon",
 "author": "Jasmine",
 "citation": "   Jasmine. \"Widescreen, High-Def Afternoon: experience with Piracetam (ID 71387)\". Erowid.org. Mar 22, 2012. erowid.org/exp/71387",
 "substance": "Piracetam",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2400 mg",
   "oral",
   "Piracetam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "71387",
   "Female",
   " ",
   "Not Given",
   "Mar 22, 2012",
   "3896",
   " "
  ]
 ],
 "report": "<p>Back in 2002, I was the mother of 2 infants and the wife of a husband with serious health issues.  In addition, I worked full-time as a database programmer/analyst consultant.  It was quite a stressful time, and my mind was jello!  I was unable to concentrate at work, and my job was quite intellectually demanding.  I had done a bit of research into the so-called smart drugs, and after some serious research on the racetams, I decided to try piracetam. When the box came in the mail a few weeks later, I was nervous and excited.  I took one of the blister packs with me to the office the next day, and decided to take 3-800mg tablets after lunch.  Normally at that time of the day my mind was pretty shot, so I figured it couldn't hurt.</p><p>After about an hour, it felt like the curtain had been lifted on a wide-screen high-definition world. Everything seemed clearer, fresher, and for the first time in months, I did not feel like I had marshmallows stuffed in my cranium.  The effects lasted several hours.  I did not have any adverse reactions.  I kept using piracetam when I needed to clear the marshmallows from my head, and it never failed to deliver.  I reordered it several times, but finally stopped ordering it when my packgages began getting opened by Customs.  They never confiscated my piracetam, and I know it is legal to possess, but nonetheless, I didn't want to run the risk.</p><p>After a 6-year hiatus, I just placed another order tonight.  I can't wait to see the sequel to the high-def show I caught 6 years ago.  Fingers crossed!</p>"
}
