{
 "title": "Suddenly Hits Me...Boom!",
 "author": "Willy Fargo",
 "citation": "   Willy Fargo. \"Suddenly Hits Me...Boom!: experience with Cannabis (ID 7144)\". Erowid.org. Aug 28, 2002. erowid.org/exp/7144",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "7144",
   "Male",
   " ",
   "Not Given",
   "Aug 28, 2002",
   "8857",
   " "
  ]
 ],
 "report": "<p>\nIt was a usual Friday for me, do nothing all day then DJ at a dodgy little club in a town near where I live.  I had been feeling a little run down, as all wasters do, but I was ready for a night of hedonistic pleasures, i.e. cheap booze, cheap women and of course, cheap drugs.  I remember thinking that I could only handle some fine weed that nite, as it helps me calm down after I have played my sets, so, the night progressed in the all too familiar vein.  Then, an industry associate, lets call him 'geezer' approached me after my set and asked me if I would like to purchase some of his extraordinary triple strength Thai bush weed.  Of course I obliged and bought some of this stuff, £30 an eighth I might add.</p><p>The lights came up and I ran off into a vacant alleyway to skin up three big joints, with barely any tobacco in any of them.  I smoked one on the way to the taxi place.  This stuff tasted like horse hair, you could feel the thick smoke particles stick to the insides of your mouth, tongue and throat.  After that spliff I was buzzing in a way I had never felt before, a mild but pleasant throb that started at the front of my skull, then worked its way to my vision, which was bouncing up and down, distorting everything I saw, giving objects a crazy, angular rendering. </p><p>'This plant is evil', I remember stuttering in the taxi, but the driver took no notice, more concerned with the rip- off fare he was about to charge me.  I stumbled out of the taxi, left my record box behind my house, then proceeded to a secluded country lane near my house to finish off these two wicked white sticks I had prepared for myself.  At this point, the high from the first J was peaking, giving me a sense of extreme questioning of the world.  I forgot about this as I smoked the second biffter, who's chemical content hit me on the first toke.  I was sure this shit had been soaked in acid or ketamine, which spurred me on to take enormous drags and hold them in.  Bad idea, but not at the time.</p><p>I quickly finished it and chucked the butt, ready to spark up the third chapter.  I remember feeling a little disappointed because the high stayed basically the same even after the third joint.  On my way back to my house, the questioning thoughts came back, but stronger.  Who am I?  Why does the wealthy part of the world watch this strange flickering box every day?  Then it got strange- I actually believed that television was a government ploy to crush the human spirit, getting us hooked on the electric waves, distracting us with entertainment while they steal from our pockets.  That may sound silly but I believed it at the time, in some respects I still do.</p><p>Soooo, I got in feeling paranoid and wary of mine and others lives, but still found a way of using my mobile phone to text a friend of mine.  As I sat back, eyes wide open staring at things, I suddenly noticed this giddy swimming feeling in my head.  I began to feel sick and started retching but nothing came out, so I stood up and walked into my hallway.  My dad was in bed at this time so I did everything in my power to not wake him up.  A numbness started to develop within my body, crossed with euphoric waves and pulses.  This shit was coming on fast.  Then, with the grace of a gorilla, I collapsed to the floor, losing total control of my arms and legs, I couldnt fucking move! </p><p>For some reason, I wasnt scared, I just stared into space, hoping to regain control.  I cant remember how long I was down, but afterwards I was totally fine, apart from being very stoned.  I havent seen 'geezer' since that night and I still watch TV, much to my disgust.</p>"
}
