{
 "title": "Worst Night of My Life - Coricidin C&C",
 "author": "unknown",
 "citation": " unknown. \"Worst Night of My Life - Coricidin C&C: experience with DXM (with CPM) (ID 7146)\". Erowid.org. Jan 15, 2003. erowid.org/exp/7146",
 "substance": "DXM (with CPM)",
 "bodyweight": "95 lb",
 "header": [
  [
   "DOSE:",
   "6 tablets",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7146",
   "Female",
   "",
   "Not Given",
   "Jan 15, 2003",
   "12635",
   " "
  ]
 ],
 "report": "<p>\nAbout a year and a half ago I started taking Coricidin Cold and Cough . One of my friends, who had taken it before, told me to try it with her. The first time I ever did it I took four. I fell asleep from it and when I woke up I was high as a kite. It scared me, but then again I also liked it. So I did it about three or four times after that. Nothing bad ever happened.</p><p>Last year we threw a party over at one of my good friends house. The second night of the party we couldn't find anything good to take so we decided to go buy some boxes of Coricidin. We bought about 5 to 6 boxes. I took 6 this time, which I had never done before, and other people took 16 apiece.  </p><p>That night is such a blur to me, so I can only tell what I remember and some that was told to me. A lot of people at the party started getting sick including me. I remember hearing the toilet flushing like every 5 minutes. I was laying in a bed across from the bathroom praying whoever was in it would get out so I could go. Finally the bathroom was empty and I ran for it.  I started to vomit. One of my friends came in there to help me because I couldn't stop being sick. That is when I started to tell all my friends that I was dying.  I felt very hot then I felt very cold. My body felt as if it was being charged up like I was being shocked. I really can't remember all that happened that night. I just remember telling people that I was going to die.</p><p>The next morning I woke up high as a kite. My whole body ached and I felt very nauseted. All I wanted to do was to go home and go to bed. I knew the Coricidin would make me very dehydrated, that was normal, but I was so dehydrated I could barely talk. I didn't find out until the next day exactly how much I was sick. My friend who helped me told my I threw up 3 to 4 times in the night and I only remember one time. She said she was very scared for me and everyone else at the party because there was like 8 people who also got sick from it. </p><p>Never again have I taken Coricidin. For one thing it is for people with high blood pressure. Also, that night I could have hurt myself from being stupid and wanting to get high. I suggest people not to use Coricidin because you might not be as fortunate as I was, you could die.</p>"
}
