{
 "title": "Getting the Most from it",
 "author": "Potion Maker",
 "citation": "   Potion Maker. \"Getting the Most from it: experience with Sildenafil (ID 71495)\". Erowid.org. Jan 2, 2012. erowid.org/exp/71495",
 "substance": "Sildenafil",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Sildenafil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1999",
   "ID: 71495",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 2, 2012",
   "Views: 13279",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe first time I took Viagra® I broke all my own rules for trying out a new drug (except that I got it from someone I trusted not to poison me). Normally I would have gone to one of the drug resource sites and read up on proper dosage and other details to help me get the most out of the experience. Then I would have talked with more experienced friends to see how it worked for them. What happened instead is that an older friend of mine, who actually had erectile dysfunction and was prescribed Viagra, gave me one of his pills and said, Try it. So I did.<br>It turns out that first dose of Viagra was 100 milligrams. Since I now typically use doses as small as five milligrams to good effect you can imagine this turned out to be way too high a dose for me. First I got a mild psychedelic effect, which was not a surprise to me since Ive found all the most effective aphrodisiacs lean in that direction. Then it felt like my pelvic region filled with blood. I swear I sloshed when I walked. Any thought of sexuality or any sensuous touch from my lover made my lingam spring to attention. Yes, it worked for me. I had a busy night. I was also relieved when the effect wore off.<br>Since that first experience Ive learned to use Viagra in minidoses. I really dont need Viagra, but I do love to use it for several reasons. It diminishes concern that I wont get an erection at all so its a powerful placebo if nothing else. My normal erection is almost always adequate to the task, but the Viagra gives me a fully erect lingam over the entire lovemaking session, as opposed to one that rises and falls depending on the amount of stimulation in the moment. This really helps out if you and your partner like to change positions a lot or if you like to switch from coitus to oral stimulation and back, etc. Sometimes an emotional comment or even an off-topic thought during lovemaking can deflate an otherwise upright penis. Under the influence of Viagra its more likely an erection will stick around so its available when called upon.<br>So, how did I go all the way down to four or five milligram doses when the smallest Viagra pill is fifty milligrams? First and foremost, Im very sensitive to most drugs, so I imagined a smaller dose would work for me. Also, Viagra is expensive, and Im a cheapskate. And third, my partner and I have done a lot of work investigating aphrodisiacs, so Ive become a bit of a local expert, and Im able to do some fairly objective and repeatable testing. Im also damn good with a pill cutter. Its worth noting that Viagra may soon be available in twentyfive milligram pills.<br>The biggest secret for getting more effect with smaller doses it letting the medicine dissolve slowly in the mouth instead of swallowing it. You can put it under the tongue or between cheek and gum, whichever you prefer. The main point is to let it dissolve slowly and spend as much time in contact with your mouth tissues as you reasonably can. Then just swallow. By allowing the drug to absorb into the mucous membranes directly you speed up the process of getting it into the bloodstream and can often achieve a good effect within fifteen minutes. Less of the medicine is lost in the digestive tract with this method.<br>Now, about that pill splitter. I use a cheap splitter like you can get for a few bucks at any drug or discount store. These have a little V molded into the plastic that holds the pill, and a sharp blade you bring down on top of the pill to cut it. The first cut with Viagra is the hard one. Place the pill so the blade will cross the pill on the short side. Bring the blade down to the pill slowly so it doesnt move on you. If the pill is in position make a quick press on the tool to snap the pill in two. Youll wind up with two nearly equilateral triangles. Now  take one of the pieces and place it in the locator triangle with the original point down. Pop the pill in two. You now have quarter pills that are approximately 12.5 milligrams each, assuming you started with fifty milligram pills to begin with. You can keep going if you want even smaller doses. Turn a quarter pill on edge and split it down the middle. This is surprisingly easy to do. Now you have slender wafers of about six milligrams each. I promise you that I get a usable effect from one of these wafers. Your mileage will certainly vary. Every body processes drugs differently.<br>I suggest you start out with a twentyfive milligram dose and see how it works for you. If you like what you get, try cutting that in half. If that also works, cut it down some more. Youll eventually come up with a dose that works for you and makes the most of each pill.<br>Besides the Viagra benefits mentioned above, there are others. Refractory time can be greatly reduced. Thats the time it takes to regain a new erection following orgasm. This can come in handy for extended lovemaking or in a group sex scenario. The effects of Viagra also last a lot longer than many folks are aware of. Eight hours or more are often reported which can be valuable if you like to take advantage of morning wood. <br>Caveats and warnings: Viagra is safe to take in combination with many other drugs, especially the common recreational drugs, but it should be noted that experimenting of this kind is rarely documented and youre very much on your own. I wouldnt recommend Viagra if youre taking heroic doses of anything until after you come back down to Earth in a substantial way. Viagra should never be taken in combination with heart medications or by heart patients at all without first discussing it with your cardiologist. Viagra use has lead to death so be forewarned. One typical cause of erectile dysfunction is heart disease, so get checked out by a doctor before trying Viagra or any other aphrodisiac, especially vasodilators if you experience erectile dysfunction. Also, this article is not written by a physician or posted as an advertisement by any drug company. It is for informational use only. Always use medicines safely.\n\n\n"
}
