{
 "title": "For Nerve Pain and Enjoyment",
 "author": "Libertarienne",
 "citation": " Libertarienne. \"For Nerve Pain and Enjoyment: experience with Gabapentin & Flexeril (ID 71494)\". Erowid.org. Nov 11, 2009. erowid.org/exp/71494",
 "substance": "Gabapentin & Flexeril",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)",
   "",
   "10 mg",
   "oral",
   "Pharms - Cyclobenzaprine",
   "(pill / tablet)",
   "",
   "100 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "71494",
   "Female",
   "",
   "Not Given",
   "Nov 11, 2009",
   "25070",
   " "
  ]
 ],
 "report": "<p>I have compressed nerves in my spine due to degeneration of the discs between my L4, L5 and S1 vertebrae. This causes pain to radiate down my legs nearly constantly, and so my doctor gave me Gabapentin to help alleviate that discomfort. I read up on it before taking it, and I found that people actually used this drug for fun. I was surprised and kind of excited to try it! I was directed to take 100 mg at bedtime to start, and then titrate the dose up to 100 mg 3 times a day. I decided I would be a little naughty and try it a few hours before bedtime to see if it was cool or not.</p><p>I took 100 mg and called a friend. We talked for an hour, and during that phone call, I found myself stumbling over words and feeling very loose and comfortable. I was stoked! I finished up my conversation and took a walk to the drug store up the street to get a few things. The walk was so nice, and I felt like I wanted to be friendly to strangers--which is not something I normally feel; I am pretty anxious in public places. I felt a marked lack of inhibition that normally follows me like a raincloud. </p><p>When I got home, I chatted with my husband for a bit. Ten pm rolled around (my normal med time) and I took my normal dose of Flexeril and Naprosyn and another 100 mg Gabapentin...just for shits and grins. Thirty minutes later, I was feeling super. I was just easing into a pool of happy relaxation...if that makes sense. I would slur my speech a bit and felt like I was on lots of Valium and a little codeine. At 11 pm I decided to go to bed. It took a bit to find the 'perfect' position to get totally comfortable, but when I got there I just melted into the sheets. I felt like I could just drift off on a cloud to dreamland right there. </p><p>I had some weird dreams that were pretty cool and vivid, and I woke up feeling pretty refreshed. The best part was I had NO ACHINESS! My knees, back and legs felt fine for the first time in months.  I LOVE Gabapentin. I hope it continues to help with the pain.</p>"
}
