{
 "title": "Not Available at the Moment",
 "author": "Faceless",
 "citation": "   Faceless. \"Not Available at the Moment: experience with Levmetamfetamine (ID 71513)\". Erowid.org. Jul 10, 2013. erowid.org/exp/71513",
 "substance": "Levmetamfetamine",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Levmetamfetamine"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 71513",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 10, 2013",
   "Views: 1288",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was really bored today, and had to go to work, and I really cant stand going to work and putting up with the people there, so I decided to go on a Medicine cabinet run. I found some pills, tried a combination, but alas, nothing. I figured I could get by on a small caffeine buzz. I drank 10 full sized glasses of Pepsi. Still nothing. </p><p>When I was going on my Pill Raid, I found a Vicks Inhaler, since my dad recently had a bit of a flu. I searched the active ingredient, and it was levmetamfetamine. Found out that the Cotton cylinder inside the Inhaler was soaked in this stuff, and it was related to Amphetamines. I figured I'd save it for after work. </p><p>When I got home, I opened up the Inhaler and got the rod out. It was about 3/4' long, and pretty thin. Just saying now, its going to taste like shit. I cut it in half so it would be easier to swallow. I downed each one with a large swig of Rootbeer, since the menthol and camphor are terrible tasting.</p><p>I felt the effects around 30 minutes after I took it. I felt great about myself, and everything that I touched felt special. My mind was completely focused on whatever I was thinking of, but at the same time it would wander off sometimes and focus on something else. I caught myself rubbing my newly shaved head for around 15 minutes, just spaced out. I didn't feel like doing anything. I just sat on my Computer chair, watching TV and posting on a forum. My head is so calm and all my time is being devoted to thinking. Certain things seem more important, like as I am typing this, the white box seems to zoom toward me and I have EXTREME tunnel vision on this window. I notice my heart is beating a bit faster, but nothing major. </p><p>Despite the terrible taste, and the toxicity of eating too much cotton, camphor, and menthol in large doses, I will definitely try this again. The inhaler I used this time was opened and used, so I can only imagine what the effects of a brand new one would be. </p><p>It is classified as a stimulant, but I feel like everything is slower and all I want to do is sit around. I have slightly better cognitive abilities, but in no way do I feel like running around. </p><p>At around $3 a pop from Drug stores, its not like its going to break the bank.</p><p>I'm not 100% sure that the Caffeine had anything to do with what happened, but I had to mention it because I did take some.</p><p>It is now 1:00 AM, and I took the levmetamfetamine around 11, and I can still feel the effects. I'm definitely going to pic some more up tomorrow in preperation for work. </p><p>In conclusion, This made me feel great, and I had some great thoughts in the process. They do their job, but not render me totally immovable and useless.</p>"
}
