{
 "title": "Dearest Friend ...",
 "author": "Zack",
 "citation": "   Zack. \"Dearest Friend ...: experience with Alcohol (ID 71632)\". Erowid.org. May 10, 2010. erowid.org/exp/71632",
 "substance": "Alcohol",
 "bodyweight": "220 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 71632",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 10, 2010",
   "Views: 5048",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nDear Alcohol,</p><p>We've known each other for quite some time now. I first met you when I was 13, but we didn't hang out that much and I didn't think you were as cool as people said you were. I definently liked my friend pot better. </p><p>My friend pot got me sent away to boarding school, and I thought that that was bad, but I didn't know how shitty shit could get. You are such an asshole. Everybody thinks that we shouldn't be friends and I dont think so either, but I just can't let you go. </p><p>In the past 6 months you have gotten me kicked out of an apartment, a hostel, a hotel, and my own home. I have lost friends,am about to lose my family, all for you. You just wont leave me alone. When I'm not hanging out with you, all I think about is hanging out with you even though I hate you so much. I went to New Jersey twice to get away from you and I just came back. </p><p>Next time I went farther. I went to Memphis, Tennessee just to get away from you, but I missed you so much I just came back. I went to Colorado thinking my life would change, but the problem with you is that you're everywhere. When I watch TV, I see people hanging out with you and I get jealous. When I talk to my friends, they all say how cool you are and I get mad. When I read a magazine, I see pages saying how EVERYBODY should be your friend. But I'm sick of you now. I know I said that before but I cant take it any longer. </p><p>Tonight, I have to look for a place to stay because of you- because not only have you terrorized me, you've terrorized my father and his father at the same time and they cant stand me being friends with you. Im sorry, friend, enemy, but its time for me to move on. </p><p>I want you to know that you're the worst thing thats ever, EVER, happened to me and I'm finally letting you go. If I never see you again in my life, I will be a happy man, but I know I will. And when that day comes, dont bother to come talk to me, dont even fucking look at me because I will not look back and I will not even acknowledge you. The worst thing is that I know you'll always be around. You've been around long before I was born and you'll be around long after I die. </p><p>I'm done, good bye.</p>"
}
