{
 "title": "One Short, Strange but Good Trip",
 "author": "Secret Agent Beam",
 "citation": "   Secret Agent Beam. \"One Short, Strange but Good Trip: experience with 4-HO-MET (ID 71657)\". Erowid.org. Feb 25, 2009. erowid.org/exp/71657",
 "substance": "4-HO-MET",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "14 mg",
   "oral",
   "4-HO-MET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 71657",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2009",
   "Views: 8485",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSunday 10:30 pm:  A good friend of mine mentions this new research chemical that is similar to shrooming and rolling.  I ask many questions and decide it's prolly not a good idea to try a new drug, since I've already gone through my experimentation phase (I'm 25).  \r\n11PM:  He returns with two capsule for himself and another friend who has decided to take the trip with him.\r\n11:05PM:  I'm feeling left out, so I send him to go get me some too.\r\n11:35PM:  We take it.\r\n11:50PM:  I'm starting to feel the onset of ecstacy.  Brief calming waves of goodness, and my eyes feel like they are shaking.\r\n12:05AM:  Everything is HILARIOUS.  I'm in a great mood.  We are sitting outside on the back porch making our own music.  I'm playing the little bongo drums, and might I add, sound like a professional percussionist.  Having a great time making music and lauging.  \r\n1AM:  Still having  great time.  laying on the ground looking up at the clouds.  They quickly change their shape and we all see the same things...hatchet man, and angel, pigs flying...all very detailed and realistic looking.  The sky was pitch black with white clouds.  Very awesome.  At this point I'm feeling like I ate about an 1/8 of shrooms but have no nausea, and no emotional ups or downs.  Just very happy.\r\n2AM:  Still tripping but I decide that I would rather be at home.  I go out to my car and realize there are cops everywhere.  So I decide to go for a test drive to the 711 across the street just to see how my driving is.  Driving is not good.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  Ggetting strong visuals from all the lights, however, I decide to make the 30 minute trip home because I was too paranoid to drive back to my firnds because there were cops everywhere and I didn't want to seem suspicious.  I crank up the Gov't Mule on my CD player.\r\n2:10am: My phone rings, it's my friends wondering how I'm doing....the phone seems as though it's attached to my hand...my hand and the phone are one....I'm doing FUCKING great.  It's a country drive so there isn't a lot of traffic....therefore not a lot of lights to distract me.\r\n2:15am:  I pass a parked sleeping semi truck.  I swear it is turned on it's side.  It's very quiet.  I brake slowly, as I come up on the truck....it's not on it's side!!  I'm just trippin'....\r\n2:30am:  I arrive home safe and make all appropriate phone calls letting people know I'm fine....everyone back at my firends is still tripping hard and having a great time...as am I, but now it's just me, my dog, and my sleeping boyfriend.\r\n2:45am:  I decide that it is too boring inside so I grab a blanket and head to the back yard.  The sky is awesome and I'm laughing to myself about how happy the sky makes me.\r\n3:30AM: Coming down.  Still have a slight body buzz, but the visuals have subsided.  I go to bed.\r\n10AM the next morning:  I feel great.  NO HANGOVER!  This is the best synthetic drug ever.  It would be good to trip when tripping just takes too long.  I know with me, after the first 4 or 5 hours of tripping, I just want to be normal again, and with 4-ho-met, this is possible.\n\n\n"
}
