{
 "title": "Felt Very Interconnected",
 "author": "Merryprankster_01",
 "citation": "   Merryprankster_01. \"Felt Very Interconnected: experience with Sceletium Tortuosum & Mescaline (ID 71672)\". Erowid.org. Aug 27, 2009. erowid.org/exp/71672",
 "substance": "Sceletium Tortuosum & Mescaline",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "0.5 capsls",
   "insufflated",
   "Mescaline",
   "(powder / crystals)",
   " ",
   "100 mg",
   "oral",
   "Sceletium tortuosum",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 71672",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2009",
   "Views: 7521",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast night I decided to combine Kanna (Sceletium Tortuosum) with a half capsule worth of synthetic mescaline. I insulfated the 1/2 mescaline pill and swallowed two fifty milligram Kanna gelcaps. I had no accurate scale to measure the mescaline but I believe it to be about half of an active dose, since another time a whole gelcap was very intense. The snorting of the mescaline was uncomfortable and I spit out the post nasal drip as to not orally dose, I wanted just barely enough mescaline to notice.\r\nThe nausea of the Mescaline passed without vomiting in about half an hour, which surprised me because previously when I ingested a whole cap orally I purged twice within an hour. After the neausea passed a warm energetic frequency worked it's way up to my brain, I got a few goosebumps so the speedy effect was still present but much more tolerable than eating a whole gelcap.  The Kanna was nice because it comforted my nerves without the cloudiness of pot that can detract from noticing a smaller dose of another substance. Kanna has an empathogenic quality to it.\r\nIt is notable that my Kanna had a disclaimer on the bottle discouraging use with 'designer drugs'. I figured since I was not combining it with MDMA or anything of that sort it would be o.k. Overall I preferred this combo and ingestion method to the straight eating of a whole pill. Because I was not suffering with lockjaw and neausea I was able to enjoy the mild but noticeable open eyed visuals and the kanna just made me feel calm, peacefull and alert. There was a great intellectual energy and I found myself watching Nova on public broadcasting entranced by the world of subatomic particles and the universe around us. I did some stretching and that felt great. The energy slowly built until maybe three hours later when the open eyed visuals became most intense.\r\nI smoked no marijuana as I didn't want to miss the full experience of the mescaline and I feel that the Kanna acted synergistically with the mescaline allowing me to have a great experience with less anxiety and not needing the pot. I think that sometimes when I smoke pot on new drugs I underestimate the other substance and that can be dangerous.  Also to get the most out of a psychedelic I want to remember and notice the effects which can be missed if I get real stoned.\r\nI had a great trip but did feel physically taxed and slept very light that night. The spiritual and cosmic ramifications of the trip were intense, but not so much so that I lacked integration. Love is always the only answer to the biggest problems and I focused love on my friends and family and gave thanks to the universe for the opportunity. I felt very interconnected to the world which is both beautiful and scary; I went on a walk and couldn't help but smile and say hi to strangers. I guess this is how it feels to be turned on, it makes my heart hurt but I am glad for it.\n\n\n"
}
