{
 "title": "Philosopher's Stone",
 "author": "Esdet",
 "citation": "   Esdet. \"Philosopher's Stone: experience with Mushrooms - P. tampanensis (ID 71681)\". Erowid.org. Oct 4, 2013. erowid.org/exp/71681",
 "substance": "Mushrooms - P. tampanensis",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Mushrooms - P. tampanensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 71681",
   "Male",
   " ",
   "Age at time of experience: 33",
   "Added: Oct 4, 2013",
   "Views: 659",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I bought 15gr. of fresh mushrooms in a smart shop in Breda for 15. As it has been a small 15 years ago (I'm 33 years) since I had shrooms I decided to take a less visual, more of a mind high type of trip. Which is why I chose Philosopher's Stone(s). Also, because I'm a philosophical kind of person and was expecting a lot from a magic mushroom named this way.</p><p>Anyway, I went home and took the full 15gr. at once. I knew this was going to be a heavy trip, but I have an extended experience with LSD, and more so with microns, a small LSD filled pill in the form of a lighter's fire stone, some say its laced with amphetamine to boost the acid effect, but Im not sure about this and this is of no importance in this report. And, as my friend could not assist me in case things went wrong I would have to undergo it all by myself and crawl out of hell by myself in case it'd turn bad. Its a test of self knowledge and self testing which I have always passed gloriously. </p><p>I'll give a small timeline. As I was alone and I wanted some security, I penned down at what time I took them and did a written follow up every hour or so. This is a good thing to do if you're taking psychedelics on your own. It enables me to supervise the working of the drug on my mind. Shrooms do their thing and I know it. Hours are on a 24H-scale.</p><p>17:20: Ate 15gr. </p><p>18:05: A very slight dizzy feeling, very mild LSD-esque feeling - a very mellow trippiness.</p><p>18:30: Sweaty hands, light increase in heart rate.</p><p>18:40: A very mild tipsy walk, motoric difficulties, colours starting to vibrate.</p><p>19:05: TV-set begins to wave, meaning it lost its solid form and showed waving motions. I also observed that I was yawning more than normally.</p><p>19:20: I went to lie in the garden to watch the sky. This is where the action really started, some two hours after consumption. The clouds were changing forms like dropping a spoon of milk in a filled coffeecup to see the milk reappear on the surface. It was pretty much like a cloud well seen from atop. This was a respectable visual effect, even though the shroom box mentioned Philosophers Stones are only mildly visual. I blinked my eyes to see it this wasnt just a hallucination, but it turned out the effect remained, so paradoxically it was a hallucination. What I liked about lying in the garden was some kind of connection I was feeling with the organic life around me: the grass was so kind to me, so accepting, just being there to softly support me and the plants and potted plants were really friendly, almost like a guest whos discrete, yet it would occur to me if he or she werent there. There was a very relaxing peace going out from nature. This was a very enrichening experience.</p><p>20:00: The visual effects disappeared and started to think seemingly deeply about some issues I have with my wife. I had mixed feelings of anger and construction, which wouldnt be more or less out of space if I hadnt eaten them all. Rational thinking was possible, even though the trippiness. LSD is for that matter a much more disorienting drug, no drug for beginners, unless assisted. Also hearing my own voice was dramatic: through my voice I sensed my own insecurities: my mind was strong, but my body couldnt translate that strength appropriately.</p><p>From then on the follow up stopped. To make sure a bad trip wouldnt get any chance, I penned down in advance when the trip should more or less end. I had foreseen 24:00, but lets say that was an hour, hour and a half later. I had sweaty hands throughout the trip, was feeling pretty energetic. I had cigarettes and some kick ass marijuana, New York Diesel and Amnesia Haze, both very strong Soma Strains, but I drank water and didnt smoke. There just wasnt the impulse to supplement the trip with THC effects. I saw a disgusting anti-smoking ad and immediately decided to quite smoking. Which is still the case. I had hoped for therapeutic effects as I had experienced with previous LSD sessions and I can moderately subscribe to them: some of the issues with my wife got answered, but at the same time other questions arose. I also decided to quit smoking. </p><p>I went to sleep around midnight. The trip was getting exhausting, even though the effects of trippiness were declining. I had also gotten up at 6 in the morning that day, so I was physically exhausted, too. Then a strange thing happened. Even though the effects were going away, I was experiencing visuals again, and at a certain point some nightmareish stuff came in my mind: thoughts of death, images of old and crippled china dolls appeared and as things go with bad trips a veil of death and darkness covered reality. I got up and had a large meal and a vitamin drink (Vitamin C is said to help gain control again). I went to sleep and got up with a very soft head ache and a slight feeling of being depressed. The other day I was OK and the conclusions I had reached from my thinking were integrated assertively in my personality. So, Im very satisfied with the episode of subconscious rubbish clean up therapy. It was all by myself and I made it by myself. I feel stronger, now, and empowered. I dont know if this is an effect you can actually look up, but in my case I cleaned out my closet and all is well now. Maybe it turns out differently for you. Also observe that there was no giggly part. It was all pretty serious. </p><p>I guess its called Philosophers Stone, because it makes me feel reflective, not recreative with the giggling and wanting to act stupid and all that. I think its good for (seemingly) deep talk. But maybe all this is because my mind set was leaning towards the pondering, the problem solving, than towards hedonism and mindless fun.</p><p>I can advise the 15gr. for experienced shroomers, or synthetic psychonauts. Id do half if you like to share or have a manageable trippy buzz for a couple of hours (with obliged assistance for the unexperienced). Next time Id like some more visual shrooms. Hawai'ian, for instance.</p><p>Cheers and may you all be happy.</p><p>Esdet</p>"
}
