{
 "title": "Ziggety Ziggety",
 "author": "d4rth",
 "citation": "   d4rth. \"Ziggety Ziggety: experience with MDMA (Ecstasy) (ID 71843)\". Erowid.org. Jun 30, 2008. erowid.org/exp/71843",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   " ",
   "  T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(ground / crushed)",
   "  T+ 1:15",
   "0.25 tablets",
   "smoked",
   "MDMA",
   " ",
   "  T+ 1:30",
   "1.75 tablets",
   "oral",
   "MDMA",
   " ",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 71843",
   "Male",
   " ",
   "Not Given",
   "Jun 30, 2008",
   "Views: 6795",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having a number of experiences with MDMA, I can say that I'm comfortable and informed about everything I experience, and certainly research beforehand for safety purposes.  A friend of mine told me he had some Pink Playboy pills.  Again, Ive tried many different forms of MDMA (including Mollys), but I had yet to experience these.  From what he told me they were great.  I got to his house and despite the fact that I trust him fully and that he was himself at the time rolling, I proceeded to do some quick internet research to ensure I didnt take too many and have health issues.  [Erowid Note: While information about some pills can be tentatively gleaned from internet research, the question of reliability of unreferenced online information is always an issue.]</p><p>He gave me 4 pills and I proceeded to take one and parachute another (this involves crushing the pill and rolling the contents into a small wad of tissue paper).  The idea of parachuting is to hit you faster, but with shortened effect time.  Another plus is you can actually peak twice, once with the parachute (in a fairly short period of time), and again with the other pill(s) you orally ingested as normal.  Id assume I took these around 7:30 PM or so.  After about 45 minutes I had definitely started to feel the parachute.  30 minutes later I felt the other pill.  I was feeling good, but not as good as Ive felt on other experiences.  Thus we decided to smoke a quarter of a pill (this was my first time doing so).  The taste was rather odd, but the effects were very quick for such a small dosage.  Now I had 1.75 pills left.  We wandered around, bought some beer (my friend wanted some, but I decided not to mix since alcohol tends to dehydrate you to begin with).  We decided to go hang out at a park for a while and be outside.  </p><p>As soon as we got there I was feeling much better.  I had a nice rush of energy.  Just then I saw a random field mouse underneath the slides and my buddy and I chased it for a good 5 minutes.  I almost caught him at one point, but he was darned fast.  Alas, we gave up and decided to not overwork our bodies and proceeded to sit at a bench and smoke a cigarette.  By this point (about 9PM), I was feeling the effects, but was a little disappointed.  I decided to orally ingest the rest of my 1.75 pills (one taken, .75 parachuted).  An hour later (10PM), we were back at my friends again and I was feeling much more satisfied and happy.  The drive home would take 20-30 minutes so I figured it was time to go [seeing as I had a Jacuzzi date with two of my lady friends ;-)].  Driving was insanely fun, although I would definitely recommend anyone to avoid doing so if at all possible (I had no other choice, unless I wanted to walk a good 30 miles).  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] Any music I had on my iPod was like heaven to me.  I found myself singing to just about everything without a care in the world.  </p><p>I met my lady friends at the Jacuzzi and we hung out for about an hour and a half.  They had no idea I was rolling because I figured they might trip out about that.  Forewarning about hot water immersion on MDMA, as your body temperature is already higher than normal (or sometimes colder, for that matter), its extremely important to not stay fully immersed for too long.  Keep hydrated, etc. etc.  Anyways, the Jacuzzi was absolutely amazing.  I loved the feeling of the skin of the water on my palms.  Not to mention, dunking my head shortly was like a different world of feelings.  Underwater, I felt like I was floating (more-so than usual) and every part of my body tingled with pleasure.  I wanted to kiss one of the girls (or both haha) more than anything, but they are too good of friends.  I also wanted to be upfront with them of my mindset, but again, I didnt know how theyd react.  Plus, I want to share everything with everyone when I'm rolling so I had to tell myself to forget about sharing and talk with them.  This proved to be the right decision, and I found myself perfectly content with carrying on a conversation with them.  Around 11:30PM, I began to get the normal eye-flutters commonly experiences with MDMA.  The girls finally left and I returned to my house (the pool was in my community, so no more risky driving).  </p><p>When I got into my house I was rolling hard.  But not in a bad way, it was great.  I began to get visual effects similar to those while under the influence of mushrooms or LSD.  This was amazing for me because these visuals were unlike any Ive ever seen before with MDMA.  I grabbed a glass of orange juice (to put some vitamin C in my body and to heighten my experience) and decided to feel anything I could find that was soft.  Everything sent tingles up my body and I loved it.  Lucky for me, my SUPER soft cat decided to join me.  Im allergic to cats, but only if I rub my face after petting them.  I proceeded to pet my cat (avoiding any contact with my face).  My cat felt unreal.  It was the most amazing thing Ive ever felt on MDMA next to Kashmir fabric and my authentic rabbit fur Russian hat (which I actually purchased in Russia).  By this time I needed to urinate and headed to the bathroom.  The walls felt amazing, the bumps on the drywalls were definitely taking odd shapes, and they were warping slightly.  I probably spent a good half hour in the bathroom (which is simply a shower and a toilet, very small) looking at what I thought was a whole new world.  I was having such an amazing time I decided to come here and share my experience.  Currently, it is 3:50AM.  I am definitely still feeling plenty of effects, visuals and all.  </p><p>For ingesting all my pills by 9PM, Im comfortable saying this is the longest roll Ive ever experienced.  To anyone interested in experimenting with MDMA for the first time, be smart.  Know who youre getting it from, very well.  Research the exact pills (color, size, shape, and logo) to get an idea of how much to safely ingest.  Read others experiences with the same pills, if possible.  Dont be too active, and if you do, make sure to take a break periodically as your heart rate is generally increased to begin with.  Drink plenty of water over time (but dont over hydrate).  For better effects, drink some orange juice, but not too much as this can cause vomiting.  Experience it with your friends, never alone.  Essentially, be smart, be safe, and have fun.  Trying to outdo yourself, prove yourself to friends, or just plain being an idiot can and more than likely WILL reap serious consequences.  In the end (or technically not the end since Im still feeling effects), Ive had a great time.  I hope this is helpful to anybody who reads this.  Dont get the wrong impression about this article either.  This is not to entertain; it is for informational purposes and is intended to help/answer questions some may have.</p><p>-d4rth</p>"
}
