{
 "title": "Seeking Knowledge? ...and Ego Death",
 "author": ".Sm0k3/",
 "citation": "   .Sm0k3/. \"Seeking Knowledge? ...and Ego Death: experience with Salvia divinorum (ID 71904)\". Erowid.org. Aug 25, 2009. erowid.org/exp/71904",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2008",
   "71904",
   "Male",
   " ",
   "Not Given",
   "Aug 25, 2009",
   "2371",
   " "
  ]
 ],
 "report": "<p>The experience I'm about to *attempt* to explain, occurred earlier today. I'm still feeling slight effects, and felt that I should write a report while it's still fresh in my mind. But first, a little about myself: </p><p>I'm 19 years old, in shape, and am a  fairly experienced psychonaut, having approximately 7 years of personal 'research' under my belt. I've experimented with just about everything one can come across. As pertaining to Hallucinogens in particular, I've used everything from the basic Mushrooms, LSD, and Mescaline, to the more exotic Ayahuasca, pure DMT, and of course, Salvia. I've always had a strong urge to further understand the relationship between my mind and alterents, and have taken many things away from my experiences. That being said, I felt the need to share this one in particular with everyone, so that others may possibly take something away from it as well. so here we go... </p><p>I woke up this morning after having visited the ocean the previous day with my friend. I will refer to him heretofore as T. Anyway, while at the ocean, T and I procured A 1 gram vial of 60x standardized salvia for a fairly large sum of money (I'm previously used to receiving Salvia for free, for research purposes). As we were leaving that night, we both decided to partake the following day (today). Now having not truly 'experienced' salvia for a few years, although unsuccessfully trying on three occasions in the weeks previous with 40x, I was determined to put away my anxiety and immense respect and reverence for the substance (I've used everything from leaf through to 80x, and experienced many things on salvia, none 'bad', but some either too intense or high plateau where I lose perceived consciousness), and try once more to delve deep into the 'world' and see through the eyes of salvia once more. </p><p>So, today my friend T and I sat in a friends apartment, loaded about 1/4 gram in to the large glass hitter of a one foot donut Zong, and prepared to take bong rips of 60x salvia. To note: my friend T has used salvia only twice prior to this, starting with (against my recommendation) 40x, and the night previous to this (unbeknownst to me) with the 60x; and as he had never truly felt salvia from the metal and glass pieces he used, I suggested a bong. T encouraged me to go first, and reluctantly, I obliged.</p><p>I took a fairly large hit, being about half the volume of the Zong, and pulled the stem. Just then, my girlfriend whom I will call J, walked in and kissed me goodbye as she was leaving for work. I held the smoke for a further ten seconds for a total of about twenty seconds. I exhaled the thick smoke, and sat back. The initial effects began much more quickly than I had remembered 60x did, and within five seconds I experienced the 'clicking' feeling as described in many ways by others. The initial coming up took me off guard as I had not fully prepared for another life changing experience. I remember feeling a brief moment of 'The Fear' in the front of my mind as the Salvia took hold. This surprised me as I have an extensive background with salvia, and have experienced her many times. 'The Fear' moved to the background (while still present) as the framing effect took over. I looked around and remember saying, 'Yep, there it is', as I moved my head. What happened next was very surprising to me as I only had what I considered a small hit... </p><p>The high intensified immensely and I began to forget my surroundings. I knew that 'someone' was there listening to me, so I began to speak rapidly and although I tried to make sense, incoherently. I had trouble breathing as reality began to rip itself apart, and I began to experience A 'hole' in front of me. I would momentarily forget who I was, and I knew what this meant. 'The Fear' came on strong as I was not prepared to feel the ego-death that was to follow. Suddenly it happened. I knew I used to be something. I began to try and hold on to whatever that something was, all while sitting in a strange and foreign place while reality ripped itself apart. At that point I turned into a rather large zipper, made up of the fabric of reality. I began unzipping rapidly, over and over again. I was made up of everything I was, along with everything else, and beneath the zipper, was everything that was not. Very strange. I can't remember what was said, but at that point T spoke from beyond and whatever he said managed to bring me back. </p><p>I remembered who I was, and remembered thinking 'oh, I see... I've been here before. I just need to see through.' I found a hole in my zipper and managed to peek through, 'The Fear' died down, and I began to level out. I started communicating as much as I could about the experience, most of what I said I can't remember. I looked around and saw my friend, and knew that although there was no 'control' to speak of, I could still see through the mask that Salvia had placed over my brain. At that time, I began to 'come to', and the zipper feeling died down a bit. I told my friend T about the experience and how I had forgotten the potential of even a small amount of 60x. I attempted to stand (unsuccessfully), and told T that we should go outside. I quickly remembered myself, and said that it would be a bad idea. I then leveled off to what I would equate to a decent 20x trip, and looked around. I started enjoying myself, and began taking stock of my functions. </p><p>I was still communicating myself rapidly, and apologized to T if I was annoying him. Of course he said 'no'. I kept looking at T to gauge how far out he was, as I remembered that he took a Hit himself shortly after me. I believe I asked him and he said that he wasn't feeling much, so he took another hit. I looked at my watch, convinced that we had been sitting there for a few hours. It had been about five minuets Since I had taken my hit. It seems as though the higher the extract, the more it distorts my sense of time.</p><p>After I came down, we walked outside and sat in a field, under a tree. We spoke of our philosophical standings on salvia, and how I was against kids using it as some sort of recreational 'novelty' drug, without proper understanding of its historical uses and practices. I strongly disapprove of people using Salvia for anything but gaining personal knowledge and experience of their selves. I spoke of how surprised and happy I was that Salvia could show me something I had not seen in quite a while; myself. It had once again, as it has many times before, shown me that even with my vast experience, I can still see that hidden aspect of my being, that I am still me, and can still learn and experience. I'm not sure what I'm trying to say, but if you feel it as I have so many times, you'll know. and you'll be thankful to be you. </p><p>Well, I hope this rambling has made some sense, and I hope it was half as interesting as my experience. Happy Tripping. ;)</p>"
}
