{
 "title": "Slow Onset, Great Trip",
 "author": "Porcupine",
 "citation": "   Porcupine. \"Slow Onset, Great Trip: experience with LSD & Gabapentin (Neurontin) (ID 7194)\". Erowid.org. Jul 15, 2002. erowid.org/exp/7194",
 "substance": "LSD & Gabapentin (Neurontin)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "400 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)",
   " ",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7194",
   "Female",
   " ",
   "Not Given",
   "Jul 15, 2002",
   "43142",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nBefore dropping acid a few days ago, I tried to do some research on possible interactions with the mood stabilizer I'm on, gabapentin (trade name is Neurontin). This is used not only as a mood stabilizer but also as an antiepileptic and in low doses as an insomnia treatment. Unfortunately, I couldn't find any information, so I went ahead and am now submitting this so that others doing similar research won't come up empty-handed.</p><p>I take 800mg of neurontin and 40mg of prozac every day. The last time I tripped, a year ago, I was only on the prozac and it didn't seem to have any effect on the LSD. To try and keep chemical interactions to a minimum, the night that I tripped this time I did not take the prozac and took only 400mg of neurontin.</p><p>I was with 3 people, who had all eaten one tab. Because I was a little nervous about tripping with two of these people, I started out taking only half a tab (these were gel tabs, not paper), which I ate around 11:45pm. An hour later, my companions were all definitely tripping, but I was not feeling anything at all. The other half of the tab had broken into three small, and at 1am I ate one of these three pieces. At 1:30, I ate the other two pieces, for a total of one full tab. I was still not feeling or seeing anything at all. At 2:30, I finally ate another half a tab, figuring that if this didn't work I would just go to bed. Around 3am (more than 3 hours after originally ingesting the half a tab), it finally started to kick in and the floor started to bubble (this always seems to be the first sign I get that acid is working).</p><p>The only difference between me and the other 3 people tripping was the neurontin, so I assume that the slow onset is a result of that, and possibly the prozac which although I didn't take that night would still have been in my system - though a year ago the prozac alone didn't do this.</p><p>Once the trip started, it hit me full force within about a half hour, and I was somewhat regretting having taken that last half a tab. Once I got over the initial paranoia, though, it was a terrific experience, mostly thanks to the music we were listening to (alternating Bach piano pieces and Pink Floyd). It started to die down slightly around 10am or so, and a couple hours later I fell asleep and woke up mostly sober at 7pm (but still with slight tracers).</p><p>So, in sum, if you are on neurontin be patient for the acid to kick in and don't overdo it just because you think it's not working! I would be interested to hear about others' experiences with this combination.</p>"
}
