{
 "title": "Pilsenkraut Experience",
 "author": "Salviablue",
 "citation": "   Salviablue. \"Pilsenkraut Experience: experience with Pilsenkraut (Henbane & Alcohol) & Cannabis (ID 71952)\". Erowid.org. Aug 26, 2009. erowid.org/exp/71952",
 "substance": "Pilsenkraut (Henbane & Alcohol) & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cannabis",
   "(plant material)",
   " ",
   "2500 ml",
   "oral",
   "Various",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2003",
   "ID: 71952",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 26, 2009",
   "Views: 8664",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few years ago I decided to try brewing some Pilsenkraut using the recipe available at this site.</p><p>The only ingredient I wasn't willing to pay for was the henbane plant matter its self, so I grew some from seeds I acquired from a now defunct ethnobotanical supplier. I managed to grow the plants rather successfully and come harvest day I reaped, separated the flowers and leaves and left the seed pods to open on their own. Unfortunately once the flower and leaf matter had dried, I was only left with around 30g of material, of which the recipe required 40g, so I decided to add a handful of seeds when the pods opened (I remember reading somewhere that some monks used to add a handful of henbane seeds to their regular beer batches for `extra effect`).</p><p>After a week I syphoned off the brew into bottles with a spoonful of honey added to each, and left those for a further two weeks. The resultant pilsenkraut tasted much like traditional flat cider but with a touch of fizz. I was so excited at successfully producing my first batch of tasty pilsenkraut that most of it was given away to friends or taken down to the pub I worked in at the time for people to sample. It was when I was down to my last 2 or 3 litres that I decided to consume the rest on my own to try the pilsenkraut `experience`</p><p>At the time I used to smoke a lot of weed (cannabis, in this case resin) and so was probably fair stoned before beginning the endevour. I didn't particularly have too many worries at the time and was fairly contented with life (well as much as a skint student with child can be). I drunk the remaining brew over the space of around 3 hours (I had one 1 litre bottle and three 750ml bottles each 3/4 filled with pilsenkraut) in my home with my then partner not taking part. I think I also had a few bowls of weed during the experience.</p><p>After the first bottle (the litre one) I started to feel a little bit drunk, as though I had just drunk a litre of 5% beer. After the second bottle the regular drunk feeling started to abate and a sort of `drunk on shrooms` feeling begun to take over. After the remaining two bottles I no longer felt drunk like on alcohol but a sort of wired drunk, like that from mushrooms. Colours were a little more vivid and everything started to take on a surreal quality. Unfortunately this is where I ran out of the beer and although the surreality intensified a little more after half an hour or so after my last bottle, no other effects seemed to.</p><p>The next day saw me with just a little groggy feeling but no other untoward side effects, although I do remember wishing that I hadn't had any weed so that I could have properly discerned the effects of the pilsenkraut more clearly.</p><p>My circumstances changed soon after that experience and I wasn't able to brew any more of the loverly beer (I did have another batch on the go about a year later from the seeds I grew, but that spoiled1:\n</p><p>I have recently though purchased some henbane seeds and will soon be growing again with a view to brew!</p>"
}
