{
 "title": "Thank God Almighty, Peace at Last",
 "author": "Alexander Supretramp",
 "citation": "   Alexander Supretramp. \"Thank God Almighty, Peace at Last: experience with DMT (ID 71961)\". Erowid.org. Jan 27, 2010. erowid.org/exp/71961",
 "substance": "DMT",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2008",
   "71961",
   "Male",
   " ",
   "Not Given",
   "Jan 27, 2010",
   "4025",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The rain was pattering on the roof as my friend J and I sat down to smoke. We had what was perhaps twenty milligrams of DMT apiece, in the form of a yellow waxy crystal. I had previously smoked a small amount with another friend and on that occasion hollowed out a light bulb to make a vaporizer. We smoked it straight, which turned out to have been a bit of a mistake in terms of the taste, but effective nonetheless. </p><p>We had meditated slightly, getting focused and calming ourselves. Neither of us is of the credulous type, so we had no expectations of contact with actual otherworldly beings or time-traveling multi-dimensional entities, but we were expecting something incredible. I asked J, 'Are you ready for a possibly life changing experience on a Tuesday night?', to which he replied, 'Of course, always,' in his wry way. </p><p>I was first with the vaporizer, loading my small pile of crystals into the bulb one pinch at a time, being careful not to spill. I sat in the recliner, facing the open window and the darkness outside. Applying the bic to the bulb, I melted the crystals into a pool, which in turn became vapor. I inhaled deeply thrice, clearing the vapor and leaving a harsh and mildly sweet flavor of melting plastic on my lips. </p><p>As soon as I'd exhaled the first time, I could feel the DMT taking hold, coming up from behind like the shadow cast by the brilliance of a mental sun. Patterns flooded my eyes, swarming across the window's storm screen. I closed my eyes, and the buildup increased. The colors were astounding, coming in organic, earth-like waves rather than the almost digital fractals of LSD or high dose nitrous oxide. They seemed to assemble into the membrane so trypical of DMT experiences. </p><p>The swirling was too intense at this point to really understand what was going on, but the membrane seemed to dissolve and the swirling colors formed into the dmt zone, in the form of a fully three dimensional room. I seemed to be standing at one end, with the highest density color waves forming at the vanishing point of my perspective. It seemed as though there were some sort of arcane locking mechanism, beyond which was the depths of my psyche, but to which I was denied access. It was as though my reified mind was holding me back, telling me not yet, that I was not ready. I accepted it, realizing that even if there was anything I could do, my subconscious probably knew best. </p><p>The swirls, I hesitate to call them fractals, because they simply didn't fit that description compared to my other experience, continued, changing forms as I moved my eyes or my position in the chair. Eventually they began to fade, and I opened my eyes again. My grey cat was sitting in front of me in the window, and she appeared to me to be more beautiful than I had ever seen her. All around me things seemed harmonious and symmetrical, as though all was right in the world. </p><p>For the first time in my life, I truly felt at peace. A strongly Huxleyian internality of experience. J smoked it next, and encountered a V for Vendetta-ish face which stripped away the darkness of his mind, pulling him, spinning ever deeper until he opened his eyes, revealing the world sheered of all pain and anguish, as though seeing it for the first time.</p>"
}
