{
 "title": "Runs Out Pretty Fast",
 "author": "The dude",
 "citation": "   The dude. \"Runs Out Pretty Fast: experience with 4-Methylmethcathinone (ID 72074)\". Erowid.org. Dec 22, 2008. erowid.org/exp/72074",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis - Hash",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72074",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 22, 2008",
   "Views: 16907",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI took my first line at 13.00, took about 250-300mg in a fat line (started out with a big line, then used 150-200mg as adjustments for best effect). I find that snorting this substance is the best way ;)\r\n13.05 I start to notice something, not sure what yet.\r\n13.08 IT HIT ME! heartbeat rising, vision is blurry, colors are brighter and beautiful to watch. It feels like I have no gravity!\r\n13.12 My whole boy is light, feels like I'm sprinting superfast and jumping higher and longer than usual. I pick up a small rock, then I pick up a pretty big rock, to me it feels as the 2 rocks aren't to different in weight. feels like I have endless energy!\r\nI went on to climb some steep hills, I ran around in the forest as well. I also watched some TV, drove around a little, and just spoke a lot with my friends. but seriously, try listening to some of your favorite music while on this substance, LOUD! At least Trance/Techno and that kind of music with a 'takeoff' in it if you know what I mean ;)\r\nThe thing is that this substance runs out pretty fast, from it starts kicking till it starts decreasing is only about 20-30 min depending on how much I take. But I still enjoy myself for another 30 min before returning pretty much to normal.\r\nI started my first line at 13.00 and I kept taking new lines all day. My last line was between 07-08.00 the next morning I think, I went to sleep at about 11.00 after smoking quite a bit of hash, having snorted about 4-4,5grams of the substance alone.\r\nAll I felt when I woke up at 18.00 was that I was exhausted. We took a couple of lines each that night as well, it was kicking much longer this day, and didn't need quite as much either ;)\r\nI feel how this substance can be addictive, so I would recomend not using 'Mephedrone' too often.\r\nMy friends were with me from the first to the last line by the way, It's nice to do in groups ;) I'm 18 years old by the way, and this spices things up a little in a party! ;)\r\nIt was all in all a VERY good stimulant, the downside is that it lasts so short.\n\n\n"
}
