{
 "title": "Mushrooms on 4/20",
 "author": "Thomas J",
 "citation": "   Thomas J. \"Mushrooms on 4/20: experience with Mushrooms, Syrian Rue & Cannabis (ID 72101)\". Erowid.org. Apr 20, 2012. erowid.org/exp/72101",
 "substance": "Mushrooms, Syrian Rue & Cannabis",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 g",
   "oral",
   "Syrian Rue",
   "(dried)",
   "  T+ 1:00",
   "3 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2008",
   "72101",
   "Male",
   " ",
   "Not Given",
   "Apr 20, 2012",
   "3620",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was 420 as I stood on the balcony overlooking an amazing brackish water system. I had ingested eight chocolate weed brownies early in the morning, thoroughly enjoying the high I recieved from them. I had been waiting for this day for a while, but not just because of the pot. It would be my first experience eating psilocibin mushrooms. I was so excited and ready to see what I would receive from the trip, but really had no idea what to expect. The time came to take the syrian rue, which I was told makes the shrooms enter your bloodstream, making the trip more intense. I ate three grams of the syrian rue, smoked for an hour or so, and returned to the table to ingest three grams of mushrooms. As I ate them, I actually enjoyed the taste... reminded me of a peanut almost. I finished the shrooms while talking amongst friends. The atmosphere was perfect. Outside the sun was shining. I could tell it was going to be a great time. </p><p>While standing on the balcony again, I started to feel really good. Not that I didn't already feel amazing (love mary jane) but I could tell something was different. Something inside my body. I closed my eyes and noticed that I was seeing swirls of vivid color, like pathways in my vision. It was amazing. I was traveling through tunnels in my mind! I was taken aback by how amazing it truly was, and continued to keep my eyes closed, traveling to who knows where. This was the beggining of everything. I did this for maybe ten minutes. Maybe twenty. I have no idea honestly. I walked away from the group of people, who weren't tripping. They had all ate them the night before. I walked down the stairs to a long dock which seemed to swirl like it was rocking back and forth. I was definatley tripping at this point. I sang a song that I had never heard before, it was coming out of me. I reached the end of the dock and laid down. Speaking words that I don't really recall, something about my path in life and to follow it is what I can remember. I then embraced the sun for what it truly was. It was intense and I had never appreciated it so much. Laid there for maybe twenty minutes before returning to the land around the water. </p><p>I picked a tree and sat under it. Meditated and talked to the divine. After this, I stood up. Still in awe at how beautiful every plant, every ray of light, EVERYTHING really was. I walked to another tree, closed my eyes, grabbed the tree with both hands, and became connected to the Earth. I felt that I was receiving energy from our Mother, that she was trying to teach me something or give me something, so I stayed attached to the tree for some time. I have had a similar experience like this on Hawaiin Baby WoodRose seeds, but that's a whole different trip, trust me. When I was done with the tree, I walked to the lower porch, laid down, and started thinking about lots of different things. I closed my eyes and saw crazy ape faces and I said to them, 'You're crazy! You better stop making those crazy faces!' haha it was really funny and strange at the same time. I then felt the urge to vomit, so I did. It was all good though. I knew it was alright for me to be vomiting... that nothing bad would come of it. So after seeing many more closed eye visuals that I can't recall right now, I arose to go find the one other person that had ate shrooms with me that day. He was on the roof, but there is a safe and easy access to it, so I joined him. </p><p>We decided to take a walk, so we trekked through some woods and eventually ended up under a bridge. We sat on the concrete and I remember looking at the water and seeing it swirling and rising. Definately a great open eye visual to be seeing. The day was warm and pleasing to my body. I felt truly amazing. I noticed while I was tripping that I never had a set thing that I had really chosen to do, everything just happened. The walk was probably the only thing we actually agreed to do. But anyway, I realized that I don't have to worry about anything basically, because whatever happens is supposed to happen to me. I had known this, but never really applied it to my life. Now I do every day, and nothing but good has come from the way I've chosen to view my life. It was definately because I ate the shrooms. They helped me so much. There are many other things that happened that day and through the night. I smoked some 5meo dmt from my friends frog and that was a great little experience in itself. It seemed like I was thrown back into my trip even though I smoked it hours after the shrooms had worn off. </p><p>I am a firm believer that psycadelics can help people in various ways. It's all just how you view your trip. I'll recommend mushrooms to anyone who thinks they would want to take them. Since this trip Ive ate them twice more, each time special in it's own little way. I'm glad they were put here for us to journey in our minds and in our world, as well as in our hearts.</p><p>I'll never forget that trip. Or the one before that. And the ones after it. And the ones to come. </p><p>THOMAS J</p>"
}
