{
 "title": "Turbo Charged Brain... or Not...",
 "author": "mrprefect",
 "citation": "   mrprefect. \"Turbo Charged Brain... or Not...: experience with Modafinil (ID 72163)\". Erowid.org. Jan 6, 2012. erowid.org/exp/72163",
 "substance": "Modafinil",
 "bodyweight": "184 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Modafinil",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 72163",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 6, 2012",
   "Views: 9047",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I came across an article about smart drugs a few weeks ago and thought this sounded like a good adventure, I love trying new things out, and with my job (network admin) I thought I could use it to get some reading and training done that I hadn't had the time or focus for.</p><p>I used recommended doses from doctors, 100mg a day, today is day 5 and I doubt I'll be taking any more any time soon. </p><p>Some things to note about how my body reacts to thing:</p><p>Caffeine has a weird effect on me, if I drink too much, say a large cup of coffee I'll get warm jittery and feel generally a bit frazzled and unfocused I find it does not make me more 'awake' though as I'm still sleepy and yawn a lot.</p><p>Marijuana I smoke on a daily basis in the evenings, generally it gets me mellow followed by hungry and then sleepy, I've read there is no interaction between the two but just something to keep in mind.</p><p>All the effects I have noticed from the Modafinil were generally the same from day to day, the only difference was that I could feel each repeated use get a little stronger then the last time. At first it was mainly wakefulness and more alert then I normally am. I felt less tired bu by the 3rd day I felt almost antsy and a bit agitated. If I drank caffeine it amplified the antsy feelings a bit.</p><p>I did not find it helped me focus or concentrate better.</p><p>I dod not find it helped me to remember more</p><p>I did not find it made me more social or outgoing. </p><p>I noticed what I would say is a very slight mood elevation not euphoric but just a little less grumpy for lack of a better word. </p><p>I did find was that it regulated my sleep a bunch. At the end of the day at bed time (10 for me as I work at 6:30AM) I was ready for bed, I slept more soundly and I found that I woke up at a more regular time often 5-20 minutes before my alarm would normally go off. </p><p>I definitely noticed a decrease in my appetite, I only biked to work once this week (I usually bike 3 times for a total of 120Km) but my appetite is way down from about an hour after I take my dose until well into the evening. I even found when I smoked up in the evening I was less hungry or not hungry at all.</p><p>Other then that there isn't many notable improvements to make this worth continuing for me.</p>"
}
