{
 "title": "Too Much, But Thankfully Not TOO Too Much",
 "author": "Davon",
 "citation": "   Davon. \"Too Much, But Thankfully Not TOO Too Much: experience with GHB, Ecstasy, GBL & Cannabis (ID 722)\". Erowid.org. Aug 1, 2000. erowid.org/exp/722",
 "substance": "GHB, Ecstasy, GBL & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "2.0 g",
   "oral",
   "GBL",
   "(liquid)",
   "  T+ 1:30",
   "  ",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "GBL",
   "(liquid)",
   " ",
   "0.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " ",
   "6.0 g",
   "oral",
   "GBL",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "722",
   "Not Specified",
   " ",
   "Not Given",
   "Aug 1, 2000",
   "23464",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI am actually writing this the day after an experience with GHB, I still feel shakey and occasionally almost as if I'm still high.  Focusing and writing is very difficult, but I'll try to relate the experience as well as I can. </p><p>About thirty five hours ago, I arrived, sober, at 2 A.M. at my favorite after-hours club, which had finally re-opened after being closed down for some time.  The music, atmosphere, and crowd were phenomenal.  I took an ecstasy tablet (named a ROLEX) around 2:30 A.M. and was very pleased and impressed with its quality and effects.  I had a great time dancing and being in the company of friends.  We had been consistently taking renewtrient (GBL or 2-3(h)furanone di-hydro) nicknamed 'newts' or 'new-news'- with ecstasy, in approximately 2 gram doses.  After the ecstasy peak, taking renewtrients will revive the 'rolling' experience and often surpasses the peak from the ecstasy alone.  Consequently, I did not need to take as many tablets of ecstasy as I had been used to taking, and the 'X-hangover' the next day was significantly diminished.</p><p>I had read that the body converts GBL to GHB, so I was willing to take GHB.  I had only tried GHB a few times before, in small amounts, but I accepted some (a bottle cap full) from a friend at around 4 A.M..  Over a half-hour had passed and I commented that I felt nothing and wanted more.  Everyone said that G was a 'creeper' and would 'sneak up on me', so I waited.  I was very high and pleased with the G, ecstasy, newts and occasional bit of marijuana- as one might expect. By the time we left around 8 A.M., I had taken only one more ROLEX and three more caps of G.  We went directly to another club where I danced for a while, but soon was very relaxed and spent most of the next few hours talking, hugging and giving or receiving massages.  My level of happiness was euphoric and sensory stimulation was exponentially high, much more than usual when taking ectasy.  I took a half tablet of ecstasy when I arrived and another half two hours later.  At about 11 A.M., I obtained a bottle of G from a friend since we were temporarily out of renewtrients and took two doses by noon- when the club closed.  I was extremely high and was dissapointed that the club had closed so we decided to have a party at my house. On the way home I took two more caps of G and two more doses of renewtrients.  When I arrived, at home I took one more half of an ecstacy tablet- the last X that I took.  We all danced in the house and on the balcony, much to the amazement and humor of anyone passing by.  I was ridiculously high but having an extremely incredible time.  Everyone kept commenting on how happy and high I looked, and they were correct.  I told my good friend Marne that I loved her well over fifty times.  At about 5 P.M., some friends arrived with renewtrients and over the next few hours I preoceeded to take four doses of newts and three caps of G.  I felt that I was happier than I had ever been in my life.  I had a profound appreciation for everyone around me.  But soon I began to be overwhelmed, all of the G seemed to hit me at once.  I kept telling my friend Tracy 'I'm so fucking high' over and over again.   I could not stand still, and was very uncoordinated.  I could not read or focus well.  I began to feel nauseated, similar to the 'bed spins'.  I felt the urge to be paranoid, but remained unafraid.  My friends comforted me greatly and kept me from totally freaking out.  I began to vomit very violently, convulsing and heaving.  My stomach was empty so it was even more harsh.  I had never vomited from any of the drugs that I had used before.  I only vomited for a few minutes and felt much, much better.  But I was still extraordinarily high and becoming incoherent.  Friends said that I would soon be a 'deer down', meaning that I would pass out- which also had never happened to me before.  Soon I was out cold and so unarousable that I did not notice everyone writing their names all over my stomach with ink pens.  My friends stayed with me and I awoke about two hours later, was wide awake and feeling fine.</p><p>I usually take more ecstasy in an evening but didn't need to because of the GHB.  The G seemed to take a long time to kick in, and since the effects were so good, it was easy to just take more and more until I had taken far too much.  But, thankfully not TOO too much.</p>"
}
