{
 "title": "Like a Kid Again",
 "author": "Adamood",
 "citation": "   Adamood. \"Like a Kid Again: experience with DXM (ID 7221)\". Erowid.org. Nov 18, 2002. erowid.org/exp/7221",
 "substance": "DXM",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "360 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7221",
   "Male",
   " ",
   "Not Given",
   "Nov 18, 2002",
   "11066",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAfter a strange week i felt I was prepared for the second plateau experience with Dex. I had done 2 oz two times previously and knew what the first plateau was like. After reading the Faq on the stuff I wanted to proceed slowly and carefully being that there is potential danger. I am mainly experienced with LSD, Shrooms, Peyote, Nutmeg, and Cannabis. This is different from all.</p><p>After preparation, over a period of about half and hour I consumed a 4 oz bottle of Robitussin Maximum strength. There were no active ingredients other than the Dex. Soon after I drank the last of it, I had some unexpected visitors. Oh shit, what do I do now?? How do you get people to get the hell away from you without being rude?? I read the Faq about this stuff turning people into anti-social, paranoid assholes and did not want to be like that, so I was kind and offered food and weed to them and eventually they left. At one point before they left, my burger did not taste as interesting as I wanted it to so I just layed it down and walked away saying something like, 'I lost my appetite.' I have not eaten anything sense. You can't just tell someone 'You have to leave now, I just drank a bottle of cough syrup and expect to trip.'  By the time they were gone an hour had passed and I was well into the effects. </p><p>I felt like walking aroung a lot and had to put on some music...Tool. Perfect. Now time for a bowl, it just enhaced the effects I was already having. This was just as I had planned, intelligent conversation with my wife was easy (even though I had just finished making absolutely no sense to my friends what so ever.)This is when I realized there were different personalities surfacing. I could switch from intellectual, to brave guy, to playful little boy, to lost little boy, to funny party guy, to paranoid, and more. I have not been able to identify all of these yet nor describe them. My ability to control this was at will, which was encouraging. At one point I declared I was Disney World and would perform Magic but when I tried to, I forgot what I was trying to do. I felt like I was about 4 years old again. This was most enoyable because I could play like a kid and not worry about responsibility. This lasted for about three hours, until I was ready to chill.</p><p> We went to bed and put on music. This had a negative effect, I started to get real self critical and was making sure I had treated everyone with respect and all that kind of stuff. I tried to shift the phase and work on deep breathing and maybe even some Spiritual work, but the cat was not leaving my pillow so it was hard to concentrate with her energy all over me keeping me grounded which was prolly good anyway. When I awoke this morning, I was still feeling the effects and can feel a bit now. </p><p>This is a powerful experience and will continue to explore my own persona. Peace and Love to all new and old explorers. Have fun and be careful. Read all the info you can get before trying this it is a powerful change and you need to be ready for what will take place.</p>"
}
