{
 "title": "On Snorting",
 "author": "Mortxed",
 "citation": "   Mortxed. \"On Snorting: experience with DXM (ID 7226)\". Erowid.org. Aug 27, 2002. erowid.org/exp/7226",
 "substance": "DXM",
 "bodyweight": "195 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "insufflated",
   "DXM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7226",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 27, 2002",
   "Views: 16154",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI use DXM quite a lot. I've been using it off and on for about two years, usually in ~400mg doses once or twice a week with ~800mg doses every now and then. I've gotten pretty hooked on several occations, doing it on a daily basis until I realize it's time to get a grip and lay off for a few months. The point here is I have a good bit of experience with the substance and it's effects on me.</p><p>I use plain Robotussin(tm) some of the time, but since I have a fairly regular habit, I often use pure powder since it's cheaper and more pleasant to take. I most usually stuff it in capsules. Although I have no scale, comparing the effects of premeasured robo and my caps, I have a vauge idea of how much powder is how much. It seems the caps I usually fill contain ~400-500mg, since they are a little stronger then a 4oz of robo.</p><p>I've been toying with the idea of snorting DXM instead of swallowing it for some time. I figured it may speed up the onset (I usually see 1 hour delay with robo, 1 1/2 hour with caps. Remember, this is me. It may be vastly diffrent for you and your body), and perhaps get more milage out of the powder. I checked the net and found very little. The only actual experience I found was here at erowid and that person sounded a little inexperienced. Also, he did ~400mg, which IMO sounds like and awful lot since insufflating generally deliver quite a bit more into the bloodstream then swallowing.</p><p>Finding nothing, curiosity got the better of me. One day, after having taken 400mg approximatly 6 hours previously, the mild trip was fading, nearly gone altogether. I scooped out what I approximate to be 100mg of powder, about the volume of 8 match heads or so. I snorted it through a rolled up piece of paper. It burned a bit, but not bad at all. The burning lasted about five minutes. I felt some sort of effect after 5 sec or so, my head seemed to 'open up', kind of like I'd taken a hit off an ephedrine inhaler. I never really felt much effect beyond that, but otoh I did still have some DXM in my system to begin with.</p><p>Encouraged by the mild stinging (I was expecting a lot more), I decided to not do DXM at all for a while and try it again with a clear head. After two days, I decided it was time. I got out my powder again and layed up two piles, ~100 each. I had taken a 25mg ephedrine tab about an hour or two before, which may have affected the state of my nasal membranes. I did both piles, one in each nostril. This time it stung pretty bad, not unbearably bad, but bad. After a few minues, the stinging got worse. And worse. And worse. I started tearing up, taking deap long breaths in through my nose and out through my mouth, which helped a tiny little bit. After about ten minutes, I could feel the effects comming on a little, but my sinuses were still stinging too bad to really notice. I sucked some water up through my nose, attempting to dull the pain. Nothing really worked very well. This was majorly bad. I ripped through my medicine cabinet and found some saline solution and squirted puff after puff into my tortured sinuses. It helped a little, the pain started fading a little as I gagged on the salty water running down the back of my throat. A full 30 minutes after I did the deed, the pain was nearly gone. I felt very sore and did so for a good hour and a half. I kept fealing slightly sore throughout the rest of the day. At the half hour mark when the pain went down enough to actually tell, I felt about as if I'd taken ~400mg orally. In other words, this venture saved me around 200mg of powder and perhaps an hour of activation time.</p><p>I would recommend this to my worst enemy, but no one else. If you want to try, my suggestion would simply be DON'T. If you do, I can almost guarante that you will not try it again. I hope this experience sheds a little light on this subject and will be found by the next wandering DXMer wondering if snorting is a good plan.</p>"
}
