{
 "title": "A Few Impressions of Salvia Experiences",
 "author": "Jaytee",
 "citation": "   Jaytee. \"A Few Impressions of Salvia Experiences: experience with Salvia divinorum (ID 723)\". Erowid.org. Oct 10, 2000. erowid.org/exp/723",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "723",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 10, 2000",
   "5661",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having grown salvia for about 4 years, I'm pretty familiar with propagation, growth patterns, and the parasitic insects that can suck the plant dry (sterilize your soils!); outdoor growth is by far the best.</p><p>Haven't consumed any in a while: it's too overwhelming at times, though the good experiences are worth it..you just can't predict when these will be. Early on in usage, a friend and I noticed a sort of physical expansion feeling, like the comic character Plastic Man. This was generally in combination with cannabis, with salvia the minority component. Fun, pleasant.</p><p>First weird experience was turning around to see my friend covered with animated white squiggles all over his body that looked like the numeral '1'. Very jolting and unexpected, although closing my eyes and resting alleviated the tension I felt (this had been an eyes-open hallucination). Another interesting situation was in public, (do not do this!) where it was impossible to tell whether I had spoken my thoughts to another person, since the voices in my head were so distinct, even gender-specific. This sort of telepathy happened on another occasion, where I thought I could hear voices of others nearby. One experience smoking a strengthened version resulted in an abrupt visual whiteout, with the sounds of the room echoing away.</p><p>Set and setting are crucial with this plant. Be in a safe setting, reclining comfortably if possible. Plan carefully to eliminate possible fire hazards if you smoke, as your mind may trip off at any instant. Darkened areas are ideal, but silence is NOT necessary (despite what Pendell says in his book), just tranquility. Review all of the available literature you can find before using, and use a proper way to enjoy this fascinating plant.</p>"
}
