{
 "title": "Tent tripping",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Tent tripping: experience with Mushrooms (P. semilanceata) (ID 7238)\". Erowid.org. Jan 15, 2003. erowid.org/exp/7238",
 "substance": "Mushrooms (P. semilanceata)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "oral",
   "Mushrooms - P. semilanceata",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7238",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 15, 2003",
   "Views: 6588",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At a camp last week in Somerset, England, I embarked on a shroom trip with two friends.  This was my first proper mushroom trip as before I had only smoked them providing me only with short buzzy experiences.  </p><p>We had 4.5 g dried of Psilocybe semilanceata, and took roughly equal doses.  I made sure I was no longer stoned from some canabis smoked earlier as I wanted to fully experience the coming up.  We kept brewing the shrooms with tea in a saucepan until most of the psilocybin was consumed.  We then chewed on the remaining shrooms.  The brew did not taste as bad as expected as the taste was covered by the tea.  Our trip begun in an abandoned caravan just off site.  After the brew I started to feel strange and light-headed almost immediately.  I think my friends were coming up faster than me though, as their pupils were already huge at this early stage.  They had become extremely energetic and violent towards the caravan and had begun kicking at the old metal.  One of them had begun shouting 'You cocksucking motherfucker you!'  (his little phrase for the entire of his trip!)  I could feel myself coming up properly now and just lay on the old matress laughing hysterically at my friends.  The caravan appeared to have enlarged and become a huge hall, and the cracks in the floor formed intricate patterns, like celtic crosses. </p><p>The caravan began to feel unhomely, though, as my friends both injured themselves when they broke a window and the ceiling seemed to be caving in!  We became so paranoid about this that we ran screaming for the door!  Although it was paranoia, it was a pleasant, hysterical fear.  It made me feel like a little child again!</p><p>The most unpeculiar feelings came when we were back on site.  The grass was at first an eerie bright green and seemed to glow.  When I concentrated on its colour it turned yellow, and started coming closer to my face although I was standing upright.  At the time it was very funny.  I then started to really trip out.  A very trippy song came into my head that I cannot put a name to and I started to slip away from reality.  It was as if I was trying to discover reality but could not find it.  I became paranoid I would remain like this forever.  After a while I realised that I had not lost touch.  I began to believe that for the first time in my life I was using all of my brain.  I had become a higher lifeform.  I imagined energy flowing from my fingers in blue patterns.  I felt like a god.  I began to have extreme energy rushes. And the tune in my head became louder.</p><p>About an hour later when I had come down a little bit, my friends and I were squashed in a tent with a few other people smoking cannabis. (I had none so as not to spoil the mushroom effects).  The more violent of my two friends (I would like to point out that he is not usually violent) began burning someone's hair who was not tripping.  She became so annoyed she poured the bong water all over him.  I am sure now that if we hadn't hidden his knife earlier, she might be dead and he in prison.</p><p>I more or less came down to earth three hours later.  The whole trip had lasted around four hours.</p><p>The after effects were quite weird and lasted for the rest of the day.  We sat in my tent with the most weird converstaions I have ever participated in.  Every now and again I would get these little rushes that made me excited I was coming back up, but as soon as they begun they finished.  Eventually I went to sleep and did not dream.</p><p>Next time I will increase the dose to 2 g of P. semilanceta at least!</p>"
}
