{
 "title": "Reality Took a Step Back",
 "author": "Psilo",
 "citation": "   Psilo. \"Reality Took a Step Back: experience with Salvia divinorum (5x extract) (ID 7239)\". Erowid.org. Feb 10, 2003. erowid.org/exp/7239",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "182 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7239",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 10, 2003",
   "Views: 5774",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirstly, let me say I have tried many different hallucinogens (LSD, PTP, 2CB, Mushrooms (4 or 5 varieties), Nutmeg and DMT.  Of all these, DMT was the closest to what I experienced with Salvia.\r\nI bought 1 gram of Salvia from a local shop in the UK, and a small water pipe to take it with.  Drove home, the sun shining and a warm feeling of anticipation.  When I got home, I cleared the front room up, drew the curtains and sat down on the floor.  Having taken DMT, I knew how fast the effects could come on, so placed about 1/5 of the phial (about .2 grams) into the bowl, set the bong on the table and readied the lighter.  I had seen the notes to have a sitter present, but again, having taken DMT and THINKING that I knew better, I proceeded to light the bong all aone in my house.\r\nI picked it up and took a large hit which I held for about 20 seconds, as I took the bong away, I noticed there was still a lot left, so took a second hit, placed the bong on the table, and as I did so, my reality began to slip away.\r\nIt's hard now to describe what I was feeling (I took it about 1 1/2 hours ago), the first thing was I felt scared, I wasn't sure why at first, but then someone told me I shouldn't have taken the second hit, I didn't see anyone, but people were talking in my head.\r\nI looked at the bong and started to panic, I felt that I had done something VERY wrong, but did not know what.  I felt that I had to get out of the room, and quickly went up the stairs to my bedroom, here I laid down on the bed, I felt that I was getting sucked into the bed and would drown in the quilt, so tried to get up and go back downstairs. \r\nIt was at that point that reality took a good step back and things started to go really weird.\r\nMy left foot and leg seemed inextricably attached to the upstairs of the house, where my right foot and leg seemed to be attached downstairs.  I honestly felt like I was stretching and blending into the house, becoming one with it, I also felt if this happened then I would be stuck there forever.  I don't recall getting downstairs, but was suddenly at the kitchen sink with the bong.\r\nI was hurriedly trying to clean it out, and get rid of the evidence, it was only now that I really recalled that I had taken the Salvia, and as this reality struck, the effects lessened and I gained control of my body again.  I sat outside for a few minutes in the sun and really came back down, there was a weird minute or two where the 2 realities seemed to combine and I couldn't be sure what was real, then my cat jumped on my lap and I calmed right down.\r\nThe time this elapsed over was about 20 minutes.  I wrote down the time when I took the salvia, 3.20 and it was 3.40 when the cat jumped on me and I remembered to check the time.  For another 20 minutes or so, my senses, especially sound and sight were heightened, and I felt slightly uneasy.  Within 1 hour of taking it, I felt back to normal.  \r\nIt's rather strange, during the trip I felt very uneasy, scared, and REALLY believed I had done somthing Terrible, although I did not know what.  When I finally remembered that I had smoked Salvia, the scariness went away, as I just reassured myself that after 15-20 minutes it would all be over.  However, after 45 minutes or so, I looked back and enjoyed the feeling, there were moments when I felt I had every answer (if only I knew the question!) and the merging with the house, although very scary at the time, was also somewhat enjoyable.  \r\nNext time I do it I will have somebody present that I trust, probably my fiancee.\n\n\n"
}
