{
 "title": "No Real Mental or Emotional Insights",
 "author": "Abyss",
 "citation": "   Abyss. \"No Real Mental or Emotional Insights: experience with Kratom (10x extract) (ID 72455)\". Erowid.org. Jan 25, 2009. erowid.org/exp/72455",
 "substance": "Kratom (10x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Kratom",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72455",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2009",
   "Views: 25439",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA Little Background\r\nI am a young male adult in his early twenties.  I have self diagnosed myself as dysthymic (chronic mild depression) with recurring major depressive episodes.  I have little motivation, constant low energy as well as being mildly anhedonic with a blunted affect.  I have been this way my whole life for as long as I can remember.  I was once prescribed fluoxetine (Prozac).  I took it for 10 days at 10mg before discontinuing the medication as it was ineffective.\r\nConsequently, I am always on the search for something that may help, though I believe nothing can cure me of this depression.  I am also aware that a daily dose of any drug is not the answer.  With this in mind, I tend to experiment with almost any substance I can get with the utmost discipline to avoid habituation, though my main passion in the area of drugs is psychonautics with psychedelics.\r\nRecently I came across Kratom and decided Id give it a try.\r\nPreparations\r\nCapped 2.0g of 10x Kratom extract the previous night into OO gel caps.\r\nTried some Calea zacatechichi the previous night although it was ineffective and I remained baseline.  Did not sleep well that night and as a result, I am quite tired today.  Two cookies were eaten this morning with some milk, along with 750mg GABA, 500mg vitamin C and ~1,000 IU vitamin D.  Not long after, I drank one cup of green tea for the caffeine.  Nothing was eaten until the substance had kicked in.\r\nStarted doing somewhat rigorous work outside around 11:20.  After working for roughly 1:30 hours I ingested the four caps containing the 2.0g of 10x Kratom extract.\r\nSetting\r\nIt is a warm summer day.  I am tired, but with the aid of caffeine I have some energy to work in the yard with my father.  The following are some excerpts from my trip log.\r\n12:45 (T + 0:00)  Ingestion.  4 caps of 0.5g 10x Kratom extract (2.0g total) taken on empty stomach using ½ & ½ orange juice (+Ca) & cranberry berry juice to wash down\r\nT + 0:42  Aware: no overtly obvious effects, just a general sense of well being  comfort  almost inner warmth.  Not sure if this is the chemical though, +/- at best.\r\nT + 1:13  Peak: head high stronger producing a more pronounced but relatively mild lightness/dizziness/euphoria (compared to real opiates).  Very enjoyable.\r\nT + 2:19  High: peak is definitely over.  Some loss of energy but motivation/well being is there.  Head high is diminished but still present.  Small inkling or urge to use again.  Must be careful or one could easily become habituated to this.\r\nT + 4:19  Comedown: definitely entering comedown now.  Getting sort of spaced out and lazy and tired.  No high  losing motivation and energy quickly.\r\nT + 9:13  Comedown complete\r\nT + 21:35  Next day: feeling very tired and hung-over.  Getting out of bed was difficult.  Very tired  eyes burn a bit.  Sensitivity to light and noise.  No sociability.\r\nThis was an interesting substance with possible benefits and substantial drawbacks.  At first, this extract showed quite the potential for anti-depressant and motivational properties, but considering its effects the following day, I have decided this should be avoided.  The high is mild but very pleasant and not overwhelming, like a box that has been dulled into a sphere; the object is still there, but much smoother.  It produced over three hours of motivation and energy without the pushing or jitters of other stimulants such as caffeine or amphetamines.  Like with other stimulants, I noticed a slight increase in sociability, though this remains un-tested on strangers.  Kratom could be a good candidate for alcohol replacement in social situations if this property holds up.  A very pleasant and much enjoyed sense of well being (not a high in any sense, just well-being) was felt throughout the experience, even during the onset before any other effects were felt.  The come-down is also enjoyable; very reminiscent of a marijuana stone, but toned down a few notches.  There were no negative draw-backs to the high at all, and the only problem with the come-down was the loss of motivation and energy, but the relaxing and sedating stone was an adequate replacement. \r\nThe downsides are three fold.  First, it produced a hangover, not unlike alcohol the following morning.  This was despite the fact that I took a moderate dose, early in the day with sufficient food, water and adequate sleep that night.  Secondly, on the following days (most pronounced the day after), I noticed a significant lack of motivation and energy in comparison to my normal baseline state leading me to believe it depletes some reserve of dopamine, serotonin, and/or some other neurotransmitter.  It took approximately five days to reach my normal levels of motivation and energy.  Thirdly, during the comedown and the day after, I felt an urge to use again.  Not an urge like, that was fun, lets do it again, like I feel with tryptamines.  This was not a desire to enjoy a fun experience like that; no, it was a more primal urge to re-use, even during the experience.  It reminds me of my strong desire to use marijuana during a relapse; the urge that defines addiction.  \r\nAll these factors indicate quite clearly to me that this substance has a potential for habituation and dependency.  I suspect chronic use of Kratom could cause damage to the dopamine system as is seen with chronic opiate users.  This property could present a serious problem if not controlled, and coupled with high cost, this drug should be used only in moderation with the utmost importance not to binge or re-use within a short time frame.  From the first trial, I would suggest waiting at least one full week between uses, or even two or more weeks.\r\nIn retrospect, the magnitude of the sedating stone I experienced during the comedown could be the combined result of the caffeine comedown and the fatigue from a hard days work and a sleepless night.  This could also have intensified the hang-over and lack of motivation on subsequent days.  A repeat experiment is needed for a full definition of this substance within my body.  I suspect I will also experiment with this substance in social situations and possibly some form of stimulation, motivation and/or inspiration, but will never buy again.  It provides no real mental or emotional insights, though it may prove to be of some value in social situations.\r\nList of Effects\r\nDry mouth; mild & fleeting\r\nEnergy\r\nMotivation\r\nSense of well being\r\nIncrease & decrease in sociability\r\nEuphoria; mild\r\nLight headed dizziness; very mild\r\nSuppressed appetite\r\nSedation/stone\r\nLethargy\r\nMicro-sleep\r\nHeadache; minor\r\nHang over\r\nDuration\r\nIngestion: (0:02) 12:45  12:47\r\nOnset: (~0:45) 12:47  13:29\r\nCome-up: (~0:30) 13:29  14:00\r\nPeak: (~1:00) 14:00  15:06\r\nHigh: (~2:00) 15:06  17:06\r\nCome-down: (~5:00) 17:06  22:00\r\nTotal Duration: ~8-9 hours (8:31 recorded)\n\n\n"
}
