{
 "title": "A Pleasant Shade of Mellow",
 "author": "Godlesssaint",
 "citation": "   Godlesssaint. \"A Pleasant Shade of Mellow: experience with Chamomile, Damiana & Alcohol (ID 72542)\". Erowid.org. Nov 21, 2011. erowid.org/exp/72542",
 "substance": "Chamomile, Damiana & Alcohol",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Chamomile",
   "(tea)",
   " ",
   "  ",
   "oral",
   "Damiana",
   "(tea)",
   " ",
   "100 ml",
   "oral",
   "Alcohol - Hard",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "72542",
   "Male",
   " ",
   "Not Given",
   "Nov 21, 2011",
   "8724",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am feeling really good right now. Day off, a good afternoon nap, and a really cool infusion I made this morning.</p><p>The local food co-op sells this wonderful herbal tea with damiana, chamomile, and other natural relaxants and tasties. I put about an ounce of it into my remaining half a liter of bourbon. I heated up a pan of water almost to boiling and placed the bottle (ALWAYS with the lid off to prevent pressure build up in a glass bottle) into the water AFTER turning off the heat. Let it sit there about a half an hour, then took it out as the water was almost cool anyway. Put the lid on once completely cool and shook vigorously. Let sit for 8 hours.</p><p>About an hour ago, I poured me a man-sized drink (about 100 ml). It tasted pretty good. Next time I will use a smooth vodka so I could taste the tea Better. Still, it made for better bourbon.</p><p>Right now, I feel GREAT!. No stress, sitting here at the computer, all mellow and relaxed. Feel like nothing in the world could bother me. Not fucked up, not hallucinating, still in a normal reasoning state, but very nice and mellow. SOOOOO much more than my usual 100 ml of bourbon can do for me. This recipe is very highly recommended for anyone who just wants to chill out without getting messed up.</p>"
}
