{
 "title": "Suicide Attempt",
 "author": "Anonymous",
 "citation": "Citation:   Anonymous. \"Suicide Attempt: experience with Zolpidem (Stilnox) (ID 7258)\". Erowid.org. Jan 17, 2003. erowid.org/exp/7258",
 "substance": "Zolpidem (Stilnox)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 7258",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 17, 2003",
   "Views: 44741",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n- No it is not a typo mistake, three hundred miligrams -\r\nThe sun was shining,\r\nthere was no cloud in sight.. and life is good..\r\nUnfortunately, that's not how I saw it at the time..\r\nI had started a business and it collapsed, and I was feeling betrayed by my friends... (I shall elaborate no more, but its much more than what i just said)\r\nI went to a psychiatrist I know, and explained I am having sleep trouble, I suggested Stilnox (zolpidem).  He took out his pen, and a paper with his letterhead, wrote a prescription for what I suggested - 2 boxes of zolpidem, each containing 20 rectangular-like white pills of the poison, signed and stamped it. (Dont blame him, I just knew what to say..).\r\nThe A4 paper was taken to an MBE postoffice branch, and color-photocopied several times. Its a big town, so three pharmacies were approached each given a photocopied prescription, and each paid an amount of around 14$ for the two boxes. I had ended with a fair amount of zolipdem power, enough to put to sleep a whole army.\r\nIt was night, I went to what is left of my office, to go down with my ship; There were no second thoughts.\r\n10 pills were swallowed at first.\r\nSome 30 minutes later, I began to feel its effects.\r\nSo I continued taking more pills, few - every few minutes.\r\nSoon everything began to look like its colors were scrambled\r\nlike an oil painting with distinctive yellow, which seemed and felt\r\nvery enjoyable, the entire room was shinning.\r\nI began coming in and out of consciousness, Trying to convince myself I can stand up, I would lift myself up, and then fall back hitting the back or front of my head on the floor, this happened repeatedly, for many many times, and my hands did not serve me, to break my fall -- I would just slam my entire body weight uncontrollably due to lack of balance, to the back of my head, which would make contact with the floor, sometimes before falling my legs would push me to a nearby wall, were I would slam into it either I would go reverse or forward, either way.. until I found a cousy spot on the floor, and slept for the next four hours.\r\nI woke up, and for the following two days, I had an intense feeling\r\nas if my brain is pushing out from the inside to the outside, and that i was _this_ close from popping some blood vessel there.\r\nI didnt seek medical attention.\r\nEven a year later, when I try to take Zolpidem at a dose of 5 mg\r\nI get an horrific headache, and i feel as I just got hit by a truck.\r\nLooking back, it was yet another miracle in my life which seems to be full of miracles, as sometime later I tried the same thing with the same MO only with Hypnodrom and Bondormine; Which I also survived; which is yet another miracle.\r\nAt the time I was faithless\r\nI had nothing in my life but my work\r\nI felt as I gave my friends everything and that after they had used me they had betrayed and abandond me.  I wanted to disappear - forever.\r\nI survived.  Till this very day a year later, I have short term memory loss, but generally I am okay, I know that I will never try to suicide again, as I was given the gift of life which is something very precious that should be cherished and not disposed even when you are so frustrated that you cant even cry, and that you cant feel.\r\nIf you feel you are in a similar position and you just dont care\r\nof what will come next, I beg you to stop and think, dont do something at the heat of the moment, even if the heat of the moment is a full month or a very frustrating year.\r\nLife has so many good things to offer, but they are like diamonds in the earth, to get to the truely pure ones, you have to really dig deep, its really hard to find them just scattered on the ground.\n\n\n"
}