{
 "title": "Started Off Bad But Ended Great",
 "author": "Defpo",
 "citation": "   Defpo. \"Started Off Bad But Ended Great: experience with mCPP (ID 72601)\". Erowid.org. Aug 8, 2009. erowid.org/exp/72601",
 "substance": "mCPP",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "55 mg",
   "oral",
   "Piperazines - mCPP"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72601",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 8, 2009",
   "Views: 5534",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nT:0\r\nmCPP down the hatch... bad taste... almost sour and bitter at the same time. Not bad if mixed with Gatorade.\r\nT:15\r\nLight nausea onset, not unbearable but uncomfortable. Pupils beginning to dilate. Everything seems bright. \r\nT:30 \r\nStrong nausea, vomiting. There goes a good lunch.\r\nT:40\r\nHunched over the toilet vomiting again.\r\nT:60 \r\nNausea has completely subsided and now I am beginning to finally enjoy the experience. \r\nT:80\r\nPupils highly dilated. Everything seems to be moving slightly. The farther away the object of focus the greater the movement. Looking outside provides an almost earthquake like feeling. A mild paranoia is also beginning to set in. It feels like someone is in the room with me when no one actually is.\r\nT:100\r\nEarlier regrets and feelings of why did I do this have completely gone out the window. It feels great. I feel happy without a care in the world. Its incredible. \r\nT: 2 hrs \r\nBeginning to worry as I have to be at work in 30 minutes and I have still not come down. Paranoia greatly increased by this worry. Still feeling good over this worry/paranoia.\r\nT: 2hr15min\r\nTime to head to work and still flying. Everything outside looks amazing as I walk through the grass, looking down into the grass, everything seems to become greener as I progress, eventually becoming a glowing neon green. 2 cigarettes help to ease any worry about going into work. \r\nT: 2hr30min\r\nArrive at work. To my surprise the only symptom that I am unable to control is the incredible dilation of my eyes and some occasional jitters. Other than that work actually became quite enjoyable in this state (by saying this I do not recommend that anyone goes into work after taking mCPP or any other drug, ultimately I regret doing it).\r\nT:3hr30min\r\nFinally coming down. Euphoria less noticeable. Mild headache coming on. \r\nT:4hr\r\nEffects of drug, other than eye dilation, have all but disappeared. Headache strengthening. \r\nT:5hr \r\nEyes back to normal. Headache almost unbearable. A few advil taken to ease the headache. After I got past the initial nausea it is all worth it.\n\n\n"
}
