{
 "title": "Old Family Recipe",
 "author": "Alvaterssklave",
 "citation": "   Alvaterssklave. \"Old Family Recipe: experience with Henbane & Alcohol (ID 72632)\". Erowid.org. Jul 28, 2008. erowid.org/exp/72632",
 "substance": "Henbane & Alcohol",
 "bodyweight": "282 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Hyoscyamus niger",
   "(extract)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72632",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2008",
   "Views: 30822",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The misinformation on henbane has gotten really bad. If youre looking for a crazy, LSD high, FORGET IT.</p><p>Let me start by saying that my family has been using henbane in hombrewing for hundreds of years, and the reports one reads on the Internet about its deadly effects are ridiculously overstated. My grandfather drank Pilsenkraut-spiked beer and whiskey his whole life, and was never seriously affected, other than the mild nonsense-speaking effects that the weed can have once it really grabs onto someone. That probably sounds terrible, but its harmless, and can be profound.</p><p>My mothers family is Karpatendeutsch, meaning Germans from Slovakia and Transylvania. Pilsner is originally simply beer made with henbane instead of hops or henbane mixed with hops. I brew it regularly, drink it regularly and am not a babbling shaman or smelly hippie. </p><p>Let me tell you how we make it, first. </p><p>5 gallons of clean, non-chlorinated water</p><p>7 pounds of fermentable malt extract, available at brewing supply stores</p><p>About 1 ½ ounces henbane leaf and flower, dried</p><p>1 ounce of hops to taste</p><p>Yeast (I recommend Muntons Ale)</p><p>Boil water, add malt, boil malt together with hops for one hour.</p><p>Using a separate tea-bag infuser, add the henbane about 15 minutes before the end of the boil. Leave the henbane infuser in as the beer cools. Take the infuser out when beer is 80 degrees, add yeast and ferment somewhere dark and cool. Read up on brewing elsewhere, as cleanliness is essential.</p><p>Prime, bottle and age about a month. Drink at about 55 degrees. </p><p>With all that out of the way, let me say that drinking more than six beers or so may indeed be dangerous. I dont know, as the beer is so filling and the taste so strong (kind of like an earthy licorice) that I dont think anyone I know has ever downed more than six beers. If someone reads this and drinks 15 real Pilseners and dies, that sounds like karma to me. So everything in moderation, huh kids?</p><p>Here are some effects I notice from Pilsener. I had a few just last night while barbecuing.</p><p>1.\tTime becomes a bit strange. For example, grilling chicken can be a long and tedious wait, trying to cook the meat evenly through; before I knew it, the meat was perfectly done and it seemed like the meat had only been on the grill for ten seconds, even though it was about 40 minutes.</p><p>2.\tVision can become a bit weird, too. Photographs may look very detailed or deeply shadowed, almost 3-D. People can look like they are made of rubber or latex. </p><p>3.\tI have to be careful what I do when I have Pilsener in my belly as my pain threshold goes through the roof; I can hurt myself badly and not feel it for hours. No power tools!</p><p>4.\tIf I really push it and start getting to the 6 or 7 beer range, I can get a little delirious. My wife told me I once wandered around the house, wetting towels and telling her we had to get our daughters fever down. My little girl was not sick at the time and I dont remember the episode.</p><p>5.\tHenbane can give me terrible, horrifying nightmares if I eat too much while I drink it. These are nightmares that will haunt you, buddy, so be careful. After a few beers (and a bowl of cereal) I once dreamt that my dead next door neighbor was trying to get into my house after clawing her way out of the grave; I have never forgotten what a gruesome dream it was. If you drink Pilsenser, DO NOT EAT BEFORE BEDTIME.</p><p>6.\tThe hangover from overdoing Pilsener includes diarrhea, muscle aches and cramps and a headache that will make me suicidal. </p><p>Okay. So that all sounds bad. But Pilsener is a sometimes thing that can be a lot of fun and can be VERY relaxing. Its especially good on cold, holiday nights with lots of pretty tree lights and carols. I dont drink more than three in one evening and I dont do it more than a couple times a month. I consider it a part of my ethnic heritage, and I enjoy the taste.</p><p>I hesitate to mention it, but henbane leaves can be steeped in hard liquor for a few days to get the same effects. Just be careful as the effects are stronger and it takes FAR, FAR, FAR less of this alcohol to give the effects. Add about ¼ ounce to a bottle of vodka and leave it alone for a few weeks. Then have a shot or two. DO NOT OVERDO IT.</p><p>Thats the mantra for henbane: DO NOT OVERDO IT. Youll be sorry if you do.</p>"
}
