{
 "title": "Mixing to Overdose",
 "author": "Dare2think",
 "citation": "   Dare2think. \"Mixing to Overdose: experience with GHB & Alcohol (ID 7266)\". Erowid.org. Jan 17, 2003. erowid.org/exp/7266",
 "substance": "GHB & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "6 cups",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   " ",
   "3 caps",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7266",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 17, 2003",
   "Views: 14222",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMy friends & I have an understanding of how GHB works and how much to take.  I have never had a problem myself, although I became involed in one at my house party.\r\n5 AM. Everything is going well, and slowing down from a good night of music.  One of our DJ's (who had been drinking beer all night) thought it would be nice to dose himself.  None of us noticed him using/drinking the GHB or we would have stopped him. \r\nI didn't even know he had taken any... Until one of friends asked me to see what was wrong with him?  I'm not sure how much he took, (he has an ego problem) but I'm sure it was more than 3 water bottle caps of very strong G.\r\nHe had his shirt off and was very hot.  He was walking around making strange noises and had a 'Blank' but crazy look on his face.  He couldn't or wounldn't talk, and this got me worried.\r\nHe sat in a chair, pulled down his pants and underware and defecated in the chair...This really sucked since I had to clean it.\r\nI've seen others 'OD' as they say.  Which means you put the person in bed and watch the breathing (which will be very long & deep).  Also, turn the person on their side to keep them from choking on vomit.\r\nThe next step was to try and get him to go to sleep.  He was fighting the GHB effects and us.  It took about 4 of us to 'Over Power' him onto the floor where we had a bed waiting for him.\r\nI told his friends that he would be alright once he started sleeping.\r\nThe next morning he woke up, feeling fine, but not remembering anything about the night before.  He said he would never use GHB again...We all hope this is true.\r\nAs for my friends & me, we use GHB very carefully.  It is a God send for people who use it correctly!\n\n\n"
}
