{
 "title": "Effective Alternative",
 "author": "Doctor Faust",
 "citation": "   Doctor Faust. \"Effective Alternative: experience with Atomoxetine (Strattera) & Mirtazapine (Remeron) (ID 72740)\". Erowid.org. Nov 6, 2009. erowid.org/exp/72740",
 "substance": "Atomoxetine (Strattera) & Mirtazapine (Remeron)",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "80 mg",
   "oral",
   "Pharms - Atomoxetine",
   "(daily)",
   " ",
   "45 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "72740",
   "Male",
   " ",
   "Not Given",
   "Nov 6, 2009",
   "13016",
   " "
  ]
 ],
 "report": "<p>Im a psychologist in training and work at a nationally recognized specialty AD/HD clinic. However, the following should not be construed as psychological and/or medical advice. I am simply reporting my personal experience with the above named substances.</p><p>I was diagnosed with AD/HD at a young age; however, I was intelligent enough that I was able to go med-free until ninth grade, which is when the pre-IB track began picking up. From about 15 years of age to 20, I took 40 mgs of Adderall (amphetamine salts) per day. Although it was effective, there were some down sides. With Adderall, there was an on and off feeling; that is, I knew when it was working, and when it wore off. Although mitigation of my AD/HD symptomology was a necessity, I didnt always feel like myself- after all, spacing out, hyperactivity, etc. are who I am. Not all of it is bad- Ive had great insights during some of my space outs, in this instance more appropriately labeled dissociation. I stopped taking the Adderall for six months. It was hell. I definitely have AD/HD, and I could barely function.</p><p>For the last five years, Ive been taking 80mg Strattera (atomoxetine) each morning and 45mg Remeron (mirtazapine) each night. Together, the two work synergistically to mitigate my AD/HD symptoms, with no on and off feeling. While they may not work quite as well as amphetamines or methylphenidate, I still feel like myself; that is, I can concentrate when I have to, but still be AD/HD at appropriate times. Since Im currently working on my PhD, I have to concentrate a lot. Ive got the motivation and the cognitive-behavioral skills; the medication is the missing piece that allows me to realize my full potential.</p>"
}
