{
 "title": "A Not-so-obvious Trip",
 "author": "Spamninja",
 "citation": "   Spamninja. \"A Not-so-obvious Trip: experience with 2C-D (ID 72829)\". Erowid.org. Sep 22, 2008. erowid.org/exp/72829",
 "substance": "2C-D",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "55 mg",
   "oral",
   "2C-D",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 72829",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 22, 2008",
   "Views: 4525",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>55mg of 2C-D is carefully measured and placed into a gel capsule. I'm in a neutral mood, not depressed or sad, but also not blissful or enthusiastic either.</p><p>2:35 - Capsule ingested on an empty stomach.</p><p>3:22 - Went off to play a game in order to occupy myself, stopped just now and my head feels a little weird, slight effects, I put on some Infected Mushroom, some of my favorite music to listen to while experimenting with psychedelics. The music is nice and attractive, doesn't bring upon major effects so I'll guess that the 2c-d is still coming up.</p><p>3:35 - Music (even relaxed music such as The Police) seems too much, kind of intrusive and uncomfortable, so I turn it off. Effects are intensifying, but I can't really put my finger on what kind of effects are present.</p><p>I felt more emotional and slightly speedy until maybe 6-7 o'clock. Effects never really came, I felt like I was tripping in a way, definitely a ++, but effects were never really pronounced. Very, very light visual waving, and a little bit of an empathetic feel, but definitely nothing strong at all. I had thought about combining with 2c-b once the trip had gotten started, but after the 2C-D kicked in, I didn't feel any desire to take anything else.</p><p>2C-D seemed like it would be a great potentiator of other psychedelics, or good to extend the duration of them, at least. Taking some a while after taking another drug would probably extend it without adding much in the way of other effects, since 2c-d doesn't seem to possess many effects to start with, but just a theory.</p>"
}
