{
 "title": "Slipping into Zen",
 "author": "Free Rider",
 "citation": "   Free Rider. \"Slipping into Zen: experience with Yarrow & Cannabis (ID 72877)\". Erowid.org. Jan 9, 2010. erowid.org/exp/72877",
 "substance": "Yarrow & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "4 glasses",
   "oral",
   "Yarrow",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 72877",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 9, 2010",
   "Views: 6233",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Its a little odd as to how I've stumbled upon this plant. It grows in some patches near my home. I did a lot more research before I actually tried Yarrow, just so I didn't get into something id regret. The first day I decided experiment was an aftermath of a crazy experience the previous night (lucy, mary, and sally were all there). I didn't need to peer pressure my open minded friends due to their curiosity. </p><p>So of course, insomnia blues ensued that morning. After a 20 minute boil with about a gallon and a half made, we prepped. Smoked a few bowls while we waited, finally done. I really didn't do much to make it. Water, a few yarrow stalks, honey/sugar, heat, done. Any who, after sipping to the bottom of the cup, my friend and I glanced at each other, thinking the same. Am I feeling anything? I sat back in the chair, easing off of every muscle. Suddenly I settled into a sense of calming euphoria. I breathed slowly trying to sense anything. I felt very clear minded and confident, I seemed to feel at one with everything. </p><p>There isn't anything nuts or visual about yarrow. A good way to put it (after trying it several times sober, or to cure myself), is that it puts me into a very zen state of mind, same as I feel after a bowl pack. I felt almost uplifted and clean, the warmth totally blew away the hangover. After 3 more glasses, my friend and I began talking about how we felt. I could feel the narcotic running through my body, everything was great. Honestly, I felt entirely relaxed and steady. It felt as if I ripped the bong a few times (without vibrating visuals). </p><p>When coming down from an acid trip, I feel so verbally frustrated, that I cannot explain my logic to people. After my test runs with the yarrow, I felt as if I was able to clearly let my thoughts flow through my head and out my mouth.</p><p>All in All: Yarrow is definitely something that my body and mind could really use. I've now had about 7 friends try this tea out. It is now somewhat communal amongst my friends and I.</p>"
}
