{
 "title": "Party Like a Zombie",
 "author": "AtomicPup",
 "citation": "Citation:   AtomicPup. \"Party Like a Zombie: experience with Zolpidem (ID 72944)\". Erowid.org. Oct 12, 2013. erowid.org/exp/72944",
 "substance": "Zolpidem",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "12.5 mg",
   "oral",
   "Pharms - Zolpidem",
   "(ground / crushed)",
   "  T+ 0:30",
   "12.5 mg",
   "oral",
   "Pharms - Zolpidem",
   "(ground / crushed)",
   "  T+ 3:00",
   "12.5 mg",
   "oral",
   "Pharms - Zolpidem",
   "(ground / crushed)",
   "  T+ 4:00",
   "25 mg",
   "oral",
   "Pharms - Zolpidem",
   "(ground / crushed)",
   "  T+ 6:00",
   "37.5 mg",
   "oral",
   "Pharms - Zolpidem",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72944",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 12, 2013",
   "Views: 758",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had eaten only half hour before, which will probably affect how the med will work. \r\n4:30 PM. Crushed 12.5 mg Ambien CR taken with soda.\r\n5:00p\r\nI  feel mostly normal. Just a little different, kind of relaxed, bit more carefree. I crush another 12.5mg Ambien CR and take it.\r\n5:30pm\r\nI am  beginning to feel the affects. From the total 25mg\r\nI am not really feeling sleepy, but if I were to lay down, I probably could fall asleep quickly. If that makes sense. My body feels heavy, walking is somewhat awkward...in slow speed. Motor skills affected. Different than when drunk. When I attempt to do something on the computer, it takes me much longer than usual to do so. Sometimes find myself 'spacing out' in thoughts for brief moments. Also, staring at nothing in general and seeing subtle movements/transformations of the objects. Looking into the laptop screen in a darkened room. The windows and the writings seem to move around a bit 3 dimensionally. \r\n7:30: I feel the effects start to wear off some after 3 hours from the initial pill. So I had another one crushed 12.5mg more. \r\n8:30: crushed and took 25mg (total since start 62.50)\r\nLooking at normal objects they seem different. I am in my own apartment and very aware it is my place, but sort of feel some king of displacement from it. As I am typing this, the lines I am writing are slowly curving back and forth like a slithering snake. I keep forgetting where I have placed cigarettes and lighter, even though it has been in the same spot for the past hour. \r\nThe occasional visual hallucinations are neat to see. I am feeling very relaxed and care free. I can't type quite as fast as usual otherwise I'll make too many mistakes. Motor skills def affected. Totally different from alcohol though, as I don't have problem with walking or typing when drunk. When drunk, my balance feels off a bit, but I am able to keep it managed enough that it isn't a problem. With Ambiem, it seems the motor control is slowed. Arms hands legs and feet feel heavier. Movement feels like slow motionnnn. \r\nI decided to walk over to the store around the corner to get some snacks. Walking outside I still felt that sense of self displacement as I slowly stumbled over to the store. Walking long distances like that, I can definitely see the comparisons between being drunk and Ambien's affects. My voice sounds mostly normal and unaffected.\r\n10:30pm: crushed 36.5mg and took it with soda\r\nThis should probably be my last 'test' dose and at some point I will probably go to sleep lol. Within 30 minutes I tired and heavy all over. Sleep is calling my name. I decide to try and stay up and lay down on the couch and watch a movie....I didn't make it too long, as I was alseep by 11:20.\r\n6:45 AM: Wide Awake, well rested and ready for an other day! No hangover or after effects.\n\n\n"
}