{
 "title": "Consider a Lower Dosage",
 "author": "Psyduck",
 "citation": "Citation:   Psyduck. \"Consider a Lower Dosage: experience with 2C-E (ID 72974)\". Erowid.org. Feb 25, 2009. erowid.org/exp/72974",
 "substance": "2C-E",
 "bodyweight": "136 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "22 mg",
   "oral",
   "2C-E",
   "(capsule)",
   "  T+ 2:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 10:00",
   "7.5 mg",
   "oral",
   "Pharms - Eszopiclone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72974",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2009",
   "Views: 3555",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was the first time that I'd tried 2C-E; I've had plenty of experience with other materials including 2C-B, and so thought I knew pretty much where this ought to take me.\r\nT+0:00 Ingest 1 sandwhich, and imeadiatly after, ingest 22mg of 2C-E as a measured and prepared capsule. A short walk.\r\nT+1:00 First alerts. Bright lights are intollerable, and the computer monitor looks like it's flickering at somewhere in the kilohertz region. I'm very restless, and feel a little nausea.\r\nT+2:00 I struggle with the computer to get it to play some light music,  then light a joint that I rolled earlier. Pretty much every toke causes me to fade out for a minute.. every time I came around, I was always impressed that the damn thing didn't need re-lighting. I also can't seem to sit or lie or stand comfortably. Can't tollerate one limb on another. I also felt cold.\r\nT+2:30 I am dangerously high, at what I assume to be pretty much the plateau (I am wrong), when my house mate comes back in. The tales he had to tell me generated strongly intense visualisations, and threw my mental train of though quite off track. I struggled to roll another joint, and managed to do.. probably wasn't a good idea though. OEVs present and rising in intensity, I can see complex fractals everywhere, trails, undulating, etc etc. \r\nT+3:00 Again, smoking MJ causes me to pass out and submit to CEV for periods of time. Physically, this material is very intense. It's like every muscle in my body is tense, I've long given up trying to sit comfortably. Nausea fairly intense. \r\nT+3:30 Switch to smoking cigarettes rather than joints. I could roll them, but I don't think I could handle them. OEVs very intense, it's difficult to see anything more than a very blurry outline of anyting at times. The music my housemate was playing affected all sorts of moods and CEVs.\r\nT+4:00 I have to go and lie down for a bit. OEVs overly intense, music too intense, physically too tense (involuntary shaking and body vibrations), I needed a time-out. I laid down in a dark, quiet room. This was the plateau. It was difficult for me to hang on here, there was a very odd feeling accompanying this also, can't quite describe it. Almost like I was not myself. I heard one voice say 'what's this then', and another say 'this is where the worlds crosses over'. \r\nT+4:30 Still so very overly intense. Go back to lying down.\r\nT+5:00 The past 20 minutes seemed like a good hour or so. I felt that I was now over the top, and rolled a joint. The smoking still had the same effect as before. I managed to get my train of thought going again, free from distractions.\r\nT+6:00 Definitly coming down a little. OEVs still present. Physically still very tense.\r\nT+8:00 Still going. Still smoking, but note I can now smoke without passing out with every toke. Around this time I noticed how cold I was starting to feel, and put on a dressing gown.\r\nT+10:00 Mentally `down' at this point, but still exceptionally tense. Went to bed, but couldn't sleep. I took a sleeping tablet (Zopicolne 7.5mg), and it normally does the trick (I am not a *regular* user of ZC); no effect.\r\nT+12:00 I can feel myself physically un-wind, muscle groups gradually relaxing. Still no sleep.\r\nT+14:00 My alarm goes off for me to go to work.. Phsyically I have pretty much wound down, but the feeling of nausea persists. Still feet a little quirky, and had no energy really. somehow I got though it.\r\nT+24:00 Nausea still persists, even with good eating/drinking\r\nT+36:00 Nausea gone, back to whatever normal is.\r\nOn reflection, this dose was probably a touch too much. Having taken 2C-B at 20, 25 and 30mg, I thought that around a 20mg dose would be about right. The extra 2mg was to ``make sure'' I got an effective dose, and that I certainly did. This was probably the key mistake, although I think that I'd next try it with less than 20mg, probably 15/16 mg range. Mentally speaking, only the peek was difficult, the rest was all managable. Physically speaking, this material is very intense and was not really comfortable at this dose. I far prefer 2C-B in this respect. Also note that it took well over 24 hours for the nausea to subside, and it took a very long time for me to relax afterwards.  It is a useful material for introspective work, but I'd want to have a lower dose to try and lessen the physical load of it.\n\n\n"
}