{
 "title": "A Mild Test Dose",
 "author": "Lurker",
 "citation": "   Lurker. \"A Mild Test Dose: experience with 5-MeO-DPT (ID 72980)\". Erowid.org. Feb 25, 2009. erowid.org/exp/72980",
 "substance": "5-MeO-DPT",
 "bodyweight": "152 lb",
 "header": [
  [
   "DOSE:",
   "6.0 mg",
   "oral",
   "5-MeO-DPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 72980",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 25, 2009",
   "Views: 5116",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've just started my experiments with 5-MeO-DPT and figured I'd submit this considering the lack of reports on this substance. This isn't a very incredible experience, but it's a uncommon compound, so here we go.</p><p>Background:</p><p>I took 6mg of this substance yesterday starting at 10:15pm. I was with two of my friends and my girlfriend at an IMAX showing of 'The Dark Knight', the new (and excellent by the way) Batman movie. I figured it'd be nice to spice up the IMAX movie a bit, and try a test dose of a new compound.</p><p>I'm slightly apprehensive about trying a new substance, but in a great mood. My friends and girlfriend are sober and supportive of the events. I'd taken a small (18mg rectally) dose of AMT six days ago, and hadn't tripped before that for 4 months. I believe I had absolutely no tolerance.</p><p>T+0 - I took the 6mg as soon as the movie started in the IMAX theater.</p><p>T+0:45 - Still not too much. The movie is awesome though and is probably keeping me from noticing the subtle effects of this small of a dose.</p><p>T+1:15 - I think I'm feeling a little bit of something. Excitement in my stomach, a little bit of tenseness in my muscles, but very mild. Rubbing my leg against my girlfriends leg feels good, kind of like 5-MeO-MiPT, but much milder. I wonder if the large meal I ate four hours ago is delaying the onset.</p><p>T+1:40 - Not too much different. I'm probably into the movie more than I normally would, a mild +.</p><p>T+2:32 - Movie ends. Wow, awesome movie. I stand up a notice all my muscles feel kind of stiff. Kind of like they want to pull inwards. My balance feels off and it's hard to focus on things. Colors seem a little brighter. Very slight trails.</p><p>T+3:00 - Walking through the casino that the IMAX was in was bizarre. My eyes don't want to focus on anything, and I feel slightly disconnected. Not a bad experience for sure; different though. The drive home is marked by typical psychedelic giggly outbursts and slight confusion at the sights I'm seeing (Traffic lights are hard to tell apart from street lights). 80's music on the radio is better than usual and hilarious at the same time.</p><p>T+3:15 - I'm at a 24 hour arcade and it's about 1:30am. I'm better at skeeball than normal, haha. It's still hard to focus on things, but when I get in to something I'm more into it than normal. Weird substance. I play Jurassic Park for a while and do waaaay better than normal. I'm into it a little more than normal too, but not as much as I was with LSD, haha.</p><p>T+4:00 - I'm feeling pretty much back to normal and we head home. Feeling good and eat tons of food.</p><p>Conclusion and thoughts:</p><p>Well I definitely need to take more to really understand this compound. I'd guess 6mg is just above threshold. So far the only thing I can compare it to is 5-MeO-MiPT without any of the body energy. Just that slightly trippy feeling you get from 5-MeO-MiPT, with out body rushes.</p><p>No nausea, headache, or after affects. Slight muscle clenches, but not even reaching the bothersome level. I do feel that this substance is probably slightly dissociative and psychedelic at the same time. It's interesting, and I'm looking forward to my next trial in the not so distant future, which will probably be at about the 11 mg level.</p><p>Thanks for reading!</p>"
}
