{
 "title": "Not so Methy Lone",
 "author": "Tiger Faerie",
 "citation": "   Tiger Faerie. \"Not so Methy Lone: experience with Methylone & LSD (ID 73058)\". Erowid.org. Oct 29, 2008. erowid.org/exp/73058",
 "substance": "Methylone & LSD",
 "bodyweight": "53 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "130 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 4:00",
   "0.25 hits",
   "oral",
   "LSD",
   " ",
   "  T+ 8:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73058",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2008",
   "Views: 8331",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a rainy day </p><p>I had a headache</p><p>This</p><p>I have to say makes for an interesting tale of facets, of euphoria, of wellbeing and of love.</p><p>I had commitments last night, I had promised a friend that I would go to his gallery opening I had also however just received a curiousity, the methylone.</p><p>I was never really one for social event such as gallery openings</p><p>For those who dont know, it generally an ordeal for those who dont enjoy small talk, wine and large groups of insecure people gathered in one space.</p><p>However this night I decided I would try the methylone</p><p>I hadnt eaten anything for a number of hours so had pretty much an empty stomach.</p><p>I dont have scales</p><p>So I worked old school</p><p>Dividing the yellowy powder with a card,</p><p>Tipping it into a glass of water</p><p>A little stir</p><p>It tastes slightly bitter</p><p>But not unpleasant</p><p>The time now is about 7.10pm</p><p>I am on the phone to my friend with whom I will join later</p><p>I tell him that I am drinking this stuff</p><p>I finish the phone call </p><p>I feel clearer</p><p>Its now 7.20</p><p>my headache has pretty much gone</p><p>it normally take me a while to get out the house</p><p>but I was on the bus by 7.30</p><p>and the bus journey was nice</p><p>I felt great</p><p>And clear headed</p><p>With no feelings of paranoia</p><p>I didnt worry about the other people on the bus </p><p>I am listening to music, it sounds good, but it is good. A DJ set from Berlin. It just enhances my good mood.  Im tapping my feet a little but I dont feel like I want to burst into dance!</p><p>I get there and there at about 8pm</p><p>I felt as free as a bird</p><p>I flitted around talking to many people, those I knew, those I didnt.</p><p>I felt as though I was full of positive confidence, the kind which is not full of ego. </p><p>Everyone is drinking, I dont want to drink. I dont really like it anyway. </p><p>I have nice conversations, very caring. Conversations flow easily with everybody, even those that I dont like. Again there is no paranoia which I might feel on E or mdma. My mind is clear. I am able for the rest of the night to deal with all kinds of social situations which I may have otherwise found challenging.</p><p>I clocked my friend </p><p>Lets call him MP</p><p>Of course as many faceted as the world is I could not just go up and speak to him.</p><p>Oh no for tonight, in this setting anyway, we were to play a little game.</p><p>For no one was to know that we really knew eachother  yes, its true artists are a bunch of no good scoundrels!</p><p>Exchanging glances every so often, I began to feel that enhanced sex drive similar to mdma but with out the confusion.</p><p>I floated around looking at the artwork</p><p>I didnt feel the forced need to mingle </p><p>It came very naturally </p><p>I was very comfortable in the space.</p><p>Speaking is easy, with only one notable minor drug sounding,slur!</p><p>An hour went by </p><p>9pm ish</p><p>I felt the need to smoke more than usual, as I dont smoke cigarettes much anymore</p><p>But, as with many drugs</p><p>I enjoyed heart felt conversations with friends.</p><p>Eventually after much circulating</p><p>We decided it was time to leave MP and I</p><p>We went out separate ways</p><p>Meeting at the bus stop</p><p>Yes!</p><p>Now it was time to go to the circus!</p><p>Yes, literally.</p><p>We happen to live in a city which once a year, for one month only, experiences its population more than double, and this toy town comes to life with music, cabaret, theatre, dance etc.</p><p>Approaching 10pm</p><p>We kiss </p><p>It feels great</p><p>Well it always feels great </p><p>But the methylone in my brain and the previous situation of sexual tension makes this kiss explosive.</p><p>We go to a bar</p><p>I am totally loved up </p><p>Again not like mdma really, you see I dont like mdma too much as it makes me feel a bit confused and paranoid, its like on mdma my feelings are not true. They are just chemical. </p><p>With Methylone I felt I could let my guard down completely, and let the drug take its course. I see now why its sometimes called Ease.</p><p>I ask MP if he would like to join me down pleasant street</p><p>We order juice and tonic water</p><p>I dose his drink with about the same amount as me</p><p>It is 10.20pm</p><p>I am still flying</p><p>I feel fantastic</p><p>Again within 10 minutes MP has joined me</p><p>And we cant keep our hands of one another</p><p>Small rushes of euphoria come in waves, remaining just at the right level to remain tucked within the inner self.</p><p>We talk about how we feel </p><p>Truly and honestly </p><p>And its beautiful</p><p>There is no false e-talk here</p><p>10.50 we head off to the circus</p><p>it is still raining heavily</p><p>and when we get there the que is long</p><p>we continue kissing under our umbrella</p><p>needless to say we are both very much hedonists!</p><p>The que isnt too bad, I decide to drop a very small about of acid.</p><p>Small as I dont want to override the methylone first time round, small also because we are going to the circus, and really there isnt need to enhance the experience too much!</p><p>The acid came on quickly. Although at this small dose gave me that slight headache and feeling in the top of the mouth sensation. </p><p>The performance was great, twas Le Clique in fact</p><p>I love that sort of thing anyway, I really enjoy this time of year here, as people like MP and I are always this way, and for this month many others come into town, other performers and new friends. I feel really happy in this new environment</p><p>I am even starting to get a little full of myself</p><p>I begin playing up to the circus/cabaret vibe, I am also wearing my soviet generals outfit one of them. This is normal for me though!</p><p>We both enjoy the acts</p><p>MP I can tell is feeling that increased sex drive I mentioned earlier</p><p>We go out at half time </p><p>And enjoy cigarettes and dirty dancing in the rain.</p><p>When we leave the circus it is about 2am</p><p>The rain looked beautiful on the ground</p><p>We wished we could go home</p><p>But in our situation this was no possible </p><p>We had to eventually go our separate ways</p><p>However horny we were!</p><p>A taxi home</p><p>A kiss goodnight</p><p>I am home</p><p>It is nearly 3am</p><p>I go into my room</p><p>I think im tripping</p><p>As to my surprise I see a shape in my bed</p><p>There is someone asleep in there!</p><p>I deal with the situation</p><p>Its one of the lost boys of never EVER land</p><p>I am surprised at my cool ability to deal with the situation</p><p>He is promptly evicted </p><p>I decide to have a joint</p><p>Unexpected OEVs!</p><p>Controlable though, nothing too heavy.</p><p>I shut my eyes</p><p>In a bid to hope that sleep will come</p><p>I hear the sounds of rain outside becoming distorted </p><p>Intense CEVs!</p><p>Woah</p><p>I had no idea! </p><p>These CEVs were where I saw the really synergy between the acid and the methylone</p><p>They had the slight dark side of acid, with similar colours. However the bliss was there which carried me through nicely into dreams of utopia with MP.</p><p>In all this was a very pleasant experience </p><p>Better than I had expected</p><p>There is only one thing I worry about </p><p>And that is, I would be tempted to use this chemical more often for events such as openings and the like.</p><p>I awoke early</p><p>Typically feeling as though I never slept</p><p>I feel great though</p><p>A little tierd</p><p>But full of positive energy </p><p>I hope MP feels this good</p>"
}
