{
 "title": "Enjoyable and Interesting",
 "author": "reboot reality",
 "citation": "   reboot reality. \"Enjoyable and Interesting: experience with Virola theidora (bark) (ID 73099)\". Erowid.org. Mar 6, 2009. erowid.org/exp/73099",
 "substance": "Virola theidora (bark)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Virola spp.",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73099",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 6, 2009",
   "Views: 11522",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've bought an ounce of Virola theidora shredded bark online three years ago. I've snorted some, smoked some and made a tea with very mild effects, then forgot about it.\r\nRecently I remember that I had some that I powdered in order to try an alcohol extraction. I dont know how much was left, mabe 15 grams (?). I made a tea with all that was left. \r\nI drank the resulting three cups over the course of one hour. Soon after having drunk the first one, I felt somehow drunk and happy and couldnt stop laughing. My mind was sped up and I was thinking about global conspiracies, media manipulation and so on. Things relate very easily and all was logical. I felt also stronger and self confident. I smoked pot, and it added to the experience. \r\nI reboiled the powder and it produced a lighter red tea. I drank the three cups and it seemed to boost things a little. After a while, I was still happy and inebriated, just less high and I didnt laugh anymore, but still was feeling fine. \r\nI was hungry, so I ate some cheese. Eating made me higher than ever before for 20 minutes. After that, I remembered that DMT (a main chemical of Epena) is not orally active. As it did produce a rather strong effect, I thought at that time that the bark either was not Epena or contained an MAOI, which could lead to problems with cheese.\r\nMy stomach was a bit upset, but that was all. I searched the web for info regarding the presence of a MAOI in Virola bark.  The documents I found were unclear and I dont know if they were regarding Virola theidora or other species. \r\nExcept the bearable light stomach pain, I didnt feel ill effects. the  peak lasted between one and two hours. After effects were very long lasting. The next day, I woke up hungover and very very happy, balanced and in a positive mood. I was depressed since a week, feeling weak and paranoid but the Epena cured it all. The hangover cleared during the day, but the well-being feeling remained. It took place two days ago, and I'm still feeling fine. \r\nHaving a rather strong high and persistant antidepressant effects was unexpected. \r\nI ordered a large batch of crude bark and concentrated extract to research further with this great ally. I hope to have an entheogenic experience.\n\n\n"
}
