{
 "title": "Went Too Far",
 "author": "Within",
 "citation": "   Within. \"Went Too Far: experience with Leonotis leonurus & Salvia divinorum (ID 7310)\". Erowid.org. Feb 6, 2003. erowid.org/exp/7310",
 "substance": "Leonotis leonurus & Salvia divinorum",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 joints/cigs",
   "smoked",
   "Leonotis leonurus",
   "(dried)",
   " ",
   "2 bowls",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7310",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 6, 2003",
   "Views: 26611",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI recently became curious about legal highs, so I ordered 1oz. of Wild Dagga and 1oz. of Salvia. First I smoked a joint of the Dagga, I got no effects so I rolled another joint, after this one I got a very slight, unsatisfied buzz that lasted about 10mins. I was very disappointed and went into the Salvia with low expectations. I loaded a small bowl and took it all in one hit, the next thing I know I am lying on my bed completely sober, but confused, I realize I have just spent the last two minutes laughing, nothing was funny, it was almost more like stomach convulsions than laughter.<br>I go to the bathroom and check the mirror to make sure I am still who I was five minutes ago. I decide to do it again properly, this time with MUCH more respect. I turn the lights out in my room, turn the music off, and light a candle intending to blow it out after I smoked and trip in total darkness. I load a large bowl, I was going to do two or three consecutively this time, I sit back on my bed in a position that allowed me to lay down quickly if need be. <br>Here goes... I expel all the air from my lungs and take the entire bowl in one hit, then things started to get crazy, I see some sort of wave approaching rapidly from the front of my bedroom enveloping everything it crossed, I was worried but realized there was no escape so I set the bong down and hurriedly knocked over the candle as if horrible things would happen if there was light in the room. As the 'wave' reached the point in my room where I was I felt it hit me, it hit my left shoulder first and this was when I got really worried 'cause my shoulder disappeared into it, I would have done anything to go back in time and not smoke the Salvia. As it reached my head I felt it hit me like a freight-train, it literally knocked me sideways onto my bed, I closed my eyes to hide from it, I knew it was about to show me things I may never recover from, but felt as if it couldn't hurt me if I kept my eyes closed. Closing my eyes was a mistake, this was when I lost all touch with any form of reality, complete ego-death, I am pretty sure it wasn't a blackout. <br>When I came to enough to remember that this was all happening because I had smoked Salvia I became very frightened that I had gone too far this time, it was like Salvia was some evil spirit that had tricked me, I actually believed I no longer had a physical self. The best way to describe it was like I had become a part of some ancient Egyptian wall and would be stuck there forever, it was a terrible feeling. A decade or so passed and I realized there may be a way to escape (basically I remembered my eyes) I opened my eyes and looked around, not as freeing as I had hoped, the place I was in slightly resembled the room I had left but there was alot more of everything, there were no walls and everything had changed into something else that I could not make sense of. <br>At some point I realized my physical self may have returned, only I didn't know where it was. I tried moving my arms, I figured that if I could see my arms move that that was where I was, another bad idea, all that happened was that I saw things moving around below me which terrified me. I then remembered that the trip was only supposed to last a couple minutes. <br>I spent the rest of the trip with my blanket pulled up to my neck for protection, clutching it for dear life with my eyes wide in fear, praying that I would be able to ride it out and get back home. I 'sobered' up and spent the next twenty minutes in dumbfounded awe of the sheer power of Salvia. The trip had exhausted me so I fell asleep for two hours then spent the rest of the day reflecting and trying to figure out what exactly had happened. I can honestly say that this was a life-changing experience, I had a new found respect for life and decided I should stop wasting mine and make the most of it.<br>I will never do Salvia again but am glad for the experience.\n\n\n"
}
