{
 "title": "Music, Sex and Success",
 "author": "I Am Ajak",
 "citation": "   I Am Ajak. \"Music, Sex and Success: experience with Aniracetam, Hydergine & Piracetam (ID 73106)\". Erowid.org. Sep 18, 2008. erowid.org/exp/73106",
 "substance": "Aniracetam, Hydergine & Piracetam",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "Piracetam",
   " ",
   "700 mg",
   "oral",
   "Aniracetam",
   " ",
   "13.5 mg",
   "oral",
   "Hydergine"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73106",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 18, 2008",
   "Views: 26708",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There's no question that the World we live in is designed to create a consumerism type mind set, short processed food attention spans and carbonated confusion.</p><p>Well getting by using only 10% of my brain hadn't been a problem for me up until this last week; a week I've been dreading for the past six months...</p><p>You see, I had a 6 month contract due in 7 days, and in all honestly I was only about a quarter done.   And this was a BIG contract given to me, and I was expected to deliver.</p><p>I would have completed the work sooner (its computer based, online marketing gig) but I couldnt for the life of me keep my attention and focus on the project.</p><p>Quite simply, I knew I needed an edge, I knew I needed help if I was going to pull this off... </p><p>So I meditated on things I could do to boost my brain focus, power, and the likes.  And thus I found a host of Nootropics that were 1) Legal/Non-Regulated 2) Reasonable inexpensive and best of all 3) Getting almost entirely positive feedback.</p><p>Six days till deadline... and still, I would stare at the screen, at the dumb blinking cursor upon a very blank, page.  **Ding Dong** at the door, it was the mail man with MY package.  That day, even if it sounds cliche, I was saved by the bell...</p><p>Not wanting to take anything on an empty stomach I took the cocktail of Nootropics with three eggs and a glass of OJ; than lied down for a nap.  Yes, six days to deadline and I was napping... like I said, I couldnt focus worth a damn!</p><p>When I woke up, about 45 minutes later, I felt like God had opened my head, blew out all the dust, gave my brain a polish and a pep talk.  It was like I knew CLEARLY what had to be done... and my brain even chronologically was figuring out how much time each task was going to take, in which order they had to be done, etc.</p><p>I go up, marched straight to my chair and worked, clear as a bell.  Beethoven was playing in the background, than Mozart and I felt like I was one with these mathematical geniuses of music.  Except my pallet was my Macintosh and I was painting my masterpiece....</p><p>Splashes of color, beautiful designs, subliminal messages, stunning words, compositions, everything was just flowing and clicking like it had never before...</p><p>What can I say?  And all this after the first dose.</p><p>----</p><p>In the five days the proceeded I continued to mix work with exercise and a proper diet.  And Im very proud to say that this story has a happy ending...</p><p>YES, I fulfilled and completed my contracts with time to spare!  I felt SO GOOD that I had risen to the challenge (and did in 6 days what I couldnt do in 6 months!) and I got all teary ended when I thanked God and the higher ups that lead me to find these supplements.  </p><p>After I posted the project and gave it my official seal of approval, I took my girlfriend out for an expensive dinner where I must say, my appearance was abnormally SHARP and my posture and aura was radiant.  A glass of wine, and I layed her down on the bed when we got home to make the most deep and love....   afterward she went to sleep immediately.   </p><p>After she feel asleep I got up, put on my slippers, sat down, and wrote this...</p><p>God bless.  </p><p>***</p><p>TO SUM IT UP:  NOOTROPICS might just be the best keep secret since LSD.  This isnt a boost rather a mind altering change in perception that will transform my life for the better.  Trust me...  this stuff not only feeds my brain, but my soul, my life, my entire being will benefit.</p>"
}
