{
 "title": "A Few Interactions",
 "author": "Qoheleth",
 "citation": "   Qoheleth. \"A Few Interactions: experience with Cannabis & Various (ID 73305)\". Erowid.org. Jan 18, 2010. erowid.org/exp/73305",
 "substance": "Cannabis & Various",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Cannabis",
   " ",
   "  repeated",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73305",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 18, 2010",
   "Views: 43918",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've been using cannabis to self-medicate for depression, anxiety, aspergers syndrome, insomnia and boredom, on and off, for about a year and a half. I am nineteen and have a fair amount of experience with the usual tryptamine psychedelics, a variety of pharmaceutical stimulants, a handful of assorted ethnobotanicals, synthetic opiates and a few nootropic agents. As I use cannabis with more regularity than my other drugs of choice, I've had ample opportunity to explore combinations therewith. I find that cannabis intoxication is often a useful augment to many other states. Here are some of those with which I have a fair amount of experience.<br>Kava Kava and Cannabis: <br>A great combination with great potential for inducing euphoria. Seems to amplify the psychedelic 'edge' of the Kava and significantly reduce the likelihood of anxiety/tweakage. During one experience, colors became brighter and experience gained a vague cinematic quality. Increased ability and desire to visualize was also noted. <br>On another occasion, when the Kava was added to weed and smoked, alongside more Kava orally, depth perception seemed profoundly altered, and the same 'cinematicity' was noted as well. I find that Kava Kava in high doses alone can for me have an indistinctly psychedelic quality; that quality is greatly intensified by the addition of cannabis. Kava could also be useful to those for whom cannabis caused anxiety is a problem.<br>Melatonin and Cannabis:<br>Not only is this a good idea healthwise, but it makes for an exceedingly relaxing pre-sleep stone. Replacing the melatonin depleted by cannabis use makes for a sounder sleep.<br>5-HTP and Cannabis:<br>Chemically, I don't get why this does shit, but it (for me) consistently delivers a more energetic and 'trippy' high (disassociation, time dilation &c.). 5-HTP for me usually seems to improve mood, but not likely much more than placebo.<br>Duloxetine (Cymbalta) and Cannabis:<br>Felt fucked up. Seemed to decrease tolerance and perceptibly 'shift' the effects of the drug. I hesitate to say that it's one of the most unweedlike combinations, but something was very different and not entirely pleasant. There also seemed to be a significant possibility that cannabis decreased its effectiveness as an antidepressant.<br>Mirtazapine and Cannabis:<br>The intoxication here was very intense. Sometimes too much. I got very significant geometrical CEVs from smoking a few cones of White Russian and something more sativa, followed by two passed blunts of midgrade mexican sativa. Unfortunately also potentially very draining  much more so than regular pot use while otherwise unmedicated.<br>Opiates and Cannabis:<br>Opiates are not my favourite class of dope, but their euphoric and anxiolytic effects are greatly enhanced by the addition of cannabis. The 'rush' of the come-up on oxycodone is much intensified. The one I've repeated the most is probably tramadol+codeine+hydrocodone+cannabis. Tramadol potentiates the opiates, increases euphoria. The body 'buzz' from the opiates is made much more pleasurable. With higher doses, this can get to feeling like too much, however. The above with a small dose of dextroamphetamine was a bit overstimulating.<br>Stimulants and Cannabis:<br>One with which I have experimented quite a lot. While there is a great potential for euphoria, one can be left feeling rather muddled and quite possibly fucked up with higher doses. Here the importance of watching one's vitals ought to be obvious. As the stimulant starts to wear off, one's working memory becomes greatly impaired; far more so than with cannabis alone.\n\n\n"
}
