{
 "title": "Why Did I Take This? I Have to Be Home Soon",
 "author": "Bervalsfane",
 "citation": "   Bervalsfane. \"Why Did I Take This? I Have to Be Home Soon: experience with 2C-B (ID 73322)\". Erowid.org. Feb 22, 2010. erowid.org/exp/73322",
 "substance": "2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "insufflated",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73322",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 22, 2010",
   "Views: 3324",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nSo its a thursday afternoon, the sun high in the sky and I'm a little high and feeling mellow. I just got out of school and decide to go over to a friends house, i smoke a little more weed and then, 'come on just try it' says a friend of mine. He continued on, 'I took it last night and had a horrible time, I regreted every second of it.'\r\nHmmm... a new psychedelic I've never tryed before, but my friend hated it, and verification from two other friends leads me to belive this is not the most mellow substance on earth. One thing that I found strange was they snorted the 2-CB powder is this what caused their stressful-trip? Well I don't have to be home til' 9 oclock, and besides when else am I gonna get the chance to snort some powder that makes me trip balls? OK i'll try it!\r\nI enter my friend's bathroom reluctantly, yet i was excited and curious, his mother should be home soon I better snort this quick. I break open the capsule on to a 8th grade yearbook. It couldn't be more than a quarter-gram, I couldn't trip off this tiny amount of stuff could I? I smashed it up a bit and filed out what looked like a sad ending to your coke supply after a long night. The capsule with a white powdery residue all along the inside goes down the hatch first. hmmm... that tasted fucking horrible, I thought to myself. My friends beat on the door and ask if I gonna do it or not, no time like the present.\r\nI take a deep breath and then, with no straw, nose-dive into it an have it gone in a fraction of a second, nothing at first then a feeling like my head may be burning from the inside out. My intire world fills with pain, but only on the side of my head with the nostril which I snorted through. In all modestey I have snorted quite a few things in my day, nothing has ever been as painful as this. Now about three seconds after the powder is in my nose I start too fell odd, its not like the wierd acid feeing, just odd. Then suddenly a barrage of sound and color and smell and fellings all surround me, no drugs done this before, I'm peaking Its been about 30 seconds since I snorted the 2C-B, I leave the bathroom to see my friends.\r\nThey can tell just by looking at me and seem mildly amused, I'm escourted upstairs to my friend's room. I sit for a while and eventually marvel at the stupidity of a secret foe's home-made bong, its shaped like a pyramid, but doesnt hit for shit. My friend whose house I'm at has left for work, and his brother isn't here either, its just me two friends and a foe upstairs, and my friend's mom and 'DT' downstairs, this makes for a strange feeling. A friend puts on the RED KRAYOLA, if youve ever heard this music it would be much easier to explain an immideiate 2C-B trip. \r\nI rock back and forth in a chair absolutley convinced i've cut my tounge in half, (later i find out it was just a hair on my tounge) I hav lost all sence of touch, warm feels cold, cold feels scaley, hairy feel cut, nothing is making sence to me right now. My friend helps a little by playing old TV show theme songs on his I pod for me. At this point I'm not sure if I love or hate this trip. The best way I can describe it is this...\r\nITs like I take four hits of really good acid, I start to peak right away, but it turns out I'm only on the drug every other second, there is no feeling of spirituallity. I'm just a normal guy whose on crazy fucking drugs, whatever, its cool.\r\nMy friend who lives at this house's brother shows up, awesome I can go down stairs! Me and him go downstairs and sit in front room of ther house, I'm feeling really good then suddenly get this feeling of, 'OH SHIT I'M TRIPPING BALLS AND HIS FUCKING MOM JUST WALKED BY!!!' But my friend is quick to reassure me that this is the same mom who we've been on acid in front of countless times, that mellows me out alot. My other friends eventually make their way down stairs after they get a little more high, now theres four of us.\r\nI have had no slight comedown yet the 2C-B is as strong as it had been the whole time. Now what could I possibly do with a brain full of drugs? OF COURSE! theres four of us lets play N64 super smash bros.!!! The game had never been as fun or intense as that day, I was kicking ass with DK even though I was tripping balls, but it did feel like if I lost a life I would loose a little bit of myself. \r\nWhile this is goinf on one of my other friends shows up to show me his new switchblade, that scared the fucking shit out of me. A little late I actually go to the gas station with just my friend's brother and his mom (still triping of course). Eventually I just sort of realize the trip got a whole lot lighter, mabey like 4 hours after I snorted it I think to myself, Its about fucking time.\r\nThat night I realized I would never snort 2C-B ever again, and then realize that earlier that day a friend told me that if I was gonna take it DO NOT snort it, but fuck that, it was an amazing experience even though I'm not sure if I liked it or not. Nothing has ever been that shockingly powerful that fast before, it might have been cool...\n\n\n"
}
