{
 "title": "A Living Nightmare",
 "author": "morefishscales",
 "citation": "   morefishscales. \"A Living Nightmare: experience with Salvia divinorum (ID 73347)\". Erowid.org. Jan 11, 2013. erowid.org/exp/73347",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73347",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 11, 2013",
   "Views: 3113",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all began because I possessed some sort of uncanny urge to alter my mind out of realism. I didnt want to take drugs for mere recreation purpose. I did not feel the need to take drugs because I didnt want to remember who I was and to forget my everyday life (like alcohol). I felt as if as long I knew who I was, where I stood as a human on this earth, and if I was aware of my surroundings while I was on a drug, I could tap into the vast sea of mind altering substances. Within this description, in my opinion, fit marijuana, mushrooms, acid, and what I initially thought salvia. Being heavily experienced with marijuana and mushrooms and knowing myself to have a relatively high tolerance level in my past drug history, I had always felt the need to step it up a notch. I wanted to experience my everyday world differently and having a number of trips under my belt, thought salvia would be a walk in the park. However, never have I ever thought anything so powerful could come from a legal herb and never did I think I would embark in a 15 min psychologically catastrophic ride with salvia.</p><p>While taking salvia the first couple of times on my vacation to LA it seemed I was the only one of four friends who wasnt feeling any profound effect. Everyone around seemed to be describing the same feeling. That of lightweightness, a feeling of hysteria and a sense of time distortion. At this point in time however I was only concerned with getting on the same level as them and experiencing this wondrous majesty. I decided to try again a few days later back at my friends apartment. He was the one always trying new things with me so I felt very comfortable just letting loose and upping the potency quite a bit. So we decided to take two hits, one moderately sized hit, and another larger one in which we were going to hold it in for 30 seconds. After being the first to do so and handing his elephant shaped bowl to him it happened...</p><p>At first it was as if my body sank. It would continue sinking until my mind seemed to be no longer comprehensive with my body. It had felt as if my soul was intercepted by an extremely strong and important force. Important in the sense of it had complete control over me and seemed to have governed my actions at the time. The physical aspect scared me. It was as if my face was being torn apart and that my right body was being torn away from me. It felt as if my right side had a certain deity to it that was telling me this is it and to come with us. At this point I was going crazy as I tried with disbelief to accept that this was actually happening to me. </p><p>In a state of sheer terror and complete disorientation I felt as if there was nothing else in the world left and that I was left alone to combat this evil taking control of me. It had felt as if my friend was part of it too. I kept yelling out to him: Dude stop fucking with me. Why are you doing this to me? Why are you laughing? Why do I feel like this? And since he was doing it also he could only laugh and assume I was just really high. But I wasnt just high. I was in a state of discontent, of suffering and I could not describe it. I could describe the feeling with a metaphor. It felt as if someone was performing surgery on me and had sedated me so I would have no feeling and I woke up in the middle of it feeling everything. It was like I was unable to grasp reality and that there was no way around this torment. </p><p>I had a feeling that I needed to do something, needed to get away from this place, somewhere to run, I just needed to escape for Gods sake!! My whole right side went numb and it felt as if the strong force was tricking me into a hellish game of torture where I had to fend for myself in getting out of this state of misery. It was as if all hope was lost and that no one could help me release this extremely uncanny feeling. It was as if my body was one step ahead of my mind and that my mind was put into a blender = mixed with hell. It was a feeling like no other. It was extremely disturbing and I had felt extremely depressed during the entirety of it. It was like the whole world was laughing at me and I was in the center helpless trying to escape this mental lunacy.</p><p>It made my heart race and I was feeling really hot, as my face turned blistering red. At that point I had trouble breathing. Diagnosed with asthma it brought me back to when I had severe asthma attacks, having almost no breath and dependent on a machine for rehabilitation. This made me extremely afraid and I started praying. I started asking God for forgiveness, asked that this sense of insanity would subside and I could just live reality normally. I was hysterical, pleading to my friend that I could not breath, that if this feeling was to go on like this I would kill myself.</p><p>It was like I was looking through someone elses eyes into my soul and all my fears had joined into one conglomerate that expressed itself through a physical and mental sensation. It was something out of this world. After feeling as if I was experiencing this for hours I asked my friend how long its been and shockingly he said about 5 min. When I had started talking to him, and I focused on my breathing, and sat with my eyes closed I had started to see that the feeling was quickly subsiding. I suddenly had faith in the world again! I felt like I had a second chance. I felt physically and emotionally drained. That I had ran a marathon and was extremely exhausted. I was also unable to think straight for 30 min. It made me feel very awkward being around my best friend. I had apologized that he had to put up with me for that horrid experience. He assured me he was here for me and I am glad he was there to comfort me. </p><p>It was an experience like no other. I was in a living nightmare, trying my hardest to escape it but reaping the consequences and emitting a toll on my body. He explained to me I was saying I was in pain and that I needed help. It all felt like a blur to me at that point, but I sat there and tried to remember the whole thing. It was life changing and it taught me to see reality as the bodys equilibrium and it is there not be tampered with, not with drugs or nothing. It is in those extreme cases where a good memorandum is received from the bad and we develop into a more understanding person. In this case about the effects of Salvia and drugs.  </p><p>Salvia delivered a strong message even though it is regarded legal and not necessarily a drug. I believe Salvia may shatter what you believe drugs are about. If you are to take salvia please please please do not over do it like I did. You will live your life wishing you never did. It is not for the faint of heart, and hearing it from someone who has experience in taking drugs do not tamper with it!</p>"
}
