{
 "title": "Food Issues/Eating Disorders",
 "author": "Anna",
 "citation": " Anna. \"Food Issues/Eating Disorders: experience with Amphetamines (ID 73393)\". Erowid.org. Aug 2, 2009. erowid.org/exp/73393",
 "substance": "Amphetamines",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "insufflated",
   "Amphetamines"
  ]
 ],
 "footer": [
  [
   "2008",
   "73393",
   "Female",
   "",
   "Not Given",
   "Aug 2, 2009",
   "16625",
   " "
  ]
 ],
 "report": "<p>The combination of using amphetamines and having issues with food and/or body image and/or suffering from an eating disorder could be potentially disastrous  it hasnt been for me (yet!) but I can easily see what a huge temptation it is to use amphetamines (or generally, stimulants that have an anorectic effect) for weight-control purposes, especially as I have the tendency to have my food binges every now and then, each one of them leaving me with a very bitter feeling of guilt and self-consciousness. </p><p>Most days Im preoccupied with food, and most days I cant control too well what Im eating, or at least definitely not as well as I wish I could; even when Im not hungry I often find myself reaching for food just for the sake of it (Ive been relatively thin by now because I manage to compensate that by various means). </p><p>Most days, except for when I insufflate that bump of white powder in the morning  it not only shuts off hunger completely but it also elevates my temperature, and that, of course, means that my body spends more energy than normal in sustaining itself (Ive used clenbuterol /a medication used for the treatment of asthma and often abused by body-builders/ for weight-control purposes, it also elevates bodily temperature) and makes me eager for physical activity: a combination that is well-desired and welcomed. The loss of appetite that is specific for amphetamines has always amazed me  not only I dont think about food and it seems to be completely unappealing but its almost impossible to eat  it tastes like plastic, its difficult to swallow, and I just dont see the point in the whole process. Many other interesting activities are awaiting for me! Thats probably nothing too exclusive for most people but it is indeed a very charming (side) effect for those who have food issues and are struggling with them on a daily basis  thats the most effective anorectic that Ive found so far, of these that I have used.</p><p>The weight loss that once had resulted from only 2 consecutive days of doing speed astonished me; coming down and the after-effects prevented me from continuing the scheme. The first day I did a fair amount of speed (I cannot give any more precise information since Im using illegally produced amphetamines that come to me in the form of powder and arent really pure, or anywhere close to purity, and vary greatly in quality) at 8.30 am, which resulted into a very strong feeling of euphoria that lasted for about 30 minutes and a general positive mood for the next few hours; I was productive, I was content with what Im doing, I wasnt thinking about food. The only effect that I disliked was that I was feeling very detached from my emotions  I could analyze anything, I would dwell into (almost absurd) abstractions and rationalizations which I would manically write down, but emotions seemed to be irrelevant and unnecessary, and that did bother me quite a lot (thats also something I generally have issues with, as I tend to have some difficulties relating to others and maintaining healthy social relations). I was alone all the time, and was going to be alone for the next days.</p><p>At around 17h (so, T + 08:30) I began coming down  a feeling of sadness and hopelessness almost completely took me over for about half an hour, then it suddenly evolved into a relaxed, contemplative mood, and I would swing back and forth several times and each time Id assume it was the last change to happen. Around 19h I ended up being very low and paranoid, also feeling very fragile, something Ive never experienced from amphetamines before  all my previous comedowns were characterized mostly by mental & physical tiredness, some apathy and a feeling of not wanting to let go the state that I had been in prior to that. This time it was extreme  I was feeling very lonely and isolated from people, yet I felt I really needed to express to someone what was inside of me, and generally to talk, but yet I felt unable to reach out for anyone. Walking through the city was very unpleasant (I had to go out for a while), I was feeling observed and judged by people, I was feeling transparent and frail, I was feeling chased by myself, too (thats how I call a very specific mood/state when I find myself in a position of an external observer  I analyze and criticize myself and my actions but I dont feel authentic  it mostly happens in a sober state). Getting home and preparing some food brought me back to reality; I had some troubles falling asleep but it wasnt too difficult to deal with.</p><p>On the next day everything seemed to be back to normal, so I opted for doing speed once again, ignoring my unpleasant state from the previous evening. The reason was, partly, that I was afraid of overeating, given that I ate almost nothing on the day before; I settled for having some breakfast and insufflating a small amount of the substance at late morning. At first it felt alright, it felt pretty good even, all the effects that I expected were noticeable but not overwhelming  exactly what I wanted. Then I began feeling more and more low, and more and more anxious. I kept myself occupied (also because I needed to distract myself from thinking) with frantically cleaning the house but it was difficult to ignore myself and my feelings. Coming down was almost too devastating  I literally felt like I was falling into insanity; the flat that I live in now appeared to be huge and a very, very lonely place to be, I felt like I was resonating in that empty, overrun space, I was trapped in myself with no way out, I felt even more detached from people, capsulated and unbearably alone, and I felt like I would never come back to my normal state  I knew that this wasnt the case, however rationally knowing it didnt make any difference for the moment and didnt provide any relief.</p><p>Back to the topic of food, I remember looking at myself in the mirror and noticing that I had lost a lot more weight than I would expect I could lose in 2 days, however it didnt make me feel satisfied or content with myself, it just made me feel miserable (which seems to be very typical for most people that have food issues). I stared at the mirror for a while  my body looked so bony and brittle, my breasts were significantly smaller (I anyway have them small), my ribs would stick out  and I bitterly asked myself, so is that what you want? is it?; Im glad I found that image of myself ugly, Im well-aware what would follow as a consequence had I liked it, because I knew I anyway wouldnt be able to keep that weight off, except for with more speed. (Needless to say that my appetite came double as strong as usual on the next few days...) And Im aware Im currently not stable at all, emotionally and mentally, so I wouldnt be able to deal with the mess that this circle would create  in my mind and in my life. </p><p>I managed to contact my loving and understanding partner, and that hugely helped me in regaining sense of reality and in not feeling as isolated; had I not contacted anyone, it would have been much more difficult to get out of that state  it felt like something inside me was broken and I wasnt sure whether Id be able to repair it. The quick fix of all my weight issues had just proved to be impossible to control, and Im rather glad it did. </p><p>Im not sure who/what Im writing this for, or if it would help anyone by any means, or if I want it to help; I just wanted to reach out for people in a similar situation as mine. (Saying youre not alone is, of course, pretty pathetic. In fact anything that Id write here as a conclusion would be pathetic; there aren't any conclusions.)</p>"
}
