{
 "title": "Smashed Through a Crack in Everything",
 "author": "Shebaaltsia",
 "citation": "   Shebaaltsia. \"Smashed Through a Crack in Everything: experience with Salvia divinorum (ID 7340)\". Erowid.org. Jun 3, 2003. erowid.org/exp/7340",
 "substance": "Salvia divinorum",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7340",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 3, 2003",
   "Views: 29213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On my third experience with salvia, I decided to try a couple things different.  On my other experiences with it, I received a strong sense of the drug actually chastizing me for taking it under less than ideal circumstances.  I'd felt like there was something else it was trying to show me, a level I couldn't quite reach without the proper preparation, which frustrated me to no end.</p><p>So, on this occasion I prepared myself by doing a mild dose of marijuana and then going into some reichian full body relaxation excercises, followed by a couple small rituals and meditation.  After about an hour and a half of this, I felt extremely supercharged and relaxed.  Since I found from my earlier times that having a packed bowl and hitting it over and over was not doing the job effectively,I started out by measuring out 3 small piles (about 1 easy hit each).  One of these I put into the bowl (totally clean and with a new screen this time, a bowl that is clogged at all hurts the experience tremendously: In fact, I now have a pipe I use exclusively for salvia).  The other two I put onto folded business cards so that I could load them in easily (it's really easy to spill half of it on the floor if you don't get the hits ready ahead of time).  Took the first hit and managed to take down the second before the rush hit me.</p><p>Immediately, WHAM, it felt like I had smashed through a crack in everything.  This is incredibly difficult to explain.  It was like I broke through into this world that was our world, but more, just slightly out of vibration with what humans normally perceive.  In this world our world was created every instant by 'beings'.  I couldn't explain what they were or exactly what they looked like, but I got the distinct knowledge that we are never alone, or moreso that we never have to feel alone.  Also, I'm sure I could feel the drug itself as something almost sentient near me and in me. I felt presences around me manipulating everything, to make sure everything kept running.  The universe was a hologram, with every part connected and showing every other part.  I was literally bristling with energy, and this tiny thing was pulling me apart and twisting me in strange directions with strings of something that was connected to me.  This was quite a bit more pleasant than it sounds.  I wanted to help the creature, I felt that there was an order to things which the creature was a part of preserving, a chaotic order, and my mind was trying desperately to comprehend something that it by nature could not totally grasp.  I felt there was a mission that I was on, something terribly important.</p><p>I have no idea how much time passed here, the effects just droped off slowly and the perceptions I'd felt seemed to recede into the distance, hiding behind everything again.  One very pleasant effect that was noted was that for a good while afterwards, I could manipulate my own energy to a far greater extent than was possible before.  Auras were much more visible when you really looked, and I had learned (and afterwards mostly forgot, but not entirely) how to focus the energy into, for lack of a better term, the chakras.  I could bring extremely strong sensations to my third eye or any other place of my body and felt like I was opening these parts up.  So, after the initial blast, I used the opportunity to work on these, with tremendous results.</p><p>The very different thing about this psychoactive when compared to most, is that I left it feeling that what I had felt was truly the way things were.  You really do need a good deal of perception and self-awareness to get the full experience from the plant.  One thing in common with all my times trying this is that I felt that something was trying to communicate to me, if I would only learn how to let it.  It left me with lasting insights that improve my life.  All in all, the most 'benevolent' drug I have ever tried.  Addiction potential if used with respect seems to be nil.  I have absolutely no desire to take it very often, even though I enjoy every single time.  I've also gotten extremely picky when it comes to telling other people about it.  I think they really have to be ready for it, and the thought of people misusing it truly makes me sad for some reason.  In closing, you don't have to treat this little baby with respect, but, trust me, you'll be glad you did!</p>"
}
