{
 "title": "Did I OD?",
 "author": "just matt",
 "citation": "Citation:   just matt. \"Did I OD?: experience with Tobacco (Cigar) (ID 73442)\". Erowid.org. Sep 18, 2008. erowid.org/exp/73442",
 "substance": "Tobacco (Cigar)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73442",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 18, 2008",
   "Views: 21792",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a 210 lb 63 male in fairly good shape and good health. I do not take any form of prescription medication, nor do I smoke weed or have even taken any sort of psychoactive substance within the last month. \r\nWhile I do not routinely take any form of drug I have dabbled in enough, but in everything I have done cigars have always held a special place in my heart until unfortunately now. So here is the set up; I am going to college in less than a week and this was my last day off before I would have to start packing and stuff so I figured I would relax the best way I knew how, with a good cigar! (Bad choice). So I go and visit my favorite cigar shop down the road and after a friendly conversation with the really cool owner of said store I selected a beauty. This sucker was huge, I'd say about an inch thick and at least seven inches long (no dick jokes) torpedo style. \r\nSo I go outside and light it up. Burns great, tastes great, everything is great. And then suddenly everything is not so great. I dont feel like the classic happy feeling I usually do, there is no head rush, instead I feel both incredibly light and incredibly heavy. I have to lean my back against the wall of my house to keep from falling over, everything starts to spin and I think I am going to pass out. But then that passes so I think hey I paid for this so I'll finish it yet another big mistake. I get two thirds of the way through and decide I cant finish hell I can hardly keep conscious.  So I go back inside and lay down but the room is spinning and I am sweating profusely and I dont exactly feel sick but I dont feel right everything is just horribly wrong. After a little while I realize I am going to throw up so I run to the bathroom and dry heave into the toilet. Now I have a really strong constitution, its almost impossible to make me throw up but this time boy did I throw up. Five huge purges later and I am lying on my bathroom floor covered in sweat and drooling like crazy and I feel like little bugs are crawling all over me.  Eventually I manage to get up and clean myself off and take a shower but I dont feel right for at least another hour. \r\nSo all in all it was pretty friken horrible, maybe someday I will try them again but no time soon.\n\n\n"
}