{
 "title": "Slow Hitting Long Lasting Resin",
 "author": "dj.substance[9x]",
 "citation": "   dj.substance[9x]. \"Slow Hitting Long Lasting Resin: experience with Kratom  ('full spectrum' extract) (ID 73540)\". Erowid.org. Mar 5, 2009. erowid.org/exp/73540",
 "substance": "Kratom  ('full spectrum' extract)",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Kratom",
   "(dried)",
   " ",
   "  ",
   "oral",
   "Kratom",
   "(extract)",
   " ",
   "  ",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73540",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2009",
   "Views: 7628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>just got my order of FS [Full Spectrum] Kratom resin extract. (29g)</p><p>also got UET 4g (ultra enhanced thai)</p><p>also had some enhanced Bali and enh. Malaysian</p><p>Heres what I took ...</p><p>3-4grams of moist straight kratom fs resin</p><p>1/2 g UET</p><p>2g enh bali</p><p>1/2g malaysian</p><p>kratom Tolerance level info: I have been doing kratom almost daily for about 6-8 months. most of the time letting tolerance go down but maintaining the full spec tincture about 25 drops a day.  </p><p>previous Synthetic Opiate tolerance:</p><p>using op's for about 10 yrs. tolerance developed a few yrs ago after starting to do op's regularly</p><p>experience:</p><p>I'm at the point where FS Tinc barely touches me anymore. I can take an awful lot (and lot of $) worth and I just feel sorta okay at this point. it used to be the greatest thing in the world but back to the story...</p><p>I ate the mentioned materials in teas and chunks at 11 am EST.  at around 12.30 I was getting disappointed that I wasted my $ and was bummed out. however about 1pm I drank a piping hot cup of enh. bali and malay. and that started kicking it in. its been 3.5 hours now and I originally ate about a MARBLE size amt of resin at 11am. it has been building now for a couple hrs and it doesnt appear to be going away. its starting it to hit hard. this would indicate that someone without a tolerance should not even ATTEMPT a dose as high as I took.  I think about 1/2 a marble size of kratom resin is a start size and a cup of hot bali tea will help start things off quicker.  </p><p>notes and feeling:</p><p>I feel more social, almost nodding out tho, was just talking to my new neighbor for over an hour and it was very entertaining. slowed heart beat almost slurred speed. however this is very plesant mind state wise.  I recommend it! if you can make it yourself with oz's of Bali go that route! its hella expensive</p>"
}
