{
 "title": "Not Worth the Time",
 "author": "E1983",
 "citation": "   E1983. \"Not Worth the Time: experience with Metaxalone (Skelaxin) (ID 73566)\". Erowid.org. Jul 9, 2009. erowid.org/exp/73566",
 "substance": "Metaxalone (Skelaxin)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "400 mg",
   "oral",
   "Pharms - Metaxalone",
   "(pill / tablet)",
   "  T+ 1:00",
   "400 mg",
   "oral",
   "Pharms - Metaxalone",
   "(pill / tablet)",
   "  T+ 2:00",
   "800 mg",
   "oral",
   "Pharms - Metaxalone",
   "(pill / tablet)",
   "  T+ 4:30",
   "2400 mg",
   "oral",
   "Pharms - Metaxalone",
   "(ground / crushed)",
   "  T+ 12:00",
   "2 tablets",
   "oral",
   "Diphenhydramine",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "73566",
   "Male",
   " ",
   "Not Given",
   "Jul 9, 2009",
   "13368",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I came across a bottle from a friend, I didn't find too much info on experience so I started out small.  On 8/19/08 at 2pm I took 1/2 pill, I took the other half one hour later at 3pm.</p><p>3pm I felt slightly light headed and a little excited, mostly from the new experience. </p><p>4 pm I took my second pill</p><p>5pm I felt just slightly disoriented, like I had to think about what I was doing, but it was easy to make myself concentrate. </p><p>8:30pm I chewed up 3 pills, then ate a bowl of ramen noodles and took a shower to kill some time. </p><p>10:00pm, slightly aggravated that I wasn't really feeling anything, I was more talkative though while watching TV with a friend. </p><p>11:00pm- Still no changes, everything was the same when I walked. My nose itched and I was getting tired. </p><p>12:00pm- It had been three hours and nothing worthwhile had happened, I figured that night was a bust and I went to bed. </p><p>2:00am- I woke myself up scratching my shoulder. I had Never broken out in Hives before but I think that's what it was. They looked and felt like mosquito bites, on my arms, legs, shoulders, and stomach. My stomach was a little upset. I got up and chewed 2 Benadryl for the allergic reaction. Then made myself calm down</p><p>2:30am- Just when I was about to fall asleep I began to feel queasy. I fought it back for 15 minutes, then finally gave in a threw up only about 1/2 cup of fluid. I felt better a few minutes after. </p><p>3:00am- I went to bed, with nothing worth writing home about. </p><p>8/22/08- One last try</p><p>I decided to start early. </p><p>I started at 12:00pm and took one pill every two hours. </p><p>12:00pm, 2pm, 4pm, 6pm, 7pm, 8pm</p><p>I also took 1 Benadry just in case. But again no hallucinations. No weird feelings, I've had better stronger experiences taking OTC Sleeping pills.</p>"
}
