{
 "title": "A Waste of Time",
 "author": "William",
 "citation": "   William. \"A Waste of Time: experience with MDMA & Citalopram (ID 73604)\". Erowid.org. Dec 25, 2012. erowid.org/exp/73604",
 "substance": "MDMA & Citalopram",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(daily)",
   "  T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 1:00",
   "1 tablet",
   "insufflated",
   "MDMA",
   "(ground / crushed)",
   "  T+ 2:15",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:15",
   "0.5 tablets",
   "insufflated",
   "MDMA",
   "(ground / crushed)",
   "  T+ 4:15",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 6:15",
   "1 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   "  T+ 7:00",
   "40 mg",
   "oral",
   "Pharms - Citalopram",
   "(pill / tablet)",
   "  T+ 7:00",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 7:00",
   "50 mg",
   "oral",
   "Pharms - Trazodone",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73604",
   "Male",
   " ",
   "Age at time of experience: 33",
   "Added: Dec 25, 2012",
   "Views: 4274",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting: My home at night. Wife asleep in bed. I was watching TV and experimenting.</p><p>A little background: I have experimented with several drugs since my early teens. These include LSD, Cannabis, Cocaine, Methamphetamine, MDMA, Adderall, and of course Alcohol. I have never been addicted to any substances. However, I know that I have an addictive personality and when I do use drugs I usually push things to the limit (or at least I think so).</p><p>Also, I have been seeing a therapist for the past 9 months. During that time I have taken 40 mg of Citalopram every day and 1 mg of Clonazepam as needed for anxiety. Also about 3 times a week I take 10 mg of Ambien and very rarely I supplement with 50 mg of Trazadone for sleep.</p><p>Well I recently came into possession of 25 tablets of MDMA. I spent a lot of time reading the few studies pertaining to Citalopram and MDMA. In a nut shell the studies indicate that Citalopram significantly mitigates the effects of MDMA.  This is both good and bad. The good part is that researchers believe Citalopram has a protective effect against neuronal damage by MDMA. The bad part is that in experiments Citalopram significantly reduced the overall good or pleasurable effects of MDMA. These studies were all short-term and did not use subjects that were regularly prescribed Citalopram.</p><p>In the studies Citalopram reduced the pleasurable effects of MDMA by about 60%. Since I knew this I decided that I would need to take about a double dose to get the normal effect. So I decided to take 4 tablets (which I ultimately took even more).  In order to maintain some level of safety, I did not take all these tablets at the same time.</p><p>At about 9 p.m. I took my first tablet on a completely empty stomach. I had not eaten since 1 p.m. By 10 p.m. I was experience very mild effects.</p><p>I decided to crush and sniff one tablet and chew another. The taste is pretty bad but not intolerable. Sniffing on the other hand is about as harsh as I have experienced.  I am sure there are other substances out there that are worse, but relative to my other experiences with Cocaine, Adderall and even Meth, this was by far the worst. My nose burned and I began to sneeze. I would hold my nose so I did not accidentally blow out large quantities of the substance I just snorted. After about 2 minutes I felt the effects of snorted MDMA. However, since my eyes were watering and my nose was on fire, I did not really enjoy these initial effects.</p><p>After a few minutes the pain subsided and I decided to start watching TV. By about 11 p.m. I was feeling pretty good, but nowhere near the effects MDMA had on me before. About 10 years ago I took 3 or 4 tablets in one night and I had what felt like an orgasm for hours and hours, probably 3 to 5 hours. However, now I was not getting this extreme body high. I felt mildly euphoric and I began to notice that there was a little bit of trippyness to this experience. I could see shadows shifting and objects breathing, but nothing nearly as strong as LSD. I felt like I was in complete control. If I really tried to focus on something or if I was moving around my vision seemed to temporarily return to normal. However, if I was just sitting there trying to enjoy the experience there was a little bit of a show, but not nearly as interesting as LSD. In fact, I remember thinking to myself that if I wanted to trip then I would have taken LSD which costs a fraction of MDMA.</p><p>Sometime around 11 to 11:30, I decided that the amount I had taken was not enough. So I sniffed half a tablet and chewed another tablet. This definitely did something extra. However, the euphoria was still mild. The trippyness of this experience increased and I would say that the visuals were equivalent to a weak LSD trip, but without any significant mental confusion. Needless to say this was a good feeling but quite disappointing.</p><p>Finally at 1:15 a.m. I took one more tablet. This had very little effect and at best prolonged the experience, but I dont think it made me feel anymore euphoric.</p><p>At about 3:15 I was at about the same point that I had been for the last 4 or 5 hours. I felt like I was on the edge of a really good experience but it just kept eluding me. This created frustration and I was already anxious because my wife was in the other room sleeping and she does not approve of my experimenting. At this point I decided to take a Clonazepam because it is very good for both reducing anxiety and reducing the side effects of many drugs. </p><p>About 4:00 a.m. I decided that I was tired of this experience and wanted to come down. I also wanted to protect my brain from the possible negative side effects on my neurons. So I decided to take 40 mg of Citalopram and an Ambien and Trazadone for sleep. Within about 30 minutes I was almost back to baseline. My thoughts were normal. I had no anxiety. My vision was clear. I went from mild to moderate hallucinations to NONE in about 30 minutes. When I say that I was baseline, I really mean it. My pupils were no longer dialated and I felt as if I could interact with anyone with behaving or feeling high or like I was on the down swing. I just felt normal.</p><p>I realize that there are a number of drugs involved here and this is by no means a scientific evaluation. However, from my perspective I believe that Citalopram mitigates the effects of MDMA even more than the research indicated. I think it is nearly impossible to get an extreme euphoric feeling if you have been taking Citalopram for any length of time or if you have recently taken it. I believe this is very specific to MDMA because about 2 weeks ago I took significant amounts of Adderall and it seemed to effect me just as strongly as it does for others. In fact my Adderall experience was dramatically better than my MDMA experience.  Furthermore, I had virtually no comedown effects from the Adderall either. In this case I think it was largely due to the Clonazepam and Ambien, but I digress.</p><p>I was shocked at how quickly I came down. Another interesting thing to note is that when I came down, I only went to base line. There were absolutely no side effects that are normally associated with high doses of MDMA. I did not have the blues the next day. I pretty much felt normal. Additionally, I was able to sleep and I did sleep soundly. I am sure a big part of this was the Ambien and Trazadone, but in the past I have not been able to sleep for at least 24 hours and that is not fun at all.</p><p>So what did I learn from this?  First, let Citalopram clear your system before using MDMA. It is a complete waste of time and expense to use MDMA while on Citalopram. Citalopram has a long half life of 37 hours. So I would think that a person would need to be off the drug for about a week to have a good chance of a great MDMA experience.  Second, I think the combination of drugs that I took in order to come down are very helpful in reducing the risk of long-term damage to neurons and dramatically reducing the hangover effects. Third, if someone were to continue taking Citalopram and still want to experiment with drugs, MDMA should be marked off their list.</p><p>On a more technical side (note I am not a doctor or scientist, just an interested mind), I think the researchers are right on track in regards to Citalopram (a 5-HT uptake inhibitor) blocking the effects of MDMA on the Serotonin release. At first it seemed counter intuitive because both drugs seem like they should work together. They are both trying to make more Serotonin available. However, it seems that the counter intuitive results are a result of the Citalopram blocking the MDMA from getting through the blood-brain barrier. Its like Citalopram is the bully in the sandbox and wont let anyone else in to play. This opinion of mine is further supported by the lack of euphoric feelings that I expected to feel from extra dopamine. Since Citalopram does not bind to any of the Dopamine pathways, the only explanation I can come up with is that the MDMA never got there or at least in much smaller quantities.</p>"
}
