{
 "title": "Intense Relaxation",
 "author": "emmyblu",
 "citation": "   emmyblu. \"Intense Relaxation: experience with Opium & Cannabis (ID 7368)\". Erowid.org. Mar 9, 2003. erowid.org/exp/7368",
 "substance": "Opium & Cannabis",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Opium",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7368",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2003",
   "Views: 46515",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Me and my friends V and A decided to take a weekend trip to the beach over spring break.  We planned to buy some crucial KB from A's sister who deals, but she was fresh outta weed, even the regs.  For some odd reason, she had a lot of opium.  None of us knew how much to get, but we ended up paying $20 for a gram.  On the drive to the beach we stopped in DC and bought $20 worth of good marijuana.</p><p>Over the next two days, me, V, and A smoked all of the weed and all of the opium.  Each day we smoked plain old bowls, joints, and blunts and got nice marijuana highs, but then we smoked two bowls of weed and opium each night in our hotel room.  We first packed our glass bowl with weed.  Then we placed a small dab of the black sticky stuff on the tip of my swiss army knife and placed the knife over a lighter.  After the heat had softened the heavenly smelling opium, we smeared it over the weed in the bowl.  </p><p>We passed around the bowl and the journey began.  It was like smoking perfume--both the black sticky stuff and the smoke from the opium were the most amazing, most beautiful smelling substances I have ever encountered.  'Like magic' I said and V laughed at me.  </p><p>The onset from the opium was relatively quick--about five minutes.  There was an incredible sense of relaxation--so intense that I almost completely lost the will to move my body.  If I was lying down when the opium kicked in, I didn't want to get up.  If I was standing up when the opium kicked in, I didn't want to sit down.  But my head would droop and A would tell me to sit my ass down before I fell over.  It wasn't impossible for me to move, but it just took more effort than I felt I had.  Usually I finally ended up lying down on the bed as the weight of my body became too much to handle.  (The intense relaxation of the opium also made my body feel weighed down and extemely heavy.)  I did not want to talk.  At all.  My head was swimming with random thoughts and I could not comprehend what was happening on the TV--it was extremely confusing to me in my druged state.  My eyelids drooped with exhaustion.  I was tired and my body was tired.  But it was a pleasant feeling--I was exhausted because I was relaxed, not because I was overworked.  Just extremely, intensely relaxed.</p><p>After smoking the two bowls of opium and weed, I was in this extremely drugged state for about an hour, but the effects could be felt for many more hours--at least until I fell asleep.  After about an hour of being so overly relaxed, I slowly regained the will to move and to talk, but I still felt extremely smacked.  Maybe it was the weed that left me feeling so high for so long, but it was definitely the opium that affected my body in the way that I described before.  Marijuana has never affected me to that degree--I don't think it can.</p><p>All in all, it was a very pleasant experience.  I would definitely recommend opium to those who are curious, but be careful.  It can be very addictive, and luckily I didn't have anymore after that weekend because I craved it for days afterwards.</p>"
}
