{
 "title": "Music Festival Psychedelia",
 "author": "PsychedeliaSmith",
 "citation": "   PsychedeliaSmith. \"Music Festival Psychedelia: experience with Bromo-Dragonfly (ID 73699)\". Erowid.org. Sep 22, 2008. erowid.org/exp/73699",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "600 ug",
   "oral",
   "Bromo-Dragonfly",
   "(blotter / tab)",
   " ",
   "1 repeated",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73699",
   "Male",
   " ",
   "Not Given",
   "Sep 22, 2008",
   "Views: 11769",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is for my second, more intense experience. It took place at a music festival this summer with my girlfriend, what better place to trip?</p><p>We arrived at the campsite and set up our tent, rolled a joint and ate two tabs each. We knew we were in for a long wait followed by a long and (hopefully) intense trip so we thought it was best to eat the tabs as early as we could.</p><p>The first effects began to show themselves around an hour and a half after we ate the tabs, but this was nothing more than a feeling of my mind being slightly distanced from my body, a slight energy boost and a feeling of restlessness that I always get on the come up from psychedelics.</p><p>At around two hours after ingestion the first faint signs of visuals began to show themselves, this was much faster than my one tab experience. Colours seemed slightly brighter and things would look like they were vibrating slightly. During my one tab trip it took three to four hours to reach this stage, so I think the effects manifest themselves more quickly at higher doses.</p><p>By around three hours colours had brightened fully, everything left trails behind it and everything seemed to be moving asif there was a strobe light on. There was also a lot of auditory hallucination at this point, the sounds coming from outside the tent (people laughing, cheering, general festival noise etc.) sounded like the sounds you would expect to hear in a medievil town.</p><p>Now we felt we had adujsted to the Dragonfly so it was time for a walk around the campsite. When I got out of the tent I noticed that the lights were overwhelmingly bright, people were just silhouettes against them. As we carried on walking the lights began to grow, exploding with colour. The lights became laser beams that reached up into the sky and down to the ground. Everything was beautiful.</p><p>When we got back to the tent it had been around five hours since we ate the tabs, this is when I reached peak tripping and for the first time I closed my eyes. It was like entering another world, crystal clear CEV of beautiful fractal patterns pulsing and moving, strange creatures and unimaginable colours. Much more vivid than I have ever got from any other psychedelic. When I opened my eyes the fractals were still there, like another layer over my vision as well as objects morphing and warping.</p><p>My girlfriend told me later that the CEV she got were vivid images of beautiful landscapes.</p><p>There were about eight hours of peak tripping, but colours and lights seemed much brighter than usual and there would be slight OEV for about twenty-four hours after we ate our tabs.</p><p>Another thing that I should mention is that we were smoking joints throughout the entire experience, which may have boosted the effects of the Bromo slightly. But I have quite a high weed tolerance so it won't have made too much difference.</p><p>One of my favourite things about this substance is that I remain relatively clear headed throughout. Other psychedelics have left me wondering who/what I am and what the fuck is going on but Bromo-Dragonfly allowed me to have meaningful conversations even whilst engulfed in CEVs. A lot of people say that this creates a feeling of 'something's missing' but I think it makes this substance even better.</p>"
}
