{
 "title": "Salty Stick",
 "author": "Ralph B",
 "citation": "   Ralph B. \"Salty Stick: experience with DXM & Drug Testing (ID 73710)\". Erowid.org. Sep 8, 2008. erowid.org/exp/73710",
 "substance": "DXM & Drug Testing",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "DXM",
   "(capsule)",
   "  T+ 24:00",
   "450 mg",
   "oral",
   "DXM",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2008",
   "73710",
   "Male",
   " ",
   "Not Given",
   "Sep 8, 2008",
   "25778",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is a specific case of using DXM before a drug test, in response to respective the drug-testing vault. To give more background to what drugs are in my system regularly- I am an occasional DXM user - probably 4 to 5 times monthly, and, as of late, use cocaine and marijuana about 2 or 3 times a month each. I am also on the prescription Lexapro and drink alcohol regularly. I have been on this pattern for approximately 3 months.</p><p>The other week I had taken 300 mg of DXM in the form of CVS Tussin Cough Liquid Gels at about 1 pm. Since I was rather disappointed with this trip, I decided to take another, stronger dose the following day. This dose consisted of 450 mg of the same brand of Liquid Gels. So I had taken DXM two consecutive days, 300 mg, then 450 mg. The day after I had taken 450 mg I had a job interview. I ended up getting the position, pending a drug test, which we did on the spot.</p><p>It, however, was not a urine test. The test I received was a standard oral test, which tested for marijuana, opiates, PCP, and the like. I do not know anymore than that, other than it was a blue, plastic stick that contained a white pad at the end, which tasted rather salty. I had to keep this pad in my mouth for five minutes. It was then shipped to the lab. I received a call the next business day saying that I passed the drug test and got the job.</p>"
}
