{
 "title": "My Body in a Delerious State",
 "author": "Bob",
 "citation": "   Bob. \"My Body in a Delerious State: experience with Sleep Deprivation, Fasting & Cannabis (ID 73717)\". Erowid.org. Sep 9, 2008. erowid.org/exp/73717",
 "substance": "Sleep Deprivation, Fasting & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73717",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 9, 2008",
   "Views: 7314",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I got up for work one morning, I had barely slept at all the night before. I often will not be able to sleep if I have a lot of things on my mind, or know that I have to get up and do something the next day, I'll end up being all anxious thinking about that all night rather than just falling asleep. So I probably had an 1 if any sleep. I got up and went to work, I work doing landscaping/construction, I don't remember exactly what I did that day but it was something semi strenuous. I also didn't have any breakfast that day, nor did I eat my lunch at work.</p><p>I got back to my house about 7 hours later, I was just in the sun all day and am tired as hell from lifting/carrying/digging things all day, plus running on no sleep or food. I get inside, my body is aching, my stomach is growling, and my energy is gone, and I'm almost in a state of delirium because of this. I go to my room and decide to smoke a fat bowl and then take a shower. I hadn't smoked yet all day so I was really quite high.</p><p>I sit down in my shower (yes you have to sit down and hose yourself off in my shower), as I sit there showering myself I start thinking about how high I actually was, I start spacing out and thinking about something, I begin to realize just how low my blood sugars are, I was so hungry and out of energy. I then started spacing out again as I showered, and started looking at the wall, small crackles in the paint were forming in to semi distinguishable objects. the swirling colors depicted on the shampoo bottle logos were morphing and twisting about and other subtle things had the same effect.</p>"
}
