{
 "title": "Overshot",
 "author": "Dan",
 "citation": "   Dan. \"Overshot: experience with Phenylalanine (DLPA) & Selegiline (Deprenyl) (ID 73722)\". Erowid.org. Feb 21, 2009. erowid.org/exp/73722",
 "substance": "Phenylalanine (DLPA) & Selegiline (Deprenyl)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "9.0 mg",
   "transdermal",
   "Pharms - Selegeline",
   "(patch)",
   " ",
   "1.5 g",
   "oral",
   "Phenylalanine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73722",
   "Male",
   " ",
   "Not Given",
   "Feb 21, 2009",
   "Views: 21034",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After reading some positive results about the combination of phenylalanine and selegiline, I decided to try it. I was taking Emsam 9mg transdermal selegiline for depression and added 1.5 gram per day phenylalanine (DLPA): 500mg in the morning, another after lunch, and a third when I got home around 7:00pm.</p><p>At first, I felt beyond well, as if on a modest dose of methamphetamine. I had profound euphoria but only modest acceleration of thoughts and without paranoia. I noticed that I had forceful leg spasms when drifting off to sleep. These affects continued without diminution until the morning of day six. About 20 minutes after the first dose, I felt a sudden feeling reminiscent of haldol and my hands developed a course, consistent tremor, just like Ive seen in people with Parkinsons. The euphoria disappeared but there was no crash in mood. My vision suddenly seemed to take on a decrease in contrast causing everything to have a dead, plastic-like appearance. Thoughts ground to a halt and I had a not there feeling, again, reminiscent of haldol.</p><p>I stopped the phenylalanine but symptoms continued to worsen. The tremor, however, disappeared. I had difficulty walking. Muscles would contract but there was a delay before they would relax again. I had a sensation that my limbs were not mine any more and that I could not quite tell where they were without looking at them. I had a concern that my hand would overshoot and miss the shifter when I was driving if I didnt look at it every time. My hands routinely overshot their targets when I wasnt staring right at them and concentrating on the movement, purposely moving slower than normal. The slightest unexpected contact, even just the hairs on my arms, caused a very forceful involuntary flinch. I occasionally had forceful leg spasms in the middle of the day.</p><p>My hearing decreased and everything sounded distorted, as if through a fan. I had difficulty swallowing, tachycardia, and severe anxiety and insomnia. I also had pins and needles in my arms and legs in spite of what seemed like good circulation (my extremities were not pale or cold), as well as brief periods of numbness. My heart rate stood about 110 for five days (my resting H.R. is normally about 62). My blood pressure (which I took many times) remained within normal limits the whole time (both the first five days and during the troubling symptoms). I had brief periods when I felt faint and had difficulty following conversations. I noticed that alcohol seemed to offer some relief, at least from the anxiety.</p><p>After 5 days of these symptoms, they largely subsided. My hands continued to overshoot their targets occasionally, the leg spasms in bed continued, and I occasionally had pins and needles in my arms and legs for about six months. I remained on the Emsam throughout the entire time.</p><p>I feel that the some symptoms are consistent with dopamine depletion, some with increased dopaminergic transmission, and some with peripheral nerve damage. This may represent a syndrome akin to neuroleptic malignant syndrome. It is worth noting that the dose and route of administration of selegiline I was taking results in high blood levels and is expected to cause some degree of inhibition of MAO type A (it loses specificity for type B at high doses). MAO type B is responsible for metabolizing phenylethylamine, so this is presumably responsible for the effects.</p>"
}
