{
 "title": "Endsearch",
 "author": "PLU",
 "citation": "   PLU. \"Endsearch: experience with LSD (ID 73747)\". Erowid.org. Mar 11, 2011. erowid.org/exp/73747",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73747",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Mar 11, 2011",
   "Views: 17592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSET.\r\nI'm 23, male and for the last two years I have used NLP, meditation, eastern philosophies and other Psychoactives (MDMA, MDA, amphetamines, Weed, Datura, LSA, Salvia) to reprogram myself into an INFP Personality type (Introverted iNtuitive Feeler Perceiver). \r\n++++++\r\nNote: I have also had experienced short outburst of endogenous DMT releases in which I have not been able to completely let go due to intensity of the onset, unexpectedness and totally randomness (during sleep) and the fear/panic it brought about.\r\n++++++\r\nOn my way back from the little park where I've bought the acid the world had a fairytale, fantasy-like quality about it. The neighborhood was well known to me and, until now, I had perceived it as a pretty grim city dwelling. There were a lot of children this time and all the people seemed much happier than usual. On the subway ride I witnessed a beautiful scene. A complete stranger gave a red airplane model to one of the children present. The child was totally beaming with joy and started running around playing with his new airplane while his mother was 'pretending' to calm him down. The palm trees that were being planted a few days ago in the intersection were sparkling with electric led lights while the sun was just setting and imbuing the scene with a faded mellow orange light. It was as if the impending acid trip was also reverberating back in time. Keep in mind that the blotter paper was still in my pocket.\r\nSETTING\r\nProps:\r\n- Hypnosis - Richard Bandler, Neurosonics personal enhancement series.\r\n- Shpoongle\r\n- The 'noble eightfold path' ring from a Tibetan monk (impromptu)\r\n- Samadhi Meditation (as a long term practice)\r\nThe day in question I've eaten only a few morsels of rice and some fruits. I wasn't planning to keep a strict diet because I've only found out that I'll get the acid later in the evening. It just felt right to eat light. \r\n++++++\r\nNote: Although, intuitively I knew something big is about to go down that day due to one of the spontaneous DMT releases during the night before. I managed to get past the 'WHAT THE FUCK IS GOING ON?!' and let go to the point where I thought the second chakra (Swadhisthana) got activated and I experienced an enormous flow of energy that seemed to come from the very source of the universe, like a zero point energy field, traveling continuously from the chakra trough two prana channels coiled on eachother around my spine to my head which was in a ecstatic spaciousness of the mind. Soon, when the fist thought made its presence, everything went back to normal and I woke up sweating. Yet, my consciousness had a very, very sharp quality about it.\r\n++++++\r\nOnce home, I made a playlist with shpoonge albums 'Tales of the inexpressible' and 'Nothing lasts'. I took a shower, clipped my nails, cleaned the place, took out the trash and then meditated for about half an hour while shpoonge was still on. When I felt everything was calm, peaceful and the smile that usually comes up by itself while meditating made it's presence I used the I Ching to determine whether I should take half or all the LSD blotter and reached the conclusion that half is the wisest and the most fortuitous choice.\r\nONSET\r\nAfter I ate the spec of paper, which was bitterish, I munched down two slices of lemon and I went back to meditation while still listening to shpongle. I don't really now how long it took to fully come on because the music was like 'OMFG!! WTF IS THAT PLACE? OAAAAW... WHAT ARE THOSE THINGS?!' I don't know how they came up with this kind of music or what they had put in, but listening to it while tripping on acid is one of the most beautiful experiences on this planet. If I were to put it in a metaphor of sorts, it's like snorting cocaine and jumping of an airplane at night withought a parachute while there's an outstanding fractal-like, kaleidoscopic fireworks spectacle all around and all the mythical creatures ever invented by the human psyche are there partying down like it's their last day on earth.\r\nDEEP PSYCHOINTEGRATIVE WORK\r\nThe next step in the structure of the trip I had laid out (at the advice of Strassman's 'Preparing for the Journey' chapter in 'Inner Pats to Outer Space') was an integrative hypnosis session. I used for that Richard Bandler's 'Neurosonics' recordings. I chose to be brief here due to the nature of the experiences being of high personal value, unique to every individual, and probably completely meaningless to whomever would be reading this. Needless to say, after I've worked trough all the psychological dissonances (and I'm quite sure I've got them all) I have met the deepest part of my unconscious. And boy is it powerful! At first it has presented itself to me as intense, almost unbearable, undefined feelings that took form of 7 dragons: Purple, Blue, Red, Green, White, Black and Gold. \r\nAfter a display of immense power, beauty and perfection at which point I was absolutely awed, intrigued, respectful and scared shitless at the same time, they all bowed down in front of me and said in an empathic caring and divine reverberating voice: 'We are your friends.' Ive talked with each and everyone of them and understood, why, how they are and what their purpose is in my personality. \r\n++++++\r\nNote: although I talked with them, I can't say they were sentient entities as one is supposed to meet on a high dose DMT trip, I wouldn't know about that cause I have yet to undergo the triptamine ordeal :D. Basically they are parts of myself. \r\n++++++\r\nAfter the 'interviews' I felt/realized that something had to be changed. More precisely that the Purple and Blue dragons are actually supposed to be one, not separated entities. And they complied merging with eachother like a high complexity multidimensional puzzle becoming itself and forming the Blue-Purple dragon of magic sexuality intuitive extrovertedness. Also the Black and Gold dragons weren't very happy either because one was missing the qualities of the other and vice versa. So I also merged them into the Gold-Black dragon of apprehensive determinative practical clarity. The Red is in charge of destroying what is no longer needed. The Green takes care of growing new structures and those two have a feminine quality complementary to the masculinity of the other dragons. The White dragon is the wise overseer.\r\n++++++\r\nNote: Keep in mind that language is a very poor perceptual-cognitive-symbolic instrument for describing what actually took place and the actual experience is in itself a far more competent direct-intuitive-non-local tool. In other words, language is so lame that I'm asking myself what's the point of writing this. Anyways, I do it because I've promised myself I'll do it.\r\n++++++\r\nREALITY and PERCEPTION\r\nSuddenly my body started conveying an unquestionable message of hunger as in 'Look, that's beautiful and all but you really need to eat right now!' Not with words but a kind of undeniable knowing/feeling. At this point I opened my eyes. \r\nAlthough the lighting was minimal the walls and the objects around me, including my body, were flashing bright, vibrating, and undulating. Moving felt extremely pleasurable and I was two feet off the ground. The coordination of movement was much more precise then the similar, lesser, kind of coordination I experience on MDMA and amphetamines. And suddenly I saw the house plants, moving, vibrating, ALIVE and AWARE of my presence. This made me blissful and I realized there is a very big difference between the intellectual knowledge (i.e. of plants being alive) and the actual underlying subjective understanding of their aliveness. Generalizing, all the knowledge in the whole world, all the books, written and spoken information is just junk compared to the direct experience itself. I went immediately to the balcony and looked at the trees. They also were subtly moving, alive-ing and actually communicating with each other. I waved hello. They waved back in their own way and they seemed happy that I was actually understanding them. \r\nBack to the fridge to eat some fruits. This is were shit gets really interesting. The perfection of the apple that I was holding in my hand made me understand that through the fact that I was perceiving it, I was actually bringing it into being. The moment I took a bite, a tremendous fear engulfed me. And a brief thought went by as fast as light Aw shit, Im dieing! But there was too late to do anything about it, I've already done it. The whole sensorium of hearing the crackling of the apple, the taste, the smell, the holding, the sight, they all sinestesicaly combined and I WAS THE FUCKING APPLE! There was no me, just a process of 'apple-ing'. A few years back I had eaten the best peach ever while I was on E. I actually had no idea, at that time, what that really meant... After this, I also have the memory of eating a few other fruits. But (and this is a profound but) it's not really 'my' memory. It's not as if I ate the fruits. The fruit's had been eaten. Period.\r\nAfter this I regained my 'sense of self' but this sense of self was still kind of separate, as if I was something else that was experiencing the self. And the self was pretty damn mad at the fact that it just *wasn't* a few moments back. It was like an old uptight professor who is mad at 'his' students for their being happy. And this other expansive I-existence and the Blue-Purple dragon were like two children in a classroom trying as hard as they could not to look at each other because they new that they would burst into laughing at a most inappropriate time if they did. And they did look at eachother and LOLd at eachother for no reason al all and 'the self' was gone again. \r\nI turned off the light and sat down back in the lotus position on the couch trying to meditate. Which was impossible. There was no way I could calm the mind. It created hundreds if not thousands of alien sceneries passing by very fast in sharpness and detail that one doesnt has access to in ordinary reality. I perceived other planets, beautiful technologically advanced cities, alien worlds, weird natural formations, Ive seen creation of stars, planets, galaxies, clusters and even bigger kind of formations which I have no idea what they were and don't even dare to speculate. After a while this got kinda boring and opened my eyes again. Apart from the tripiness of it all around me, guess what was on the table in front of me glowing with a white, light blue tinted aura? The 'Noble Eightfold Path' ring that I got from China. It has inscribed on it the eight Buddhist symbols and as far as I know it belonged to a Buddhist monk from Tibet. The weird thing is not that it was glowing. It was also communicating to me, not with language, but with a direct form of communication, and what it was repeating is 'ask the questions! ask the questions!'\r\nI put it on my finger and suddenly 'the thousand petal lotus' bloomed under me. It was not made of matter as a normal lotus is made of. It was pure energy of all known colors, and colors I havent seen before, wonderfully woven and throbbing with the fabric of space-time itself. I realized that the meditation position I was in, was totally wrong. There was no way the different parts of the body could be at peace with each other because they were hurting one another by being twisted in fucked up and uncomfortable ways. So I started rearranging everything guided by the feelings I got from very slight and subtle repositioning. It took an eternity to finish this to the point where everything was in complete cooperation, but unlike the previous part with the visuals it didn't get boring because as I was progressing I was feeling deeper and deeper relaxation and blissfulness. When I was done, the whole chakra system just lit up. There was no 'one, then the other'. They activated, (though activated wouldnt be accurate enough; they are there at all times whether I acknowledge it or not) all at once releasing and at the same time gathering immense quantities of energy and the reality ripped apart. There was only a multidimensional field of consciousness, the fundamental building block, creation and love itself producing the world moment by moment. Past and future do not exist. All there is, is here and now.\r\n++++++\r\nSlowly I got grounded again and on the coming down part of the trip I experienced tons of feelings in chaotic randomness and fast succession of the full spectrum. From raging fury, hopeless jealousy, utter loneliness, pure horror to absolute love, total happiness, compassion, centeredness often accompanied and most probably triggered by visuals. Though it might have been the other way around just as well. \r\n++++++\r\nNote: Thinking about it now, I dont recall horniness being part of the emotional spectrum. Its more like a command.\r\n++++++\r\nNow, another subtly interesting aspect of this is the fact that I was detached from the emotions. This could be interpreted as god just as it could be interpreted as bad also, depending on the emotion. For example, feeling the horror and at the same time being dissociated from it is quite ok. But feeling the love while still being dissociated from it is not an immersing enough experience\r\nCONCLUSIONS\r\nPerception is *the* active process of creation that brings into being everything I thought I passively perceived. I experienced not being one with everything or interconnected with everything. I 'was' fucking everything! All there is, is me and I am all there is. The I in me is the same as the I in you or the it in plants, animals and objects. There is no front without the back, no foreground without the background, no light without dark no outside withought the inside. At his fundamental level not even nothingness exists and at the same time everything exists. This is the eternal now. Again, I can't stress this enough, the intellectual knowledge of this kind of existence has noting to do with the existence itself. It is part of it though, but it cannot express it just as language can't really express it either. Basically there is no final attainment, no final stopping place; the enlightenment business is not really what I thought it is because it just IS. The whole existence is enlightened in its totality. If that makes any sense... Being everything there is, it can express itself in every form. And it does. It does that because being just the big ONE gets boring eventually and it creates separateness so it can, from time to time, go back to that basic unity. Just as there is no male withought female, no good withought evil, no sacred withought the profane, there is no ONEness without the separateness. And then OW LOOK ! CHOCOLATE! and beautiful GIRLS! and LOVE! and MOUNTAINS! and AND!'\n\n\n"
}
