{
 "title": "Should Have Listened...Didn't",
 "author": "Ophelia",
 "citation": "   Ophelia. \"Should Have Listened...Didn't: experience with GHB & Alcohol (ID 738)\". Erowid.org. Oct 10, 2000. erowid.org/exp/738",
 "substance": "GHB & Alcohol",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "738",
   "Male",
   " ",
   "Not Given",
   "Oct 10, 2000",
   "22306",
   " "
  ]
 ],
 "report": "<p>\nThis case happened a few months ago when my boyfriend and I went to a popular club to meet up with some friends.  At the time 'G' was something of a new item and everyone was really interested in what it did when brought into the club atmosphere.  So everyone was using it recreationally--1 capful for every 45 minutes, max.</p><p>My boyfriend was the only that had not taken any.  Instead, he was just drinking beer, but by like 3:00am he decided that he wanted to take some too.  The only problem was that he had been drinking fairly heavily and by this time I guess he felt untouchable.  So without my total knowledge, he took what we estimated to be like 5-6 capfuls in about 2 hours.  The 'caps' were said to have been watered down, that is why the dosage was so great.</p><p>Well, about 30 minutes later he grabbed some other girl's crotch, which was totally out of character for him.  He was hanging off of the lights on the ceiling and had stripped down to only his pants.  Now this club is pretty forgiving about weird shit happening, but what comes next is unforgivable.</p><p>I look over at 'subject' and he is taking his pants down.  I run over because this is not a good sign.  As I get there he is pulling out his unspeakables and peeing all over the people in the booth below us.  Thank god they thought that it was a beer or they would have probably killed us all.  The next thing I know I have his pants up but during the process, he tripped on the cuff of his pants and landed head first on the iron banister.  Bad goes to worse in like 2 seconds.  'Subject' is now unconscious, bleeding profusely from his face and I do not know what the hell to do.  I turn around to ask one of my friends what to do and everyone is gone.  They all took off, afraid I guess of what was about to happen.  So I tried to feed him ice and water and bribe him with sexual favors and such to get any reaction out of him while trying to see where all the damned blood was coming from.  Now granted, at the time I took G myself, so I could hardly see straight and this sucked.</p><p>By this time the people below us have realized they have been pissed on and they call all of the bouncers and they come and drag him off, pants down to his ankles, bleeding all over everyone, unconscious.</p><p>This was the worst night of my life.  I watched the love of my life get tubes shoved down every hole in his face and watched him wake up wondering what the hell was going on.  I watched him get stitches in his mouth.  All because we did not listen to anyone's advice that this drug can kill you.  Granted, it can give you a good time...it can also cause you to gag on your own vomit and all your friends will watch you die.....I have seen it happen.</p><p>I talked to the bouncer about the night of the above incident...'subject' was the 7th person taken to ER that night from GHB.  Two weeks later a girl died in the club from too much G.</p>"
}
