{
 "title": "A Novel Combination",
 "author": "UBTNG",
 "citation": "Citation:   UBTNG. \"A Novel Combination: experience with 2C-E & Wild Dagga (ID 73802)\". Erowid.org. Oct 30, 2008. erowid.org/exp/73802",
 "substance": "2C-E & Wild Dagga",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "insufflated",
   "2C-E",
   "(powder / crystals)",
   " ",
   "1 bowl",
   "smoked",
   "Leonotis leonurus",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73802",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 30, 2008",
   "Views: 5562",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n2C-E is known for its intensity, especially when insufflated. One tends to wonder what to do with all of the ENERGY; there have been reports of bodily malaise mainly due to the fact that no position one tends to put oneself in feels at all *comfortable*. \r\nOne night, I insufflated somewhere around 5 milligrams of my current favorite white hallucinogenic powder. I know the warnings against eyeballing the stuff. Number one, I've weighed out this substance more times than I can count, and number two, I'm always extremely cautious with such things. \r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]\r\nThe effects began as they always did, some 30 minutes later, after the 'punched in the nose by millions of tiny knives' sensations had left. The point of this report is not to communicate the values of 2C-E, which has been done by much more skilled writers than I, but rather to investigate the synergy between the two substances listed in the title, thus I will refrain from describing any insights or personal revelations experienced.\r\nWhat I was was typically uncomfortable. I was pacing around, trying to get rid of some of the excess stimulation. Lacking my usual green ally in such situations, I remembered I had a small bag of 20x wild dagga (Leonotis leonuris) extract. I had previously chalked the stuff up to be just another expensive, sub-par legal 'high', but thought I would give it a shot.\r\nI smoked a bowl packed with the extract, remembering and not particularly caring for the barbecued-chlorine taste of it (at least that's how I perceived it :D), but was soon rewarded. The excess stimulation of the 2C-E had abated somewhat! In fact, I had to look around me a few times to ensure the dagga extract had not somehow nullified the trip. No problems there, I soon realized. \r\nI was amazed, however, at how profoundly the dagga extract altered the dimensions of the experience. The usual jangled edge of 2C-E had been replaced by a dreamier quality not unlike a small hit of our green friend, but without the excess mental 'oomph' said friend tends to impart.\r\nIf you like 2C-E, but find it a little hard to deal with thanks to the feelings of never being able to get comfortable, try some dagga extract along with it.\n\n\n"
}