{
 "title": "The Deepest Corners Of My Mind",
 "author": "Vindico",
 "citation": "Citation:   Vindico. \"The Deepest Corners Of My Mind: experience with Mushrooms & Cannabis (ID 73832)\". Erowid.org. Mar 5, 2010. erowid.org/exp/73832",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 73832",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 5, 2010",
   "Views: 3477",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs I am writing this, my first experience with mushrooms occurred about two days ago, on a Friday night. I live in a fairly small town, one where drugs other than marijuana can seldom be found. However, I received word about a week prior to the experience that a trusted dealer in the area had come across a large amount of the magic fungus. I sprang at the idea, bought an eighth of an ounce, and began waiting.\r\nThe week seemed to crawl by at an unbearably sluggish place. I was to spend the night at a friends house, who will be referred to as A, where we would not be bothered by any stimulus that may disturb or give away the trip (law enforcement, parents, so on, and so forth). I spent much of my free time skimming through the multitudes of reports online, hoping to glean a small idea of what was about to come. I had been smoking pot daily for about a year, and had taken ecstasy about one month prior. After a long night of rolling, I appreciated the true meaning of the word psychedelic. I had been expecting nothing more than an altered marijuana high, perhaps a stronger than ordinary buzz; what I had experienced was a completely different state of consciousness, a new reality, so real and touching that it was hard to believe I was in a drug induced state.\r\nLong story short, I knew I could not possibly imagine, nor be prepared for, what I was about to experience.\r\nEventually, after what seemed like years upon years, Friday arrived. I had spent the week preparing as much as I possibly could. I called an old friend, an experienced tripper, also the first person I rolled with, and asked him for some advice the night before the trip. He told me that if I felt as though the trip was making a turn for the worse I should go for a short walk outdoors. Apparently, that has always helped him. And remember to breathe deep, and take everything in. On Friday I ate an apple for breakfast and drank a lot of water and fruit juice, and ate a bowl of grapes about two hours prior to ingesting the mushrooms. Other than this, I fasted all day. I put aside about 15 minutes before leaving my house to meditate, and to calm my high strung nerves. I felt I was ready.\r\nI arrived at As house with my girlfriend, well refer to her as P. Our mutual friend J was also there, as was As girlfriend, G. Another mutual friend, S, was to arrive in another hour or so. The trip was to take place in a small building he had on his property, one of the playhouses every wanted as a kid. It was no larger than the average sized bedroom,  and was furnished with two couches, black lights, an abundance of posters, and of course, the mushrooms. Aside from myself, A and J were the only others that planned to ingest mushrooms this evening. P and G would be content with getting very, very stoned, and S had one tenth of Molly (MDMA) he planned on rolling on later in the evening. A had tripped only once prior, and had experienced an awful trip. Being ill informed on the actual effects of the drug, he attempted to sleep, alone, in his room, before the effects could set fully set in. Anyone who has tripped on mushrooms before could tell you this was a monstrous mistake. J had tripped many times prior, about three or four from my understanding, and had had a glowing experience each time. This was my first, as I have stated before.\r\nThis had all the makings of a good trip; I was extremely close and comfortable with all the friends that were supposed to be there, and I was very familiar with my surroundings. As we were all of age, As parents had no qualms with us tripping. I shut off my phone, as to avoid any complications with receiving or making a call in the future. I hadnt eaten all day, and orange juice was readily available in order to intensify and speed up the trip.\r\nWe all sat down in the playhouse, ground the mushrooms, and sprinkled them onto peanut butter sandwiches. I had 2.5 grams ground up, J had about two, and A had three. We all ate our sandwiches, remarking that the ground up mushrooms tasted of sunflower seeds. This was the beginning. The time was 6:37 PM.\r\nWe finished eating after about 15 minutes, and I was already feeling something changed about me, although I couldnt place it. My vision was slightly sharper, and my sense of touch seemed to be a little stronger than usual. My pupils were already the size of large plates. I dismissed the effects to being nothing more than a figment of my imagination, no doubt due to my excitement for experiencing the trip. My girlfriend, P, gave me a short backrub, which was very relaxing and highly appreciated. G arrived shortly thereafter, and we all headed back inside the playhouse to smoke some pot. The time was about 7:10.\r\nWe all sat down the playhouse, packed a bubbler, and sent it around. I was the only one who declined, as I wanted to experience the mushrooms for what they were. I was definitely feeling something by now; the music seemed so much fuller, and my train of thought toggled between varying subjects very quickly. S arrived at about 7:20, procuring a bottle of Fuze citrus flavored juice, which was packed with vitamin C. I took a few swigs and left the rest to the potheads, who were experiencing some intense cottonmouth. I began to feel someone claustrophobic, which was odd seeing as how I had never felt boxed in like that before. I asked P if she would join me on a short walk out back.\r\nWe left the playhouse and walked out back into the large expanse of woods on As property. We walked to the edge of the woods and came back. I noticed that the grass rippled as I walked along, and that the trees seemed to breathe. I looked at Ps face; her forehead had a slight green tint to it. I saw a deer and pointed it out; she told me I was tripping balls and that there was no deer. I became unnaturally disturbed: No. No. Not true. Its right there. It has to be. Its so real. I cant be hallucinating this strongly. Shit. There was something in the mushrooms. I overdid it. Shit. Shit. She saw how badly I was freaking out and started laughing, letting me know that she was just kidding, and that there was a deer there. I told her not to mess with me like that, and we head back inside.\r\nWhen we reentered the playhouse, the main lights had been turned off, and the black lights had taken their place. The posters seemed to glow three dimensionally. S had brought his laptop and had it plugged in to the speaker system in the playhouse. Jimi Hendrixs Little Wing was playing, and although it was one of my all time favorite songs, I felt as though it was my first time hearing it. It was about 7:45 at this point, meaning I was definitely starting to rise. The trip had begun.\r\nI grabbed my bag and pulled out a pack of glow sticks. I threw them around to everyone in the room, who snapped the capsules inside so that they began to glow. I saw trails of light follow as the brightly colored glow sticks were thrown around the room. I took one in my hand and started at it; it was so very bright, and I could see the liquid flowing inside of it. As I stared at it longer and longer, it began to move. It looked as though it was wriggling free. I tossed it on the table and leaned back, looking all around.\r\nFrom this point forward I will no longer be able to relate times, as I lost all track and comprehension of it.\r\nI was relaxed. So relaxed. I asked A and J if they would like to take quick walk with me. We exited the playhouse and walked outside towards the woods. The trees were still breathing, and I kept wondering about the huge world that lay in the grass underneath my feet. The ground seemingly sprung up with each step I took, propelling me forward. I began laughing. I dont know why. Nothing was funny. I was laughing because I was so happy, so peaceful, so thankful to be alive. I watched their cigarette smoke form beautiful, intricate patterns in midair. I felt great. We stood around talking about what we were feeling for a little bit, and then headed back inside.\r\nAfter sitting down, I realized the intense tide of emotions I was feeling. My eyes were tired, and it helped to close them. I lay back, and began to think. I thought hard. My mind was slowly opening up, giving me insight, giving me power. I opened my eyes again and looked at the ceiling. The tiled area above us looked like another floor, one that was suspended upside down in midair. With each beat of the music a small ripple would flow from the speakers across the ceiling, giving it a wave like effect. S, P, and J all decided it was time to go to the gas station up the street and grab some drinks. I opted to stay behind, not wanting to go out in public, and G stayed back so she could check on A, who had disappeared to go lay out on the patio.\r\nAfter the group left, G and I headed out to the porch to make sure A was all right. Walking outside felt like I was stepping into something huge; no, gigantic. I looked up at the sky above me, and saw all the stars. They were so bright, and seemed so close, like they were a tangible part of the sky. I almost jumped up to try to grab some of them for closer inspection. I decided not to, as I didnt want to disturb nature, nor did I want to take away parts of the constellations. They were best left alone. The ground was dark and uneven, and I stepped very carefully, still looking all around, making sure I didnt miss a thing. A told G that he wanted to be left alone, that he needed some space to think. We were walking back inside, G leading the way.\r\nOnce back inside the playhouse, I sensed that she was a little hurt by his statement. I told her not to worry, and that a lot was passing through his head right now, and that he was feeling a lot of very strong emotion. The smallest little thing could push him over the edge. She said that she knew it was best to just leave him be, she was just worried. I understood and lay back onto the couch. She asked if I cared to smoke, and I agreed; I was beginning to feel somewhat apprehensive, and I needed to calm my nerves. She whipped out the bong, we call it the Tube, and began packing it as I continued to stare curiously at the ceiling.\r\nSo whats it like?\r\nI took a second to think. I was having problems putting together words to create sentences.\r\nDo you see all the tiles on the ceiling?\r\nYeah are they moving? she asked with a chuckle.\r\nNo. They are rippling, right along with the music. Its like the playhouse is dancing.\r\nAs I said this I became aware that the light was constantly changing, both in brightness and in hue. One second everything would be tinted red, the next it was flowing into purple. She passed me the bong, and I took a hit. I kept it small, knowing from my experience on E that I could easily cash the entire bowl without so much as a cough.\r\nI felt the familiar relaxing sensation of the pot begin to take over my body. It felt so good. I felt so good. I was smiling, beaming, I saw a light coming from my mouth because I was so happy. Being high was like an old friend to me, it calmed me, it gave me something to hold onto.\r\nSoon enough everyone returned with drinks; I had water, but P had also grabbed me a large can of Monster in case I got tired. It was at this point when the hallucinations began to really hit. Ss curly hair was twisting, like a head of snakes. I stared, fascinated, for longer than I realized, before I looked to my left to see P sitting next to me. I noted a bright blue aura emanating all around her. Js face was distorted; his eyes were small and far apart, and his mouth wasnt centered. \r\nI realized J was crying. Tears were streaming down his face. Upon closer inspection, I realized he was still laughing, laughing so hard at absolutely nothing at all that he was bawling. I smiled, realizing that it took me a few seconds to recognize his facial expression, and that laughing was a good thing.\r\nIt was at this point that I was hit full force with the mind expanding properties of the mushrooms. I felt as though my mind was a map, folded up all my life, only allowing me to read one region. It was now opened up, all the way; I could see everything, I could see my own personality, and everyone elses. I began thinking, I was thinking hard, I couldnt stop myself, and I didnt care. This is what I wanted. I was concentrating on everything at once, millions of thoughts were flowing through my head every second. They expressed themselves in me as emotions, emotions I couldnt explain, feelings I had never felt before. I was feeling my own thoughts. I thought about family, and how close they are. I thought about these new emotions.\r\nI thought about my girlfriend, and the actual inadequacy of the English language surfaced in my head. What was I feeling? It wasnt love, it was stronger. It was the strongest sensation of relaxation and comfort I had ever felt before. I was sitting next to her, and that was all that mattered. I was safe, everything was okay. I closed my eyes and saw intense visual landscapes unfolding before me, playing out on the canvas on my eyelids. I journeyed to mystical worlds unknown, ones I had never seen, and never would have imagined. My thoughts deepened, became more intense. I felt myself fading, my own individuality, my ego, and I knew not to fight it. I didnt want to. All it had ever given me before was concrete feelings. The broad range of emotion I was feeling now was simply amazing.\r\nI embraced this, and felt myself fall so deep into my head that I no longer knew what it was to live. This life was so short, so compressed, and living was so very foreign to me. I thought about how almost everyone spends their life succumbing to the needs and wants of their body. I recognized my body as nothing more than a tool for furthering my thoughts and mind. I wanted knowledge, I wanted power over myself, I wanted to get to know myself. I thought about myself, and I saw who I really was, and I was okay with everything. I accepted myself for who I was.\r\nAt this point in time the feelings of relaxation began to subside as fear began to make its way to the top. I realized that my constant rollercoaster of emotions was tailored to the music being played. I didnt even realize it was being played, it just flew so naturally through me that I accepted it as part of my thoughts. I felt every beat, every note, and watched in my opened minds eye as they caressed my inner thoughts and took hold in my body as emotions, each one new, previously unfelt. The fear was being held down by one of these emotions, which I had given a name to, but have since forgotten. Each time the music would stop, so would the protective feeling, allowing the fear to surface. Music was my lifeline; I was nothing without its comforting hold.\r\nThis continued for a large expanse of time. It could have been hours, it could have been minutes. I began coming down around 9:45, and reality was newly introduced to me. I could not seem to grasp the concept of time. I was physically and emotionally drained in every sense of the word. 9:45 meant nothing to me. Was it late? Was it still early? Was it still Friday? Had everything even happened yet? I had no idea. In trip reports I had read during that week, a rebirth was often mentioned, but I never truly appreciated the meaning and significance of this until I came down. Everything seemed foreign, and nothing seemed real. Slowly my mind began folding back up, and the hallucinations began to subside, before I was hit with everything again. This continued for about half an hour, each new wave lessening and lessening in power until my trip had finally, truly ended.\r\nWe all sat and discussed the trip as it faded away. P had gotten picked up by a friend, and G was downstairs in As house sleeping; she had smoked a lot of pot, and was absolutely exhausted. By this time, it was around midnight, and one of As friends, well call him M, had arrived. A and M had a few beers, and, in order to ease our flowing and overworked minds, about an eighth of weed and half a gram of hash was smoked. We packed two bowls, with hash mixed in with both of them, and three extra fat joints were passed around. After we were all nice and stoned, we chilled out, listened to some music, and just sat back and reflected on what had happened. A went down to the house to check on G, and M left a few minutes later. After A got back, J and S both announced that they were going home to get some much needed sleep, seeing as how it was about 1:30 in the morning. We all said goodbye, and myself and A trekked back down to his house. A showed me the bed where I would be sleeping, and woke up G to be brought back upstairs to get picked up. \r\nAlthough being both mentally and physically drained, I only got about five hours of sleep that night, and woke up feeling refreshed and revitalized.\r\nI reflected on my experience the next day. I was hoping to get something out of it, other than just having a trip, and I did. I feel more in touch with myself, and I feel healthier and much better. I have vowed to treat my mind and body with much more respect, to meditate more often, and to stop eating junk food and soda, even though I am already quite skinny (Im 61 and weigh 140 pounds).\r\nMy biggest question of the experience is as follows: which did I prefer, ecstasy or mushrooms? While the answer is not yet clear, I have picked out the best parts of each. While I much prefer the body high and good natured feelings of ecstasy, the deep and complex thoughts and emotions I experienced in my trip were one of a kind. I no longer view drugs as drugs; I see them instead of tools, which, when used properly and treated with respect, can be used to further my thoughts and give me deep insight into life, spirit, and, most importantly, myself.\r\nI do wish to experience both again, and to open up my mind in many new ways, leaving not a corner of it untouched.\n\n\n"
}