{
 "title": "Different Effects",
 "author": "jackthestripper",
 "citation": "   jackthestripper. \"Different Effects: experience with Codeine with Acetaminophen (ID 73856)\". Erowid.org. Feb 24, 2011. erowid.org/exp/73856",
 "substance": "Codeine with Acetaminophen",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "3600 mg",
   "oral",
   "Acetaminophen",
   " ",
   "360 mg",
   "oral",
   "Codeine"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73856",
   "Male",
   " ",
   "Not Given",
   "Feb 24, 2011",
   "Views: 5374",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: this person took 3600 mg of acetaminophen (paracetamol) which can be dangerous to the liver if taken in very high doses; over 10 grams at a time can be fatal. The maximum daily dosage (adult) is 4 grams (this estimate is from emedicine.com). People with liver disease or who are regular users of alcohol are more at risk of liver failure from high doses of acetaminophen, even doses lower than 4 grams.] </p><p>I am a regular user of opiates. my opiate of choice is morphine. I have been unable to dose for the past three weeks. I went through withdrawal (for myself this includes 24 hours of deep sleep, followed by 72 hours or so of moderate depression).</p><p>Recently, I obtained twelve pills of acetaminophen with codeine 300/30 milligram tablets. I am not very experienced with this medicine, and did a bit of research, for I know that an excess of acetaminophen can cause health problems. I decided to ingest half of the, pills 1800/180 milligrams, to begin, and read to not ingest more than 4000 milligrams of acetaminophen within a 24 hour period, so I thought it best to not take them all at once.</p><p>I ingested the pills with a cup of fine green tea, and proceeded to watch a Democracy Now broadcast online. Within 30 minutes, I felt a familiar, yet different sensation of opiates in my system. After twenty minutes or so, the medicine began to show its contrast from the morphine that I am used to; The euphoria seemed to be centered more in my head than in my chest, and my neck was very itchy. I still felt the usual contentness, but this was soon followed by a mild anxiety spell, which lasted about an hour. From then on, most sensations of euphoria, itchiness, and anxiety had subsided into a pleasant, tranquil state. I relaxed for an hour, then decided to eat the remaining six tablets and take a cruise on my skateboard, as it was a calm, quiet evening. I downed the remaining tabs with another cup of tea and set out into the cool night. I returned home, not more than 20 minutes after I set out, feeling exhausted and nauseated. This worried me, as I am nocturnal and naturally energenic.</p><p>As I sat in my easy chair, I began to believe that consuming this medication was not such an enlightened choice, and perhaps I should have been satisfied with the first six tabs. I also had trouble urinating later that evening. In conclusion, I did not like the overall effect of this medication. Perhaps I took too much. I never have ill effects from my usual dose of morphine (30 to 60 depending on tolerance), and am questioning if this is a result of slight acetaminophen poisoning.</p><p>I wanted to follow up by saying that I spent the earlier portion of this day quite nauseated and vomiting. Purity is important with opiates, and I knew this before I ingested them, but my junkie instincts told me to do it anyway. I paid the price.</p>"
}
