{
 "title": "IzDizDipt?MmmILikeit!",
 "author": "Geest",
 "citation": "   Geest. \"IzDizDipt?MmmILikeit!: experience with 5-MeO-DiPT (ID 7392)\". Erowid.org. May 25, 2002. erowid.org/exp/7392",
 "substance": "5-MeO-DiPT",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE:",
   "9.0 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7392",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 25, 2002",
   "Views: 12101",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy time has come to try something new. Reading all information available produced a image that eventually had to fall down. This is what happened with this etheogenically experienced 64 kg-weighing-thc-junkie.  </p><p>First trial ~9 mg divided in ~6mg & ~3mg 1,5 hours later taken on a empty stomach late in the night resulted in feeling strange for a couple of hours. Not sure how to feel etc. Probably caused by hoping it would be a pleasure drug. Reminded me of that strange feeling psylocibine gives. My girlfriend reacts much better to the substance she doesnt seem to go thru the sequence > mmm I feel good mmm I feel strange mmm what the shit do I feel.  </p><p>Second trial 15.00 ~9mg ingested on a empty stomach by me and my girl. Woh  its working on my body trembling & vibrating. Not at all like the first time. This time it feels friendlier maybe the set and setting. The brightness of the world around me surprises me. And Im getting a bit more jumpy, for me this means every action is bodily enjoyed. There is an extremely euphoric feeling and changed sounds especially music.</p><p>For her it all stays neutral. Then the doorbell rings its one of my mothers surprise visits. This is testing the limits but surprisingly I stay coherent. Its like Im on mushrooms without some of the characteristics like o.e.v., extremely sluggish behaviour which often makes me crouch and drool (almost literary) and give me a complete chaotic episode in thinking. I explain to my mom I under the influence of a substance.   My girlfriend looks at me in disbelief (did he say that, can he say that) and then to my mom with relief (she knows). My mother immediately asks me to let her try some. I love her she is one who stayed completely innocent and unpolluted. Because Im not sure what to think about 5-meo-dipt I tell her to wait until Im sure its one of the good ones.</p><p>And yes it turned out to be I took another dose ~9mg T+ 1.5 hours later. The empathic feeling continued during conversations between us three making it easier to listen. I was very jumpy and distracted like a little kid (which Im at 28 years) but it did feel grounded & real. At a certain point an excursion in the outside world takes place. I feel warm (sun is shining & Im wearing a winter sweater) and energetic there is complete control combined with drunken like behaviour and the bond with my companions is intense. Although the world seemed surreal and distracting it was mere fun to be there. Imagine your self in nature in comparison to the urban jungle Rotterdam city is, wow.</p><p>What made it so good is that it was real in comparison to par example mdma. It did not end it just changed in nature, so after a few joints (tabacco+cannabis) and some delicious fresh bread (eating was possible and tasty). We still felt rejuvenated, for my girlfriend this is actually when she begun feeling good and better, another comparison I see with psylocibine the only other tryptamine Ive known and taken.</p><p>Later that day a strong desire was felt to do something we winded up with a few friends in a roots reggae, rock steady party. I can only describe how the music was treated it created vibes, smooth warm flows purely danceable. This was 7 hours after my last ingestion. I was happy to the point of being bezerk and then I drank too much and got pissed. And still had retrospective on what I did. I know that this was only the second try so maybe there is a snake in the grass (meaning it could still turn out to be less innocent then you would initially believe, like I witnessed with mdma). But further examinations and other points of view are in order.</p>"
}
