{
 "title": "Poem",
 "author": "gus",
 "citation": "   gus. \"Poem: experience with Mushrooms (P. cubensis) (ID 7395)\". Erowid.org. Sep 23, 2001. erowid.org/exp/7395",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 7395",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 23, 2001",
   "Views: 11473",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLike curtains of raindrops falling down<br>Each glittering jewel a twinkling sound<br>your love sweeps upon me<br>within me<br>without<br>A breath of deadly beauty<br>And conciousness therein<br>You glitter and shine<br>And turn inside out<br>these selves that are calling my soul to come out<br>A sweet breath is blowing my soul into fire<br>My body is dying so that I might go higher<br>Into the void I now burst anew<br>The celestial creatures a blessing bestow<br>On my selfless dying and comedy show<br>The same experience a friend once had<br>to wander through the heavens<br>to experience the riddle of the universe<br>to remember what you forgot<br>to know who you are<br>to know you've come so far<br>to know your soul's evolution is infinite<br>to be ordered to say your piece of the puzzle<br>that is the fathomless mystery <br>that is the universe within us<br>to feel divine love ravage our body<br>and turn every cell inside out<br>to feel your bones ache<br>and know that one day your body will die<br>to know what will be left behind<br>to go beyond the door<br>that is guarded by the image of our self<br>to sacrifice this image so we may be born anew<br>well my friend said he did not know what to do <br>when he came back and had to talk to me and you<br>but he was very humble that friend of mine<br>who had sacrificed his body<br>to witness the mysteries of time<br>just imagine<br>just imagine being a limitless being<br>constantly imaging itself<br>constantly getting to know itself<br>constantly making love to itself<br>constantly suprised<br>and constantly being alarmed by itself<br>constantly enchanted by itself<br>constantly dying and constantly being born<br>constantly mended and constantly torn<br>constantly crying<br>and constantly laughing at us<br>the myriad lifeforms that inhabit it<br>that are it<br>that are its eyes and ears<br>And after all this I hear an angel's astonished shout<br>does it really fucking matter<br>who we think we are<br>does it really fucking matter if the Jones have a bigger car<br>does it really fucking matter <br>if someone beats you up<br>does it really fucking matter<br>if you live in a rubbish bin<br>when such truly timeless beauty<br>can be found within\n\n\n"
}
