{
 "title": "Nasty Experience, Lingering Anxiety",
 "author": "MindForRent9",
 "citation": "   MindForRent9. \"Nasty Experience, Lingering Anxiety: experience with Kratom (ID 73969)\". Erowid.org. Feb 9, 2010. erowid.org/exp/73969",
 "substance": "Kratom",
 "bodyweight": "67 kg",
 "header": [
  [
   "DOSE:",
   "2 g",
   "oral",
   "Kratom",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 73969",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 9, 2010",
   "Views: 16741",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been curious about the effects of Kratom for a while, having seen it turn up in discussions claiming all sorts of uses, from recreational to helping deal with serious opiate addiction withdrawals. It sounded like something worth trying, so I did some reading, and ordered 10 grams (the smallest available) from an internet vendor who I have bought other items from before, and found reliable and a generally good service. They are also active and have a good reputation in an internet community based around kratom which I visited to read advice and information. I was not on any medication or other drugs, legal or otherwise at the time.</p><p>On the day I planned to try it, I had a light breakfast of high fibre breakfast cereals and a few glasses of water, to help with any constipation and dehydration the kratom might cause, and then waited a few hours before taking the kratom, as a precaution- generally, advice seemed to indicate that an empty stomach was a good way to start. My readings had indicated that 2g was probably a fairly good dosage to start off with, so at approximately 11AM I carefully measured out two 1 gram doses of the fine powder, tipped each into my mouth, washing each down with a sweet fizzy drink (some cheap coke) to cover any possible after taste. It wasn't too bad- a bit like eating a mouthful of sherbert or something, a bit dry and powdery, but basically going down easily.</p><p>Within about 20 minutes, I was feeling something, a vague hint of stimulation. I planned to take a third 1g dose after an hour if I hadn't achieved the desired effect from this initial dose, again following recommendations for dosage increments I had found. However, in a further 10 minutes, I realised that I would definitely not be taking any more, because I was starting to feel very uncomfortable with the effects already. My pulse was starting to pick up pace, and I was feeling waves of anxiety, nausea, and dizziness. At points I would tremor uncontrollably, and my heart rate would vary between hammering like crazy and relatively gentle, close to normal. Initially, I tried to make myself throw up, but couldn't, and eventually gave up. I did my best to keep a reasonably level head, trying to keep up a reasonable water intake throughout to counteract dehydration, though the anxious feelings often overwhelmed me. At times I felt a little numbed, a little 'floaty', so it's possible that the 'higher dose' sedative/narcotic effects came into play at points.</p><p>In some ways it was similar to the one time I have experienced having too much caffeine in the body, after underestimating the strength of certain types of coffee- generally the same feelings, but the kratom effects were rather stronger, and a few effects of the kratom don't apply to those of the caffeine and vice-versa.</p><p>The physical effects continued strong until about 1:30 PM, and then started to ease off. By 3 or 4 they were mostly gone, but I remained somewhat worried and anxious, a condition which has continued for about two weeks now, on and off, at the time of writing. I have recently consulted a doctor about this, and been informed that it is most likely some temporary condition, though the doctor was (not surprisingly) unfamiliar with kratom.</p><p>It is possible that the particular kind of kratom I purchased was, in fact, some kind of enhanced strength product, or just that I'm in some way overly sensitive to the effects of kratom and therefore had a bad reaction to it. It's interesting that I have often seen relief from anxiety listed as one of the benefits of kratom, and there are quite a few people who successfully use it for that purpose. I'd recommend caution though, because searching around now I have seen other people saying that kratom caused them anxiety too. I personally will definitely not take kratom again.</p>"
}
