{
 "title": "Through the Night",
 "author": "Jfrankl",
 "citation": "Citation:   Jfrankl. \"Through the Night: experience with DOC (ID 74012)\". Erowid.org. Aug 19, 2011. erowid.org/exp/74012",
 "substance": "DOC",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3 mg",
   "oral",
   "DOC",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 74012",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 19, 2011",
   "Views: 5242",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was my first time taking DOC. It was in a sugar cube which had been kept at slightly cooled temperatures in an airtight container. The cube was supposed to have 3 mg which is considered a strong dose.\r\nT+0  I put the sugar cube in my mouth and let it partially dissolve before swallowing. There is a very faint bitter taste but the sweetness of the sugar overwhelms it. This was right before I got in my car; I felt safe enough after reading other reports that driving would be okay considering it takes ten minutes to get back to my house on a road with next to no one. I got home without feeling the slightest trace of anything.\r\nT+1:30  While watching TV I feel the first indications that the drug is coming on.  My chest feels slightly tight and my eyes are feeling a bit strained. Over the next fifteen minutes Sports Center becomes increasingly funny, but not absurd.  \r\nT+2:00  I walk upstairs and go to the bathroom.It seems like the change of scenery kicks the hallucinogenic properties into gear and the first flickers appear. The millimeter or so bumps on the drywall appear to have a faint orange outline as if they are gleaming in the light. I go through my nighttime rituals of cleaning: brush my teeth, shave, etc. Moving from the bathroom to my room, I enter a dimly lit area for the first time on this trip. The carpet seems redder than it should be and the night sky through my window seems pitch black despite it being nearly a full moon. I relax in my bed, turn off the lights, and turn on my iPod.\r\nI continue to rise until around +5:00 where I peaked. During the peak, which lasted about two hours, strobing lights appeared to be coming at me. The hallucinations were very similar to when I took Bromo-Dragonfly in the topic but not necessarily intensity or form. Both times the heads of my parents were talking to me from across the strobing light about how we were bouncing in and out of reality at the same time.  Semi-solid objects seemed to jump out and race across me before vanishing behind my body. I made the weird interpretation that these looked like frogs made of sponge.\r\nAfter the peak I was simply trying to ride it out.  I listened to both the Division Bell and The Faints Dance Macabre twice.  Although the ending was gentle I felt worn out and tired. I had not slept and as I began to begin the next day I still had subtle hallucinations.  The day after I took the DOC was exhausting and all I wanted to do was sleep, which I did.  By noon (T+16:00) I could not feel any direct effects from the drug. After a decent rest I was back to normal.\n\n\n"
}