{
 "title": "Smoking Kava Kava -- Focused and Relaxed",
 "author": "§ynthetic",
 "citation": "   §ynthetic. \"Smoking Kava Kava -- Focused and Relaxed: experience with Kava Kava (ID 7411)\". Erowid.org. Dec 16, 2001. erowid.org/exp/7411",
 "substance": "Kava Kava",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Kava",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7411",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2001",
   "Views: 33596",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nLast night in desparation for pot (and a lack thereof) I decided that I would try to smoke some Kava Kava.</p><p>I took a capsule of pure kava kava that I bought a a local health store, broke it open, and poured it into a normal tobacco pipe that I fitted with a screen.</p><p>I took two hits and was unable to finish the rest.  The effects were like being stoned, only with much more awareness and a sort of inner peace.  I also experienced mild hallucinations where the folds of my blanket kept turning into small furry animals.  The most amazing part was the complete lack of paranoia.  I felt like everything was at peace and that life was, for some reason, making sense.  </p><p>After enjoying the mild trip for a little while, I began to meditate.  I found this hard to do because everything I looked at was so interesting and vivid.  After about 15 minutes of hard focusing, I went into a sort of trance where I pictured myself floating up above myself.  The imagination was greatly enhanced.  Then about and hour later I returned out of meditation and fell immediately asleep.  For a person who suffers insomnia, this is just short of incredible.  Not even pot would put me to sleep.</p><p>In short, smoking kava kava has made for the most relaxed that I've ever been in my life.  The drug doesn't by any means make me feel happy.  But I found that I was able to focus and feel at peace.  The best part is, for a broke college student, that it's way sheaper then most anything and readily available at the grocery store.  Also, the 'high' lasted a lot longer, granted the euphoria did not.  I woke up this morning feeling completely relaxed and now, almost 10 hours later, I still feel focused and relaxed.</p>"
}
