{
 "title": "Mental Clarity, Focus and Well-Being",
 "author": "Blackyak",
 "citation": "   Blackyak. \"Mental Clarity, Focus and Well-Being: experience with Catha edulis (Khat) (ID 74120)\". Erowid.org. Jan 8, 2010. erowid.org/exp/74120",
 "substance": "Catha edulis (Khat)",
 "bodyweight": "188 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Catha edulis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74120",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 8, 2010",
   "Views: 7668",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been curious about khat for quite some time, having read experiences online and found them to be mostly positive. I thought I would never run into it here though, a prairie city in Canada. I ran into it by chance through one of my classmates, and managed to get a ziploc bag full of dried leaves. </p><p>At first I was rather skeptical, as all experiences relating to khat made it quite clear that the fresh leaves are the only really potent ones but I figured I would give it a shot anyway. I usually spend my saturday mornings at school studying, so I figured that would be the best time to try it out. I got to the library, and started chewing a small mouthful of the leaves. The taste was not unpleasant, similar to a strong tea, though it took some getting used to. I'd recommend having a bottle of water handy when chewing. It took about 10 minutes to chew the leaves fully.  </p><p>I repeated the process, and kept studying. After about an hour of this and feeling no effects, I was pretty disappointed and chalked it up to having dried leaves instead of fresh ones. But, I kept chewing anyway - might as well I figured. Two hours in, and I did not feel 'burned out' or tired from studying as I usually do, and I found it incredibly easy to focus. I became more talkative than usual which led to messaging a bunch of people on my phone. I kept chewing until I had finished studying, the total time had been about 3 hours. Disappointed from the experience I got up and went home. I had consumed about ¼ of the bag at this point. </p><p>On the way to the bus stop is where things started to get a little interesting. I felt very relaxed and happy, the music on my mp3 player became more significant. My mind felt very clear, I felt like I had just got up from a good night's sleep. There was an overall sense of well being and content. I could not keep a train of thought, instead my thoughts were jumping from one to the next seemingly at random and it was easy to just not think at all. I felt like I had just consumed an enormous amount of caffeine, but there was none of the jitteriness or nervousness that usually accompanies it. </p><p>Once I got home, I sat at the computer feeling great. The body high was comparable to the one I get from smoking weed, but there was none of the tiredness associated with it. It was very easy to focus on a single task, and keep doing it. I did some more homework and spent the rest of the time on the internet talking to friends. This lasted for about 4 hours, and the come down was very mild but left me feeling drained. I did not feel hungry at all the entire time, and had to force myself to eat. </p><p>Overall, it was a very enjoyable experience, though next time I will definitely do less. It's a wonderful drug for studying or doing anything else that requires concentration. It is far more enjoyable than having an energy drink or taking caffeine pills. It is a very mild stimulant, though I think it could have been more powerful if I had fresh leaves.</p>"
}
