{
 "title": "Effective But Not Euphoric",
 "author": "techie",
 "citation": "   techie. \"Effective But Not Euphoric: experience with Phenylpiracetam (Carphedon / Phenotropil) (ID 74180)\". Erowid.org. Apr 24, 2010. erowid.org/exp/74180",
 "substance": "Phenylpiracetam (Carphedon / Phenotropil)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "300 mg",
   "oral",
   "Piracetam",
   "(pill / tablet)",
   "  T+ 5:00",
   "300 mg",
   "oral",
   "Piracetam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74180",
   "Male",
   " ",
   "Not Given",
   "Apr 24, 2010",
   "Views: 79830",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I suffer from ADHD, and am prescribed Adderall. Unfortunately, I have a nasty habit of using my month's prescription in a week to enhance my performance at work, and then am stuck without effective medication for the remainder of the month.</p><p>So I have tried a bunch of legal and quasi-legal stims, all with disappointing results (ephedrine, caffeine, 1-3-dimethylamylamine, BZP, etc.) But the other day I found a website selling phenylpiracetam. This is more well known as 'Carphedon' or 'Phenotropil' - an obscure Russian stimulant developed to keep astronauts awake on long missions, and occasionally used in Russia as a prescription nootropic for various types of neurological disease. It became well known a couple years ago when a bunch of athletes got kicked out of the Olympics for using it, leading a nootropic supplier in California to start selling it on the Internet as a supplement.</p><p>Anyways, I was burnt out from having had no Adderall for a week, and the package arrived at my office first thing this morning. The recommended dosage was 100-300mg, up to twice a day. So I took 300mg to start. It was slow to kick in, and crept up gradually (probably about 1.5 hours to reach full effect.) I didn't think it was doing much until I actually decided to do some work. As soon as I started writing code, my mind focused as well as it would on 40mg Adderall, and I got a complex application written by lunchtime (normally, my mind will wander and I will surf the net frequently, procrastinating my code writing, and delaying the project.) </p><p>After lunch, (around 5 hours after the initial dose), I noticed that I was once again tired and unfocused, but not more so than when I had started work - there was absolutely no crash or anything of the sort. So I took another 300mg, which kicked in very quickly, and is still somewhat going for me right now (12 hours after the initial morning dose, 7 hours after the booster.)</p><p>Anyhow, my evaluation: as a performance enhancer / focus aid / ADD med, this stuff is in the top tier, more effective than Ritalin, less effective than Dexedrine or Adderall. However, it does not have any of the mood-boosting happy euphoria of the amphetamines. Though conversation flows great on the stuff, it doesn't give one the urge to run one's mouth off for hours at a time, probably a good thing for a stim that is used at the office.</p><p>Another benefit over conventional stimulants is that for me it has far fewer physical side effects - no jaw clenching, the appetite is normal - though the pulse rate is greatly increased comparable to ephedrine. Apparently the lethal dose is ridiculously high - about 100 GRAMS, suggesting that it has exceptionally low toxicity.</p><p>I have heard from various forums that there is a rapid buildup of tolerance, and that daily use is a waste of material. That is too bad, as it is effective, and doesn't seem to have a tendency to make me want to abuse it, as is the case for me with conventional stimulants. It is also ridiculously expensive. At the 600mg / day level, a $100 supply lasts for 6 days. Apparently the only way to get it at a reasonable price is to walk into a pharmacy in Moscow and buy it with Rubles.</p><p>Oh, I should also note - I gave 200mg to a co-worker who I found asleep at his desk after pulling an all nighter. At that dose, he reported no stimulation, but did note that he felt well focused and well rested, even though he had gotten almost no sleep the night before.</p><p>This is definitely a substance that warrants further evaluation for performance enhancement and ADHD treatment.</p>"
}
