{
 "title": "Recovering From Severe Opiate Addiction",
 "author": "xdefeatsy",
 "citation": "   xdefeatsy. \"Recovering From Severe Opiate Addiction: experience with Buprenorphine & Naloxone (Suboxone) (ID 74216)\". Erowid.org. Jun 26, 2009. erowid.org/exp/74216",
 "substance": "Buprenorphine & Naloxone (Suboxone)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Opiates",
   " ",
   " ",
   "  ",
   "oral",
   "Pharms - Buprenorphine",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Naloxone",
   "(daily)",
   " ",
   "600 mg",
   "oral",
   "Pharms - Quetiapine",
   "(daily)",
   " ",
   "150 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 74216",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 26, 2009",
   "Views: 18307",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been a drug addict for the better part of 5 years. I have gone through the alphabet of chemicals, I think it's fair to say I have tried quite a variety. The last 2 years of my general addiction were the worst. I ended up with a $300-400 a day habit that consisted mostly of oxycontin, heroin, and cocaine. I went from being a recreational user to a full-fledged fiend; dealing, manipulating, and stealing to get what I needed. On top of this, I was also being treated for a mix of Avoidant Personality Disorder and Social Anxiety Disorder. For this I was prescribed 600mg of Seroquel in conjunction with 150mg of Zoloft every day. Eventually life caught up with me and landed me in the emergency room with a lot of explaining to do. The least-painful option for me was inpatient rehab.</p><p>While in rehab I was put on 16mg of Subutex a day for the first 4 days of detox. I was then switched to its cousin, Suboxone (Subutex with the Naloxone craving blocker), as part of a opiate replacement therapy. I started out at 16mg and over the course of a year I stayed clean, reducing my dosage of Suboxone every few months by 4mg; this while maintaining my Seroquel and Zoloft dosages. </p><p>I can say now after finally getting off of it that it was a worthy investment, and I owe the Suboxone program my life. Not only did it kill the withdrawals instantly, but the Naloxone serves as a deterrent to using opiates again because if I use on it I am forced into withdrawals -- and anyone who has been through heroin withdrawal knows that it isn't worth it. It is very comfortable in terms of weening off, I suffered no withdrawal while changing dosages. Maybe a little irritability and headache at the end when I went from 2-to-0mg.</p><p>As someone who has tried to use methadone unsuccessfully in an attempt to ween myself off, I can honestly say that Suboxone was the drug that finally made it possible for me to quit the heroin and the oxy's for over a year now -- and hopefully, for good.</p>"
}
