{
 "title": "An Outrage of Hysterical Laughter",
 "author": "Stoanhart",
 "citation": "   Stoanhart. \"An Outrage of Hysterical Laughter: experience with Nitrous Oxide (ID 7424)\". Erowid.org. Feb 10, 2003. erowid.org/exp/7424",
 "substance": "Nitrous Oxide",
 "bodyweight": "188 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "1999",
   "7424",
   "Male",
   " ",
   "Not Given",
   "Feb 10, 2003",
   "18884",
   " "
  ]
 ],
 "report": "<p>It was my first year of highschool and I had joined the wrestling teem.</p><p>After several practices I realized it wasn't really as fun as it looked but decided to give it one more chance and go to a tournament. We arrived after riding in a cramped schoolbus for 5 hours. After finding a spot on the floor for my sleeping bag (In a school gym), I had a few practice rounds before the tournament would start.</p><p>First round and I was on my back with my knee twisted. My patella had been dislocated. I lay still there on the mat with a crowd around and eventually the paramedics came in.</p><p>I told them it really hurt to move so the brought out the nitrous!</p><p>It was a tank which I was told was 50-50 with Nitrous and Oxygen. I started breathing with a mask over my head. Nothing happened for a while and after seeing people use laughing gas on TV I expected to break into an outrage of hysterical laughter. I was quite disappointed, and when I was about to settle down and accept the idea I wasn't going to get high, it hit me!</p><p>This was actually my first experience with any drug (I have since taken mushroom, canabis, and a very weak form of an attempted Phalaris extraction of DMT. It worked a bit, but was nowhere near the experiences I read.) and I was taken completely by surprise.</p><p>I just started to notice I was getting lightheaded when my image of the world became a blur. I couldn't think straight, and all I can remember is suddenly starting to laugh. I looked around me at the crowd, and saw strange trails being left behind by everything I looked at. It was like those anoying mouse trails you can turn on on your computer. If you have ever seen an attempted recreation of a drug experience on TV, where everything is double imaged and echos, that was my trip. I remember getting enough breath together to mutter 'Everything is echoing!'. This is when the ambulance attendants and the onlookers burst into laughter. It was almost scary. I heard echoing, creepy laughter like a pack of hyenas and my vision was so distorted I couldn't make sense of it all. It should have scared me but it only drove me deeper into a frenzy of laughter. The more I laughed, the more they laughed and the cycle went on and on until I actually had to get my act together enough to pull the mask off of my face and get some air. I thought I was going to die because with all the laughing I never had a chance to take a breath.</p><p>The moment I took my mask off I started calming down. They said the were going to lift me onto the gurney but my knee had already started to hurt again.  So i strapped my mask back on and once again entered the wonderful world of nitrous.</p><p>Being caried to the ambulance was fun also, but nothing compared to the crazy antics of the gymnasium floor. The attendant eventually told me to take the mask off, saying I didn't need any more. He afterwards congradulated me on draining an entire tank.</p><p>After reading about the combination of mushrooms and nitrous, i can guarnatee you, next time i get twisted, i'm bringing along a baloon or two.</p>"
}
