{
 "title": "Observations",
 "author": "Collectively Unconscious",
 "citation": "   Collectively Unconscious. \"Observations: experience with P. harmala (Syrian Rue) & Mushrooms (ID 7427)\". Erowid.org. Jun 14, 2001. erowid.org/exp/7427",
 "substance": "P. harmala (Syrian Rue) & Mushrooms",
 "bodyweight": "165 lb",
 "header": [],
 "footer": [
  [
   "Exp Year: 1996",
   "ID: 7427",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2001",
   "Views: 25325",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I've now tried Rue + high dose Ps. Cub. twice and here are my observations. <br>Unlike straight Ps. Cub., both trips were *very* similar in both what was presented and 'look and feel.' Set and setting seemed to have very little effect. It was as if the pure mental effect was so strong that external stimulii were blown away. To draw from star trek, the ego has been shifted from death to disintegrate and there is a whole new demention to time loss. Recreational potential: 3 to 5 on a scale of 0-10.<br>Fun things to do: <br>Re-experience the big bang.<br>Crawl into and out of complete solipsism learn about such concepts as self and other in a whole new way<br>Talk with God<br>Be God<br>Rebuild your personality from scratch<br>Shift to other universes<br>Create other universes<br>Be other universes<br>Go 'before' and 'after' time<br>Get in touch with really primal experiences and emotions<br>Things which are noticably different than mushrooms alone: there is very little euphoria, the visuals seem to mainly be distortions during the main part of the trip (ie the pretty paterns go away). While overwhelming at times, memory of the events seems to be retained. It lasts 10+ hours. It has a less friendly 'feel' or as a friend says 'it is more 'shamanistic.'' <br>A guide and a place where yelling 'aha!' at the top of your lungs is ok, seem to be really good ideas for me atleast :) It also seems to have a pretty heavy body load.<br>Remember: treat the body you see as if it were your own.\n\n\n"
}
