{
 "title": "Harmala Combinations",
 "author": "Toad",
 "citation": "Citation:   Toad. \"Harmala Combinations: experience with P. harmala (Syrian Rue) (ID 7429)\". Erowid.org. Jun 14, 2001. erowid.org/exp/7429",
 "substance": "P. harmala (Syrian Rue)",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 7429",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2001",
   "Views: 23935",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nOne would hope that readers are familiar with the cautionary requirements of dicking around with ones MOAI's in combination with centrally active compounds.\r\nI've had my share of scare's... pumping veins and all. Personally I havn't found very many aplications for the betacarbolines that I continue to use aside from the traditional oral tryptamine (dmt, 5meo, dpt) huasca activation.  The one harmala combination that I have yet to try and would like too is mescaline. This combo makes sense, since a large amount of mescaline is usually required and it has been fairly widely reported as being a positive potentiation.  Combinations with mdma and other stimulating compounds seem quite ludicrous to me.\r\nThe obscure rue combinations known to me are: \r\nwith shrums: defintitely intense on the body at high dosage levels, qualitatively different trip.\r\nwith 2cb: heard several negative reports, too much physical activation/headache\r\nwith mescaline: many positives, a few neggies\r\nwith LSD: several positive reports.  provides a more earthy grounded feeling.\r\nwith DPT: works well huasca style, be very careful with the dosage. Comments from a friend: 'Instead of 100-200 mg oral only 30-80 are needed.\r\nAlso the oral DPT bodyload was greatly reduced.'\r\nwith 5meODMT: increases effects, some report worrisome physical symptoms\r\nwith Psilocybin: Many people report positive work with this, but can increase darkside and increase length, intensity, bodyload\n\n\n"
}