{
 "title": "Weird Numbness, Good for Opiate Withdrawal",
 "author": "Opiholic",
 "citation": " Opiholic. \"Weird Numbness, Good for Opiate Withdrawal: experience with Pregabalin (ID 74332)\". Erowid.org. Dec 5, 2012. erowid.org/exp/74332",
 "substance": "Pregabalin",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Pharms - Pregabalin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "74332",
   "Male",
   "",
   "Not Given",
   "Dec 5, 2012",
   "8085",
   " "
  ]
 ],
 "report": "<p>I have carefully experimented with pregabalin (U.S. trade name: Lyrica) over a few sessions, and I found that a higher dose is more difficult to tolerate initially.</p><p>My other-half took Lyrica for peripheral neuropathy, and he claimed that it did NOT work very well for his leg pain; however, he always said that he was 'high' when he took this drug. He always describes any psychoactive experience, rather positive or negative, simply as 'high' without any further subjective explanation, so I decided to find out for myself exactly what he meant.</p><p>The first few times I tried Lyrica, I could not exactly describe the feeling. It did indeed have some relatively potent psychoactive properties, but not exactly euphoria as a few anecdotal reports have described. Let's just suffice to say that Lyrica is not equivalent to opioid painkillers as far as psychoactive properties are concerned.</p><p>I started with a dose of 75 mg on my first few tries, and I felt my sense of touch become slightly dull. My lips were slightly warm and numb, but I could still feel them. Swallowing felt slightly dull in the throat as well.</p><p>Over time, I have worked my way up to a dose of 200 mg, and I must say that the numbing effect gets stronger with dosage increase. Currently, on a 200 mg dose, my face feels somewhat warm and pain-free, all my movements feel less exaggerated, my overall sense of touch is quite dull. I still have a sense of touch, however; I can still feel anything that happens to touch my skin, but my overall senses seem slightly dull. This is the best way I can describe it. I feel a slight stimulant effect and a desire to generally stay active, however, I know that if I lie down, then I will sleep very well and very deeply; I have slept on Lyrica during previous experiences, and the sleep is quite deep and comfortable. Upon waking, however, the side effects tend to be more pronounced for me. This is one drug that does not like to subside very quickly.</p><p>I am currently addicted to opiate painkillers, namely hydrocodone or morphine, whichever one I can obtain. When I go through withdrawals from these opiates, I experience severe leg pain, a burning pain in my upper back that extends to my shoulders and arms, and I also experience diarrhea, malaise, and anxiety. A good dose of Lyrica, between 100 and 200 mg, will actually stop all of the withdrawal pain that I feel, and I will become much more comfortable throughout the withdrawal process. One (200 mg) dose of Lyrica lasts anywhere from 12 to 48 hours for opiate withdrawal pains, in my own experience. I have experienced profound variations in duration and/or intensity of the effects of Lyrica, even at a constant dose of 200 mg. I assume that I am becoming more tolerant to some of the side effects.</p><p>I typically will only take one or two doses of Lyrica within a week, as I do not want to become addicted to this drug. The withdrawal from an anticonvulsant can be much more dangerous than the withdrawal from a few Lortabs.</p><p>It should be noted that the initial dose that a doctor would typically use for neuropathic pain, seizures, or anxiety is 75 mg. A titration period up to an optimal dose is crucial in order to tolerate the 'CNS numbing' effect. </p><p>Overall, I find that Lyrica works well for diarrhea, anxiety, withdrawal pain, insomnia, loss of appetite, and other symptoms of minor opiate/opioid withdrawal. I would not recommend taking Lyrica for just one of these symptoms unless a doctor prescribes the drug for that symptom. Actually, I do not recommend taking ANY pharmaceutical drug that is not PRESCRIBED. The individual assumes any responsibility for committing an illegal act such as consuming a medication that is not prescribed to that individual.</p><p>Lyrica can produce some side effects that may be undesirable to some people; weight gain and edema (swelling) have been often reported during clinical trials. Others have experienced loss of coordination and other CNS side effects. Also, allergic reactions are not uncommon. I will summarize this experience report by saying that Lyrica works very well FOR ME when I wish to alleviate opiate/opioid withdrawal symptoms and cravings, and I will now refer the reader to the official Lyrica website where he or she can find more professionally documented information on this peculiar, yet oddly effective drug.</p>"
}
