{
 "title": "The LSD Hangover Lasts Years",
 "author": "Sane again at last",
 "citation": " Sane again at last. \"The LSD Hangover Lasts Years: experience with LSD (ID 7440)\". Erowid.org. Mar 9, 2003. erowid.org/exp/7440",
 "substance": "LSD",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "200 ug",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1991",
   "7440",
   "Male",
   "",
   "Not Given",
   "Mar 9, 2003",
   "14933",
   " "
  ]
 ],
 "report": "<p>I took acid 15 times in 2 years in the early 1990s and found it an amazing experience, and like all new experiences, modified my view of the world. For me, the new experiences stopped after 3 trips and the remainder were a waste of time.</p><p>Unfortunately I had a number of side effects that I attribute to LSD. these were:</p><p>Depersonlisation (duration 1-2 week after trip) - sometimes after taking strong (200ug+) acid I would loose all sense of my self - as if I was a robot/non human. </p><p>Recurring Pulsing light (in between trips) - Regularly during sleep or drowsing I would feel all woozy and then experience a painful rapid white pulsing light in my head, blocking out all thoughts, followed by murky near vision hallucinations of geometric shapes that were exactly the same as the visuals I experienced on acid. Curiously after this I would feel at complete peace -serene-as if my head had been 'flushed' of all problems. This stopped immediately after stopping acid.</p><p>Associations/Rationalising - Perhaps the most serious side effect, lasting a number of years(3-5) after final use, was that I was my ability to rationalise in everyday life was seriously hampered. I was making wrong connections/associations - for example I believed my 'fate' was geared around the number '67' which related to (amongst other things) the number of letters in a poet's name whose poems 'spoke' to me, addresses of houses, names of girlfriends (the list goes on...)</p><p>To conclude, what an experience! but I wouldn't take it more than a few times if I had my time again.</p>"
}
