{
 "title": "Bromo Spazmfly",
 "author": "Just A. Guy",
 "citation": "   Just A. Guy. \"Bromo Spazmfly: experience with Bromo-Dragonfly (ID 74496)\". Erowid.org. Oct 31, 2008. erowid.org/exp/74496",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "Bromo-Dragonfly"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74496",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 31, 2008",
   "Views: 13493",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nBought two hits of Bromo-dragonfly from a very reliable source, I always trust this guy. Each hit consists of three drops of solution in a sugar cube and is estimated to be 250ug.</p><p>My friend and I eat one sugar cube each at 6pm and prepare for the long come up. I lie in bed listening to Shpongle and reading Huxleys doors of perception. One hour in I cant concentrate on reading anymore and a slightly irritation come up feeling creeps in for the next hour, feels much the same as many other come ups but extended.</p><p>Two hours in I can definitely feel something. My sense of touch is feeling pretty nifty and looking at art online is enjoyable and emotive although not anywhere close to the way this felt on a 2C-E 2C-B combination I once tried.</p><p>Over the next hour ego begins to soften and I enjoy some throat sweets whilst listening to music and chilling in bed. So far I like this.</p><p>At this point Id like to address the comparison that has been made between this and LSD. Some say the bromo feels like a milder but extended acid trip. Though I only have one experience with each to compare I would say that the similarity between the two is  very small. Though my thoughts did become quite trippy at times the feeling is closer to 2C in my opinion. Through this trip visuals were almost non existent whereas on LSD visuals were very obvious. I would also say that the bromo has a distinctly chemical feeling to the high comparible to 2Cs and LSD but somehow different. In my opinion the feeling of a plant based high is by far preferable. Mushrooms are by far my favorite drug.</p><p>My friend is also feeling distinctly high and joins me for some conversation which is frequently funnier than it ought to be. At this point I am beginning to get twitches in my left leg. I can put up with it though.</p><p>After about an hour or so we move upstairs for the duration of the trip. More silly conversation ensues and I begin to twitch harder and more frequently. Another friend joins us and a joint is smoked. The twitching continues to increase in intensity. My friend says she has some pretty good visuals, since I only have twitching this we decide means that she is winning at bromo-dragonfly.</p><p>At about 1am my friend and I are alone again. I cant stop twitching and my friend now has a pounding headache. This was the worst section of the trip and totaled aroung an hour of extreme discomfort for both of us. Cold flannels and one of the worst joints I have ever rolled fail to alleviate the pain. Eventually nerofen (Ibuprofen) solves the problem but we had steered clear of it for a while since we werent sure whether there could be any bad interactions.</p><p>The next section of time is spent watching some Mr.Ben which is frequently hilarious, its essentially a barely animated childrens cartoon about a middle class man who visits a costume shop owned by a man who looks like a Moroccan hash dealer and is transported into other worlds by putting on the costumes in the shop.</p><p>Next we watch a modernized version of Romeo and Juliet which is very good.</p><p>Im starting to twitch less but its still pretty bad.</p><p>We both feel pretty tired after the film, it must be about 4am by now. An attempt at sleep is made which predictably fails. My mind is kicking out all sorts of nonsense which is pretty typical when trying sleep in this kind of state. Still twitching like a motherfucker.</p><p>The period of around 5am to 10:30am is one of the best during the trip. Feeling very mellow and the twitching has dropped to a new low, its almost funny now.</p><p>Which brings us to about now: 12pm. Had a shower, put on some daytime clothes and wrote this report. As far as I can tell the twitching has completely stopped. Not that I feel like trying now but I would expect that I wont be able to get any sleep for at least 4 hours. I feel hungry but dont want to eat.</p><p>So my overall view on bromo-dragonfly: </p><p>The peak section felt very good but by no means better than shrooms or cactus. </p><p>The most pronounced effects for the majority of the trip were mild to severe twitching and inability to sleep.</p><p>The visuals I got were wholly uninspiring, my friend reports fairly decent visuals but again nothing special.</p><p>There was a definite mood lift but nothing particularly amazing past the 5 hour mark (bare in mind that the come up accounts for around 2-3 hours of this).</p><p>24 hours is a long time for a drug to act for. A nights sleep will be lost.</p><p>Overall I enjoyed it however I had to enjoy it in spite of the horrible twitching.</p><p>For me this drug doesnt bring enough to the table to make it worth taking over cactus which is easily available (though hellish to ingest) and of course shrooms.</p><p>If youre curious you might want to try this but to be honest I wouldnt recommend it over other less rare drugs.</p>"
}
