{
 "title": "12 Miles Later, 350 Caps In Hand",
 "author": "Dinge",
 "citation": "   Dinge. \"12 Miles Later, 350 Caps In Hand: experience with Mushrooms - P. Semilanceata (ID 7449)\". Erowid.org. Jun 6, 2003. erowid.org/exp/7449",
 "substance": "Mushrooms - P. Semilanceata",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "80 caps",
   "oral",
   "Mushrooms - P. semilanceata",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2000",
   "7449",
   "Male",
   " ",
   "Not Given",
   "Jun 6, 2003",
   "6112",
   " "
  ]
 ],
 "report": "<p>After spending a day walking around on Dartmoor for a calculated 12 miles we ended up with a bag of liberty caps and a large carrier bag of fly agaric (about a kilo). The walk was most terrible but advised if you enjoy what I have to say.</p><p>Later on that day (at my house) the mushrooms were counted out and the fly agaric shared between us. we had 350 liberty caps in total and a fair few large fly agaric caps each. The Liberty caps were all brewed up, and my fly agaric cut up and drying on a few plates. </p><p>We shared most of the brew out between the three of us (worked out to be 80 caps each) and drank, which tasted fine with a couple of tea bags and a lot of sugar. We didn't no how long it would take to start having effect but we started to feel quite different about ten minutes after we had drunk the brew, nothing intense at all but just a slight strangeness. My father then gave us a lift over to Ollie's house where we would spend our unconscious state.</p><p>The next set of events I am telling you to the best of my ability, I cannot remember what happened exactly but I will try my best to describe the nights proceedings.</p><p>We were all getting quite silly in the car, laughing a little but all trying to let the mushrooms take control of us and not just trying to play up on the fact that we were poisoned, all slightly worrying if we had taken enough and if we were going to be that out of it. Our paranoia soon came to end as soon as a foot was stepped out of the car. A slight breeze against our intoxicated cheeks, floating towards his front door as if we had just been dropped off on some weightless paradise. Colours so intense, even though it had been dark outside for a few hours. Walls of nearby houses were morphing between different shades of pink and purple, all of us in complete and utter harmony with each other and our surroundings. </p><p>We knocked on his door but no one was in, so proceeded around the side to his back garden, as if we had just found the portal to the secret garden. The grass looking so plush and fantastic, changing from green to purple, the three of us talking to each other in amazement of what we were witnessing in front of us, totally loving the surroundings, all with a smile reaching from one ear to the other planted on our faces. Ollie came up through the back gate with a few more friends just coming back from scoring some ganja. We proceeded into his house and up to his room where the bongs started getting passed around.</p><p>Everyone else there had dropped pills, which did put the three of us on a strange level with them, but we put up with it anyway it was not too bad but if you are going to do mushrooms it is advised to be in a place where you are just with people that are intoxicated on the same mushrooms as well.</p><p>The real hallucinating started in his room after sitting in three rounds of large bongs. Just as weed enhances the hallucinations if you are on ecstacy, the same and even worse I think happens with mushrooms. Also I clearly remember Tim rolling bloody nice joint and wondering how the hell he could do that in his state. I was seeing geometrical patterns of different colours. The strange thing though was that these patterns were morphing from one thing into another depending on what environment I was in. The shapes would change size and position and colour. If I went outside the setting that before was euphoric now seemed dark and depressing, the shapes would morph into something that represented evil, due to the dark setting. A sort of Picasso cubist style, horned beast was in front of me, laughing the most terrible laugh ever, then that would change into lots of smaller ones in a lattice formation within my imagination, still constantly laughing. This shit was freaking me out and I was getting scared, I definitely had to get back inside.</p><p>Time seemed very distorted and what was 3 or so hours seemed to take a whole day to pass by. I had heard about people tripping on fly agaric for days, and still not coming out of it totally for years. I didn't know if this was true when I heard it but when I was on liberty caps, I honestly didn't think that after hallucinating so much I would ever come out of my state. This made me extremely petrified and I actually remember quoting to Tim and Pete 'I don't think I am ever gonna stop tripping' This was near the end of the night when things started to get dodgy and at one point found myself being sick down the toilet thinking I was going to die.</p><p>We decided to walk home after that I think due to the people around us and the ganja that we were smoking we all started to sketch out a little, and sure enough all of a sudden I was nearly completely back to normal having to suffer the hour long walk home, but knowing that the mushrooms I had taken and stimulated parts of my brain that I had never used before, a totally mind expanding experience. I cannot wait to feel the same again, this time knowing that it will come to an end, and probably a little less ganja for me I think. It's a long way to mushy season but I cannot wait.</p><p>A quick word about the fly agaric. When they were dry I ate them with another mate; Ben. We had about 10g between us and didn't feel a thing, still I'm very weary of there powers, and I dont think I'll take them again, just in case.</p>"
}
