{
 "title": "Brain Damage?",
 "author": "DJ Walz",
 "citation": "   DJ Walz. \"Brain Damage?: experience with Piperazines & Quetiapine (Seroquel) (ID 74516)\". Erowid.org. Jun 15, 2009. erowid.org/exp/74516",
 "substance": "Piperazines & Quetiapine (Seroquel)",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 tablets",
   "oral",
   "Piperazines",
   " ",
   "  T+ 2:00",
   "25 mg",
   "oral",
   "Pharms - Quetiapine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74516",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 15, 2009",
   "Views: 12191",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Although seroquel is used to treat schizophrenia it had a reverse effect on me and I believe I now have schizophrenia from mixing these two drugs. I bought a few piperazine blend pills off of a legal highs website after reading that they gave cool visuals and were fun. I was excited to try this and was in a really positive mindset. 2 hours after consumption I did not feel much more then a buzz. I wanted to get fucked up and my friend had some 25mg seroquel (which I have never done before) and just popped one. This sent me into a night of undescribable pain and anguish. I drifted in and out of consciousness all night and felt unimaginably disconnected from everything that was going on (even my own thoughts) my breathing was slowed down to an extremely low level and the whole night I felt like if I fell asleep I would go into a coma. I really wanted to call an ambulance, but my friends encouraged me not to, I now realized this was a horrible mistake because I might have been able to stop the permanent brain damage. </p><p>I now live my life completely schizophrenic all the time. I always hear voices and have random hallucinations all the time, I feel like I am going to die just from the mental distress I am having about all of these effects. I decided to write this to give people a warning about this mix, DO NOT EVER MIX SEROQUEL AND PIPERAZINES. You could possibly end up permanently brain damaged like I have. Piperazines suck anyway.</p>"
}
