{
 "title": "Relatively Pleasant",
 "author": "Ras",
 "citation": "   Ras. \"Relatively Pleasant: experience with Ether (ID 74524)\". Erowid.org. Jan 12, 2010. erowid.org/exp/74524",
 "substance": "Ether",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "125 ml",
   "inhaled",
   "Ether",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2008",
   "74524",
   "Male",
   " ",
   "Not Given",
   "Jan 12, 2010",
   "Views: 6319",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I procured diethyl ether from 4 L bottle from a chemical company.  The ether contained no additives besides BHT, which is added to prevent formation of explosive peroxides.  At first, I placed the ether into a glass beaker and tried to inhale.  I felt a rush, but a very minor one.  Next, poured some ether into a latex glove, and cupped the glove around my mouth and inhaled/exhaled for a few cycles.  This gave a much larger rush.  The ether has a relatively fast time of onset as compared to other standard recreational drugs.  After some more experimentation, I came up with the following arrangement.</p><p>Soak a few cottonballs in ether and place them into a plastic bag, and carefully inhale/exhale as much as desired.  I used this arrangement for two reasons.  One, the cottonballs soak up the ether and act as a meter, preventing me from doing a dangerously high amount at once.  Additionally, it is convenient and clean.  At the time that I wrote this, I inhaled 100 to 150 mL of ether using this cottonball method.  Ether is very volatile, so 100 mL is not as much as it would seem.  Still, it was enough to produce an intense sense of euphoria.    </p><p>The experience itself is very intense.  Due to fast onset, the high is achieved almost immediately.  The downside is that it wears off pretty fast.  I felt as if I was disconnected from my mind, and that I was traveling within my mind.  As more ether hit my system, my eyes started to flutter.  The best part of the experience is that I come out of it feeling as if I understand the world better than anyone else does.  In some ways, the high is somewhat like being intoxicated with alcohol.</p><p>My usage of ether was relatively pleasant; in fact, I was fortunate enough to not even experience any nausea.</p>"
}
