{
 "title": "Herbal Pills",
 "author": "DD",
 "citation": "   DD. \"Herbal Pills: experience with Ephedra sinica (ID 7453)\". Erowid.org. Jun 6, 2003. erowid.org/exp/7453",
 "substance": "Ephedra sinica",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "2 capsls",
   "oral",
   "Ephedra sinica",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7453",
   "Female",
   " ",
   "Not Given",
   "Jun 6, 2003",
   "20002",
   " "
  ]
 ],
 "report": "<p>One night, a couple of my friends and I went to my friend's party. There, I saw an old friend of mine who looked like she was on some major drugs because her hands were shaking really bad and she just didn't look too good. So I asked her what she was on and she told me 'speed' as she laughed and then she said, 'No, really I'm on some dietary supplement called 'Yellow Jackets'' I was really surprised and she took me and a couple of my friends to go get some. So I took 2 of the striped pills and my other friends took 3.</p><p>So we went to shoot pool at the pool hall as we were waiting for the pills to kick in. For an hour nothing happened and I kept saying that these pills weren't going to work. Then all of a sudden as I was waiting for my turn to shoot, I had a crazy hot flash, began to sweat a little though it was cold out and I felt a little dizzy. I ignored this sensation and went for my turn. As I was aiming to shoot the ball, my hands starting trembling and I couldn't concentrate. So I asked my friends if they were feeling it yet and they said that they were feeling real hyper, but that was about it. At that we decided to go driving around.</p><p>As we were driving for a long period of time I felt strange and everything looked a little fuzzy. All I wanted to do was stay in one position and not move. My jaw was jittering a little so I had to chew some gum. Then I began to move my hand up and down in front of my face and I could tell that my eye coordination was quite a bit off. I had slight sexual urges, but not enough for me to actually do something about. My skin felt a little tingly too. About 30 minutes later I began to feel as if I needed to throw up(this may have been b/c i get car sick sometimes and the pills intensified that sickness) and my eyes began to get droopy, though i was wide awake.</p><p>Later when we got back home me and my friends tried to go to sleep, but we couldn't. All we could do is lay still, keep our eyes shut and think. None of us really felt like talking though we wanted to. None of us slept at all that night and continued not to sleep right for about 3 days (though we got more sleep the following nights). It also effected my short term memory the days after because a few times I forgot little things. For example, one day later at school I was trying to find my keys to go home, but I didn't see them at first so I began to panic because I could NOT remember how in the world I got to school that day! Then I found my keys and realized that I must have drove to school even though I still couldn't exactly remember.</p><p>Pretty freaky pills, but not really worth doing all the time. I'd rather just smoke weed or something.</p>"
}
