{
 "title": "HPPD and Me",
 "author": "Sam",
 "citation": "   Sam. \"HPPD and Me: experience with Various (ID 74571)\". Erowid.org. Oct 21, 2008. erowid.org/exp/74571",
 "substance": "Various",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "20022009",
   "ID: 74571",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 21, 2008",
   "Views: 9706",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Over the years I have used a variety of psychedelics, namely mushrooms, LSD, San Pedro, as well as DMT in a variety of forms, and a spattering of others, with cannabis featuring more regularly until recently.</p><p>HPPD is real. Ive never had what I would call a flashback, although on returning from the Peruvian Amazon, one night I woke up to find myself in an ayahuasca visionary trance for a few seconds. My experience of HPPD is really quite a subtle one; it doesnt cause me any distress and doesnt interfere with my life in any way. Sometimes I may say faint fractal patterns on things like the carpet or cloths for example, but these are very subtle. Against a backdrop of white, or looking at rippling water, I may notice a few subtle colours now and again. When Im on the train looking out with trees going past me, or on the road with street lamps acting as strobes with my eyes shut, I start to see fractal patterns. When its dark, I will often see little coloured pixels moving, or shimering slighlty. Looking into a fire also brings out these fractals. Cannabis definitely seems more psychedelic these days. Sometimes I may get tracers.</p><p>Thats about it really though. Nature seems more beautiful than ever, with sunrises and sunsets being particularly spectacular (mescaline sunsets). Clouds are an amazing canvas for the imagination; I have a newfound appreciation for them. Music has the ability to enrapture me on a new level. And, I do daydream a lot, but to be honest Ive always done that. So I cant really say anything negative about it. In fact, its very subtle, low level quality serves as a reminder of past experiences, and I would say my perspective on the world is actually an improvement on what it used to be.</p>"
}
