{
 "title": "3 Weeks of Afterglow?",
 "author": "Monest",
 "citation": "   Monest. \"3 Weeks of Afterglow?: experience with DXM (ID 74597)\". Erowid.org. Oct 30, 2008. erowid.org/exp/74597",
 "substance": "DXM",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74597",
   "Male",
   " ",
   "Not Given",
   "Oct 30, 2008",
   "Views: 10568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am 23 years old and most of the way through a bachelors in biology.  I used DXM and pot regularly when I first graduated high school, but never really got into other drugs.  I went to rehab 3 years ago and cleaned my act up.  I had been sober for almost 3 years and for some odd reason I wanted to give it another try. </p><p>For whatever reason, the bottle of Nyquill on top of the fridge called my name, and I ended up taking a healthy 2 doses.  Within minutes I started feeling a little buzz, but also sleepy.  In efforts to counteract this, I reached for the Dayquil liquid gels, which have 30mg DXM each and ate 6 of them.  A few minutes later, I found myself driving to the store to buy even more.  I would up with another bottle of Nyquil and a pack of Robo cough gels.  In the parking lot I downed half the bottle of Nyquil and ate 14 cough gels (15mg DXM each). I threw the rest away then so I wouldnt eat them later.  </p><p>The trip that I had is not the focus of this post and I will not go into details.  Of the 200+ times I have taken DXM, it did not stand out in any way, it was not especially strong or different from any of my past experiences, except for in one way.  I woke up the next day and I was still messed up.  It lasted all day.  I went to sleep again, same thing the next day.  I was definitely not still full out tripping, but I felt a light buzz like I get from around 100mg DXM, along with feeling very out of it and having a slight headache.  A week of this went on, absolutely no change. 2 weeks, same thing!</p><p>Now I am writing this article, it is the 22nd, I took the DXM on the 5th of this month, and I still feel exactly the same.  Im screwing up in school because I cant concentrate or interpret information correctly.  I would do anything now just to be sober.  If things dont change soon Im going to have to go see a doctor, but I am extremely scared.  I dont know if I have done permanent brain damage or what, but almost 3 weeks after the fact I am wondering if I will ever come down. </p><p>I have looked all over the internet and cannot find anyone else who has had a similar experience.  I dont know the purpose of me writing this.  I guess I am scared and looking for help, because I truely do not know what to do. I am also wanting to warn people out there.  I always thought DXM was relatively safe.</p>"
}
