{
 "title": "Paradoxical Reaction",
 "author": "Monsieur Donkey Show",
 "citation": "   Monsieur Donkey Show. \"Paradoxical Reaction: experience with Amphetamines (Dextroamphetamine) (ID 7461)\". Erowid.org. Jun 3, 2003. erowid.org/exp/7461",
 "substance": "Amphetamines (Dextroamphetamine)",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "5.0 mg",
   "oral",
   "Amphetamines",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "1999",
   "7461",
   "Male",
   " ",
   "Not Given",
   "Jun 3, 2003",
   "18762",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was prescribed dextroamphetamine by my doctor so as to improve my often grumpy mood, and perhaps to help me lose weight.  The first time I took it was in 1999, at the age of 15.  The first time I took it, I was rendered completely unable to do anything but feel like crap within 15 minutes.  I felt terribly sleepy, naseous, irritable, and otherwise bad.  I lied down on my kitchen floor, and noticed that our oriental rug had begun to emit green flashes of light.  Ok, I don't care for this.  I felt better within a few hours, and I didn't take it again until about a year later.</p><p>At this time I was beggining several college classes, and I had also decided to try and lose some weight.  I took one of the pills in the morning, and within 15 minutes, rather than feeling like complete garbage, I got a sensation very similar to hydrocodone.  The same could be said for my afternoon dose, and both of the doses for the next day.  After that, this pleasant (but inconvenient) feeling stopped when I took it.  It still has a somewhate sedative effect by itself on me, but it STRONGLY potentiates the effects of caffeine.  It never did have much of an anorectic effect.  On several occasions I have accidentally taken two pills, after having forgotten about taking the first one.  This feels indistinguishable to me from hydrocodone, but it is quite inconvenient, as I usually have things to do in the morning.  I have never taken two at a time on purpose, for an (unreasonable?) fear of addiction, and the fact that I don't really like being sleepy.</p><p>I have stopped taking dextroamphetamine several times, mostly just because I don't like taking pills.  I feel fine, but my friends and family keep telling me that I'm a total sourpuss when I do this.  They then proceed to bitch and moan until I resume taking it.</p><p>I'm a complete freak for having one of the most pharmocologically active stimulants in the world make me sleepy, so don't expect similar results.</p>"
}
