{
 "title": "GHB: Proceed Carefully",
 "author": "rgentry",
 "citation": "   rgentry. \"GHB: Proceed Carefully: experience with GBL & GHB (ID 7462)\". Erowid.org. Jun 9, 2003. erowid.org/exp/7462",
 "substance": "GBL & GHB",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "  repeated",
   "oral",
   "GBL",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7462",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 9, 2003",
   "Views: 21132",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nTo the GHB community:  </p><p>I first began using GHB about a year and a half ago. My experiences have substantiated the claims made by all it's proponents. Nonetheless, there are two points of order I'd like to submit to the GHB intelligentsia. </p><p>First, every site I checked prior to beginning a relationship with GHB stated categorically that GHB and it's analogues are non-addictive. Wrong. GHB makes you feel good and any substance that brings relief from pain--whether physical, emotional or psychic can be abused. If you give a rat a choice between two levers-one that dispenses food, the other that dispenses anything that acts on the pleasure centers of his brain, guess which one Mr. R. will choose. And to state - as many have - that GHB is not addictive in the 'classical' sense, is just semantic quibbling. The dopamine rebound that occurs after long usage is equivalent to withdrawal symptoms associated with other, more dangerous narcotics. </p><p>I recently spent 3 hellish days leaving 'GHB time' for 'real time'. I didn't sleep a wink and felt like I had these Dali 'crutches' between my eyelids. I was even afraid to close my eyes. Time stopped. I would lay in bed for what felt like hours only to look at the clock and note that 7 minutes had passed. Excrutiating stuff indeed. The next 3 days were better, at least I was more or less functional and could eat food and doze off for short periods, but it's taken nearly a month to get back into a regular sleeping cycle. </p><p>Second, it has been universally suggested that one's ideal dosage level will not increase over time. My dosage began to increase exponentially during the last 6 months of usage. I went from GHB to the twice as potent GBL and used the same amount within a month or so as when I was on GHB. I also began to use it twice as frequently as before to keep the dopamine rebound at bay, so that by the time I quit i was ingesting 6-8 grams of GBL 8-10 times daily. If you are at all possessed of an 'addictive personality', you may want to steer clear of GHB and it's analogues. </p><p>Finally, please remember that this is a federally scheduled substance and that there are severe penalties attached to possession and/or distribution of this substance. In fact, the only way I was able to quit using GHB was because I was in jail due to a shipment I received through the mail. Since this is a relatively new and unknown substance and because of the 'date-rape' stigma attached to it, apprehension is high and penalties are stiff. Please be careful.</p>"
}
