{
 "title": "Dancing with Death",
 "author": "V",
 "citation": "   V. \"Dancing with Death: experience with Cannabis (ID 7466)\". Erowid.org. Apr 17, 2003. erowid.org/exp/7466",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7466",
   "Male",
   " ",
   "Not Given",
   "Apr 17, 2003",
   "Views: 7283",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First I'd like to say that I've never told anyone this before because it is a little weird. Before this experience I am writing about I had toked like 5 times before, nothing major I felt 'high' and happy, but nothing prepared me for what happened this time. </p><p>I was at a party where I didn't really know anyone. My only friend there had passed out so I was just chilling there and talking to some of people there. There were about 12 people at the party and this one kid takes out a huge bong. Now I had never smoked out of a bong before so this would be my first time. So I'm sitting on the couch and he offers me a hit. I quickly oblige and we pass the bong back and forth while conversing and I took around 6-7 hits and this was a huge bong. </p><p>At first I started getting that floaty feeling I get when the effects start to come on, but then it hit me like a brick wall. I was sitting there watching the tube (which was off BTW) and all of a sudden I felt way different from the usual high. I felt like I was dying. I kept saying to myself, 'this is how it feels like to die.' My brain was going at one frame a second. It was like the breath I was taking in this moment was my last, and all my brain could comprehend was the NOW. I had no memory of what happened a second before and could not comprehend what was about to happen in a second. All I knew was that this 'nowness' was what it felt like to be dead. It felt like where I was now was my eternal resting spot. Amazingly I kept physically calm, it was very scary, but physically comforting at the same time. </p><p>In my head though I was fuckin freaking out and frantically calling out to God saying 'I don't want to die yet! God please help! Please help me I'll make better with my life!!' and here is why I've never told anyone this before. He talked back. Yeah I'm talking about God. He just kept saying to me 'This too shall pass, this too shall pass....' over and over again. Call me a looney if you want, but that's what happened. At the time I was a hardcore atheist too so don't think I'm some kind of biblethumper. </p><p>All I have to say is that it was a humbling experience. I couldn't think the same way again since that faithful night. I have not 'converted' to any religion in any sense, but I now know that there is a higher power out there. Seriously it scared the shit out of me, I was never that scared in my life. </p><p>Peace...</p><p>-V</p>"
}
