{
 "title": "The Fractalizing Moon and 15,000 Universes",
 "author": "Savage Henry",
 "citation": "   Savage Henry. \"The Fractalizing Moon and 15,000 Universes: experience with Mushrooms - P. cubensis & Cannabis (ID 74734)\". Erowid.org. Aug 22, 2009. erowid.org/exp/74734",
 "substance": "Mushrooms - P. cubensis & Cannabis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)",
   "  T+ 0:45",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74734",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 22, 2009",
   "Views: 2403",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I will start by summing up the Friday that we did this: boring. Same old bullshit at school, and the norm. I had plans to go to a little Halloween haunted house thing at Busch Gardens, but that became a bust. So my buddy, C (who I was supposed to go with), said he could get some shrooms. I had never done them before, and he had a rather unsatisfyingly intense trip a few months prior. He said just come over with what ever you want and we'll trip.</p><p>It was already 7:00 PM, and being the anxious person I always am, I started packing my bags with some stuff. I packed some extra clothes, my sketchbook and several drawing utensils, my iPod, and the album art for Tool's 10,000 Days (which is a trippy 3D glasses thing). I was hanging out with my friend D, most of the day after school. I asked him if he wanted to do some - he declined as he needed to be home by 11 o'clock, and take his SATs the following morning. He said he would drive me to C's place and maybe chill for a bit and smoke some weed. That sounded okay, so we grabbed some McDonald's, which was the only thing I had eaten all day - and for the rest of the night. </p><p>We drove around C's neighborhood for some time waiting for him to arrive with the shrooms. I had asked for him to pick me up 1.75g, or a half-track, instead he could only get a full 3.5g. Which was fine, I had extra money to pay him back. When he got there he said we had to wait a couple of hours for his folks to fall asleep. So while we waited we smoked a little bit, played hacky sack, jammed out via drums and guitar (whilst his parents were out at dinner), and just prepared mentally for the night's event. I was in a strange state of mind. I felt like what I was doing would be great but wrong at the same time. It was weird. I meditated for some time, just to clear my mind of these slightly negative thoughts. I left the session feeling revitalized and open minded - ultimately, ready and prepared.</p><p>At about 10:40 we began to ingest the shrooms. I had one introductory bite of them by themselves, and decided I needed some crackers to help me get them down. I finished off most of the bag off with 5 or 6 packed cracker-shroom sandwiches. They masked the odd taste famously. It was 10:47. I sat on my buddy's leather couch and just breathed in and out. The anticipation got at my nerves, and I began to feel this strange sort of goofy high. I was laughing out of control at times. C had turned on some Tool while I was recording some things in my sketchbook. He had these crazy colored lights that danced and reacted to the ambiance around it. These colors were beautiful. I began to feel really happy, almost too happy. Overjoyed with these strange emotions. A love for everything.</p><p>I was standing at one point around 11:00, C told me to just sit and chill. I decided to just lay down. It felt necessary and had to happen. I laid on the cold tile floor which felt ethereal - like small blunt needles protruding into my epidermis. It was comforting, not scary. I was enlightened, strangely, by the space between the couch and the floor. Its deepness and blackness intrigued me. Underneath this simple place of sitting was a void - a whole different world. I was starting to feel them coming on around 11:10ish. I watched the crazy pyramidal shadows of C's acoustic foam pads warp and stretch. The colored orbs from C's mechanism danced like 17th century ball dancers on the ceiling above me. At one point this mechanism fell from the wall; C catching it reflexively, turned it off and laughed. At the moment it fell, and only that moment, I felt awestruck with horror - a horror that can only be matched by the nightmares of one's youth.</p><p>Around 11:25 I mentioned we should go outside and smoke the large joint we had. We wandered into his back yard toting our iPods. It is rather hazy at this point but I think while C was attempting to get the joint lighted I was roaming around his back yard staring at the strange things around me. The ground flexed and seemed soft against my bare feet. At one point I laid down and stared at the sky. C's yard is surround by very tall slender trees that jutted into the sky. The sky was multi-colored, starting at the tree-line with orange, blending into green, then purple, then crimson at the very top. It was beautiful, unlike anything I had ever seen.</p><p>We soon wandered over to some chairs and began to smoke the joint. The smoke felt so different, I was able to take a lot larger hits than I am used too. I would hold the joint for awhile (as C became uninterested in it) and stare at it. It glowed and pulsated, seemed otherworldly and familiar at the same time. I couldn't help but stare at the moon while I was sitting. The way the moon looked and how it affected me was one of the highlights of my experience. It glowed tenaciously with long fractal-like tendrils of light that whipped and wisped in the crimson sky. It was outlined with small beads of multicolored orbs. I felt uplifted at the sight of it, it beckoned me to come to it, but gravity kept me thus. It's beauty, along with the poly-colored sky, blew my mind.</p><p>After finishing most of the joint, I stood up and clambered onto my friends trampoline - which was a prolific feeling. C had gone inside, we were becoming distant from each other. The weightlessness took me by surprise and I just collapsed like a ragdoll. I attempted to get my iPod working, but my relaxed feeling only left me fumbling. I managed to scroll my way to Tool songs, then to their song Third Eye, got it playing, but never donned my ear buds. I don't know how long I laid there, but eventually C stumbled out and said I should come inside.</p><p>A lot of what happened inside is a blur. I do remember that I had a little bit of shroom pieces left over that I was going to try and finish - but never could. Something about them prohibited me from doing it. After sitting and listening to some really strange and intense music, I asked C (who was very hard to talk to, because most of my sentences were cut short by sighs and 'Dude') if he remembered the thing I had said the following friday (while high) about experiencing 15,000 different universes simultaneously (yeah, I trip kinda weird on weed). He said, 'Yeah, you were trippin', man.' Then I followed with, 'Yeah. But right now, dude, I feel like I am living each and every one of those 15,000 universes separately and for five minutes at a time.' And this is truly how it felt. So many weird thoughts, voices, distortions, and colors were racing around me. Eventually after doing some sitting, I had the urge to go outside. We brought what little we had left of the joint and ventured into nature once more.</p><p>By now it must have been midnight. I paid no attention to the sky or the moon this time outside, but more the trees. They seemed to be like flames at the tips burning and distorting. We sat back down, by now it was impossible for us to communicate because neither of use could form coherent sentences. C pulled out the joint which was surprising a snarly little shit roach. Repulsed is how I felt. I mentioned going to get a bowl from the room to pack it in for a quick toke. I stood up and went inside. I grabbed the bowl from his dresser, but never made it back outside. I don't quite remember how, but I got sidetracked by something. C came in a couple minutes later and sat at the computer. The time was pushing 1:00. For next hour or so we sat there and listened to music. A lot of what was going was so quick and non-descript that I just can't recall it. But at about 2:15, C, who was lethargic the whole time, stood up and parted for his bed. I laid down on the sofa as he left me in the darkness.</p><p>I don't know how long I laid in the dark. What very little light that pierced the void of blackness cast deranged shadows that warped and flexed. Several times I sat up trying to calm myself down. I started thinking how much longer was it going to last - I had had my fun, and I was ready for it to come to an end. I started to feel like I could never possibly be normal again, and I would feel this way forever. The five hours that had elapsed (as it was now 3:00) had felt like an eternity. Would I return to normal? When? These questions along with the darkness; and the fact that I was still tripping fairly hard, kept me awake for hours to come. I laid there watching floating eyeballs dance in kaleidoscopic patterns around the room, along with mouths. I started hearing my thoughts as different voices which would dramatically change pitch at random. I was constantly jumping up and glancing at the door thinking someone was staring over me, talking to me in strange tounges with fluctuating pitch. At one point the door opened - suddenly. I laid still. Completely motionless. That was it. No more darkness. No more voices. I stood up slowly once I felt safe, and closed the door. I walked into the bathroom, and flicked the dim lights on.</p><p>I looked at myself in the mirror. I felt vile. Disgusting. My face pulsed, rippled, and morphed. My eyes came together as one and then separated portraying me as a fish. I changed shirts, washed my hands and face, and turned on some more lights. I was coming down - a little. I kept telling myself that I was done tripping. But every time I'd think about it and stare off at something it warped and bended. I messed around on the computer for some time. At one point C came in and said little, then left. I laid down at 4:30 and caught a couple Z's. When I awoke at 6:00ish I was sane again. I caught up on some more sleep, but it was hard, as I couldn't stop recollecting and trying to fit the pieces of the last eight hours together.</p><p>I began to think - really hard. I began to analyze what I had just experienced. I came to the conclusion that I was retarded for eight hours, and I was a dirty, filthy miscreant. I concluded they weren't for me, I just had no control over the crazy shit that was going on. The voices. The colors. The eyes. The thoughts. At points during the night I would stand up and walk into the bathroom - and then I would forget walking over there, making it seem like I was teleporting across the room. I even had strange out-of-body experiences, where I felt like I was someone completely different. Several times I felt I was taking on the likeness of C, in body, voice, and emotion. I became other people as well. C and I talked for a bit after he woke up. He was rather unsatisfied. He drove me home and we didn't talk for a day or so. </p><p>My attitude about the experience has changed over the past couple weeks since. At first I was not interested. I soon became mutual, realizing it wasn't smart to do it at night and confined within C's house, so I'd tell myself, 'Maybe one last time...doing it during the day.' Now I feel the urge to do it again. Not an addiction, but a feeling to delve deeper into this mysterious and powerful drug. Its binding me to nature and oneness was one of the most exhilarating things I have ever felt. The next time I venture into the savage journey that is mushrooms, I plan to bind myself more to nature and my surroundings. For as long as I live, it will be an experience that I will remember.</p>"
}
