{
 "title": "I Love It",
 "author": "Capital A",
 "citation": "   Capital A. \"I Love It: experience with PCP (ID 74742)\". Erowid.org. Mar 5, 2009. erowid.org/exp/74742",
 "substance": "PCP",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "PCP",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2008",
   "74742",
   "Male",
   " ",
   "Not Given",
   "Mar 5, 2009",
   "14985",
   " "
  ]
 ],
 "report": "<p>Well this report isn't on one specific experience...but more a general overview of my love affair with PCP.</p><p>Let me start by saying Ive only used PCP maybe 12 - 15 times in my life and I am 25. I used to do alot of different drugs from tha usuals like cocaine, ecstacy, acid and OF COURSE my favorite...marijuana. I even dabbled in heroin, shot it a few times but ended that when my good friend died of an overdose (New Jersey has rediculously pure dope, highly potent). Ive done some not so known names like AMT, ether, bromethazine & codeine...but none ohhhh sooo great as Phencycladine.</p><p>My first experience with dust, i was about 18 or 19 just got off probation and me and my friend were going to celebrate by smokin a fat blunt. But this time, some old hippy we got this smoke from dipped it in PCP...smelled like a chemical factory, even before you lit it. We drove around and smoked this fat blunt...my periphial vision was distorted. My friends head would blow up like an air balloon...i laughed. I felt indestructable and invulnerable but not once felt violent or out of control. My body wasn't there...I was floating above it. No comedown...I love this drug.</p><p>Over time, I used PCP about a dozen more times in 7 years. One time at my crib when my family was away, we smoked PCP laced mint leaves we call 'GORILLA PISS' due to its black color and chemical odor. We watched tha Ted Bundy story and I honestly had to go to tha bathroom and wash my face off...I felt very unstable, mentally...but physically I can honestly say I smoked this stuff with alot of people...even otherwise violent people, and I never experienced a violent incident.</p><p>My belief on PCP is simple...you need to be ready for it, and have good company and surroundings. If you dont like feeling like you arent there, if you're scared of sleepwalking, if you dont have a good self image...maybe this drug isn't for you. But for anybody who wants to go down tha rabbit hole and experience something a little different...PCP is where its at. Its so different from any other drug and in my experience...completely unaddictive. One needs to separate drugs from reality...there is a time and place for everything.</p><p>I'm going to end by trying to explain a PCP high to someone who never experienced it...</p><p>You ever watch THE MATRIX? ITS LIKE BEING IN THAT MOVIE.</p><p>A</p>"
}
