{
 "title": "A Magical Experience",
 "author": "Robjuggalo",
 "citation": "   Robjuggalo. \"A Magical Experience: experience with Mushrooms (ID 74772)\". Erowid.org. Apr 23, 2012. erowid.org/exp/74772",
 "substance": "Mushrooms",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "50 caps",
   "oral",
   "Mushrooms",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 74772",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2012",
   "Views: 1609",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nNovember 1st, the day after halloween, unluckily having found no shrooms for halloween, but we found about 200 caps out on the golf course. Me and my friend had not wanted to be completely far gone, so we ate 50 each. We were in a forest at a cabin like structure with a couch\r\n4:00- I was first to munch them down with some candy, my other friend had a little more trouble as he is no vegetable eater at all. So we walked on over to the ice rink so he could get a bottle of water to wash it down, he went in the bathroom to eat them in case he upchucked.\r\n4:20- while he was in the bathroom I just walked around trying to pass some time, pressing the buttons of the vending machines, and then it started to come on to me. At first it was just a weird feeling, lightheaded, and a good feeling of energy, like an adrenalin rush. Then it started to get a little sketchy, I noticed everyone looking at me as I was strolling around, I had to get out. My friend got out of the bathroom and we headed back to the cabin to meet another friend whom be planned not to tell about the mushrooms. \r\n4:30- we got back on the trail and I was noticing that everything was a little different. By the time we got back to the cabin, I was having quite a difficult time walking, but it was all good. I just stood in the field for a bit, and my friend looked at me strangely (as it had not hit him yet). Our friend got there and I was feeling quite groovy, we headed back to the trail. \r\n4:40- when we got to the trail, it hit me hard. I could barley walk at all, I was very slow at it, but I had the rush to yell at a couple that I did not know as they walked by. My two other friends busted out the pipe and lit up a bowl. Im a heavy pot smoker,several times a day, everyday. However when the pipe was passed to me I refused..I actually wanted nothing to do with smoking pot at that moment, it was very strange, but I did not want to smoke. The effects were getting heavy. It was like a force wrapping itself around me, making me walk very slow. It took an hour to walk a distance that would normally take 5 minutes. The trees on the trail seemed to be trying to grab me, they were pointing at all directions, and looked almost like some kind of octopus trying to grab me.\r\n5:40- we were almost off the trail, the trail looked like it had words all printed out on the gravel. No words at all existed of course, I knew that, but it seemed like an endless scramble of words were laid out all over the trail, none of which I could make out. When we got off the trail we went to the mall, where we went to a John Deer store, it looked so colorful. We read a couple of  children books, which we were absorbed into. Then we would come back to reality and try to act cool, but it was impossible. We left the mall and out to wendy's resturaunt. I wanted no food. My stomach was fine, but I was not in the mood for food, I was tripping. There were bad vibrations coming from everyone I felt. My friend devoured a meal, which did not look pleasing at all. I only had coke, which seemed to not go to my stomach, but to my throat and then would dissolve into all parts of my body, I had no stomach. I felt pretty trippy, I wanted to reach my hand inside my body, and throw out the mushrooms, I wanted it out of my bloodstream and brain, I tore up a burger wrapper in frustration of wanting this feeling gone. It felt like a medical pill high, but bad, like an o.d of pills\r\n6:00- we went back outside and it was freezing,very much freezing. Suddenly I felt the urge to go home and to the warmth of my bed and just lay there. Reality came back that I could not go home yet or I would be clearly caught and have very aqward conversations with my parents. I was still freezing though, we had the hardest time trying to decide what to do and where to go. I just wanted warmth, that was all I was seeking. Then we struck up the idea to walk. I began doing odd warm ups and running around, which got me warm and fuzzy. Suddenly all those horrible feelings that swarmed me went away, I was good, ready to take on the world. When I stared at anything, it seemed to move, everything was alive. The sky was purple, the pavement was purple, very odd. \r\n7:30- we wanted to go into a field that lead back to the trail where we walked earlier. It was dark now, but I felt great. I blazed through the field, which had heavy bush and weeds all through it. It looked very sketchy, and I would normally have been sketched out by this dark, thick bush we were trudging through. But my body was warm, I cant explain the warmness and good feeling I had, but it was good, I could do anything. Then we sat down in a clearing, just grass. And toked up, this time I smoked. I smoked my menthols too, which I had not wanted to do at all earlier. It was a good setting, even tho it wasn't in reality. It was dark and cold out, but it was all good. The first time sitting however was extremely difficult, it was like I forgot how to sit, eventually, after 15 minutes of trying to sit down, I did it.we sat on the grass and toked and smoked for over an hour. I had a torch lighter which I swiped from a hardware store, it kept sticking up and not lighting, it began to give me an extremely bad vibe for some reason, I saw the lighter as something evil, it was out to get us all and would only bring trouble. I was very irritated by the lighter, I had to kill it, I had to get rid of it, so I threw it into the trees perhaps 5 feet away, but it was all good now, it was gone. I looked over my shoulder a couple times and saw about 20 people coming down towards us. It sketched me out solid, but nobody else could see them, it was in my head.\r\n8:30- we began walking aimlessly. Whenever I would check my cellphone or I-pod, I would get lost in it, and all I could see was my device, and nothing around me, however out of the corner of my eyes I would see groups of people, people that were out to get me or something, but I knew there weren't real, so I stayed cool.\r\nI was in another planet, this had been the case of all night, but it was so strange. I saw myself as not a person or human being, but as just another living organism of cells and atoms, I was nothing important to this world, the world was small compared to the universe, we were nothing. I could see the world from the view of space and it scared me sort of, but gave me a deep understanding to life. A sacred understanding like, it feels like its unexplainable.\r\n10:50- after wandering for a good while I could feel the effects coming down pretty solid. I still saw the people trying to grab me and pull me down, still ignoring it as I knew it was not real, they did not frighten me, nothing did. We walked into complete darkness into the trees, and had a smoke, then went home. Sleep was good, extremely good.\r\nThe feelings of that night were odd, very odd, but a good odd. At points I felt like I wanted the high to go far away, at others I loved it and felt so happy and willing. I suggest it to anybody, but have it planned, we had no trip sitter, it may have been a more pleasant experience with one, but until I tried, I never understood the feelings, words can only explain so much, it was most certainly magical.\n\n\n"
}
