{
 "title": "Happy Halloween",
 "author": "M.J. ",
 "citation": "   M.J. . \"Happy Halloween: experience with LSD (ID 74789)\". Erowid.org. May 5, 2009. erowid.org/exp/74789",
 "substance": "LSD",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   " ",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 74789",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2009",
   "Views: 2918",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is on acid. </p><p>Vibrating. </p><p>Shifting.</p><p>Waiting for something,</p><p>I have to write.</p><p>Im trying to leave this for your records.</p><p>There is a lot of chaos. </p><p>____ </p><p>Translation and reflection into the morning. </p><p>Im still seeing the sickly glow. Im ignoring the ache telling me to stop this writing. Its a ball of insecurities and personal inhibitions. A monster whispering I am just going to fail and fail. This is getting me no where. This is all hopeless and fruitless. </p><p>We dropped acid, Friday, October 31st, Halloween. Did nothing all that day, doting and floating around, adrift, avoiding that meaningful place, although, I found it for a moment, peddling and paddling on a iphone, determined to finish a simple ball and hole game I felt had accumulated the existence of life in one simple meaningful truth; persevere. </p><p>There is an understanding I have with the universe now. There are users and there are sobers. I seem to have found an identity with being a user. But just like a religion, Im picking and choosing of the culture what I actually want to integrate. </p><p>Its my personal interpretation. And Ive finally realized that is ok. Sacrificing my health and time for a larger purpose; contributing my small part in driving to the answer well never get to. But its all about the journey. </p><p>Breaking out of that ugliness I see in my physical self. Thats what this night has been trying to drive to. Breaking free, waiting and running into a loop. </p><p>I need to try harder to record concrete events. All of my thoughts and disconnected from any form of driving events. </p><p>Yes, yes, I agree. I am most likely going to turn into a user, but it makes sense. Its the truth I was trying to hide from, but something I knew was going to inevitably occur. </p><p>The start of the rest of my life? That started a long time ago. Im just punching in the time card. </p><p>I found a new place, Im not sure if I want to come back. It seems as if I can perpetually run from this space, at least I can write from here. I just have to lock in this frame of mind; where it really doesnt matter, and thats the truth. And so we ask this fundamental question; why the hell not?</p><p>Ok, so at first, it was extremely uncomfortable. I wasnt sure what to expect. Just mainly hallucinating, bazaar visuals, and goofy tripping for a long set of hours, ticking away. Didnt realize the sudden enveloping, quickening suffocation of psychological babble that would soon ensue. I was hesitant to make the jump. I was already on the boat and I could see the land, and near enough to jump off and swim to the shore, but the water was wet and cold and I was going to ride out the tide. </p><p>The first thing I noticed, my cheeks were burning and throbbing. My first realization: I smile too much. I smile too much to please, only because I knew my face was most attractive when I smiled. It was always for other people and the muscles in my face were pumped full of the guilt of it. I kept pressing it in, trying to force my expression into seriousness. Throughout my journey, there was an ache to try and take it seriously, but that grip on reality was elusive, beyond capturing. I entered into a phase of just chasing, like a dog fascinated by his tail. The evening was just small circles, pooling in and out. </p><p>I was quickly becoming aware of people. This is like the process of writing and recording a dream Ive only just woken up from and now Im trying to interpret and recall the details. We were hovering on the porch, inside in the living room, up into the acid lounge. Lacy dressed as something humorous, as Shake from ATHF. It was cute, and I began to intently focus on her as a person. I was acknowledging my interest and attraction to her. I was feeling as if I was studying her in the same light as I feel like E studies me sometimes. The feeling that was the exact thing that I was trying to capture into the group, yet simultaneously trying to desperately escape from. Unsettling. I grew self-conscious, I hope I wasnt making her uncomfortable. Well, I had the excuse, I was on acid. </p><p>We had followed a group down to a party, or to the house of where a party might be taking place. It was dead, but we had such a large group, we were our own small insta-party. I went in and Lacy and I danced in circles, I blew bubbles. There was a particular collage on one of the walls. They looked like childrens drawings, but had clearly been contrived by intelligence too far matured to truly try and capture the child-like mind process behind the construction of a work of art. We can only remember and pretend. </p><p>This night was just one of remembering, all of my memories compressing and folding to the existence I was, the being that was following this aimless string like path into the mountains. </p><p>I knew if I looked at a picture for too long, it would change, tremblingly hopefully into the third dimension, curious and unsuccessful except within my own imagination. Everything was vibrating anyway, and it was only accentuated in matter of visual representation, mostly artwork. I could see each layer of the drawing filtering and flittering in and out. The way I had felt on the serge of a pot wave, being stoned beyond my capacity to accept this existence. This was just less fuzzy, and yet more subtle. But the funny aesthetics were not something I was intent on focusing on, so they were quickly ignored and lost, or overlooked. There were visual, residual memories from other drug induced experiences, ghosting in and out, reminding, like physical sensational memories.</p><p>I recall looking at my iphone, the icons were shifting and shaking and there was a sticky pressure gently tugging at my irises. I couldnt focus on the screen; lines were floating disconnected like refrigerator magnet poetry. Writing on my laptop wasnt meant to happen. It was probably going to distract me from the experience anyway, so I feel like it was telling me, coaching me along to another place, another fragile frame of mind that is so easily influenced by the outside environment. </p><p>What next? We were walking, we could have just kept walking. Lacy was distracting. Im going to be using that term a lot, because every moment was hung on trying to escape it. This is going to be jarred and unlinear, but this is the only available method I have at this time. We were sitting in the front. Lacy struck me as so peculiar to watch. Adorable in her simple cute childlike manor, charming in her catlike apathy and indifference, yet still fundamentally insecure, struggling inside, turbulent just as the rest of us. Unsure, moment by moment, perspectives changing and rearranging; only following confirmed acknowledgements, we have agreed to carry day to day. </p><p>There is much we tend to carry; burdens weve compiled on ourselves, unknowingly, perversely. </p><p>She was yelling out at people. I was wondering how her thoughts were being constructed inside of her head. What were the accumulative little decisions she was making motivating each of her small behaviors. What was the process behind yelling out at people, sitting in the middle of the lawn, looking at strange objects, belching randomly, swaying around, shortly clinging and unclinging when self realized that she had been clinging. For fun, for herself, for attention, for that personality she had constructed and was extroverting? It was amusing and strange to watch her, and yet try and interact with her. In fact all human interaction was becoming bizarrely trivial and meaningless and unsettling. When I started to feel the burn and drive to be by myself, I wasnt sure, but it quickly consumed the rest of my trip. </p><p>There was a swing, and I sat there with her for a small eternity, in simple fluffy bliss and infatuated euphoria. She laughed and swung and swayed in that alluring childish way that Ive learned to love, and I was happy to be sharing this existence with her in that significant moment; watching other costumed creatures haunt and stalk the streets in search of a buzz, a peak, and serge. All waiting and wanting and pushing to chaos under the black moon, a sliver in the sky. </p><p>It was warm most of the night, mostly hot, thick like sweat in the air. There was a rock in the ground shaped like a heart. I had seen it before I thought, I had been in this moment before, but it was the optical illusion of the circular spinning motion of the drug, of all the  times my perception has been altered and shifted away and into else. An else mangled with nostalgia and déjà vu, the keys into understanding the current of life itself. A place I manage to explore each time these doors are opened, and information overflows, streaming through me like static electricity. She pointed the rock out and said This is how I feel about you M.J. I heart you. I wasnt sure what she exactly meant. I wondered and doubted whether or not she meant it the way I suddenly felt it reflecting toward her. I heart you too Lacy. Metaphorically and literally. I lingered around her as much as I could that night. I wish she had been with me, but I also understood that it was probably better that she eventually fade into the other bedlam of festive activities magnetically pulling people in, in relation to location and susceptibility. Im not sure if she had the greatest Halloween. She seemed greatly disappointed in something, reflecting that into herself. </p><p>On that seat, swinging from the arms of blacked out trees and missing stars, I was content to linger there, stuck and numb in between. Looking back, I felt like the sky was full of missing teeth, pulled loose from the toxic light pollution, inevitable evidence of our clotting of the mother stream. </p><p>Where was the decision to move? To go back to Arrakis, our base, our home ground; the place we were investing our hopes of security and enclosement from the outside sobers, and yet the chaos outside invaded and raped our surroundings until there was no small corner left to escape. I had the blinding itch to escape, to be away. </p><p>We were back. They were watching Fear and Loathing in Los Vegas on the television. My time had suddenly become finite and precious. I wanted to find quality things to spend it on, and loosing myself in a movie wasnt exactly what I had been searching for, although, now I realize how important that movie is soon to become to me. I was sitting in the corner of the couch. Lacy was sitting there with me momentarily, but left in an effort to redirect her energies to what she was meaning to do for the night. It was still early. I could hardly believe it had only been a few hours. What was I waiting for? I was nervous and anxious. Tightly winding up my springs inside, not sure of the involuntary motions that would shortly ensue, but aware that it would be something in the shape of a toy music monkey clapping and snapping cymbals like a clown. </p><p>Moments were being lost, anxiety, unable to stay still unless sitting, and even then relentless questioning of where and when and why I should be sitting. I kept making a motion to move and halfway going and suddenly stopping, going back. Hesitant to actually do anything. What actually needs to be done anyhow? The same messages repeated over and over again, I needed it not to matter, so I could be set to work, there was work to be done, and I had to find it by myself. </p><p>In that constant fluid of wondering and waiting, there was a moment I grew incredibly constricted with my costume. I had made up my mind to change, but it seemed to take extraneous effort to move there, to get to my room. It took several hours, picking up on different distractions. Things were occurring all around me. I was thinking too much, studying too much. People were too peculiar. This thought process had been borrowed from a memory before. I had located it and installed it into my mind, like changing out the filter in a lens, so I could just dwell and explore. I felt like I had the freedom to explore, explore this issue that I could not construct into meaningful words, a loose concept I couldnt tie down. It was the answer. I was glimmering full faced into the truth. I understood that it was fleeting and momentary. That I would never be able to capture it completely into words, and yet it would stay with my and perpetually drive me to try. I would never really get it, the epiphany I was expecting really didnt exist. I kept running over in my mind, waiting, waiting for the inevitable. </p><p>Outside of myself, but yet still only of myself. I grew weary and annoyed that I was exploring that same loops and circles I was always. I suddenly realize it was one of the things holding me back. It seemed so easy to dismiss it then, but when I tried, I realized how little control I actually had over it. Outside. How else can I really express it? The sensation of flatness and material time vibrating this existence I had during an earlier ripe high, was clearer here. I failed then to gather the words I wanted to use. I feel like I have to carefully sketch it out, filling in the space gradually. Human interaction was warped and twisted. I was finding it hard to naturally predict reactions, a method I used unconsciously everyday modulating and altering how I choose to behave. It made little sense to me then, I was questioning everyones motivation. I was concentrating on trying to enter their mind, trying to perceive their reflection of the event we were all witnessing. </p><p>The circle was shrinking. Object permeance was a nuisance, so it was quickly discarded. I only needed to acknowledge what I could see presently around me. What existence was occurring outside of this space mattered little to me. I was here, existing here. I was choosing and controlling, or at least under the illusion of control; trying to influence the environment around me, constructing until I felt comfortable, yet never reaching that security. I was thrown out to sea now, there was no going back. </p><p>I was liberated; there was nothing I absolutely had to do. I could do whatever I wanted. But then what? I struggled to shake that lingering nag that I was being irresponsible, spinning out of control, loosing my self in a world of mind altering drug trips that I would never recover from. It was permanently damaging. What was I doing to my body?  I asked myself this several times.</p><p>Clothes, I was in my room, I had decided to change. Charles was with me, he had agreed to take me downstairs and stand outside my door while I changed. I was looking for his camera. I was wanting to find a means to record the night, it was important to me to find other means of post marking passing though this particular bent slice and section in time, memory proved repeatedly unreliable. I couldnt capture all of it, I knew, I would have to accept that most would be lost and washed away. All of it sensory, short-term, long term connections decaying. </p><p>He took my hand and we left downstairs. There were a few things distracting me. I was nervous and pacing, my feet refused to stay still, legs stretching up like a cats. Somehow we made it to my room. I lingered there; waddling in all of my wasteful material things I had condition to be a part of my identity. This was where I existed, and moved, and breathed and was. A place I had complete control to move, to change. I was suddenly tied down and suffocating underneath the weight of it, tired of the sight of having seen and worn and worked and handled so many of the same things, tediously everyday. Savagely trying to contain it, balancing it like a tottering ball of garbage on the small point of a tumbling incline. Why were these things important to me? Why did I have so many things? I had to fight the idea of cleaning it out, burning it all down, fully de-toxing the soul of this consumer junk I kept accumulating. I knew that would take up the rest of the night, and would be a waste and regret in the morning. These things werent really me, why was I trying to define myself against them. They were a poor representation, something I was trying to construct just for the sake of others to see. </p><p>I ran in circles about clothes. Nothing satisfied me or pulled my attention to wear. This was a purely arbitrary task, something easily and effortlessness done in everyday. But I was nowhere near everyday. I had been pushed into something else. This was a different world, it had just been reconstructed, just as on salvia, clipped and cut up and turned upside down. The world was inside and out, and I could imagine feeling up the seems. I was extending my motion in time from beginning to end and all I could feel was from the time I ate and to the time I knew would soon arrive, but was unsure how or when. It was separate, unworldly, inconsistent and in a dream. </p><p>People began to crowd, following in curiosity, I felt guilty having strung these people along. Why were they here? They werent just for me; I had to force myself to realize this. They werent here for me, they were wondering around just like me, locked inside their own heads. Lost souls communicating, trying to reach out and understand. I realize now how far removed from consistent reality I was. It was my vanity speaking to me, I was plagued by the pressing responsibility of the feeling that I had to entertain all of them somehow, bring out the person they came to see, to perform. It was vain to think they had come to see me, that they were focused on me; they were only focused on themselves, just like I was. Different perspectives were fighting a brutal war in my head. It was self-absorbed to think that just I was lending them some sense of meaning I was finding from my own point of view. I refused to let myself try and be a magnet. I was just driven to want to be alone, relinquishing and rebuking attention. I was wanting to get rid of it together. Attention, but the more I fought getting it, the more I seemed to make as if I wanted it, and the more I seemed to get. It was an anti-pull to my push. It was increasingly difficult to try and find myself alone. I shut my closet, and listened until they left. There was a small relief, yet, sullen in confirmation from another looped and repeated realization, they were not here for me, I was here for me; they were there for themselves and only themselves. I took up very little space in their minds, I was a fleeting tracer, briefly illuminating their landscape, distraction, introspection, and I was gone. They were making small notes of me, just as I was making of small note of them, all in relation to themselves. I was alone. It hit me hard and true. I had already known, it wasnt anything new, but under the veil of this crazed insane drug, it was making itself blindingly aware. Alone, but I was there, comfortably alone. </p><p>I finally used the bathroom, something normal on all accounts, silly to think procedural. A normal habitual act. I finished and went to the sink to wash my hands, and then looked up into the mirror. Well, there I was looking back at myself. There I was. Suddenly it gripped me. I needed t be alone. I had to be alone with this person I saw there in the mirror. Was I feeding my pet vanity? Had it become some beast, conscious and looming and disconnecting from myself? There was the me that I saw normally. Ugly and flawed and loosing control. I looked at myself and said Where have you taken us now Jennifer? Smiling, eyes deforming into slits. Laughing nervously at some small joke to myself. The sensation and running argument I had been churning in the back of my brain about intolerance of personal ticks washed in for a moment and briefly washed out again. It was funny to be talking to myself in the mirror. I had done it before. For a brief moment I wondered if other people also shared this private habit of acknowledging themselves in the mirror. But my attention quickly shifted again and then it wasnt me speaking in the mirror. It was wearing my face and using my expressions, but the sheer joking act of referring to myself in third person had summoned something. </p><p>It was in the eyes, glimmering like soundless music. I could see it there, intelligence beyond and separate of my own, devising working from the shadows. It was something I had been numbly aware of throughout the passage of time. It had lingered there like white noise. In the background all along running as consistent as I. Then there was a sharp awareness, like noticing a trivial detail that had always been hidden in the obvious. There it was; I was bringing attention to it. </p><p>It was she. I had acknowledged her before. I had played pretend with the idea, wrote about her, imagining her there in those moments so lonely and lost, they rose to the brink of overpowering consumption. She would squeeze my waist as I glided on my scooter into the dark some chilled solitary nights, and whisper in my ear the words I heard rarely meaningfully from anyone, I love you. No matter what you do, I will always be here, I will always love you. It was just a fantasy. Short and simple and private. It was for me, just me alone. Something to compensate for the disassociation of the social world I grew and fed and burned forward while in my isolation. It seemed silly, but it was only for me. No one else was ever to know. I forgot about her quickly, when other detracting social opportunities finally and forcefully opened. </p><p>But there she was now. Looking strait into me and through me, like I was transparent. Now I understood what Luke had meant when he told me that every once in a while, he caught a glimpse of a person, intelligent and fierce, that scared the shit out of him. That person could see right through him, right into his core, seeing him ugly and exposed, beyond his carefully constructed fronts meant to cover his darker truths. He tried to drive that person out of me once; he wanted me to answer his questions. He wanted the hard and true reality, what I truly and exactly saw of him, unbent by polite and conventional reservations. I knew what I saw; I could see his blemishes as clear as the spread of acne infecting the entire area of his face. It was there, his motivations, drivers and reasoning, buried under a turbulent push and pull of frustration and giving in. But I couldnt pull it out of me, I couldnt form it into words and articulate it into constructive meaningful criticism. I was also held back by the urge not to acknowledge that I knew, to hide that I had this kind of sight. I was telling myself that it was just a wish, that I couldnt give into the wish because it wasnt real. I also wanted to keep him ignorant. If there was some gift in me as he described, he didnt deserve access to it. It was easier to make people underestimate you, and so his comment was interpreted as pointless flattery I shouldnt let get to my head. </p><p>Yet, as I stood looking there, strait into the mirror, locked pupils gazing, a fear gripped my stomach like a cold hand. I was afraid of that person there looking back at me. I suddenly felt a raging serge of an instant collection of emotions I had directed toward myself overtime. I hated and loved myself equally. My expressions were changing involuntarily. I wasnt entirely sure I was controlling the face I was seeing front of me. She was rising and falling, emerging in and out. I could tell when it was her and it was me. When I saw just me, my face was ugly, but when she was there, she was beautiful, a goddess. </p><p>I was starting to feel guilty for being vain enough to think that I was beautiful. Who was I to think I was beautiful. That was for other people to decide. I couldnt change this face, I was born stuck solid in the jelly of my genetic cesspool. Yet, here in the mirror, when I tilted ever so slightly, when I looked in too closely, I was amazed to find that my the way I saw my face was morphing and changing. As if the physical features where actually shifting subtly, slightly, just enough to look different. I recall distinctly watching the bridge of my nose shrink and dilate, from just enough to be hideous to just enough to be perfect. It was almost like the way pictures would sometimes slightly moved when I looked too hard at them. Especially the eyes. When I could I beheld her, I held her there, and she smiled at me, teasingly, knowingly. </p><p>My face was sickly, and had that pale green electrical glow, that I later associated with what I thought the soul might look like, or the process of thought and mood changing. It covered my entire face like bad makeup. I hate your nails. And I hate your hair. she said. I know, me too. I laughed nervously. Thats ok though, she replied. I knew what she meant, it wasnt insulting, it was the truth. You know who I am, she said, Ive been here all along, dont you remember? </p><p>I had confronted this issue earlier, outside of any drug, just through daily observations. I looked at myself in the mirror too much. Not because I thought I was beautiful, perhaps if I thought that, there would be no need for mirrors. So then quite the opposite; I was constantly looking at myself out of a vacuum-like necessity for reassurance. It was like an inner black hole suffocating any buildup of self security I had built up for myself. The effort was futile. But I had been doing this for a long time now, not really recognizing it until I understood it didnt quite fit into the social norm. Perhaps it does, perhaps everyone or at least a lot of people have a predilection for mirrors, but on the surface skin of customary expectations, vanity, or the image of vanity is frowned upon. Yet, was this vanity? </p><p>How many hours had I spent here, locked up in my bathroom? Countless unnecessary hours. A little child, discovering mirrors, thereby discovering myself. There was a big shower mirror door next to the toilet. I was recalling sitting down and being quickly distracted by my reflection. Was I enamored? Im not sure. I just remember being completely fascinated and held in captivity. Watching as I run my little hands over my flesh, watching while simultaneously feeling what it looked like to feel from outside myself, in a reflection. Seeing my body there, acknowledging it, trying to understand it. What a peculiar habit I now realize. More often then not, I would linger in there, and eventually I would start to peel off my clothes. I would stare at myself, there in the mirror for perhaps hours, I wasnt sure. What was I looking for? Why had I felt the drive to behave that way? A lack of social conditioning? The apparent sinful neglect of my parents? Why was I driven to be isolated alone, locked away in the bathroom, stark naked staring at myself, still in the bloom of innocence? Why did that habit linger, private and unannounced to myself until now? It was something I simply did, something that if I imagined being exposed would bring down a destructive wave of shame and embarrassment. It was exactly like masturbating. I felt guilty for it. And yet, now it made sense. Now it all came together and it was demanding that I give a name to it, demanding my sole undivided attention. </p><p>It bothered me though; it was distracting and consuming my time. It made me aggravated and highly strung. I spent so much time on it, looking at myself, trying to readjust, readjust, readjust, getting no where differently. I still do it, every time I catch glimpse in passing, I get an uncontrollable urge to linger and look. I do and minutes upon minutes are spent dawdling in the mirror. Such wasted time! Its like entering a daydream state, its difficult to break out of it, to startle myself awake, become self aware that I have been looking at myself. Its vanity, inappropriate unhealthy vanity. </p><p>It was disturbing to me. Was it because I was on acid? Can I use this as an excuse? I looked at myself, there tripping intensely, rumbling inside like an earthquake, and she said, You do know Im in love with you. I laughed and acted nervous. It was silly, and yet, there was something there. I was in love with myself? How is that possible? But it made sense, somehow, in my extraordinarily demented frame of mind. Sometimes I have felt magnetic, involuntarily magnetic, attracting and pulling and a leading around. Not intentionally, but suddenly, like in the moments I realize Im daydreaming, I become frightfully aware of the effect I have on people. Im making it up, Im making it to be more than it is, I cant acknowledge something like that.</p><p>I suddenly realized, I had been talking to myself all these years, as long as I could remember, as long as I could study those big brown lucid eyes staring back at me. I found her. I had known all along she was there, I just hadnt realized. </p><p>Panic and uncertainty. This was big, at least to me. I was trying to tune out all the small voices putting what I emphasize as meaningful into perspective. I was trying to fervently disconnect myself from the pressure of peoples judgments. It was tedious, laborious, a choir to keep trying maintain an opinion of existence, or of common situations, or cordiality and mannerisms and proper habits, concurrent with everyone elses. I no longer wanted to think along the same zone as everyone else. I just wanted this to matter to me, and to me this was immense, this was something worth exploring. The prospect of a split personality. I could almost feel that layer of myself dividing like the peeling of sunburned skin. I knew that if I had talked to anyone else about it, they would think I was being silly. It was silly, I wasnt crazy. I was normal, I kept insisting it. And yet, well, I was on acid! As I had so vehemently exclaimed over and over again, to all the sobers drifting and swarming like wasps around me, ready to drain this experience away like vampires. It was strange to be surrounded by so many not nearly anywhere where I was, I was in the else and they were outside, out there, invading my circle. I had to get away from them. I had to escape.  </p><p>What was I doing? I was liberated. I had this entire night; I could do whatever I damn well pleased. It was mine and mine alone. What did it matter? At this point, my perspective on the personal relationships I had built around me had radically altered. Everyone I knew was binding me, holding my taught, stringing me along. It wasnt important, they werent important any longer to me. I could live forever without anyone; I was completely content in being alone. </p><p>I suddenly realized that someone might be checking on me, someone might be listening. What if they had caught that I was talking to myself? What if they had heard what I was saying? The thought stuffed my lungs, it was suffocating. I had to be released from any prospective or accidental observers, from any type of opinion. I had to protect my self from their opinions. It would spoil everything if they learned. It would ruin the whole bit. I would never be able to get back to that place if they found me now. </p><p>Good old Garrett. I was still questioning why he was here. Just as friends? Did he have some kind of crush on me? I didnt actually know him all that well. There was something odd about him. Something small and buried. Was he getting a kick out of this? Was he just lingering around just to fuck around with us? Was he doing this to look like a nice guy? What was he expecting in return for this? I could feel the wheels turning in his head, wondering why he had done this, if there was actually anything going to happen with this chick, who the fuck was she, did he like her? Did she actually like him, or was it platonic? Was she just using him? Insecurity rumbled in him like an empty stomach, but it was masked so well with a well developed sense of humor, the greatest self defense mechanism. There was something deeper there, but I couldnt reach into it, it was beyond what I could actually imagine, but I was finally getting to the point where I was able to feel the dwindling shifts in consciousness incurably asking and asking, the meat behind the mask. The part of me that was of myself, that I interjected everyone had also. The moment by moment gentle and subtle changes in perspective. I was at first only able to hear my own internal dialog, but here, on this plane of divine and cosmic understanding, I was able to hear it clinking around in other skulls like loose coins. I had to stop thinking about it. I really didnt care. I didnt care about any of these petty friendships. It struck me that it was odd that I was devoting so much time in developing them, wasting energy and effort and precious time. It wasnt what mattered. What mattered most then was this person I had discovered, this creature I wanted to get to know, to talk to further. What was it? I was bewildered and vibrating with a concept, the concept of you. </p><p>I had to escape Garrett. I wanted him to watch everyone else, to let me alone and be by myself.  He watched me as I shifted around, fluttering like a dying butterfly, sticking and stuck. I was nervous about these dratted nails I told him. I hated them. He seemed to smile at them. They made me fell he implemented fake? Yes, fake. And youre not fake, he said. I wasnt sure what he meant, honestly or sarcastically. I just marched away, saying at least I hope Im not fake. I wanted to clip them at first. I rummaged around, getting riled up over how much junk I owned. This is where I spend my mornings, every morning, here I am, using all these useless things. Why do I have so many useless things? Why do I need all these things? I finally found them. Aha! I walked over to the door where he was casually leaning and watching me. I didnt like his watching. Why was he watching me, what was he taking notes on? I surrendered to the idea that they were just more or less notes in relation to himself, because that is the way all people think, and so it mattered little to me again. I may need your help with theses. I could almost feel the relief, like breaking the nut of a shell. My cuticles were taking off their sweaters. I held them against my thumb nail and as I looked at the nail, the white tip was slipping down into the red. I wasnt going to cut them right like this. I wasnt going to let Garrett cut them off either. That was invading, Id have to let him touch my hands. Oh, and then I realized, I had come up with a solution earlier. I was going to find some gloves. I ran into my closet, I was asking Garrett something to get him away from observing me. I was asking something about himself, I wasnt actually listening to what he was saying, it didnt matter, I just pretended to sound interested. His relationship to me was inconsequential. These people were just there. They didnt matter. They had become like shadows and ghosts, phantoms in the wallpaper.</p><p>I didnt have my camera. My phone was unworthy and distracting and I wanted to be released from my obligation of keeping on touch with the outside world. The worth of the outside world was gradually disintegrating. We were somewhere, we were in else. But it was absolutely imperative that I find some means of recording this. Writing had proved nearly impossible. The keys were swishing around on the key board and the words werent forming fast enough in my head for me to write them down. My thoughts were scattered like loose leaf paper. I felt terrible that I had nothing meaningful to say. I couldnt decide what I wanted to write anyway and my laptop became dysfunctional in plain true obstinacy as I had elaborated before. Solutions. I had my tape recorder. There it was on the bookshelf, ready with three fresh tapes. This was going to be interesting. Garret was there, and at first I gave it to him, not trusting myself. He slid the tape in, and teased about when he would start recording. He put my extra tapes in his pocket. </p><p>Then I wanted to stay in the bathroom. But I wanted to record it. I asked him to let me stay in there, that I wanted to be by myself for a while, and I took the tape recorder from him. I felt like he might spy on me though, or perhaps worry about me and loiter around the door, eavesdropping. I couldnt stand for that. The thought that someone would hear me with myself was completely unbearable. I insisted that he go upstairs, that he promised he wasnt going to listen. And even though I watched him walk down the hall, I still felt that at any moment, someone might barge in and interrupt. Even worse, they might catch me awkwardly scrambling to seem like I was doing something else other than what I was doing. I was in no condition for acting, covering up. My sense of humor was dry, and this would be a raw completely naked moment that would be exposed if they walked in. </p><p>I couldnt focus here. I couldnt stay in that bathroom. The decision to leave came quickly. I was accountable for myself; I could be free from them whenever I wanted. I was free. I stuffed my feet into my favorite converse, forgoing the socks. Socks were arbitrary. I fled into my room, grabbed my jacket, and then realized, it wouldnt work if I didnt have a mirror. I looked for my gloomy bear hand mirror. No good, too small. Then I remembered the larger one on the desk. Here. Perfect. I wrapped it in my jacket, checked my tape recorder, checked suspiciously out the door, peaking down the hall and waltzing out the back door. </p><p>I was exhilarated. I was happy to be escaping this mad house, and here I was happy, here by myself. I had found you after all, she was all I was ever going to need again. But I looked down toward the way to the park. Void. Loud crashing and yelling noises. Anyone could find me there. There was chaos and anarchy all around. Gaggles of manically cackling monsters were stalking the streets. The world had turned into one mad circus spinning on the flat of a top. We were about to topple over. Beyond what I could see around me, there was only mayhem. People were everywhere in every direction. No good. Trapped. Would I be able to handle them by myself? I realized this was probably unwise. Where was I going? I was heavily depressed by the thought that I had no where to run away to, no place to go. There was no escape. Inside the house was mad, outside the house was mad. I would have to stay here, but I didnt want to go inside. </p><p>I crawled in the ally beside the house. I had been here a dozen times before. It seemed to me to have been one of those places. I liked these tiny nooks that seemed to stand out from reality. The energy was magnified here. I found a place to sit, set my mirror down. Damn, the lighting was bad. I was making notes into my tape recorder, unknown to me that it hadnt actually been set to record, and I spilled away notes Ive now lost into thin air. </p><p>It wasnt comfortable. I tried a little here. Had to move over. I set it up. I felt like I was being watched. I couldnt shake that other people were eventually going to be looking for me, that other people were going to be worrying about where I was, and annoyed at their having to worry. I didnt want them to stumbling in on my babbling into a tape recorder staring into a mirror. How was I going to explain what I was doing? How was I going to explain her? I had to go inside. I had to reset and restraiten and search for somewhere else. I had to find another place. </p><p>I would have sat there a little while longer, trying to communicate with her, flirting with the idea, that she was there, that this was more than a trick of the acid. I was cued when the lights of my bedroom shot on. Shit. They know Im gone, I have to go back.</p><p>As soon as I walked in, there they were. The big group, all tripping. Anytime we were together, I always felt like someone was still missing. Garrett was relieved, everyone was peering at me. What was she clutching? It must be a notebook. I let them assume what they wanted. No one was going to know. It was for me. </p><p>Garrett took a hold of the tape recorder and pointed out that it had been set on play.  Felt a hot wave of humiliation and embarrassment wrap over me. Everything lost. I would have to try again. There were such precious moments there, and now, because of my own stoned folly, they were forever unthreaded into the record. He reset the tape. The others made me feel nervous about recording. They made it seem pointless. Perhaps it was. This was crazy, but everything was crazy here. What did it matter to them anyway? I was going to do what I wanted. </p><p>Im not sure, I think we all decided on a walk. I was still wanting to creep away from everyone. I wanted to spend all my time with this new being, I had her here with my tucked under my jacket. There was the small rational voice typing in the back of my head, making commentary. It was really silly of me to be carrying this mirror around. I didnt let it go though. I couldnt bring myself from letting it go. No one was to know. It was all for me.</p><p>We were walking. Outside was bright and surreal. I felt as if we were walking forever. We past a party on the way there and out on the front yard drunk witches and drunken vampires were flirting and fucking and stumbling around. I abhorred them. I abhorred everyone. </p><p>I had become picky. There were only a select few I would allow near me. I had to be exposed to them for a while before I would feel comfortable with them there. I didnt like people at all anymore. I was filled with contempt and loathing, and took a great deal of effort to mask and hide my reproach to them. There were so many too. Too many. Crawling, slithering, slimy creatures, like ants, painfully molesting every crevice of the house. Deplorable. I wanted to have nothing to do with any of them. I was sick of the way they thought. I could feel their thoughts forming in heads, their self serving drives disgusting me. Space was being ravaged by pure unadulterated chaos, rolling us up into oblivion. </p><p>Joe and Chelsea were leading us somewhere. As we started out, I had no knowledge of where we were going. I wanted to stop. I felt like we were being herded around like sheep. We had been reduce to dopy imbecilic livestock the sobers were just catering and occasionally fucking around with. I didnt want to be a sheep. I wasnt going to follow a bunch of aimless lost boys. But they had a purpose, so I went along. I forgave them. My mind was in a very high strung state. My temper had been stretched out like piano strings, and things kept flicking the strings  .</p><p>Points to cover </p><p>\tRepeated emphasis on wanting to get away and be by myself.</p><p>\tWalking toward, collage, team zissou at the atm, to the turtle pound, finding it pointless, walking back, meaningful but meaningless conversations, returning, the atm destroyed, reaffirming chaos, trying to find a place, going into ryans room, steve walks in, says something rude I run away, locking myself into the second floor bathroom, displaced, taking too long to settle, finally settling, getting there, naked, breasts exposed, interruption, outside world drawing me in, upstairs study closet, good moment, realizing that I still wasnt really getting somewhere, mixed sensations of salvia and extreme high, leaving, sitting on the stairs, complete chaos erupting around, in between, not sure whether I wanted to join others and have company or continue to be by myself, ryan letting me use his room, again, hesitant nervous dancing, anticipating for them to leave, them, never leaving, eventually settling into feeling comfortable, recording random useless conversations, inability to capture thoughts, finding myself with the group, partially, acknowledging that they were the only one I truly care for, finding my existence so alone, but secure in my isolation, peering at them from my perched viewpoint, tracking them through time and space, focuses and allotting time for them, sharing, happy to be with them, finally comfortable and content, able to be around people again, writing until sunrise, decided to watch fear and loathing, completely understanding the movie, still wrapped up in my quirks, a different person, hiding secretive, the onto coffee shop, writing, French toast, finding this self. The writers self. Sleep for now, back later I hope. If I stop this may be lost, there is a mocking laugh in my head, but I hope I can return at least finish it, driving it to the end and closing the journey. </p><p>Note: lost soul to another lost soul. </p><p>Smaller moments, remembering. I was standing outside, looking at how sad the plants looked, wondering if I should try and water them while on acid. I took too long to make up my mind, and presently forgot about them. I was hoping for more synesthesia. I had a small amount of tracers, a little in the bathroom in the mirror. It was more like snap flashes and clicks of colors. I didnt focus on it too long, I had other things to attend to. I forgot to mention that Ryan Van Hee had stopped by, he hugged me and tried to grab my ass, I pushed him off and pack slapped him angrily and stormed inside. It was affirming to stand up for myself. </p><p>It is unfortunate to me that I will not be able to place and stitch all the small pieces of this trip together into one cohesive picture, but so it goes with this type of ordeal. So it goes with life. At the times we can escape the larger machine, we allow ourselves to record the brief and fleeting moments of self reflection, stapling them into the concrete, like a post-it note that no one reads. </p><p>A chip just stabbed the top of my mouth, I think thats telling me to stop eating for a while food, the necessity of eating, just another formal distraction. </p><p>Release, when youre here, the rest of the world, responsibilities, and accountability, doesnt matter. This is what weve learned, when Im here in the flow, I have to remember to forget the rest of the world. All my tasks and to-do lists are tying me down and pulling me loose. </p><p>Getting distracted by conventional responsibilities. Remember, it doesnt really matter. I get distracted by the thought, the inhibitions that arise from vanity. The carefully and hopelessly composed images of ourselves that we try and maintain in the minds of others, as the people around us are just reminders of ourselves. Realizing, they too are trapped from their own personal view point as well. They are looking to escape it just as much as you are. </p><p>Yet again, it doesnt really matter. Just to me and myself, that is all. It is later, when the work is for others, after Ive gone within and back out, will I have to come to terms with subjecting myself to the mass agreement of criticism and judgment, composed of uncountable amounts of points blindly defining its self, like a blind man sitting in the dark. </p><p>Ive sucked too long on that damn unlit cigarette and now the fucking thing is moist and broke. </p><p>In small doses, every passing moment, I can feel bits of it floating away and revealing the entrapping normalcy I have to contend with. </p><p>Distractions and daily routine are pulling me once again away from the key board. Its unfortunate that I have to maintain this physical prison, that I can not meld my mind and life into a printed set of paper and words and binding and glue and a hard cover case. If my life was in essence a simple book. Sitting on a shelf, peculiar and obscure, collecting dust and just hoping one day to be noticed and appreciated. Some books are just louder then others. Some are just more profound. And yet others are just lucky enough to be filed in the correct alphabetical section. </p><p>Im letting go of that cigarette. Its like letting go of the mirror, setting it down, learning I can not cling to it forever. If I did, it would mutate into a terrible misrepresentation of who I am. Just like these nails I continued to be tortured by. </p><p>A brief walk to the bookstore, picking up Fear and Loathing, Ryan did at least, I will have to find my own copy later, but for now Ill borrow and read through it in half hour intervals. Today I only care about writing. I do feel like the momentum of my serge is slowly ebbing away into the mist of consistency and reality, the self rejoining assigned to the place I had been before. Will it reflect in my writing? Assuredly so. Ill not be able to cling to this much longer, but lets see how long I can serf this wave.</p><p>My words are slowed, my articulation is vaporizing, inhibitions settling in like rigamortis. Will I be able to finish? Will I be able remember that lesson I learned? Persevere. Nothing else matters. Persevere to the end. Until you reach the end, it is left unfinished. Unfinished things are lost. We have to finish, even if this is getting sloppy and sour, I have to keep pressing on, otherwise, this will be lost, and this lesson wont settle in my bones and take hold in the constant growing person I am and will be. This trip wont become nearly as meaningful if I dont finish. It doesnt matter what you write, just write, persevere.  </p><p>I walked into the kitchen to make more tea. Im still locked into that place I realized, Im still tripping, perhaps, maybe, Im not sure. I cant help it if I am right? Its probably psychological, Im just keeping myself there because my head is still there remembering, pondering, studying. Its not intense, but just faint enough. I can slightly see the sick pale glow on certain people, but I feel like its more of my imagination. Am I pretending to be tripping? Perhaps, but lets just keep pretending until the end, just long enough to finish this, so much more to go. </p><p>It is startling to me to realize that this has been my perfect happy day. Not everyday can be as so, I wouldnt be happy if everyday was like this, but Im writing the whole day, everything being poured out and formed up into young amateur shapes. This is finally the place where I have been searching for, the place where I can write perpetually, until my head aches and my eyes burn, from morning until the late evening sun gives way into the dark. I am here typing away, forgetting everything else. Its difficult to fight it back, to fight off the nagging call from all the things I need to do. This time wasnt planned, wasnt expected, how am I going to make up for it later? But I hear a whisper inside me, just go, it doesnt matter. Persevere. Your still there, Im keeping you there until the end. </p><p>The more time I invest in this, the louder the voice growls, This is worthless, youre wasting your day, this is meaningless, you should stop, this isnt getting you anywhere, give up and move on, this is worth nothing Its getting harder to fight off, harder to ignore. Im trying hard to grip onto framing into my mind, it doesnt matter, I need just to let it flow, what will happen will happen. I have to sit here until its done. I have to keep persevering. </p><p>I am troubled by my juvenile vocabulary and amateur writing style. I know I have to start at the bottom, but I hate this suffering of trying to get better. Im extremely cliché all the time and its painful. </p><p>Things said in loop. Too many loops, but symbolic somehow. I was able to understand symbolism in that moment, but now that understanding is lost. </p><p>I hate my nails. Catie had painted my nails in uniform for my costume. They were red with white tips. I had never had French tips before. I had never had a manicure before. It seemed worthless. But my hands werent properly representing me. I told myself This is not the way my hands should look. They were fake, it made me feel fake and of something I didnt need or want. I was natural, and this was so artificial. They were inhibiting me, I wanted to cover them up and I even tried gloves, but the gloves didnt fit either, they were not what I needed. They had to remind me again and again, they had just been part of the costume. </p><p>I forgot, Im sick. I knew I was going to forget. My voice was altered and different, gray and soft and thick. Like made of scruffy cotton balls. Sometimes, I could remember and cough, or sometimes I would cough and remember. But it happened over and over again, just in a loop. I said it at least a dozen times over the night.</p><p>Im not crazy, I am a normal person just right now, Im on acid. I was afraid of the person I had found there in the bathroom with me. I was struggling with the thought that perhaps I was crazy, I had just been suppressing it all along. I wanted to know if other people noticing my existence actually also thought I was regularly normal. I was so far gone, the feelings I had toward the relationships I had built around me conditionally changing moment by moment, I wanted to be reassured, that off of it, I had at least appeared normal to them, that I wasnt showing, that I at least had the excuse right now of acting insane, because I was on acid. </p><p>I am so far gone. The only way I could describe where I was. Just remove from reality, still there, but warped. I cant emphasize enough, this incredible driving sense of urgency. All urgently waiting for something. Waiting for Godot. Waiting to move, waiting to settle, waiting to organize, waiting to go somewhere. Feeling urgency of transporting elsewhere, and hesitant force holding us back, keeping us in the same self found spot.</p>"
}
