{
 "title": "Years Ruined by K Addiction",
 "author": "JayBee",
 "citation": "   JayBee. \"Years Ruined by K Addiction: experience with Ketamine (ID 74825)\". Erowid.org. Jan 25, 2009. erowid.org/exp/74825",
 "substance": "Ketamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Ketamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 74825",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2009",
   "Views: 19074",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have just turned 19 years old. For years I had been depressed; seriously, deeply depressed. When I discovered drugs my whole life (so I thought) turned around. It gave new meaning to life, these new experiences, trips and adventures gave me something to look forward to. I did everything from cannabis to LSD and went through every drug-phase and addition known to man. Those were all easy to kick and move on to something else - until I came across Ketamine. <br>Ketamine fit into my life perfectly. I still know it would but I dare not ever touch it again. My social anxieties were brought down to zero, concentration was increased, memory increased, depression lowered by massive amounts and my general outlook on life was amazing - but this was only while I was high on k. <br>Looking at all those times that I wasn't high... I wasn't fun to be around. My mood when I wasn't was extremely irritable and wound tight. Realizing this I began to keep myself on it constantly. Not a day went by that I didn't use for a full year. <br>Thankfully someone special came into my life. This person cared about me so much that they wanted to help me out of my addiction. It's taken a good year for me to stop completely.<br>Here are my personal warnings:<br>- It's been months since I used (covering everything) and my abuse with ketamine has left me with some persisting mental disruptions - concentration interruptions and flashbacks<br>- physically it lowered my bodies intake in vitamin B12 and I now have to take it daily and for a short period of time abuse affected the wall of my bladder causing thickening in turn causing pain and near loss of bladder control<br>- I still to this day get cravings for ketamine like nothing I've ever experienced before!\n\n\n"
}
