{
 "title": "Stuck in a Time Loop",
 "author": "HeWhoLives",
 "citation": "   HeWhoLives. \"Stuck in a Time Loop: experience with DXM & LSD (ID 7486)\". Erowid.org. Dec 6, 2001. erowid.org/exp/7486",
 "substance": "DXM & LSD",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "650 mg",
   "oral",
   "DXM",
   "(powder / crystals)",
   " ",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7486",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 6, 2001",
   "Views: 44988",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nOn the Saturday night before Easter 2001 I finally tried this combo. Around 11:00 PM I measured out 650 mg of Dex on a Deering 10g scale and dosed it in open gel caps. This dose is a low 3rd plateau for me as I weigh 155 lbs. The highest dose of DXM I have taken is ~780 mg. I then went outside to sit in the cool night air. My brother had gone to bed and I was alone. After an hour, I felt the Dex coming on so I popped 2 sweet tarts with a drop of acid on each. I let the tarts dissolve in my mouth. Soon I felt somewhat nauseated but I never puked. I thought this was strange because I usually throw up on Dex. As I began to feel the trip accelerate I popped my hypnotism tape into the walkman. I had been listening to this tape for 2 months, every night at bed time. On the tape, the hypnotist guides me through progressive relaxation, then into a state of hypnosis, then through guided imagery, then gives suggestions, and then guides me out again. I have become somewhat sensitive to the hypnotic state by listening to the tape so much. \r\nOn the tape the hypnotist tells you to feel yourself going down. This particular time, I went WAAAAAAAAY down. I felt myself falling through different dex dimensions. Finally I reached a point where all there was was me as a disembodied mind and my environment as a set that my mind existed in (like a set in a play where one can go behind the set as well as in front of the set). But I got the idea that really all there was was just me. I felt like the set was an extension of myself. I kept switching back and forth from being the set and being an individual on the set. The set was a strange version of my neighborhood or the view I had from my back porch. Occasionally I would hear and see things from 'the sober world,' but they quickly became incorporated into the strange dex world as I would swtich back into that dimension. I have done Dex 3 other times before that night and have noticed that Dex is very similar to Salvia. Both produce worlds that have the same 'feel' to them. Both dimensions seem like an extension of myself or I am an extension of them. Both feel like a lucid dream and I find myself using 'dream logic' while tripping on these drugs. I also kept getting this deja vu effect like in lucid dreams.\r\nEvery Dex trip has incorporated elements and experiences from the previous trips. Curiously, during the trip before this one I met some Dex entities that said 'Welcome back!' Anyway, this deja vu effect started to manifest in other ways. I kept hearing this police helicopter fly over my house. Then I would hear a train whistle. Then water in the gutter of a house across from mine would rush down the drain pipe with a loud splashing noise. This pattern happened over and over and over again and I kept thinking 'did that just happen?' Soon my wondering if the pattern just happened again became part of the pattern. This happened after the hypnotism tape was done and I was too fucked up to put on any music. As a result, I had no guiding ground for the trip and the manic acid-driven need to figure things out kicked in. I convinced myself that I had become caught in a mind loop that consisted of a dirty dark dingy depressing version of my neighborhood. In other words, I was in hell. The continual pattern of sounds were driving me mad and I was becoming very freaked out. I have tripped alone quite a bit in the past and talked myself out of bad trips before. These prior experiences probably saved me. I made myself gain more awareness and forced myself to teeter inside and up into my room. But the acid theme was still strong and I still kept hearing the same helicopter thunder over my house and the same train whistle mournfully follow. I fell into the classic panic that I had finally tripped one too many times and was now stuck in some dimension. \r\nFinally I looked at my clock and saw that time kept moving forward. This meant that I wasn't in a time loop after all. I also put on some music and realized that this too was progressing and not looping. I spent the rest of the morning enjoying music and getting wrapped up in manic post-acid-peak philosophical speculation. I eventually fell asleep around 10 am. \r\nThis combo was not very fun and I have since decided that I am not going to do dex again and probably won't do acid for a very long time. Both drugs seem redundant now and the deja vu effect makes the dex world smaller each time I do it. It is ultimately becoming boring.\n\n\n"
}
