{
 "title": "Manifestations of My Subconcious",
 "author": "Van",
 "citation": "   Van. \"Manifestations of My Subconcious: experience with DMT (ID 75162)\". Erowid.org. Dec 30, 2009. erowid.org/exp/75162",
 "substance": "DMT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 75162",
   "Male",
   " ",
   "Not Given",
   "Dec 30, 2009",
   "Views: 2507",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In the past I have consumed many psychoactive substances. The vast majority being common opiod pharmacueticals and pschedelics. I've had many experiences with LSD, Mushrooms, and DMT. This time I had just acquired some DMT and it was the first time I had consumed it in a few weeks. I didn't have a goal in mind for this experience beyond my desire to push myself further than ever before. I just wanted to know for sure, that I am experiencing all that DMT has to offer without wasting the experience. </p><p>I took the bowl and put a bit of the white waxy substance and placed it on top of the cigarette ashes and metal screen. I looked at it and asked myself How far am I willing to take this? I loaded the pipe with more than I had ever before. Eyeballing it I estimate that it was approximately 50-70mg. I had no idea what I was getting into.</p><p>I inhaled deeply noting the harshness of the smoke. No match for my leather lungs. Almost instantaneously everything in my perception rattled and shook and outlined itself in color. Outlines building upon outlines, crashing into each other. Much more quickly than ever before. Much more intense. The first hit was a cloud; I held it in for about 10 seconds. I still had two more hits to go, each one more difficult than the last. Each one increases the intensity of the effects. Everything in the real world was nearly instantaneously being replaced by some bizarre dimension, the DMT sensorium. I couldnt keep my eyes open anymore. My ears began to roar and buzz. It sounded like a high pitch ring that was being ripped apart. There was also a lot of mechanical noise. Which matches the experience to come.</p><p>I closed my eyes and crashed into space. I could no longer feel my real body. Aside from the burning that raced up and down my torso, head, and neck. It was like I was being burned by the intensity of what was happening within me. I was surrounded by beings in the shapes of women made entirely of light. And I was in a room that seemed to be made of these women. The room was completely 3 dimensional; it appeared to be a machine. It would transform itself as if on hinges. It was made of bright purples and golds. Extremely colorful. And I tried to focus on what was happening. My eyes felt as though they were opened and at the time I believed they were. I was completely engulfed in this space. And one of the beings tried to show me something. I asked repeatedly What is this? What do you want me to know? </p><p>And in the palm of her hand was a small machine like object. My visions hardly seeming psychedelic anymore. As though they were open. Very much like a lucid dream. As though I was seeing with my true eyes. A squiggling orange liquid that broke into segments as it grew longer. Intense emotion and warmth washed over me. I have no idea what I beheld and nothing made sense to me. Further in the environment changes all around me. Unbelievable color, grids each containing kaleidoscopic swirls. I felt like I was exploring an alien dimension, like I was being carried by some force through everything. I felt myself starting to come down as the visions gradually became less intense and all I saw was swirling geometric shapes made of bright lights and colors. I started to feel my body again, like my soul was setting itself back into my body. I opened my eyes briefly, astonished that they werent open the entire time. I was completely fooled by the trance. I couldnt keep them open for long because the outside world was still a jumbled mess. The outlines of every object still crashing into each other, making the sight too confusing and intense. And I fell back into the light trance state. </p><p>Behind my closed eyes I was still in a room, staring at objects that completely baffle me. When I could finally come out of it completely everything was still swirling and vibrating, intensely colorful. Moving and dancing all around me, reminiscent of the effects of psilocybin. Only more than I will probably ever consume. But compared to what had just happened to me this felt like baseline. I immediately began to try to compile everything; I looked down to my left. The pipe and lighter sitting there. Im surprised it landed upright, I could barely hold onto it earlier. </p><p>The strange vistas and soundscapes are literally impossible for me to translate. I know I dont remember everything, which is somewhat frustrating but at the same time I know thats how it has to be. It has to be experienced, just experienced. Nothing I could ever say will accurately describe what happened. It was like being in an alternate reality. A real place in space and time thats just outside our own. It didnt feel like a state of mind at all. Ive had approximately 10-15 experiences with DMT. None being this strong. This break through experience completely redefines what I thought before was a high dose.</p>"
}
