{
 "title": "The Beat of the Soul of Nature",
 "author": "Kapitan",
 "citation": " Kapitan. \"The Beat of the Soul of Nature: experience with 2C-B & Cannabis (ID 75201)\". Erowid.org. Jul 20, 2009. erowid.org/exp/75201",
 "substance": "2C-B & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 capsl",
   "oral",
   "2C-B",
   " T+ 4:20",
   " ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2008",
   "75201",
   "Male",
   "",
   "Not Given",
   "Jul 20, 2009",
   "13151",
   " "
  ]
 ],
 "report": "<p>I had never had the pleasure of attending one before, but I never</p><p>expected drugs to be sold so openly at music festivals. My journey to</p><p>Spookstock 7 was long an uneventful, and mostly was spent mentally</p><p>preparing for whatever psychedelic experiences I might have. I was</p><p>actually doubtful that I would be able to find any doses at all, as</p><p>it's fairly uncommon in my home state. I was not to be disappointed.</p><p>I awoke to the rising sun at about seven o'clock, on the second day of</p><p>the festival. I had arrived at the campground at midnight the night</p><p>before, to something like an all-night music and drug party, and</p><p>hadn't slept much in the intervening time. I was feeling strangely</p><p>refreshed anyway, for some reason. I think it was something about the</p><p>atmosphere of this place; everyone I met seemed to non-verbally</p><p>acknowledge the strange, subtle connectedness that the psychedelic</p><p>state awakens me to. It was, perhaps, the change that was refreshing.</p><p>Not many people I normally interact with have been awakened in this</p><p>way.</p><p>As I climbed out of my friend R's car, stretched, and stumbled around,</p><p>I encountered three new arrivals, camped out in the space next to</p><p>us. were yelling at passerby, 'Molly!  Mescaline!'. (T-1:00)</p><p>'Mescaline', I thought. That was definitely on my long, but</p><p>shortening, list of 'Substances To Experience Before I Die'.</p><p>In addition to the connectedness, everyone here is just extremely</p><p>friendly, too. Maybe it's all the good pot and beautiful scenery. I</p><p>don't know. Anyway, I talked to this 'mescaline' guy for a while, and</p><p>he invited me over to his campsite, and offered me some hot chocolate.</p><p>He told me that what he actually had was MDMA, Peyote extract, and</p><p>2C-B, which he explained was like synthetic mescaline.</p><p>However, I already knew 2C-B well from my research. I had never</p><p>experienced it, though. It is indeed chemically similar to mescaline,</p><p>but it has its own unique and interesting effects, also. I knew that</p><p>it's effects are described as 'Somewhere between MDMA and LSD, but</p><p>completely unlike a combination of the two.' He agreed to sell me one</p><p>of his few doses. I took it on the spot, and proceeded up the hill to</p><p>the site where people had been gathered around the bonfire the night</p><p>before. I knew there would be a good aura up there. (T0:00)</p><p>As a bit of background information, I've been having a mild identity</p><p>crisis over the past few months. A lot of my friendships had changed</p><p>suddenly, and I found myself more alone than I'd ever been. I realized</p><p>at this point that I had been defining myself too much by the people I</p><p>was associating with, and, in the absence of them, I wasn't entirely</p><p>sure who I was, where I was, or even why I was alive. It was very</p><p>disconcerting, to say the least. </p><p>The embers of the bonfire of the night before were still smoldering</p><p>when I arrived, and about ten of my fellow early morning trippers had</p><p>been drawn up here as well. They were all sitting around it, smiling,</p><p>sometimes talking sporadically, but mostly just relaxing and being</p><p>generally amicable towards the world. I'd never met any of these</p><p>people before, but the seemed friendly enough.</p><p>A kid in glasses and an all-over print t-shirt welcomed me over. This</p><p>was the first time I'd seen the camp in the daytime, and I must say,</p><p>it is beautiful beyond description. It was a perfect day. Clear, blue</p><p>sky with a warm sun beating down its pure energy onto us. The</p><p>greenest, softest grass I'd ever seen encircled the fire like a</p><p>carpet, stretching away into the woods at the bottom of the</p><p>hill. Birds were flying in an unbelievable dance of life far above us,</p><p>as the fire crackled in what I thought was a wise and especially</p><p>soothing manner. I was definitely beginning to feel the effects of the</p><p>drug now. (T+0:30-0:40)</p><p>All of my previous trips have been with tryptamine compounds, and what</p><p>I found is that, if 2C-B is any indication, phenethylamines are much</p><p>more pleasant. Much warmer, much friendlier, less 'glitchy', and with</p><p>less distracting visual activity. That's not to say the visual</p><p>activity is not there. If anything, it was much more intense than with</p><p>other drugs I've tried. However, I was able to ignore it much more</p><p>easily. It wasn't as mesmerizing as what I would see on, for</p><p>example, LSD. This was a good thing, as it lets me focus more on my</p><p>soul, which is what I came here to do.</p><p>When it finally arrived, after maybe 45 minutes, The come-up was fast</p><p>and fairly intense; almost overwhelming. I felt the energy of it</p><p>washing over me in waves, and it felt amazing. If I had been in a more</p><p>neutral or hostile setting, things probably would have been</p><p>frightening at this point, but I knew that everyone around me</p><p>understood, and was supportive of my state of mind. This made it much</p><p>easier to bare my soul, and slip into a pleasant state of openness and</p><p>unity with my surroundings. (T+0:40-1:00)</p><p>Before I had been there thirty minutes, the kid in the glasses and an</p><p>old hippie got together with a guitar and a drum, and started playing</p><p>music. It started off rough, and before long the kid admitted that he</p><p>was 'too fucked up on mushrooms' to be playing guitar well. Everyone</p><p>laughed in that kind of spaced-out way, they switched instruments, and</p><p>then proceeded to play the most beautiful music I've ever heard. The</p><p>trees swayed, the wind blew, the birds swooped and dove in intricate</p><p>patterns, and it seemed as though the whole valley was dancing to the</p><p>beat of our collective soul.</p><p>Colors ... are amazing. Acid never did the colors thing for me, but on</p><p>this ... the grass was the greenest green I have ever seen. I'll never</p><p>forget it, as long as I'm alive. The world is a beautiful place, if</p><p>only you can eliminate your bias and stop filtering the beauty through</p><p>your worldview for a moment. I am in love with this place.</p><p>The birds ... its almost as if they act as a single organism, some</p><p>kind of a pseudo-hive mind. Every one of them has a soul, but,</p><p>together, they are something greater. Something ... beyond ... mere</p><p>birds. They are a collective. WE are a collective. We are at peace.</p><p>It was quickly apparent that 2C-B is also much more of an intoxicant</p><p>than LSD is, at least for me. My memory was dramatically affected, and</p><p>somehow in-sync with the waves of energy crashing over my</p><p>consciousness. The rest of the trip was superimposed upon sets of</p><p>clearly-defined waves of beauty, awareness, and clarity. It was as if</p><p>I was in a movie, and, at points, I would suddenly 'awaken' in a new</p><p>place, as if a cutscene or transition had taken place. I was fully</p><p>sane, conscious, and aware in the intervening time, and I remember it</p><p>clearly, but it's not nearly as important as when I was on the crest</p><p>of a wave of energy. Its as if I was coming to orgasmic revelations,</p><p>every twenty minutes or so.</p><p>I remember clearly, at the peak of my come-up, two older clean-shaven</p><p>men came over and sat down around the campfire with us. For some</p><p>reason, it was obvious to me that they were undercover cops. Looking</p><p>back, I'm not sure if they actually were. However, a man in camoflogue</p><p>came over to the campfire, talking in a walkie-talkie, convincing me</p><p>beyond a doubt that we were surrounded by some kind of undercover SWAT</p><p>team. </p><p>He reached down behind a log where a kid was sitting, and picked up a</p><p>bag of weed. 'What's this?'  he said. 'Will you please stand up, sir?'</p><p>I was sure that we were getting busted, and was really high at this</p><p>point, so it was kind of starting to freak me out. But, it turns out,</p><p>the guy was just selling weed. 'Crappy weed is what it is. Nugget</p><p>delivery service!' he said. 'Somebody buy some nuggets!' I didn't see</p><p>or hear about anyone get arrested during the entire festival. The guys</p><p>that I suspected were cops even smoked some of the pot with us. (T+1:30)</p><p>As I started to come down from the crest of my first wave, I wandered</p><p>away from the campfire, and walked down 'Shakedown Street', the place</p><p>where all the vendors are set up. Everyone's face was severely</p><p>distorted, but not in a menacing way. It was an obvious drug effect,</p><p>so it didn't cause me much worry. The people didn't seem to notice</p><p>that I was tripping, or just simply didn't care. I felt a strange</p><p>benevolence towards everyone, tinged with a hint of suspisciousness,</p><p>as I still suspected there were more undercover cops around here,</p><p>somewhere. I didn't have anything on me, so it wasn't a fear, but</p><p>rather an understandable delusion that I held for twenty minutes or</p><p>so. There probably were cops around there, with all the drug</p><p>trafficking going on. However, I recognized it as a drug-induced</p><p>delusion, and brushed it off before I left Shakedown.</p><p>Eventually, I ended up by the creek that runs through the bottom of</p><p>the valley. It's nothing like the creeks from my home state, all muddy</p><p>and brown. No, this one was perfectly, unbelievably clear, like in a</p><p>dream. Three more dudes were sitting by the creekside playing drums,</p><p>and again, it seemed like they were playing to the beat of the</p><p>river. Through the music, it seemed to me that they had uncovered the</p><p>secret heartbeat of nature. Why hadn't I heard this before? (T+2:00)</p><p>I sat there for nearly two hours, in the sun, listening to the drums,</p><p>the river, and watching the golden spiderwebs of the morning sky dance</p><p>across the perfectly clear water. I bathed in the radiance of the</p><p>heartbeat, its warm, pulsating waves. The energy of that time was</p><p>absolutely amazing.</p><p>I find that, personally, with the exception of Ayahuasca, the 'comeup'</p><p>of psychedelics in general is not nearly as useful, in terms of</p><p>introspection, as the 'comedown'. That is, the comeup is more</p><p>enjoyable, but, if I take anything away from the experience, I'm going</p><p>to learn it while descending back to sobriety. That turned out to be</p><p>especially true with this substance. During the last four hours or so,</p><p>I spent a lot of time wandering around, both in the campground, and in</p><p>my mind.</p><p>I realized that my identity crisis was more an issue of where I was</p><p>derived from. That is, I need to be part of a collective, a culture,</p><p>perhaps, or a group of friends, but I cannot be OF that culture. Much</p><p>like the flock of birds on the hill, I need to enter into it,</p><p>independently, as a developed person, and bring something new to</p><p>it. Any other way, I would either be defined by cultural norms, or an</p><p>outcast. I need to push out my identity to those around me, rather</p><p>than pulling in theirs. This was my problem, and the realization of</p><p>this greatly settled my soul, and still does, as I write this more</p><p>than a month later.</p><p>After the sun had ascended so far into the sky that I could no longer</p><p>justify calling this a 'perfect morning', I ended up back at the</p><p>campsite of the people who had sold me the 2C-B. They were rolling up</p><p>a blunt. Perfect. Everything had that shiny, plastic sheen of order,</p><p>yet identity, about it. They invited me over to smoke. It was a</p><p>wonderful, communal experience. I felt close with everything. I had a</p><p>very intense feeling of having arrived home, at long last. (T+4:20)</p><p>There was what seemed to be an extremely long period of intoxication,</p><p>after the main effects had ended. This may or may not have been a</p><p>product of all the marijuana I had smoked over the course of the day,</p><p>though I suspect it was not. I had the same 'waves of energy' feeling,</p><p>but without any of the visual activity, or really anything other than</p><p>a mild feeling of drunkenness. It was not unpleasant in the slightest,</p><p>but it did seem to go on well past the peak of the experience. I was</p><p>just confused as to how I could still feel like I was tripping hard,</p><p>but without any kind of visuals at all.</p><p>I finally was completely sober around 3 or 4 PM. The world retained</p><p>its beauty, however, and, strangely, the grass retained its surreal</p><p>green color. Even today, I will occasionally come across a</p><p>particularly green patch of grass in the morning or evening, with the</p><p>sun falling across it just right, and I will again be overwhelmed with</p><p>the beauty of the world.</p><p>All in all, I think this was hands-down the best trip of my life. I</p><p>didn't learn as much from this substance as I did from Ayahuasca, and</p><p>it wasn't nearly as intense as LSD or psilocybin mushrooms, but,</p><p>rather, a soft, warm day spent in paradise. I'm glad I had the</p><p>opportunity to experience this. Highly recommended.</p>"
}
