{
 "title": "Tilt (nMDA Antagony + GABA Agony)",
 "author": "hamster",
 "citation": "   hamster. \"Tilt (nMDA Antagony + GABA Agony): experience with Tiletamine & Zolazepam (ID 75291)\". Erowid.org. Apr 13, 2009. erowid.org/exp/75291",
 "substance": "Tiletamine & Zolazepam",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Pharms - Tiletamine",
   "(powder / crystals)",
   " ",
   "  ",
   " ",
   "Caffeine",
   " ",
   " ",
   "  ",
   " ",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 75291",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 13, 2009",
   "Views: 10885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having a fair bit of experience with nMDA antagonists, mostly ketamine, the assessment of a similar chemical mixed with a novel benzodiazepine seemed like a good selection for an experience report. </p><p>7 small doses were insufflated over the course of 4 hours along with moderately low doses of caffeine and cannabis. A familiar nMDA antagony was noted very soon upon onset, and it quickly became quite easy to use isolation as a cognitive tool to separate conceptual relativity. For instance, I could easily separate the idea of the action of going to the refrigerator to get a soda from the idea of the action of moving my legs and propelling myself forward. Both actions were taken simultaneously and existed only because of each others existence, the balance of the two forces oscillating as they were pulled towards the gravitational pole of the soda's necessity. The soda was of particular interest to me, but I was not interested in what I would ordinarily expect to be interested about regarding the soda. I was interested in this specific can of soda, not the desire and acquisition of a general archetypal soda or even a brand of soda, but instead where it was in the fridge, the color of the can, the shape of the can, what it was about the can that made it a can, what material the can was made from, and where the materials that the can was made from originated, but mostly that this can was, in fact, a can. A can of soda. </p><p>Clearly, the zolazepam had been affecting me for some time as my insights also became more and more difficult to express to those around me. I lost track of several points I was making for a period of 20-30 minutes during the peak of the effects, but managed to conclude the thoughts without a feeling of unresolve as the dissociative effects began to fade. </p><p>Aftereffects are not dissimilar to how one feels waking up after a short nap. The combination of tiletamine and zolazepam most likely produced uniquely different effects from the administration of one or the other individually. After I wrote the last sentence, and before I began writing this one, I insufflated another small dose to put into words an intrinsic representation of the character of this particular combination. The process of typing this experience report has slowed dramatically in the last 30-40 minutes as I have been focused primarily on certain objects in my proximity as opposed to other objects, and in turn the heuristics that I have used in an adamant effort to weave the thoughts together that fit in their appropriate categories reflect the objects themselves that my stare radiates at, intently chasing perceived synchronizations between confused mental cues. Clearly this state is disassociated, but it is blurred in an unconventional sense, as opposed to the context of ketamine. Physiologically I seem to be in a somewhat normal state, no mania or significant level of sedation. My heuristic devices are becoming intrinsically relevant objects as their practical functionality increases their relevance. A specific pattern on a bottle that meant something seemingly significant an hour ago now indicates quite clearly to me that it is sparkling natural mineral water, its purpose purposefully alien to my memory of it. </p><p>As I reflect, hours later, quite awake, it seems to me that this benzodiazapene, zolazepam, is definitely different than alprazolam or diazapam. However, I have a distinct sense of anticipation, or rather excitement, compelling me quite convincingly and unangrily towards the sensible recombination of mental heuristics and their logical counterparts, which is actually a lot more exciting than it sounds. </p><p>Also it should be noted that this particular combination of drugs is extremely effective at mitigating the mania sometimes associated with acute schizotypal syndromes.</p>"
}
