{
 "title": "Cut Through the Head Fog",
 "author": "Carnage",
 "citation": "Citation:   Carnage. \"Cut Through the Head Fog: experience with Modafinil (Provigil) (ID 75369)\". Erowid.org. Feb 4, 2009. erowid.org/exp/75369",
 "substance": "Modafinil (Provigil)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Modafinil",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 75369",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 4, 2009",
   "Views: 15619",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI figured I'd add a little bit of my experience with Long term Provigil use.  This may take awhile but I'll start at the top.\r\nAfter I graduated college, something happened to me physically and mentally.  Physically, I started to have extreme pain in my hip that shot down my leg.  The pain was so bad at times that I would have one leg dragged almost useless behind me.  It was through sheer will that I got around.  Mentally, I felt like I was living in a fog.  I was in a constant dream state and felt little emotion.\r\nI started taking Hydrocodone, Oxycodone, Morphine, Hydromorphine, whatever I could for the pain.  I found that it not only dulled the pain, it cut through this head fog.  After a few years of being sick of pain, I gave up on normal physicians and headed to the Chiropractor.  Four months later, the pain was gone.  It may come back one or two days every month, but not the every day pain I had before.  Only thing was, I was hooked on Painkillers and they shot through the head fog like a laser.\r\nOne fateful day a coworker of mine gave me a 200mg Provigil tablet she received as a sample.  The Provigil did more than cut through my head fog, it made me the person I used to be.  With that knowledge and some professional help I got off the narcotics.  \r\nFive years later, I'm still taking Provigil and I can't believe how it saved me. If I ever doubt that, I can go without taking it for several days and relive the dreamworld that used to be my life.  I am generally happy, focused, ambitious, and full of energy every day, provided I take the dose my body needs.  Some days it's 200mg, some days I need 1200mg.  I realize this is not a good thing.  It doesn't seem to be a tolerance thing either.  I never really step back to make it more effective.  It either is or isn't at the standard dose for the day.  Most days I take between 400-600 mg.  I work now as an independent IT consultant and am without health insurance until my wife graduates from college and gets a teaching job.  Because of the high price of Provigil I have been forced to purchase them overseas at less than $1.00 per tablet instead of $11 per.  I still see my psychiatrist and he writes me prescriptions to 'Cover' me if I were ever in trouble from importing the drugs.\r\nOne bad side effect of the drug is that I have changed my lifestyle in a way that I have slowly become more isolated.  All of my friends are drunks.  I used to be a drunk.  For some reason, I do not enjoy drinking since I started taking Provigil.  I would rather pursue learning a new computer programming language, read a good book, play some type of strategy board game, anything but waste my life away in an alcohol induced haze.  It has pushed this so far that I can not have more than four drinks without feeling the need to vomit.\r\nI did use Provigil early on to try to stay up all night.  I once made it fairly easily without sleep for 72 straight hours.  In retrospect, I would never do that again.  The exhaustion clouded my thoughts and while the Provigil kept me going, it was not without loss of focus.  I try to get at least 6 hours of sleep a night.  Without proper sleep, the true benefits of Provigil are lost.  I would not recommend using it in this fashion.\r\nThis drug, as I said, changed my life.  It isn't for everyone as two others I knew absolutely flew off the handle and abused it, devouring as much as 3000 mg in a single 24 hour period.  They acted much akin to crack heads after several days and exhibited strong drug seeking behavior.  It is perfect for me, maybe a disaster for others.\n\n\n"
}