{
 "title": "1 Seed Dose",
 "author": "Swim",
 "citation": "   Swim. \"1 Seed Dose: experience with H.B. Woodrose (ID 75377)\". Erowid.org. Dec 1, 2008. erowid.org/exp/75377",
 "substance": "H.B. Woodrose",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 seed",
   "oral",
   "H.B. Woodrose",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 75377",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 1, 2008",
   "Views: 7757",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was looking furiously for some information on the internet about the effects at certain doses of the LSA containing Hawaiian Baby Woodrose seeds, which will here after be referred to as HBW for simplicity. After fruitless hours of searching, I decided to take it into my own hands to create these reviews. This particular review will serve as a walkthrough on a dose of a single HBW seed.</p><p>Preperation: The seed was scraped of its fuzzy outer coating as suggested by many of a resource. Then, the seed was crushed and placed in a bottle with 3 ounces of water. The mixture sat, for 1 hour, and shaken occasionally.</p><p>Note: I had a slight stomach ache prior and at the time of ingestion. Nothing to make life too uncomforatable, just noticeable.</p><p>(T+0:00) The HBW/water mixture is ingested without filtration of the substances to reduce the risk of losing any of the active ingredients that may be in the seeds. Normally I would have filtered the material out, but decided against it because of the small doseage. Tastes like chewing on dirt and leaves, or any other organic material. Slightly unpleasant. Washed the taste down with an orange soda. Will place in something more tasty next time</p><p>(T+0:20)  I am feeling slightly light headed. I am not sure if this is in my head. But the experience is pleasant.</p><p>(T+1:00)  I am feeling nothing from the one dose of HBW. Colors are slightly more vivd, but barely noticeable.</p><p>(T+4:00) I can now conclude, at least for me, that a single HBW seed does very little. Colors were slightly more vibrant. I am sure that this was not a mind game. It was slight, and if this were all I could get, it would not be worth the trouble.</p><p>I will continue with my research and plan on attempting a 2 seed dose soon, prepared in the same manner.</p>"
}
