{
 "title": "Dead Light",
 "author": "MonkeyBoy",
 "citation": " MonkeyBoy. \"Dead Light: experience with Mushrooms (ID 754)\". Erowid.org. Jun 22, 2000. erowid.org/exp/754",
 "substance": "Mushrooms",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "1996",
   "754",
   "Male",
   "",
   "Not Given",
   "Jun 22, 2000",
   "16408",
   " "
  ]
 ],
 "report": "<p>\nIt was May 28, 1996.  The Grateful Dead were playing what would be their last Portland performance before Jerry's untimely, yet unsurprising demise. By happenstance, the concert fell directly on my 26th birthday.  My ticket was a gift from the friends who attended with me.  Along with this they were going to seek out suitable drugs to accompany the experience.  None of us were virgins to the psychedeilic experience; however I was not ready for the extra portion which I was afforded for being the birthday boy.  As is the tradition with dead show, we arrived several hours early to experience the carnival/ freak show environment that is omnipresent, and of course secure our party favors for the day.  The latter of which is prevelant and nearly unavoidable.  We soon settled with a bedraggled, dreadlocked and dirty deadhead on an undeterminable yet healthy looking bag of fungus.  We all quickly consumed our portions.  After a slow half hour of people watching, we made our way to a local bank machine to obtain some spending cash and prepare to enter the concert grounds... this is where things begin to go whacky.  I first felt a numb confusion. A wave of fear and anxiety which was a doozy of a first step.  I immediately was struck with the urge to make myself vomit. I struggled with this for about ten minutes, yet no matter how far I jammed my fingers in my throat, I was unable to dislodge the stuburn poison which was running rampant through my troubled body.  The only recourse I had was to try and 'ride the wave'.  My friends began to notice that I wasn't on their giddy train of light, mind alteration... quite the contrary, I was slipping over the edge, I was infact teetering, staring into the void, not sure or capable of deciding what to do.  Although slightly worried, they thought time would bring me right, and took my hand and led me back toward the show.</p><p>The memories I have are slow and lucid, not at all like a hazy drunken night, but like a slow motion replay.  The nudity and debauchery of the show grounds was shocking to my vunerable, and uncontrollable mind. Thoughts of madness came like a runaway train. We walked bewildered through the carnival, I can remember the Dead walking out on stage, and immediately the legions of deadheads morphing from their given form into balls of bright light bouncing on the grass paddock that streched out before the stage.  That was the proverbial last straw.  I immediately sunk to my haunches, hands over face, and accepted that this was to be my life.  I was beaten, with what I had seen and felt in the last two hours, what could possibly make me right again, how could I get back... seeing me in this discombobulated state of disreason and fear, my cohorts pulled me to my feet, and carried me to the back door of the first aid tent.  I can remember my friends pleading for a glass of water, and the workers, who were frenzied with similar cases of overuse, demanding we leave, citing the long queu out the front entrance.</p><p>Then, mercifully, they saw my beaten eyes, possibly straight through to my troubled soul. He can stay. I remember vividly a kind hearted, sweet middle aged women leading me to a green army cot. Lay down my son.  Take my hand. what did you take? Pills? Acid? I took mushrooms, a big handful, and now nothing is right, what the fuck is wrong with me, can anyone help... Gripping my hand with a comforting strength she spoke softly and directly. The Grateful Dead pays me to travel with them and help people in your situation. You will be fine. With this I stepped back away frow the edge. with every word I was farther from the breach which I was beginning to view as home.  She spoke for ten minutes, or was it an hour.  In the end I lay there, unable to move, and staring directly into the most beatiful blue eyes I had ever come across, and they stared back. The light was gone and the people were again dancing.  An hour and half later, the day was a gift, as were many to follow.</p>"
}
