{
 "title": "One Month Experience",
 "author": "Bob",
 "citation": "   Bob. \"One Month Experience: experience with Piracetam & Lecithin (ID 75419)\". Erowid.org. Jun 16, 2009. erowid.org/exp/75419",
 "substance": "Piracetam & Lecithin",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.6 g",
   "oral",
   "Lecithin",
   "(daily)",
   " ",
   "  repeated",
   "oral",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 75419",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 16, 2009",
   "Views: 17354",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have experimented with many illegal drugs and herbal drugs.  I am very sensitive to most drugs; I am the essence of lightweight.  My 100 pound girlfriend can outdrink me.  Despite my sensitivity to most drugs, I noticed absolutely nothing from piracetam.  </p><p>The day my order came in I did an attack dose of 3200mg.  Then proceeded with 800mg every 4 hours  taking a total of 5600mg that day.  The next day I decided to increase my dose to 1600mg every four hours, taking a total of 6400mg per day.  I did this for three weeks straight without noticing any effects.  After two weeks with no success I decided to take 9600mg in the morning and 9600mg in the afternoon.  I did that for a week with no results.  I started taking lecithin many months before I discovered piracetam.  I stuck with my regular lecithin schedule which contains 1.6 grams of phosphatidylcholine per day.</p><p>The setting was constantly changing over the course of a month.  I am in college, I work in the accounting department, and I train my dog in agility courses daily.  So I was doing things that are mentally demanding but these things did not seem any less demanding then usual.  I read a couple of challenging philosophy books while on piracetam, but I did not feel my mind working any harder than usual to rearrange how I perceive reality.  The only answer I could think of to explain why I did not feel anything and why others receive powerful effects is because my brain already communicates very well between hemispheres, and my brain already has an overactive acetylcholine system.</p><p>A final note, the stuff works great on my dog.  I gave him 1600mg once in the morning for a week and I noticed that he had more mental energy than usual. He usually trains at full force for about 30 minutes straight, twice a day that day he trained at full force for more than an hour during his first workout.  I count his jumps, he usually does 350 jumps between two separate workouts on his hardest training day of the week.  On that day he did 600 jumps.  400 the first workout, 200 the second.</p><p>On another day I do a training routine where he chases a bouncy ball around the basement with a strobe light on, to enhance his sensory perception.  I noticed that while on piracetam, after about 5 minutes, he would fetch the ball almost as quickly as he would without the strobe light on.  So maybe piracetam helps with timing skills.  Retrieving a ball that you can only see half the time requires good timing skills.   </p><p>Even though he has more mental energy while on piracetam, he does not seem agitated.  He can still sleep at night and nap during the day.  He is not startled by loud noises.  He does not seem hyperactive or over stimulated at all, he just trains harder and faster.  So the effects seem to be energizing but not like that of a typical stimulant.</p>"
}
