{
 "title": "My Life as a Robot",
 "author": "Saicho",
 "citation": "   Saicho. \"My Life as a Robot: experience with Robotussin (ID 7542)\". Erowid.org. Jun 19, 2003. erowid.org/exp/7542",
 "substance": "Robotussin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7542",
   "Male",
   " ",
   "Not Given",
   "Jun 19, 2003",
   "9066",
   " "
  ]
 ],
 "report": "<p>My second experience with the red elixir differed significantly from my first. (Note: The first time I drank Vicks, this time Robotussin; I had slightly more this time. I know not if these factors had much effect on my experience, but I thought it important to mention them)</p><p>At 11:50 PM, I downed the bottle of Robotussin, alternating between swigs of it and swigs of orange juice. I found the taste nearly unbearable, much worse than that of Vicks. Though I managed to down the whole bottle, by the last couple swigs I practically gagged when I took it in and had to hold it in my mouth a few moments before my body would allow me to swallow it.</p><p>Afterwards, despite the stomach ache, I ate a few cheetos. These worked well to eliminate any aftertaste. As I was coming up on the DXM, I bided my time by reading a few reports on this site. I found different regions of my body feeling warm, pleasant buzzes, and my stomach feeling generally unhappy. I also found I had to focus harder in order to read the reports.</p><p>After about twenty minutes of this, I decided to head outside. It was a warm June night, and I went and sat in my father's jeep (which has its doors and top off) and reclined in the seat. This was a relatively comfortable position, and I smoked a cigarette while staring at the stars.</p><p>The buzz from the cigarette was intensified by the roving body buzzes I was feeling from the Robotussin. My stomache, however, remained dissatisfied with my Robotussin and Cheeto meal, and made itself known. Still, I was more happy than I was uncomfortable, and I had another cigarette while reclined in the seat.</p><p>A bit later I decided to try to walk around the block and enjoy the night. The Robotussin had made me very cold blooded, and being outside even in a summer night I was becoming chilly. After a few steps out of my driveway during which I felt very disoriented, I decided to sit down and smoke again. Robotussin had made me a chain smoker at this point, but I found cigarettes very enjoyable (whereas they had been so-so last time).</p><p>I worked up the courage to stand up again, moved a few more feet, then promptly sat down again. This time my cats came up to me, and I pet them while smoking my old cigarette. I stood up again and started walking, and found it pleasant. My stomache stopped grumbling for a little while and I began to stroll around the block.</p><p>It was a pleasant night, and I finished my cigarette while traveling. The Robotussin made me sort of walk automatically, and despite the cold, I enjoyed myself. Nothing exceedingly interesting happened on my walk, except for when I laid down in the street to stargaze and a car drove down a nearby road and the driver gave me a weird look.</p><p>I moved back into my house and into my room, by this time it was 1:40 AM. I turned on my TV and laid down in my bed. The last time, when I chugged Vicks, I found TV absolutely boring. This time, it was totally different: reruns of Saturday Night Live were endlessly entertaining. My body felt really good and really relaxed, sort of how it did when I took four or five Vicodin. This feeling lasted for about an hour. I smoked a few more cigarettes during this time, and found moving around at all caused intense discomfort in my stomache (when I moved it felt as if all of a sudden a small shotput pushed down in the pit of my stomache).</p><p>Despite this discomfort, I made a foray into the kitchen. While walking I felt pretty sick, but it also felt as if I had no legs, only feet and my torso and up. This was an interesting experience, and not unlike the floating feeling I have with low doses of Ketamine. When I got to the kitchen, I opened the fridge and got a nectarine to get the cigarette taste out of my mouth (though I am addicted to cigarettes, I smoke irregularly so they still taste bad). By this time I had smoked around a third my pack, and wanted to save most for later. I finished my nectarine and the taste was mostly eliminated, but each piece reaching my stomache felt very unpleasant.</p><p>By this point I was pretty much coming down, after about a four hour DXM kick. What I found so fascinating is how different my two experiences with DXM have proven: my first experience was a mind-expanding trip in which I felt tremendoous creative energies released and felt a general well-being towards life, my second was a more 'traditional' high, with a body buzz, disorientation, that cold-blooded feeling, stomach discomfort, and a floating feeling. My second was much more of a 'stupid' high, in that I did not do a great amount of thinking during it, nor did I write much save this report at the end.</p><p>Going over the events in my mind, the only things I can imagine that could change were the experience were the brand and the dosage. My mood is pretty much the same, as these experiences are only a few day apart, and the only other difference is yesterday I expiremented with a low dose of dramamine (200mg) to see what that was like.</p><p>DXM has, overall, proven to be a mixed bag of nuts. On one hand, it seems to be able to make my mental faculties flow better (allowing me to write more well than usual) and it can make for a fun night, but on the other, the taste with certain brands (named Robotussin and Tussin) has proven to be unpalatable for me, and the stomache problems that can plague me thereafter can be very detrimental to the experience. I would strongly recommend taking Vicks, as it seems to be much better tasting (whilst being far from good) and easier on the stomache.</p>"
}
