{
 "title": "Mellow Experience in Large Amounts",
 "author": "Brainiac",
 "citation": "   Brainiac. \"Mellow Experience in Large Amounts: experience with Erythrina mulungu (ID 75459)\". Erowid.org. Nov 5, 2009. erowid.org/exp/75459",
 "substance": "Erythrina mulungu",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 tsp",
   "oral",
   "Erythrina mulungu",
   "(powder / crystals)",
   "  T+ 1:00",
   "4 tsp",
   "oral",
   "Erythrina mulungu",
   "(powder / crystals)",
   "  T+ 2:00",
   "3 tsp",
   "oral",
   "Erythrina mulungu",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 75459",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2009",
   "Views: 12438",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a neuroscientist in a medical center and an experienced user of just about any drug, herbal or otherwise, designed to mellow people out. For three straight years running, a bit of marijuana was my go to substance in the evenings, but the withdrawal I experienced when taking a break from it last year was so nasty that I just can't imagine going back. Yes, there is such a thing as withdrawal from marijuana. When it happens to me, it typically kicks in about 3 weeks after quitting, not immediately after, and brings with it horrible insomnia/anxiety. Ugh! Luckily it does end after a few really uncomfortable weeks.\r\nWhile I don't drink much alcohol (maybe 1 drink a week), I do like the occasional benzodiazepine, like Xanax or Ativan, in the evening for relaxation/sleep, particularly after giving up the devil's lettuce. Tolerance, dependence and withdrawal are big problems with these drugs, so I do not take them on a daily basis for more than a week or so at a time. I like to provide breaks to allow for the drugs to wash out of my system, preferably three days off for every three days on. So, on off days, I like to experiment with various herbal alternatives and have tried all that I am aware of - Valerian (does nothing for me), Kava (absolutely nothing for me), Kratom (nice but will steal your soul!), Corydalis (makes me feel depressed), California poppy (nothing for me), Hops (nothing for me), Lagochilus inebrians (nothing for me), Phenibut (1 gram is nice and mellow, any more causes a hangover, tolerance is a problem) and the list goes on and on. \r\nI thought I had tried everything until I recently stumbled across some information about a tree, called Mulungu, that grows around the Amazon. Apparently, it has been used for 100s of years in South America as a sedative and general mellowizer. So, I ordered a pound of powdered bark and decided to give it a try. I was unable to find any real dosing information beyond a few anecdotal reports. Based on one user's experience, I decided to start with three heaping teaspoons, probably about 15 grams. Rather than making a tea, I simply mixed it in some water with some orange flavored powder and chugged it down. Not bad. \r\nWithin 30 minutes I noticed the same kind of experience most users report. Mainly a tranquilizing effect, meaning that I was quite mellow but not necessarily very sedated. I sank into my couch and started to watch a movie. After an hour, I decided to add another dose, and so drank four more heaping teaspoons. This intensified the mellow effect but didn't really change the experience. After another hour, I added another three heaping teaspoons, bringing the total to 10 heaping teaspoons in three hours. \r\nWithin 15 minutes or so of the last round of teaspoons, my phone rang. I was surprised to find that my motor coordination was seriously impaired despite the fact that I wasn't aware of any significant muscle relaxing or sedating effect of the bark. My speech was a bit slurred and moving my lips was a bit of a chore. Another user reported the same thing and cautioned others not to drive after taking Mulungu because one's motor coordination can be impaired even if you don't feel a heavy buzz. After my experience I would have to agree.\r\nTwo hours later I decided it was time to get some sleep. I sank into my bed and expected to sleep deeply. To my dismay, just as I drifted off to sleep I awoke suddenly with a bit of a panic. At least two other users have reported this. For some reason, perhaps only when the dose is high, some people spring back to an awakened state immediately after falling asleep on this stuff. This happened a few times until I finally did fall asleep. I had bizarre dreams, but I always do so it's hard to attribute it to the bark.\r\nSeveral users reported that they had deep, personal epiphanies after taking Mulungu, like that they should really quit smoking or change themselves in some other important way. I don't smoke, so I wouldn't know about that part. But I didn't really have any deep insights or revelations on Mulungu, just a mellow experience a lot like Xanax.\r\nIn sum, after taking what must have been a total of 45-50 grams of Mulungu over a three hour period, I can attest to its mellowing properties. While others have reported that you can literally knock yourself out with this stuff, that certainly wasn't the case for me. It is definitely better than an alcohol buzz in that it takes the edge off of anxiety/worry without a heavy drugged feeling. Motor coordination is definitely impaired even though it doesn't feel like it should be. I would compare it favorably to Xanax. \r\nIs it worth the money and hassle? At this point I would say no. The dose, at least for me, had to be huge, which required drinking gobs of powdered bark. Tonight I will try it as a tea and will stick to one dose of 4 heaping teaspoons (probably about 20 grams). It seemed to me that there was no real advantage in repeatedly dosing, as the effects certainly did not increase linearly with the dose. There is a chance a tea might work better by liberating the active components before the bark is ingested, but I doubt it. All in all, I think it is worth having in one's collection of herbal options for relaxation, and it does seem to be an adequate replacement for low doses of Xanax (like 0.25-0.50 mgs), but it's not a 'must have' substance by any means.\n\n\n"
}
