{
 "title": "Natural Ecstasy",
 "author": "Alex",
 "citation": "   Alex. \"Natural Ecstasy: experience with Tabernanthe iboga (ID 75558)\". Erowid.org. Dec 9, 2008. erowid.org/exp/75558",
 "substance": "Tabernanthe iboga",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Tabernanthe iboga",
   "(rootbark)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 75558",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 9, 2008",
   "Views: 11256",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Age 21, 5'10'  </p><p>So I got tired of waiting around for someone to offer me lsd so I decided to search online for natural plants that contained psychedelics.  So i found many plants that interested me.  One in perticular being Ibogaine in the iboga root bark.  I did some mescaline the other day before I tried the iboga and thought that the iboga would have similar effects than the mescaline.  Wrong.  Iboga is totally different.  More powerful.  </p><p>At first i ordered 2 grams and grinded it up in coffee grinder and mixed it with a fruit drink to mask the HORRIBLE taste.  After an hour or 2 i feel as if i am roling on ecstasy and I also saw some flashing and then it went away after a few hours.  So  I then ordered 4 grams after and then grinded it up in my grinder and drank it with fruit drink.  I was in my apartment with music playing on my computer while also playing visualizations on winamp.</p><p>After two hours i threw up and the felt better and started to trip. I should have taken pepto-bismol an hour after i drank the iboga so that I did not have to through up the iboga. </p><p>I started to feel it.  Started to see things. colorful texture on everything. </p><p>After about 5 hours a new stage in this drug experience happened.  I began to feel different, the drug was kicking in more!  I can try to describe what was going on with me.  This drug was making the smarter. Opening up my head so that I could think VERY clearly.  Normally my memory is bad because I smoke a lot of marijuana and usually forget what I am saying or thinking and can not recall it ever, but with the iboga I could remember everything with lighting speed.  It has been 2 days since I have done it and my head is still above what it should be.  The drug made me think of different persectives on live that I would have never of thought of with out this drug.    I felt free, I felt smarter and I felt as if a new chapter in life has started for me.</p><p>The drug lasted about 15 hours and i still had some after effects more than 24 hours later. I am ready for 8 grams.</p><p>I dont' know why there are no good experience reports about this drug, so I decided to give ya'll some information. I am also planning on extracting dmt from plants and drinking Ayahuasca.  5-meo-dmt looks interesting too.  I love san pedro cactus too!  I want to try shrooms too.  I am growing them now. (fyi)</p><p>Overall the experience was unforgettable and very theraputic for me.</p>"
}
