{
 "title": "Be Careful With Labeling",
 "author": "Prae",
 "citation": "   Prae. \"Be Careful With Labeling: experience with Aniracetam (ID 75578)\". Erowid.org. Mar 8, 2009. erowid.org/exp/75578",
 "substance": "Aniracetam",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4.0 g",
   "oral",
   "Aniracetam",
   "(capsule)",
   "  T+ 12:00",
   "4.0 g",
   "oral",
   "Aniracetam",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2008",
   "75578",
   "Male",
   " ",
   "Not Given",
   "Mar 8, 2009",
   "Views: 22635",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Due to cost concerns, I hand pack my own piracetam and aniracetam capsules.  I normally take one aniracetam three times a day and four piracetam three times a day, for a total of about 1600mg aniracetam and 12 grams piracetam.  The piracetam is already a higher-than-recommended dose, due to perceived ineffectiveness.  After packing a new set of capsules and taking them to work, I had forgotten to label them properly (I put them in old glucosamine bottles) and accidentally took aniracetam at piracetam dosages for two rounds.</p><p>I estimate to have taken 7-9 grams of aniracetam in two dosages over twelve hours.  This is about three times the maximum recommended daily dosage of 3000mg and 5 times what I usually take in a day.  Starting about an hour after the first dose (~4g), I felt intense nausea and intestinal discomfort, attributed to food at first.  Over the next two hours the regular mental effects kicked in, with some side effects of racing thoughts, inability to concentrate as highly as usual, and general cloudiness, normally racetams produce mental clarity, this effect was reduced and eventually reversed.  At about T+4:00 after the first dose, a massive headache began to set in along with dry mouth.  Ibuprofen (2x 1000mg) was ineffective, but acetaminophen (1x 700mg) may have had more of an effect.</p><p>Another ~4g of aniracetam was taken at T+12:00 before I realized my error.  Approximately 30 minutes later, dry mouth increased substantially and the headache grew in intensity.  The nausea was persistent but bearable.  My head felt disconnected and cloudy, similar to 'medicine head' from cold medications.  Writing and typing became more difficult than usual due to shaky hands, and work in general was very hard to accomplish.  It appears as if aniracetam at this level might take on some stimulant-like effects, which are absent at lower dosages.</p><p>Symptoms began to subside at T+18:00, but the headache persisted for approximately 24 hours.  In general, the experience was a bad one and I will more closely watch my dosages.  I had never before taken more than 5g of aniracetam over a 24 hour period (3 dosages 8 hours apart), which is beyond where the positive effects plateau.  All of the positive effects of aniracetam were cancelled out and then some at this high of a dosage.  It is not recommended at all- staying within the 3g/day range will do just fine.</p>"
}
