{
 "title": "He Lives on Through Me",
 "author": "Wiccan_seeker",
 "citation": "   Wiccan_seeker. \"He Lives on Through Me: experience with 2C-E & Mushrooms - P. cyanescens (ID 75592)\". Erowid.org. Jan 16, 2010. erowid.org/exp/75592",
 "substance": "2C-E & Mushrooms - P. cyanescens",
 "bodyweight": "320 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 mg",
   "oral",
   "2C-E",
   "  T+ 11:00",
   "0.25 g",
   "oral",
   "Mushrooms - P. cyanescens"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 75592",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 16, 2010",
   "Views: 5649",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis isn't a report of some frightening overdose on a research chemical with the tripper barely making it.\r\nNo, its a story of what most would consider a completely uninteresting dose of 2CE, and the completely unexpected result.\r\nI've been tripping for 15 years now, and every once so often something utterly gobsmacking happens completely out of the blue - something that never ever happened before.\r\nLast sunday, on a small dose of 2CE, this proved to be the case once more.\r\nMy best friend and I took 2CE, He took 12mg and I ended up taking 4mg, a dose which for me works out to be about as active as a gram of Cubensis mushrooms, typically about 6mg Psilocybin, which to my high sensitivity is a good amount. His girlfriend was to be our sitter, in case issues needed working through.\r\nThe effects came slowly, building to full intensity over about 2:30 hours, and the effect itself was quite relaxing and tremendously slow, compared to the hectic nature mushrooms and LSD tend to have. It was in many ways similar to the mescaline experience we had weeks earlier with San Pedro cactus.\r\nThere proved to be very little going on for both of us, the psychedelic effects were almost generic. We were sitting wrapped in blankets, tripping in a comfortable way and calmly having a meaningful discussion in complete darkness, while our sitter listened in and meditated to pass the time. The day before we had been her sitters, and there was much for her to meditate on.\r\nMy friend and I noticed unpleasant vasoconstriction from the 2CE, especially my friend with his higher dose was unpleasantly affected. I'm a cardiac patient and always have a bottle of sublingual nitroglycerin spray at hand to counter angina pectoris attacks. My (healthy) friend decided to want to try using that to counter his vasoconstriction, and took 800 micrograms of nitroglycerin sublingual, and I followed suit. For both of us the nitroglycerin's vasodilation proved to counter 2CE's vasoconstriction comfortably, but not completely.\r\nAs time progressed my friend decided to go to bed to try get to a deeper level meditatively, and I did the same, turning inward in near complete darkness, wrapped in a comfy blanket on their living room couch.\r\nUp until then the 2CE had been both enjoyable and relatively uneventful. But all that was about to change, fast!\r\nI gazed inward to observe sparse visuals. I believe I had my eyes closed for 10 minutes when suddenly something came from beyond, as we in Holland say: 'like a clap of thunder from a clear sky'.\r\nSuddenly as if a valve was opened wide I was flooded with memories, imagery and emotions. At first obscure, it soon became all too clear what was happening: I was being flooded with memories from a past life, from the life before this one.\r\nI've always been a tad skeptic about 'past life memories' but however real or illusory the phenomenon is - it happened to me.\r\nIncredibly detailed memories that spanned all senses, sight, sound, touch, smell, taste it was all there, and all wrapped in strong emotions that felt 100% authentic.\r\nMy rational mind frowns at the thought of past life memories but the experience, the flood of sensations, was completely authentic, as if indeed I remembered it.\r\nMy name was Salim. I was a black orphaned child who lived homeless on the streets in sub-Saharan Africa. I lived in hunger, trying to survive, in the 1960s and early 1970s. I died by a lung ailment that made white slime froth from my mouth about 12-13 years old, to be reborn shortly after in my current life.\r\nThe memories came and came and at first I was overcome by the tragedy of it all and cried for well over half an hour, mourning my past life and agonized death, where I died so young starving and choking on my own fluids.\r\nThough I believe in reincarnation, I never gave Karma much thought. This experience was chock full of unmistakable Karma. Much hopes and desires of that abysmally poor boy had I sought after and fulfilled in this life. Issues which then were important, carried over to this life. The story wasn't alien to me in the least bit, because so much of my current life which I couldn't put my fine on is a LOGICAL consequence of that past. There were parallels beyond belief, tiny ones and really big ones.\r\nThe defining word here is *authentic*. It felt so completely authentic with details so blatant and trivial, you just can't make that up.\r\nThis whole outpour lasted over an hour, then the faucet closed with the return of my friend.\r\nThough I cried and cried for much of it, it at NO point was a 'bad thing'. It was a homecoming. It was remembering something long forgotten but ESSENTIAL to life as it is now.\r\nThe trip returned to more mundane matters, and hours went by. When my friend and his girlfriend went to bed, after 11 hours had passed, I decided to take a quarter gram of Psilocybe cyanescens mushrooms (typically containing about 3-4mg Psilocybin) to see if I could reconnect with the past life experience.\r\nCould I ever!\r\nAlone in the night, I partially regressed to being that young boy, while at the same time aware of whom I was now. Salim was absolutely overjoyed to be alive and was utterly amazed to find himself as a fully grown white man, staring at his/my arm and hand in utter amazement, making little dances of joy quite uncharacteristic of an obese white guy in his mid-30s and gasping a few equally uncharacteristic Allah Akbar's at the miracle of it all.\r\nThe regression was partial and I felt being both lives simultaneously. He looked through my eyes, when I ate something he tasted it it too.\r\nAnd all the while memories poured in. Memories of staring at a torn poster of a Hindi cinema movie and being enthralled by all the wealth and glamour, as opposed to his own life of poverty, memories of his best friend Achmed/Ahmed (he couldn't read or write so I had to reconstruct phonetics) who was a bit older and watched over him like a brother, speaking to him saying things like: 'Achmed - there IS life after death' and being convinced that all would be well if he could just find Achmed again.\r\nPartially regressed I took pen and paper and wrote down memories as they came. Reading it sober, a few days after, it reads like it was both written by a young boy and grown man. Later the experience faded, and I was convinced I will learn more from this in sessions to come.  I went and put some verifiable things through Google and indeed some words I remembered were in the Swahili language, as is the name, and the East African region where this is spoken indeed is Muslim to quite some extent.\r\nI went to bed and slept well.  The next day I was high with excitement to have experienced the utterly unexpected, yet what I felt and feel is an important piece of the puzzle of my life. To me its not completely important whether the experience related to authentic reincarnation or was a symbolic abstraction made in this life. It was a truly awesome experience that I feel did me quite some good.\r\nAn uneventful trip giving rise to what in every way feels like a past life recollection, a phenomenon I used to be skeptic about.  You are never too old to learn.\r\nMr. Alexander Shulgin, thank you for bringing this amazing molecule into this world.\n\n\n"
}
