{
 "title": "Liver Pain",
 "author": "PBlair",
 "citation": "   PBlair. \"Liver Pain: experience with Codeine (with Acetaminophen) (ID 75620)\". Erowid.org. Jul 7, 2009. erowid.org/exp/75620",
 "substance": "Codeine (with Acetaminophen)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Codeine",
   " ",
   "  repeated",
   "oral",
   "Acetaminophen"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 75620",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 7, 2009",
   "Views: 18806",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'll try to keep this short and sweet. I'm an alcoholic. And I've done just about every drug in the book. Anyway...\r\nI was in a foreign country (name omitted to save myself, but suffice to say it's developing) and I discovered that they had 30/500 codeine effervescent tabs.  Over the course of a week I began experimenting with them.  Trying different combinations including drinking on them. Bad idea.\r\nOver the course of one day, I took roughly 250mg worth of codeine. I had attempted an extraction, but I can't really guarantee how much codeine was extracted. I started at about 3PM and felt great.  I slowly sipped the concoction over the course of the evening and by midnight I was feeling good but a little disaffected, kinda weird.  I finished the last of it at about 1PM and started kinda getting worried that I might have taken too much.\r\nI sat out for a while and didn't exhibit any of the signs of opiate overdose but about 3AM I started having a pain in my side, about where my liver was.  I started freaking out and didn't get much sleep.  I woke up the next day and felt miserable, and my side still hurt. I made the decision to go to the clinic.\r\nAt the clinic, I was admitted with severe dehydration and possible paracetamol overdose. The estimated possible amount of paracetamol I could have had in my system was 5500mg (I probably extracted at least some of the paracetamol decreasing the potential amount), well below the threshold for a normal person, however I am an alcoholic which greatly decreases the toxicity level.  Suffice to say, had I been in a developed country, I would have had access to better health care, blood tests and the antidote for paracetamol poisoning. I had access to none of these.\r\nNow it's just going on 72 hours since I first experienced pains and I'm still alive, but kinda nervous. I was discharged this morning with the instructions to drink plenty of water and juice.\r\nThe moral of the story is not to mess with paracetemol if I am an alcoholic. Seriously, it causes some serious problems and I'm still not sure I'm in the clear.  Additionally, I ought not mess with drugs like that outside the developing world.  I really begin to realize that my life isn't worth anything when I am lying in a clinic watching children die from cholera.\n\n\n"
}
