{
 "title": "Exam Preparation",
 "author": "J",
 "citation": "   J. \"Exam Preparation: experience with Ginkgo biloba & St. John's Wort (ID 7572)\". Erowid.org. Jun 19, 2003. erowid.org/exp/7572",
 "substance": "Ginkgo biloba & St. John's Wort",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "6 capsls",
   "oral",
   "St. John's Wort",
   "(capsule)",
   " ",
   "9 capsls",
   "oral",
   "Ginkgo biloba",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7572",
   "Not Specified",
   " ",
   "Not Given",
   "Jun 19, 2003",
   "Views: 32870",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nBeing a university student in Britain is not easy these days unless you have rich parents. I don't, so come exam time I was extrememly stressed having spent most of the year struggling to pay the rent and my tuition fees, rather than studying. Maybe if I hadn't smoked as much weed I wouldn't have had to work as much to pay rent, but if you can't smoke weed what's the point of going to Uni? </p><p>Anyway, about a month before my exams I realised that I was far too stressed to be able to learn all the material I had to learn in the time I had left. I decided to take a combination of 6 St. John's Wort pills and 9 Ginkgo every day until exam time (2 St. John's Wort and 3 Ginko biloba, three times a day). I had heard that St. John's Wort works like Prozac and Ginkgo helps with concentration. After the first day I started feeling the effects of the St. John's Wort. I felt like I had more control over my situation. After a week or so I noticed that my concentration span had increased dramatically. Before I started taking these herbs I could concentrate on a text for about 15 minutes. After this I would have to keep going back and reading the same paragraph over and over. I would get frustrated and start thinking about the injustice of the system that didn't give me enough time to study during term. </p><p>After a week or so on the two herbs, I found I could concentrate on a text for 40 minutes quite easily. I didn't get stressed out and distracted while studying anymore and I felt very focused when I was working.</p><p>An hour before each exam I took ten ginkgo pills, and drank a can of red bull energy drink. I didn't have any St. John's Wort because I ran out a few days before the exams started. I felt confident and answered all the questions to my own satisfaction, so hopefully I passed.</p><p>Around the time of the exams I noticed that my memory seemed to be working more efficiently than before. For example, I found myself able to remember the phone number of a bus company that I had seen at the bus stop but had never tried to phone before. I found myself able to remember other phone numbers as well that I had never tried to learn. As well as this I found it quite easy to spend hours reading complex texts like Hippolytus's Refutation of All Heresies.</p><p>A course of Ginkgo and St. John's Wort is ideal for reducing exam stress and improving the brain's capacity to study. I just hope my confidence that I passed wasn't an effect of the drugs!</p>"
}
