{
 "title": "A Fine Time",
 "author": "Jacked",
 "citation": "   Jacked. \"A Fine Time: experience with 2C-P (ID 75859)\". Erowid.org. Dec 22, 2008. erowid.org/exp/75859",
 "substance": "2C-P",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 mg",
   "smoked",
   "2C-P",
   "(powder / crystals)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Tea",
   " ",
   "  T+ 3:00",
   "6.0 mg",
   "oral",
   "2C-P",
   "(powder / crystals)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 75859",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 22, 2008",
   "Views: 17672",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a 25 year old male weighing 120 lbs. I do not take any drugs or supplements.</p><p>Substances: 2C-P HCl & 15% alcohol (1 shot)</p><p>Dose: 8 mg total (2 mg smoked, 6 mg orally)</p><p>Mindset & Setting: I'd had a long sleep the night before, and a meal (fish sticks) a few hours before dosing.</p><p>Experience: This was my first time trying this substance. I've done many other tryptamines and LSD many times before, but only MDMA and 2C-T-2 (one time) as far as phenethylamines.</p><p>Preparation: I weighed doses out with my +/- 2mg-accurate scale. I weighed the amounts at least 5 times to ensure a fairly accurate reading.</p><p>I started at 4:00 PM with 2 mg, vaporized off of aluminum foil. That gave me a head rush, and I felt sick from the taste. Felt like that over the next hour, in varying degrees. Tracers in 4 minutes... Not much else besides confusion, anxiety, my mind wondering, and general difficulty focusing. My train of through derailed with ease. As far as visual effects... there were pretty cool tracers (they follow my hand when I move it sort of like smoke) at 2.5 hours, but nothing else. My pupils not dilated. I had some green tea in that time.</p><p>I took another ~6mg orally (in a shot of alcoholic egg nog) @ ~7:00 PM. It did not dissolve in the egg nog (even with stirring and poking, it just floated on the surface). Felt strange at 7:30. My neck hurts, but I have horrible posture at work. Perhaps it is just telling me to work on that? That sounds a little mystical, but I don't know why else my neck would hurt. It does not normally hurt. That went away after maybe 20 minutes. At 7:36, I saw rainbows in the halos around car lights. This is many times a 'first alert' that a very visual trip is coming on. At 8:00 PM, I got lots of energy and my mood became much better. The visual stuff started too.</p><p>I never felt any nausea.</p><p>The close eyed visuals were great, although I don't quite remember what exactly I saw, except that fractals and many colors (especially yellow) were involved. There was lots of visual stuff going on. I was glad to see so many beautiful Christmas lights on houses and buildings. Sometimes I had to blink my eyes to be able to see, the visual stuff would just take over my visual field... although that's not exactly how it was, it's hard to describe. Many times I was very relaxed while sitting and felt almost as if I could doze off. I yawned many times after about 4 hours from the second dosing. At 10:00 my pupils were quite dilated. I drank a whole bottle of water (which I bought at a store with no problems) and I still could not urinate every time I went into a bathroom. I went into about 7 stores' bathrooms trying to urinate. I got off the city bus 3 times because I thought I was going to piss my pants. It was like torture. Although I've sometimes had similar problems tripping on other drugs (mushrooms, most notably), it has never been this bad, and I've always been able to urinate once I got to a place where I could acceptably. I ended up urinating after I'd gone to bed and slept for 10 hours. My urine was a darker yellow than normal.</p><p>My trip was pretty visual, but mellow at the same time. The visual effects were not intricate patterns everywhere and were not moving, swirling or 'breathing' facades or walls either. It was more like floating abstract art that moved with my eyes. I was out in public and kept it together very well. Mentally, there was not a LOT going on, but I did take stock in a few things, and I told myself I need to get my stuff together and get rid of some unnecessary, risky things I do and refocus that energy on productive and life-enhancing projects. I was pretty rational with my thinking too, but could be side tracked easily.</p><p>I walked past some cops in the dark and they were kinda out of breath, like they'd just been running and they were talking to each other I guess about what just happened. I walked past them, saying hello without struggle. Their banter was amusing.</p><p>I had a lot of paranoid thoughts, especially towards the end of the night, but I am kind of a paranoid person even when sober, and I do not smoke marijuana. This could have just been an enhancement of my natural paranoia and not something to be blamed on the 2C-P experience. I even went so far as to turn off my cell phone and take the battery out when it said 'searching' trying to pull up information! I've never seen it do that before.</p><p>Briefly, when I got home and was sitting in the bathroom (again trying to urinate) around 1:00 AM, I heard music in my head (that which could be made by synthesizers and percussion instruments) when there was no sound. There was also some wah-ing and distortion of sounds earlier in the trip.</p><p>2:00 AM: Not tripping as hard as I was hours ago.</p><p>2:16 AM: The crazy visual stuff is winding down significantly.</p><p>I could not sleep, but lay in bed under covers until about 8:30 AM, when I finally fell asleep. I woke up once after 5 hours, but went right back so sleep for another 5 hours.</p><p>I did not feel hungover the next day.</p><p>To sum it up, I felt that it was very nice - a lot like LSD, in fact, and I will be doing it again.</p><p>\nOn the subject of a nickname for 2C-P, I suggest 'Plexus' be adopted. I've been calling it that. The reasoning for this is 2C-B has a nickname of 'Nexus' and the P in 2C-P logically lends itself to Plexus (which rhymes with Nexus, of course).</p><p>Definitions:</p><p>Nexus: A connection or the centre of something.</p><p>Plexus: A combination of interlaced parts; a network. Or: any complex structure containing an intricate network of parts.</p><p>Derived from: Mod.L., lit. 'braid, network,' from pp. of L. plectere 'to twine, braid, fold,' used of a network, such as solar plexus 'network of nerves in the abdomen'</p>"
}
