{
 "title": "Bitterness Without Peer",
 "author": "Jurdoc Kordian",
 "citation": "   Jurdoc Kordian. \"Bitterness Without Peer: experience with Nutmeg (ID 7591)\". Erowid.org. Jun 4, 2003. erowid.org/exp/7591",
 "substance": "Nutmeg",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "4 Tbsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7591",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 4, 2003",
   "Views: 16289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few nights ago, being out of marijauna and currently too enlightened from a previous salvia experience, I decided to try eating nutmeg, and I must say I approached with low expectations.  As with any new plant or substance I try, I READ UP about it before trying it, and I highly recommend this for everyone who is about to do something new, often I have found this can save you an unpleasant experience if you can have a general idea how you expect to react.</p><p>I read of one person's experience in which it was suggested something be used to blot out the taste of the nutmeg, and believe me you will need it.  It's taste is indescribable but horseshit should do for now. In fact I am convinced if I were to ever eat nutmeg again I would truly be out of my mind based solely on the fact that it tastes SO BAD.</p><p>So I decided to eat 4 tablespoons of nutmeg, which is easier said than done.  I started by choking down one spoonful and wished for all my luck that i could throw it up because it tasted so bad.  I then proceeded to head upstairs and grab some pepsi and lemon juice and i made a half and half mix of that, which I used to follow down the remaining 3 tablespoons, which was certainly a task in itself.  The problem that ground nutmeg poses (which is what I was eating) is that it is a very absorbant powder, so it basically is like eating sand who's bitterness is without peer.  </p><p>About two hours after eating, I began to feel rather high like I had smoked a lot of weed.  I lost a bit of my coordination and walking around became a bit difficult.  I was sitting at my computer playing video games when I decided nothing was really happening, but it was hard to really concentrate on anything anyways due to the terrible aftertaste in my mouth (which, with me, lasted two days no matter what i did, i drank half a bottle of listerine)</p><p>As I was playing I got a strange sense that 'something' was up, but I wasnt sure what.</p><p>Now I shit not here folks, I highly recommend you get yourself comitted if you eat nutmeg based on taste alone, BUT i began to hear soft voices saying things to me, interestingly enough I could not interpret what they were saying.  So I turned off a box heater which was causing distraction and heard nothing...</p><p>I then proceeded to walk outside onto my porch, and I sat there for about ten minutes listening to a tree tell me about how old it was and what my house looked like when it was a younger tree, only it didnt 'TALK' it 'communicated' with me, is really how it went.  At the same time i really didnt believe it was happening because it was just too outlandish...I then walked back into the house and out in 360 degree peripheral vision, and this is hard to explain here, its like all the areas where you 'see out of the corner of your eye' was glowing green light.  So basically i couldnt really see it too well but it was definitely there.  </p><p>I hadnt slept in probably two days so at that point i decided to hit the sack and i expected it to end there, and for the most part it did, with the exception of some really strange dreams that i had about being involved in a three way orgy, what was really odd about it is i was really tripping while asleep, but yet i knew it wasnt real, but yet at the same time i accepted neither explanation that my mind would give me (its a dream, its reality) as fact.</p><p>I woke up rather impressed but with the taste of total ass in my mouth...</p><p>All in all a rather pleasant experience minus the taste...</p>"
}
