{
 "title": "Comfortably Numb",
 "author": "Xanthine",
 "citation": "   Xanthine. \"Comfortably Numb: experience with Kava (ID 7596)\". Erowid.org. Jun 21, 2003. erowid.org/exp/7596",
 "substance": "Kava",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE:",
   "35 capsls",
   "oral",
   "Kava"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7596",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 21, 2003",
   "Views: 29925",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Kava is a very relaxing drug. It's surprising it's not more widely used socially. Perhaps if it had been selectively bred in the same way cannabis plants have been for a few centuries, you could get quite an impressive high from this plant. Sadly this isn't the case, but it's still very relaxing.</p><p>I tried it a couple of times. The first time I simply took about 10 capsules (each containing 300mg of Kava root - no mention of lactones on the bottle). Quite relaxing. Pleasant. Not much more effect. Smoking a spliff, it seemed to enhance the effects of the pot.</p><p>The setting is simply that I was sat at home. Exams finished a couple of weeks ago. I got my results back and was pleased with them. Now it's just a relaxing week or so till I go to get a job for most of summer. And FYI, I smoke pot moderately. I have done for the past week or so anyway. No medications or anything either.</p><p>Anyway, for the next time I made up a little recipe:</p><p>Contents of 35 Kava capsules (empty out the powder)</p><p>1 tsp of cinnamon</p><p>1 tsp of nutmeg</p><p>1 tbsp of honey</p><p>1 tbsp of golden granulated (unrefined) cane sugar</p><p>5 cardamom pods</p><p>1 pint of milk</p><p>Mix the ingredients together in a pan and warm over a low heat, stirring occasionally, till milk is nice and hot. About 20 minutes should be fine.</p><p>I'm going to try and experiment with this recipe. It may be nice with soy milk. Possibly, you could add some ground rice and turn it into a type of kheer (a traditional indian desert).</p><p>Many people would probably hate this concoction, but I found it quite nice. Admittedly, it was a bit hard to taste - it numbed my taste buds a fair bit!</p><p>Drinking this, I experienced a temporary numbing of the lips and mouth as I drank (lasting no more than a couple of minutes) and a pleasantly warm feeling in my stomach.</p><p>Within the next half hour I found myself very relaxed. My arms felt heavy. My mind, working in a slower way. There's a little (extremely mild) visual distortion. Music sounds deeper. Colours look nicer.</p><p>If you have either of them -- play either of Radiohead's latest CDs! =)</p><p>I wouldn't describe it as a high. It feels incredibly mellow. Similar to the feeling you get the morning after a good party (and I don't mean a hangover).</p><p>Later, as the Kava was wearing off, I smoked a spliff to stay chilled and lay down for a while. Extremely relaxed. I meditated for a while. Later that evening, I went out with my flatmates to shoot some pool. I actually found myself still very relaxed several hours later. That said, various people have told me that I'm one of the most chilled out people they've ever met. I guess it comes naturally...</p><p>I'd recommend Kava to anyone feeling a bit stressed out. After an exam, this stuff would be ideal. I think Kava can teach people how to relax. How to take more things in their stride and better appreciate things.</p><p>I like to think I normally take time out to appreciate things (all part of being a stoner), but I know far too many people who rush about all the time. If you find yourself so hyped up that you no longer take time out to enjoy a clear blue sky or properly listen to a good song -- go and have some Kava. Now! =)</p>"
}
