{
 "title": "Enlightened in Karauli",
 "author": "Gerry",
 "citation": "   Gerry. \"Enlightened in Karauli: experience with Cannabis (bhang) (ID 75961)\". Erowid.org. May 16, 2011. erowid.org/exp/75961",
 "substance": "Cannabis (bhang)",
 "bodyweight": "153 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis",
   "(liquid)",
   " ",
   "22 oz",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 75961",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 16, 2011",
   "Views: 3450",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was noon in Karauli, India, after a walking of the town, palace and temple, when our guide pointed out the street stall selling bhang.  As a firm believer in the salutary effects of ganja (having been a regular user-smoking- since the late 60's- I'm now 65) and not wanting to miss the opportunity of a cultural experience, I thought it would be worth trying.  After all, ganja is a holy sacrament in the Hindu religion, the favorite food of Shiva, the Lord of Bhang.  Plus, one portion costs only 5 rupees, or a dime (in Varanasi a portion of bhang was only one rupee!).</p><p>Within 20 minutes I consumed the bhang back at the hotel (bhang is made fresh I should be consumed within an hour of purchase).  I then went to the dining patio to join the rest of the travel group (about 12 other people for lunch).  I was the only person in the group to try bhang at that time, but I was glad that the others knew that I had partaken- there is nothing worse than being stoned and trying to hide it.</p><p>Within minutes of sitting down I felt this intense omniscience. There were multiple conversations going on in the table and I was locked into each one.  I was having a difficult time ascertaining social cues. The conversation across the table, was it ok to interrupt.  A murmur of Hindi emanated from the adjacent kitchen, a most comforting sound.  Other sounds of India (barking dogs, car horns, the call to prayer from the local mosque) invaded my consciousness.</p><p>The experience was quite intense, almost to the edge. I am sure one more bhang portion would have put me into a negative situation. Perhaps my reaction was adulterated by the 22 oz bottle of Kingfisher beer I had (180 rupees- guess what the stimulus of choice is in Rajhastan). The intense period lasted until 5 pm. I could not  nap- ganja, orally taken, definitely had an opposite effect on me from that of smoking. I was fortunate to able to have access to an Indian music channel on the small tv in the room and for the first time I really 'grooved to', as well as the beautiful estate grounds of the hotel, which were tranquil and free of the cacophony and crowds outside the hotel grounds.</p><p>By  7 pm in the evening and after a marvelous afternoon I was feeling incredibly relaxed and serene.  An English travel group on the dining patio group inquired about the results of the U.S. presidential election, and there was an explosion of joy when they heard the news.</p><p>I slept well that evening.</p>"
}
