{
 "title": "Convulsions, Seizures, Vomiting",
 "author": "handsome",
 "citation": "   handsome. \"Convulsions, Seizures, Vomiting: experience with 5-MeO-DMT (ID 76059)\". Erowid.org. Jul 18, 2009. erowid.org/exp/76059",
 "substance": "5-MeO-DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 76059",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 18, 2009",
   "Views: 7043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast night I smoked an unweighed amount of 5-MeO-DMT with friends. I'm guessing 10-30mg. I was not on any MAOIs or any other drugs. I had done regular ol' N,N-DMT once before, a somewhat low dose, and it was great. \r\nMy friend had already hit it, snorted some, then hit it again before I smoked it. He told me to take a big hit so I did, unaware of how much lower the dose is for 5-MeO-DMT. As soon as I pulled the pipe away and breathed in, I felt a tingly sensation spread from my lungs to the rest of my body, all the way to my toes. My vision distorted/blurred/fuzzed very quickly and my body was heavy/relaxed. I remember feeling overwhelmed, but not scared, and slumping against my friend. That's where I blacked out. My friends watched me collapse on the bed, then fall to the floor and start convulsing violently, groaning, eyes wide open, non-responsive, then projectile vomiting, no blood. This in combination with the fact that I was hitting my head repeatedly between the floor and the underside of the bedframe, kicking shit wildly, got my friends to call 911 (one of my friends put her head in her hands and became nonresponsive while the other finally ran to get someone to call). \r\n-EMTs arrived a little while after I stopped seizing. they reported that I was steaming, blood pressure 160/90, heart rate something way over 100. I quickly regained consciousness and helped the EMTs navigate the dark stairs out of the courtyard as I tried to explain what 5-meo-dmt was. I had a CAT scan that showed normal. Now I have medical bills. boooo! stick to regular dmt, i say.-\r\nEMTs arrived a little while after I stopped seizing. Next, I woke up surrounded my paramedics and cops in a chair outside the room. I was steaming, my blood pressure was about 160/90 and heart rate was something over a hundred. In this sobering environment, I was informed that I had been seizing or convulsing violently. I helped the EMTs navigate the dark stairs out of the courtyard as I tried to explain what 5-MeO-DMT was. I felt fine and didn't want to go to the hospital but the cops made it mandatory so I went and the CAT scan was fine, they stitched a cut in my ankle (from kicking a space heater), cleaned up the scalp and forehead wounds, and I walked home.\r\nNow I have medical bills. boooo! stick to N,N-DMT, I say.\r\n[Reported Dose: Unknown; 10-30 ? mg]\n\n\n"
}
