{
 "title": "Nothing I Would Recommend to Any One",
 "author": "L",
 "citation": "   L. \"Nothing I Would Recommend to Any One: experience with H.B. Woodrose (ID 7615)\". Erowid.org. May 31, 2002. erowid.org/exp/7615",
 "substance": "H.B. Woodrose",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7615",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 31, 2002",
   "Views: 8900",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nWell, I'm still coming down from the trip so please excuse spelling and so on. Probably a very stupid idea; writing while intoxicated. But please bear with me. I don't know how much of this I will remember tomorrow. </p><p>Location: My bedroom.</p><p>Mindset: Felt a little blue but not depressed.</p><p>Peparation of seeds: Scraped of the coating with a knife. Chewed and swallowed.</p><p>Sitter: None</p><p>I munched down 5 seeds 5 hours ago. Rinsed them down with water.</p><p>'Bout one hour after consumtion I was gettin real worried and felt very dizzy. I was gettin a little paranoid (well, not just a little; I started to think that I never be normal again). </p><p>The body felt very light. It still does. Not very pleasant though. Although I felt bad and still feel a little weird. I haven't had that much trouble with nausea. </p><p>I felt really long and got scared that if I'd fall to the ground I would break. I had to remember to breathe, 'cause if I didn't I would stop breathing and that would hardly be good. </p><p>Not much visuals. But everything looks strange. Some things seem very big, other things; small. </p><p>Thoughts rushing trough my head made it very hard to relax. I tried to get some sleep but my head simply wouldn't calm itself down. Although I was to tired I felt that if I couldn't get to sleep I would break down and cry, I still couldn't get to sleep. </p><p>Overall a rather scary and unpleasant experience. Not something I would recommend for anyone interested in trippin'.</p>"
}
