{
 "title": "The Exploding Orange",
 "author": "Zona",
 "citation": "   Zona. \"The Exploding Orange: experience with Mushrooms (ID 76185)\". Erowid.org. Aug 21, 2010. erowid.org/exp/76185",
 "substance": "Mushrooms",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 76185",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 21, 2010",
   "Views: 1433",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was the middle of first semester my sophomore year when I decided to take mushrooms of the magical sort for the first time.  I had heard many horror stories of bad trips, and been warned by many friends that this may not turn out the way I wanted.  However my excitement to enter the psychedelic world overwhelmed my fear of having a bad trip.  </p><p>I had wanted to take shrooms for quite some time now, but they were never readily available to me making it very difficult.  Finally one day one of my good friends, we will call him Koogs for the sake of argument told me my other friends roommate, Sutts we will call him just got some in.  Koogs and I had been talking about taking shrooms for quite some time now and were very excited to hear we were going to be able to finally take them.  </p><p>Our original plan was to buy them on a Wednesday, which we did, then myself, Koogs, Sutts, and our 4th party we will call Sully were going to take them that Saturday at a popular place called Mt. Lemon. We all decided this would be the best time to take them so the date was set or so we thought.  As the days passed our excitement grew, since we had already purchased our shrooms they basically taunted us sitting in their baggies in our rooms.  By the time Friday rolled around we were all very excited to take them the next day and began searching for something to do that night.  We couldnt find anything to do as usual, and then as if by some miracle we all had a great idea at the same time lets just go to Sutts house and do the shrooms tonight. It was the perfect plan.</p><p>We were so excited we grabbed our shrooms, got a double cheeseburger, and drove over to Sutts house to consume our little beauties. We all sat down on the couch set out our individual bags of shrooms, looked at each other, smiled and began to consume.  Myself, Sutts, and Sully all decided to eat them with food, Koogs however (the only experienced one) decided to eat them with just water.  After about 10 minutes everybody had eaten their shrooms and the nervous excitement began. When were they supposed to kick in? We were all sitting there for about 20 minutes and nothing was happening, we began to get very impatient and decided a nice game of Nintendo 64 Blitz was in order to help speed up the process.  Not a single minute after we chose our teams and began to play Koogs decided to let us know he had a terrible stomachache and was feeling sick.  Since myself Sully and Sutts had eaten them with food we felt just fine and began to laugh hysterically at Koogs for having this stomachache, something that is usually not so funny.  About 5 minutes later after we decided Blitz wasnt for us Koogs said he had a stomach ache again and began laughing at himself. At this point this foreign yet amazing feeling began to overtake my entire body.  </p><p>(50 min in) the body fry had hit all of us like a ton of bricks; we went form feeling nothing one minute, to having intense euphoria and extreme laughter the next. I couldnt tell you what we were laughing at, Koogs stomachache mostly, but everything seemed to bring us joy, and everything made us laugh.  We were all eager to experience the widely talked about visuals you get when you take mushrooms so we went over to Sutts turtle tank and began playing with the turtles. The body fry was becoming more and more intense but the visuals just werent working for us yet.</p><p>As a group we decided to leave the safety of the house and go explore outside in the desert. I found that I was fearful of nothing.  Nothing in nature could scare me, it just made me want to explore it, everything was foreign and new, and everything had to be explored.  As we were walking down the street toward the sand I noticed that everything had become HD.  All colors and outlines were extremely vivid making everything fun to look at.  We finally hit the sand and it dawned on us we should look up at the beautiful night sky.  After all we were in Arizona the number 1 astronomy state in the world, and it was clear as a bell that night.</p><p>The moment we looked up at the sky the long awaited visuals finally began to hit us.  The sandy rocks beneath us all of a sudden felt like the surface of the moon, and all at once as if we were on the same page we began walking in slow motion, on foot after the other as if we were walking on the moon.  When we finally realized everybody was doing the exact same thing we burst into laughter and decided it would probably be best to get back to Sutts house before the drugs hit us too hard. </p><p>(1:30 into trip) after what seemed like an hour walk (realistically more like 5 minutes) we walked into the backyard of Sutts house where I saw for the first time green luscious grass.  I walked over to the grass that was bout ankle high and just walked around admiring the beauty of nature, wishing I could become part of the grass to see what it felt like.  The high was still creeping up on me, and I wanted to visuals to hit me harder, so I joined the other 3 who had taken post near Sutts pool.  As we gazed into the pool the visuals were definitely starting to hit us harder and harder. And then finally Sully decided to throw an orange into the pool.  None of us were ready for what ensued.  There was an amazing splash of color as if the orange was an exploding paintball instantly turning the water orange.  The ripples of the pool intrigued me, I attempted to follow a single ripple for the duration of its trip but found it hard to focus on a single thing because the whole experience was so exciting.</p><p>After about 15 minutes of water ripples I decided to get up and leave my friends to the pool while I explored inside Sutts room. As I rose and began to walk towards the door I brushed up against a tree and felt a welcoming sensation overtake my entire body.  I wanted to become the tree, and it seemed as though the tree wanted me to experience its life.  The long branches seemed to slowly pull me in towards the trunk until I was finally immersed in branches, staring at my friends who were looking at the ripples in the pool.  Suddenly, virtually at the same time (this seemed to be a theme during the night) my 3 amigos looked up at me, stared for a few seconds and we all burst into laughter, which seemed to give us a shot of reality. </p><p>At this point we all decided we should go into Sutts room and listen to some music and see if the visuals were going to hit us any harder.  When we got into his room Sutts had the idea of downloading shroom music from limewire that turned out to be a great idea. As I lay on Sutts bed staring at the patterns of a recently de-pop corned white ceiling the magical colors of the rainbow began to come to life.  As I stare at the patterns the ceiling began to pulsate as if it had a heartbeat, and with every beat colors would shoot out from the middle of the ceiling towards the walls and out through the floor. Every heart beat would project a different color shooting throughout the room.</p><p>At this point I was to involved in my own trip to know or care what any of my friends were doing. I was stuck, at one with the bed, staring at the ceiling.  As I stare I realize the fan on the ceiling may be a gateway to another world of some sort.  I was incorrect in my thinking. The fan began to spin faster and faster, and wobble more and more until it finally began falling from the ceiling landing on the bed in front of me exploding with color.  The fan continued to spin on the bed acting as a drill leaving a perfectly spherical colorful hole in its wake.  Although all of these amazing things were happening all around me I never lost complete control, I was always able to tell myself I was on shrooms and this was normal.</p><p>As I was enjoying the plethora of colors exploding all around me I finally began to notice my other friends and how funny it would be if somebody not on shrooms walked in and saw all of us.  Sutts was watching videos on youtube laughing like a hyena, Sully had somehow positioned himself upside-down in a chair and was just staring straight ahead, and kroogs was no more than an inch away from the wall studying pictures as if he had never seen anything so amazing before in his life. I thought about bringing us together as a group, but realized I didnt want to be bothered when I was tripping on the ceiling so I left them alone and decided to explore the bathroom. </p><p>As I get off the bed and walk over to the bathroom I find it difficult to walk, like the carpet became quicksand and was attempting to pull me in every step that I took. I was finally able to make it to the hard surface of the bathroom when, just as if a magician had snapped, the entire bathroom changed on me.  The bathroom was no longer a bathroom it was a place I had never seen before in my life.  The entire axis of the bathroom was off; it seemed to be slanted to the left, throwing off my balance as I tried to walk over towards the shower.  The bathrooms white walls were no longer white but colorless somehow.  The bathroom altogether had a yellowish glow, quite an amazing sight.  I was finally able to make it over to the shower when I looked down and saw a knife (what turned out to be a shower brush) and what appeared to be blood (this turned out to be rust) pouring down the drain.  This was the only point during the trip when I thought I might lose it.</p><p>For some reason (Sutts is a weird guy) there was a chair in the shower, so I decided to sit down and think about what the hell was going on.  As I sat down I caught a glimpse of Sutts sitting in his chair cackling at the computer screen.  As I looked down and saw the blood and knife I looked back at Sutts and for a split second thought he was a mastermind murder and that I had to get out of the house, and I had to get out immediately. Fear simultaneously took over my body making it impossible to move.  Luckily the fear quickly wore off and I again realized I had taken mushrooms about 3 hours beforehand. (After the first 1:30 I lost complete track of time so this is just a guess). My fear passed, the room snapped back to a regular bathroom and I went back to my post on the bed. </p><p>At the time all of our visuals were seemingly disappearing so we decided to go to Sutts roof where we could lie down and look at the stars.  This turned out to be the best idea any of us could have conjured up.  As we climb up the fence and onto the roof all of us realize the visuals are not done, far from it, we are barely able to make it to the roof before we see the street and downtown, two of the most amazing sights I have seen to this day.  The cars werent cars but hover crafts zooming to and fro on the street.  Downtown had a glow to it, and I thought to myself I was never going to be able to make it in that world.  I just wanted to live with nature and let all of the hi tech people live happily in their world while I lived happily in mine. The deep thoughts of the street and downtown were too much for me to handle.  We all decided to lie on the roof and gaze at the stars for a while. </p><p>As I look up at the stars I remember wondering how insignificant I was in the grand scheme.  I am simply a player in the game that is the universe, and my life is so unaffecting to so many other people.  As I thought this, a sudden calm came over me, a new feeling of euphoria that wasnt physical.  I sat there knowing that even though I was so insignificant everything was going to be OK. As I thought this something magnificent caught my eye. It was the moon basking in all its glory.  I stared at it for quite some time before the moon began to move about the sky ever so slowly.  I attempted to move the moon with my mind, unsuccessful at first, but then the moon began to follow the path I had in my head.  The moon began to move faster and faster before it was out of my control, and it began to plummet towards earth.  Behind the moon was a large comet tail and it began to fall right towards me.  I had no fear at this point just amazement for what I was witnessing. I stuck out my hand inviting the moon to visit me, and sure enough the comet tail disappeared, the moon slowed, and landed right into my outstretched hand. I sat there staring at it for a while when Koogs asked me what I was doing and I suddenly snapped out of it. The moon was back in the sky and everything was much less vivid than I remember. </p><p>This is where all significant visuals ended and the trip was coming to an end. We sat on the roof for some time until we were sure the visuals were over.  As we climb down from the roof we decided to go watch TV on Sutts couch.  We sat there for a while contemplating whether or not our trip was over.  After about 30 minutes we realized the most amazing experience we had had up to that point was finally over.  The body fry lasted for another hour or so, and was followed by the dreaded come down where myself and Koogs (together that night to make sure we werent fucked with) experienced headaches as Sully drove us back to our rooms.  </p><p>As we arrived home many of our friends asked us about our experience, but Koogs and myself were unable to answer at the time, just wanting to give our brains a rest. The next day the effects of the come down were still apparent but definitely worth the amazing enlightening experience I had.</p>"
}
