{
 "title": "A Nutmeg Night",
 "author": "Mike B.",
 "citation": "Citation:   Mike B.. \"A Nutmeg Night: experience with Nutmeg (ID 7621)\". Erowid.org. Jun 4, 2003. erowid.org/exp/7621",
 "substance": "Nutmeg",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 oz",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7621",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 4, 2003",
   "Views: 14398",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently, I have been interested in finding legal highs.  I found quite a bit of information off the internet, including this site.  As I looked at the list, nutmeg struck my fancy.  I thought, 'I can get high on NUTMEG??'  I have tried it a few times, and they all had their ups and downs.  I thought I'd share my most recent experience.\r\nI went down to the grocery store and bought an ounce of ground nutmeg (expensive stuff!  not exactly something I'd buy very often).  Since I know how crappy this stuff tastes, I took the liberty of putting the nutmeg powder into gelcaps.  The gelcaps were not empty, so I emptied out the stuff that was in it, and packed the nutmeg in there real tight.  It equaled out to about 22 capsules or so.  I promptly swallowed them all accompanied by a big glass of water.  Cool!  Now all I had to do was wait.  About an hour later I ate dinner.  Just as I finished, the effects came on quickly.  It was uncomfortable... pretty shitty feeling.  It felt as if little bugs were crawling under my skin.  No matter what I did, I could not get comfortable.  I was irritible and just decided to lay down for a while.  I did feel slight nausea, as if my body was telling me it does not approve of this crap I took.\r\nThis uncomfortable and irritating feeling lasted for about 2 hours, and I wish it would just end!  I had called a friend over and was seriously thinking of calling the night off and telling him to go home.  But the tension slowly passed, and it felt as if I was not high any more.  But one thing, I had the taste of nutmeg in my mouth!  I don't know how this is possible, but everything I ate tasted like nutmeg.  I ate some cookies, and the taste was STILL there.  Finally, after having some ice cream, the taste went away.  My friend and I watched and episode of SNL later that night (about 2 hours later).  I was laughing my head off like never before!  I know SNL is funny, but damn, I couldn't stop laughing!  This was the feeling I was looking for.  It wasn't so much of a 'high' feeling, but I felt mellow and had a case of the chuckles.  The only uncomfortable part was the dry mouth, which lasted long into the next morning.\r\nThe next morning was fun also... but in a different way.  I was SOOO hungry and thirsty.  Eating never felt so good in my entire life!  Every gulp of my turkey sandwich and soda was pure ecstacy!  I ate a lot that day, and never seemed to be full.  This hungry/thirsty feeling lasted until the late evening and went away.\r\nOverall, it was not even close to a hallucinogenic experience, but it was very amusing.  I think if you have the time, try nutmeg.  But be careful on your dosage, don't overdue it.\r\nPeace!\n\n\n"
}