{
 "title": "Amnesia",
 "author": "David",
 "citation": " David. \"Amnesia: experience with Pregabalin (Lyrica) (ID 76271)\". Erowid.org. Mar 2, 2009. erowid.org/exp/76271",
 "substance": "Pregabalin (Lyrica)",
 "bodyweight": "183 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Pharms - Pregabalin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2009",
   "76271",
   "Male",
   "",
   "Not Given",
   "Mar 2, 2009",
   "13262",
   " "
  ]
 ],
 "report": "<p>Taking Lyrica 75mg twice daily for 4 days and then 150mg twice daily, without noticing I hadnt reached the 7th day mark yet, and increased my dosage too early; on the seven day I knew something was wrong.  I couldnt remember whether what I had done that morning wasnt actually something I had done yesterday or last week maybe.  I had extreme amnesia and it came on fast, real fast and had been creeping up for several days, but the effect was so faint, I was unaware of the changes in cognitive ability.</p><p>On the seventh day I stopped taking this medication.  Potentials for overuse and more importantly, the fact that I could not remember things in any type of sense that would be called committing information to memory in a chronological order; It was much worse than even an amnestic state from Xanax overuse.  Lyrica definitely belonged in a schedule, possibly a schedule IV with the benzos, and then take the benzos out of scheduling or make a schedule VI for them.</p><p>Fortunately the half-life of Lyrica is not too long so I hope to be out of this state very soon as it is greatly affecting my ability to function.  Its also causing marked insomnia; like taking valium for too long.  I havent slept well since I started taking it and currently Ive slept very little the past three days, maybe 15 hrs, with a lot of cognitive activity.  Quite odd actually as it is expected to give somnolence.</p><p>The effect is like valium mixed with a barbiturate, slightly less euphoric and more amnestic.  I feel there is a very wide range of patients who would like this medication and depend on it every day; like a nation dependent on antidepressants, which, if I were consulted, would place these types of drugs into a schedule rating of II.  Much more of a dependence and psychological abuse than any narcotic ever produced.  More of the population takes them, as they are not viewed as harmful to the persons success.  Personally, Ive had experience with all these medications.  The ones that were most antagonistic to my road to success so far has been the Antidepressants, classical SSRIs and the atypical, and the Epileptics, gabapentin (extreme somnolence) and now pregabalin.  Pregabalin has the potential to be the most antagonistic but I will choose to stop it here.  I would be unable to put food on my table if I took this medication.  My job is to memorize, collect, and present data, as well as remember what was said when meeting with other people.  I cannot function with this medication.</p><p>Ill stick with my benzos for now.  Pregabalin is not to be trusted as a medication.  The patient would forget himself.  </p><p>In my short and limited experience, pregabalin is hands down, the greatest and most effective medication I have ever taken for the treatment of my neuropathy.  It should be considered the Gold Standard in the treatment of neuropathy, at least those of nerve damage from traumatic injury, and hopefully from diabetes.</p><p>No drug comes close to the efficacy of Lyrica in the treatment of chronic pain.  The opiates cant even touch it as I have found them to now be the second most effective drug, and valium following them.   Chronic pain is psychological pain.  It hurts, but its psychological, and the narcotic helps to calm them, as does the valium and the epileptic; but pregabalin calms me a little too much.</p><p>One thing that is most very apparent is that pregabalin takes away not only the physical pain of nerve damage as do the narcotics, but also the psychological pain and fear of living.  No drug has ever achieved the latter in my experience.  And no man should be without his fears, less he be forever disillusioned and completely unaware of the fact.</p><p>David</p>"
}
