{
 "title": "A Trip through the 4th Dimension",
 "author": "Walled Lake",
 "citation": "Citation:   Walled Lake. \"A Trip through the 4th Dimension: experience with DMT, LSD, MDMA (ID 76287)\". Erowid.org. Jun 25, 2010. erowid.org/exp/76287",
 "substance": "DMT, LSD, MDMA",
 "bodyweight": "159 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:30",
   "2 capsls",
   "oral",
   "MDMA",
   "(powder / crystals)",
   "  T+ 1:25",
   "50 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 76287",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2010",
   "Views: 7093",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWow. Well where to start off, this is about 3 days after my experience. All I have to say about every time I think about it is wow.\r\nAnyway it all started when I decided I wanted the Psychedelic experience of a lifetime, and oh man did I get it. Now this is probably not reccomended but I did this with my sitter passed out on the couch at around 4 in the morning (we were watching the history channel). Earlier that day we each took 150mg molly so we both rolled pretty hard and crashed, I decided that I didn't want to go to bed yet and I wanted to experiment with my favorite three mind viewing drugs ^.^\r\n(4:00) LSD ingested.. will wait 30 min before ingesting molly\r\n(4:30) Acid is kicking in a little big I think, take 2 caps of my friend molly and wait for the peak. Normally this experience is amazing without piling on any other drugs but DMT sounded like a very interesting combination tonight.\r\n(5:00) I am deffinatly tripping nuts just waiting for mdma to kick in now, should be any second. I enjoy watching TV but for some reason still pictures entertain me more than moving ones.\r\n(5:20) Ahhh here we go up, uP, UP, UPUPUPUPUP and we have lift off. Candy flipping at its best! Wow what could make this any better, oh I know how about my good friend dimethyltryptamine.\r\n(5:25) Load up 50mg of dmt into lightbulb vaporizor. Slowly light the bottom until dmt melts away and smoke is released, take about 3 huge tokes to start experiencing 'the void' \r\n(~5:30 time is lost) Last thing I remember is taking that last huge toke, now where the fuck am I. Where is the TV, couch and my passed out buddy.. This isn't funny anymore seriously where am I, and then I realize that I am the universe. I see a being that's not really a person but more an aura of light except it isn't light it looks like an object that I would never be able to draw or explain to anyone in this world because I have died and been reborn in the 4th dimension. I have no idea how I deducted that I'm in the 4th dimension other than the fact that basic forces that apply in our 3d world don't apply to the place I was. There was no gravity, there was no electricity, light or verbal communication.\r\nI could feel the presence of this aura but it was more than that, I could communicate with it just by thinking. I tried telling it my name, and it replied by saying that in the 4th dimension, people don't have names, in fact there's no such thing as people, just spirits. Every spirit knows every other spirit by feeling its presense. We started communicated and I shared where I had come from and that I didn't really know where I was or how to get back but this aura being thing seemed to know everything that I had tried explaining to it.\r\nI honestly have no idea how long this experience lasted for, but I 'fully' woke up aka 'regained conciousness' at 2pm the next day still tripping. I've never slept on acid before, but then again I don't think I was sleeping it was more like my soul took my mind for a trip through the 4th dimension. The thought that I woke up with is that the world is going to end in 2012. I did a little research on this and I guess that the magnetic poles of the earth are probably going to switch in 2012 leaving us vulnurable to cosmic radiation which may or may not exterminate all life on earth. Also the magnetic poles switching would have an effect on the super volcanos in yosemite national park and in other parts of the world causing them to erupt. Which would be bad. I guess all humans are probably close to their last Psychedelic trip if this actually happens.\n\n\n"
}