{
 "title": "Nitrous Extraordinaire",
 "author": "koosie moose",
 "citation": "   koosie moose. \"Nitrous Extraordinaire: experience with Nitrous Oxide (ID 7635)\". Erowid.org. Jun 23, 2003. erowid.org/exp/7635",
 "substance": "Nitrous Oxide",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE:",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7635",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jun 23, 2003",
   "Views: 9145",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Nitrous is something I was in general worried about in regard to health, as it is an infamous inhalant. So I was very skeptical as to whether the effects would be worth it but with enough peer pressure I was coaxed into trying one cartridge.</p><p>My friend 'John' had purchased 24 earlier and all the others around me, 7 or so people, had decided it was game. Two of them were newbies excepting me. John had a cracker and a balloon so everything was quite well planned out. I saw all my friends inhaling and the others giggling and laughing and him trying to breathe back in and then out again over and over until he was red in the face, and since he was sitting, fell over backwards with him eyes flickering numbly in response to the physical euphoria. John offered to save me one and I put it in my pocket, so when all the others were finished, he proposed it be my turn.</p><p>John handed me the filled balloon and suggested I let it sit for a moment to warm up before taking my hit. After a few seconds I put my mouth on the balloon opening and let the cool sweet air fill my lungs, breathing back out and again until I felt a head rush and a numbness all over my body and a general feeling of 'whee!' and crazy insane shaky chaotic crazy rush, and I spat the balloon out and fell over backwards in the amazement and overall crazy appreciation for the incredible effect it took. For a few moments, the world as I viewed it was shaking and ludicrous, like it was as if I had run around in circles, twirling, for 10 minutes and then sat down. But it wasn't a nauseous feeling, more so an enlightening happiness. I was so crazed, I held my hand out in front of me, laughing uncontrollably, shaking it vigorously, for a few seconds; confused as to why, how, what, and all those confusing questions you could ask on a drug.</p><p>But then it quickly faded away, and I realised the high was gone after only 30 or so, maybe 20 seconds. And then john asked me how I felt, and he, being an experienced drug user and good friend, summed up my feelings toward this session as the smallest dose of the best physical high, somewhat visual drug in the world, and that its so good and incredible that's all that humans should have and deserve.</p><p>For a while I felt slightly off and light-headed and I had a few shots to 'take off the edge' but overall it was incredible. If someone is concerned about whether or not they should try nitrous oxide, I believe it is a great experience and if not to get away and free your mind then to have the knowledge of what is possible to feel and be. In short, it comes highly recommended, but always research and use professional materials to be as safe as possible.</p>"
}
