{
 "title": "A Good First Time",
 "author": "Bubba",
 "citation": "   Bubba. \"A Good First Time: experience with Morning Glory (ID 7637)\". Erowid.org. May 31, 2002. erowid.org/exp/7637",
 "substance": "Morning Glory",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "7.5 g",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "2001",
   "7637",
   "Male",
   " ",
   "Not Given",
   "May 31, 2002",
   "7035",
   " "
  ]
 ],
 "report": "<p>\nWow. This was my first experience with Morning Glory seeds, and I can give a brief description of how well it worked. I prepared this stuff by grinding it in a pepper mill, mixing the crushed seeds with hot water, and letting sit for 10 hours. Then, I took a cooking metal strainer and got the liquid out of the mush. I used 5 packs of Heavenly Blue variety.</p><p>9:30 - Ate a light breakfast, some cereal</p><p>10:00 - Took the liquid (mixed with soda)</p><p>10:30 - Mild lightness was felt, nausea was coming on</p><p>10:45 - Had some marijuana smokes with a sober friend. I would like to recommend this for ANYONE who has this available. This got rid of the nausea feeling within minutes, and for the rest of the trip.</p><p>After that, the effects were starting to come on, slowly. I recall looking up at a ceiling light and feeling almost a burning sensation in the eyes (it made my eyes watery) just looking at natural sunlight. I felt light in the mind. Soon, I realized what was happening, my nostrils seemed to be closing. Breathing was becoming increasingly difficult, and for the rest of the trip, my nose was pretty much closed.</p><p>I recall feelings of happiness, and motion seemed much different when riding in a car (bumps and dips caused me to laugh). Listening to some techno beats would cause me to laugh histerically, my friend told me afterwards (i do vaugely remember this happening). Music felt as if it were crawling inside of you, and since it was not mellow (it was techno) everything felt 'uneven' and not very smooth. Food tasted entirely different (I recall eating some candy, and telling my friend that it tasted like rocks, and it took me like 10 mins or so to eat like 3 skittles!) </p><p>All I can say is that it was fun, and I felt the universal feeling sometimes associated with MG. Next time maybe i'll up to 6 packs or so.</p>"
}
