{
 "title": "An Unholy Matrimony of Blook, Fire and Death",
 "author": "deCypher",
 "citation": "Citation:   deCypher. \"An Unholy Matrimony of Blook, Fire and Death: experience with Datura & Cannabis (ID 76457)\". Erowid.org. Aug 6, 2009. erowid.org/exp/76457",
 "substance": "Datura & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 seeds",
   "oral",
   "Datura",
   "(seeds)",
   "  T+ 2:00",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 76457",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 6, 2009",
   "Views: 17187",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe Entrée:\r\n25 finely chewed seeds of Datura Stramonium, aged to racemize the hyoscyamine to atropine and the scopolamine to atroscine.  Each seed is roughly 7-8 mgs, but alkaloid content of each seed varies too much to be consistent.\r\n2 bowls of Blueberry Kush, cured to decarboxylate the THCA, and smoked approximately two hours after ingestion of the Datura.\r\nI eye the small cluster of black, teardrop-shaped seeds in the palm of my hand with a mix of apprehension and usual pre-trip anxiety.  They taste bitter with a hint of an earthy bite; not bad by any means but the hard husks get stuck in my teeth.  I chew well and let the mass sit in my mouth for a few minutes to aid any sublingual absorption, and prepare to joyously delve into the bowels of torment and despair.\r\nThe Trip:\r\nEyes closed, pitch blackness.  A sense of evil, a seductively malevolent vibe.  Apprehension as the gears of my perspective slowly creak into the lower planes.  Streaking spirals of light, growing brighter and brighter until... suddenly, break through.  People and landscapes in perfect clarity as if I were watching through an invisible camera.  A man turns towards his wife before stabbing her violently in the back.  He rips the peeling flesh from her body as insects suddenly pour out.  Cut.  A pool of blood, undulating with red waves.  Body parts falling in, silently splashing.  No sound whatsoever to these visions.  Cut.  A wolf, black eyes, digging into an unidentifiable corpse.  Strings of meat are dangling between its teeth.  Cut.  Many scenes of erotica, usually ending in gory climax.  My skull is but a padded cell, the walls of which my inner demons bounce off.  Themes of sadomasochism, violence punctuated by guilty pleasure.  \r\nI hear sounds of sheer chaos.  Screams, thumps.  Dragging noises.  Someone calling my name, louder, and louder.  A gentle hiss and a bump. Cut.  Spiders.  Lots of spiders, pouring through the cracks of reality as if puncturing through this thin veil of ordinary life.  I feel things gently running over my body.  I don't open my eyes.  Cut.  Swinging bodies on nooses, burning.  Fire, blood dripping as maggots squirm into the quivering flesh.  I am carrying on a conversation with something, but I do not know what.  My mind echoes with distorted fragments of meaning; snippets of grand truth ripped from this primeval chaos.  Lots of blood.  Death.  Churning corpses being flayed.  Rotating scenes of razor-sharp blades dissecting through my mind.  I contemplate the nature of fear in all its manifestations--here there is true, unmitigated terror.  A woman reaches back and rips the top part of her skull off; a horde of black moths flies out.  I hear the whispering voices of angels.  Cut. \r\nI lift my eyelids and stare into the darkness of my room to find relief from the torrential deluge of demonic imagery.  My wall is covered with crawling black things.  Posters and my pull up bar, dimly seen in the nonexistent light, are bending at absurd angles and then popping back to their rightful shape.  Swarms of gnats have infested my room, making the darkness heavier with their presence.  The wall shudders as its cracks begin to disgorge countless more denizens of the shadows.  I have welcomed in the eldritch beasties of the night, and I'm here to pay them homage.  I close my eyes again, and sink further into the welcome depths of Hell itself.\r\nThe Aftermath:\r\nFrom the intense effects that I was experiencing (including open-eyed visuals, auditory hallucinations, and a quite intense mental trip), I expected that I had ingested too much of the tropane alkaloids and that I would undergo the typical three-day delirium that comes with an overdose.  However, I woke up the next morning feeling nothing but refreshed and revived with fresh exhilaration.  There was also no anticholinergic loss of cognitive faculties during the experience, which I usually feel under high doses of diphenhydramine and the like.  My best guess is that marijuana synergizes wonderfully with the Datura plant (in India the combination of smoking Datura Metel with Cannabis is supposed to unify Shiva, the male spirit, with Shakti, the female spirit), and that this combination allowed me to experience a form of divinatory visions and open-eyed deliria without being overly toxic or long-lasting.\r\nI would not recommend this combination to anyone without first starting at low doses of 1 or 2 seeds and working your way up gradually with much time in between the doses.  Datura is known to stress the cardiovascular system, and the combination with marijuana can put a great toll on the heart.  Combine carefully and with low amounts.  Silent meditation in the dark is good for best results, but I've also been able to use Stramonium before sleep for lucid dreaming purposes.  Typically the trips manifest with an air of seductive evil, bloodshed, and death to them--things that I greatly enjoy as an alternative to the clichéd puppies and flowers atmosphere of most traditional psychedelics.\r\nTread the tropane waters carefully.  Here there be demons.\n\n\n"
}