{
 "title": "Better than Meth",
 "author": "Elfspice",
 "citation": "   Elfspice. \"Better than Meth: experience with MDPV (ID 76473)\". Erowid.org. Jan 25, 2009. erowid.org/exp/76473",
 "substance": "MDPV",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "17.5 ",
   " ",
   "MDPV"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 76473",
   "Male",
   " ",
   "Not Given",
   "Jan 25, 2009",
   "Views: 26195",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I first heard about MDPV back in about 2007, and it sounded interesting as its effect were commonly compared to methylphenidate, and I had found that stuff helpful but it elevated my alert level and anxiety too much, leading to two incidents of psychotic behaviour in which the police were called, while I was living in new zealand.</p><p>MDPV, however, lacks this psychosis induction effect for me. It also has a diminished 'fixation' effect as compared to methamphetamine. I also find that it has an after effect which actually reduces social anxiety for up to 3 weeks after a moderate 18 hour binge, probably an effect that would build up with daily dosing.</p><p>It somewhat elevates my excitement level, but not so much as caffeine, which I find at times when I'm embedded within an fps game or listening to music with earphones I discover my natural level of expression voice/body language etc is a bit intense. So not as bad as if I'd just dosed 200-300mg of caffeine.</p><p>I made the title better than meth because for me it is better. It doesn't cause the biggest problems I have with it, obsessive fixation and rigidity to near the same degree, I am able to pull myself out of a mental sinkhole much easier, and shift my attention. In fact on high doses of meth I actually get what seems to be some kind of tunnel vision where peripheral stimuli don't get any attention to the point of the ridiculous, like, probably a bomb could go off next to me on a high dose of meth when I'm fixating on something and I'd not even notice let alone jump in surprise.</p><p>My only gripe with MDPV is - well I wish it lasted 8 hours, but in my experience drugs either last 3-4 hours at effective levels or 12 hours, but at the latter the insomnia persists another 6-12 hours which is not acceptable, and I'm sure it's wrecking my body's recovery during sleep when I get it in that state - ok the only big gripe I have is it suppresses my thirst and hunger better than any drug I've ever taken ever, and unfortunately I already have a mild degree of anorexic tendencies. With awareness and routine feeding I'm sure I could get around that. It doesn't inhibit my digestion so much as inhibit my desire.</p><p>[Reported Dose: 'eyeballed 5-20mg']</p>"
}
