{
 "title": "Terrible Stuff",
 "author": "thedoser",
 "citation": " thedoser. \"Terrible Stuff: experience with MDPV (ID 76470)\". Erowid.org. Jan 25, 2009. erowid.org/exp/76470",
 "substance": "MDPV",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " repeated",
   "",
   "MDPV"
  ]
 ],
 "footer": [
  [
   "2008",
   "76470",
   "Not Specified",
   "",
   "Not Given",
   "Jan 25, 2009",
   "34408",
   " "
  ]
 ],
 "report": "</p>\nAs has been mentioned by others, this drug is very potent at incredibly small doses, It would be a fool to 'snort a line' of it. Really, do not underestimate it.</p><p>I've found the substance to have similar potency, whether it's taken orally or nasally, the only difference perhaps being an onset difference of 5 minutes when taken orally, and perhaps a slightly longer duration. Within 15 minutes of snorting ~3-5mg, I experienced amphetamine-like symptoms: urge to clench the jaw, leg shaking, and a more noticeable heartbeat (not sure whether it was necessarily much faster).</p><p>During the peak, which lasts about two and a half hours (and then sharply declines), I didn't notice much of an increase in ability to focus, as I do with methylphenidate. Once the jittery-ness of the peak is over, a severe crash is observed.  The first time I tried it, it appeared only as a mild depression, with a sort-of 'burnt-out' feeling the following day.</p><p>While working on a project with a deadline fast approaching I decided to attempt an experiment with MDPV and take 3 small doses (~3-5mg each) throughout the day, for two days.</p><p>It turned out to be a terrible idea. </p><p>Amazingly, after only two days of this regimen, I experienced the worst withdrawal that I've ever experienced from any stimulant (I've tried: caffeine, various amphetamines, cocaine, and various forms of methylphenidate, and probably others).</p><p>The night after I concluded my experiment, I had extreme difficulty falling asleep.  A serving of diphenhydramine (benadryl/tylenol PM) and valerian root did little to help.  Interestingly, after taking the sleep aids, I experienced a very odd sensation where I felt as though part of my brain (including the part responsible for regulating my breathing) was asleep while the part responsible for my normal waking consciousness remained awake. I think I finally managed to fall asleep, but it didn't last very long as I suddenly awoke in a cold sweat, jaws-clenching like they've never clenched before, and feeling rather nauseous. I felt like crap the entire night, but thankfully the following morning the nausea subsided and I was more or less able to function, but in no way capable of any real productivity.  This after only taking it for two days.  Those looking for a quasi-legal and prescription-less Adderall-alternative will, I think, be sorely disappointed.</p><p>One other thing I noticed is that I don't like how this thing makes my heart feel, it feels, even a day after taking it, as if it's under stress, although it's not beating rapidly.  Just based on this I would be wary of long-term usage.</p><p>There is a chance that I might try it again in the future, but next time I'll make sure to only take about 1mg's worth.  To give you a rough idea of how small that is, in its powder form it's about the size 2 mm^2 [SEE NOTE BELOW] lying on a flat surface.</p><p>Perhaps the only positive remark that I can make about this substance is that it doesn't appear to be habit forming, perhaps only because the withdrawal is so quick and harsh that it doesn't really give one the opportunity to use it for very long. Although, I can only speak for myself, I'm sure someone out there will find a way to abuse it for a long period of time...</p><p>---------------------\rCORRECTION NOTE (submitted 1/27/2009, presumably by the author):</p><p>Hi, this is not a report, but a correction to a previous report I recently submitted for MDPV, #76470</p><p>The correction relates to this paragraph:</p><p>'There is a chance that I might try it again in the future, but next time I'll make sure to only take about 1mg's worth. To give you a rough idea of how small that is, in its powder form it's about the size 2 cm^2 lying on a flat surface.'</p><p>The mistake is the units, it's 2 mm^2, not centimeters.  There's no way that 2cm^2 of a powdered substance like MDPV can be 1mg.</p><p>Sorry about the mistake! I'd just like it fixed to prevent anyone from accidentally overdosing.</p>"
}
