{
 "title": "Seven-Day Trial",
 "author": "2psychonauts",
 "citation": "   2psychonauts. \"Seven-Day Trial: experience with JWH-018 (ID 76486)\". Erowid.org. Mar 9, 2009. erowid.org/exp/76486",
 "substance": "JWH-018",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "JWH-018",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 76486",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2009",
   "Views: 56997",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>1-Pentyl-3-(1-Naphthoyl)Indole aka JWH-018, An Experiment Into the Physical Effects of Said Substance On Human Volunteer Test Subjects, With Repeated Applications Over the Course of a Week.</p><p>age: 23F and 26M</p><p>weight: 140F and 165M</p><p>sex: female and male</p><p>dose: ~3-5 mg repeated, smoked. </p><p>intro:</p><p>1-Pentyl-3-(1-Naphthoyl)Indole aka JWH-018 is a synthetic tryptamine cannabinoid agonist. It is a fairly new chemical and there is little known about its short-term and long-term effects on humans. It has been sold as a 'secret ingredient' within herbal mixtures on the 'legal-weed' market as a substitute for marijuana under such names as 'Spice', 'Chillin-XXX', and 'SpiceHead'. FONT COLOR='#FFCC33'>[ Erowid Note: As of March 2009, it is unknown whether all Spice products contain the same psychoactive chemical(s) or not. At least one sample of Spice has been analyzed and found to contain JWH-018; other tests have found other substances.] \r[ Erowid Note: As of March 2009, it is unknown whether all Spice products contain the same psychoactive chemical(s) or not. At least one sample of Spice has been analyzed and found to contain JWH-018; other tests have found other substances.] </p><p>We have smoked 'Spice' products many times before, and hearing that the main active ingredient of these mixtures is JWH-018, a decision was made to replace marijuana with pure JWH-018 for a period of a week to see if it was a suitable replacement. Both of the test subjects are habitual marijuana smokers who have been smoking daily for respectively 7 years (Female) and 12 years (Male). We also have been using opiates recreationally for roughly 2 years. We have previously cleansed our systems of all opiates or any other drug, with the exception of marijuana. This is an experiment to find out if the 018 has any side effects such as tolerance build-up and/or any other physical symptoms. Tobacco has been smoked during the experimental period.</p><p>The package of 1000 mg JWH-018 arrived Saturday night. The product resembles what has been sold as 'red-rock opium' (Dragon's Blood Incense), but has a softer, waxy texture as opposed to DB Incense's hard, crunchy texture. It has a distinct flowery/chemical scent to it.</p><p>Day 1 - Saturday</p><p>Marijuana had been smoked previously during the day, and directly before first ingestion of the 018, so the first day was difficult to differentiate the marijuana from the 018. No mg scale around, we very carefully shaved off 3-5 mg of product (when not condensed into a 'rock', the product looks light yellow) and inserted it into an indirect heating/oil pipe (bubble pipe). Keeping the flame under the product, it melted and began boiling/smoking. Inhaled all subsequent vapors in one breath. It has a distinct flavor reminiscent of N,N,DMT.</p><p>Within 2-5 minutes, we start to feel a marked heaviness very familiar to a rather large oral marijuana dosage. Again, we had smoked marijuana previously so the effects were hard to differentiate. Around ten minutes later we began to notice that colors were very vibrant and full, as if we were on the verge of coming onto a low dose of psychedelics, but not quite tripping. Again, very reminiscent of an oral dosage of marijuana vs a smoked dose. Conversation was stimulated; slightly manic, though euphoric. A bit of the paranoia that comes with novice marijuana smokers (we expect that to disappear with repeated dosages over a time, as it does with marijuana). Experience lasted about 3 hours. Plateau was achieved at roughly the hour point after inhalation, with a slow decline for the remainder of the experience. Definite time dilation.</p><p>Dosage was repeated over a total of three times each for the rest of the night. Definite CNS depression and respiration suppression, we feel we have to consciously control our breathing. Could this chemical have a rather low LD-50? A little worrying, so we halted any more applications for the night. Normal respiration acquired roughly one hour after CNS Depression was first noted. </p><p>Day 2 - Sunday</p><p>Woke up with a mild case of diarrhea. Not sure if this is attributable to the 018 or if it's just me. It reminds me of when I first began to smoke marijuana in my younger days. I would get symptoms of 'pot-sickness' - eg mild diarrhea, nausea, and the spins (attributable to 26  year old male). A bit of a sore throat in both of us. Probably caused by the harsh smoke of a pure, unadulterated chemical.</p><p>Vaporised 3-5 mg 018 through oil pipe. This was a virgin experience (no other drugs) and we definitely felt the effects of the chemical this time. Very pleasantly surprised. Our experiences with 'Spice Gold' and Spice-alikes were relatively minor. A feeling that it is similar but weaker than marijuana. 018 is serious business and we were significantly intoxicated. The equivalent of a gram-sized blunt of high-grade marijuana, although different... The fact that you need only one hit to ingest a rather large amount of this substance creates a bit of a 'rush' when the chemical comes on (roughly 2-5 minutes after ingestion), very much like the rush accompanied by an intra-nasal application of a strong opiate. As the rush subsides, we fell into the distinct heaviness, a sense that all of our limbs were roughly 10 pounds heavier and if we held very still, we could feel the 'buzzing' or 'humming' that accompanies a good psychedelic experience. Other than color enhancement, no other psychedelic properties were noted. Extreme sedation was noted (reminiscent of an opiate experience, could possibly be used as a withdrawal aid), and we doubt that any further applications of the chemical would enhance the psychedelic properties inherent. More likely, the test subject would fall asleep.</p><p>I was in a terrible, foul mood prior to first ingestion of the day. Immediately after the effects were noticed, my mood shifted from terrible to giddy. Definite anti-depressant qualities (attributable to 23 year old female). Dosage was repeated at the same levels (3-5 mg) a total of 5 times throughout the day, keeping the effects stable (this is how we smoke marijuana). The desire for actual THC/marijuana was dramatically decreased with the 018, so already we know it is a viable replacement for marijuana. In some ways, more intense than Delta-9 THC itself.</p><p>Woke up in the middle of the night with opiate withdrawal-type symptoms eg restless legs and overactive mind. Unable to fall back asleep until the final dosage was applied (this is a technique we also use with marijuana, eg sleep aid). We are unsure if this is attributable to the JWH or if it is the tail-end of our opiate withdrawals.</p><p>Day 3 - Monday</p><p>Again, mild diarrhea (accompanied by stomach cramping with 23 year old female) was noted, this time with both subjects. A side-effect of the 018? Possibly. More testing is required. Not significant enough to be worried, some Immodium clears it up nicely. A mild headache was also noted by both test subjects, also cleared up nicely with some Ibuprofen. Again, sore throat noted.</p><p>3-5mg of 018 vaporised by both test subjects. No tolerance build-up noted. Repeated applications of opiates would have by this time created a noticeable tolerance to said substance. We got just as 'high' as the first time, with the same amount of substance. Same physical symptoms noted as before, eg mild CNS depression/respiration suppression, time dilation, sedation, color enhancement or 'fullness', physical 'buzzing' or 'humming' feeling accompanied with 'heaviness', anti-depressive qualities (euphoriant) and mild paranoia and 'jumpiness' (this has decreased to being nearly unnoticeable at this time, as we had expected).</p><p>If I were hard-pressed to describe this experience without using marijuana as an analogy, I would say it most resembles a moderate dose of opiates combined with a low dose of tryptamine psychedelic (attributable to 26 year old male).</p><p>A total of 4 applications were applied throughout the day, 3-5 mg each time.</p><p>Day 4 - Tuesday</p><p>No diarrhea, it is unlikely it was caused by the 018. Mild headache noted in 26 year old male, none in 23 year old female. Throat no longer feels as sore (getting used to the harsh smoke?), but definitely dry.</p><p>3-5 mg of 018 vaporised, same effects as before. No tolerance build-up noted. 018 completely killed the headache. Analgesia noted.</p><p>I wouldn't say this is a perfect replacement for marijuana. The effects seem to be ill suited for the workplace. The heavy bodyload accompanied with significant sedation is markedly different from marijuana intoxication (attributable to 23 year old female).</p><p>Multiple applications throughout the day, 3-5 mg each time.</p><p>Day 5 - Wednesday</p><p>We woke up a little earlier than usual, had some trouble sleeping. When we finally did get out of bed, we noticed a bit of a headache. This has been consistent throughout the experiment, eg feeling fine for the majority of the day but waking up with a very minor headache and some mild lethargy. Maybe a bit of hangover? It's so minor that it's only mildly irritating. No diarrhea, no sore throat.</p><p>3-5 mg of 018 vaporised, same effects as before. Mild tolerance build-up noted. Maybe we're just getting used to the experience, but we didn't seem to feel the effects as strongly.  Multiple applications throughout the day, 3-5 mg each time.</p><p>Minor headache throughout the day, Ibuprofen nor 018 would not kill it (attributable to 26 year old male).</p><p>Day 6 - Thursday</p><p>Good sleep, no headache, no sore throat, no hangover.</p><p>3-5 mg of 018 vaporised, same effects as before, Mild tolerance build-up. Don't need any more to feel effects, they are just not as pronounced as before. In fact, at this point I can't tell the difference between the effects of the 018 and the effects I get from marijuana. Just pleasantly stoned (attributable to 26 year old male).</p><p>Multiple applications throughout the day, 3-5 mg each time.</p><p>Day 7 - Friday</p><p>Good sleep, no headache, no hangover. Mild sore throat noted again, but nothing worrying.</p><p>Decided to go for bust today and vaporised ~6mg each. Effects were profound and just as intense as the first time we partook. Experience lasted almost exactly as long as it always has, so effects are not prolonged with higher dosage.</p><p>Multiple applications throughout the day, 3-5 mg each time. Male subject experienced nausea near the end of the night, but since that has not been noted with previous experiences, it is doubtful it had anything to do with the 018.</p><p>Day 8 - Saturday - Conclusion</p><p>We have learned that the substance JWH-018 has mild tolerance acquisition very much like marijuana. The effects are similar enough to be almost indistinguishable from marijuana with regular use.</p><p>Possible side effects while under the influence are:</p><p>CNS Depression / Respiration Suppression,</p><p>Sedation, </p><p>Color enhancement or 'fullness',</p><p>Physical 'buzzing' or 'humming' sensation accompanied With 'heaviness',</p><p>Anti-Depressive qualities (euphoriant),</p><p>Mild paranoia/jumpiness (very mild anxiety),</p><p>Time Dilation,</p><p>Analgesia,</p><p>and possibly Nausea.</p><p>Possible 'hangover' effects are:</p><p>Dry sore throat,</p><p>Mild Headache,</p><p>Mild diarrhea,</p><p>Insomnia,</p><p>and lethargy.</p><p>Possible Medical Uses are:</p><p>Hunger Aid,</p><p>Sleep Aid,</p><p>Anti-Depressent,</p><p>Pain-Killer,</p><p>Opiate Withdrawal Aid,</p><p>and Anti-Anxiety (although there is a slight amount of paranoia or anxiety attributable to the experience, the sedation and euphoric quality of this substance are marked enough so it would make for a suitable anti-anxiety medication).</p><p>Conclusion - </p><p>This is a quality substance that is well-suited as a marijuana replacement. With regular usage, tolerance builds very slowly and possibly plateaus. Negative side-effects are minimal and the experience itself is largely pleasurable. Neither subject noticed any addiction/withdrawal symptoms with abrupt discontinuation of applications after the seventh day. </p><p>With 1000 mg costing less than $200 USD, we have consumed less than 200 mg in seven days. Marijuana costing $50 USD for 3.5 g, which would last us roughly one day. This substance is far cheaper than marijuana 'hit-for-hit'.</p><p>More long-term experiments are necessary to learn the full effects of this substance on the human body.</p>"
}
