{
 "title": "Everything is Shiny",
 "author": "Adamood",
 "citation": "   Adamood. \"Everything is Shiny: experience with Nutmeg & Cannabis (ID 7651)\". Erowid.org. Jun 23, 2003. erowid.org/exp/7651",
 "substance": "Nutmeg & Cannabis",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 1:00",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 2:00",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 3:00",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 4:15",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 5:30",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 6:45",
   "0.1667 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 7:30",
   "0.5 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 11:00",
   "2 hits",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7651",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 23, 2003",
   "Views: 28803",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was our Anniversary. We are experienced with using the powerful magic that is inside of the nuts as therapy and recreationally. We decided we would make this a time to remember, and it was. I carefully ground up two large nuts in the coffee grinder and diveded the portions out evenly. S took one nut in icecream and I put mine into 7 gel capsules. I decided since I was the designated driver, I would take it in segments to see if there was a significant tolerance factor with the nuts ability to change my perception. I then ground up two more medium sized nuts for later. What I found was that what I had suspected was true. The drug takes a long time to wear off and to kick in, therefore making it possible to somewhat control the amount to take for desired effects. <br>My previous experiences with this drug helped me know what to look for when taking the capsules so I would not overdo it. I have read lots nutmeg reports and find a common thread with all the bad experiences: too much nutmeg taken. The low doses will have little or no side effects, and are less intense on the body. This will help free the user to enjoy the mind decorations this has to offer. <br>I started the doses at about 12 noon and did not really feel any notable change until about the third pill which was three hours into it and was most likely just beginning to feel the first. It seemed to be a mild stony feeling like I had eaten a small M brownie. We were at the pool and the water took on a shimmery, glittery look that is not normally present. There was a distinct feeling of euphoria that is not always present with Cannabis. This feeling lasted the rest of the night. <br>After the sixth dose, things at the restaurant were starting to seem like they were just for us. It was about 7:30pm. This is where I  dumped in another half a nut into my coffee and S did the same. Only small visuals at this time, and just a pure enjoyment of all the sounds being made around us. <br>Once we got home is when things decided to really start shining. Everything had a beautiful sparkly flick to it. As the Sun set, I was able to play with the light and see the life of everything vibrating all around me. This was really cool. I looked at the sky at the stars and there were strobe flash kind of tracers in the sky. Crickets were singing us their songs of Nature that seemed to stream together like an orchestra. Now that things were going well, it was time for a joint. Two times inhaled and the trip went up several more levels. I was watching my own actions as I would do things and it was silver robot like. The shine was on things that I moved. A candle burning in front of a psychedelic painting was low profile as the patterns in the painting would dance, breathe, spin, and hang in the wind. There were actual hallucinations of objects looking like something they are not, and then in a flash would be back to normal. These are not scary, just make it hard to distinguish reality from nutallity.       <br>I slept from about 3am till 7am and do not recall any dreams. Sometimes with this nut, it is hard to tell if the dreams are real or not. After about 4 hours of sleep, I went outside (24 hours after my first dose), and decided to read. The birds were really singing particularly loud and with enthusiasm. Thats when I noticed the rock garden was breathing. It was breathing to the sound of the birds. This gave me the Loving feeling that Nature is Harmonious. I just sat there and enjoyed the feeling. After being with the drug for more than 24 hours, I have made a day happen full cycle. Each part of it has little suprises, including the sleep which I don't remember. It is now 7:30 Sunday evening and the mindgames and mild visuals are still going on.<br>If you want to have a good time with this, don't be an asshole and try and 'outdo' other people's doses. You will only have a bad time for 3 or 4 days. Just be cool, and take it in a lower dose. The experience could be rewarding. Cannabis seems to act as a trigger for some of the properties. This way you can experiment without risking too much. I hope this helps people understand this drug and use it safely. Peace.\n\n\n"
}
