{
 "title": "Completely Not In This World",
 "author": "Shroomie",
 "citation": "   Shroomie. \"Completely Not In This World: experience with Mushrooms (ID 7652)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7652",
 "substance": "Mushrooms",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2001",
   "7652",
   "Female",
   " ",
   "Not Given",
   "Jun 24, 2003",
   "6159",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nJust last night I went to a Dave Matthews concert. I have never tripped on LSD, just mushrooms, several times. Once again I'd eat the shrooms before my concert. I took a little less than usual but they were getting old and I think might have made a little more potent. I didn't realize the trip I was in for. The night before, my sister whom I was going to the concert with told me not to embarrass her because I was going with her friends who are a few years older. By the way, I just graduated high school. Anyways, none of the people I went with did any drugs at all. They were actually against it. So I knew I'd have to be somewhat 'normal'. When we got to the lot before the concert. I ate my shrooms, drank a few beers and smoked some bowls. About 45 minutes in the lot the visuals kicked in first. There were lines in the sky everywhere, travelling every which way. The whole atmosphere was just swaying and whoa, just looked real cool. I said at the time 'I hope I just stay like this all night I'll be great.'</p><p>I was able to speak and doing fine just having fun. A bunch of things happened as we went in and I started to think (a lot). Everything that was happening, I felt was the opposite was going on. Someone came up to my sister and was asking questions, and I was so paranoid the whole time. I actually thought he was a cop busting her for something, not until later she told me that he was really doing a survey for something. Unless you've tripped before I can't explain the weird thoughts that run through your head and how you feel. But it's probably ten times stronger than you can even imagine. You are completely not in this world. Physically, yeah, but on such different level reality of thought then the rest. It's very hard to communicate.</p><p>We finally sat down and I sat on the grass and began to enjoy my trip. I don't think I looked like I was having fun, I kept thinking they thought I was insane. I would laugh hysterically to myself at the funny things I saw. I was just in my own world jamming to the beats. I had a conversation with my sandals who I thought were a man and woman couple. They turned into angels inviting me into their home. Which made me feel good. I became so focused on things. I'd look up at the sky for what seemed like a minute, but I think it was more like a half hour. The sky was more beautiful then I'd even seen. That day happened to be beautiful, pink and purple clouds just enhanced my trip. It actually looked like there were different portals opening up capturing me, taking me to different times and galaxies. It was awesome. Time was nothing. If I thought it was only 5 minutes gone by, it was really an hour. Or the opposite. Very confusing. I just wished I had someone to share it with.</p><p>I tried to talk, but the trip just got stronger and I could hardly speak a word. Actually I remember now I ate another stem in the middle of it, why I don't know. I knew no one knew what I felt which was an annoying feeling. I started to get very uncomfortable. Thoughts raced through my mind more than I could ever believe. I thought I knew everything. Those people didn't know anything they were all the same. Only I knew, but if I told anyone they'd think I'm nuts and not believe me. It was sort of scary. I felt extreme guilt and just about every other emotion there is at one time. Like I was a bad person. I just felt I would never come back to reality again. I didn't care about anything. I really just wanted the thoughts in my head to go away so I can enjoy the music. The number or questions that arose on me was incomprehensible. What was this? What is life? WHY ANYTHING? Was the biggest thing.</p><p>As much fun as I was having I had just as bad a time. So paranoid and ashamed of myself. Anyhow I was tripping the whole time. The end of the concert I realized I couldn't name one song Dave played, I was so distracted with everything. I could hear every single person's conversation and I just wanted them to shut the hell up. But the music was still amazing and just filled the air the whole time.</p><p>We went back into the car and began out ride home. This would be hard cause I didn't even know if my sisters two friends knew I was tripping. She just told them I was fucked up. So I was embarrassed at myself and tried to be okay. They looked at me funny though and it was a horrible feeling. I started coming down as we got home and I came home and talked to my mom and was fine. My sis told me never to trip in front of her again cause she doesn't like it or seeing me on it. I felt real bad about that. Today I woke up and I've had the hardest day ever. No work, just mad thoughts racing through my head.</p><p>Why did I do this what have I done? Before I felt like I'd have to go to a mental hospital, my brain was going to explode. Questioning everything I've ever believed. I'm feeling much better now and I will still say I love mushrooms and will definitely do them again. To enter the level I get on when I'm tripping is just an amazing experience and I've learned so much. This past trip taught me how to deal with these emotions and just help it make me a better person. Only now, I'll only trip with people I know well and who are also tripping with me. That's the most fun and best way. Other than that, respect these drugs, they aren't for everyone, but if used in the right setting they are a life changing experience.</p>"
}
