{
 "title": "Anaesthetic Hypothermia",
 "author": "Curious",
 "citation": "   Curious. \"Anaesthetic Hypothermia: experience with Bupropion, Dextroamphetamine & Cannabis (ID 76532)\". Erowid.org. Oct 21, 2013. erowid.org/exp/76532",
 "substance": "Bupropion, Dextroamphetamine & Cannabis",
 "bodyweight": "158 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "Amphetamines",
   "(daily)",
   "  T+ 0:00",
   "150 mg",
   "oral",
   "Pharms - Bupropion",
   " ",
   "  T+ 1:00",
   "4 hits",
   "vaporized",
   "Cannabis",
   " ",
   "  T+ 2:20",
   "10 mg",
   "oral",
   "Amphetamines",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "76532",
   "Male",
   " ",
   "Not Given",
   "Oct 21, 2013",
   "628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There appears to be limited data available on bupropion (Wellbutrin) - Cannabis combination. Here's a summary of my recent experience.</p><p>I have been on Dexedrine 10 mg Spansules BID for 6 months for ADHD. I usually vaporize a small amount of cannabis (3-4 draws from the vaporizer) every second day. Regular use of the low-dose cannabis has resulted in keeping my blood pressure low in spite of the amphetamine and its tendency to increase both pulse and pressure. It has additionally served as a potent social enhancer. My PDoc recently added Wellbutrin and suggested I take it with my first dose of Dex in the morning. Here's what happened.</p><p>Took 150 mg XL Wellbutrin and 10 mg Dexedrine Spansule upon awakening. Within an hour noted a slight lightheadness.</p><p>At one hour following the pharms I vaporized my usual small amount of cannabis.</p><p>Within 20 minutes the light headedness intensified. Over the next hour a gradual feeling of sedation moved in - anesthetic like. I felt very relaxed, cognitively numb, and my pulse and breaths per minute slowed. I took my blood pressure: 85/53, pulse 58. These stats are significantly lower to my usual daytime vitals, much closer to my functioning during sleep (as cross referenced with the data from a Holter Monitor I had a while back). Concentration was very poor and I had a very strong impulse to sleep. Decided to take my second dose of Dexedrine (10mg Spansule) in an attempt to raise arousal.</p><p>The second Dex did not have any modulating effect on my slowed state. I began to feel slightly more confused and had increasing difficulty staying awake. I also noticed that my hands were feeling very cold. In combination with the depressed vitals and desire to sleep, I decided to take my temperature: 93.2 F - moderate hypothermia. The combination seemed to be acting akin to an opiate overdose which is confusing to me especially given that both the Dexedrine and Wellbutrin are activating sympathomimetic stimulants. </p><p>Anyway, long story short, I decided sleep was probably not the safest route to take so, instead, poured a warm bath to raise my core temperature, sipped on warm water, and did some isometric exercises and stretching in the tub. I had to do this a couple of times during the day as my temp would continue to drop without the external source of heat. </p><p>10 hours later, apart from feeling slightly spaced out, all my vitals had returned to baseline.</p><p>Anyway, thought that I'd write in order to remind folks that significant unexpected and paradoxical reactions can take place with this combination. It is possible that the potent stimulant combination (Dex + Well) significantly intensified the analgesic and cardiorespiratory depressant effects of the cannabis. I'm going to try the Dex-Well combo without the cannabis for the next week or two and see what happens. Given that this was my first dose of Wellbutrin, it might take some time for my system to adjust. Once I'm stable on that, I'll try combining the cannabis again to see if the outcome is the same.</p>"
}
