{
 "title": "Accidental Huge Dose",
 "author": "wng",
 "citation": "   wng. \"Accidental Huge Dose: experience with 2C-E (ID 76567)\". Erowid.org. Mar 23, 2009. erowid.org/exp/76567",
 "substance": "2C-E",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "75 mg",
   "oral",
   "2C-E",
   " ",
   "  T+ 10:00",
   "60 mg",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2006",
   "76567",
   "Male",
   " ",
   "Not Given",
   "Mar 23, 2009",
   "13606",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 75 mgs of 2C-E is considered an unusually high dose, see 2C-E Dose Chart]</p><p>Hit hard, and fast. It was only maybe 20ish minutes after it hit me that I was full blown tripping balls. Fractals all of the place. It was great for the first hour, I was absolutely loving it, probably one of the best psychedelic experiences I have ever had.</p><p>After that when it was really starting to peak it was so hard I couldn't even move. I basically laid down on the couch and went into a psychedelic sleep and didn't really move for the next few hours. I have no idea what my physical state was doing, except about 2 minute periods where I would snap out of it, but then slowly fade back in every 40 or so minutes. In my dream state, I was swimming in some under water city, with lizard-like creatures that gave me the power to breathe underwater.</p><p>I don't remember much of this incident, but one thing was I think they were gods, I'm pretty sure of that. They spoke another language, but the only part I remember was one phrase. There is another report that mentions seeing blue 'cyberpunkesque' creatures, and I could also use that word to explain the ones I saw. I didn't see that report until just now, when I was browsing the experiences. His was also on a unreasonably high dose, though smoked.</p><p>'oobi mama hema mamos'</p><p>For some reason that gibberish is all I can remember. I do think that I did understand it while it was happening. For one period a few hours later I think I stared into the mirror for at least a couple hours, or that's what my roommate said. I definitely lost track of time at that point.</p><p>About 6 hours into it I snapped back into reality, but was still getting amazing visuals. Very mathematic visuals, rather than LSD's more organic visuals. I was still not fit for public so I just chilled and put on music for a few hours. But 10 hours after dosing I was able to go to sleep with the help of a valium or 4. 6 Hours after that I woke up and was absolutely fine, just a little bit off from being blown away.</p><p>Probably the craziest psychedelic experience I have ever had.</p>"
}
