{
 "title": "Cured Post-CFS/ME & Depression",
 "author": "Ohayoco",
 "citation": " Ohayoco. \"Cured Post-CFS/ME & Depression: experience with DMT (ID 76579)\". Erowid.org. Feb 3, 2009. erowid.org/exp/76579",
 "substance": "DMT",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "DMT",
   "",
   " ",
   "oral",
   "Cacti - T. peruvianus",
   "",
   " ",
   "oral",
   "Syrian Rue",
   "",
   " ",
   "oral",
   "Mimosa tenuiflora"
  ]
 ],
 "footer": [
  [
   "2008",
   "76579",
   "Male",
   "",
   "Not Given",
   "Feb 3, 2009",
   "14067",
   " "
  ]
 ],
 "report": "<p>I am certain that DMT has changed me, for the better.</p><p>MY PREVIOUS HEALTH PROBLEMS</p><p>A few years ago, I got very ill for no apparent reason. While no diagnosis was able to be given at the time as tests all came up normal, I was later told by my psychologist that I had probably had chronic fatigue syndrome (CFS/ME). The illness came on when I had been veggie for 6 months, and gave up oral antibiotics (for acne) after a period of over a decade, and the only other possible factors could be that I caught a nasty food-poisoning/virus thing off my girlfriend and her friends, and possibly was under stress though no more so than at other periods in my life.</p><p>Whatever the cause, I got abnormally skinny and pale, constantly fatigued, stomach pains etc., needed abnormal amounts of sleep but never felt refreshed, felt mentally slow and eventually got to a point where I was having dizzy spells and felt like my soul was being ripped from my body to an inch to the right during a nauseous period I would have at the same time every afternoon. At this point I felt I must make the choice between eating meat again, or suicide. I opted for meat, and whether coincidence or not, my health gradually improved over the next 6 months. However, I never got back to the same level of energy that I had before falling ill and this made me understandably sad and lacklustre, which is why I started seeing a psychologist.  Psychology was helpful, but in all honesty it only helped me to 'accept my fate', because I never regained the energy and enthusiasm for life that I once felt.</p><p>CACTUS HELPED STOP BINGE DRINKING</p><p>We're nearly getting to the DMT bit. I needed to stop binge drinking, which I had been doing since the age of 13 at least once a week, a few years before 3 times a week. Alcohol was definitely enjoyable escapism, as well as being used to counteract shyness when young. My hangovers now took two or three days, and on the first day I would do ABSOLUTELY nothing, not even get out of bed. Discovering Peruvian Torch helped me curb my drinking, because by taking 5g when I went out, I lost that hunger to continue pouring booze down my throat. This was my first step towards healing. Buying the book 'Feeling Good: The New Mood Therapy' was my second and somehow helped me far more than the psychologist did.</p><p>EXPERIMENTING WITH AYAHUASCA ANALOG</p><p>I then heard about ayahuasca and tried M. hostilis with rue. I had an amazing visionary first time that left me walking on air for the rest of the week. However, the next time I got a real mental pounding from the rue, and couldn't get enough of the light down, and had a horrible horrible experience that was in no way helpful whatsoever - I was already aware of the problems that surfaced and felt depressed for days afterwards. Without the light, the purge was a really nasty experience too.</p><p>DMT TO THE RESCUE</p><p>I suspected that it was the power (MAOI) that I didn't need, just the light, so I decided to try smoking DMT instead. I was spot on. It's as if DMT and I were made for each other. After 3 years, I feel energy and enthusiasm again, I'm so happy, and I have decided that I shall be smoking DMT weekly for the rest of my life. As well as these physical/psychological effects (depending on what's actually happened in my brain), when I'm out I have no desire whatsoever to get drunk any more, in fact I actually specifically don't want to drink too much. DMT also satisfies my spiritual curiosity as if it were filling the 'hole' left inside me by my atheism. I feel loved, if that makes any sense, I almost feel like I'm in love, it's a similar feeling. Don't worry, I don't feel in any danger of being addicted, if such a thing is possible.</p><p>CONJECTURE ON DMT AS A MEDICINE</p><p>Not much is known about CFS/ME. It's a syndrome that seems to have emerged with my generation (I'm 30). It was originally called ME because they thought it was caused by brain swelling. That theory is no longer in favour, and its name changed to CFS, but they call it CFS/ME still because sufferers are keen to keep the physical connotations of the 'ME' label in defence of unsympathetic people who think sufferers are 'just lazy'. A recent theory is that a virus is caught which causes mild brain damage in the relevant areas of the brain... such that while the patient has recovered entirely from the virus, the brain still believes and acts as if the patient is still ill, hence the fatigue, inactivity and excess sleep. Extreme sufferers even feel debilitating pain and muscle aches, but fortunately I didn't suffer that badly.</p><p>So I think it's interesting that people attest that DMT cures them of headaches and distracts them from pain. For me, I feel like it has lifted the 'trick' that my brain (physically damaged or not) was playing on me. I will let you know if my current situation changes, but I don't feel like it will. I feel... right again. Hope this tale is of value.</p><p>28th Jan 2008: It has now been over 9 weeks since I first smoked DMT and I've been happy the whole way through (it's about 3 months since I first drank aya analog).  I have never been this happy and emotionally healthy in my entire life.  Recently I didn't smoke it for 3 weeks and still felt fine, although was starting to become a bit more negative again.  I expect that eventually I won't need it at all, it having taught me to be optimistic, inspired and motivated again.</p>"
}
