{
 "title": "Pharmasists Don't Lie",
 "author": "birtch",
 "citation": "   birtch. \"Pharmasists Don't Lie: experience with Pharms - Zaleplon (ID 7661)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7661",
 "substance": "Pharms - Zaleplon",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Pharms - Zaleplon"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7661",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2003",
   "Views: 16707",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It's a difficult thing to believe that you are addicted. I personally have a great distain for the idea of dependence on anything but myself for anything, this is why I hesitated before accepting a prescription for my insomnia. But I accepted it at 5 mg a night. And so it went for a week taking my dosage with out feeling anything. The insomnia continued until one night where I suddenly felt I was so incredibly 'doped' that I couldn't move I was paralyzed with dope; my only words where 'this is really dope'. Harkening back to the famous line in valley of the dolls.</p><p>Well my prescription as such continued until the end of my first 30 dose box, which is when I asked for another box. The stuff helped the insomnia for a time but the dosage just didn't cut it anymore so I asked to double it which my doctor did happily. No problems there most of his clients are dope seeking yuppies anyways. The biggest market in my town is of course Zoloft or Prozac...name your poison. Anyway I digress. I continued for another 3 months on 10mg pills.</p><p>Finding the is I broke the capsules open and dabbed the powder onto My tongue. I could get  the more pleasant effect along with some hallucinations for a time before I drifted off to sleep nicely.</p><p>A short time of telling my friends of my dabbing experiences they got curious and taking some to social events to spark them up a bit was a little fun. Until dabbing just wasn't the same any more and my tolerance was one again rising along with my intake so I quit them for a time and decided to do some research starting with Erowid along with the pamphlet that came along with all my prescriptions. The prescriptions told me that these drugs should not be used more then 3 weeks (I was at 4 months by then) and that addiction was imminent as well as withdrawal includes: insomnia, shaking, seizures. Well I didn't like that at all. </p><p>I went back on Starnoc mainly recreationally (finding snorting lines of the powder to work the best for this) off and on for the next couple of weeks until the stress of my days was getting worse and the insomnia returned. Recreational and medicinal use of my drugs was taking a large toll on my supply in the last box and I was left with a 10 day difference between boxes.</p><p>That was the most horrendous 10 days of my life insomnia returned with a vengeance and I had to get a generous supply of marijuana to get through some nights. My new box just came in and right away within 3 days I had gone through 7 pills. Then after 10 days 12 pills and I decided I need to cleans my body. And here I am with the best day in a long time coming tomorrow. Shaking with withdrawal, insomnia gripping me like a vice, and going within 20 feet on my supply sparks me to ritualistically grab for my mirror and cutting card.</p>"
}
