{
 "title": "My Kind of Mindfuck",
 "author": "Wank",
 "citation": "   Wank. \"My Kind of Mindfuck: experience with 4-ACO-DiPT (ID 76631)\". Erowid.org. Jun 3, 2009. erowid.org/exp/76631",
 "substance": "4-ACO-DiPT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "insufflated",
   "4-Acetoxy-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 76631",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jun 3, 2009",
   "Views: 9262",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My setting this experience through would be the comforting intimacy of tripping alone in the early hours of the morning, in my room.  I would be on a completely new substance, on perhaps a decidedly high dosage for being inexperienced with this chemical.  This trip, I decided to avoid electronica in my play list of music(a mainstay of music for my psychedelically accelerated mind) and decided to otherwise choose vocally inclined artists including Modest Mouse(an older album), Jason Mraz, Dido, Rasputina, and Frank Sinatra. </p><p>I have been lucky enough to have been dealt(so to speak) a rather nice hand of drugs in my few short years of tripping.  I've come to experience Salvia, Dxm, Amanitas, 2c-i, Lsd, 2c-t-2, Lsa, Mushrooms, Nitrous, Pfpp and a few others.  I am 20 years old, weigh around 160lb, and am physically fit, although I wouldn't go so far as to say I'm 'built'.  I exhibit a borderline personality, but am an otherwise stable individual.  I take no medications, and supplement daily my diet with vitamins, an omega 3, 6, and 9 complex, and 100mg 5-htp, additionally I use kava nightly as a sleep aid. I pursue psychedelics for the wide range of experiences offered, and I rather like how these substances interact with my drawing capability.  At the beginning of this experience I've eaten a number of cookies and a large, fast food restaurant's burger, finding myself edging towards being full.  </p><p>02:05  Imbibement</p><p>I insufflate the chemical, and lick the residual dust off the mirror, finding to my chagrin a powerfully unpleasant assault on my taste buds.  The bitter, chemicalish taste doesn't linger and was easily dealt with by strong mints, though it would be recurring due to the drip.  The nose load from this is mildly unpleasant, but I've only partook in snorting one other drug, yopo, and this happens to be a walk in the park comparatively speaking.  However, the drip is rather unpleasant, and in the beginning I wondered if I would regret my method of ingestion, but found myself to have forgotten about it some ten minutes later.</p><p>02:15  First Alert </p><p>My pupils have dilated, and while colors are a bit brighter, overt mental and visual effects are absent.</p><p>02:30  </p><p>I've come up listening to music and find myself by this point able to pick out every instrument at my leisure.  Visuals are still absent.  I find it rather odd, I can feel my mind slipping into a significantly off baseline area where I'd usually expect visuals to follow, I'm excited to have found a chemical that packs a wallop for the mental experience while laying off trivial(in my opinion anyway) visuals.</p><p>At this point I decided to drop music from my activities and pursue drawing for a bit.</p><p>0300  +++</p><p>I realize now that this is amongst the most pleasant body highs I've experienced, no jaw clenching, odd muscle tensions, balance issues, disorientation, or anything I can otherwise tell as negative.  Instead, a slow warmth has begun creeping across my entire body, accompanied by a very mild mood push, while the tactile experience has seemingly been enhanced some fair bit.  The mental experience is coming along very nicely, seemingly lacking those tightly spun loops I associate with 2c-i or mushrooms, and instead allowing for an extremely level headed perspective, without polarization any one way or the other(emotionally or reasonably speaking), with the added bonus of a creative push(or step away from my normally lethargic nature).  I find I'm rather enjoying myself at this point.</p><p>04:00  </p><p>I've recently called a friend, and found speech to be completely uninhibited, I'm a bit faster on the uptake of topics and such than normal, although rather tangent orientated, or a bit more easily distracted, but all of such is to have been expected in the heightened associative mindset of this kind of substance.   I've decided to put my headphones back on and am greeted with something or other that is pleasant, from here on I proceed to continue drawing and find myself very relaxed.  I find I am able to focus on drawing and the music separately and well, neither in the least bit distracting from the other.  The euphoric warmth is quite comforting, as if like basking in the sun's glow, the tactile has not gotten much better or worse and by this point can't be expected to change much.</p><p>05:00  On Comparisons</p><p>Over the past two hours I have peaked nicely, and found visuals akin to pfpp, that is with a general kick up of the visual scatter, brighter colors, a bit of a halo effect around stark contrasts, and mild breathing effects(most prominent in shadows and textured surfaces).  The mental effects were significantly greater than pfpp and more akin to 2c-t-2, with perhaps a bit less overall euphoria.  The body load seems to have been most comparable to 2c-i with regard to general temperature seemingly having been a bit warmer, slightly higher heart rate, and a greater appreciation for the tactile sense.  From this point I proceed to ride the experience out to it's close, allowing myself to become distracted by the internet and little else.  Typing well, at this point, does require a bit of effort and I seem to have a few more spelling errors than is usual.  Otherwise, as with engaging in conversation, communicating on IRC and sending messages is not particularly difficult.</p><p>06:20  Review</p><p>My pupils are back to baseline size, as am I back to normal with a pleasant afterglow.  I am not at all fatigued by this experience, and do not feel any negative effects such as a slowdown, headache, or other undesirable.  I did not find this substance to be overly stimulating or sedating, there was absolutely no nausea(though that's something I wouldn't normally experience except perhaps for by yopo), gastro effects were nothing special, and I very much so enjoyed myself.  The change in scenery regarding my preference for music did nothing more than keep me for the most part uninterested and unengaged in the music, finding myself treating it more as distraction worthy than to be the beautiful sound scape I would under normal circumstances enjoy.  </p><p>I rather think integrating the bit of enhancement to artistic capability from this will be rather easy, due to few gaps in my memory that I would otherwise experience on the vast majority of psychedelics I've done(perhaps simply an issue of length of time and relative impact of a tighter, faster looping thought process I seem to associate with tripping on most other substances), and the fact that the enhancement to my drawing ability was not in any sense 'mindblowing' but would be enough to warrant review and kick start the integration process from this aspect of my trip.</p><p>Written in the afterglow of the experience.</p>"
}
