{
 "title": "HPPD as a Gateway to Irrational Reality",
 "author": "TheDude",
 "citation": "   TheDude. \"HPPD as a Gateway to Irrational Reality: experience with Cannabis, Amanitas & Calea zacatechichi (ID 76749)\". Erowid.org. Jul 15, 2010. erowid.org/exp/76749",
 "substance": "Cannabis, Amanitas & Calea zacatechichi",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  ",
   "smoked",
   "Calea zacatechichi",
   " ",
   "  ",
   "smoked",
   "Amanitas"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 76749",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 15, 2010",
   "Views: 13499",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First, let me start this by giving a little background on myself. At the time I am writing this, I am a 19 year old male with an extensive history of drug use and abuse. I suffer from mild HPPD, and have for several years. Occasionally I see things run around the edges of my vision or have a 'screen' of color over my vision, or see fractal patterns spiral around, etc. </p><p>Now, back to closer to the present day. About a week ago, I smoked two bowls (approx. 2.5g total) of my 'house mix' that is a base of Cannabis with a portion of Calea Zacatechichi and A. muscaria skins. All I can recall of that night is smoking the last of the second bowl, setting my pipe down and picking up my lighter. Three hours later, I woke up in a construction site about a half mile from my house. I walked home, trying not to walk in front of traffic, as the lights from oncoming cars was very warm and inviting. After I fell asleep I had very strange dreams that would take forever to describe here.</p><p>A few nights later I went back to the construction site to try to get a handle on the trip and figure out how I ended up there. After sitting on a concrete pipe for over an hour I was no closer to a breakthrough, so I got up to leave. As I stood up, my head started swimming, and I felt a little drunk. The familiar spiraling fractals started flying across my vision. I tried to sit back down, but missed the pipe that I had been sitting on and kept falling. I fell backwards onto a new plane of existence. </p><p>From there(or maybe it's really here) I could see clearly two paradigms of reality. In one, everything was a construct of my own mind, created or destroyed at will, my will. In the other, everything was concrete and was a creation of a force beyond myself, stable and unbending. By looking one way, everything was oriented to one version, by looking another the second took over.</p><p>The divergence of perception and the lack of a stable view of reality was starting to make me feel physically sick. I think I vomited once or twice. I tried to fight my way back to what I thought was normal. But I only succeeded in merging the two mutually exclusive views of reality into one. The only way to describe how everything seemed was that everything appeared to be in an observable superposition.</p><p>That was days ago. Everything still seems to be in a state of being indistinguishably concrete and existing as far as a thought. This has shown no signs of abating. I have no idea how long this will last. The only upside of this is that experiencing everything for the first time is so fresh and new, but that quickly wears off. The difference between the paradigms of reality is no longer physically affecting me, but it remains a constant annoyance.</p>"
}
