{
 "title": "Let Your Children Play",
 "author": "The Lizard King",
 "citation": "Citation:   The Lizard King. \"Let Your Children Play: experience with LSD (ID 7674)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7674",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 drops",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7674",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2003",
   "Views: 11619",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWow.  Wow.  Very crazy, yes.  The expectations were nothing, the hope was small, the reality to come was a big surprise...\r\nUpon certain times in a person's life, the nature around you takes you in.  It envelopes you.  It calls to you.  Yesterday was one such day.  Nature's display of weather was unignorable.  The rains to be called down in summertime...and then I recieved a note from a friend with a graphic that truly captivated and inspired me.  Let it be, children - let them play.  I felt the call, it was strong.\r\nTo pursure the faint hopes of minimal expectations, while knowing all the while that we're prepared for an exercise in futility, we went through the motions.  The empty bottle lay where it was put to rest after the last episode.  It was there that I found it.  Two swallows of water into the container, followed by a swirl and shake, and off with the top.  Again, the expectations were that this would most likely be an exercise in futility, but the hope was there.  The bottle was emptied into a glass and I drank one swallow, Rob drank one swallow.  Then nothing.\r\nThen something.\r\nThen everything.\r\n'This is a worknight for me.' - I expected to perhaps 'feel' something, or maybe see the stains of motion that the eyes allow.  I thought we would have to 'try' and focus to 'gain' anything.  To the contrary, there was nothing you could focus on that wasn't 'gaining' on you.  Less than one hour after the sip, the squares on the ceiling came together and tore apart, furiously.  The water that had rained from the heavens took on it's life, and danced.  Everything was broken up, and together.\r\nWhat I expected to be little bike ride through the park became a rollercoaster through the planets.  This was a worknight, again.  Extremely intense, way too much for a worknight.  Alas, I was in for a ride, and held on tight.\r\nThe Simpsons carried us into a candyland maze of colors and cartoons, and inspired us to create a cartoon of our own, so we did.  I had these glowsticks in my car, which I retrieved.  There was two greens, a blue, and a red.  Oh yeah.  Lisa had just finished mopping the kitchen floor and cleaning everything...\r\nAnd we got the scissors out.  The glowsticks were parted by a single cut, and exposed.  To hold on in your hand above your head like the statue of liberty, only to allow your arm to swing violently, releasing the glowing substance to land on and light up every inanimate object, only to animate it.  Rob danced under the rain of color, and it stained him - his hat, his shirt, everything.  Yes - 'let your children play'.  Let them sing, let them dance, let them REJOICE!  And so it was, the entire room glowed.  Brilliant red, green, blue stars everywhere.  The ceiling, the kitchen, the carpet, the walls, the furniture - and Rob...\r\nSo there we stand, hovering over a maze of colors and stars like Gods looking down upon a universe.  And it was the universe, indeed.  We would hover over a particular galaxy, and them shoot to the floor to investigate a particular cluster of stars.  The stars would then become everything - clowns, faces, shaped, a fantastic kaleidescopic array of patterns, vibrant with glowing color.  And the lights are off the whole time...\r\nNeedless to say, in REALITY - Lisa was not too pleased.  But the children want to play, none the less.  Let your children play.  And we did.  DRIVER 2 is a video game where we crash cars into each other, and crash we did.  A burst of laugher not much different than that of young schoolgirls rang out every two minutes from the astronauts.  They were bliss, and watched, as everything turned and twisted, through the night.\r\nAnd then it was 2:00AM.  The walls told the tale that this was not over, not by a longshot.  I gaged the depth of my journey directly by the speed at which the walls allowed themselves to liquify and allow gravity to take hold of them, their appearance, their structure.  And melting at a rate of 12 inches per 5 seconds was an indicator of where, in time and space, we were.  It was time for the plants to try and bring me home.\r\nAnd so we began to build clouds inside the house.  We knew that these clouds would be the only hope of bringing the astronauts closer to the earth, as well as allowing a proper decent, without incineration upon entry into the atmosphere.\r\nAnd success it was.  Apollo 13 landed, and two sailors are left at sea, swimming.  And so I laid my head to rest, still swimming, hoping that throughout the night, we would find shoreline.  God bless the shoreline, huh?  Well, in the middle of the night, the swimmers did, finally, swim to shore.  With both feet on the ground - I awoke.  It was 7:15AM.  Rob lay on the couch, eyes closed.  I'm sure he made it to shore, too.  After all, it was quite clear early in the night that I had traveled a LOT further than he.\r\nI closed my eyes again, and Lisa drove to work.  I opened my eyes, sat down, and began to type.\r\nAnd I type now.  This is my story, this was my dance.  The children's soft minds were soaked, and dried.  As I look around me today, I feel a greater distance between my fellow man and myself than ever before.  My coworkers - they are in place in this universe much different than I.  I am further from humanity, and closer to God, or so that is the word I choose to use because it encompasses NATURE, the STARS, and the 5th dimension.  People are funny, yes they are.  I feel so detached from common man, and closer to the wonders of the world - it's unbelievable.  To play...yes, to play.\r\nLet your children play.\r\nThere's something different about us, different from the common man.  No, sir.  You are uncommon in such common land.\r\nLet us play.\n\n\n"
}