{
 "title": "The Day I Became the Creator",
 "author": "Napp",
 "citation": "   Napp. \"The Day I Became the Creator: experience with 2C-E & 5-MeO-DMT (ID 76794)\". Erowid.org. Jan 25, 2010. erowid.org/exp/76794",
 "substance": "2C-E & 5-MeO-DMT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "2C-E",
   " ",
   "1 hit",
   "smoked",
   "5-MeO-DMT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 76794",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2010",
   "Views: 3876",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: 40 mgs of 2C-E is considered a very high dose, see 2C-E Dose Chart.  Without further detailed information about how the measurements were derived, it is reasonable to assume that this dose is either misinformed or overstated.] <br>It was during the summer of 06, I was 18 and very what I thought was VERY experienced in psychedelics, until that night.<br>My background in psychedelics is pretty extensive. I had taken the sacrament of mushrooms soo many times that I couldn't ever count. Too many journeys, and so much knowledge gained that to ever put words to them would be an injustice to the whole thing. The same with LSD. I had found a vial and basically disappeared for quite sometime but that was a couple years ago. I liked to trip by myself and have been since the beginning. I'd say about 99% of my trips were alone or in the company of sober people who really didnt know if I was tripping or not and didnt care if I was. <br>Then I met my buddy who we will call D. D and I had known each other as we used to live in the same neighborhood. We didnt ever really hang out but I got him to smoke weed i think for like one of his first times. Then, we both lost track of each other. Eventually he got an apartment and we started hanging out all the time. Been through a lot of the same she mentally and spiritually. There was a dank bond between us and we always chilled. <br>Well I moved to the other side of town and didnt see him very much. I moved back in after a lot of fucked up shit and going to rehab for prescription drugs, happened. It was pretty shitty to say the least but it saved my life. Any who, I ended up randomly getting a bag from him and we hung out ever since that day. I started tripping with him for the first time that I've ever tripped with another person. The rest was history. We had many journeys together since that fateful night.<br>I was reading about 2ce and a bunch of other research chemicals at the time and D just so happened to pick up 2ce and some 5MEO-DMT. My parents were out of town up at their condo in a vacation spot. I decided host a tripping party. It was a great idea. <br>We dose about 40 mgs at 11:11 pm and i am tripping at around 11:45. Everything is very colorful, shifting and moving. There's and odd 4th dimension to tripping on 2ce, and lots of tracers. From what I gather, 2ce (becuz it a lot since this night) is a light-based trip, meaning the hallucinations are more intense depending on how much light your eyes take in and if ur sitting in the dark or in a daytime setting. I prefer the dark with a lot of lights like glowsticks or just walking around at night near town. We stayed in tonight and kept the setting controllable.<br>11:45- I feel my consciousness changing and I feel heavy. There really isnt a mind fuck on 2ce just hard tripping with a kind of clear head unless you take a lot.  <br>3- D and I decide to smoke some 5MEO-DMT with our other buddy S who had come over a little after we first dosed. He got a little dose and was the tester. I went next. We loaded it on some foil, about 35mgs premeasured, and D lit under it. I used 3/4 of a plastic bottle to catch the smoke and rip that hit like a rock. I had no idea what I was in for. <br>Within seconds all the smoke was in my lungs and I held it in for quite sometime. Before I could blow the smoke out I coughed out 'OMG! This is the most balls I've ever tripped in my life!' The room started shaking. And all of my vision was shattered like a piece of glass. All the pieces fell, and everything went black. A light kind of like the light of an equalizer visualising music in the shape of a line, in the color of blue, started shaking in the tone of a B flat, which i made to be the hum of earth, but that happens to be 12 lower than the human ear can hear. This geeked me out. <br>I was tripping so hard! Then sound started resonating and getting louder and louder and louder, I was suddenly shot off like out of a cannon. I was flying through outer space and different worlds with ridiculously amazing colors and patterns in the shape of sacred geometry. I come to a bunch of galaxies which fractal/zoom out to a million galaxies in encased in one large circle. I had become the creator of the universe. I was able to see through his eyes. <br>I saw my life and death and the truth/purpose/meaning of life and death. It blew my mind. No one person should be able to see and experience these things. Its just not possible. That freaked me out a lot. It was all so intense and fast that I dont remember any of it except that I was shown it. I came back through a ridiculous amount of hyperspace, back to the normal world. I ran upstairs only to find out it feels like I am floating through limbo and a different dimension, tripping so hard, to go puke in my sink. It felt very good. <br>I remember tripping so hard and then sitting outside in a chair on my back deck smoking some weed with everything moving. the boards of the deck were flying off the deck and zooming around. In general, mad sack trippage. I tried to convince my buddy D that he was and wouldnt ever be prepared for such a hit, and that maybe he shouldnt do it because it was so scary/enlightening. Of course, this made him want to do it more, him being like me. He loved it and had the same ideas i had about it. I played guitar during his trip which he said made it awesome and influenced his whole trip. We tripped until around 8:30 or 9 in the morning. Everyone went to bed and then we awoke at about 4 to discuss the trip. <br>All in all, it was the most defining moment of my life. It was so scary but eventually it enveloped/encompassed my whole life once I realized how awesome it was. I am obsessed forever with the power and the glory.\n\n\n"
}
