{
 "title": "Threshold Oral Experience",
 "author": "1108",
 "citation": "   1108. \"Threshold Oral Experience: experience with Ayahuasca (Mimosa teniflora & Harmala alkaloids) (ID 76862)\". Erowid.org. Dec 31, 2009. erowid.org/exp/76862",
 "substance": "Ayahuasca (Mimosa teniflora & Harmala alkaloids)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "160 mg",
   "oral",
   "Harmala Alkaloids",
   "(powder / crystals)",
   "  T+ 0:35",
   "580 mg",
   "oral",
   "Mimosa tenuiflora",
   "(tea)",
   "  T+ 1:25",
   "600 mg",
   "oral",
   "Mimosa tenuiflora",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 76862",
   "Male",
   " ",
   "Age at time of experience: 22",
   "Dec 31, 2009",
   "Views: 4967",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First, some background information. I am 22 years old, 5'11'/200lbs, and have been experimenting with psychedelics for the last 3 years. I have taken LSD 8 times, and mushrooms 4 times. With the exception of one LSD trip, these were all very mild trips. I have come to like low doses of psychedelics, and decided to add a low dose of DMT to my list of experiences.</p><p>The setting was a suburban neighborhood with my girlfriend J, and two friends A and C, all of whom have similar previous experience with psychedelics. C and J were both initially scared to try a new substance, especially due to DMTs reputation. My own mindset was one of curiosity. I have learned to love low doses of psychedelics by keeping low expectations, and not hoping to be blown away. Hoping to be blown away takes all the fun away when you aren't. I was also going to try not to over analyse the experience while tripping, since that can also take the fun out of the trip. By the time we dosed, no one was 'scared', but we were all anxious in anticipation.</p><p>I had spent a considerable amount of time browsing the internet trying to find out about the safety of MAOI combinations, the similarity of DMT to other psychedelics, and proper dosing. From my research, I was expecting it to be far more similar to my mushrooms than to LSD with potency of raw MHRB taken with MAOIs to be about equivalent to the same weight of dried Psilocybe Cubensis of the same mass (without MAOI). </p><p>12:00PM</p><p>We stopped at Jack in the Box for 'breakfast' before our trip. We didn't pay too much attention to the MAOI diet, since the harmala alkaloids are both selective and reversible and I had read several experience reports from people who ate cheese with MAOIs and had no problem. No one had been taking any prescription or OTC drugs with the exception of J's birth control pills. I ate the teriaki chicken bowl, J had the egg & sausage biscuit, and A had 4 tacos.</p><p>12:50PM </p><p>A few minutes before taking the MAOI, we started snacking on 'crystallized ginger' candy to help with possible nausea. We consumed at least a few grams each.</p><p>1:00PM </p><p>I had previously extracted the alkaloids from 2 ounces Syrian rue seeds yielding 1g of brownish crystals (which should be about 2/3 harmine HCl and 1/3 harmaline HCl). I weighed out 600mg of extract and dissolved it in water. This was poured into 4 identical shot glasses, with the level on my glass slightly higher than my girlfriend's glass. I estimate that I took 160mg. The taste was a bit bitter and unpleasant, but bearable. I then weighed out 2 grams of mimosa hostilis root bark powder and placed it in a cup of boiling water. This was left to stand for a few minutes. We then began to filter out the powder and another cup of water was poured on the sludge that remained in the bottom of the cup. Filtering with coffee filters turned out to be a waste of time.</p><p>1:35PM</p><p>The combined cups of 'tea' were then split by volume into 4 portions. C and A both took 125ml, I took 138ml, and my girlfriend took 87ml. This works out to 0.58g of MHRB personally consumed, for an estimated 7mg of DMT, based on the results of an extraction on the rest of the root bark. The dosage distribution was done this way to try to normalize the dose by body weight-at least to first approximation. The MAOIs did not have any noticeable effects; we all felt sober at this time. Decaffeinated green tea was added to each cup in a futile attempt to mask the taste. The taste was certainly not pleasant, but it was not all that horrible either. We drank the tea over the period of a couple minutes. We began to prepare a second batch of tea, in case we decided to take more. This time the bark was weighed out individually; C and A both got 0.5g, I got 0.6g, and J got 0.4g. This time hot water was added to the powder, stirred, and left to sit. We continued to snack on the ginger candy.</p><p>2:25PM</p><p>By now, we are all definitely feeling the effect. Since the dose is so low, the first effects are very subtle, and we thought we could feel it at about 20 minutes in, though it could have been placebo. There are no visual distortions, but there is some sort of body high, and everyone has their tripping grins on. A,J, an I decided to drink the rest of our tea, making sure to leave the sludge at the bottom of the mug. We then went on a walk through the local park.</p><p>It was a bright and sunny day and about 70 degrees Fahrenheit. We were all enjoying ourselves, and I was definitely in the 'tripping' frame of mind, though there were no visual distortions or significant changes in color. Things seemed somehow different, but it seemed to be more of a subtly different way of looking at things. When we got to the end of the park, we discussed the effects and how they compared to similar doses of mushrooms and LSD. We concluded that it was somewhere in between, though quite a bit 'closer' to mushrooms than LSD. We all agreed that the experience was more mild then when we took 0.5, 0.5, 0.6 and 0.4g (in the same order) of potent Psilocybe Cubensis mushrooms.</p><p>C and I then rolled down the grass hill a few times, which was a lot of fun. The dizziness made it a bit more obvious that I was tripping, as it was one more perturbation from away from sober.</p><p>3:00PM</p><p>We were all still at the park, and C announced that he thinks he isn't feeling the effects anymore. The rest of us, having taken the second cup of tea, feel like we are about at the peak.</p><p>3:30</p><p>We came back from the park and ate more Jack in the box tacos and watched TV. C decided to drink his second cup of tea.</p><p>4:00</p><p>We decided that we were no longer feeling the effects of the DMT.</p><p>No one got any headaches from the MAOIs, and no one was nauseous. It was comparable to a short and light mushroom trip. I am definitely glad I tried this, as it was a lot of fun, and very cheap/easily available. Since the effects are mild and do not last very long, it might be the perfect introduction to psychedelics for those not on prescription meds like SSRIs.</p>"
}
