{
 "title": "Potentially Nasty Stuff",
 "author": "Mrcs",
 "citation": "   Mrcs. \"Potentially Nasty Stuff: experience with GBL (ID 76897)\". Erowid.org. Oct 11, 2009. erowid.org/exp/76897",
 "substance": "GBL",
 "bodyweight": "149 lb",
 "header": [
  [
   "DOSE:",
   "2.25 ml",
   "oral",
   "GBL",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 76897",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 11, 2009",
   "Views: 6529",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my report on using GBL before I cooked it into GHB because I couldn't seem to find any GBL-specific experience reports.</p><p>After waiting two weeks, I recieved an HDPE container of GBL (GHB's solvent-like precursor) from an online source. I did a small amount of research and found both the instructions for cooking GBL into GHB and on the recommended dosing of GBL itself. I was too excited to cook when I found an independant forum on dosing GBL itself (along with discussions on cooking it into GHB). Using a pipette, I measured out a dose just slightly above 2mL & stored it in gelatin capsules.</p><p>After swallowing the GBL I noticed full effects within 10-15min at most, I felt the first effects within 5 minutes. A pleasant 'floatiness' was the first thing noticed. I had no nausea of any sort, even though I had eaten two-hours prior to dosing. I snuggled up in bed with my female 'trip'-sitter (who I've had casual sex with before, but was mainly there in case I happened to carpet out) and felt extremely comfortable. I mentioned the urge to sleep and she agreed to monitor my breathing for safety. I slept very peacefully for 15 minutes until I was awoken by my bored sitter. We began fooling around which eventually led to sex. I've grown to love sex while on GBL/GHB: It carries extended orgasms, increased mental sensuality, and a mild fake-openess that comes with the MDMA high (but to a much smaller degree).</p><p>The larger portion of the effects were over within an hour and I figured it safe to have a couple glasses of wine. Even after the hour of stronger affects gone, I became very drunk quite quickly. Due to this, I passed some time with sensual sex before going to sleep.</p><p>A few friends had caught wind of what I had obtained & were rightfully curious. For the sake of my & my friends' safety I only gave out 1-1.5mL per person. One person decided that since he enjoyed the effects and had done GHB twice previously, he would ask for more which I strictly declined because he had recently taken 25mg of diazepam: I personally didn't care if he wanted to put himself in danger, but not with my product & NOT in my household (ie, not putting myself in legal danger). I used the bathroom & came out to see something that made my heart sink; the pipette used for measuring the GBL in the hands of this asshole. I immediately demanded to know how much he had taken to which he responded the worst thing I could've heard: 'I don't know'. Jesus Fucking Christ! The combination of CNS depressants had already had him high...wtf!?</p><p>I immediately prompted him to sit in an uncomfortably straight, hard-wood chair. It took no time for the drug to take hold, causing him to drop out of the chair like a log. Me and a friend were able to plop his heavy-ass against a wall. I would've put him in the recovery position, but he hadn't been drinking alcohol like I was. He would lift his hands and blindly move them about. This lasted for about 10 minutes. The whole time during this ordeal I held my hand under his nose to make sure he was taking deep breaths: if he wasn't, I would've been forced to call an ambulance. We realized he was out for the time being & decided if he didn't wake within the hour, he was going to the hospital even if he was breathing fine. While waiting for him to awaken, we developed a method which caused him to take deep breaths. Every time we gently slapped him in the chest, he would take a very deep breath...we were slapping his chest like a metronome for thirty minutes until he began responding & eventually woke up. I have yet to forgive him for putting me in such a position.</p>"
}
