{
 "title": "Catnip? Guck",
 "author": "BloodLust",
 "citation": "   BloodLust. \"Catnip? Guck: experience with Catnip & Tobacco (ID 7690)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7690",
 "substance": "Catnip & Tobacco",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Catnip",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Tobacco",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "7690",
   "Male",
   " ",
   "Not Given",
   "Jun 24, 2003",
   "Views: 35650",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok, I was looking for a legal high so I read around here and learned that catnip can get you high... So in being the curious little... that I am, I decided I would try it. I read a few experiences, and I learned that every one of them sucked except for like 2, and one of the ones that didn't suck was when he mixed it with tobacco... Which makes perfect sense to me- cigarettes make you absorb the chemicals in them better so you become addicted, thus if catnip is part of that concoction, you will absorb it better as well...</p><p>So I emptied a fourth of a cigarette into my Dr. Graybow and mixed it with catnip. I sat in my car, smoking it, and I'll tell you right now - it doesnt taste bad. If you try to hold in a LARGE (and i mean large) quantity of smoke at once though, its quite harsh.</p><p>The catnip hit me very quickly, as I felt it almost instantly on my second hit. It made me feel calm and stupid. Upon taking the last hit of the pipe (even though i was hotboxed), the EXCESSIVELY SMALL buzz wore completely off, and now I have hacked up a few loogies and my chest feels kinda congested and painful.</p><p>Not to mention my briar pipe now smelling and tasting like CATNIP. And yes, catnip leaves a resin in the pipe, so have fun cleaning that out.</p><p>Catnip is just NOT worth it. If you want a legal high, then go with Nutmeg or morning glory seeds. (I would recommend the seeds, because they don't taste like eating DUST nor do you have to eat extremely excessive amounts of it).</p>"
}
