{
 "title": "Harassed by British Dude INSIDE the TV",
 "author": "theonewhotrips",
 "citation": "   theonewhotrips. \"Harassed by British Dude INSIDE the TV: experience with Salvia Divinorum (10x extract) (ID 76911)\". Erowid.org. Apr 2, 2012. erowid.org/exp/76911",
 "substance": "Salvia Divinorum (10x extract)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)",
   "  T+ 0:00",
   "1/3 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "  T+ 0:05",
   "1/4 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2008",
   "76911",
   "Male",
   " ",
   "Not Given",
   "Apr 2, 2012",
   "Views: 1173",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting: I'm in my dining room. TV is on nearby in living room. The show Top Gear (on BBC America) is on. This will matter later :) My sitter is chilling on the couch with my laptop in the living room.</p><p>Mindset: A little nervous, and pretty doubtful that I will experience anything beyond sweating and dizzyness/confusion, like my first time trying salvia. This trip report is of my second time. Salvia is the first psychedelic that I've tried.</p><p>Other drugs: I take 20mg lexapro daily (prescription). Shouldn't have had any effect.</p><p>So I load up my bowl about 1/3 of the way, a decent amount. I smoke that in about 2 or 3 hits, holding the smoke in for about 15-30 seconds. At this point I'm a little confused/dizzy and I feel like I'm drifting to my right. That's all I experienced the first time I smoked salvia (and I smoked alot too, like 2 bowls). I really hate the taste of the smoke, marijuana smoke smells so much better to me. I'm in good enough shape to smoke some more so I load another 1/4 of a bowl (roughly). I take a medium size hit, then I took a really big hit and just barely avoided coughing. I hold that in for 30 seconds, and after that is when the fun starts. I remember putting the bong down and standing up, to walk into the living room because I thought at that point nothing was gonna happen, and I was pretty disappointed. I still had the smoke in my lungs. Thats where I draw a blank. I don't remember exhaling. My sitter, I'll call him J, tells me that I dropped to the floor next to the TV which was then almost directly above me in the entertainment center. I was on all fours apparently. I vaguely remember that the room was sideways, and I was hanging on to the floor because I thought I was falling backwards.</p><p>Then things get freaky, and this is the part I remember pretty well. At this point I have no idea whats going on, I completely forgot that I had smoked anything and I barely knew where I was. I look up at the TV, and to me it looks like the host of Top Gear is hanging on to the side of my TV (like INSIDE the TV) and he's yelling at me to 'turn it off!. In reality he's just driving one of  his test cars. I am freaked out at this point, I'm thinking that because of my actions this guy is somehow suffering and I need to figure out how to turn off the TV. J tells me that at this point my hands are running up and down the side of the entertainment center, presumably because I'm trying to find the power button. This was of course made all the more difficult because the world was sideways! Then the British guy is telling me 'Its stuck!' and I'm thinking 'I'm sorry I'm trying to turn it off!' I know that doesn't really make sense lol. I turn to my sitter at this point and beg him to help me turn off the TV. 'Turn it off!' I yelled at him. My voice was actually pretty clear and understandable to him, he said. I  am coming back to reality just a little at this point and I find the remote on the floor and manage to turn off the TV. Thank God, I think to myself. I was so relieved that I managed to finally turn it off. That whole experience took place in under a minute. Then a few seconds later J tells me that I smoked salvia and I was like 'Ohhhhhhh wooooooooooooow.... thats what happened.' I was very confused and dizzy for the next few minutes but the feeling gradually went away. I still feel a little dizzy about an hour later and have a bad headache as I type this. I bet I'll have an even more crazy trip next time :)</p>"
}
