{
 "title": "Light and Pleasant",
 "author": "Tricky",
 "citation": "Citation:   Tricky. \"Light and Pleasant: experience with Bromo-Dragonfly (ID 76989)\". Erowid.org. Jul 23, 2009. erowid.org/exp/76989",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "86 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "333 mg",
   "oral",
   "St. John's Wort",
   "(daily)",
   "  T+ 0:00",
   "  ",
   "oral",
   "Vitamins / Supplements",
   "(daily)",
   "  T+ 0:00",
   "250 ug",
   "oral",
   "Bromo-Dragonfly",
   "(blotter / tab)",
   "  T+ 12:00",
   "1 cup",
   "oral",
   "Coffee",
   "(liquid)",
   "  T+ 12:00",
   "1 ",
   "smoked",
   "Tobacco - Cigarettes",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 76989",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2009",
   "Views: 13409",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n35 Year old male 86kg  \r\nReligion: Neo Pagan- Wicca \r\nMeds: None \r\nAlternative Meds: 333mg St Johns Wort (standardised extract 1000mcg hypercin), Vitamin tablet (100% RDA of all major Vitamins, plus some minerals), Fish oils 600mg (All taken daily, AM)\r\nPrevious experience: Including the following, LSD, Mushrooms (liberty cap), 2c-x of various types, others including unknown pills, mdma, various amphetamines, as well as an assortment of tryptamines.\r\nReasons:  A new and somewhat rare chemical I have the opportunity to taste for the first time.\r\nSet & setting: Im at home, and I have a few days off, so Im testing a threshold dose of this chemical, to check for unusual reactions, before doing further testing.\r\nPreparation: A simple cleaning/banishment of negativity. 5mg of the compound was dissolved in 1.0ml of water with a small amount of HCL added, the freebase went into solution easily. This was dosed onto 5 pieces of paper, 0.2ml each piece. These where then dried to give 1mg per. The scales used are accurate to 0.1mg, and the calibrated pipette to 0.01ml, the combined accuracy should be more than sufficient. \r\nDrug identification: The drug was sold as bromo-dragonfly, there is little info on purity, and insufficient sample to be tested. \r\nT-00:15 BP 134/70 pulse 75\r\nT+00:00 I take 250mcg bromo-dragonfly. 1 piece of paper cut into 4 equal sized pieces. One of the pieces is placed on the tongue. Noted a mild bitter-sweet taste, and tingling sensation. \r\nT+00:30 Not expecting much, so will try to sleep, as this is a long-lasting drug, any effects that appear are likely to be present when I wake. It takes a little while to sleep, and meditation is required, due to being nervous. BP 146/75 pulse 85\r\nT+06:11 Awake to find something is happening, but it is hard to say what. Vision seems sharper, giving things more depth. There is a hint of things moving out in peripheral vision. BP 124/65 pulse 82\r\nT+07:00 No change from above, colours are enhanced a little, bright and sparkly things stand out more than normal. The tiredness that would be normal after only about 5 hours sleep isnt present, nor is stimulation. I dont feel much different than normal mentally, though maybe there is tendency to think about things a little more deeply. There are also mild trails left by moving objects. I feel awake, and a little bored. There is a very mild body buzz, slightly stimulant like, but weak. There is also a slightly dreamy / floaty feeling. \r\nT+11:00 Still not baseline, nothing new to report. BP 112/71 pulse 86 \r\nT+11:30 Appetite is suppressed, but Im going to eat anyway. So far this has been the most powerful effect of this compound. All other effects are somewhat mild, if long lasting. Eating proved to be enjoyable, and not difficult. There is slight enhancement of taste, much the same as there is with colours. \r\nT+12:00 I have had breakfast, and 1 cup of coffee, and smoked a cigarette. This is expected to have an effect on BP. BP 127/77 pulse 86 \r\nT+12:15 I think things have started to tail off a little now, though it is hard to say, the effects where mild to start with. \r\nT+16:00 The above was more of a shift, than tailing off. Its hard to say what has happened, but there is a change to a more dreamy state. The hours are just drifting past in a gently brominated way. There are still mild tracers, and sensory enhancement, also mild.\r\nI have been out and done some shopping, the walk was nice, most pleasant, even if the weather is cold and rainy. Its a little like being wrapped up in a bubble of something nice, quite hard to pinpoint. Conversation is fine, if anything Im more social than usual. My train of thought is more easily derailed than usual, but I can remain focused if I want to.  I have been smoking less than usual, though I did have a cigarette on the way back from the shops. \r\nSpeaking to people seems to be easy, and conversations are fluid. There is a feeling of connectedness with others. This is also apparent but lessened while speaking on the phone. It is possible to stay on subject, although it is easy to flow from subject to subject as well, without taking off in random directions.\r\nThis is very pleasant, and subtle. I am trying to think of some other compound to compare it to, but it is difficult, there are none like this. The closest would be a low dose of mescaline-containing cactus. Even so it isnt the same, and the duration is much, much longer. \r\nIf anything time seems to be passing more quickly than normal. \r\nT+17:00 There is still a mild stimulation, but nothing overt, just a feeling of being slightly more awake than normal. Again I dont feel hungry, but decide to have lunch, its a little later than normal, but I hadnt been thinking about it. Food still tastes good, and eating is easy to do, slightly enhanced flavours, but nothing extreme. BP 131/82 pulse 92 \r\nT+20:00 Effects are reducing, but it is happening slowly. There is still some effect, though its getting hard to tell, I have become more accustomed to the effects by now. I notice them more when they start to go away.  I still dont feel the slightest bit tired, or sleepy. \r\nT+20:30 Third meal of the day. Again not all that hungry, but food was nice, and the taste still seems to be enhanced to an extent. I noticed the fresher taste, as this meal was cooked fresh from good quality ingredients. I think the taste enhancement makes this especially clear. I can also report my first (possible) negative effect I have a slight headache, although it seems to be fading rapidly. \r\nT+20:30 For what should have been a threshold dose, this is lasting an awfully long time. Im sure of my measurements, so will assume this is the European batch. In this case 250mcg is a light to medium dose.\r\nT+22:00 Still some effects, mostly just slight stimulation, again nothing extreme. Im fairly sure the other effects have faded, but as above it is hard to tell at this stage.\r\nT+24:30 Still a mild stimulation, I do not feel sleepy at all. BP140/82 pulse 77\r\nT+25:00 Will try to sleep, though it may be difficult.\r\nT+26:?? Sleep attained with difficulty. \r\nT+34:00 Awake to feel fairly normal. There may be some residual fuzz, but that could be due to lack of sleep. No hangover, or unpleasant effects noted other than that. BP 116/64 pulse 74\r\nThis was a very strange substance, in that the effects at this dose where mild, but exceptionally long lasting. It also becomes hard to tell if the effects are present or not, since it is easy to become accustomed to them. \r\nThe experience was very positive throughout, if very subtle. As written above, it is almost like existing in a bubble of pleasantness, there is nothing overt, or extreme, but overall the experience is very nice. \r\nI expect to repeat this, and may try a slightly higher dose, although I would not want to push the dose too high, too quickly. This substance has already taken me by surprise, in that there are two (or more?) batches, with very different potency. \r\nThe method of dosing is not what I would have chosen normally, the reasons for doing this are beyond the scope of a trip report.\n\n\n"
}