{
 "title": "Falling In Love Again",
 "author": "scamjet",
 "citation": "   scamjet. \"Falling In Love Again: experience with Mushrooms (P. cubensis) (ID 77001)\". Erowid.org. Jan 6, 2013. erowid.org/exp/77001",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2009",
   "77001",
   "Male",
   " ",
   "35",
   "Jan 6, 2013",
   "Views: 2316",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I hadnt touched magic mushrooms for about 3 and a half years. I have never purchased them, I have only ever pick wild ones. Briefly, I am 35 years old. I have been through a few pot-smoking phases in my life. I have used shrooms every now and then if and when I found them and that is the limit of my drug taking experience.</p><p>Just before Christmas 2008 my wife, our baby girls and I visited my parents in Northern NSW (Australia). One day we all went to a river recreation spot for a swim and to my astonishment and glee I saw Psilocybe cubensis growing all over the place. </p><p>I nicked off quietly several times by myself and bagged as many as I could. I shared the news of my find with my wife (who came and hunted with me) but there is no way Id tell my parents. </p><p>This find was the mother load! I hunted 2 more times over the next few days and dried them all out with a blow heater the result was a Tupperware container about the size of an extra large bulk pack tissue box packed full and tight and pressed down with crispy crunchy dried cubensis by far more than I had ever seen in my life. </p><p>On new year's day 2009 we had left our kids with my parents and went camping in the back of our truck in what turned out to be a spectacular coastal location.</p><p>My wife had never tried shrooms before and I wasnt sure if she would. We were at each other a little bit due to life and family pressures etc. I packed some shrooms into my small backpack along with some coke to wash it down with, some food and a bottle of water. </p><p>Very early in the morning we set off down a long sandy track to discover a beach. We walked along in a semi uncomfortable silence. I wanted her to be my friend but we werent connected. She seemed a bit hostile and I could picture her refusing to take shrooms with me. I did not know how the day would pan out.</p><p>We came across a sandy, tidal creek / river it didnt look that nice but I thought that it would be a place where it would be likely that no one else would come. I was looking for a private place.</p><p>After a short disagreement my wife reluctantly followed me and we walked / waded down the stream. I found a suitable private place, sat down got out the shrooms and made my offer. She agreed! It was a very low-key thing. I made two little piles and we ate them, we didnt really chew them well it was more like swallowing pills with coke to wash it down.</p><p>We continued on, we experienced some physical nausea and something akin to mental nausea with accompanying thoughts like oh no what have we done? I hope that this is going to be nice because I can feel it coming and theres no turning back now. </p><p>Jumping forward slightly in time, we were coming up in a big way and the timing perfectly coincided with us reaching the mouth of the river where it meets the ocean and wow!!! Sensory and emotional overload!! This is the most beautiful beach I have ever seen in my entire life, the weather is perfect, the timing is perfect, we are grinning at each other, holding hands, splashing, playing, running and swimming.</p><p>Its new years day! So many of our pressures and worries just washed away. This is what a holiday is supposed to be like. I experienced this revelation and it was all about every detail that lead up to this point. So many details were totally beyond my control and they have all come together to bring us to this place. It dawns on me that this is divine providence. Today is a gift from God! </p><p>We are becoming a bit drunk and behaving a bit silly. We walk a bit funny and stumble on the rocks etc. There are other people around and I dont want our behavior to attract attention. Im a little bit paranoid. I dont want to talk to any strangers. </p><p>We wander around and find our way to the top of a big rock / headland / island thingy. This place seems very central to the overall area and we have a 360-degree view. We are a safe distance from everyone else, no one can overhear our conversation but we can see everyone. People are coming out to play! Families, couples, a man on a kayak, a fat lady with an outrageous brightly coloured sombrero hat. A fat man in a wet suit who tried spear fishing...he had so much gear on including a bright orange floating buoy. He looked so ridiculous; we laughed and laughed at him. The man in the kayak was also laughing at him.   </p><p>My wife started to ridicule my parents expounding on all their quirky ways, we found this hilarious and we dealt with a lot of our angst in this way. Then my wife started telling me how I really am and what it is like to live with me and giving me a really hard time. Everything she said was true and I agreed with it all. I did not fight or contend but I agreed. I didnt just say that I agreed I really saw it from her perspective and I thought to myself what do I do to this woman? It was pretty intense but we got through all of it until there really were no more grievances. Then we fell in love. Everything that she is all, the crap that she has put me through, all the things about her that annoy the hell out of me and an ocean of good things that I enjoy about her all the time for all of this I am in love. We are in love.</p><p>We had much more good conversation and many more mini adventures, peering into rock pools, letting shrimp nibble at our feet etc. and then we started to come down nice and gentle, we wandered again and found a grove flowers on a another headland. It was a ground cover flower with lush green foliage, a carpet of green leaves spotted with pretty flowers we lay down in them and cuddled. We were protected from the wind and we were in our right minds again. People walked along the little path through this little forest and they saw us in our lazy embrace and called out warm greetings we felt warm towards them and sociable.</p><p>We felt God's love for us, warm, happy, safe, and comfortable.</p><p>At 5pm the same day we thought we would give it another go. We did a slightly larger quantity. It went down pretty easy, we strolled off down the beach. It was very different this time. No drunkenness at all. No nausea at all. I thought that it wasnt going to work. The first thing that I noticed was, quite clearly, there was a face in the sky. It was a stylized image constructed of Aztec type geometrical shapes with a hint of Maori tribal tattoo design influence. We had been commenting to each other. Do you feel anything yet and the answer had always been no. So I said do you see that face in the sky? No she didnt. Apparently there was only a roundish hole in the clouds. After this I began noticing amazing, beautiful patterns in the sand and in the wash of water as the waves receded. This beach has minerals in the sand that rise up with the water wash and make spectacular patterns, we could touch them and wipe them off and watch them rise up again. But the drug added an extra dimension to this experience and enhanced our fascination for and appreciation of this wonderful world we live in.</p><p>Another notable experience was running up the sand bank at the back of the beach and beholding the bitou bush. In the late afternoon light the colours had changed, the mushrooms made the bitou bush into a much more striking, vivid, intense green somehow this green satisfied my soul, it was sumptuous.</p><p>We played and laughed and sat and talked looking up at the clouds they were otherworldly and appeared very close like maybe only 50m above our heads. At some stage we started meandering back up the beach. I was so completely at peace sometimes we were silent and my wife commented, why arent you talking? and answer was that my strivings have ceased. All of the stuff that I deal with and think about had reached its completion. I am truly satisfied and completely at peace. I feel like I have been understood and that I can and do understand. All that needs to be expressed has been, and now there is...Existence...Being. Timeless, harmonious perfect life. This is what heaven must be like. This is a glimpse of what is to come. An appetizer.</p><p>We came across a comfortable looking hollow in the gentle undulating sand dunes. A good place to rest, I sat down and in doing so I turned around and sat facing, guess what? The sunset. And I was blown away! Magnificent, beauty beyond description. We marveled, we were enthralled. This lead on to a discussion of stars and planets and the Earth turning and then we imagined piloting in a plane flying into the sunset. It would last for hours but eventually it would escape from you. We were imagining all the international pilots and as they look at their paperwork they are pleased to find out that they are scheduled to fly into the sunset. We imagined the piloting crew totally chilled out just like us right now silently sharing unspoken profound gratitude to be able to enjoy a six-hour sunset together.</p><p>Well thats about it. That was our new years day. On the way back my wife experienced a time distortion. When we arrived back at our things she couldnt believe that we had arrived. She could not connect the walk back up the beach with our arrival. She was convinced that she had lost some memory and said that she has just woken up and we are here and she doesnt know how we got here. I talked her through it and it seems that she did remember all of the pieces of our journey she just couldnt connect them with our arrival.</p><p>Oh yeah, it got dark but I was warm and comfortable, no wind, no mosquitoes or sand flies. I nicked off by myself to eat some KFC that we had but I didnt end up eating it I got so lost in thought. Then I heard my wife crying so I went to her quickly. Her come down was a bit nasty and she said she was sick. I realized that we had forgotten to drink and we had been in the sun all day. I made us drink a lot of water even through we didnt want to and then she told me that her breasts were very full of milk because we had left our baby 24 hours ago. She asked me to feed from her and to suck her completely dry. We have fooled around like this before and it has been erotic but this was different she needed me and I was the strong man coming to the rescue. It was very, very intimate and slightly arousing but not erotic or sexual. I developed a good technique and she was greatly relieved. From this time on for the rest of our two days away we did this together about 3 times a day.</p><p>We were re-united with our family happy refreshed and in love.</p><p>Since this experience I have had a few more and they were very, very different from these. Last night I did shrooms again and they absolutely kicked my ass. This next experience will be more educational and helpful it is also a warning.</p><p>Since new years day I have read copious amounts on the internet about magic mushrooms. I am currently attempting to cultivate them. I havent succeeded yet.</p><p>Last night I found the plastic snap lock baggy that was in my pocket on new years day. The remaining shrooms were crushed into a powder. I emptied about an egg cup full of it into a tall plastic container followed by 350 mL of orange juice and a 500 mg vitamin C tablet. Vitamin C changes everything. I wizzed this concoction up with a stick mixer (kitchen appliance) until it was very well blended.</p><p>I put on an Italian sub-titled movie and sipped at the brew. I am home alone. The taste was fine; it went down easy. I drank about 2/3 of the mix at 7pm and waited about half an hour. No physical nausea but definitely mental nausea. Thoughts like oh crap what have I done, Im a bit scared of this stuff. I felt a bit drugged and it was hard to concentrate on the movie so I went into my ensuite for a shower. I had a normal shower experience and at the end the drugs had worn off. I was completely baseline and a little bit tired. I was pleased about this a good nights sleep was definitely the go.</p><p>I have a little gadget called a shaker. It plays mp3 music. It is very small and it fits into your hand and has its own speaker, not just headphones. This gadget will become my trip set and setting mentor, guide my everything.</p><p>I started playing some music and reading in bed and thinking an hour slipped by now, its 8:30pm. From deep in my reverie I look up and notice oh my goodness I have arrived in mushroom land. I didnt think this was going to happen tonight. </p><p>This is the first time that I have ever done shrooms inside. I am usually wandering around some beautiful outdoors location. We have small children and I have promised myself that they will never see me shrooming. My wife and I enjoyed shrooms on new years day but we have never since been able to get away from the kids (together). I have just realised we can do it right here in our bedroom when the kids are asleep. I start to have fun and enjoy myself then I look over at the remaining 3rd of the brew. I have never had a second helping before once I am up the thought of eating anything is mildly repulsive but eat more mushrooms yuk no way. Mushrooms have powerful appetite suppressant qualities.</p><p>The brew however is quite pleasant so what the hell, down it goes. </p><p>OK vitamin C changes the nature of the trip. If I eat an orange or wash it down with orange juice the trip becomes warmer and brighter the colour of the trip tends more towards oranges, yellows and bright warms colours. I also experience being more in control and not so out of it. Much more able to socialize etc.</p><p>However blending the mix and adding a vitamin C tablet also magnified the intensity by at least a factor of two, maybe more.</p><p>Within ten minutes of consuming the second 3rd of the brew I was coming up to a level that I have never experienced before. I had that music player in my hand. It was playing worship music. I was tapping my foot and I was getting into the groove. Over the course of 4 or five songs I got so deeply and passionately into the music that it had taken hold of me and I was swept away. I was right there with the musicians, I was part of the music, it was emanating from me. I was looking at my music gadget and had profound appreciation for it and its designers. </p><p>OK, simultaneously as I am rising in this musical crescendo the visual hallucinations also rise. In previous trips I have seen the patterns that ebb and flow in a two-dimensional way in other words they are stuck on some surface, the floor for example or the wall or a tree but always the images are constructed out of the substance of real life. In this case it was the granite looking vinyl floor under my feet.</p><p>As I rise, these visuals leap into 3d. My bedroom floor is made out of quickly moving snakes but theyre not too scary because they are stylised snakes and they all fit together like puzzle pieces much like the art of M. C. Escher. They seem to be about 1 foot deep I am up to my knees in them. I am sitting on the edge of my bed.</p><p>Amidst this I am swept up in the groove and them...boom, the 3d visuals leap up and take over everything in the room. The musical ecstasy is beyond ecstatic. It simply defies description. </p><p>Now I cant remember how that little scene concludes. The next scene gets bit ugly and shameful. It needs telling though so here goes. I find myself on the floor in my shower cold water is running but I am trying to stay out of it. I am acting, no I am playing a character or in a character or a character is in me. It is a caricature a farcical cartoon. I am acting out depravity, I am being the very essence of everything that you dont want yourself to become. I am certifiably insane, completely disgusting and the most disgusting thing is I like being this way. I find myself pulling hideous faces. (Thankfully I avoided the mirror.) I just cant stop doing it. I think that I can stop any time that I want to but I dont I just keep going. I dont stop because I like being this way but I also find it repulsive. I think that I could stop but I never do so maybe I couldnt.</p><p>My nose is producing phlegm, lots of it and I am enjoying wiping it all over my face my facial contortions also include hawking and generating spital and it is just coming and coming and coming. I am writhing on the floor of my shower and making hideous animal noises. This culminates in oh dear can I write this. I explode with vomit and it is everywhere, I writhe in it. I smell it. I vomit again. This is too much. Some sanity returns I stand up and shower myself down. It never occurred to me to turn on the hot water. I start to wash some of the mess down the drain. I am weak and exhausted.</p><p>My mind has been so repulsed by what I have experienced and indeed what I have become that I make a decision. Absolutely and for certain beyond any trace of a doubt I will throw out all my remaining shrooms. I shall discard all my cultivation set up and all the info that I have on my computer. I shall never ever again hunt for shrooms. I see this decision in a vision and then I see the cost of it. I highest sacrifice that I will pay will be to never ever have a day like new years day again and I have remorse for the future lost times with my wife. I see perceptual visions (in knowledge) of the much greater and more powerful person that I will become if I follow through and clean up my life. I see other visions of all the relationship damage that I have caused by ever taking drugs and what I would have been like and where my life would have been had I never touched any substance. It will be a costly decision but I have made it and I am resolute, I will follow through.</p><p>I hop out of the shower I am still acting, my character is now humbled, no humiliated and stunned as a gesture of my commitment to my new, clean life I will start by cleaning the shower. I procure cleaning agents and tools from the kitchen and begin. I do a not too bad job and then I am just tired. I believe at this point that I am in my right mind, but I am not.</p><p>I am wet and cold and tired. I half dry myself and curl up on the edge of my bed in a pile of clothes.</p><p>Next scene: I have no personhood. I am a nameless entity. I have always existed and will always exist. I am aware of only two things, the red numbers on my digital alarm clock and a blue flashing circle on my music gadget. It is stuck on pause and so am I.</p><p>For an eternity I have a strange repetitive thought loop. It is machine-like but still biological in some way. I exist to click on and off like the blue circle light on my gadget. I stay like this forever. And then click...I am back, game over.</p><p>Just like the Michael Douglas movie The Game, one moment he is fully believing that the game is real (and its horrible) he jumps off the roof and is caught by those that set the game up he realises that it was a game and he loved it. It was such a worthwhile thing to him that he was happy to pay the bill.</p><p>My right mind had returned and I was awestruck. I walked around the house and outside hoping that no one had heard me. My jaw just kept dropping. I was quiet simply stunned. </p><p>Like I said the mushrooms kicked my ass.</p>"
}
