{
 "title": "More Salvia Divinorum",
 "author": "S.H., France & ER Editors",
 "citation": "   S.H., France & ER Editors. \"More Salvia Divinorum: experience with Salvia divinorum (ID 77006)\". Erowid.org. Mar 25, 2009. erowid.org/exp/77006",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 77006",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 25, 2009",
   "Views: 8356",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nCitation: S.H., France, ER editors. 'More Salvia Divinorum'. The Entheogen Review. Autumnal Equinox 1998;7(3):57-8.</p><p>Wow! In the past I have thought that Salvia divinorum was 'fun but interesting.' Well, it is very interesting, but also very powerful. I smoked alone inside my home at night. I saw a whirlwind of cobras so incredible that it literally made me stop smoking for a second. I was afraid that it was going to wake up all of my neighborhood, and I'm sure that if I hadn't stopped that would have happened. I closed my eyes and the energy became two wheels of raw power, moving in opposite directions around me--even while I was locked in the most powerful position one can achieve--the lotus. I had to open my eyes and move a little bit to release energy. I closed my eyes again and fell gently into obscurity. I had the feeling that, while floating, I could try to reach friends; but I just couldn't think of what friend wouldn't have been disturbed by my apparition, whatever that would have been.</p><p>Two days later, I smoked with a friend outside in the mountains at night. The first attempt was somehow deceiving; as if, instead of bouncing on the walls back against me, the power was diluting itself among the stars. But now I look at this as if the Salvia divinorum was preparing me for what was coming.</p><p>On the second try, everything broke into patterns--but not African, Tibetan, or Indian patterns. No, it was just sausages--sausages everywhere. Beyond these visual effects, suddenly and without any doubt I knew that I wasn't in the same universe. While laughing, I said to my friend, 'I'm talking to you from another dimension. My voice comes to you from a different reality.' It was so clear and so incredibly simple, that I was killing myself laughing. I was in another universe and I saw a very concrete frontier between my friend and I. As time passed, I slowly reintegrated my ordinary spatial and temporal coordinates.</p><p>On the third attempt the world exploded into... mice (why the hell sausages or mice... we've got a lot of dirt in our heads), but with eyes closed I saw that the mice, like laughs, were just flowery images that were keeping me from going deeper. I took deep breaths, concentrated on the energy, and I found myself in a 2001: A Space Odyssey universe. Larger spheres were rotating (some of them were in contact), and between them there was eternity. I said to my friend, 'It is obvious that, of course, I'm not here any more.'\rSalvia divinorum is very powerful. I don't know what would happen if the effects weren't so short. I mean, this state is completely unknown. We don't have the slightest idea how to move in it. Still, it was so simple. I had two choices: acting as if I didn't know what was happening, and ranting and raving, 'What's that? What's that? What's happening to me?' or taking responsibility. And it was simple. I went to another dimension and it was so simple. In fact, the best definition I can give that some readers will understand is that I changed the place of my 'point of collection.'</p><p>A few questions: Are dried Salvia divinorum leaves potent when chewed? If yes, how much is needed, how long does the experience last, and does anyone have a clue as to how to act with it and use it shamanically? -- S.H., France\rIt has been suggested that dried Salvia divinorum can be rehydrated with hot water, chewed, and kept in the cheeks in the same manner as fresh leaves are used (Pendell 1995). This method has now been reported by numerous psychonauts as being effective. A good starting dose is probably 2-3 grams of dried leaf. As with fresh-chewed leaves, the experience should come on slower and last longer than smoked leaf--perhaps 1-2 hours.</p>"
}
