{
 "title": "Don't Touch It",
 "author": "None",
 "citation": "   None. \"Don't Touch It: experience with GHB (ID 7702)\". Erowid.org. Jul 16, 2003. erowid.org/exp/7702",
 "substance": "GHB",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 oz",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7702",
   "Male",
   " ",
   "Not Given",
   "Jul 16, 2003",
   "Views: 18770",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was at a club with some freinds and one of the girls had found a 'new freind.'  This guy had a 20 oz water bottle of something, which I later found out was GHB.  A couple of my freinds had been sipping on the bottle, and I was offered some.  Being the stupid, half-asleep, being 2:30 AM, guy I was at that point, I decided that I could use some as well.  The guy that gave it to me said that it would be like rolling, something I had never done, but was looking forward to trying.  So I drank a about 4-5 oz of the bottle, not knowing the correct dosage.  I was fine for a while, but after about 30 mins, I was sitting on a couch and I started getting crazy visuals, almost as intense as a hard acid trip - something I have done MANY times - and was finding them very enjoyable.  Then I tried to stand up and I couldn't keep balance, so I sat back down.  Then a couple of my sober freinds saw that I was in trouble and started to carry me out.  I was vomiting violently by this point, and later found out most of what came up was blood, not vomit.  As we turned the corner to go downstairs, I passed out.  </p><p>The next thing I know I was lying down, not able to move or open my eyes, and that was pretty scary.  I could hear people talking, saying something to the effect of 'He's coming out of it.'  I couldn't figure out if I was laying on a dorm bed, as that was where I was staying, or in the hospital.  When I opened my eyes, I saw the much dreaded walls of the Intensive Care Unit, and was terrified.  My parents were sitting next to my bed when I woke up, and shortly thereafter my best freind, the girl that quite possibly saved my life, walked in.  To this day I remember the relief my parents felt when they found out I was ok and the terror that I felt when I woke up in the hospital, not able to move at all.</p><p>I will never, and should never have, touch GHB again.  This little incident shows how fragile the human body is and that one person really can make a difference.  I will never forget that night, and never want anything like that to occur again.</p>"
}
