{
 "title": "Fear and Pure Extasy",
 "author": "J. Marshall",
 "citation": "   J. Marshall. \"Fear and Pure Extasy: experience with 2C-B (ID 77053)\". Erowid.org. Feb 16, 2010. erowid.org/exp/77053",
 "substance": "2C-B",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "2008",
   "77053",
   "Male",
   " ",
   "Not Given",
   "Feb 16, 2010",
   "Views: 5155",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One evening I went to my friends house to drink some beers. recently I was hospitalized from two heart attacks and an overdose from heroin. I am an alcoholic and an addict. nothing could make me stop using including ODing or heart attacks. </p><p>Well once at my friends house he offers me some 2 cb. Ive always wanted to try it and I asked if it speeds up yor heart rate since I just had the heart attacks. he replied no, so I took it. within 45 minuites the lights started to sort of just flow together. me and my friends decided to go to another party so we got in the car and headed to downtown Portland. </p><p>Once in the car the effects of the 2cb started hitting hard. my heart began to pound rapidly out of my chest and I felt like it was skipping beats. the music in the car was making it worse. pure fear took over my entire body. the mental effects of the chemical were making my mind think of only one thing. the beating of my heart. </p><p>Then we got to the other party and I went inside and laid down. everything started melting slightly like a light acid/mushroom trip. the heart beat was still pounding in my head, but instantly a feeling of pure peace and extasy flooded over my body. I actually felt like I was going to orgasm. no joke. The sick part of all this is that I was on the verge of death and yet in such a euphoric state that I didnt know whether to be scared or enjoy it. This lasted for about two more hours.</p><p>finally the effects wore off and my heart came back to normal. All I want to share is that if you are on beta blockers, dont take hallucinagens. I know its sounds like a no brainer, but with the addicted mind that I had nothing was reason enough to ever stop using drugs.</p><p>I am now six months clean and sober, loving life. bu I wouldnt change my drug days for anything. they have helped me learn and grow as a human being and I can now help those who are struggeling fight the same fight with addiction as I once did. </p><p>Learn and love.</p>"
}
