{
 "title": "Intense, Amazing & Different",
 "author": "A-rod",
 "citation": "   A-rod. \"Intense, Amazing & Different: experience with 2C-E (ID 77112)\". Erowid.org. Feb 23, 2010. erowid.org/exp/77112",
 "substance": "2C-E",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "oral",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2008",
   "77112",
   "Male",
   " ",
   "Not Given",
   "Feb 23, 2010",
   "Views: 2805",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 45 mgs of 2C-E is considered an extremely high dose, see 2C-E Dose Chart] </p><p>This is trip reflection almost more than a year ago. I dont remember as much as I would like and some details may be slightly altered; I tried to recollect as much as possible. A friend, Jack, and I received what we thought to be 2C-I, later however, we were informed by our supplier that it had been mislabeled and was in fact 2C-E.  </p><p>My friend having a good deal of experience with 2C-I, 10+ times, thought he would enjoy a higher level trip than had been previously experienced.  He decided a 45mg dose would be adequate. I decided to join my friend with his heroic dose and took the same amount myself.  Three of our friends also joined, however with lower, 25mg doses.</p><p>An hour and a half after taking our respective capsules there were still no noticed effects, not even departure from baseline.  Since this was our first time with this specific chemical we thought it might have been inactive. Shortly after this we decided to walk to another friends room and watch The Futurama movie.</p><p>No more than 10 minutes into the movie I started to notice heavy effects. The plot was hard to understand, colors were misplaced and I started having hot flashes. As the movie progressed my discomfort became alarming. My thoughts became disjointed, confusing, and depressing. The plot of The Furturama movie is not linear and it is hard to understand, until the end. My brain became ever confused as Bender jumped through time and the plot became more twisted.  I wanted to leave, but didnt want to venture out by myself.  I couldnt convince anyone to come with me and felt forced to stay.  I was having the most intense trip of my life and reality seemed to be sucked away by the movie.</p><p>The movie finally came to an end and my friends communicated that they were also feeling the drug in full force.  We decided to venture back to my friend Jacks room to lie on pillows, play guitar and lounge.  In his room he had a fairly common grateful dead poster. It features a dead head symbol in the middle, with two lute players in the top corners and skulls adorned with lit candles in the bottom; it is a very detailed poster with A LOT of things going on.  After staring at the poster for a short while each character came to life and seemed to act to their own accord, it was almost like watching a movie, however it had no rhyme or reason.</p><p>I soon grew bored and we decided to venture across campus to my room, I didnt have a roommate at the time and my room was quite larger than most.  The trek was arduous and long, but when we finally made it we started playing with my only still working OGG (a soft egg shaped LED light). We watched in amazement as Jack began to swing the OGG and created solid circles of light. After a few hours of discussion and OGG swinging everyone decided they would head back to their rooms for some well needed R&R.  I couldnt sleep for more than 4 hours and while lying in my bed I experienced the weirdest body sensations I have ever felt.  Some were unpleasant, such as abdominal and stomach cramping. Some felt deeply emotional, but like no emotion I had ever experienced.  While some were very pleasurable, very similar to deep meditation.</p><p>The next day my friend explained his discomforts from the previous night.  He said he had felt his brain melting and many un-nerving and un-centering feelings and body sensations. Although he agrees that it was by far his most intense, unique and mind altering trip he vowed never to try it again.</p><p>In retrospect it was a horrible idea for me to take 45mg of an unknown substance right off the bat, especially since I was relatively new to psychedelics (LSD, Psylocibe Cubensis, 2C-B). My friend who took a similar dose remarks that he has felt off balance ever since the experience.  I am now more experienced in psychoactives (2C-D, 2C-I, 2C-B, 2C-T-7, 4-HO-MET, 4-ACO-DIPT, DMT, MDMA, Methylone, 5-MeO-AMT) and in stabilizing my mood, mind and body while on a psychoactive venture.  This was my most intense psychedelic experience, and I prefer to keep it that way.  I havent felt the urge to completely lose myself like I once did, and I hope that urge never returns.</p>"
}
