{
 "title": "Giant Neighbours Through a Square Holed Hedge",
 "author": "Lomphy",
 "citation": "   Lomphy. \"Giant Neighbours Through a Square Holed Hedge: experience with Acacia, Cannabis & Dihydrocodeine (ID 77155)\". Erowid.org. Oct 20, 2013. erowid.org/exp/77155",
 "substance": "Acacia, Cannabis & Dihydrocodeine",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   " ",
   "Pharms - Dihydrocodeine",
   "(liquid)",
   "  T+ 7:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 7:00",
   "1 bowl",
   "smoked",
   "Acacia",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 77155",
   "Gender: Male",
   " ",
   "Age at time of experience: 16",
   "Added: Oct 20, 2013",
   "Views: 512",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a 16 year old male living in Australia. I have spinal degeneration so I decided to find something to numb the pain, it just happened to be in the form of a cough medicine (Rikodeine) containing 'dihydrocodeine'. I also like the odd cone and became interested in DMT two months ago when I was in Scotland after trying Salvia divinorum. After some searching on the internet I realised a tree in my back garden looks remarkably like an acacia from a picture I found so I decided to put some on top of a jumbo cone and see what happens. This is my experience.<br>I had not eaten for 7 or 8 hours and had been sipping on a bottle of Rikodeine while at school, after the 25 hours of sitting on a plane my back was in dire need of a chiropractic attention but I couldn't get an appointment for a few days so I figured self medication was the way. Rikodeine contains just under 20mg dihydrocodeine per 10ml but because it also contains sorbitol I recommend an iron pill the morning you are taking much of this stuff (lots of sorbitol can give you the shits, iron pills have the opposite effect so they kind of cancel each other out). Over the course of these 7 or 8 hours I had consumed just over half the bottle, just over 100mg dihydrocodeine so I was feeling very happy and no pain at all. This is when I thought of having a jumbo cone mixed with dried sap.<br>I went and sat on the sofa out the back of my house with all my usual gear (pipe, pot, etc.) where I sit to get high looks over to the fence which has big vines covering it and going about twice as high as it, you can't see through it at all, the people who live on the other side have their house at the other end of a full block, so you rarely hear them either. It was 4:30pm in the afternoon and I was pretty base line by 7pm. I was pretty out of it but this is an estimate for the timing.<br>4:30pm. Smoked my first jumbo cone of strong pot mixed with dried sap, it was a very sweet smoke. I got the usual delayed pot buzz (I find pipes take a 1 or 2 minutes to hit me) then going through to the stoned unable to move feeling.<br>4:35pm. At the point where the feeling would normally stop increasing didn't occur, I just kept feeling better and better until I had this complete and utter euphoria all over my body. Think of the best orgasm you have ever had, times it by a million and you're still nowhere fucking close. It was completely amazing.<br>4:40pm. My utter euphoria feeling was still very much with me but I had some form of control over my body now, I could actually open my eyes and look around; which is when things started getting weird. I looked around and everything was very odd and then I heard my neighbours who live behind me clear as day saying they were going to come and buy some drugs from me, there was the guy who lives there and a women, they were both in this 2 dimensional world just moving from side to side of the garden, with no facial expressions or even facial movement but I could hear them talking. Another thing is there is a single man who lives there.<br>4:42pm. I got up and walked/staggered through to the kitchen to get a drink and after having a refreshing glass of bubbly water I looked out the window and to my surprise the hedge was still there but there were now square holes dotted all over it like a lattice and though the squares my neighbour and this women were bigger than the house and still moving from side to side (not walking but just hovering from side to side). I walked back outside with my full glass of water and left the screen door open, instead of turning right to the sofa I went and lay on the grass. Then I closed my eyes and when I opened them back up I was still sitting on the sofa with my pipe in my hand. No glass of water and the screen door was shut. There were no dirty dishes, not even a dirty glass. I had been sitting on the sofa all along. <br>4:50pm. I continued on with my pot high for a while with it coming to a complete end at about 7pm, nothing else like that happened again.<br>This had been one of the weirdest experiences of my life. I had never experienced anything remotely like this before. I'm not sure if I'll try to re-create it, I haven't used pot or any legal drugs since; it happened just over a week ago and has changed my life.<br>This has been my first experience report, I hope you enjoyed reading it and have gotten some ideas from it.\n\n\n"
}
