{
 "title": "Talking To My Soul",
 "author": "Fetch",
 "citation": "   Fetch. \"Talking To My Soul: experience with DXM (ID 7715)\". Erowid.org. Jul 21, 2003. erowid.org/exp/7715",
 "substance": "DXM",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "560 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7715",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2003",
   "Views: 7752",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well I used to take DXM but only for the 1st plateau sensation since I like to be more active, dance, etc.  Reading up on the dosages/dangers/plateaus  I decided to go one beyond and slowly prepare myself for the later plateaus.  Well I bought 3 bottles of Vicks44 since they had no Robo Xtra Str.  I did about 2 1/2 bottles before I just couldn't stomach anymore syrup.  </p><p>So I then went into my bedroom and relaxed while I waited for it to take affect.  I wanted to be alone and somewhere familiar so I stayed home.  I always like to get my favorite music, close my eyes and experience it from there.  Well I listened to some Trance music, some older Cd's (Northern Expo 2, and Harddeserttrance 2) that I still appreciate to this day.  As soon as I started  Expo 2 (disc 1), I was already heavily feeling the euphoria that I've felt with 1st plateau and just started dancing.  </p><p>But quickly thereafter I noticed I wanted to sit down and close my eyes If you're familiar with the CD you'll know what I mean :) From there I clearly felt the second plataeu.  I noticed the music dictated where I was and where I was going.  I felt I was traveling at high speeds when the music would speed up, rising higher.  I noticed I felt as though I were in many different 'rooms'.  I began to, from what I understand, talk to my soul but very briefly about my upcoming divorce and my life thereafter.  I noticed for only brief moment I lost sense of this reality (I would clearly think about my responsibilities, things I had to do etc) and only gazed upon what other realities await me. I'd say the peak lasted the whole first CD then halfway thru the second (2 hours) where I began to regain a constant hold on my reality.  In between the CD's I got up and walked around my house for a bit and felt 'wobbly' and couldn't dictate my sense depth as the stairs became a chore to go down :)</p><p>The experience has opened my eyes at what DXM can do, if only for what I saw was so limited as to what the Third/Fourth Plateaus behold.  I will try around 600mg next time to understand the Second Plataeu more before reaching the later stages.</p>"
}
