{
 "title": "Tramadol Trials in Thailand",
 "author": "green girl",
 "citation": "   green girl. \"Tramadol Trials in Thailand: experience with Tramadol (Ultram) (ID 7717)\". Erowid.org. Jun 28, 2001. erowid.org/exp/7717",
 "substance": "Tramadol (Ultram)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Pharms - Tramadol",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7717",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2001",
   "Views: 48842",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was recently prescribed tramadol quite legitimately in Thailand, for severe headache. Whereas one (as rx) had no effect, upping the dose soon brought on very pronouced opiate effects, i began to feel extremley relaxed and pleasant with around 300mg, in a slightly different way to codeine, the experience was cleaner, without the nausea, gastric effects and scratching that codeine sometimes brings.\r\nHowever i should point out that i have a regretably high tolerance to opiates and would urge caution with this, and all other opiates.  Although i was advised that it was not addictive, i found increasing tolerance and dependance did occur with time, and i ended up taking 700mgs at a go.  This was actually fantastic, the full opiate, laid out place of safety thing, but a non participating observer reported my behavior as extremely bizarre while under the influence.  I was talking to myself and other non existent individuals, trying to rest on my outstetched arms in mid air,and appearing very irritated when disturbed from my reverie.\r\nAfter two months use at around 500-700mg a day i moved on to malaysia where tramadol was unavailable.  I experienced a very unpleasant cold turkey experience after about 48 hours with muscle cramps, fever,shaking and postural hypotension (Feeling faint on standing up) and some horrific trainspotting type nightmares.It took me three weeks to feel o.k again.\r\nTramadol is available over the counter in thailand for about two pounds a box. According informal word of mouth researched by myself, most people seem to have fun on 4-6 tablets - 200-300mg.I have heard of people having very unpleasant trips however,although i had nothing but fun till i tried to quit.one thing however,its really hard to pee after taking even small doses, this lasts for about 12 hours after the last dose and can be a little freaky.would i recommend it..? yeah,but thats me..caveat emptor as they say....(let the buyer beware!)\n\n\n"
}
