{
 "title": "Wishing It Would All Go Away",
 "author": "Sirynx",
 "citation": "   Sirynx. \"Wishing It Would All Go Away: experience with DXM (ID 7719)\". Erowid.org. Jul 21, 2003. erowid.org/exp/7719",
 "substance": "DXM",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "4 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7719",
   "Male",
   " ",
   "Not Given",
   "Jul 21, 2003",
   "Views: 6038",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had not yet experienced LSD, and was told by all kinds of people that 'robotripping' was, if nothing else, 'interesting.'  Well, interesting it was, but after taking LSD, I will never go back to such a dirty drug...here's what happened:</p><p>I was at my apartment, with several friends, 3 others who were all tripping with me.  We drank the bottles (which was the worst tasting substance I have ever had to take) and felt kinda sick for around 30 to 45 minutes before it started to take hold.</p><p>Once it started, it was intense, and a lot of times scary.  There wasn't the paranoia of LSD, but there was this ability so sense the underlying themes of whatever was going on, especially in music.  There was just a menacing vibe everywhere, and it was all in all disturbing.</p><p>Eventually, the effects became overpowered...it was difficult to function on any kind of level...walking was almost impossible, and coherent thought doubly so.  The most intense visual I had was like this:</p><p>I was lying on the floor with my eyes closed, and just really wishing it would all go away.  I opened my eyes, and instead of seeing the carpet, I was looking over and down this huge, sheer embankment of what seemed like thousands of feet.  It actually felt like I was on top of this cliff, and it was NOT cool.  After that I just laid there for ? hours and waited for the effects to wear off.</p><p>The entire next day, and even some into the next, I could feel the comedown, I just felt horrible.  I thought at the time that it was pretty cool, but then like I said, I finally got some LSD, and NEVER will I go back to od'ing on cold medicine for a high, and I do not recomend it...stick to the real stuff, it's a much better experience..</p>"
}
