{
 "title": "Thought Processes Attacked",
 "author": "KJ",
 "citation": "   KJ. \"Thought Processes Attacked: experience with DXM (ID 7721)\". Erowid.org. Jul 22, 2003. erowid.org/exp/7721",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "4 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7721",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 22, 2003",
   "Views: 6521",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Please, do not experiment with DXM. Its a fun (and interesting) experience, BUT NOT WORTH IT. Trust me...</p><p>My experience started on new years eve 2000 (we were entering 2001)... I had done DXM before, but the previous 2 times I had split the bottle with another friend (usually letting him have more than me). Anyways, my friends and I went to Albertsons to buy some Robitussin for us early that evening. Each of us drank a bottle around 8:00 pm and were definately feeling the effects by 10:00 pm when we got out of the Spa. The trip lasted well into the night and when I ended up going to bed at about 1:45 the next morning I was still feeling it. The next day I felt drained of energy, the next day I was feeling better, and the next day I started to realize that DXM had attacked my thought processes.</p><p>A DXM trip is like being really stoned (the 'slow motion' effect), really drunk (the 'no balance' effect), and has a noticable body high. Oh yes, and my vision is FLAT and many times I will think that an object is something that is really not. Its not halucinations, but my mind definitely wanders and feels out of place. What ever I are focusing on with my eyes is 'outlined' in a way and everything else around it is flat. Don't get me wrong, the DXM experience was very fun at the time (example: my friends and I sat in a VAN for 45 minutes just laughing and watching the neighbors kids ride around on their Razor Scooters), BUT, it was NOT WORTH the after effects! If I could trade in that new years eve for a boring new years eve with out DXM ever involved, I WOULD.</p><p>The next month or two (and even now but nearly to the extent as earlier), my brain would not function correctly. Thinking of the right word to fit into a sentence was difficult, I find myself slightly dyslexic, memories I know I should have are not easily recalled, and I generally feel like I am considerably more stupid than I was before I made the decision to pound that bottle of Robo.</p>"
}
