{
 "title": "Merging with Methylone",
 "author": "Selective Amnesia",
 "citation": "   Selective Amnesia. \"Merging with Methylone: experience with Methylone (ID 77240)\". Erowid.org. Mar 22, 2010. erowid.org/exp/77240",
 "substance": "Methylone",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 1:00",
   "60 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 2:00",
   "60 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 3:00",
   "60 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 4:00",
   "60 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 5:00",
   "60 mg",
   "oral",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 77240",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 22, 2010",
   "Views: 4523",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>150mg re-dose 60mg every hour. Initial effects lasted 2 hours with 150mg.After this effects began to wane. Re-dose was then administered after the first 2 hours, every hour.</p><p>Comparatively an MDMA-like buzz with a slight feeling of anticipation and anxiety on onset, progressing to a feeling of elation and warmth, but not to the same extent of MDMA. Although this drug has been called MDMA-like, it is of-course not MDMA, so therefore its effects are different and a comparison cannot be adequately made. It is an empathogen for me, but without the forced loved up synthetic ecstasy buzz. Its definitely not the methylone talking.  Feelings of happiness and wellbeing. A lucid clearheaded intoxicated state.  My personal judgement is not affected such as the ability to act normally (baseline) in a situation as if sober. There is a defining dream-like affect that is distinct from the MDMA buzz. Music appreciation is enhanced. Slight nausea was experienced with a friend who took 175 milligrams in the initial phase but re-dosed on similar amounts (60mg), nausea diminished after 1 and a half hours (roughly). Through the process of experimentation my own personal optimum dosage 150mg and small top-up doses there-after. After effects included a feeling of slight emotional flatness. No intensive negative feelings experienced. Later in the day the flatness was replaced by a feeling of contentment.</p>"
}
