{
 "title": "Clear Distortion",
 "author": "Forrest",
 "citation": "   Forrest. \"Clear Distortion: experience with H.B. Woodrose  (ID 77264)\". Erowid.org. Oct 26, 2012. erowid.org/exp/77264",
 "substance": "H.B. Woodrose ",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Cannabis - Hash",
   "(cookie / food)",
   "  T+ 0:00",
   "7 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   "  T+ 0:20",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:30",
   "4 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   "  T+ 2:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 77264",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 26, 2012",
   "Views: 1012",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ive been experimenting with psychedelics for a few months now and decided that H.B. Woodrose was worth a shot seeing as how theyre cheap and many people enjoy the effects. </p><p>I ordered seeds off the internet and my friend and I chose a Friday evening to take them. I had eaten a quarter of a pretty potent hash brownie so I was already pretty on by the time we got around to the seeds. At about 6:30 PM we each ate 7 seeds, simply popping them in our mouths and crunching them up without prior preparation. We decided to walk down the beach while waiting for them to kick in. After about 20 minutes I noticed a slight change in my vision and a peculiar body feeling. There was a faint sort of veil over everything in my range of vision and when I closed my eyes I could see some moving shapes and colors. My friend reported that he was feeling a bit spacey. My stomach began to feel a bit off too so we decided to smoke a bowl on the beach. Afterwards we walked towards my other friends coffee shop to get some drinks. The body feeling remained more or less the same for most of the walk but I noticed that time seemed to be moving very slowly because the 30 or so minutes it took us to get there seemed like at least an hour. </p><p>About halfway through the walk my friend started bugging me for more seeds because he wasnt feeling it so he took another 2 seeds while I took an extra 4 for myself. This brought my total to 11 seeds and 9 for him. By the time we reached the coffee shop and I got my drink I was feeling sicker by the minute. Nausea began to creep into my stomach and I was so tired I felt as if I was going to fall asleep right there. My tripping buddy said he felt fine apart from being really buzzed so I figured it must have been those two extra seeds and the large mocha freeze I drank. My two friends wanted to go to my house and finish off the MJ but I told them I just wanted to go to bed. </p><p>It was about 9:00 when we began the long walk home and I was sure I was going to throw up. On top of the nausea I was getting painful cramps in my abdomen and my mouth felt extremely odd as if my tongue was swelling. Once I got home it was about 9:30 and I went straight to my room and flopped down on my bed while my trip buddy used the bathroom. When I closed my eyes I realized that the colors and shapes I had noticed earlier had become much brighter and clearer and were quite a bit of fun to watch. So after giving my stomach a minute to rest my friend and I decided to smoke anyway to see if I couldnt intensify the hallucinations a bit. So we went out back and packed a huge bowl and I stayed for about 2/3 of it and left the rest for him. </p><p>I went back inside, stripped down to my boxers, turned the lights of and put on some Shpongle while I lay on my bed enjoying the kaleidoscopic colors and geometric shapes dance before my eyes, they seemed to move and bounce and spin in time to the music. I was having a very good time when I heard a noise in my backyard and went out there to find my trip buddy who I thought had gone home 20 minutes before staggering around muttering to himself. When he saw me he said I found it! I really found it! </p><p>I thought to myself Jeez, hes really fucked up, I cant let him walk home like this so I invited him in and told him to be quiet cause my brother was asleep downstairs. He collapsed on my bedroom floor and started mumbling something about how he had become god and he could see and feel everything in the universe. He would start to get very excited and begin yelling and raving and I told him to shut up and he would apologize profusely and say something like You dont understand, you are my son, my disciple. </p><p>Every 20 seconds or so he would ask me what time it was and Id tell him and hed refuse to believe me because he said it felt like years had passed since he last asked me. Then he started holding his breath for as long as he could and then scream Im dead my son! Im dead!</p><p>I eventually got him off the floor and made him watch the visualizer on itunes which he seemed to enjoy very much and I made some instant noodles and we sat there for about an hour listening to Shpongle and eating. At one point I wanted to experience what my buddy was experiencing so I smoked another bowl by myself but it only made me feel slightly more loaded. </p><p>At around 11:20 I walked my buddy home and returned to my house to try to go to sleep. I couldnt sleep because the hallucinations were still pretty intense and the stomach cramps began to return. My throat felt as if it was expanding and contracting slowly and my jaw kept locking up making me very uncomfortable. I laid there for about 15 minutes before getting back up and putting the music back on. </p><p>At 12:30 I was still pretty fucked up and my pupils were pretty dilated. Then without warning, I started experiencing very powerful, very weird sexual urges, like crazy kinky fetish stuff that had never even crossed my mind before. Just the fact that I had such an intense urge to do these things scared me a little. But just as I was about to go get out some oil and candles the desire disappeared and was replaced by a deep sadness that lasted about 20 minutes. I tried to get back to bed but my jaw continued to clench up and the hallucinations distracted me.</p><p>Over the next hour I had dramatic mood swings that took me from depressed, to ecstatic, to horny again, to confused, then back to depressed. I kept having the desire to do very bizarre things like run around in my backyard with no clothes on. At one point I wound up in the bathtub naked and crying. At around 3:20 AM I finally calmed down and fell asleep. </p><p>I woke up the next day at 2:00 PM with a headache and a weird tingly sensation in my legs that made me pretty wobbly and I wasnt quite back to 100% until about 5:00. </p><p>Overall it was a very bizarre experience, both good and bad at the same time. I think Id like to try them again in the near future but I'll take them by myself and just stay home for the duration of the trip. I may smoke more too because Im curious to see what my tripping buddy was talking about.</p>"
}
