{
 "title": "Stimulation Without Euphoria",
 "author": "Sparky",
 "citation": "   Sparky. \"Stimulation Without Euphoria: experience with 4-Methylmethcathinone (ID 77309)\". Erowid.org. May 27, 2009. erowid.org/exp/77309",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 77309",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 27, 2009",
   "Views: 18514",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm a 17 year-old male in the UK with experiences of stimulants, narcotics and psychedelics.\r\nOn to my experience...\r\nI measured out approximately 200mg of mephedrone by splitting a 1g packet into 5 equal lumps. The mephedrone was an off-white powder with a strong fishy smell. The 200mg was dissolved into a cup of water and drunk quickly. Despite experience with many other substances, I have no desire to ever insufflate anything, hence the oral dose.\r\nAs I had recently come back from work, I grabbed myself a sandwich and crisps whilst waiting for the mephedrone to take affect. After about 20 minutes, I could feel more than anticipation. The chemical was starting to come up.\r\nBang! The mephedrone hit with surprising force. An overwhelming sense of speed enveloped my body; I could only describe what I could feel as my pupils dilating quickly, close objects becoming larger when focussed on, and distant objects becoming smaller. There was a sense of disconnection from the room. Music playing sounded slightly distant and tinny, albeit much, much faster.\r\nMoving around seemed very, very fast and I felt the need to pace a bit. At one point, I lay down for a couple of seconds as the rush became too intense. I didn't record my heart rate accurately, but estimated it at 150bpm + at this point.\r\nOddly lacking from this crazy speed was a sense of euphoria. This is where the mephedrone for me became disappointing. As the speedy rush weakened (after only 5 - 10 minutes), I was expecting euphoria to wash over me. No such luck. The speed diminished into a caffeine-like residual stimulation. A side effect present however was strong leg shaking and jaw-clenching.\r\nThis residual stimulation lasted for about two hours after the short, 10 minute rush diminished. Despite this, I had no problem sleeping, and awoke early the next morning refreshed.\r\nIn conclusion, mephedrone really disappointed me. The initial come-up rush led me on to thinking I had stumbled upon something very special - then it dropped off. Whether this is due to the method of ingestion, the fact that I ate after dosing, or my own brain chemistry is unknown.\r\nIt seems that few reports from Erowid and afar have mentioned a lack of euphoria, so it just goes to show that chemicals affect people uniquely. Being a school night, and driving the next day, I didn't intend to redose; this may have brought on the desired euphoria, and I may try this at another point. At no point was I compelled to take more mephedrone, despite its reputation of being moreish.\r\nIn the future, I will try accurately measuring 200mg into a gelcap, and try the substance in a more fitting situation - a rave or party. However, based on my first experience, it proved disappointing and not worthwhile considering little is known about harmful effects.\r\nCheers,\r\n-- Sparky\n\n\n"
}
