{
 "title": "A New Life",
 "author": "Daniel",
 "citation": "   Daniel. \"A New Life: experience with Ayahuasca (ID 77312)\". Erowid.org. Sep 17, 2009. erowid.org/exp/77312",
 "substance": "Ayahuasca",
 "bodyweight": "146 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 ml",
   "oral",
   "Ayahuasca",
   "(liquid)",
   "  T+ 1:00",
   "200 ml",
   "oral",
   "Ayahuasca",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 77312",
   "Male",
   " ",
   "Not Given",
   "Sep 17, 2009",
   "Views: 9303",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I live in Algarve, in Portugal. I apologize for my bad English.  I am posting this report, because I believe it will help many people like me.</p><p>About 1 month ago my life took another direction, after the most magic, intense and wonderful experience of my life.  </p><p>I used to suffer of depression, anxiety and syndrome of the panic. I was very fat (146 kg or 319 lb), and I'm not tall (1,72 m or 5.64 feet). I had tried suicide several times. I never understood the reason for that, nor any therapist or psychoanalyst. Sometimes I was interned, I passed some years of my adolescence from one clinic to another, and sometimes in hospitals, while I should be having fun and making friends. The anti-depressants softened my suffering, but they didn't heal it, and in a certain way they seemed to worsen my condition.  </p><p>At the end of my adolescence, when I was 19 years old my general mental health was better and I started to study in normal schools, I could make friends. But along to this freedom I began to use drugs, at first Marijuana, later the Cocaine, I became a heavy cocaine addicted and I started to spend all my family's money without their knowledge. I got to use PCP and Ecstasy. My family never knew, just my psychoanalyst, that continued prescribing anti-depressants and saying always the same thing: Stop with that, but never pointed me a real solution.  </p><p>In 2001 I had heard about the Amazonian sacramental brew through Internet, called Ayahuasca, and also fantastic healing reports related to it. So I started an incessant search for this precious sacred brew. In 2003 I found in a Dutch smartshop a Kit for analogue Ayahuasca, with Mimosa hostilis bark and Peganum harmala seeds. I bought 7 kits, however none of the preparations, in any amount, produced any vision or healing. I was disappointed and forgot the subject for some time.</p><p>In 2007 I found the powder of the Banisteriopsis caapi and Psychotria viridis ready for brewing, I bought 5 kits. I just felt a light euphoria with the content of the 5 kits taken in an unique dose. The material is good, however very very thin. I continued to use these kits, sometimes I could feel something and eventually to see images (as a dreamy-like state, but not vivid), my life was changing slowly, the depression was no longer severe and I felt these mixtures were healing me indeed.</p><p>Recently I found a genuine Ayahuasca supplier in Brazil. I was suspicious, but I decided to take the risk. So I ordered the 0.5 liter bottle for 10 doses. It was 12 countless days of wait and anxiety, but finally the order arrived! It comes in a 50ml tube, the Ayahuasca comes very viscous, as polish, to be mixed and restored with water, and I did that. </p><p>I went by car to my parents' country house in the mountains (Serra da Estrela), I was alone. I cleaned the room, lit some incenses, put to play the icaros CD that they sent me (very good songs), I lied down on an old mattress and I took the dose of 50 ml.  </p><p>After 1 hour I only felt a light euphoria and I judged that they deceived me. But I took more 200 ml thinking that the tea was thin, the flavor is very bitter, it is different from everything that I ingested.  </p><p>After that I didn't count the time, but something was approximating, I don't know how to explain that exactly, I was afraid, the wind blew and whistled, and I saw through the window that it was snowing, it was very cold outside, however I was protected by 3 covers. I noticed that my audition was better than usual, behind the music I could hear what people were talking at 200 meters or more.  </p><p>Suddenly I felt falling in a hole and my conscience started to dance, it produced spirals, it was simply moving in the space around, and that was not the physical space. Everything was so vivid, so real! Then I felt an strong nausea, I wanted to vomit, but I couldn't get up. Luckily I had prepared a pot, and left it near me, with an effort I lifted my head and vomited inside the pot. When I opened my eyes, for my surprise, there was a mixture of cocaine, cigarettes, pills and maybe also blood. I entered in despair. I Remember a voice that was not mine, a female sweet voice, that told me to be calm, that the despair would not help me. I got to calm down. The visions were intense, very fast, I could capture just a few of them.   </p><p>At a certain moment I saw myself as a child, perhaps 4 or 5 years old, in a spring day in a park of my city (Faro). Many children, maybe 7 or 8, approached me and started to attack me, they swore bad words, they renounced me, they said for me to leave that place. They were children in my age and older, my parents didn't do anything noticing the situation, they thought it was child's game. I cried, cried, and when I opened the eyes noticed that I was shouting, crying very loud, with the face soaked by tears.  </p><p>I cried for more than 1 hour.</p><p>So I understood from where my suffering become and when it began. My subconscious used to tell me I was an unwanted person, that I didn't deserve to live and for that I was punishing myself. Then the cry ceased, I felt an wonderful well-being sensation and peace, as I never felt before, and an incredible gratitude for the life. At this moment I could not more see images, however my conscience was still dancing and traveling around me, but I was back to the material plan in 90% I suppose.</p><p>My family doesn't know about this experience, but I intend to tell them soon. The fact is the people are amazed with my life change. Immediately after the experience I threw out to the garbage all my medicines, the cigarettes and the cocaine that I brought with me. More than ever I have the power to live. I feel that my body, mind and soul are united again, and the discipline is my friend. I began to pratice exercises and eating raw food (actually not 100%, but it will be soon), I got health and lost 17 kilos in less than one month. I believe in god, in the life and in people.</p><p>Ayahuasca brought me the life.</p><p>After this experience I had other 2 experiences, the last one yesterday, for what I decided to talk about. These experiences reinforced what I learnt, as well as they brought new resolutions.</p>"
}
