{
 "title": "Buzz Light",
 "author": "Perry",
 "citation": "   Perry. \"Buzz Light: experience with Hops & California Poppies (ID 77352)\". Erowid.org. Mar 9, 2009. erowid.org/exp/77352",
 "substance": "Hops & California Poppies",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Hops",
   "(dried)",
   " ",
   "  ",
   "smoked",
   "Poppies - California",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 77352",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 9, 2009",
   "Views: 8986",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe way I smoke hops is with california poppy foliage in a 50/50 mix, I find the effect is better and its much more smokable. Let me clarify 'poppy foliage' mostly this is sticks, I remove the larger ones from the mix. I also use the mix because hops are somewhat soft so the 'foliage' helps balance this and make it easier to roll.\r\nExperience\r\nHops have a bit of a weird taste to them, I don't like it on its own but the poppy helps with that. I smoke a joint of this, sometimes a larger one. The buzz is similar to MJ but not nearly as strong, and I don't experience any mental clouding or paranoia as with MJ. The effects last for 15-20 min. and then become unnoticeable. I experience a slight mood lift, but nothing that would turn me around from feeling bad. No negative effects experienced. \r\nMy neighbour thought I was smoking MJ, he could smell it from the hallway, it does smell similar to MJ so be careful if you are around people who are not MJ friendly. Another thing I have noticed is that it makes easier for me to go to sleep if I have it before going to bed, MJ before bed keeps me awake. \r\nConclusion\r\nI smoke hops frequently as a lighter MJ alternative. I would mix hops with something else because the taste is not that great, other than that, no negative effects. Its nice to smoke if I just want something lighter, and a good backup if I run out of MJ.\n\n\n"
}
