{
 "title": "Deep Healing Journey Within",
 "author": "PsiPhi",
 "citation": "Citation:   PsiPhi. \"Deep Healing Journey Within: experience with Harmala (caapi extract?) & Mushrooms (ID 7737)\". Erowid.org. Jun 29, 2001. erowid.org/exp/7737",
 "substance": "Harmala (caapi extract?) & Mushrooms",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Harmala Alkaloids",
   "(pill / tablet)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7737",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2001",
   "Views: 10899",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAfter a six year hiatus from entheogens I had the opportunity to try some mushrooms.  A few weeks prior I was able to obtain some Banisteriopsis caapi (Harmine/Harmaline) in tablet form from an online distributor.  Since it had been six years and I had no idea how potent the shrooms were, I started by eating the smallest shroom in the bag.  Although it was less than 1g, the experience was deep and insightful, lasting about 4 hours.  From my previous shroom experiences I now knew these shrooms were very potent.\r\nAfter a few days I took the 2 x 250mg tabs of Banisteriopsis caapi by itself to familiarize myself with its effects - it was very pleasant and deeply relaxing with a mild nausea and vertigo.\r\nSo a few days later I took 500mg of Banisteriopsis caapi and about 2 grams of shrooms.  Within 20 minutes I began to feel both deeply relaxed and at peace while my mind began a deep journey within.  After a timeless period, I awoke to my external surrounding realizing that this entire time I had been sitting in my chair at the computer.  I was deeply entwined with internal experience that I had lost touch with external reality completely. It was then that I slowly made my way to my bed to lie down and get under the covers.\r\nThis combination is definitely not recreational and should be done in a safe and controlled setting, preferably with low light and a comfortable place to lie down.  The Banisteriopsis caapi puts me in such a deep state of relaxation - almost anesthetic - that an externalized trip would have had to been forced.  This combination really took me inside like I had never been before.  After years of reading about the Ayahuasca voyages, this is exactly what I had achieved with this combination.  The harmline's provide a deeply calming effect that allowed me to accept all the visions, especially the disturbing ones to be experienced with love and acceptance.  I felt as if my soul was being healed from the inside out.\r\nAt times this 'healing' was very painful, harrowing and humbling.  But the really nice part is there seemed to be several breaks - I would go through a wrenching cleanse of a particular ego fixation, followed by a calm period of peaceful integration and back in again for more.  At one point I felt the pain and suffering of all of mother earth, and I wept for her, the pain we have caused her.  I felt that I was not only healing myself but my relationship to the planet, and deep felt symbiotic gratitude from Gaia for my reconciliation.\r\nDespite the depth of this experience I was most surprised at its short duration and quick recovery.  I dosed at 11:00am and was back at baseline by 3:30 fully refreshed.  I went out and grabbed a late lunch and felt a renewed sense of self and my relationship to everything.\r\nFor me this was a great combination!  One I plan on experimenting with more.\r\nPsiphi\r\n[Erowid Note: The erowid reviewer, based on available products in 2001, decided to code this as 'harmala' instead of 'B. caapi Extract'.]\n\n\n"
}