{
 "title": "Fitter, Happier, More Productive",
 "author": "Mary Microdot",
 "citation": "   Mary Microdot. \"Fitter, Happier, More Productive: experience with Cacti - T. pachanoi (San Pedro) (ID 77468)\". Erowid.org. Dec 26, 2009. erowid.org/exp/77468",
 "substance": "Cacti - T. pachanoi (San Pedro)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "10 in",
   "oral",
   "Cacti - T. pachanoi",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 77468",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Dec 26, 2009",
   "Views: 12950",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took my first San Pedro journey yesterday and thought I'd share what I learned.  Hopefully this report will help inexperienced users with things like preparation, set and setting, and knowing what to expect from the dosage in the report.  It's fairly long, but I've broken it down into sections so you can skip around if you like!</p><p>Set/Setting:</p><p>My apartment, alone on a Tuesday.  I've cleaned and prepared the house for my trip by getting out the waterfall fountain, setting out art books, etc.  The weather is unremarkable and I have nothing to do but this all day.  My mood is positive, if somewhat anxious about possible nausea during the trip.  I recently lost my job and have been under a lot of stress, but have put it all aside for this experience in hopes that I'll come out with some insight.</p><p>Previous Drug Experiences:  </p><p>The only psychedelics I've done are mushrooms, about 6 times, and salvia, which did nothing.  Other drugs include marijuana, ephedra, kratom, Benzedrex, poppy pods, hydrocodone, oxycodone, Xanax, codeine, alcohol, and muscle relaxers, all in small/therapeutic doses and not large recreational ones.</p><p>Mental/Physical Preparation:  Because I never try a new drug without knowing EVERY possible outcome, I scoured the web for upwards of 2 weeks to learn all about the mighty San Pedro.  I read my tarot cards and followed their advice for what to focus on both before and during the trip, got all my worries out in the open with loved ones beforehand, and did a quick colon cleanse/detox the day before using magnesium citrate, fiber, and other cleasing aids.  This was a well-planned event, not a spur-of-the-moment thing, and I'm glad I did it that way as it added to the meaning I got out of the experience.</p><p>~~~Cactal Slime and Finger Pricks, aka 'The Preparation'~~~</p><p>I received a 12-inch cutting in the mail as a birthday gift from my mother (coolest mom EVER?!) and immediately began preparing it for the following day.  I de-spined it, peeled off the outer xylem, cut it from the inner woody core and chopped it finely with a large knife, all of which was very messy and sticky.  </p><p>I dried the chopped material in front of a fan for an hour, then popped it in the oven on 'Warm' (around 150 degrees) with the door cracked.  I watched it carefully to make sure it didn't burn and took it out when it was nearly completely dry.  My biggest mistake here was not spraying the cookie sheet with non-stick spray, which caused the some of the pieces to be lost.  Next I put the pieces into a food processor, then crushed the remains with a mortar and pestle.  It still wasn't a fine powder, but wasn't in huge chunks either.  Finally, I put the material into pill capsules and tucked it away for the following day.</p><p>Total prep time:  6+ hours.</p><p>~~~Ingestion~~~</p><p>I was left with 11 '0' sized pill capsules, which I took one at a time.  My biggest fear with psychedelics isn't a bad trip, but the nausea/vomiting that can occur.  To help prevent it, I took the pills slowly and ate candied ginger slices, chewed fennel seeds, and drank plenty of water.  I also ate some cacao nibs to help boost the experience, as they contain theobroma, a stimulating compound with all sorts of health-enhancing properties.  My stomach wasn't full, but was far from empty.  After about 8 pills, I had to eat some granola to combat that 'my stomach is eating itself' feeling.  No nausea to speak of!</p><p>Total ingestion time:  2 hours.</p><p>~~~The Wait~~~</p><p>Knowing how long mescaline can take to fully kick in, I had plenty of things to entertain me while I waited.  I sat on the couch reading a book called 'Spliffs' and listening to a Bob Marley mix cd that always relaxes me.  Colors slowly became more vivid, and the music sounded crisp and clear, if only a little more so than usual.  I patiently wait for more, while sipping water and eating granola.</p><p>Total waiting time:  1.5 hours from taking last dose.</p><p>~~~Liftoff/The Ascent~~~</p><p>While finishing up my book, I slowly start to notice a stoned feeling.  Words move around slightly, colors jump off the page at me...</p><p>I get up to go to the bathroom.  As I'm sitting there, I see the shape of a woman in the style of a Sistine Chapel painting in the floor tile.  Whoa!  I've never noticed any patterns in the tile before, so this is my first indicator that the San Pedro is in full effect.  I continue looking for more shapes, spotting another, and another...</p><p>Walking back into the livingroom, the music really took hold of me.  I danced and spun around like one of those hippie chicks you see in old Woodstock clips--arms out like eagle wings, head back, mouth agape and eyes to the heavens.  Little rushes of euphoria and energy washed over me and made it hard for me to stop smiling.</p><p>Total comeup time:  30 minutes.</p><p>~~~Tripping in Earnest, aka 'The Orbit'~~~</p><p>For the next 7 hours, I alternated between euphoric stimulation and utter exhaustion.  My body felt light one moment, filled with lead sediment the next.  My hands and feet were cold, and I had to pee...A LOT.  Vision was noticeably altered, with colors appearing brighter and more vibrant, shapes jumping out at me, and minor movement of things like carpet fibers and pictures on the wall.  My mind was occupied with the notion that I was being healed and interpreted the experience both as a learning process and a mental vacation as opposed to a fun 'party' experience.  I felt as if I couldn't have willed myself into a bad trip even if I tried.  The only negative part was the drowsiness, but only because I prefer drugs that are more stimulating.  During the trip I mostly read, laid on the floor listening to music, surfed the web, and played Nintendo.</p><p>Total orbit time:  7 hours</p><p>~~~Potholes and Pitfalls~~~</p><p>My roommate brought home some pepperoni pizza about 7 hours into the trip, and I was starved.  I scarfed down 4 pieces and was surprisingly not sluggish afterward.  (I have wheat, cheese, and gluten sensitivities that cause extreme fatigue).  </p><p>About an hour later, I was gripped with extreme stabbing pains in my urinary tract, bladder, back and stomach--the same thing that happened on my 1st shroom trip years before!  I suffer recurrent UTIs and kidney infections and know that drinking lots of water is the best remedy.  I downed as much as I could, which helped the pain but caused about 30 seconds of the most intense nausea imaginable as well as a feverish, hot feeling.  I sat still and let it pass.</p><p>Total 'icky' time:  30 minutes.</p><p>~~~Slow Descent to Baseline~~~</p><p>The rest of the experience consisted of more stimulated/exhausted feelings, visual effects, and introspection on things like God/the Divine, physical healing and ways to incorporate more creativity into my life.  Slowly, ever so slowly, the visual effects became less pronounced and the drowsiness turned to genuine need for sleep.  When I went to bed (around 2 A.M.), sleep came easily and was more refreshing than normal.  No nightmares, no waking up in the night, and no morning fatigue.  </p><p>~~~Residuals~~~</p><p>That brings me to this morning, which has been really positive.  I feel almost better than I did during the trip--refreshed, optimistic, and with less craving for unhealthy food/drugs.  I routinely use poppy pod tea, Benzedrex inhalers, and caffeine, all of which irritate my kidneys and produce somewhat addictive effects.  I'm already planning future trips, and want to do San Pedro every other month as both a physical healing agent and for the positive mental effects.</p><p>~~~Retrospective~~~</p><p>Overall, my first San Pedro experience was a positive one.  While it's not 'fun' in the traditional sense, it's an interesting, relatively-safe way to get out of your own head for a day and see things from a different perspective.  My experience was a moderate one--a far cry from my first mushroom trip, which was weird, unpleasant physically and too intense.  I could've stood to take more than 12 inches, but not by much--probably another 4-5 inches would've been perfect.  Marijuana would've sent my trip to another dimension, and I kept wishing I had some during my trip.  Being alone was fun, but so was hanging out with my roommate.  If you're an introvert, I suggest doing it alone (in a safe environment of course). </p><p>In terms of its relation to other drugs, I'd say San Pedro is like mushrooms visually and like marijuana in its feelings of physical intoxication, with overtones of both a stimulant and a sedative, we'll say ephedra and Valium for the sake of comparison.  While I've never done MDMA, I'd liken some of the brief euphoric feelings to it.  San Pedro is milder at this dose than about 2 grams of shrooms, but I'm sure it can be even stronger than other hallucinogens if taken in large enough doses.</p>"
}
