{
 "title": "Messed Me Up",
 "author": "CWash",
 "citation": "   CWash. \"Messed Me Up: experience with Diphenhydramine (ID 77469)\". Erowid.org. Oct 14, 2010. erowid.org/exp/77469",
 "substance": "Diphenhydramine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 77469",
   "Male",
   " ",
   "Not Given",
   "Oct 14, 2010",
   "Views: 10183",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The other night, I had run out of weed to smoke, and was unable to get more, so I decided to look around the house for some kind of household high. I had found a bottle of tylenol pm, simply sleep, 25mg pills of DPH. I read that it would make me hallucinate and have some crazy trips, so I tried it. I killed 24 tablets and a 16.9oz red bull and waited for the effects to set in. After about an hour I began to feel it working. I felt like I was drunk and just out of it. It had completely shot my memory as I tried to write down my experiences. I continually would forget what I was writing right in the middle of writing it, and sit there for 10 minutes trying to remember. I never hallucinated from this substance, instead, after about 2 or 3 hours of the drunken feeling, I decided to go to sleep because it just wasn't worth it. This is where it turned for the worse. As I lay in bed, I felt very tired but was unable to fall asleep. As a little bit of time when by, I began to have muscle contractions that felt more like seizures. My legs would kick randomly and rapidly without reason, and my arms would lock up almost like a tetanus victim. This lasted for a couple of hours, it wasn't painful, it was just incredibly annoying.</p><p>The next day, when I woke after finally falling asleep. I was remembering things that never happened very vividly. They must have been dreams I had while the chemical was still in my body, but the memories seemed incredibly real. I walked into my math class later that evening at the college and could not recognize anyone that was in my class. I sat down anyway, and started to try to organize my mind and set my memory straight. Aside from the memory loss I was very clumsy and on edge. Everything would startle me, when I went to the restroom, the automatic toilet flushed while I was standing in front of it, and it made me jump about 5 feet in the air.</p><p>That evening I had acquired more weed and smoked that evening. The day after, the third day since the DPH, I had major muscle failure in my arms and could barely move them normally for most of the morning and afternoon. It is now 6:00 in the evening on the third day since and I have still not fully recovered, there is still something different about the way my body is functioning.</p><p>Conclusion: This is not worth it. If you were like me and just ran out of your typical substance, do not try this as a replacement. Just wait until you can get more of what you typically do, be it alcohol, or weed, or whatever...this substance is not worth it for that damage that it did to my mind and body.</p>"
}
