{
 "title": "Bad  Can Outweigh the Good",
 "author": "Patricia",
 "citation": "   Patricia. \"Bad  Can Outweigh the Good: experience with DXM (with CPM) (ID 7750)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7750",
 "substance": "DXM (with CPM)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "16 tablets",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2001",
   "7750",
   "Female",
   " ",
   "Not Given",
   "Mar 31, 2003",
   "18805",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First of all, let me just say that I do still take this mess (stupid huh?).  I began taking Coricidin about three years ago.  I used to just use it recreationally maybe one weekend a month.  After a while, I'd neglect it, then months later, return to it. Well hell, to my surprise, in group therapy, I had doctors and other patients telling me it was a pattern of addiction.  I was kind of embarrassed that i could possibly be addicted to cold medicine. Anyway, I continued use, but then started to use it more frequently.  Before I knew it, frequently became up to two boxes every other day.  My body got used to the high, and wanted more and more of it.</p><p>I'm not going to lie, I would choose CCC over any street drug any day.  I guess i liked it so much because it was cheap and so easy to get. The high is the best experience I've ever had with any drug.  It's kind of mindnumbing, which is why you definately shouldn't drive anywhere while on it.  This is something I can just kick back to and listen to music in a whole different way.  It does seem to make me drowsy, but also, if I get up to exercise or dance, I won't be able to stop! Probably one of the main things i don't like about it, other than risk, is the slurred speech.  It's like I'm talking too fast, and I leave off the ending of words. Weird.</p><p>That was the good I guess.  Now the bad.  It's bad enough having to swallow all those sweet-tasting pills, but then to expect one thing and get something totally different.  There were a few times my body couldn't handle it, and I overdosed.  It's the worst feeling in the world.  I'm expecting to get high, but instead, I get intense abdominal cramps, and start to sweat buckets.  I'm not talking about menstrual cramps.  This feels like someone's tearing at my insides.  I can take a lot of pain, but there was alot of moaning, puking and crying with this. At that point, I don't care about the high, I just want to make the pain stop.  Every time, the only way I made the pain stop, was by falling asleep in agony.  What makes it even worse, is that it's already absorbed into my bloodstream, so I'm fucked up and thinking I'm about to die. I just have to deal with the consequences, unless I go to the hospital.  Even then, they'll put me away for attempting suicide.  Also, if a person already have a mood disorder, this can add on to the depression.   </p><p>For those that haven't tried dxm, I urge you not to.  It's very dangerous and very risky.  I've taken it for a long time, so i kind of know how much I can take.  Sometimes, not even that way is safe since I've overdosed maybe four or five times. I never went to the hospital, for fear of my parents finding out.  This was even after I had been using the same amount for a while.  So as you can see, there's no telling what it's going to.  I can have an ok trip, but my next trip could be my death bed.  I think about this every time I use it, but I've got my own reasons.  I know that if i continue this, it will lead to an early grave.  So learn from other stupid people like me.</p>"
}
