{
 "title": "Magic with Music",
 "author": "J. Delay",
 "citation": "   J. Delay. \"Magic with Music: experience with 2C-T-2 (ID 77515)\". Erowid.org. Jun 14, 2012. erowid.org/exp/77515",
 "substance": "2C-T-2",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-T-2",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 77515",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 14, 2012",
   "Views: 1711",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Firstly, here is some background information: </p><p>A few months ago, I received a package containing 2 grams worth of the research chemical 2C-T-2,  and I measured out 10mg to be put in individual gelatin capsules for personal research. I took the substance twice:  Once with only one dosage of 10mg, which left me very anxious and almost on edge, and once with two doses. My experience with two doses wasn't extremely intense, but I did have auditory hallucinations, and music was very magnified, emotionally. Also, the walls had a breathing effect similar to that of mescaline. Because of my prior experiences with this chemical I thought of it to be more of a recreational drug than other psychedelics. I thought of it to be just a new toy to play with whenever boredom may strike.</p><p>Ok, now we get to my last experience with this chemical.  I was leaving to go to a music festival when I realized that I still had a few gelatin capsules of 2C-T-2 lying around.  I immediately decided that the festival would be the perfect venue for me to try a higher dosage. Like I said, I have never taken over 20mg.</p><p>The first night of the festival I indulged in a few 30mg roxicodone pills. Like usual, I snorted them. The next morning I didn't feel up to tripping, as the festival was horrendously hot and packed with people. However, I had never been to a music festival before, and I really wanted to try experiencing 2C-T-2 in nature, so I sucked it up, and I swallowed two and a half capsules. (never do this. If you dont really want to trip, Its probably for the best that you put it off.) </p><p>As usual, My body took forever to process the drug. Over an hour and a half later I felt slightly nauseous, and I felt myself change emotionally. Everything felt brighter and larger. This chemical really has the capability of making me feel like I am a child again, 2C-E is similar in this way. </p><p>Over the next hour or so the chemical began to plateau while I watched one of my favorite bands perform on stage- Deerhunter. I felt like music was the driving force of the trip, and only when the band stopped playing was when I realized how inebriated I really was. The ground and the sky both breathed with life and brilliance. Deerhunter began to play again after a short intermission, and once again I felt like I was being sucked into the music, it was a very beautiful and surreal experience. </p><p>Suddenly, the singer made a remark that changed the course of my trip. I felt as though he was being oddly pretentious, and that really bothered me as I see him as a musical icon.  I could not tell if he was being sarcastic or not, and that became the main problem with my experience. I really could not differentiate between someone telling me a joke, and someone talking to me seriously. </p><p>Within 3 hours, I had begun to feel an over whelming joy, and I could not stop laughing. Me and my friends sat in our tent hardly able to keep the food that we were munching on in our mouths as we laughed to the point of choking. However, once I left the tent, the problem that I mentioned still lingered all around me- I felt as if I couldn't decipher sarcasm from honesty, and that drove me to run back to my tent, where I was camping, and try to calm down a bit. For reference, I felt the same way when I took a heavy dose of LSD about a year prior to this trip, so It could just be that I have a paranoid personality. 2C-T-2 differs greatly in its effects on people, and its effects were oddly dissimilar each time that I took it. My first trip was definitely the closest in similarity to MDMA, and it became more of a psychological trip each time after. (probably due to taking higher dosages.) </p><p>I still stand by 2C-T-2 as a very fun, and mostly recreational drug, however, it is still not to be taken lightly. I say this because I know that if I had taken anymore than I did, I would probably be unable to comprehend simple harmless comments, and I probably would have seen them as insults. I would recommend tripping in a place were you feel safe, were you are going to have access to music, and were you can be with people that you can trust. Comfort is very important to my trip on this substance, much more than say 2-C-E. Also, I've heard many people compare their trip on 2C-T-2 to that of MDMA and Mescaline, and I'd say that is not very far off. Music is a magical experience on 2C-T-2, and visuals are pleasant and enjoyable if I reach that point. </p><p>Although this experience was far more thoughtful (and paranoid) than my other ones, I still enjoyed it thoroughly. </p><p>Good luck with future experiences, be safe and long live the RC community!</p>"
}
