{
 "title": "Butylone Confounding",
 "author": "Aido Ser",
 "citation": "   Aido Ser. \"Butylone Confounding: experience with bk-MBDB & Methylone (ID 77568)\". Erowid.org. Mar 16, 2009. erowid.org/exp/77568",
 "substance": "bk-MBDB & Methylone",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "bk-MBDB",
   " ",
   "  ",
   " ",
   "Methylone"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 77568",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 16, 2009",
   "Views: 14899",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Subject Brother One is early 30's male, 210 pounds, well experienced in psychedelics, minimally involved in stimulants and alcohol. Subject Brother Two is similarly situated, 170 pounds, with less involvement in psychedelics, and has history of methamphetamine abuse about a decade earlier. This report is an attempt to demonstrate differences in the Butylone experience that personal chemistry and mixing can make for.</p><p>BrotherOne</p><p>21:00 150mg Butylone</p><p>23:45 100mg Butylone/100mg Methylone</p><p>04:15 100mg Butylone/100mg Methylone</p><p>BrotherTwo</p><p>23:00 100mg Butylone</p><p>04:15 100mg Butylone/50mg Methylone</p><p>04:45 250mg THC-based component</p><p>BrotherOne Experience: Earlier reports read regarding Butylone did not prepare for intensity of experience at 150mg. Was expecting akin to Methylone at 200mg. Butylone a lot more potent. Boosters with Methylone led to severe eye-twitching that caused double-vision that was blurry, interspersed for 3 seconds every few minutes or so for about 30 minutes. Outside of this, slight shortness of breath only other side effect. Side effect did not discourage second booster with Methylone, tolerance played a part in second booster in that blurred-vision effect only lasted for a few seconds for a fifteen minute period.</p><p>WARNING: Butylone/methylone combination, and active exercise led to extreme dehydration. BrotherOne suffered slightly from this, leading to some physical side effects from not properly hydrating (while he was conscious of his need for hydration, was only taking sips of liquids, instead of the gulps he needed).</p><p>Psychological effects were pronounced, intensely introspective, yet capable of extroversion, seeming at a paradox. Acceptance of self was at incredible levels, warts and all, and created allowance for rejection, acceptance of social awkwardness, made space for super-confidence (akin to the fables of cocaine rush). Note that super-confidence was not based on delusion of concrete success, but at acceptance if failure was the result.</p><p>Emotional exploration potential for Butylone is great, but must stay focused: easy to get distracted by hallucinations, and overall feeling of 'need to do 'x' before this experience is over.' Possible side-effect of being too far along the stimulant pathway?</p><p>Subject BrotherOne did followup of Butylone the following week to test tolerance. Insufflation at 13:00 of 30mg. Oral consumption of 170mg/150mg/150mg at 13:00, 16:00, and 19:00.  Tolerance caused noticeable diminishment of hallucinatory effect. Overall body and emotional high stable, mental effects diminished as well. Uncertain as to the underlying reason why this might be.</p><p>Brother Two:</p><p>First effects felt within ten minutes, though personal experience includes extreme sensitivity so this may not be a 'normal' experience. Mild effects--gentle rise, soft stimulant effect. Light physical euphoric effect, emotional clarity and sense of grounded psychic control, ie. the truth, in the form of feeling, coming into perspective. </p><p>More physical a sensation--with methylone, it's less physical, and more emotional a state. Sustained sensual feeling over the course of three hours, during which time alcohol was added, in a a public setting. Near pitch-perfect control over social dynamics in this period--the emotional insight under the butylone was almost absolute, like an x-ray had been cast upon the emotional skeleton of the world. </p><p>Within twenty minutes, of butylone/methylone booster, was on what is, for him, the emotional rocket ship known as methylone. Ready to resolve any conflicts, promote understanding amongst the greater human fold, and, writ large, guarantee that every person knows of their intrinsic value and worth. Needless to say, this is a good time to hide one's cell phone and never, ever log on to email. </p><p>Within 40 minutes of the boost, vision is blurred to the point of near-blindness. Heart rate and breathing is elevated. The elevation lasts for near 24 hours, unfortunately, likely a produce of the synergistic effects of methylone/butylone, since the butylone and methylone (previously administered under similar circumstances) had not produced such effects on their own. </p><p>High lasted for the next 6 hours, during which time there was extensive physical activity with associated mental clarity. The elevated heart rate and shallow breath coupled to create a rather unpleasant physical experience. Mentally and emotionally, experienced sanguine clarity, insight and a sense of love. But the shallow breathing and elevated heart rate would continue on for another 36 hours. Not fun.</p>"
}
