{
 "title": "Trouble In The Depths of a Binge",
 "author": "Randal Stone",
 "citation": "   Randal Stone. \"Trouble In The Depths of a Binge: experience with Dimenhydrinate (ID 7760)\". Erowid.org. Jul 22, 2003. erowid.org/exp/7760",
 "substance": "Dimenhydrinate",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7760",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 22, 2003",
   "Views: 15369",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The other night my friend J and I rode up to a Drug Store and picked up two bottles of the Original Dramamine formula. (None of that Dramamine II bullshit.) We each downed a bottle at the store's water fountain at about 1:55 am and drove back to my home. Once there, I found four more tablets in my medicine cabinet from a past airplane trip. I took them with water and joined J in my room. My mother was sound asleep in her room across the house. By 2:45 am I noticed J's subtle change in attitude. It hit him strong, I could tell...probably from all the acid he's done lately. When I began feeling moderately stoned, I could see that he was someplace else entirely; blank, wide-opened eyes staring unfocused at 'All In The Family' blaring a few feet away on the T.V. A few more minutes passed and the Drug began to take hold entirely.</p><p>Every time I would move my head the room seemed to move with me. No visuals at this point, instead I felt an intense feeling of Artificial Euphoria. I would stare off at the T.V. I could feel my eyes grow heavier and heavier. I began to feel drowsy and realized that I needed to urinate. I got up and immediately felt almost weightless. I could barely feel my legs, arms, or head...but my torso felt like it was holding me down as I walked across my house to the John. I made it there and began relieving myself into the toilet when I noticed something strange happening to the speckled counter that rested before me...it began moving in distinct circles, I reached out and rubbed it which caused it to dissolve. I knew it was taking hold, and I enjoyed it goddamnit!</p><p>I wasn't aware of my surroundings, the only thing that concerned me at that moment in time was the speckled counter that was playing cruel and nasty tricks on me. I diverted my attention to the pink tile wall, it seemed as if it was falling apart...at the time. My eyes began to zero in on the dimly lit white little chunks here and there would protrude before me. 'Not now.' I muttered as I desperately reached out to push them in and they were gone! Just like that...gone. I shook and zipped up. Just as I was about to leave the John, invisible lines began flashing every which way I looked. The bathroom was dark, only a dim nightlight glowed, so I'm guessing the shadows had something to do with it. I frantically waved my arms out before my path, to somehow try to rid myself of this terrible thing.</p><p>I eventually made it back to my room where J was entranced by the T.V. His eyes were wide open and looked very peculiar, I'm guessing mine did too. I took a seat on my couch and turned the light off, leaving the dark room glowing from the T.V. Every so often J would begin speaking fragmented sentences...more like slurred fragmented sentences. I couldn't make out what he was trying to say...either way it didn't seem to have any relevance. I let my pupils unfocus and suddenly noticed that the carpet was moving...like a little whirlpool. In a way similar to how the counter had moved in circles in the John, but this time the hallucination was Bigger, more noticeable. I began pawing curiously at the melting carpet when I noticed a bottle of SunBlock on my desk about 6 feet in front of me...it was changing. Not it so much as its label...you know, with the little girl being undressed by the dog? Anyway, it began to gracefully mush together, Mad Hysterics. 'I gone leave.' I could hear J grumble incoherently beside me. I looked up at him with uncertain eyes. 'What is it?' I questioned. He merely shook off my attempt of acknowledgment and got up and walked out my side door. What could I do?</p><p>NOTHING. I enjoyed my altered reality a little while longer before laying in my bed to sleep. By now it was almost 4:00 am. I soon discovered a potentially disastrous problem that could hinder my ability to slip into a peaceful slumber...every 8 seconds or so after shutting my disoriented eyes, an uncontrollable itching in my right leg would begin pulsing. It was unbearable, several air kicks made it stop. Was that the end of it? I thought. Hell no, every eight goddamn seconds I would have to kick my leg into mid-air to relieve myself of this spastic-like annoyance. Another thing was happening within those eight (8) seconds after shutting my eyes...I would completely leave myself and enter a dreamlike state-visuals of talking to people...it felt so real... then a few seconds later the itching would start and it would jolt me out of it. But every time I opened my eyes, I wouldn't know where the fuck I was or anything. It would take me a few seconds to gradually get my bearings and shut my eyes once again only to meet up with the same Fate in 8 seconds or so. This trouble plagued me until 5:46 am when I was FINALLY able to ignore the trouble in my leg and fall asleep.</p><p>I've read other reports about the Drama-Trip being uncomfortable and frightening. I found it rather enjoyable besides the fact that I couldn't go to sleep for nearly two hours.</p>"
}
