{
 "title": "A Suprising ++++ Experience",
 "author": "Fluffun",
 "citation": "   Fluffun. \"A Suprising ++++ Experience: experience with H. B. Woodrose & Anadenanthera peregrina (ID 77618)\". Erowid.org. Jul 23, 2010. erowid.org/exp/77618",
 "substance": "H. B. Woodrose & Anadenanthera peregrina",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "8 ",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   " ",
   "3 ",
   "insufflated",
   "Anadenanthera peregrina",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 77618",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2010",
   "Views: 11623",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn the past I have experimented with many different drugs and recently I discovered the Shulgin measurement scale. I came to realise that I have experienced two ++++ trips in my lifetime, my first was with mushrooms where I had a teacher experience, and came out of the trip far more enlightened about the nature of the human mind than I was before undertaking the dose.<br>That was nearly six years ago and is not so fresh in my memory, my second ++++ experience was last year, it is this trip I wish to detail in this report.<br>Around Febuary 2008 I had a phone call from a friend who had purchased some Anadenanthera Peregrina seeds from a reliable online vendor. He had absolutely no Idea how to prepare the seeds into a yopo snuff, so I kindly offered to help him having all the nesesscary ingredients powdered edible lime etc. I also brought with me to his house a large bag of HBW seeds which he had also, never tried. We took eight HBW seeds each and while they were taking effect we went about making the Yopo: <br>First I cooked all twelve of the seeds in a thick bottomed frying pan until the skin became cracked and blistered <br>Next we peeled the seeds and put the brittle, yellow interior into a pestle and ground them up as finely as possible.<br>I then added about half as much edible lime powder to ground seed.<br>I then wet fingers very slightly and rubbed the lime into the yopo, which I've read converts the Bufotenine contained in the seeds to Bufotenate which crosses the blood/brain barrier more quickly.<br>After I had pressed the resulting mixture into a flat disk it was crushed again and left to dry.<br>We were beginning to feel the effects of the HBW seeds by this time and decided to retire upstairs to a quieter enviroment. We sat and talked for a bit a few small hits of salvia were had but not enough to cause any serious reaction, the trip off the seeds was mild and peaceful niether of us experienced any discomfort or nausea (I have done in the past and believe me, it was excruciating) and we stayed up into the small hours. Just before I went to bed I decided it would be a time to try some of the Yopo I had made earlier. My friend decided to abstain but urged me to try, the snuff was very dry and a light pale yellow, I chopped out a fat line and took it in one. I then ran to where I was sleeping and sat while the Yopo burned my sinuses.<br>Then I felt it, a little like the come up from salvia my vision started to fragment like seeing an image through a broken pane of glass, it steadily became stronger and stronger until the glass shattered sucking me through to the world beyond. I was completely incapacitated at that point and in my mind I was flying through a subspace. A complete, ever changing 3D world. It was the most vibrantly coloured place I have ever seen, there were objects beneath me but none were distinguishable, everything I looked at kept morphing and evolving as I tried to identify it (I tried opening my eyes at this point and the world was the same inside my head as it was outside, this was disturbing, the eyes remained shut)<br>I suddenly saw I was heading towards a tunnel which was completely dark within, looking back I should have been scared but something calmed me down, it was like someone was whispering in my ear saying 'don't be afraid, come with me, I am about to show you the most important thing you have ever seen' I couldn't see this entity but I knew it was there and this comforted me greatly. As the tunnel drew closer I saw a shape within it floating and rotating within the confines of the tunnel as I drew closer it took on a more defined shape. It was a mandala huge and slowly rotating, it was the most beautiful thing that I ever have seen. <br>The mandala was divided into millions of segments and I marveled in it's beauty for a moment before I heard the voice again, it said 'look closely at me and tell me what you see' it was the mandala talking to me and it had been all along, I looked into it's segments and saw my life. Not just things that represent my life but within each segment memories moving like a film or an image that meant something to me, I was invited into each one in turn and I experienced a fragmented shock of memory like a photo collage moving at a million miles per second, once this finished I witnessed the mandala one last time revolving and I came to a conclusion within the trip. This mandala was me, every facet of my life written on it's face, it was the most profound experience of my life. I had witnessed my own subconcious from it's vast painted interior. It was around this point that the visuals started to fade and I began to come out of the trip. It was about 7 in the morning and light I hadn't expelled the Yopo from my nose from the line and it was fucked for many weeks afterwards. <br>I have never touched Yopo since, mainly because it's such an inefficient and painful way to have a profound psychedelic experience, I had taken Yopo prepared in exactly the same way before experiencing only disorientation and flashing lights, niether of which were remarkably pleasant. And my friend who later tried some of the same snuff I had this experience from reported a sore nose and not much else. I was also stunned by my ability to recollect this experience as I made no notes immediately afterwards. This would be the first time I have ever shared it on paper. It will be forever imprinted on my mind.\n\n\n"
}
