{
 "title": "Satan Made Hell Like Heaven To Torture Us",
 "author": "Jeff",
 "citation": "   Jeff. \"Satan Made Hell Like Heaven To Torture Us: experience with DXM (with CPM) & Cannabis (ID 7769)\". Erowid.org. Jul 22, 2003. erowid.org/exp/7769",
 "substance": "DXM (with CPM) & Cannabis",
 "bodyweight": "139 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "240 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   "  T+ 4:00",
   "240 mg",
   "oral",
   "DXM",
   "(pill / tablet)",
   "  T+ 6:30",
   "5 hits",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "7769",
   "Male",
   " ",
   "Not Given",
   "Jul 22, 2003",
   "24659",
   " "
  ]
 ],
 "report": "<p>It was my third time to take Coricidin  and I don't even want to think of how many times I had smoked weed. Me and my friend took the pills (8) at 10:30 pm that night. We then went to his friend's house till about 12. The effects were taking very long till they kicked in. Finally at about 1:30 they hit us and they hit us very, very hard. It was a normal DXM trip from the start. Weird walking, everything seemed so big and yet so small. I could see the childhood face of my friend on his now grownup body; it was quite humorous. We listened to music for a while and it was a great time. We listened to a lot of Marilyn Manson he's great. We then listened to a Metallica song Low Mans Lyric and commented on how great it was and listened to it over and over again. We then of course talked about life and thought we knew everything and we were so smart.</p><p>That's when we popped 8 more pills  at about 2:30 in the morning. Then we really started getting hit hard. I was walking around as if I were being controlled in a Nintendo game and couldn't control my own legs. If they would have led me off a cliff I would have fallen off. At about 4:25 in the morning it began getting light out. We went into his bathroom and spun around and watched each others eyes twitch like crazy  it's so cool to do. We then looked in the mirror and envisioned our childhood selves coming out in demon like forms...at least I did. It was quite weird.</p><p>At about 5:00 AM we went out on my friend's porch and smoked this very chronic weed he had purchased. Immediately after the first two hits I began to felt very good about myself. I took 5 HUGE hits and then we went and disposed of the coke bong and sat on the table. My friend Shawn commented, 'This is a new feeling...a totally new feeling.' I began to laugh for no reason feeling so high it felt like all the THC in the world was coating my brain. Then I began to feel the worst dry mouth in the world. I immediately got a water, which only made the dry mouth feel better when it touched my mouth, once it was swallowed the dry mouth was back. I think at about this time my next 8 Coricidin pills hit me, and my friend Shawn said 'We are in Heaven' I looked out over the lake he lives on and I felt raised above everything. I felt as if the environment were fading away from me and I was a king or a ruler of some land.</p><p>Then the dry mouth began to feel very unpleasant and I got up and walked and my body was pulsating with an odd energy. Like electricity flowing through my body. By far the worst physical effect any drug has ever given me. I told Shawn he needed to call 911 because at this point I feared for my life when I felt my heart beating extremely fast! He said, 'Jeff, I felt like I was going to die once when I took ecstasy...my friend helped me through it. I will help you get through this Jeff.' Then he started rambling about us being in heaven and how I can't die in Heaven; I'm already dead. This made me very angry because I didn't want to be dead and I thought I was now in Hell and Satan was making it feel like Heaven to torture us.</p><p>This is when I told Shawn I seriously needed help and wasn't right at all. I had taken DXM twice before and smoked a lot of weed. This feeling wasn't normal. He then told me to sit down on the chair and I'd feel better soon. He then went to play my favorite song, Low Mans Lyric. and then I floated down to Earth, came back into reality, and came back into a very good normal trip. This is hen I realized that Shawn had saved me from either dying or going insane. One thing I have learned from this experience is that you must be with someone when you are doing this shit or you can get really fucked up mentally or physically.</p>"
}
