{
 "title": "Self-Harm",
 "author": "HappyGoLuckDamBunny",
 "citation": "   HappyGoLuckDamBunny. \"Self-Harm: experience with Diphenhydramine (ID 77691)\". Erowid.org. Mar 22, 2009. erowid.org/exp/77691",
 "substance": "Diphenhydramine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 77691",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Mar 22, 2009",
   "Views: 11363",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began using sleeping pills in a safe way to help me sleep instead of staying up all night obsessing about food and calories (I have an eating disorder).  I also self harm.  After a binge, I was very upset.  Within the span of an hour or two I took 500mg.  It was not a suicide attempt, but it was a self harm thing.  I ended up calling someone for help because I got scared.  I could not move my body.  As the trip lengthened, my talk was gibberish and I was so so forgetful.  I was taken to the hospital overnight.</p><p>Since then I have been doing 250mg a lot.  That dosage is not enough for me to get hallucinations.  It is enough to make my vision blurry, make it difficult to walk, make me talk gibberish, make people seem to be talking in another dimension, and what I am seeing very confusing.  However, the next days after are filled with strong lethargicness and depression.  It rapidly turned into a cycle.  The pills made me depressed the next day and so I took them again that night.  Repeat.  Finally, I was able to go a few days without before I took them again.  Only then did I realize the great impact they had on my energy, personality, and motivation.  </p><p>I love my trips - not gonna lie.  Now though, I am trying very hard to keep myself off of them.  My grades and have dropped, distanced from friends, and happiness lessened because of them.  My psychiatrist gave me a totally different type of pill to help me sleep.</p>"
}
