{
 "title": "Pulse",
 "author": "Peaches",
 "citation": "   Peaches. \"Pulse: experience with Calea zacatechichi (ID 77731)\". Erowid.org. Mar 27, 2009. erowid.org/exp/77731",
 "substance": "Calea zacatechichi",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   "oral",
   "Calea zacatechichi",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 77731",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 27, 2009",
   "Views: 7865",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Just a few nights ago I was rather restless and I wanted to take another shot at my bag of calea thats been hangin around for some time. I filled a standard coffee filter with the dry foilage and flowers and steeped in luke-warm water for about a half hour. I hadn't eaten anything in a few hours so I figured that I had a relatively empty stomach, so I chugged down the cup of calea tea as per my usual method (the more I drank this tea the more I could tolerate its flavor if I powered it down fast enough.)</p><p>I didn't pay particular attention to time; calea makes me space out and focus on my thoughts and thought trains and I started to become aware of my heartbeat. At first it was a little bit interesting but though my mind wandered it kept returning to my heartbeat and with each successive return I became more and more aware of my heartbeat. It got to a point where it was all I could focus on and it became rather annoying. More and more I focused and I started to freak out all I wanted to do was space out like I normally do after drinking calea but my heart kept taking the spotlight and just as it became distressing the effects began to wane and I became less and less aware of my heart and I drifted off to relatively undisturbed sleep. I awoke the next morning feeling burnt but very much alive.</p><p>A few nights later I witnessed my own reflection in the darkness under its influence and a friend suggested that I had achieved astral projection. Overall tho that particular night was stressful I don't normally experience problems with calea.</p>"
}
