{
 "title": "Don't Take Too Much",
 "author": "Banjo-B",
 "citation": "   Banjo-B. \"Don't Take Too Much: experience with JWH-018 (ID 77794)\". Erowid.org. Jul 28, 2009. erowid.org/exp/77794",
 "substance": "JWH-018",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "2 mg",
   "smoked",
   "JWH-018"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 77794",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 28, 2009",
   "Views: 18104",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having recently been informed of a new chemical known as JWH-018, I unfaltering searched and found a small quantity. Intrigued by its effects and similarity to cannabis, I decided to give it a try. Before hitting the chemical through a water pipe, my dealer told me to make sure I had a driver. That being said, my accompanist for the evening and I flipped a coin to see who would hit and who would drive. I won the hit!</p><p>I inhaled the entire hit, holding my breath and clearing it. It tastes very similar to plastic and somewhat unpleasant. I waited about 2 minutes and found that the chemical was much more potent than I had originally expected. My accompanist and I quickly left to the vehicle. Walking was difficult and paranoia was highly in effect.</p><p>Before the door was even shut I had completely lost contact with reality. Everything was bright and vibrant, moving in waves much similar to LSD or DMT. A euphoric confusion overcame me and I only had enough focus to tell my driver that I was tripping and not to worry. This ride became one of the most intense psychological trips I had ever taken. I couldnt even talk. I didnt know who I was or where I was.  I could only sit there in my seat, tripping out while my driver freaked that I was overdosing. I kept gagging and I didnt know why. I felt that I was panicking so I became determined to just go with this unexpected trip. Nothing is worse that tripping out when you least expect it. After deciding that going home wasnt an option, we drove to the park. </p><p>Here, is where my trip really turned around and became somewhat fun. I felt a colossal connection with the trees and one with the earth. Everything was meaningful! However, I kept going through bipolar phases where I would be having fun and smiling, but then quickly transition into depressed sadness and then back. This was very odd and different from previous salvia, LSD, DMT, and mushroom trips. I sat here in my seat for about 20 minutes, gazing at the beautiful creation of nature and the harmony between us. My driver still freaked, but by this time I had informed her that I coming down. </p><p>After coming down a little, we decided to go home. I went inside and listened to music for about an hour while extreme thoughts of life and nature raced through my mind. I learned about my true self and power of the human mind! I view this experience as a gift that should not be taken lightly. I then fell asleep and slept for an abnormally prolonged period of time. The next morning I awoke with no hangover of any sort, however, an odd pain in my lower back. Mentally, I was secure and ready for a new day of enjoyment and deep thinking.</p><p>It can be said that anyone wanting to experiment with JWH-018 should use extreme caution with the dose. DO NOT DRIVE while under this influence!! I think that .5 to 1mg. will ensure a similar effect to cannabis, only more intense. </p><p>2mg. threw me into euphoric trip like never before!</p>"
}
