{
 "title": "The Sinclair Method",
 "author": "Goin4More",
 "citation": "   Goin4More. \"The Sinclair Method: experience with Naltrexone & Alcohol (ID 77806)\". Erowid.org. Jul 21, 2010. erowid.org/exp/77806",
 "substance": "Naltrexone & Alcohol",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Naltrexone",
   "(daily)",
   " ",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 77806",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 21, 2010",
   "Views: 8037",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI began taking Naltrexone 5 weeks ago to enable me to moderate my consumption of alcohol. I have been a 2 bottle of wine a day drinker for the past three years. I am trying method whereby an alcoholic takes naltrexone one hour prior to drinking. The drinker still gets a buzz, but over a period of time  generally 3-5 months  the opiate receptors in the brain become unwired from addiction. This is supposed to result in the drinker being able to moderate, or halt, their drinking. \r\nMy own experience has been: For the first week or two, I was more fatigued than usual. Shortly after taking the Naltrexone I experience prickling of my lower extremities. On occasion, within the first half hour of ingestion, I get what feels like a low sugar experience  weak, sweating, somewhat dizzy and disoriented. This is relatively mild and passes in 15-20 minutes. Within a short time Im back to normal. I intend to eat a high protein meal before taking the med to see if that helps.\r\nSo far I have not experienced the flat, listless or depressed feelings reported elsewhere. In fact, the opposite is true. Im already drinking significantly less than I did when I started, down to an average of 6 glasses of wine per day, as opposed to my previous 10-12 glasses. I wake up feeling more alert and ready for the day. Ive had one day with no drinking at all  and didnt miss it. On the days of no drinking, naltrexone is not taken. So while I do have some negative side effects, they are nothing in comparison with the side effects of heavy, persistent abuse of alcohol.\n\n\n"
}
