{
 "title": "Smoking Foxy to a Mist",
 "author": "Mescalhead2001",
 "citation": "   Mescalhead2001. \"Smoking Foxy to a Mist: experience with 5-MeO-DiPT (ID 7789)\". Erowid.org. Jul 1, 2001. erowid.org/exp/7789",
 "substance": "5-MeO-DiPT",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "smoked",
   "5-MeO-DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7789",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 1, 2001",
   "Views: 9027",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI have done Foxy orally before but don't like the stomach aspects of it, namely the nausea, cramps and general discomfort. So i decided that i should try smoking it.</p><p>The setting was perfect, a calm, misty saturday night, i was feeling good and relaxed, put some Allman brothers in the background and got on with the plan. I smoked Foxy the same way I had done DMT in the past, by putting around 25mg of it in the tip of a cigarette (filter removed) and firing it up. Althoug it didnt produce the same kind of 'dissolution of reality' that DMT does, the effect was immediate. I was sitting on a couch and after the second or third puff i couldn't  hold the makeshift cigarette anymore. But i had prepared and had an ashtray and a coffe table at hand so no harm was done.</p><p>The first wave was overpowering like a sledgehammer slowly compressing my being, a fairly-sized body load. Within a few seconds i started feeling nausea but not too much, and my perception was clearly different, even though a gigantic, inexplicable fear developed. But 5 minutes afterwards I felt no nausea and no fear.</p><p>I then stood up (something imposssible earlier) and opened the window to admire the night skies but a thick mist had covered the streets. But I started to notice a strange glow on the mist, like if was about to reveal some inner meaning. It never did, but the effect was quite beautiful. There were absolutely no visuals to speak of, only a heightened sensitivity to colors and shades. </p><p>T+15 minutes and I grabbed my acoustic guitar and started playing it. I was amazed by how easy and fluid my playing was, how much i seemed to get 'into' the notes, effortlessly jamming along with the Brothers. This was the most interesting aspect of the trip, the fact that some inner force was guiding my hands and I felt i could play anything, do anything. The Fear and the nausea had long gone and i was supremely detached, immersed in the music. One hour and a half later, i was back to baseline.</p><p>All in all, a mild, nice, peaceful trip. I strongly advise this way of ingesting this drug, especially for those who dont deal well with stomach issues.</p>"
}
