{
 "title": "Surprisingly Like E",
 "author": "DFsGeezaman",
 "citation": "   DFsGeezaman. \"Surprisingly Like E: experience with 4-Methylmethcathinone (ID 77952)\". Erowid.org. Nov 16, 2009. erowid.org/exp/77952",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "82 kg",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "4-Methylmethcathinone",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2009",
   "77952",
   "Male",
   " ",
   "Not Given",
   "Nov 16, 2009",
   "21425",
   " "
  ]
 ],
 "report": "<p>First time mephedrone, two waves of goodness.</p><p>Geezaman has often enjoyed ecstasy over the past 5 years and also enjoyed a variety of other drugs. Geezaman has also tried ecstasy substitute pills or 'party pills' often containing piperazines such as BZP MeOPP and mCPP, or LSA via morning glory or hawaiian baby woodrose seeds. Most of the 'ecstasy substitute' experiences were interesting and at some stages enjoyable, however they never got anywhere close the the magic of ecstasy. </p><p>Mephedrone came to Geezamans attention some time ago and following reading up on it he decided to give it a try, hoping it might well hold some of that ecstasy magic. He is very impressed and in no way disappointed.</p><p>The mephedrone arrived as a clumpy off-white powder, smelling strongly somewhere between chlorine, and old circuit boards, but with a hint of creamy nutty'ness. As it is considered a research chemical he decided to start off slow with a small dose.</p><p>He took a 60mg dose in a gel-cap with water at 8.40pm after not eating for 4 hours prior to the experience. He is otherwise a healthy young male using no prescription or OTC drugs of any kind, The experience setting was in his bedroom alone with music, laptop, and Internet for entertainment</p><p>T-0.00 Down the hatch with some water.</p><p>T+0.25 felt speeded, had mental clarity.</p><p>T+0.40 feels he seems to have stopped coming up and plateaued. It feels pleasant and warm but not euphoric in any way, he has great focus and clarity of mind, he also feels quite contented.</p><p>T+0.55 Jaw tension seems to have come out of no where but is now in full force.</p><p>T+1.45 He feels like he has come down and is calm again though is still quite alert.</p><p>T+2.20 Feels like he is coming up on pills (ecstasy). Very alert again, Tingly in the stomach, Tense, Jaw Clenching, Skin chills and rushes. Pupils also slightly dilated. Hands clammy, Fine patterned CEVs, Stomach discomfort, like some come ups on E pills, but not nausea in any way.</p><p>T+3.35 For over the past hour, his experience could best be compared to a mild dose of good ecstasy, Euphoria, Empathy, Focus on conversation, urge to interact with the world and others etc. Now jaw clenching/grinding has become very intense and he has mellowed slightly, he feels he is past the peak, which seemed to plateau for about an hour.</p><p>T+4.25 he had definitely gone over the hump and effects gradually drifted away, focus remained, as did increased pulse rate and strength, and jaw grinding. His Pupils are now massive though he has had bigger on other occasions</p><p>T+6.25 he is going to bed, From his reading on this drug he thought from the point of taking the gel cap he would be back to base (or as good as) in 3 hours, and now its nearly 6, he still feels very awake but not alert as before, jaw grinding has also subsided somewhat.</p><p>T+7.55 (4.20am ish) got up for a drink, grinding reverted back to jaw tension and with a little effort it desists, he had simply layn awake, but feels sleep is near.</p><p>In retrospect mephedrone gave more than he ever expected, true empathy and true euphoria. he was very, very surprised by the effect of such a low dose (in comparison to other reports of individuals consuming such a lot more). He was also surprised by the way he seemed to come up with one effect,(very like speed/coke) and then have a dip in the experience followed a good time later by a second come up and high that he believes he might have found indiscernible from some E tablets he has taken. However there was always a greater aspect of control and 'feet on the ground' with mephedrone.</p><p>The total duration was roughly 6 hours.</p><p>Positive effects he experienced were -Clarity, Empathy, Euphoria, Rushes, Energy, Alertness, CEV patterning, Music enhanced.</p><p>Other effects he experienced were - Cold clammy blotchy hands, increased pulse strength and rate, stomach discomfort (though maybe due to not eating), pupil dilation, gurning.</p><p>Will he be trying this again? Definitely!</p><p>Peace,</p><p>G</p>"
}
