{
 "title": "Subtle, Profound, Life-Changing",
 "author": "outekker",
 "citation": " outekker. \"Subtle, Profound, Life-Changing: experience with Salvia divinorum  (ID 78022)\". Erowid.org. Jun 25, 2013. erowid.org/exp/78022",
 "substance": "Salvia divinorum ",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "5 g",
   "buccal",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2009",
   "78022",
   "Male",
   "",
   "Not Given",
   "Jun 25, 2013",
   "945",
   " "
  ]
 ],
 "report": "<p>I have little experience with psychoactive substances:  I have only done cannabis twice before.  Entheogens have always interested me, but given how difficult it is to obtain something like DMT around where I live, I had relegated an entheogenic experience to just a dream.</p><p>Imagine my surprise at finding out about Salvia divinorum which, according to reports, not only equals DMT in experience, but is actually *legal* in my country.  Later I would come to the conclusion that comparing entheogens is futile.  After reading tons of literature, I decided to try the quid method first, so as not to jump in the deep end.</p><p>I obtained 10 grams of dried Salvia divinorum leaves from an online shop.  A friend of mine was also interested and we decided to do it together.  Our individual doses would be 5 grams each.  We went to an open field at night.  We used mouthwash (containing menthol and alcohol) as recommended, having also brushed our mouths beforehand.  We started with 2.5 grams of dry leaves each which was not rehydrated.  We each chewed this for 30 minutes.  The leaves are bitter, but manageable.  My friend found it atrocious.  Subtle effects came on at 20 minutes:  a feeling of heaviness, almost weakness, slight ataxia, and a definite feeling that something is different in your head.  We spit out our quids and put the second quid in our mouths, again for 30 minutes.  10 minutes into the second quid I started feeling very happy, and prone to laughter:  I could laugh at anything, even if it wasn't funny at all.  At around 20 minutes into the second quid I kind of lost track of time, and found myself cordially debating with my friend over the effects we were feeling.  It was then that I suddenly realized I was high.  I could not trace events from when I took the quid to that exact moment.  My imagination became stronger (like with cannabis) and I could imagine quite easily that we were in some different place but it was also easy for me to 'touch ground' again and look at reality.  The strongest effect at this stage was my happiness and the feeling that I was a *different person*, which was a strange but somehow familiar feeling, like returning to some long-forgotten place.</p><p>Remembering that the effects are different with closed eyes, I sat down cross-legged resting my head on my hands.  My friend was about 50 meters away and walking towards me.  With closed eyes I didn't notice anything at first, but then I saw/sensed (and this is very subtle) a kind of two dimensional black hole with particles swirling around it.  Then I had a very strange feeling:  time was stopping.  It was marvellous.  It was actually in my control.  I knew that I could actually stop time if I wanted to.  This feeling was connected to the 'black hole' somehow.  For a moment time did cease and it felt like I hit the pause button on the world.  Everything had stopped and somehow I was standing outside it.  I had the idea that this 'black hole' is somehow at the center of the world, or behind it, animating it.  I then opened my eyes, realizing that the world had not stopped in reality, and that only my perception of it had changed, and I did not want my friend to suddenly pop out of nowhere beside me.  He was still some distance away.  I closed my eyes again, and this time I was flying over a field of green pillars standing in two rows.  As I passed over them they fell over.  This was interrupted by my urge to tell my friend what had just happened.  It is difficult to explain that all of this was at once very subtle but also profound.</p><p>We decided to walk around.  There was a definite feeling of intoxication, but it was a 'good' intoxication.  The closest I can get to describing it was to slight alcoholic intoxication, but it was entirely different:  there was a sense of extreme control, consciousness and clarity.</p><p>After about an hour of experiencing these effects, we sensed that we were 'coming down'.  This was actually the greatest part.  We both felt this very strong feeling of (for lack of a better word) 'indifference', but in a very, very positive way.  'Transcendence' would be a better description.  I'm a very self-conscious person, but during this comedown stage my worries seemed ridiculous; irrelevant.  In fact, I saw everything clearly:  all the negative things in my life, things I worried about constantly, became ridiculous and was not justifiable in terms of the time I spent thinking about it.  I had a feeling that I could overcome them - that I *would* in fact; no doubts.  There were greater things to think about and experience in the world.  My friend reported the exact same effect.  It was as if our minds were a blank slate, no prejudice, no noise - just clarity.  The idea of a self, an ego, was irrelevant and unnecessary.  This went on for about an hour.</p><p>I went to sleep shortly afterwards.  I had no clear dreams, rather one long rush vague images and ideas.  Waking up the following morning I found to my amazement the 'afterglow' that is commonly reported.  But I had not expected this.  It was like the comedown, only more subtle.  My imagination is much stronger than usual, and familiar places feel foreign and new to me, as if I were experiencing them for the first time.  My whole perception of the world has changed.  Also, the transcendence effect persisted quite strongly.  I feel like a different person.  I can basically divide my life into 'pre-Salvia' and 'post-Salvia'.  It is now more than a week later and it is still with me.  I don't think it will ever leave me entirely.</p><p>Strangely enough, I have no desire to immediately do Salvia again.  The timing must be right.  Salvia revealed a new world to me, a new way of thinking, one that I could not have imagined.  I feel that it is somehow outside of this world.  It is subtle and deeply profound at the same time.  I have a deep respect for it.</p>"
}
