{
 "title": "Patches, Patches and More Patches",
 "author": "purple kangaroo",
 "citation": "   purple kangaroo. \"Patches, Patches and More Patches: experience with Selegiline (patch) (ID 78057)\". Erowid.org. Jul 17, 2009. erowid.org/exp/78057",
 "substance": "Selegiline (patch)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "12 ",
   "transdermal",
   "Pharms - Selegeline",
   "(patch)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 78057",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 17, 2009",
   "Views: 10628",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have depression, anxiety, social anxiety, OCD. I have tried many medicines the doctors have given me. One day my doctor gave me a box of EMSAM patches, 9 mg each. I tried them for a couple months, one a day, and I felt nothing. No improvement was evident, I felt just as tired and anxious as always. So I decided to put 4 on each day for 3 days, amounting to 12 total patches.\r\nEMSAM is a selective MAO-B inhibitor at doses below 10 mg/a day. I wanted to achieve MAO-A inhibition as well.....because theoretically, MAO-A inhibition would raise serotonin levels, which should help with my anxiety and OCD.\r\nI washed my arms with rubbing alcohol, then put on the patches, consecutively, one next to the other on my arm. So now (presently) there are 4 patches on my arm. \r\n-00 put on patches\r\n--5 minutes : slight stimulation, faster heartbeat, slightly increased motivation.\r\nI felt less anxious throughout the day, and less depressed. I had slightly more mental energy, and a brighter outlook on life. Music sounded somewhat better.  \r\n-8 hours\r\nI started getting dizzy and lightheaded, very tired. I decided to go to bed. I lay in bed half sleeping for a couple hours, then got up. I looked in the mirror, my eyes were extremely bloodshot, my brother asked me if I had smoked weed. I walked around in a daze, I was super tired, every time I stood up I almost fainted. I believe this low blood pressure is due to the Nitric Oxide vasodilation increasing effects of EMSAM.\r\nI felt as if I was extremely dehydrated. I was a little agitated. The whole night, I laid in bed trying to sleep because my body was so tired, but I couldn't get to sleep.\r\nThis ironic insomnia was accompanied by extreme low blood pressure and drowsiness, hazy thinking, and mildly improved mood. It could be described as a 'mixture of a booze hangover, a stonedness, and extreme exhaustion from working outside all day.'\r\nI havent slept in 3 nights now, it is 7 o clock in the morning, and I am taking off all the patches. I realized I was kind of stupid.....I even ate tons of food with tyramine. I just slept all day, and twitched all night.\n\n\n"
}
