{
 "title": "You Tell Me",
 "author": "L",
 "citation": "   L. \"You Tell Me: experience with Salvia divinorum (ID 78054)\". Erowid.org. Oct 24, 2013. erowid.org/exp/78054",
 "substance": "Salvia divinorum",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   "  T+ 0:00",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "  T+ 0:20",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   "  T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol",
   " "
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 78054",
   "Male",
   " ",
   "Age at time of experience: 22",
   "Oct 24, 2013",
   "Views: 487",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday the mighty salvia crossed my way the first time and I have to reckon that this was one of the weirdest experiences in my life. I have some very basic experience with drugs, smoking the occasional joint and hitting one or another capsule of nitrous oxide. Having a lot of respect for drugs I informed myself properly and I tried not to overdose, which, in the end, led to one hit of maybe about .75g and another one later of about .1g. The all-knowing internet preaches a .25 - .5 for the full experience, but I was eager not to overdo it.</p><p>The setting and mindset was nothing short of perfect. My sitter and I decided to take it outside, sitting on a bench next to a forest on a hill with an impressive view over the city and it's lights. The bench was behind a small road, which hadn't any traffic at all. It was quiet, we were by ourselves. We both agreed that this was going to be full of awesome. I am currently serving time in the army, getting home for 5 days over Easter, so my mood couldn't be any better.</p><p>First I opened the bag and took a wiff of what looked like black dope to me. It smelled like death. In full anticipation I prepared a bowl, getting a little nervous. I said something along the lines of 'Here goes nothing' and torched the bong, ripping that small pile of crumbs in 1 hit. As I inhaled, I was pleasantly surprised that the taste wasn't as bad as I expected. It does taste like a smoking a pine forest littered with dead monkeys though. I had no problems holding the smoke in my lungs, and I quickly forgot about the bad taste. I knew I had to keep the smoke down for as long as I could. About 15 seconds in I couldn't help it but to start laughing. My friend beside me started to laugh as well, but I did my best to keep the smoke inside my lungs. About another 10 seconds later I started to laugh like a crazy person and I had to let go of the smoke. Shortly after that, a gradually increasing feeling of extreme euphoria coursed through my body. I felt like my mind had left my physical being and I could do whatever I want. Having smoked so little, I never really lost touch with reality, in fact, everything appeared to be really real. It's hard to explain, but it was sort of like 'This here be a tarmac ground, it is here, it is now'.</p><p>Slowly reaching the plateau, I started to get massive spinning sensation (mind you, it wasn't an alcohol induced 'Oh god I am gonna vomit all over the floor'-spinning) and I felt a force, not unlike another gravity, pulling on my face. I had the strong urge to stand up. So I did and I walked to the edge of the road and let out the mother of all war cries. A loud 'WHOOOOHOOOOOOO!' made its way all over the city through the night sky. After I did that I thought to myself: 'What the hell did I just do? Why did I do that?'. The most reasonable explanation I could come up with is that it felt pretty good and it seemed like a good idea at the time. I decided to lie down in the middle of the road. The spinning sensation was still going strong and I had the urge to roll around. I thought this would look rather silly and so I decided to stand back up. I went back to the bench and sat down.</p><p>The spinning slowly faded as I was coming down and I tried to start explaining my experience to my sitter, laughing like a madman in between sentences. I still felt pretty out-of-body and I could hear myself talking like I was inside another person, listening to myself and it all sounded like a load of horse-ass to me. My buddy reassured me that it all somehow made sense, in a weird way, which gave me a comforting feeling. This took more or less 2-3 minutes, but the full effect faded as rapidly as it had come on and I was left with an inability to fully verbalize my experience.</p><p>About 20 minutes later, after my buddy had his hit and felt good enough to watch over me one more time, I loaded another bowl, this time slightly more than the first. I torched it and ripped the thing in 1 hit. This time the taste was much worse and I almost sent the bowl flying into outer space from coughing into the bong, but I managed to get a grip on myself and keep the smoke where it belongs. Shortly after inhaling, I knew this was gonna be one hell of a ride.</p><p>The effects rapidly started to come on even with the smoke still in my lungs. I remember uttering the word 'Whoa.' before I drifted away. I still did not lose touch with reality though (At least it didnt feel like I did), I was still sitting on that bench with my homie beside me, knowing I was safe.</p><p>The following is extremely hard to explain and I try my best not to sound completely insane. I became part of a triangle. I am sure it wasn't a solid structure, but it was there. It existed, but at the same time, it didn't. I guess it just 'was'. It had three corners (duh); one of them was me, another was a spotlight in the distance and the third was another spotlight about 60 degrees to the right of the other one. In fact, it was a 60 by 60 by 60 degree triangle. It was a perfect construct of beauty to me. The latter corner had an extreme pulling sensation coming from its direction and I depicted it as something (a creature or a person) that was trying to pull me towards it.</p><p>I did not like this. I didn't feel like this individual meant me any harm (nor that it had any malicious intentions) by doing this, but I had the impression that I wasn't ready to let go yet. I recall swearing at it, but it did not mind. This I liked. I also had my friend's leg inside my peripheral vision and it appeared to morph into a grotesque figure, but I can't recall what it was. I stopped paying attention to it after what appeared to be a few seconds of staring at it in utter disbelief. I started trying to explain what was going on to my sitter again. This was really hard, as I couldn't communicate a single word before having to give in to the urge to laugh hysterically again.</p><p>After many unsuccessful tries I managed to say something along the lines of 'That motherfucker over there is pulling me man, but I wanna stay here and tell you what awesome things I'm seeing'. And awesome they were. The dark night sky turned into a comforting blue color and the road under my boots was green with red stripes going off toward the creature in the distance. The tarmac turned into a green river, where I could see each molecule flowing towards that 'thing' that was pulling me. Even though I saw the road as a liquid, I felt the solid grip of my military-grade combat boots on the ground. This was a comforting feeling.</p><p>I stopped paying attention to the road for a while and my eyes wandered off towards the city. The lights of what appeared to be thousands of houses and street lamps were dancing like fireflies. It was one of the most incredible sights I have ever seen. As the pulling started to fade a little, I got up to walk around on the green road. I had some trouble keeping my balance, but managed to take a few steps. Still rambling on about that 'son of a bitch' that tried to pull me, I asked my sitter for a cig. Immediately after I said that I somehow realised I was still tripping and told him not to give me one. I felt like some part of me was still back in reality and that I was not able to let go completely. Over the whole trip I was confident that I still had control over myself (except for the laughing part) and that my common sense hadn't gone anywhere. It was like a special case of serious schizophrenia, but I was in total control of myself. I was going in and out of my second (drugged) consciousness on demand. This scared me a little, as it was very strange. I started paying attention to other things again and I slowly felt the effects fading. I was coming down, still enjoying the beautiful lights of the city. This took all took place over about four to five minutes, but it felt like a lot more.</p><p>After another hit for my sitter we decided to call it a night's worth. Another thing about Salvia is that it makes me really thirsty. The bongwater didn't look very tasty so we decided to go back inside and have a few shots of vodka. We were both getting very tired. I'm guessing this was the combination with alcohol. Watching Top Gun in this state was a real blast though. The overall after effects (a strong feeling of being breakneck stoned, but better; general clumsiness) lasted well into the night; I slept very little, having lucid dreams about women and their private parts.</p><p>As closure I'd like to say that even though I did not smoke a lot, my experience was off the effing hook. It was unlike anything I had ever experienced. This is a very potent and powerful plant, it is by no means a party drug to get a quick fix. Even less than that is it anything like a weed substitute. Its effects are way beyond what THC can do. It holds a level of its own. Things can and will go downhill if you don't prepare yourself properly. Use it with caution and treat it with respect.</p>"
}
