{
 "title": "A World of Colours",
 "author": "Sovann",
 "citation": "   Sovann. \"A World of Colours: experience with 4-HO-MET (ID 78096)\". Erowid.org. Jun 2, 2009. erowid.org/exp/78096",
 "substance": "4-HO-MET",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "IM",
   "4-HO-MET"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 78096",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 2, 2009",
   "Views: 12182",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter my earlier negative experiences with some other research chemicals,\r\n2C-C and 5-MeO-DiPT (Foxy Methoxy), whose heavy body load and insufficient\r\npsychedelic yield got me disappointed, I have approached this chemical\r\nwith a degree of apprehension and skepticism. I needn't have to worry;\r\nthis is a very gentle drug of rare beauty.\r\nXavier (my partner) and I decided to tag on an experiment with this\r\ndrug to the end of our MDMA-enhanced love-making session, having just\r\ncelebrated our anniversary. We were both already quite tired, but still\r\nfelt we'd like to extend this wonderful night for a bit longer.\r\nI decided to apply this drug by IM injection, in order to bypass the\r\ndeleterious effects of the digestive tract, and to speed up the action.\r\nThe drug acted quite fast, perhaps within 10 minutes, and my threshold\r\ndose was about 5mg. I was then comfortable enough to gradually increase\r\nour dose to a total of 40mg, for each of us. The dose-to-response curve\r\nwas remarkably linear, gently tapering off. There was very little body\r\nload. The effects started to subside in approx one or two hours, and I\r\nhave extended the duration of the trip by topping up.\r\nThe first thing I noticed were gentle rushes in my face, followed by\r\naltered perception of colours. It's a bit like if I turned my\r\ninternal 'colour contrast' adjustment control to the max, and then some.\r\nColours become incredibly deep and vibrant. Xavier (my partner) and I\r\nwere watching a porn movie; this was turned into a piece of art, a\r\nfeast to our eyes.\r\nWatching Xavier's face, I saw it transformed before my eyes. He has a\r\nhandsome face, with some strong features, and I saw him transformed\r\ninto a Star Trek alien, then yet another type of alien, and then some\r\nstrange animals, one after the other. He looked a bit scary, but I\r\nrealized that I would still love him even if he remained like that.\r\nClosing my eyes produced a never-ending tapestry of intricate artistic\r\nimagery which, if one was able to remember it all, would keep alive a\r\ngeneration of fantastic artists.\r\nInterestingly though, this drug was not at all trippy in the Ketamine\r\nsense. It did not affect my mind; there were no 'conversations with\r\ngods', no funny mental loops, no time dilation. It never got scary. I didn't \r\nactually get deeply involved in the 'action'. Rather, I was in a\r\nposition of an amused, almost detached, observer. That was quite enough\r\nfor me, but Xavier was somewhat disappointed, being used to a deeper\r\ninvolvement on Ketamine and complaining that the visuals were too\r\nweak even while he was at the peak of his experience.\r\nHaving said that, I did in fact notice some subtle mental cues of deeper\r\npsychedelic deja-vu of my earlier Ketamine sessions. The drug does seem\r\nable to get me close to some of the doors of higher perception, but leaves\r\nthem safely shut.\r\nIn terms of the stimulant/depressant scale, this drug was mildly\r\nstimulant, in a peaceful, gentle way. I would imagine (as I heard) that\r\nit would make a great combo with MDMA (in our case the MDMA effect was\r\nalready over). But it was not a rave club drug; I wouldn't be able to dance on it.\r\nIn fact I tended to develop a slight nausea just by going to the\r\nbathroom and back, which however, quickly subsided when I got back in\r\nbed again. It was not a sensual drug; I probably couldn't have sex on it,\r\nit does not seem to enhance any erotic feelings. But if I wanted to just\r\nlie down and relax, and perhaps watch some movie, I could be sure it\r\nwill become a work of art, a colourful, yet not kitchy, eye candy, while\r\nstill leaving my mind intact enough to be able to follow the plot.\r\nThis is a successful research chemical which could in fact make it to\r\nthe mainstream. It should have a street name; I'd simply call it 'Colour'.\n\n\n"
}
