{
 "title": "Be Prepared and Careful",
 "author": "Gennifer",
 "citation": "   Gennifer. \"Be Prepared and Careful: experience with LSD (ID 7815)\". Erowid.org. Oct 31, 2001. erowid.org/exp/7815",
 "substance": "LSD",
 "bodyweight": "85 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7815",
   "Female",
   " ",
   "Not Given",
   "Oct 31, 2001",
   "Views: 10131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nAbout a month ago, I went to a folk festival with my family and my boyfriend. I've been wanting to try acid for a long time; me and my boyfriend have been trying to get a hold of it for months. He's done it before, and said it is the best drug out there. Well finally we acquired 6 hits- on marshmallows- from a kid in school (we're still in high school, 17 years old). I decided to take one, he would take two, and then we'd save the rest. So we brought it to the campground with us, and were planning on taking it on Friday night, when all the good bands were playing. </p><p>We ate a little dinner, and took a walk up the street at about 6:30 and ate one marshmallow each. About five minutes later, I could already feel the effects. (Tip: before you do a more serious mind-altering drug like LSD, I recommend trying some other psychedelics before - I've experimented with mushrooms, DXM, and morning glory seeds. This way you'll get a familiar feeling when you trip. This is important so you know what to expect and you don't freak out). It was the usual light-headed, almost drunk feeling. We wandered around for about 45 minutes, but nothing really progressed for either of us- the same feeling as before. So we decided to eat another one each. So it was then 7:15, and I had taken two hits, and he had three. </p><p>My little sister was tagging along that night: as most 13 year olds, she was being really annoying, and my boyfriend John* was getting nervous. He knew that she'd bug him out. (Setting is very important- only choose to be around people who you trust, and people who will make you feel relaxed and calm in this type of situation). So after about 30 more minutes of hearing my little sister beg us for a hit, we gave it to her. (Bad Idea #1- we knew she wouldn't be able to handle it, even though she's experimented with alcohol and marijuana before). </p><p>So at 7:45, an hour and fifteen minutes after Hit #1, and 30 minutes since Hit #2, we went down to the field to watch the show. At that time, I was feeling extremely intoxicated. I expected it to be more like being high on weed- but it was definitely like being drunk, or a strong DXM trip. It was getting dark, and I was getting confused (Setting again- be comfortable where you are taking this drug, don't take it in an unfamiliar scene). We made it down to the field, and chilled in the back, where we knew my parents wouldn't find us (Bad Idea #2- taking LSD around parents). </p><p>These little kids had glow necklaces and were throwing them in the air. It looked so awesome- the patterns and the trails had begun. I sent my little sister over to a vendor and she bought three. We were just laying there on the ground, swinging them around- it was like being at a laser light show. It was 8:15- I was feeling really good, smiling, and thinking 'this is why I'm alive'. Then, John's attitude started to change. It was really cold out- but he was like, rocking back and forth, sweating. I was trying to tell him how cool everything was- we were in a different world, people were walking by in slow motion, there were patterns everywhere, and everything was alive. But whenever I opened my mouth, he'd tell me to shut up. </p><p>I was getting scared, because I was afraid that he was gonna have a bad trip- he kept repeating 'I'm never doing this again...this was a bad idea...I wish this would stop'. Then I started thinking these ideas. This dude walked up and asked me something, I answered him back, and when he walked away I realized it was my dad. It was about 9:30. My little sister was chewing on her long sleeved shirt- it was soaked. She looked insane-you couldn't see her blue eyes- only huge pupils, and she looked like a rabid dog. My boyfriend was laying on the ground, with his eyes covered, shaking. I was getting really scared for him. I was trying to calm him down. </p><p>Eventually, the concert ended, and it was about 11:30- but it felt like we were there for a couple days. My trip was starting to go bad, between my little sister and John,  my mind began to race- when is this gonna end? what time is it? what happens when my parents come up? everyone around us knows! what if a dog attacks me? Well my parents found us again, and we tried to act normal, but my little sister kept saying that she was having so much fun, and I knew we were being shady. We walked up the hill to the campsite, which seemed to take forever, and my parents stopped and gave us the camper key, because they were gonna stop by the bathroom. My dad handed it to me and said 'it's the perforated one'. But aren't all keys perforated? It seemed like everyone else were the ones who were messed up, not us! </p><p>Well, we got lost on the way back to the camper. My parents were there before us, and they kept asking us where we were. We were freaking out, because it only seemed like we were lost for 5 minutes- but on acid, your timing is messed up- in reality it could've been 2 hours. We walked into the camper and we started to get ready for bed. There was no way I couldn't changed my clothes, or washed my face or brushed my teeth. I was sitting on my bed, and John was looming over me, and I kept asking him where we were and what we were doing in my camper, and when are we going home? (Another good reason to be in a comfortable situation). We climbed into bed, and my dad was outside listening to trance music. Not tonight! we thought. It was one o' clock,I had been tripping for about 6 hours, and it didn't seem like it was going to stop. I shut my eyes, but the trance music was causing some crazy closed-eye visuals. </p><p>Then my mind lapsed to a book I had been reading about the Vietnam war. I started freaking out because I thought the Congs were going to come and shoot my family. I was hiding under my sheets, sweating, and I realized something was really uncomfortable in my mouth. I was chewing gum. It was dark in the camper, my parents had already gone to be (2 am) and I reached into my mouth to get the gum out. Well I went to throw it in the trash can next to me, and it wouldn't get off my finger! I took my other hand and tried to pull it off, but it was stuck between my hands then. I kept trying to get it off, and I was getting incredibly afraid that it would end up on my face or in my hair, and I started crying, and I jumped up out of bed. My mom looked over and was like, what's the matter! So I told her that I had gum stuck on my hands. She helped me get it off, and was giving me wierd looks (because I still had my clothes and makeup on). </p><p>I was getting back into bed, and I looked on the top bunk and John was there, wrapped up in his sheets, staring at me, and completely sweaty. I kissed him and went back into my bed. The rest of the night was full of unwelcomed and sometimes scary patterns on the wooden walls, and wierd noises. Finally I heard the alarm clock go off: it was 6 a.m., and time for John to drive me back home to get ready for work. We went to the Wawa down the road, looking like serious crap. I walked in, and this guy in front of me in line had a huge orange spider crawling up his back. I was so frightened and disturbed that I almost started screaming, and when I paid and left, I walked out and told John. </p><p>We then figured out that we were still trippin. John admitted that he took too much, and he was on the border of having a really bad trip. The three of us drove home, in the fog, and I got in the shower (which was really strange) and put on my makeup and left for work. I was at work, and still tripping till about 10 a.m. </p><p>I learned a lot of things from that night: </p><p>1) Setting is very important- make it a comfortable and familiar place, with trusting people. </p><p>2) always test the substance out for strength before you use it. </p><p>3) make sure you don't have to do anything serious the next day. </p><p>4) Don't do this in front of parents. </p><p>We decided that we would try this again in the future, but only 1 hit each, and during the day, so it won't disturb our sleep so much. Overall, it was a beautiful experience, but you just have to be very prepared and careful.</p>"
}
