{
 "title": "Easter Therianthropes",
 "author": "kgao",
 "citation": "   kgao. \"Easter Therianthropes: experience with H.B. Woodrose & Herbal Ecstasy (ID 78156)\". Erowid.org. Jun 18, 2013. erowid.org/exp/78156",
 "substance": "H.B. Woodrose & Herbal Ecstasy",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 ",
   " ",
   "Herbal Ecstasy",
   " ",
   "  T+ 3:00",
   "10 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   "  T+ 4:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2009",
   "78156",
   "Male",
   " ",
   "Not Given",
   "Jun 18, 2013",
   "Views: 848",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the easter break I was keen to cut loose a bit from the daily grind and do some dancing and tripping. I have come to realise that if an experience is meant to befall me, it will find its own way of happening, no matter what my choices through space and time are. So I was not surprised to stumble upon a rave complete with psilocybin themed lectures occurring the very next day, just 2 hours away by train. That very same afternoon, a package I had ordered from an online retailer also arrived, containing a pack of 10 hawaiian baby woodrose seeds, 4 amino-acid based herbal ecstasy tablets and some ayahausca ingredients (the latter were not part of this experience). A voice in my sleep (or was it my iPod?) once told me a coincidence is what you get when you apply a bad theory. So what else could I do than pack my swag and set off for the rave?</p><p>The day of lectures was very stimulating and thought provoking, the perfect way to prepare for a psychedelic experience. As the sun began to set I sat around a fire with strangers and enjoyed the atmosphere. At about 8pm I took one of the herbal ecstasy tablets. I have taken these many times before so new what to expect - a slow come-on followed by intense euphoria after about 2 hours. At the same time I could feel a cold coming on, but this wasn't going to dampen my spirit - although it ended up having a big effect on the trip. At 9pm the first DJ started playing, and I made my way into the main dance area and slowly began the ritual that is dance. I had been reading Graham Hancock's book 'Supernatural' over the past few weeks, and had been inspired by the shamanic dances of the San bushman from South Africa where a trance state is entered and hallucinations encountered - apparently without psychotropic substances.  So I was keen to treat the dancing this night in a shamanic way (i.e. full-on, non-stop) and see what effect it would have on my trip.</p><p>After the first two DJ sets had finished (mild progressive-trance) I was feeling a nice buzz from the herbal e and went outside to drink the HBW concoction I had prepared the night before (ground 10 seeds, mixed with lemon and water), avoiding the cardio-active compounds in the sediment that had fallen to the bottom of the bottle. I sat by the fire some more for an hour or so until I started to feel the first rising notes of LSA entering whatever synapse it interacts with. As I heard the first beats of a dark-psytrance set started I quickly inhaled a small joint, and headed in for the experience. The music was amazing, synergizing with the rising energy of the trip and flowing through my body. I soon let go and submitted to the experience as I felt my grip on reality dissolve away from the substances and intense dancing. Time started to slow down, colours became brighter. Also, I felt like I was in telepathic contact with the DJ. If I would make a certain motion with my hand or face, I would look up a moment later to see the DJ mimicking the same motion. The bass line pummeled through my body and lifted my spirit higher and higher.</p><p>After this set, I went back outside. The trip was only just beginning I realised - either that or the dancing had amplified the effects many times. As I lay down on the ground with some crazy throat singing happening by the fire, I started to hallucinate. The hallucinations seemed much more overt than my previous LSA experiences, closer to LSD or psilocybin. The texture of rocks was an especially good canvas for the visions to unfold on. Maybe it was the book I had been reading that spurred my imagination, but I began to see rock paintings of what Graham Hancock refers to as therianthropres - half human, half animal hybrids - on the rocks. Millions of them - the smallest piece of moss or colouration in the rock would set off a cascade of bison-men floating through the rock ether. And then I had a revelation, a feeling, that I have only ever had on DMT - the absolutely clear knowledge that all time and space and consciousness is connected, everything is one. And a premonition befell me - that I should, and will, devote my life to the elucidation of the psychedelic experience. Next year I plan on beginning a course in ethnopharmacology - hold me to my word, dear friends.</p><p>I didn't sleep for another 16 hours, partly due to the stimulants I had taken and partly due to near psychotically enlightened state I found myself in. I must admit that at some points I was scared that the experience was becoming too intense and my sanity was at risk. I remember saying to myself - 'sobriety is such a precious thing'. I think this paranoia may be induced by the cardio-active compounds in the HBW fuzz that seemed to be present despite my attempted filtration. I think in the future I will attempt a proper polar/non-polar extraction of LSA - the poisonous compounds in the seed coating really make the trip difficult.</p><p>This experience opened my eyes to the potential of plant-based LSD-like experiences.  It also presented me with many revelations, as mentioned about, plus another that I just remembered - morning glory seeds or LSA/LSD like compounds must have been used heavily by our pre-historic ancestors for such profound psychedelic effects to occur.  When I'm in that state, it is obvious that my body and this compound have a very deep connection that runs far into the Paleolithic.  </p><p>Peace, and happy tripping.</p>"
}
