{
 "title": "The True Allergy Drug",
 "author": "RMPSergeant",
 "citation": "   RMPSergeant. \"The True Allergy Drug: experience with Kratom (ID 78171)\". Erowid.org. Jan 23, 2010. erowid.org/exp/78171",
 "substance": "Kratom",
 "bodyweight": "182 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Kratom",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 78171",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 23, 2010",
   "Views: 8789",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIntroduction\r\nI have suffered sinus and allergy issues for 12 years, to the point where my doctor has prescribed Tussionex as my main medication.  Tussionex has been mildly effective, but Kratom has been explosively effective.  I have suffered allergies, year round, and they interfere with my quality of life.  Fatigue, irritable bowels, bad moods, sore throats, congestion are just some of the physical and mental ailments that haunt my every day.  I discovered the existence of Kratom through the internet and decided to give some a try.  After a year and a half of experimenting, I have found (for myself) the perfect recipe/amount of Kratom to use.  I decided that I would rather be addicted than deal with my allergy symptoms on a daily basis.\r\n-----------------------------------------------------------------\r\nPreparation\r\nI will scoop out 6 grams of enhanced bali, 4 grams of premium commercial; add one package of hot chocolate to a standard coffee mug.  Filling the mug three fourths of the way with water, I mix the Kratom and hot chocolate together, and then microwave the concoction for one minute and ten seconds.  The purpose of using the hot chocolate is to mask the taste of Kratom, which can be very unpleasant to swallow on its own.  The mixture is pleasant and easy to ingest.\r\nTypical Onset of Effects\r\n00:00-00:15I can feel a hint of the Kratom, a warm (opiate) feeling in my chest is just detectable.  If my allergies are severe at this point, I can already feel them slightly subside.\r\n00:15-00:30-My allergy symptoms continue to subside, the warm feeling begins to spread throughout my body.  Thoughts, both practical and creative, become clearer, energy levels (drained by allergies) return.  \r\nNote-Sometimes after ingestion, I will take a power nap of either thirty or forty-five minutes and upon waking I will feel completely refreshed.\r\n00:30-01:00-The Kratom kicks in, the warm feeling has overtaken my body.  I feel refreshed, clear, and without symptoms.  My fatigue, congestion, and the other unpleasant feelings have vanished and will stay in effect for at least two or three more hours.  \r\n-----------------------------------------------------------------\n\n\n"
}
