{
 "title": "Evil Sort of Temptress Idea",
 "author": "slmn",
 "citation": "   slmn. \"Evil Sort of Temptress Idea: experience with Cacti - T. bridgesii (ID 78222)\". Erowid.org. Apr 20, 2009. erowid.org/exp/78222",
 "substance": "Cacti - T. bridgesii",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cacti - T. bridgesii",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 78222",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 20, 2009",
   "Views: 5068",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWe bought bridgesii cacti, like 6 feet [2 feet or so for me], cut them up and boiled them for like 4 hours, then reduced all the liquid to just a few ounces, which we then drank down with water, lemonade and pepsi. Pretty bitter. First time Ive done this, but have done a bunch of other drugs. <br>The first thing to start coming on was a different feeling, like I had ingested something psychedelic. The next thing was intense beautification of regular life  we went to a garden and the flower, leaves, etc. were so much more vivid. The existing patterns  like the marble floors at the garden  began to swirl. Anything with a pattern to it, especially non distinct, began to swirl. At first is was only through peripheral vision, then it started all the time. Things began to change again. This is the way I would explain this trip, constantly changing. We put on good psy-trance and the music was intensely intense. Synthethesia started with hearing the musical notes, flashes of light and kaleidoscopic transformation of sounds both in my head with eyes closed in tune with music, but also a kaledeiscopic view of everything around me especially in conjunction with the music. <br>Then came a body high, more intense than MDMA, along with the kaledeiscopic visuals. With my eyes closed at this time, the music sounded almost sinister and there was a sinister feeling in the background  than I started feeling as if an evil temptress was dancing along with the music in my mind, that was contributing to the feeling as a whole  evil seductress but not with bad intent, deviousness, intensely kaleidoscopic visions, but here my mind starting becoming kaledeiscopic, with the best way to describe everything, what I'm seeing, feeling, hearing, visualizing, thinking about has an evil sort of kaleidoscopic interesting flowy, moving, repetitive but with no repeat of the pattern, circular, visuals, but more importantly mind flow. Its like 4 hours into the trip, and things begin to look DMTish before the actual travel part  when I did DMT, first Id get purplish swirling patterns in my head with eyes closed, with strange oddly familiar music and with a suggested task of moving towards some possible figure at the end of a Tunnel in my head. But the bridgesii gave that same purplish, kaleidoscopic, moving, patterned but never repetitious look inside my head. But also to things around me, and again, most importantly with the way I was thinking/viewing the world again an evil sort of temptress idea about the world  not scary at all, but just deviously interesting and wanting to have fun with me. <br>Definitely a different perspective on life. With a few hours of all this, begin to come down, but the visuals are still there, only no more euphoria. Then it continues to come down. But here things get interesting again. There is a time period at the end of the trip that I feel kind of like when on meth or amphetamines, a general euphoria and racing of thoughts, with a lot of mental clarity, then a big time hornyness, then a feeling like Im coming off speed, and an inability to sleep for a few hours, but then a calm effect the next day. In conclusion, the bridgesii is a gentle mix of different substances, mixes of ectasy, speed, some elements of mushrooms and acid, even some DMT, but an altogether interesting and worthwhile experience. Very little circular thinking as well like Ive experienced with acid, and way, way more interesting visuals, but again, the empathy and high of e, at times, and the mental clarity of speed. I forgot to mention, a few hours after ingesting the cacti, huge wave of nausea and vomiting, everything in my stomach but helped a lot.\n\n\n"
}
