{
 "title": "All I Saw Was White",
 "author": "Dummy",
 "citation": "   Dummy. \"All I Saw Was White: experience with LSD (ID 7824)\". Erowid.org. Aug 12, 2003. erowid.org/exp/7824",
 "substance": "LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7824",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 12, 2003",
   "Views: 8784",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was about 2 months ago. I had just recently bought a vial of acid. Having only a small portion left, me and my friend J decided to take the rest of it. My vial was in a small sweet breath bottle. I dropped 2 hits on J's tounge. Then I went to drop it on my tounge and nothing but air came out. I was extremely pissed at this point. I knew my friend was to soon be tripping and I was going to be able to enjoy it with him. I knew there had to be some acid still on the tip of the bottle. So, I licked all around it and immediately tasted the acid. I put the tip of the vial up to my mouth. I sucked in while squeezing the bottle. What ever acid remained in the vial was now in my mouth. I could taste it! </p><p>Me and J rolled up a blunt and started to smoke, waiting for our trips to kick in. I started to feel the 'butterflies' within about 10 minutes of my dose. I knew I was about to be FUCKED up!!! I asked J if he was feeling anything yet. He said no. The butterflies got stronger and stronger. I knew that this was going to be CRAZY! I knew this trip was about to blow my mind.</p><p>Now, I was starting to get a little scared at this point. This was the 5th weekend in a row that I had tripped. I was kind of shady about doing it in the first place. I was getting the feeling like I was going to flip out. This made me even more nervous about the upcoming trip. All I could think about was that I was going to go crazy. After all, who knows how many hits I took. I thought I took too much. I have never felt butterflies like that before. </p><p>All I could do was stare at the floor while this amazing feeling crept up my body. J noticed I was acting a little weird and asked if I was ok. I said yes, I'm just feeling the acid start to kick it. He said ok and held out his arm to pass the blunt to me. Just as I put my hand out to grab the blunt from him, his arm started melting. It looked like hot candle wax, just dripping onto the floor. Pretty soon his whole body melted and was soaked up into the carpet. I was like WHAT THE FUCK!! I could hear his voice asking me if I was ok. I knew it was just a hallucination so I closed my eyes to get back to reality. I opened my eyes once again and it was 10 times worse. All I saw was white. I was in a completely white room. ALONE!!! All that was in there was me and the couch I was sitting on. It was like in the Matrix when Morpheus brings Neo into the computer and they are in the white room. I can still hear J talking to me. I look straight ahead and I see a tiny white light. All of the sudden it just gets bigger and bigger. Then it shoots out at me. Just like in the Matrix when all the gun racks shoot out at Neo in the white room. I felt a thump on my chest and I was back in reality.</p><p>Reality was much more different than what it should be. When I came out of my trance I was tripping nutz. Everything was moving, waving, and jumping around. I felt like I was in a cartoon. I was tripping so bad my stomach started to hurt. I felt like I was going to throw up. I went and sat by the toilet then realized I wasn't going to throw up. My stomach was growling cause I hadn't eaten all day. </p><p>So, me and J went into the kitchen to cook some food. At this moment he wasn't tripping yet. He told me he was going to eat a left over steak and I could eat whatever I could find. I decided I wanted some hot dogs. He heated me up two. When they were done we realized he was out of buns. I had to make use of what we had. I was so fucked up I took tortillas, spread ketchup all over them and rolled the hot dogs in them. About half way through this crazed idea J had started to trip himself. So, we were both really fucked up. He had a nice steak and I had hot dogs wrapped in tortillas. I looked and my creation and looked at J and said 'what have I done?' He looked at me and just laughed. </p><p>We went into his room because DragonBall Z was about to come on. We figured it would be the perfect thing to watch while tripping. Believe me, IT WAS!!! The fast motions, bright colors, and intense fighting scenes put us in complete euphoria. It looked like the whole TV was shaking. I saw the fighters jump out of the screen and practically onto the bed. It looked like minature men where fighting on my lap. It was crazy!</p><p>After DBZ me and J went to smoke another blunt. Then we realized we were both tripping way too hard to even begin to roll a blunt. So, we called some homies of ours to come over so they could do it. They show up about 30 minutes later. They roll up a blunt and we smoked it. Then we got our friend D to lick the inside of the vial. This was his first time to trip and it was great to see him that fucked up. He was running around like most first timers do. Amazed at what he was seeing.</p><p>Me and J walked into the garage and found a big bottle of fruit bunch that said 100% vitamin C on it. We had heard that vitamin C increases your trip so we proceeded to drink it. It did increase my trip pretty well. We went outside and everything was wavy. The trees looked like kaleidescope images. I looked at his porch lights and saw rainbow colored streams shooting out at me. The feeling was incredible. I was in such a euphoria. It was the best feeling I have ever felt. I was truely in a perfect world. Surrounded by good friends with a great feeling. I was in a totally different world. </p><p>Although I don't know how many hits I took it must have been around 7 at least. This was some dank acid too. Really good shit. I could tell right away. Well, that's my story. Be safe and have fun.</p><p>Happy Trippin & Peace!</p>"
}
