{
 "title": "Doesn't Always Matter if It's Actually Illegal",
 "author": "anonymous",
 "citation": "   anonymous. \"Doesn't Always Matter if It's Actually Illegal: experience with 4-AcO-DMT (ID 78466)\". Erowid.org. Apr 29, 2009. erowid.org/exp/78466",
 "substance": "4-AcO-DMT",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "2009",
   "78466",
   "Male",
   " ",
   "Not Given",
   "Apr 29, 2009",
   "20143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>I had a legal encounter I want to share. I am located in New Jersey, USA and in 2009 I was arrested and charged with possession w/ intent to distribute, possession of controlled drugs (CDs), and possession of CDs in a school zone for what was believed to be mushrooms by the police. It was in fact 4-aco-dmt acquired on the internet and diluted with iced tea mix and bagged. I am a juvenile and was released to my parents later that night after being processed and questioned where I didn't have much to say except it was nothing illegal. </p><p>A plea bargain was sent out involving 18 months probation, this under the assumption it was in fact CDs. A lab analysis tested negative for any CDs whatsoever. It turns out, however, that I would still be prosecuted for mislabeling the substance as CDs.  It had picked up the nickname 'shroom powder' locally. At court a plea bargain was accepted: 12 months probation, restricted drivers licencse, restraining order (DORA) for the location of the incident, 20 hours community service, and about $1100 in fines. </p><p>In the end, the only differnce between me actually selling shrooms and 4-aco-dmt was 6 months probation. Go figure. I hope this can get onto the site somehow and help others avoid situations like my own. I didn't have the bravery (or stupidity as the case may have been) to question the judge really on the legality of the substance but I was in trouble for nothing other than a mislabeling which I still dispute to myself for lack of the textual evidence sent by phone.</p>"
}
