{
 "title": "Altered Space & Time",
 "author": "dillon",
 "citation": "   dillon. \"Altered Space & Time: experience with Salvia divinorum (ID 7847)\". Erowid.org. Aug 12, 2003. erowid.org/exp/7847",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "4 bowls",
   "smoked",
   "Salvia divinorum",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7847",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 12, 2003",
   "Views: 6042",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ok well today my brother just got some salvia divinorum leaves and me him and my friend smoked about 6-7 bowls, some in the room sitting in the light very bright light and some in outdoors mainly on my porch and it did not really have any effect on me accept it felt more like a cannabis high really but every thing just seemed to get so annoying.</p><p>But later that night away from every body in my room at about 1:35am</p><p>I fixed up my bed so every thing was comfortable to me, turned off all the lights, and with some light trance playing across the room, I lay down.  I began to smoke some more salvia, hit after hit nothing really happened but the whole time I had my eyes closed and once I started to load the 3rd bowl I opened my eyes to a whole new reality my head was just glued to the pillow with the feeling of somebody or some force holding me down, but soon I came to see this rather pleasurable reality. My room became like a dark hole in the ground with all these little things fluttering behind me but straight ahead of me was this bright light with sounds coming from it as if they were talking to me. Then, all of a sudden the specks started going for the light then one of them was kind enough to turn around and ask me, ' . . . come with us . . . ' For some strange reason, I appreciated it asking me, but I was still unable to move my head from the pillow which I forgot about.</p><p>Then at about 1:40, I was on my way to load anther bowl, when I lit it up I started to inhale it, my chest expanded I think. So much that I dropped the bowl on me but I didnt care. My room then began to feel like a trailer house room. So small and not enough room to think that it was making me nervous all the light and reflections looked like twirling fire flame just laughing and looking at me that I just wanted out! It was definitely a scary yet extremely vivid experience, one worth trying again </p><p>I recommend it to anybody looking for a rest from reality.</p>"
}
