{
 "title": "Cosmic Energy Cloud",
 "author": "Sam",
 "citation": "Citation:   Sam. \"Cosmic Energy Cloud: experience with 5-MeO-DMT (ID 78485)\". Erowid.org. Jan 25, 2010. erowid.org/exp/78485",
 "substance": "5-MeO-DMT",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "17 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 78485",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 25, 2010",
   "Views: 2549",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIm struggling for words here. 5-Meo-DMT is without a doubt the most powerful substance I have ever experienced, and I am familiar with most things, psychedelics in particular.\r\nI received a sample from an Australian friend, along with some changa. I had previously erred on the side of caution with 5-Meo, having read up on it and well aware of its reputation for potency. I had tried a tiny pinch, and got a pleasant, heavy intoxication, but that is it.\r\nThis experience took place at night, lying in bed, with candlelight and Shpongle playing. I decided to dump the rest of my sample into my glass pipe (impossible to know how much, approximately 15-20mg). I applied a flame to the pipe, vaporised, long and slow, and inhaled one, and then another vast lungful of 5-Meo (not that harsh).\r\nVery rapidly, within a few seconds, my consciousness began to mutate in to something very different. I became aware that my mind was being flooded with light/energy. The feeling was very cosmic, of oneness with everything. There were some visual  patterning in this ocean of light, but this seemed a mere footnote compared to the energy I was experiencing. I felt massively intoxicated  very different to smoking DMT. When I smoke DMT, I encounter incredibly detailed and colourful visions, yet during the experience I feel incredibly clear headed. Not so with 5-MeO. The feeling was of pressure, yet incredibly pleasurable pressure, enveloping my being, and this feeling built up very rapidly after smoking. My pulse increased rapidly, my breathing became shallower, and I did feel nausea.\r\nI didnt get the fear with 5-Meo, to be honest I actually find the trance state more inviting than on DMT, which can feel quite cold and alien on high doses. I find it very hard to describe the trance it put me in, particularly in comparison to other psychedelicswords are a poor medium for describing such a state. I was however, very impressed, and feel very lucky to have experienced it.\n\n\n"
}