{
 "title": "Giving In",
 "author": "Slappy",
 "citation": "   Slappy. \"Giving In: experience with Heroin (ID 7850)\". Erowid.org. Aug 12, 2003. erowid.org/exp/7850",
 "substance": "Heroin",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "1998",
   "7850",
   "Male",
   " ",
   "Not Given",
   "Aug 12, 2003",
   "15679",
   " "
  ]
 ],
 "report": "<p>My heroin use can best be described in a poem I wrote about it about the time I got off it.  I was never really horribly addicted, it never really got to the point where people could tell.  Most of my friends don't even know anything about those six months, just that something was fucked up.  I started because my girlfriend at the time was into the stuff, she shared with me and I loved it.  Wanting to please her, and be different (just like millions of other heroin addicts out there), I nearly destroyed my life.  </p><p>Every time I shoot the stuff up, I stop caring about anything at all.  I feel so warm and safe, that I never want to leave that place.  It is almost what you could call heaven.  But truely, it is a glorious path to hell.  This is a drug that is a favorite, I believe, for those of us that have lived horribly traumatic lives.  This seems to be an anti-depressant that works.  Unfortunately, it is an anti-depressant that makes everything worse.  After a while a milligram or two isn't enough, you have to go to three or four milligrams, then maybe even up to twenty.  That gets horribly expensive, and so you must buy more to get high, or more accuratly, to escape the world.  I think this drug also alters mood incredibly, as I noticed that my girlfriend seemed to become two different people, one evil, the other sweet and kind.  And me, I became a huge asshole.  After a while, I begin to live on the street with my girl, we stayed at somebody's house, and we robbed them, for our habit.</p><p>Luckily, I realized where this was leading me, and I somehow got out.  I tried to get my girlfriend to quit, but in the end, I had to leave her.  Now, I'm a bit more on track, going to college, working on an MBA so I can be a corporate asshole trying to steal the world out from under the lower class.  Probobly driving more people to drugs.  I dunno.  Read the poem, its called...</p><p>Giving In</p><p>Hatred consumes my soul</p><p>This cloud of emptyness you drag me through</p><p>Everything is lost because of you</p><p>You have taken everything away</p><p>You have destroyed me</p><p>I will never live again</p><p>I will never be free</p><p>Hold onto this pre-mortal coil</p><p>And shed away your tears</p><p>Break free from this sweet gravity</p><p>And fall into my fears</p><p>Be ever consumed within my darkness</p><p>Be blinded by my light</p><p>Hate everything about me</p><p>And I will make it all right</p>"
}
