{
 "title": "Adverse Health Problems After Two Months of Use",
 "author": "kuf44ver",
 "citation": "   kuf44ver. \"Adverse Health Problems After Two Months of Use: experience with DXM (ID 78553)\". Erowid.org. Jul 13, 2009. erowid.org/exp/78553",
 "substance": "DXM",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 78553",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 13, 2009",
   "Views: 21813",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had never gotten high on cough medicine until about 2 months ago.  I was bored and read that you could get high off cough syrup.  I went out and bought a 4oz bottle (300 mg) and drank it in my apartment.  It made me feel really comfortable and warm and happy, and it was fun to walk a little weird.  For two weeks I took 300 mg of DXM maybe twice a week until I started to notice that my body had built a tolerance to it, plus I was getting sick of drinking syrup, I just couldn't do it anymore.</p><p>This is when shit turned bad.  I was doing research online and realized there were gel pills with DXM in them.  On a whim I went out and stole 2 bottles of them and took 600 mg before watching a movie with my dad, fully expecting the high to be as mild as the 300 mg high.  I was so wrong.  I got so messed up that I felt dissociation and when I tried to talk I sounded like a mummy and my dad thought I was just sleep talking when really I was trying to talk to him.</p><p>Well, this experience was awesome.  I didn't know that cough medicine could get me as high as I had just been.  I continued to abuse.  For a day or two after each trip, I would feel off.  I would feel clumsy, forgetful, stupid, and not myself.  But I didnt care.  For the next month and half I would steal Robo gel caps everytime I saw them.  I would be getting high 2, 3, 4 times a week, up to 900 mg at a time.  Several times my trip scared me so bad that I vowed not to do it again, but nonetheless, I couldn't help it, the experiences were just too intense and amazing.  I felt like I was tapping into my unconscious and finding the real me.  I became addicted to stealing.  I started stealing anything I could whenever I had the chance, in front of customers, at checkouts, I didnt care.  I stopped hanging out with my friends because none of them were into drugs, especially not cough medicine.  Instead of hanging out on weekends, Id take 700+ mg of DXM, crawl into the back seat of my car, put music on, and trip all night, stumbling back to my apartment hours later.  </p><p>About a month or so into my abuse I knew that I needed help.  I have an addictive personality and my self-control isnt the greatest, so I began to fear that I was going to get further and further into the abuse and end up hurting myself or even dying.  Then, things started to change.  I got arrested for stealing Robo gels.  I told myself this was what I needed and that I was not going to do them again.  That lasted a week (the longest Id been sober in almost 2 months).  Then I went out and BOUGHT (for the first time in 2 months) my Robo and did 800mg.  The trip was ok, nothing special, but as I was sobering up, the most intense migraine Id ever gotten hit me like a ton of bricks.  I was in so much pain that I was writhing and moaning and hallucinating.  I eventually passed out and woke up feeling fully recovered.  I laughed off my migraine and assumed it was just stress related.  </p><p>Four days later, out of nowhere I got really nauseous and started to throw up.  My puke was a deep red, and looked like a mix between blood and robo gels.  This freaked me out since it had been so long since I had eaten anything red or taken Robo gel caps.  About a week later, I decided to trip again, but only 600mg this time.  Again, as I was sobering up, I was hit with another horrific migraine, this time worse than before.  I was literally tearing up and throwing up and buckled over in pain.  My vomit was the strangest shade of pink Id ever seen, and was so overly salty that I knew something wasnt right.  I took some Excedrin migraine and it helped.  I woke up again feeling perfectly normal.  </p><p>It has been three days since that experience, and I am proud to say that I am done forever.  The migraines and vomiting have to be a sign that I am damaging my body.  It is a plea from my body to stop hurting it so much.  I am 22 and way too young to be destroying my body with a drug.  And this all happened in TWO MONTHS.  I dont know what damage has been done but my memory is not as good, I am not as coordinated, and my stomach/appetite has not been right for some time now.  I hope my story will help someone in the future before they get too far into their addiction and have horrible consequences.  If they are going to abuse DXM, I am not here to stop them, just give advice.  I was once like those who read stories like these and thought to myself that wont happen to meI dont use as much or as often.  There are people who use daily, far more than I have, for months and years at a time are seemingly okay, but who knows what damage there is that cannot be seen.</p>"
}
