{
 "title": "At the Library",
 "author": "Moc",
 "citation": " Moc. \"At the Library: experience with Adrafinil (ID 78592)\". Erowid.org. Sep 3, 2009. erowid.org/exp/78592",
 "substance": "Adrafinil",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Adrafinil",
   "(pill / tablet)",
   "",
   "1 tablet",
   "oral",
   "Vitamins / Supplements",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2008",
   "78592",
   "Male",
   "",
   "Not Given",
   "Sep 3, 2009",
   "13753",
   " "
  ]
 ],
 "report": "<p>I recently decided to import adrafinil into Canada after reading many articles online about its kin modafinil, which is sadly controlled here. I had mostly read about this class of drugs being used to enhance academic performance (studying, speaking, writing, et cetera).</p><p>I am a soon to be graduate student, so while I do not technically have any tasks to perform of an academic nature, I am enough of a geek that I enjoy my studies, and often haunt the university library. On this particular day I decided to head to the library and review some literature about Kashmir Shaivism and Advaita Vedanta. Before leaving my apartment, I swallowed two tablets of Olmifon (adrafinil) at 300mg each, along with my daily multivitamin, with some water. I then went out into the rainy afternoon, arriving at the mostly deserted library. I found my usual table by the philosophy stacks and a few of the books I wanted, and set to reading.</p><p>Around half an hour into reading (so about an hour since I ingested the pills) I began to notice myself yawning. However I knew I was not tired, and mentally I felt quite awake. Soon after this I began to have some tension in my jaw, and became somewhat thirsty. Though these few side effects were unpleasant, the focus I possessed at this point was wonderful. I usually skip around essays, and have many disorganized thoughts cropping up due to associations with the subject matter. This behaviour did not seem to be a problem now, as I found it much easier than usual to switch between my internal commentary on what I was reading and the actual stream of understanding the text itself. </p><p>Upon finishing a few essays, however, I found myself restless. I got up and went to a water fountain, then sat down again and began to read. I found I wished to write on my laptop, and this thought repeated until I finally got up, checked out the books, and headed for home.</p><p>On the walk home I lit a cigarette, but quickly decided it tasted awful, which is not something that usually happens. I doubt it had anything to do with the adrafinil, but I suppose it could. Upon returning home I chatted with my roommate about my experience, ate part of a meal, and then did get down to writing. </p><p>Throughout the experience, which I suppose was 4 or 5 hours, I did feel I was 'unnaturally' awake, though it did not feel as tense as caffeine can for me. There seemed to be a bit of pressure behind my eyes, some jaw tension, and  I did continue to yawn (seeking oxygen?). At the five hour mark or so I went for a walk with a friend and smoked a cigarette. Soon after, I did not feel 'up' at all, and was quite grumpy, though this undoubtedly had as much to do with our conversation as the cigarette. Still, it did seem the cigarette 'ended' what I had thought of as the adrafinil feeling.</p><p>Now I am around five hours removed from that cigarette. I do not know if adrafinil will be of actual use for studying or writing, but I think next time I will try just one pill.</p>"
}
