{
 "title": "Raver's Delight",
 "author": "Jessyca S.",
 "citation": "   Jessyca S.. \"Raver's Delight: experience with Ecstasy (ID 786)\". Erowid.org. Aug 4, 2000. erowid.org/exp/786",
 "substance": "Ecstasy",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "3.5 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 786",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 4, 2000",
   "Views: 11498",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'm only 14 years old but I know how to party.  This occured in the summer time with my boyfriend of 11 months. He had been going to raves for a while and the word was just spreading around town about this new drug and this new club, so I thought that I would give it a try. I figured it would have been like shrooms or acid but it was the most intense feeling I have ever had. We got to this club and as soon as I walked in the door, there were people coming up to me touching me welcoming me and giving me light shows. I never was really much of a dancer but the music just grew inside of me and started making me dance. We just started buying them there and splitting them piece by piece until we were so wired that I just couldn't stop smiling and I was on top of the world. </p><p>After that night I was looped for about 3-4 days and I couldn't stop thinking about E. So my boyfriend and I started to abuse it, taking it Friday and Saturday night every single weekend for about 3 months until I got scared for what was going on with my body (backpain and confusion) so I started researching it on the net and now I am more educated about it. I haven't done it for about a month now but we plan to stick to 'every now and then' for a treat whenever we go to raves. Esctacy is the best drug I have ever done. I have made so many connections with people when our eyes meet and we're having a conversation and it feels as if our souls are talking to each other. I respect so many people now and love so many people not just because of rollin' with each other. I'll be doing e when Im 60.</p><p>Peace.</p>"
}
