{
 "title": "Bad Trip, But Would Do It Again",
 "author": "AtlasFellOver",
 "citation": "Citation:   AtlasFellOver. \"Bad Trip, But Would Do It Again: experience with DMT & Alcohol (ID 78724)\". Erowid.org. Jun 25, 2010. erowid.org/exp/78724",
 "substance": "DMT & Alcohol",
 "bodyweight": "123 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "250 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 78724",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 25, 2010",
   "Views: 12683",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMy boyfriend and I had been drinking for a few hours one night. We had bought a gram of DMT from a friend earlier in the week and had hit it a few times, always sprinkling some on top of a small amount of weed and simply smoking it. I'd tripped on acid and mushrooms many times before, so was not apprehensive of trying DMT at all; however, out of the two or three times I had tried it, I hadn't felt more than an uncomfortable, weird feeling that lasted for 10-15 minutes with no real hallucinogenic effects.\r\nThis night, we only had one bowl, so my boyfriend tripped first. He put a little more than we had been putting in the bowl and had, as he put it, an amazing, incredible trip. He knew that I had had trouble feeling anything the past couple of tries, so he told me to just empty the rest of the bag when it was my turn. I took one long hit of the bowl, held it in for at least 15 seconds, and exhaled. Immediately I felt the DMT; I said 'Whoa,' and sat down on a bed in the room. I should add that the room was dark (some light was coming in from the adjacent room) and Pink Floyd's 'Echoes' was playing. By the bed on which I was sitting hung a Prussian flag that had a huge bird on it.\r\nImmediately the bird came to life and grew to about three times its normal size, making it about three and a half feet tall and two feet wide. I started spinning into a crazed, dark tunnel, with this bird flapping its outspread wings at me and screeching all the while. I really cannot describe what this tunnel was like; I know I definitely broke through in the DMT terminological sense, but it was certainly not in a good way. The only way Ive been able to describe it is that I felt like Alice in Wonderland when she is falling, but everyone I know and love (and those I simply know) were trying to kill me or otherwise hurt me as I fell. I did not see faces of these people, I just knew that everyone wanted to hurt me. Meanwhile, I was still experiencing the visuals that DMT trips are known for, but they were painful to look at and not pleasant at all.\r\nAs soon as I got some grip on reality again, I called for my boyfriend, who was in the adjacent room. He ran in, and I was crying and convulsing on the bed. I told him to hold me, which he did, and I truly believe that had he not been there I would not have been able to recover the way I did from my trip.\r\nThe whole thing lasted approximately ten minutes, maybe thirteen or so; I wasnt really keeping track. I do know that my body was physically affected by the trip for a good two hours after it happened. I couldnt stop crying, and images from the trip kept creeping back into my mind.\r\nNevertheless, I believe that I could have had and will at some point have a good DMT experience. I had had a pretty rough weekend when I tripped, and mixing the drug with alcohol probably wasnt the greatest idea either. Next time I smoke DMT I will make sure that I am A)In a comfortable setting, probably where I can sit/lie down immediately and won't break anything; B)In a good mood/mindset C)Not drunk.\n\n\n"
}