{
 "title": "Black Magic",
 "author": "Poindexter",
 "citation": "   Poindexter. \"Black Magic: experience with 4-Methylmethcathinone (Mephedrone) (ID 78758)\". Erowid.org. Jul 1, 2009. erowid.org/exp/78758",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 mg",
   "oral",
   "Nicotine",
   "  T+ 0:00",
   "260 mg",
   "oral",
   "4-Methylmethcathinone",
   "  T+ 1:16",
   "4 mg",
   "oral",
   "Nicotine",
   "  T+ 1:55",
   "260 mg",
   "oral",
   "4-Methylmethcathinone",
   "  T+ 3:00",
   "100 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "  T+ 4:00",
   "100 mg",
   "oral",
   "4-Methylmethcathinone",
   "  T+ 5:00",
   "100 mg",
   "oral",
   "4-Methylmethcathinone",
   "  T+ 6:00",
   "100 mg",
   "oral",
   "4-Methylmethcathinone"
  ]
 ],
 "footer": [
  [
   "2009",
   "78758",
   "Male",
   " ",
   "Not Given",
   "Jul 1, 2009",
   "Views: 34818",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I.  Introduction</p><p>The time was 13:00 approximately a week before this report's composition.  I had just woken up, well-rested, and called to get a bit of (weak) cocaine, and on the way out I discovered that the sample containing several capsules of the aforementioned dose of mephedrone (purportedly) had arrived.  The package was not held in customs for an inordinate amount of time, and there was no indication that it had been opened at any point between the sender and me.</p><p>Returning about an hour later, I examined the sample.  The bag smelled strongly of cocktail shrimp or some other seafood--pretty unpleasant--and the capsule exteriors became rather sticky on contact with water.  I'm not sure if this was because of residual compound or because of the gelatin, but my fingers were coated with a foul residue after minimal contact.  I had to use soap and warm water to get it off my hands each time after handling the capsules.</p><p>The powder itself was very tractable and seemingly not hygroscopic after six hours of sitting out at 28 degrees C.  No breaking up was necessary to prepare 100mg for insufflation.  It did not appreciably stick to the razor or glass, and there was no subjective change in the potency of a full capsule's content exposed for the same time.  I was completely naive of this chemical before this experiment.  </p><p>I decided to take notes.  My handwriting is (I'm told) very neat for a guy, and one can easily see its getting progressively worse as the experienced continued because I was compelled to write faster and faster up to a certain point, after which I put zero effort into forming identifiable symbols.  It's pretty funny, actually.  Note that items in square brackets are my comments/corrections for clarity upon writing this report.  I can remember the experience and writing these notes as vividly as anything else from the past week.</p><p>II.  The Good News</p><p>T0:00 - 'Ingested one with water, empty stomach, shrimpy smell, parked 4mg piece of nicotine gum'</p><p>T0:02 - 'Facial warmth?'</p><p>T0:10 - 'Pupil check... normal'</p><p>T0:15 - 'Threshold?  Something's happening.  Physical effects (stomach rumbling), perception slightly changed, pupils look same, motion is ... [trails off]'</p><p>T0:16 - 'body feels light in motion, definitely coming up, excited[,] movement brings happiness, writing fast, energetic, smiling'</p><p>T0:17 - 'Woahhh! Euphoria!'</p><p>-------Here my handwriting becomes quite ugly and frenetic.-------</p><p>T0:18 - 'There go pupils--I have to get up and move--do anything--euphoric--wowwwwww [trailing off the notecard and onto another] Motion feels EXCELLENT!!11 [sic; they were ones, and I remember doing this deliberately]'</p><p>T0:19 - 'Time slowed--functional impairment--trying to plug speakers in, short of breath, heart racing, everything is AWESOME [indeed.]'</p><p>T0:21 - '[Success!] HOLY SHIT @ MUSIC... WOWWWWwww'</p><p>T0:21 - 'EYE TWITCHES NOT WIGGLES, WITH HALLUCINATION -- POPPING BUBBLES [the effect was hard to describe--imagine the visual distortion you get from staring at something that's continually moving forward, except it's constantly happening over bright and dark surfaces, particularly when you move around)]'</p><p>T0:22 - 'MUSIC EFFECTS, VOLUME IS BETTER [not sure what I meant]'</p><p>T0:23 - 'Overwhelming magic'</p><p>T0:24 - 'HOLY SHIT HAVE TO DANCE  MORE VOLUME MORE BASS [Benassi Bros - Light :D]'</p><p>T0:24 - 'HADD [sic] TO WRITE, ALL CAPS EYE WIGGLES PROPEL [sic; I think I meant 'proper'--unintelligible] OEV EFFECTS [the aforementioned], RUNNING OUT OF NOTECARDS'</p><p>T0:28 - 'HAVE TO DANCE, MAKING EYES TWITCH CAUSES MORE OEV SHAKINGGG'</p><p>T0:29 - 'Effects die down with song's ending'</p><p>T0:29 - 'I feel awesome.'</p><p>T0:30 - 'WRITING EVERYTHING FEELS GOOD [quite an unswing as the next song started]'</p><p>T0:30 - 'JUST LETTING EYES TWITCH'</p><p>T0:30 - 'PUPILS BLOWN'</p><p>T0:31 - 'PEAK has ended suddenly definitely, forgot nicotine gum was in my mouth, all nicotine gone by now'</p><p>T0:31 - 'Peak ended.  Visual distortion w/ my eyes--movement is intriguing w/ the cards [I was shuffling the stack of notecards around on the desk]'</p><p>T0:32 - 'Feeling great... song ends, peak seems to end [I keep going on about it, eh?]'</p><p>T0:33 - 'Breaking back under my control [I couldn't feel my breathing nor my heart's beating for some time]'</p><p>T0:33 - 'Eye wiggles [much faster than with MDMA] subsiding - feel a little normal'</p><p>T0:34 - 'New song... constantly the long [?... no idea]... just brushed my hair for 2min straight--felt awesome--felt [unintelligible, but it was definitely great]'</p><p>T0:35 - 'Writing distorted because I'm inducing eye twitches--pencil roaming [running] out of lead, I think'</p><p>T0:35 - 'Starting to sweat or maybe now I can just feel it.  Everything still feels good but I am not incapacitated [my writing certainly was:  total jumble, unfortunately in cursive, which I never use.]'</p><p>T0:36 - 'Body still shaking, swaying, song ends'</p><p>T0:37 - 'Spatial distortion [not unlike a strong cannabis high]'</p><p>T0:38 - 'Just swaying back and forth, regain feeling that I should be doing homework. boo. [BOOOO!]'</p><p>T0:38 - 'Eye wiggles are good still [it was hard to measure when they were actually gone, but they definitely stopped at some point]'</p><p>T0:38 - 'Maybe a hint of nausea -- still not slowed down enough to write'</p><p>T0:39 - 'Writing returns to normal [it didn't -at all-, actually]'</p><p>T0:44 - 'Reading seems easier--interested in getting on IRC or a chatbox [IRC is always good, but I've never used a website chatbox in my life]'</p><p>T0:45 - 'Heart still racing [at this point I turned on Metronomy - Heart Rate Rapid :)]'</p><p>T0:49 - 'Stopped writing for a little while to brush my hair, lol, reading discussions is very interesting [on a drug forum], and Wiki edit wars!'</p><p>T0:55 - 'Less desire to write, can definitely write better [a little], finally going to get some work done [nope]'</p><p>T0:57 - 'Still a little terrible typing, eye wiggle subsided [could it be true this time?], pupils not so huge now'</p><p>T0:58 - 'Feeling any type of feeling or type of emotion is basically awesome [mind = blown]'</p><p>T1:00 - 'Brushing my hair [unintelligible]...what--lost my train of thought [totally unintelligible, but I remember writing it]'</p><p>T1:04 - 'Feeling good, haven't read in a while, think I'll try that [writing is decent at this point]'</p><p>T1:09 - 'Had/have nicotine gum but really craving cig now [I guess I didn't remember how long I'd had it in]'</p><p>T1:10 - 'Feeling pretty okay--I left the music off for some reason'</p><p>T1:16 - 'Time for a new piece of nicotine gum'</p><p>T1:20 - 'Still feel a little iffy, arms are light'</p><p>T1:20 - 'No real negative effects so far [so far :/]'</p><p>T1:21 - 'Still brushing hair on and off when not moving or typing, but I would keep doing it if I had another arm [lol]'</p><p>T1:25 - 'Music nowhere near as pleasurable as it was'</p><p>T1:33 - 'Still brushing hair'</p><p>T1:39 - 'Still brushing hair [yep...], feeling pretty normal'</p><p>T1:44 - 'Motion still slightly enhanced'</p><p>T1:55 - 'Dropped another with water [mistake...].  Pupils still a bit big--ran out of lead in mechanical pencal (couldn't spell pencil) [I actually wrote that in at the time with no redaction]'</p><p>T2:17 - 'Feel something going on--harder to measure/gauge changes in perception obviously'</p><p>T2:19 - 'Coming back up, eye wiggles persist, want [unintelligible--writing is getting worse than it was during the first peak]'</p><p>T2:19 - 'Coming up! light euphoria, eye motion'</p><p>T2:21 - '[Handwriting is abysmal from hereon] Body and jaw trembling--no desire for cigarette anymore--watching myself [unintelligible] gives eye giggles [sic], not sure why'</p><p>T2:21 - 'but it only happens when I write and m-[absolutely unintelligible for about two lines]'</p><p>T2:23 - '[unintelligible]'</p><p>T2:24 - 'Less jaw twitching'</p><p>T2:25 - 'Feeling lots of cold'</p><p>T2:26 - 'Licking lips - tastes awesome [...]'</p><p>T2:26 - 'Had to ... [something about nicotine gum... I can't read it at all]'</p><p>T2:28 - 'Coming on really strong'</p><p>T2:30 - 'Perhaps should have redosed earlier? [perhaps]'</p><p>T2:35 - 'Not too much there =/'</p><p>T2:49 - 'Feel good but not as far off baseline'</p><p>That's where the notes end.  Soon after, I insufflated the 100mg, and it was acutely painful initially; I definitely didn't want to do it again.  I did not notice a very strong effect, but at this point it was hard to gauge reactions because I began redosing orally every hour until I had only one left.  This stuff is extremely more-ish.  </p><p>III.  Drug Interactions</p><p>With Cocaine</p><p>-------</p><p>The cocaine I had, as I said, was quite heavily cut, and there wasn't an appreciable synergy between the two when I insufflated 30mg of the mixture during one of the (extremely weak) peaks of the subsequent doses--towards the end.  There was perhaps an enhancement of cocaine's time-slowing effect.  The mephedrone was so overpowering that I consider this a total loss of the money spent on that (albeit tiny) portion; it may have not been the case with stronger material or with a higher dose, but my nose was already quite sensitive because of the mephedrone.  It never bled, though.</p><p>With Nicotine</p><p>-------</p><p>Nicotine seemed to be a bit synergistic in terms of stimulation, and I did cheat once and have a Newport before I smoked a bowl of cannabis.  It was nice and buzzing for a couple of minutes, and it definitely quenched my desire for a cigarette for the rest of the night.  However, this could easily be attributable to the fact that I am in the process of quitting and don't have more than one or two cigarettes a day (and Newports are heavy hitters, especially compared to painfully slow-releasing gum).</p><p>With Cannabis </p><p>-------</p><p>Mid-grade cannabis was a pleasant and much-welcomed additive at the end of the night before I went to bed, as it usually is.  The spatial effects were very pronounced, and the sweating was controlled, which was nice.  There was significant audio distortion with anything that wasn't music, and time was highly slowed when listening to music.  Rather nice indeed.</p><p>IV.  The Bad News</p><p>Acute Negative Effects (Absolute First Dose)</p><p>-------</p><p>Profound feeling of cold; profuse, shrimpy-smelling (disgusting) sweating; very light nausea; headache.  Kind of like having an extremely mild fever.</p><p>Binging Effects/The Next Day</p><p>-------</p><p>I took approximately 1820mg over twelve hours.  This was incredibly stupid and irresponsible of me!  The only effect that carried on the entire night was the bubble-like hallucinations, and I was sweating the whole time; the clothes I was in and my bed sheet had to be washed because they had that odor.  Thankfully, I didn't have any trouble sleeping after I stopped taking it, nor did I dream/remember a dream (but that's typical).  I strongly caution against using the extreme amount I took as an indication of safety; I am generally very healthy, but I also tend to diminish the severity of less-than-enjoyable drug experiences for various (dumb and immature) reasons.</p><p>Of course, I had to take the last capsule.  Re-dosing the next evening on an empty stomach (I had eaten hours earlier) and on only a few hours of sleep led to an experience similar to the first time, but there was no bubbling, definitely more nausea, and it subsided very quickly.  Just as well, because by the peak I wanted it to end.  I chewed a vitamin pill in the hope that it would change something, but no.  Afterwards, I didn't feel good at all.  </p><p>The nausea rose as the drug subsided, and eventually I threw up multiple times--to the point where a foamy mix of protein and acid was coming out.  Each time I knew I was going to throw up again, but it was painfully slow to come.  The first time it happened, I opened my eyes and there was blood running out of my nose and into the sink, which scared the hell out of me. My senses were also uncomfortably heightened, and my balance was very off.  It was not unlike having a deep sinus infection:  in short, awful.  I should have thrown the last capsule away, but I wanted to see how my body would react.  Stupid.</p><p>Of course, I may not have had such a bad reaction if I hadn't binged the night before, but I can't say that for certain; it doesn't work like that with the friendly chemicals I usually partake of, even if I do it heavily, but I had a similar experience with my first two (and only two) recreational doses of DXM.  I did not insufflate any more of the cocaine that day before or after, and I felt that cannabis would make coming down worse in that case, though I had smoked a bowl hours earlier after eating.  The next day, I felt fine for the most part.  I was quite irritable for most of the morning, and I was totally aware of it yet couldn't keep myself from snapping.  Bleh.  There was also still some effect on my balance.</p><p>V.  Retrospective/Summary</p><p>The first dose was pleasurable, but overall I regret buying such a large quantity.  If there was magic here, I certainly lost it over the course of a couple of days.  Worryingly, it was much more acutely psychologically addicting than MDMA/MDMA adulterated with methamphetamine, Bk-MBDB and the various piperazine combinations I've had (though I will certainly place my satisfaction with this above that of those nasty pipes or of Bk-MBDB!).  Hell, I felt more like doing this the next day than I felt like getting to my cocaine, and that's even after having a bad experience.  This propensity for addiction has been echoed across the internet.  Fortunately, it doesn't seem to be anywhere near as physically addictive as methamphetamine.  </p><p>As of a week after the experience, I'm not interested at all in getting more (past the background desire of my generally addictive personality, but even that's weak towards this stuff), and I can't notice any withdrawal symptoms.  In fact, reflecting on some of the things I've written made my stomach churn.</p><p>Lastly, there is apparently VERY, VERY little information available about this particular research chemical.  Scouring the internet returned almost no real scientific information about it.  This is precisely reason I took the hours to write this report, so please keep what I've said in mind.  I really, really don't want to read about anymore of my brothers and sisters in the exploration of consciousness becoming ill or dying from this stupid drug.</p><p>PLUR</p>"
}
