{
 "title": "Birth & Death, Meaning Remembered",
 "author": "Bigme",
 "citation": "   Bigme. \"Birth & Death, Meaning Remembered: experience with Salvia divinorum (10x extract), Kava, H. B. Woodrose & Rivea Corymbrosa (ID 78751)\". Erowid.org. Oct 20, 2010. erowid.org/exp/78751",
 "substance": "Salvia divinorum (10x extract), Kava, H. B. Woodrose & Rivea Corymbrosa",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 Tbsp",
   "oral",
   "Kava",
   "(tea)",
   "  T+ 1:00",
   "1 seed",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   "  T+ 1:00",
   "1 seed",
   "oral",
   "H.B. Woodrose",
   "(seeds)",
   "  T+ 1:00",
   "3 seeds",
   "oral",
   "Turbina corymbosa",
   "(seeds)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 78751",
   "Male",
   " ",
   "Not Given",
   "Oct 20, 2010",
   "Views: 2846",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My background:</p><p>I have been into spiritual meditation since becoming aware of 'subtitle' phenomena when I was a child. Adults couldn't answer my questions or relate to my experiences so in elementary (grade) school I sought out information in the library on psychic experiences etc until I found some information that could even vaguely be related to what I would experience on occasion. That was about 30 years ago. Since that time I have dabbled in pranayama, path working, OBE, and the like.</p><p>In the last year I've tried HB woodrose, not long after loosing a lot I had accumulated over the years. After that awfully bad but good trip the insights I received opened me up to exploring further than woodrose. I've been into non psycho active herbs as long as I can remember. I learned herbalism while young first by contemplating the herbs in trance gaining understanding of their nature, confirming it after ingesting them in a subsequent trance, and later chemical and scientific follow up. I'm not new to mental experiences, I just learned some the 'hard' way. There definitely is a benefit to some training of the mind (currents) and emotions. It seems to make my mental vehicle 'lighter'.</p><p>I had 20x salvia in the past with absolutely no effect. The regular leaves I received from my brother were smoked over the course of about 2 months just reaching the gate/mental divide and energy needles in the heart chakra area. I believe the repeated light meditative/reflective use sensitized me to the plant.</p><p>Mindset:</p><p>I have been experiencing an inner push to have a 'reach' experience the past few weeks/month or so. The push was coming from a light experience (gateway) I had with regular dried salvia leaves my brother had given me. I knew I was supposed to have a harmonized experience to reach a place that was necessary for me in my growth.</p><p>I'm a vegetarian so I didn't have much to do in purification the day of. I stopped eating sometime around 3 or 4 pm (pasta salad around noon). In the 3/4 time period I had 8 oz of apple juice mixed with about 2 tablespoons of spirulina over ice and received through a straw (tastes better very cold). I also had about a hand full of sunflower seeds blended with purified water, vanilla, almond extract, and maple sugar. I wanted to time my beginning peak for 8ish since I knew my sitter would arrive around 7:30p.</p><p>Settings and further prep:</p><p>I didn't do as much house straightening as I should have and I recommend everyone to have a very clean house and sitting area. I find a controlled environment with things specifically chosen to be seen and experienced is ideal. I prefer a meditation room: Neutral colors and mostly empty. A view to the outside which can be shaded is nice too. </p><p>At 6pm I took the water soaked (20 minutes) preparation of Kava Kava after running through a filter. The Kava was powdered in a coffee grinder than mixed with pure water. I chewed the remaining grinds until my throat and tongue were too numb to continue then I spit it out. At 7 I took just 1 H.B. woodrose seed and a bit later 3 Rivea Corymbosa seeds (only chewing good with a swig of water). I am not on any medications and nothing else was in my system in the least. About 3 days prior I had 5 rivea seeds to stump a migraine in it's tracks (beautiful!). </p><p>Launch:</p><p>Some time after 8pm we retired to the living room from the kitchen. I put on some ambient meditative music took off my shoes and prepared myself for a position which was comfy on the couch. I did some light breathing exercises to center my thoughts and raise an emotive happiness in me. Affirming life and the fact that I was going to let go and let Salvia 'be' and run her course unobstructed. I put two pinches into the burn area of a 24' water bottle (no carb) and used a torch like extensions lighter to flame the tag (what I call the pouch of salvia for some reason).</p><p>One long draw engulfed and fully burned all of the salvia 10x to slag leaving a column of thick smoke in the channel just below my lips. I took two deep breaths through my nose and exhaled deeply preparing for the draw which would fill my lungs. I drew in and laid back on the couch and started to mentally count for the 30 seconds I was prepared to hold my breath. Somewhere at the 10 second mark time started to slow down and lose it's meaning but I was aware I was still holding. I saw my brothers face and smile then the music froze in time at the last note as if it was looped, constant steady tone. My brother who was over me looking down with a light smirk then split into layers like a stalled video stream (cascading) repeating at quick intervals as I floated down and time stream froze.</p><p>The first few 'moments' in eternity have not fully integrated into my consciousness. Either I am not lite enough or I chose not to let it back in. I just know I was in an infinite expanse out of time surrounded in light and part of a totality which was unformed. It was much more in it but words and consciousness seem to lack compatibility with expression of it here. It's a subjective thing only reachable in an altered state. </p><p>Upon coming forward from this entirety I had to get 'forward so I can get back'. I knew at this boundary what life is and who I was in it. I could see my birth and my death, the now and the then as one continues moment where my conscious was attempting to divide so it could understand what it always understood. The Bigme showing the smaller me. I knew that I knew, that I had been here Many Many times before exactly here. Trying to wake myself up, submerging myself into life only to forget and having to do it over again. Not another life, this life, this one. I knew every moment of my life, all possibilities and the vein that I had chosen and lived/was living. It was a paradox of predetermined destiny and a multi verse of having chose and 'pushed through'ing of my consciousness at various times over life. I became aware of a state of being. I was disembodied. I could see all eventualities. </p><p>I felt the disappointment of not being able to 'remember' and act 'in' life, the life of the physical or 'integrated' life. The word Remember is the key in life and death. It has deep meaning for continuity. Not remembering is destructive and hellish in the memes we use. I recognized that we were still evolving and at an evolutionary nexus in consciousness. Our memes are keeping us from experiencing and moving into it. The memes of stone & bronze age apes. Just strange acting apes who believe the self deluded and affirming ape thought(s) that the way they/we do things is somehow special because it's the way we do it.</p><p>Because monkeys (and other creatures) do not speak or do human their rate or value is based on how like a human a creature can act...how its 'powers' can resemble ours or not. It's a confused and deluded arrogance moving among us like a mental virus. Human nature is the same as the nature of anything else in existence. It's simply 'to be', everything else is malleable and subject to change in accordance to memory & remembering (genetic, species, conscious, etc). Most of the things we hold dear on a deeper level are valueless in the scheme of things and in our personal schemes. The bigger self that comes forth by night knows this since it is its essence but we choose to forget and ignore it. Our night time is equally as important as our day. They must reach harmony. Scarcity for profit is our stone age apish problem. The way we have organized our societies=moot. The concept of religion=moot. All of it=moot. We must REMEMBER. It is the most important of all things.</p><p>Evil is because we choose to forget. Every morning we choose to forget, all of our lives we choose to forget. Our genetic code is a form of physical memory, it remembers (literally) in the creation of the physical us. Waking life is a form of sleeping where we keep hitting snooze on the alarm and trying to silence it and we end up SLEEPING through LIFE! Dreams are the argument of consciousness (Bigme) pushing into life (discrete life) and Little me (discrete life) pushing back. It is a war of meaning, needing, and forgetting on it's lowest level. We have been sleeping into life and dreaming into consciousness! Denial, rebellion, fear, and mental abuse by the other sleepers by day confuse and confound us all the more. This war of sleeping and waking in brains with a certain chemical makeup and 'consciousness force' is the source of schizophrenia and its related 'disorders'. These brains are shamanistic but crippled by memes and socialization. They can't integrate and can't shut down the night self. It's so much more. </p><p>I was able to integrate/become my sitter/brother and I saw his life and who he was in his totality. I saw me through his eyes as a sum from birth to death. 'Bighe' let me know what not to look at or share back. I could see all but agreed to shade a portion from little me. I saw the life of my children, my ex wife, my wife to be all with equal detail. I knew my wife to be found me 'by night' and why. I explored many other things and concepts and I re approached the 'by day' boundary because I had an urgency to do what I was supposed to do and to teach others (and myself) to let go and remember, and live awake. There is a seed in my words and a gentle but increasing whisper to wake and arise by day that I send for all of us. 'Coming forth by day & night' actually takes on true meaning for those that know. Sometimes words will awake a sleeper who is ready to hear for others it is just profane and will serve to puff up their stone age ape minds with fluff and weight. All have been called to remember but few have chosen to remember. Intent is important, it is a tool by which you shape your consciousness and prepare your way back from both sides.</p><p>I then approached the boundary through which I experience everyday life and body. On the sides there is an infinity up, down, right, left, and after a distance behind me albeit somehow filtered/blocked against non remembering heavy consciousness. In front of me I found myself beginning to push my mind into the forward boundary (like sticking your face into a wall of water) and part of my mind (a corner angle) was in my body and part was at the expanse of this space across time. The entry was behind my eyes somehow. There is an angular relationship to consciousness and integration. 'We travel by angles', 'We go forward just to get back and do it over again' was a subtext that permeated my mind (it was a frustration in the latter).</p><p>Some songs passed through my mind that let me know the writers big self was trying to push through but the little self wrote the words. I could here the correct lyrics as reality divided down again back to the point of initiation. I could see the source of the songs, the alphabet soupishness of consciousness and ideas we all access. I could feel my entire life still as one experience but I was now pushing through into the now I had started from (apparently I was also saying to my brother in mumble) I have to get back to the start. I new what had happened and was going to happen. I was trapped partly in the time continuum (oneness of time) and piercing into it at a point. That boundary could be seen as an infinitely large 'bubble' and I was poking into it creating a point in. I seem to have been above the forth dimension since time at first was an option and space existed within it. (in one conceptualization time is the surface of the bubble/boundary).</p><p>It was truly disconcerting knowing what was happening next, the future was still laid out like cards. My brother would start to speak and I would put my hand on his shoulder and say I know attempting to stop him. Of course he would continue and say what he didn't know I already knew. I saw the future still as one experience but it was dividing down closer to my point of entry. There was some sort of time dilation still. I wanted to be back. I wanted to return to the world of the woman that I loved so dearly, more than I had known since our times intersect and connect at great need and purpose. I needed to 'do' life/wake correctly.</p><p>On my brothers side he just wanted me to sit down or be careful. I had tossed the heavy glass and solid wood coffee table to the side of the sofa out of my way like it was a feather (unknown to me) and grabbed him by his throat (proximity to hand) when he tried to subdue me, I was intent on a walk about. His familiarity and identity in this world were enough that I didn't harm him or myself as we found ourselves going up the stairs as he was trying to figure out what I wanted and what I was attempting to do. (I was just attempting to become me again but movement apparently is a reflex of reintegration lacking the dream state 'freeze' the body exercises at night).</p><p>It seems as I was pushing into reality and wrapping myself in my body and 'little me' mind, the push and reach was similar to coming up from under water when you need to breath. You burst out above the surface and inhaling is the move about equivalent (thrashing in the water thus walking about aimless). Now that I'm familiar I think I might be able to control it with intent before hand.</p><p>Over the course of the next 40 minutes to an hour I gained more and more reintegration with my body. My 'cap' (top and back of my head) was still totally off and my consciousness expanded. Slowly it has wrapped into the body but writing here at 2:30pm the next day I am still open and much higher functioning in thought and understanding than baseline. I'm still aware of the subtle within and around me and can pop in/out and just below wake/baseline at will. While walking back and forth gaining a present sense of time after reintegration, during the next 2 hours the magnitude of what I was/had experienced was sinking in (apparently 11ish 3 hours from start).</p><p>'I NEVER KNEW' (little me). 'Nothing is the same to me anymore'. 'This is MAJOR'. 'Life isn't what we/I think/though it is/was'. 'NOTHING is as how we have been taught to believe'. 'Sex, Male/Female, time, importance, religion, god, nothing'. Most concepts and practices in life are so far from anything 'real' that they carry no conceptual relationship to what actually 'IS' or is needed. They just don't compute. Literally it's like 'adding your fingerprints to the alphabet so that you can use your calculator better to put on lipstick'. </p><p>There was no way of preparing myself for this trip. I experienced a synergy here far passed the dose of anything I had ingested and for far longer than either had every functioned seperately. I'm still under the light influence of a connected reality as I write. Folding the meaning into my reality has taken all of the night and part of today. I'm sure I will be discovering understandings in this for some time to come. The amount of what I experienced vs the time lacks quantification. I don't want to write then edit a book (at least at this time) but I could speak and write volumes. In normal little me 'conscious sleep' I write, spell, and punctuate well. That is presently unavailable so please forgive me. I needed to write now and not later. I'll write more later.</p><p>Dahm (keeper of the Date Palm).</p>"
}
