{
 "title": "Less the Substance, More the Technique",
 "author": "The Spivey",
 "citation": "Citation:   The Spivey. \"Less the Substance, More the Technique: experience with Oxygen (ID 7879)\". Erowid.org. Jul 5, 2001. erowid.org/exp/7879",
 "substance": "Oxygen",
 "bodyweight": "212 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "inhaled",
   "Oxygen",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7879",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 5, 2001",
   "Views: 33232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI went to the new Oxygen Bar in the Broadway Market in Seattle's Capitol Hill district. I bought, for $2, a reusable nasal cannula, which was then hooked up by clear surgical tubing to the oxygen machine. I settled back in a reclining massage chair (left the rolling massage things turned off, so it was just a comfortable chair). I was able to pick either plain oxygen, or gas that was bubbled through one of several 'aromtherapy' scents. I chose the plain oxygen. I settled back and began, at the advice of the staffer, breathing slowly in through the nose and out through the mouth. \r\nI did notice a sense of relaxation after a few minutes, accompanied by a sense of detachment from the surrounding mall. The queue of people waiting to see a movie seemed distant, and I became aware of the acoustics of the environment. The 15 minutes passed quickly, and I headed out. \r\nA day later, I decided to return to the mall to try something out. I went to the side of the floor opposite the Oxygen Bar, sat in one of the mall's plastic chairs, and spent 15 minutes doing nothing but breathing slowly. I got the same effects noticed the day before. Generally, my verdict is that any sense of relaxation and hyperawareness I gained was due the the fact that I rarely spend 15 minutes just breathing -- pure oxygen or regular air -- and the dollar-a-minute stuff didn't seem to offer anything I couldn't get from the free stuff.\n\n\n"
}