{
 "title": "5-MeO-DMT Warning",
 "author": "A.S., CA",
 "citation": "   A.S., CA. \"5-MeO-DMT Warning: experience with 5-MeO-DMT (ID 78870)\". Erowid.org. Jun 8, 2009. erowid.org/exp/78870",
 "substance": "5-MeO-DMT",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 78870",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 8, 2009",
   "Views: 23690",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nCitation: A.S., CA. '5-MeO-DMT Warning'. The Entheogen Review. Winter Solstice 1999;8(4):136-7.</p><p>I know someone who had a severe and prolonged response to a vaporized 20 mg dose of 5-MeO-DMT. This person had done all the usual entheogenic substances for some years and was careful and intelligent. She had done her research and when offered this dose by a good friend, she agreed to do it but questioned the amount, as she felt that it should be 5-10 mg. Her friend assured her that he had done it, and others too, many times without problem.</p><p>Immediately on ingesting, she became unconscious for half-an-hour, then came 'round groggy and remembering nothing. The sitter encouraged her to walk and eat something, however this was difficult for her. From that time on she experienced difficulty in sleeping, fear upon closing her eyes, and three nights later awoke at 3:30 am in the grip of a very severe, intense, and frightening panic attack. These attacks continued nightly, with nausea, vertigo, and heart palpitations during the day. Ativan® (lorazepam) was prescribed and later Klonopin® (clonazepam). Her doctor did a full check and said that her blood pressure was elevated, but that she had no apparent physical problems.</p><p>Her symptoms persisted for eight weeks. Normally this person has slight, intermittent asthmatic symptoms around cats and mold. On coming 'round from the 5-MeO-DMT overdose, and for the eight weeks following it, she experienced breathing difficulties that usually occurred at night and when having panic attacks. This person is not unduly sensitive, was taking no medications, and had not eaten or drunk anything untoward. In fact, she had fasted the day before. Acupuncture was useful in the latter part of the eight weeks, but the Klonopin® was essential in controlling the symptoms.</p><p>I have read many things about this material and even spoke with Charles Grob, who I know. No one had heard of such a prolonged reaction (until now) and it occurred to me that The Entheogen Review might like to let readers know that great care should be taken with the dosage of 5-MeO-DMT. Dr. Grob did say that if the blood pressure goes up too much during the session, it could precipitate a stroke. My friend was a very healthy woman of 59. I do hope this may be of help to others; information and warnings should be made available, and I feel that this is a volatile and unpredictable material. -- A.S., CA\rPeople do seem to have quite varied reactions to 5-MeO-DMT, from mild to severe, but this is the first time that we have heard of after-effects lasting for eight weeks. When trying any new compound it is advisable to start with a low dose, and gradually work one's way up. In the case of very potent materials, such as 5-MeO-DMT, great care must be taken to make sure that the dose is accurately weighed, and this can be difficult if one doesn't own a scale that weighs with a 1-2 mg accuracy. 20 mg would definitely be an overdose for most people, and we agree that it is important to report the situation that you described as a warning to others to be extremely careful with dosing.\rRead the 2009 update to this report...</p>"
}
