{
 "title": "The Psychoactive They Cannot Deny",
 "author": "Psi Locybe",
 "citation": "   Psi Locybe. \"The Psychoactive They Cannot Deny: experience with Oxygen (filtered atmosphere mixture) (ID 7889)\". Erowid.org. Sep 23, 2003. erowid.org/exp/7889",
 "substance": "Oxygen (filtered atmosphere mixture)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Oxygen",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7889",
   "Not Specified",
   " ",
   "Not Given",
   "Sep 23, 2003",
   "Views: 31751",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is in response to the 'Ask Erowid' solicitation on Oxygen.  During my incarceration, I resorted to atmosphere abuse in a desperate attempt to relieve the mind-abusing boredom of spending ~23.5 hours a day in a 10x9x7 featureless beige box.</p><p>The technique was simple, really.  O2->CO2 is a reaction at a constant rate determined by metabolism (C6H12O6 +  6 O2 -> 6 CO2 + 6 H2O).  Thusly, by constantly moving the greatest possible volume at the highest possible rate with my lungs, CO2 (itself psychoactive - try huffing a freshly-empty 2 liter sometime) would be minimized, thusly preventing annoying sensations of suffocation, while blood-oxygen levels would climb higher, and higher. Most people call this 'hyperventilation.'</p><p>It takes a bit of effort, however.</p><p>After a signifigant amount of rapid deep breathing, a mildly relaxed, calm state occurs.  If in a jail/prison environment, keep plenty of water around - they overcondition the air in an attempt to further isolate the incarcerated from the outside world (organic volatiles in the air might just let someone feel connected to that which has been ordained in nature, after all...)   After about 5-10 minutes of this, some of the most mind-blowing 'highs' are possible, blowing nitrous (and just about anything) completely out of the water... as far as intoxicatory potential goes.  Didn't really help me connect with the sacred, but then again, the LSA which had been absorbing through my skin rash throughout the incarceration only brought the revelation that my incarceration hurt so much because I actually believed in the American ideals... teach me to be a patriot... so it could just be a matter of set/setting...</p><p>The most profound experience occurred right as they opened the doors so that we could stand in line for 'dinner' (what was said earlier about nature being banished from the air in punishment goes also for the food)  I stopped breathing so deeply as the doors unlocked, right as I began to climb over the peak.  I had a thought... a thought I could not understand.  As the peak subsided, a moment later, I was struck with the realization that my most successful strategy of understanding the experience/thought I had just had would be to let it go... there was no hope of understanding.  (spent my time in line staggering dazedly).</p><p>Though not of the highest value, compared to such soul-openers as LSx, Dimethyltryptahol (psilocin), and the hempen-flower, to name a few, when one is undergoing the torture of forced denial of neuroplasticity via absence of stimuli variance, it can save a few brain cells.  Negative side effects were primarily limited, with overabuse, to an extreme tingling/burning in the extremities, probably related to cellular damage, and possibly mitigable with antioxidants/free radical scavangers.  It also seems to potentiate for quite some time afterwards the effects of LSA.</p><p>  All and all, CO2 will always remain my recreational inhalant, due to its ease of manufacture and high safety (it makes you need to breathe), but locked within a hell realm (school/jail/etc), oxygen is nothing to sneeze at... and something they can never take away.</p>"
}
