{
 "title": "Chewing Dried  Leaves",
 "author": "Noel",
 "citation": "Citation:   Noel. \"Chewing Dried  Leaves: experience with Salvia divinorum & Cannabis (ID 78907)\". Erowid.org. Aug 17, 2011. erowid.org/exp/78907",
 "substance": "Salvia divinorum & Cannabis",
 "bodyweight": "176 lb",
 "header": [
  [
   "DOSE:",
   "15 leaves",
   "sublingual",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 78907",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 17, 2011",
   "Views: 9043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis report is meant to contribute to the not so extensive body of reports available on the effects of chewing (the traditional Mazatec method) dried Salvia leaves. Below are brief notes of two attempts so far, taken briefly after the effects start to wear off (approximately 1 hour after ingestion).\r\nFirst attempt\r\n- dosage: rehydrated 10 dried leaves of medium size, squeezed the water out, made them into a ball and put all under tongue, chewed and held under tonque repeatedly for about 15 min, then spit out; a small puff of white widow just before starting chewing; beware at first taste is bitter, but later even enjoyable\r\n-  setting: darkened room, daylight outside, lying down, eyes closed\r\n- T+20 min: aware of awareness without any form and outer world is nothing but an aspect of this awareness\r\n- inner world and outer world is one whole, just like in a state of dreaming, but this time awake, conscious and in control\r\n- detachment from body, awareness is everything and is free\r\n- when tranquility settles in the other perspective is revealed, the outer world is an aspect of the inner and they are one\r\nSecond attempt\r\n- dosage: rehydrated 15 dried leaves of medium size, squeezed the water out, made them into a ball and put all under tongue, chewed and held under tonque repeatedly for about 15 min, then spit out; a small puff of white widow just before starting chewing; beware at first taste is bitter, but later even enjoyable\r\n-  setting: darkened room, daylight outside, lying down, eyes closed\r\n- experiencing being/ existing in another state, conscious, yet different and other\r\n- gravity seems not be present here\r\n- as if the center of everything is in your head, somewhere where the pineal gland is supposed to be; feeling of emptiness and freedom\r\n- there are no concepts, but laws there are, but different\r\n- resembles the moment you are waking in the morning- a pleasant instant of unawareness of what or who you are, and yet conscious enough to perceive the way you are, but this time it is a lasting perception\r\n- me = awareness is capable of doing anything and going any where; infinity of space, lack of desires and blissful, but in a different way\r\n- don't want to and actually is quite unpleasant to move my body; lack of coordinates, no up or down, no directions, at will they can come, but will and desires disrupt the harmony\r\n- feel centered and limitless, nothing filled with everything, but no-I, it is free, knowing of relaxation and regeneration\r\n- unpleasant to move, as if the way the plant is feeling, but super conscious\r\n- no up, nor down, no concepts, but meditative tranquility and infinity; tranquility leads to this other perception, there between the two dreams ( of sleep and consensual reality); the mind is awake and limitless, has not yet taken a form, has no feeling of I-separateness and ego-density\r\n- state of non-dreaming, but awake, awake in a different way, where reality and state of things is different\r\n- feels like the light infinity and undefiness of when you just wake and your mind has not taken yet the forms that make up the 'normal' you\r\n- as a whole indescribable, different; there was a message and a feeling that all this is me and it is up to me weather there is harmony, peace and tranquility\r\n- controlled and disciplined tranquility\r\n- body feels distant; all around feeling of limitlessness (you can call it infinity as well)\r\n- sounds coming from outside sound distant; feeling of being in two dimensions/ states in the same time\r\n- need of being static, leads to stillness, centering, loss of coordinates and concepts; infinite, conscious, awake, greatly relaxed\r\n- need of silence and darkness, and lack of sensory distractions, in order the mind to shift into this other dimension, half still here, but can go further where awareness of this dimension (everyday reality) will be lost\r\n- at the treshhold of perceiving visuals and sounds, but faint (I suppose a few more leaves would be necessary) \r\n- at some time start flowing movements with my hands, but not comimg from me, smooth and beautiful, have the feeling i am almost seeing my hands through the closed eyelids\r\n- epxectations, desires and fears can only disrupt the condition, it is pure, harmonic and without a form \r\n- like a Buddha, blissful and boundless\r\n- sexual arousal, feeling of my penis, but distant, feels like a separate part, gratifying feels ecstatic, but somewhat alien and distant; being conveyed a message of learning to enjoy and not feeling guilty or restricted, let go fully and come one with bliss\r\n- a different state of awake-being, it is difficult to stress how different, just different; clarity of consciousness is thereby enhanced\r\n- vital and energetic afterwords\r\nIn conclusion, I would like to say that for me (and the people with a thousands of years relationship with the plant) sublingual administration (i.e. chewing) is by far the more preferred method of administration. Compared to smoking, the effects of chewing unravel slower, and are more lasting, give the opportunity to explore in depth, and chance of panic is minimized. It is definitely a wonder plant , a 'repository of vegetable gnosis', and a true door to other dimensions. So far with Salvia I have had no visuals or other-worldly encounters, but I am confident it has given me a live-fulfilling opportunity of peeking into a multi-dimesnional Universe and further explorations are soon to come.\n\n\n"
}