{
 "title": "All of the Universe Inside of Me!!!",
 "author": "Dr. Imma Boomer D.M.",
 "citation": "   Dr. Imma Boomer D.M.. \"All of the Universe Inside of Me!!!: experience with Salvia divinorum (5x extract) (ID 7906)\". Erowid.org. Dec 2, 2003. erowid.org/exp/7906",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   "  T+ 0:25",
   "4 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7906",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 2, 2003",
   "Views: 4368",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have just recently begun my studies and research with some of the semi-newly available sacremental agents  of the mind and spirit. I have been well versed in classical entheogens such as psilocybin, LSD, and MDMA. Seeing I had read about these powerful experiences with Salvia I opted to experience her first before delving into the land of DMT and other such shamanic agents. <br>So here I was just receiving my extract in the mail, and ready to journey. I was alone, and it was daytime. This was my very first time. <br>I packed my pipe with about 1/3 gram of 5X extract. I turned on some didjeriedoo music. I said a prayer, asked for a blessing from god, bowed my head in silence for a moment and then proceeded. I hit my pipe hard 4 times. Each time holding the smoke for as long as possible. <br>After the fourth hit I gracefully set down my pipe and laid down on the floor and closed my eyes.  Within about 5 seconds of lying down I began to laugh immensely and uncontrollably and with unified absolute insanity.  Suddenly I was seeing what looked like diamond shaped street signs, swirling in every imaginable color. and some that I had never seen. Then she took hold of me. I stepped through or projected through this field of diamonds. I was seeing my body folding up into little pieces yet I felt as if I was extending to the farthest reaches of our universe. And the universe in its entirety became my body.  I then found myself in this soft, shiny, glazed, plushylike toyland of sorts that felt like my home.  There were other entities who had expected me and the sense of a female presence that was watching over us as we all played and laughed and giggled with tickle in this beautiful land of Plush.  I felt I had been there before yet had long forgotten about it.  There were fairies, and intensly, carefully constructed tactile roller coaster type rides that had this organic unjulating nature. <br>I then saw myself project back into this world we normally see. I realized that I had to urinate and sat up. I looked at the ground where I was lying and saw myself. It was most bizzare as I was half in and half out of my body. I then without thinking of it oddly asked my body if was coming along because I had to pee. So I reached down with my arm and lifted my body up into the sitting position and my spirit and my body then merged back as one. I laid right back down and then the same thing happened again. I felt at this time like I was puppeting my body around and realized that I am merely the agent of this body. I proceeded through a semi-world of fractals, diamonds  and rainbow worm holes and found the toilet. I sat down. I urinated and this was most interesting. Not like acid and not like mushrooms. I felt myself travel down my rainbow urine stream and into the toilet. There was no discernable separation. I was not wet or feeling dirty by anymeans. In the toilet and within the swirling urine I played again with new entities and they as well as the others knew me and knew that I was coming and were glad to welcome me. <br>At this point I realized I had no idea of who I was/am. Although the last say 25 minutes or so I had been in that same reality and just realized it. At the moment of realization of this. I found myself back in my body and slumped over on the toilet, drooling on the floor, and intensely warm. Wow and Whoa!!. I thought. I was just in the toilet playing!!!! I then proceeded back to my place on the floor and repeated the session. <br>Second round was nothing that any language can explain in the slightest. Yet I will try to expound on it the best I can. So after 4 more hits. I lay in a place of no time, no words, no sounds and, basically nothing at all. and my body was folding into smaller and smaller formations. I feel this was the TAO.  So I thought. Next thing I remember was being surrounded by an uncountable plethera of rainbow wormholes. Every direction my minds eye looked. I saw only these wormholes. Pulling at me with intense force. I heard a woman say softly and gently. Who would you like to be? Which path is it that you would like to take? I replied with uncertainty and asked if I could just stay where I was. That is fine she said but why? I had no answer to this simple but most perplexing question and sat within silence as she read my thoughts, then proceeded to tell me things about myself that noone would ever know. Even things that I had long since forgotten. <br>The next part is hazy but recollected and pronounced as follows. I then unwillingly or unconsciously with no sense of self split into trillions of pieces and each piece got sucked down one of the rainbow wormholes. I feel as if I experienced being everyone who ever was, is, or will be. All at once and for about a second or two. But living fully and completely each individual life. Only to find each individual piece of myself travelling back to center of it all through the wormholes. Which then all pieces re-assimilated as my body and my own self and I woke up again to find myself here. Sitting in lotus position.  Calm and peaceful and wishing I had stayed inside all of you. <br>Other experiences will be documented as I explore the wonderful world of Love and Sub-Dimensional realities that My mother has shown me. God blessed this plant, and you should respect it accordingly. A sitter is highly suggested. <br>Rev. Dr. Imma Boomer.  Doctor of Metaphysical Science.\n\n\n"
}
