{
 "title": "A Night of Pure Insanity",
 "author": "Jeffreyd",
 "citation": "   Jeffreyd. \"A Night of Pure Insanity: experience with Mushrooms - P. cubenesis (Amazonian strain) (ID 7911)\". Erowid.org. Dec 2, 2003. erowid.org/exp/7911",
 "substance": "Mushrooms - P. cubenesis (Amazonian strain)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 7911",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 2, 2003",
   "Views: 9148",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After a successful first time shrooming with 5 of my best friends last week, we decided to do it again. But this time we were going to up the dose to 2.5- 3.0 grams of fresh dried amazonians. Also we went down to my school apt. and had the perfect setting. We all thought it would be perfect. Well 7:00pm with 2 hours of daylight we all at scarfed them down. Before we even finished eating the shrooms we started to feel a body buzz come on. I swear 4 out of 5 of us were getting dizzy and tingly in the back of out necks less than 5 minutes eating them. That was the first sign of 'damn these things are gonna kick out butt'. Everything was going great, we went for a walk down this trail in the woods near by, was very fun. Then we went back to our apt. and sat and listened to some mellow music. </p><p>Then it happened. It went from pure fun to pure hell. First of all I have shroomed 3 times before. I was still with it mentally. Next thing I know my friend was lying on the couch, his eyes shuttering.. asking everyone if he is going to die! Non-stop he's yelling 'I'm gonna die!!' for over an hour, first it was funny, then we all tried to calm him down, but it didnt work! We were so scared.. we didnt know what to do. Then he would get up and ram his head into the wall and started destroying things... we were so close to taking him to the emergency room, but we all knew there was no way he could die.. Soon he lost control of his bladder peeing in his pants. He was on no medications, and has done many drugs before including LSD. I didn't understand. </p><p>Then my other friend started freaking out causing a chain reaction. He thought he was 3 different people. He seriously meant it, you could see the rage in his eyes. He threatened to kill himself! Then I almost lost it. I have a very strong mental mind and it takes alot to pull me out of reality to a point were I don't know where baseline is. I started to lose every aspect of who I was as a person. I had a complete ego death, and I've never felt so alone in my life. I was trying to get a hold on any little piece of reality I could. Soon as the 6 hour mark hit, I started to come down. What a relief. Slowly everyone came back and things returned to normal. But I will say I have NEVER, EVER been so scared in my life! </p><p>If I ever do shrooms again, I have new respect for all of my friends and myself. I know I have been mentally changed from this experience. Even if you think everything is perfect. It can all go to hell very fast. I feel shrooms are the most powerful mind altering drug there is. I also know that some can be EXTREMELY potent. No question there. It is the day after and I have broke down several times in tears, looking back on that night. Be careful and please don't take these things for granted. </p><p>Peace</p>"
}
