{
 "title": "Growing Up On Antidepressants...",
 "author": "Bo",
 "citation": "   Bo. \"Growing Up On Antidepressants...: experience with Fluoxetine (Prozac)  (ID 79150)\". Erowid.org. Dec 26, 2009. erowid.org/exp/79150",
 "substance": "Fluoxetine (Prozac) ",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Pharms - Fluoxetine",
   "(capsule)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 79150",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 26, 2009",
   "Views: 19096",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before I start I just want to say that I was always an outgoing, extroverted kid. I was always nice to everyone and always had many close relationships with friends. I loved life as a kid. With that being said, here’s my story.</p><p>When I was 13 my parents got divorced. I wasn’t upset about it, but my siblings both went off to college the same year, I just hit puberty so I got a little emotional, and my whole life changed completely so I was a little sad about my situation. So my mom forced me to a psychiatrist who instantly prescribed me Prozac to take each day because I said I was a little “sad.” But there’s a BIG difference between being sad and being clinically depressed. I was against it, as I knew I didn’t need some foreign drug to help me. But my mom screamed at me over and over until I took it because a real “doctor” told her I needed it, and she just wanted to help me. So I started taking it to get my mom off my back. I had no clue what that little blue capsule was for, I was just following my moms “parenting.”</p><p>So at this time I’m in 8th grade and I had just hit puberty. I really had no self-awareness that we have as adults, so any effect that this drug had on my mood was clearly unnoticed by me; I was just going through life. After a few months, I started to become emotionally numb. It also made me anxious, insecure, and tired all at the same time. My over-dramatic mom would argue with me and I would have very violent outbursts, often slamming doors and punching walls. Again I had no clue this was from the Prozac, it was just how I felt so I kept taking it. My mom thought it was just my rebellious nature so she took me back to the psych and he increased my dosage because I wasn't improving.</p><p>By the time I’m 15 I had been on the medicine for 2 years now. The sex drive that I once had at 12-13 from hitting puberty is now gone. At this point I’m so confused about life and who I am that I’m just gliding through life like a zombie. My mom thinks my “depression” isn’t improving so she keeps me on the medicine and by this point taking the medicine is 2nd nature so I just take it every day. The fights my mom and I have are worse now. Im breaking things in the house and constantly yelling back at my mom. I completely fail my freshman year of high school and have no motivation for anything. I still have no clue this is from the Prozac, as my mom and the doctor insist I “need” it. My heart, emotions, and natural personality are slowly starting to fade.</p><p>So by the time I’m 17 I’m still on Prozac cause my mom sees such a great decrease in my character in me over the past few years, so she assumes that there’s no way I can go without Prozac. I’m in 11th grade by this point and my sex drive is completely gone, I have no personality, and I’ve been kicked out of 2 high schools. My emotion is gone, so I’m basically a vegetable by this point, almost to the level of legal insanity. My insecurity gets so bad that I have trouble going to class. When I’m around class mates I get so nervous and constantly worry about what other people think of me after I say something, to an extreme I’ve never ever experienced before. The only thing that calms my anxiety and makes me feel better from these horrible side effects is marijuana, so I’m smoking massive amounts of marijuana at this point. </p><p>By the end of my senior year I’m 18 and have been on the Prozac for 5 years, all because my mom kept refilling the prescription over and over saying I “need” it. I have been kicked out of 3 schools by this point, all for smoking marijuana. In a way, I was only self medicating with the marijuana because it was the only thing that helped me cope with my Prozac-induced anxiety. At this point my social anxiety gets so bad from the Prozac that everyone around me starts to notice. I can’t even have a strong conversation with someone because my brain has been so altered from this medicine. I have no self awareness on anything and the only thing I know is this feeling. So by the time I barely graduate at 18 I am basically a nothing person. I don’t know how to socialize, have zero sex drive, and just have overall no emotion or confidence in anything. This is quite close to insanity in my opinion. </p><p>I finally go off the medicine at 18 and I have no clue about anything your supposed to learn as an adolescent like basic life skills and social skills. I was in a cloud of “nothingness” all those years. The doctor never explained anything about Prozac to me and my mom kept giving it to me with such great energy so I just kept taking it. It’s a very sneaky drug, it makes you feel completely different but it feels natural. That’s why people kill themselves on it: because they don’t realize it’s the drug making them feel that way, its just how they feel. </p><p>From age 18-21 I literally had no clue who I was. I had no friends and really didn’t know how to do anything. And the only thing that made me feel normal was illegal drugs or more anti depressants… I feel my brain had almost chemically become a drug addict… One more thing: Prozac also stunted my pubertal growth. I didn’t grow one inch during puberty while on Prozac, so I am basically stuck in a 13 year olds body. My whole family is tall, except for me. I can’t prove this but studies are just now coming out saying it stunts growth in children and it all makes sense why I didn’t grow.</p><p>So now I’m 21 and I’m just now starting to get my sex drive back along with some emotion. I have major difficulty socializing and holding a job. And the worst part about this whole experience is I didn’t realize that ANY of this was going on until about a few months ago. I was just going through high school regardless of how I felt. I didn’t know anything about fluoxetine and how it affected my mood/behavior so I just took it everyday as prescribed. These antidepressants really mess with your head way worse than 99% of all illegal drugs. With drugs like LSD and marijuana, I only have experiences that enhance my life and the lives of others. But with SSRI’s, they do something different. They change who you are. Some people need these meds, but if you don’t need them and you take them they will probably screw you up.</p><p>The best way for me to explain my situation is the snowball effect. Before I went on antidepressants, my life issues were a small snowball. When I was put on the meds, my issues/the snowball started going downhill and the snowball/my issues only got bigger. The longer I was on the meds the bigger my issues got. By the time I got to the bottom of the hill, which is the end of my pubety at 18, I am stuck with a massive snowball of mental issues that might take years to recover from.</p>"
}
