{
 "title": "Am I An Alcoholic?",
 "author": "skankyskeezer",
 "citation": "   skankyskeezer. \"Am I An Alcoholic?: experience with Alcohol & Cannabis (ID 7920)\". Erowid.org. Aug 13, 2003. erowid.org/exp/7920",
 "substance": "Alcohol & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "  repeated",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 7920",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Aug 13, 2003",
   "Views: 11404",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My boyfriend had just returned from visiting his folks in NC, and we were going through some troubles. Mostly my fault. Never ask too many details about previous sex partners/practices. Just make sure there's no disease and forget it.</p><p>So I arrived at his place. He had wine, dinner, candles...all that. We were having fun just talking. After awhile the wine was gone. So we popped open another bottle. Then that was gone, so we hit the peach schnappes and had two or three fuzzy navels. Then we smoked some weed. </p><p>Then he told me, when I called his previous sex partner (a friend with benefits sort of situation) a squat whore resembling a hobbit, that he didn't agree with my viewpoint. Instead of stopping there he told me she was the most beautiful women he'd ever seen naked. EVER! This of course upset me. He told me I *was* attractive, but basically I wasn't all that, to paraphrase. Due to my then five or ten extra pounds (all in the gut).</p><p>So I did what any 22 year old woman would do. I yelled at him and then did about six to seven shots of Vodka in a row while he was in the bathroom. My goal was death. Earlier that year (or the one before) a nineteen year old kid had died when some sailor dared him to drink an entire bottle of Vodka.</p><p>The rest of the night is basically gone. I guess the term is blackout. I was awake, interacting, talking, and moving about. But I don't think I knew it. I then related to him something that had never happened to me. He later says I was in tears. Something about a Sunday school teacher trying to get it on with me.</p><p>I then did many sexual things that I wouldn't normally partake in. But I remembered none of it. He could of made the whole thing up, and I wouldn't know the difference. Its just things he described meshed with things I thought had been a dream. And oh ya, I also pissed all over myself in my little drug induced coma. I'll never drink an entire bottle of wine, three fuzzy navels, did I mention the screwdrivers?, and six shots of vodka in a six hour period ever again.</p>"
}
