{
 "title": "Foxy Load",
 "author": "Codhbk3",
 "citation": "   Codhbk3. \"Foxy Load: experience with 5-MeO-DiPT (Foxy) & Cannabis (ID 79224)\". Erowid.org. Aug 9, 2010. erowid.org/exp/79224",
 "substance": "5-MeO-DiPT (Foxy) & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "12 mg",
   "oral",
   "5-MeO-DiPT",
   "(capsule)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 79224",
   "Male",
   " ",
   "Not Given",
   "Aug 9, 2010",
   "Views: 3419",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My buddy recently told me that he could get all these psychedelic chemicals like: 2c-b, and 5-MeO-DIPT (Foxy).  I was definitely down and got a 20 mg of 2cb and two 12mg of foxy. The following experience is with one 12 mg pill of foxy.</p><p>The trip took place at my friend Rs place, with my friend C. C and I were the only ones on foxy and were both having the same dose (12mg). R has an apartment full of animals. He has 2 cats, 2 ferrets and a little Chihuahua, which made the trip very exciting.</p><p>After smoking a few bowls, we popped in the foxy and swallowed them down.  With in 15 minutes I could feel a strong buzzing in my legs and they started cramping up a little.  Everything in the room slowly got brighter and patterns stuck out, but it was hard to enjoy it through the body load.</p><p>Foxy gave me a body load that made me not even want to stand up, or talk.  Any movement for a while would made me nauseas. R and C went in the kitchen to get the pizza.  Just the sound of food made me feel more nauseas.  I was left in the room with the cats.  The cats fur was so soft.  I took my mind off the nausea and focused on the good feelings I was also experiencing.  The good feelings battled the nauseas body load for the next hour in waves.  Even with the intense body load I was tripping so hard, with a hard to handle body buzz.  My audio was very out of place.  Everything sounded surround sound. There was a Johnny Rotten poster on the wall and he had a weird grin on his face that stuck out and just stared at me. R had told us his girlfriend wasnt going to be there that night because she was in the hospital for a infected tooth.  </p><p>The trip is starting to peak and go more intense when all of a sudden the front door flies open and his girlfriend and her friend come in and sit down.  It took me by surprise and was so awkward because I was tripping so hard, and they didnt know.  R went into his room with C to show him the ferrets.  I was tripping really hard and still had a terrible body load that made me stay in my seat.  It was too awkward being alone, so I forced myself up into Rs room.  I sunk into the squishy rug on his floor.  The body load made me sit down, as we played with the ferrets.  We came back and chilled in his living room.  As soon as Rs girlfriends friend left, the body load also loosened up and I could finally enjoy myself.  This is when C started to trip real hard too.</p><p>My audio was so strange.  When I would talk, it felt like everything I said was going through a microphone in my head.  A cop went flying by the window with his sirens on and the noise it made was coming from all over and the lights that flashed in the window were ridiculous.  The T.V. would make waves that would then follow my entire field of vision.  We played a game of Wii bowling during this time, which was pretty intense. I didnt even feel like smoking, but feeling guilty for being so fucked up at Rs house, I packed a bowl. When the pipe got to me, it felt like the pipe had melted in my hand and had become part of my hand.  We went to bed around 3:00 in the morning which was about 6 hours after we took them.  R went into his room with his girlfriend and they were watching Pocahontas.  Even with their door shut, it sounded like the movie was playing all around me.  I woke up the next morning with a foggy head, but a little weed cleared that up!</p><p>The body load the foxy gave me for the first few hours was hard to control and made the trip hard to enjoy.  It was a experience I dont want to repeat, so I sold my other foxy to R.  I wouldnt call it a good trip, but I wouldnt call it a bad trip.  It was one hell of a night with the fox.</p>"
}
