{
 "title": "Headf**k",
 "author": "RozeeM9",
 "citation": "   RozeeM9. \"Headf**k: experience with Methylone ('Explosion') (ID 79282)\". Erowid.org. Nov 16, 2009. erowid.org/exp/79282",
 "substance": "Methylone ('Explosion')",
 "bodyweight": "8.5 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Methylone",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 79282",
   "Female",
   " ",
   "Not Given",
   "Nov 16, 2009",
   "Views: 4713",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have only come across this substance once and doubt I will again. I was introduced to it by my brother who, during his short time with us, was a great fan and avid collector of out of body experiences, for lack of better words.  He was always on the look out for new and interesting substances, unconventional ways of achieving the highs that would normally be attained through drugs such as MDMA and  he always seemed to find things that no one else we knew had tried before.</p><p>I remember him coming home one evening with a friend of his, they had clearly consumed something that had altered their current state of being, of course, this was quite normal for him! </p><p>I was in somewhat of a mood, he had munched the last of the chips I had been looking forward to eating and had also polished off my coco pops! I confronted him about it, disgruntled at his selfish behaviour,  as this was something that happened often! However, to my annoyance, the response I got was far from satisfactory. He could only laugh at me and my pettiness and had no desire to apologise or even acknowledge my dissatisfaction. I can remember accusing him of being inhuman, I have always had a temper and in my rage, I often say silly things without thinking and tend to seriously over exaggerate the seriousness of the situation. He found this behaviour to be hysterical and could only tease me and wind me up further. I remember him trying to be serious after some time, standing with his hands out in front of him as if they were scales, trying to weigh up the importance and balance between coco pops and chips, with the idea of being inhuman floating somewhere in the middle. I couldnt understand the hilarity of the whole thing, even being aware of my own nonsensical argument! Little did I know at this point that he had taken a massive dose of the above named substance. I was soon to understand his strange behaviour!</p><p>The following day he and said friend came knocking at my door, asking if I would like to try some explosion trip. They had no idea what it was, all they knew was that drinking it produced some very interesting effects. It was a liquid that came in little vials with little written on them. One was an orange/red/brown colour and one was blue. The red/brown being original and the blue being trip, to this day I have no idea what the difference was and couldnt tell you if they produced different effects as I took them together. In all I took three vials, two original and one trip. Never in my life have I taken anything that has produced such hallucinogenic effects. I had lost my belief in hallucinogens, believing them to be little more than an over exaggeration on the part of others, for none I have taken have ever made me see anything more than the odd tracer. This however, was a fantastic kaleidoscope of visual insanity. </p><p>Kaleidoscopic is an excellent term for describing what I saw, my walls appeared to be covered in an ever changing multi coloured mesh that twinkled and shimmered, things melted down and zipped back together. I remember looking at my brother going through the door, this produced an image that Ill always recall as looking like an accordion, in reality, the door had a false wood effect, had the pattern of grain across it and was painted white,  in my trip, as the door opened the grain separated and the spaces between were black, as it closed they  folded back together.  </p><p>The best memory I have of that night was our friend, whom I mentioned before, he is a plumpish chap who resembles uncle fester, except he has black hair. I remember him being surrounded by a dark mist, his chin came down to a point and his hair twisted into horns making him look devilish, he was the picture of evil, but hilariously so. I have never experienced such an  intense effect from any drug nor anything that has lasted so long. I can also recall wondering after many, many hours if it would ever end and becoming quite worried that I would be stuck like this. I did eventually get to sleep but I still felt bizarre the next day and for some time after. Its strange though to think that of all the experiences I have read, mine is the most intense and visual, far exceeding any relation to MDMA or similar drugs. Perhaps I took too much! (I will also add that  for me, the side effects were long lasting and intense, not to disturb anyone but,  I can remember a feeling in my head every so often that felt like a twitch in my brain, feeling nauseous and off balance, distanced and confused and feeling detached from reality, this is in no way an exaggeration and is a genuine account of my experience.)</p><p>Thank you so much for reading!</p><p>[Reported Dose: '15ml (3 5ml vials) I do not know what the concentration of the drug in the vials was.']</p>"
}
