{
 "title": "Beautiful, but Respect It (Dose-Dependent)",
 "author": "stbot32",
 "citation": "   stbot32. \"Beautiful, but Respect It (Dose-Dependent): experience with Unknown (sold as LSD) (ID 79290)\". Erowid.org. Jun 30, 2009. erowid.org/exp/79290",
 "substance": "Unknown (sold as LSD)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "Unknown",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 79290",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 30, 2009",
   "Views: 8571",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThere is a lot of RCs being passed off as LSD these days, an unfortunate trend that is likely to continue.  I have no problems with RCs per se but dosing people unknowingly is just wrong in so many ways... it's easy to misjudge a dose, etc.<br>In early 2008 I obtained what I'm very certain is Bromo Dragonfly circulating on plain, purple blotter paper.  It was given to me as LSD.  At the time I was told that this 'acid' took 4 hours to kick in, which of course should have set off some alarm bells.  I tested it twice (reported below) and on both occasions the come up was actually nearly 6 hours.  This is far too long for a DOx substance or any other research chemical I am aware of that can fit on blotter.  Hence my guess is that this was Bromo Dragonfly.<br>-Dose:<br>I took two hits at about 9pm one summer night in a natural setting.  They had a strong and distinct chemical taste very reminiscent of other 2C's (I've tried 2CI on numerous occasions.)<br>-Come up:<br>Come-up took about 5-6 hours.  To put this into perspective, I had dosed the same time SWIM took acid, and by the time I was only just starting to peak, SWIM was already down from the peak into the plateau.  <br>-The effects:<br>A very stable high, with no waves of ups and downs like tryptamines or 2CI.  It was either on, or off.  Compared to 2CI (the only other RC I've tried) I found the high heads and tails more pleasant, with no real body load to speak of.  I went for lots of long walks and had no problems eating.<br>Vivid audio hallucinations, I heard drums turning into childrens' voices and ocean waves.  Incredible visuals.  The real world turned into a mosaic-like grid.  Trees were bursting apart into fractals.  I went to find an outhouse.. the walls turned completely invisible as if I were looking right through them.. and so forth.<br>Special effects aside, the mental trip was remarkably pleasant.  I felt centered and and empathetic, deeply connected to those around me.  CEVs were crystal clear, vibrant and lush, although not organic like LSD is for me--but I still spent hours with my eyes closed listening to the rain.  I had gone into this trip thinking it was acid, so I had no set/setting problems.<br>Come-down:<br>One word: gradual.  When I was falling asleep ~26 hours later I was still getting moving visual artifacts.  The mental trip actually subsided long before the visuals.  I slept great and woke with little after-effects to speak of other than a pleasant groggy afterglow.<br>Second test run (low dose):<br>I took another half tab a year later to see what effects it had.  Visuals were very subdued but it still took 6 hours to kick in and another 11 hours after that until I was able to sleep.  It was somewhat like being on a gram of p. cubensis (but less euphoric)--for 17 hours.<br>Conclusion:<br>I'm fairly certain this is Bromo Dragonfly for the reasons mentioned in the outset.  This is a powerful one, not to be underestimated.  But I clearly need to find the right dose.  Underdosing will still keep me up forever, with mild trippy thought patterns.  Also because of the ridiculously long comeup time it would be easy to take too much.  SWIM took more than I did and ended up feeling nauseated for several hours and hallucinating for over a day. <br>I don't think I can go as far with this one as I can with acid, and because of the length, it strikes me as more of a dreamy, weekend adventure, put my feet up and relax psychedelic.  <br>Although unexpected I was not disappointed with my trip.  Trying it once was fine.  I am concerned about the growing prevalence of 'counterfeit LSD' that's out there, combined with the naivety of people who think LSD takes '4 hours' to kick in.  If one ever eats a strong tasting blotter, it would be wise to wait a few hours before deciding to up the dose.  Or follow the old adage 'If it's bitter, it's a spitter'.\n\n\n"
}
