{
 "title": "Xhosa Dream herb",
 "author": "AllWhoYonderRNotLost",
 "citation": "   AllWhoYonderRNotLost. \"Xhosa Dream herb: experience with Silene capensis & Dreams (ID 79368)\". Erowid.org. Jun 16, 2009. erowid.org/exp/79368",
 "substance": "Silene capensis & Dreams",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Silene capensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 79368",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 16, 2009",
   "Views: 21840",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've always enjoyed dream/analysis and saw Xhosa on a reputable online ethnobotanical. I was already stocking up on Salvia so I ordered Xhosa (Silene Capensis) based solely on their remark that one of their employees loved this plant. I love it too now.<br>So, I had read on another forum that someone was taking as little as 250 mg per day in a tea and was getting effects strong enough that he never even bothered with the traditional preparation. I like to stick to what works so I tried it his way. For three days I simply put 250-350 mg in a travel mug, poured boiling water over it, and stirred every 5 min, letting it go for at least 20 minutes. Then I'd add honey and put it in the freezer to chill and drink it on the way to work. After of course removing the xhosa root itself. Okay, I'd say that every two or three months I have a dream that is both remembered and vivid before taking this root. I had vivid dreams I remembered all three nights after I drank the tea during the day.<br>On day four (yesterday) I stopped taking the tea to test and if I did have any dreams, I don't remember them. From my experience this root has a definite effect on dreams. Not a drug herb, but an enjoyable herb nonetheless. I bought my 14 grams (40-56 doses) for ten bucks, which is a deal to me. I don't recommend anything in abundance but I fully intend to start taking my Xhosa tea again and in slightly larger amounts to see if dreams get more interesting.\n\n\n"
}
