{
 "title": "Studying",
 "author": "Definate",
 "citation": "   Definate. \"Studying: experience with Modafinil (ID 79386)\". Erowid.org. Apr 19, 2010. erowid.org/exp/79386",
 "substance": "Modafinil",
 "bodyweight": "150 kg",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Modafinil",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 79386",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 19, 2010",
   "Views: 17004",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Here's my life story...</p><p>Many of my cousins were diagnosed with ADHD and had access to Ritalin. I was never diagnosed with ADHD, though I was tested for certain sleep problems and dyslexia when I was younger. I have always been quite intelligent and liked studying, though I suck at it. I'm also quite motivated... when I can be.</p><p>I decided to start researching study drugs and undertook a reasonable about of research and narrowed it down to Methylphenidate (Ritalin) or Modafinil (ModAlert) and Atomoxetine (Strattera). I don't take recreational drugs, I'm extroverted, spend about 16 hours a day on the computer and consider myself a card carrying member of the nerd brigade. I don't do drugs, don't smoke (anything), don't drink coffee, and don't drink alcohol.</p><p>Since finding this out, I have endeavoured to obtain a prescription for Ritalin through being diagnosed with Adult ADHD, however this has become a social faux pas diagnosis now, and no psychiatrist will go near it. My doctor is trying to find a psychiatrist to refer me too, however he has talked to 8 all of which don't handle ADHD cases, specifically Adult ADHD. I am in Australia. I searched for illegal sources, I can get my hands on cocaine and other methamphetamine stimulants basically within the day, however I can't get their safer alternative. So I have turned to importing them myself. I dont care about whether or not I have ADHD, I care about improving my study performance, which is something I desperately need.</p><p>I researched where to get them and what to get online, this provided me with good general information, expectations, other sources and where to get them. I did a small test order which was successful. I obtained the generic ModAlert version which is identical to the Profivil/ModaVigil variants. I got the 200mg tablets, as the tablets are scored, so I can cut them in half, and they last twice as long for a nominal cost.</p><p>Here's my experience...</p><p>7:30am - Wake Up - Took 100mg ModAlert tablet (cut a 200mg tablet in half) - Went about getting ready to study, had breakfast, had caffeine, showered, etc</p><p>8:10am - Began to feel it kick in, just felt really awake, wasn't tired (I got 8 hours of sleep, but I usually take about 10-11 hours).</p><p>8:30am - Get to study.</p><p>11:40am - First time I had gotten up since sitting down at 8:30 - Felt great - Didn't have an appetite, but wanted to move around and grab something to eat, and maybe watch a bit of a show.</p><p>12:40pm - Back to study.</p><p>3:00pm - Started to get some head fog back, not too bad, probably exacerbated by me struggling with a few problems.</p><p>4:20pm - Parents get home and interrupt me, no problem, wanted to get back to exercises, etc.</p><p>6:30pm - Din dins</p><p>7:00pm - Back to work.</p><p>9:00pm - Finished - About 90 pages of reading (I can never read this much in 1 day) and 10 pages of exercises and tutorials.</p><p>Here's my findings...</p><p>-It took about 40 minutes to kick in. When it did, I felt it, mainly because I always feel sleepy, and I didn't feel like going back to bed. I didn't have to fight to be awake.</p><p>-I was still easily distracted, but less so. I was undertaking my study away from everything, in to a room with little stimuli (no computer, TV, music or even a view, just the table, book, calculator and me), this helped me focus heaps.</p><p>-I felt more energetic and felt like doing the things I wanted to do. This is extremely rare for me, I'm usually super lethargic and always feel sleepy during the day, unless I'm hyper active. This is consistent with the symptoms of someone with sleeping problems or ADHD.</p><p>-Felt like my pulse rose a bit, especially in the morning, though this could be psychosomatic (and I'm insane) however.</p><p>-Wasn't great for focus, but it allowed me to focus more easily by clearing the head fog and allowing me to wake up. I think this might feel like regular people feel when they wake up.</p><p>-I planned an entire day for it, and I plan to do this. This way, I'm in the right set, am not wasting the tablet, am waking up at the right time and wanting to study.</p><p>-Haven't taken it for lectures or anything yet, however I am looking forward to doing this.</p><p>-My findings mirror my friends who have experimented with this also.</p><p>In the future...</p><p>I plan to order a lot more and also obtain some Strattera to try on its own and with the ModAlert. I will mix them, especially since the Strattera are known to make people sleepy, the opposite to what I want. When I've done that, I'll report back.</p>"
}
