{
 "title": "Yellow Jackets Attack",
 "author": "FrequentFlyer",
 "citation": "   FrequentFlyer. \"Yellow Jackets Attack: experience with Ephedra (ID 79490)\". Erowid.org. Mar 21, 2010. erowid.org/exp/79490",
 "substance": "Ephedra",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "4 tablets",
   "oral",
   "Ephedra sinica",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 79490",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 21, 2010",
   "Views: 6504",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So this was going to be like any other experience i've had with ephedra up till now, or so I thought. </p><p>I had bought a bottle of yellow jackets in my local smartshop, never had that specific brand of ephedra before but figured it was the same thing I was used to dose wise. I even checked with the vendor to be sure, and he assured me it was the same. I'm used to taking anywhere from 4 to 9 pills for a pleasant buzz, decided I wanted a mild pick me up this saturday morning so downed 4 yellow jackets with a cold beer, rolled a joint and sat on my balcony enjoying the summer sun.</p><p>After some 30 minutes the usual effects came on, quite enjoyably. Stayed like that for another 30-45 minutes, and then it happened.</p><p>I started feeling very heavy and slightly nauseous, started sweating like a pig, felt hot and cold flashes and knew where this was going, and where i was going: the bathroom, to try and throw up and get this over with. While hanging over the sink feeling all the strength being sucked out of me the only thought in my mind was 'waay too much waay too much waay too much' over and over, tried to make myself throw up but couldn't because my stomach was clenched up like a fist. Decided to lay on the bathroom floor for a while waiting it out and while thinking 'this feels a bit better' i had to stop myself from passing out. </p><p>I got up after a few minutes, feeling dizzy but somewhat better, and took a shower to wash the sweat off. </p><p>When i got out of the shower i felt extremely lethargic and found it impossible to concentrate on anything. The distinct ephedra buzz was there alright, but it wasn't very pleasant at all. </p><p>Decided to crawl into bed to relax a bit and spent the next few hours in my bed without having any specific train of thought, with my heart pounding and racing, my body vibrating, and feeling my heartbeat like a jackhammer throughout my entire body. I knew this wasn't a good reaction at all but figured i just had to ride this one out best i could. </p><p>About 6 hours after ingestion i got up, had a joint to try and calm me down a bit, and i felt it would be wise to take a walk outside and get some fresh air. Didn't feel very well, but manageable. Stomach still felt upset after i returned, but forced myself to eat some fruit anyway. </p><p>After two more hours of sitting around feeling restless, numb, unfocussed and with my heart working overtime, the yellow jackets finally released their iron grip, and i began feeling a bit better. Managed to get in half a pizza and started feeling a little less lethargic.</p><p>Now, 11 hours after ingestion, i'm quite energetic and reasonably relaxed, still feeling a (quite pleasant) ephedra buzz, drinking a beer and smoking a joint to calm me down. </p><p>The thing that got me with this particular experience is that, although i used to consider ephedra a very mild and predictable drug, the moment these yellow jackets floored me, i felt and thought very distinctly 'this is really really wrong'. That thought didn't leave my head the whole while. Never had that alarming feeling with any other drug before although i consider myself a reasonably experienced user. All in all this experience was much more unpleasant and draining on a physical level than on a mental level.  </p><p>I'm very glad i was wise enough to stick to 4 pills, i shudder to think what this experience would have been like on 9 pills. Probably 911-time. I think i finally experienced the dangerous side of ephedra, and feel pretty humbled by it. This stuff won't fuck with your mind, but it can definitely fuck with your body.</p>"
}
