{
 "title": "Better than Coffee",
 "author": "hotblood",
 "citation": "   hotblood. \"Better than Coffee: experience with Capsicum spp. (ID 79505)\". Erowid.org. Feb 27, 2011. erowid.org/exp/79505",
 "substance": "Capsicum spp.",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 ",
   "oral",
   "Capsicum spp.",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2009",
   "79505",
   "Male",
   " ",
   "Not Given",
   "Feb 27, 2011",
   "5298",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI am half Indian so you might think Im immune to chili. Not so; although apparently I had an aunt who popped chilis like candy, I have sweated like the best. </p><p>But I was really interested in the purported anti-viral properties of chili. I also read that chili has been found to raise metabolism which greatly interested me as I have been seeking to lose weight and high metabolism makes that easier. But how on earth do you eat chili easily and avoid the burn? Divine inspiration struck. Capsaicin, the active ingredient in chili is an oil. Peanut butter is also very oily. Good combo. I coated my cut and de-seeded fresh green chili pieces liberally with peanut butter and found I could eat them pretty easily with little burn. It seems the peanut butter mostly absorbed the released capsaicin and buffered it from my mouth. Ahh, this was quite pleasant. I have done this a number of times and observed the following actual or presumed benefits:</p><p>- I have found capsaicin is a better stimulant than coffee with effects lasting many hours. Half a regular green chili and Im easily fully alert all afternoon and evening. One has to be careful about this  I had a chili late in the day and wasnt able to sleep until the early morning. I now try to have a whole or half chili only in the morning or by midday at the latest and if delayed I only allow myself smaller amounts after that so I can get good sleep.</p><p>- I noticed that chili appeared to quite comfortably suppress my appetite somewhat which was helpful.</p><p>- I believe having chili warded off a cold that had threatened when I had a sore throat. Ive often had colds after sore throats. Post chili no cold. </p><p>- I believe chili boosted my exercise efforts by making it easier for me to lose weight and get trimmer yay. </p><p>Three warnings I consider:</p><p>1. Chili is a vegetable and in some parts of the world who knows what they use for manure. I wash your chili with soap and water and rinse well to avoid risk of ingesting bacteria on the chili skin.</p><p>2. I absolutely do not eat the seeds. In my experience they did not digest well and burned painfully at the other end. Not enjoyable. I get rid of the seeds and wash my hands very well with soap and water to prevent capsaicin touching sensitive body parts.</p><p>3. Like any substance  I dont overdo chili even with peanut butter. The odd chili for most healthy people should be fine, but check with your doctor if you have any concerns. Also I note that very high consumption of chili has possibly been connected with stomach cancer  not enjoyable. Otherwise I think its probably a good part of a healthy diet. Enjoy!</p>"
}
