{
 "title": "Icarus and the Fractal Sky",
 "author": "Dougal",
 "citation": "   Dougal. \"Icarus and the Fractal Sky: experience with Inhalants (solvents) (ID 7964)\". Erowid.org. Apr 5, 2004. erowid.org/exp/7964",
 "substance": "Inhalants (solvents)",
 "bodyweight": "96 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1990",
   "ID: 7964",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 5, 2004",
   "Views: 13571",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage.  We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]\r\nI had already inhaled the contents of a bottle of nail-varnish and decided it would be a good idea to try augmenting the experiment with some air freshener - containing butane/propane mix I believe.\r\nI turned down the lights and started to inhale. Dimly I could hear my heart pounding, something which would have worried me were I not experiencing massive rushes of pleasure and some bizzare visual effects. My eyes turned into a screen onto which was being projected an amazing, living fractal pattern which evolved and morphed through the blue/white colour spectrum. Something caught my eye and I could see that some of the tiny shapes were in the form of a dragon fly which became Icarus flying in 2 dimensions in the fractal sky. The more I focussed on him and let myself go, the more my heart pounded and the more extacy I felt. I think it was this that triggered the change.\r\nIcarus did a final spectacular loop and turned towards me, flying towards me and, it being in 2D, he appeared to just get bigger. My point of view changed and I could see a side on view of him pushing his wings/glider towards the back of my brain where I knew once got there he would take me over completely. I stood up in a panic and shook him out/off me. As I turned I saw his shadow (now without wings) move across the wall. I couldn't see him but he was there. After looking carefully I saw that he was in fact a nearly invisible gel - just visible enough to bend light around his edges. He reached into my head and I could feel his slippery fingers part my flesh and bone without pain.\r\nI gagged and bit down on his fingers. I spat a piece of him out on the bedroom floor. I realised I was still inhaling but the bag had become, well sort of soft and not there - something I can't explain any better than the word I heard that can't even be conceived whilst straight. When I'd come right down I looked on the floor and exactly where I'd spat his finger was a white lump! At which point my brain retro-engineered this little detail is beyond me but I was pretty impressed.\r\nI'd say that for me, some solvent combinations have had much more profound effects than 5 tabs of acid but are much shorter lived. I've been to hell and back, been sliced open by a troupe of dancing skeletons and been told jokes I didn't know the answers to - they were the funniest things I'd ever heard.\r\nI would not recommend solvents to anyone. I started doing them 17 years ago and I still can't trust myself with a tube of glue if I've been out on the C or E for a night and get back on my own. I know people can die on the spot from heart failure. Not a risk worth taking.\n\n\n"
}
