{
 "title": "Cave Walking",
 "author": "Jay Adam",
 "citation": "   Jay Adam. \"Cave Walking: experience with Salvia Divinorum leaf (ID 7966)\". Erowid.org. Dec 18, 2003. erowid.org/exp/7966",
 "substance": "Salvia Divinorum leaf",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2001",
   "7966",
   "Male",
   " ",
   "Not Given",
   "Dec 18, 2003",
   "5800",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have known about Salvia divinorum for years. The whole time I had been very skeptical of its effectiveness. A few days ago, however, for reasons still unknown to myself, I decided to buy an ounce of Hawaiian Salvia divinorum leaf. I took my first flight at a friend's house. He had a lot of people over, so I took a close friend downstairs with me to be my sitter. I took three large hits, but the setting was wrong, I just felt massively drunk. Too many lights, too many people and too much noise.</p><p>I didn't give up. The next night I was at my own house. I was excited about getting to use the plant in a more relaxed environment. So excited that I forgot that I had given my only pipe to a friend, so I had to do with a make-shift foil pipe.</p><p>I prepared a small dose, put on some very tranquil instrumental music and turned the lights completely out. I sat and got comfortable put the pipe to my lips. I took three hits with the flame to the leaf the entire time. I held each hit in for a slow count to twenty, about twenty-five to thirty seconds. My body became very heavy and gravity changed to a seemingly random direction. I closed my eyes and watched giant visual slugs move around me.</p><p>I came out of this state after about ten minutes, but I knew that there was more to Salvia divinorum than that. I loaded up again, expecting full effects as salvinorin is not supposed to build a tolerance. This time my first hit was the equivalent of the entire last dose. I did two more equal hits. By the end of the first hit I was no longer counting the seconds that I was holding it in. Someone else was, and that presence was using my voice. I laid back and sank endlessly into my bed. I covered my eyes with a dark blaket to ensure that no light got to me.</p><p>This is when my Salvia breakthrough happened. I opened me eyes under the blanket. I was standing before a large rock wall that led downwards into a cave. I started my decent after being instructed by a small, green and alien woman. Her presence remained with me through the whole experience, but her physical form left me. It felt like it took almost an hour to climb down the wall. At the bottom there was a small tunnel that I had to climb through. I remember physically reaching out and grabbing a small tool that I felt I needed to get through this tunnel. After an hour of wriggling through the ever shrinking tunnel I entered a large chamber with giant red stalagtites (the spikes on the ceiling). The alien woman was down here I couldn't see her, but I knew what direction she had gone to, so I followed. I chased her through a tunnel for years. There were many other tunnels that branched off, but I knew the exact pathway to take. I found myself in a small cave room with walls of glowing crystals. I had found the alien woman. She was diferent. She had grown. In the few years that it took me to follow the woman she had aged from a young child to an old woman. She told me that she wanted me to see this spot. That she dedicated her whole life to me finding this one spot. It was a beautiful spot. The most beautiful place that I have memory of in any realm. The woman died before I got her name. It was sad, but I was overwelmed with joy that I had been chosen to see this place. I saw the night stars and crawled out of the cave. I crawled up through my bed and found my self back in my room.</p><p>What felt like five years only took ten minutes. I had a wonderful body trip after for nearly an hour, then I went to sleep. I made a promise to myself that night that I would one day revisit that cave room to pay respect to the alien woman.</p><p>Salvia d. is like nothing I have ever put inside of me before. It is not a drug. It is a Goddess. Salvia divinorum does not feel like a drug. She takes her visitors to a diferent place in space and time. Then she shows them a different world. She may leave her taker there for only seconds or for years. This is not a party drug.  As I have stated in a party setting I just felt drunk, but in the right setting it is a spacecraft to other worlds. </p><p>Use a sitter, at least until you feel comfortable with the dose you are taking.</p>"
}
