{
 "title": "Good, But Next Day Skin Felt Very Itchy",
 "author": "northernraver",
 "citation": "   northernraver. \"Good, But Next Day Skin Felt Very Itchy: experience with Mephedrone (ID 79687)\". Erowid.org. Sep 21, 2009. erowid.org/exp/79687",
 "substance": "Mephedrone",
 "bodyweight": "51 kg",
 "header": [
  [
   "DOSE:",
   "2 capsls",
   "oral",
   "4-Methylmethcathinone"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 79687",
   "Female",
   " ",
   "Not Given",
   "Sep 21, 2009",
   "Views: 8832",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I took two capsules of mephedrone (sold as Plant food in shops) on the weekend at a dance festival. I was a little apprehensive to be taking a new drug for the first time. However, I had heard good things about the it from friends who had already tried it before. The sun was shining and the music was good, so I took the pills and hoped for the best! It felt like it took a long time for me to feel anything from the dose. I took the pills at 3pm and it was only at about 5 that I started to notice a rush-like feeling. Suddenly felt the urge to chat to people, my stomach felt a little jittery and wanted to dance. Similar to that of coming up on MDMA, mixed with a feeling also similar to cocaine. I also noticed about an hour later feeling very relaxed and slightly heavy at the same time. This didn't worry me in any way, I just wanted to sit down, close my eyes and enjoy the good music. I had only eaten a sandwich all day, and by 7pm felt quite hungry, but couldn't bring myself to eat anything...</p><p>All in all, I felt a rushy MDMA' esque happiness, mixed with relaxation and calmness of being slightly stoned. This lasted about 3 hours, then after I could still feel the drug in my system for a good 4 hours.. being able to appreciate music to a different level and having more energy. I found it difficult to sleep but easy to unwind. I started to get a headache early in the morning whilst I was attempting to sleep. Felt a little sick and tense in the muscles, like a mdma comedown but not as bad. After getting some rest, I felt okay, just a little headachey. </p><p>The only bad thing I would bring to attention is that the next day my skin felt like it was crawling and very itchy. Also that little is known about this chemical, so just be careful. The feeling is very good and from what I have heard can be very addictive, especially if you choose to snort the drug. Friends I was with took more the next day because they enjoyed the experience so much.</p>"
}
