{
 "title": "Destruction Of One's Mind. Period.",
 "author": "YankReed09",
 "citation": "   YankReed09. \"Destruction Of One's Mind. Period.: experience with MDMA (Ecstasy) (ID 79724)\". Erowid.org. Jul 7, 2009. erowid.org/exp/79724",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "225 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2007",
   "ID: 79724",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 7, 2009",
   "Views: 4751",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dear oh dear, to start I would just like to say that I dont pop x anymore. As some would say it lost the magic. But I am going to relive some of the amazing times, and the long term effects that this Euphoric Empathogen left on my life.</p><p>Young buck, I worked at subway when I first learned about this mysterious substance. One of my co workers introduced me to it. I was heading out to town that night to stay at a house my buddies dad was watching for the owner, and we wanted something more. Something besides weed. We asked my friend who will be known as KK, in no time at all, my friend D and I both had one in our hand. When we got out to town, we ate it. Truthfully I barely felt the effects of the drug, and went to sleep around 4am. </p><p>Over the next year, I began rolling 4 to 5 times a week. Consuming 4 to 6 pills at a time, per night. Now think about it, this went on for about a year. I rarely went to sleep even when I wasnt rolling, my sleep patterns were destroyed, and they still are. I had a destructive incentive on my brain. I couldnt remember when I wasnt rolling, and I turned my entire city onto it. After about 3 months I started to hit licks with them. I was the go to guy, because I had the connect of a lifetime. People would call me every day for 50, 100, 200 pills. I would make bank every day, plus stealing 50 dollars a day from my work really induced my habit. No one in XXXX could see me, If you lived in XXXX, or any of the surrounding cities and you rolled? You would know EXACTLY who I was I was so geeked up making thousands a week, that I just couldnt stop. No one could stop me, I was addicted to grindin.</p><p>On a carefully calculated estimate, I have probably consumed over one thousand pills in a one year period. Dead Serious. The destruction it has done to my mind will never be replaced, but I would never trade those experiences for anything, even a million dollars.</p><p>There are absolutely so many experiences that I have went through, I couldnt begin to explain any of them. Words cant describe what I felt, right now I think about it, and all I see is white. And its weird even though the problems I was having, the insane thoughts, the feelings in my chest, the ticking in my brain that would never escape me, and worst feeling. The feeling of being alone, whenever I was not rolling, and for 6 months after I stopped, I could be at the most jumpin party ever, and feel as if I was the only one there. Shit does destroy me. I never thought I was going to escape it, I thought I was going to roll forever. Then out of nowhere, the rolls turned into horror. </p><p>The last times I rolled it felt completely wrong. I felt completely insane, like I was falling off the edge of reality, and it took all my strength not to scream out for help. I almost called an ambulance one time, because I really thought I was going to be stuck in that state forever. The weird thing was, those last few times I rolled, those insane thoughts about falling off the edge of reality, that I was losing it? Was God. He did that for me to stop my destructive lifestyle that I brought to myself, my friends, my city, and the surrounding ones. I know it was God, and that he saved me.</p><p>To this day, if I were to eat any ecstasy, I would go right back to that scene. I think I actually would go insane, and fall off from reality forever. I know I couldnt handle one more roll, one more time of bliss, never again. If this gets published, I want everyone that reads this to heed my warning. Please, Ecstasy should not be dabbled in, use it in moderation, not excessively. Dont lose yourself as I have, and never, never regret the past experiences that you remember, if you remember them at all.</p>"
}
