{
 "title": "The One Thing That Stopped My Head Exploding",
 "author": "bob dole's tech",
 "citation": " bob dole's tech. \"The One Thing That Stopped My Head Exploding: experience with Mirtazapine (ID 79758)\". Erowid.org. Jul 7, 2009. erowid.org/exp/79758",
 "substance": "Mirtazapine",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Mirtazapine",
   "",
   "6 hits",
   "smoked",
   "Cannabinoid Receptor Agonists",
   "",
   "2 glasses",
   "oral",
   "Alcohol"
  ]
 ],
 "footer": [
  [
   "2008",
   "79758",
   "Male",
   "",
   "Not Given",
   "Jul 7, 2009",
   "6151",
   " "
  ]
 ],
 "report": "<p>Screaming babies. Parents that won't stop. No space. No privacy. No escape.</p><p>A sister with a baby, parents that never stopped yelling at anything, no lock on the door.</p><p>I couldn't take it anymore... So I started smoking & drinking. It amazed me at first how easy it was to hide. I just yawned, or stared into my computer or ipod... They just went away when I ignored them. It was working!!!!</p><p>Well.</p><p>After a few weeks weed wasn't working anymore... A quarter or a half a week does that to me when I smoke little bits all day long. I couldn't ignore them - I needed more weed for that,  but couldn't afford it. So I switched to mostly vodka, draining one every day or two, with a little weed on top.</p><p>Months later I was surprised when my girlfriend left me, saying I had become an arsehole that wouldn't go out and party, but I would waste myself on the lounge... Then I thought about it, and didn't care, lighting up another bong.</p><p>After a few weeks she stopped sleeping with me and gave me back the necklace I bought her. About then, I figured out she had meant it all along.</p><p>And I went nuts.</p><p>I drank the remaining one and a bit bottles of vodka, smoked about four grams of weed and took six codeine tablets. Picked up a bat, sprinted to the local bushland, and began attacking every tree I could find. Started taking running swings at things... Well.</p><p>Woke up later on with a broken finger and a huge lump on my head, and realised  I might need some help. So I went to my doctor and told her what had happened. She didn't really believe me until I showed her my hand, thought I'd made it up because of my head. Then gave me a script and told me to take the pill first, then go slow on the booze n drugs because it would affect me. I've been on antibiotics before, I thought, fuck it!</p><p>Later on, with the family apparently retired, I took my first pill. 30mg of mirtazapine. After performing the evening mechanics, maybe 30 minutes later, I was in my bedroom wondering what the big friggin deal was, so poured myself a couple drinks.</p><p>Wow, it did make a difference. Ok, let's have a smoke :d   After four, I still couldn't notice a thing. Five. Ok, maybe a little - that's about normal for my first bong all day. I smoke a lot in one sesh.</p><p>Six - and halfway through, I enter nirvana. My eyes glaze, I stare at the cherry in pure delight and suck it down with glee. Then I stop.</p><p>This is something I have not done in six months, and it takes me fifteen minutes of cloudgazing to realise this.</p><p>With a start, I begin to pack again out of pure habit.</p><p>I get that one down too. And re-learn the meaning of 'lazy'.</p><p>It takes me damned near half an hour to empty my bong in the grass and get back inside, somehow having a cigarette on the way (again, something accomplished purely out of muscle memory I'm sure)</p><p>Once I'm inside, the only thing I want to do is watch star wars. So I do! From 1-6, not 3-6-1-2.</p><p>There are visual effects until I fall asleep - everything's in technicolour 3-d 200hz hd video.  Even watching a vhs on an old tv - wow! Enormous laser battles take on an entirely new significance and realism. Of course, im pressed into my bed during all this. I'm thinking about food, but am not nearly as motivated as when smoking weed normally. I don't have to get up and eat, I can ignore it and watch the movie, or go to sleep. I can even ignore the urge for more bongs and cigarettes.</p><p>After a few hours I fell asleep.</p><p>Upon waking, a good 8 or 9 hours later (up from 3 hrs and then I needed to smoke more bongs) I was still plenty tired enough to roll over and sleep more - I just had to piss. So I did, and slept.</p><p>After a week of this, my body adapted and began rejecting alcohol and weed. I could only smoke two or three cones and have one drink before tripping out.</p><p>Since then, I have come down to half pills with the occasional drink or smoke, seperately, to being off any sort of addiction or daily intake to being a normal person. Drinking on weekends with friends at venues, talking to peoples faces not through a keyboard.</p><p>I don't want to strangle little noisy kids anymore. I don't want to lash out and smack idiots in the face with a passion. I'm pretty normal now.</p><p>Changed my life. </p><p>The worst bit... </p><p>The first week I took them my hands and feet twitched just after taking it. Wears off pretty quickly but it's a little strange.</p><p>I have never really remembered my dreams. I'm one of those people who, once a month, will remember something and laugh at its absurdity. Now, its more like once a week I remember some small absurd part. No stupid vivid dreams for me excepting the very first night, and that was amusing as hell - it was like I was duke nukem himself inside a videogame. I loved it.</p><p>I was fatigued in the mornings when I was on it. I had to wake up a little earlier to drive to work without 'fog'. Herbal concoctions and diet coke worked wonders where coffee and normal coke didn't. Something to do with sugar maybe. I don't eat breakfast till I've been up a few hours.</p>"
}
