{
 "title": "Light and Cool",
 "author": "EastSideMag",
 "citation": "Citation:   EastSideMag. \"Light and Cool: experience with Nutmeg (ID 7980)\". Erowid.org. Feb 9, 2004. erowid.org/exp/7980",
 "substance": "Nutmeg",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "2 Tbsp",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7980",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 9, 2004",
   "Views: 7013",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOne night, my friends and I were bored. We then thought of what we could take that we could buy at the store to make us high or hallucinate. I came up with nutmeg after remembering a friend's experience on it. So we drove to the local store and bought two containers of ground nutmeg. The experience was pretty cool. Here is what happened:\r\n12:15 am  I ingested 2 Tbsp of ground nutmeg. I washed the nutmeg down with coke. This almost eliminated the bad taste.\r\n1:45 am  At this time I felt like I had a couple of beers. Just a slight buzz feeling. Nothing much.\r\n3:15 am  I started to see minor trails coming from objects as I walked past them. Also when I move my hand around.\r\n4:00 am  I when back to my room and turned a blacklamp on and started to listen to music. I have stars on my ceiling that were glowing. When I stared at one star for a while, the surroundings around the star started to change color. The color changes seemed to be foggy and cloud-like. I then started to move my head from side to side to the beat of music while looking at the stars. This was rather cool considering every star had a trail. I was feeling qite euphoric and energetic. Never did I think the color changes were real. I knew they were just hallucinations.\r\n4:30 am   I was watching t.v. and I found myself zoning out. After zoning out several times. I decided to go to bed.\r\n2:00 pm   I woke up feeling tired. I didn't have a headache or anything that would resemble a hangover. I didn't appear to be feeling anything. So i went to watch t.v.\r\n6:30 pm   After watching t.v. for several hours, I went to go to the store. When I was out walking around, I felt tired and disconnected. I felt as if the world around me was moving a little faster than normal. Nothing intense though.\r\n9:00 pm   Everthing back to normal. Feeling sober.\r\nThe next time I do it, I will take more than 2 Tbsp to get a more intense feeling. But what i took was still pretty cool.\n\n\n"
}