{
 "title": "The Pixies Are Calling",
 "author": "Mycophile",
 "citation": "Citation:   Mycophile. \"The Pixies Are Calling: experience with Salvia divinorum (ID 79943)\". Erowid.org. Jun 17, 2011. erowid.org/exp/79943",
 "substance": "Salvia divinorum",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2007",
   "ID: 79943",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 17, 2011",
   "Views: 7115",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had tried this before when I was about 19 at a time when I was fairly unaware of the shamanic properties of the drug and how to utilise it properly. It was at a party and I had been drinking which is not exactly ideal for salvia! I only had a small amount and remember just having the giggles for a good 5 minutes. \r\nYears later after learning a great deal about psychoactive drugs in general and after many intense psychedelic experiences with other drugs, I decided to give it another go. I bought some of the 25x strength from a shop in wellington NZ. I went home, drew the curtains, lit a few candles and my girlfriend Jodie and I sat on the bed and began to take hits from a pipe. (in hindsight a bong would be ideal to condense the smoke more and filter out the carbon a little.) I just managed to finish the cone before I became too detached to continue smoking. I remember staring at the glowing embers in the pipe and then losing all context and perspective. The room faded away and the glowing embers seemed to transform into a fire on a beach in the dark. I was sitting there watching the fire and there were other people/beings around too although I couldnt really make them out. This quickly faded back into the room and to Jodie who by now must have been well away on her own trip. \r\nThe next sensation I felt was what I can only describe as a rake being dragged through my aura, turning from right to left across my body. The pressure started to build up around the center of my chest as if there was a peg pressed into my sternum and this rake like force was pushing it sideways. The pressure continued to build until in popped a rush of energy shot up from my chest to my third eye. I closed my eyes and began to leave my body through my third eye. If you can picture this reality as a cube, it felt like one side of the cube was folding in on itself and then opening up into a second cube or alternate reality into which I was passing. Although my eyes were closed I could still see the room as a kind of fractal energy lattice and I recalled Alex Grey talking about this and rendering it in some of his paintings. I drifted around the room for a while pushing energies around like sponges in the air. I never strayed too far from my body as I kept having minor attacks of fear which would draw me back in. I also remember feeling like Jodie was very far away and that worried me. I would open my eyes and she would be sitting next to me so I would try again. This went on for some time until eventually the effect wore off and I found myself grounded back on the bed next to Jodie. \r\nJodie and I talked about our experiences and found that the rake through the aura feeling was common in both our trips. The only difference was that her went from right to left instead of left to right which I suppose makes sense in terms of directional energy flow of masculine and feminine  yin and yang and all that. We also decided that it was a distraction from the experience having another person there too, especially a partner, because the concern for them tends to pull us out of our trip. This of course may be purely subjective.\r\nAfter the experience when recalling it I realized that the whole time I was hearing strange voices in my head which at the time I took for granted as being my inner dialogue. Afterwards however I realized that these voices did not come from me but were external. It was like there were pixies calling me out of my body. Mischievous whispers.  It was not to be the last time I heard these voices.\r\nSince this experience I have had salvia a number of times with some amazing results but this one was by far the most profound.\n\n\n"
}