{
 "title": "Kava Java",
 "author": "Xanthine",
 "citation": "   Xanthine. \"Kava Java: experience with Kava & Caffeine (ID 7998)\". Erowid.org. Oct 29, 2003. erowid.org/exp/7998",
 "substance": "Kava & Caffeine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "30 capsls",
   "oral",
   "Kava",
   "(ground / crushed)",
   " ",
   "  ",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 7998",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 29, 2003",
   "Views: 40249",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nKava mixes extremely well with coffee!</p><p>I'd assume it would thus also go well with Guarana or possibly a little Yohimbe (I stress - a LITTLE).</p><p>At any rate, I made a half-half cocktail of coffee and Kava spiced milk this morning. My exact recipe was to make a mug-full of coffee in my cafetiere, and brewed about 30-capsules worth of Kava root powder in a pan of warm milk for a while (cardamom, cinnamon, nutmeg, honey and dash of Kahlua optional). I later realised this was a sort of kava chai...</p><p>Actually the coffee was java. 'Hot Lava Java' to be precise. So I suppose, what I made was Hot Lava Kava Java.</p><p>Sorry... I found that amusing.</p><p>[Just a side note: Ironically, whole milk contains a compound that helps the human body get rid of excess fat! No shit! If you know any maniacal health freaks, you might want to taunt them with this fact, though I doubt they'll believe you. IMHO, skimmed milk is too freaky and bearded.]</p><p>I felt the, now familiar, temporary numbness in my mouth as I drank this. An interesting flavour. If I'd sweetened the coffee a bit more, I'd have probably really liked it. Within minutes I was feeling the chill-out effects of the Kava, combined with the get-up-and-go effect of the caffeine. A very interesting combination. Enough energy to get things done, but chilled enough to take it all in my stride. I was thinking how this would be a good idea before a presentation or an important speech.</p><p>If it was more freely accessible, I'd happily drink this stuff over a Vodka/Red Bull anyday!</p><p>Actually I was thinking about calling a friend whom I haven't spoken to in a while. I felt the overwhelming compulsion to give her a big hug and tell her I loved her. It sounds silly, but it's true. I've never taken an E, so I don't know quite what it's like. I imagine though that if you were to smoke a nice phat spliff and have a big mug of Kava coffee, you might come quite close... But I'm only guessing, so don't quote me on it!</p><p>Even aside from that effect, I found it a very uplifting drink. I felt happy and was walking around smiling all day. And it was nice. I quite enjoy being cheerful for no apparent reason. Last year when I was depressed, I was taking St. John's Wort. If I'd known about Kava, I'd have been taking this stuff too!</p><p>Seriously though, if you're in a troubled relationship with someone you still love, or if you just want to feel closer to any friends or loved ones, I suggest you both sit down, have a couple of cups of Kava coffee and spend an evening cuddling.</p>"
}
