{
 "title": "Opium in Laos",
 "author": "Raul",
 "citation": " Raul. \"Opium in Laos: experience with Opium (ID 8006)\". Erowid.org. Jul 11, 2001. erowid.org/exp/8006",
 "substance": "Opium",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "10 bowls",
   "smoked",
   "Opium",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "2000",
   "8006",
   "Male",
   "",
   "Not Given",
   "Jul 11, 2001",
   "75155",
   " "
  ]
 ],
 "report": "<p>\nThis may seem curiously similar to a previously written story, but it's unrelated although reading the other story and seeing that there were only 11 entries in the opium category did inspire me.</p><p>We flew into Vientiane and stayed the night at a low end hostel off the big square (forgive me but I don't remember the names and I don't have a LP handy).  Rented a Suzuki Samurai-style thing the next day and made our way out.  </p><p>The place we stayed was quite nice, if rustic.  Comfortable at any rate.  </p><p>The basic drill was to smoke in the evening and wake up late.  Our primary morning activity was joint rolling.  The first night we were lucky enough to share in a special meal prepared in honor of some friends of the proprietor.  A few hours after we had retired to our cabin the proprietor and an older gentleman came to our cabin.  They brought a long pipe, perhaps 36' long, made of bamboo.  A ceramic bulb capped one end of the pipe.  The ceramic bulb had one hole about 1/8' in diameter.  </p><p>I went first.  Although I would have preferred to sit up, I was instructed to lie down.  I did.  The older gentleman motioned for me to turn onto my side.  Once I had done so he placed a candle on the bed.  Then he kind of curled up on the bed a few feet from me, just past the candle.  He pulled a cellophane packet of opium from his vest and a metal poker 8' long and 1/16' in diameter from his pants pocket.  He heated the poker in the candle's flame.  Then he pushed the poker into the opium, pulling a chunk away with the poker.  He heated the opium-laden poker, molding the opium into a cone with his fingers.  He finished by pushing the poker through the hole in the bulb, leaving a cone on the outside of the buld with a nice hole in its center.</p><p>With the opium nicely formed on the pipe the old man indicated that I should take the straight end in my mouth.  He held the bulbous end over the candle and the opium started to bubble.  Smoke visibly poured over the edges of the cone.  The smoke tasted deliciously sweet.  I felt no rush or high.</p><p>As the opium burned it became molten and began to drip into the hole.  In order to prevent its blocking the hole, the old man used the poker to push the molten opium through the hole, into the bulb.  [The contents of the bulb, are, as attested to elsewhere, the spoils of the old man.  He smokes for free (and makes money on the opium itself - 40/bowl at the time - hey, everybody's got to have some kind of gig).  Please don't think that detracted, detracts, or will detract, for me, from the pleasure of the experience.]  It takes a minute or two to smoke a bowl.  The ritualistic aspect is cool in and of itself.  I admit that having the pipe tended by someone my own age lost a certain thrill.  </p><p>I smoked 10 bowls in a row over 20-30 minutes.  It was my first time.  After I finished I moved and my buddy got up on the bed (it was his bed - I had my own) I tried to read inside the cabin but the light was too dim, so I went to the porch.  I had a little trouble focusing so I got my glasses (which I don't typically wear for reading), but they didn't help much.  I went and laid down on my bed.  I felt the opium.  </p><p>My buddy was finishing up his hits.  Our friends took off to the next cabin and we put on some Groove Armada.  We had a crappy speaker set for our walkman, but the music complemented the mood.  We drifted in and out, talking occasionally for the first hour or so and then silent for a couple more hours before just going out completely.  </p><p>Smoking opium is like orally imbibing lethargy and goodwill.  The warmth is immeasurable.  The dreams are wonderful.  Practically zero hangover.  </p><p>We smoked three days in a row, the last day twice, once in a bamboo hut.  It's cool to look down and see sloping dirt below the house.  This ain't no park.</p><p>We ate a couple of balls that a second old man had cooked up for us with the remainder of a lump we'd bought through a local connection (he'd just heated the stuff and rolled it into balls, actually, but we didn't realize that when we were told that we should do it).  We ate them back in Vientiane.  The night market was better in slo-mo. Kind of like pot & valium in a shopping mall, it just takes the edge off.</p><p>The context contributes to the experience but opium's worth trying regardless.</p><p>Pardon my paranoia, but I haven't given many details about location as I don't want to endanger any nice places.  I've even changed the country and city.  Suffice to say that it was very pleasant.  With great weather.  </p><p>I understand that the stuff's quite addictive, so take it easy.  But try it.</p>"
}
