{
 "title": "Preloading to Enhancing the Experience",
 "author": "Vova",
 "citation": "   Vova. \"Preloading to Enhancing the Experience: experience with MDMA, Piracetam, Choline & Amphetamines (Adderall) (ID 80175)\". Erowid.org. Jul 25, 2009. erowid.org/exp/80175",
 "substance": "MDMA, Piracetam, Choline & Amphetamines (Adderall)",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "700 mg",
   "oral",
   "Vitamins - Choline",
   "  T+ 0:00",
   "2.8 g",
   "oral",
   "Piracetam",
   "  T+ 1:10",
   "80 g",
   "oral",
   "MDMA",
   "  T+ 1:10",
   "13 mg",
   "oral",
   "Amphetamines",
   "  T+ 1:40",
   "80 g",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 80175",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 25, 2009",
   "Views: 6939",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently me and two of my friends J and M decided to go do some MDMA at a small rave at a venue in the middle of nowhere. We decided to do 160mg of MDMA, 13mg of Adderall and preload on piracetam and choline bitartrate. The MDMA would be divided into two doses of 80mg. The Adderall would be taken with the first dose.</p><p>I had been taking around 2.8g of piracetam and .7g of choline bitartrate daily for seven days before the rave. M had been taking around 2g piracetam and .7g of choline bitartrate for the previous three days and J preloaded around 2g of piracetam and .7g of choline bitartrate before taking the MDMA.</p><p>On the day of the rave we all took 2g of piracetam and .7g of choline bitartrate around 70 minutes before ingesting the first dose of the MDMA. We got to the venue in 30 minutes. After getting inside and checking the place out, we took the second dose of MDMA.</p><p>Until this point the MDMA experience had seemed pretty normal. We were all a little bit down and lethargic during the come up. I danced at the dancefloor a little bit, but I didn't seem to have that much energy at that point. I first noticed a new feel to the MDMA experience around 25 minutes after taking the second dose. While my thought process seemed quite clear, I still felt as if I was rolling really hard, I thought it was comparable to my first MDMA experience.</p><p>It was a lot easier to look into things with a positive MDMA outlook, but still retain a clear head. I felt comfortable with analyzing my life and I was really happy about it. I felt great about all my friends, my family and all my experiences in this crazy world. I normally get similar sort of thoughts on MDMA, but this time everything felt a lot more lucid and immersive. I would say the entactogenic effects were unusual in that they reminded of the first time I had a really good time on MDMA. The whole experience felt very profound, more so than a typical dose of just MDMA in a comparable environment and mental mindset.</p><p>M and J had largely agreed with my observations. M suggested that this trip was cool in its own way, rather than it being 'a whole new take' on doing MDMA, but he did agree on the prominence of entactogenic thoughts. M had also written a short poem during peak. It was about the psychedelic experience, that was really cool. He doesn't normally write poems on MDMA and I don't think he has been writing anything recently. J agreed that the this trip felt kind of like the first time one has a good MDMA experience. He also agreed that this experience had a new quality to it.</p><p>While I was analyzing my life during the peak of the trip, I was also having a lot fun. Dancing was incredible, it was great talking to random strangers. We were having some pretty good conversations between ourselves. Around 3.5 hours after taking the first dose, M seemed to have crashed from the adderall. He wasn't dancing and it seemed like he was ready to head out. So in another 45 minutes we decided to head out from the venue.</p><p>The come down seemed pretty gentle, definitely not as 'irritating' as a typical MDMA come down. I sometimes have some pretty bad anxiety during the come down, but this time I felt pretty good, it was almost like an afterglow. Once we got back to our hotel room, we smoked a bunch of dank weed and that really helped. It was almost like the weed was acting in a synergistic manner with the 'remains' of the MDMA experience.</p><p>We were all really pretty tired on the next day, but that is mostly because we didn't get a lot of sleep. I think J didn't sleep at all, he spent the whole morning talking to this chick. M and I got maybe 2 hours of sleep. Overall, while I was tired on the following day, I had a pretty positive outlook on things. I feel like I have the power to change stuff in my life and to not let unimportant things bring me down.</p><p>I think it is crazy how preloading on piracetam + choline can have such an effect on MDMA. Preloading on piracetam + choline for a few days before the roll really added to the experience I think, but on the other hand I tend to get strong entactogenic effects from a lot things. For instance, for me MDMA effects are always mentally psychedelic, I never find them to be just euphoric and/or empathic.</p>"
}
