{
 "title": "How Easy it is to Get Intoxicated Underwater",
 "author": "Pariah",
 "citation": "   Pariah. \"How Easy it is to Get Intoxicated Underwater: experience with Nitrogen Narcosis - Air at 3 Atmospheres (ID 8020)\". Erowid.org. Jul 12, 2001. erowid.org/exp/8020",
 "substance": "Nitrogen Narcosis - Air at 3 Atmospheres",
 "bodyweight": "165 lb",
 "header": [],
 "footer": [
  [
   "2000",
   "8020",
   "Male",
   " ",
   "Not Given",
   "Jul 12, 2001",
   "9777",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>  Now that Nitrogen Narcosis has become an area of interest to some of those inclined to use inhalents for euphoric and intoxicating means, I will share an experience that happened to me on a check-out dive when I was applying for my Scuba-Diving license from NAUI in a cold lake. This experience is being recalled to the best of my knowledge, seeing that it happened over a year and a half ago and was very brief and unexpected.</p><p>    I was not an experienced scuba diver by an means, nor did I even own much of my own equiptment but I needed a new hobby. I decided to take a scuba diving class, pool-training, and then hands on training and check-out dive course offered by a NAUI (National Association of Underwater Instructors) Worldwide affiliate and taught by extremely experienced experts. After emerging as one of the most improved members on my class the time came for the checkout dive in a cold, mountain lake in the north-eastern united states with the rest of my class.</p><p>      Aware, I was of all the dangers facing me, even in shallow water if I did not follow all proceedure properly, but I knew everything like the back of my hand at this point. I suited up and made my way to the near-freezing lake with just a full wet-suit on (shoulda used a dry suit) and the 70 plus pounds of equiptment. After all the preliminary tests had been wrapped up it came time for one-on-one excursions with my instructor. Large vehicles; air, land, and sea had been sunk in the lake to provide more interesting dives for divers since it was primaraly a scuba-diving lake. We made our way to the fire engine; I think it was, which was at one of the coldest spots in the lake and then everything became quite fuzzy.</p><p>     It became apparent I was enjoying myself a little too much, especially since fear was gripping me throughout the entire excursion and this was still part of the test in which I really had to make sure I did everything right(a mimiced vacation-like dive). It was as if I had been drinking before the dive, which I hadn't been. I fooled around with stuff in the back of the open-backed antique-style fire engine that on a normal day I would be disinterested in and began to lose track of time and the extremely cold temperature didn't bother me anymore. Just seconds before as I slightly descended to the cold spot when the fire engine rested the temperature had made me want to flee and jump out of the lake and into the shower in the restrooms. My situation became apparent when my intructor came around from the from of the engine where he had been waiting for me for I don't even know how long.</p><p>   Nitrogen Narcosis. I had become intoxicated by an imbalance in nitrogen in my system on the descent to the old fire engine through going down too fast, the pressure building, and the temperature or a combination of the three since I most likely crossed through another atmospheric pressure when I went down further to get there. I motioned to my intructor that I had Narcosis by pointing at my chest and then at my head and going the 'crazy' finger-rotation. He nodded and we swam up slowly until I noticed it disapeering when the pressure change let the nitrogen release. I tapped him again since he was directly beside me and signaled to level off, did the 'crazy' finger rotation and shook my head to say I didn't have it anymore. We continued on the rest of the dive and even descended again without either one of us having to deal with narcosis.</p><p>    That was my only experience with narcosis to date. It was slightly enjoyable but due to the fact that I was underwater and had responsibilities like monitoring my air supply which I had to do math to keep track of atmospheric pressure x depth x air usage etc.. This also was a crucial dive to me obtaining my NAUI scuba diving license, in which I did :).</p>"
}
