{
 "title": "Nearly Killed Myself",
 "author": "deaf girl",
 "citation": "   deaf girl. \"Nearly Killed Myself: experience with Diphenhydramine (Benadryl)  (ID 80252)\". Erowid.org. Jul 28, 2009. erowid.org/exp/80252",
 "substance": "Diphenhydramine (Benadryl) ",
 "bodyweight": "98 lb",
 "header": [
  [
   "DOSE:",
   "48 tablets",
   "oral",
   "Diphenhydramine"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 80252",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jul 28, 2009",
   "Views: 6627",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On Aug 10th, 2008 I went to the walmart that day... and getting benadryl. I popped them * 48 ^ pills at once... and drink pop... I arrived home. I was driving just fine only 30 minutes away from the place, that I stopped by. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  some how I didnt expect weird stuff going on. I started to notice myself falling down and feeling spinning around inside my head. I have no control over it to stop it. I remembered few bits of pieces. I was mumbling trying to figure out what wrong with me. *no one home* My boyfriend was at work that day. I didnt know that he had a webcam that was recording that day and saw every detail what I was doing. He saw me acting little weird and he thinks He should watch and see if its everything okay, and realized that I was having seizure on my couch... and he went home. He found me under the table clicking to the computer screen to get it on/off. He told me my eyes are shot and my mouth was foaming and look so sick. I dont remember anything. He rushed me to the hospital.  I blacked out in the car. he was terrified and thought I am going to die in his arms. </p><p>Doctors and Nurses whoever tried to wake me up. They put me in heart monitors etc. and I was in coma for 6 hours or more. and later..... my boyfriend that time.. cannot figure out what causing it... and wonder why and what did I take. He went home and look all over the place and couldnt find it. not even my car. *I threw it away first before going home* </p><p>I dont remember anything til few hours later. I started to remember what I did take and how many and I told him I took 48 pills at once and threw that box and all that at walmart trashcan outside and went home. That's it. I told him I dont want to live. I wasnt happy and doctors plan to take me to mental ward hospital for more testing... boyfriend told them he will watch me for few days til I get better. </p><p>Doctors told him that I nearly died from it.. they think I will be mental retarded after I got out of coma. </p><p>2 weeks later I found out I was pregnant and realized that how lucky I was and feared for that unborn child that time. How does it affect it? And baby born that may 14th 08. she was very healthy. I was happy to have her and I will never go back to pills again. Fear to take me to mental ward hospital and never get out of there again. Yikes. Thank god for my boyfriend now my husband saved me. If not... I will be dead at his trailer if no webcam recorded that day.  </p><p>I never speak to anybody about this ever again... too much drama for me. really.. this shit is not funny.</p>"
}
