{
 "title": "Alot! Opiate Withdrawal Savior!",
 "author": "mmaglioc",
 "citation": "   mmaglioc. \"Alot! Opiate Withdrawal Savior!: experience with Gabapentin (Neurontin) (ID 80286)\". Erowid.org. Jul 31, 2009. erowid.org/exp/80286",
 "substance": "Gabapentin (Neurontin)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Pharms - Gabapentin",
   " ",
   "1200 mg",
   "oral",
   "Pharms - Gabapentin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 80286",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 31, 2009",
   "Views: 31526",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nTo start I was prescribed neurontin for nerve damage following a crushed thumb, I have little feeling in it. To try and remedy the situation I had been doing so many illegally purchased pain meds that I had become addicted to oxy contin. Just when I was at the end of my rope, along came neurontin! A miracle I call it. I is nothing short of a savior. I  mean I was doing over 300mg of oc's a day. I have a huge tolerance for opiates and in my search of things that soften my withdrawals I found that neurontin made it ridiculously easy to deal with my withdrawals... granted I did have to take alot of neurontin throughout the day. I was taking between 1200 and 1600mg  3 to 4 times during the day sometimes more depending on how I felt, which was generally good. I was able to relax... my mind was clear and not a mess like it is when I usually withdrawal. I know I dont have to tell anyone who has gone through it how terrible it is but believe me I tried neurontin in high doses with some pepsi or coke and sat back and relaxed and let the waves of relaxation take over. Its sooo easy. It worked so well that Im on day 7 now and havent felt one withdrawal symptom at all. It saved me life and nothing short of that.<br>As a side note my experience with neurontin is like this: I take 1200mg in one shot and wash it down with a glass of regular soda (helps absorbtion)... and I dont get discouraged if I dont feel better in 15 minutes the first time I tried it it took almost and hour and half to start.<br>Heres what happens when it does start:<br>1. I get chills down my back which feel amazing during withdrawals<br>2. I start to get almost giddy and instantly am in a great mood (wanted to talk peoples ears off) which is a good thing in withdrawal because normally I dont want to see or talk to anyone unless they are gonna give me pills.<br>3. I get the munchies... which is so amazing during withdrawals because it gives me energy I wouldnt get without.<br>4. I get energy that I didnt know I had, and the withdrawals are gone.<br>5. I sit back and relax and feel the waves of euphoria take over and I can do anything I want and feel great while doing it.<br>6.I am able to make it through my day peacefully and OPIATE FREE, which stay on track is the most important message in this... I cannot be an rx junkie my whole life. I have to take the out when I can and never look back, and just be glad I got through it so easy. (which it is on neurontin)<br>7. Imable to get a full nights rest everyday I have over 2000mg of neurontin in my system... (if I only have a minimal amount I would take it closer to bed time and only take like 600mg during the day to feel better and big doses at night to sleep, sleep = very important)<br>8. Repeat for 4 to 5 days if possible.<br>9. stay off the opiates... it tears families and friends apart and causes nothing but problems... <br>10. BE SAFE PEOPLE<br>[Reported Dose: 5000mg+ a day]\n\n\n"
}
