{
 "title": "Sensory Overload",
 "author": "Kurayami",
 "citation": "   Kurayami. \"Sensory Overload: experience with 2C-C (ID 80282)\". Erowid.org. Jan 10, 2010. erowid.org/exp/80282",
 "substance": "2C-C",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "buccal",
   "2C-C",
   "(powder / crystals)",
   "  T+ 1:00",
   "2 lines",
   "insufflated",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 80282",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 10, 2010",
   "Views: 6202",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOccurred: March 09\r\nSetting: To begin, prior to this experiment I had been very ignorant in psychoactives and had only experience with small dosages of mushrooms and bromo dragonfly (thought we were getting acid) I hadn't really educated myself in this area, IE not understanding the dosage.\r\nGo: So me and a friend decide to go to rave in West Oakland, my friend, who we will call J, happens to be completely loaded with rc's from an online vendor. I decide to try it out on the way there under the gums. After redosing several times I determine that doing it this way is certainly not giving me or my friend the effects we desire. The effects at this point are nothing but a little buzz and moderate enhancement of colors. We enter the rave not thinking of it and go inside to party.\r\nAbout an hour later I am looking around for my J and come back to see his blissful eyes staring at me. I asked what he did and he said he snorted it. I became over anxious and instantly took the bag with me to the bathroom. Once I was in the bathroom I wasn't sure exactly what to do, as I had never snorted anything before, nor had I any idea how to determine the dosage. This added to the fact that the oral dose had such a little effect resulted in me putting as much as I could fit on a fingernail file looking thing took one big line with as much as I could fit on it and up it went. I took another one with half as much on it and sniffed it as well.\r\nThe pain was excruciating in my nose, and only seemed to increase as my trip was taking off so fast I wasn't sure if I would be able to handle it. Leaving the bathroom with my eyes watering uncontrollably. I really wasn't sure what I had gotten into, this would be one of my few thoughts for the next half hour as I stumbled and staggered back into the rave. The pain in my nose was really starting to overwhelm me. The taste the horrible bitter taste was everywhere. Every nerve on my insides seemed to be coming alive, the overload on my senses was occurring on every plane. The music, the lights, no longer were perceived but flowed through me leaving an electrical sensation that ripped away all that I knew. For that small moment in time there was nothing else in the world.\r\nAfter one final wave through my body I collapsed to the ground and at this point didn't know where I was. J knew he had to get me out of there and didn't want anyone to call the hospital. So he grabbed me by my shoulders and dragged me out of the place. Meanwhile my trip was going through a rebirth as I could not identify to anything, it was as if I was seeing the world for the first time. Once J had finally got me out of the rave much of the sensory shock was gone.\r\nJ started asking me questions just to try and talk me back. I really didn't have any answers to any of them. I had no idea how I'd got there, and I wasn't entirely sure who he was at the time. I started asking him questions on how I got there, and about 10 minutes later remembered my name and the rest was soon to follow. J then took me to a park to get under control. I remember the squishy playground safety floor stuff at the park making a pretty big impression among the two of us. It was here 20 minutes after we had left the rave that a self concept of myself and memory came back. The recovery of memory came as fast as the loss. What was left was the visual enhancement. But there are plenty of trip reports that get into that.\r\nThe rest of the trip once coming down was similar to other peoples experience with the chemical. I just thought I'd share what I consider to be a unique experience with a very high dose of 2cc, since I haven't seen any other similar reports.\n\n\n"
}
