{
 "title": "Interesting, Very Powerful Substance",
 "author": "raellear",
 "citation": "   raellear. \"Interesting, Very Powerful Substance: experience with Bromo-Dragonfly (ID 80301)\". Erowid.org. Jul 31, 2009. erowid.org/exp/80301",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "81 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Bromo-Dragonfly"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 80301",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 31, 2009",
   "Views: 13445",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm from germany and my English is not too good. I hope the report is helpful anyway. :)</p><p>This is a small summary of the Bromo-Dragonfly-experiences I had so far. My first trip with DOBFLY was dosed at 250uq. I aimed at the threshold dose of the american batch and did not intend to trip the whole day on a high level. </p><p>I dosed the DOBFLY at about 9:00am shortly after breakfeast. First effects showed up at about 1:00h after ingesting the material. A mild and subtle stimulation, felt quite amphetamine-like but without a 'rush'. Similar to the stimulation that all of the 2C-x-substances I tried so far have in common. Pure energy, not very pushy. Electric and synthetic as well. The psychedelic effects started to develop 2-3 hours into the experience. At first, time slowed down and everything became calm and easy. Meditation was very very easy in this state. </p><p>It was a beautiful summer day in June. I heard the children play and sing in the streets. Reminded me of my childhood. I went outside for a walk and ended up meditating in our garden. Beautiful nature! For a PEA, nature looks much too nice on DOBFLY. t+3hrs I decided to get on the bike and ride to a friend's house (30km each way). This proved to be a difficult task since the perception of time and space was altered in a very interesting way. Not comparable to any drug I've taken before. Just feels different, but I can't really tell how. Anyway, I managed to do the ride and had some very very deep and introspective moments while doing that. Beaaautiful landscape and nature. Did remind me a little bit of acid. On the one hand you got the electric and stimulating, synthetic mood of let's say 2CE, but on the other hand there is that deep and fascinating richness wich I experienced on LSD, but not on any other PEA yet.</p><p>At t+6hrs, the bike ride was finished and I met up with some friends to jam a bit. I played bass guitar and it was no problem at all. A lot of energy apparent while playing. Great stuff for making music. The effects gently faded about 12hrs after dosing, sleep was easy at 14hrs. Mild afterglow on the other day, a bit tricky since I had to work. But no problems occurred.</p><p>Second experience were 700uq on a big german electronic festival. I dosed at 10:30pm, the night before I had about 3hrs of sleep in a car and I didn't manage to meet up with my friends because I appeared much too late at the festival. Anyway, I dosed and decide to meditate on a big hill overlooking the whole scene. The DOBFLY kicked in at about 2hrs (surpringly, it took a little longer than the first time) and climbed up very strongly. I started to walk around and dance because the sudden and pushy way of the effects surprised me. There was a deep force present: The force of rising ego loss. t+3hrs I felt overwhelmed by the effects and left the dance floor. I found myself sitting in a dark place and trying to work that egoloss-thing out. I meditated and it got stronger and stronger, but I didnt feel too comfortable leaving my body at this location. Eventually I returned to the crowd and met up with my friends. I managed to push the effects of the drug in a more social direction and shared the stuff with them. The rest of the night was beautiful, but didnt differ to much from my first experience. Just a bit stronger. The effects proved to be excellent for a festival. Good stuff for dancing, talking, walking around and watching other people. Sleep was not necessary until t+26hrs. I slept 3hrs in 66hrs and did not feel uncomfortable at any time. Did not expect this drug to be that easy!</p><p>The last experience so far was 800uq together with 3 friends. I experienced a deep state of ego-loss and mystical union with my inner core. This was an unbelievable powerful experience and felt much stronger and deeper than any LSD experience I had before. No words to describe it. :)</p><p>All in all, DOBFLY is a very interesting and flexible compound. On lower doses, it is nice and forgiving, just great for social events etc. if I want to stay awake for a long time but don't want to get too messed up. Higher doses are deeply spiritual and overwhelming. Egoloss on DOBFLY is an unbelievable deep experience. No toy! No easy tripping! Watch your speed. :)  </p><p>Many people describe DOBFLY as a mild and easy high. This is right, but also depends strongly on the dose and set/setting. Not so many people know the deep and powerful side of this compound.</p>"
}
