{
 "title": "Hash Trip / Kundalini?",
 "author": "i fountain 7",
 "citation": "   i fountain 7. \"Hash Trip / Kundalini?: experience with Cannabis (edible) (ID 80412)\". Erowid.org. Nov 7, 2011. erowid.org/exp/80412",
 "substance": "Cannabis (edible)",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE:",
   "2 ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 80412",
   "Male",
   " ",
   "Not Given",
   "Nov 7, 2011",
   "Views: 2891",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Sat-25-July</p><p>Strange experience </p><p>Went down the road for a couple of drinks (flatmates friends birthday), night started off normal, listening to music etc. Awhile later there were some deserts passed around, truffles and brownies but these contained cannabis.  Just had 1 of each, why not, no commitments at the time Having a good time going up and down stairs (others up there) while coming down the stairs spotted (for the first time) the occupants large ornament of Buddha in some stone colored blue, interestingly placed as you walk down, wow I thought that was cool.  Felt quite high from the sweets, as only had 2 drinks, and started to feel it more and more with racing heart and jelly legs! Thought it was time to head home, just down the road Opened the door, something didnt feel quite right, went to my room, 1 cat was on bed that woke up, meowing and kept meowing wouldnt stop, thought there was something seriously wrong with him, this accelerated the high more, then felt like someone or something was in the house, so checked round, of coarse nothing physical, but something wasnt right and both cats acting strange (mind you-they missing 1 owner who was away).  To the lounge, sat down to try relax because it was intense and heart race, while trying to relax/meditate/breathing  felt powerful forces, spiritual energy pulsing through my body, especially focused on hands, knees, spine, head. Like electricity race up the spine to the head and out the top (no real closed eye visuals except pulsing light).   </p><p>While this was happening 1 thing that crossed my mind was a crystal relation? and also that Buddha a saw earlier This part sitting down wasnt scary (like the cats) but intense, felt like it was more than something that just the plant set off.  Wow.  As far as the cats go, when arriving home earlier I thought they where trying to tell me of a spirit in the house, but reflecting on it a day or 2 later, I have a feeling spirit inside cat? and not able to look at the cats eyes since without unease dont like cats as much now (feel like they are stealing good energy).  </p><p>Didnt get much sleep that morning but when I woke up I felt like I had some sort of awakening! Only sort of similar to 1 or 2 other times in my life - (A SIMILAR HIGH/GOING UP THE SPINE -AFTER JUST SMOKING 1 BUCKET),, (IN SOME WAYS MORE INTENSE THAN SOME OF MY MESC/CACTUS TRIP BUT WITHOUT THE VISUALS).  Had to write it down.</p>"
}
