{
 "title": "Psychedelics on Bupropion",
 "author": "Ronan",
 "citation": "   Ronan. \"Psychedelics on Bupropion: experience with Wellbutrin XL, Mushrooms & 2C-B (ID 80447)\". Erowid.org. Jan 16, 2010. erowid.org/exp/80447",
 "substance": "Wellbutrin XL, Mushrooms & 2C-B",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Pharms - Bupropion",
   " ",
   "  T+ 0:00",
   "3.5 g",
   "oral",
   "Mushrooms",
   " ",
   "  T+ 3:45",
   "0.5 tablets",
   "insufflated",
   "2C-B",
   "(ground / crushed)",
   "  T+ 4:15",
   "0.5 tablets",
   "insufflated",
   "2C-B",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2009",
   "80447",
   "Male",
   " ",
   "Not Given",
   "Jan 16, 2010",
   "Views: 8419",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My main reason for writing this experience is that I've recently started Wellbutrin (Bupropion) 150mg XL and I've been wanting to partake in psychedelics, specifically 2C-B. I checked the experiences online on multiple sites to see if anyone has tried 2C-B with Wellbutrin. Alas, I only found a single, vague, not-so-helpful comment describing it as safe. So I tried it.</p><p>I ate 3.5 grams of Mushrooms around 11:30, and they started to kick in around 12, and a very good amount of effects flooded in by 12:15. I have tried Mushrooms roughly 7 times before this, and this time it didn't seem that the Wellbutrin affected the trip. And I won't go into details of the Mushroom trip because you can read the all ready giant magnificent library of beautiful human experience online. The come-up, plateau and comedown were just like they were on my other Mushrooms trips, in character and time, seemingly unaffected by the Wellbutrin.</p><p>Around 3:15 AM, I broke the 2C-B pill in half and snorted it (I was told each pill was about 13-15 mg). It's burn wasn't as bad as snorting Methamphetamine/Ecstasy pills. (Worst in my opinion is snorting Methadone, Don't do it!) But, for the unexperienced noses of the world, it WILL hurt. At this point the Mushrooms weren't having their super effects anymore, but I was instead gliding down on the stem coming from the cap in the sky. Still influenced by the mushrooms. </p><p>This was my first time doing 2C-B, so at first it was hard to tell apart what was part of my mushroom trip and what was part of the 2C-B. I went outside to smoke a cigarette and colours had started diving into their own shades of dark blue, light blue, metal blue, etc. Tracers were amazing, and I think this is a definite effect attributed to 2C-B: My tracers had blue/green/yellow/red outlines, something I hadn't seen before. I started to understand why people called 2C-B very synthetic. </p><p>After half an hour (3:45 AM), I decided to do more since my body felt fine. I snorted the other half, and then I finally understood what it was. The trees in the distance looked like flagellum arms growing leaves that kept on multiplying. I wish I had done this in the day time! Also because I ended up laying in bed, with blankets from the psychedelia express, until 7:30 AM. I had a bearable amount of stomach discomfort, and some pains in my head that seemed to shoot around. I could also feel my blood pressure being high, and a few small muscle spasms in my legs. The one effect I am not sure if it is the 2C-B, is the day after doing it I started feeling very hot for a couple of minutes. It happened around 3 times that day. None of these side-effects alarmed me though; they were bearable and not terribly uncomfortable.</p><p>I've read that Wellbutrin can decrease the effect of psychedelics, but I didn't find this too true. It contributed to perhaps the raised blood pressure and heart rate, but no more than mushrooms or 2C-B can themselves. The combination of Mushrooms and 2C-B, by the way, is exquisite and grand. My friend who was partaking along with me ate an additional (he ate 3.5g at the same time as myself) 1.4 grams of mushrooms before snorting his 2C-B pill. He peaked on both simultaneously and said it is definitely a very enjoyable experience that he wants to repeat. </p><p>My conclusion is that Wellbutrin is safe to take with 2C-B for me, but if you are on Wellbutrin and are considering it, please consider this:</p><p>150mg XL isn't a high dose, if you are taking 300mg XL, or taking 150mg SR three times a day, there is a higher chance of there being some sort of reaction.  Wellbutrin (as you hopefully know) lowers your seizure threshold. Much more, also, if you're on higher doses than I am. So please KNOW YOUR BODY! KNOW YOUR MIND! And take it slow. I'm sure you'll enjoy :)</p>"
}
