{
 "title": "Religious Experience",
 "author": "Jolly",
 "citation": "   Jolly. \"Religious Experience: experience with Salvia divinorum (20x extract) (ID 80534)\". Erowid.org. Mar 31, 2011. erowid.org/exp/80534",
 "substance": "Salvia divinorum (20x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 80534",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 31, 2011",
   "Views: 3022",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I begin the story with my quest to find this Mazatec herb that was currently not illegal for me in my locality and most importantly, profession. </p><p>After asking around my local and trusted, shadowy contacts, I found a Head Shop that sold the 'Purple Sticky Salvia' 20X strength. I tried purchasing this with plastic (which I really don't care about all the conspiracy theories) and when asked for an ID, the guy behind the counter with Visine stained white eyes freaked out when I produced my 'issued' ID. </p><p>'No way! No man! I heard a story about how people were busted in a sting at another shop for selling it to some army dude. I'm not selling this stuff to you man. Sorry, but no.' I guess some people think the conspiracies run deep. Good for them. </p><p>A few weeks passed, and same guy, same shop, this time chose a less official ID and used cash. I was amused when the guy behind the counter produced a waiver form of some kind that I had to sign. The waiver was horribly photocopied, and I couldn't understand most wording on there. So for legal purposes, whatever it was I signed was null and void due to legibility. His hands were shaking horribly like mine used to when in combat. But from what I was able to read, a few of the bullets emphasized a sober sitter needs to be around. From what I researched, that's VERY important.</p><p>I also picked up the cheapest pipe I could find, that the 'dealer' recommended. It was wooden and cheap, I had to wash it out and clean it extremely well when we got home because I'm pretty sure the debris inside of it was a booger thumbed purposely into the bowl. Damn pot heads!</p><p>It would cost less than $30 for the purchase of these items.</p><p>The reason behind my wanting to do this was for the purpose of experiencing a spiritualistic journey. After a few attempts, the objective was accomplished andWOW!</p><p>Salvia 20X. It took a few tries to figure out how to properly use a pipe for this... </p><p>The lighting was very dim as we sat on the couch in our condo, a few candle lit on the wall concise and some low music on one of the TV stations that I picked, the station had earlier played the theme song from the movie 'Matrix' before I began, so I knew I was on the right kind of channel for the journey.</p><p>Torch lighters burn at a stronger temperature and allegedly that's needed for the chemical mechanics of the mental reaction.</p><p>Immediately there felt an urge, like I was being pulled forward. The same thing that I've seen on a majority of the online videos. But this time I could understand why people always want to stand up.</p><p>It felt like a printing press machine was running a stream of ribbon paper speeding through my body, encompassing me, and pulling me forward and outward into the physical world of my surroundings that existed in another dimension. This also included the strand of drool that was hanging from my mouth. I could feel this drool strand interacting with this wall, or field of intense plain of existence. I could feel this 'Out of Body Experience' but this wasn't something that you'd be able to understand through documentaries that are talked out while still inside the shell of my body.</p><p>My body didn't really exist, nothing existed except for this strong urge to come with whatever it was on the other side of this dimension. I could describe this more of a 'Near Death Experience' than any other thing that our educated series of grunts, which we call language, can explain. That is the only thing that scared me, and that's how important the purpose of having a sitter that you can trust is so very important. The experience only lasted a few minutes.</p><p>I felt something telling me that 'She can't feel what you're feeling' referencing my wife.  'Come with ____ (That word doesn't exist but I could describe it as Us, Everything, God, etc...).'</p><p>I began to feel, as I can describe the effect, as an immediate and intense journey that made an Atheist  My wife said that I was looking at her saying 'I believe in God! I REALLY, REALLY believe in GOD!' while I was shaking my left clinched fist that was holding the lighter.  I sat back down on the couch and slowly waited for me, to dimensionally and spiritually, return to this field of existence.</p><p>My perception was changed, and I was humbled.</p><p>I returned to the world stating how much I love my wife, and how I wanted to continue this thing we call life by spending time with her. How precious this existence is and how we only we have one shot at it. So be good, and enjoy this life we are given.</p><p>It was the most intense state of being that I have ever felt. I can see why people who hear about this want it made illegal, this isn't a play thing, or a recreational party drug.</p><p>I am going to spend my life enjoying this field of existence a little more as it is so very precious. I still consider myself an Atheist as there's no religion that I know of, that man has created, that gets it. </p><p>I have a new respect for ancient Americans in this New World.</p><p>For the record, I do consider myself as an 'Agnostic' (vice my previous Atheist status for the past 15 years) because of this religious experience that I went through when it was still legal in my state.</p>"
}
