{
 "title": "Saved My Life During Opiate Withdrawal",
 "author": "BrockLanders",
 "citation": "Citation:   BrockLanders. \"Saved My Life During Opiate Withdrawal: experience with Gabapentin (for Opiate Dependency) (ID 80581)\". Erowid.org. Aug 20, 2009. erowid.org/exp/80581",
 "substance": "Gabapentin (for Opiate Dependency)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   " ",
   "Pharms - Gabapentin",
   "(daily)",
   " ",
   "  ",
   " ",
   "Hydromorphone",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Oxycodone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 80581",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 20, 2009",
   "Views: 31696",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOk, I've been struggling with opiate addiction for close to 5 years.  It started during my time off work due to carpal tunnel syndrome and I was prescribed 180 Lorcet 10mg per month.  I began to abuse them after about 3 months, and during the next few years, moved up to OxyContin...about 6 or 7 80's a day just to feel well.  After which, I moved up to heroin, first snorting, then IV and IM.  Never shared needles, I work in the healthcare industry, and have access to clean, sterile needles and equipment.  Anyway... I got clean, then in May 2009, I was diagnosed with MRSA, and had to have a I&D, removing about a quarter of my upper deltoid muscle and all the surrounding tissue.  I was hospitalized for over a month, and given IV dilaudid every 3 hours on top of OC 20's every 8 hours.  The addiction was back...after I was discharged, I have been prescribed OC40's ever since, and have been abusing them again...even IVing them and the 4mg dilaudid pills that I've also been prescribed.  Well, I broke out with shingles and was given my normal OC prescription along with Neurontin.  \r\nI've been on Neurontin for 3 days.  I've had absolutely no desire to take my OC's.  No opiates at all in 3 days, and my pain is controlled.  I am active, talkative, eating, and sleeping normal, with no signs of opiate withdrawal.  I've heard that gabapentin also has withdrawal symptoms, but only with prolonged use.  I am hoping to be able to use this for a couple weeks, then the shingles should be gone, and my opiate withdrawals should also be a thing of the past.   I used Lyrica, which I later found out is just a prodrug for gabapentin (pregabalin, I believe) to get off of OCs the first time... but just within the last few weeks did I realize they were related.  This is definitely a life-saving substance.\n\n\n"
}