{
 "title": "A Skeptical Person Pleasantly Surprised",
 "author": "Mike O.",
 "citation": "   Mike O.. \"A Skeptical Person Pleasantly Surprised: experience with JWH-018 (ID 80731)\". Erowid.org. Aug 21, 2009. erowid.org/exp/80731",
 "substance": "JWH-018",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "2 mg",
   "smoked",
   "JWH-018",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Lotus/Lily - Nymphaea nouchali var caerulea",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2009",
   "80731",
   "Male",
   " ",
   "36",
   "Aug 21, 2009",
   "14387",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I tried a couple of herbal smokes that were allegedly laced with JWH-018.  I liked them a lot, and I figured I could save money by buying the chemical itself.  I ordered 2g from an online U.S. vendor, and the package came within a week.  Id heard varying reports on what JWH should look like; some say brown, some say white.  Mine was a quite brilliant white.  </p><p>I bought a Chinese milligram scale on ebay and measured out 2mg of JWH on it.  It was a very small crystalline piece, slightly smaller than the head of a pin.  The scale was cheap, so its hard to say if it was exactly 2mg or not, but hey, it was probably close.  I stuck it in a $20 vaporizer (also from ebay) and fired it up.  Nada.  The vaporizer was obviously designed for plant material, and was such that I couldnt get the JWH close enough to the heating element for vaporization.</p><p>At first I was ticked off, thinking I got some bogus JWH.  Then, I decided to try something else.  I stuck some blue lotus (which is, as far as Im concerned, an inert material) into a small wooden pipe along with 2mg of the JWH.  I took four hits, and got quite stoned.  Very much like MJ, but somewhat shorter acting  I was back to baseline in about an hour and a half.  Definite body stone; it was difficult to do anything other than sit on the couch.</p><p>Buying the JWH itself is much cheaper than going with the herbal smoke blends.  But, from what I hear using too much can lead to a very bad experience.  So, invest in a mg scale as well and youll still come out ahead.</p>"
}
