{
 "title": "Anti-Escapism",
 "author": "Montauk",
 "citation": "   Montauk. \"Anti-Escapism: experience with Spice (ID 80755)\". Erowid.org. Mar 23, 2010. erowid.org/exp/80755",
 "substance": "Spice",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 80755",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Mar 23, 2010",
   "Views: 5644",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[ Erowid Note: As of March 2009, it is unknown whether all Spice products contain the same psychoactive chemical(s) or not. At least one sample of Spice has been analyzed and found to contain JWH-018; other tests have found other substances.] </p><p>In the last few months I have found myself experimenting with a brand of 'spice' products. It is an interesting high because it seems to bring up all my unresolved problems to the forefront. instead of being an escape i find that it forces me to deal with all my issues head on. I know almost every drug had a time where people thought it was gonna change the world, but i truly feel like this is an incredible beneficial experience, excruciating painfull and paranoi-filled but beneficial. Definitely something psychiatry should at least consider.</p><p>The empathy and love on it is amazing and feel like its opening new emotional landscapes for a guy that was always cold and unemotional. i find myself truly loving everyone for who they are and tears flow very easily. It feels like this substance gets rid of my mental filters and lets me see things clearly. Thus when i review my shitty life i realize that's its pretty shitty while when I'm sober it doesn't seems that bad.liek for example I was watching some financial show and it dawned on me that all these people are making this huge deal over some scoreboard  tied to some company and it seemed so ridiculous. I also realize that i should be doing something meaningful with my life and not waste it away smoking weed.</p><p>Anyways, the most important thing for me has been i have taken steps to deal with my problems after i come down and there seems to be a positive outlook on life lately with more love for everyone around me. my friends have tried this stuff and they just get stoned, but to me its really a unique and psychedelic experience kind of like shrooms but shorter and without the hallucinations.</p>"
}
