{
 "title": "Eating Excessive Amount Is Like Tripping",
 "author": "francisco",
 "citation": "   francisco. \"Eating Excessive Amount Is Like Tripping: experience with Hash (ID 8075)\". Erowid.org. Feb 13, 2004. erowid.org/exp/8075",
 "substance": "Hash",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  tsp",
   "oral",
   "Cannabis - Hash"
  ]
 ],
 "footer": [
  [
   "1987",
   "8075",
   "Male",
   " ",
   "Not Given",
   "Feb 13, 2004",
   "22474",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This happened a long time ago, back in my 'crazy' college days but may be of interest because it involves an experience I had from eating hash (something I have read little about from others). I tried this only one other time and had a great experience. That involved a ski trip I went on where I did not know anyone on the trip and therefore wanted to be secretive about getting high, but definitely wanted to experience snow skiing while stoned. Why?</p><p>Anyway, I took a small piece of hash (maybe the size of a pea but probably a little larger) and swallowed it just as a bus was leaving the hotel at 7:30 AM for the drive to the slopes. I think I ate breakfast AFTER swallowing the hash 'time bomb' and thought 'What a way to start the day' as I waited for any results. This seems like a very wasteful way to indulge on hash (which I have not even heard about in years, being pretty far removed form the drug scene now) but hey, I was a college student and had money and time to do such things.</p><p>After about an hour or so, I was incredibly stoned. I had sort of a sleepy, dreamlike sensation going though my head, NOT ideal for something as physically demanding (or dangerous) as snow skiing. I remember the best part being leaving the slopes after only one poor outing on the beginner's slope and finding a restaurant where I restarted the day with coffee and breakfast. I met a couple on their honeymoon who were friendly and talkative. They had no idea I was zonked out of my mind and feeling like each sentence was only babble. Well, I got recharged and skied my heart out making the most out of a unique opportunity and after the success of this 'experiment' a friend and I each ate a much LARGER amount of hash on the plane ride TO Amsterdam later in the spring of '87!</p><p>Why would I be wasting my hash when I could supposedly be 'almost' legally buying it on any street corner within twenty-four hours? Again, there were my 'crazy' college days and it 'seemed' like a good idea at the time. We planned to swallow the hash balls (I think it was A LOT of hash-- maybe the size of the ball used in pinball machines) in the bathroom at the airport right before entering security area where carry on bags are checked. What a weird plan! This was going to be my third trip to Europe from Atlanta and I wanted to make the most of it, I guess.</p><p>Again, like the time I swallowed hash and went skiing, it took an hour or so before the effects started to be felt. This time, however, it took longer and longer to really feel what was going on because of the larger amount consumed. It wasn't until well into the flight I not only felt super-stoned, I felt like I had taken a hit of acid! The constant noise of being in an airplane was intense and scary for the most part throughout the LONG night. Of course, sleep was out of the question and I was so wasted, I could barely communicate with my friend or even hear what he was saying. He seemed to be as uncomfortable as me and we both seemed to realize this was a mistake probably because of the large amount eaten.</p><p>Two particular things stand out on memory, 1) getting a dizzy feeling almost making me fall down when in the restroom which seemed half the size of a phone booth and scary because it didn't provide relief from the constant 'airplane noise' that was powerful and 2) talking with a beautiful Dutch flight attendant (I mean the MOST beautiful woman) who convinced me to try taking a sip of cognac after my meal because it was a custom on this KLM flight. I had just started to relax a little after eating (which seems to happen when tripping) and when I swallowed (a BIG sip - stupid) of this strong brandy or whatever it was, my head felt like it exploded! The pretty woman just smiled at me and probably thought how silly I looked and was for digesting so much hash and having to suffer on this airplane trip.</p><p>I FINALLY fell asleep and came down enough to stop freaking out. My poor friend remained awake the whole 'trip' and got less relief. We were both very much stoned throughout the day when getting settled in Amsterdam and this 'event' set the stage for a wild week of much smoking of hash and pot; fun times mixed with paranoia and unexplainable encounters which I can only imagine seemed as out of the ordinary because of the strong psychoactive substances and good beer being almost constantly consumed. Oh, the good ole days! Oh, eating hash - don't do it. Smoke it since it goes so much further. Its a 'no-brainer' which I felt like on that flight!</p>"
}
