{
 "title": "Blues In The Butt",
 "author": "T#1 + T#2",
 "citation": "   T#1 + T#2. \"Blues In The Butt: experience with Diazepam (Valium) (ID 8077)\". Erowid.org. Feb 8, 2004. erowid.org/exp/8077",
 "substance": "Diazepam (Valium)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "rectal",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8077",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 8, 2004",
   "Views: 58132",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n'Water soluble?' you say about the diazepam Valium.  Yes, it is true! [editor's note: Diazepam is soluble indeed, but only very slightly, about 1000mg/350ml water] Valuim is water soluble, so one can insufflate the crushed pill through the nose.  The tender mucas membranes in the nasal chamber absorb the drug.\r\nThis was the chat my friend, T#2, and I, T#1, had tonight, after a long night of other endevores in synthed pleasures.  Our stomachs had seen the wrath of a night of over-stimulation.  Valium, taken orally or nasally, would have made things worse than things already were.  Myself and my good friend, T2, on the horrible way down from our night of headonism, were in need of sedation.  But, alas, how were we to get the valiums in our blood stream?  \r\nPondering our pressing predictiment, I alluded to a time when I experienced the 'candy kid secret', using another water soluble subtance. . . MDMA.  Skip the stomach and cram! Yes, there are mucas membranes in one's anus.  At the end of our digestive tract, lies a spounge where water (and other substances) are efficently absorbed. And so, simply not giving a fuck, I decided to anally accept a little blue pill.  I had gotten the courage to cram a very large MDMA pill (white buddah) months earlier.  I logically figued that the valium pill would be absorbed through the mucas membranes of the colon area.  At this point, our twitch was becoming more urgent, and our minds were getting the better of us.\r\nLying on my back, with my knees up by my head, staring into a large mirror . . . I relaized the absurdity of the feminine position I held. So, placing the small blue pill at the end of my pinky, I inserted the two into the depths of my anal cavity.  Not too pleasent, but not too painful either.  Looking in-between my seperated butt cheeks, I noticed the blue pill being sucked in as the colon closed shut.  Yucky... smelly finger.  Within minutes, I felt the calming effects of the downer ease my cracked out mind.  My stomach, having been by-passed, did not even know that it's worst nightmare had been avoided.\r\nSo, after an extensive search on anally supposited valium on the net, no similar experiences were located.  This information may help those who need to come down, but who's weak stomachs can not take any more chemicals.\r\nGood Luck and Good Vibes.\r\n-T and T\n\n\n"
}
