{
 "title": "Mind Inside-Out:  A DPT Experience",
 "author": "QuestonReality",
 "citation": "   QuestonReality. \"Mind Inside-Out:  A DPT Experience: experience with DPT (ID 8080)\". Erowid.org. Jul 14, 2001. erowid.org/exp/8080",
 "substance": "DPT",
 "bodyweight": "174 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "31.25 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "  T+ 0:30",
   "62.5 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8080",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 14, 2001",
   "Views: 11598",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n07/12/01  Mind Inside-Out:  A DPT Experience.\r\nDrug: DPT (N,N-Dipropyltryptamine hcl salt) \r\nSubject: Healthy 37-year-old male, 79 kg.\r\nDose: T+0: 31.25 mg snorted.\r\n      T+30 min: additional 62.5 mg snorted\r\nT-15 min:\r\nI am taking this slow, and have a little anxiety about this, since it seems pretty major league, and I dont know what to expect.  So, I will meditate a (short) while to calm down and open up my mind.  Then I will snort a fraction of the powder.  Several sources have indicated that a 125 mg dose might be appropriate for me, but that I should start out much lower, say at 25 mg to get a feel for the physical effects of the drug.  I will do this, but start out with one eigth of my stash (divided by eye), which should be about 31.25 mg.  I will leave out one or two other piles about this big in case I want a boost.  \r\nT+0 min:\r\nWell, I only lasted a few minutes at the meditation, but I think it helped.  I am relaxed and receptive.  My friends most excellent new CD is looping on the computer.  I am in my sacred space in the basement.  I will now snort one line of this substance.  \r\nA cocaine-like feeling/drip in the back of the throat and nose.  A little nastier than coke, and without the numbing.  I am drinking some water.  Then I will go lie down and wait 15 minutes or so to see what happens!\r\nT+15 min:  \r\nA little dizzy feeling, a kind of spacey high-like feeling over all.   I like it just fine so far.  I wonder how far to boost it!?\r\nI have really felt no unpleasant physical effects.  No body load or vibrations as people report.  Maybe I should wait a little longer.  \r\nT+30:\r\nI debate for a long time about whether to boost with one more line or two.  I feel like I could handle much more, so I do both.  \r\nT+45 min: \r\nInterestingly, while the visuals are so far very promising, I have not felt a lot like what I would call trippy.  That is, my mental faculties are functioning normally.  Its just my senses that have gone all fucked up!  This is what trippy visuals are like.  All colors and moving shapes.  Everything blobs up and the comes apart again.  \r\nI have to let go. \r\nT+ 2 hrs 15 min:  I have been longing to express whats going on, and I am finally able to type these words:  Holy shit!\r\nT+ 2 hrs 25 min:  Good.  Good.  Good. Good.\r\nT + 2 hrs 30 min:  I regain full ability to type, and enter the rest of this report over the course of the next hour or so.  \r\nSo cool.  I cant believe how incredibly different and pleasurable this drug is.  It is not the same as tripping on acid or DXM at all.  Its as different as could be.  Whats happening (still, as I try to write this) is that my brain is busy making these metaphors about how its kind of out to lunch about what we forgot to be thinking about anyway, like we had anything better to do.   But meanwhile, the whole structure of my brain and the universe and whats going on and what matters is in flux.  And somebody really doesnt know whats going on in her strawberries and experience and thought itself are stretched and experienced.  \r\nConcepts of brains actually existing and having thoughts like making metaphors is nobodys business when were totally in the mashed potatoes kind of way where our brains used to be.  \r\nIts just pleasurable to be insane for a while and let it run.  \r\nThe visuals are pleasurable.  Everything is sparkling with little flecks of white light and pink and yellow sparkles.  Ive got a soft focus and things are waving around a little bit.  Just distortion of whats there, no objects manifesting.  However, concepts such as visual distortions are so overshadowed by the mere experience of somebodys mixed scooslie hoos, and somebodys manster changerpants.  As I try to articulate the metaphors I find they arent really expressed in full-formed language as much as they are felt and pre-verbalized.  The metaphor machine takes me on a tour of what it means to think, to be, oh yeah, to be an animal who might face physical danger, who lives in a complex society.  Could I hurt myself here?  I dont think so.  Yes, I forget that I have a body that can get hurt, but when Im in that mode of being, Im not really capable of hurting myself.  I could allow myself to come to harm through inaction, so I guess thats why its cool to have been responsible in my set and setting.  Im mobile and squirming around on the floor and moaning and getting on my hands and knees and walking around and lying down again moaning in pleasure.  Im sure this would be very scary looking to a sitter, but its really totally fine.  At times I would have been able to answer coherently that I was OK; at times not able.  \r\nT+ 3hrs:\r\nI wonder when I will possibly start thinking only rational thoughts again, without taking these constant excursions into somebodys metaphor about how my brain is out to lunch.  \r\nIts not so much that things are made pleasurable or painful, its that pleasure and pain are twisted about and scrambled and reassembled and totally taken out to lunch.  \r\nIt felt (feels) like my mind is being constantly taken out from where it normally lives and being turned inside out and spread out on something that claims to be something that matters.  \r\nCertain metaphors or concepts kept cropping up as themes or flavors of the experience.  While I normally just kind of writhed out of control and thought coursed through me, the metaphor making part of my brain was hyperactive, and kept thinking about myself and how certain parts of my body were involved in metaphors that used scrambling or food as the basis for explaining how I was totally insane at the time.  The metaphors also tried to express how I was having a good time, and how it was nobodys business.  It was funny and my thought train made me smile a lot.  \r\nAt the peak, I could not for a while remember that I was a living animal passing through time.  I was time, I was the fabric of the universe, I could even feel myself be the structure to the very meaning of meaning.  Then the meaning of meaning changed, and somebodys cracker drawers.  \r\nLayering and recursion also played large parts.  This is hard to describe.  I felt sometimes like I was around a great mound of something that represented a particular extreme of feeling, such as goodness, badness, sorryness, OKness, or preciousness, and it would build up in layer upon layer of feeling that could be experienced almost physically (as a mental image, not a hallucination).  There was also a characteristic verbal thought that would come with each layered visual and feeling.  Like for a layered feeling about pleasure or goodness, my mind would generate a lot, a lot, a lot, a lot, smarts, presents.  Sometimes a concept would twirl around itself and get wrapped up in a tightening spiral form that squeaked when it could not tighten any more.  Sometimes it would keep tightening for a long, long time in a dizzying ride.  It was relentless at times, but I was not scared.\r\nT+ 3 hrs 30 min:\r\nIm getting physically tired, and feel I could probably go to sleep even as this insanity continues to coarse through me and wash over me.  \r\nI can easily get up, go upstairs and get more water (I did that a while ago) and then totally dissolve my entire mind the next minute.  \r\nAt the writhing peak, it was literally impossible to know where I was, what I was, or what was happening.  I guess thats what ego-shredding means, I was not a self in the world.  The very fabric of the world was changing, racing through me like a river of fire through my veins.  \r\nAs I started to come down, a certain zen-aware self started to emerge, even as the metaphors and drop-outs continued to swirl around it.  It mostly observed that parts of my mind were nobodys business.\r\nI went in and out of the peak experience, often struggling by force of will to regain a sense of self and certainty.  Focusing on the candles and getting up and walking around helped me gain control, and I felt a really good rush of power as I mastered the incredible energy flowing within me and channeled it.  I would be standing there in my room, growling at my pleasurable effort to mentally and physically control the experience.  Then I would let it go and it would wash up and overwhelm me again.  As I let go, the world would kind of dissolve and become patchy and transparent.  Not so much in a visual way, but in every way at the same time.  Like my mental representation of the world was being washed away by splashes of water in the inner-most parts of my consciousness, so that all sensory modalities and mental representations would break up at the same time.\r\nIts very difficult to compare this to other drugs.  I dont think there is any experience Ive ever had that even comes in the same category as this trip.\r\nI dont feel like it was particularly useful psychologically or spiritually.  I saw it as mostly entertainment value.  Its somewhat educational in seeing how my brain works at a low level.  The whole experience wasnt really happening at a psychological level.  It was lower than that.  It was in semantics, meaning, existence, metaphor.  \r\nWould I do it again?  Of course.  Its not to be missed.  There was a general feeling of pleasure associated with making the metaphors and feeling my brains scramble.  Kind of orgasmic type pleasure, but totally unique to being a human on a drug.  There was a base body pleasure that was felt throughout my guts.  It made me moan like sex and made me think of middle-aged men and women from earlier this century enjoying some guilty drug pleasure.  It was along the same lines as sexual pleasure, although it was not the same and was not located in my sexual organs.  To go on that ride, when things are generally pleasurable, is a tremendous experience.  \r\nI did not feel much of what people describe as body load.  Before I peaked, I felt a little shivery and cold and twitchy, but this was minor and was not enough to be worthy of attention as the experience progressed.  I did have some minor temperature issues along the way, and several times I was compelled to shed or put back on most of my clothing.  That seemed to take care of the problem.   \r\nIt was certainly a unique and intense experience.  As far as dosage goes, that was certainly enough.  Im not sure if it could get any more intense than it was.  I think a lower dose might have been less pleasurable, although it might be easier to control and to observe the visuals and the metaphor machine.  \r\nCould everyone handle this?  Absolutely not.  I have no secrets from myself or hidden demons in my mind.  I was not surprised or ashamed about any of the metaphors or visual images I saw.  Im not sure everyone would feel that way.  Bad feelings could easily overwhelm.  Im not sure why mine did not, since everything was so out of control.  Perhaps my meditative preparation and receptiveness helped.  I always felt that things were suffused with OKness at least, bliss at most.  However, for people who dont like being out of control, this could be terrifying.  Control is not an option when your mind is inside out and you dont know what you are.  However, at the times when I regained awareness that I was a human, there was no sense of delusion.  I knew quite clearly that I was experiencing the drug.  \r\nT+ 3 hr 45 min:\r\nI think Ill try to sleep now.  I am almost totally down now, and feel exceptionally lucid and rational.  There is no mental afterglow at all.  I am a bit wired and have some gas, but certainly no physical discomfort or impairment to complain about.  \r\nT+ 9 hrs:\r\nDespite feeling a bit speedy, I was able to fall asleep easily within 10-15 minutes.  I slept for 5 hours, and awoke spontaneously at my normal awakening time, feeling refreshed.  I look and feel normal, and Im hopeful that I can operate normally today at work.  Im a little tired, but nothing that couldnt be explained by the late hours last night.  Physical after effects are almost nil.  I had to blow my nose a bit, but it doesnt appear to be damaged.  I awoke hungry and ate a full breakfast of eggs, vegetables, and V-8.  Gas from last night is gone.  \r\nI remember the whole experience and have had fun writing this trip report.  I look forward to doing it again.\n\n\n"
}
