{
 "title": "Interesting, but Could be Stronger",
 "author": "Alkaloid",
 "citation": "Citation:   Alkaloid. \"Interesting, but Could be Stronger: experience with 4-HO-DET (ID 80904)\". Erowid.org. Nov 12, 2010. erowid.org/exp/80904",
 "substance": "4-HO-DET",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "4-HO-DET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 80904",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 12, 2010",
   "Views: 5321",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nBelow are the notes from two successive trials that occurred somewhere around four years ago. The material was a fluffy brown powder, I was given 40mg and split it into the following dosages. I am an experienced explorer of psilocybian fungi, and so there are numerous comparisons to this throughout the report.\r\n1925: ~15mg 4-HO-DET ingested \r\n1945: Very slightly off baseline\r\n2005: Definate +1. No visuals yet, but peculiar perception of vision and audio. Slight nausea, not worth any concern. (passed within 20 minutes).\r\n2045: A little further developed from previous recording. No visuals. Cognitive abilites still clear. A little shakey.\r\n2115: Cannabis smoked some 10 minutes earlier, faint CEVs, subtle but slow moving OEVs (both unlike Psilocybin). Some slight auditory hallucination, repetitive psychedelic sounds with a quiet ring. Definate change in general perception. +2\r\n2130: Not much progression from above recording, 'tranced out' staring at a particular pattern.\r\n9140: Music is significantly altered. Seems to have some control over current emotion. Sounds better than usual. (Yay Ohm Gnome!).\r\n2210: Ate, taste seemed unaltered. Definately no anorexic effects.\r\n2225: Visuals slightly less prominent, not sure whether it is more the Cannabis wearing off or the 4-HO-DET (probably both).\r\n2300: Feeling close to baseline. Still some minor OEVs (carpet crawling, text warping etc) and fading CEVs. \r\n2335: Visuals gone, just a mild 'stone' now.\r\n0005: Little development from previous recording, a little less 'stone'.\r\n0100: Pretty much baseline. +/- Has been a nice night overall, look forward to trying at 25mg.\r\nTRIAL 2\r\n1830: 25mg 4-HO-DET ingested\r\n1855: Definately off baseline, a little shakey.\r\n1905: Coming up fast. Feeling quite weird, very mild CEVs.\r\n1925: A little more development. Slight 'carpet crawling' and mild CEVs. Head feels alot clearer than with psiloc(yb)in. +2\r\n1950: Mild visual distortion. Not noticeable unless concentrated on. Not as visual, interesting, mind-altering or introspective as psiloc(yb)in - yet there is a similar feel.\r\n2005: Feeling of nice stillness. Not euphoria, but some kind of positive inner warmth. Probably at peak. Visuals similar to psilocybin but almost slower and less predominant. Nice feeling, not too strong, may be a good party drug as it is much less demanding on the mind than psilocybin. As mentioned, nowhere near as introspective as psiloc(yb)in.\r\n2225: Cannabis smoked two hours earlier, slightly intensified visuals and the other mental effects (positive). Possible starting to come down.\r\n2300: Coming down, visuals close to non-apparent. Can still feel mental effects.\r\n00:25: Almost baseline. No visuals. Only a mild 'stone' remains.\r\n0200: Pretty much bassline, +\\-. \r\nNice experience, although again not as strong as I was hoping for. If I get to try it again I'd go 35-40mg and see how that sits.\n\n\n"
}