{
 "title": "A Solid Boost",
 "author": "Experimenter",
 "citation": "   Experimenter. \"A Solid Boost: experience with Adderall XR (ID 80979)\". Erowid.org. Oct 14, 2010. erowid.org/exp/80979",
 "substance": "Adderall XR",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 80979",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Oct 14, 2010",
   "Views: 21282",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI woke up one morning quite tired and knowing I would be barely awake and essentially non-functional before too much time had gone by. I had gotten about 4 hours of sleep the night before which wouldn't be optimal but also wouldn't be too bad except I'd gotten similar amounts of sleep regularly recently and was slowly getting worn down. I had an important (but that I predicted to be very easy) test that morning. I drank a strong (but not large) cup of coffee, let's call it 100 mg of caffeine. An hour later, I received an Adderall. It was 25 mg, and extended release. Having taken roughly this amount before but in instant release form, I knew its effects wouldn't make a jittery mess out of me so I figured it was a safe experiment. <br>I had taken Adderall as a tiredness killer but not in a situation where I'd be, for example, taking a test. I knew it would 'speed me up' but was in uncharted territory as far as its effects on my analytical mind. The following is an account of what I found in that department as well as some physical effects worth noting:<br>(I would assume some of the effects I felt, especially early on, were partially caused by the caffeine. My typical tolerance/response to caffeine means that the amount I had would have me awake but not very alert and not feeling very good with the level of physical tiredness I was feeling. )<br>30 minutes after taking the pill: I sit for the test. I am well awake-- in fact quite energetic.  While I can't directly perceive any effect, I am not frustrated or unhappy to be there working. This subtle change in attitude and emotions, from experience, meant that the Adderall was working.<br>40 minutes post Adderall: The test is going well. Most questions are relatively straightforward... When I need information that has slipped my mind, I recognize I am not going to remember it and move on. Moving back to skipped sections of the test later, even devoting a lot of effort to them, yields no results. This confirms that my decision to give up on them was a good one. A few questions look difficult but after a little thought I decide they are possible and start putting more effort into figuring them out. All questions I have trouble with but decide to work through I get in the end. This increased ability to judge my own potential or odds at something is appreciated.<br>60 minutes: Later there is a longer open ended writing section of the test. I find myself writing very quickly and writing a very large amount. There are many ideas running through my head and I feel I should able to portray all of them. I link them together coherently and in an organized, sequential way without really pausing to think. Writing from my train of thought like that almost always ends badly for me, and I reread what I've done wondering if it will be nonsense. I look over my work and find it to be very wordy but not unintelligible. While things are generally correct they just sound way too long. I scribble out about half the words I've written and once the whole passage is streamlined I find it to be overall well assembled. All told I take more time than almost anyone else, just because I kept writing and writing.<br>2 hours: I hypothesize about potential benefits on tests such as the SATs. On the surface an increased short term memory and comprehension ability as well as better memory recall sounds all good. However I'm overthinking things now, and things that might be complex or disjointed (such as my writing) makes at least some sense. I use long wordy sentences because I can keep track of all I'm trying to convey. The SATs have many questions with similar answers and multiple ones could in some way be justified-- one is just the 'best' answer. In my current state I would likely end up talking myself into some nonsense responses, thinking that they made perfect sense. A 'brain enhancing' drug like this seems like a good idea until you realize that its doing really weird things with your brain too.<br>4.5 hours: It's time to eat but I am not hungry. I feel no nausea, which is nice, but I have little desire for food. I keep working on a random assignment which seems like a reasonable thing to do, while I down half a sandwich and call it a lunch.<br>5 hours: Through the whole day I've been incredibly engaged whenever I've needed to, not just able to shut up and work, but actually finding almost everything I'm assigned interesting and making the most of it. Now though, the 'hyper' buzz I was feeling is fading, though I feel like I have a lot of energy left. I still couldn't fall asleep, that much is for sure, but I'm also feeling like the day might go downhill from here if the Adderall is wearing off.<br>5.5 hours: On a physical note, my heart rate is very high. I did not take my pulse but I would estimate 120, almost double what it should have been. Dehydration can increase heart rate and for me it does very severely. It makes sense that I am dehydrated, caffeine alone will do that and I haven't been drinking enough to compensate. The Adderall, I figure, must also raise my heart rate. It's possible Adderall contributed to dehydration also, I don't know.<br>I start making a point to take in lots of (caffeine free) fluids.<br>On a mental/more abstract note, my thinking is still fast... it's just no longer any good. I ramble on about things if someone will listen, rush to process things I hear or see, overall think like I'm really hyper... but now I keep forgetting what I'm talking about mid-sentence. Single words hang me up as I try to remember them. At this point I am acting like I'm sleep deprived and a little loopy. I don't feel bad but I don't feel smart or on top of what's going on anymore. I feel like this is what it would be like had I never taken the Adderall... something is still affecting me, keeping the desire to sleep completely out of my mind (even though I'm starting to feel 'tired' I'm not 'sleepy').<br>6.5 hours: My heart rate is high but no longer worrisome, far slower than the last time I noted it. I believe this more moderate increase is the effect of the Adderall alone now that I've been drinking enough water. Though I've been feeling like it's wearing off and I'm now dumb and tired, there is definitely something stil keeping me going. Any feelings of having extra energy or being 'hyper' are gone, but my mind isn't done being active yet. I'm still alert, though now I'm fighting off exhaustion that should have come a while ago had I not taken Adderall.<br>7 hours: I should be/would be all but asleep right now, possibly I would be literally napping on my desk. I am not, and have to assume it is an effect of the slowly fading Adderall still in my system... but right now I'm not feeling like its influencing me. I'm feeling slow, tired, uninterested, and otherwise like I shouldn't be awake. I want to go lay down, but I don't want to sleep. That's still out of the question.<br>Past here any effect tapers off slowly and uneventfully, and when I go home and relax I don't feel so wiped out. By 10 hours past taking the pill, I'm totally baseline and the only aftereffect other than mild fatigue I expected from the normal events of the day... and an elevated heart rate, for a very long time afterwards. Though it didn't have much of a noticeable effect I don't think it's a good thing, and it makes me wary of increasing doses. Anything with that effect in normal doses could probably be very harmful if too much was taken.\n\n\n"
}
