{
 "title": "A Good Way to Sweat",
 "author": "PVPS",
 "citation": "   PVPS. \"A Good Way to Sweat: experience with Finnish Sauna (ID 80976)\". Erowid.org. Feb 20, 2011. erowid.org/exp/80976",
 "substance": "Finnish Sauna",
 "bodyweight": "115 kg",
 "header": [],
 "footer": [
  [
   "2009",
   "ID: 80976",
   "Gender: Male",
   " ",
   "Age at time of experience: 28",
   "Added: Feb 20, 2011",
   "Views: 3088",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI was reading about health benefits of sweating and topics about different sweating techniques. In Finland almost everyone uses SAUNA to sweat and get clean. it's suitable from young children to old people. WARNING! If someone is having heart problems they should consult with their doctor before going to sauna. But it's also shown that many heart patients benefits from sauna use. SAUNA lowers your blood pressure by stimulating blood circulation.</p><p>Usually we go in sauna with friends or family. AND YES... we get there naked (it's quite dark in sauna usually and in Finland it's normal to see other people and your parents naked, not that we are exibihionist or anything :) ). Sauna is pre-warmed with wood or electric power to 60-100 C degrees. Most people prefer wood because it's a lot smoother and more moist and the aroma is nice. </p><p>First you wash yourself lightly and wet your hair. Then you go and sit on tall benches near the bath house stove (KIUAS in Finnish). Throw some water at the stones to make steam appear to make sauna feel warmer. the steam also cleans your pores and helps with insect bites etc skin problems. The term for doing that is 'heittää (throw) LÖYLYÄ. Stay inside sauna as long as you feel comfortable. Usually the head is the first place that starts to feel too hot. for that you can either pour some water on your head or use  sauna hat or some kind of wet scarf wrapped around your melon. Some people use also a thing called VASTA or VIHTA, which is a bundle of birch branches tied together with leaves left in. With that you can hit yourself all over you body during the 'LÖYLY'. it's really healthy and cleans  and scrubs your skin. WARNING! if allergic to birch you might get some rash from vihta.</p><p>After a good sweating in sauna clean yourself with water or jump in the nearest lake. In winter you can also go swimming in a hole in the ice. Icewater swimming has also many good effects on health...</p><p>Sauna makes me feel comfortable and restful afterwards. It really cleans every cell of the skin and helps with respiratory problems. Warming good old wood sauna is kind of a ritual on its own and often brings people together and loosen the atmosphere even among people that don't know each other before.</p><p>That's the sweat dropping treatment in my life.</p><p>[Reported Dose: 10-60 min]</p>"
}
