{
 "title": "Destiny Calling",
 "author": "Sleepor",
 "citation": "   Sleepor. \"Destiny Calling: experience with Salvia divinorum (ID 81037)\". Erowid.org. Oct 31, 2013. erowid.org/exp/81037",
 "substance": "Salvia divinorum",
 "bodyweight": "127 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2009",
   "81037",
   "Male",
   " ",
   "16",
   "Oct 31, 2013",
   "413",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For the most part the only drug I do on a regular basis is marijuana, but I've dibbed and dabbed in a select few chemicals. I've had a long-lasting affection for pain pills, preferably Hydrocodone.  And if its going to be Hydrocodone, it'd better be a Watson 387-503.  Other than that I've taken a tab of ecstasy once, and loved it, but it isn't something I would do on a normal routine. I've seen the dangers of prolonged exposure to serotonin overload, and it doesn't look pretty. Know what I'm saying?</p><p>I've read everything there is to know 'technically' about Salvia. That is, I spent hours scouring the Internet in a way to understand this unknown and mysterious plant, a plant that seemingly had been in use for centuries. I had only recently heard about Salvia in the last three to four years; other than that its only been a digital rumor to me. Until last week when I looked up my state's legalization on my newfound sensation, and I started maneuvering. I scam forty dollars to pay for an outrageously taxed, government farmed black powder.</p><p>Well, it wasn't totally black powder, but it was black and chopped up leaves. Honestly, it was toxic looking, and at first I had second thoughts. I was thinking of what was I getting myself into, how will I cooperate with this thing. Just the random nonsense that comes with doing a deed for the first time, nothing more nothing less. I was leaning on the edge of doing something that I knew would take me beyond anything I had ever coped with, anything I had ever imagined. I was nervous as I stood on the doorway to oblivion.</p><p>Then the scent of green tea wafted up from the tiny plastic cage. I tingled with the softening smell of a friendly, relatively common household item, and I was shocked. I first thought of smelling a weed type of smell, or at least a stale, cardboard flavor. Instead I greeted the packaged black shrapnel with the same love it approached me with, a burning love.</p><p>Along with the Salvia I had picked up a glass lip burner, roughly the size of my extended fore finger, and I christened the new little smoke toy with anticipation. I had read that it only takes a pinch or two to get obliterated, so I packed half a bowl and unsheathed my torch lighter. </p><p>Sitting down in a low-to-the-ground stool, I placed the pipe to my lips and hesitated one more time before diving in. I lit the bowl and it held a cherry nicely. I released the carb and slowly inhaled. Immediately I noticed a difference. The smoke stung like tiny needles darting all throughout my lungs in a rhythmic fashion, like a pulse. I held it in as long as possible, and breathed out. I had no earthly idea what was to come next, but I had suspected a pot-like buzz or some kind of familiar euphoria associated with most things smoked. I waited about ten seconds and felt something that I now describe as a stopwatch.</p><p>I felt like I had just initiated the start of something so grand and my biological clock was counting down to liftoff. I began to hear voices - they were faint and far off, nonetheless they were there. Then there was something grabbing my spine, trying to grip the back of my neck and wrench me from this dimension. I had an impression of being yanked backwards through an infinitely small rip in the fabric of space and time. I was being corkscrewed through a wrinkle in the universe, twisting ever so fast round and round on this merry go round of insanity.</p><p>The voices were getting closer, and the motion of my body was keeping pace with the vortex swirling around me. In retrospect, I think my vision was too fuzzy to make anything out. I don't remember even trying to focus on any one thing, everything just seemed to collide in peaceful cacophony. Images bean to float into my mind. Foreign, alien things just bounded between the walls of my skull, but I couldn't focus on any one particular thing.</p><p>I felt like I was trying to wriggle myself out of my body, like a forced out of body experience. I knew I was no longer on the same planet, let alone astral plane. I was so far out in the universe and reality seemed so unreal. I sensed that I was surrounded by an all powerful and omniscient energy. It was watching over me and guiding me through this wonderful torment. I felt calm that moment and I attribute that energy feeling to God keeping an eye on me as I left Earth.</p><p>The corkscrew feeling intensified, twisting my body through that tunnel of light speed. Just as I sensed that I was about to reach my destination, sobriety hammered me like a biased judges gavel. I found myself sitting in the exact position I left in. I looked down and it seemed that I drooled a little onto my shirt, but other than that there was nothing. It was at first an extremely uncomfortable position to be in. I had just spent what felt like the past three hours jetting about the galaxy and chilling with the ethereal astral inhabitants only to be shoved unceremoniously back into my body with no souvenir to boot. I had never experienced a crash as abrupt as that of Salvia.</p><p>The pipe was still in my hand, thankfully, but the lighter had drifted to the floor. I looked around my garage in awe. I had a little trouble standing up, but only because I was about to piss my pants at what just happened to me. Nothing in the world, absolutely nothing could have prepared me for that. No story or personal account could come close to describing the power and raw strength of this scented black powder. I looked around with a new sense of enlightenment. I felt serene. I felt like I had a place in this chaotic world, and I was fulfilling a role designed for my soul only. Everything was interconnected, in some bizarre way. I could feel the force of destiny tugging at my feet to walk the path that was laid out for me centuries before I entered the womb. I felt my consciousness expand in a subtle way.</p><p>The next several hours my friend and I sat around and tried to wrap our heads around this plant, and how it held such a prophetical glory that seemed to broaden our horizons. Salvia is something not to be meddled with by the casual amateur transcendentalist. This drug has the potential to transport you to worlds you have never known existed. The mental world that this projects you into cannot be predetermined, and if you don't know what you're doing, I recommend watching a friend trip first. And in every scenario always keep a trip sitter, somebody there to guide you through your spiritual sojourn.  </p><p>Peace.</p><p>P.S. I'm writing this section of my paper a day after and several fully packed bowls later. Salvia is something very spiritual. It has an indescribable effect on the soul, in ways that are greater than most life changing experiences. I walk away from this a changed individual. I feel that I see the world the way it really is. Everything in this life has some amount of purpose to it. Everything, from the slightest twitch of a tree limb to a green light suddenly going red. There are metaphysical strings attached to everything in this world, and all events that take place under our sun are connected and have purpose on a grander scale. Salvia is not something I would recommend for recreational use, at least not on a daily basis. It is more like a refreshing breath of enlightenment every now and then that can keep a positive beat reverberating through your core for days to come.</p>"
}
