{
 "title": "Off The Hook",
 "author": "Dru",
 "citation": "Citation:   Dru. \"Off The Hook: experience with AMT & 5-MeO-DMT (ID 8108)\". Erowid.org. Jul 23, 2001. erowid.org/exp/8108",
 "substance": "AMT & 5-MeO-DMT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "AMT",
   "(powder / crystals)",
   "  T+ 4:00",
   "10 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)",
   "  T+ 4:02",
   "5.0 mg",
   "insufflated",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8108",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2001",
   "Views: 7059",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nWell today's experience with the AMT was less than satisfactory,now it's time to try some 5-MeO-DMT. Actually it's still only been 4 hours since I took the AMT and was going to wait until tomarrow to take the 5-MeO-DMT but I needed something to rescue me from this stupid AMT B.S.. Earlier I felt that I had to eat and seeing as how it was almost 4 hours since I ingested the AMT i felt that I should eat something. So I ate 1/2 a slice of cold pizza(probably a mistake). \r\nWell I couldnt wait, I read that the effects of the 5-MeO-DMT are less intense and longer when snorted. So I eyeballed a small line and blew (snorted) it, there was a tiny bit of pain but barely noticable after a while and well worth it.  Well, I had blown about 10mg and I thought it was supposed to hit me almost right away, I think a minute or 2 went by, I wasnt sure but I wasnt feeling much, so I blew another 5mg.\r\nWithin a few minutes I was getting insane crazy visuals like I've never gotten before. At first I remembered how 5-MeO-DMT was supposed to be not very visual. HAH! Not very visual indeed, but then I realized I have to take in account the AMT even though it really didnt do squat when I was on, it must have had a big effect in the high, after all it was a tryptamine, and an MAOI at that.\r\nMy heart was pounding like crazy. I didn't have the mental capacity to do anything like take a pulse but I imagine it was dangerously fast. I felt very sick, it must be from the pizza and I was already feeling sick from the AMT. By the way I washed my hands for hours with all kinds of soaps and the AMT stench was still in my fingers. Every time I felt like I needed to puke, I felt that I couldn't. The intensity was still building and finally I puked. Even though I had eaten some pizza, all I saw was foam come out which struck me as weird, although I dont have too much experience with puking. \r\nI had to lie down. My heart was still beating really fast and I felt I should try and relax to settle it down which didn't really work. But the visuals, the visuals where amazing everything was flowing around me, I knew in my mind that since I had snorted it, it wouldn't become too intense...even though I have no idea how the AMT might effect it, but I doubt it do too much. Well I started to feel a little better and the visuals where still pretty intense so I decided to put on a CD. I had to put on what I thought was one of the greatest cds ever mixed. HAPPY2bHARDCORE chapter 4. \r\nThe music was alright nothing too great, it would sound better on pot I thought, and definitely better on acid. The music sounded like it kept getting closer and further away, quieter and the louder, it was wierd, but not as good as I had hoped it to be, but the visuals where still off the hook. But gradually diminished. Even though they were sooo strong after 40 minutes they were now completely gone.\r\nWell it looks like we have a winner here, out of the 3 new drugs I purchased (Salvia 5x extract, AMT & 5-MeO-DMT) the 5-MeO-DMTis the only drug that produced anything enjoyable, and it was quite an enjoyable experience at that, if I hadn't gotten sick and if I hadn't thought there was a possibility my heart might explode it would have been perfect.  Too bad it was so short lived (so much for the MAOI workings of the AMT). Oh well, there's more were that came from :). I cant wait to see if maybe the same thing will happen when I'm not on the AMT.\r\nI cant to see what will happen when smoked. But from what I just experienced this is the stuff. Although many report a good body high from it, bliss they call it. I got nothing in that aspect. I did feel better than when on just AMT though, so basically I felt almost regular again. But both the body high that AMT is supposed to produce and the one that 5-MeO-DMT was supposed o produce were not there at all. Oh well it was still really phat visual-wise, i guess nothing is perfect.\n\n\n"
}