{
 "title": "An Emotional Burden",
 "author": "FDG",
 "citation": "   FDG. \"An Emotional Burden: experience with Mushrooms & Cannabis (ID 81108)\". Erowid.org. Oct 7, 2010. erowid.org/exp/81108",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 81108",
   "Male",
   " ",
   "Age at time of experience: 18",
   "Added: Oct 7, 2010",
   "Views: 1474",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A few nights before most of my close friends and I headed our separate ways to go to college, we decided to try mushrooms again. I had tried them once previous, taking 2 grams. The experience was mostly positive and I remember feeling very peaceful and serene the following morning.</p><p>I talked to one of my buddies and he said that he could hook us up with some quality, homegrown shit that his friend had. My friend T and I each bought an eighth and headed to my house to ingest the shrooms. Another friend - J - who had experience with mushrooms volunteered to be our trip sitter. At about 8:20 PM, we each ate our eighth, using water to wash down the bland taste. We then packed a quick bowl and went outside and smoked it with J on my deck. Feeling pretty high, we went back inside and attempted to play video games.</p><p>After about 20 minutes, my head started to feel light and I became much more talkative, a feeling almost like being drunk. By 9, I began to notice the windows in my family room moving in almost a breathing pattern. Realizing that the trip was beginning, I sat back and began to enjoy the visuals. It wasnt anything profound, there were no giant pink unicorns in the room, but it definitely looked cool. Every thought that went through my mind was analyzed and reanalyzed as if my brain was trying to decipher normal thoughts from high thoughts.</p><p>It was a clear night outside so I encouraged J and T to come with me on a walk around the neighborhood. T and I both noted that stars seemed to be especially bright. I noticed patterns in the sky that I had never previously noticed. I swore that I could see the face of Jesus outlined in the stars. None of us being very religious, this caused a great uproar between all three in our group. We asked J to decide whether what I was seeing was real or the figment of my imagination. Unfortunately, J had been drinking steadily for the majority of the night and thought it was hilarious that T and I both were pondering about Jesus in the stars. When we returned to my deck, I really began to enjoy the trip. We sat there talking about nothing in particular. T kept staring at the house next door, which is slightly set back from mine. He claimed that the only lit up window visible to us was changing colors. I didnt see this happening, but I figured every trip was different. Everything seemed funny too, it was a wonderful feeling.</p><p>Around 10 PM, my friend N called me and asked to stop by, which I gladly agreed to. He showed up while J, T and myself were still sitting on my deck. T informed him that we both ate an eighth and, being an experienced tripper himself, N began to try to fuck with us by waving his hands in front of our faces and asking us questions which forced us to think in circles. After a few minutes of this, he stopped the shenanigans and the four of us agreed to smoke a bowl together. I threw my bag of weed to J and told him to pack a fat one. I did not really consider the fact that J was barely able to stand up at this point. The bowl went around a few times but I think I only took a hit or two, not really needing the weed.</p><p>We went back inside to watch TV, all of us some form of intoxicated. It was an episode of COPS that I had watched earlier that afternoon and yet I began to notice that some of the scenes appeared to be different than ones that I had remembered. I wondered how closely I had been paying attention earlier. I also began to notice that I wasnt having any profound visuals. I believed the trip to be almost over, despite the fact that it had been only about 2.5 hours since I had ingested the shrooms.</p><p>We went back out to the deck to smoke one final bowl before everyone went their separate ways for the evening. I noticed the light on in the upstairs bathroom and I knew, along with my friends, that my sister was up there. We all began making very loud jokes about her (I do love my sister  these were not mean spirited at all), not believing she could hear us. We were being quite obnoxiously loud, however, and I watched in horror as the light shut off in the bathroom and my sister walked down the stairs and out to the deck. Now, my sister knows that we smoke pot but the fact that I was tripping, combined with her turning on the light, scared the shit out of me. She confronted us about the jokes and told us to knock it off. I apologized to her, afraid to look up at her for fear that she would see that my pupils were the size of marbles. After she went back outside, J and N began laughing hysterically while T and I had our jaws drop. We agreed that it would be best if we went back inside after we finished the bowl. Now, my heart was racing and I could feel my trip beginning to change.</p><p>At around 11:30 I began to feel an intense fear, one which I cannot describe in words, coming over me. I dismissed it as paranoia stemming from the confrontation with my sister. J, who lives right up the street, got up and announced he was heading home as did N, leaving T and I alone in my living room. T and I attempted to have a conversation, one in which I attempted to convince myself that I was sobering up. We talked about the night and how the trip was going. We both observed a poster in the room, which appeared to me to be moving in a distorted, twisting pattern. However, T too had to go home. I made sure that he was OK to drive and, after he assured me that he was, he too departed for the night.</p><p>I went to go upstairs, but I first made a stop at my sisters room. I apologized for our earlier actions, making sure to do so in a dark hallway so that my pupils would not be easily visible. I went to my room, turned off my computer and tried to sit up and a read a book. Alas, this was not to be. The words on the page appeared as if they were melting away and, although I had read the book before, I had a hard time following the story. I was taken aback by every sudden change, almost as if I was a character in the story. Realizing that reading was not going to do me, I tried to sit down and watch TV. While doing so, I found that my thoughts took me over. Fear began to creep in again. A small calendar on my wall, along with all of my posters appeared to be rising and falling.</p><p>Worst of all, I began to experience a very strange feeling my stomach. I couldnt decide whether I was going to puke or not, I wasnt even sure if the feeling was real or if I had just made it up. I went downstairs, got water, and tried to pace around and calm myself. Still, the feeling in my stomach persisted. I went back upstairs and tried to watch more TV but found myself extremely restless in bed and unable to focus. I tried to turn the TV off and sleep but this only made things worse. My mind was racing with thoughts of how I was going to be alone in the world in a few days and how things would never be the same and how I faced the prospect of living the rest of my life as an outcast. By now, I just wanted the trip to end.</p><p>After another half hour of restlessness in bed, I tried to get up and puke. However, I only found myself able to piss. Staring at the rug in the bathroom, I noticed all of the little fibers moving in a wave pattern. I tried to look at myself in the mirror, but I found that something about my appearance was off, I didnt look normal and I couldnt figure out why.</p><p>The pattern of stomach pains, trying to puke, drinking some water and trying to sleep persisted until about 2 AM, when I was finally able to get to sleep. When I awoke again at around 3:40, I at first felt that my head had been cleared. The visuals had pretty much gone away, but I found myself void of almost any thought. I felt as if a chunk of my personality had been taken away and that I would never be able to get it back. I truly believed that I was never going to be the same person again. I was still restless and I found it nearly impossible to get back to sleep. I eventually got down on the floor of my room and did some push ups, trying to stimulate my body a bit. Im not sure how, but I somehow was able to get back to sleep. When I awoke the next morning, I felt a bit depressed but also relieved to find out that my personality had come back to me. After a few hours I felt pretty much back to normal, albeit still freaked out from my trip.</p><p>I realize now that I made two crucial mistakes. The first was that I took the shrooms at a time of great change in my life. All of the combined emotions of college and leaving my friends and home likely contributed to the great fear that I felt. The second was that I spent the last hours of my trip alone in a dark room. I believe that had I still been around my friends at this time, I would have been able to manage my fear and I likely would have come out of my trip alone.</p>"
}
