{
 "title": "An Insane Feeling of Euphoria",
 "author": "annonymous",
 "citation": "   annonymous. \"An Insane Feeling of Euphoria: experience with MDPV (ID 81118)\". Erowid.org. Feb 16, 2010. erowid.org/exp/81118",
 "substance": "MDPV",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "7 mg",
   "insufflated",
   "MDPV",
   "(powder / crystals)",
   " ",
   "7 mg",
   "smoked",
   "MDPV",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 81118",
   "Male",
   " ",
   "Age at time of experience: 19",
   "Added: Feb 16, 2010",
   "Views: 16328",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article] </p><p>I'm just wanting to write a brief report of an experience with mdpv, first of all I'll explain abit about it, I think it is a purely dopamine releasing drug and it has been compared to coke when snorted. It is legal where I live and it'll is probably legal in most other parts of the world and it is also very new.</p><p>Now my experience with snorting it, I did quite like but I couldn't really say it was that much like coke, I just basically had a greater feeling of motivation and could do a lot more stuff. Now this is obviously quite useful, but not very good, if you intend on doing for recreational purposes, however this is just my reaction and there are other people who have had a different experience suggesting its good recreationally.</p><p>Now I am going to talk about smoking this stuff, I tell you it was like doing a totally different drug, I'd take a hit and get a insane feeling of euphoria for I think about 20 minutes to half an hour. I became addicted straight away (I'm very lucky because I lost the bulk of my stuff which was annoying at the time but I'm very glad it happened) and it was SO easy to smoke far too much. I thought I was going to have a heart attack because my heart was beating faster than it ever had done in my life for like 6 hours or something and I could feel my heart getting tired and you would think that would of put me of doing anymore but I ended up smoking more just a couple of hours after that. </p><p>My conclusion is that if I'm going to experiment with drugs stick to the well studied drugs(illegal)(I wouldn't condone breaking the law, I'm just saying that these research chemicals are much more risky than the illegal ones) that can be used safely as long as I'm moderate, make sure the supply is clean and approach with caution.</p>"
}
