{
 "title": "Prisoner to the Spinning Sphere",
 "author": "jpok",
 "citation": "   jpok. \"Prisoner to the Spinning Sphere: experience with Salvia divinorum (ID 81112)\". Erowid.org. Oct 28, 2013. erowid.org/exp/81112",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 81112",
   "Gender: Male",
   " ",
   "Age at time of experience: 24",
   "Added: Oct 28, 2013",
   "Views: 363",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I once bought a little bottle of Salvia 10x extract at a headshop without any definite plans of using it. It sat in my closet for months until one day I decided the time was right to try it.</p><p>I have had a handful of psychedelic trips in the past. I try to use these drugs in a healthy, constructive way. But I would find out that as opposed to LSD, my intentions would have little effect on the character of the experience with Salvia.</p><p>The setting was my basement. I spread out a sleeping bag on the floor. My girlfriend sat nearby. As I was uncertain about the dosage, I started very small, probably about 20mg. I soon noticed an interesting spinning effect. I was not spinning, but something was spinning through me and everything. I took another hit, probably about 30mg. The spinning sensation was now stronger, but I was still very grounded in reality. At this point I was enjoying the effects quite a bit, but wanted more to reach a visionary state.</p><p>I took one more hit at least as large as the first two combined. I set the bubbler down and my girlfriend picked it up and set it on my desk. Then she sat down. The exchange probably took 5 seconds, but I perceived it to be more like 30 seconds. By the time she sat down, I had suddenly transitioned into a complete lunatic.</p><p>My plan was to close my eyes and maybe lay down went out the window. Instead I locked my eyes on my girlfriend's. A paranoia far deeper than I could have ever imagined crushed me. I felt my entire life up to that point was an elaborate ruse leading directly up to that moment. I was led to believe I had a relatively happy existence but it was not real and I could never go back to my previous life. It was like a child's room that would be forever locked.</p><p>She did not expect that I would fix my eyes on her. She was smiling back at me, probably trying to have a positive influence. In my state I believed that she had tricked me. I desperately tried to ask her if it was true, if she had foreknowledge that this would happen. But I was speaking gibberish, so she did not respond.</p><p>My anger gave way to dejection. There was no longer a three-dimensional space, nor the passage of time, though I vaguely recognized the room I was in. The spinning motion I sensed earlier was now all-encompassing. It was like there was a non-material sphere spinning violently. And everything was part of it. My girlfriend's eyes were like the eyes poking out of the sphere, mocking me.</p><p>Of course, my deranged and absolutely locked stare at her made her uncomfortable, so she got up to go across the room and sit on the couch. I recalled being led by her like a prisoner in handcuffs. In reality, I got up and followed her.</p><p>I noticed anxiety in her eyes while I was staring intensely at them, trying to get an answer regarding my fate. This led me to believe that perhaps she had not in fact tricked me into being snatched out of the world. But the drug was still going strong, so I wasn't sure if what I saw in her eyes was genuine or if she was in fact a malevolent sorceress.</p><p>When I sat next to her on the couch she suggested I take off my shirt because I was mumbling about my sweaty armpits. I interpreted this as a command to a prisoner and promptly complied. Then she asked if I wanted her to touch my hand. This seemed like a sick joke to me, because I still believed myself to by prisoner to this alien world and nothing could possibly free me.</p><p>But to my surprise, I started to return to the world as she touched my hand. The drug was simultaneously wearing off. For about 10 minutes I had a slight suspicion that reality was fake.</p><p>When I truly believed I was back in my old body and three-dimensional space I was very happy to be back! My girlfriend was sleepy, but I had lots of energy and had to go out for a walk in the night. I watched the full moon slipping in and out of the clouds.</p><p>There was no lasting harm from this experience despite it being without a doubt the most disturbing moment of my life. The weight I had previously associated in my mind with being paranoid was like a drop in a bucket of water compared to what I felt. I was absolutely defeated by Salvia. But the main reason I almost certainly won't try it again is not the terror I felt, but more precisely it is the fact that I had not one bit of control over the trip. At no point could I remember other people's experiences and remember rationally that I was in a temporary state. Nor could I remember that I wanted to meditate. Instead I was utterly convinced that I was eternally destroyed through a trick.</p><p>Of course, if you're thinking of trying Salvia and you're like me, your curiosity won't be satisfied by this story and you'll still want to try it. And my intention is not to dissuade you. Like I said, I wasn't harmed by it. But beware that despite your best efforts, there may be little you can do direct or guide the trip. Salvia asserted control.</p><p>I have a couple of speculations about how to increase the chances of a more interesting experience. First of all, if I had taken a little more, I might not have been in this distracting situation of trying to reconcile the world I could still see (my basement) with the new alien world (all-encompassing spinning sphere). Also, it seems like the split second before I left my normal state was crucial. I was distracted by my girlfriend moving my bubbler. Perhaps if I remembered to close my eyes and lay back instead of watching her I would have been able to experience visions instead of locking eyes with her and being pulverized by a wave of paranoia.</p>"
}
