{
 "title": "A Rich and Beautiful Sleep",
 "author": "Noddy",
 "citation": "   Noddy. \"A Rich and Beautiful Sleep: experience with Calea Zacatechichi (ID 81155)\". Erowid.org. May 11, 2010. erowid.org/exp/81155",
 "substance": "Calea Zacatechichi",
 "bodyweight": "54 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Calea zacatechichi",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2008",
   "81155",
   "Male",
   " ",
   "29",
   "May 11, 2010",
   "20331",
   " "
  ]
 ],
 "report": "<p>I bought some dried calea after reading intriguing reports that seemed inconclusive - some suggested it 'worked' in some way, others not at all. </p><p>After receiving the dried herb, I tried on various occasions to smoke joints of pure calea and the result was inconclusive: I wasn't sure if I was really feeling any different or if my sense of awareness was just heightened in anticipation. Most of the experiences reported involved either smoking the herb or drinking a tea made from it, described as pretty revolting. I decided to try another way. I took a handfull of the herb and put it in a small plastic (ex-water) bottle and filled it with wine. I left it to macerate for quite a few weeks. </p><p>Then one evening I decided to give it a try. I made the bad decision of smoking a joint made of the herb before trying the wine. A bad decision as my partner, who'd just gone to bed, realised he'd forgotten something and came in just as I put it out and the room was filled with acrid smelling smoke. He, being completely anti-drug and not very open-minded about these things went mad and was convinced it was cannabis.... anyway, not a good start. </p><p>Back to the wine. I managed to drink the whole lot and it wasn't as foul tasting as most people found the tea - a very earthy, slightly accrid wine. Although I'd already drunk some wine beforehand, drinking the whole calea wine didn't get me drunk. I didn't notice strong and obvious effects though time seemed a little warped and elastic. I went to bed and managed to get to sleep fairly quickly.... This is where Calea works its magic. I had at least four dreams I can just about remember, perhaps more. I can't recall the two I had in the middle of the night very well but the two in the morning I can still visualise pretty well. </p><p>What made those dreams different from any other I've had before or since was their whole appearance. They were all 'tinged' with this incredible contrast and depth in the colours. There was also much more continuity, however weird and surreal the dreams were. The first dream I can remember properly happened in the morning. I'd already woken up and was at that stage when you go in and out of sleep. I noticed while awake the shadow of what I thought was a big spider behind the curtains. This made me uneasy as I don't like them much and kept an eye on it. </p><p>I was reluctant to close my eyes in case it would disappear and therefore be at large in the bedroom. Anyway, I did eventually close my eyes and drifted off. I then found myself dreaming of where I was: in bed in the morning feeling uneasy about a spider behind the curtain. The colour in the room was stunning. It's not that there were bright or weird colours but more that everything was enhanced. Darker colours were deep and rich, and brighter colours were glowing a beautiful golden colour from the glorious sunrise outside flooding in (which it wasn't in reality). </p><p>I looked at the curtain and the spider had gone. I thought 'oh no !' and wanted to carefully look for it. It's then I saw the most bizarre sight. On the bed next to me was an odd small structure which, as I looked closer, turned out to be a small stadium-like thing in which lots of insects were assembled. They were watching two big spiders wrestling in the middle. 'Ah, so that's where it's gone !'. I watched for a while before the insects and spiders dispersed and disappeared under this large gap between the floor and the wall (which doesn't exist in reality either). </p><p>The second dream I can remember from that morning seemed to be a direct and positive response to the whole 'situation' that developped following my partners' discovery of my substance experimentation. He was still very OTT about it and had a go at me while I was still in bed and groggy. Anyway, drifting back to sleep, I found myself with my partner in a non-specific city at night. Once again the contrasts in colours were stunning and the whole atmosphere drifty and surreal.  I can still feel the deep black of the night and the bright white light of the streetlights. My partner and I were walking around happy. I was forgiven and we were enjoying the moment.... </p><p>So in conclusion?  Well I do believe Calea works as a 'dream enhancer'. I haven't tried the wine mixture while awake long enough to be able to say how that would work. The distinctive tinge it gives to dreams is beautiful and memorable: the high contrasts and drifty surrealism. Nothing harsh or unpleasant and the whole 'therapeutic' aspect is very interesting as the last two dreams dealt so clearly with very current issues to say the least and presented a positive outcome (or too silly to be frightened by it in the case of the spider business). I have just put a large amount of calea in some wine again and will be trying it soon....</p><p>Oh yes, and it turns out the spider was a Daddy long-legs.</p>"
}
