{
 "title": "My Last Year",
 "author": "XI",
 "citation": "   XI. \"My Last Year: experience with Kratom (ID 81236)\". Erowid.org. Nov 6, 2011. erowid.org/exp/81236",
 "substance": "Kratom",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Kratom",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 81236",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Nov 6, 2011",
   "Views: 9528",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDrug History: I have used a variety of substances in the last five years of my life, stemming initially from marijuana and alcohol into more enlightening drugs like DXM, mushrooms, and LSA. Once my fascination with psychedelics and alcohol subsided, I discovered the bliss inside of opiates. Ive used a handful of opioids, the main ones being opium, hydrocodone, oxycodone, morphine, and methadone. Legality related paranoia influenced me to try an alternative route to getting the same high I would from a line. Browsing an online vendor I had gone through numerous other times, I discovered Kratom and after research I decided it seemed to be what I was looking for. Since my first purchase, I have used Kratom 2-5 times a week for the last year. Being somewhat of a connoisseur for euphoria inducing substances, I would relate Kratom to being a mix of oxycodone, morphine, and codeine, but not as strong as the former two, of course.<br>Preparation: I have used many different strains of Kratom, almost the whole variety this online vendor offers. I find Kratom 15X extract to be the most convenient yet cost-efficient and plain Kratom - Premium Dried Leaf to be the cheapest yet effective in larger amounts. In a hurry, I sometimes will chase 15 grams with water, as the herb is powdered. I find that a very light meal helps the absorption of the herb in this case rather than an empty stomach. Less euphoria is noted with this form of consumption when compared to others. When actually making the tea, I will often put 40 grams into a gallon-sized pot filled half full. The first batch I boil for five minutes, the second ten, the third thirty, and the fourth the same. The third and fourth batches are boiled further to concentrate the solution. I strain using coffee filters tightened to three mason jars using the lids.<br>Consumption: The first and second batch is usually all I need to get the desired effects on an empty stomach. The combined liquid amount usually comes  to one and a half quarts. The taste is rather bitter, so I usually down it in a few gulps chased with a drink with high sugar like monster or pepsi. After a couple glasses, I usually slow down to let it creep on and to keep nausea at bay, though it only persists for a few minutes afer drinking. Ive noticed when the tea is ice cold it tends to induce less nausea.<br>Physical Effects and Health: I have noticed NO affects to my health except the 20 pounds I have lost due to more exercise and a change in my eating habits. I find myself more physically able to perform tasks I wouldnt normally be able to under certain conditions. If Ive had only a few hours of sleep, Fifteen grams of herb or the left-overs from the previous day fix the issue. Strangely enough, the comedown is no worse than normal. Its mainly endurance that is affected by the tea. Furthermore, it is a GREAT drug for sex. In normal conditions, I may be able to last only ten minutes with my girlfriend for the first run. On many nights with her and the tea, I have lasted two hours with heightened sensitivity yet never coming. Pupils become contracted and sometimes red. If I have had a decent amount in a night, my skin will sometimes be more pale but that is likely to be the nausea. Mentioning nausea, I would rate the nausea to be at a 5 and usually only for fifteen minutes at a time, and this is only with decent amounts. I have also noticed a cross-tolerance between opiates and Kratom. I started using 30 grams, whereas my friends usually only need fifteen. Strange enough, my tolerance with Kratom has never grown. I still only need 30-40 grams to get the same effects. However, if used persistently, over three times a week, the effects are dulled and arent as desirable. Taking larger amounts to get the same effects usually results in nausea and other unwanted things. If your high is becoming less, taking a few days break should fix the problem. <br>Mental affects: The most prominent is a decent euphoria. For the first few hours, it is very relatable to a morphine high in the well-being aspect. I find myself talkative and social, less sensitive yet just as understanding, caring, and excitable. I am able to be in public situations speaking as I would want to normally when I dont have enough courage. I feel a love for the people around me and a sense of understanding in my environment. I am at ease and I let come whatever may. I take it to parties because I dont drink anymore, I take it along with the girlfriend on dates, and I take it to concerts because it simply enhances the situation. It works great with music, and your emotion and vibe reception is more sensitive. In a typical night, I come up within a half an hour and peak within an hour and a half. Though at times I get a nod, a cold drink and standing up with usually alleviate it. As the buzz tapers off after around four hours, it comes down to the level, mild opiate feel yet stimulation that oxycodone brings on. Theres no jitters or sudden anger. The only negative aspects Ive noticed on the comedown is a find myself a little paranoia, sometimes unable to slip to sleep quickly, a VERY mild irritability, and slight confusion. Unless use is often, I usually have a decent afterglow the next day lasting until noon.<br>Summary: I find kratom to be a a substance to be enjoyed yet revered. It is great for gatherings, sex, and conversations. It cleanses my emotions and clears my mind. It instills euphoria, relieves pain, and lets real ideals surface. However, all these pros lead to one con. It is habit forming. Not only physically, but over-use can lead to a dependence resulting in a lack of confidence to deal with ones own problems. Its not the best drug in the world, but being legal and not too expensive, I would say it is my favorite and most used.\n\n\n"
}
