{
 "title": "The Good and the Bad",
 "author": "Texas Trippers",
 "citation": "   Texas Trippers. \"The Good and the Bad: experience with Morning Glory Seeds (ID 813)\". Erowid.org. Aug 4, 2000. erowid.org/exp/813",
 "substance": "Morning Glory Seeds",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "9.0 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 813",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Aug 4, 2000",
   "Views: 11015",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMe and my friend finally decided to give the Morning Glory seeds a try.  We went to Wal Mart at 2:00am and bought 10 1.8g packages of Heavenly Blues.  We slightly crushed them in my blender and consumed them with a milkshake. We each had about 9 grams.  We were rather sceptical at first and we were prepared for anything.  We had candels lit, the house clean, no chance of others coming over and it was great weather.  Everything was set up perfectly for a Trip to the unknown.  We were in good spirts with plenty of sleep and no anxiety about tripping.  </p><p>We ate them at about 3:00am and the effects came on quickly. After 15 minutes we started to feel them and see things in our perifiral vision.  We were playing video games and couldn't quit laughing.  After 45 minutes we went outside and stared at the full moon and the clouds rushing by it. After an hour it was a full blown trip.  Not quite like LSD but very similar.  For a time I felt like I was in a space land and everything was mathematical.  I saw very complex geometric shapes float around the room and move and change in front of me.  I was amazed at the power of a substance bought at Wal-Mart.  </p><p>We were listing to a CD made for trippers with electronic sounds etc.  Everything in the room corresponded with the music.  The candels flickered with the beat and things on TV went perfectly with the music.  I closed my eyes and the music made pwychedelic stars and spheres swirl and dance to the beat in my head.  My friend played a video game for about 45 minutes but the car he was driving never moved.  He was amazed at changing the views of the game along with the music.  I layed in bed and watched the glow stars on my celing.  They transformed to 3D and were all around me moving and flying around the room. I could control their flight with my mind.  I had never seen them like that before on LSD or Meth.  </p><p>I returned to the living room to find my goldfish were swimming upside down.  I looked at them very closely and the were still upside down.  I was amazed. We also both experienced amazing tracers and light flashes around the room at all times. The main trip ended about 7:00am.  And all of the next day we were very up and down mentally.  Very out of it experiencing the after-effects of the drug. </p><p>The next night we did it again with another friend at his house.  We mixed the seeds with ice cream.  The same dosage as before at about 11:00pm.  This time things were wrong.  I was in a unfamiliar place, tired, still out of it from the night before.  The trip was not good but not too bad.  I saw a few minor visuals and music was really too intense to handle comfortably. We were listing to Hendrix Are You Experienced and it was freakin me out!  I had some pretty intense paranoid thoughts and was not enjoying myself.  I just felt too fucked up, more than I ever had before. I fell asleep about 3:00am.  I really didnt feel like myself again until Tuesday morning after ALOT of sleep.  My advice to the user is to make yourself a very comfy environment with people in good mindsets and dont try it twice in a row.  Also make sure you have about 14 hours free to do it.</p>"
}
