{
 "title": "The Perfect Night ... Well, Almost",
 "author": "ButterFLYER",
 "citation": "   ButterFLYER. \"The Perfect Night ... Well, Almost: experience with 2C-I (ID 81346)\". Erowid.org. Feb 23, 2010. erowid.org/exp/81346",
 "substance": "2C-I",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   " ",
   "10 mg",
   "oral",
   "2C-I",
   "(capsule)",
   " ",
   "  repeated",
   "inhaled",
   "Inhalants - Nitrites",
   " ",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 81346",
   "Male",
   " ",
   "Age at time of experience: 19",
   "Feb 23, 2010",
   "Views: 2335",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The Perfect Nightwell, almost</p><p>Ahh, now to recount the night I tried 2C-I. It started with a text from my friend A about him being able to get 2c-I, and after some research I decided I wanted to try it, and the upcoming weekend in DC was the planned time of consumption. My original intent was to eat the pill and browse several of the art museums on the national mall, but my friend who had the hook-up had work in the morning and ended up not being able to get the pills to us while we visited the national mall. The art museums were still majestic to say the least though. </p><p>We thought he would at least be able to join us for the afternoon on the mall, but we ended up heading back to his college after sitting in front of the capitol building for an hour as the afternoon drew to a close. When we got back, we rechristened his dorm room and blazed some fine beasters, followed by the dankest sour diesel, purchased straight from a McDonalds in Times Square. About five minutes later, when the hunger from the day grew to an aching climax and the munchies had firmly took hold, we decided to make a run to a local grease joint. God bless short order cooks and fatty-ass food! </p><p>After the satisfying diner dinner, we headed back to the dorm to get ready for that nights party. J1 and J2 were planning on taking about ten Hawaiian Baby Woodrose seeds: meticulously separated, finely powdered and neatly parachuted. I opted out of the lysergic trip as I had recently done one, as I like to avoid the excessive vaso-constrictive feeling consecutive trips can produce, in favor of the 2c-I pill. J1 and J2 took their doses before the party and ran off to grab a 2 quart Tropicana orange juice from the local 7-11 as a booster. </p><p>We went to said party only to discover that it was a rather lame gathering, and during the course I consumed a beer and about three shots of Jack for the drinking games that we played. Eventually I decided Id swig down the pill with a bit of Jack, and J1 and J2, who were feeling and looking excessively heavy due to the LSA, wanted to go.  We carried back some extra alcohol to As dorm room, and on the way, I ran into the dealer, who informed me of the 10mg dose in my capsule.  </p><p>After printing off directions to the campsite and gathering all necessary supplies, we headed off towards the sub station. While sitting at the metro, trying to act as un-sketch as possible, J1 started lighting up on of the Mavs he had purchased for a sickening $6.50 earlier at the 7/11. Although I didnt notice at first, I managed to catch him before our party could get rained on (for some reason its illegal to smoke at metro stopseven outdoor ones!). We boarded our sub and made the transition all the way to Greenbelt, MD without a hitch. </p><p>The sub was where I noticed the beginning effects of the 2c-I: it came on like a roll, but something was visually different as I stared out the window at the passing tunnels and scenery. And it had some of the same trip paranoia as shrooms, albeit far less intense! We exited the sub with all of our bags and proceeded in the direction I thought would be best, as our scrawled street names did not provide an initial clue, eventually coming to a recognizable street. We then walked for two miles through some rather sketchy MD neighborhoods, somehow not missing a turn. </p><p>After a jump across some extension of 95, we made it to the state park we planned to camp at and began to look for the check in booth, which unbeknownst to us was another 3 miles into the park! We kept on walking, but our spirits were high, and we had a flashlight. Upon finally reaching our destination, we set up camp with eagle scout precision, and then sat down on the picnic table to blaze a rather large bowl. The weed definitely synergizes with 2c-I as I had predicted based on my similar combinations with MDMA, another, more researched phenethylamine. Every hit felt sort of like being shot out of a cannon, and definitely increased the visual quality of the I.</p><p>Looking at my phone, I noticed a few missed calls from the friends that we left behind at the party: it had been busted, and they came to check to see if we were doing alright. Turns outwe were more than fine, and they even had to wait in their warm car while we skillfully built a fire out of the camp grill. After a quick check, they left and the real fun of the night began. We had been watching the fire for some time, but we started to play with the embers, making all sorts of smoke patterns and trails. With the I, the trails seemed to linger, and in general just looked more amazing.  </p><p>We hit a few poppers when we got there to warm up, but the popper/weed/I synergy really increased visuals as well, but the real treat was some 20x salvia topped on a big nugit opened up the 2c-I from that point onward into a full blown trip. The most amazing thing I can recall is staring up at the trees and noticing that they were continuing to grow in their pre-existing fractal intricacies, until eventually my field of vision was taken over by colorful fractals, not unlike the computer generated multi-hued Mandelbrots people so often consider trippy.</p><p>With all the orange juice consumed, J1 was reaching the profound, blissful plateau, I so love about LSA, and our discussions far transcended the ordinary, realizing that every aspect of our universe can be boiled down to a struggle for communication (He said it so more eloquently than I, and If you really think about it, there exists much truth in the statement). I just remember that he would stare then laugh with delight as the epiphanys rushed to him, and while I could follow, sometimes in the absence of a word spoken, his thought patterns, sometimes I would ask and he would remark Never mind, you wouldnt understand. This interaction of discovery continued from about two till the late wee hours of four when J2, who had been rather quiet and feeling left out, headed for bed.</p><p>J1 and I, who were not tired, or exhausted of discovery, went on a 4:30 nature walk, back to one of the trails we had passed. We ended up walking about 200 yards down the trail to a nice sized tree where we sat down and prepped the bowl. With the cold, and how hard we were tripping it took two of us to do the work, and J1 ended up putting a nug in the bowl that looked like an iceberg jammed into a pond. It passed back and forth endlessly (probably about 30-40 times) as we took hits. We decided to send a text to his roommate, and preparing just the right thing to say took us about twenty minutes, but it was definitely perfect upon completion. Heading back, smoking cigs and hitting poppers all the way, we decided to lie down in the road and stare at the sky which may have been the best idea of the night. There is something so comforting and peaceful about laying down in the middle of the road without a care, not to mention tripping face while inhaling the beauties of a cold, starry night.</p><p>Well we headed back after that, to try to get some rest before our last jam packed day in the district. I finished my 40, and began the painful undertaking of stripping before I got in my sleeping bag. Little did I know that I would spend the next 45 minutes trying to get into the mummy. The campus rental liners posed an interesting complication, and led to my ultimate outcry of distress and frustrationFuck the mummy! While initially warm, the under-insulated bags soon grew cold, and our lack of those insulating pads combined with the 24 degree night made sleep a near impossibilityexcept for J1, he slept fine. I will never forget the WWI soldier that I saw mounting the trenches in the patterns of the zipper on the side of the tent when the sun began to rise.</p><p>With J2 not being able to sleep, I decided to get out of the tent and make a fire, still tripping pretty hard. The trip subsided throughout the day, but the stimulation effects as well as some visual leftovers were present, notably as we perused through the Georgetown shops, I kept thinking people were next to me, when I was just next to the manikins. Also, riding in the backseat of the car with my friend A driving was amazing (he is a good driver, albeit speedy), as we made it back in town going well above the speed limit.</p><p>The eye dilation persisted through the following day, but subsided after my first real night of sleep.</p><p>List:</p><p>Us:</p><p>1 gram NY sour diesel</p><p>1/8 beasters</p><p>Poppers (alkyl nitrates)continuously</p><p>CigsOne box of Mav reds</p><p>1/3 gram of 20x Salvia</p><p>Me: </p><p>1 capsule 2C-I~10mg</p><p>1 40oz Schlitz Beer</p><p>1 12oz Natty Light</p><p>3 Shots jack Daniels</p><p>J1, J2:</p><p>10 seeds HBR, parachuted</p><p>2 QT. Orange Juice</p><p>Interesting Thing: Somehow a bowl was backfired during the night (forget who), but both major nugs were recovered amongst the leaves and moss in the early morning.</p><p>The night before was a serious binge of alcohol, absinthe and weedfollowed by the </p><p>most painful hangover ever!</p><p>Note (8/18/09) I realize that a pertinent addendum to this recollection is that I wrote this after consuming 4 hits of Scooby-Doo Blotter Acid, a steady stream of poppers, and a downright ridiculous amount of Vitamin C loaded drinks like Orange Juice and V-8. I dropped the acid after getting out of an exam around 11am, and wrote the report around 5pm. The interim consisted of a blissful and reflective walk through a local nature park.</p>"
}
