{
 "title": "Dealin With the Poh",
 "author": "Sly One",
 "citation": "   Sly One. \"Dealin With the Poh: experience with Marijuana/Tobacco (ID 8137)\". Erowid.org. Aug 4, 2004. erowid.org/exp/8137",
 "substance": "Marijuana/Tobacco",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1999",
   "8137",
   "Male",
   " ",
   "Not Given",
   "Aug 4, 2004",
   "9062",
   " "
  ]
 ],
 "report": "<p>I just wanted to relate this story because so many drug users are like me: stupid. Our actions lack in forethought and common sense. Well, this is a story of just such an instance in which I used terrible judgment, and made out like a bandit (no pun intended; you'll understand after reading my story).</p><p>So I was desperate to get high. A friend of mine invited me to go pick him up and smoke some of his weed with him. It was 1 in the morning when he called me. Unfortunately, I had recently been caught by my parents while sneaking out. As a result, my car keys had been being collected in the evenings so as to prevent me from leaving my house at night. I told this all to my friend, and he, like me, preferring to toke together than alone, pleaded with me, and asked me to find some way of coming to his house (he did not have his license yet). So that's when I realized that my aunt and uncle, who live just down the road from me, were on vacation. I live on a large plot of forest and my family and my aunt and uncle share this land. Well, I used to steal cigarettes from my aunt's house because I had no other way of obtaining them, so naturally, I knew a way to get into the house despite the locked doors. I also knew that they had left the keys to one of their cars lying on their dining room table. So I broke into the house, took the keys, and took the car.</p><p>I picked up my friend approx. 20 minutes later, and after several passes of his house in the car to make sure nobody woke up with his exiting of the house, we felt secure enough to go and smoke the marijuana. My friend knew of a cul-de-sac which was in an area of future construction. This cul-de-sac was secluded and far away from any neighborhood or houses. So we parked the car in the middle and began to smog the car.</p><p>After about 3 bowls, we saw another car coming down the road to the cul-de-sac. Our instinctive reaction was that it was some other group of high schoolers out for a good time. We waited patiently, watching the car come down towards us. As the car came to a rest facing my driver's side door, a large, bright, round light mounted above the drivers' side mirror of the car came on and flashed into me and my friends' eyes. My friends' immediate reaction was to say in a hardly convincing tone, 'it's not the cops, it's not the cops.' my response was something along the lines of, 'bullshit, it is too a cop.' Still hopeful, however, I started our car and tried to pull away. Unfortunately, in my state of intoxication, all I succeeded in doing was turning on the windshield wipers, turning on my emergency flasher lights, honking the horn repeatedly, and going in reverse. After this extremely confusing few seconds, the cop got out of his car and approached us. I put our car in park and rolled down my window, greeting the pig with the cliché opening, 'is there a problem, officer?'</p><p>He replied by asking what we were doing out there. I told him that we were smoking cigarettes. He asked if we had been smoking any marijuana. I looked back at my friend, and then at the center console, upon which was laying two pipes, two lighters, and an open sac of weed. I knew I couldn't bullshit my way out of this. I admitted to the cop that we had been smoking weed. He told us to get out of the car, so on, so forth....</p><p>After he collected our ID's, I pleaded with him relentlessly, begging him to simply allow us to leave, to go on our business, to go home. I was so frightened in my state, that when he told me to shut up, I did exactly as he told me. From that point forward, I was completely honest with the cop. I told him my name, phone number, that I smoked weed regularly, blah blah blah.... After 20 minutes of watching him write on his little note pad, he said, 'i am currently out of citation sheets. Im going to go to the top of this street to get the address so a friend of mine can bring me some more sheets. Now then, if that marijuana should suddenly catch the wind while Im up there, I wouldn't have much on you boys, now would i?' I nodded, knowingly. The cop went up the street, and my friend and I proceeded to throw out the weed. The cop returned and wrote us out a citation for possession of a tobacco product. He then went around to get the insurance information from the glove box. So, following with my pattern of being honest, I told him how I had obtained the car. His reply was, 'so you borrowed your aunt's car. no crime.' he let us go home with nothing but the tobacco charge.</p><p>The moral of this story is: If a cop asks if I'm guilty, and I know that he knows I'm guilty, I won't lie. If I'm honest about confirming what he already knows or would soon know anyway, I'll be in far less trouble. Cooperate.</p><p>Peace</p>"
}
