{
 "title": "It Cross Tolerates",
 "author": "Delsymfan",
 "citation": "   Delsymfan. \"It Cross Tolerates: experience with 4-MeO-PCP (ID 81468)\". Erowid.org. Oct 8, 2009. erowid.org/exp/81468",
 "substance": "4-MeO-PCP",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "4-MeO-PCP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 81468",
   "Male",
   " ",
   "Age at time of experience: 19",
   "Added: Oct 8, 2009",
   "Views: 18053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just figured I'd provide a report on a very new research chemical that has hardly any information on it. </p><p>I was a frequent DXM user, and after about 25 trips of 6.5mg/kg average, I found myself unable to get much of anything from the trips. I stopped using it in Feb. 09, and havent touched it since. </p><p>When I heard more dissociative RC's were hitting the market, I jumped for joy, as Dissociatives still always were my fancy. Hoping to once again feel that wonderful feeling, I sought out 4-meo-pcp. </p><p>After procuring a gram of the stuff, I mixed it in a cup of water, about 8.3mg/ml. No problem. Dissolved right away. </p><p>I dosed 150mg on an empty stomach in August 09. This chemical was supposed to last 12 hours or so, most reports go there, with an afterglow lasting well into the next day. I was prepared and had a clear schedule.</p><p>I took the liquid at 9 PM, quite awful tasting. Like a burnt chemical of some sort. Just nasty. But it went down with two swigs. After 30 minutes, I started to feel a sort of tingle. It felt nearly identical to the come up of DXM. I was excited. </p><p>At an hour, the effects started to tear off. Whereas DXM is a slow climb, this was like being in a faster moving vehicle. Not a rocket launch, but still it was clear the effects were gaining speed.</p><p>Before long, probably in 15 minutes, I was floating through the walls! Much like on DXM 3rd plateau, but with a different feel. I found the same depth perception distortion, but it was in another dimension of some sort. Its hard to explain, there were many similarities, but still each one was a bit different. </p><p>The body was numb, and comfortable holding still. I felt dissolved as I do on DXM, but less fuzzy. More like static electricity, less like a fuzzball like I get that Opiate-style numbness from DXM.</p><p>The trip was going great at T+90 minutes. I was having interesting CEVs, cool OEVs, and had a couple interesting flashbacks to previous locations I know, and people I have been with. It was quite delightful.</p><p>However at about T+2hr, things started to kind of, well, slow down. I was on the verge of falling into some sort of sensory hole, I could feel myself slipping. And I started going in, and then just floated back up into my bed. Unable to get back to that point, I was a little frustrated. I assumed I had not dosed enough, or perhaps this drug comes in waves.</p><p>Yet I would be proven wrong. The effects continued to taper downward. Eventually, at T+4hr, there was nothing visual. There was still a difficulty walking and a bit of a heavy feel in the body. But overall, I found myself thinking normally. This was not expected, or desired.</p><p>A future trial with 230 would reveal the same truth, that 4 hours would be the max I could get. It appears that my tolerance to DXM has not faded much at all, and it also affects other dissociative chemicals. </p><p>I have decided not to continue with 4-meo-pcp. I probably will avoid all dissociatives for some time, hopefully getting the ability to use them again in the future. In the meantime, I will explore other items.</p><p>Hopefully this helps anybody looking to get some 4-meo-pcp. I highly enjoyed what time I did have on it.</p>"
}
