{
 "title": "Best ADHD Medication I Have Tried",
 "author": "ADHD Momma",
 "citation": "   ADHD Momma. \"Best ADHD Medication I Have Tried: experience with Amphetamines (Vyvanse) (ID 81479)\". Erowid.org. Jul 30, 2010. erowid.org/exp/81479",
 "substance": "Amphetamines (Vyvanse)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "81479",
   "Female",
   " ",
   "24",
   "Jul 30, 2010",
   "15210",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was diagnosed with ADHD Inattentive Type (was ADD back then) when I was 7 years old.  Immediately I was put on Ritlan, then Adderall later on.  I have been having complaints about the side effects of Adderall (not lasting long enough, irritable, depressed, anti-social) so my doctor recommended Vyvanse.  </p><p>I was started out on a 30mg dose, which didn't really do much after the first couple days.  Just last week my dose was increased to 50mg.  I have to say, I love this medication!  It lasts all day, unlike the Adderall which I had to take a second dose in the late afternoon.  It helps me focus like crazy, the first few times I took it were intense, but now I am starting to get used to it and it is has such a nice, steady, even effect.</p><p>7:45am Ingest orally after eating a small breakfast.</p><p>8:00am Starting to feel perky and motivated, appetite decreasing.</p><p>8:10am Definitely feeling focused and motivated, in a great mood.  Don't want to eat at all, but my mouth is very dry so I drink some water.</p><p>8:15am Medication is in full effect and I am ready to get some work done.  Cleaning, laundry, planning meals for the kids, playing with the baby.  Still no appetite but dry mouth is still there.</p><p>12:30pm Vyvanse is still in full effect and I am not hungry at all but I force myself to eat a bowl of cereal.</p><p>3:30pm Still going strong, I feel great and have accomplished quite a bit.  Spent a couple hours blogging and editing photos, now to help older son with his homework.</p><p>5:30pm Peppy feeling starting to fade and my appetite is starting to increase.  Still in a great mood.  Making dinner for the family now.</p><p>8:00pm Effects of Vyvanse are now pretty much all gone, I feel a bit restless, but it is definitely chill time.</p><p>10:00pm Headed to bed, have to take Ambien most nights in order to fall asleep quickly.  Without the Ambien I will usually toss and turn for 30 min or so.</p>"
}
