{
 "title": "Short but Sweet",
 "author": "Marsky",
 "citation": "   Marsky. \"Short but Sweet: experience with DPT Freebase (ID 8150)\". Erowid.org. Jul 16, 2001. erowid.org/exp/8150",
 "substance": "DPT Freebase",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "smoked",
   "DPT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8150",
   "Female",
   " ",
   "Not Given",
   "Jul 16, 2001",
   "Views: 12508",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis was the first time I tried this drug.  I was with my spouse and another friend. We took turns smoking it and I waited to see what happened to them before I agreed to try it.  My spouse's experience was a little disconcerting (see Mahan Atma's report).  I don't think he expected it to be so powerful.  But our friend did it without blinking an eye.   After that I felt more confident about doing it myself - and I'm really glad that I went for it. </p><p>Just seconds after inhaling the dose from a freebase pipe, I felt the effects coming on strong.  It started out with flashes of sparkling light -like fireworks.  Oooohh! Ahhhh!</p><p>With eyes closed, I felt like I was hurtling through a tunnel of prismatic light.  It looked like shards of glass with rainbow/iridescent shimmers and wavy trails expanding off them.    It was over the top intense!  I let it wash over me and floated suspended in awe.  I thought I was an angel.  There was also a tremendous but pleasant body energy.   My limbs were tingling and I felt a pleasant buzz all over.    </p><p>I murmured happy sounds to let my friends know I was OK.  I'm sure they could tell by the smile on my face that I was more than OK.  After a drab, mundane, and uninteresting day at work, I found myself joyous, incredulous, and blessed to be alive.  If you're ever feeling 'blah' this is the drug for you.    I kept my eyes closed to wallow in oceanic bliss and felt torn between lingering in this state and trying to communicate with my parter and friend.  In his case, the drug had a telepathic effect and while I would love to mind-meld with my husband, I also felt selfish about staying inside and keeping this to myself. All too soon the beautiful mind expansion faded away - probably about ten minutes after the initial hit.  I still felt the body energy and was unable to fall asleep for many hours, typical of the other tryptamines I have tried.     </p><p>I want to experience this again!</p>"
}
