{
 "title": "A Trip While Tripping",
 "author": "amfournda",
 "citation": "   amfournda. \"A Trip While Tripping: experience with DOM & 2C-B (ID 81545)\". Erowid.org. Oct 23, 2012. erowid.org/exp/81545",
 "substance": "DOM & 2C-B",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-B",
   "(powder / crystals)",
   "  T+ 0:00",
   "15 mg",
   "oral",
   "DOM",
   "(powder / crystals)",
   "  T+ 1:00",
   "15 mg",
   "oral",
   "DOM",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 81545",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Oct 23, 2012",
   "Views: 1401",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA little background first: I have tried 10mg DOM once before. The effects were very mild. This time around I was looking to have a very powerful experience. That is why the dosages are so high. They are not mistakes. I apparently have a very high tolerance. Times are also approximate. I was not attempting to keep exact track of time. \r\n(T+0:00) Took 20mg 2C-B and 15mg DOM upon getting to the party.\r\n(T+1:00) First effects, body buzz and feeling of energy. There was also strong nausea, I felt somewhat sick but did not vomit. \r\n(T+1:00) Took 15mg DOM. It is easy to get fixated on objects, people and conversations. Nausea is fading. [Erowid Note: 30 mgs of DOM is considered an extremely high dose, see DOM Dose Chart] \r\n(T+2:00) Nausea is gone, definite 'high' feeling but no hallucinations yet. Went out to get a hamburger in a sit-down restaurant. It seemed noisy and colors were pronounced.\r\n(T+3:30) Got back to the party, there was some psy-trance music playing and trip-art all over the walls.\r\n(T+5:00) It was very difficult for me to keep track of time, it seemed much later than it was.\r\n(T+7:00) Mental confusion, I would start walking some place and wonder why I was going there. Couldnt remember reason.\r\n(T+9:00) Sitting in chair listening to psy-trance and looking at trip art, it is very difficult for me to understand a conversation, although I apparently (according to my sitter) still gave reasonable responses to questions. Felt very disjointed.\r\n(T+10:00) Leave party, start to come down, any visuals I had go away.\r\n(T+11:00) Go to sleep, it is restless and I keep waking up.\r\nI woke up in the morning simply feeling slightly tired and a little stoned feeling.\r\nAll in all, this was a good experience, however I probably wont repeat it considering the dosages I had to take. I would recommend this drug to people who like mushrooms and/or acid but want to try something different.\n\n\n"
}
