{
 "title": "Finally, a Helpful Antidepressant",
 "author": "moc",
 "citation": "   moc. \"Finally, a Helpful Antidepressant: experience with Escitalopram (ID 81563)\". Erowid.org. Oct 9, 2009. erowid.org/exp/81563",
 "substance": "Escitalopram",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharms - Escitalopram",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2009",
   "81563",
   "Male",
   " ",
   "23",
   "Oct 9, 2009",
   "Views: 14184",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been taking cipralex for a little more than a month now, to treat my depression and anxiety issues, and, combined with other positive changes, have been having the happiest period of my life. </p><p>To begin, my current experience, in brief, for those who might just want to skim this report. In point form, the pros and cons, so far:</p><p>Pros:</p><p>-increased energy</p><p>-decreased shyness</p><p>-increased sexuality</p><p>-less likely to become emotionally overwhelmed</p><p>Cons:</p><p>-occasional teeth grinding</p><p>-increased sexuality</p><p>-yawning without fatigue</p><p>-decreased attention span</p><p>-sleep pattern disrupted</p><p>-cost (I do not have a drug plan, so the pills are a burden financially)</p><p>It is true that some of the 'cons' could perhaps be considered neutral, but I tend to find the yawning a bit confusing and the teeth grinding very annoying. </p><p>The decreased attention span is perhaps the consequence of increased energy - I am a graduate student, and my ability to read for long periods of time has been severely diminished, which is not a good thing. I have found ways to deal with this, but it is disruptive to my persona as a dedicated student, something I hold to be important.</p><p>As to increased sexuality being in both lists, this is due to sex and romance being a difficult category for me throughout my life. I remarked to a friend a few weeks after beginning cipralex that it was like I had entered a second puberty of some sort because my thoughts were almost constantly turning to women and sexual fantasies. Prior to beginning this treatment, I would avoid thinking about such things as I saw any aspect of sexuality in myself as merely a source of anxiety. So the increased confidence and focus on sexuality which seems to have come with cipralex is both welcome, as I do wish to give expression to my sexual side, and feared, as I have many anxious feelings attached to that category which are being seemingly forced upon me now.</p><p>My sleeping pattern used to be fairly simple - I was tired all of the time, and would sleep twelve or fourteen hours a day if possible. My preference was to be awake in the hours after midnight for the peace and quiet. With cipralex, I seem to switch between sleeping for ten hours some days, and having a pretty normal schedule, to having limitless energy for up to twenty-four hours, in which I walk and talk a great deal, getting many things done. It sounds like the manic episodes some of my bipolar friends report, though not quite as severe, and without reduced inhibitions. Such episodes are very enjoyable at the time, but disruptive for my class schedules and such, especially when I inevitably crash.</p><p>HISTORY</p><p>I have been on other SSRIs in the past (paxil, celexa, effexor) as well as wellbutrin (which is some other class of antidepressant). Out of these wellbutrin seemed to have the most balanced effect, as the others tended to make me feel like a zombie. My memory of all of these is hazy though, as I took them mostly in high school, and wellbutrin on to my first couple years of university. I now realize that it is possible these did help me by giving me a more stable emotional life to work with, but at the time I was not ready to utilize such tools - my view of myself, of my future, of other people, and of God were still all too dark to allow me to do so.</p><p>After I discontinued wellbutrin, some time in 2005 or 2006, feeling that it did not help me, I began smoking marijuana more and more heavily. This basically became my antidepressant, and though I still suffered from panic attacks, it kept me 'afloat,' so to speak, and I was a successful student, if a lonely one. </p><p>2008 was a year of great changes, the catalyst for where I am today. The significant events were, in order: my graduation with a BA, a summer job which drained me of self esteem and ambition, a move to a larger city away from family and friends in order to attend graduate school, me dropping out of graduate school, me losing my virginity finally, and following all this, a winter (2009) of me utterly alone, without job, school, or friends, smoking too much pot and consuming any other drug that came along (including LSD, HBWR, gravol, kratom, benadryl, DXM, syrian rue, amanita muscaria, and others).</p><p>Having come out of that winter alive and with a much deeper understanding of myself, I found I was having violent mood swings (from euphoria for two days to suicidal the next three) and that my old ally marijuana merely made me paranoid. I resolved to find a suitable therapist willing to deal with issues of meaning rather than mere symptoms, and to give antidepressants another try.</p><p>Over the summer I was successful in achieving this, and cipralex has been an important ingredient in a much brighter future. However I recognize that its effectiveness is directly related to my new apartment, my new outlook, my new graduate school (with full funding this time), and my new relationship with both my body and spirit. As I used to occasionally say to friends, I see antidepressants and other 'therapeutic' drugs as essentially crutches - one must be willing to learn to walk with them if any healing is to occur, but the point is to eventually be rid of the crutches altogether and walk on one's own.</p><p>As I hope comes across in this report, I am pleased with life and partially credit cipralex with this change. It is the first instance of an antidepressant that seems to work for me.</p><p>As an added note, my view of 'recreational' (or at least illegal) drugs is essentially positive though I now avoid most of them. Marijuana and psychedelics, though I often used them to hide from the world, did open me to many aspects of myself that otherwise might have been left unknown, as well as giving me experiences which deepened my relationship with God.</p>"
}
