{
 "title": "From Happy & Dancing to Spasms & Panic",
 "author": "eLeKtRoNiCa",
 "citation": "   eLeKtRoNiCa. \"From Happy & Dancing to Spasms & Panic: experience with MDMA (Ecstasy) & Sleep Deprivation (ID 81588)\". Erowid.org. Oct 8, 2009. erowid.org/exp/81588",
 "substance": "MDMA (Ecstasy) & Sleep Deprivation",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "MDMA",
   "(powder / crystals)",
   " ",
   "1/2 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "1/2 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "1/2 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "1/2 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "1/2 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "1/2 tablet",
   "oral",
   "MDMA",
   " ",
   " ",
   "1 tablet",
   "oral",
   "MDMA",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 81588",
   "Gender: Female",
   " ",
   "Age at time of experience: 21",
   "Added: Oct 8, 2009",
   "Views: 6513",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have done Ecstasy quite a few times in the last 2 years. Recently I got my hands on a batch of 'pure' mdma which I am going to distinguish from E in this report mainly because it feels like a different high. On with my story...</p><p>I had a friend who was DJing electro tracks in my local town and I wanted to be there to support him. When I walked into this bar that was very familiar to me, I was quite surprised with my surroundings. It was like being in a city afterhours club, and I was loving it. I hit the dance floor and took my first pill. It was a MDMA capsule. </p><p>Within an hour I felt the effects, a wonderful high full of energy and dancing and happiness. The only downfall to this was that it ended a short hour later. So I decided not to do anymore because there's a chance that once the bar closes I will drive to the city to get to the afterhours club. I enjoyed the rest of my time there, and once it was over I decided that I would go to the other club.</p><p>I stopped at home first on the way to grab some ecstasy pills, since I wanted to get high again and the effects of these seem to last a lot longer. (Probably from whatever they are cut with). I grabbed some blue and green aliens and headed to the city.</p><p>Upon arrival to the club, I popped half a blue alien, which is not enough to get me high. The reason that I only pop half pills like this is because I tend to get paranoid that I will overdose.  I have panic disorder, so doing this helps me tell myself that I won't die. That way I can just take another half in a little while so it kicks in and it's all good. </p><p>Over the next 4 hours until about 7 a.m. I really enjoyed my night. I danced non-stop, made tons of friends, and in total popped 3 more halves (2 pills total). It came time to leave the club, and the effects of the pills were mostly worn off. I drove home, but decided that I wanted to stay awake until noon and visit with my roommate once he gets up. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  So I grabbed a green alien pill, bit it in half and waited another half hour and took the rest. The effects hit rapidly at this point, I was tired, but this time I felt really strung out. I was experiencing some mild hallucinations and I was pacing back and forth in my living room trying to get rid of some energy. I felt good, but in the back of my mind I started to feel like maybe this was gonna be too much for my body to handle. Especially since I have been up for neary 24 hours at this point. </p><p>I decided to call a friend and walk to the local Wal-Mart. I was a chatterbox on the phone the entire time, explaining how awesome my night was to my friend on the other end. The bright lights in Wal-Mart were not very nice on the eyes at all, and walking among people was just weird. I felt as though I was in this little vortex and everyone else was moving so fast around me, but staring at the same time. It was an uneasy feeling, So I left and went home, and decided to take another half a pill. Right around this time my roommate woke up and came downstairs to see me bouncing off the walls so to speak. He was happy that I was having a good time, but told me that I should stop doing pills and go to bed. He seemed worried about me. He said he'd be mad if I did anymore E because I apparently looked way too fucked up. I didn't listen. I went upstairs and popped a whole pill this time and pretended that I only went upstairs to change my clothes. </p><p>A half an hour of us chatting and me pacing around full of energy quickly came to an end. Sometimes when I'm high I get the urge to check and see if my hands are turning blue. This goes along with my panic disorder and fear of dying. I kept looking at my hands, and instantly my roommate knew something was wrong. I told him that I suddenly feel really sick, and not stomach sick, like my whole body sick. I was having a hard time collecting my thoughts and my sensation in my hands and feet was all fucked up. He told me to lie down with him on the couch and relax. I kept checking my hands and I told him that I swear they are turning blue and that I am going to die. He said that my hands were fine and that I would be ok. I lay there for quite some time, listening to my heart beat at an insane pace, it was super hot in our house, but I was freezing and wrapped in a blanket. I kept complaining of a pain in the back of my head that seemed to go along with my heart beat. I was also sweating and mildly hallucinating once again. I couldn't put together a sentence so I chose just to stay quiet and try to not die. </p><p>For the next hour I was having problems with my muscles. One minute my arm would seem to tense up and relax, then I would get a foot cramp for no apparent reason. (I was still lying on the couch). My bladder felt extremely full, but i could not urinate. This scared the hell out of me. My roommate watched me so closely, ready to call the ambulance if something bad happened. Then I decided to try going to the washroom. I sat up, and my head was spinning and throbbing. I stood and walked to the washroom. Walking was strange, as I really had to concentrate on what my feet were doing. I kind of stomped my way there, trying not to stumble and fall on the journey that's only about 14 feet from couch to toilet. In my head I was freaking out and thought that this was the end. I managed to urinate a tiny bit and get back to the couch. Only a few minutes later I had to go again.  This happened 6 times within 20 minutes and had me thinking that I was dying and that my kidneys and bladder were failing. But surprisingly after urinating so much I felt a little better, and was able to walk myself upstairs and lie in bed with my roommate. I fell asleep after about 10 minutes for 2 hours. When I woke up I felt so much better, almost like normal again. </p><p>This was only a month ago, but definitely the scariest time I've ever had on E. I've been hospitalized twice in the past, and had other sketchy times, but this one tops the list. I kept a cool head throughout the entire thing, even though I REALLY felt that this time was going to kill me. I still wonder if it's possible that I experienced serotonin syndrome or maybe some sort of a mild seizure during this, but not serious enough to put me in a hospital. To this day I still have muscle twitches (a neck twitch that lasted a week!) and headaches. I am quitting E for good, and this experience has killed any desire to do it again. For someone else, taking this amount of E might be just right for a good time, for me it was way too much for my body to handle.</p>"
}
