{
 "title": "The Opposite of Nodding",
 "author": "Anaxis Imperator",
 "citation": "   Anaxis Imperator. \"The Opposite of Nodding: experience with Morphine (ID 81595)\". Erowid.org. Nov 14, 2013. erowid.org/exp/81595",
 "substance": "Morphine",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "Morphine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2008",
   "81595",
   "Male",
   " ",
   "29",
   "Nov 14, 2013",
   "1758",
   " "
  ]
 ],
 "report": "<p>My experience or rather; life, with morphine technically began in 2004 when I was injured in Iraq by an IED, and I was initially given tramadol for the back pain resulting from several herniated discs. Then in 2007 on my last tour in Iraq, I reinjured my back in a work accident as a mechanic, and this required my being medevac'd home.</p><p>The tramadol had long since been discontinued by my doctor at my request due to the horrible withdrawals from tramadol & it's other side-effects, in addition to the ineffectiveness at treating my now severe chronic back pain. 10mg Percocet and cyclobenzaprine (Flexeril) was perscribed, and I continued on that combination for about 5 months. However, which may be a result of my previous long-term tramadol use or even earlier-in-life heroin habit, my body had built a tolerance to these new opiates rather quickly, and within the year I had went from the 40mg codeine daily, to 30mg morphine IR (immediate release) & 30mg morphine sulfate ER (MS Contin) daily.</p><p>This was moderately effective for only a couple months, and my doctor understood the reasons for my tolerance levels without the knee-jerk reaction most docs have when a patient asks for his/her narcotic pain-med dosage to be increased due to said tolerances. However, neither of us had much of a choice in alternatives, so my morphine intake slowly increased from a total of 60mg daily, to the peak of 180mg total morphine sulfate daily, the maximum allowable by the Army for a non-terminally ill patient.</p><p>At times when my back was being a particularly nasty neighbor, I could tolerate over 250mg MS orally in one dose, or my normal 180mg oral MS in addition to whatever dosage of Dilaudid or Demerol the post e-room would usually give me just so that I could motivate under my own power and tie my own boots. And by tolerate, I mean operate normally without any sort of nod.</p><p>But I knew what I was getting into from the very start, having had my run with heroin during my younger years, peaking at somewhere around 3/4 gram daily for almost a year. This prior habit may account for my unusually high tolerance for opiates even a decade later; the maxim 'once a junky...' may hold true in some, or all cases.</p><p>All of this is not unusual for a chronic-pain sufferer, as the body can naturally handle doses of narcotics that would normally drop a healthy human when extreme pain exists. What is unusual, at least in my estimation, is the effect that morphine has on my mind.</p><p>For example; my best friend who also suffered the same fate to his back in another IED blast, was on the same dosage of morphine sulfate as I, at the same time as I. And we would hang out watching TV after taking our daily doses. He would nod out within 30min; once even dropping a lit cigarette onto his belly-button, not realizing it until I started smelling burning fabric & flesh and awoke his attention. Yet I have always become tweaked-out on any strong opiate; I have never nodded even after my first time slamming 1/4 grain of very good china white heroin. Instead I am a very active, creative, productive & sociable morphine user. This has confused me to no end, as I have known quite a few junkies of every stripe when it comes to their opiate DOC; without fail they have been sedate, nodding partners when fixed.</p><p>Recently, I was given the suggestion that possibly my speed-like reaction to opiates may be a result of my being ADD, ADHD, or even slightly autistic which was an open question when I was a young child. I am very interested to know the correlation between these conditions and the experiences of other confirmed opiate addicts with said conditions, and if they are not dissimilar to my own mental state while high on morphine.</p><p>In all other respects though, morphine affects me just as it would for any other opiate-dependant person. When in withdrawals (early, acute, late-stage WDs) it doesn't matter. If only the opposite were also true for me as it is when I'm high. If anything, I am more severely affected by morphine withdrawals than other addicts with comparable habits who are also WD'ing.</p><p>As a final note, my doctors have tried several different anti-depressants/anxiety meds over the years to try and help me cope with the results of two combat tours in Iraq & a debilitating back injury and none have been so effective at alleviating my psychiatric symptoms as the morphine alone has been. And honestly, I'd much rather take something that originated from a natural & well-known source to help with post-combat stress, than a weird synthetic compound that scientists know does something, but don't understand how it does it. As it stands now, I am resigned to having morphine in my life, most likely for the duration and the prospects don't upset me in the slightest.</p><p>Except of course when the hour-glass of junk runs out, and then life is pure torture in all it's hellish intensity.</p>"
}
