{
 "title": "An Interesting Experience",
 "author": "EAS",
 "citation": "Citation:   EAS. \"An Interesting Experience: experience with 2C-I (ID 81622)\". Erowid.org. Jun 8, 2010. erowid.org/exp/81622",
 "substance": "2C-I",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 81622",
   "Gender: Male",
   " ",
   "Age at time of experience: 32",
   "Added: Jun 8, 2010",
   "Views: 2171",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI obtained a small amount of 2CI. My scale only weights to .01 grams so I weighed out .02 grams (20 mg) in two piles of 10mg and then put back 2/3 to ½ of the second pile, leaving the pile at an estimated size of 3 to 5mg. Because of this I am unable to state exactly what my dose was, but estimate it was between 13 and 15 mg, possibly adding a few extra milligrams from the dust and residue I licked off of the devices I used to transfer and weigh the material.\r[Erowid Note: One should always use a scale with appropriate accuracy every time individual doses are prepared, especially for substances active at less than 50 mg. See related article] \r\nAt +0:15 I started to feel some minor alerts, these built very slowly for the next hour. I was working from home and sitting in front of a computer listening to music. I noticed some minor visual distortions which built slowly for the next hour and a half. Oddly I noticed no aural distortions at all.\r\nAt +2:00 I was definitely noticing some significant visual distortions, no morphing or geographic patterns, these were almost completely sharpened perceptions and colors being more vivid. When I went to the bathroom and looked in the mirror and at the tiles I may have noticed some more typical visuals.\r\nAt +3:00 I would say I was starting to peak and at this point was having great difficulty focusing on the work I was attempting to do. Instead of trying to focus on my work I instead laid my head down on my desk and enjoyed just being in my own head.\r\nAt +4:00 the peak experience was continuing. Although I was home alone I feel I was able to function somewhat normally, despite my inability to think in words or logic I was able to perform normal daily tasks without any serious problems.\r\nBy +5:00 I was still in a peak state and was getting worried as I had plans for the evening and had been counting on being down and sober for these plans. Over the next hour the comedown was very rapid and very smooth.\r\nBy +6:00 I was pretty much completely sober. When my friend picked my up I found myself a bit giddy and giggly being in the presence of another person and kept laughing to myself at nothing in particular, but it seemed very funny to me. This reminded me of my first experience with mushrooms about 16 years ago when I consumed just one mushroom and just laughed at everything for hours.\r\nBy +8:00 I felt completely sober.\r\nThis was a very interesting experience and I enjoyed it greatly. There was a great body high, the visual hallucinations were there but not overwhelming or particularly strong or distracting. Oddly I noticed no aural hallucinations, as a big music fan one of my favorite aspects of psychedelics is how they enhance music. With this material I noticed none of that. I also greatly enjoyed the introspection. As a casual practitioner of Buddhism and meditation I have some practice at quieting my mind and this allowed me to quiet and empty my mind without any effort. Rather than examining everything and thinking about everything I was able to just sit with a blank open mind and enjoy whatever was going on around me.\r\nI definitely plan on trying this again, and the subtle nature may allow me to use this in settings outside my home. I am normally very reluctant to use psychedelics outside my home as I want the experience to be personal and spiritual.\n\n\n"
}