{
 "title": "Feelin Kinda Foxy",
 "author": "Bobocabra",
 "citation": "   Bobocabra. \"Feelin Kinda Foxy: experience with 5-MeO-DiPT (foxy methoxy) & Cannabis (ID 81723)\". Erowid.org. Aug 9, 2010. erowid.org/exp/81723",
 "substance": "5-MeO-DiPT (foxy methoxy) & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 capsls",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   "  T+ 3:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 4:30",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2008",
   "81723",
   "Male",
   " ",
   "18",
   "Aug 9, 2010",
   "2705",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me first tell you a bit about my history of pychedelic use. Ive been smoking pot everyday sense I started when I was 14, sense then Ive experimented with about all recreational pharms (not a fan of those), salvia, kava, mescaline, lsd, mushrooms, mdma, ketamine , 2c-b, dmt, 5me0-dmt, 5meo-dipt, tmfpp, bzb, mcpp and several others wich I cant remember at the moment.</p><p>Now this was my first time having heard of let alone try foxy. I was at a psychedelic deseart party when one of my friends tells me this hippie couple was wanting to trade a couple of doses for a couple blue supermen wich we had taken to the party. They described it to me as like being on horny mushrooms. Naturally I was quite intrigued and followed them to there camp, they didnt have a scale on them so the guy eye balled the doses as best he could, he said they were pretty good doses, altogether Id say it was about 25 mg to 30 mg of powder in a small capsule. He told me to just dilute the dose in water and split it with who ever I was taking it with. My plan was to stay at the party, and try this foxy when I got back to my friends house. Now at the party I was selling rolls, at one point I had one pill left and no bag, as I walked around trying to find a bag the pill was crumbling from the sweat in my hand, so I decided to just eat it, that was around 11 p.m. Later in the party at around 2a.m Im offered free ketamine, only about a dub bag but thats all I needed at the time.</p><p>We finally leave the party at around 4a.m. when we get back to the house my friend (who we call matches) wanted to dose with me, hes the only one whos down with research chems. At around 6 a.m. we poured the powder into a small glass vile, filled it with water and split the water equally. Drinking this water was very disgustinig, it was like drinking liquid burnt tires. The taste stuck in my mouth for about a half hour or so.</p><p>20 min into the trip my stomach was feeling very warm and fuzzy inside, I was allready liking the way it was starting out. Me and matches decide to sit outside to watch the clouds go by. </p><p>1 hour into the trip the visuals are starting to set in and the body high is extreamly tingly and sensational, the body high was amazing.</p><p>2 hours into the trip some of matches friends come over and offer us to go hiking with them in the deseart. Matches was down for the idea but I wanted to wait at the house for some dank pot to show up. So matches leaves on his hiking adventure while Im at the house with everyone else being asleep.</p><p>2 and half hours in Im siting in the living room on the couch enjoying my trip. I sat there staring at the large tie-dyd piece tapestry that was hanging on the wall, the visuals had gotten much more intense. The colors started to flow more vibrantly and consitantly. The tapestries corners were stretching long and sharp, I found this extreamly funny and was giggling so loud I woke up one of the people on the couch across from me. Well call him trails. Trails woke up and knew instantly I was fucked up on somthing. He too was in dire earge to smoke so he called around and within 20 min we had a ride to go pick up an 8th of some afgangoo.</p><p>3 hours in were on our way to the d's house. As we pull up to a red light, we sat there waiting, when the light turned green I screached with laughter. I had thought the jeep we were in had stayed still and had completley moved the earth underneath us. So we get the sack and get back home and decide its time for a blunt, we roll about a gram into the blunt and smoked it just me him and our roomate (we call him goob). This made the visuals skyrocket with intenseness, also the body high had become almost overwhelming. I was curled up on the couch in a blanket, freezing my ass off, but I was sweating and the house was realy hot (we live in arizona so its hella hot here all the time)</p><p>3 and a half hours in the munchies droped on me like a bomb, we drive up to kfc, and order around 10 snacker bowls for us 3. Thinking now that were full lets smoke another blunt.</p><p>4 hours in and after the second blunt Im still feeling the foxy very strong, and to my surprise, Im just as hungry as I was an hour before, so we decide to take another road trip down to the closest burger king, were I got several rodeo burgers and whopper jrs. The food is as amazing this time as it was the first time. Id have to say foxy munchies are some of the best Ive had.</p><p>4 and a half hours in after were done eating. We decide to smoke the last gram and a half in a final blunt. We sat around smoking, the visuals about the same as an hour before, and the body high still feeling amazingly instense. And to my surprise, Im still just as hungry as before, so I talk goob into taking me to jack in the box so I can buy some churros and tacos to fianly satisfy my hunger. This time it fianly did hit the spot. When we get back to the house matches is back home and hes only about as half fucked up as I am because he spent all that time hiking with no buds, while I sat on a couch smoking eating and smoking and eating. </p><p>Over the next couple of hours the visuals subsided and the body high was still kind of there. I just sat around at the house playing games and enjoying the rest of my buzz. It took about 12 hours for me to reach baseline, and another 6 for me to finaly get to sleep. </p><p>Foxy was an amazing experience and sense then Ive developed a love for this methoxy. Ive only done it 3 times sense, the 3rd time being last night, wich was almost as amazing as the first time.</p>"
}
