{
 "title": "Tactile Mayhem",
 "author": "Matt",
 "citation": "Citation:   Matt. \"Tactile Mayhem: experience with Salvia divinorum (5x extract) (ID 8179)\". Erowid.org. Jun 28, 2004. erowid.org/exp/8179",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)",
   " ",
   "  ",
   "smoked",
   "Tobacco",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8179",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2004",
   "Views: 4516",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAs a regular cannabis user, Salvia was my first excursion into the ontologically arbitrary world of hallucinatory plants. With a smoking partner, I smoked one recommended dose (as indicated on the label) of 5x extract. While I was apphrensive, I was confident that I could ultimately emerge unscathed from anything that might happen during my experience. I was, generally speaking, right---however, I was more than surprised at the capacity for complete conscious delusion that this plant can engender. \r\nI tried to prepare for my trip logistically by leaning back on a bed as I used the extract mixed with tobacco in a chillum---thinking that if the plant hit me hard I would be safe from falling onto the floor. Nervously I lit up my concoction and inhaled furiously as to not waste any of the extract. Almost immediately I felt a slight radiance of body heat eminating from my shoulders and neck, and began to breathe slightly rapidly. What happened next is completely inexplicable. \r\nI immediately abandoned my pretense to safety and found myself standing up in the middle of the room with my friend sitting down looking up at me. On one side of the room there were two large open-air windows, but otherwise the floor was clear. I soon found myself overwhelmed with an 'almost' panicked sense of urgency in completing an inexplicable task. For I felt, all over my legs, invisible hands pulling at my pant legs pulling me over towards the window---as if invisible little spirits that were in dire need of my assistance wanted me to cooperate with them (there was nothing intrinsically malevolent about the feeling of being touched, or being in their presence). With jerky motions I went to the window and found myself 'pulling' an invisible rope, as if I was helping to pull something up that was dangling outside of the window. My friend sat motionless and disturbed, and much to my dismay, was ignoring my pleading for assistance in the task.\r\nI remember clearly pleading with these beings to not leave--that we would in fact help them as soon as I could convince my friend of their reality and the task at hand. Soon I ended up 'letting go' of the invisible rope as I felt them all moving out of the window back down the way they seemingly came. Before I knew it I was sitting back down on the bed completely confused but amused by the fantastic tactile sensations I had felt, and my own fleeting earnestness in helping these almost cliched energy-beings. The strangest part, though, is that in spite of my eventual recognition that these beings were hallucinations, I was saddened at having let them down. \r\nThe truth of the matter is, however, that I will probably not be trying Salvia again. The experience was simply too unpredictable for regular use, and the feeling of being helplessly pulled towards the window could have ended in a bad way (splat!).\n\n\n"
}