{
 "title": "Luminosity",
 "author": "Tia Serendipia",
 "citation": "   Tia Serendipia. \"Luminosity: experience with Tabernanthe iboga (extract) (ID 81800)\". Erowid.org. May 27, 2010. erowid.org/exp/81800",
 "substance": "Tabernanthe iboga (extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Tabernanthe iboga",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 81800",
   "Gender: Female",
   " ",
   "Age at time of experience: 40",
   "Added: May 27, 2010",
   "Views: 5526",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOne week and one day later, I can write about this.<br>There is SO much to convey, to report, I won't be able to share it all.<br>Layers upon layers upon layers of experiences, that continue to this moment<br>in calm and profound ways. I did the right thing.<br>I began preparations a week before, cutting out meats, focusing on things<br>I wanted to change in my life, intentionally introspective and self aware<br>to the best of my ability. All this time, I had the feeling that Iboga was<br>aware of me. I'll say this once, then just let it go: I'm reporting some<br>things that won't jibe with consensus reality. Nevertheless, they are real.<br>Think what you will.<br>The day before I was going to take the Ibogaine, I ate only vegetables, and had<br>my last cigarette in the evening. I'd been sober off alcohol for about,<br>well, 4 weeks? I spent time in the jacuzzi,<br>relaxing and focusing, praying and meditating. I invited Iboga in<br>intentionally during a meditation. Interestingly, I felt acceptance, and my<br>visualization was intense. Felt like it wasn't self generated at all, and<br>included splitting me open at the middle (solar plexus? xyphoid process to<br>pubis?). I sealed and sent my intention with the energy generated by<br>orgasm, then with some trepidation, went to bed.<br>The next morning at 9am, I took a test dose of TA extract. I tolerated<br>this well and took a flood dose carefuly calculated for my height, weight,<br>gender and length of sobriety. This did not take me where I needed to go,<br>and so over time, in 300-400mg increments, I made it up to over 3 grams of<br>extract. Apparently I was a hard nut to crack. Two other people I have<br>spoken with used the same product and found it very potent, so that wasn't<br>the issue. (Wish I had boosters, though!!! Damn!).<br>At around 3?4? in the afternoon, I looked in the mirror across from the<br>bed and saw some people peeking around the corner of it-from the inside- to<br>check if I was ready. I called for a giant mouthful of plain yogurt, I was<br>craving it like mad, lay down, and went on a journey. :)<br>I threw up only twice, shortly after that, quickly and painlessly. I<br>suffered no prolonged nausea and no dry heaves.<br>My BP was strong the entire time, not much fluctuation from my normal<br>100/70. My pulse stayed at an average 56 beats. I was so incredibly<br>relaxed. Of course there were visuals. So many visuals I could not possibly<br>tell you all of them, as time was very different as well. I can tell you it<br>began with an eye, that saw me. A sense of myself having waited, maybe as<br>if in a queue, and I was finally seen, addressed. It was my turn.<br>I was matter of factly and sometimes with humor shown many, many things<br>about Beverly, and about the world. Much of my thinking was realigned, and<br>many old wounds were cleaned out. I also know very strongly that I will<br>take this journey again, that Iboga has more for me, and I for Iboga,<br>though I realize how presumptuous that sounds. I did indeed communicate<br>with my dead elders, remember that was one of my early questions? I also<br>think that my 20 some odd year history with meditation and visualization<br>and traditional magics were a boon, as was having been fairly sober except<br>for marijuana and a couple days of recreational darvocet for some weeks.<br>I also did Not want to be disturbed during the experience, and maybe came<br>across as bitchy in conveying that (sorry, dear husband!lol). I cried a few<br>times during, but it seemed that as soon as the emotion made it to my<br>mouth, I was onto healing the next thing.<br>I came around the next morning full of light. Or maybe just so clean<br>inside that my light was visible. If I didn't have a witness, it would be<br>almost hard to believe that my skin actually glowed. Light from within, I<br>was luminous. I was enamored of my hands, so pretty and soft, though I<br>didn't look in a mirror for three days. I didn't think of it.<br>I again went to the jacuzzi. I was able to sit lotus without a thought in<br>my head, not a thought! for ten minutes. This is actually amazing, lol. I<br>was and am so calm. I did not want a cigarette, a drink, nothing. I was<br>free of all wants, really. A perfectly lovely place to be.<br>My ovarian cysts have shrunk to the point of being no longer palpable.<br>This is down from 9cm and visible when I lay on my back. I no longer need<br>surgery for the moment.  My surgery was scheduled for 9/14. :)<br>I then dined on a brilliant plate of fruits. In little teeny tiny bites,<br>lol. Everything tasted divine. Interestingly, for most of my life I have<br>disliked fruit. Now, I've been to three farmer's markets in one week<br>because I can't get enough. I proceeded that same day to read 'The Easy Way<br>to Quit Smoking' (thanks to the wonderful human here who brought that to my<br>attention) and finished it. I've wanted a cigarette a couple times since,<br>but mostly out of boredom and when it's a habit (afetr eating, etc) nothing<br>I can't acknowledge away. :) I am not finding alcohol to be an issue any<br>longer. I'm not even thinking about it.<br>I made roast chicken and braised squash on the next night, with a simple<br>risotto. I needed a splash of wine for the risotto. The rest of the bottle<br>is still sitting in my house. It is a non-issue.<br>I also must say that emotions bubbled up after, and still are, but not in<br>the same way. For the first few days they came like puke or diarrhea. Not<br>that it was gross, but definitely was a purge, and there was NO stopping<br>it!!! Lol, walking down the street, getting sad about not seeing my beloved<br>grandmother one last time before she passed. Looking desperately for an<br>alley or hidey hole, because, man, I'm going to sob! After each cry,<br>though, I just felt bigger inside. Wider, more expansive. I now fully<br>inhabit my skin.<br>I can breathe into my feet, my breathe moves in me.<br>Also, in the past I have been buffeted by other people's emotions, I pick<br>up on them like a sponge, often to my detriment and confusion. This is<br>amazingly under control now. I am less porous, less...vulnerable? Yeah, but<br>less porous seems more accurate. I have not lost the ability to connect,<br>but it's a choice, and I can see whose emotions are whose. This is such an<br>unexpected gift, but just one of many.<br>I also look much younger, according to husband and dear friends. My face<br>feels so relaxed. There is less pain on it, to be sure.<br>I also am confirmed in needing to escape this darned day job! (In time, in<br>time)<br>There is so much more, but this is a decent brief.<br>I see many things clearly now, and am confirmed in my thinking on many<br>others.<br>I know I will be working with Iboga in some capacity, I have no idea how,<br>but I am confident about it. I did the right thing.<br>My very heartfelt thanks to Iboga, the place it grew, the hands that<br>harvested, the entities that got it from there to me, my husband for<br>sitting with me and everyone who has contributed to the movement.<br>Particular thanks to the individuals who have taken the time to talk with<br>me privately, and opened their hearts to me, giving me the gifts of their<br>time and attention.<br>It is my hope to be able to give back at least as much as I have been<br>given.<br>I am a different woman, or maybe just more profoundly and completely the<br>woman I've always been. ;)<br>Love and rockets,<br>Tia\n\n\n"
}
