{
 "title": "Luminosity",
 "author": "Tia Serendipia",
 "citation": "   Tia Serendipia. \"Luminosity: experience with Tabernanthe iboga (extract) (ID 81800)\". Erowid.org. May 27, 2010. erowid.org/exp/81800",
 "substance": "Tabernanthe iboga (extract)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Tabernanthe iboga",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 81800",
   "Gender: Female",
   " ",
   "Age at time of experience: 40",
   "Added: May 27, 2010",
   "Views: 5526",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One week and one day later, I can write about this.</p><p>There is SO much to convey, to report, I won't be able to share it all.</p><p>Layers upon layers upon layers of experiences, that continue to this moment</p><p>in calm and profound ways. I did the right thing.</p><p>I began preparations a week before, cutting out meats, focusing on things</p><p>I wanted to change in my life, intentionally introspective and self aware</p><p>to the best of my ability. All this time, I had the feeling that Iboga was</p><p>aware of me. I'll say this once, then just let it go: I'm reporting some</p><p>things that won't jibe with consensus reality. Nevertheless, they are real.</p><p>Think what you will.</p><p>The day before I was going to take the Ibogaine, I ate only vegetables, and had</p><p>my last cigarette in the evening. I'd been sober off alcohol for about,</p><p>well, 4 weeks? I spent time in the jacuzzi,</p><p>relaxing and focusing, praying and meditating. I invited Iboga in</p><p>intentionally during a meditation. Interestingly, I felt acceptance, and my</p><p>visualization was intense. Felt like it wasn't self generated at all, and</p><p>included splitting me open at the middle (solar plexus? xyphoid process to</p><p>pubis?). I sealed and sent my intention with the energy generated by</p><p>orgasm, then with some trepidation, went to bed.</p><p>The next morning at 9am, I took a test dose of TA extract. I tolerated</p><p>this well and took a flood dose carefuly calculated for my height, weight,</p><p>gender and length of sobriety. This did not take me where I needed to go,</p><p>and so over time, in 300-400mg increments, I made it up to over 3 grams of</p><p>extract. Apparently I was a hard nut to crack. Two other people I have</p><p>spoken with used the same product and found it very potent, so that wasn't</p><p>the issue. (Wish I had boosters, though!!! Damn!).</p><p>At around 3?4? in the afternoon, I looked in the mirror across from the</p><p>bed and saw some people peeking around the corner of it-from the inside- to</p><p>check if I was ready. I called for a giant mouthful of plain yogurt, I was</p><p>craving it like mad, lay down, and went on a journey. :)</p><p>I threw up only twice, shortly after that, quickly and painlessly. I</p><p>suffered no prolonged nausea and no dry heaves.</p><p>My BP was strong the entire time, not much fluctuation from my normal</p><p>100/70. My pulse stayed at an average 56 beats. I was so incredibly</p><p>relaxed. Of course there were visuals. So many visuals I could not possibly</p><p>tell you all of them, as time was very different as well. I can tell you it</p><p>began with an eye, that saw me. A sense of myself having waited, maybe as</p><p>if in a queue, and I was finally seen, addressed. It was my turn.</p><p>I was matter of factly and sometimes with humor shown many, many things</p><p>about Beverly, and about the world. Much of my thinking was realigned, and</p><p>many old wounds were cleaned out. I also know very strongly that I will</p><p>take this journey again, that Iboga has more for me, and I for Iboga,</p><p>though I realize how presumptuous that sounds. I did indeed communicate</p><p>with my dead elders, remember that was one of my early questions? I also</p><p>think that my 20 some odd year history with meditation and visualization</p><p>and traditional magics were a boon, as was having been fairly sober except</p><p>for marijuana and a couple days of recreational darvocet for some weeks.</p><p>I also did Not want to be disturbed during the experience, and maybe came</p><p>across as bitchy in conveying that (sorry, dear husband!lol). I cried a few</p><p>times during, but it seemed that as soon as the emotion made it to my</p><p>mouth, I was onto healing the next thing.</p><p>I came around the next morning full of light. Or maybe just so clean</p><p>inside that my light was visible. If I didn't have a witness, it would be</p><p>almost hard to believe that my skin actually glowed. Light from within, I</p><p>was luminous. I was enamored of my hands, so pretty and soft, though I</p><p>didn't look in a mirror for three days. I didn't think of it.</p><p>I again went to the jacuzzi. I was able to sit lotus without a thought in</p><p>my head, not a thought! for ten minutes. This is actually amazing, lol. I</p><p>was and am so calm. I did not want a cigarette, a drink, nothing. I was</p><p>free of all wants, really. A perfectly lovely place to be.</p><p>My ovarian cysts have shrunk to the point of being no longer palpable.</p><p>This is down from 9cm and visible when I lay on my back. I no longer need</p><p>surgery for the moment.  My surgery was scheduled for 9/14. :)</p><p>I then dined on a brilliant plate of fruits. In little teeny tiny bites,</p><p>lol. Everything tasted divine. Interestingly, for most of my life I have</p><p>disliked fruit. Now, I've been to three farmer's markets in one week</p><p>because I can't get enough. I proceeded that same day to read 'The Easy Way</p><p>to Quit Smoking' (thanks to the wonderful human here who brought that to my</p><p>attention) and finished it. I've wanted a cigarette a couple times since,</p><p>but mostly out of boredom and when it's a habit (afetr eating, etc) nothing</p><p>I can't acknowledge away. :) I am not finding alcohol to be an issue any</p><p>longer. I'm not even thinking about it.</p><p>I made roast chicken and braised squash on the next night, with a simple</p><p>risotto. I needed a splash of wine for the risotto. The rest of the bottle</p><p>is still sitting in my house. It is a non-issue.</p><p>I also must say that emotions bubbled up after, and still are, but not in</p><p>the same way. For the first few days they came like puke or diarrhea. Not</p><p>that it was gross, but definitely was a purge, and there was NO stopping</p><p>it!!! Lol, walking down the street, getting sad about not seeing my beloved</p><p>grandmother one last time before she passed. Looking desperately for an</p><p>alley or hidey hole, because, man, I'm going to sob! After each cry,</p><p>though, I just felt bigger inside. Wider, more expansive. I now fully</p><p>inhabit my skin.</p><p>I can breathe into my feet, my breathe moves in me.</p><p>Also, in the past I have been buffeted by other people's emotions, I pick</p><p>up on them like a sponge, often to my detriment and confusion. This is</p><p>amazingly under control now. I am less porous, less...vulnerable? Yeah, but</p><p>less porous seems more accurate. I have not lost the ability to connect,</p><p>but it's a choice, and I can see whose emotions are whose. This is such an</p><p>unexpected gift, but just one of many.</p><p>I also look much younger, according to husband and dear friends. My face</p><p>feels so relaxed. There is less pain on it, to be sure.</p><p>I also am confirmed in needing to escape this darned day job! (In time, in</p><p>time)</p><p>There is so much more, but this is a decent brief.</p><p>I see many things clearly now, and am confirmed in my thinking on many</p><p>others.</p><p>I know I will be working with Iboga in some capacity, I have no idea how,</p><p>but I am confident about it. I did the right thing.</p><p>My very heartfelt thanks to Iboga, the place it grew, the hands that</p><p>harvested, the entities that got it from there to me, my husband for</p><p>sitting with me and everyone who has contributed to the movement.</p><p>Particular thanks to the individuals who have taken the time to talk with</p><p>me privately, and opened their hearts to me, giving me the gifts of their</p><p>time and attention.</p><p>It is my hope to be able to give back at least as much as I have been</p><p>given.</p><p>I am a different woman, or maybe just more profoundly and completely the</p><p>woman I've always been. ;)</p><p>Love and rockets,</p><p>Tia</p>"
}
