{
 "title": "Epic Snowball Fight",
 "author": "Whitewater",
 "citation": "   Whitewater. \"Epic Snowball Fight: experience with Mushrooms & Cannabis (ID 81818)\". Erowid.org. Jan 17, 2011. erowid.org/exp/81818",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   " ",
   "1 g",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 81818",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Jan 17, 2011",
   "Views: 2213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had recently popped my shoulder out of my socked, and the doctor prescribed me a bunch of Percocets for the pain. I'm not really a fan of painkillers so I decided to sell them for some mushrooms. Me, my sister C, and my good friend M were making plans to take them on a Monday a week or so in the future. When that day rolled around I was real excited, and trying to get myself into a good mindset about the ordeal. It had been a while since I last ate some shrooms, over a couple years. Every time I've taken them I had an incredible experience, despite negative things actually happening.\r\nThe first time I tripped I was extremely nervous about it, but 30 minutes into the experience I found myself more relaxed then I could ever remember being. Later that night we would be interrogated by a bunch of police because they thought we were responsible for some nearby break ins... not likely, half of us were barefoot (this is South Florida). They eventually let us go, but throughout the whole thing I never lost my initial optimism. Maybe I'll write a trip report about that someday, cause it was extremely fun, unfortunately this trip I was preparing for didn't turn out to be that fun... \r\nI was riding back to my town from my girlfriends town with a friend of mine at about 7:00 am, he asked if I wanted to hit some chronic, and I couldn't refuse. Back then I was smoking a lot of pot. I ended up getting extremely blazed and felt great, although looking back I wish I hadn't got so high that morning because I ended up smoking way to much that day and I feel like it lessened the shock of coming up on the shrooms. I got in my car and picked up my sister S, and we both drove over to M's house.  (it's not a good idea to drive while intoxicated, it's irresponsible) *my disclaimer*\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]\r\nThis is when things started getting weird, the setting for this trip was BAD! You see, at this time my sister S, and my good friend M were actually dating, which was weird in and of itself, but today they were having severe relationship problems and refusing to actually communicate with one another to figure it all out. So I realized the vibes were a little weird, but asked M to pull out our shrooms anyway. We measured out 3.5 g's a piece, and me and M ate them with some sour peach rings. C was making fun of us for being wimps and chasing them, then devoured hers straight. To kill some time for the come-up, me and M moved some music equipment from M's garage to his living room, because being February in MI it's hard to play when your fingers are too cold, and we thought it might be fun to trip out and make obnoxious noise.\r\nAfter we moved everything around, and set it up M started saying he could feel them a little. I couldn't feel anything at all, so we went into M's room and smoked a bowl. The weed made me a little more aware of the subtle anticipation preluding the mushroom trip, and I starting getting really pumped up to start jamming with M. I started playing and noticed M wasn't really trying to play anything at all, I asked him what was up and he said he was already too high to play, and looking into the mirror wasn't helping. I was kinda shocked, because I really wasn't feeling much at all, but decided it was probably a good idea to see what C was up too.\r\nI found her setting up speakers in the kitchen to play music throughout the whole house. I thought this was a great idea and helped her speed up the process. M had moved over to a reclining chair, and sat kinda motionless, I could tell he was gonna have a strong trip. C said she was also starting to feel the shrooms, and I was the only one feeling more or less sober. That kinda bummed me out, I had waited a while for this trip and had hoped for a good one, I didn't want to be let down. At that time C let me in on a secret, she had only ate a portion of her 3.5 g's. She said she didn't feel like tripping too hard. I laughed about her wanting to hide that, because theres no reason me or M would care at all if she wanted a smaller dose, but then I asked her if I could eat her remaining mushrooms. M told me that if you don't eat them all at once they won't make that much of a difference. I don't know how much truth there is to that statement, and said I was gonna eat them anyway. I weighed them, there was another G.\r\nLooking back I was obviously tripping at this point, but never realized it because my mind was fucked up. I remember holding the mushrooms together, and noticing they looked like little cacti, not mushrooms, laughed then chewed em up and swallowed them, no peach rings. I began pacing because C was playing some good music, and was really enjoying the feeling of the music. I admitted to myself I was beginning to feel the shrooms, and enjoyed their peculiar euphoria. M packed up another bowl and we walked outside to smoke it in the garage. It was a beautiful day, very clear sky, about a foot or so of snow reflecting the brilliant sunshine, blinding our eyes. The only downside was the frigid temperatures. I believe it never got much over 22 degrees that day.\r\nWe shut the door to the garage and slowly adjusted to the dim light filtering through the sole shaded window while we smoked the bowl. I was feeling pretty good at this point, and my vision of the garage changed, letting me see in the dim garage. We stayed there talking and joking for a little while, then M opened the garage door and my vision was assaulted by the overpowering light reflecting off the snow. The usual white reflected into a shimmering prism and moving color, and was extremely beautiful. M experienced this the same way, I could tell by the way he said 'wow'. I was overjoyed with the beauty, and suddenly had a great idea. I ran out there and began hurling snowballs at M and C. C did not appreciate this, and hid herself in the garage. M mostly just looked confused. I realize this may have seemed mean or maybe a little surprising, but I was seriously hoping for an epic snowball fight. After a few more strikes M decided it would be best to defend himself, which was exactly what I was hoping for. I had a great time with that until I realized how cold my hands were.\r\nI apologized to C, and she laughed at me because she new I was kidding, and said she would have played along if it wasn't so cold. We walked inside to warm up. At this point in time I probably could have entered a visionary state if I had focused on that, but I had way too much physical energy, the snowball fight was only a warm up. I convinced M to go outside and throw his disk golf driver back and forth with me. We did that for a while, but those things hurt to catch, so our game didn't last long. I then convinced M to walk with me to Kroger because I wanted something. I honestly can't remember what I wanted because it was only an excuse for an adventure. M thought this was a bad idea, he said he couldn't fathom trying to act sober in public. Let down, I walked back into his house.\r\nC's playlist was getting much heavier at this point, and she was absolutely wigging out. I tried really hard to communicate with her but she was just laughing, or punching a pillow, or looking at herself in the mirror. It was weird. This was the time I started feeling the negative energy buzzing around on a personal level. I walked to the back door, though it took forever for me to get there. My peripheral vision became a pulsating red and the walls became purple. My skin became scaly, and I knew I was a snake. The insanity crept up my spine until my whole world began shaking like it was crumbling. I walked outside into the cold, in a T shirt, and kneeled onto the ground. I knew what I had to do, I had to purge myself from all this evil that surrounded me and connect myself to nature. I puked a few times (glad I wasn't at Kroger), and began trying to purify my mind. It worked and my nausea was gone. I noticed my puke looked like a bunch of little cartoon mushrooms, I thought it was pretty cool.\r\nAs soon as I tried to walk back inside I was nauseous again, it hit me like a brick. I turned around and sat down on M's porch, regaining my stability. I wondered why the vibes were so nasty in his house. Eventually M realized I was sitting outside in the freezing cold without a jacket and made sure I was ok, I said yeah and walked back into his house. I realized I needed to strengthen my own energy to keep everything else out, and that idea worked. Unfortunately for the remainder of the trip I felt disconnected from M and C. \r\nActually the entire remainder of the trip was much more introspective. I watched the curtains turn into snakes and lizards (animals I like, not frightening at all) and the carpet move. I was finally enjoying the visual aspect when I get a text message from my girlfriend saying 'for some reason I woke up this morning feeling like it was my day to die, I feel very weird'. It was a very bizarre message, I couldn't quite figure it out, and it only added to the strangeness of the trip. I was totally engrossed in the music at this point, and stayed that way for a while just trancing out listening to the tunes watching snakes and lizards shift around M's room.\r\nWe smoked another bowl, and it felt so amazing I loved it, and it only chilled me out more. I stayed that way until M's mom came home from work. She came into M's room holding M's disk, saying 'Hey you forgot your TRAY' thinking we were using it to break up weed. We all started laughing and M's mom said 'well, I know theres no way in hell you were outside throwing that thing around today', we all laughed harder. She just assumed we were stoned. She didn't like M smoking weed, but knew he did it and admitted to having done it in the past, basically she wasn't a scary mom to be around when messed up. Feeling more or less sober I drove home and slept a really long time.\r\nThanks for reading that long and pointless account, it was my first trip report : ). All in all I would have to say it was a neutral experience with mushrooms, plenty of good and bad. It was for sure the closest I've ever came to having a 'bad trip'. But even at it's worse point I can recall experiences with alcohol being much worse. I am planning on doing a much more positive trip in the near future, and I'm not going to smoke weed because I've never tripped without smoking, and I am curious how that will affect my experience.\r\nP.S. M's mom was not happy with her living room being turned into a jam room\n\n\n"
}
