{
 "title": "Long-term Use - Acute Neurological Effects",
 "author": "Casper",
 "citation": "   Casper. \"Long-term Use - Acute Neurological Effects: experience with Cannabis (ID 81915)\". Erowid.org. Feb 11, 2011. erowid.org/exp/81915",
 "substance": "Cannabis",
 "bodyweight": "93 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 81915",
   "Male",
   " ",
   "Age at time of experience: 29",
   "Added: Feb 11, 2011",
   "Views: 9282",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I began using cannabis after parental abuse, abandonment, homelessless, unemployement - you get the gist. I've used MDMA a handful of times, speed is avoided because I like it waaaay too much and alcohol's for hobos. No psychadelics of any kind.</p><p>Some background - I'm a writer and editor, and I'm very good at it. The lack of evidence for this in the following passages is the most sobering demonstration I can give you. National publications in newspapers, magazines, screenwriting and copywriting, every mode of the written language you can name and excelled at all of them. I've no reason to lie with a pseudonym. Despite my constant cannabis use, I completed two degrees and am about the embark on a med science degree cause why the fuck not.</p><p>This is to characterise me as together kinda guy with drive, talent and determination.</p><p>Weed never really held back my intellectual development. I learnt fast, and I retained info well, cross-referencing it for later. Bear in mind I was putting away about half an ounce per week, throughout the entire time.</p><p>I'd have problems with word recall, but only when bonged over and a good finger-drumming would usually deliver the goods. However, at the beginning of this year i got tinnitus. It pushed me to the brink of suicide. Weed was my saviour, and serendipity decreed I'd get access to 25%+ THC weed at the same time, and lots of it. Mounds of it. More than I could sell OR smoke. But being a go-getter, I tried anyway.</p><p>Two weeks ago, I got an acute reaction. I'd be stumped for a word (especially when editing), and the door of inspiration with its well-worn, comforting brass handle all of a sudden opened to reveal... nothing. The Nevada badlands, replete with tumbleweeds and mute wolves roaming in packs. The word simply WAS NOT THERE. I was once a TV comedy scriptwriter. My humorous connection died at the same time. Not impaired - gone. Just gone. I'd love to think of another word for 'gone', but the words have flown away. I read what I've written above and it makes me sick with its pedestrian nature.</p><p>I've quit for a month and no improvement. None. Words are my bread and butter and now I'm making do with cockroach gruel and what I can sop from the walls of my dark new cell. I doubt it will ever return. It feels like I've lost my voice, and my best friend stole it.</p><p>I love weed more than anyone. Weed has destroyed my talent. I'm the same guy, I'm as smart as ever and no-one tells the difference to talk to me. There is one, it's acute, and it's destroying me inside every time I try and breathe life into the pictures I see in my head. My tongue's been torn from my jaw.</p><p>Please, smoke weed in moderation. You get higher, you can function, and you can improve upon rather than clinging to the rare gift blind chance dropped on you for no discernible reason. Please, please, please. Heed my warning. Weed's great. Moderate your use. I beg you. That's all.</p><p>[Reported Dose: Average 1/2 ounce a week for 13 years, ages 16-29]</p>"
}
