{
 "title": "The Spiral that Contains the Universe",
 "author": "The Other Side",
 "citation": "   The Other Side. \"The Spiral that Contains the Universe: experience with Gymnopilus spectabilis & Peganum harmala (ID 82)\". Erowid.org. Sep 10, 2000. erowid.org/exp/82",
 "substance": "Gymnopilus spectabilis & Peganum harmala",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Syrian Rue",
   "  T+ 0:45",
   "10 g",
   "oral",
   "Mushrooms - G. spectabilis"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 82",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 10, 2000",
   "Views: 8928",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a combination of two separate experiments. One done one night before the other.  Both with the same dosage.</p><p>2 grams of Peganum harmala </p><p>10 grams of Gymnopilus spectabilis</p><p>4 decent size roaches (marijuana)</p><p>The Peganum h. was ingested 45 minutes before the mushrooms. The mushrooms were crushed as much as possible, and then at the last minute, dropped into beef stew. The roaches were smoked one and a half hours after the mushrooms.</p><p>I began to feel the mushrooms taking effect after about an hour. The effects were mild, until the weed was smoked (marijuana always enhances entheogens for me). After that, everything became very psychedelic.</p><p>There were colors forming everywere, and the patterns could definitely be noticed. If I concentrated enough, I could put all the patterns together, to form one inmense spiral (the spiral that contains the whole universe in it).</p><p>I had more visuals on the first night. On the second night was when I broke through:</p><p>I closed my eyes and began to concentrate. All the sudden I was no longer in my body. I was not anywere on Earth. I had entered the spirit realm. It was either too dark to see anything, or I just couldn't see. I could only feel another spirit in the distance (the purpose of me going into the spirit realm, was to make contact with a loved one). I could not feel that it (the spirit) had any color to it, it was very transparant tho. As I approached it, I began to feel love. When I reached it, I merged with it. We were no longer two separate spirits, we were both one. The feeling was so intence. It was a feeling of pure love. It was the best feeling I have ever felt. Words can't ever describe how good it felt. I also noticed that I, or the other spirit I was with didn't have any thoughts. We were pure energy. There was no thoughts, it was all just a feeling of energy (love). Unfortunately this didn't last very long (not longer than thirty seconds). The next thing I knew, I was back in my body.</p><p>I was also able to reach a deeper consiousness. Before this experience, I believed that there were only three. Now I know it goes much deeper than that. In this deeper consciousness I was shown a much larger part of my mind. But I also realized that there is much more. I am not sure if this mushroom will allow me to go deeper. Perhaps a combination with Salvia will do the trick.</p>"
}
