{
 "title": "Pretty Versatile Chemical",
 "author": "Rvan0015",
 "citation": "Citation:   Rvan0015. \"Pretty Versatile Chemical: experience with MDPV (ID 82100)\". Erowid.org. Oct 7, 2010. erowid.org/exp/82100",
 "substance": "MDPV",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "insufflated",
   "MDPV",
   "(powder / crystals)",
   "  T+ 0:15",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 2:30",
   "9 mg",
   "insufflated",
   "MDPV",
   "(powder / crystals)",
   "  T+ 4:30",
   "1500 mg",
   "oral",
   "Acetaminophen",
   "(pill / tablet)",
   "  T+ 4:30",
   "75 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)",
   "  T+ 4:30",
   "15 mg",
   "oral",
   "Pharms - Mirtazapine",
   "(pill / tablet)",
   "  T+ 4:30",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 4:30",
   "1 ",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 12:00",
   "10 mg",
   "insufflated",
   "MDPV",
   "(powder / crystals)",
   "  T+ 16:00",
   "10 mg",
   "insufflated",
   "MDPV",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 82100",
   "Gender: Female",
   " ",
   "Age at time of experience: 23",
   "Added: Oct 7, 2010",
   "Views: 21781",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is a report of my first experience with this chemical, and am writing this report 3 days later.\r\nMy boyfriend had ordered 500mg of MDVP back in Julyhe had accepted that hed been mega-scammed some weeks ago. Yesterday (11/3), to our humbling delight, we found that it had finally arrived! The packaging of the order was peculiar, and I feel that a detailed description is warranted; it was neatly enclosed in a plastic baggy, inside a slightly larger plastic baggy, which was wrapped in toilet paper, then wrapped into like 4 sheets of paper. It had then been stuffed in an envelope, and THAT envelope was ALSO wrapped in toilet paper and what is assumed to be double sided tape, another several folded piece of paper, securing the contents of the item, and finally, the item subject of this report was too diligently situated into a too legit USPS priority envelope.  We finally got to the core of that mass of tape and paper, and lo and behold, the 500mg order was actually 2,000mg. Worth the wait? Dare I say nay? \r\nAt around 6:30 pm we had a buffet dinner, so be mindful that all the effects Im going to begin reporting are on a full stomach. At approximately 7:30pm, we weighed out a couple of 10mg bumps for snorting purposes, and it hit me instantly, sort of reminiscent to how you feel when youre just starting to feel the effects of a GOOD, not generic, 30mg instant release Adderall. My boyfriend said he felt about the same way. He said he was feeling pretty euphoric, but he lumps pretty much all sensations into euphoria. The taste/drip was not too bad, but had a very prominent chemical taste.  \r\nI felt very stimulated probably 5-7 minutes after insufflating that first dose. At approximately 7:45pm, I joined my neighbors outside for a smoke, and found myself to be extremely chatty, and cigarettes to be extremely delicious. I was feeling really energetic, but I didnt really want to go anywhere. All I felt like doing was chatting. My neighbors were doing opiates and drinking beer, so we had a bit of a different dynamic, but it worked. We smoked about 3 bowls of chronic between 4 people. \r\nThe effect of the chronic was about what I had expected, similar to a weed/coke mix. We sat around for a while chatting and watching a variety of videos online. At about 10:00, my boyfriend and I came home. I decided that I wanted to redose, my boyfriend tried to convince me to not, but he failed, and i did a little less than the first 10mg dose, by insufflation again. All I wanted to do was watch videos and read about anything and everything on Wikipedia, searched places on the map in different countries that had street view. \r\nLike with any stimulant, the desire to redose was strong, but I had to work at 8:00 that morning.  At about midnight, I took 3 tylenol pm, one 15mg mirtazapine, smoked much more weed, and had a beer. At about 4:00am, 6 hours after the second dose, and four hours after that midnight cocktail that I had relied on to put me to sleep, I resolved to staying up until work. I had lost all feelings of stimulation, and just felt a general high feeling. I sniffed another small amount before work, didnt even bother to weigh it out.  \r\nIt got me going pretty well, and definitely got me through the morning okay. I left for work, a law office as it turns out, and fortunately I didnt have much to do, because at that time I was getting a little delirious. It took me so long to finish a task because I would forget what I was doing so quickly. When I went home for lunch, I took a little more, for good measure. I felt good for a couple hours after that, but it didnt last me through the rest of the work day. \r\nMy phone/communication skills were nonexistent, I had a twitch in my face, and it was obvious that I was having trouble comprehending things. I got home and was experiencing one of the strangest crashes ever.  The sleep deprivation was unreal. I started having auditory and visual hallucinations at around 6:30pm, 23 hours after we first dosed. I didnt sleep well that night, despite how terribly weary I was mentally and physically.\r\nDespite the horrible run-in with insomnia, the terrors of sleep deprivation, and the uncontrollable twitching, the overall expectations that I had for the drug were well met. I would definitely suggest against taking this in the evening if you have obligations the next day that require a certain level of professionalism and clarity. Nonetheless, I would say its almost as enjoyable as meth or coke, minus the tedious drug dealing process. Unlike coke and meth, I would suggest redosing no more than once every 3 hours. Its a pretty versatile chemical, especially if you have shit to do. Will definitely be keeping this drug around!\n\n\n"
}