{
 "title": "Catching Cosmik Debris",
 "author": "Spaceship",
 "citation": "   Spaceship. \"Catching Cosmik Debris: experience with MDMA & LSD (ID 82160)\". Erowid.org. Dec 19, 2012. erowid.org/exp/82160",
 "substance": "MDMA & LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(powder / crystals)",
   " ",
   "4 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2008",
   "82160",
   "Male",
   " ",
   "21",
   "Dec 19, 2012",
   "Views: 902",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The winds of time eddy in chance for those with their ears open. Friday evening they brought one to Laytonville, CA to celebrate peace and love with other satient individuals across the globule globe. My brother, bereft of financial aid, relied upon the quick wit of our friend, sporting a jauntily pieced bracelet entailed from the ends of other benefactors.</p><p>Gear hastily piled upon the stooping hill claimed by our own, our feet taking over and pulling us towards vibrative healing waves, eager to move in and out of sweeping arches of music. Sean and I, eager for incresed stimulus, began a search for the pure form of methylenedioxymethamphetamine. We stood as extensions of the Dome of Electronica, swooping our heads in unison in search for the right individual.</p><p>Our solar spectator introduced himself in subtle fashion and unvieled a tonic of most strong composition. 3 inches of crushed molly and apple kiwi juice lay between us. The elixir slowly mingled into our throats, a rich pungeant taste enveloping the mouth in a pleasurable grip. We floated back towards the main stage and our companions.</p><p>The supernova went off a half hour later. And continued upon every second for what seemed like a year. Every pore, every surface of my body inside and out began to orgasm. Wide eyed wonderment exchanged between the two of us, and reality oozed into pure pleasure. The overwhelming facilities of this experience saturated my brain and all processing I could handle. I remember running, pell mell drunk stumbling criss crossing fading with Sean. Primordial wonderment gains control and all thought of previous life is thrown on the backburner. I became concentrated energy, a lightning bolt conducting with everything around me.</p><p>I was now backseat to a spiritual experience gone sentient. It still thirsted. Separated from my last links to reality, those who had brought me here, I found another catalyst to my cacophonic existence. Figures materialized bearing Lysergic acid diethylamide, blotted upon simple paper. 4 appeared in my hand and were placed in my mouth with organic certainty.</p><p>The world, swirls, twirls, sifts, syphons, fractures, fragments, splinters, splices. I begin to channel something, chancing upon my friends again, and begin foaming at the mouth, a la Nietzsche, spouting philosophical, challenging the consciousness around me, searching for a mind as finely honed as my own.</p><p>Deep into the night, uncertainty comes for a visit. I begin to wonder where camp is, where my friends are. Suddenly the amourfous light enveloping the pines are invasive, unappealing. I begin to wander, eyes blinded by kaleidoscopic waves, sifting through the patterns for the path to sleep. For suddenly I am living in a dream, and reality is what I make of it.</p><p>My feet bring me to a small temple, geometric canopy shrouding idols of prayer. I approach a small table, overhung with a white canvas. A lady full of happiness and beauty views my questioning eyes and offers hot tea. I take it and feel confused when she asks for money, and blindly appease her materialistic desire. She guides me to small pavilion, rectangular and exuding love. I shed my shoes and meditate amongst my fellow travelers. An urge to move flows through my body.</p><p>I stream my hands over my face, through my hair, relishing each tingle. Shoes unneeded, I plunge headstrong into the night.</p><p>Thus begins a roundabout paranoia. Weed in tow I move amongst the stages, tents of various shapes. The clash of such different drugs, affecting different levels of chemical balance, began to distort my judgement. I began to envision falsehood all around me. Weed became crack. I began sniffing, and individuals who I now know to have been full of concern, were doubted and mistrusted. Back to the sniffing, at this point i realized i had plunged very deep into the rabbit hole, for i had holes in my memory from the inception of my journey. i believed people were dosing me with crack. i also believed these same individuals were some type of secret society of high thinkers, testing me and my thought, if i were eligible and enlightened enough to share in their metaphysical wanderings.</p><p>I was now the tiger i was born under; wild, unpredictable, snarling i had two flimsly goals: smoke green with people and find my tent. People would offer me bowls and half smoked cigarettes. So sensitive to the smoke, my senses heightened, the trails of burning matter would infuriate my nose i would believe someone had snuck me cocaine. Bless the souls of all those i encountered and their patience and fortitude with my insatiable self. any other environment i would have been shunned, beaten even. but with love in their hearts they kept watch over me, as i condemned them as one thing or another, puppet masters and manipulators.</p><p>I truly believed i had been taken from earthdance. i believed i was in a crack camp. i headed for the country, cutting my self on fences and the underbrush. i came back in and one of the elders found me. by now i had accepted much and was less in denial. one of them sat me down in a hammock with a flagon of water and a wool blanket. we spoke of life, the universe, and my test for what seemed like hours. his spirit was strong, he gave off the impression of an old native american shaman, i guided my cometing thoughts into a cohesive structure. after they fell asleep in their old vangon, i continued in search of my tent. twilight lit up the sky, a orchestral spread of blues and purples, resonating with my every step.</p><p>I chanced upon two more night owls, who tolerated the last dredges of my alternate reality. i pulled myself into camp, strangely now knowing exactly where i had to go. anchored in i began the long process of grokking-drinking deeply of, understanding- the events that had transpired.</p><p>I know that i went well beyond my limit, deeper into the rabbit hole than i would have ever though possible. After i took the molly, the pure mdma, my mind decided to test itself. i projected this onto the individuals i met in my journey. what i saw, what i heard was accentuated, altered by what was altering me. I am still not sure of the fullest extent of this, but i believe i was creating individuals i was having conversations with.</p><p>The next day, i was walking to the car with my brother. i estimate i made a strong mental connection with at least 40 individuals, yet i strongly remember maybe 10. A man walks up to me with wonder on his face.</p><p>the man: 'Brother, i am glad to see you alive today. You changed my life last night with what you said. You opened my eyes.'</p><p>myself: 'Thank you friend, i dont know what to say.'</p><p>he asks me what i took last night. i tell him.</p><p>'You are a warrior brother! Your words have completely changed my view on life. Thank you.'</p><p>'You are welcome. Many thanks brother.'</p><p>Everything is so clear now. Through darkness we see light.</p>"
}
