{
 "title": "Balanced Alone, Mixes Badly",
 "author": "Barafundle",
 "citation": "   Barafundle. \"Balanced Alone, Mixes Badly: experience with 4-Methylmethcathinone (Mephedrone), Cocaine & Cannabis (ID 82187)\". Erowid.org. Dec 28, 2009. erowid.org/exp/82187",
 "substance": "4-Methylmethcathinone (Mephedrone), Cocaine & Cannabis",
 "bodyweight": "64 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "250 mg",
   "oral",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 3:00",
   "250 mg",
   "oral",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 0:00",
   "250 mg",
   "oral",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:00",
   "  repeated",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 82187",
   "Gender: Male",
   " ",
   "Age at time of experience: 26",
   "Added: Dec 28, 2009",
   "Views: 8753",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently I had been reading a lot about the various RCs around and as Ive always been curious about drugs. I started smoking pot at 12 then went through amphetamine, Ecstacy, benzodiazapines, crack cocaine, cocaine, methadone, LSD, mushrooms and ended up taking heroin and getting hooked for some years, so Ive had experience with both uppers and downers. But as Id kicked the heroin habit I decided to try these Rcs.</p><p>Firstly I tried Mephedrone, swallowing 250mg in a 'bomb' before going to a house party. After 15min I could feel a slight restlessness which got stronger as time went on. By the 1hr mark I was defiantly feeling something. The closest I could compare it to was amphetamines but it wasnt anywhere near as aggressive. On speed I just HAD to move, even if sitting I had to jiggle my leg but with mephedrone it didnt seem to be like that at all although I was still strongly stimulated. I could sit and be still, no compulsion to move myself if I didnt want to, where on speed I felt I had to. I also had an overwhelming need to talk and be frank with people.</p><p>The other thing I noticed, I had a great empathy with people, not as strong as with MDMA, but personally I felt MDMA to be too overwhelming in its empathy giving qualitys. With mephedrone it seemed I had the right balance for me. After 3hrs I decided to top up as I seemed to have crashed all of a sudden with no warning, which was a shock as with other things used its always tapered off, so I swallowed another 250mg and this took me back to where I was before. As the night went on I found it very easy to talk to people I knew and didnt know at the party which is normally hard for me and as night turned to day (I swallowed my first bomb at 6pm, my second at 9pm) I decided to leave for home, which was around 5.30am. I felt sleep was impossible for me so I stayed awake, not feeling any come down but just generally drained, due to no sleep. Then next night I slept fine and wanted to repeat this experience. </p><p>My next experience with mephedrone was drastically different and is maybe a cautionary tale about mixing drugs, at least mephedrone and cocaine. The amount was the same, 250mg swallowed around 6pm then out to friends house for a party. I smoked some pot and talked away feeling the same empathy and stimulation. This time though a friend brought out some grams of cocaine which some of us proceeded to take. Alltogether, over the night (from 7pm to 5am) I had gone through 2 grams myself pretty much, but the 2 drugs didnt mix well at all.</p><p>Where the last time I was clearheaded and knew what I wanted to say, this time I kept forgetting what I wanted to say, I was jabbering a lot and falling drastically behind in conversation. An example of this is how a friend and I were trying to remember the word penicillin as we were talking about allergies, but we couldnt think of the word. Some hrs later it popped into my head and I shouted penicillin!! even though the friend I was talking to about this earlier was long gone. Evidently the mix of both drugs had impaired my mind greatly so I dont think Ill do this again, as although it did feel good at the time, looking back though it was too much on my brain.</p><p>So in conclusion I think Mephedrone is a very good stimulant, it has all the good qualities of amphetamine, like stimulation, increased awareness and confidence but with the added bonus of a feeling of empathy and euphoria, which speed doesnt have.</p>"
}
