{
 "title": "Comfortable & Enjoyable",
 "author": "Nachoman",
 "citation": "   Nachoman. \"Comfortable & Enjoyable: experience with Kava (ID 8221)\". Erowid.org. Aug 5, 2004. erowid.org/exp/8221",
 "substance": "Kava",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1540 mg",
   "oral",
   "Kava",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8221",
   "Male",
   " ",
   "Not Given",
   "Aug 5, 2004",
   "Views: 17450",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was reading up in this website looking to buy some salvia. Somehow, and I'm not too sure how yet, five minutes later i found myself calling GNC and asking if they carried any Kava Kava Products. Anyway I ran down to the local GNC and picked up two bottles of Kava Kava pills because I heard the tea tastes TERRIBLE (never tried it though)! The kind i got had 110mg Root and at least 60mg Kavalactones per pill.</p><p>First Kava Experience</p><p>4:00 PM - Ingested 8 pills with some water. (880mg root, at least 480mg Kava)</p><p>4:15 PM - Mild buzz. Could be placebo effect.</p><p>4:35 PM - Mild but definite positive mood swing. I felt slightly dizzy.</p><p>5:00 PM - I felt like smiling or laughing for some reason (hmmm...)although it seemed to come out of nowhere and faded quickly.</p><p>5:20 PM - Most effects have worn off, took 3 more pills. (330mg root, at least 180mg kava)</p><p>6:00 PM - Should have taken all 11 at once. Regardless, it was a slow and easy-going introduction to Kava Kava.</p><p>Next Day:</p><p>Ingested 14 pills (1540mg root, at least 840mg Kava. </p><p>35 minutes later I was buzzing heavily mild. I was very relaxed and felt no pressures what so ever. I listened to a little music and it sounded better (or at least more interesting) than usual.</p><p>Walking was a bit awkward but no problem. I still wouldn't recommend driving even though you could pull it off with no problems. I felt a bit sick to my stomach but nothing too uncomfortable. I also felt a bit light-headed. Very comfortable and enjoyable. Worth doing again (but definitely not regularly).</p><p>That's pretty much it. No earthshaking euphoria or anything (probably in larger doses) but that's ok. For $11.00 for both bottles (30 pills in each) I would probably do it again although I would definitely smoke some bud with it. Altogether a comforting and mellow 'high' (it's not really a 'high' like pot high. It's kind of unique) I tried to concentrate on giving the dosage numbers instead of actually describing the experience. I did that so newcomers to Kava (myself included) will have a better idea of dosage.</p>"
}
