{
 "title": "Woke Up This Morning, Toked On Me Bifta",
 "author": "thelzdking",
 "citation": "Citation:   thelzdking. \"Woke Up This Morning, Toked On Me Bifta: experience with Cannabis & Alcohol (Vodka) (ID 8227)\". Erowid.org. Jul 28, 2004. erowid.org/exp/8227",
 "substance": "Cannabis & Alcohol (Vodka)",
 "bodyweight": "76 kg",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "3 oz",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8227",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 28, 2004",
   "Views: 5638",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was about a a week and a half ago when my friend, and fellow experienced smoker, invited me to his house for a BBQ. His parents had gone away on holiday for a couple of weeks so we decided to have a smoke. It was a Monday and I had band practice, so I arranged to go to his house after that. I arrived, and my friend and two other friends (all smokers) were there. He had some Bud, I had never had Bud before, but we had toyed with the idea of getting some for a while, he had a teenth which cost him £15. They had already had a toke or two, and we went to the shop for food and alcohol. We came back and had the BBQ, it was nice, but a bit burnt, but it was pretty good. It was now about 9:00 to 10:00pm.\r\nI hadn't smoked at all for around 2 or three months as a girl at school asked me to stop as she didn't like me doing it. I really liked (and still do) this girl, so I did. She didn't, however stop drinking a lot for me, or even stop treating me like shit so I thought 'Fuck it, I want some Bud.' I was an experienced smoker, but only with Hash before, so I really wanted to try Bud.\r\nWe loaded up the pipe at about 10:30pm and we toked away on the Bud. It went down so smoothly, not harsh like Hash does, it burnt pretty quickly. I had one big toke and a smaller one there after.\r\nI felt it hit me pretty quickly, I was buzzing, but soon became very lethargic. I didn't feel like I had the strength to move my arms or legs. I was buzzing, like I had pins and needles, all over, ut especially around my jaw, legs and arms. It was like I was falling, or half asleep. It was really strange. I realised I was REALLY stoned. I was scared I was going to freak out. The combination of strong Bud and not smoking for a while had got me really stoned. I hadn't been that stoned since my first time, where I had a Waterfall and was fucked up for days.\r\nThis time, however, I thought 'I'm going to enjoy this,' I got a glass of water from the kitchen, to wet my throat which was dry from a tiny toke on a joint my friends had rolled with the Bud. Getting the water was quite an experience, especially with an equally (if not more!) stoned friend on a slidy kitchen floor with socks on. Anyway, I drank the water and sat back down on the sofa with the TV on. My eyelids were buzzing, I closed my eyes and saw a vivid streak of electric blue. It was amazing, I had read about visuals on Bud, but it was really something, even if it only lasted a second. At this point communication with others was becoming easier after being difficult for what seemed like an eternity. I had spent what seemed like hours alone with my thoughts and distant voices, I even had shivers, which I hadn't had since toking on bottle pipes with my old smoking friend. It was intense, but the strangest was yet to come.\r\nWe were all giggly, especially after making up a song along the lines of: 'Woke up this morning, Toked on me Bifta.' My friends had rolled a joint of pure Bud which they had enjoyed while I was too stoned to do anything, and were rolling another. We were getting a bit hungry, so decided to get the buiscuits out and eat. We were eating, it was now around 12:30am, and I needed the toliet, I got up to go and switched the light on when I got there, streaks of Blue, Yellow Green and Red were dancing around the light, it was amazing again. I couldn't believe it, I was really mellowed out by now. My mind was so clear, but normal thought was impossible.\r\nAt about 2:00am we decided to put 'Pulp Fiction' on. Just as Uma Thurman snorts her line in the toliet and says 'Gawd damn' we lit the all Bud joint up, and smoked away, we got about halfway through and decided we had had enough. At about the point where she overdoses the other two friends there fell asleep. Me and the host decided to have some more of the joint. He was toking, and I went to the kitchen for a drink and then to the toliet. I came back and he was struggling to bring a mattress and duvet downstairs, I had some more joint and we watched some more of the film. About half an hour later we were lying on the mattress and we just started rolling about on the floor, laughing, making weird noises, pretending we were swimming, it was bizzare. It seemed perfectly right to do it. We woke the other people there up doing a full 'Fear and Loathing...' routine with me throwing things at him and him attacking me with a stick. It seemed like the right thing to do. It was clear in my mind it was normal. He was under the duvet pretending to be a fish (I think). It was so weird, It was like some kind of dream, we chilled out and went to sleep.\r\nThe next morning we all decided Bud was not like Hash. No headache that you usally get after a heavy session. And It was almost trippy in a way. We didn't feel stupid about rolling around on the floor either, it still seemed like the right thing to do at the time. I've been stoned before, but on Bud it was something else! Everyone must get some top quality Bud of Cannibis and get toking!\n\n\n"
}