{
 "title": "A Fascinating Insight, A Mind Reborn",
 "author": "p5ych0n4u7",
 "citation": "   p5ych0n4u7. \"A Fascinating Insight, A Mind Reborn: experience with Cacti (Peruvians) (ID 82272)\". Erowid.org. Nov 19, 2013. erowid.org/exp/82272",
 "substance": "Cacti (Peruvians)",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 g",
   "oral",
   "Cacti",
   "(dried)",
   "  T+ 5:15",
   "  ",
   "smoked",
   "Calea zacatechichi",
   " "
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 82272",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 19, 2013",
   "Views: 663",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The following is a record of my first experience with mescaline, specifically, from some Peruvian Torch cacti, 20g, which I ordered online. The times are of course approximate, and almost all of it was typed up as it happened. I was alone one night and had no plans that evening or the next day, I was in a fairly good mood and I had an open and relaxed mindset, so it seemed like the perfect opportunity.</p><p>8:40 pm: I try eating some of the raw pieces of the Peruvian Torch. It's probably the worst thing I've ever tried eating. I decide, though with hesitation, to make a brew instead.</p><p>9:00 pm: Started brewing the tea. Cut up the dried pieces then ground it as best I could into tiny chunks and dust with a mortar and pestle. Added to a mug then half-filled it with pure orange juice. Apparently the acid helps in extracting the mescaline, and perhaps more importantly, eases the gruesome flavour. Added the boiling water from the kettle and stirred.</p><p>9:15 pm: Been distracted by people and TV so only now am I trying the brew. It tastes horrific raw, though not as bad as the raw dried material, and not as bad as sinicuichi tea. The orange juice helps, making it palpable enough to swallow. This is going to take a while.</p><p>9:35 pm: Only just halfway through the brew. It's not too nauseating; I thank the orange juice. Been drinking a nice cold soft drink with it to ease it down, which helps in between the difficult gulps.</p><p>9:50 pm: I've had as much of the brew as I can handle. There's only about one big mouthful left, really. By now, I've gone a little light-headed, and my stomach, naturally, feels odd. As I type, my arms are going slightly numb.</p><p>10:40 pm: By now, I would've expected the full effects to hit. I've had no intense waves of thought, closed-eye visuals or open-eye hallucinations of any kind. Textures seem normal as well. Slightly disappointed, but understandably as I didn't completely grind the cacti and boil it overnight or anything.</p><p>11:50 pm: I've just realised I'm feeling slightly detached from reality. Quite pleasant, actually. And not too dreamlike. There's time dilation, too - it feels like it was ages since I had the brew.</p><p>12:30 pm: I've been watching a surreal film and I'm enjoying it, perhaps more than usual. The time dilation has become more pronounced - but now, I'm not sure if things feel slower or faster; it's a really typical time dilation sensation, a bit like a good dose of MDMA. A friend started texting me, so I've been chatting with her about problems she's been having. Now I also realise I feel more attached to people; things seem more intimate. Also, and again as with MDMA, thoughts, ideas and emotions run more freely. I can understand concepts about existence more clearly. Slight pupil dilation noticed as well.</p><p>1:00 am: Time still seems slow, but pleasantly so. The film ended, but since I'm alone, I feel the need to have some 'company' so I leave the TV on. This is strange! I never do that. I find a live music show. The woman singing seems beautiful. Not even in a strong sexual way, just purely beautiful. I realise that once again as with MDMA, I see beauty in its purest form. A man comes on; I feel a strange, almost spiritual bond with him. Another beautiful woman. It almost feels like I'm there, like an audience.</p><p>1:25 am: I was content grinding up some chacruna; before the pleasant spiritual feelings kicked in, I was planning on smoking some. But it doesn't look like I'll need to; I could happily fall asleep with this feeling. Feeling slightly cold, but the window's closed. Very slight visual distortions, like ripples in the darkness. Faint vibrating light at the edges of the screen of the computer, but not the usual glow it gives off. A light switch looks more pronounced. I feel the need to be with people; I want to be with friends, talking, anything. A song I remember from when I was younger comes on, making me feel even more peaceful. I consider turning on the radio, just for some background music, but seeing the people on the TV seems oddly pleasant, so I guess I'll leave it on until I go to bed.</p><p>2:32 am: Where did all that time go? I still feel very at peace. Even being alone doesn't feel so bad now. I know I'll be going to bed soon; it feels like the end of a journey, like I get at the end of a night on MDMA. I'm having a little smoke of Calea zacatechichi in a hope I'll have another vivid dream tonight. I find it hard to focus and type this. But it feels like part of me has been reborn. It's been a quintessential shamanic experience. I'm not really sure how to describe it, so I won't try. I expect I'll feel quite refreshed tomorrow.</p><p>It was about 4:30 am before I was tired enough to go to bed, and at least 5:30 before I fell asleep, so it certainly kept me awake far longer than normal. I'd say the whole experience lasted 7-8 hours, though perhaps would've been more were I to keep myself awake. I experienced no hangover or next-day symptoms and I slept for around 7 hours. My pupils were their normal size by the morning; no nausea or vomiting; no unpleasant feelings. While downing the brew may be hard work, the whole experience was very clean (in more ways than one), save for some gas.</p><p>Last night/early this morning, as clichéd as it might sound, was an experience I don't think I'll forget. I wondered how a psychoactive could be called 'healing'; I've always seen them as insightful and fascinating instead. The shaman inside me feels invigorated and fulfilled. I feel more reason to continue living, like mescaline revealed a new dimension to my existence. I don't feel these words do the substance justice, though. Now I fully understand why it is so important to the Native American Church and the shamans. As with some other 'powerful' psychoactives, I think only the experience in itself can truly reveal to the user what it means. Of course, it goes without saying that mescaline is not simply a party drug or a 'get high' thing; it's a truly spiritual substance like Salvia divinorum that (in my opinion) should not be abused.</p><p>In short, I think anyone with an open mind and a determination to better understand existence should try this interesting substance. I hope that if you try it, you will appreciate its properties as much as I have.</p>"
}
