{
 "title": "Beauty's Rebirth",
 "author": "Bun",
 "citation": " Bun. \"Beauty's Rebirth: experience with MDA? (sold as MDMA) (ID 82417)\". Erowid.org. Dec 15, 2009. erowid.org/exp/82417",
 "substance": "MDA? (sold as MDMA)",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "MDA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "82417",
   "Male",
   "",
   "22",
   "Dec 15, 2009",
   "15043",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: The author of this report thought he was buying MDMA and speculates that it is actually MDA.]  </p><p>While in the midst of an intense depressive cycle brought on by 6 months of inordinate excess involving a seven-day-a-week lifestyle of alcohol, marijuana, cocaine, heroin, and xanax, I came across some MDA from a neighbor.</p><p>At the time, I had been 'clean' from coke and dope about a week and half  the longest I had gone in six months , but I was inconsolably depressed and barely felt the point of life.  One day, for example, I arrived 5 hours late to work:  I didnt see the point of getting out of bed, so I just stayed under my blanket looking around my room with sad eyes doubting my own existence.  I wasnt eating but a handful of food a day; every hour seemed a chore; and I found myself completely bereft of any initiative or enthusiasm whatsoever for anything.  Life merely channeled pain.</p><p>Convinced I had completely destroyed my life (over the past two months especially), I dwelt only on my own sufferings  all of which I had brought on with my own actions.  To a certain extent, I was correct.  The following are a few reasons why:</p><p> Any other employer would have fired me months before for my pathetic performance at work.  I was chronically late; I was sleeping in my car for lunch every day; I was nodding off at work; I was having to take a ridiculous amount of sick days for heroin and cocaine withdrawals; and one day, I flaked out at work at 11:30 in the morning and never came back for the rest of the day; &c.</p><p> Due to a raise and a bonus 6 weeks previous, I received $1800 over the course of 14 days, $800 of which I received on the second of the month at hand  and yet I couldnt pay rent for another three weeks.  I had become so destitute that I had to borrow $3 from my co-worker to do laundry one day, for I had no clean clothes and not even $1.50 for a single load.  And I was still three weeks late on my rent.</p><p> I weighed somewhere between 126 and 130 pounds at a time when I should have weighed between 150 and 160.</p><p> Due to my failure to maintain my vehicle, I woke up one morning to an inch and a half of standing water in the cabin of my car.  When I opened the door to go to work that day, water spilled out of the threshold onto my foot.  I had to pay $100 to get it cleaned.</p><p> I could go on, but you get the point.  I had totally fucked over my life.</p><p>So one day, thinking I was buying MDMA, I purchased half a gram of pure MDA powder for $70.  I veg-capped it myself at 100 milligrams apiece and proceeded to get two friends together so we could all roll together and go see some shows. However, we thought we were going to roll, and had no idea we had taken a strong hallucinogen.  Both of my friends flipped out (not in a bad way) early on in the night, and we ended up splitting up, lost and wandering around the city.  This was unfortunate, but I got to trip alone  something I had never done  all night in my apartment.</p><p>While I experienced nothing in comparison to my next trip two days later, I did come to a few realizations.</p><p>For several heart-wrenching  but somehow pleasant  hours, I saw my *self* in my *life* over the past 6 months as a *character* in a *narrative*  an author-written character in a printed narrative, where my person was defined by a finite set of particular words definitively printed and permanently bound into a book.  I saw myself not as a person living a life, but merely as a fictitious character  a pathetic drug addict  amid a sea on intertexuality, and released into the world by an unknown author:  A prodigal son manacled to a fixed language definition of his person.</p><p>That night, I wrote down the following sentence:</p><p>'Take your life, place yourself in a narrative, and interpret your own character. Distill your souls agency out of the pap, and ask yourself if youve ever really seen your own face. Only narrative can show you what life has been hiding from you.'</p><p>When my life  my narrative-immured character, that is  appeared before my eyes, I felt somehow liberated, but other than that, I simply felt mesmerized by my open-eye visuals and positive sense of well-being occasionally tinctured by a calm icy-hot, snake-like sensation of paranoia about my drug addict character in this bizarre objective narrative.</p><p>Two days later</p><p>3:30 p.m.:  I knew the whole time we would have to try it again, for now we knew what we were dealing with, and moreover, I still had two 100-milligram pills left.  So two days later, I planned a trip with one of those same two friends ('D' for short).  Now that we knew we would trip (and not roll), we planned out the day a lot better.  However, I dosed my 100-milligram pill by myself at before heading five blocks down to Ds place so he could drop  but he wasnt answering the door, and I couldnt get a hold of him.  Given my experience two days before, I knew I had a full two hours before the Sassy (a moniker for MDA) would fully kick in  before I would be tripping hard  so I thought fast.  I immediately thought of another friend ('C') who worked 4 blocks away at a restaurant.  Hoping he would be off soon, I ran over to the caf to find him.</p><p>4:15 p.m.:  Sure enough, C was planning on leaving the restaurant in forty-five minutes.  He gladly accepted the Sassy and dropped at 4:15, putting him 45 minutes behind me.  I was on the threshold of starting my way up, but it would be another 75 minutes before the real action started.</p><p>At that point, D called to tell me he was very hungover from the previous night, and that he couldnt trip that day.  After I explained that I had already resolved the situation with my other friend C who would be off in half an hour, he invited me over to chill.</p><p>5:00 pm:  D and I talked, listened to some great music (Beachhouse, Midlake, and Wilco), and smoked some fine herb together for about an hour before my trip pal called to tell me that he unfortunately had to stay another two hours at the caf.  Cruel fate!  We both panicked a little bit when we first found out he would have to stay till 7 p.m., but he worked at such a ghetto establishment that it didnt matter to his coworkers or manager that he was tripping at work.  We hooked up as soon as we could.</p><p>7:10 p.m.:  And then . . . zang!</p><p>Im not exactly sure where to start with this story.</p><p>Equipped with a great soundtrack and blessed with some amazing overcast fall weather  all in the middle of a city recently decked out with bright holiday street decorations  C and I were set for the best trip of our lives.</p><p>We got into all the usual trip adventures and met our share of crazy characters while on our wild missions.  Ill refrain from devoting too much time to these random, serendipitous, and occasionally hysterical trip episodes.</p><p>9:00 p.m.:  While walking and driving around and hanging out in my apartment listening to music, we found that two hits of herb every 90 minutes or so sustained a harder trip without making us the least bit stoned.  The weed accentuated our visuals without affecting our motor or cognitive functions.  It was wonderful.</p><p>11:30 p.m.:  At one point, we drove a few miles away to a place where we could watch the river in the woods.  When we arrived, we stepped into a pitch-black forest which occluded sight of all objects.  We somehow made our way down the hill to the water, finding a perfectly placed log over some eroded earth where we could comfortably sit and watch the water and sky.</p><p>After smoking a bowl, we were enjoying the scenery when we both realized we could hear girls talking from all the way across the river  in the middle of the night and in the middle of nowhere.  I took the position that the voices  which were of adolescent girls exchanging indistinct persiflage in a mall-like environment (given the acoustics)  were in our head, but C was adamant that the girls were really there, and that it was even possible the girls were talking underwater.</p><p>A few minutes later, C told me he saw huge billows of sea fog rolling down the river.  Right as my brain processed his words, I too saw the fog  saw it on a backdrop of a midnight horizon increasingly suffused with light from within.  I saw light of every color radiating from over that imaginary line so far away, bounded across its entire base by the black-silhouetted cap of the forest's canopy.</p><p>As we watched in awe, the overcast sky at once became peppered with hundreds of moving streaks of light in four cycling colors.  The streaks swirled and flew and circled around and across the sky before all gathering in one spot right in the middle of my field of view.  That one spot then morphed into an enlarging spherical galaxy composed of seemingly millions of stars revolving around a focal point, all the while maintaining its perfect spherical shape.  The stars were coming right at me.</p><p>I remember at one point seeing all these stars circle and spiral around right at me, mostly coming at me from the 10 and 2 positions on a clock, when my whole field of vision  peripheral and all  started lighting up significantly, akin to the effect of turning up the brightness while editing a picture in Apple iPhoto.  I believed my head to be lifting itself off my shoulders as the revolving spherical galaxy seemed to be pulling me right into and beyond the sky.</p><p>It was a bit too much, and I told C we had better go back to the car before I passed out.  As we got up off the log and turned around, we saw the formerly pitch-black forest suffused with blue electricity.  Every leaf glowed and pulsated with this blue electric power (especially the outlines of the leaves), and the whole forest seemed to breathe the stuff.</p><p>Im not sure how we made it up the hill, but we did.  Once inside my car, the dome light restored us to sanity.</p><p>12:45 a.m.:  We drove back to town to spend an hour or so at a candle-lit and black-lighted bar where a mutual female friend of ours worked  a very good decision.  We got to listen to some trippy mid-80s Sonic Youth and drink beer that made us think we were imbibing pure liquid flowers.</p><p>We then retreated back to my place to listen to more fantastic tunes (including the Department of Eagles first record The Cold Nose) while watching the light and shadows on my walls, or watching the city out from my third-floor deck as we tore through our communal pack of Winston Reds.</p><p>3:00 a.m.:  After a few more walks, we decided to go to Cs place to see if anyone was up.  We hooked up with his roommate and decided to go to Waffle House, where I ate the tastiest waffle I had ever eaten in my life  even though I grew up with WaHo, and WaHo are not the best.  Everything tasted so perfect that night.  All foods constituted pure ambrosia.</p><p>The Waffle House was packed with trippy people doing trippy things when we got there, but after 20 minutes or so, it got awfully quiet, and my trip-pal and I started to get the fear.  Cs roommate had already offered to get my meal in return for the pack of smokes I bought for him on the way there, so I was free to go.  I got up abruptly and left.</p><p>As soon as I got outside, all the sparkly specks in the asphalt started to come at me in waves of light, and the whole parking lot became suffused with electrical wires of many different colors.  Every time I set my foot down, I sent a pulse of electricity through the wires, and the shock went straight to my car sitting all the way across the lot.  Once again, my head started ringing and I passed out as soon as I got inside my car.  Im not sure how long I was out, but it was probably only a minute before C started banging on the window asking to be let it.  Once again, I was restored to sanity by the dome light.  Thank you, dome light!</p><p>3:30 a.m.:  We're back parked on my street after dropping off C's roommate at his house 10 blocks away.  About ten seconds after I kill the engine, an ambulance screams by us and parks a half-block down on the right of this one-way street.  We sat in the car listening to some early Flaming Lips records and smoking cigarettes for the next hour.  The ambulance completely tripped us out.  At one point, all the lights on the back of it started spiraling around in a rapid circle before spinning off the truck with individual lights flying right at me:  The spiral came off the back, but another spiral rotated with it at the same time with each leaping light replacing itself right as it spun off past me.</p><p>We then both realized we could in no way see an ambulance anymore.  We saw a variety of other vehicles  two kinds of school buses and a Dead-Head-like party bus among them  each at its own different angle:  Every vehicle we saw was canted differently, and they were all askew  in all three dimensions  to some degree.</p><p>The night went on for several more hours.  I'll stop with the stories to conclude and make some applications.</p><p>We tripped at least 13.5 hours.  I say 'at least' because we both fell asleep while we were still tripping.  Ive heard from others that this is more common than the oft-suggested '8-hour' duration.</p><p>The next morning, I woke up alone glowing on my couch looking out my window.  I saw a perfectly blue sky split by a distending cloud of an aircraft's jet steam.</p><p>For the first time in probably three months, I saw something I thought was beautiful.  I recognized beauty again.</p><p>My life immediately turned around.  That day, I began one of the best weeks of my life.  I got a whole weeks worth of work done in 2 days at the office; I wrote 3 letters to three different friends; wrote 7 postcards to others; and cleaned up my nuclear waste facility of an apartment, turning it into a clean and pleasing place to live in once again.</p><p>More than all this, however, I completely and utterly lost any desire whatsoever to ever roll up another dollar bill or fill up another syringe for the rest of my life.   Life was so beautiful again, and I saw only grunge and hurt in those drugs.</p><p>That week, I restored my relationships with several individuals very important to me.  My drug addiction had alienated many friends, and much of town was worried about me.  (I lived in the middle of the closely packed, 25,000-person city:  Everyone knew me, and it was no secret I had a serious problem.)</p><p>I had already made the decision to move out of town at this point, so I had to say my goodbyes to all my friends  and I did; and everyone noticed a huge difference in me.  It was difficult for me to convince a few of my friends that I was not then on blow due to my enthusiasm and positive attitude about everything.</p><p>I said many goodbyes; I spent some of the most solid hours of my life hanging out with my good friends for the last few times; and I got my life completely back on line.  I saw beauty in everything, felt like God had given me my soul back, and no longer perceived myself as an animal.  I was Gods covenant child again, and I was ready to resume my existence as his blood-bought bond servant.</p><p>MDA changed my life.  There is no way around that statement.  Im somewhat loathe, somewhat reticent, to ascribe such power to a chemical, for I am not a mystic and have always found such Leary- or Huxley-like rhetoric to be dangerous.  Up to this point, I tripped for fun  and for fun only.  I only had two acid trips under my belt at the time, and neither affected my perception of reality, level of consciousness, or spiritual state.</p><p>This trip, however, was miles away from those previous.  My friends all saw it, my boss saw it, my roommate saw it; and my life flowered again like it used to  but this time more beautiful than ever before.</p><p>I'm now a week and a half displaced from this trip, and everything I experienced still lingers with me.  I'm still clean of coke and junk, and I don't see that ever changing again for the rest of my life.</p><p>Thank you, Sassy  and thank God for this bizarre chemical that taps into deeper levels of ones mind to show one beauty, love, and value; and to restore ones faith in life again.</p>"
}
