{
 "title": "Initial try: Pleasant, mild visuals,  audio",
 "author": "Penn Umbra",
 "citation": "   Penn Umbra. \"Initial try: Pleasant, mild visuals,  audio: experience with Salvia divinorum (ID 8241)\". Erowid.org. Jun 3, 2004. erowid.org/exp/8241",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Salvia divinorum",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Salvia divinorum",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8241",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 3, 2004",
   "Views: 5798",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI take some prescription meds regularly--most importantly, an SSRI antidepressant with a short 'half-life' and carbamazepine (not for seizure disorder, but for paresthesia)--so I avoided these and any OTC meds for at least 12 hours. <br>I'm not greatly experienced with street drugs--one strong and rather bad MJ experience many years ago, several nice MDMA trips about 12 years back, and a couple negative experiences each with DXM and nutmeg. So I was initially a little uneasy about the experience ahead, but I dealt with that.  One of the DXM experiences was really awful (mentally), yet I found some confidence from having gone through that. I also asked God for protection, insight, and (if what I was about to do was wrong in some way) forgiveness and gentle correction.<br>This got me to feeling pretty relaxed. It was late night, and I was alone in a comfortable room of a quiet, sleeping house. I turned the lights down very low and put on some nice Baroque string music--soft and slow, and sat down on a couch so I could stretch out if I wanted. After a few minutes of this I was totally at rest mentally and physically, and without anxiety.<br>I wanted to be very conservative with dosage the first time. Here's how I handled it: <br>1) Mixed 1.5 droppers tincture with 1 dropper water, held 1/2 of that mixture under tongue for five minutes, while focusing on the music with my eyes closed. Then swallowed and waited 5 minutes.<br>2) I wasn't sure anything was really happening yet beyond curiosity-induced false effects--I felt my heartbeat a little strongly. So I put the remaining mixture (1/2 dropper) under the tongue and proceeded to wait another 5. I was barely into this period when I began to think the music sounded subtly different--more textured and slightly slower. That effect built by steps while I held the dose in my mouth. At the end of 5 minutes I swallowed.<br>3) I began another 5 minute wait, uncertain what I would do at the end of it if nothing more were to happen. That proved a moot question.  Within another two minutes something more was definitely happening.<br>The music had taken on a slowly resonant liquidity. I seemed to perceive each note until the very last vibration, and the notes seemed much prolonged though not slower (that sounds contradictory). Imagine a silent round room with a tranquil pool of water, and a vaulted or domed ceiling above.  A drop of moisture falls from the ceiling and strikes the pool. The soft 'plop' of its splash resonates smoothly around and around, from ceiling to pool surface and back, fading slowly away.  Now, compare that to a single plain drip striking a hard floor. The former is how the music sounded now, and the latter is how it sounded normally. That's just about the closest I can get to a metaphor for the way the music was transformed. It was beautiful. Also, the string vibrato seemed to have an almost 3D texture.<br>Closely tied to the music, there gradually became apparent some lovely and at first very subtle visuals. Try to visualize (if you're mathematically inclined, and if this makes any sense) an acoustic waveform that's mapped somehow onto a closely spaced set of wiggling 2-dimensional (X and Y) curves that are placed 'side by side' along the Z axis. As time passes, new notes are struck, and old tones fade, the curves oscillate rapidly and pulsate in colors. The colors are smooth and continuously graded along each curve. Dim reddish hues and slower oscillations seem to go with lower pitches; the higher pitches have brigher oranges, blues, yellows, and (especially) greens with more rapid oscillations. It's a fascinating display.<br>The visuals vanish when I open my eyes, but the audio effects are only weakened a little. After a few moments I stop the music. Looking around the nearly dark room, everything seems more richly colored and sharply defined than it has any right to be. One cutout picture looks almost three dimensional. The decorations in the room, especially the old dolls and stuffed animals, sit and wait with a quiet air of expectancy, their gentle attention seemingly focused on me. A low, soft whooshing sound starts. With an amused note, I imagine it as the sound of some large but childlike and friendly monster breathing outside the house. (This is consciously imagined, mind you, but seems quite plausible). Gradually, as it slowly grows, I realize it is the sound of a jet passing far overhead. Then it langorously fades away. <br>Some of the experiences are definitely out of order here, but it's only because I didn't bother to keep any notes. About halfway through what turned out to be this roughly 20 minute period, I had gotten up and put the remaining .5 dropper of tincture under my tongue, undiluted.<br>I listen to the quietness for a few minutes, shutting my eyes again. The musical waveforms are gone. Instead I see random pinwheelings of soft yet more vivid, almost cartoonish pure colors--red, white, yellow, green, blue. This starts to fade as I lose interest.<br>After swallowing the last bit that was still in my mouth, I get up and go into the other room. I turn on the clock's 'Big Ben' chimes, which almost immediately sound. They are, normally, pure physical (that is, not electronic) chime tones. Now, they have the resonant liquid quality tried to describe earlier. I am able to hear the last tone of the three-quarters-hour continue for what seems to be more than a minute, right down to a last delicate oscillation. My first S. divinorum experience was just about over, and had lasted about 35 minutes, though they seemed to pass at a placid, relaxed, and yet minutely scrutinizable pace.<br>I go get into bed beside my sleeping wife. Though everything seems normal again it is some while before I fall asleep. Yet I rest comfortably and quietly until I do. Through the remainder of the night I have unusually vivid and realistic (but not lucid) dreams. In the morning I awake after my few hours of sleep, feeling well rested.<br>To sum up:<br>There seems to be even more peace than I had imagined in the ordinary world around me, at least in my quiet nighttime house. The expectant tranquillity in the objects around me, if seeming to be focused toward me, was only so because I was the one observing it.<br>Though the world is more than full enough of strife and sorrow, yet there are places of quiet, sublime harmony hiding in places that should be obvious to us but somehow aren't.<br>Next time:<br>I will stay off the meds for perhaps 24 hours and try a somewhat larger and/or undiluted dose. I know I can be more sure of my ground, starting out. I'll try a small variety of music--but nothing raucous.\n\n\n"
}
