{
 "title": "Finding the G-Spot",
 "author": "Seven Up",
 "citation": "   Seven Up. \"Finding the G-Spot: experience with GHB  (ID 82484)\". Erowid.org. Jan 13, 2011. erowid.org/exp/82484",
 "substance": "GHB ",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 82484",
   "Male",
   " ",
   "Age at time of experience: 34",
   "Jan 13, 2011",
   "Views: 9903",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I never tried GHB until recently when i was given the opportunity to. Below is my escalating trials with this peculiar molecule. Venturing in a completely unknown territoty, i decided to start low and work up until finding my G spot (despite my being a male ;). </p><p>First time - 175mg : drank the stuff dissolved in a cola drink on a full stomach. Effects did not materialize before 1h15 : definite although subtle mood lift and an increased desire to smile. This was no placebo. After 10 min of this non stop smiling, my cheeks felt tired as if i had been smiling for hours. Felt cheerful and playful. I did this in the evening. Mood elevation, decreased muscle tone and a sort of voluptuous laziness as well as a positive emotional balance persisted for the next 4 days. The fifth day after the experience i felt that the positive influence of G has disappeared.</p><p>Second Time (10 days later) - 350 mg. This time the stuff wasn't further dissolved in a drink as last time. I simply measured 2ml of the solution i had concocted and swallowed it on its own as i wanted to experience GHB's own taste : salty indeed but also sort of soapish. That time too was on a full stomach. Took it at 8:30 pm. Went to sleep at 4:00 am. Unlike last time however, the effects were not as pronounced. I did get the cheek tiredness and the subtle shift of emotions towards the positive. It is only the next day that i felt energized and increasingly social, light spirited and kind of restless really the entire day and evening. I think the full stomach tends to act like a time release mechanism. Can't comment more as i got sick (flu) on the third day...</p><p>Third time (3 weeks later) - 710 mg from a different batch since i had left my previous batch on a shelf and some mold eventually grew in it. The new batch contained a bit of unreacted GBL (i could tell from the taste, not to mention the pH of 8...). Empty stomach, shot up to a peculiar state of joyful exhilaration after 20 minutes. I felt immensely joyful yet didn't feel the least intoxicated or drugged up. Was playing some videos online, I so enjoyed Duran duran's Girls On Films (uncensored version) that i kept replaying it on and on just for the sheer pleasure of dancing and grooving to it. This went on for a good 20 more minutes then the exhilaration subdued and i felt just good for some time and eventually fell asleep. Felt voluptuously lazy the next morning. The next days i wasn't feeling terribly moodlifted or anything although i noticed a marked level of aggressivity. This totally subdued the fourth day afterwards.</p><p>Fourth time (one week later) - 1000mg from the same GBL stained batch on a full stomach. The GBL after taste is simply gross ! Alert after 20min, i notice a vague heaviness in my head especially when it comes to accommodation, a feeling typical of a heavy forthcoming intoxication. I notice it's difficult to focus and write this text. Breathing heavier. I go on with my FreeBSD PF tuning. After 35 min it become difficult to keep attention together as it started to diverge. I get fed up with unix tinkering and decide to go for Apple driven entertainment. I had a fleeting drowsy euphoria, i can see why people compare it to alcohol. Listening to music and drifting langorously away... I realize the voluptuous character of music. The dreamy feeling totally subdued after 2h20 and I felt totally normal and possibly energized until i actually fell asleep. Quite energized next morning although i felt partially amnesic about the previous night. I'm starting to get a hint as to how GHB can be used for malevolent purposes. </p><p>Fifth time (1 day and a half later) - 500 mg still taken from the gross GBL stained batch. It provided me with a light mood lift, increased sense of humour and increased sociability. I took it on a sad grey rainy sunday and it somewhat kept me afloat from the grey bored sadness of this kind of day. Nothing eventful though after 5 hours going to bed is a temptation. I begin to understand how the GHB addiction begins. One really feels just good although in a non druggy way. Next day at work i felt just fine.</p><p>Sixth time (5 days later) - 1210 mg. First alert after ten minutes. drowsy feeling after 20min. Concentration was not an option after 30min. Curiously though i was not feeling much beside the drowsy feeling. No surge of euphoria or anything. Just a drowsy feeling, and the typical shutting down of negative emotions. But no euphoria, no genuine mood lift, no feeling of real intoxication or anything. Disappointing not to mention puzzling ! I should mention that i didn't want to take GHB this day but i just did anyway to go on with the trials. This wasn't even to the level of buzz i achieved with 500mg. However i woke up the next day feeling refreshed and highly energized though i wasn't sure what to do with all this energy. </p><p>Seventh time (next day, 26h after the previous intake) - 1000mg. Taken as an initial 650mg. I must mention that i was torn as to the time of this new trial. I was quite disappointed from the uneventful previous trial and i desperately wanted something to happen with this stuff. On the other hand i just felt that it was not right to take it again so soon for i felt i didn't need to do it so soon. Eventually though i did get on with it. The taste was just as gross as usual. Strong drowsy gently euphoric surge after 20min. Things are funnier. I take an extra 450mg after 30min and couldn't help but nibble as well. 20min after the extra intake i started to feel heavy eyelids and went to brush my teeth. In the bathroom i noticed my pupils : their ability to accommodate to light seemed diminished although not as constricted as with opiates. Back to my room, i crawled into my bed with my macbook pro to watch videos, the effects of intoxication grew more intense over the next 30min to the point that i fell asleep. The next morning i felt very languid the entire day.</p><p>Eighth time (three weeks later) - 1500 mg. Taken as three 500mg doses, each 5 minutes apart. Shot up to a state of strong intoxication vaguely similar to alcohol yet quite different. i just felt good and goofy for the whole evening until i started to think about my ex. I got all misty and nostalgic and cried. It felt ok to cry. It felt very emotionnal yet painless... Relieving. Woke up mollified the next day.</p><p>-------------------------------------</p><p>Conclusion</p><p>GHB is a peculiar substance. My expectations of what GHB was were largely shaped by Claude Rifat's paper on GHB as the first authentic antidepressant in which he speaks of GHB as a rather tantalizing elixir of the sublime.</p><p>On the whole i found GHB to be subtle. you have to do something to realize it's there. Nothing to do with heavy drugs like psychedelics or opiates. In this respect, the context plays an important part. I understand why it is compared to alcohol (it provides a pleasant drowsy feeling) or ecstasy (it stimulates sociability), although it doesn't actually feel like either one. It has its own feeling which is unique. One thing that struck me is how prosexual it is. Not that it makes sex physically any better, in fact it slightly decreases tactile sensitivity and there is no doubt that this compound has anesthetic properties. However it sure makes you horny (even guys can become slutty with it lol) and the intimate bonding becomes quite gratifying. I believe this is an outgrowth of its sociability enhancing power.</p><p>My trials were not satisfactory as to the right dosage for me (my G spot so to speak ;-). I believe it should really lie in the 2-2.5 g range. I wouldn't be surprised since Gamma-OH (the original pharmaceutical brand name of GHB) used to be sold as 2g ampoules...</p><p>One undeniable thing is its genuine strong antidepressant power. That stuff can lift you out of depression within 20 minutes. It doesn't bliss you out of reality. It seems to prevent negative emotionnal states or negative ideation while enhacing the basic emotionnal tone, meaning that it shifts your emtionnal balance towards the positive ranging from 'it's ok' (this is more characteristic of the afterglow) to 'i feel so good' (during the peak). On this account Rifat was completely right !</p><p>Another peculiar feature of GHB is how you can actually have enough of it. I highly suspect this to be dopaminergic homeostasis at play which i thought was quite remarkable.</p><p>I need to say however that because GHB feels quite benign (the effects are not otherworldy and there is no major abrasive drawbacks such as hangover or harsh come-down), and the effects so pleasant, it can become very tempting for some people to redose continuously hereby leading to... addiction. It needs to be treated with the respect its power deserves.</p><p>I was first disappointed with GHB because from what i had read i imagined it to be a blissed out experience on par with MDMA or strong opiates. It is simply not. It is indeed a (relatively) subtle substance. However, when just considering the quality of the experience rather that the intensity/quantity, it is truly a remarkable compound.</p><p>I think it's a complete disgrace that such a friendly mood enhancer has been banned. It is simply the best thing i've tried so far : quite mundane yet genuinely and humanely gratifying.</p>"
}
