{
 "title": "Tough, Strange, and feels like Purgatory",
 "author": "Rueful",
 "citation": "   Rueful. \"Tough, Strange, and feels like Purgatory: experience with Syrian Rue (ID 82553)\". Erowid.org. Feb 2, 2011. erowid.org/exp/82553",
 "substance": "Syrian Rue",
 "bodyweight": "162 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 g",
   "oral",
   "Syrian Rue",
   "(tea)",
   "  T+ 0:30",
   "5 g",
   "oral",
   "Syrian Rue",
   "(tea)",
   "  T+ 1:30",
   "3 g",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2009",
   "82553",
   "Male",
   " ",
   "20",
   "Feb 2, 2011",
   "13725",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Before this, I've tried psilocybin and DXM on a number of times. Before this experience, I was sure not to have any high-tyramine foods. This is my first try with Syrian Rue, and I'm starting pretty high. I generally have a very high, natural tolerance to mind-altering substances, as I've learned on multiple occasions with other substances.</p><p>I started up by brewing 5g of the rue tea, by letting the crushed seeds simmer in a pot for 30 minutes. Then I carefully strained out the seeds, leaving me a yellowish soup that seemed just awful. I added some stevia in, and tried to finish it. Kinda wish I didn't have that much liquid...</p><p>Took about 5 tries before it went down, while quickly alternating the tea and diet coke. I prepared another batch of tea shortly after (30 minutes later), recycling the dregs of the first (saved the used seeds), and using another 5g of fresh rue seeds. Made it in the same basic fashion, and somehow swallowed it. About 1.5 hours into the experience, I then quickly swallowed 3g of fresh seeds with juice. The timeline of my experience goes a bit like this...</p><p>8:50pm</p><p>Swallow 5g of nasty rue tea.</p><p>9:20pm</p><p>Feeling light-headed, dizzy. Coordination is down somewhat, I begin walking in a manner resembling that I've had 10 drinks of liquor.</p><p>9:25pm</p><p>Swallow 5g more of stronger, nasty rue tea.</p><p>9:55pm</p><p>Feeling now at a super-drunk point. No significant nausea yet, but my head is majorly buzzing. Thoughts and visions are becoming clouded especially, and a very slight distortion (shimmers) if I really concentrate.</p><p>10:30pm</p><p>Still super-drunk, no noticeable difference. Thinking has become a bit strange and clouded. Imagination is a bit strong, but halfway between normal and CEV-level. I feel somewhat weightless if my attention drifts off.</p><p>11:00pm</p><p>Feeling dead tired and sleepy. Not sure what to make of this yet. The room is spinning, and this just seems to resemble me drinking a ton of liquor. Except less enjoyable somehow. My thinking is definitely very altered at the moment. I feel as if I'm able to look fairly in depth at random video's and lyrics, and remember and mention strange significances I haven't noticed before. And rather quickly at that. A definite time distortion is going on. Feels like hours, but only minutes have passed.</p><p>11:30pm</p><p>I first start noticing tracers. The tell-tale psychedelic sign of harmaline. They were fun for a little bit, as I shifted my vision or walked around, they would follow, but it wasn't too impressive. Friends looked at me like I was crazy. Didn't see too many *strong* tracers as I've seen mentioned. Seems like a peak.</p><p>Midnight</p><p>Can barely walk, I stumble to bed. I stay awake for a good hour, being confused of where I am, and fall into trances and abruptly awakening multiple times. I can almost see a fuzzy image of outside, through the walls of my room for a short while. Then I pass out. Still peaking all the way.</p><p>1:00am</p><p>Look at the clock right before falling asleep. Feels like I'm on a merry-go-round with the dizziness I feel.</p><p>7:30am</p><p>Had to awake up for class, but still had tracers everywhere. I stumble around trying to get myself ready, but coordination was still funky. I set my alarm a bit later --- feel too messed up and exhausted.</p><p>8:30am</p><p>Feeling mentally and physically exhausted. Diarrhea all this morning, with some very slight stomach discomfort. I skip breakfast and my usual coffee due to the general rules of MAOI's. I then drag myself to class, walking slightly uncoordinated.</p><p>9:30am</p><p>Thinking is still clear, but exhausted.</p><p>11:00am</p><p>I start writing this report.</p><p>As an overall, this experience was fairly interesting. It's a very tiresome endeavor, but even with my weak stomach I never vomited (I vomit from anything). I believe this may have to do with me actually not consuming the seeds. I definitely did see a slight visual shimmer to things if I concentrated, and a drunken feeling with just the 10g of tea with zero stomach discomfort. The strongest points were definitely developing in me right before I slept, and the effects lasted a good 10-11 hours total (including sleep). At around the 17 hour point, side effects became null, besides general exhaustion.</p><p>I wouldn't repeat this again alone, and not in the quantities I did it. It simply isn't something I can take recreationally or pleasurably. The tyramine-restricted diet kind of stinks too. The euphoria really isn't there, and the vivid CEV or visuals aren't there, and the only case I could see it being very interesting would be with some sort of meditation. Or potentiating other drugs.</p>"
}
