{
 "title": "Possible Remedy For Overdose?",
 "author": "Hatoner",
 "citation": "Citation:   Hatoner. \"Possible Remedy For Overdose?: experience with Datura, LSD, Alcohol & Tea (orange leaf) (ID 82622)\". Erowid.org. Mar 14, 2010. erowid.org/exp/82622",
 "substance": "Datura, LSD, Alcohol & Tea (orange leaf)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Datura",
   " ",
   " ",
   "  ",
   "oral",
   "LSD",
   " ",
   " ",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "1 cup repeated",
   "oral",
   "Tea",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2006",
   "ID: 82622",
   "Gender: Male",
   " ",
   "Age at time of experience: 27",
   "Added: Mar 14, 2010",
   "Views: 14568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nFirst of all I am writting this because i witnessed something very interesting during a vacaction trip to a virgin beach in the state of Michoacan, México. The story is regarding properties from the orange te leaves othat i dont know if are known or uknown to moste of the community in erowid,the story happened like this.\r\nI was on my vacations on this semi virgin beach in the state of Michoacan, México named Maruata, several plants and drugs can be found here since many many people come to this beach to experiment with them and the unique ambient and settings of a virgin beach, the drugs that can be found here are most commonly opium, marihuana, lsd, datura or 'toloache' asi is called by the inhabitants or natives from the beach, extasy and others.\r\nWe were hangin out with my girlfriend in the camping zone when she had to go to the bathroom at approx 10 p.m, when se came back she told me about this very weird guy that seemed to be on something very potent, she told me that he came up to her and started asking her what her name was, and after that he told her as if i was something very normal to look at his burned feet, he showed her his feet which was baddly burned after steping on a bumfire, he said some other nonsence which i dont quite remember and left, we thougnt that maybe he was on shrooms or something, \r\nAt approx 11 pm we were waiting for our food to be served by the locals at this table located in the camping zone when we heard screams and saw movement between all the other tents and saw this guy screaming 'help me', 'he wants to kill me' and stuff like that he was coming up to me and my g.f so i thought he was going to be agressive towards me since my gf told me it was the same guy that tried to talk to her earlier so i stood up but before he reached our tables he tripped and falled to the ground and tried to hide under a table, when he fell he calmed down and remained silent, i came close to him and saw he was awake but silent, he was breathing extremly fast and when i touched his chest i noticed his heart was beating very fast, his body was very hot too, he stayed just laying there with his eyes open for approx 1 minute and i was askin he what he had taken, he didnt listen to me and started screaming again to help him, that someone was trying to kill him, he stood up and start running again just to fall to the ground again. \r\nBy this time may of the people that were there were trying to help him, asking him what he had taken but he wouldnt say nothing back, he was just screamin for help, and at one point he started choking himself, grabbin his neck with his own hands and squeezing it, we stopped him from doing that and tryied to calm him down, some people suggested to drive him to the near hospital which is located in the Navy base which was 10 mins away approx, but we couldnt get him in the pick up truck, not even between 7 guys we could get him to the truck, he would just get away from us and go back to the floor, it was like if his body was in total drunkess.\r\nMany locals were watching the whole thing and most of them were saying that it looked like he had taken 'toloache' (datura) and were saying how theyve seen people take it before and never coming back from the trip, or stayin with the effects for about a month. after an hour of this a guy who was his friend came and told us that he didnt know what he had taken, besides some medicine for the burned foot, alcohol and maybe lsd, he said hsi friend went to this island the night before and returned in a very weird state, the the rest happened. While we didnt know what else to do this older local woman came with a coup of some kind of tea and told us to give it to him. We asked what was it and she said it was orange te (orange leaves tea) which as you all might know is very very common, at least in México, is something that we all will have in our houses to drink sometime.\r\nAfter all this preface we come to the interesting part, we grabbed the guy on the floor, made him drink a lil bit of the tea and INMEDIATLY like after 3 or 4 seconds from drinking the tea he combes back, he stares at us and in a very very very scared, desperate voice tells us to help him, that he doesnt know what he took, that he remembers going to the island but dont remember what he took, then after approx 10 seconds he goes back to his madness screaming and stuff, we give him more tea and comes back, again saying that he is not feeling right, that he doesnt know what he took but that he needs help, to not make the story longer, his friend had to deal with this all night long, giving him the tea, having this guy sleeping and waking up in terror, then going back to a sort of sleep, but everytime he drunk the tea either he came back to reality or was able to sleep a little bit better.\r\nNext day we walk by their tent and see the guy is feeling better, but still has a strange look like he is not completly back, he looks worried, a lil bit scared, confused. So that was the only and last time i saw him, but for sure ill never forget how this so commonly used tea brought him back every time he took it. \r\nI hope this story can be usefull someday, if anyone has similar stories pleas writte them here, if anyone wants more details about the story or wants to talk to me writte me to hateonek@hotmail.com, ok this is the end and sorry for the ortography and grammar, im Méxican so english is not my first language.\n\n\n"
}