{
 "title": "Dosage Experiment",
 "author": "The Caveman",
 "citation": "   The Caveman. \"Dosage Experiment: experience with Cacti - T. peruvianus (ID 8263)\". Erowid.org. Jul 29, 2004. erowid.org/exp/8263",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cacti - T. peruvianus"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8263",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 29, 2004",
   "Views: 8217",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI purchased 6 Cacti from a little town in Arizona. Each Cactus weighed nearly 5lbs. I selected 3 cacti from the group that I felt would not survive being replanted. These 3 cacti together weighed 17.8lbs. I trimmed the spines then cut off all the green stuff throwing out the white core portions (I will not do that again). I set the green plant matter in a dehydrator for 1 day. After it was dried I ground it in a coffee grinder. What remained was 4.6oz of dried powder. Starting out with low doses and working up is best advised when experimenting with new cacti. So I first took one teaspoon of the powder and chased it with water. NO RESPONSE. The next week I consumed 3 teaspoons. Mild response. Weak cacti? A week later I consumed 2 Tabelspoons. Nice response but I never seem to get good visuals on anything other than fresh cacti. My best response to date was buying a whole live Trichocereus Bridgessi that was 16 inches tall and 6 inches around. Cut off the spines and chow down. Cooking, drying, grinding, and blending all increase the flavor of the cactus. <br>From here on out I will be eating my cactus like corn on the cob and adding nothing but a little bit of salt. If your really concerned about the flavor here is a good recipe for you. Dry and grind your cacti. Add Vitamin C to your dose in a small bowl. Squeeze two limes into the bowl and stir. This will thicken quickly. Let sit for about 15 minutes then add chopped Jalapenos, onions, cilantro, and chopped tomatoes. You get a nice cactus salsa. Eat this with a few corn chips and enjoy. I do not get any nausea from any of the cacti but if you do, a really spicy salsa could be quite painful coming back up. For my next experiment I am going to attempt to make cacti wine.\n\n\n"
}
