{
 "title": "Is Erectile Disfunction Fun?",
 "author": "Zinex",
 "citation": "   Zinex. \"Is Erectile Disfunction Fun?: experience with Diphenhydramine (ID 82659)\". Erowid.org. Apr 7, 2010. erowid.org/exp/82659",
 "substance": "Diphenhydramine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "Diphenhydramine"
  ]
 ],
 "footer": [
  [
   "2008",
   "82659",
   "Male",
   " ",
   "19",
   "Apr 7, 2010",
   "Views: 13260",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I hope that my experience would discourage others from making the same mistake. I started using Diphenhydramine for its classical hallucinogenic mind altering effects. I would used more than 500Mg to achieve this. However I did not enjoy the effects that it brought at high doses: extreme drowsiness, horrific hallucinations, cottonmouth, and anxiety. However, I started experimenting with lighter doses because I enjoyed the dreamlike perception shifts it causes.</p><p>I was never 'addicted' to this drug, until by accident I discovered that it dramatically enhances the intensity and pleasure I can experience from an orgasm. I have been abusing this drug like a heroin fiend since then, perhaps do to my pornography addiction but that is irrelevant.</p><p>My actions brought consequences, now at the lovely age of 20 I suffer from erectile dysfunction, as consequence of my drug abuse. According to my doctor that happens to be an Urologist Diphenhydramine is an antihistamine used to treat the inflammation that accompanies allergies. However, the drug is also a powerful 'vasoconstrictor' that can damage the sensitive nerves and veins surrounding the penis. This is especially the case if used while being sexually active.</p><p>I wish I would have know this information before I started abusing this drug for this seemingly harmless 'enhanced orgasm effect'. I abused this drug for over a year, so if you happen to used once or twice you may be all-right. But that is what I thought then when I started abusing, I guess that is common when you are addicted. Now my life is miserable because of my poor judgement. You never appreciate things until you lose it. I never anticipated that at my young age I would became sexually dysfunctional.</p>"
}
