{
 "title": "Orange Gave Way to Utter Darkness",
 "author": "Charles",
 "citation": "   Charles. \"Orange Gave Way to Utter Darkness: experience with DMT (ID 82670)\". Erowid.org. Jul 14, 2010. erowid.org/exp/82670",
 "substance": "DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "DMT",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2009",
   "82670",
   "Male",
   " ",
   "20",
   "Jul 14, 2010",
   "Views: 11916",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started the night by going out to eat with my little sister, we had a great time eating and laughing and just generally talking. After our meal, I dropped her off at my mom's house and went to my friends house, I will call my two friends John and Jane. It was dark by now, and rain was coming down really hard. I finally got to their house and we were up in Janes room. We were listening to bluetech and some other bands, mimosa was another I think. We were just drinking and talking, and eventually we started coloring and making a collage. After about an hour of coloring and watching planet earth on mute to music, John pulled out his lil glass pipe with the DMT already loaded in it.</p><p>I have smoked it once before, and while I didn't really get too far, I definitely had my first brush with a DMT spirit.  I blasted off for the first time with Richard Wagners Lohengrin-prelude playing in the background. It really helped to calm me down and set a good mood, personally at least. I remember during the first time, an amazingly vivid and flowing.... feminine like spirit was looking at me... She didn't say anything, but she did... touch me kind of? When I say touch, I mean that a bit of this spirit tapped my forehead almost and with that, viscous bubbling Saffron Orange energy seemed to rupture in front of my eyes and I was swept away.... The whole thing was very calm I did notice on the fringes a darker side to it all though... black jagged lines and slithering hisses taking stabs towards the center of my vision. They were swept away each time though as the Orange bubbling energy constantly expanded outwards.   When I opened my eyes, it was over, for the most part. As quickly as it began it faded away and it left me dazed.</p><p>Anyways, back to Janes room. Jane had turned off the main lights and the room was illuminated by stars with lights behind them on the wall, these seemingly innocent looking stars would later morph into terrible looking things. It was a dark purple color in the room. Some sort of shamanistic music was playing in the background, I can't remember the artists name. John held the pipe for me as I took a very large hit. Instantly after I let out my breath, I felt it. A new perceptiveness to color, a heavy feeling all over my body. The second hit was larger and when I exhaled I started feeling hollow, weak in the limbs, it was hard to support my upper body with my arms. The background started blurring and I could hear the music being distorted. I started taking the third hit and I took as much as I could in. I tried to hold it for as long as I could but I lost the ability to hold my body up and as I fell back into the bed, I exhaled.</p><p>As soon as my head hit the pillow I was there. But things weren't like last time. I saw the Orange being in the distance, but she was being held back by vines of blackness.... Then I heard the hissing again...  It is at this point that I want to tell the reader that I honestly felt the sensation of terror.... I was literally terrified by what was about to happen. The lamp in front of me fractured and broke down into 2d layers that then were splayed out like a slinky. I noticed the ceilings colors shift from gray purple to a cascade of earthy plant like colors... Green, purple, brown, black... The black gave way to the beings I met. These three spirits came in from varying angles and in different forms.... all of them felt malicious and sinister. They kept circling me and asking me questions as they came closer. </p><p>'Why have you come here?'</p><p>'Do you really think you can come here?!'</p><p>'This is not your place!'</p><p>'Why do you think you can be with us?!'</p><p>'Why do you think you can come here?!'</p><p>They asked me these questions repeatedly as they engulfed me. I felt like I couldn't breathe, and I opened my eyes, but the room was not what it was before. I looked towards the door, my way out, but it stretched away from me.</p><p>'You can not leave yet.' they said</p><p>'COME BACK'</p><p>I closed my eyes again and what happened was so moving it still makes shudder. These dark spirits had twisted together in a black and purple pulsating cocoon around me. Jagged edges, sharp tips, they were extremely threatening. They made me feel every negative emotion I have in my human form... they showed me what it feels like to be completely alone in the darkness, with no escape... I felt an immense pain in my lips and lungs. I felt utterly hopeless, surrounded by all the negativity in the world, the suffering, the endless pain that exists, surrounded by malice and hatred... evil. My breathing was very sharp and rapid I think.</p><p>Then they stepped back. The orange girl in the distance was coming closer. As she approached the darkness peeled back and let her near. I got the sense that it was actually the Orange girl that had called upon these three dark things. At this stage I had taken control of my breathing. She said to me...</p><p>'This is how it is, this aspect of it at least.'</p><p>'You always have a choice.'</p><p>'You always have a choice.'</p><p>I remember telling the girl that I did not like them, the dark ones. I did not like them at all, I hated them, I wanted nothing to do with them. She responded by making the blackness reveal itself. They were extensions of the girl... tentacles almost.</p><p>'Why did you do that to me?' I asked</p><p>'You needed to see what we live in, this is our domain... this is the way it is. You will learn more soon.'</p><p>I opened my eyes and I was back in the room I remembered, but I still had the visuals equivalent to a massive dose of LSD. I remember having the sensation of fear, thankfulness, and love at the same time. I was afraid of what I had seen... but then I realized that nothing was malicious about what had happened. I thought the orange girl had betrayed me, but she had really just helped me out. She was trying to show me her world, at least a part of her world.... I then became very very calm... It was as if she had flipped a switch in my mind. I felt love for the earth, gravity, life in general.</p><p>The Buddhists say that life is suffering, but to attain enlightenment, you must accept it. Acceptance that life is suffering is the first step to nirvana. Well, I feel that I accepted it that night. She thrust me into the darkest well of my mind, she showed me what it looked and felt like to suffer... but not in a bad way. She remembered to tell me that there is always a choice... I still don't know what that means, but I think that she wanted me to know that there is more to life than suffering, more than the blackness, more than the void. That if we choose to walk a higher path, it exists, but it is hard to navigate. BUT... that there are those who will help you should you choose that higher path. </p><p>I know this story sounds out there, but it all happened with such vivid clarity. It wasn't like the drug changed my surroundings, it just widened my spectrum of what I see. It was as if I gained the ability to see radio waves, or sound waves... to see what is there but not visible to us... It is always there, but we are conditioned to mute it out. That there are other beings in this realm that we can not perceive but are always there. There is a Yin to every Yang, and existence/consciousness doesn't stop past the visible spectrum of light.</p><p>That is what I would have to say to sum it all up. All in all, it was an amazing experience. Even though it was very dark, and what some more inexperienced psychonaughts might call a 'bad trip', I feel like I gained a priceless lesson. I am ready to meet the Saffron Orange Girl again, but this time, I want to follow her, and see where the others are. She did mention that she was not the only one, that there many like her, and many that were very different from her.</p>"
}
