{
 "title": "3 Months of Active Psychosis Horror",
 "author": "Joe",
 "citation": "   Joe. \"3 Months of Active Psychosis Horror: experience with Modafinil (Provigil) & Bupropion (Wellbutrin) (ID 82721)\". Erowid.org. Sep 30, 2010. erowid.org/exp/82721",
 "substance": "Modafinil (Provigil) & Bupropion (Wellbutrin)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Modafinil",
   "(daily)",
   " ",
   "  ",
   " ",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2006",
   "ID: 82721",
   "Male",
   " ",
   "26",
   "Sep 30, 2010",
   "Views: 23014",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was put on Provigil to combat Narcolepsy and chronic fatigue syndrome in 2006.  At the same time, I was prescribed Welbutrin, an anti-depressant.  I was put into a facility under 'observation' while I acclimatised to the drugs.  Nothing unusual was noted.  I began to hear strange sounds in my environment, especially late at night, but did not think much of it, since it was a hospital.  A woman gave me a bible and prayed for me, and suddenly I felt immensely better.  I began to develop a fixation with the bible and would sleep with it under my pillow.  </p><p>When I left the hospital I moved to a city far away from my family to further my studies.  Within a week I had begun to see auras.  I thought it was quite nice really, and interesting, and I began to have the archangels visiting me and I could tell them apart by the colour and energy I sensed in the room.  One day I went running and lay down on the forest floor.  When I got up my body was still lying there, traced in a blue-grey smoke.  I could see details like my jawbone and my teeth.  It was like an x-ray, a blueprint of me.  That was the last nice experience I remember.</p><p>As it was later explained to me, the Provigil pushed my mood up and up, and the Welbutrin stopped it from ever falling.  I was on an exponential trip to happyville which went over the edge and didn't come back.</p><p>Suddenly my awareness of sounds in the environment turned into an increased noise sensitivity, and a heightened paranoia in which I began to put together events based on the sounds in the houses around me which I could not possibly have heard.  I had moved into a new house with strangers and began to believe they were satanists and wanted to kill me or join their cult.  I thought I could hear them chanting at night, reciting latin prayers backwards or singing.  Then they began to talk about me and how they were going to make me join.  At night I would wake up and hear them changing 'I bind you to Satan, I bind you to Satan'.  There were sudden hysterical giggling fits, and I identified various different characters and voices having conversations.</p><p>As the weeks progressed, I would begin to see things in my room at night.  I was terrified, all alone in a foreign city, sleeping on a bible given to me by a stranger, which seemed my only support.  Throughout this time I became increasingly religious.  I thought since I knew nothing about such things that my mind could not be making it up.  One morning I woke up at 3 AM and found the front gate open.  The girl who stayed in the front room was not there, but her light was on.  I thought I could hear her next door, and that they were talking about how they were going to make me join and sacrifice babies, or kill me because I could hear them and I knew too much.  From that day, I lived out of the back of my car with a few clothes and toiletries.</p><p>I believed they were following me.  My life turned into a horror spy movie.  I made long phonecalls to psychics at remote telephone booths.  One of them told me there was a book in my room that was being used as a focus by the coven and I had to go get it.  There had been a book when I moved in.  I opened it.  It had a horned beast on the inside cover and was the supposedly true description by a ritual murderer about how he set about killing his victims while possessed by demons.  I burnt it.  Things like this made me believe the whole thing was real.</p><p>I had found another place to stay in the meantime, and when the same pattern began to unfold again, and when I still heard some of the same characters talking 'in the house next door', I knew it was me.  I was going mad.  Nothing like this had ever happened to me before, so it took me that long to accept it.  After three months of active psychosis I ended up at a psychiatrist's office.  He immediately put me in a clinic and took me off Provigil.  The rollercoaster of medications he put me on is another story.  Seroquil had me sleepwalking down the Main Road of the city in my underpants, after having scaled a 3m security fence in my sleep.  An ambulance brought me back to my new housemates with cuts in my hands and I tried to fight them off and run away.  I have very limited memory of any of this happening.</p><p>The Provigil permanently altered something in my brain.  I still hear voices now, and have paranoid thought cycles at night which seem inexplicable by day.  Due to the intense trauma suffered from going to bed each night believing sometime in the night they would come to fetch me and kill me, and that I was under constant surveillance, after my nervous breakdown I eventually took myself to a mental hospital.  The tests conducted on me there indicated that I had TLE (temporal lobe epilepsy) and the theory was that the Provigil had fired a continuous buildup in my brain which caused me to have constant fits and hallucinations for three months.</p><p>I also began to understand that somehow the Provigil had brought out all my hidden neuroses and turned them into massive obstacles and forces within a fantasy world I unconsciously already believed in.  It was like all my greatest fears, expressed until then in subconscious paranoia, were suddenly blown open, symbolised, characterised, personified, magnified and made real.  In therapy I linked the trauma of the psychotic episode to being bullied daily at school for five years.  I learnt things about myself I might never have tried to understand, thanks to the psychosis.  It also ruined my life, blasted my bank account, turned me into a person who continues to have a mental disorder I did not have before (hearing voices) and cost me unbearable shame, public embarrassment and years of recovery, not to speak of lapsed career opportunities.  According to the various psychiatrists that saw me, this could only have been brought on by the Provigil, although they could not actively explain it.</p><p>The medication I take is similar to that prescribed to bipolar people, and I often tell people I am bipolar because it is easier to explain why I can't drink at a party for instance, due to medication.  In hospital I did not score as bipolar on any of the tests they made me fill out.  I am on Lamictin (Lamitrogine) by day and Tegretol (Carbamezapine) and Risperdol (Risperidone) at night.  I am only too happy to take it because even though it does not work 100%, it takes the edges off things like the severe depressive episodes I sometimes experience.</p><p>I have never been drawn to illegal substances and was not taking anything of that nature during this experience, nor was I drinking alcohol.  I did however become addicted to sleeping tablets during this time as I was desperate to control my sleeping patterns.  Most of the time, however, the imminent fear of being killed was stronger than the sleeping tablet.</p>"
}
