{
 "title": "Another Day Addicted",
 "author": "Euslace Nodd",
 "citation": "   Euslace Nodd. \"Another Day Addicted: experience with Heroin (ID 82765)\". Erowid.org. Jan 25, 2012. erowid.org/exp/82765",
 "substance": "Heroin",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2008",
   "ID: 82765",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Jan 25, 2012",
   "Views: 4927",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Its 6am. God, why didn't you save something for the morning? You KNOW Sammy always sleeps till 2pm, and doesn't get out here till like 4 or 5. Even 0.1 would have given me time to get some cash together. I have to turn the fan off immediately, the cold is unbearable. It feels like I have taken a bath in Icy-Hot; alternating chills and sweats, its a very disgusting feeling. My bed is soaked with sweat and I can feel my knees start to ache.</p><p>As I said, Sammy, my dealer, sleeps WAY in, usually till about 2 or 3 in the afternoon. Withdrawals always wake me up early in the morning, so I have to suffer many hours before he rolls through. Mom insists on taking me to Costco today, to lift the cases of water. I really don't want to go, but I can't let her know I've been using again.</p><p>By the time we get there its about 11 o'clock in the morning and my aches are starting to kick it. I have to go wait in the car, where I poke around trying to find some cash stashed somewhere. I turn up nothing. I'm broke, I have no cash to get well, nothing to pawn, my mind is racing through all the possible ways to get money. </p><p>I ended up stealing $30 out of my mothers unguarded purse. First a twenty, then I went back for another ten. Of course there is no guilt, she has tons of money, and I NEED this. After unloading groceries, she takes off for work. I stay home to sit in my bed and wait for Sammy to wake up. I tell her I'll be by the shop to help out later today, after I have picked up of course. </p><p>I blew up Sammy's phone and eventually woke him up. He seemed irritated, which was later reflected in the skimpy balloon I got.  He finally picks up at about 1 in the afternoon, says he'll be through shortly. Of course he isn't through shortly. He's 'still waiting on 3 people,' and its three o'clock by now. I start to cry when I hang up.</p><p>I sit in my bed, soaking it thoroughly in sweat, watching reruns of MASH. Oh that Klinger... Around 5 in the afternoon, I hear his car horn through my open window. Immediately my heart rate skyrockets, I JUMP out of bed, throw on some slippers and RACE out the door. My knees are aching unbearably, the sun is too bright to see, and the cold air stings my skin as I walk across the yard to the alley where his silver car is waiting. I look terrible; matted hair, wild eyes, clammy white skin, weighing 120lbs, wearing nothing but basketball shorts and slippers.</p><p>When I get inside, my kit is already sitting out waiting for me; the needle, the water, the turny, and my little silver spoon. I could NOT get that stuff into my veins fast enough. Its truly a beautiful thing when all your aching bones, your Icy-Hot skin, you chills and sweats, your lack of energy, when it ALL dissolves away in thirty seconds. Theres nothing like that feeling. </p><p>Now I can walk again, I'm in a GREAT mood, I'm petting my obnoxious dog, I have the energy to MOVE, my back no longer aches where I can't lie down, I'm cleaning the house, everything is perfect, everything is working, everything is just great, until tomorrow of course.</p>"
}
