{
 "title": "Beginner's Foray into The World of Psychedelics",
 "author": "SKuM",
 "citation": " SKuM. \"Beginner's Foray into The World of Psychedelics: experience with 2C-E (ID 82791)\". Erowid.org. Feb 3, 2010. erowid.org/exp/82791",
 "substance": "2C-E",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "12 mg",
   "insufflated",
   "2C-E",
   "(powder / crystals)",
   " T+ 2:00",
   " repeated",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2009",
   "82791",
   "Male",
   "",
   "16",
   "Feb 3, 2010",
   "7909",
   " "
  ]
 ],
 "report": "<p>First use of any psychedelic (with the exception of marijuana).  20mg purchased on an online vendor with a friend, split between us semi-equally (I came out with 12mg, he came out with 8).  Friend wary of insufflating powder, transferred powder onto blotter tab  and consumed orally.  Acquiring the research chemical was a bit of a chore, as I am currently still in high school and living with my parents.  Shipping to house was not an option, so a P.O. box was purchased.  </p><p>Decided to snort the powder, as a 12mg oral dose is reasonably low.  12mg insufflated 2C-E falls under the 'Heavy' dose, the strongest dosage category.  Feelings of euphoria in association to music and movement expected, along with a severely altered thought process, CEV's, and if lucky, minimal OEV's, especially in conjunction with marijuana.  I plan on smoking my herb if I feel that I should intensify my trip, and I have 20mg of hydrocodone if my trip needs to be mellowed out.  </p><p>Nausea is likely, as drug consumed on full stomach, as well as strong possibility of general stomach discomfort and diarrhea.  Come up is expected to be extremely quick, and a terrible drip and burning sensation will likely be associated with the insufflation of the powder.  Setting is extremely comfortable, with no chance of contact with parentals or sibling.</p><p>Dose taken at 11:20</p><p>T-1:30</p><p>Browse the web and play guitar to pass time while I await the sleep of my parents.</p><p>T-0:45</p><p>Write down 7 things on an index card to keep my trip in a good mood, i.e. 'You are not going to overdose.'  'You are able to breathe perfectly normally.'  'Your parents are asleep.'  etc.  Hopefully will be helpful if my trip turns sour.</p><p>T-0:30</p><p>Begin meditation in order to ensure good vibes of my trip.  I am at peace with myself and the world.</p><p>T-0:05</p><p>I am extremely nervous that I will have a bad trip, and I almost chicken out.  Despite my meditation, I am slightly uneasy about the high dosage of my trip and my inexperience with psychedelics (and hallucinogens in general.  Prior trips include several 1st and 2nd plateau DXM trips and several low and medium dosage DPH trips.)</p><p>T=0:00</p><p>I rail half the powder up the right nostril, the effects of the drug are immediate.  The line is approximately a half inch long.  15 seconds pass, and I finish the rest.  Because I'm such a pompous fucking douchebag, I decide to rail the drug off my guitar.  I feel cool.</p><p>T+0:03</p><p>Come up is blindingly fast.  I sip on my orange juice and cannot control myself from spitting into my trashcan every 10 seconds.  Surprisingly, neither the burn nor the drip are discomforting at all.</p><p>T+0:08</p><p>I am in full trip mode.  I am lying face up on my shag carpet floor, unable to move.  The lava lamp captures my full attention.  Euphoria is extremely noticeable, and a plethora of visuals bombard my senses.  My walls breathe in and out, and the wax inside my lava lamp floats outside it's glass prison and begins to bounce around my ceiling.</p><p>T+0:15</p><p>I attempt to text my friend (the co-purchaser of the drug) that this is the greatest I have ever felt in my entire life.  He has decided to wait until Friday to consume the drug (it is Tuesday night).  The numbers on my phone shrink and grow rapidly, much like what I would expect the visuals of an LSD trip to be.  My texts are largely unintelligible.  Our conversation reads as follows (I am S, he is J):</p><p>S:U still up</p><p>J:fa sho. u rail it</p><p>S:Ya mang.  Shit fuckin colour</p><p>J:ya pretty sure i got going from licking all the stuff clean</p><p>S:Dude the text on my phone is getting so small i cant see it.</p><p>J:lol</p><p>T+0:25</p><p>I attempt to post on two websites to enlighten the world about my wonderful drug experience.  However, my posts are largely unintelligible and nonsensical.  Apparently (judging by my posts), my hands looked like skeletons, and colours ravaged my senses.  I get in a rap battle with somebody online. my rap goes as follows:</p><p>goddamn muthafuckas, throwin sick as shit rhymes down</p><p>yall aint got nothin on me cuz your smokin bobby brown</p><p>yall think you smoke kush? BULLSHIT!</p><p>i rock some mean weed, take fuckin green after green hit.</p><p>poomonst3r who the fuck you think you are?</p><p>some kinda godamn rap star?</p><p>i beatcha in a fuckin minute, i ain't even tryin</p><p>i ain't even on weed, my brain's fuckin fryin</p><p>railed a line of 2C-E, burns like a fuckin bitch</p><p>popped some hydrocodone, i rock the three hour itch</p><p>smokin dank herb, fuckin bowl after bowl</p><p>try and see if you can keep up, i'm reppin OLD SCHOOL!</p><p>T+0:45</p><p>I lay around for a while, experiencing this new alien world.  I decide to watch 'Fear and Loathing in Las Vegas,' a movie which I have watched several times both sober and high on marijuana.  The movie appears to have a new meaning while I'm tripping.  I suddenly understand why there was an entire generation of youth devoted to psychedelics; the wonder and amazement that is the psychedelic experience seems suddenly worth the failure of the counter culture movement in the 60's.  The movie keeps me entertained for over an hour.</p><p>T+1:50</p><p>I suddenly feel the urge to masturbate.  Won't go into details, but it was orgasmic in every sense of the word.</p><p>T+2:00</p><p>I make the decision to smoke marijuana in order to intensify my trip.  A dozen bong rips later of California medicinal marijuana (Alaskan Thunderfuck, $60 an eighth) and I am flying higher than I could ever have believed possible.  I look out my window, and the trees merge into infinitely complex geometric patterns of flowers.  A blink of the eye later, and the flowers have disappeared.  My walls breathe in and out, and the visuals are indescribable.  Colour seeps down my walls, and the text on my computer screen is outlined by green, red, and yellow, which shoot back into the depths of my screen into oblivion.</p><p>T+2:20</p><p>I take my hand at drawing some pictures.  A terrible picture of an emboldened 2CE in cursive is drawn with nonsensical words and scribbles in the background.</p><p>T+2:40</p><p>I listen to several songs on my music player.  The most memorable song is 'Adagio for Strings,' by Samuel Barber.  Extremely emotional classical piece made in the mind 30's.</p><p>T+3:00</p><p>Continue to browse the web.  I lay in my bed for a while as I am chillingly cold, despite my thermal, sweatshirt, and two blankets draped around me.</p><p>T+3:30</p><p>I slip in and out of consciousness for a half hour.</p><p>T+3:35</p><p>I fail at an attempt to play my guitar. I am tripping far too hard to actually play anything legible.</p><p>T+3:45</p><p>I leave to the restroom, as the inordinate amount of orange juice I have consumed has passed right through me.  I sit down on the toilet seat, as I do not trust my aim to successfully hit the water in the toilet while tripping as hard as I am.  As I sit, peeing, my bowels explode, and I have terrible diarrhea.  I panic and leave the bathroom as fast as I possibly can.  I nearly spiral into a bad trip, but comfort myself with more orange juice.  All is well.</p><p>T+3:55</p><p>I make the mistake of laying in my beg again, believing that 2C-E has the same temporary insomniac properties as LSD.  I am wrong, and pass out immediately.</p><p>T+7:40</p><p>I awake, rejuvenated and entirely sober, however slightly disappointed about my lapse of consciousness.  I reflect on the meaning and power of my first psychedelic experience.  Immediately, I wish to be back in my happy place again, and the thoughts of my trip remain on my mind for the rest of the day.  While the trip was definitively life changing and easily on my top 3 list of greatest experiences in my entire life, I worry that the experience was almost TOO good.  My addictive personality could easily lead me down a spiral of obsession with powerful psychoactive substances.</p>"
}
