{
 "title": "Psychedelic Energy Rush",
 "author": "CrazyInsane Insanity",
 "citation": "   CrazyInsane Insanity. \"Psychedelic Energy Rush: experience with 2C-E (ID 82843)\". Erowid.org. Mar 29, 2010. erowid.org/exp/82843",
 "substance": "2C-E",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "13 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 82843",
   "Male",
   " ",
   "Age at time of experience: 23",
   "Mar 29, 2010",
   "Views: 3380",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Substance: 2c-e and cannabis</p><p>Dose: 10-15mg. (First time trying any 2c compound)</p><p>Time of ingestion: 11:30 a.m.</p><p>Age: 23</p><p>Body weight: 125 lbs. and in great physical health (aside from a chest cold).</p><p>Prior drug experience: Most any psychedelic excluding only the more dangerous ones...including (but not all inclusive) countless shroom trips, a hand full of LSD experiments, and a couple DMT experiments), cannabis (frequent use since the age of 14), MDMA (a hand full of times over the past 2 years), Adderall (occasionally, off and on, since the age of 16), salvia extract (several times), cocaine (previously semi-heavily addicted for a period of 2 years), Seroquel (currently prescribed for 4 months for bipolar disorder), and DXM (frequent doses ranging from 200mg to over 900 mg. over a period of 2 years starting at the age of 16...I would advise through experience to stay clear of heavy disassociative abuse)</p><p>Set: Good mood, was pissed off earlier in the morning, but quickly got over it. Tired due to lack of sleep the night before (slept about 4-5 hours) and have been suffering from a mild chest cold for about a week or two.</p><p>Setting: Lake Michigan Dunes with my sober brother and his kids. Temperature in the mid 70's with a cool wind and clear blue skies. Perfect day and nicest day of the year so far.</p><p>Experience:</p><p>Immediatley after consumtion, I began to walk to the dunes (due to a closed road). After about half a mile we realized that my brother had forgotten his cigarettes in the car so I ran (literally) to the car and back while he watched the kids. I believe this set the pace for the first half of my trip. After that I walked about 1.5-2 miles to the dunes, toating children and bags the whole way, sat down for about 20 minutes, then decided to go back to the car to get more stuff I forgot. After running the entire distance back to the car I realized I forgot the keys (marijuana has definitely played a large role so far) and walked back to the dunes, listening to my footsteps echoing behind me in my head as I began to notice the first effects. I then walked/jogged back to the car again, noticing the trees, sand, and water puddles were becoming quite vivid and pastel looking. Unfortunately I found out, after all of this excessive traveling, that there was an area close by where you could simply climb over the dune (although the incline was quite steep, it cut off about 1-1.5 miles of walking. </p><p>I should also note that I did not make sure to stay hydrated throughout my travels (there was literally no place to get refreshments). Upon returning I then proceeded to carry my heavier than average 2 year old nephew up the dunes, running full speed up the hill with him in my arm. My legs hurt, but did not feel fatigued so to speak. I definitely felt an irresistable need to keep moving. Interestingly enough, I did not feel 'speedy,' I did, however, go from tired (before ingestion) to awake and full of potential energy (within 20-30 minutes of ingestion)...but did not feel speedy at all. </p><p>Despite all the senseless exercise and having to entertain children, I had a fantastic time. As for visual effects, they did not kick in until about 90 minutes after ingestion...well after I noticed a obvious rush of euphoria and energy. I saw no morphing and very little distortion, however, the colors I saw on this already beautiful day were simply amazing...the world almost looked like an oil pastel in motion. I wish I could explain the visual aspects in greater detail but it was really just an extremely enhanced perception of colors. Cannabis definitely increased the brilliant colorations, even towards the end of the trip, well after the visual stimulation had seemingly subsided. As of this point it had definitely been a very pleasent trip that I will always remember.</p><p>We left the dunes at approximatley 4:30 p.m.. Up until we left I had felt a strong euphoria. Upon entering the car my euphoria almost immediately stopped. I felt slightly 'down,' and I experienced a heavy bodyload and a mildly unpleasant physical discomfort through-out the second half of the trip...along with minimal visual 'brightening,' and some auditory distortions. I definitely felt quite off by this point. It felt like my body was saying stop, but my brain said no. I felt very tired, but it'd be expected when taking into account a lack of sleep the night before on top of a very exhausting day (note: muscles still didn't feel fatigued. They did, however, feel 'weird'). I consumed sufficient amounts of water after we had left the beach to prevent or combat any possible dehydration. I'd also like to note that I had no symptoms throughout the entire day following ingestion of a mild chest cold that had been bothering me all week. I went to bed at 1:00 a.m. with virtually none of the effects still noticable. Effects were barely noticable 12 hours after ingestion. I also consumed 50 grams of whey protein before bed to reduce muscle fatigue the following day.</p><p>Upon waking the following day, I didn't seem to have much of a hangover, with the exception of a little anxiety, which would probably be due to not having taken Seroquel the night before to avoid any possible reaction (which I came to find out much later, there isn't any...or at least doesn't seem to be). I also would like to note that although I felt tired, irritable, and quite sore, I did not feel as sore as I would've expected (probably from the protein?). I also don't think that my being tired was related to the 2c-e so much as physical fatigue and putting so much stress on my body when I already had a cold. I have also noticed in typing this that I have been leaving out words like 'it,' 'have,' etc. Don't know if it has any relation to the 2c-e, I'm probably just tired, but I read a couple reports of other writing/reading problems associated with heavy use of this chemical.</p><p>Over-all I'd say that this is a very interesting substance that I will surely try a few more times. With all else aside, I can honestly say I will always value my experience with this magical psychedelic.</p>"
}
