{
 "title": "To the Very Top Str8 Down to the Bottom",
 "author": "DJ MATT MAJIK",
 "citation": " DJ MATT MAJIK. \"To the Very Top Str8 Down to the Bottom: experience with Heroin (ID 8290)\". Erowid.org. Nov 21, 2001. erowid.org/exp/8290",
 "substance": "Heroin",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Heroin"
  ]
 ],
 "footer": [
  [
   "2001",
   "8290",
   "Male",
   "",
   "Not Given",
   "Nov 21, 2001",
   "21597",
   " "
  ]
 ],
 "report": "<p>I write this report as my warning to the use of heroin. I know it's all been heard before but I feel inclined to write this after what has happened to me. If I can put anyone off then something good would have come out of what I feel is undoubtedly the worst drug out there.  </p><p>I lived in the south east of England and got a good job in London as a web designer. I had loads of good friends, brilliant family, great car on lots of money and a beautiful girlfriend; my life was 'perfect'. I had moved up to London and came back at weekends. Me and my friends all used to go out to the pub, clubbing, get pissed, have a smoke do the usual pills; back to work Monday. I came back one weekend and my mate said he had got some heroin did I want to try some? I said no as at the time it didnt interest me at all. Over the next couple of months or so I saw how a couple of my mates were really getting into it and kept on at me to try some. They never seemed that bothered about getting any and kept saying it wasn't addictive smoking it. So one weekend we brought a couple of grams each.</p><p>My mate made a cone out of tin-foil and put about half a gram on a piece of burnt tin foil. we smoked it between the 3 of us; at first I was coughing and heaving it made me feel sick but I persisted afterwards and kept smoking. After about 15-20 tokes each I felt drowsy, really warm inside. the biggest thing I noticed is that normally I am such a worrier and sit there thinking and worrying about things constantly from work to my girlfriend but on this over the weekend I didn't worry once about anything. So that, in my opinion, won me over and the next couple of months I was doing it every weekend I came back from work. I started not being bothered about going out or anywhere. I was happy to get some gear and stay in, which is really unlike me. I really liked the warm feeling it gave me and the self assurance inside. I could tell my girlfriend was getting worried about me and I started to take quite a bit back with me every week. One morning at work I went into the toilet at work for the usual morning toke when the person who I beat to a promotion came in and caught me red handed; the fucker reported me. I denied it of course when accused but I was told I would have to have a urine test. Over the next week I knew I was fucked so I started using more and more to block it out and stop worrying but inevitably the results came back positive and I was sacked. I was gutted and ashamed of myself.</p><p>I moved back home and over the next month the money ran out fast and I had found out my dealer had got busted. Over the next week I started aching all over especially my bones in my arms and legs. I couldn't sleep at night was extremely restless vomiting, hot and cold sweats. I found a new dealer before long but money was low. I knew my mum and stepdad were pretty well off and started taking her card and withdrawing money once a week to pay for the gear. She found out a lot quicker than I had anticipated. I felt so ashamed but had to keep getting gear. I knew my dealer took things like electrical goods etc, so over the next couple of months I took my mums video camera, sold all of my stuff in my room tele, stereo, video, my beloved decks but it only kept me going for a while. I had started to get final warnings over payments for my car (over 3 months behind) so I sold my williams clio for a silly price to keep up my gear habit. When the bayliffs came round to take my car there was no car to take; then I was in big trouble. But I still didn't learn. I think the lowest point was when I stole 300 off my nan. I just wanted to kill myself and started looking at that as a real alternative. My mum kicked me out and I moved in with my  girlfriend; she told me to get some help and after 5 months on a waiting list at a clinic they put me on 30-40mg of methadone a day. I had everything only 9 months ago now have just my wonderful girlfriend. I have just got another job doing the same job on pretty good money through my mum. She has given me a chance to prove myself which I shall do. I have hurt the people closest to me when they were trying to help me. </p><p>Im starting to put my life back together again but I know Im addicted forever and will probably always crave it but as they say you have made your bed so you have to lie in it. I paid a big price for the big H. I know no one will listen but I believe doing it all the time will always end in disaster ALWAYS.</p>"
}
