{
 "title": "Riding The Spiral",
 "author": "jsn",
 "citation": "   jsn. \"Riding The Spiral: experience with Salvia Divinorum (ID 8294)\". Erowid.org. Aug 10, 2004. erowid.org/exp/8294",
 "substance": "Salvia Divinorum",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8294",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 10, 2004",
   "Views: 6232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After a of couple mild sessions with the Shepherdess, I decided I was done screwing around and would try out my 5x supply. Experience with shrooms, LSD, and lots of reading on the Salvia subject, gave me a sense of preparation for the journey. </p><p>This proved to be incorrect. </p><p>I packed a homemade water bong with a wee little pinch of plain dry leaf, and poured in a previously prepared capsule of 5x leaf: 1g separated into 16 equal parts and put into empty gel caps.</p><p>I was alone (not recommended) and prepared my self mentally by doing some breathing exercises and playing soft music. When ready, I dimmed the lights and took a large rip from the bong, holding the smoke in as I lean back on the couch. </p><p>I could immediately tell that this was going to be the 'real deal', and as I exhaled I closed my eyes. The first few moments (seconds) came on like a surging, washing, energy wave of green leaves and spirals. Then I was gone. </p><p>My sense of self disappeared, and I had no idea who I was, where I was, when I was, or how I got into such a state. A (brief) moment of fear came falling in, and I opened my eyes, as if to save myself. This did little more than confuse the situation. My living room was gone, and replaced by a fractal vision of leaves and vines, swirling in an infinite spiral. I felt as if I was apart of this spiral and as it churned and turned it pulled me with it. My body tingled with energy (seemingly underneath me) and at that moment I noticed trillions of little eyes embedded throughout the vine. Their presence was overwhelming but fleeting. Not hostile, just observing, as if to say, 'you only thought you were a human being, but actually you're a plant that dreamt it was a man' (This soon passed.) </p><p>After another moment or two, the room started to materialize before me, and I finally realized that I had smoked Salvia and it would be over soon. My mouth and eyes were gaping wide open, so I closed them both and rode it out. During this time, thousands, if not trillions, of thoughts were running through my mind. It was very difficult to grasp onto any one concept. </p><p>The music I had playing came washing back into focus, and it was then that I had the sensation that the whole journey was being guided by it. It was as if the Salvia broke me into singular atoms, and threw me into the realm of energy/frequency. </p><p>Several more mild moments passed and I clicked on a light to try and make sense out of what had just happened. </p><p>The journey was very overwhelming, but not scary. At no point did I feel compelled to freak out or get up. In fact, I don't think I moved a muscle. It is a state of consciousness like nothing I have ever experienced. And certainly not something to be taken lightly. But I will go back. That is for sure. Salvia is a very wise plant, and has much to tell us. </p><p>That is if we are bold enough to ask. </p><p> ~ As a side note, in all of its intensity and oddity, something seems so familiar about a Salvia journey ~</p>"
}
