{
 "title": "It's What's for Dinner",
 "author": "Coirage",
 "citation": "   Coirage. \"It's What's for Dinner: experience with MDVP (ID 82988)\". Erowid.org. Sep 14, 2010. erowid.org/exp/82988",
 "substance": "MDVP",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "MDPV",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "82988",
   "Male",
   " ",
   "32",
   "Sep 14, 2010",
   "13259",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hi there an thanks for reading. I am writing this report at the end of my experience with MDVP. This is a very very interesting drug. What I can say for certain is that it shares properties with most stims but that being said it effects everyone differently. First off I must advise this drug is stronger then my will power. Seriously it very moreish. I have consumed .06 over the last two days.  when i say .06 I mean .6 of a Point [gram]. I really don't need this much for this drug, really a few flecks will do me and keep me pumping for 2+ hours. I have been dosing with tiny tiny amounts for the last 48 hours the only side effect I have found is lack of appetite, cravings, sore muscles and utter boredom. DO NOT DO THIS DRUG ALONE!</p><p>Also of note is increase heart rate (I can feel it) don't push yourself. I don't want to dance either, but I'll want to talk and talk and talk. I have some lab rats that are using ATM and effects are varied, some get horny, some don't, some can eat, some cant.</p><p>***</p><p>Important part: The 'I WANT TO SLEEP BUT CAN'T' is the worst bit, I will require 1) Booze (a shot of spirit will be good) 2) Any benzo.  I will be using 5MG Xanax</p><p>***</p><p>I believe this drug to be very very addictive, please only purchase in small quantities. Once I did that first line it was very VERY hard for me not to do another and another. If i was to recommend a dose size it would be 0.005g - I know that sounds weird but it is the truth, a little bit goes a long way.</p>"
}
