{
 "title": "Drifting",
 "author": "Wally",
 "citation": "Citation:   Wally. \"Drifting: experience with Morning Glory Seeds (ID 8301)\". Erowid.org. Feb 17, 2002. erowid.org/exp/8301",
 "substance": "Morning Glory Seeds",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "185 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8301",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 17, 2002",
   "Views: 6795",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nA friend and I were determined to trip but had no access to shrooms or cid. So morning glory is the way we went. We ate our seeds around nine in the morning. We took low doses so that we'd be sure to be down and back to normal by the time we'd have to deal with our parents.\r\nStage one of the experience was sick as fuck. I threw up thrice and my friend threw up twice. We felt pretty shitty but shortly after the final pukings and about halfway throug our jolly wake - up bowl we started feeling pretty good.\r\nIt felt like acid setting on, except this: in the past when I've tripped, smoking pot wouldn't get me stoned. Instead it would bring me back from wherever I'd gone out to. It would chill me out and rejuvinate the trip. On morning glories however, I felt simultaneously stoned and tripping lightly. I experienced the jumbled mind I associate with being stoned, and at the same time had somewhat of the sense of clarity and infinity I feel while tripping. I wanted the pot to wear off. \r\nI tried to play my guitar for a little while, which didn't really work out, so I stared at a peace sign sticker on my guitar case and hallucinated a little bit. This didn't really satisfy me. I'm yet to have a trip where I'm content with just sitting. My friend on the other hand was having just this. She was laying on her couch, occasionally laughing or shouting or saying something. \r\nI put on two c.d.s in different rooms at similar enough volumes that they'd mesh together where my friend was laying. She seemed to appreciate this. Meanwhile, I was too damn bored. The pot had worn off and I was not tripping. A little less than two hours had passed since we'd downed our seeds. \r\nI refer to the state that the morning glory induced in me as drifting. My best definition of tripping is moving along from one pursuit, mental or otherwise, to the next. The mindset I was experiencing at this time was quite similar except way less intense.\r\nI decided to go for a drive. I drove across town, got some gas and returned. In the course of my drive I bitched a little bit about how I wasn't tripping, how what I was experiencing was a tease, but I came to terms with it. I was feeling a bit more free. My mind was swimming a little bit. I decided that this would be a good substance to do in school perhaps, provided I took them early enough in the morning to get the sick stage over with at home. I functioned and communicated well enough to get through the day.\r\nWhen I returned to my friend's house she seemed to be pretty much done with her 'trip' as well. Later on in the day, I went downtown and though not really feeling high in anyway, it was apparent to a few people who knew me that I'd been up to something. I was supposedly sweating profusely and had flush skin. I didn't really feel sick, just way out of it. We smoked several more times in the course of the day. The later few times returned me to my quasi-tripping state.\r\nIt was fun. It wasn't particularly enlightening, though I don't doubt that it has those capacities. I'd recomend them for anyone up for an interesting experience.\n\n\n"
}