{
 "title": "Intense Psychedlia",
 "author": "Knock",
 "citation": "   Knock. \"Intense Psychedlia: experience with 2C-P (ID 83066)\". Erowid.org. Jan 21, 2010. erowid.org/exp/83066",
 "substance": "2C-P",
 "bodyweight": "56 kg",
 "header": [
  [
   "DOSE:",
   "14 mg",
   "oral",
   "2C-P",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 83066",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jan 21, 2010",
   "Views: 10059",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My setting for this trip was my house and I was on my own. Previous experience with psychs include lsd, mushrooms and 2c-e. my goal was to enjoy life for the next 10-16 hours.</p><p>T+00:00 Ingested 14mg 2c-p dissolved in water.</p><p>T+01:30 First visual distortions noticed.</p><p>T+02:30 Prevelant OEVs, some colours; pinks and greens.</p><p>T+03:00 My whole body is positively electrified, heavey OEVs, approaching full effect now I'm in my bedroom swaying back and forward and the whole room is moving with me. I go downstairs, turn on the tv and peoples faces are melting...turn off the tv.</p><p>For the next 6 hours I am pretty much incapacitated by intense psychedlia. I keep telling myself not to downplay this experience and then I would tell myself not to overplay it. I have never been so overwhelmed by a drug. I attribute the intensity of the experience to the bodily sensations as much as the hallucinations. I am almost constantly hit with intense rushes of trippieness. </p><p>At one point the hallucinations were pretty scary and I found myself thinking I was going to fall into a 'bad trip'. I never thought I could have a bad trip because its never the trip thats bad its the state of mind. I was ok, I wasnt having a bad trip but I felt I could  lose my head if I wasnt careful.</p><p>T+09:00 The intensity is finally subsiding. Over the next 6-7 hours the visuals wind down.</p><p>T+16:00 Still slightly tripping. My face and the top of my chest are still electrified. Still getting occasional body rushes. This drug is overstaying its welcome. For the next 4 hours I have an annoying tension in my face as though Its the last place for the drug to leave my body.</p><p>T+20:00 I pass the 20 hour mark and I can still feel the twang of chemical in my body but I eventually fall into a restless sleep.</p><p>I got up after about 5 hours sleep still worn out from the experience. I was looking for a bit of intensity with this trip when I decided to take 14mg but I got more than I bargained for. Would I take this substance again? Not in a hurry but if I was I would definately not take this much.</p>"
}
