{
 "title": "Keep well Clear of This Shit",
 "author": "Sheffer",
 "citation": " Sheffer. \"Keep well Clear of This Shit: experience with 4-Methylmethcathinone  (ID 83111)\". Erowid.org. Apr 30, 2010. erowid.org/exp/83111",
 "substance": "4-Methylmethcathinone ",
 "bodyweight": "82.5 kg",
 "header": [
  [
   "DOSE:",
   " repeated",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2009",
   "83111",
   "Male",
   "",
   "46",
   "Apr 30, 2010",
   "9206",
   " "
  ]
 ],
 "report": "<p>I had taken ecstasy (along with a whole load of others, heavily, for around 12 years so have quite some experience of these things. I had left london 3 years ago and not taken anything since then, being in a new job which I enjoy. I had read lots of positive things about this substance (not counting compulsion, which I ignored) and thought it would be a 'Christmas treat' after my abstinence.</p><p>I ordered 4g in total, and finally, 48 hours later in a brief interlude of clarity, I threw the remainder down the toilet. I would otherwise have continued doing one line after another, completely driven by this chemical. My nose was bleeding, my throat was dry and sore, I had a pounding headache right at the base of my skull, but I was still being driven to 'have just another line'. There is a persistant sensation that I have not quite reached the peak of the experience and 'just one more line' will do it. IT WON'T!</p><p>This substance is all mink coat and no knickers, all promise and no delivery, leaving ME wanting more and more. Its like I am starting to come up on some of the best 'E', but then it stalls as though I have not quite had enough to reach that peak. I NEVER WILL HAVE ENOUGH!</p><p>I'm not saying it is addictive, I certainly have no desire to ever touch the stuff again. But it is compulsive in the extreme, and once I start taking it, I am not going to stop until its all gone, and I will still not have been 'really' high. I had a nose bleed and headache for three days and a depressive comedown of 5 days. The toxicity of this substance builds and builds as I chase the high I will never achieve. It is just a big letdown. My advice is stay clear of it.</p>"
}
