{
 "title": "Acid Rain",
 "author": "Starrness",
 "citation": "   Starrness. \"Acid Rain: experience with LSD (ID 83138)\". Erowid.org. Nov 9, 2012. erowid.org/exp/83138",
 "substance": "LSD",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 83138",
   "Female",
   " ",
   "22",
   "Nov 9, 2012",
   "Views: 6900",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I first tried LSD about 4 months ago. And I haven't tried it since. </p><p>In the past I have been a regular pot smoker, LOVED mushrooms, done coke 3 times, crack once (and never again), and a number of different painkillers etc. I tend to be experimental but not a habitual drug user. (Other than alcohol and every now and then pot)</p><p>It all starts with me getting off work at about 3 am. I headed from work over to a friends house to hang out.. We ended up drinking. Well I got pretty smashed, and drove home around 9 AM after my boyfriend called me wondering where the hell I was. (he didn't know that I was at a friends house and had expected me to be home when he woke up) When I got home I was acting pretty stupid, being drunk and all.. And they told me to just go to bed. Well I was a bit too revved up to go to sleep so I hung around the living room. Next thing I know my boyfriend told me he was going to take the acid we had bought a couple days ago...  So I said 'Me too!'</p><p>He thought this was a little strange because I'm usually very hesitant and nervous about taking new drugs especially because I have really bad anxiety and tend to freak out even if I get a little too high... BUT I was intoxicated and had a 'What the heck why not' attitude. I strangely had no reservations about this... So he hesitantly said ok.. And put the tiny square on my tongue... He took one, and we also gave some to my room mate. After leaving it on there for a while I took it off and threw it away, or I may have swallowed it I cant remember. I think at this point I decided it would be a good idea to get out my art supplies and start painting. I don't really have a good perception of how long it took to kick in because it was a very slow process... I slowly became more euphoric and I was still a little drunk and now feeling a little high. I ran into my other room mates room and told him to wake up because things were so crazy and awesome cause we're tripping on acid and he's like wtf? I think around this point (after sitting around and talking and waiting) I decided that the acid just wasnt working good enough for me so I took another hit.. This time, I put it on my tongue and immediately (accidentially) swallowed it.. I realized that I wasnt really aware of my tongue. </p><p>So I went back into the living room and started pouring paint all over this huge canvas. Every color I could think of... The sun was shining into the balcony window onto the painting and the colors were extraordinarily bright.. I shoved my hands into the paint and began swishing the colors around.. I felt like a child I was giggling and dancing around covered in paint.. I got my boyfriend to help me... I felt like my eyes were HUGE as I kept staring at the colors... </p><p>Finally I washed my hands and my room mate who also did the acid suggested that we go buy some food. Food? Why would you have a desire to eat NOW? I was confused, but decided it might be fun to leave the house. So we went... About the time that we pulled up to the store I started tripping a little harder... The trees outside the window felt like they were trying to get me, like they were reaching into the window and grabbing at me. I told everyone that the trees were trying to kill me and they thought it was funny... So did I.... </p><p>So my room mate who did acid and my room mate who I had woken up (who was driving and NOT on acid) went into the store while I sat in the car with my boyfriend. My boyfriend asked me if I was ok.. And I just remember I kept saying.</p><p>'Yeah......' Really quiet and slow. </p><p>I decided that I had to get out of the car now.... So my boyfriend came around and helped me get out of the car.. Standing was strange.. So was walking.. It was like I was floating and sinking into the ground at the same time. We started walking around the building.. I can't tell you how many times we walked in circles around this building... I was very quiet.. I was somewhere else.. I couldn't speak. It had also begun to rain. (it had turned into a very cold and dreary day and then begun to rain) about the 3rd time we circled to building (and the people in the movie store started looking at us weird) We came around to the back side where there were two dumpsters. I stopped dead in my tracks ..I felt like I was standing there horrified and gawking at the ground.. There was a river of red water coming out from underneath these dumpsters... OMG... Something is dead in there... I couldnt stop thinking.. I imagined there was a dead person.. Or maybe animals dead inside this dumpster and the rain was washing the blood out of it and into the drain below... My boyfriend interruped the thoughts after I stood there for a minute and he was like ... </p><p>'you OK?' </p><p>I said  'yeah.... '</p><p>I told him what I was thinking and he told me it was just the rust from the metal washing off in the water.. (does that actually happen?) So by the time we are back to the car I've decided im full blown tripping.. I cant speak anymore, I'm so very far away and everything is very strange... Life is so strange... I'm distant and confused. We're driving along and as I'm looking into the sky I see these intense visuals.. These kaliedascopes of colors swirling and dancing and pusling.. I shout 'OMG, They're real! Its true!' My roomate asks me what is real, I tell him about the designs im seeing and he said yeah, where else did you think they came from? I thought that people were just making those psychadelic pictures up... That it was just their was of interpreting their feelings... But anyway... We get home and when I get out of the car I feel like I sink into the ground.. I can't wait for a minute.. Suddenly I feel so very small.. I feel small and as I continue walking I get bigger and bigger (I may have actually been walking crouched over and slowly standing up, I couldn't tell if it was the acid or me) </p><p>Finally im back to normal size.. We head up to the apartment and I go inside.. I don't eat the sandwich they got me I just lay on my bed.. So does my boyfriend... We aren't talking.. He keeps asking me if I'm ok... Which freaks me out because I think 'do I look like im not ok?' and he said he was just worried about me.. </p><p>At some point I looked into the mirror and became extremely interested in my eyes.. One pupil so much larger than the other... I asked everyone if they really were two different sizes or if I was just seeing things.. They were tripping too so I couldnt get a straight answer.. While looking in the mirror I discover a sore on the inside of my lip. I ask my boyfriend what it is.. He said its probably just some kind of ulcer... I ask him what causes that and he tells me bacteria... Then, when he says the word 'Bacteria' I get this halarious visual.. Of a little man (and some buddues) in a green sweater and cap sliding down my tongue and in a high pitched voice shouting 'Bacteria!' So I get really creeped out and start brushing my teeth to get rid of the 'Bacteria' As im brushing my teeth im imagining the little green men being squished under neath my tooth brush.. It bothers me a little bit but I keep brushing because the idea of little fat men in sweaters inside my mouth creeps me out even more... </p><p>The rest of the night is a blur... But this is were a lot of the worst stuff happens. It goes from being slightly strange but interesting... To downright unbearable. After taking a beautiful walk outside in the rain and picking up some amazingly colored fall leaves on the path I come back inside and lay down. I spent the next 6-8 hours laying in my bed.. Periodically, me and my boyfriend got into the shower in order to feel more comfortable.. I couldn't sleep... My entire body felt like it was dying (possibly some sort of hangover effects being made worse by coming down off acid) My room began to feel like a prision.. I started having this seriously overwhelming fear of being an inanimate object. I tried to stop myself from thinking it... I didn't want to go that far away... Images flashed in my head but they didn't make any sense... My entire brain was jumped up. I laid in bed, unable to sleep, feeling as if my brain was a circuit board and someone was systematically unplugging input cords and shoving them carelessly into the wrong holes.. Every time something was put back the wrong way I'd feel like that hole would then become fried and unusable.. I was horrified...</p><p>My brain was being rewired and wired again.. Over and over and over and over and over... Time was lasting forever, I thought I would never be the same again. As I was laying there staring at the ceiling (but not looking at the ceiling) I felt as if my body parts were being taken off and then put back on the wrong way, like my legs and arms were laying at odd angles, twitching and working incorrectly. Every time these thoughts became unbearable and I thought I might freak out I went into the shower and sat there for a while.. We must have taken like 6 showers that night. </p><p>About 12 hours into the trip I was done with it, I wanted it to be over so bad... But it was like a strange and horrifying show that I was being forced to watch over and over again that made less and less sense every time. I had this terrible fear that the acid was destroying my brain, that it was re-wiring my brain the wrong way and that I may never be normal again.. Nothing felt right anymore. I felt alone, god didn't exsist... I was a cold and useless robot or computer progam that had just been struck with lightening and fried, or had just contracted some kind of trojan virus... I felt a lot of remorse. I started taking sleeping pills.. I just wanted to go to sleep. 16 hours after my first hit (and 26 hours since I had last slept) I finally fell asleep... Leaving being the cold icy stare of my bedroom and the items within it... </p><p>I woke up the next day and my anxiety was pretty terrible.. I still felt like I wasn't the same.. Like something still wasn't right... It took me about 3 days to feel slightly normal again... But until this day I know that something changed in my brain that night... And I don't know what it is.. But it was something that was perfectly fine before.. And now its slightly wrong... I wish I could explain it... Every now and then for no reason.. (I know there is a trigger but im not sure what it is) I will just stop and zone out for a second and that feeling returns... Almost like my brain skipping a beat or a glitch... And I just don't feel right... But I can usually come back from it... I just feel like something is missing... </p><p>*sigh*</p><p>I don't know if I'll ever do acid again.. I have strong feelings about doing man made drugs.. I prefer all natural drugs, un-tampered with. I feel like acid was made to rewire or even destroy the human mind. (and not rewire for the better) Perhaps its in the eye of the beholder but I lost something about myself that night... Im not sure what it is, but I'd give up the trip experience to have it back. One good thing that happened after the trip... I wasnt able to have a single cigarette during my trip AND after my trip.. It took my almost a week to get over the repulsion I had when thinking about cigarettes.. On my trip I thought they were super disgusting and that if I smoked one, I'd puke... So prehaps the drug has the ability to help with quitting smoking?  But my only suggestion is that people be careful about their surroundings while tripping.. Whatever you see/hear/experience on acid is more likely to get stamped on your mind. I listened to a music video by Cradle of Filth (I dont usually listen to that kind of music) while at my peak of tripping and I swear to god the song kept playing in my head over and over again for the remainder of the trip.. And that must have been well over 5 hours of 'nymphetamine' playing in my head... It became torture.. Even though I kind of like the song...</p>"
}
