{
 "title": "Empathy, Synergy, Energy",
 "author": "Logan",
 "citation": "   Logan. \"Empathy, Synergy, Energy: experience with LSD & Cannabis (ID 83142)\". Erowid.org. Dec 15, 2013. erowid.org/exp/83142",
 "substance": "LSD & Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   " ",
   "LSD",
   " ",
   "  repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 83142",
   "Male",
   " ",
   "20",
   "Dec 15, 2013",
   "Views: 637",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Author's Note</p><p>It should be noted that several stages overlapped and intertwined, and this should not be seen as a strict chronological ordering of the events, nor should a described 'stage' be seen as an exclusive event unaffected or unrelated to the other 'stages.' While certain periods of the trip were marked by specific characteristics, short-term memory was heavily affected for the majority of the trip (though the trip as a whole remains very clear in my mind). Restlessness and an inability to concentrate were also constant symptoms. The initial stages were marked by intense excitement and energy, while the later stages tended to be more clear-headed and somber as they tapered out into sobriety.</p><p>Ingestion</p><p>I, along with seven others, ingested the acid around midnight. I took two hits, which it turns out was likely overkill, as those who took a single hit appeared to experience effects nearly identical in nature and intensity. I ingested the acid by chewing the two pieces of blotter paper thoroughly before swallowing.</p><p>Emotional And Psychological Effects:</p><p>Euphoria: The initial effect, felt about an hour or so after ingestion, is a strong euphoria, and I find that I'm much more prone to giggling than usual. An individual who took a single hit reported no noticeable effects at this point, while I and another who had two hits make eye contact and instantly giggle.</p><p>Fizzling Out: The next stage was characterized by moments of clear-headed sobriety and clear speech that quickly dissolved (within several minutes, perhaps no more than a minute) into illogical thoughts and mindless babble, which I described as 'waves of feeling like a 4-year old.' While this retrogression was at first unavoidable, we later found that, with intense concentration, we were able to maintain the clear-minded state for much longer. We were eventually able to maintain this state indefinitely, save for occasional explosions of excitement that caused us to momentarily revert to an illogical state.</p><p>Collective Emotions: The first few hours of the trip were characterized by intense excitement. While the ego persisted, emotions were shared at the group level. Conversations filled with fits of laughter grew in intensity until they peaked, and an 'excitement explosion' occurred, which I likened to a 'joy grenade', as these eruptions cause so much excitement that the group instantly scattered, as if a grenade had been thrown in the center of our group. After such an explosion, it was extremely difficult to recall the cause of all the excitement, and it was as if we rebooted. Triggers for these explosions included a metal tub we had been joking about falling from the wall, and me jumping atop a chair during a conversation. This pure emotional empathy was also noticeable as I traveled between smaller groups, feeling myself drawn in to the given emotion of that group, be it the somber and depressing mood of a friend who was struck with the meaninglessness of existence, or the tranquility felt by those listening to Marley in a room with the lights off.</p><p>A Very Long Conversation About Nothing: This stage was characterized by a feeling similar to having something on the tip of one's tongue. Instead of searching for a word we understood but could not vocalize, we were wracking our brains in an attempt to complete the statement 'acid is...' Another accurate analogy is trying to solve a puzzle. Due to the destruction of our short-term memory, as well as the wide range of experiences evidenced by this writing, we were never able to come to a conclusion. This search seemed to be the focus of our conversations for some time, and the end result was a very long conversation about nothing. It may well be that the acid simply created a mental clog that we were trying to work our way around, and there was no real question or solution.</p><p>Communication Breakdown: We realized the unimportance of the topic and content of our conversations, and understood conversation as a much more basic and primal thing, existing to build social bonds between hairless apes. As I stood watching the other members of the group interact with one another, their words faded out and I felt like a scientist watching monkeys, who chattered to one another because they are wired to be social mammals (it was also quite evident who the talkative 'leader' types were, and who preferred to listen). I simplified the feeling as 'I am a human. Interacting', the analogy being simple robots using the simple command prompt 'interact' with one another. During this stage we would often begin sentences, realize the irrelevance of what we had planned to say, and trail off into 'blah blah blah'- or 'yadda yadda'-type vocalizations. Interestingly, the other members understood, and treated the sentences as if nothing were amiss.</p><p>Hivemind: While we had previously experienced emotions shared by the group as a whole, it was not until later that the ego truly ceased, and the feeling of individuality was dramatically lessened. It was as if our brains, being closed circuits, had linked up and formed a continuum. I felt acid had reverted our minds to a more basic, pure state, unadulterated by the unimportant bits that describe an individual. I felt that our identity was now at the level of the group, rather than the individual, similar to how a colony of ants might be more accurately described as the basic entity, as opposed to any specific ant. When I found a cup of sweet tea in the kitchen, I realized I had personally not poured it, but felt as though I was but an extremity of a whole organism, and 'whose' tea it was was a nonsensical question, as 'we' had poured it and 'we' were consuming it. All this is not to say that we had reached complete ego death or lack of all individuality. For example, we retained our own personal musical interests, but due to the intense empathy we chose a very neutral music to listen to so as not to favor one's interests over another's. Due to this being my own subjective account, I cannot with complete certainty say that everyone felt as connected to one another as I did, so it is possible that their experience varied from mine, and the hivemind did not extend beyond my own.</p><p>The Marley Room: We turned off the lights and put on a Bob Marley & The Wailers album in the den, effectively creating a separate world filled pleasant vibes and no worries. While in this room I felt as if I were truly living for the first time, as my mind was absent of thoughts not pertaining to the emotion and enjoyment of the present. Due to my inability to concentrate or stay immobile for very long, I traveled between this room and the rest of the house. However, when I moved to another room and spoke to those in other rooms, the euphoric vibes remained in the den (due to the external conditions in the room), and I returned to a somber state. I immediately forgot the room, had I not I would have immediately returned, but I was drawn in if passing by. Whenever I returned to the room it became evident that I would be living in the moment and riding the emotional waves around me regardless of where I was, and I could either choose to endure a somber, almost depressing state, or make the most of the present and enjoy the moment fully in our own paradise, removed from the rest of the world. As a note, we listened to the album repeatedly throughout the night, never changing the music.</p><p>Obsessed With Cleaning: While Marley was playing in the other room, I was often elsewhere in the house, intensely obsessed with cleaning. This is not to say that acid causes one to enter a cleaning frenzy, but that it amplified my latent worries and stress and, due also in part to the hyperactivity it could often create, caused me to become irrationally focused with keeping the house clean. This is because I was the host, my clean-freak father returning in a few days, and nine individuals in your house tripping on acid can create a bit of a mess, which I was eventually responsible for cleaning. The focus, dedication, and thoroughness with which I cleaned was quite similar to how Adderall or a similar amphetamine might cause me to compulsively clean, though I felt worry, stress, and responsibility as opposed to the enjoyment amphetamines give to this mundane task.</p><p>Beyond the very early stages, acid did not affect how clearly I was able to think, and I felt very much like myself. However, in the later stages this sober-mindedness was particularly keen, so much so that I even felt more sober and clear-headed than I feel when actually sober. I saw myself, life, those around me and their interactions in a very objective and unemotional way, far removed from the intense emotion felt at the beginning of the trip. I was a mammal who ingested a substance that affected the chemical pathways of my brain, producing novel affects. Life had no real meaning and our actions, decisions, and conversations were entirely unimportant, as were we, being strings of organic molecules. These were not necessarily negative things, they were simply objective observations that were not, and could not be, positive or negative. These were beliefs that I do actually hold, and though I had believed them before this trip, I had not fully realized or evaluated them. On a normal day, one often has much in their mind, mostly useless information and thoughts that clutter the brain while we run, to some degree, on autopilot. However, that night I felt as if the autopilot was off, my mind was crystal clear, and I saw the world around me in a much more objective and impersonal way. It should be noted that, as this was near the end of what I would define as the 'trip', it may be that it was not a true stage of the experience, but rather sobriety budding through the lingering effects of the acid. It should also be noted that I felt like an objective observer at other points in the night, points at which others were having a very emotionally-driven experience.</p><p>In Conjunction With Marijuana</p><p>Though we smoked many, many blunts throughout the night, the marijuana never caused me to feel any different than I had before we smoked. It was as though the acid trumped any effect the weed might have had, and thus the blunts were unable to produce any noticeable effect. This persisted well into the following day, long after the effects of the acid had last been felt. Interestingly, while another member was as unaffected by the marijuana as I was, several members were able to get high by noon the following day. The number of acid hits taken appeared to be unrelated to whether or not one could feel the effects of marijuana at this point. As a side note, unrelated to the combination of the two drugs but relevant to the effects of the acid, we expressed little concern over whose turn it was to hold the blunt, as well as a lack of concern over the ownership of the several bags of weed present at the house. Our attitudes toward this otherwise precious commodity can best be summed up as rather communist.</p><p>Visuals</p><p>Visual hallucinations were more minimal than expected, though I suspect I could have experienced more visuals had I tried. Most members of our party reported no visuals at all. I've found it's easiest to experience visuals in dimly-lit environments, as your mind has to do more guesswork with what exactly you're looking at. Other than some minor, standard growth/pulse type visuals (where objects and surfaces appear to be expanding, or moving towards/receding away) my hallucinations were limited to the following three experiences:</p><p>Dancing With The Christmas Tree: While staring at the strangely-lit Christmas tree, ornaments and limbs swayed heavily, as if affected by a strong breeze. I realized I could control how the tree contorted by bending my arms and body while standing in front of it, and likely made a fool of myself by dancing with a tree in my living room.</p><p>Tracing: While a friend spoke to me, he made various gestures with his arms. Every time his arms moved, I saw trails that traced the paths his arms had taken. These trails were so pronounced, constant, and distracting, that I asked him to keep his arms still while speaking, as frankly it was making me uncomfortable.</p><p>Paint Simmer: While sitting in the kitchen, I began to stare at a paint stain on my jeans. The stain began to contort, melt, and generally change size and shape. The effect was similar to mirage water on a hot roadway.</p><p>Physical Effects:</p><p>-dryness of the mouth</p><p>-tension in neck and shoulders</p><p>Some Notes from a First Time User:</p><p>-Our blotter paper wasn't a vibrantly-colored image of a cartoon character, but came on a standard note card.</p><p>-The effects weren't immediate, and took an hour or two to set in.</p><p>-Remaining in a comfortable place to trip once we took the acid was important. Tripping out behind the wheel of a car was something we were happy to avoid.</p><p>-Being cool on acid in public situations and around the general populace weren't as easy as I'd thought.</p><p>-We took it at midnight, stayed up through the night, and had obligations the next day that definitely were not as pleasant as sleep would have been.</p><p>-We were a bit compulsive with our smoking, and subsequently wasted a lot of weed that could have actually got us high on another day.</p>"
}
