{
 "title": "Flatlined Beyond Comprehension",
 "author": "jimmywoo",
 "citation": "   jimmywoo. \"Flatlined Beyond Comprehension: experience with 4-MTA (ID 83154)\". Erowid.org. Apr 30, 2010. erowid.org/exp/83154",
 "substance": "4-MTA",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "4-MTA"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 83154",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Apr 30, 2010",
   "Views: 11229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe day to end all days it seemed. An experience I was NOT prepared for. Having little money at the time I bought this cheap Flatliner thinking that the media hype surrounding its potential to kill was just well, hype. I WAS WRONG.\r\nI take the pill\r\n10+ I am waiting for the pill to kick in. As I have an empty stomach I expect that to be anytime soon.\r\n30+ Still not happening for me, I feel agitated and cheated.\r\n45+ This is still not working, I can't believe this s***\r\n1 Hour after ingestion- BOOM\r\nIt happened; my world became another planet. I was 2 people talking to each other. I was a cartoon character. I was on another planet. I was screaming inside my head but couldn't talk properly. I ran desperately around to try and get the experience to end, my mind was ruined. I knew I had gone too far taking this drug. I was seasoned with amphetamines and psychedelics even ketamine I can handle, but this was beyond recognition, beyond comprehension. The world became a place that was filled with good people, but I was most certainly not one of them. I was an alien in a human disguise. What if the fellow people knew? If they didn't know they would most certainly find out. I could hear voices telling me I was going to die and that I should probably end it all. I was sweating like a PIG. I felt like I couldn't breathe, everyone else was breathing air. But air wasn't right for me, i needed another gas. God I felt lost. God was telling me I was.\r\nThen the nausea, I was sick off this drug. Constant vomiting and dry heaving. My body felt ruined. I can't put a timeframe on this, time had melted away a long time ago as far as I was concerned. But slowly I remembered who I was and left for home on the bus. When Planet Earth beckoned I started to feel a mild amphetamine effect. Speedy and relieved that the whole experience was over. I still count my blessings to this day I didn't die from this. \r\nIn my opinion this is not a drug to be messed with. Its negative effects seem to outweigh any positive attributes. However if you like to lose you sanity then go ahead. I doubt very much that labs produce this drug anymore.\r\n[Reported Dose: '1 Pill-160mg']\n\n\n"
}
