{
 "title": "Not In a Hurry to Try It Again",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Not In a Hurry to Try It Again: experience with Toad Venom (ID 8321)\". Erowid.org. Dec 16, 2001. erowid.org/exp/8321",
 "substance": "Toad Venom",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Toad Venom",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8321",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 16, 2001",
   "Views: 26637",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I did little to prepare for the experience that was to come. Everything went as it normally did that day. I did however take a minute to sit down before hand and gather my thoughts and try to relax. I was kinda of nervous not knowing what to expect but anyway on to my experience. </p><p>I dropped 4 to 6 pieces of dried toad venom ranging in size from that of a match head about half that into a test tube. I then turned the test tube horizontly making sure to get all the pieces in roughly the same are at the end of the pipe. I then applied a jet flame lighter that has a blue flame to the underside of the testube under where the venom lay. I waited until it began to burn and crackle and then smoke began to fill the tube. While keeping the flame going I inhaled all of the smoke in the testube (probably too much) in one complete inhalation. Almost immediately I began to feel the effects. I felt as though I had fucked myself this time but then said to myself it will be over soon so try and enjoy it. </p><p>I layed back on my bed and although I had no significant visuals my vision was different than normal. It was tunnel like with things slightly blurry and static like if that makes any sense at all. Physically it felt as though I was begin catapulted at a thousand miles an hour and could do nothing to stop myself. My teeth were on the verge of chattering when I heard one of my parents  I started to freak out so I moved downstairs farthest away from them and sat or laid on the couch endured the rest of the experience until it began to subside at which point I began to walk around and felt my legs to be kinda of shaky and weak. I did however have a pleasant after glow to the whole experience. </p><p>I felt kinda of lucky I had experienced 5-MeO but was not in any hurry to try it again anytime soon. I would not say I really enjoyed my experience nor did I regret it. I would say however that it is something to be approached with caution. As one person's experience could be very different from the next person's.</p>"
}
