{
 "title": "Slowly Ruining My Life",
 "author": "ALkaHoLeKz",
 "citation": " ALkaHoLeKz. \"Slowly Ruining My Life: experience with Methamphetamine (ID 8323)\". Erowid.org. Feb 8, 2004. erowid.org/exp/8323",
 "substance": "Methamphetamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8323",
   "Male",
   "",
   "Not Given",
   "Feb 8, 2004",
   "8743",
   " "
  ]
 ],
 "report": "<p>I'm a caring, deeply emotional/sentimental, and intelligent 20 year-old filipino who is definately addicted, sometimes I even believe dependant on that evil, evil drug known to me and my friends as tweak (or crystal meth).  The most disturbing and sad part of this all, is that the people that I do this substance with are just like me: multi-faceted, good-hearted, and intelligent.  In other words, do not, I repeat DO NOT underestimate the power of this drug's addictive qualities; you can easily feel it's sometimes seemingly incessant pull on your heart and desires after doing it just once.... It's scary.</p><p>I first did the drug back in November of 2000 in my garage with my brother, my cousin, a mutual friend of ours, and some of my cousin's friends that we had just met a few weeks ago.  That day, I had gotten some acid for myself, my cousin, and my friend to try for the first time.  My cousin's friends were going to smoke some tweak in the garage of my house (my parents were home but they didn't mind the company as long as we weren't too loud).  Earlier that day I had smoked some weed with my cousin and his friends and we were concerned that the weed might have some affect on the acid.  Anyhow, after doing the acid we didn't feel that much (we only had a 1 hit each).  We felt a little different and a few, scant hallucinations here and there but nothin too exciting.  We went to the garage where my cousin's friends were smoking the tweak.  My brother joined in and the three of us were wondering if we should try.  It looked interesting and we didn't see much harm in trying so we smoked some.  I have no idea how much we did nor how we were suppossed to feel like, but we used the foil/straw method and seemed to smoke a good amount.  I really didn't feel that much from the tweak except I noticed we were all quite talkative and I couldn't sleep or eat for the night or the next day.  However, I didn't get addicted until after the second time I tried the drug because the come down was so bad and I didn't want to experience that again.  </p><p>A couple of weeks later I recieved a call from an old friend asking if I wanted to buy some tweak because he had known that I had done it before.  I obliged and told him I wanted 2 grams.  When his sister and friend came to my work asking for the $140 dollars I was shocked at the high price I had to pay and gave them instead $70 for a gram.  They said they were actually hooking me up because street price is normally $80 a gram.  Anyhow, when I got the stuff I smoked like half of it with them and the other half the next day/night by myself or with my friend that was with me the first night in my garage.  After that first gram was gone was the first time I felt it's extreme addictive qualities.  I wanted more, I wanted to feel like that again.... I hated the come down.  So I bought more as soon as the first gram was done.  Another gram of course.  I smoked that with my dealer or my friend, or my cousin, or my brother, or all or some of them.  It really didn't matter who really because that euphoric feeling was great.  I mean, it made everything better.  I felt so much more open with everyone, so much more nicer with everyone, so much more intelligent and willing to talk, talk, and talk the night away.  It was great, I had fun, I got to know people and I had so much energy.</p><p>That was then, this is now.</p><p>Now I'm on my 84th consecutive day of smoking this stuff (btw, I prefer to smoke the stuff with a GP, or glass piece, because it's less wasteful than foil and I seem to get bigger hits with a GP despite the belief that the biggest hits come from foil).  I no longer associate with my first dealer or the other dealers that I had because even though I had known them before I did this stuff, they all skimped on the portions they gave me.  I now consort with only one dependable dealer.  Basically I'm the runner for the area that I live in, the one that everyone calls if they want tweak.  I get their money, drive down to get the stuff (I get my middle man fee and free smoke outs for doing this), and deliver them their stuff.  I want to quit this stuff so bad, but I'm so addicted to this stuff, that I don't quite feel normal anymore when I'm not on it.  I mean, I'm used to the comedown by now, but then again, maybe I'm not because I don't allow myself to fully comedown.  Whenever I start to feel the full effects of the comedown (irritatable, impatient, angry, anxious, etc. etc.) I don't feel like myself.  People even notice that I'm not me unless I'm on this stuff.... It's a sad reality, but it's true.  And what really gets to me is the fact that I got many of my friends into this drug.  Granted, I didn't know the full affects of this drug, but now that I do, I try my best to not get the stuff for anybody that has yet to try the stuff.  </p><p>Now what are the bad affects of this drug?  Well basically, one slowly gets sucked into it, never really noticing that one is slowly doing it more and more until it's too late.  I began doing it more often, little by little, or more of it each time, little by little.  I spend more and more of my time and money on this drug.  It slowly takes over one's life (it's taken over mine) and could even become a number one priority sometimes.  It's an expensive habbit and if it takes over one's life, it could be hard to keep a job (i lost my job because I stole from my work to help support my habbit).  It can change personality and outlook on life.  While on it, my personality and outlook is more positive and I feel on top of the world.... but when I come down I feel like sad, or angry, or irritable or.... basically like crap.  It can make one very paranoid.  Some people so much that they think that others are talking about them when they really aren't.  It got so bad for my cousin that he thought his parents put hidden cameras in his room!!!  It's not worth it when all is said and done.  It is slowly and still is ruining my life.  It's ruining my friend's lives also.  We all know it, and all know that in order to get our lives back in order, we have to quit this drug.  And, yet, we still do it!  We are so hooked.... </p><p>Please, stay away from this drug at all costs.  If you gotta try it, be smart about it and really, regulate your usage of it (in other words make it on occassion. Like durin a special party or something), or better yet don't do it again.  We did it every weekend.... that turned into everyday in the weekend, then sometimes during the week also, then almost everyday, to now, several times during the day.... we didn't even notice it until it was too late.  To be completely safe, just stay away from this evil drug!!!!</p>"
}
