{
 "title": "Re-Analyze That Please",
 "author": "SarahToxic",
 "citation": "   SarahToxic. \"Re-Analyze That Please: experience with DXM with CPM & Drug Testing (ID 83251)\". Erowid.org. Jan 13, 2010. erowid.org/exp/83251",
 "substance": "DXM with CPM & Drug Testing",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "32 tablets",
   "oral",
   "DXM",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 83251",
   "Female",
   " ",
   "Age at time of experience: 18",
   "Jan 13, 2010",
   "Views: 3734",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]  </p><p>I was addicted to DXM. Actually, I still am, but I've been off the shit for a year now. It's honestly the strongest drug I have EVER done. I'd pop 32 tablets before I went to bed, and then I'd wake up the next morning high as a motherfucker, and it'd last all day and even into the next day if I didn't take more that night. Anyways, I'm filling this report out because someone asked for experiences with DXM and it showing up as a false positive for PCP and opium. </p><p>In February of 2009, I was put in the emergency room because my school's resource officer noticed I was fucked up. So I'm laying in the hospital bed with an IV in my arm. I pissed in the little plastic cup and waited for the test results. I knew that weed would show up in there, but I figured that's all that would show up. DXM and smoking weed were the only drugs I did.</p><p>When the doctor came in with my UA results, he said marijuana, opiates, and PCP were detected in my system. My mother (who went to the hospital with me) started freaking out. I asked him to go re-analyze or something, because weed was the only detectable (or so I thought) drug in my system. So he did and came back. He asked if I had abused any other substance and I told him about my using DXM. He left and returned a few minutes later.</p><p>When he came back he said the DXM registered as opiates, and it normally shows as a false positive for them. Then he said that because I was using such a large dose frequently, it showed up as PCP.</p>"
}
