{
 "title": "29 Years of Flashbacks From Bad Trip",
 "author": "Bob from the UK",
 "citation": "   Bob from the UK. \"29 Years of Flashbacks From Bad Trip: experience with LSD (ID 8336)\". Erowid.org. Nov 24, 2001. erowid.org/exp/8336",
 "substance": "LSD",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "1972",
   "ID: 8336",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 24, 2001",
   "Views: 65638",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI am presently aged 45, and took LSD at aged 16, during 1972.  I can honestly say that the trip experience was so profound and real, that it has affected me ever since. </p><p>My parents were on holiday, and I tripped at home, with a work colleague, who was not a good friend, just somebody I knew.  I thought LSD was going to be all flowers and pretty lights, etc., and was looking forward to the experience.   We bought the black microdot tabs from a dealer that he knew, who warned us that the tabs were strong, and to make sure we were somewhere safe.  On the way home on a bus, we dropped the tabs. We got home OK, and decided to go to a local shop.  The time was around 5-6pm. After about half an hour, we started to feel a bit light headed, and giggly.  We returned home, and sat in the front room, and put on some Deep Purple on the hi fi. I can remember moving my hands, and seeing the fingertips trailing behind, and the seeing the walls swaying.  Also, sounds coming out of the hi fi speakers were in colour.  Then, bang.   I lost an hour or two here, my colleague said that I just wandered round and round in circles, in a trance state.  I can vaguely remember seeing my mind on different planes and levels, shooting out into infinity.  </p><p>I then came round, and noticed the guy with me staring at me in an all-knowing way.  He had tripped before, and I began to get the AWFUL feeling that he had tricked me into taking the tab. As the time went on, I began to get paranoid, and started to realize that this trip was going to last for eternity, and, in fact, my whole life previous to this, was also part of the trip. I saw my parents sitting on the sofa laughing at me, you've been conned again on their faces.  I looked at the guy with me, yes, I now realized I knew him, I'd always known him, for eternity, I was in a death trip now, I was sucked into a spiral, everything I looked at, I knew what was coming, DEJA VU on a massive scale. Fear is not a good description of the horror of this experience.   </p><p>Several times in the trip, I became 'aware' and tried to tell myself, this is stupid, you are you, I repeated my name over and over.  At one stage, I decided to go for a walk.  It was dark, about 11pm. We caught a bus, God knows how.  Walked round a town centre.  It was raining.  The rain hit my face and felt like acid burning holes.  I looked at the guy with me, yes, his name, everything, he was the bastard that always tricks me into taking LSD, and I fall for it every time, for infinity -whoosh  - away again down the deja vu spiral, horrendous sickening fear.   At one stage in town, I looked at an EXIT sign.  Yes,  ex it,  this is it, it is the trip, whoosh - away again.  Managed to get home safely by walking home. We had left the front door unlocked, but got lucky.   I then spent the next 2-3 hours battling with my sanity, as time and time again I suffered the realization, and gut-wrenching fear, that I had done this millions of times before, and could never escape it.   I eventually came down at about 4 am, staring at a gas fire, in a state of shock. </p><p>The following days I wandered round in a daze, trying to come to terms with what had happened to me.  I only took LSD one more time after that, a half a tab.  To convince myself it was OK.  It wasnt.  I went to rock concert at a stadium, it was dark, I saw the EXIT signs, I was back on the same trip, panicked, left early, and went home, lay in bed in a state of fear. </p><p>The following year, I smoked some weed, became paranoid, and suddenly flash backed, I was still on the trip.  I ran panicking, its all I can do for a few seconds, then the feeling goes.  I tried sniffing solvent, bang, whilst high, I got the same feeling, still on the trip, panicked and ran again.  People look at me strange, Im not surprised.    The years went on.  I married and had children, got a good job.    Whilst at work, I had to go into a dark hall, with an illuminated exit sign, bang, - youve guessed it, I flash backed again, deja vu, the people with me are all part of the conspiracy. And it goes on.   Ive had about 7 or 8 flashbacks, some being as far as 8 years apart.  The last one was last week.  I was in a panicky situation involving my job, involving danger. I was dealing with something, when I had the realisation, deja vu feeling again, OH NO, is what I say.  Christ, its a nightmare.  </p><p>So, during my life, Ive tried TM, Buddhism, Martial arts, various other spiritual paths,  Im lost, Im searching for sanity,  I honestly dont know, 29 years later, what is reality.   When I die, I hope its blackness and peace, and not part of a neverending trip, and Ive got to suffer the experience again.</p><p>My advice to anybody reading this who hasnt tripped yet,  DONT.</p>"
}
