{
 "title": "Unatural Concious Nightmares",
 "author": "Quaggz",
 "citation": "   Quaggz. \"Unatural Concious Nightmares: experience with JWH-018 & Cannabis (ID 83407)\". Erowid.org. Apr 30, 2010. erowid.org/exp/83407",
 "substance": "JWH-018 & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "JWH-018",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 83407",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Apr 30, 2010",
   "Views: 8095",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: The author refers to 'JWG-018', probably meaning JWH-018.]</p><p>A friend of mine brought over the JWG-018 earlier that day, I was quite skeptical but Im down to try anything. The first administration was pretty nice, I loaded a bowl and he gave me a dose on top of the bowl. The hit went down smooth, it didnt kick  DMT and it didnt taste as chemical as Ketamine, at first. I was extremely stoned with in minutes, I was enjoying my music it was pretty nice. It was intense but it felt really nice after awhile, my friend after smoking the bowl had to do a interview on the phone I have no idea how he did it. Anyways I go to class and my friend comes back over and him and two my other friends and myself smoke personal bowls to ourselves with the dose JWG-018. </p><p>This is where the high ends and the nightmare begins, at first it was like I was so overwhelmingly stoned. I was experiencing severe time dilation, thinking that thirty minutes had gone by and it had only been three minutes since I had finished my bowl. I started to try to focus my high with my mind and body, the alignment happened quick and fast but there was something terribly unnatural about it. Within minutes after closing my eyes I was about to break through, but there was a gut feeling that came from inside telling me do not do it like this, this is not the way to enlightenment this is not MARIJUANA! Only five minutes had past and I was starting to get very frightened, there was something so unnatural and synthetic about it and my body could tell. My inner self was disgusted with this chemical I had done, it kept telling this is not the way, this is the way to destruction you must never do this drug again. Now I love drugs, I have fallen into K-holes that have me thinking Im in Shanghai. Acid and Shroom trips that have been so overwhelming that I have hated myself and forgotten who I was. Overdosed on cocaine at a amusement park, but this was by far the most disgusting vial drug I have ever consumed. </p><p>I started getting nauseous my body was telling me this was the only was to throw up the poison. I did, I still felt like shit, I was humbled  by this drug that had me hugging the toilet, this legal fake keef on steroids. As soon as there wasnt vomit coming out of my mouth I told my friends the message I had got from within. I told my friend that brought it over that I cannot have anything to do with this substance, I dont want be someone's friend if they smoke it and I never want it in my house. I have never said those words about any other substance, but I had never been told so strongly from within to have nothing to do with a drug. Both my other friends had equally as horrible times, my other friend who brought the JWG-018 wasnt as fucked up as us. I think there is a time and place for almost every drug, except for PCP and JWG-018. </p><p>[Reported Dose: 'two administrations of .5 milligrams']</p>"
}
