{
 "title": "Interesting Cocktail",
 "author": "pj",
 "citation": "   pj. \"Interesting Cocktail: experience with Salvia divinorum, Nitrous Oxide, Cannabis & Alcohol (ID 8352)\". Erowid.org. Jul 26, 2001. erowid.org/exp/8352",
 "substance": "Salvia divinorum, Nitrous Oxide, Cannabis & Alcohol",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(dried)",
   " ",
   "3 carts.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8352",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 26, 2001",
   "Views: 18070",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis is not a single trip report, but rather an analysis of several experiences with salvia, nitrous, MJ and alcohol taken in combination.  It is particularly interesting because I find none of these substances to be all that special by themselves, at least compared with 'harder' substances such as LSD and mushrooms.<br>First, some background.  I have plenty of experience with alcohol and MJ and would call my experiences typical.  I enjoy alcohol at the 'slight buzz' stage, but strongly dislike the effects beyond this.  (I'm fond of good beer, and often wish I could drink more for the taste without getting drunk.)  My experience with nitrous is moderate -- it is a cheap thrill and nothing more.  I am still a novice with salvia.  I can obtain a calming, centered, meditative state by smoking dried leaves, but have yet to experience the mind-blowing experiences that others have reported.<br>The first time I tried all these together was an unplanned occurance at at party of about 30-40 people were only a small number of people were doing anything other than mass consumption of alcohol.  Hardly an ideal set and setting.  I had about 4 beers (my typical evening's limit) and enough MJ for a good stone when a friend brought out his salvia pipe.  I estimate that I smoked about 100 mg. of very dry leaf over a 10 minute period.  This was enough to notice a definite change in perception, though rather difficult to describe as other than pleasant and calming.  A few minutes later, my friend brought out a nitrous cracker and a box of carts.  I did a full cart and I knew something was up right away, because for the first time I actually found the nitrous more than just a cheap thrill.  I did a total of 3-4 carts over a 15-20 minute period, going up for a higher, longer rush each time.  The last one was completely mind blowing.  I'm sure the effect lasted only a few minutes, but it felt as if it lasted for maybe 15 minutes or more.  After that I sat uable to move or speak, yet aware of my surroundings, for about 20 minutes (this time measured by the time on a VCR)  At this point I got a ride home and quickly fell fast asleep.  I woke up with no ill effects, knowing that this was something I wanted to explore more thoroughly.<br>Several weeks later I had another chance.  Several rather experienced psychonauts gathered at 1am for a 'no substances barred' party.  I had 3-4 beers at a concert earlier in the evening (9pm-midnight) and we started the party smoking some MJ while planning our cocktails.  I decided on simply a *large* dose of P. Cubensis.  We then decided to watch _Fight Club_ on an 80 inch. projection TV.  We had all seen the movie many times, and each of us can relate to the movie in a special way.  I can't speak for the others, but my launching coincided directly with the movie.  About an hour in as the screen was dissolving, I closed my eyes and got some of the most amazing animated 3-D visuals I have ever seen in my life.  After the movie was over (about 4am) we went outside to walk in the grass, spin poi, and watch the sun come up as we came down.  I spent much time alone meditating during this time.  About 8am we were most of the way down and went back inside.  We smoked some more MJ to ease the crash, when the salvia and nitrous came out.  I smoked about 100 mg. of salvia, chased it with a whippet, and was catapulted right back to the peak of the mushroom trip for about five minutes.  This was repeated twice more with similar effects.  Shortly after the third one my girlfriend started talking about the few people killed at Burning Man.  She started to talk about this guy who took LSD and then got on a motorcycle.  This was *really* bothering me, so I asked her to stop, but she didn't.  A few moments later, I re-lived a motorcycle accident I had four months earlier in the crystal clarity that only a strong psychedelic experience can provide and wound up a sobbing mess for the next 20 minutes.  Although it was a horrifying experience, I never felt out of control, and in a very odd way it was strangely enjoyable.  I could elaborate here for hours and still not fully explain what happened.  Suffice to say it was an incredibly powerful experience.  I can't begin to imagine where I might have gone if I did this a little earlier while still heavily into the mushroom trip.<br>My third and most recent experience happened just a few nights ago under somewhat more controlled conditions.  I was with two close friends and were were watching the movie Baraka.  I was curious to see how the A + M + S + N coctail would work at a moderate dosage.  I started with two beers and enough MJ for a good stone.  About an hour later I smoked about 250 mg. dried salvia leaf.  The effects of the salvia were definitely more noticable than previous attempts, likely because I smoked harder and faster, yet still far from what I believe is possible.  I waited about five minutes to get a feel for the salvia and did a N20 cart.  Almost immediately I went into a state or nirvana which lasted a good five minutes before tapering off.  I did 3-4 more carts of N20 over the next hour combined with about 100 mg. more salvia, achieving about the same level each time.<br>Again, the experience was completely unlike *anything* I have ever experienced before.  The combined effect of these four substances in rather moderate dosage is completely unlike any of them, or even any subset of them, taken in much higher dosages.  (Excepting the salvia, of course, which I have not thoroughly explored by itself yet.)  I have no way to describe the feeling other than pure bliss or perhaps a nirvana state.  The interesting thing I noticed this time was that after the strong nirvana rush wore off, the next few hours were very happily tainted with it's aftereffects.<br>The same evening I turned one of my friends onto the same combination.  His prior experiences were quite similar to mine, and although I tried to prepare him for what might come, it *still* took him completely by surprise.  This leads me to believe that this coctail may produce similar results in many who try it.\n\n\n"
}
