{
 "title": "The Live Experience",
 "author": "CodTram",
 "citation": "   CodTram. \"The Live Experience: experience with Codeine & Tramadol (ID 83563)\". Erowid.org. Dec 19, 2013. erowid.org/exp/83563",
 "substance": "Codeine & Tramadol",
 "bodyweight": "12 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "200 mg",
   "oral",
   "Pharms - Tramadol",
   "(capsule)",
   "  T+ 0:40",
   "240 mg",
   "oral",
   "Codeine",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 83563",
   "Gender: Male",
   " ",
   "Age at time of experience: 28",
   "Added: Dec 19, 2013",
   "Views: 390",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: I am a 28 year old male with an intermittent and infrequent use of various drugs in the past (prescription, OTC and street). My earliest use of drugs was in my late teens when I began experimenting with cannabis. Then in my early 20's, while working in a night club, I took X (MDMA) for the first time. X was regular every other week for a period of about 6 months, after which I stopped with no after effects. That was to be the end of my experience with any drug until recently, when I tried Coke for the first time which I assume was crap stuff, as it had literally no effect after 3 or 4 lines. Over the last 8 years I have taken codeine by prescription for a couple of injuries but never longer than the recommended timescale.</p><p>Preparation: In preparation for this experience, I have been regularly taking smaller doses of Codeine and Tramadol. There may already be a small tolerance built up, as the more recent doses have little little to nearly no effect. The codeine I am using has come from 30/500 Solpadol tabs prescribed to my father. Extracted by CWE, 8 tabs totaling 240mg of Codeine, dissolved in approx 100ml of tap water, stirred occasionally for 5-10 minutes. Solution was then filtered into a glass through a doubled over t-shirt to leave a slightly cloudy solution with no particles of apap present. I was happy with this final solution without need for 2nd filtration or use of fridge/freezer. Filtration took approx 30 minutes.</p><p>Timeline:</p><p>I am writing up this experience as it happens live. </p><p>Setting: I am sitting at the computer in the living room, feeling quite relaxed and well rested as I have slept all day up to 4pm.</p><p>2000: Took 4 capsules of Zydol (50mg Tramadol Hydrochloride). I am taking these before the Codeine solution as I know they take longer to act than the codeine solutions do. </p><p>2030: So far nothing has happened, but I do expect a little onset in the next 10-15 minutes or so. Preparing to drink the bitter solution prepared earlier of Codeine (approx 200+mg Codeine Phosphate in solution). Begin to surf the web while listening to a little chillout music on Spotify.</p><p>2040: Drank down the codeine solution in one go. Yeah, not so nice that taste, but worth it...I hope :D</p><p>2055: Decided to start a video chat on Skype with a friend. Now starting to feel the effects. Pretty sure this is the codeine, Arms have gone like jelly as have legs. Getting a sort of muscle twitch in random parts of my body which I think I am attributing to the combination of these two drugs. Its not at all unpleasant. </p><p>2115: Feeling completely relaxed and jellylike now. Nothing bothering me. Sight is slightly affected in that I have a greater vision retainment time, giving a slightly sluggish view of the room when I look around me. Starting to feel very dry in the mouth also.</p><p>2120: Starting to feel quite hungry and thirsty now. Find that smoking enhances the effect quite a lot. Not quite sure if this feeling is an effect of the codeine on its own, or the combo of drugs in use. </p><p>2130: Feel that the codeine kick has peaked. Settling down and getting comfortable now. No immediate need to do anymore. Still able to hold a conversation with my friend on Skype without slurring and have been able to maintain my mental faculties in doing so. </p><p>2140: Getting slight tingles turning to itches, mostly on my head. Doesn't bother me too much. Just carry on doing what I am doing. Still seem to be peaking. Very nice feeling all over. </p><p>2145: Decided to go make some food, as hunger pangs were too much. No nausea so far, which really does help the food go down. Still feeling quite happy and relaxed. :)</p><p>2155: Definitely coming down from high. Feeling calm and a little profound. Legs still jellylike and rest of body completely relaxed and at ease. </p><p>2100: Would say that I have baselined from the codeine but still getting the jellylike muscle twitches, which I again attribute to the longer lasting tramadol. Quite content now and from recent experience, expect to feel this way til I go to sleep tonight.</p><p>Conclusion: This was a completely vivid and relaxing experience, euphoric even. The peak of this high was a highly social one. I felt I could relate well to what my friend was saying and I was able to communicate clearly back, unlike the peak of X, where I could become slurred and slightly unintelligible.</p><p>My return to baseline was rather rapid on this occasion, and I put this down to tolerance of both drugs at this stage. I have not found Codeine to be addictive for me. Nor Tramadol. In that, when I don't have either of the two drugs, I don't find myself yearning for them. I am able to carry on with my life as normal without them.</p><p>I would however, only recommend these types of drugs for recreational use only, as the tolerance I have developed, shortens the effect(s) and then requires a larger dose, which I myself am not happy about doing.</p><p>Happy Highs All.</p>"
}
