{
 "title": "Mildly Pleasant on Pure Meperidine",
 "author": "john_iv",
 "citation": "   john_iv. \"Mildly Pleasant on Pure Meperidine: experience with Meperidine (ID 83610)\". Erowid.org. Nov 27, 2013. erowid.org/exp/83610",
 "substance": "Meperidine",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "insufflated",
   "Pharms - Meperidine",
   "(powder / crystals)",
   "  T+ 0:10",
   "25 mg",
   "insufflated",
   "Pharms - Meperidine",
   "(powder / crystals)",
   "  T+ 1:00",
   "50 mg",
   "insufflated",
   "Pharms - Meperidine",
   "(powder / crystals)",
   "  T+ 1:00",
   "1 mg",
   " ",
   "Pharms - Lorazepam",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 83610",
   "Male",
   " ",
   "Not Given",
   "Nov 27, 2013",
   "Views: 518",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Set: At ease. I am a well-experienced user (spent many years on codeine and huge doses of tramadol, have experimented with many other opiates and opioids). Not currently addicted, though I do take various opiates and opioids on occasion. I have take Demerol orally on a few occasions, and have always found its oral effects quite mild and somewhat disappointing overall. I've read numerous statements that it can (or 'should') be snorted or injected; I don't use needles, so I'll go with the former and this will be my first time insufflating Meperidine (though some may still think it's a 'waste', especially given the source of the drug).</p><p>Setting: My condominium on a Sunday afternoon in winter. January 31, 2010.</p><p>Drug: Meperidine HCl, USP reference standard</p><p>This is as close as one gets to 100% pure (so there is none of the common worry most have about binders, fillers, etc. from insufflation of crushed Demerol tablets). The powder, on closer inspection is more like tiny crystals, perhaps likely finely powdered sugar. There is 200 mg in the small amber vial, and I have split it into four piles. I will insufflate one pile (~50 mg).</p><p>Experience:</p><p>Time 0 (1:48pm): Insufflated ~25 mg. </p><p>Halfway through the line, the sensation burns to the point of bringing tears to my eyes (I was ready for this, having read other accounts). However, the acute burn quickly subsides within minutes, leaving only a mild burn and a very noticeable pleasant feeling welling up.</p><p>As I sniff to ensure it's all up there, and as the powder begins to trickle down the back of my throat, the acute burn returns, though not quite as bad as the initial administration. And the 'pain' of the burning is already easily 'pushed aside' by the feeling of well-being.</p><p>5 min: Burning in the throat (from the trickle down of powder) is bothersome, though tolerable. Shoulders feel very relaxed. I can tell I'm on some sort of opioid, but nothing to put me on the nod or feel really 'opiated' (the term I use for a strong opioid 'high').</p><p>The physical side (i.e. relaxed shoulders) seems like just a general anxiolytic effect, and not the euphoric swell one feels with a stronger drug such as oxycodone. The effects seem more cerebral to me.</p><p>No 'numbing' sensation, though I do feel the effects slowly intensifying. I will note that I'm having a tiny bit of trouble typing fluidly & orthographically (usually I'm quite fast with typing, and tend not to make typographical errors).</p><p>10 min: Have an overall feeling of well-being, and all burning sensation has stopped. I will now snort the rest of the line. Insufflated ~ 25 mg. The burn came back, but no tears this time. It subsided quite quickly and seemed much more 'distant' this time.</p><p>20 min: Much more to the pleasance now. There is now more of a numb 'opiate' feel to the experience. However, still not nearly as euphoric as oxycodone but it is still intensifying.</p><p>I thought the route of administration, i.e. insufflation, would have caused an almost immediate effect. I realize it still takes a few minutes for most insufflated drugs to reach a peak effect, but this still seems somewhat delayed to me. [Note: I am adequately experienced in insufflating various drugs, including numerous stimulants, several benzodiazepines, and a few opioids.] My lips are very numb (almost like cocaine) as I wiped up the residue of the powder with a finger and licked it. An expected bitter taste, but nothing bothersome. </p><p>30 min: Now it's all here. Miosis (small pupils). A numb, mildly euphoric state typical of what I would expect from the dosage. </p><p>35 min: I'm on my game. Quite fluid with the typing again and feeling quite stimulated (in the sense of motivation) to do some writing or music. Note: This is a common effect I have always experienced with this class of drugs. Though they are depressants, I do not lose any motivation to do things, and in fact often feel more motivated to pursue my various creative interests. </p><p>45 min: Most of the feeling has come back to my lips.  No change in the subjective 'high'.</p><p>60 min: The high is just beginning to fade a very small bit. </p><p>I have lost interest in keeping a real-time account of the experience. I am going to insufflate another 50 mg, take 1 mg lorazepam, and go on with my day writing/recording some music. </p><p>Tootles. And here comes the burn...</p>"
}
