{
 "title": "Negatives vs Positives",
 "author": "joolino",
 "citation": "   joolino. \"Negatives vs Positives: experience with GHB & GBL (ID 8379)\". Erowid.org. May 26, 2004. erowid.org/exp/8379",
 "substance": "GHB & GBL",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "GHB",
   " ",
   "  ",
   " ",
   "GBL"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8379",
   "Male",
   " ",
   "Not Given",
   "May 26, 2004",
   "Views: 26364",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After several months of moderate to heavy use, I've become more comfortable and less ashamed of my habit.  Due to so much misinformation that travels around, I've been very upfront and honest with those I meet concerning my use of GHB and GBL.  When asked 'is it bad for you' and/or 'is it addictive', I've always responded 'no, if used properly' and clarified that it can be good for you in some ways.  After visiting this website and reading all the testimonies, I'm not sure what to believe anymore.</p><p>I use GHB and G3(a type of GBL) multiple times daily.  The GHB I use is always top quality powder (sodium based) GHB.  When using anything other than the powder GHB, such as potassium based liquid, I intuitivly sense that what I'm putting in my body does not agree with my system.  For whatever reason, I have not experienced this with sodium based powder GHB.  Nor have I experienced this sensation with GBL or 'G3'.  The 'G3' as it is called is bright yellow due to B12 put inside (so I was told).   With G3, I have experienced that when using excessively, it is often difficult to sleep throughout the night without waking up.  One difference I have noticed between the G3 and the GHB is that the G3 does not seem to make my stomach uneasy in higher dosages.  In higher dosages, it induces sleep, but no sickness, whereas higher GHB doses seem to make me sick to my stomach.</p><p>Although I have been using G3 for several months (4-5) daily, I have stopped for many days without side effects.  While using G3, I have experienced moderate anxiety and sleeplessness, however it is unclear whether or not this is due to the drug or the anxieties of life.  I work many hours a week at high stress levels. When on vaction, the sleeplessness and anxiety seems to disappeer. The G3 helps me to relax, helps me to compose music and functions as an empathogen of sorts, allowing me to communicate and open up to people and experiences in a beautiful way.  I am thankful for these experiences and hope that I will continue to grow from them with or without the drug.  I have learned so much about myself while using G3 and hope to share the benefits of the drug with others, while advocating moderation and safe usage!   I also believe that G3 helped me to quit smoking cigarettes after 3 years of addiction, over a pack a day!  I do not drink alcohol or smoke pot either.</p><p>After reading many reports about addiction to GHB, I am now more wary about the possible dangers of GHB abuse.  Let us not lose sight of the benefits as well.</p>"
}
