{
 "title": "Impressive at First, Now Not So Sure",
 "author": "M_Bassy",
 "citation": "   M_Bassy. \"Impressive at First, Now Not So Sure: experience with 4-Methylmethcathinone (Mephedrone) (ID 83822)\". Erowid.org. May 5, 2010. erowid.org/exp/83822",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "750 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 24:00",
   "750 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 83822",
   "Gender: Male",
   " ",
   "Age at time of experience: 37",
   "Added: May 5, 2010",
   "Views: 7295",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A friend and I caned a total of 3g over two successive evenings i.e. 0.75g each, per evening, all insufflated. Both of us had taken it occasionally before, and we were both comfortable with drinking beers, vodka, RedBull etc as we went.\r[Erowid Note: The wording of this report suggests that the substance was taken over the course of the evening in repeated smaller doses, totaling 0.75 g] </p><p>We both had extensive experiences of many different substances stretching back almost 20 years, and had come to appreciate mephedrone as a relatively clean, euphoric stimulant. Personally, I'd taken maybe 5g over the previous six months, since first discovering it, all obtained from the same UK-based supplier. It was very much an occasional Saturday night thing for me. If pushed, I'd say that whilst my initial experiences had been deeply pleasurable, entirely in line with descriptions of aphrodisiac/euphoric/MDMA feelings elsewhere, it had slowly and almost imperceptibly become more like regular amphetamine.  </p><p>Assuming my supplier had maintained fairly consistent quality control, I concluded I was just developing a tolerance to it. Either way, I still enjoyed it, and more importantly experienced no negative effects afterwards, mental or physical. This was probably why I held it in much higher regard than cocaine, which invariably does relatively little for me, but ultimately leaves me feeling listless and grouchy for a short while afterwards. </p><p>I've always been grateful for having a relatively robust mental constitution. I generally don't experience negative emotions even when coming down from something powerful, to me it's just the inevitable pause in neutral as you change from one mode to another, and a reflective, rather than a depressive phase. Despite having broad experiences of many entheogens and hallucinogens, I can honestly say I've never had a bad trip, and if a trip's got particularly heavy, then nothing more than remembering that 'It will pass' is sufficient to get me through. But I found myself repeating that quite a few times over the last few days. </p><p>Over the weekend, we managed maybe 2 hours sleep during the day, before embarking on the second evening. The second evening was animated, but definitely not euphoric. Music sounded excellent, and we did manage quite a bit of intense, emotional, frank conversation, which is not always a given in a male-only environment. Nothing too heavy, and all broadly enjoyable and perhaps even a bit constructive.</p><p>Sunday morning kicked in with lengthy train rides for us all back home, and I didn't reach home until around 6pm Sunday evening.</p><p>By now my tongue was on fire. It didn't look too swollen or odd in any other way, but it was like a scalding-hot soup burn, all over. Drinking any kind of cool/warm liquid was extremely uncomfortable. I had a nagging, but not incapacitating headache (also quite unusual for me). Otherwise, mentally and physically I was about on par for this stage of such a weekend. I leapt into bed, and got a full night's sleep, getting up several times for a drink of water.</p><p>On Monday morning, my tongue and my head still felt just as bad. Only my tongue, not my throat, or my nose, which were somehow unaffected. What's more, I felt very low, unusually low for me. Regardless of what I've been up to, or for how long, I can generally count on being well on the way back to normal, the morning after a full night's sleep. Fortunately, I didn't have work that day. I have quite an intense job, and my 'plans' assumed I would be right as rain when I did start back the following day. At this point, that felt overly optimistic. </p><p>I was not in a black place, but pretty close, listless, shaky, beginning to panic about work the next day (hence the 'It will pass!') and a tongue still on fire with which I could barely speak. I wanted to go out for fresh groceries to kick-start my recovery, but could not face driving, or walking to the store (also highly unusual for me). So I had to make do with the best I could at home. Made some pasta, as I was by now quite ravenous, but couldn't manage more than a mouthful. I hit the internet for some more cautionary advice about mephedrone, but that's still quite hard to come by eh?! Hence, I resolved to add my 2 cents when able to do so. I found quite a few scary articles about extreme physical reactions, many of which seemed to arise only after several sessions. I know certain substances can trigger allergic reactions only after a sustained degree of exposure, and I wondered whether this might be some such type of response.</p><p>Either way, I needed some extra days off work, and it's now Thursday, and my tongue still hurts. It's been improving slowly, and should hopefully be right in the next day or two. My mood was still very poor on Tuesday when the headache finally lifted, but Wednesday was better, and seems pretty much back to normal now. </p><p>Hence, I'm submitting this report as this counts for me as probably the most sustained and unpleasant response to a substance I've ever had, and I will definitely be re-appraising my opinion of this stuff. Nothing above is particularly extreme, but I am genuinely concerned that as an occasional user, I've been able to go from zero adverse effects to 5+ days of adverse effects over such a short period of time. Whatever is responsible, it suggests a very steep trend to the potential reactions at work, and I can do without that, so there won't be any more of that for me.</p>"
}
