{
 "title": "Very Like Crack",
 "author": "dougie m.",
 "citation": "   dougie m.. \"Very Like Crack: experience with MDPV (ID 83865)\". Erowid.org. Apr 29, 2010. erowid.org/exp/83865",
 "substance": "MDPV",
 "bodyweight": "85.7 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "MDPV"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 83865",
   "Gender: Male",
   " ",
   "Age at time of experience: 39",
   "Added: Apr 29, 2010",
   "Views: 18507",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHello.  Im in the midle of finishing my second batch (0.5g) of this relatively new designer drug called mdvp. The first time I had it was two weeks go. Decided to smoke it using a home made vaporizor from a lightbulb (very easy to make). The first time I tried it, it got a decent buzz /high but nothing greaat. This was on a friday night about 6 o clock. This stuff is very addictive much like crack but not  so addictive that I want to get more and more. I mean two solid days on this stuff and I get anxious and jittery ect and just want to call it a day for now, because it takes it out of me when binging for days and in the end all I want to do is get some sleep.<br>Anyhow back to my experience. Friday night 6 oclock I started my small bag wich I pudchsed from the internet (same company every time for other drugs) after going with the home made vapourizer all night till about 2 am sat, I decided it just wasnt working efficiently enough, too much sucction and little smoke.  So I decided to make s pipe using a small medicine bottle with a pen tue stuck in the side. Yeah! what a different beast. The hit I got was very similiar to crack and the taste was same too. Well there was no stopping me now apart from the fact I was working in 4 hours, ha ha I just didnt care and kept smoking it right up till I set of to work. Wasnt as bad as was especting being a plasterer half zombified lol. I got throught the day finally and went back to my trusted mdpv pipe and started where I left off, caarrying on through till monday morning and work again, I was not well enough to work but had to go. Wow I have rarly felt so ill in all my life. I had cold shivers and short of breath, just culdnt find any energy. It was bad news! Anyways I said I wouldnt get any more after that but here I am feeling good all over, and not slept for 36 hours, but I think I can sleep on this after a 4 hour break. <br>Conclusion is I find this new drug very good except it makes me want to look at alot of porn but cant get the slightest hard on and it can make me paranoid after a days binging and it can make me cold due to bad circulation. But other than that id give it 10/10 for value and 7/10 for the trip/hit. Oh yeah another good way to smoke it with any waste is to freebase it /chase it on fiol. <br>PS I have never weighed out any drugs I've taken cos I've got a very high tolerance level to every drug going but like herion you should always start of low dose\n\n\n"
}
