{
 "title": "Whistling in the Dark",
 "author": "the cheshire cat",
 "citation": "   the cheshire cat. \"Whistling in the Dark: experience with Cannabis & Amphetamines (Dexedrine) (ID 8390)\". Erowid.org. Aug 3, 2004. erowid.org/exp/8390",
 "substance": "Cannabis & Amphetamines (Dexedrine)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "10 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 48:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8390",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 3, 2004",
   "Views: 13622",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFor the past couple months, I've been half-addicted to speed - I would go on speed binges at least once or twice a month, and then never touch the stuff.  Now, I am an avid smoker, and have smoked on a daily basis for the past couple years.  Amphetamines completely SHATTER my tolerance for pot.  Uppers and downers is always an interesting mix, as the speedball (heroin and cocaine, for those less familiar with the terms) shows so well.  Only on speed do I ever have to bow out from smoking.  The past couple days is an accurate depiction of what I mean.<br>I've been in a rehab course for my possession arrest lately, so I decided to quit smoking until I got out of it.  I spent the day with my friends looking for shrooms, pills, k, or anything that would get us nicely crunked.  However, things kept going wrong with the day, and all we ended up doing was picking up a quarter of middy.  I decided that I would put a hold on my quitting smoking and smoke for the night.  A quick walk to the woods and we went through two bowlpacks, which gave me a  nice buzz.  Another friend promised to pick us up at the gas station at 11:30, so we went back there to wait.  There we picked up a couple KXMs, an energy drink, which gave us a nice boost to our highs, and kept us awake.  Finally our friend picks us up.<br>We bake the car a bit, and then go to her house and smoke a few more bowls.  By now, I'm pretty high.  Then, my friend whips out the Dexadrin.  I was to get a paycheck in a relatively short amount of time, so I asked for a 15mg, but instead she gave me two 5mg pills.  I didn't mind, and I downed them with some iced tea.<br>Within twenty minutes, the dex had begun to kick in, and all of a sudden, I was smacked beyond belief.  My 'nicely high' was multiplied tenfold, it seemed, and I was loving it.  I actually had to turn away some of the next joint passed around, it was too much for me.  I continued this way, meeting people I hadn't seen in months, and having in general a great time (taking another dex at some point in there) for the next 6 hours.<br>I didn't get to test out how low the dex left my tolerance the next day, but the day following that, I met the same friend who purchased the middy at the mall, and he still had some left (we were all dexing, so none of us needed that much bud that night).  We went into the woods and smoked a nice-sized joint.  <br>Now, let me point something out.  A joint will NEVER normally get me high.  It can give me buzz sometimes, but nothing like what happened.  While my high was not as intense as it was the last time I had smoked, I was amazingly high off that one joint.  It was as if my tolerance was not only completely reset, it was lowered further - I had never gotten that high when I started smoking!<br>I was stoned to the point of hallucinations.  We were forced to walk the long way through the woods.  I remember seeing a fence that I couldn't remember being there.  I had a conversation about it with my friend, who was rather confused.  I figured out why when I tried to lean on it, and my hand went right through it - apparently I had imagined the whole thing.  When we got out of the woods, we reached a construction site that I do distinctly remember there being a fence around.  I told my friend this, and he laughed and shook his head.  In an attempt to prove it was there, I kicked it, and my foot never connected with it.  It just plain wasn't there.<br>I didn't hallucinate any more fences that night, but thoughts were going through my head like an acid rant.  I would imagine a situation to occur, and before I knew what I was doing, I would start playing it out in my head.  Many a time did I think of a difficult problem, and spend forever trying to solve, only to discover that when I finally discovered a solution that worked perfectly, I would have forgotten the problem.  This happened countless times.<br>After a couple hours, my high had gone down.  I started to comment on how smacked I was, and how amazing the shit was, and how much I smoked, when it occured to me.  Wasn't it just middy?  Very decent, but I've smoked much better.  And I didn't smoke much at all!  In fact, that high was off one joint.  Thinking back now I find it hard to believe, but one joint sent me flying like it used to take several to do.  And it's such a nicer high!<br>Maybe it's just the speed addict in me, but recreational speed is immensely fun, and can help add value to other experiences, as those two days showed.  Of course, speed is still great for taking a hit before work or school to increase my performance, but stuff like this is unreal.  I've met many people who say they can't smoke shwag anymore, because they smoke KB or other high grade nugs too much, and shwag barely gets them high.  Often have I reached that point while smoking, and always, speed completely resets it.  <br>To just pick up two grams of regular Kind Bud, it would cost me $35-40, where for that much I can buy a quarter of shwag, and 15-20mg dexadrin, and get a much nicer high that lasts me so much longer.<br>suspended annhilation.\n\n\n"
}
