{
 "title": "Ecstasy, Friends and Memories",
 "author": "Smach^",
 "citation": "   Smach^. \"Ecstasy, Friends and Memories: experience with Ecstasy (ID 8394)\". Erowid.org. Jul 27, 2001. erowid.org/exp/8394",
 "substance": "Ecstasy",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8394",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2001",
   "Views: 7697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nSo my friends and I have been using 'E' for quite sometime now. We started around Christmas time and soon fell in love with it. In the beginning, we would take the pills when we went clubbing, normally 3 pills max. per night and clubbing meant every weekend. The 'high', even though I think the it's an understatement, was amazing. We felt connected with everybody and everything around us. We'd talk with anybody just because we thought people were the grooviest things in the world. But more than anything, between my group of friends, we had a connection. We would just love each other and see each other so differently from before. We always had the greatest times and best of all were the memories.\r\nNow, it's all different. The 'E' doesn't have the same effects as it used to. Our doses are higher, mostly because the effects aren't as prolonged as before. As doses went higher, so did the amount of money we're spending, which can be stressful at times. The drug isn't the same anymore for one major fact though, we know what to expect. It no longer has any surprises. We know what happens, how we're going to feel, what we need etc. etc. But we still love it. Our 'connection to the universe' isn't the same. The connection between is the same, but with exterior people, it's been lightened. But mostly, when we're using 'E' now, it's all for the fun. We always have only great memories and stories when using 'E'. Ecstasy is our drug, and will stay our drug.\n\n\n"
}
