{
 "title": "Adderall: Is There Anything It's Not Good For?",
 "author": "Anonymous Adderolic",
 "citation": "Citation:   Anonymous Adderolic. \"Adderall: Is There Anything It's Not Good For?: experience with Amphetamines (Adderall) (ID 8395)\". Erowid.org. Jun 28, 2005. erowid.org/exp/8395",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8395",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2005",
   "Views: 24084",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter reading through all of the reports written in the Amphetamine section with the keyword Adderall, I have noticed that one of my favorite things about the drug was rarely spoken of. Adderall makes you incredibly smart for the period of time the drug is in your system. I used to take Adderall occasionally during my sophomore year in high school, and I was amazed by how well it improved my academic performance. \r\nI would try to plan my experience on those days that I had major tests, as it greatly improved my scores. I most noticed an increase in my math skills. I made a 100 or higher (we had HARD bonus questions sometimes worth extra points) on almost every test I took in my Algebra II class while on Adderall (I have to say almost because one time I messed up and made a 99 instead). I believe that the drug increases the amount of your brain that you use, making it much easier to make solve problems. As you might have read from these other reports, it greatly increases your wanting to do stuff that you would normally not care so much for (like cleaning your room or doing the dishes). It's almost like you want to do these things, regardless of how much you disgust doing them normally. I often find myself almost dissapointed when I finish my homework, sometimes even doing extra work for no apparent reason at all other than to improve my new knowledge. I remember one time I had taken Adderall at school the same day before a long road trip. In the car I suddenly decided that I would attempt to teach myself Calculus, as it was the only book I found in the car. I opened the book and started on the first chapter, actually understand the problems and how to solve them, without any assistance or prior knowledge of the type of problem. I most likely could've finished a good part of the book if the sun wouldn't have gone down killing my light.\r\nI've also noticed from my many experiences on Adderall that it improves your memory quite a bit. I'm not so sure whether or not it increases the flow of information in and out of your synapses or not, but it sure does something to help. Not only are you more likely to remember something you learned while on Adderall, but while on Adderall you will also easily remember stuff you learned without Adderall. To put this much simpler : When you take Adderall, you'll remember things you learned in class much easier than you would without it. This is why it's ideal to take it on a test day - you'll easily remember all those stupid history questions you normally would've forgotten about.\r\nAfter reading all the other reports I found I've also noticed many people who have had bad problems with Adderall, and advise against using it because of them. Well I just have to say that I believe their problems are due mainly in part to the large amounts of the drug that they've taken. While I do admit it's very addictive, I believe that if you keep yourself under strict regulation (I've never taken more than 30 mg in a day) then your much less likely to run into problems. Also, frequent use, while seemingly a great idea after seeing how the drug improves every aspect of your life, is also something to avoid. Try to keep it to only once a week at max, and occasionally just pull yourself away from the drug for a month or two to keep it from becoming a regular part of your life. \r\nIn summary, it's great for improving your life, but keep in mind that it's been found to be 3 times as addictive as cocaine - so find your own limits and obide by them.\n\n\n"
}