{
 "title": "To See Enlightenment",
 "author": "Philosophi",
 "citation": "   Philosophi. \"To See Enlightenment: experience with 2C-E & Nitrous Oxide (ID 84036)\". Erowid.org. Jun 30, 2010. erowid.org/exp/84036",
 "substance": "2C-E & Nitrous Oxide",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "2C-E",
   "  T+ 1:30",
   "2 carts.",
   "inhaled",
   "Nitrous Oxide"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84036",
   "Male",
   " ",
   "Not Given",
   "Jun 30, 2010",
   "Views: 5772",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Prologue: Over the last two years, I have come to experience and appreciate the exploration of consciousness through psychedelic experimentation. During these last two years, I have familiarized myself with a variety of hallucinogenic agents. Since my first life-changing psychedelic experience  a miraculous medley of psilocybin mushrooms and dimethyltryptamine  I have revered this realm of experience. A deep intuition has led me to where I find myself at the writing of this experience report, and it is with this deep intuition that I relate to you the happenings of a most significant experience with the compound 2,5-dimethoxy-4-ethylphenethylamine (2C-E).</p><p>Experience:</p><p>This trip had been personally important to me for months prior to its happening. On this occasion, I finally had the opportunity to share my appreciation of altered states of consciousness with my girlfriend  heretofore referred to as Empathy. Empathy and I have been dating formally for several years and have been close friends for the entirety of both of our lives. If the soul exists, she is unequivocally the other half to the one we share. In addition to this, my first ego death instilled in me an inexplicable prophecy that my third ego death needed to happen with Empathy present. I waited patiently for the right combination of circumstances. The time had come.</p><p>I explained to Empathy my previous experience with 2C-E and did my best to familiarize her with it before dosing. When she was ready, I measured 15mg for Empathy and 25mg for myself. After dosing via oral administration, we sat together on her couch and talked of what was to be expected. </p><p>The come-up was near identical to my previous experience with 17mg of 2C-E. A gradual otherness crept into mind and body. My vantage point of experience began to feel increasingly separate from my body and my mind calmed the way it usually does before a storm of consciousness. Having navigated this before, I knew it was simply a matter of opening my mind to the pure experience and letting go before I was beseeched.</p><p>I spent much of the come-up catering to and staying attentive to Empathy. This being her first exposure to 2C-E, I wanted to make the trip as positive and enjoyable as possible for her. She mentioned a mild nausea and an upset stomach. I reassured her it was normal and would come to pass once we had discharged our nitrous oxide.</p><p>The shifting visual distortions Ive found to be characteristic of the phenethylamines started approximately 45 minutes after dosing. Empathy reported no change in consciousness at this point, preoccupied with her discomforting body load. Around 90 minutes after dosing, I sensed my state of mind and the 2C-E start to synergize. In part because I knew it would help Empathy, I decided now was the opportune time to try our nitrous. Empathy and I had agreed it would be preferable for her to go first. In this way, I could sit with her through her dissociation and let her come back down before starting mine.</p><p>I watched Empathy inhale her first charger of nitrous oxide and observed her behavior dutifully. She focused on her experience while I recalled my own first experience with 2C-E and nitrous. Toward the end of her comedown, she said her body load had been erased with the anesthetic euphoria of the gas. I was very happy for her. I loaded my charger into the dispenser, discharged it, and felt the cold of the metallic container spread to my hand. I moved to the carpet and relaxed myself back against the couch. I glanced around the room, tilted my head back, and inhaled the heavy gas from the container. My own body load subsided as my world began to shift and melt more remarkably, more frequently. I am now irrevocably immersed in my trip. This first charger was but a primer, my intuition tells me. The summit is nearing.  </p><p>Now Im here, I acknowledge, Would you like another charger?</p><p>Not right now, I dont think, but you can if you want to, says Empathy. </p><p>I prepare my second charger and assume a cross-legged position. I inhale a steady, deep breath. I clear my mind and do not move until my intuition compels me. I survey the melting, moving tectonic plates of the ceiling above me and the vibrating texture of the comforting carpet. I look over to my Empathy, who has been quietly observing me from her warm, secure spot beneath her blanket.</p><p>Im ready, I say, Dont be afraid, okay? I love you and I will always come back for you.</p><p>Im not afraid, says Empathy, I love you too.</p><p>I place the dispenser to my lips as I stare up at the ceiling. I close my eyes and instinctively begin to meditate as I inhale the charger into my being. My hand sets the dispenser down at my side as I assume an erect posture and lay my right hand inside my left, upon my lap. I immediately feel my body transmute into formlessness as I transcend the world of consensus reality. A luminous light appears in front of me. I feel my consciousness move forward and merge unto the luminousness. My being expands into boundlessness and can no longer differentiate itself from the profound interconnectedness of all things. I am eternity. I am pure experience. </p><p>When my physical body can no longer contain my experience, my eyes jolt open to a world full of wonder. I stand up and turn toward my Empathy.</p><p>Empathy, my voice utters as I manifest, Im enlightened. I burst into tears of limitless happiness and unwavering compassion. I can never go back. Truths upon truths upon truths enter my awakened mind. Empathy begins to cry herself.</p><p>Thank you for letting me go, I tell Empathy as I move toward her, my body overwhelmed with the consciousness it struggles to contain.</p><p>Youre welcome, Empathy sobs as she opens her arms to me.</p><p>We embrace one another and lie back down on the couch. I can do nothing but stare in awe at the world around me as I gratefully hold Empathy, who is soothingly brushing my hair with her hand. I try to summon the words to elucidate these truths for Empathy so that I may guide her in her path. But she calmly silences me and reminds me that I need not.</p><p>I wish so deeply that I could share this with you right now, I say.</p><p>You cant, says Empathy. Im so happy for you, but we have to do it for ourselves. Just experience it. You can tell me about it later.</p><p>I thank her understanding with a warm embrace and surrender myself once again to my peace. For the rest of the trip, I oscillate between the most complete happiness for the experience and the most genuine compassion for those who still suffer, all the while crying and laughing and smiling and crying. I contemplate what has happened, what can be done, what is to follow. Empathy and I  now intangible halves of the same whole  fall asleep holding one another.</p><p>Epilogue: </p><p>In the time since, I have had enduring understanding, thankfulness. I hold no more attachments to the illusion of the self or of the ego. I use traditional first person and possessive language because I feel it is necessary in this telling of my story and in my interactions with people in everyday life. These utilities are purely symbolic and are meant to communicate that. While I can communicate the knowledge, I cannot communicate the wisdom.</p><p>What I would primarily like to emphasize in addition to sharing my story is that under the appropriate mindset, setting, and circumstances, psychedelics can be very meaningful tools of discovery. Truly, I mean to illustrate only the potential of an experience, not a certainty.</p><p>May peace become you.</p>"
}
