{
 "title": "Mainlining",
 "author": "BurgerKing",
 "citation": "   BurgerKing. \"Mainlining: experience with 2C-E (ID 84056)\". Erowid.org. Apr 27, 2010. erowid.org/exp/84056",
 "substance": "2C-E",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.5 mg",
   "IV",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84056",
   "Male",
   " ",
   "Age at time of experience: 22",
   "Added: Apr 27, 2010",
   "Views: 6754",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There really isnt a whole lot to report here. Basically I was hanging out with a friend and we got the most amazing idea to shoot up 2ce. Apparently snorting it hurts. </p><p>So i throw 1.5 mg of 2c-e in a spoon and prep it for IV. Not a huge dose i thought. I had just snorted a lot so clearly I was a good judge of IV research chem dosage. And he trusted me. And I really regret ever pushing that plunger down. Because even though he is fine and nothing bad happened there was like 45 minutes of us being in new territory, not knowing what to do. </p><p>He kept thinking he was going to die. And even though im a bit of a pharmacist he was puking violently and sweating and honestly I did not know anymore whether or not he would live. I was worried. I was worried and tripping and he was 'tripping harder than he had ever tripped' and bitching about how i was experimenting on him. Even though I wouldve done the same thing to myself if I hadnt already seen him this way. </p><p>It seemed very unpleasant. Dosage of 1.5mg IV was non lethal but unnessesarily intense. the duration seems akin to that of snorting it. It was noted curiously that there seemed to be a minute of crippling sobriety. Prior to the psyechedelics taking hold when injected. HE definately knew what was about to happen and regretted the fuck out of it. Like watching a train come at you. but in your veins. </p><p>I will likely go IV with 2ce but ill go with micrograms and work my way up. basically. Dosages dont seem to be 1/10th nasal but more like 1/50th. Also take a second to think about the very real possible outcomes before you inject yourself with something you just bought online. There was a very real moment there where he and I both were unsure of his fate. He couldve died. Be careful. Shit almost got really really really real for us.</p>"
}
