{
 "title": "West African Gym Buddy",
 "author": "drugrugdoug",
 "citation": "   drugrugdoug. \"West African Gym Buddy: experience with Yohimbe (ID 84223)\". Erowid.org. Feb 2, 2011. erowid.org/exp/84223",
 "substance": "Yohimbe",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "Yohimbe",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2010",
   "84223",
   "Male",
   " ",
   "21",
   "Feb 2, 2011",
   "Views: 12032",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I bought a bottle of yohimbe about 3 years ago, and still have not consumed more than a quarter of the 60, 500 mg capsules. The reason for the delay in my usage is due to the fact that one dose of 500 mgs made me feel just awful. The desired effects of extreme arousal, energy increase, and and a desire to do physical activity were all present, but the nausea and the cocaine-like heart palpitations were too much to handle. So for about 2 years it sat on the shelf. Then one day, much like the good Dr. Hoffmann taking LSD-25 off the shelf, I decided to give yohimbe one more shot. I started taking roughly a quarter of a dose, which did little if anything. Then I tried to 250-300 mgs, or half a capsule. </p><p>At 300 mgs I feel all the effects with minimal side effects. I can still only eat small, light meals under its influence to avoid nausea, however, this is nothing compared to the so called 'adderall anorexia' that many speed freaks suffer from (i.e. not wanting to or being unable to eat on speed). </p><p>In my experience, the come up produces a sensation akin to that of cocaine or ecstasy on the come up. I feel warmth in my limbs, my heart rate slowly escalates, and may attitude shifts to a ' yes sir, can do sir!' mentality where I feel like I can kick some ass in whatever endeavor I am pursuing at the time.  Mental clarity is somewhat increased for me, while my mental processing speed is DRAMATICALLY improved. This was demonstrated clearly in how I played a video game online; I usually place 3rd or 4th in a match, but every time I have taken yohimbe and played I have been first, first, and first. In other words, it put me on a roll in Call of Duty 2 I could probably not have attained otherwise.</p><p>I feel motivated to lift weights on yohimbe; in fact this is the only time I actually want to work out, which is pretty sad. In this respect yohimbe has had a positive effect on my health and body image. Coupled with this effect is a sensation of true, pure, unadulterated masculinity. This sounds vary strange even to me, but I believe that this manly identity I gain reveals the true nature of yohimbe (perhaps the shamans of west Africa would concur) I believe yohimbe is a true plant ally if there ever was one. He is there to spot me when I bench press, there to cheer me on in the bedroom. And he is there after I work out to show me the progress I have made, as indicated by how much he has helped my muscle tissue and veins to expand and grow stronger.</p><p>In the bedroom yohimbe makes me feel like another person. Sometimes I feel like 'he' is controlling me, at others that it feels like he is just there for moral 'support.' I am usually a gentle lover, meaning I like to  build up slowly during sex and give my partner some say in what we do. Not with yohimbe. I am a god. I am THE MAN. I call the shots, and when I do, I execute them with extreme intensity and brutal force. This is great for my current partner, who is very submissive, but i I worry down the road about how my future partners will take to my yohimbe sex personality.  Again, I am not usually like this, but my girlfriend has not yet had any complaints!</p><p>I will continue to use yohimbe, but I hope to better utilize this plant ally in my exercise routine. I need to find some balance between getting pumped to lift and not puking up a hearty meal later on. I worry about possible contraindications, but so far I haven't experienced anything too to bad. Overall I would say yohimbe is a powerful drug that must be approached with caution, respect, and a general idea of what to expect from 'him.' He is a powerful plant ally that I feel is not given enough credit or respect for his abilities; instead he is so often consumed with other herbal preparations just to get guys an edge in the bed room. Respect him, know your limits, and the likely hood of a enjoyable, if not useful and healthy yohimbe experience will be much higher.</p>"
}
