{
 "title": "Grab Your Things, We've Come to Take You Home",
 "author": "Acorn",
 "citation": "   Acorn. \"Grab Your Things, We've Come to Take You Home: experience with Salvia divinorum (10x extract) (ID 8433)\". Erowid.org. Jul 27, 2004. erowid.org/exp/8433",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8433",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2004",
   "Views: 5207",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nJust would like to relay this story to you, which was relayed by someone to me....so I'll pass the baton!\r\nThis fellow who told me started off by saying that he thought the term 'hallucinogen' was quite a misnomer, since he believed anything seen, heard, or experienced through use of such substances was, as has been stated before, 'true' reality.  'Nothing is a hallucination, only things that exist that we rarely have a chance to encounter.'\r\nAnd then he began his story....I will relate it to you in the first person, as he did for me:\r\nI am quite an experienced psychonaut, and for better or worse, a real proponent of heroic doses.  Up until this point, my most intense experiences had involved (consecutively, not concurrently) the ingestion of 75 hits of blotter LSD on one night, and later on in the fall, 50 mg of MEO-DMT.  I wouldn't recommend this to anyone, up to and including myself, but you can't tell *anything* to some people.  In any case, for the purposes of this story, I'd like to start off by saying my experience with Salvia Divinorum left *those* two forays into the infinity of it all...well, in the dust!\r\nI got one gram of Salvia Divinorum 10x extract fortified leaf.  I seperated it out into 10 roughly equally-sized piles.  This, again, was throwing caution to the wind for two reasons: 1) I was only eyeballing the substance and 2) 1/10 gram of Salvia Divinorum 10x is probably too much for a first timer to do.  Please keep in mind, your mileage may (and probably will) vary, so play it much safer than me!  I put one of the ten piles into a spoon, then just tossed the rest of it back into that tiny ziploc-type bag.  I dumped the crushed leaf into a very small glass-pipe, lit it, and inhaled as deeply as I could.  Since I don't smoke anything at all, I didn't get what I thought was a very good draw off the pipe.  Nevertheless, I held it in as long as I could.\r\nMy girlfriend was with me as a sitter (I at least took *that* precaution) and we were sitting cross-legged, facing each other, on our bed.  After inhaling the smoke, I held it in as long as I could.  Within 10 seconds, I noticed familiar psychedelic visual 'distortions', and by the time I could no longer hold the smoke in, there was *no way* I was willing (or able, for that matter) to take another draw.  I set the glass pipe down on a book (Astral Dynamics, by Robert Bruce...I highly recommend it) on the bed.  Almost immediately after setting the pipe down, I lost contact with 'reality.'  I didn't close my eyes, but definitely lost all concept of the usual visual images of my room around me.  I was being playfully beckoned by a male entity behind me, up, and to my left...he wanted me to 'go with them.'  I asked where they wanted to take me, and they responded by saying 'Out with all the scenery!'  Immediately a Phil Collins song began playing, or the chorus at least, which says 'Grab your things, we've come to take you home!'  (mind you, there was no radio playing at all, and I don't even like Phil Collins...*didn't* like him, that is.)\r\nI immediately sensed that wherever this male presence wanted to take me was 'home.'  I could feel a strong pull, this time in the direction of the perceived male.  It was like the 'life force' within me was being pulled, primarily through the spot in the center of my shoulderblades, toward him, and presumably 'home.'  It was *very very* non-invasive, and not a bit frightening...more of his attempt to help me go 'home.'  I was assured that I could come back soon.  The only problem was that I didn't know how to go!  This was viewed with great amusement by the male presence, and a kind of 'understanding' acceptance.  My field of vision was occupied on either side of me by fields of lush green grass, with split-rail fences on the edges, hemming in the dirt country road I was on.  It was beautiful, and I was very happy!  I have absolutely *no* idea how long this lasted.  \r\nWhen I came  back to 'reality' I started explaining to my girlfriend in a very hushed voice what was going on.  There was an overlap of sorts of the two realities....that is to say, when I had regained a connection with 'reality as we know it', I retained a slight connection with the 'place' I had just been...like a double-exposed photograph.  I explained to my girlfriend about 'them' trying to get me to go 'home', and that I could come back, but didn't know how to go. I was visibly ecstatic, quite moved by the experience.  I explained about the fences, and I could still feel the pull, although it was diminishing.  Gradually, all of this wore off and I was back to baseline.\r\nI'd like to note a few things to clarify portions of this description.  I never once saw or heard the male entity, just 'felt' it, and knew definitely that it was male.  When I indicate anything said, heard, or seen, none of it was in the conventional way at all.  It was mostly 'sensed' quite vividly.  I felt things mostly as ideas and emotions.  I also don't belive I really 'went' anywhere, just accessed a different vibrational level of existence occupying the same space I was already in.\r\nAnd the guy's story ended there!\n\n\n"
}
