{
 "title": "Earthy Cavern - In My Head",
 "author": "O",
 "citation": "   O. \"Earthy Cavern - In My Head: experience with Salvia divinorum (5x extract) (ID 8438)\". Erowid.org. Jul 27, 2004. erowid.org/exp/8438",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8438",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2004",
   "Views: 11437",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had a slight headache, sitting on the couch, but I felt comfortable with the people and the environment, so I placed a large dose of Salvia 5x extract in the pipe.  I smoked one hit, held it in for 15 seconds, exhaled, smoked the second hit, put the pipe and lighter down, tried to get as comfy as possible, and after 15 seconds, exhaled.  Complete blank... my brain had shut off for a few seconds, and there was no sense of time to it - my brain was 'off'.  My view of time no longer existed.  I was just there, in this earthy cavern (which I later reflected on and realized the cavern was the inside of my head/mind/brain).  There was no contact to reality, but seeing as I had no mental functions - no sense of reason, no train of thoughts, I didn't know or care that I was supposed to be in some 'living room' and not in this cavern.  All I could do was observe.  </p><p>I saw pain (which I finally realized was my headache), on the left side of this cavern, just off the middle.  Everything was divided up into sections or 'chunks', like I was at one end of the cavern and vertical chunks made up reality of the cavern extending outward from me.  My headache was an intense warm pain, and it was so wonderful to be so close to that experience of pain, at the time.  The closest I could describe it to would be the pleasure of a newly-born creature experiencing something for the first time.  (It felt exciting and made me very happy).  Time was just starting to exist at this stage, and the thought crossed my mind that I am very confused, and I had not always been in this cavern (realization that I might actually be alive and 'be' something), but I was enjoying this place so much - it was warm, kinda comfy, just bizarre and foreign.  So I felt a strange panic as the thought crept back into me that I was supposed to be alive, and yet I wasn't aware of breathing or anything 'normal' for living things to do.  I wondered if I would just be confused (insane) and be there forever.  </p><p>Nothing was changing in that cavern as a seemingly-endless time progressed.  I was able to relax and melt into that panic, and I started to just enjoy the place thoroughly.  Then (an eternity later, it seemed) I realized that I had a body, and that I was in a room, and suddenly the 'cavern' was a projection - almost like an extra dimension to reality, that was blocking my view of 'normal' reality.  I suddenly got awareness of myself again, and realized I was smiling and feeling really positive.  Everything was funny... the whole universe, all of reality, was immensely funny.  I looked over to my left and the world snapped into view.  I saw C sitting there, and I tried to say 'I'm fine now'.  But my words were confusing to myself and I wondered if I was saying the thought that I wanted to express correctly.  But then, everything wasn't normal... that cavern reappeared, draped over normal reality, and I closed my eyes and just went with it. </p><p>Eventually (after this happened 3-4 times, turning to C and saying 'I'm fine' and then 'going back'), I got my sense, and the 'real world' slowly became reality again.  The break between smoking the Salvia, the lapse in my memory, and then being in the cavern seemed to not exist in 'normal' time.</p><p>It turns out that I had been sitting still the whole time, smiling, and occasionally waving my arms and trying to talk about 'chunks' (which were those sections or 'chunks' of the cavern).  I vaguely remember this, after-the-fact.  I was confused for about 30 minutes afterwards (it felt foreign to actually have to have trains of thoughts and actually remember things from 'before').  I didn't understand what people were saying very well, and I could clearly see what I wanted to express, but my thoughts weren't complex enough to create the words that would say/explain what I wanted to express.  So, it was a very interesting half hour - everyone was really nice, most of the people being at various stages in their 'recovery' to the normal world.  I was left with this 'impression' that the world was extremely funny, which lasted until this morning (and still a little now, and probably forever!).  I had really odd/cool dreams as well last night.</p><p>My thoughts and full mental clarity are just finishing their process of returning fully, a day later.  Salvia was the first hallucinogen I've tried, and I've never had a bad trip on Salvia.  I'm giving it a rest for a while now though - the experience is always so dramatic and strange, but it shakes up reality pretty well, and complete mental clarity comes slowly for me afterwards.</p><p>I'm curious to try other hallucinogens to see how they are different from Salvia... it would perhaps be nice to actually be able to have some notion of the 'real' (?) world during a trip, which is something I haven't yet experienced on Salvia.</p>"
}
