{
 "title": "LSD = Scary Eyes",
 "author": "Matthew",
 "citation": "   Matthew. \"LSD = Scary Eyes: experience with LSD (ID 844)\". Erowid.org. Oct 23, 2000. erowid.org/exp/844",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2000",
   "844",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 23, 2000",
   "Views: 10843",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMindset:  For about 6 months before the trip I had been severly depressed about many different aspects of life, spirituality, etc.  </p><p>Setting:  I had not been taking any medication of any kind before this time.  Several friends and I were on our way to another friend's house, having planned to do various drugs and spend the night at the location.  I had bought 3 hits and planned on dropping 2 of them based on my friend's recommendation (secretly, I took the third after arriving at the house).  The house where we were planning on staying was a warm and comforting location, with many 'trippy' lights and paintings and such, and overall very non-threatening.</p><p>Twenty-five minutes after taking the last hit, I began to experience various visual hallucinations, such as swirling walls and changes in color.  After about 2 hours I began to realize that things were happening that were not supposed to be happening (people and events seemed to be lagged in time), so I started to fight the trip.  I experienced paranoia, anxiety, negative thoughts and I would only let one certain person touch me because the others seemed to be bad actors trying to make me think they were people.  Someone said that it was only temporary, so I went into the bathroom to calm myself down by looking in the mirror and concentrating.  After 5 mintues of doing this it seemed as though everything began to spiral out of control, and I thought I had to get the drug out of my system as soon as possible by forcing myself to vomit as much as I could.  I was probably there for 10 more minutes vomiting before someone came in to stop me.</p><p>I had to be dragged home because I was screaming at anyone who would look at me, and I could not stay at the house.  At this point in the night I became too detached to remember what really happened, and what was just a hallucination, but I was taken home and my parents put me to bed.  During the night I got up to try to make myself vomit again (I don't know how long it had been since I dropped, possibly 6-8 hours) and when I looked in the mirror the whites of my eyes had been replaced with blood.  This scared me so much I went back to bed, to find out the next morning that that was real, and I had burst many blood vessels in my eyes and it would take more than 3 weeks to heal.  My face was bruised from a struggle that no one remembers happening.  I had to wear sunglasses because of the fact that my eyes made me look like a corpse.  the end.</p>"
}
