{
 "title": "Soft and Pleasant, but Risky..",
 "author": "AvalonX",
 "citation": "   AvalonX. \"Soft and Pleasant, but Risky..: experience with GHB & MDMA (ID 8450)\". Erowid.org. May 26, 2004. erowid.org/exp/8450",
 "substance": "GHB & MDMA",
 "bodyweight": "117 lb",
 "header": [
  [
   "DOSE:",
   "20 ml",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "  ",
   " ",
   "MDMA",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "8450",
   "Female",
   " ",
   "Not Given",
   "May 26, 2004",
   "Views: 12985",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First time: My dosage was monitored by a friend familiar with the substance, I don't remember the Mol strength of the solution.  I was at a party and drank the GHB with 4 friends, with very carefully dosed SINGLE shot.</p><p>The onset was pretty rapid and felt fairly soft.  Mood very good, touchy-feely v. friendly kind of effect.  But I noted that I could feel how easily it could go out of hand if the dosage went wrong and that was pretty uncomfortable.  Light tingling in the middle of my forhead reminded me of the last time I went in for surgical anesthesia...pretty scary, but went by after the initial onset of effects.  Onset was about 15 min. and lasted for 1.5 hrs. and I came down pretty softly and slept like a baby after clubbing.  No morning-after not-so-fresh-feeling (yay!).</p><p>Second time:  Went to a house-party after clubbing and taking very good MDMA with my girlfriends.  Met an aquaintance who offered GHB from a bottle (blue tinted).  I was very careful and tasted for strength and took a very (very) small sip.  The effects of the E seemed to be a tad heightened by the GHB, but not much more.  My friends weren't as careful and one ended up vomiting and the other passed out.  I played nurse for the remainder of the party.  MDMA is good for a Florence Nightingale feeling :-S  Lucky I have medical + basic chemistry training.  Anyways, will not try it again, since I feel it is much too risky for effects that are IMHO quite inferior to other alternatives.  In my opinion it's not really worth it.</p><p>PS: I might also mention that I have ADHD (attention deficit hyperactivity disorder) and take Ritalin daily, but never when clubbing or using other drug/medication/substance.  I don't know if that plays any part.</p>"
}
