{
 "title": "First-timer - Heaven & Hell",
 "author": "Bagman",
 "citation": "   Bagman. \"First-timer - Heaven & Hell: experience with Mushrooms (P. cubensis) (ID 8451)\". Erowid.org. Jun 28, 2005. erowid.org/exp/8451",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "3.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8451",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 28, 2005",
   "Views: 3371",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had always been curious about the hallucinogens, but never did anything heavier than grass before. So on a business trip to Holland popped into the local psychedelic shop and picked up about 3 g of Mexican mushrooms. I was a little bit apprehensive (not helped as the hotel had a strict no drugs policy) so took them slowly over the period of an hour in my room. After 70 minutes was just about to think I had been ripped off as nothing was happening, when I was watching TV and couldn't stop giggling for the next 30 minutes. This was not entirely comfortable as I was sure that half the hotel could hear me, but it was OK. The next hour and half was not so pleasant. Visually disorienting, and mentally confused, I paced around the hotel room trying to keep myself together. I couldn't look at anything to long before it disintegrated, so was constantly switching fields of view. The scary thing was probably more that I was unsure of whether it was going to get worse or whether I would totally flip, rather than the absolute level of the trip, and the feeling that it would never be over (I have never looked at my watch so much in my life). There was also a problem that I couldn't have asked anyone for help even if I wanted to, without being thrown out on to the street.\r\nAfter the longest 90 minutes of my life it started to settle a little, but now with lots of thoughts starting to come in about my life, relationships etc. Utterly exhausted, I collapsed on the bed, to be then overwhelmed by the most fantastic feelings of peace, clarity, and love. It was the closest thing that my atheistic soul would ever get to a religious contact. This lasted about three hours, when about midnight I finally fell asleep.\r\nIt was definitely a life changing experience. Based on the sort of conversations I had with myself at the end, I have given up alcohol, and meat (my wife has not been impressed, thinks she can never take me out to a dinner party again). I doubt whether I will do it again, the first part of the experience has put me off for life. But I am very glad I went through it. I don't think having someone with me would have helped - it was bad enough seeing faces on TV warp into werewolves, but to have the same thing happen to a live person next to you would be too freaky.\n\n\n"
}
