{
 "title": "Panic at the Party",
 "author": "Lex",
 "citation": "   Lex. \"Panic at the Party: experience with JWH-018 (sold as 'Bonsai Fertilizer'?) (ID 84520)\". Erowid.org. Mar 31, 2010. erowid.org/exp/84520",
 "substance": "JWH-018 (sold as 'Bonsai Fertilizer'?)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "JWH-018"
  ]
 ],
 "footer": [
  [
   "2010",
   "84520",
   "Female",
   " ",
   "17",
   "Mar 31, 2010",
   "Views: 12608",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience with 'bonsai fertilizer' aka. Spice. Was very powerful and overwhelming. Considering I had done spice before on occasion, I was still a lightweight. </p><p>I was with my friends driving when I had taken my first hit. It was good and I felt giddy and hyper (as usual). I wanted to have a good night so agreed to have another hit. This was another 2-3mg hit on top of what I had already had.</p><p>While my friend was driving I had the worst panic attack ever. I began hyperventilating, I became terrified, because this spice is much more of a visual than a sensational for myself, I began witnessing the car begining to shrink. I paniced. My friends (some of which were high as well) tried to calm me down. I sat terrified in the car, pulling on the handle to jump out. I got claustraphobic. I felt that people were out to get me. And I hallucinated that bugs were crawling inside the car.</p><p>Little to my knowlege that we were actualy headed to a birthday party, there were strobe lights, tons of people, and I was absolutely terrified. So terrified in fact, that I ran from the party at full speed, sprinting down the side of the road. Lol. At this point the sidewalk of the road stopped, and so I stopped too. I sat on the grass. Convinced that the stars were falling from the sky and were going to squish the partiers. Confuzed, I didnt know who I was, or where I was, what I was doing. Completely disoriented. My friend came and grabbed me. And took me to the car. Where I sat for the next 20 min blazed out of my mind.</p><p>My friend drove me to a park. Where I proceeded to run around in complete bliss for the next hour. </p><p>Needless to say. It was a terrifying. Blissfull trip.</p><p>About 3 hours had passed since</p><p>[Reported Dose: 3-5mg total]</p>"
}
