{
 "title": "My God That Toilet Door Was Whacky",
 "author": "KrazyFabi0",
 "citation": "Citation:   KrazyFabi0. \"My God That Toilet Door Was Whacky: experience with DXM (ID 8453)\". Erowid.org. Aug 15, 2007. erowid.org/exp/8453",
 "substance": "DXM",
 "bodyweight": "72 kg",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8453",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 15, 2007",
   "Views: 30960",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA few nights ago, I had an absolutely insane experience with a bottle of Robotussin DX.\r\nThis was my first dose of DXM, and after reading up o it, I was dying to give it a try.\r\nAs my DXM was kicking in, I was chatting to a friend on the net, and as I came up to the second plateau, I killed the computer and lay on my bed listening to GOA Head (GOA and PSY Trance CDs).\r\nAs per expected I appreciated the music a bit more, but nothing really special as I was lying on my bed still in a stationary environment with a steady stream of sound.\r\nThen, out of nowhere I got up to go to the toilet (down the hall), I looked to my right as I got up to look in my mirror and saw my own reflection - a dead body.  No shit.  I saw a lifeless human shaped piece of meat, my mind removed all previous assosiation from the object, and I just saw a lifeless zombie before me. - A Zombie that really needed to pee!  So I began the journey down the hall to the toilet...\r\nSpace, size, objects, and depth meant bugger all to me at this time.  I get the feeling I was going hard into my third plateau as I was robowalking down the hallway towards the toilet door.\r\nI was alone walking through my darkened house at 3am with a storm outside - this was one of the most intense drug experience I have ever had.\r\nWhen I got to the door, I opened it slightly and turned the toilet light on and looked at the door and handle.  My GOD it seemed the door was huuuge, like the door was a massive cliff face and I was hovering hundreds of metres above the ground, my god that toilet door was whacky.\r\nthe trip back down the hall was very strange in that the hallway seemed to be sloping uphill.  This was not correct.\r\nThe second I got back to my bedroom, I got back in bed peered over the edge of my matteress to see a massive drop off the side of a cliff to see my socks far below!\r\nI vaguely remember laughing at myself for being so mashed and still being sane enough to listen to my favorite CDs.  That night was so much fun.\r\nThe other thing I love about DXM is the fact that the comedown (if timed right) can be slept off and the amazing feeling I get when I wake up after a good hard DXM trip, how changed I felt.\r\nDXM - Wicked stuff\n\n\n"
}