{
 "title": "No Visuals, Just Terror",
 "author": "cadillac",
 "citation": "   cadillac. \"No Visuals, Just Terror: experience with 5-MeO-DMT  (ID 84543)\". Erowid.org. Apr 1, 2010. erowid.org/exp/84543",
 "substance": "5-MeO-DMT ",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1998",
   "ID: 84543",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Apr 1, 2010",
   "Views: 11941",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was obsessed with the psychedelic experience. I had taken LSD, various mushrooms, and smoked pot daily for the past 2 years. I was very interested in hallucinogens and in love with the idea of Timothy Leary's 'seven levels of consciousness'. I was eager to try the entheogens I had learned about in the course of my library research on the topic of 'anything mind-altering'. \r\nOne day, while looking through the back of High Times, past all the 'please don't smoke our REAL opium incense' and 'SUPER-caine' BS ads, I noticed a small ad by a company in Indiana selling amanitas as well as offering a catalog featuring 'roots, seeds, other botanicals'. I was thoroughly book-educated of amanitas and this is the first I had seen them for sale. I mailed off my $2 and anxiously awaited the catalog. When it arrived, I was immediately intrigued with it, even though products were listed only as scientific name, commom name, and price, with no specific info. Still I was amazed that all this was legal, and filled with wonder about the effects of some of the products of which i had never heard, such as toad venom and gymnopilus mushrooms. My first order was for amanita muscaria var. muscaria. A small brown package arrived via UPS 5 days after I called the order in, recited a legal disclaimer promising I am over 18 and understand the catalog's products are not sold for consumption. During my first amanita trip i don't know if I was more amazed by the effects of the mushrooms or the fact that I could actually order stuff like this legally. I was very happy with my new connection! \r\nMy second order a couple months later was for morning glory seeds, also a positive experience, and the catalog update shipped with this order contained a new section entitled 'pure chemicals.' Pure chemicals to me meant LSD etc. and I was totally clueless of research chemicals and even further intrigued by this new section of catalog. No product on this list was familiar to me, they might as well have been written in Sanskrit. However one product jumped out at me, n,n 5-Methoxydimethyltryptamine. I recognized the dimethyltryptamine and erroneously assumed this product was merely DMT chemically tweaked so as be made legal. I ordered 25mg for $25 plus S&H. A week later the UPS delivery man handed me the package and commented on how light it was, 'it must be a box of fresh air from Indiana!' He had no idea. Neither did I. I opened the box in my room, dug through the packaging peanuts and stared in awe at the tiny vial of gleaming whitish-clear crystals. I loaded my pot pipe with cigarette ashes with shaking hands and sprinkled less than half of the crystals on top. (This is a horrible way to measure such a small dose but a day after the horrible experience I took the remaining contents of the vial to a friend with a mg scale and there was 17 mgs left which put my dose at 8mg. [That is, if there was actually 25 mg originally]) \r\nI was nervously excited and expected an intense visual trip as I had read DMT delivered. I struck the lighter, held it above the bowl and slowly inhaled. The smoke was harsh but I held it to the count of 5, then exhaled. I counted to five again, felt nothing. Just as I was reaching for the vial to smoke the rest my heart began pounding out of my chest. I looked down at my chest, it was heaving from the force of my heartbeat, which must have been over 250 bpm. I jumped up in a wild panic. I was going to die. I didn't fear this, I knew it. I ran into the bathroom to hold my head under the cold bath tap. As i kneeled down, I realized my heart was beating so hard it was affecting my breathing. Inhalation was only possible in short gasps. As i held my head under the icy flow, I was praying to a God I didn't believe in to please, please make this stop, I am terrified. After what seemed like literally hours my heart began to slow. I was able to stand and I walked back into my room, just sort of paced back and forth running my hand through my hair. I noticed my alarm clock only 8 minutes had passed since I took that single hit, not the hours I thought I had spent on my knees in the bathroom. \r\nNow my heart has returned to its normal obedient, sane self and I am fine. I am so happy to be alive. The entire experience, from puff to me being able to sit back down on the sofa from which I started, lasted exactly 10 minutes. There were no visual effects, no shattering enlightenment, nothing that felt even close to the psychedelic experience. There was only terror. The next day I took the vial containing the remaining crystals to a friend who owned a very expensive and accurate scale. 17 mgs remained, putting my dose at 8 mgs. I described the experience to said friend. He asked if he could have what was left as he was sure I did not want it. I declined and dumped the contents of the vial down the toilet. According to my research after this, my experience is not common for a healthy young adult male, not on any prescription meds and not mixing the substance with any other. Suffice it to say I gave up on research chemicals and have stuck with the natural and well documented vehicles in the broad, and sometimes frightening, spectra of psychedelics.\n\n\n"
}
