{
 "title": "It's Pretty Ridiculous",
 "author": "Dave",
 "citation": "   Dave. \"It's Pretty Ridiculous: experience with 4-Methylmethcathinone (ID 84596)\". Erowid.org. Apr 30, 2010. erowid.org/exp/84596",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "4-Methylmethcathinone",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 84596",
   "Gender: Male",
   " ",
   "Age at time of experience: 17",
   "Added: Apr 30, 2010",
   "Views: 8320",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI've consumed about 15 grams of this total, and I'm satisfied with the effects, but obviously wary.\r\nAs far as insufflation goes, it's really not so bad. The euphoria hits in within 10 minutes, and it's a nice way to start off the inevitable binge. But it's definitely caustic, and I wouldn't recommend snorting it on a regular basis. \r\nMy typical experience goes like this:\r\nI look for some sort of vitamin capsule or something of the like, empty it, and fill it with the powder. If it doesn't get me high in 30 minutes, I take more (Very scientific I know). Some people say 50-90 mgs is good for them, but I prefer around 200 for a single dose.\r\nEarly on in my experience with mephedrone, there were hardly any noticeable effects leading up to the high, but these days I notice that anxiety sets in during that waiting period. I also tend to get the runs. The high is very clear-headed and bright. It lasts a few hours without redosing. The empathy is nice, but the explosive euphoria is much better. Redosing doesn't bring the peak back, but keeps me at a relatively elevated state. I consider it a pretty heroic accomplishment to avoid redosing. 4 out of 5 times I will redose at least once, probably a few times. \r\nI don't experience the short-term memory issues which appear to be common. There is a clamminess to my limbs after the peak, but I've never gotten any blue tone. One thing to note is the intense painkilling. I mean if I am sitting in a shower with nothing but steaming hot water turned on,  I am not going to notice it. So I'd watch out.\r\nOne very odd thing that happens to me is that, after long binges, there's this disturbing but temporary effect (lasting a couple hours or so) on my mind. Confusion is the best way to describe it. I'm unable to internalize certain thoughts such as 'what am I doing and why?' Everything becomes alien and information turns to white noise. Interestingly enough, I took ginkgo biloba for it one day, and it was actually very effective. Just a tip for anyone who experiences whatever that is, mild serotonin syndrome maybe?  In any case, going on a long binge is retarded.\r\nAs for the comedown, it widely varies. It can be suicidal to non-existent. Tramadol is extremely effective for me. It usually gets rid of it altogether.\r\nThe next day, I smell very pungent, like a mephedrone factory, so take a shower. Also, I notice my skin tends to take an odd tone for a while. That's basically the gist of it.\r\n(P.S. I would avoid.. masturbation..)\n\n\n"
}
