{
 "title": "Crushed",
 "author": "SKM",
 "citation": "   SKM. \"Crushed: experience with Cannabis (edible) (ID 84611)\". Erowid.org. Nov 14, 2011. erowid.org/exp/84611",
 "substance": "Cannabis (edible)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1.5 ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2009",
   "84611",
   "Male",
   " ",
   "16",
   "Nov 14, 2011",
   "3100",
   " "
  ]
 ],
 "report": "<p>I did not want to smoke very much, mainly b/c i didnt like the idea of smoke being in my lungs. as an athlete the idea just messed with me and made me think my performance would decrease. i had smoked weed for my first time around 3 months prior to this occasion. me and one of my closest friends had gotten some brownies from another friend who was not present during this experience. i just wanted to get high, which had not happened the first time i smoked which i heard was not uncommon. so i took the brownie and my friend (who knew a lot more about this stuff than I did) told me I should start feeling the effects in around 30-45 minutes. We played a game of fifa and by the end of it I could tell that he was getting pretty messed up and I was still completely sober. 30 minutes passed and he said to wait an hour and if nothing has happened I could take some more. </p><p>At the hour point I had only the slightest feeling of difference in my mood, nothing better or worse. I then proceeded to eat ½ more of a brownie which was a horrible idea. The effects from the first one kicked in almost instantly after I had eaten the 2nd. My feet began to feel very cold. I was walking around the room panicking about what was going on. I wasnt high; it was just a very scary 10-15 minutes where I asked for silence to try and figure this whole thing out. He suggested that we play another game of fifa to take my mind of myself. About halfway through the game I realized that I couldnt hold the controller any more and dropped it to the ground while laughing uncontrollably. Everything became funny in the room. Just looking at my friend made me burst out laughing. This lasted for maybe 30 minutes until I got the dreaded sleepzies. Wow, did I get hit hard by it. I slept on the floor for what seemed like forever, but was actually around 2-3 hours. I clearly should have not eaten the 2nd half of the brownie. When I awoke I felt pretty normal. I to this day smoke marijuana for fun and enjoy it to the fullest. I will never forget the first time I was high though.</p>"
}
