{
 "title": "Several Insufflations",
 "author": "BigJew",
 "citation": "   BigJew. \"Several Insufflations: experience with 2C-T-7  (ID 84685)\". Erowid.org. Aug 24, 2011. erowid.org/exp/84685",
 "substance": "2C-T-7 ",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 84685",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: 18",
   "Added: Aug 24, 2011",
   "Views: 4712",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Myself and a few close friends have had several experiences insufflating 2c-t-7 in varying doses. I will detail the most important details of each experience. Although there was one scary experience I feel that there is a disproportionately large amount of fear of insufflation of this drug.</p><p>1.\t12mg Snorted</p><p>Two friends and I decided we wanted to try snorting 2c-t-7 despite the known possibility of death. We had found that 2c-t-7 was very weak orally, took too long to come up, and lasted too long. Several weeks before we had each eaten 60mg of it and experienced visuals comparable to only 15mg of 2c-e but lasting about 10hours and with a very uncomfortable body load.</p><p>I am an 18 year old male, 175lbs. Friend 1 is 18, male, 145lbs. Friend 2 is 18, female, 165lbs. We all are experienced with LSD, salvia, mushrooms, 2c-E, 2c-I, 4-AcO-DMT, dextromethorphan, MDMA, diphenhydramine, and 4-HO-DiPT.</p><p>We measured out ~12mg lines each and proceeded to snort them in my friends basement. We had a sober trip sitter with us in case things turned bad. The first thing I noticed after snorting it was the taste/smell. The closest thing I can compare it to is an overpowering onion type flavor. And then it started to burn. Initially it was a numb pain in the nostril which quickly spread over the entire side of my face. And then the pain gradually became more sharp and intense until it felt like the entire right side of my face was on fire. We all became swollen around our chosen nostrils and our eyes were filled with tears. I went to the bathroom about 5 minutes after snorting it and looked in the mirror which is where I first noticed the visuals.</p><p>That was when we decided we needed to leave the house because my friends parents were home. We made our way outside and we all began to feel nauseas. Within several minutes we were all vomiting but immediately after we felt great -minus the burning nasal passage.</p><p>None of us were feeling like walking so we sat down in our trip sitters car and she drove us around for the rest of the night. We all spent most of the ride with our eyes closed, enjoying the incredibly bright and vibrant closed eye visuals and talking. The visuals were in the classic 2c-x chemical styling but much brighter and more vibrant than I had ever experienced them before. Cognitively, I felt much more capable than I had ever been on a psychedelic. We were able to talk normally all night without getting giggly and had no problem going into a convenience store to buy drinks. There was very little body load compared to an oral dose. The visuals lasted about 4 hours and I was able to sleep after 6 hours. I woke up the next day feeling great.</p><p>We all agreed that the first half hour was incredibly uncomfortable but was still far better than taking 2c-t-7 orally.</p><p>2.\t???mg Snorted in very small amounts</p><p>Several weeks later, a friend really wanted to try snorting 2c-t-7 but I didnt have my scale with me. I informed him of the risks and he chose to do it anyway. We decided the safest way to do it was to take out tiny amounts from the bag, snort them, wait 10 minutes, and then snort more until the desired effects were reached.</p><p>We scooped out tiny chunks which I would estimate to be about 1mg each time. I dont know how many chunks he did but eventually he got as high as he wanted to be. He said that the nasal discomfort was bad but his eyes didnt tear up and he never vomited. He is a very experienced tripper and said that this was the most powerful closed eye visuals hed ever experienced.</p><p>I plan on trying this method myself because it seemed to greatly reduce the discomfort of coming up while still giving the same effects.</p><p>3.\t20mg and 8mg snorted</p><p>Two more of my friends really wanted to try 2c-t-7 after hearing about the above friend. They snorted 20mg and 8mg respectively because I had my scale again. The friend with the 20mg dose had a very similar experience to my first experience and said he would do the same dose again. </p><p>The friend with the 8mg dose, however, just about scared me to death. Immediately after snorting it both of his nostrils began to bleed. And not just a slight drip of blood; it was pouring out of his nostrils. He plugged his nose so that the blood dripped back down his throat but then several minutes later when he started feeling sick he began vomiting up this blood. At this point I started getting worried because his nose was not stopping. I decided that if it didnt stop in 10 minutes I would take him to the hospital but fortunately the bleeding stopped soon after. The rest of his trip was pretty standard and he also said he would repeat that dose. I found out after that he gets frequent nosebleeds because of the lack of humidity in the winter. I wish he told me that before.</p>"
}
