{
 "title": "The Membrane",
 "author": "Phantom",
 "citation": "   Phantom. \"The Membrane: experience with Mushrooms, MDMA (Ecstasy), Nitrous Oxide, Cannabis & Clonazepam (ID 84711)\". Erowid.org. Jul 7, 2010. erowid.org/exp/84711",
 "substance": "Mushrooms, MDMA (Ecstasy), Nitrous Oxide, Cannabis & Clonazepam",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   "  T+ 0:00",
   "100 mg",
   "oral",
   "MDMA",
   "(capsule)",
   "  T+ 0:15",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 0:15",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 2:30",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 3:45",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 3:45",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   "  T+ 4:00",
   "0.5 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84711",
   "Male",
   " ",
   "Age at time of experience: 18",
   "Added: Jul 7, 2010",
   "Views: 4983",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: It was the final day of spring break, and I was looking for a way to end it with a bang. The evening really began with me and two friends in my friend's apartment, discussing plans for the evening over a few bowls of weed. I had recently picked up two 24 packs of nitrous canisters, and after a few whippits we contemplated a hippieflip. This idea soon manifested itself as we contacted our guy, who shortly arrived at the apartment to supply us with the mushrooms. </p><p>The timing on this is estimated, as time is difficult to keep track of in such a state. </p><p>T+00: Friends B, V, and I consume the mushrooms, wash them down with water, and then each swallow 100mg of MDMA, in a capsule. I'd had little to eat that day, and it was 9PM, everything was consumed on an empty stomach. </p><p>T+00:15: I'm beginning to feel the anxiety of having consumed mushrooms, and am beginning to feel nauseated. To subdue the nausea, we all move to the bedroom, smoke another bowl, and do a few more whippits. All nausea subsides. </p><p>T+00:30: After a brief visit to the bathroom, I notice while washing my hands that the water is extremely cool and strange to the touch. This is when the mushrooms began to take effect. I move into the living room to join B and V on the couch. </p><p>T+1:00: While watching TV for half an hour, I begin to realize I'm tripping hard, and I am no longer focused on the TV. I become completely enveloped in a mental funk, contemplating my life and regular drug use. No visuals yet. </p><p>T+1:30: B starts a movie on the TV and skips ahead to the middle of the film. V and I are completely confused, but more distracted by the shrooms. The room is filled with a bizarre dark hue of purple, similar to the shade of a black light. My mental state begins to slide from a negative funk to complete despair, contemplating suicide, overwhelmed by my perceived perceptions of family members had they encountered me in such a state. Strong patterning on walls and CEV. The TV screen appears to have large diagonal streaks of shadow, as if the screen was lit by an external lamp, which had been obstructed. I walk into the bedroom and consider doing whippits, but am overcome by my perception of my 'junkie nature' and am feeling quite overstimulated without nitrous. I begin to feel like I had bitten off more than I could chew, unready for such a psychedelic state.</p><p>T+1:45: I get up to use the bathroom, and return feeling refreshed, and aware the MDMA has taken effect. I am no longer concerned with others opinions, and am anticipating a good trip. When I return to the living room, there is a love scene in the movie and I am overwhelmed by it. I was unsure whether to laugh, cry, or react in any way. Emotions take over and I am overwhelmed by a swirl of fear, love, confusion, and sadness. I look in the mirror and into my massively dilated pupils. The color of my iris appears to be swirling into my pupil and fading into the black. Fascinating. I am also unsure of the color of the bathroom walls, and feel strongly inclined to ask V for a second opinion. </p><p>T+2:00: I return to the bathroom, urinate, and then stand staring at the wall. I touch the wall, and still cannot tell the original color of the walls. The texture of the walls was also amazing. </p><p>T+2:00: We ditch the movie and begin listening to music. The three of us were babbling incessantly about how hard we were tripping, and began sliding off of the couch and rolling on the floor. B bumps into my leg and I am overwhelmed by the sense of touch. At this point we decide to do whippits. </p><p>T+2:30: V collects all nitrous canisters, plastic bags, and the cracker, and we settle in the living room. After much fumbling around with uncoordinated hands, we cracked a canister in a plastic bag, and I inhaled the gas. At first, I feel unchanged, then I am hit with what feels like a wave of physical force and I slide into the couch, feeling as if I had pierced some invisible membrane, followed by a feeling of being released to float free. I was suddenly immersed in a white hot void, filled with only the music in the background (Poison Lips by Vitalic). I felt a rush of pure euphoria and ecstasy greater than anything I had experienced, thousands of times stronger than orgasm. I debate whether such an experience could be topped by anything else in the world. I thought I died. I then slowly slipped back into awareness of my body, and was in awe of such a pleasurable feeling. Music was divine. I felt a strong sense of finally getting exactly what you want, and realized I had achieved my ideal high. </p><p>T+2:35: B and V both take hits of nitrous and slouch onto the sofa, completely overwhelmed. We all come to and listen to the music, and contemplate doing another hit. I was hesitant after such an extreme rush, but V was insistent on doing more nitrous, so I followed suit. The second time I wasn't quite as overtaken, but the sensation was still incredible as I melded into the couch. </p><p>T+3:00: we've consumed one of the 24 packs by this point, and it is a brief moment of clarity, and we all exclaim in shock, 'They're all gone?!' At this point I retrieve another box of canisters and we continue. The canisters are piling up on the floor and couch, and we talk about how other people must think the three of us are crazy. I begin to babble about how people have such a drive to achieve such bizarre mental states, and how we had collected every manmade device for deriving serotonin in one room, and how good it really felt. </p><p>T+3:30: We continue doing whippits, and suddenly become aware of the time. V nailed it when he said 'You just never want this to end. Like I wouldn't have any problems with just doing whippits while hippieflipping at midnight for the rest of my life.' I couldn't have agreed more. I was starting to feel overstimulated and decided to try and calm things down by smoking another bowl of weed. </p><p>T+3:45: The three of us move back into the bedroom, and I grab way more weed than needed and ground it all up, exclaiming how we were gonna 'smoke all this tonight man!' The bong made it around the circle once, and I take way too big of a hit. I take the entire thing, exhale, then fall into a spasm of uncontrollable coughing, and begin to fear dying. I then took a sip of water, and began to relax, steering away from the verge of vomiting. I am suddenly aware I need to be home in 15 minutes for curfew. All concern falls by the wayside as B hands me another bag filled with nitrous. I inhale the bag, and my vision goes dark. I flop back on the bed, and stare at incredible paisley patterns on the ceiling. I sit up and everything is stretched vertically, I am confused by such realistic visuals, but stand up and move into the living room, where I decide I'm going to 'straighten out' for the drive home in 15 minutes. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>T+4:00: Everyone is still tripping and rolling hard. B is very red in the face. V is looking more and more frazzled. B leaves, and I debate spending the night, but then we decide to leave the mess of nitrous cartridges and weed and clean it up in the morning. I drive V home, and am having little trouble driving. There are no cars out on the road. I arrive at my house and drink a glass of fruit juice. </p><p>T+4:00: After staring at the granite kitchen counter for a while, I move upstairs and get ready for bed, but still rolling and tripping. Pupils are still huge. I am delighted by the feeling of my electric toothbrush, swallow .5 mg of clonazepam, and drink some water. </p><p>T+5:00: I feel the clonazepam take effect, and feel as if I am melting into my chair as   I browse the internet, listen to music, and stare at the visualizer. Minutes feel like hours. I strike up a conversation with a girl online that I hadn't spoken to in 2 years, and then lose interest. I visit the bathroom one more time, and then climb into bed. My sheets feel amazing, but the clonazepam was on my side and I quickly fell into a sound sleep. </p><p>The next day I felt pretty spaced out, and some minor visual hallucinations such as slight shifting of objects, but had no major headache, little depression, and had a solid appetite. I've decided to take a couple weeks off from any substances after such a night, and I need to weaken my tolerance after smoking daily for almost 6 months. Overall it was an incredible experience, and someday I wouldn't mind repeating it, but for now, I'm plenty satisfied with my present drug experience.</p>"
}
