{
 "title": "A Pleasant Evening",
 "author": "Perdido",
 "citation": "   Perdido. \"A Pleasant Evening: experience with 5-MeO-DALT & Syrian Rue (ID 84710)\". Erowid.org. Jun 22, 2010. erowid.org/exp/84710",
 "substance": "5-MeO-DALT & Syrian Rue",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 g",
   "oral",
   "Syrian Rue",
   "(seeds)",
   "  T+ 0:30",
   "85 mg",
   "oral",
   "5-MeO-DALT",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "84710",
   "Male",
   " ",
   "20",
   "Jun 22, 2010",
   "Views: 6398",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Summary: 80mg of 5-meo-dalt with 0.5mg of syrian rue produced a strong (+++) psychedelic experience. Time dilation CEVs, OEVs, and enhancement of all other senses. Slight nausea experienced by one individual, strong nauseau and vomiting experienced by the other. Body buzz/vibration noted during come-up. 5-meo-dalt has strong empatheogenic effects, and also a very sexual nature (in the right setting). A wonderful experience.</p><p>Duration: 5 hours.</p><p>12:00am</p><p>A 145lb male and a 115lb female each took 0.5g of syrian rue.</p><p>12:30am</p><p>Female consumed 75mg of 5-meo-dalt, male consumed 85mg. The male found the come up period to be pleasant and interesting, except for some body tension in the back of the neck. The female started to become uncomfortable and nauseous. It should be noted that both individuals had consumed thai food 6 hours previous, which contained both tofu and soy sauce (a bad combination with MAOI's).</p><p>1:00am</p><p>Female is experiencing intense waves of nausea, male feels slight butterflies in stomach that he usually experiences when consuming any psychedelic. He also notices an intense body buzz, he feels like he is vibrating. He becomes paranoid that his heart rate must be elevated, but it is 96bpm. Music is no longer pleasant at this point, the male finds it sinister and the female finds that changes in light/sound/touch make her feel unstable and more nauseous. Both move to the shower to distract from the come-up and hopefully be comforted by the warm water.</p><p>1:00am to 1:45am</p><p>Both are laying in the shower under a stream of warm water. The male is distracted by many droplets of water that sit on their skin, which are extremely interesting and seem to be embossed. He holds his hand so that his fingertips are parallel to the stream of water, feeling the drops hit directly on the pads. This is a very pleasant sensation. The female reports feeling better, though extreme nausea still comes in waves. The wall of the shower has a slight bulge in it, but to male and female it looks like the wall is 9 months pregnant. At some point the female gets out of the shower and empties her stomach into the sink (oops). After vomiting she reports that the nausea is gone and that the psychedelic effects have suddenly kicked in.</p><p>2:00am</p><p>Female comments a few times that we need to get out of the shower (the male has been in and out of the shower for the past 15 minutes, closing windows and adjusting the thermostat), but that she is trapped. She is fascinated by the pool of water in the bottom of the shower, until male helps her stand up and step over the raised edge of the shower. OEVs have begun, with the usual mystical/fractal patterns appearing on surfaces and embossing of textured surfaces. CEV's are apparent.</p><p>2:15am</p><p>Both persons have made it out of the shower and onto the mattress in the middle of the living room. Music is extremely pleasant, the fleece blankets feel amazing, and time dilation is noted. Male and female note sudden intense arousal, and some time is spent kissing each other's hands and fingers. Sucking on eachother's fingers and touching teeth/tongues/roof of mouth feels orgasmic. The peak of the experience is starting.</p><p>3:15am to 4:00am</p><p>Peak has passed but effects are still strong. Male and female continue touching, talking, listening to music. Male and female spend some time discussing their relationship and their mutual friends (this drug has strong empathogenic effects).</p><p>4:15am</p><p>Female falls asleep. Male is still experiencing CEVs/OEVs and altered thought, and feels very alert. Male considers going for a walk (it is a lovely early morning), but decides to stay inside.</p><p>5:30am</p><p>Effects are mostly gone for male. Sleep.</p>"
}
