{
 "title": "The 'All-Knowing'",
 "author": "JayBee",
 "citation": "   JayBee. \"The 'All-Knowing': experience with Ketamine & Salvia divinorum (20x extract) (ID 84804)\". Erowid.org. Jun 27, 2010. erowid.org/exp/84804",
 "substance": "Ketamine & Salvia divinorum (20x extract)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   " ",
   "1 g",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84804",
   "Male",
   " ",
   "20",
   "Jun 27, 2010",
   "Views: 4984",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This, by far, was the most powerful and meaningful trip of my entire life. I am very experienced in the use to both ketamine and salvia, but I was shocked by the combination of the two.</p><p>A friend of mine and I had been lounging-around doing bumps of ketamine all night, kept the buzz going and chilling out. I felt like I needed a little extra kick, so I asked my friend if she wanted to do Salvia. She didnt want to take my offer but was more then happy to be my sitter as I was the guinea pig. So, already being quite high from ketamine, I had no fear going into the trip. Which Im sure helped a lot.</p><p>I took a big toke of salvia (20x) and held it in. As I was holding it in I looked over at my friend and watched as my reality split up. I exhaled and then boom! My life, as I knew it had paused. All of the sudden I was in complete darkness. I got that familiar feeling of being all knowing that I usually get when I do Salvia. I understood everything about life and all its questions, forgot about the problems and anxieties of a human being. Basically, I died.</p><p>Then, suddenly, bubbles appeared. Each bubble represented a life, a past life, and I was in the center as they all floated around me. This is strange because I never really believed in past lives before. As I looked at these life bubbles I experienced them in their entirety. I could remember everything from every one of my past lives and it was as if I lived a million times over, birth to death. </p><p>But then one life bubble caught my attention. It was different from the rest. Something was missing from it. I then heard this voice saying this ones not complete yet and I saw that, indeed, it was not a full life bubble. Instead of being an O it was more of a U. As soon as I saw this incomplete life bubble, I zoomed into this life. It was like I had to start from the beginning and fast forward to where I was last in my life, like watching a tape. I began to remember who I was as I watched my life flash before my eyes. Then, BANG! I was back into my body. </p><p>It took a while for me to gather myself and think about what just happened. But all in all, I believe the mix was helpful. Salvia alone, I tend to forget the experiences. But when mixed with ketamine it slows the process down, makes it easier to understand and comprehend. My friend told me that I said this ones not complete out load during my trip, which I find interesting! </p><p>It was life changing. I enjoyed it thoroughly and I would do it again in a heartbeat. Though, I am not sure if there is much else to learn from the combination. I feel like Ive learned all I can from it.</p>"
}
