{
 "title": "Not Fun; Spent the Day Lying in Bed",
 "author": "wizard of az",
 "citation": "   wizard of az. \"Not Fun; Spent the Day Lying in Bed: experience with 2C-P (ID 84868)\". Erowid.org. Apr 15, 2010. erowid.org/exp/84868",
 "substance": "2C-P",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6 mg",
   "oral",
   "2C-P",
   "(powder / crystals)",
   " ",
   "350 mg",
   "oral",
   "Pharms - Carisoprodol",
   " ",
   " ",
   "12.5 mg",
   "oral",
   "Pharms - Doxylamine",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84868",
   "Male",
   " ",
   "Age at time of experience: 19",
   "Apr 15, 2010",
   "Views: 9719",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dose: ~6mg (oral aqueous)</p><p>Time: 12:30</p><p>[written at t=0 (12:30)] I dissolved 100mg into 125grams of water at room temperature.  90 minutes later, it still hasnt really dissolved, but rather formed a suspension.  Its kind of annoying.  I think it will dissolve eventually.  I am a little worried about the accuracy of my dosage.  The water I used was not distilled, but rather tap water (drinking fountain) that I let sit exposed for 3 days to get rid of dissolved chlorine.  I hope it worked.</p><p>Just ingested it  7.5mL of water containing 6mg 2C-P (1mg per quarter teaspoon).  Taste lasted for under 5 seconds.  It was somehow reminiscent of wasabi. I didnt get much sleep last night, maybe 4.5-5 hours.  I hope this doesnt affect the experience too heavily.  I avoided my usual morning Adderall, caffeine (coffee), and citicoline.  With the caffeine and citicoline, I was not worried about interaction, but rather I wanted to avoid the laxative/gastroprokinetic effects I experience with these drugs.  I have been off mirtazapine for 5.5 days.  I took melatonin last night and, of course, smoked cannabis.  Havent smoked weed (yet) today.  </p><p>This was my first phenethylamine.  I would liked to have started with a perhaps gentler or more mild 2C.</p><p>[t=.25h] I feel different.  Relaxed but excited.  Bit of a headache.  </p><p>[t=1.5h] I feel sick.  GI upset (mild).  Nausea (was extreme for a few moments).  </p><p>[The following was written the next day, before 3:00pm] The GI upset and nausea went away (mostly) for the next ten hours.  Next day there was mild diarrhea.  I got the body kinks people speak of.  This seems vasoconstrictive.  This, along with a report of sinus clearing (see Pihkal) suggests an adrenergic component.  I worry about potential cardiovascular damage.  </p><p>The experience was not fun.  It was far from pleasant.  I experienced no severe emotional distress while on the drug.  However, around the 9th hour, I started getting bummed out about the duration.  I just wanted to sleep.  I was exhausted.  This drug is physically and psychologically very draining.  Regardless, I see incredible therapeutic potential in this drug.  Even at my low dose (6 mg), I realized how intense and unforgiving 2C-P could be.  </p><p>I spent the day lying on my bed.  There was none of the stimulation people have spoken of.  My body hurt, and movement was very uncomfortable.  Fortunately, I saw little reason to move for most of the next eight hours.  In fact, I felt rather tired.  The sound distortion was pretty intense.  It would mix somehow with my somatosensory awareness (skin was more sensitive, and objects felt very different; heavier and rougher), causing the perceived shape of my body to become distorted.  Occasionally, there was considerable hilarity.    </p><p>That night, I used 350mg carisoprodol (sedating muscle relaxant) and 12.5mg doxylamine (pretty much like Benadryl).  I feel like this may have helped immensely with the physical pain and insomnia.  I suffer from chronic insomnia, so I was pretty concerned about not being able to sleep.   </p><p>The next day, even after eleven hours of spotty sleep, I feel drained, emotionally and cognitively.  </p><p>I am also thinking in some psychedelic thought patterns.  I feel pretty empathetic, and I dont think I can be angry, arise such a cause.  This reassures me about 2C-P, and I will try it again at some point, despite many unpleasant aspects of this drug.  In the meantime, I hope to get more enjoyable effects from 2C-I and 2C-C.  </p><p>[The following is written around 5:00pm the day after ingestion] Or at least, I did, until I smoked a little weed.  Then I felt great.  Colors were vibrant, and the world around me was beautiful and fascinating, visually.  It was in fact, a very nice, sunny, bright day.  I was finally able to eat comfortably.  My short term memory is completely shot though.  Next time I ingest a psychedelic, I will try smoking weed with it.  I have been reluctant to do this so far due to worries of extending the experience too long.</p>"
}
