{
 "title": "Seroquel Mindfuck",
 "author": "Storm_420",
 "citation": "   Storm_420. \"Seroquel Mindfuck: experience with Quetiapine (Seroquel) (ID 8488)\". Erowid.org. Feb 10, 2004. erowid.org/exp/8488",
 "substance": "Quetiapine (Seroquel)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Pharms - Quetiapine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8488",
   "Male",
   " ",
   "Not Given",
   "Feb 10, 2004",
   "Views: 57573",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was with some friends one night, sitting around smoking a j. One of them said that he had some pills - muscle relaxers, he said. He handed me one and I examined it, as I usually do with pills that I don't know about. It was a white circular pill with -Seroquel- and -200- imprinted on one side. I decided to wait to take it until I could get to the handy-dandy PDR.</p><p>The next day I got online to check it out. It turned out to be an antipsycotic, not a muscle relaxer, as my friend had said. I was skeptical about taking it; Antipsycotics can be scary stuff if you don't need them. I said what the hell and took it. Two hours later when nothing had happened, I said 'Oh, well. It was free.' When my roommates came home (about an hour later) we were cleaning house. I was doing dishes, when all of a sudden Zang! - I was gone without any warning whatsoever. I struggled through the dishes, and made up an excuse to leave, because my roommates are straight, and they have a child (I don't like to trip around children - they ask too many questions).</p><p>I had to drive to my brother's house several city blocks away (NOTE: It's my opinion that driving under the influence is incredibly stupid and dangerous). The drive there was terrible, like being really drunk. When I got to my brother's, some of friends came over for some beers and blunts. My brother suggested I not drink any beer, and I agreed. I did smoke a little of the blunt, but didn't feel anything because of the Seroquel. I kept having to get up for some reason, even though the body high was like a Dramamine high. The mindfuck wasn't as bad, but I was still pretty loosely screwed on. I had trouble making out what was going on in the movie they were watching. Certain things on the screen would be very hard to figure out in my mind. </p><p>As the evening went on, I slowly got more sober and more talkative, which was good because I drive back to go to sleep for work the next morning (7AM, and I couldn't call in, because one of my roommates is the manager).</p><p>Overall, it wasn't worth the risks. I could have easily ended up in the hospital or had siezures, or some other ill shit like that. I knew I was taking something powerful, but I had no idea it would be like that.</p>"
}
