{
 "title": "One Helluva Drug",
 "author": "Bleh123",
 "citation": "   Bleh123. \"One Helluva Drug: experience with Amphetamine (Adderall) (ID 84909)\". Erowid.org. Jul 15, 2010. erowid.org/exp/84909",
 "substance": "Amphetamine (Adderall)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 1:20",
   "200 mg",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84909",
   "Male",
   " ",
   "Age at time of experience: 17",
   "Jul 15, 2010",
   "Views: 47191",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On the first night of spring break '10, I decided to try out some Adderall. I had just bought 10 pills at school that day from a friend, for $4 per 20mg Adderall IR pill.</p><p>I've always thought of myself as a 'hallucinogen guy'; I've thought that other drugs may put you in a good mood or make you feel good, but shrooms and LSD are relatively harmless to the body, and have the potential to give you meaningful experiences. But on this first friday night of spring break '10, I learned how awesome amphetamines are.</p><p>I think that a good way to describe the effects is that it was a combination of the 'good' aspects of: a 300-400mg caffeine dose (increased focus, energy, less boredom, faster thinking) and hydrocodone (my body felt good in a way that's best described as 'smooth', and a sense of well-being). It's worth noting that I didn't get any effects similar to: caffeine's jitters/anxiety or hydrocodone's 'stoning' effect.</p><p>Here's a timeline of what happened, and i was taking notes as things happened, so it's not just my 'best guess' at a timeline.</p><p>T+0:00 (7:43pm); I took 20mg of generic Adderall IR (the pink 'COR135' kind. Many people claim that the pink generic kind effects them differently from the brand name Adderall. Normally this would seem like hogwash, but apparently a LOT of people feel this way). I hadn't eaten for 7-12 hours beforehand, so I believe my stomach was empty.</p><p>T+0:30; nothing yet, other than some very subtle 'effects' which are likely placebo. I'm playing Counter-Strike Source on my PC while waiting for effects.</p><p>T+0:45; (Sorry, I can't read this one-word note, but I know that there were no strong effects yet)</p><p>T+1:00; Effects are here. I feel as though my focus is incredibly channeled. My notes were 'power/tunnel/focus vision/consciousness'. Obviously that's not a complete sentence, but I feel that it was a good description of what I was feeling. Whatever I looked at, I was VERY focused on, as though my vision and my consciousness itself were entirely honed in on whatever I was focusing on. This was only noticeable when staring at something, not when actually doing things. My calculus practice test is VERY interesting due to the adderall, I'm enjoying this more than I usually enjoy computer games.</p><p>T+1:10; Listening to 'The Crystal Method' (great band), and their music sounds even more amazing than ever. Their music style sometimes has many 'layers' to it, and it feels like my (high-quality) headphones are playing 5 songs at once, and I can enjoy each of them with my undivided attention. Also, my room is still fairly cold (62f), but I don't feel cold anymore. My body is feeling really goooooood and smooth, like it does on hydrocodone. I still find the calculus work very interesting/fun.</p><p>T+1:20; Heart rate: 85 BPM. This experience is so awesome that I decide to supplement my experience with a 200mg caffeine pill. I walk downstairs to get some water to take my pill with, and I talk with my dad. It's funny, it felt like I had to focus on speaking INCREDIBLY SLOW and it still sounded a bit faster than normal.</p><p>T+1:30; As I wrote in my notes, 'It feels like I'm living 20-25 minutes for every 10 minutes of clock-time'</p><p>T+1:40; It snuck up on me, but I realized that I had to piss really badly.</p><p>T+2:00; Had to piss again</p><p>T+2:10; Starting listening to Tiesto's 'Elements of Life' Album. The song 'Everything' is written about ecstasy (lyrics are: 'Everything sounds better, everything looks brighter' etc.), and I feel like I finally can understand what the lyrics are talking about, now that I've taken adderall and seen what amphetamine's effects are like. Music still sounds very good, though slow tracks make me impatient.</p><p>T+2:20; My room is cold(59f) with the windows open, but I've stripped down to my T-shirt and still actually feel warm.</p><p>T+2:25; For the third time in less than an hour, I have to piss urgently. I'm still contently doing calculus homework, which is definitely an effect of the drug.</p><p>T+3:15-3:45; I decide to masturbate on the drug, to see what it's like. Here are my notes: 'Jacking it: Progress is slow, and brief pauses (in masturbating) pull me way backwards (further from orgasm). I even got flacid while watching porn if i stopped masturbating for even a minute. Amphetamine was definitely still effecting me, as I could tell from how long it was taking to hit orgasm.' In my personal experience, this was similar to masturbation on opiates.</p><p>T+4:00; Effects seem to be slowing down. </p><p>T+4:30; Playing Counter Strike Source online. It seemed as though I had superior fine motor control when aiming, etc.</p><p>T+8:15; It's now 3am, and though I'm not tired, I force myself to sleep, so as to not mess up tomorrow. Keep in mind caffeine could be partially responsible for my non-tiredness, but honestly, I'm not effected much at all by 200mg 7 hours later.</p><p>I did not feel bad the day after. Adderall is one helluva drug, but be careful, because it's tempting to use it more than I really should.</p>"
}
