{
 "title": "LSD Über Alles",
 "author": "johnny shit",
 "citation": "   johnny shit. \"LSD Über Alles: experience with LSD & Cannabis (ID 8491)\". Erowid.org. Jun 29, 2005. erowid.org/exp/8491",
 "substance": "LSD & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 drops",
   "oral",
   "LSD",
   "(liquid)",
   "  T+ 1:30",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 15:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8491",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2005",
   "Views: 3416",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOn the night sometime in my twisted life, there was a sort of panic. The last of the acid vile my friend had bought a few nights before was looking dismal, only like fucking five drops left, god damn I said as I took two drops to myself and my friends did the same. We decided to eat before it kicked in, veggie Chinese, mmmm. Well about half way into the meal my head was starting to collapse on itself and the spinning swastika in the color wheel in the restaurant wasn't helping. What is going on I thought I still should have a good 45min before it kicked in? Then I thought could it be since it was the last in the vile it had some how collected itself on the bottom turning into some kind of super LSD. By the time I thought about it my mind was lost I through some money on the table and got the hell out, let my friends deal with those bastards I thought.\r\nAs I waited outside I could feel this intense wave coming over me, I need some weed to calm me down I suppose? When we got back to my house we immediately fired up a bowl. By that time we where all gone to some kind of other plain. This acid felt like it was right from gods own stash some real holy shit. Everything was melting away, everything that came out of my mouth was complete gibberish and my sight was masked by some kind of creature molding out of the bush in front of me. The weed did nicely though a nice additive to this insane drug of choice. We decided we should go where theirs some people, then we could really feel god I thought. We called up some hired help (a sober friend) and we were off. The only obstacle now was getting from the parking lot to the main area for loitering without hurting anyone or completely loosing it. Luckily there was a tram for that purpose, the announcer guy had some real Brady cracked out voice with the enthusiasm of a tweaked out gorilla. I couldn't stop laughing and my friend next to me looked like he was going to burst,  we both just stared ahead trying not to say anything but then the moment came about half way into the ride, the announcer 'uh sorry folks for the delay but...' what did he say I thought, as the tram stopped, everyone was babbling around me about someone or something falling off. All I could think was ...........\r\nAs all of us (temporarily insane kids) couldn't hold in the laughter, about this unfortunate side dish to our already deranged main course. We laughed all the way to the terminal while screaming obscenities to each other. I wondered what people thought, did they know I was seeing there eyes fall to the ground while there face melted away? Did they know that is what I was laughing at? As we got off that death trolley we found ourselves in a frenzy of over weight tourists, and beenie baby kids which was not a good combination with the thoughts I was having. The patterns on the ground made some sort of circle that I found myself walking until I noticed that I had been walking around again and again and I stood back to watch my sober friend continue to lead acid dazed people on some sort of Nazi goose chase. That bastard I thought I should cut out something of his and mail it to his uncle but then I realized he was my ride home and gave up this notion. After a long walk around this rat infested hell whole we began to loose it and went home. My high was starting to ware off so I decided to smoke another bowl and eventually fell asleep (at like 9 the next day).\r\nFin\n\n\n"
}
