{
 "title": "Clean High With Bad Hangover",
 "author": "BOSS",
 "citation": "   BOSS. \"Clean High With Bad Hangover: experience with Oxymorphone (Opana) & Alcohol (ID 84910)\". Erowid.org. Aug 28, 2010. erowid.org/exp/84910",
 "substance": "Oxymorphone (Opana) & Alcohol",
 "bodyweight": "208 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "insufflated",
   "Pharms - Oxymorphone",
   "(ground / crushed)",
   "  T+ 0:30",
   "5 mg",
   "insufflated",
   "Pharms - Oxymorphone",
   "(ground / crushed)",
   "  T+ 1:30",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84910",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Aug 28, 2010",
   "Views: 15157",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>There seems to be only a couple experience reports about oxymorphone or otherwise known as Opana. I would like to give my 2 cents on this amazing drug. I would first like to say that I am very experienced with opiates. I have done alot of drugs in my past and opiates have always been my favorite. I have smoked weed, taken shrooms, acid, E, cocaine, and have done all sorts of pills including uppers and downers. When it comes to my favorite drug of choice, opiates, I have done everything from codeine to heroin and everything in between. I have been taking opiates for the past 7 years and I have a very high tolerance to them. It takes me around 40mg of oxycontin to get a decent buzz. I consider myself to be very experience with opiates. </p><p>When I first heard of how strong oxymorphone is I thought it was to good to be true. Of the reports and first hand experiences Ive read and heard of I knew that this was something I would have to try first hand. Ive heard that oxymorphone is more potent than oxycontin. My boy got his hands on two 20mg Opanas (oxymorphone) and I decided to give it a try and purchased both of them from him. The pills were green, shapped like a octogon, a 20 on one side and blank on the other.</p><p>That night I sat down, broke one of the pills in half and crushed it up for insufflating. With every new opiate I try, I try a little bit at a time so I dont over do it the first time and get sick or even worse over dose. So I figured I would try half the pill first just to see what Im dealing with. So 10mg of oxymorphone was insufflated at 8pm.</p><p>After about 10 minutes the ever so familiar opiate rush started to slowly fill my head and body. 20 minutes in I was feeling very good. I felt very relaxed, loads of euphoria, and felt like nothing in the world could bother me, same feeling I get from any other opiate. At the 30 minute mark I felt as if I had hit the peak. I felt GREAT. I then decided to insufflate another 5mg.</p><p>20 minutes later I felt like I was on top of the world. With all of my experiences with opiates I would compare 15mg of oxymorphone to around 50mg to 60mg of oxycontin. But for some reason the high I get from oxymorphone is a little different from oxycontin. The high feels more 'clean'. There was no nausea, nodding off, zoning out, or any other negative side affects I get with oxycontin. The only negative side affect I really got from doing oxymorphone was I was incredibaly itchy. Seriously the itchyness I get from oxymorphone was 5 times worse than I get with any other opiate. But it felt so good to itch my arms, legs, my head and my back.</p><p>After about any hour and a half from doing 15mg of oxymorphone I decided to have a couple beers. Alcohol mixed with the oxymorphone very well. Again experimenting with a new drug and drinking alcohol I was very cautious and took it slow. I was high on the oxymorphone for about 4 to 5 hours after doseing. Drank a total of 7 beers over a 8 hour period. Went to bed later that night and as soon as I hit the bed I was out like a light. Slept 9 hours with out waking once to toss and turn and change my position in bed.</p><p>But at around 9 the next morning I did notice some very uncomfortable withdrawls while laying in bed. Went from extremly hot to extremly cold in a matter of seconds and was sweating like crazy. I have never experienced this feeling the next morning from taking any opiate except for oxymorphone. The only reason for the very uncomfortable feeling the next morning was because of my body withdrawing from the drug, which again I have never experienced with any opitate except for this one. Oxymorphone is so strong that the hangover and withdrawls the next morning were horrible. Very uncomfortable. I wanted to call into work and stay home sick for the day. But I decided to suck it up, got up and headed to work. I was very hungover and felt like vomiting for the rest of the morning. At work I did seem to experience more withdrawls but that was taken care of with three 10mg Norcos (hydrocodone). I felt much better after that and worked the rest of the day with no ill affects.</p><p>The next night I insufflated two 10mg lines of oxymorphone and experienced a good high but did not seem as good as the night before.</p><p>Conclusion: Oxymorphone is an absolutly wonderful drug. Produced a great high with no real negative side affects I get from other opiates except for the itching. The hangover the next morning was a little to uncomfortable though. But that was taken care of with a couple hydrocodones. Oxymorphone is a VERY strong opiate and in my opinion is 2 to mabye 3 times stronger than oxycontin. I would rank oxymorphone a 9.5 out of 10 in the opiates field.</p>"
}
