{
 "title": "1st and Last",
 "author": "rusty60010",
 "citation": "   rusty60010. \"1st and Last: experience with Methylone (ID 84949)\". Erowid.org. Apr 29, 2010. erowid.org/exp/84949",
 "substance": "Methylone",
 "bodyweight": "191 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 84949",
   "Male",
   " ",
   "41",
   "Apr 29, 2010",
   "Views: 8351",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Heard on the news about the two lads dying from Mephadrone use, instead of putting me off it gets my intrested, and I look on the websites about its uses and how to get some, got some Mephadrone from the internet a couple of days later, but I also received .5gram of Methylone as it was going cheap.</p><p>Worried about taking the Mephadrone so I opted for its softer alternative instead </p><p>It was a Saturday afternoon and my son was out playing with his friend, Wife was out shopping with my elder daughter, so I thought I would give it a go, I had read reports that it would calm me down and so what better time to do this than a Saturday afternoon, as watching football always gets me agitated.</p><p>5.25pm .25Gram taken orally with some 100ml of water. tastes like bitter asprin but not undrinkable,</p><p>6.15pm Doctor Who has just started and I have an overwhelming feeling to go out and find my son in case he misses it.</p><p>6.20pm feeling very mellow, but in control, unlike Alcohol or Cannabis, find Son and tell him he is missing his favourite program. Feeling a lot of Love for my Son, so I give him a big Hug.</p><p>6.40pm The New Doctor Who is a lot better than I expected, But cant make out if its because I am feeling a lot of Empathy for his first Time being Doctor Who and feel sorry for him, or is this due to the Methylone and really he is a load of Pants, Jury still out on that one.</p><p>6.50pm Wife and Daughter back home, feeling very concerned and needing to show them some Love \n</p><p>7.30pm Feeling great, very calm, not agitated, as I often get on a Saturday, I think this is because it is my day off and I never seem to get any peace, so I start to resent the people who dont give me any peace, which is usually the kids, and in the end, I finish of the evening by getting in a mood and shouting at everybody.</p><p>8.pm, High has worn off now, but still feeling very relaxed and at one with things, realise what an absolute Arsehole of a Father I have been recently, determined to mend my ways and think more about my Wifes feelings and the children a lot more and be a good dad like the one I wanted when I was a Child.</p><p>11pm Made Love to the wife, but with a lot more consideration and less rush than Normal, God this Methylone is great and now the Government is going to Ban it, not Voting for them this Year, interfering Arseholes</p>"
}
