{
 "title": "Third-Eye Coloring Book",
 "author": "Tech_Alch3mist",
 "citation": "   Tech_Alch3mist. \"Third-Eye Coloring Book: experience with Atomoxetine & Cannabis (ID 84945)\". Erowid.org. Dec 30, 2013. erowid.org/exp/84945",
 "substance": "Atomoxetine & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "40 mg",
   "oral",
   "Pharms - Atomoxetine",
   "  T+ 2:00",
   "2 hits",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2010",
   "84945",
   "Male",
   " ",
   "20",
   "Dec 30, 2013",
   "282",
   " "
  ]
 ],
 "report": "<p>A little background first; I've had lots of mental stress throughout all my life and have only recently decided to seek help. My psychoactive experiences include DXM, 2-CE, 2-CB, Mushrooms, 2-CI, and LSD. My reasoning for this is the fact that I believe that I can manage my own emotions and thoughts. Nevertheless, school was an additional stressing factor that I decided I could aim a little more of my focus and energy at. Keeping in mind the power of psycho actives, I decided to see a psychologist.</p><p>I did a lot of research on ADHD medications and actually went in expecting to come out with a prescription that would leave me high strung and on edge, this however was not the case. To my surprise I was prescribed Strattera, I was told it was non-stimulant and relatively new.</p><p>The first day I took 40 mg as prescribed. Within the fist hour I felt anxious and really unsure about what temperature I was. I decided to listen to Infected Mushroom and try to relax, didn't happen, music that intricate seemed too much to take in at that time. I went to my room to lay down. Two hours in I lay in my bed extremely sweaty, nauseous, and anxious with thoughts traveling down dark dark paths of self destruction. I decided to try to do something else to relax, keeping in mind this is a psychoactive I tried to not smoke cannabis, however I found my self pacing back and fourth like the world was going to end tomorrow. Smoking seemed the only option as it would either A) help the nausea and anxiety or B) send me on the fastest insanity train, either way I'd know and was tired of the 'grey area' I was in.</p><p>It was a struggle to pack the water-pipe however when it was done it was all worth it, because, the second I took my hit I immediately felt relived and even stopped sweating before I even took my second one. The rest of the week was about the same but progressively less debilitating each time.</p><p>Some time later after I had decided to start taking the 80mg I started to notice that sometimes during conversation it felt as though I could vividly picture not only what they were explaining but also the conversation that we were having as though it were a physical object that I could manipulate in my mind and control through dialogue. This visualization that I had been having was very similar to that of meditation or even the closed eye visuals experienced through other psycho actives such as DXM or Mushrooms.</p><p>In a sense it feels like its like an extremely slow psychoactive lasting months instead of hours.</p><p>I have noticed that I have been able to focus better as the pictures that I visualized can be anything that I decide to visualize. I really never expected anything like this, and so far it has my thumbs up, if you don't count the first few days.</p>"
}
