{
 "title": "Difficult Emotions",
 "author": "Hasphat",
 "citation": "   Hasphat. \"Difficult Emotions: experience with 2C-I & JWH-018 (ID 84996)\". Erowid.org. May 9, 2010. erowid.org/exp/84996",
 "substance": "2C-I & JWH-018",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-I",
   " ",
   "1 bowl",
   "smoked",
   "JWH-018"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 84996",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: May 9, 2010",
   "Views: 6887",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIn this trip, I dosed up on 20 mg of 2C-I and then proceed to smoke JWH-018 for the first time. This combination led to a VERY interesting trip. The trip was definitely different from my previous trips with 2C-I and 2C-I/weed, and I attribute this to the effects of JWH-018. \r\nI found myself in a ridiculous position, the only one in the room who was tripping. I was losing my mind much more than in my previous 2C-I trips. I found it hard to concentrate on anything. As we were watching a movie, all I wanted to do was either melt into the floor or hug someone. I saw swirling effects. Everything I looked at seemed to be moving from within, like something underneath the surface was moving around. These visuals were very apparent and clear. \r\nAt one point we looked at one of those optical illusions on the internet--the kind that you stare at for a long time, then look away and see the wall moving. Well. I was already seeing that shit anyway. And I can say that if you're already having visuals on 2C-I, TRY LOOKING AT OPTICAL ILLUSIONS, it's amazing. When I looked away at the ceiling, it swirled into itself like a slow whirlpool.\r\nThe interesting part of the trip came when the cops showed up. I noticed out of the window some flashing lights and a cop parked outside of our apartment. Luckily they weren't there for us and were simply closing the gate as they do every night. But holy shit... it scared me a lot. For 6 hours after that my heart wouldn't stop racing. The initial rush of quickly hiding the stashes of our various drugs had boosted me up into an all-new headspace. My trip had been transformed into something very strange. I couldn't stay there. I got the hell out of there. I walked really fast over to a friend's apartment.\r\nWhen I got there I found myself with absolutely nothing to say. I felt completely out of place. My emotions were becoming irrational. Everything that came out of my mouth had the wrong inflection; when I said something it sounded like I was upset, even though the words themselves were not out of the ordinary. I was never able to get out of this, and ended up having a pretty awkward evening at my friend's apartment.\r\nWhen I got back home I couldn't sleep. I was too busy being paranoid and crying. I didn't understand any of it. The night had been insane. Since then I've tried JWH-018 by itself and haven't had the same paranoia. I want to caution everyone to remember their setting when combining 2C-I and JWH-018. It seems to me that the combination can definitely lead to a great and unique kind of trip, but it may be a little hard to retain your composure. But I'm willing to try the combination again.\n\n\n"
}
