{
 "title": "It IS Addicting",
 "author": "ROBO",
 "citation": "   ROBO. \"It IS Addicting: experience with DXM (ID 8504)\". Erowid.org. Apr 23, 2003. erowid.org/exp/8504",
 "substance": "DXM",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "540 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8504",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 23, 2003",
   "Views: 8541",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nWe were all really bored and me and Amber were actually in the process of quitting DXM because I had been taking it once a week for about 8-9 months and Amber had been doing it weekly for about 2-3 months.  I got sudden DXM cravings and I informed everyone that I was gonna do DXM that night and they all decided to join me.  We decided Amber was gonna buy the robitussin and we all went and bought the shit and went back to ambers and we had to wait for her mom to fall asleep so she could sneak out and shit, just to make sure everything was good and safe cause thats just how it has to be when youre dealing with DXM.  11:00 rolled by and Amber came out and we all drank our shit and went out walking so that the robo settled nicely as possible in our stomachs.  It started kicking in and we went in her little fort in her yard and layed down for a little bit.  Then about 20 minutes later I started feeling really good and decided that we should all be inside a warm place at our peak so I announced to everyone that we were all climbing through ambers bedroom window.  </p><p>We all left the fort and proceeded to climb through her window.  We got in her room and I instantly layed down on her bed cause I was feeling soo good.  Josh layed down too and amber sat on the floor.  I sat there and spun for about 5 minutes before I decided it was time for the closed eyed hallucinations (my favorite part of the high J).  I closed my eyes and all I felt for what seemed like an eternity was that I was in a fabric bubble just bouncing around and my legs felt like they werent there and I had sensations of wind blowing on my face as I flew around.  Then I guess I got just a little higher cause I was suddenly and what seemed like violently in a sort of way was thrust out of the fabric bubble and into the outside neighborhood on her block, around her house outside and shit.  I was flying hella fast over the roads and then just bursting through the trees and sometimes I would stop, slowly float down until my face was an inch from the road and id just hang there for like 5 minutes and then Id slowly start elevating back up into the sky.  </p><p>That happened for what seemed like an eternity and a half and every once in a while Id open my eyes and sit up sharply and see that everyone was lying down with their eyes closed so I would continue doing the same.  The effects were starting to wear off but I was still in my trances and I heard josh and amber talking and I slowly came out of my trance to see amber and josh talking to alan, ambers older brother, and he was drunk off his ass.  He came into ambers room and she told him what were high on and he did the tsk tsk thing and then asked if we had any left.  Then he laughed and went and passed out.  Amber went to search his brothers pants for weed so we could boost our high and then come down nicely, and she found $20 bucks laying on the ground.  So we decided, at 2:30 am, that we were gonna go to chevron to see if Danielle was hanging out there.  Pretty fucking stupid of us.  So we went and our highs got really intense, it did for me at least, it seemed like it was doing the same to them.  </p><p>We went down the road and we were walking towards chevron and we saw these jogger chicks running like ostrichs down the road making weird noises and they looked at us and screamed oh shit like 8 times then the just vanished.  And we all saw the same thing so either that was a kenetic hallucination or it was some fucking weirdos running around in their afterglow too.  Then we got to chevron and of course, he wasnt there, but there was someone working there and it appeared as if his face was pressed up against the window and staring us down, and he had cartoonish qualities.  We went back and chilled at ambers the rest of the night and of course we did not sleep.  Josh enjoyed his afterglow a lot since it was only his 3rd time doing DXM.  He was hella hyper and it was wide awake but hella slow.  </p><p>I just wanna say DXM as among the most powerful drugs out there called dissociatives.  They include DXM, Special K, Angel Dust (PCP), and Nitrous Oxide.  All I have to say is read up on a drug as much as you can before you try it, its the best way to go if you dont wanna accidentally get permanent brain damage.</p>"
}
