{
 "title": "Subtle, Positive Difference",
 "author": "BuddhaZen420",
 "citation": "Citation:   BuddhaZen420. \"Subtle, Positive Difference: experience with Amphetamines (Adderall XR) & Tyrosine (ID 85077)\". Erowid.org. Jul 7, 2010. erowid.org/exp/85077",
 "substance": "Amphetamines (Adderall XR) & Tyrosine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 1:25",
   "2000 mg",
   "oral",
   "Tyrosine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 85077",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Jul 7, 2010",
   "Views: 9827",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIts finals time and I was planning on pulling an all nighter tonight. I had a 25 mg Adderall XR that I intended to use to stay awake. I also had a bottle of L-Tyrosine pills that I had purchased on an unrelated occasion. I didnt initially intend on taking the Tyrosine, but it seemed like a good idea. Times are slightly irregular because I only looked at the clock periodically. \r\n8:00 pm: I have been hydrated all day and ate two hours prior. I feel very relaxed and I am ready to start working. Now its time to take the pill and wait.\r\n9:45 pm: It has been 1 hour and 45 minutes since I took the pill. I have a decent tolerance to amphetamine and Im not really feeling anything. Rather than take more Adderall, I decide to take 2000mg of L-Tyrosine to see what it does. I swallow the pill and walk to the corner store to buy cigarettes. I am on my way to a friends house to study.\r\n10:15 pm: I have finally gotten to my friends house and I feel very alert. I get into the living room and I am greeted by several of my friends who are smoking marijuana. I am offered a hit. Usually, I would accept even if I was speeding. I realize I dont feel like smoking tonight and head out to the porch to get some quiet and work.\r\n11:30 pm: I am typing an essay revision on the porch. Initially intending to simply revise and edit the paper, I start completely from scratch instead. I am definitely feeling the speed now. I feel extremely energetic and mildly euphoric. The feeling is similar to my first experience with amphetamine. My body is slightly vibrating, my core is extremely hot but my fingers and toes are frigid. I notice that my usual cigarette cravings arent so severe now. I also notice a LARGE difference in my attitude toward people. I feel very connected and talkative, but I prefer to talk to one person at a time, not everybody all at once.\r\n12:00 midnight: Amazingly, I have almost completed my essay. Im not satisfied with it though, I want to keep working. I decide that it is too distracting to be at this apartment and leave for the library. \r\n12:30 am: I meet some friends on the way to the library and get into a discussion about this summer. I am insistent that my one friend and I meet up soon after leaving school. We get into a discussion about his job for a while. After chain-smoking two cigs, I go inside to study. I can still feel the initial euphoric high of the Adderall even though such a low dose normally doesnt last this long. \r\n1:15 am: Im less focused now, but I still feel amazingly high. I keep getting weird stomach cramps though. I have also gotten an enhanced sensitivity to noises which usually happens on Adderall. Normal speech sounds loud and Im trying to zone out with some Drum and Bass.\r\n2:30 am: Im running out of work to do and keep insisting on cigarette breaks. Definitely lost the euphoria, but Im still speeding hard and can tell Im not going to get much sleep. No signs of a crash in sight.\r\n3:45 am: I am still awake, but Im starting to feel a little jittery. Im absolutely amazed at how long this Adderall is lasting. Im finished my work and I didnt even need to take the other pills that I had saved as extra. Trying to figure out what to do with myself.\r\n4:45 am: I am starting to feel a bit of a crash, but it is extremely different than I am used to. This is much more pleasant. There is a noticeable lack of a headache and my body doesnt hurt as bad as usual. Im just starting to feel tired and it is hard to concentrate. I have a strange urge to avoid crowds and light. Overall, I feel tired and nothing else.\r\n5:15 am: Its almost daybreak and I decide that I am done with this experience. All I really want to do is sleep. I have a joint of some Bubble Kush rolled up and Im going to smoke myself to sleep. I definitely feel strung out, but its not nearly as bad as usual. Im going to smoke and then one last entry.\r\n6:00 am: I just smoked. The pot has me feeling as if I am in a dream. Im still thinking to fast to sleep, but music seems to entrance me. Music gives me an almost an MDMA-like feeling of vibrating pins and needles in my skin. Im very sleepy now. \r\nOverall, I feel as if the L-Tyrosine has helped me get the maximum desired effect from the Adderall without a lot of the bad stuff. Much more pleasant and I feel as If I will do this again sometime.\n\n\n"
}