{
 "title": "Excellent Self Healing Session",
 "author": "WanderRA",
 "citation": "   WanderRA. \"Excellent Self Healing Session: experience with Kratom (15x extract) (ID 85164)\". Erowid.org. Jan 9, 2011. erowid.org/exp/85164",
 "substance": "Kratom (15x extract)",
 "bodyweight": "57 kg",
 "header": [
  [
   "DOSE:",
   "4 g",
   "oral",
   "Kratom",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 85164",
   "Gender: Male",
   " ",
   "Age at time of experience: 26",
   "Added: Jan 9, 2011",
   "Views: 10679",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWow what to say about Kratom other than I found it an excellent tool for self healing. I bought a small 4 gram vial off an online vendor looking for something to give me the inner softness and perception to work on my mind/body. I was extremely impressed. I would liken the experience to mushrooms without the elaborate visuals, but the same spiritual potency.<br>At around 8:30pm I emptied the vial into a glass of water and drank the water, not bad at all and just like taking my daily alalfa suppliment. Though I think next time Ill just empty the vial in my mouth and chug some water. By emptying it into a glass I had the difficulty of getting the last stray clumps into my mouth.<br>Probably 10 minutes later I felt my insides become soft and pliable like the onset of most trippy drugs and quickly stopped playing a PC game to adjust to my shifting consciousness, so went downstairs to start experimenting with body movement. IME, a good drug enables me to move/dance with more precision and awareness. Kratom certainly gave me this, but its not the kind of thing Id like taking at a rave, no psychadelic is really, Synthetics are best for that. Entheogens I prefer to utilise in clearing away physical/emotional cobwebs, but each to there own.<br>At 9pm the substance I guess worked its way into my mind, then my mind sort of trimmed away all the trivial things I spend my time doing (ie online gaming) and showed me all the imbalances in my life I dont 'need' to work on, but should for my own wellbeing and wellbeing of my friends. I realised I could be self centered a lot of the time, but the self critisism and realisation of some of my lower traits were eased into me with the help of the Kratom, and was not overwhelming like something like Hawaiin baby woodrose seeds, which simply do not care for what horror they put me through. The spirit of Kratom is nurturing, warm and cares for me. It shows me myself like a mirror, an unbiased light, 'this is who you are, no strings attatched' sometimes the visuals from other substances cloud the truth and delude me, this is why Kratom is great for honest self healing.<br>Ignoring timekeeping from now, I was pretty much peaking half an hour after taking the stuff. The rest of the night oscillated between excersising (stretching/martial arts) and light meditations, where I would close my eyes and become immediatly aware of any tense muscles in my body, the Kratom would help me focus on them and literally 'instruct' me on how to dissolve them. Light visuals were accompanied with this process, I could see cobwebs in parts of my bronchial tubes, and a crying puppy dog when I focused on a tension in my right shoulder. Relevant visuals.<br>I keep myself fit as it is, so the potential for people who have much deep seated emotional/physical tensions could be great. As I say, the Kratom (for me) simply showed me myself, like a mirror reflection, there were no tassels or glittery sparks, just honest introspection. <br>Though I did veer onto the borderline of freaking out at one point, I came 'close' to panicking and wanting the trip to end, even going to bed. 2 minutes later I was out, getting dressed and turning on the lights thinking what else could I do lol. Negative thoughts easily smoothed themselfs out and were not the 'omg Im a complete mental disaster' sort of affair. A few hours earlier I'd had a Mcdonalds, and when I tuned into my stomach, I could see a putrid swamp of greeny-brown, bacteria infested sludge in my gut. I also tuned into the suffering of the cows and factory farming. Part of the freaking out 'episode'.<br>I dont consider it addictive. I think Kratom is something I'll take maybe twice a year, alone, as a sort of periodic self healing session. I think all psychotropic plants are in some way designed for this.<br>Anyway, after the mild nausea had subsided I spent the remainder of the night glowing with the energy I had gained working through my tensions, I felt very free, happy and euphoric. <br>Ive done most drugs across the board except maybe heroin. I got some Kratom after they made Meow Meow illegal here in the UK a week ago. All I can say is that Kratom is a real hidden gem. Sort of the psychadelic no-one really talks about, but its nothing less because of this. Its got the 'funness' of mushrooms which I had sorely missed after doing my rounds with Salvia and Hawaiin woodrose, and all the sincerity of a teaching plant.<br>I think on higher doses, Kratom could really invoke a cosmic-mystical experience. Guess I'll get two vials next time. :)<br>Excellent self healing session.\n\n\n"
}
