{
 "title": "It Has a Lot to Offer",
 "author": "Apradavra",
 "citation": "   Apradavra. \"It Has a Lot to Offer: experience with Bromo-DragonFly (ID 85196)\". Erowid.org. Jul 30, 2010. erowid.org/exp/85196",
 "substance": "Bromo-DragonFly",
 "bodyweight": "187 lb",
 "header": [
  [
   "DOSE:",
   "675 ug",
   "oral",
   "Bromo-Dragonfly",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 85196",
   "Gender: Male",
   " ",
   "Age at time of experience: 27",
   "Added: Jul 30, 2010",
   "Views: 6903",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Several days prior I acquired one vial of bromo dragonfly which was diluted in ethanol, (everclear). The source was a friend of a close friend, a university student from San Deigo, who is very well versed on RCs. He explained how he purchased the chemical, which he had previously purchased the same amount, from the same distributor, and diluted it the same way as which I was buying. He claimed the dose would measure roughly 75 units of measurement per drop of liquid. He also said that he knew about the two separate batches of bromo dragonfly produced several years back, where the American batch was not as potent per weight as the European batch, but since that was several years prior, he didnt want to state which batch this was, but that this batch of bromodragon fly had the R isomer, which made it more potent by weight. I know what I feel is enough to be competent in the idea of the variations of phenethylamines, but I do not understand why this R isomer makes this the more potent. This was not purchased through Haupt-RC.</p><p>I dropped 9 drops at 75ug which I believe equals 675ugs at 6pm. I was in a social setting, and wasnt expecting much for a while. My buddy dropped roughly the same amount and was drinking beer.</p><p>Within an hour or two I could definitely tell that I had a psychedelic in my system. My friend redosed 5 more drops at around this time.</p><p>At approximately 9pm I left the party. I was feeling weird, sorta speedy with some minor trippiness. I wasnt sure if it would progress. </p><p>By 11pm I was experiencing pretty wild visuals, it was much richer than the wonderful LSD which I regularly consume out here on the West Coast, but I felt that there wasnt the godspace which I attain when I see visuals like that off of any other favored psychedelic. I found this same issue when I had my two experiences with high doses of 2-cb in the past. It was visually very impressive, but the clarity of mind made me almost feel like something was missing. </p><p>By 1am, things are very funny. I never made it back out into the night to be social, instead I parked in front of the television and watched cartoons like the simpsons, which were visually amazing, and very light and funny. I keep drifting between being unsure about this chemical, and finding a psychedelic sorta mdma mindspace.</p><p>By 4am, I tried to lay down, but the room was exploding with colors. It was nice to be in a bed, but sleep was not going to be found. So I got comfy and observed the darkness. The visuals I can only compare to when I insufflated 35mg of 2-cb. </p><p>This trip lasted a real long time. I am typing this at 8pm, 26 hours after dosing, and I am feeling somewhat back to baseline. I have not slept whatsoever. But I was able to eat a full sub sandwich around 5pm, which made me feel much better. It surprised me I was able to eat while tripping that hard.</p><p>I tend to not like taking LSD in the daytime, because I feel its more visually rich during the nighttime, but bromo dragonfly would be a great substance to take for a long day in nature, or possibly a music festival. Its a very, very visual substance. </p><p>I dosed on the lower end of what my supplier recommended to begin with. This may mean that the solution is not as strong as he was expecting, or that possibly this isnt the stronger R Isomer, because I would assume 675ug would be more potent on the dosage scale. Although this was a rather visually intense trip for anyone not experienced with psychedelics. </p><p>My friend had redosed at roughly nine. I was worried about this after separating due to how hard I was tripping, even though I myself didnt redose. When I spoke with him the following day at 5pm, I was definitely still tripping, and he said he really didnt get much out of bromo dragonfly, and he dropped his doses out of the same batch, and he significantly dosed more. Although he was drinking a lot of beer, and also he took a very fair amount of LSD in the weeks/days prior to his bromo dragonfly experience, which may have resulted in this difference in our experiences. I did however ingest a fair amount of LSD the evening prior, and it appeared to have little effect on my bromo trip.</p><p>I was also smoking hash oil/marijuana throughout the experience. Which I feel helped tone down the mild to moderate jitter I was occasionally experiencing, especially when the psychadelic effects first manefested. </p><p>I will definitely try this chemical again. I feel it has a lot to offer, although I also feel it should be regarded very carefully after the gnarly overdoses which have happened. I know several were due to mislabeling which happened during fall 2009. My supplier claimed this was not purchased from Haupt-RC. From what I understand a majority of the other health issues associated with bromo dragonfly have been the results of large overdoses. Simply not measuring properly, or having mislabeled chemical was to blame for a majority of the horror stories I have read.</p><p>What I didnt understand prior to consuming this chemical was that it is closely related to the DOx substituted amphetamines. I guess bromo dragonfly is more closely related to DOB than it is to the 2cs. </p><p>I hope this experience sheds some light on this somewhat unknown psychedelic. I will write another experience when I choose to experiment again with bromo dragonfly.</p>"
}
