{
 "title": "Letdown",
 "author": "Mikeilike",
 "citation": "   Mikeilike. \"Letdown: experience with 5-MeO-DALT (ID 85211)\". Erowid.org. Jul 19, 2010. erowid.org/exp/85211",
 "substance": "5-MeO-DALT",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   " ",
   "10 mg",
   "smoked",
   "5-MeO-DALT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "85211",
   "Male",
   " ",
   "30",
   "Jul 19, 2010",
   "8288",
   " "
  ]
 ],
 "report": "<p>I purchased 1 gram of 5-meo-DALT.</p><p>I had read up online and had seen the excerpt from Shulgin's forthcoming book. I recall one user having described it as a +++ with eyes closed.</p><p>I have tried a number of the 5-dmt / amt, and 2-CI , 2-Ct7 type research chemicals back in 2001 when those were legal. I remember some of them being excellent. On par with my experiences with LSD and psilocybin mushrooms.</p><p>I woke up this morning planning on meeting up with a friend and going surfing. He canceled on me. Realizing I had nothing else planned for the day, I decided I would try some of my new 5-meo-DALT.</p><p>This morning was the second time I had tried it. I tried it a few nights before and didnt feel much, but at the time I was also trying a few of the JWH- type compounds so I didnt think that experience was very pure.</p><p>I feel it important to mention that I take 100mg Zoloft (Sertaline) daily. I have read and in my own experience found that Zoloft significantly lowers the effects of ecstasy (street MDMA type pills). So that may have also played a roll here.</p><p>I placed about 10mg of off-white crystalline powder in a long piece of aluminum foil and placed this on a heated electric stove burner. The powder liquefied, smoked, and gradually browned. I inhaled the smoke through a straw. The smoke was very bitter and I felt a strong urge to vomit until I rinsed the taste out of my mouth. </p><p>The feelings came on instantaneously, strongest within the first two minutes decreasing there after. I would not describe this product as trippy or a +++. The best I can say about it, as said by another user, it gives a tryptamine feeling of energy.  I would say a medium body buzz.  </p><p>I looked at some internet porn (this is my usual test of a psychoactive substance to see how strongly the visual effects of porn are changed by the drug and how my feelings and interpretations are changed.) While looking at the porn  I noticed very minor visual and mental trippyness. I quickly got bored of the porn(unusual for me). I then put on some electronic music and tried listening to it with my eyes closed to see if I could detect the supposed +++ closed-eye visuals. I found it physically hard to keep my eyes closed. I attribute this to the tryptamine-like body buzz. I did manage to keep my eyes closed, but experienced no closed-eye visuals at all.</p><p>I returned to the kitchen and smoked another 5-10mg. The experience was similar to that previously described.</p><p>The whole of the experience lasted about 30 minutes. </p><p>Comedown: I was left very slightly disoriented and disenchanted.</p><p>Synopsis: I would say: Dont waste your time and money on this compound  unless you have something good to add it to. I have considered trying higher dosage, but based on experience reports of others and my two experiences; It seems that the ratio of psychedelic experience to unpleasantness is too low. It is like huffing gasoline or ether, sure you can get high from it, but is it worth the trouble?</p><p>The better DMTs and AMTs give such a much better psychedelic experience, I would put my energy into finding extracting them rather than messing with 5-meo-DALT. (Again, I am on Zoloft so this may have altered my experience.)</p>"
}
