{
 "title": "The Tale of the 7 Seeds",
 "author": "nutmed od?",
 "citation": "   nutmed od?. \"The Tale of the 7 Seeds: experience with nutmeg (ID 8527)\". Erowid.org. May 2, 2004. erowid.org/exp/8527",
 "substance": "nutmeg",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7 seeds",
   "oral",
   "Nutmeg",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8527",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 2, 2004",
   "Views: 16748",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Tuesday</p><p>5:00 PM  As I had taken nothing else for a couple of weeks, I wanted to do something, so when I found whole nutmeg seeds (McCormick Spices) available at the local grocery store, I bought a bottle of 9 for $6, along with a gallon of skim milk.</p><p>7:00 PM  That night, I began shewing them and promptly washing down with milk.  In fact this is probably the best way to take them, as I was able to take up to 2 seeds before I had to consume about .5 glass of milk.  In all, I ate 7 seeds and drank 3 glasses of milk.  I did experience a couple 'nutmeg burps,' but nothing except sleepiness in the first hour.</p><p>8:00 PM  This sleepiness was what eventually put me to sleep.  I think I also almost felt a strange gidiness & lightness of breath, which I now feel was the effect of the onset of oxygen deprivation to the brain.</p><p>9:00 PM  I was awakened by my mother and forced to help set up a tent outside.  Needless to say, I was feeling the effects a bit more now and was quite 'hammered.'  I felt quite lethargic, and 'greyed out' whenever I stood up or moved too much.  Perhaps nutmeg inhibits oxygen absorbtion or reaction significantly somehow....  Anyway, after lifting a pole or so, I announced I was quite tired and went back to bed.</p><p>7:45 AM  My alarm clock rings, I shut it off, feeling that I am not quite operating at full capacity (63% maybe).  Anyway, knowing at least that I would be fired if I missed even one more day of work, but unable to move too much without greying out, I got up, dressed and drove to work (What the hell, eh?).</p><p>Wednesday - Friday</p><p>Mostly, the next few days are like a motion blur in my memory.  They all kind of blur together.  Partially beacause of the monotony of my work schedule, and partly because I could mot think clearly.  The effect on my thought procii seemed to be that it required a hell of a lot of effor to think, and even more to do things.  To me it seemed like oxygen deprivation.  I found it difficult concentrate, difficult to think about alternatives logically, and yet surprisingly, I felt able to converse more fluently and normally with people (my co-workers).  The whole time I felt quite 'hammered.'  I mean hammered like the kind of feeling you get when you drink too much and it feels like somebody has smacked you in the head with a 2x4 to get you to spluge everywhere (only without the dizziness).  The nausea and headache was somewhat present, but I didn't throw up or feel particularly migrain-ish.  The effects seemed to go away steadily Friday. That evening, I was sober and somewhat dizzy thinking about it.</p><p>Retrospective</p><p>No hallucinations, no daydreams (although I tried several times Wednesday through Friday), no liver failure (although I don't think I had the heart, or the intelligence to drink until Friday), just a really 'hammered' feeling for about 3 days.</p>"
}
