{
 "title": "Hated by Everyone",
 "author": "REW",
 "citation": "   REW. \"Hated by Everyone: experience with Ecstasy, Alcohol & Cannabis (ID 8532)\". Erowid.org. Aug 3, 2001. erowid.org/exp/8532",
 "substance": "Ecstasy, Alcohol & Cannabis",
 "bodyweight": "111 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 8532",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 3, 2001",
   "Views: 39424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n(I'm writing this report in part as a response to JJ because I beleive there are some similarities between my experience and his so I hope it will help in some way for him to recover.)\r\nI started having problems during Febuary 2000. I had two jobs, one full time during the week and one part time on occasional weekends and evenings. I spent all the money I was earning socially - I used to go out drinking 5-6 times a week and in order to stay awake, make it into work and enjoy myself when out, I was taking half pills whenever I went to the pub, as well as going out clubbing twice a weekend, when I would take a fair amount of E aswell as drinking alcohol. I was smoking alot of weed too.\r\nThis kind of abuse had already started to take its toll - I had my first paranoia attack one weekend in Febuary, when I had somehow ended up on my own after clubbing (I had a fairly wide circle of friends and as I'm normally ok and with people they had all assumed I was with someone else). I am not going to describe that experience here, but after that I took great care not to be on my own when getting wrecked, and then carried on as normal.\r\nA couple of months after that I went out drinking with my best mate P on a Friday night the weekend after a particularly heavy session. We went on a mad one round town, and we somehow ended up losing each other. After trying to find him, I eventually gave up and went to another mates' flat.\r\nOnce at the flat there were alot of our mates round, so I dropped a pill, carried on drinking and started smoking weed. After about an hour and a half everyone had gone and there was just me and two of my best mates, who actually owned the flat, left. At that point P phoned to say that he was ok, he had just been kicked out of a club and he was coming round.\r\nAs soon as he went off the phone the whole world seemed to change in front of my eyes. I suddenly thought that these people hated my guts, and had trapped me in there flat. P was going to come round and tear my head off. I started to leave, but my friends tried to stop me, telling me P wouldn't do anything (he was me best mate after all). But I just thought that they wanted me to stay so that they could all torture me and kill me once P had got there. My friends have said afterwards that they had thought there might something wrong, but I kept saying I'll be alright and gave a load of other excuses to leave, and eventually they let me go because in the end I seemed ok.\r\nOnce outside I realised I had left something in the flat, but I felt I couldn't go back. I was terrified to walk round outside incase I met P. There is a taxi rank next to my friends flat, but I took a huge detour all round town to avoid anywhere he might be, absolutely terrified of meeting him or any of my other friends. Eventually I got to the taxi rank, but I was terrified about going in it or near it in case P saw me. After hiding in the shadows for a bit and watching to make sure he was nowhere to be seen, I got myself a taxi and it wasn't until I got myself home and locked myself in my room that I snapped out of the trance and realised something had gone seriously wrong. The whole experience lasted about an hour and a half.\r\nThe thing that scared me most about this experience is how long it took me to recover. For the few months I was at home after that, I still thought that my mates hated being with me - if it wasn't for my girlfriend inviting me out all the time I might have just locked myself away or something. I was constantly living in a world of paranoia, I thought I was boring and couldn't make friends with people. On the outside I seemed reasonably normal, although quieter than I used to be, but in my head I was being constantly haunted. I felt as if I couldn't talk to anyone about it either. It is worth noting that these really are good friends of mine - I have known them for years and grown up with them.\r\nIt wasn't just my friends I thought evil of either - I started to blame my parents for every little bad thing that ever happened to me while I was growing up, but now when I look at it none of it was really their fault at all, but this seriously affected my relationship with my parents for some time.\r\nNow over a year later I feel as if I have recovered. Just after this happened I had started to realise that when I was on MDMA, the world seemed how it should be, and I could start to answer some of the problems and questions in my head. Therefore to sort my head out, when I went away to university at September last year, I took the opportunity to take pills nearly every day again (but without drinking or smoking) and gradually rid myself of the paranioa by not facing a comedown, so I suppose I became psychologically dependant on MDMA. I lost my phone and all my numbers, so therefore lost contact with everyone at home. While at university I started to form a new set of friends, and it wasn't until I started to notice similarites between them and my friends at home that I realised that thats what those people at home were, my friends. When I go back home now, it is as if I never left (none of my mates went to university so when I go home I am the only one returning), so I settle back in straight away. To them nothing seems different, but to me everything seems clearer. I feel like I'm with friends, rather than friends who hate me. Of course this was affecting every aspect of my life, because I thought if my friends can't like me, no one can, so I felt as if I couldn't trust anyone.\r\nThe process of clearing my head for me worked in two stages - first I had to convince myself that they were paranioa attacks, and that they did actually happen (rather than what I saw being true!), and secondly I had to try and work out why they happened. I am still finding some of the reasons why, I think that they include the fact that I was bullied in school when younger (everyone hated me then so why shouldn't they hate me now?), because it was a bad trip and it brought out hidden demons from the past, and the fact that I was on drugs all the time so I never got to speak to my mates when straight.\r\nEach time I give an account of this everything seems a little clearer, the more people I speak to about it, the more people I learn to trust again. I now feel happier than I ever have been, and have alot more repect for drugs and how they can alter your awareness and outlook on life. I still take alot of E, and I have recently started drinking and smoking again, but now I make sure I give myself regular breaks and talk to people as much as possible about any problems I might have.\r\nBad trips such as these are serious - they can take a lot of time to recover from and people who have them need the support of others. I would like to urge everyone with similar experiences to post them to Erowid, because even writing this account now has helped my mind break free just a little more.\n\n\n"
}
