{
 "title": "Is This It?",
 "author": "Moc",
 "citation": "   Moc. \"Is This It?: experience with 5-MeO-DMT (ID 85600)\". Erowid.org. Oct 5, 2010. erowid.org/exp/85600",
 "substance": "5-MeO-DMT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 85600",
   "Male",
   " ",
   "24",
   "Oct 5, 2010",
   "Views: 4667",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Finally, after a long wait of 5 years or so, I smoked 5-meo-dmt. Five years since I first heard of the stuff, that is. Only recently did I have the ability to actually get a small quantity.</p><p>It was an odd experience, not much like I expected.</p><p>In the aftermath, I'm left wondering if I did something wrong, or even if what I have is actually 5-meo-dmt.</p><p>The setting was my bedroom in my tiny apartment. My roommate is gone for a while, so I have the place to myself. A nice day outside, the sun setting, no noise, no fuss, a Friday evening.</p><p>I have a new glass pipe, of the sort used for marijuana. I wanted to find a glass pipe that's more meth style, so to speak, as really I want to inhale the vapours of melted 5-meo, but I do not know where to find such a thing. And besides, a colleague online told me I could get along fine melting the stuff on top of some sort of leaves.</p><p>As I have no tobacco or pot, I decided to use some tea as a base. Smoking tea is not great, but it smells okay, and I really don't want anything but 5-meo-dmt effects. So I load a little base of green tea in the pipe and sprinkle some crystals on top (likely about 10mg, taken out of a 500mg bag).</p><p>The first tokes gave me a body buzz unlike anything I'd felt before. It was 'solid,' somehow multicoloured, but left my rational faculties untouched.</p><p>I suspect that I was losing a great deal of material in my technique, as I wasn't getting the sort of effects I'd read about, and some of the material was being sucked down beneath the bowl.</p><p>Another small pile of crystals got similar results. Finally, with the third pile (and perhaps with all the accumulation), I inhaled, held in the smoke, and had a rush.</p><p>All at once the world was made of tiny pixels. Not that I could see them - I 'knew' this. The world was perfect stillness, or the objects in the world were occurring in a perfect stillness. My mind raced, chattering on about the different drug experiences this resembled, the esoteric doctrines it resonated with...yet another 'mind' (or spirit or soul or some other more 'important' sounding name if you like) was still and held in rapture, lightly laughing at my thoughts. They didn't matter, they didn't touch what was being experienced.</p><p>I was shirtless, lying on my bed, staring at the sky outside my window. I began to salivate a great deal, drooling onto my chest. Still I could think in my 'regular' mind while simultaneously inhabiting a greater space. 'Everything's just the same' I thought, yet I knew that was not the whole truth...but it was part of it, at least.</p><p>I twitched a bit, and arched my back, feeling energy up and down my spine. Everything was energized, my mind, my genitals, my fingers, my toes, yet very quiet and still too.</p><p>Eventually I got up out of bed and looked at my face in the bathroom mirror. My pupils were huge, my body seemed misshapen, though I recognized there was no 'actual' distortion.</p><p>I walked through my apartment, feeling that it was more spacious than usual. 'Just this,' 'suchness,' and other Zen platitudes came to my mind, but again this was dismissed by the larger mind. Or...dismissed sounds too harsh. The thoughts were allowed, but given the status of a child explaining things. </p><p>I decided to get in the shower to finish things off, as I was coming down and felt something very tactile would be good.</p><p>So to sum up: there were no revelations, no visions, nothing beyond the set and setting. My thoughts went all over, but they were secondary, just a little voice in a vast still place/being/____.</p>"
}
