{
 "title": "Better Than Bud",
 "author": "Duncan",
 "citation": "   Duncan. \"Better Than Bud: experience with Products - Spice (Gold) (ID 85637)\". Erowid.org. Jun 26, 2010. erowid.org/exp/85637",
 "substance": "Products - Spice (Gold)",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)",
   "  T+ 3:00",
   "0.5 bowls",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 85637",
   "Gender: Male",
   " ",
   "Age at time of experience: 15",
   "Added: Jun 26, 2010",
   "Views: 7780",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOver the past three or so months 'K2' has become exceedingly popular at my school. So after getting busted by my parents for weed for the 4th time I decided I'd quit, but after hearing about this stuff and fearing a UA, I decided I would see what It is all about. I went to our local head shop and bought a gram of 'Spice Gold.' I picked up my lady friend and headed up to the top of the bluffs that surround our town, we went to the lookout, packed a bowl, and started to smoke. It hit surprisingly smoothly, by this I mean it is very easy to take a big hit and hold it in for a long time. We smoked two bowls between us and the following is what happened.\r\n3:00 - we smoke two bowls.\r\n3:02  notice incredible cannibis like high setting in, heightened appreciation for auditory stimuli-the birds and bugs outside created an extraordinary music like symphony of sound.\r\n3:06  unlike weed the high continues to get more intense, we begin to walk up the hill back to our car with the distinct feeling that my legs have melted away; I feel just warmth in place of my legs. As we walk back to our car we see a big knotted tree, the bark of which begins to shift shapes and swirl, we walk up to it and hug and talk to it for upwards of 15 minutes.\r\n3:25  we finally get back to our car. We put on Shpongle (our favorite messed up band) and begin to drive the long way back to my house. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] Going down the hill at 50mph was an incredible rush, similar to driving on ecstasy, my body felt like it was flying separate from the car. The body high I was experiencing at this time was incredible intense. At this point it has become unusually hard for me to communicate verbally, words and ideas sound so weird and stereotypical in my head that I cant express anything Im thinking. Not to mention the process of actual talking felt incredible difficult.\r\n3:40  we get back to my house and can finally begin to relax as driving was a very stressful experience, I would highly recommend a designated driver when consuming this because it gets incredibly hard to concentrate. We put Shpongle on on my computer and lay down on my floor. I close my eyes at this time and see visuals akin to what I have experienced on shrooms (fractals and spinning patterns). I notice my mouth has become extremely dry, yet the uncomfortable-ness I expect to get seems oddly not a part of me. Closing my eyes my body feels like its floating in the air. \r\n4:00  I would have expected the effects at this point to have lessened, however, if anything I have gotten more high, it has come in waves, the intenseness getting almost unbearable at times. \r\n5:00  we retreat to my parents room where we have sex. I would not call this a good drug to engage in sexual activities on, the extreme paranoia and loss of coordination makes acts of passion very difficult. Even making-out took an extreme measure of concentration that I didnt want to spare on another person.\r\n6:00  the effects have lessened slightly but it has happened so gradually that it is barely noticeable. We smoke another bowl and return to the extreme high we had been experiencing. We lay on my bed naked and snuggle under a blanket at this point, the feeling of security and warmth is overwhelming, an almost euphoric ecstasy like feeling has overcome me.\r\n6:15  my freind leaves and I lay in bed listening to trance music. Over the course of the night I drift in and out of deep sleep having some of the most vivid/lucid dreams I have ever experienced. Usually when I smoke weed and fall asleep I dont dream at all but quite the opposite is true for this.\r\nLooking back on this from the next day feels very strange. I cant seem to recall everything that has happened yesterday as I feel like there are big blank spots in my memory. My short term memory is very noticeably impaired also. Still 24 hours after Ive come down I keep experiencing waves of highness. Ive felt a body high similar to what I feel on cannabis almost all day today. People Ive talked to werent kidding when they said this was stronger than weed, for a comparison I would multiply the weed high by about 4. Overall it was a very enjoyable experience. I expect I will do this much more in the future, especially because I foresee this becoming illegal here in Minnesota very soon (already took away our salvia!)\n\n\n"
}
