{
 "title": "7 Cops and One Bad Trip",
 "author": "Seti",
 "citation": "   Seti. \"7 Cops and One Bad Trip: experience with DOC & Cannabis (ID 85645)\". Erowid.org. Aug 19, 2011. erowid.org/exp/85645",
 "substance": "DOC & Cannabis",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " ",
   "2 hits",
   "oral",
   "DOC",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2008",
   "ID: 85645",
   "Male",
   " ",
   "15",
   "Aug 19, 2011",
   "Views: 9424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a friday afternoon at my house and I was getting ready to go hang out with some friends. My mood and mindset were fairly normal at the time. I took 2 hits of the DOC (one was a playboy bunny, the other a white lightning bolt on a red background) at approx. 2pm. I had nothing to do until 5, knowing it wouldn't kick in until around then so I sat around on the computer.</p><p>At about 5 I had to eat dinner with my Mom and sister. I was starting to feel really up, like a balloon was in my chest and and clothespins on my cheeks so I couldn't stop smiling. As I sat down, the light from the ceiling was reflecting on the silverware and right into my dilated pupils. This was fantastic, the light had shades of purples, greens and yellows which was a theme throughout the trip. I made it through dinner ok, I knew my mom and sis knew but I was past the point of caring.</p><p>I went up to my room and had some people over. The evening began with some smoking and hanging out on my roof. I smoked 2 or 3 gravity bong bowls and I was in the land. As I was sitting on my roof, the sky was purple and green and the street was oddly colored and moving. I went back inside and sat on my bed. My buddies asked my throughout, 'How you feelin' man?' to which i replied 'holy shit dude' or couldn't answer at all.</p><p>A little while later I basically blacked out. I went out of my body and saw myself sitting on my bed and everything kept zooming out. I was drawing at the time but watching myself from up in the stars. At one point I witnessed 2 stars collide in a different galaxy of some sort. This scared the crap out of me and I think thats when things started going downhill.</p><p>My friends started to leave and when I sort of regained consciousness i ran out the door because i really wanted to go with them. I'm not sure what happened next but i ended up back at my house. Next thing I know I'm standing in front of my mom's room and she's looking at my weird. I couldn't remember the past 5 minutes or more. My sister was yelling at me because apparently I had spilled instant coffee all over the doormat.</p><p>So I went down in the basement trying to escape all the madness. I went on my computer and couldn't even log on I was tripping so hard. The whole time there were magnificent yellows, greens, and purples in my peripheral vision and things were very acid like. Its kind of like acid on crack.</p><p>Anyway, I honestly don't remember what happens next but this shit made me sweat like a beast, so i ended up naked. While naked I guess I ran downstairs. By this point my mom and sis knew what was up so I guess they tried to restrain me. I hit my sister in the chest and tackled my mom and bit the shit out of her leg, I had no idea what was going on.</p><p>My mom called the cops. This is where shit gets raw. So next thing I know I'm on the ground (still naked) my hands are behind me and i cant move them. I start yelling and screaming and I was told later that I tried to jump off the balcony to kill myself (which is stupid because its only 1 story but oh well) and 7 fucking pigs are on top of me. Now take this in for a second. 7 full grown male and female police officers taking on a 130 lb. 15 year old kid tripping out of his mind. I assume I fought them off for a little bit but I was told they were about to tazer me and I gave up.</p><p>The next part of the story is the ambulance and hospital which I'm going to go over very briefly. Basically i was rambling crazy ramblings in the ambulance (and they were recorded and read back to me in family court) and freaking out. So in the hospital they strapped me to a chair and this lady nurse was about to give me a catheter. I was still tripping really hard and thought I was a game show, had won, and was about to have sex with this sexy nurse. Boy was I wrong. I won't go into details but the ended up giving me a sedative and throwing me in the PICU.</p><p>The next day I woke up with 2 broken wrists, bruises all over my face, back, arms and legs. My mom has the nerve to show up with a picture of the bite i gave her and was rubbing it in my face as if I didn't feel bad enough. I was still tripping in the PICU the next day, I couldn't tell right away but later I realized the clock was kind of melting and was green yellow and purple. I spent the next 3 days in the psych ward.</p><p>To sum it all up, this was a crazy fucking trip. My first mistake was taking it at around 2pm. I should have done it about 5. Second mistake was doing it at home. BAAAAAD IDEA. Well whats done is done and cant be undone. I must say I doubt I will ever do DOC again. This is an intense drug and should be dealt with carefully.</p>"
}
