{
 "title": "Machu Pizza",
 "author": "Murple",
 "citation": "   Murple. \"Machu Pizza: experience with Coca Leaves on Pizza (ID 8566)\". Erowid.org. Aug 3, 2001. erowid.org/exp/8566",
 "substance": "Coca Leaves on Pizza",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "0.75 tsp",
   "oral",
   "Coca",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8566",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 3, 2001",
   "Views: 22344",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\nRecipe created by Murple<br><br>Ingredients<br><br>\n1 pre-made personal sized pizza dough (Boboli or some similar product)<br>\nPizza sauce<br>Llajwa (This is Bolivia's all-purpose condiment. It is similar to pico de gallo or salsa. You can probably find it pre-made at Latino grocery stores. If not, recipes are available . Essentially, it's a puree of tomatoes, locoto peppers, and a cilatro-like herb called quilquiña.)<br>Garlic powder<br>1 Coca leaf tea bag (or about 3/4 teaspoons of de-veined dried coca leaves, chopped into small flakes)<br>Enough cheese to cover pizza (a combination of monterrey jack and cheddar works well)<br>1 Locoto pepper (Often called 'rocoto' outside of Bolivia. If unavailable, you can substitute some other fruity tasting but very hot pepper, such as habanero.)<br>\nInstructions<br><br>Preheat your oven, following the directions on the package of <br>whatever pizza crust you are using. When creating this recipe, I used a <br>personal-sized Boboli crust, and preheat the oven to 400 degrees <br>Farenheit. Other than the ingredients, this is just a regular pizza.<br><br>While the oven is heating, prepare the pizza.<br><br>First, you will need to make the sauce. Combine 2 parts pizza <br>sauce with 1 part llajwa. Mix in 1/8 teaspoon garlic powder and half of <br>the coca leaf flakes. Spread the sauce out on the pizza crust.<br><br>Put the cheese on the pizza. Sprinkle the remaining coca leaf <br>flakes on top of the cheese. Slice the locoto pepper up into thin slices <br>and put them on the pizza.<br><br><br>Once the oven has heated, put the pizza in the oven for 8 to 10 <br>minutes, or until the cheese has melted. Note that the cheese may take <br>on a slight green color from the coca leaves - this is normal. Let the <br>pizza cool, then cut it into slices. If possible, serve with a nice glass <br>of Vino de Coca.<br><br>This recipe is not likely to cause any kind of noticable high from the coca leaves. It is purely a novelty recipe. However, it may have some health benefits. Coca is high in vitamins as well as the mineral calcium. It also may help with the digestion of carbohydrates. The herb quilquiña, found in the llajwa, is known for its ability to lower blood pressure. The locoto peppers (both in the llajwa and the fresh slices) have all the health benefits of any other chile pepper, as well as having a delicious fruity taste. Tomatoes are loaded with carotenes. Most important of all, this recipe is damn tasty!<br><br><br>Buen provecho!\n\n\n\n"
}
