{
 "title": "A Viable MJ Alternative or a Novelty?",
 "author": "Mikail Sasha Hoffman",
 "citation": "   Mikail Sasha Hoffman. \"A Viable MJ Alternative or a Novelty?: experience with JWH-018 (ID 85799)\". Erowid.org. Apr 22, 2012. erowid.org/exp/85799",
 "substance": "JWH-018",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10g repeated",
   "smoked",
   "JWH-018",
   "(daily)",
   " ",
   "60g mg",
   "smoked",
   "JWH-018",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 85799",
   "Male",
   " ",
   "Age at time of experience: 30",
   "Apr 22, 2012",
   "Views: 3123",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report doesn't describe a single experience, rather is a report that details use of JWH-018 at consecutively higher doses over a period of three weeks.  Furthermore, the goal of this paper is to inform users of products containing JWH-018 (Spice, K2, MoJo, yucatan fire, Serenity, and many more) of the effects of this class of drugs.  Finally, the effects of the JWH series compounds will be compared to those of Marijuana. Therefore, the purpose of this report is to educate those interested in JWH compounds as an alternative to cannibis.</p><p>To begin, I am a heavy pot smoker that smokes 5-7g daily and have done so for more than 12 years.  Needless to say, i was skeptical when told by a friend that K2 (JWH-018) gets you stoned just like pot.  I ordered 1g of pure JWH-018 to find out for myself.</p><p>I first weighed 3mg on an analytical scale, one capable of measuring accurately .1mg.  As such scales are expensive, 1g JWH-018 can be dissolved in 100mL of ethyl alcohol (everclear) resulting in a solution that contains 10mg per mL.  As such, with a graduated cylinder or syringe one can prepare accurate doses without the need for a scale.</p><p>With that being said, a brief background of how these trials were performed is in order.  Firstly, I quit smoking MJ for 3days prior to JWH use.  I then began by smoking a 3mg dose in a glass piece filled with ashes, carefully placing the powder on top of the ashes.  I took it all in one toke, taking care to burn it all and hold the smoke as long as possible.  Onset is immediate, however, peak effects are achieved about 3-5min after inhalation.  The peak effects lasted 15min, though after they subsided somewhat further after effects lasted another 30-45min and were decidedly more MJ like than the first 15min after onset.  The first portion of the buzz was so much more intense than MJ that it actually scared me somewhat as I felt like I spinning so fast I almost threw up.  </p><p>I also noticed that while the buzz of JWH is weed like, it has subtle and not so subtle differences that in my opinion make it different enough to not be a weed alternative for everyday use, but rather a novelty that gets the job done when weed cannot be procured or simply cannot be smoked because of drug tests.  Of the many differences of MJ and JWH, most interesting is the fact that the euphoria of JWH seemed to be confined to my head whereas MJ's euphorant effect is felt all over my body.  </p><p>Over the next couple weeks I smoked JWH in place of MJ altogether, upping the dose as I became aclaimated to the effects.  The first week I smoked 3,6,and 10mg doses.  At the higher end of that spectrum (10mg) effects were so intense that they made me fearful that I might have a panic attack.  The initial peak effects at this dose lasted 30 min and were so intense it was almost to much to handle.  After that subsided, the remaining hour long buzz was similar to that if I had smoked a blunt of diesel ass dro by myself.</p><p>Week two:  After 7 days of smoking JWH exclusively in doses ranging from 3-10mg at regular intervals (as often as if i had been smoking MJ), I began to notice that the effects of JWH had become hard to distinguish from those of MJ.         </p><p>Week three:  After a few high dose experiments ranging from 20mg to 60mg I came to the conclusion that there is no need to take such high doses as the experience is a profound and almost disassociative like in effect(like being in a K-hole or under anesthesia). </p><p>After 10 days of exclusive JWH use I began to develope headaches and nausea that were most certainly caused by my JWH consumption.  These adverse reactions got worse as time under the influence of JWH icreased.  Likewise, increased dosages also increased unwanted side effects.</p><p>At the end of the three week trial I abstained from JWH use for two days before reverting back to daily Marijuana use.  Interestingly, once I smoked pot again I realized that I could hardly tell the difference between the effects of MJ and JWH.  Once you become acclaimated to the effects of JWH and keep your dose at a set standard (i recommend 5mg) there is little difference between it and MJ, accept of course the fabulous taste, smell, and natural beauty of cannibis.</p><p>Conclusion:     If you're a pothead and can't smoke because of drug tests, probation, or simply don't like dealing with the criminal element of society than JWH is for you.  However, as with all substances, if you don't respect the power and inherant dangers of this and all research chemicals you may find yourself in a world of shit, or even worse dead.  Always research extensively any substance you put in your body.</p>"
}
