{
 "title": "Happy Honey Oil",
 "author": "Mobius",
 "citation": "   Mobius. \"Happy Honey Oil: experience with Cannabis extract (honey oil) (ID 8587)\". Erowid.org. Aug 17, 2001. erowid.org/exp/8587",
 "substance": "Cannabis extract (honey oil)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Cannabis",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8587",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 17, 2001",
   "Views: 20441",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSince there arent many reports about the honey oil extraction (posted all over the net, including this site i believe) here's a report on my first try at this method (performed last night).\r\nFor the uninitiated, what was done was basically to fill a pvc pip with about an oz. of powdered leaf, stems, tips and some shit buds from some wild plants, then butane (from gas-lighter refill cans) was sprayed into one end, went through the pipe extracting the oils, then dripped out the end into a bowl. the butane was evaporated away by setting the bowl in another bowl full of warm water. from start to smoking the whole process took under 30 minutes. (note this is only a rough description, if you plan on doing this yourself check out the full method first, and make sure to be careful to do the extraction outside away from any source of sparks, remember what you are making is essentially a pipe bomb full of weed =)\r\nthe product was a lot runnier and lighter in colour than other oil i've had, and tasted fairly horrible (always a good sign in kitchen chemistry =). it smelled alot like potent leaf. when smoked the taste was nice and definitly hashy, the high was very physical, not particularly intense mentally though. Definitly not as strong as other oil i've bought but still fairly potent when you consider it came from shit leaf that would otherwise have been thrown away. I'll definitly do this extraction again, it was well worth the 20 minutes work and $4 can of gas. A word of caution though, be careful how you store this stuff, we left it out on a glass dish overnight and in the morning at least half of it had evaporated away. if anyone knows a good convenient way to store this stuff i'd like to know it. \r\nJust a short follow up...I tried the method for a second time, doing exactly the same as i did the first time only using different weed (still leaf, but off much better plants). the results were much much better than last time, the oil was extremly thick and sticky (the first lot was alot runnier), and ALOT more potent, we spread a little on a joint and one toke instantly blew you away. this is indeed a very nice extraction, i'm suprised i haven't seen many other reports on it because it really couldn't get much easier than this, and there is no possible way that the materials (a can of butane gas and a length of pvc pipe) could be controlled. Why would anyone stuff around leaving a jar of powdered leaf soaking in alcohol for 3 days or setting up a reflux/distillation process when you can get some incredibly potent oil from a bag of leaf and a $3 can of gas, in around 30 minutes??\n\n\n"
}
