{
 "title": "Dream-like State",
 "author": "James",
 "citation": "   James. \"Dream-like State: experience with Nitrous Oxide (ID 859)\". Erowid.org. Oct 24, 2000. erowid.org/exp/859",
 "substance": "Nitrous Oxide",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 859",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 24, 2000",
   "Views: 10904",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThe first time I tried inhaling N2O was on an afternoon when I was considerably bored.  I didn't know what to do, when I remembered hearing something about there being nitrous oxide in whipped cream containers...so I thought I'd give it a shot.</p><p>All of the whipped cream was gone, so I just stuck it in my mouth, pushed the button, and inhaled.  At first, I just inhaled a little, for about 2 seconds.  The next time I got a lungful, and kept doing that until it was all gone.</p><p>At first, I thought that nothing was going to happen, but literally seconds later, I felt my lips get a little numb, and  I started giggling.  I didn't seem to think anything was funny.  I just started giggling to myself.  When I laughed to myself, it sounded different...sort of far off.  It sounded like I was in a day-dream, and someone was laughing in the background.  I also simply couldn't stop laughing.  I just couldn't control myself.  I tried taking a few steps, then found myself wobbling around, and almost fell over.  Through my eyes, everything looked a little bit different, sort of fuzzy, and some things were moving a little bit...shaking.  I also felt light headed, and very care-free; like nothing mattered.  I then felt a sense of euphoria, and the urge to talk to myself.  I talked to myself, and smiled, and giggled for about the next minute or so.  And then, all of a sudden, it all stopped.</p><p>I would have done it again, should there have been more nitrous in the whipped cream container.  This was my first time ever being under the effects of any drug...I hadn't even had my first drink before.  So I simply thought it was amazing.  Anyways, I've now found out that it can be dangerous, and I'm very careful now.  I always inhale out of a balloon, and never do it while standing up.</p>"
}
