{
 "title": "Comparable to THC, with Some SIde Effects",
 "author": "Luke",
 "citation": "   Luke. \"Comparable to THC, with Some SIde Effects: experience with Products - Spice and Synthetic Cannabinoids ('Spice Gold') (ID 85911)\". Erowid.org. Jul 22, 2010. erowid.org/exp/85911",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Spice Gold')",
 "bodyweight": "85 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 85911",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 22, 2010",
   "Views: 8876",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is of an experience which I made about half a year ago when I stayed with a friend for 2 weeks.</p><p>Well like everyone else I tried Spice because we ran out of weed and were not able to buy some. He still had a bag of Spice so why don't we use that? So we just rolled it up and smoked it like usual. First thing to notice: It tastes like shit. I would compare it to something like the smell of burning saltsticks or something like that.</p><p>Second thing: It somehow is comparable to THC but it didn't please me like weed does. It already starts with the bad taste, afterwards I felt kind of numb, but not the same 'warm' feeling weed gives me. It also made me quite indifferent, what maybe helped when the last part of the Spice story kicked in.</p><p>Third thing, and also the reason why I wouldn't smoke it again: After 1 hour or so I had these symptoms someone in another experience report described as a flu without the joint-pain. I think that's what describes it best. It was also freezing cold even though the heater was turned to maximum and I was under a thick blanket. After some 20 minutes or so I successfully fell asleep and when I woke up everything was gone (luckily). It was exactly the same as the aftereffects of taking too much 'Herbal Ecstasy' but without the puking. But that's another story... :)</p>"
}
