{
 "title": "A Nice Combo",
 "author": "Box Head",
 "citation": "   Box Head. \"A Nice Combo: experience with bk-MBDB & MDAI (ID 85938)\". Erowid.org. Jul 23, 2010. erowid.org/exp/85938",
 "substance": "bk-MBDB & MDAI",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 0:00",
   "1 cig.",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Tobacco",
   " ",
   "  T+ 0:00",
   "125 mg",
   "oral",
   "bk-MBDB",
   "(powder / crystals)",
   "  T+ 1:50",
   "200 mg",
   "oral",
   "MDAI",
   "(powder / crystals)",
   "  T+ 2:42",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 2:54",
   "137 mg",
   "oral",
   "MDAI",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 85938",
   "Male",
   " ",
   "Age at time of experience: 37",
   "Jul 23, 2010",
   "Views: 6977",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>21:45 We both parachute approx 125mg of Butylone. I have already had two beers and one medium strength spliff.</p><p>22:30 I start to feel the urge to mix. Clumsily I mix seven or eight songs. Music appreciation is increasing. I start to wiggle but not dance. I also feel the urge to connect but its not overwhelming.</p><p>23:35 We parachute approx 200mg of MDAI. </p><p>23:45 My head feels tight around the cranium.</p><p>23:55 I start to feel giddy but pleasant and my head feels rushey. There is an obvious need to communicate, hence this log, likewise, my partner is willing to type this log. My partner is typing very fast. Music appreciation is heightened. Also I begin smoking a medium strength spliff. My head feels very clear and I have butterflies, feeling slightly excitable. Fingers wont stop dancing, but this is commonplace for me, as a DJ and music obsessive.</p><p>00:06 I feel fine for 5 minutes then feel off it for 5 minutes. Music appreciation is still there. My partner is still typing very fast.</p><p>00:12 I am feeling really nice, pins and needles in arms, feeling a warm Ready Brek glow. Not overpowering or overwhelming, still clear-headed but fully aware that I am chemically enhanced.</p><p>00:23 I still feel high but yawned. Ready Brek glow very much present, feel snug and warm.  No particular sexual thrust (unlike Mephedrone, Methylone). Jaw shaking and trembling. Im drinking a medium vodka and lemonade.</p><p>00:27 No sooner have I typed the above and there is an almost instantaneous realisation that it is wearing off. My partner reports heavy eyes, but no real effects.</p><p>00:28 My partner feels clear headed but heavy eyed and yawning. I decide to give partner a bigger dose than me. My partner reports no other effects.</p><p>00:34 I parachute another 125-150mg of MDAI (partner 200mg). We decide not to mix with Butylone or Mephedrone at this point.</p><p>00:40 Almost immediately, I feel the warm arms and pins and needles thing, its very pleasant. My partner suddenly reports a real sense of focus. We are both still very clearheaded. It cuts through the booze but allows me to enjoy it. </p><p>(Throughout, music is really enjoyable but as time passes the interest decreases to a point of us chatting with no music playing in the background)</p><p>02:08 Music enjoyable again, following another 125 -150 mg parachute, ten minutes earlier. My partner has gone to bed.</p><p>02:15 I could easily go bed, but want to sit it out a little longer, no need for a stim... in this setting it would spoil and be wasted, with a group it might be a good idea.... I continue to listen to music, with the TV muted and on for a focus point.</p><p>03:35 Its bed time, I have eaten a few bits, the MDAI does not restrict appetite. ....Bed.</p><p>08:35 I wake up after a good sleep, it wasnt hard to fall asleep either, something that I do struggle with, even on a dry day. My head is very sore and aches (although this may be due to the amount of alcohol drank). I want to sleep some more... so I roll over.</p><p>1007 Stir again, my head is still quite sore.</p><p>10:56 I get up, head aches but not as bad as earlier. I hope the headache doesnt last.</p><p>17:29 I till feel a little heady but quite manageable.</p><p>Conclusion: A pleasant, mild, warming experience. It will not push or bully; it lifts me into a nice mood. Would I do it again...? Yes... Would I go out on it...? No. This is an at home with good company experience. If it doesnt hit my button then there is nothing lost I can still eat and sleep with no after effects apparent.</p>"
}
