{
 "title": "The Wind Cried Mary",
 "author": "Fat Boy",
 "citation": "   Fat Boy. \"The Wind Cried Mary: experience with Cannabis (ID 86)\". Erowid.org. Jul 27, 2001. erowid.org/exp/86",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 86",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2001",
   "Views: 11468",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It's surprising how such a small amount of a thing can effect such a profound change in a person. I just shelled out $30 for an eighth of ganja. I know it's a large price for such a small amount (4 oz is about $300 where I come from), but it was well worth it. It was my first hookup from this person (I will call him 'Steve'), and I had the usual hope/joy/fear feeling that comes from putting your trust in somebody you hardly know. Two days later, it happened, 'Steve' told me to meet him in class early; we would 'make the pass' there. A simple handshake and a smile was all it took. Now, normally, I don't like to do that stuff at school, because I believe that students that don't want to be exposed to 'drugs' at school have the right not to be (that and it's almost asking to get busted), but I made an exception that day. School flew by in a blur as I anticpated my enjoyment of the evening.</p><p>I got home at 3:00 that afternoon, and made my preperations. A glass of lemonade to stave off cottonmouth, a carrot (a very effective way to eliminate ganja breath), and 'Are You Experienced?' by Jimmy Hendrix was all I needed.</p><p>At exactly 4:20 I packed my bowl and sparked up. I took a few 'warm-up hits' (I hadn't toked up in a while) and took a few more regular hits. I then repacked and relit. </p><p>Now, I don't know if it was something in the ganja, or if my lungs just reacted strangely, but when I was about ready to take another hit, I involuntarily inhaled VERY deeply. I was overcome instantly with a feeling of extreme disorientation and confusion. I put my bowl away and just sat there for a while. I ate my carrot and sipped the lemonade as I felt the first effects of cottonmouth coming on. I put Jimmy on and listened for a while. </p><p>When 'The Wind Cries Mary' came on, I felt a funny feeling in my ears. You know when you have the munchies and eat something crunchy and get that really good feeling in your jaws? Well, I had that, only in my ears! It was the most amazing feeling I have had in my life so far (I'm only 16). I sat there for what seemed like hours, listening to 'The Wind Cries Mary'. I downed the last of my lemonade and grabbed a pack of gum on my way outside to see what I could see.</p><p>I sat in my back yard, chewing gum and watching the sun set. It was incredably beautiful. All the colors and shapes seemed to dance in the sky, just for me. I felt deeply awed and honored to be able to see this sunset. I sat and thought about myself and my life, and their directions. I learned some pretty deep stuff about myself that evening. For example, I found that by unintentionally acting like an asshole for most of my youth, I had hurt some people pretty badly, and had really been a major source of bad vibes. Others did not hurt me, I only hurt myself.</p><p>When I came down, I felt reborn. I wanted to put my lessons learned into use. My life was going to be better from now on, I came back to school with a new mission. I made amends with all the people I had hurt. I got some wierd looks (apoligizing to somebody for something you had done 5 years ago will do that). And started to learn, not just be there. What were once D's and F's are now A's and B's. I have turned my life around, all because of a kind green bush that the U.S. government has decided must be outlawed because the think it is bad for people. It is because they do not listen to people like me. They refuse to hear the good, only the bad.</p><p>I would like to thank Erowid for allowing me to voice my profound changes brought on by the kind bud. May we all learn greater lessons to come.</p>"
}
