{
 "title": "Zen  vs.  Insanity",
 "author": "Smoke psilo",
 "citation": "   Smoke psilo. \"Zen  vs.  Insanity: experience with Mushrooms (ID 8603)\". Erowid.org. May 3, 2004. erowid.org/exp/8603",
 "substance": "Mushrooms",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8603",
   "Male",
   " ",
   "Not Given",
   "May 3, 2004",
   "Views: 12852",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>    I was at a party one night with a few of my friends and were taking mushrooms.  We all were having a great time watching the carpet turn many different colors and basically just enjoying the trip.  We had probably eaten about 2 grams each of the mushrooms and were tripping very hard within the next two hours.  </p><p>    Being very interested by the type of mushrooms we had taken I decided that it might be interesting to smoke some of the mushrooms.  I then took some marijuana I had with me and crushed up the mushrooms and broke up the pot.  I mixed them together and added some tobacco i had.  Just myself and one other friend smoked the packed bowl.</p><p>    Within 20 minutes we realized that it was probably a bad idea.  Now I have never had a bad trip.  I always prepare for my trips days ahead of time, and I often meditate so I'm pretty in touch with my mind; however, it quickly became apparent that my friend was not.  I went from having visuals to feeling like, and believing that I turned into a puddle of water.  This was because i have spilled some water on myslef.  I was very content being a puddle of water and enjoyed myself thoroughly.  My friend on the other hand, whom I later found out had a history of mental illness, lost control.  We quickly realized that he wasn't alright, we had seen him trip many times before and he never had acted like this.  He could not see anyone, hear anyone, or speak.  He could let out a few squeals and shreaks of terror.  He began trashing everything in his path.  Knocking over anything that he was near, I tried my best to restrain him but he now had superhuman strength and me being a puddle of water at the time didn't help either.  What happened next was somewhat of a blur but I think what happened was I was so frightened that I ran out to my car where I fell asleep.</p><p>The other people in the house became so frightened by this raging bull of a wasted human that they called 911.  I was woken by a New York State Trooper at 4:37AM in my car.  Everything had seemed hazy but I looked around and saw that there were 10 police cars, two ambulances, and a fire truck, which I thought was absolutly absurd.  But apperently it wasn't that absurd because it required 6 men to restrain raging demon insde the house, and they promptly shackled him to a strecher and rushed him off to the hospital, where he fell asleep than woke up at 8:30Am and was fine. </p><p>     The next day he called and told me of the horror he had gone though that night.  Visions of death via demonic possesion were the only thing he could see and he could do nothing but fight these horrible inner demons that had sudsided from the depths of his mind.  When we had tried to restrain him it made things worse for him for we appeared as Satanic workers that were doing nothing but trying to kill him.</p><p>     To this day I'll never truely know if it was the smoking of the mushrooms that did him in or not, but I enjoyed the experience I had until the scene went sour.  But to this day I am haunted by the memories of that night, and the absolute horror that it went with.  I would not recommend smoking mushrooms to anyone with any mental illness, and no one should ever smoke mushrooms I they do not have tripping experience and aren't in touch with themselves and know their minds.  The term that comes to mind is self-actualization.</p>"
}
