{
 "title": "A Mildly Interesting Stimulant",
 "author": "Palmer Eldridge",
 "citation": "   Palmer Eldridge. \"A Mildly Interesting Stimulant: experience with 4-Fluoromethcathinone (ID 86047)\". Erowid.org. Jun 28, 2010. erowid.org/exp/86047",
 "substance": "4-Fluoromethcathinone",
 "bodyweight": "65 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 ",
   "rectal",
   "4-Fluoromethcathinone",
   "(capsule)",
   "  T+ 1:40",
   "200 ",
   "rectal",
   "4-Fluoromethcathinone",
   "(capsule)",
   "  T+ 9:00",
   "20 mg",
   "oral",
   "Pharms - Diazepam",
   " ",
   "  T+ 10:00",
   "10 mg",
   "oral",
   "Pharms - Diazepam",
   " ",
   "  T+ 12:00",
   "10 mg",
   "oral",
   "Pharms - Diazepam",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 86047",
   "Gender: Male",
   " ",
   "Age at time of experience: 50",
   "Added: Jun 28, 2010",
   "Views: 10243",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>T= 0 = 01.05 am</p><p>Setting: relaxed, at home, secure environment. The time of day was not optimal, but the time was available.</p><p>Setting: I am not worried about the effects of this relatively little known material as I have read a few accounts of it and had tried taking in combination with other stimulants before with no alarming effects. I am not expecting much from what I have read, but am curious. I have experimented with mephedrone, methylone, bk-MBDB and bk-MDEA and had enjoyed those generally, although bk-MDEA has dysphoric tendencies, as can bk-MBDB occasionally.</p><p>0.00: 150 mg 4-MC in a gel cap, taken rectally.</p><p>0:25: A slight feeling of excitement, something is happening. I am organizing my CD ad music files and the activity is more than usually interesting, almost obsessive.</p><p>0:40: A feeling of well-being, tinged with a slight nervousness, is present. No real euphoria to speak of.</p><p>1:30 Still working on my music collection. It seems a bit like amphetamine in that it encourages mindless repetitive activity. In small doses it could be used as a study aid, perhaps. It is much less more a plain stimulant than mephedrone, methylone, bk-MBDB, less empathic. It is has a low quotient (but not zero) of entactogenic qualities. I feel no uncomfortably elevated heart rate or other signs of physical discomfort so I decide the dose may be too low.</p><p>1:40 200 mg (rectal) This time there is more excitement over the next couple of hours. I feel the desire to watch porn on the internet, which is OK but not as fun as it can be with other stimulants. I have a feeling of wellbeing but there is little magic.</p><p>4:00 350 mg (rectal) I feel the desire to re-dose, which is a bad idea, but I do it anyway. Ive finished my supply now. There is slightly more euphoria now, which is enjoyable but nothing exceptional. I notice my body keeps getting stuck in one position for a long time, sometimes causing discomfort. I felt little desire to drink fluid and zero appetite, As time goes on I feel more and more disorientated. Time is meaningless. Its hard to remember what I have been doing.</p><p>07:00 Begin to fell the negative effects, typical of a stimulant. Im a bit jumpy and nervous. Waves of dysphoria come and go.</p><p>09:00 Take 20 mg of diazepam as I want to sleep. That makes me feel more comfortable but not sleepy.</p><p>10:00 Another 10 mg of diazepam. Still no sleep.</p><p>12:00 A further 10mg eventually gets me to sleep for about six hours.</p><p>18:00 Waking up I feel terrible. I feel very negative about everything and very weak. No appetite and feel stiff. This may be partly due to the amount of diazepam taken to get sleep and lack of food.</p><p>Afterthoughts: I cant see why this material should become very popular. The duration is fairly long, similar to bk-MBDB. I have no particular desire to ever take this material again, at least not by itself. There are much better alternatives. The optimal dose may be quite high, as much as 400 mg, but I wouldnt like to speculate about that too much as too little is known about its toxicity.</p>"
}
