{
 "title": "I Felt Smaller",
 "author": "AmanitaLuv",
 "citation": "   AmanitaLuv. \"I Felt Smaller: experience with A. muscaria (ID 86100)\". Erowid.org. Jan 14, 2013. erowid.org/exp/86100",
 "substance": "A. muscaria",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "6.5 g",
   "oral",
   "Amanitas",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 86100",
   "Gender: Male",
   " ",
   "Age at time of experience: 25",
   "Added: Jan 14, 2013",
   "Views: 1320",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had been researching amanitas for about a year before this experience. After reading the many terrible trip reports I wanted to make sure I did this respectfully and got something positive out of it. Before my successful trip I tried a dose of 3.5 G but got nothing out of it. \r\nMy first experience with success was a night when I was home alone and the parents went out of town. I did this with the intent of respecting the spirit of the mushroom and having a positive experience. I put on a movie and measured out 8.5 G of Amanita muscaria. I knew from before that I don't mind the taste so I ate it as it was after brushing off any dirt. One thing I would like to point out is I took my time eating it. I had a feeling that taking things slow may help with the nausea and am not sure if that's why I handled things so well or not. \r\nAfter measuring it out and sitting down I slowly ate the mushrooms over a period of about 35-45 minutes. I had already determined I would not take more that night if nothing happened. I heard too many horror stories and know it can take a long time to kick in, I kept respect for the mushroom in mind.\r\nAbout 30 minutes after finishing I began to feel different, kinda like a little drunk I guess. A few minutes later my perception of size became strange as I felt smaller. I called a pre-arranged phone sitter. Things got more intense and I began having conversations that I now realize made no sense or I would forget what I was talking about and change the subject to something random. I remember at one point my friend was talking about a video game and I went from talking about playing with her to randomly discussing some fantasy world based on it in my mind that was completely nonsensical. I even got ahead of myself in speech a few times but was still in tune enough with what was going on to say 'wtf' and realize my mind was moving too fast. I got off the phone and sat down to watch the movie.... \r\nThat was the light part, now I have heard horrible reports and know some people say they got nothing from this mushroom. I personally believe I didn't get sick because I respected the mushroom and took my time doing it.  \r\nI almost drifted off and think I laid there for about 30 minutes completely out of it before I forced myself up. It was the moment I stood up that I realized I was really feeling effects of this mushroom, and hard. I understand now why they say to be careful because I almost fell up the stairs but caught myself. I then decided I should call my sitter back. The problem was I could not figure out how to use a cell phone. I spent almost 30 minutes which involved me locking myself out of the phone, taking out the battery, and in the end I still couldn't call her. She ended up calling me because I somehow sent her three blank text messages. After that I decided to cook pizza and accidentally cooked it twice in the microwave without anything under it. I also couldn't remember getting out silverware, so I had burn pizza, a counter lined up with silverware, and a microwave covered in cheese. For this reason I don't recommend cooking on these if you are to the point it's hard to set the timer on a cooking device. \r\nAnyway, aside from the few disaster (which made fun stories anyway) I felt I learned things. I had heard the vikings may have used these for battle frenzy. I feel I understand that now after my charge up the stairs and almost falling. I had to remind myself to worry about injury. I can see how lack of such concern could benefit in battle. \r\nI went to bed about 4 hours into the trip.\r\nI also had amazing dreams! \r\nBeautiful! I don't know if that is standard with amanitas but had not seen it reported. Beautiful, vivid dreams. I also felt wonderful the next morning. I will be doing this again and always with love and respect.\n\n\n"
}
