{
 "title": "Nothing Appeared to Matter",
 "author": "The Gram Breeder",
 "citation": "   The Gram Breeder. \"Nothing Appeared to Matter: experience with Products - Spice and Synthetic Cannabinoids ('K2 Mellow') (ID 86139)\". Erowid.org. Jul 22, 2010. erowid.org/exp/86139",
 "substance": "Products - Spice and Synthetic Cannabinoids ('K2 Mellow')",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   ".5 g",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Tobacco",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 86139",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Jul 22, 2010",
   "Views: 5885",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast semester my Christian medium sized private school decided to implement it's first drug testing policy.  Our school, particularly my class, was filled with nice, mellowed out potheads, they are all good people who just don't aspire for a whole lot.  They're still my best friends though, we were a pretty tightly knitted group.  \r\nSo yeah we all loved to smoke marijuana.  We were mostly smart about it and succeeded in avoiding any run ins with the law.  This drug testing policy was going to be a hair follicle which tested up to 90 days, and it started at the beginning of the next school year.  Which meant no smoking the herb all summer.  Easier said then done.\r\nSo I decided to try some different legal herbs of different sorts and there was a very popular one named K2.  Different flavors, scents, smokes, etc. Well I decided to smoke a larger amount of a particular flavor called K2 mellow.  \r\nI mixed in in a large pipe with some grade A pipe tobacco and proceeded to smoke it.\r\nTaste is pretty good and I immediately get the head high from the tobacco, followed in the ensuing body/fucked up stoned of the K2....\r\nSo i chilled in my car a bit listening to some music at night when I was smoking this.  It was a pretty bad ass vipe and despite critics of the K2, I found it really enjoyable and not freaked out at all.\r\nThis was about my 6th time smoking K2 but I think that in moderation it may not be to bad.  \r\nTowards the end of my bowl I went inside and got on my computer and was very tripped out.  I'd try to get on a site just to wonder what it really all meant.  A lot of introspective stuff which I hadn't had before.\r\nPretty good though.  \r\nPeace and Pot!\n\n\n"
}
