{
 "title": "Amazing Alternative",
 "author": "larulezd00d",
 "citation": "   larulezd00d. \"Amazing Alternative: experience with Products - Spice and Synthetic Cannabinoids ('Stinger') (ID 86159)\". Erowid.org. Jul 22, 2010. erowid.org/exp/86159",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Stinger')",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 86159",
   "Female",
   " ",
   "15",
   "Jul 22, 2010",
   "Views: 6804",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been smoking cannabis for a few months now, and the other day I was out dry. Nobody was selling lately so I was pretty bummed. I was with a friend and I was explaining to him my problem. He told me about some spice products at the gas station that work just as good. I had trouble buying into it at first, no believing it would get me high. Sure enough I went and bought a 500mg bag of the brand 'Stinger.' </p><p>The next night I decided I'd give it a try. I went outside with my pipe, lit a few bowls at around 11pm. About 10-15 minutes later I felt the effects immediatley. I couldn't belive that it actually worked. My mind was swirling and I kept forgetting things like I usually do when I smoke mary jane. A great feeling of relaxation swept over me around 30min later and I could not stop smiling and laughing at everything. The high lasted about a good hour or so. </p><p>The only difference I could really notice was that usually after my marijuana high I feel buzzed for a good while afterwards. I did not feel a buzz at all after the spice. It was like I was high for an hour and then it dropped and I was back to completely normal. It didn't last as long as I had hoped for but it is a great alternative to the real thing, plus it's legal in most states and doesn't show up in drug tests. I will most likely be using this product again in the near future.</p>"
}
