{
 "title": "Seizure from Being Careless",
 "author": "Jdubb",
 "citation": "   Jdubb. \"Seizure from Being Careless: experience with Alcohol, Alprazolam & MDMA (Ecstasy) (ID 86167)\". Erowid.org. Mar 7, 2011. erowid.org/exp/86167",
 "substance": "Alcohol, Alprazolam & MDMA (Ecstasy)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "4 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "15 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "4 tablets",
   "oral",
   "MDMA",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "86167",
   "Male",
   " ",
   "19",
   "Mar 7, 2011",
   "Views: 6287",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Now I am well aware of the effects of first taking Xanax before E causing blackouts. And this is probably one of the stupidest things I have ever done. This is a very bad mix.</p><p>So my girlfriend and I come home from a party drunk, my girl kept complaining about blacking out. This is because she took a white ladder (2mg bar) and god knows how many shots. Now I thought she was just overreacting. So later on this morning about 3 AM I decided to take 2 bars (my tolerance is ok enough to take this amount). Now where I messed up here was I was so drunk that it altered the alprazolams effect on me. So I too was starting to black out during my owning spree in COD modern warefare2.. or super streetfighter IV? </p><p>SO I am guessing it was about 4 or 5 AM and I decided to go to my homies house where they were still playing beer pong (I didnt know of this till my bestfriend told me about this a few days later). And I guess I took more bars. Take note I do not know how many bars I ate till I looked in my bag of xanys a few days later. </p><p>Then it comes 7am. My girl told me that her and I got into a big fight, and that she ended up going to her homegirls pad, and I went to my cousins. This is where by then I had consumed all 9 and a half bars. Now I dont know why I had the temptation to roll, but for some reason I went in the house and asked my cousin if he was down to drop, as usual he was. This is around 7:30am and my cousin told me I ate about 4-5 thizzles (stupid me). Buuut anyone that eats bars knows that your just down for anything. BTW these were Green light bulb pokeballs. </p><p>8am. So we are rolling and we decide to go to my other homies house where you can just chill and get fucked up. But first decide to take a stop to smiths to take a shit (Ive done this to make the roll hit me faster and harder).</p><p>Now this is where it all goes bad. My cousin and I were stogging outside when I start having a seizure and collapse. Now he calls my cousin and the Paramedics.</p><p>9am. I am in the hospital with my loving girlfriend, close friends and parents... apperantly I was making a fool out of myself.. but thats how it is when I'm at the hospital barred out. So I dont really remember anything till my girlfriend, cousin, and friends tell me their experience with me on this shit. I was in the hospital for 3 days running EEG tests to see if I'm epileptic, thank god not. </p><p>Well thats all I can say from my experience. Common sence was absent on my part. To those who abuse, use in moderation and common sence. If your tolerance is high then chill out for a bit instead of bumping your dose up. And those who have no control, dont stock up on the goods! Taking the bars during the comedown, always works. But taking it before rolling made me black out and not remember anything. </p><p>Thank you for your time!</p>"
}
