{
 "title": "Fireflies and the Full-Moon Sky",
 "author": "FerretFace",
 "citation": "   FerretFace. \"Fireflies and the Full-Moon Sky: experience with MDMA, Mushrooms & Ketamine (ID 86254)\". Erowid.org. Dec 20, 2013. erowid.org/exp/86254",
 "substance": "MDMA, Mushrooms & Ketamine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "oral",
   "MDMA",
   "(capsule)",
   "  T+ 1:30",
   "125 mg",
   "oral",
   "MDMA",
   "(capsule)",
   "  T+ 2:00",
   "1 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 7:00",
   "  ",
   "insufflated",
   "Ketamine",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 86254",
   "Male",
   " ",
   "Age at time of experience: 18",
   "Dec 20, 2013",
   "Views: 354",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have never written my own experience report with psychoactives before but this night was quite possibly the single most amazing, beautiful and inspiring night of my entire life to date. So I would like to share this one experience with whoever may wish to hear about it.</p><p>(This is a little lengthy but it was the best I could describe my experience.)</p><p>I am male, 5'7 and only 115 lb.</p><p>My story begins on a summer's morning at the end of June, for weeks I had been feeling quite let-down because there was going to be a free outdoor 21 hour rave near my city; and I didn't have a drive there! There was a shuttle-service set but I did not have enough money for both that and my 'treats'. </p><p>After frantically searching for a ride this girl I have only met a few times (we'll call her G) messaged me because she heard I had no drive and said there was space for me with her and some of her friends in their car. I was so unbelievably ecstatic and thankful.</p><p>So I hopped in a car with G and her friends, and on the drive up (it was a good hour drive out of town) I found out one of her friends in the car had a good 2 grams of very pure MDMA, which they offered to capsule and sell some to me. I bought 1/4 a gram (250mg) in two capsules. </p><p>We arrived at the site around 2pm and everyone began setting up tents (to chill in essentially and lay down if needed). The music had started at 1pm and the event was to go to 10am the next morning. In my excitement earlier in the day I forgot to eat, but it didn't matter I wasn't going to be all that hungry later anyways.</p><p>I have consumed many ecstasy tablets before (probably 1-4 times a month for a year and a half, with a few small month or month and a half breaks here and there) but only once had I done pure MDMA which was on my very first time, so you can imagine I had great difficulty waiting for night fall, but I did nonetheless. </p><p>I was laying on a blanket looking at clouds with a group of people I knew, waiting for my girlfriend and her friends to arrive (they were due in around 9 pm) so at 7:30 I decided to take my first capsule because usually I take a good 60 minutes to begin coming up, and doing this I could start my high by watching the sun-set. My friend K decided she would also take hers as well and so did my other friend C they each had just normal tablets, which were apparently quite speedy.</p><p>To my pleasant surprise at about t + 40:00 (8:10 pm) I started to feel a very wonderful warm sensation that began to move quite comfortably from my stomach all the way through my chest, through my arms and then to my face and finally my mind. Never had I felt such a smooth relaxing come up. My jaw began to clench uncontrollably so I opened my pack of gum. I had no real desire to run around, or go dance I just felt like cuddling with C and K, watching the clouds and looking for shapes in them listening to the great Dub-Step playing over at the stage/dance floor, or really I should say dirt about 50 meters across the clearing. This was definitely good MDMA, I have had many experiences with speedy pills and I love Ritalin, and other prescription speed-like substances and I can tell you right now this stuff had none of that in it. Perfect Ecstasy.</p><p>At t + 1:15 (8:45 pm) more and more people were beginning to show up, until that point maybe only about 50 or 100 were there but suddenly the crowd began to build up as people ran about setting up more tents in the small adjacent clearings and wooded sites. Even better the sun was starting to go down. Brilliant colors of pink, gold, and red shone off the wonderful and quite odd clouds we had scraping across the sky that day.</p><p>The sun had finally got close enough to setting that the stage lights lasers and trippy visual screens were turned on and people flocked over to begin the real dancing. K and C decided to go join the dancing, their pills had given them great amounts of energy (speed), I however was feeling far too chill, I was perfectly content sitting over on my blanket talking to various acquaintances and strangers as they would come over to chat. We talked about typical things, where we were from things we liked to do, we told stories of past experiences and made jokes. I really enjoyed this because I normally suffer from Social Anxiety, but I felt completely open and empathetic for others, as MDMA should do.</p><p>At t + 1:30 (9 pm) my girlfriend finally arrived (we'll call her \n</p><p>T + 2:00 (9:30 pm) Night had fallen but some heavy cloud cover settled in, everything was in full gear now there was easily 300, 400 maybe even 500 people now here and the mood was infectious, people making out, jamming to the sick Drum and Bass that was up at the time and some like me, just running around catching up with people I haven't seen in ages. I was starting to feel insanely good, hardest best roll I've ever been on, eye shakes, jaw clenching like crazy. And then \n</p><p>However she had disappeared likely to go dance, I still really just felt like being social instead of dancing quite a shame but I was still appreciating the music and having a good time. Then I saw my old friend J, I don't see J often and she's probably one of the most-chill people I know so we were a good match to hang this night. She had also just eaten the same mushrooms (except 1.5 grams).</p><p>At about t + 2:45 (10:15 PM) My MDMA high was still coming up really strong as my second hit had joined my first, and I got that familiar feeling I get whenever I eat mushrooms. The laughing gas effect. I just began to laugh and laugh and laugh, so did J though I am still not entirely sure if it was because she gets that too or if she was laughing at my laughing. What I did know though was it was hitting her too. She had taken nothing else yet and did not the rest of the night.</p><p>We decided to go explore the site which once upon a time was a junk yard now buried by dirt and reclaimed by the forest, some evidence still remained a tire here, some wrecked up cars in the trees. We followed a little dirt road that led from my tent past some others and it led to a path. I was feeling very adventurous as well as indestructible and so was J so we decided we'd check it out. The path twisted and turned, we skipped and ran and walked along talking about just about everything. At this point I was getting some mild visuals a little color change and some lights in the corner of my vision, which is something I always seem to get when I do mushrooms. I wasn't expecting much in the form of visuals, as I usually prefer to eat 1.5 or 2 grams and I had just done mushrooms earlier that week. But my thoughts were in a whirling confusing way, which I recognized as mushrooms sort of mind high.</p><p>T + 3:00 (10:30pm) We continued down this path, at this point we were laughing and playing like children, picking up sticks which kept changing color every time I'd see them on the ground and I'd think it was a glow stick and grab it to be disappointed.  We came to what appeared to be a recently used dig site or something along those lines. There was a mound of sand, soft sand like at the beach J climbed it and declared it to be 'Mushroom Mountain'. She also proclaimed it was time to be one with nature and go barefoot, I followed suit, walking in bare feet allowed me to feel the earth and it reminded me just how amazing gravity is, keeping my feet down. We sat in the sand, which felt like getting a professional foot massage, and then I turned and saw the most amazing thing I'll ever see.</p><p>Back behind us the clouds parted and the moon was Revealed, it was a full moon and it looked so beautiful, purple clouds near it's base as it glowed down on me. I felt its warmth like basking in the sunshine. From way back at the rave in the distance we could hear everyone let out a massive howl, and we joined in the howling.  As we howled we noticed something else, the forest and clearing beside us light up, here and there, everywhere. There were thousands of green lights flying around, Fireflies. This was my first time ever seeing a firefly, and there were so many I couldn't ever count. We began to walk towards them, and in this moment, with the moon about, the forest lit and the earth on my feet I came into a almost spiritual realization of how even the smallest of creatures depend on everything in our plant. How everything is connected and how beautiful it is. We sat there for a good 35 or 40 minutes in complete awe. Fear no longer existed, time no longer existed, just this place of perfection. We turned to each other and said 'I'm so glad were friends' simultaneously, we hugged and laughed. We really did feel connected that night as if we were one mind.</p><p>T + 4:00 I finally came to my senses and checked the time on my phone, it was 11:30 pm and I realized we told no one where we went so we hurried back. Barefoot of course. I decided to stick to nature and I went to dance barefoot, it's always fun dancing on mushrooms the music felt as if it flowed through me for my body to interpret. Still no intense visuals but definitely slight alterations and the lights did do some questionable things. Over to the side a group was in a circle so J and I investigated, in the center this girl had a hoola-hoop the crowed cheered her on as she did crazy tricks with it. Spinning it from her hips to her foot throwing it to the air catching with here neck and hoolaing it back to her arm up her legs and back to her hips, really crazy stuff. Then to my sudden amazement I realized the hoola hoop was ON FIRE (it had little prongs evenly spaced around the outside that could be light) I was very amazed and joined the cheers the flames kept changing colors too. I then realized my mouth was bleeding and ran back to my tent for gum (I had clenched down really hard on my lip).</p><p>T + 6:30 (2 am) I don't remember much of the time between the hoola hoop and here I just know it was good. I rolled and tripped ballz. But now I was pretty sobered up except for what I call 'Shroom-Phoria'. It is this feeling of complete ease and well...euphoria I have that lingers for a good 3-4 hours after my visual effects are gone when I eat mushrooms. That is why I like to mix it with ecstasy because it sort of negates the comedown for me. I found my no idea she was at the rave. I tackle hugged her to the ground and she came in my tent with us. We'll call her H.</p><p>T + 7:00 (3am) me and H and \n</p><p>Looking back I wish I hadn't done the K as I felt pretty sick the next day and I think that may have been to blame. As my stomach is pretty tough and Pills and Mushrooms never ever make me sick. Well except for pipes. All in all this was the most memorable experience I have had, and I hope to have many more.</p>"
}
