{
 "title": "First Experience",
 "author": "rawmo",
 "citation": "   rawmo. \"First Experience: experience with A. colubrina & B. caapi (ID 86298)\". Erowid.org. Dec 7, 2013. erowid.org/exp/86298",
 "substance": "A. colubrina & B. caapi",
 "bodyweight": "89 kg",
 "header": [
  [
   "DOSE:",
   "10 g",
   "smoked",
   "Anadenanthera colubrina",
   "(extract)",
   " ",
   "0.5 g",
   "smoked",
   "Banisteriopsis caapi",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 86298",
   "Male",
   " ",
   "Age at time of experience: 39",
   "Dec 7, 2013",
   "Views: 455",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Method of extraction: 10g Cebil onto ~500mg Caapi leaves, using bufotenine IPA extraction tek</p><p>t 00:00  4:00. 4 small cones of Caapi leaves infused with Cebil extract were smoked. Unsure of exact dose strength, but aimed mild.</p><p>t 3:00  8:00. Feeling of tightness in face and slight nausea, mildly uncomfortable.   Slight 'distancing' from 'normal space', slight balance perceptual alterations when standing up but easy to adjust with very mild concentration.</p><p>t 4:00. Lay down on bed in dark room.</p><p>t 5:00. Visuals began to start. Built in perceptual level with active concentration.</p><p>t 8:00. Nausea and peripheral tightness had subsided almost completely.</p><p>t 9:00. Visuals present (closed eye only). Subtle but definite.</p><p>Characteristics  </p><p>Rapid cycling/flashing through images (approx 5 per second).</p><p>Image style  'real world' visuals (i.e. of common day events), i.e. non-psychedelic.</p><p>Head space  normal space clarity, but with a dreamy edge. No ontological distortion or adjustments which seems characteristic with other members of the tryptamine family.</p><p>t 15:00 (approx). The odd (approx every 30 sec) more characteristic DMT style visual briefly appears overlaying the 5/sec non-psychedelic visuals. Head space  normal space.</p><p>t 30:00 (guess). Effects slowly ramp off. Enter into more standard dream state / rest.</p><p>Fell asleep after the experience. Dreams particularly vivid and semi lucid.</p><p>2 stages of dreams (in both occurrences):</p><p>Stage 1  snapshots of images in a surrounding (normal space) with a focus on particular events occurring. Non linear, small snapshot (3-4 second) type sections.</p><p>Stage 2  The full dream, but as each dream lead to an event where the stage 1 snap shot was about to happen a realization would occur of awareness of what was about to happen and corresponding lucidness. It was like being aware of the future.</p><p>No noticeable after effects. Next day hangover and couldn't see the future, even with thinking about it really hard.</p><p>Worth trying more next time as this apparently passes the visuals past the normal space into psychedelic space.</p>"
}
