{
 "title": "Proceed With Caution",
 "author": "Waschbr",
 "citation": " Waschbr. \"Proceed With Caution: experience with Smoking Blends (Cloud 9 and K2 Summit) (ID 86408)\". Erowid.org. Jul 19, 2010. erowid.org/exp/86408",
 "substance": "Smoking Blends (Cloud 9 and K2 Summit)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Products - Smoking Blends - Cannabis-Like"
  ]
 ],
 "footer": [
  [
   "2010",
   "86408",
   "Male",
   "",
   "26",
   "Jul 19, 2010",
   "11416",
   " "
  ]
 ],
 "report": "<p>Personal Background:</p><p>I'll start with where I'm coming from... I smoke more than my fair share of cannabis. I'd estimate I've smoked pot almost every day for the last 3 years, and more sporadically going back about 8 years. I smoke up to scramble my thoughts and change the subject, often to escape negative thought-loops. While this regimen is probably ill-advised, I have managed to still be a productive, functional member of society.</p><p>As for the other chemicals... I'm a regular coffee-drinker and a light tobacco-smoker; about 2-4 cigarettes per week. I've had a handful of experiences with magic mushrooms, salvia divinorum, and adderall and found each to have its place. I take no prescriptions or supplements. And I don't touch alcohol.</p><p>Sidling up to Spice:</p><p>I had heard that local headshops were selling a legal 'synthetic THC' product that actually worked, so I decided to give it a try. There were about 2 dozen different varieties available at the shop in my neighborhood, but the staff there strongly recommended a brand called Cloud 9 and I went with their advice.</p><p>My thinking going into this was that anything from the headshop would have to be weaker than real, honest cannabis. Thinking like an economist, I reasoned that so much value was added by it being both legal and readily available that vendors would have no incentive to make it particularly potent, so long as they could consistently deliver some baseline level of cannabis-like effects. I was wrong.</p><p>Initial Encounter:</p><p>I smoked my first bowl of the stuff over the course of about 15 minutes and didn't really feel anything until the very last hit. The come-up was a bit slower than I expected, but I was properly stoned by about the 20-minute mark. It came on as mostly a body high, emanating from the back of my head, with waves of tingliness rolling up over my head and down to my face. It was a little salvia-esque, but not as severe. I quickly realized it was in my best interest to sit down, but it didn't forcibly knock me down as salvia might have.</p><p>Aside from the strong 'sit-yourself-down' body high (not a 'let's-go-for-a-run' body high), it did cloud up my head and scramble my thoughts to my satisfaction. It was somewhat calming, but not particularly euphoric or amusing. Food didn't seem to taste any better or worse. Music wasn't particularly enthralling. I didn't feel particularly creative. It seemed to last a bit longer than I was used to, but I was not keeping good track of time by the end.</p><p>This was an interesting substance, but it was definitely not cannabis.</p><p>Prolonged Exposure:</p><p>Not too long after first trying Cloud 9, I ran into some troubles with my cannabis supply-chain. I could have scared some up eventually, but it would have meant a big production, going through freinds-of-friends-of-friends-of-friends... and there was this legal stuff readily available just down the block. It wasn't my first choice, but it would suffice.</p><p>I proceeded to use the Spice product as I had been using cannabis for about 4 weeks (mostly this Cloud 9 brand, but also some K2 Summit). I generally smoked about 0.25 to 0.50 g/day, everyday. </p><p>For the first two weeks it was going fairly well. The body-high aspect of it meant I was pretty much guaranteed a case of 'couch-lock,' but I was alright with that as long as my thoughts were getting scrambled, and they were. Then things got interesting.</p><p>I'm not sure if it was some kind of cumulative effect, or a particular batch, or what, but after about two weeks of daily use I started having hallucinations pretty regularly while using it. I would look down at the ground (usually outdoors) and see a giant boa constrictor at my feet and it would take a good 10 seconds to reassure myself that it was not in fact corporeal.  </p><p>Another memorable one occurred as I was walking and in mid-stride I thought I was about to step on a raccoon and kind of jumped off-balance to avoid him. Fortunately for both of us, he was not really there. None of these hallucinations struck me as particularly dark or threatening. My emotional responses ranged from 'well, that's pretty crazy,' to 'oh, dear, I hope I didn't hurt that raccoon.' (I have on occasion had my eyes play tricks on me while smoking cannabis in poor lighting, but these experiences were quite a bit more vivid and convincing than anything like that.)</p><p>Also around the two-week mark I started to notice that every time I smoked Spice product, one of the first effects after coming up was that I had some sort of tunnel-vision. Things were clear straight in front of my face, but my field of view was framed by a substantial ring of red, green, and blue spots. The spots were exactly like the 'stars' one sees if one is a bit dehydrated and stands up too quickly, though in my experience they don't usually arrange themselves into a ring like that. This tunnel vision would become less pronounced after about 45 minutes, but would usually linger to some extent for about as long as the body buzz.</p><p>I also caught myself slurring my words a few times while it. This has never happened to me with cannabis.</p><p>The Dark Side:</p><p>Though I found it to be very different from cannabis, I would characterize all of the above mentioned effects as 'neutral' to 'positive.' (At one point I found myself thinking, 'this is nothing like cannabis at all, but rather it's like what they said cannabis would be like in DARE class... and that's okay with me.')  Then, after about 3 weeks of daily use it took a turn towards the unsavory.</p><p>I found myself craving it more strongly than I had with any other substance in the past. I was looking for (and creating) 3-hour holes in my schedule to sneak in an extra bowl here or there. (I had always been able to restrict my use of cannabis to the end of the day, after I had all my responsibilities taken care of.) It was a bit unsettling, but I continued and my consumption climbed up a bit, into the 0.40 to 0.60 g/day range.</p><p>Then one afternoon I was experiencing the tunnel-vision described above and noticed my heart was beating awfully fast. I sat down on my couch, stretched out, drank some water, and concentrated on breathing deeply and slowly, but my heart kept racing. I wasn't moving, but my heart was pounding out of my chest, as though I were cycling or running at a full-on sprint. It was quite scary, but I recognized that more adrenaline was the last thing my body needed, so I focused on peaceful thoughts and just rode it out. My best guess is that this lasted 30 minutes.</p><p>I should have quit right then. I was scared of wrecking my heart, but on the other hand I had already smoked this stuff dozens of times without any adverse reactions, so perhaps it was a fluke. And there was the aforementioned craving.</p><p>I continued using it daily for 5 days after the heart-racing incident. During that stretch, I experienced the heart-racing two more times. I found myself thinking that I really needed to stop smoking this stuff, but somehow I kept going back to it. (There's a word for that, no?)</p><p>One evening about an hour after smoking one more bowl, I smoked a (tobacco) cigarette-- and it knocked me to the ground for about 15 minutes. I was conscious, but struggling to catch my breath and keep control of my heartbeat. Sitting up was not possible.</p><p>That was enough. Things were getting out of hand. I felt like I had just been subjecting my body to way too many chemicals lately. I resolved to take a break for a while, and as of this writing I haven't smoked anything in 4 days (quite unusual for me). Even after the rough time described above, the thought of smoking again is more tempting than it ought to be. I think I'll be sticking with good old cannabis going forward.</p><p>The Upshot:</p><p>This stuff certainly has some interesting effects and can yield positive experiences if approached with the right mindset and in a safe setting. However, I think it does everyone a disservice to liken it to cannabis in any way. It scrambles my thoughts and gives me a body buzz, and the similarities end there. I reckon it's about as similar to pot as it is to anything else that will set one off-kilter.</p><p>If you're looking for pot, just smoke pot. If you're looking for something else entirely, proceed with caution.</p><p>Cheers!</p>"
}
