{
 "title": "Left Me Numb",
 "author": "CandyRayne",
 "citation": "   CandyRayne. \"Left Me Numb: experience with Products - Spice (ID 86442)\". Erowid.org. Jul 30, 2010. erowid.org/exp/86442",
 "substance": "Products - Spice",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   " ",
   " ",
   "40 mg",
   "oral",
   "Amphetamines",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 86442",
   "Gender: Female",
   " ",
   "Age at time of experience: 27",
   "Added: Jul 30, 2010",
   "Views: 5128",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI smoke marijuana occasionally. I take 20 mg of amphetamine twice a day for ADHD but that day I had taken an extra pill because I had not gotten much sleep. We had planned to buy some dro but none was available and so we went to our local head shop and purchased a 1 gram of what the cashier said was the best they had. He warned us that we would not need much to get some sort reaction. I had never tried anything like this before and so had no idea what to expect. The package had no ingredients that I can recall so I cant say what was in it.  <br>At about 11pm we opened up the package and it looked similar to marijuana but it was a lighter green and it was not dense or sticky. I loaded a bowl in a helix pipe and took one medium size hit. It tasted nothing like marijuana; it almost tasted like an herbal cigarette. We passed it around and I took several more hits, I would like to say 4 and I took them all in quick succession. I assumed that since it was legal that it would not be that strong and I was wrong. <br>About 5 minutes later I definitely started to feel high. The lighting seemed dimmer and I was drifting swiftly into another world. I was staring off into space and not paying attention to anyone else in the room. After about ten minutes I needed to sit down, I wasnt feeling dizzy but just instinctively knew that sitting down would be the best thing to do. <br>That is when things got bad. My friends had only taken 1 or two hits and they felt just fine, they had a buzz but my experience was becoming much more intense. My whole body began tingling and I started to feel numb. I felt completely paralyzed and unable to move. I am not going to say that I was 100% lucid but I could verbally respond to questions and I was aware of what was going on around me. The numbness spread to every part of my body. I could not feel my legs at all, even my mouth and tongue felt numbed like at the dentist. <br>I kept my eyes closed and started to experience strange images in my mind. There was a movie playing and I kept seeing these bizarre images that didnt correspond to the movie but the things in them were speaking the dialogue. My mouth became very dry and eventually I was able to lie on my side. I didnt feel dizzy or nauseous; I was just completely unable to move any part of my body. This lasted about almost 3 hours and then it wore off almost instantly. <br>It left me feeling very tired, but it was also after 2 in the morning and so that is to be expected. None of my other friends experienced anything like I did, though they didnt do as much as I did as quickly as I did. They all said their experience was very similar to marijuana and had no numbness like I did.<br>Overall I had a very bad experience with this product however I would probably try a small amount again. I imagine if I only took one hit that I would have such a strong reaction again. I will say that in the past when I smoked some very good dro that I had a similar though not as strong reaction.\n\n\n"
}
