{
 "title": "Usually Good but Had One Horrible Trip",
 "author": "Livia",
 "citation": "   Livia. \"Usually Good but Had One Horrible Trip: experience with Products - Spice and Synthetic Cannabinoids ('Spicy Green') & Alcohol (ID 86508)\". Erowid.org. Jul 24, 2010. erowid.org/exp/86508",
 "substance": "Products - Spice and Synthetic Cannabinoids ('Spicy Green') & Alcohol",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)",
   "  T+ 1:00",
   "1 bowl",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)",
   "  T+ 2:00",
   "1.5 oz",
   "oral",
   "Alcohol - Hard",
   " ",
   "  T+ 2:00",
   "1 bowl",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2010",
   "86508",
   "Female",
   " ",
   "23",
   "Jul 24, 2010",
   "7242",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have smoked weed quite frequently (at least once a day) for about two years but since I was entering the job force, I decided to quit. A few months after this with hardly smoking (maybe once or twice during this period), I about Spice, I thought it would be a great alternative to weed since it wouldn't turn up in drug tests. </p><p>I have smoked it a few times now, and have been really impressed about the high I get from it. I can get really relaxed or silly or insightful, but I have found that I can easily get paranoid when using it, which was never really the case when I was smoking weed except for a few times when using low quality stuff.</p><p>One time when I smoked it, I realized my heart was pumping very quickly. I thought this was just my paranoia, but when I counted it to calm myself down, it actually was around 158 bpm (normal is 60-100).</p><p>Today I had the house to myself and thought I'd use it all day (a common practice of mine with weed when I had a day off). I smoked once and about an hour later after the initial high was dying off I smoked again, then I had a weak alcoholic drink after the second high died off, then decided to smoke again almost right after the drink. Each time I smoked I would only use enough for about three good hits (which is all I needed to get a good high). Less than 30 minutes after doing this, I became extremely messed up. My heart was beating quickly again and I felt really sick. I couldn't concentrate on anything and started to get a little worried since it began as just being uncomfortable to feeling fucked up so quickly. I tried to shower to help bring myself down and calm my nerves, but I started seeing spots, was extremely dizzy and nauseous to the point where closing or opening my eyes were equally terrible, and basically felt completely out of control. My nausea was so bad I couldn't stand the shower on anymore and just tried to lie in the tub with cold water running on my feet. At this point I felt as if I was going to die right there in the shower. It was terrifying and not anywhere near the years of experience I've had with weed. After maybe 45 minutes of this I finally made my way down again, but had not really recovered from it for a few hours.</p><p>I'm not sure why I had such a reaction to it in this way. I had smoked it and drank quite a few beers before and had quite a pleasant high, but when I mixed smoking with one drink that contained about 1.5 oz of 40 proof rum, I had a terrible trip. If you use it, I suggest waiting at least a few hours between each session and not to mix it with alcohol. It probably would also be best to have someone at hand that you know will be able to talk you down from any paranoia you may experience. If it's your first time, smoke it slowly since it's easy to smoke way too much without realizing it.</p>"
}
