{
 "title": "Interesting Effects",
 "author": "Rtor",
 "citation": "   Rtor. \"Interesting Effects: experience with MDAI (ID 86704)\". Erowid.org. Sep 30, 2010. erowid.org/exp/86704",
 "substance": "MDAI",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE:",
   "125 mg",
   "oral",
   "MDAI",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "86704",
   "Male",
   " ",
   "19",
   "Sep 30, 2010",
   "Views: 17775",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Name: Rtor</p><p>Age: 19</p><p>Month/Year: August/2010</p><p>Scale precision: .001g</p><p>Dose: 125mg  tan MDAI (5,6-Methylenedioxy-2-aminoindane)</p><p>Weight: 58kg</p><p>Method: Oral/Empty stomach/325ml of water</p><p>Sex: Male</p><p>Time: T0 = 1am, where T is minutes</p><p>Observation method: As it happens</p><p>Background on subject: Slender and very little fat, NO previous MDMA/MDA use. Common caffeine intake (used \n</p><p>T0  Tasted like solvent? Very nasty taste. Nasty aftertaste, and brown spot left on tongue. Other than that, a slight sting though it was very minor and can be ignored.</p><p>T10  Im impressed at the fact that I can feel something at 10 minutes, placebo? Empty stomach? Absorption through tongue? </p><p>T20  100% sure not placebo, first confirmable alert</p><p>T30  Odd feelings and sensations, tingling skin, barely any euphoria if any, noticeable effects however mild. Greatly increased affection</p><p>T60  Ability to get an erection extremely diminished, feelings and sensation greatly increased, pleasant tingling similar to a caress of the air on the skin, a minimal amount of extra warmth, tactile sensations enhanced, Some stimulant effect that is very noticeable, On the other hand an opiate like drowsiness, both cancel out and lead to a clear and balanced feeling. Slight euphoria, 100% that it was not placebo, however it is easy to overlook. Slightly increased affection compared to t30, very high affection. Warmth is comparable to a slightly harder/colder version of the opiate warmth, not as pleasurable but still pleasurable.</p><p>T120  2 hour mark and the effects seem to have plateaued in my opinion (Im writing this now at the 2 hour mark), music is enhanced however a slight bit above normal, harder/sharper sounds are less favorable and produced very slight anxiety/no euphoria/pumped up feeling, softer/smoother sounds are very favorable (trance) and produced no anxiety/slight euphoria/introspection/smooth feeling/mild calmness/increased warmth. Affection has clearly plateaued.</p><p>T180  Overall effects increased from t120 to t180, with the exception of the slight anxiety, which is completely gone. Clearer thoughts, easier recollection, faster reflexes, sensitivity to bright lights and harsh sounds. Smoother and articulate speech along with increased affection, more talkative and interested. From t120 to t180 the warmth increased dramatically, however not the same warmth as experienced with opiates. Little if any increase in actual body temperature/little if any increase in sweating. Euphoria is equivalent to t120. Music (trance) is very smooth and welcoming. Interesting note: micro versions of the same thought loops during LSD. </p><p>Zero anxiety, on the contrary, very calm and secure feeling. Feeling very self confident but nowhere to the extent as to feel on top of the world or superior. At this point it is clear that my focus is enhanced near amphetamine like but lacking the adrenaline/rush. Slight jaw tension, nowhere near the bruxism of MDMA/MDA. Tactile sensations are significantly enhanced and particularly pleasurable. </p><p>I used a reflex measurement game on the internet to measure my reflex time: http://www.fingertime.com/bullettime.php</p><p>Reflex chart (trial # - time in seconds) </p><p>1 - .183 \t6 - .191</p><p>2 - .196 \t7 - .195</p><p>3 - .184 \t8 - .204</p><p>4 - .198 \t9 - .184</p><p>5 - .194 \t10 - .194</p><p>Simple reaction time avg = .1923 seconds while previously establish reaction time (sober) = 2.1-2.5 seconds</p><p>T210  Effects may be diminishing, but at an extremely slow rate. Perhaps the awareness of the effects has gone down? Music (trance) is more comforting and enjoying louder volumes. Sleepy yet stimulated by surroundings, this is past my usual bedtime. No incentive to go to bed.</p><p>T230  Effects are clearly diminishing, however as previously stated very slowly. Overall mood happy, calm and confident. No euphoria, no anxiety, no nausea till this point. Going to sleep/walk around/eat. The alertness and boost to interest is still there, however it blends in almost perfectly. Loss of appetite, did not eat. Walking was pleasurable, refreshing cool feeling on skin. </p><p>T250  Went to bed for 10 minutes and realized there was no chance I was going to doze off, as it was a bit difficult to keep my eyes closed. I wouldnt call it a restless insomnia, or even uncomfortable. This type of insomnia is quite different from any ever experienced, as there is absolutely no overexcitement nor restlessness or even discomfort. Lying in bed and moving around seemed to startle the effects, and the effects got a bit stronger too. </p><p>T270 - It seems that though my body is tired, the effects of MDAI are trying to give me incentive to explore my surroundings. Also being away from music for 20 minutes gave me a huge craving for music and to explore the rest of the trance album I was listening to. Something that catches my attention is how sincere and almost childlike the craving for music is. </p><p>T300  Diminishing effects, nothing new, a very persistent drug. At this point I am feeling effects equal to roughly 50% of the peak. Very sleepy, yet somehow aroused. Eyes are heavy, but at the same time they dont want to close. My body is comfortable and ready to relax but at the same time, it aspires to move and touch.</p><p>T330  going to sleep</p><p>Reflections:</p><p>From beginning to end, it was an overall good experience with very few drawbacks. Aside from the vile taste of MDAI, and the mild restlessness it has no bad effects really. No hangover, smooth comedown, and no nausea. Though the effects are overall mild, it is a very long and relaxing buzz. The effects even linger for a couple of days and provide a very healthy boost of mood.</p>"
}
