{
 "title": "Thought I Was Going to Die",
 "author": "check",
 "citation": "   check. \"Thought I Was Going to Die: experience with 4-Methylmethcathinone (ID 86741)\". Erowid.org. Aug 6, 2010. erowid.org/exp/86741",
 "substance": "4-Methylmethcathinone",
 "bodyweight": "110 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "86741",
   "Female",
   " ",
   "19",
   "Aug 6, 2010",
   "11389",
   " "
  ]
 ],
 "report": "<p>I'd had previous experience with mephedrone before this trip. I acquired one gram of it months ago, and ended up using it maybe 3 or 4 times, but still had a good bit left (each time I did it I usually snorted 3-6 small to medium sized lines).</p><p>I hadn't used it in months, and one night I was bored, and figured I would just finish it off and play video games all night.  I sat myself down in front of the TV and set up the game, then dumped a small pile on the back of my cell phone.  I made about 4 smallish lines and snorted them all pretty quickly, then started to play Grand Theft Auto.</p><p>I was enjoying flying planes across the map and smashing cars and pretending I was driving for real.  Shortly after, my friend instant messaged me. I was talking to her for a bit, I did 3 or 4 more lines, and then somehow the conversation got really intense. I started telling her all about how I'd been depressed, and how I'd originally been using mephedrone months ago (only for about a week) to help me deal with my depression.</p><p>I was getting really hyper talking to her, typing a mile a minute. I took more mephedrone. She asked me if I was on mephedrone now. For whatever reason I lied and said no, and that's when I started freaking out.</p><p>I was really afraid she could tell I was on drugs and would think I was a drug addict or something. Then after we talked for a bit longer she had to go do something, but said she would be back soon. I waited for ages for her to come back (it was about an hour). I started freaking out horribly, my heart was racing, I couldn't think. I thought I was going to die. I thought I had overdosed.  I realized that while it felt like a long time, it had really only been maybe an hour and a half or so.  I thought I had done too much, and I was really scared.</p><p>I started looking up mephedrone overdoses. My skin felt numb.  My feet kept falling asleep.  I was very lightheaded and dizzy.  I kept trying to go back to playing Grand Theft Auto but I couldn't focus on it. I kept wondering where my friend went.  I started getting horribly paranoid, I texted her a few times and then I thought 'What if she knows I'm high and this is a test?' and then I thought 'What if something happened to her?' I started thinking she might be dead.  Finally, after what seemed like forever, my friend finally came back.  Once she came back I felt so much better.  I was still freaking out a little bit but it was nothing compared to how I had felt before.  </p><p>After we talked for a little while longer (after I freaked out I had put the mephedrone away up in my room so I wouldn't do any more) I was getting tired and coming down, so I tried to go to bed.  I watched some TV for a while, and managed to fall asleep. I remember lying down on my couch just before I drifted off just thinking about how unbelievably comfortable my couch was.  This last 10 minutes or so were interesting, it was like I had finally found some kind of peace to the last few horribly intense hours.</p><p>I woke up late the next morning, and felt really really depressed all day.  I was dizzy again and having lots of the same negative side affects I had when I was freaking out.   I distracted myself all morning, and eventually felt better (only after staying inside for the entire day and finally taking a walk with a friend at 9pm).  I kept feeling so shitty for not telling my friend I was on mephedrone again; I don't know why it even mattered because I knew I wasn't using it to deal with any kind of depression this time.  But it still freaked me out a lot.</p><p>In conclusion, I would definitely take this drug lightly.  It's very easy to keep taking more and more without realizing how much you are taking, or the effects it will have on you.  Also I would not recommend taking it alone, or at least have someone to talk to the whole time.  When my friend left, I felt like I was the only person alive, and I was horribly lonely.</p><p>I don't know if I'll ever do mephedrone again.  I still have a lot left, and the times I have done it before this, it was enjoyable.  I may do it again way in the future, probably not any time soon though.</p>"
}
