{
 "title": "Should Have Gone Easier",
 "author": "SuperLamp",
 "citation": "   SuperLamp. \"Should Have Gone Easier: experience with Spice and Synthetic Cannabinoids (Spice MAX) (ID 86821)\". Erowid.org. Aug 13, 2010. erowid.org/exp/86821",
 "substance": "Spice and Synthetic Cannabinoids (Spice MAX)",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 86821",
   "Male",
   " ",
   "Age at time of experience: 26",
   "Aug 13, 2010",
   "Views: 6388",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background info:  I was a regular pot smoker (~10 times a week) for about 3 years but have spent the last year smoking only around once a month.</p><p>I hadn't smoked pot for a few months and had recently moved to a new city and still hadn't made any connections to buy any, so one night when my wife was away I decided I'd give the synthetic stuff a try.  </p><p>The smoke shop I visited only had one brand, called 'Spike,' I couldn't figure out if it was related to the Spice brand or not, and as such I have no idea if it is the same chemical used in K2 and Spice (JWH-018).  They had two grades of Spike, Silver ($22/g) and MAX ($31/g).  I bought the MAX.  I was kind of upset they were priced so highly.</p><p>For some reason I had convinced myself that it would take more than a hit or two to get high so I packed a small bowl of maybe .2-.25 grams and smoked almost the whole thing (about 4 hits, maybe 5).</p><p>The effect was immediate, within 30-45 seconds.  Initially it felt similar, but still noticeably different from cannabis.  However, I became aware fairly quickly that I had smoked too much.  The movie I had on ('The Men Who Stare at Goats') began giving me horrible vibes about 5 minutes after the smoking.  I shut it off and just stared at the TV screen for probably 30 minutes, dreading the thought of my wife's goodnight call (because I didn't think I'd be able to even answer my phone).  </p><p>I laid down on the couch and just began to focus on my breathing because I noticed it was becoming very irregular.  I could only stay focused for a few seconds before I would start to begin taking short, quick breaths.  I was convinced my heart beat was becoming irregular as well but believed I could still control it if I focused on taking deep breaths.  This is when I had my first out of body experience of my life, viewing myself from above the couch.  It is hard to describe, I was still seeing the room through my vision but I could clearly see myself on the couch next to my dog from a top down perspective as well.</p><p>After about 30 minutes of lying down my wife called and I spoke to her for only a couple minutes, telling her I was already asleep for the night.  After the call my dog came up to me asking to be taken outside for her nightly walk.  I stood (for the first time since smoking) but it made me very nauseous and I could only take baby steps, something that has never happened to me when I've smoked pot.  I knew I couldn't walk down the street without someone asking me if I needed help so I just let the dog outside in the backyard (a no-no for our landlord.)  While she was out I became more nauseous and headed for the bathroom, but I knew I couldn't get there fast enough (with my baby steps and all) and grabbed a nearby towel and vomited into it.  I got up from the floor after I was finished, let my dog in, but became nauseous again and returned to the towel for a second round.</p><p>After this, I felt noticeably better.  I knew I had it in me to shut off all the lights and check the locks so that I could go to bed, and I made it to the bed with no problems.  I felt very comfortable when I got there and enjoyed my state of mind very much.  I was still having waves of intense feelings but they were much more manageable than when I was on the couch and more enjoyable as well.  I fell asleep fairly quickly.</p><p>The next morning I could still feel it in my system, much like if I had eaten brownies the day before.  However, the word that comes to mind when I think about my experience is 'unnatural.'  Yes, the effects are similar to marijuana, but they are also very clearly unique in their own right as well.  </p><p>Overall, I believe my night would have been much more enjoyable if I just hadn't smoked as much.  If it is your first time trying one of these synthetic brands, treat it just like you would any other drug and start off slow, it certainly has the potential to be every bit as powerful as maryjane.</p>"
}
