{
 "title": "Relaxing Free Association",
 "author": "Sigea",
 "citation": "   Sigea. \"Relaxing Free Association: experience with Alprazolam & Cannabis (ID 8697)\". Erowid.org. May 12, 2004. erowid.org/exp/8697",
 "substance": "Alprazolam & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   " ",
   "30 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8697",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 12, 2004",
   "Views: 31030",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n9:30\r\nI take 3 .5mg generic Alprazolam tablets to combat the high dose panic I usually get with cannabis.  I have not eaten in 6 hours to clear my stomach for maximum effect.\r\n10:00\r\nThe Xanax is slowly overtaking my body with a gentle softness.  I feel very relaxed, but this is not at all like alcohol.  My friend D recently bought a four hose hookah that we planned to use tonight.  We also have a large amount of cannabis, 1/4 o of powerful stuff.  We pack a huge bowl, and begin smoking.  And smoking.  And smoking.  The only reason we stopped is because we became too uncoordinated to light the bowl.\r\n10:30\r\nThe smoking session ends and I feel like I'm starting to nod off, my body is VERY loose (which is good, because earlier today I had a terrible back ache) and my mind is exploding with free association.  I start to see the deeper meaning in less signifigant things.  It reminded me of a part from the book Siddhartha, in which the main character is being told by his friend how the river knows all, how it can teach him infinate wisdom.  \r\nI am now too stoned to understand (or even care about) the menial banter that spews from my tv and decide to engage in the only thing that seems real now: music.  I normally prefer indie and classic rock, but during my chemical excursions, trance is the only way to go.  I layed in bed, but my physical surroundings now meant nothing.  My vision meant nothing, all stimulation was audible and I was playing a very strange movie in my head.  Very beautiful and relaxing.\r\nThe rest of the night was just lying in bed relaxing, until I woke up.  I feel a little groggy and mentally impaired, but nothing that doesn't go away in a day or two.\r\nXanax and cannabis are, in my opinion, inseperable.  Especially for someone who is prone to anxiety, it really keeps you on a good vibe.\n\n\n"
}
