{
 "title": "Those About To Die By Edibles: We Salute You",
 "author": "MissGoodle8s",
 "citation": "   MissGoodle8s. \"Those About To Die By Edibles: We Salute You: experience with Cannabis (ID 86985)\". Erowid.org. Oct 27, 2011. erowid.org/exp/86985",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cannabis",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 86985",
   "Female",
   " ",
   "Age at time of experience: 30",
   "Added: Oct 27, 2011",
   "Views: 5001",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nLast night a pal of mine and I decided to partake in some brownies and for the 3rd time I witnessed someone get their ass handed to them.</p><p>I had a bad trip about three years ago that left me pacing my hallway in a panic for 3 hrs trying to avoid any rays of sunlight on the floor. So since then Ive practiced extreme moderation with brownies and cautioned everyone else to do the same. But most people insist that because I have a low threshold for weed and liquor, I simply have no idea what harsh really is. Or to quote something a friend said once, I dont think you understand the point of weed.</p><p>Well, last night I discovered why those sentiments are often the precursor to that person holding their head between their knees and asking me if theyre going to die for four hours straight. Often times theres a prolonged gestation period when one starts out feeling absolutely nothing or only a very light sense of awesome. The problem is that at that point hubris kicks in and they either get disappointed (which may lead to a negative mindset), or god forbid demand to eat more. And then in about an hour or two the other shoe drops. Mary Janes shoe. And she drops that shoe on that ass for the rest of the night.</p><p>The feeling is similar to a moderate panic attack for people who dont know what severe panic attacks feel like. For a long time I thought my three hour hallway track meet was awful until a very pot savvy friend got so convinced he was going to die he threw all his pr0n away so his family wouldnt find it posthumously. Then on another occasion a girlfriend of mine ate waaaaaay too much. After being certain she was 'going into the light' for three hours she started speaking in the most annoying accent and couldnt shake it. It was like a horrible combination of German and babytalk. That was probably MY worst experience of all time because my high died instantly.</p><p>My tip for talking people down from bad brownie incidents is to tell them the feeling IS eventually going to end. That seems to be the most common concern. And don't let them get obsessed with things like the time and how long they've been feeling panicked.</p><p>However, other helpful tips for people in that condish include:</p><p> No one in the history of weed has ever died of weed and you arent going to claim first.*</p><p> No, youre not going to forget to breathe.*</p><p> Yes, you exist.*</p><p> I can see why you might think that but no, you should not call your [out-of-town sleeping family member] at this time.*</p><p> And in answer to the query am I just acting out what I think its like to be high because Ive started to slip back to reality or away from what I was suppose to follow:  Nope.*</p><p>*particularly in my fucking house.</p>"
}
