{
 "title": "Everything Bagel's Astonishing Power (Effect on UA)",
 "author": "Samanthe",
 "citation": " Samanthe. \"Everything Bagel's Astonishing Power (Effect on UA): experience with Poppies - Opium (seeds) (ID 87132)\". Erowid.org. Aug 31, 2010. erowid.org/exp/87132",
 "substance": "Poppies - Opium (seeds)",
 "bodyweight": "120 lb",
 "header": [],
 "footer": [
  [
   "2006",
   "87132",
   "Female",
   "",
   "36",
   "Aug 31, 2010",
   "8412",
   " "
  ]
 ],
 "report": "</p>\nOnce upon a time, I was a subject in a IRB-approved research project that required that I pee in a cup and breathe into a breathalyzer each morning that I showed up for guinea pig duty. Ostensibly, the test was of the NIDA-5 type, to make sure I wasn't secretly messing up the data with unauthorized drug ingestion. This is understandable, considering that sometimes people do naughty things they don't want to divulge, particularly if doing so jeopardizes their chance at earning some cash for being a test subject.</p><p>To be clear, I was not being a test subject for the money -- that would be kinda sad (In my opinion, it's so not worth the modest stipend they were offering if that's the only motivation for participating). I *was* interested in seeing what taking a scheduled substance in a research setting would be like.</p><p>On one of the test mornings, I peed in the cup as usual, and then sat down, relaxed while the nurse hooked me up to a heart monitor and took my temperature, and waited for the drug-administration (or placebo-administration) part of the day to begin. This morning, though, things proceeded irregularly. The head researcher came in -- which he never did at this time of day -- looking a little embarrassed. He informed me that I had tested positive for opiates. 'Did you take something this morning?', he asked, tentatively. I don't remember the exact wording he used, but it was vague.</p><p>Shocked, my jaw dropped and my heart raced when he revealed this. I had been a scrupulously conscientious research subject, and knew some of the research team personally. I don't even *like* opiates except if I'm lying perfectly still after a surgical procedure, when I can appreciate the analgesia while still avoiding nausea. Feeling like my honor was in question -- never a good feeling for me, as someone who is obsessed with doing things 'right' -- my mind grasped for what might be going on. </p><p>Then I remembered, I had eaten an everything bagel that morning, and had barely had a thing to drink (actually, I subsequently developed a urinary tract infection during the course of the study, so apparently I wasn't drinking enough water in general at the time). I probably hadn't even peed first at home before rushing to the early-morning appointment at the hospital. Was it possible? Had the test been so sensitive that a couple of poppy seeds tested positive? This wasn't a poppy-seed bagel... it was an *everything* bagel for heaven's sake.</p><p>When I described my breakfast to the doctor, he looked relieved. I was still upset, though. Not just because of the tiny remaining shadow on my credibility, but, because my racing heart rate was skewing the data for the day. :( It was hard to calm down, but eventually I did, and everything else proceeded smoothly.</p><p>Note to self -- don't just avoid poppy seed bagels, avoid any amount of poppy seeds, period, before a UA.</p>"
}
