{
 "title": "Communion with Spirits",
 "author": "Hemlock",
 "citation": "   Hemlock. \"Communion with Spirits: experience with Ayahuasca (ID 87165)\". Erowid.org. Nov 21, 2011. erowid.org/exp/87165",
 "substance": "Ayahuasca",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1.25 oz",
   "oral",
   "Ayahuasca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 87165",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Nov 21, 2011",
   "Views: 3658",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Ive participated in about 25 Ayahuasca ceremonies over the years and have found it to be the most profound and productive plant which Ive encountered. I only use it in a ceremonial setting as that augments the experience tremendously.</p><p>The following is a description of one of my journeys from a couple of years ago.</p><p>We meet in a large room which can be darkened almost to pitch black. This adds to the internalization of the journey and helps to make the experience as individual as possible. After I  set up my chair, percussion things, water, tissue, and bucket, I spend time outside greeting friends and getting to know the first-timers. I always enjoy it when we have a good number of first-timers!</p><p>After were called in, the shaman explains the ceremony and effects of the plant and some of the newbies ask questions. Then, were ready to go. We get smudged and sit quietly while the shaman sings and prays, awakening the spirit of the plant. One by one, we approach and drink. I have become much more sensitive to the plant over the years and usually only drink a small amount but I wanted to do some hard work this time so I drank an entire cup- maybe 1- 1.5 fluid oz.</p><p>The taste of the brew is difficult for me and I have to work a bit to keep it down immediately. After everyone has drunk, we sit in darkness and quiet until the shaman offers another prayer and then begins his songs or Icaros.</p><p>About 45 minutes into the ceremony, I begin to get the familiar geometric visuals and buzzing in my head which signal onset. Very quickly, I begin to experience the presence of spirits. The first spirits i see are shamans dressed as large birds. They are dressed in white robes with decorations and are standing in a line which extends as far as I can see, one behind the other. The message I get from this is that the ceremony is the result of ages and ages of people using this brew to gain esoteric knowledge and that the knowledge is real. After all, people have been studying ayahuasca far longer than theyve been studying science.</p><p>Fairly quickly, the line of shamans fades and I see the shaman building the foundation for our journey. He builds a space for us to be safe and begins to ask for assistance from various plant and animal spirits. Ayahuasca, flowers, trees, jungle cats, hummingbirds, etc. are invoked. As this progresses, I experience myself in a large cave with people dancing in a ritual manner. Very powerful.</p><p>The shaman continues with his songs, invoking and evoking different experiences. After about 1.5 hours, I purge and then relax a bit into the rest of the journey. So far, so good.</p><p>At one point in the journey, I begin to meet strange entities. Some of these entities may give gifts, some seem to just be there to visit, and some do work on me. One entity was a large being with a metallic face which had several different planes. His body was covered with a sort of cloak and after he stood and looked into me for a while, he opened the cloak and another face with a long probing nose began to work on my heart chakra. Another being, similar to a large mosquito type insect, came and sat on my chest, removed the top of my head and worked on my brain.</p><p>One of the things which makes the ayahuasca journey so different from other psychedelic experiences is the degree to which it is shared. After this particular journey, a man across the room asked me if I was visited by a large insect like being which worked on me. Keep in mind that our ceremony is conducted in almost complete darkness. My daughter, who was also at this ceremony, was also visited by the man with the metallic face.</p><p>After the visits from the beings, I begin to slowly come down. The shaman asks several of us to play our instruments or sing if we feel called by the spirit of the plant to do so. I am able to join in the drumming and later to play the guitar, as well. While playing the guitar, I was able to experience how my playing affected others in their journeys and to be able to help them with their work. This is the first time that Ive had a taste of what the shaman must be experiencing most of the time. Several people purge while I play which brings a great sense of accomplishment to me.</p><p>After about 5 hours, I am down enough to stand and walk over to eat a light meal. This is always one of the more wonderful things about our ceremonies. The taste of the foods is indescribable and the incredible lightness which everyone has is very conducive to great fellowship. Another 2 hours or so of eating and talking with fellow travelers and I am on my way home.</p><p>Fo me, ayahuasca is not recreational in the sense of being fun and relaxing. It is hard work and very demanding but the exploration, insights, and cleansing make it very worth the effort. It certainly is not a journey for everyone but I am profoundly thankful that the plant called me.</p>"
}
