{
 "title": "Dancing with the Jade Lady",
 "author": "Dreamer042",
 "citation": "   Dreamer042. \"Dancing with the Jade Lady: experience with JWH-018 & Various (Herbs) (ID 87264)\". Erowid.org. Feb 8, 2011. erowid.org/exp/87264",
 "substance": "JWH-018 & Various (Herbs)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 mg",
   "smoked",
   "JWH-018",
   "(powder / crystals)",
   "  T+ 0:00",
   "2 joints/cigs",
   "smoked",
   "Various",
   "(plant material)",
   "  T+ 0:05",
   "1 cup",
   "oral",
   "Various",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 87264",
   "Male",
   " ",
   "Age at time of experience: 26",
   "Feb 8, 2011",
   "Views: 6659",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am a reasonably healthy happy 26 year old male, roughly 135lbs, thoroughly experienced with the classical hallucinogens, and worked through a decent portion of TIHKAL and PIHKAL. I haven't ingested cannabis in over a month and haven't had anything stronger than tea for a week. </p><p>I rolled up a small pinter joint of my 'jade bliss' blend consisting of 1 gram mixed lavender, chamomile, oat-straw, lemongrass and perhaps a few other benign/relaxing tea herbs infused with 10 mg of JWH-018. My apologies, I failed to weigh the exact amount of herb used but I would approximate the amount to weigh between 100-300mg being ~1-3mg 'jade' (JWH-018).</p><p>I stepped outside and lit up, the first thing I notice is the smoke is not as harsh as I was expecting and the taste was quite pleasant, good blend of herbs. I took a good rip held it for a second or so and let it out, then another... On the third rip I began to notice effects just slightly starting to kick in. By the fifth rip it was definitely starting to take effect so I put the half smoked joint out and closed my eyes to focus on what was happening, I was 'high' no question about that, my heart rate had increased quite a bit as well. Overall it felt clear headed and kind of on par with the effects a fine sativa strain or good hashish. Only... I could tell there was something that wasn't 'natural' about it and sense an almost sinister chemical feeling similar to the one I experience on methylone and mephadrone behind the enjoyable effects. I took note that the 'high' seemed to synergize nicely with the relaxing effects of the herbs.</p><p>t+01 min = I decide to open my eyes and enjoy the summer afternoon I notice that everything seems a bit brighter and more vibrant in that special way it does on cannabis. I spend the next 5 or so minutes wandering around the backyard with equally wandering thoughts, notice what might be a hint of a slight headache.</p><p>t+6 min = I decide to go inside and start a cup of herbal tea, I dislike the idea of leaving the big colorful outside world to go back into the confines of the house but I remind myself I want tea and I feel like it will help balance out the effects. As the water boils I type up this experience report which brings me to the present about t+30 give or take.</p><p>t+30 = I am definitely still 'high' it has been fairly the same level since it started I notice mild pains appearing in various parts of my body seemingly at random, my heart rate is still elevated and I feel like my breathing has been a bit constricted, though this is likely just from smoking. The head effects seem to have turned quite a bit more cloudy and the wandering thoughts quality has persisted so far. Now if you'll excuse me my tea beckons.</p><p>t+45 the tea is made up of oat-straw, lemon balm, lavender, and chamomile almost if not exactly the same blend as the smoking blend. The effects of the jade seem to totally overpower any effects the tea may have but I've just started drinking it, I'm going to enjoy some television and report back in a bit.</p><p>t+1:05 still 'high' but the effects have been slowly diminishing, the tea is doing its job and that may be contributing to the calming and comedown effect. I tend to get a sticky feeling behind my eyes on cannabis, I have been noticing a similar effect for the past 15 minutes, my heart rate is starting to slow down, still a bit faster than normal but its coming down as the effects are.</p><p>t+1:50 effects are still lingering very vaguely almost completely back to baseline still a bit of a feeling behind my eyes thinking is basically back to normal if a bit slowed down. Heart rate completely back to normal, lungs feeling a bit raw and starting to feel sleepy, been noticing a bit of jaw tension.</p><p>t+2:10 feeling pretty much completely back to baseline, a little tired and wore down, maybe the slightest hint of an effect still lingering but comfortable with calling myself sober.</p><p>All in all the effects are amazingly close to cannabis but there are subtle differences.</p><p>pros: </p><p>A bit more clear headed/less stupifying in effects than cannabis.</p><p>Comedown is much more gentle and seems to have less of a drag.</p><p>Seems to be shorter acting and doesn't effect the appetite as much.</p><p>Doesn't make me perpetually want more/not as addictive.</p><p>cons: </p><p>Feels somewhat toxic on the system.</p><p>Lingering headache feeling.</p><p>Seems unnatural in its effects and has a somewhat sinister character.</p><p>This is indeed an interesting chemical, it's very effective as a cannabis substitute. I enjoyed the fact that it seemed to have less of the negative side effects I find in cannabis (being 'stoned stupid', 'the munchies', taking much longer to get back to baseline and being kinda zombified for the rest of the day). I'm interested to see if it will effect my dreaming at all, cannabis is notorious for making me forget my dreams. I will update in the morning as to how the 'hangover' is and whether it interferes with my dreaming in any way.</p><p>t+ next morning: I had a bit of trouble getting to sleep but less so than I experience with cannabis. It did not inhibit my dreams in any way if anything it enhanced them, but I don't think it did that either. I slept restlessly and woke up several times throughout the night, there does seem to be a slight lingering hang over this morning but overall I'd say it interferes with the sleeping process less than cannabis and does not interfere with the dreaming process much if at all.</p>"
}
