{
 "title": "Warm Energy Behind Me",
 "author": "Eric",
 "citation": "   Eric. \"Warm Energy Behind Me: experience with Tabernanthe iboga (root powder) (ID 8729)\". Erowid.org. Aug 11, 2001. erowid.org/exp/8729",
 "substance": "Tabernanthe iboga (root powder)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Tabernanthe iboga",
   "(roots)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 8729",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 11, 2001",
   "Views: 19337",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nLast night I had, and still have, a encounter with Iboga root bark powder. The amount about a spoon full, lets say 2gram. </p><p>It took some time before effects entered:</p><p>it started with a kind of blanket-effect. A blanked can cover you, like lsd covers you. It came definitely from the top left. It took several times(1hrs) before I was really covered.\rA kind of mystic appeared and I remember the strange awareness of wearing a kind of energy thing on my back and head. \rOpposite of associative drugs, where my size is reduced (sucked away) to a pin point, Iboga increased my size.\rA strange repeating sound became hear-able in the back/bott of my head. The same sound you get to hear sometimes while conscious dreaming, or when you wake up at night.\rAlso my vision was a little strange, as if I needed glasses. And everytime I opened my eyes after blinking them, it was like everything was put back on its place. I just saw the last fragment of motion. It was filled in total, as if somebody puts a giant, view filling, poster in front of you every time you open your eyes. Everytime the view can back from left top to bottom right. The same direction the blanket covered me.</p><p>I remember that reading was allmost impossible. We were trying to order a pizza, but it was very hard to find the number in the phonebook. Closed eyes gave me an extra dimension. \rI felt very easy and relaxed, had some hunger, was hard to concentrate especially when talking. Just forgot what I wanted to say. Maybe this was also due to the Olumpic Marihuana Fire. \rMy legs were waving, fibrating. As if they had no mass. It was also as if those gummy legs were some higher than my real legs. Strong sensation of motion. I was rotating (clock wise), faster and faster, felt my stomach protest. Geometric things came circling by, colors and sounds. Later lightning flashes (cracks in the black) appeared with open eyes.\rOutdoors was also very nice, more mystic. Had very very nice dreams, I think I woke up after each dream, fully rememdering the beauty of it. Pitty I did not write them down.</p><p>\n\nWoke up pretty early, feeling good and still buzzed, having the feeling I am not alone at this moment. Can feel warm energy on/behind me.</p>"
}
