{
 "title": "The Worst Trip Yet",
 "author": "Stevie",
 "citation": "   Stevie. \"The Worst Trip Yet: experience with Mushrooms (ID 87302)\". Erowid.org. Sep 21, 2010. erowid.org/exp/87302",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 87302",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 21, 2010",
   "Views: 2065",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was most definitely was one of the most unpleasant nights of my life. It was the 2nd time Id ever taken shrooms. I didnt know what I was expecting though, since the first time, I didnt have enough to trip. At about 8:30pm I and a friend divided our 5 gram bag. Between the two of us. I had a little more, because I took the scraps in the bag too. They kicked in really fast, I got a body high within about 10 minutes, and I remember being really hyper and excited for no reason, and consistently sitting then standing up at random. My friend was annoyed at me, as she still wasnt high. At this point everything was good, we were just laughing a lot.<br>Then at about 9:30 I started feeling sick, and felt like vomiting. Though this didnt really surprise me, as the first two times I did e, I vomited as well.  By about 10 oclock I had to lie down on her bed, and not move. At this point our highs were both gone and I just felt like shit.  So, I did the stupidest thing I think Ive ever done in my life. I called my mom to come get me and take me home. <br>BIG MISTAKE.<br>About 25 mins after I got home, things started moving. I was all alone in my room in the dark. I flipped out for a minute, because I didnt know what was going on. Then I realized it must be the shrooms. I called my friend and she was tripping out too. This was where we realized this was going to be a really fucked up night. At first I tried just to go to sleep, and ignore the things moving around me. At this point I had no body high, and nor would I for the rest of the night.  I couldnt fall asleep, the colors swirling under my eye sockets where too distracting, and made me feel even worse. The frilly edge of my curtain had light coming from outside, and was moving like a wave. That had to be the most annoying thing in the world. I have an abbey road poster at the end of my bed, and I swore to god Paul looked at me. At this point I have the urge to go to the bathroom. The shower curtain I have is a tree, so it looked like the branches were moving in wind or something. The room seemed to be shrinking on me too. I got out of there ASAP. When I came into my bedroom the bit of light coming under the curtain seemed to illuminate the whole room.  I looked at my bed, and it looked like there was a person lying on the bed, I paused for a sec, and decided to jump on them. It was my blanket. I did that 3 times over the course of the night. <br>I decided to call my friend again. Time seemed to have stopped, I figured it was about midnight, But when I picked up my phone It was 2am. When I talked to her she was still high, but perfectly fine. Shed done shrooms alone before, a few times. She calmed me down a bit more; knowing I wasnt the only person in the world. I was able to fight the high a bit more after that. I remember having a conversation in my head, which I thought lasted forever. I came up with the name Lisa, for the person I was having the conversation with. I called my friend to share my news (which when I was sober I couldnt remember for the life of me) it was only 2:11. I lay on my bed, and stared at the ceiling for a while, and then I decided I need water, so I went to the kitchen. When I saw the clock in there it said 3am. That was surprising. I drank some water, and decided I wanted to pet my dog. So I sat on my kitchen floor for what turned into about 45 minutes petting my dog. Then when back to my room and finally fell asleep at about 4am. My friend was up until 6. I was sick the whole time, and that made it so much worse. But I woke up at about 11 the next morning feeling great. <br>For a week or so after doing them, I said Id never ever ever do them again. But Ive got a feeling Ill change my mind now.\n\n\n"
}
