{
 "title": "Of Spice and the Sedation Thereof",
 "author": "ihavebecome",
 "citation": "   ihavebecome. \"Of Spice and the Sedation Thereof: experience with Cannabis & Spice and Synthetic Cannabinoids (ID 87374)\". Erowid.org. Nov 9, 2010. erowid.org/exp/87374",
 "substance": "Cannabis & Spice and Synthetic Cannabinoids",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "  T+ 0:30",
   "1 glass",
   "oral",
   "Alcohol",
   "  T+ 7:00",
   "  repeated",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2010",
   "87374",
   "Male",
   " ",
   "19",
   "Nov 9, 2010",
   "5096",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'll begin this recounting by stating that I smoke 'spice', or various other brand name (i.e. K2) or nameless herbal incense blends, on a regular basis. I also smoke cannabis on a regular basis; I usually buy spice when I can't afford high-grade cannabis due to the extremely cheap price of the herbal blends in my area.</p><p>T 11:30PM - I am extremely stoned off of several bowls of some great weed. I purchased a new piece earlier in the day. I'm smoking out of it as much as possible to make its color change more quickly. More bowls are to be packed, as my friends are eager to smoke more.</p><p>T 12:00AM - I am slightly intoxicated off of a malt liquor beverage and even more stoned than before, as more bowls have been packed. I decide to call it a night and depart from my friend's house and make my way back home, which is just next door. </p><p>T 12:30AM - I am laying in bed, feeling a wonderful mix of drunken stupor and stoned euphoria. I fall fast asleep.</p><p>T 6:30AM - I receive a text from a close friend telling me to wake up because he is on his way to my house to smoke a bowl of spice with me. I still feel the effects from before I fell asleep earlier.</p><p>T 6:45AM - My friend arrives. We sit in his truck and smoke three bowls of spice quickly and consecutively. I am expecting to get as high as I usually get, but soon after we finish the bag I start to feel unlike I ever have. </p><p>T 6:50AM - My vision is skewed and everything looks crooked and significantly more blurry and fuzzy than I've ever experienced. I start to laugh hysterically and uncontrollably. Nothing around me seems as real as it did moments ago, but I am still able to grasp reality as I keep repeating aloud, 'I'm so stoned!' or other variant phrases. It feels like I keep getting more and more high, and I don't want to. I am confused as I've smoked considerably more spice than this at one time and felt nothing like this.</p><p>T 7:00AM - My friend and I chat; he points out how obvious it is that I'm high. I say, 'How are you not as stoned as I am?!' hysterically, and he says that he is. I look at the clock and exit the vehicle at my friend's request because he has to go to school. My thoughts are going all over the place and my stream of consciousness doesn't seem to make sense. I feel like my body and mind are not connected. I make my way back into my house, finding it difficult to walk. My heart feels like it is beating out of my chest. I think to myself over and over again 'I need to quit smoking.' I stumble my way into my room and lay in my bed. My eyes feel like they are vibrating violently, as I can't focus on anything with them, and my body feels like it won't stop shaking or twitching. Nothing feels real.</p><p>T 7:15AM - I get out of my bed to get a glass of water, hoping that will somehow calm me down. It doesn't, and so I sit up and zone out for what feels like an hour or more. I look at the clock and only a few minutes have passed. I feel aware of my body and can control my movements fine, but I feel very unaware of my thoughts, or rather lacking control of them. I think about what death feels like, and if this was it. My vision is stroboscopic. Life feels like it's in stop-motion.</p><p>I passed out at some time, probably around 7:40AM. I woke up a few hours later and felt fine. Overall, the experience lasted for less than an hour but it felt like it lasted several hours. I'm not sure if the intensity of the experience has anything to do with how high I was before I smoked the spice or if it's because I wake-and-baked with it or anything, but it was a terrifying trip. I asked myself and my friend if it was salvia that we smoked, as the trip was similar to that of a salvia divinorum high. It was not salvia; it was the same spice that I've been buying and smoking regularly. I don't know why I had such an experience, but henceforth I'll look at JWH-018 with much more caution. Don't overdo it.</p>"
}
