{
 "title": "Going Up Not Down on Caffeine",
 "author": "Euphoric Chic",
 "citation": "   Euphoric Chic. \"Going Up Not Down on Caffeine: experience with Caffeine & DXM (ID 874)\". Erowid.org. Sep 8, 2000. erowid.org/exp/874",
 "substance": "Caffeine & DXM",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "180 mg",
   "oral",
   "DXM",
   "(liquid)",
   " ",
   "4 tablets",
   "oral",
   "Caffeine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 874",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 8, 2000",
   "Views: 29323",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nMy night started out by drinking half of a 4oz bottle of generic Tussin (180mg).  I don't remember specifics about that night, since I have so many dexing nights to remember.  I know I had no problems with the DXM that night so as those affects wore off I drank the other half of the bottle.  I didn't go to sleep that night and was pretty wired.  My cousin and I made a tent in my living room by putting 4 chairs in a square with the backs facing each other.  Then we draped a ton of blankets over the top so we couldn't see out.  From there we turned on some really enjoyable music: Lamb.  The music just fit the mood.  </p><p>At about 9:00 in the morning we were getting pretty hungry so we decided to go to Perkins.  The lack of sleep made us very hyper and we felt the need to move around and talk after we were done eating.  We then went to a grocery store and bought a bottle of NoDoz, thinking that we would become even more hyper than we already were.  We each took 4 pills when we got back home.  We never really got more hyper than we were at that moment, however, we did decide to rearrange my living room.  Doing that made us very tired and hot.  I started to feel very faint and nauseous.  I was also shaking.  After my cousin went home I took a shower and then tried to go to sleep.  That didn't happen, as I felt the need to puke for about 2 hours.  I kept going to the bathroom and standing over my toilet awaiting the pukingness, but it never came.  I even drank a lot of water to help make me puke, but that didn't help either.  </p><p>I think I did fall asleep for about an hour before I decided to watch some T.V. to make me even more tired.  I went to bed very early that night, at about 8:30 or so.  I'm not sure if the caffeine made me sick, or if it was the fact that I had dexed and not gone to sleep that night.  But then again, I did take one NoDoz one other time after that when I was really tired and also felt nauseous the rest of the day.</p>"
}
