{
 "title": "My New Eyes",
 "author": "Fruscianteisgod",
 "citation": "   Fruscianteisgod. \"My New Eyes: experience with Morning Glory Seeds (ID 8741)\". Erowid.org. Apr 27, 2002. erowid.org/exp/8741",
 "substance": "Morning Glory Seeds",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "125 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8741",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 27, 2002",
   "Views: 17331",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI ordered a pack of Morning Glory seeds from Ebay. Me and a long time friend tried them the week I got them in. We waited until Friday, and spent most of the evening searching our small town for a pepper grinder, without success. We finally gave up and chewed them. We each ate seventy five. Since it was our first journey into the world of hallucinogenic drugs, we didn't want to take too much.</p><p>It had no effect, so we stole some weed from his parent's bedroom. I only had one hit, and things were already getting fucked up. It wasn't my typical marijuana high, but something completely different. At times, I felt as if I were racing at high speeds through a tunnel, but at the same time remaining completely still. It seemed that I was in the correct state of mind, and everything else had gone mad. The people on the television were appalling. Fake in every way. Doing everything possible to 'fit in' and be accepted by society. It was disgusting, so I put on 'Dark Side of the Moon'. I felt every note played, every word spoken. Some very relaxing and soothing, others downright disturbing.</p><p>Somehow it got turned off.. I guess my friend did it. The more I looked around, and watched t.v., the more hatered and disappointment I felt towards the human race. Such magnificence, such potential, yet almost unwilling to use it. It was hell in a sense, to see the human race in such a raw, unpolished form. Monkey-like, just another animal.; I also remember something floating in my glass of tea. A very small crumb of food. As I looked closer, It ballooned into various large objects. A hot air balloon at first, then it appeard to be a planet floating in space, then a universe. Thus, my theory of infinity was born. There was indeed a universe inside that tiny crumb. And even smaller crumbs inside that tiny universe, and so on, forever. Earth is just another crumb. And we are smaller crumbs. This probably sounds like a bunch of jibberish to everyone else, but makes perfect sense to me now.</p><p>The second time I ate more. About 150-200 seeds. It was around midnight when I ate them. On and empty stomach, I might add. After two hours or so, I still felt no effects, and assumed that it wasn't going to work. It was then 2 o'clock, so I attempted to get some sleep. No sooner than my head hit the pillow, I began to break out in cold sweats. I was getting very tired, so I tried to ignore it and go to sleep. But, it wouldn't be that easy.</p><p>Just as I was falling asleep, I was jerked awake again by what felt like muscle spasms in my head. 'Shit', I thought. 'I'm going to die.' I must have blacked out or something, because the next thing I know, it's 5:30 a.m. and I feel fine. I walked outside and everything changed. It was the most beautiful place I had ever seen - my front yard. The grace of the birds, the determination of the ants marcing on the concrete beside my feet. The brilliant green color of the grass and trees. Trees which stood tall and proud. Any other time, I'd curse the birds for their annoying noise, stomp the ants if they got anywhere near my feet. I smoked my cigarette, and went back inside.  I thought about the girl at Wendy's, who had been trying to convince me to 'biggie size' my order (long story not appropriate for here) and fell in love with her right then and there. She's all I could think about until I gave in to sleep at about 10 or 11 a.m. I fell in love with everything. It was almost too beautiful to bear.</p><p>I've been to hell. I've been to heaven. Or so it feels....I've had both good and bad experiences with it. And came out with good and bad feelings toward everything. I am nothing, yet I am infinite. As is everything. So small in the vastness of infinity, yet vital to the everything. For without me, without you, without that tiny crumb of food, there would be no infinity.  These are my new eyes. I've explained things to the best of my ability, which is not an easy thing to do. Even I don't fully understand the experiences, but I can say that it has definitely changed my outlook on life. But I don't know if it's for the better, or for worse.</p>"
}
