{
 "title": "One Central Point",
 "author": "countryboy",
 "citation": "   countryboy. \"One Central Point: experience with Salvia divinorium (ID 8747)\". Erowid.org. May 12, 2004. erowid.org/exp/8747",
 "substance": "Salvia divinorium",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "7 hits",
   "smoked",
   "Salvia divinorum",
   "(leaves)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 8747",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 12, 2004",
   "Views: 5122",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friends and I had been doing some studying of salvia on the net, trying to find out as much information as possible about the drug before we tried it.  One of my friends found a good source on the net and decided to buy an ounce of leaves for all of us to try.  One sunday night we all decided to try it. We were told that 2 good bong hits should be enough for most people, that smoking salvia was self-limiting because you lost the ability to keep smoking. I bought a micro-torch because I heard that is the best way to smoke it, something about the high heat and vaporizing the leaves before the salvinorium breaks down. </p><p>I prepared my mind all day for it simply by calming myself and filling my mind with good thoughts. Then that evening came the moment of truth. I sat back and started taking big bong hits, holding the smoke in for as long as I could over twenty seconds. Being a heavy smoker at the time, I could hold it in fairly easily. After the seventh hit, I realized I was done and tried to stand up, but couldnt. After about ten minutes sitting on the floor almost catatonic, I went back to my dorm room and listened to music. At the time I had never done any other psychedelics so I was not ready for the intense visual images but I was calm for the whole experience. I remember seeing all of space and time collapsing on one central point directly in front of my eyes. In that point everything was completely clear, all of life made sense, but if I tried to move my eyes around away from the point it all went fuzzy. </p><p>Thats the only real memory I have of the trip, but my roommate said I stood and did some body movements closely akin to tai-chi, I have no recollection of this. All in all I would say that salvia is a wonderful experience if you are really in tune with your mind and prepared for it, not just looking to see blue bunnies or melting shit as with an acid. Without mental preparation salvia is worthless.</p>"
}
