{
 "title": "Effects On A College Student",
 "author": "Rollings a Necessity",
 "citation": "Citation:   Rollings a Necessity. \"Effects On A College Student: experience with MDMA (ID 87521)\". Erowid.org. Aug 29, 2011. erowid.org/exp/87521",
 "substance": "MDMA",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 87521",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Aug 29, 2011",
   "Views: 3301",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDrug background:\r\nIve never smoked anything, Ive done shrooms several times, Ive eaten weed brownies, and Ive done MDMA approximately 6 times. Ive never received a bad batch of MDMA. Ive only used powder and capsules. \r\nThe first time that I tried MDMA, there was a free concert in a park while I was coming up, where we then drove in the car listening to Bassnectar and other electronic music on our way to the beach. It was absolutely incredible. Euphoria, utter satisfaction, and endorphins/dopamine flying around everywhere. Ive never had a depressed day after usage, only a bit of time in the morning where I think Im freaking exhausted and dont want to wake up yet. (More than likely due to excessive alcohol consumption the night prior)\r\nIve never had any negative side effects related to memory loss, nausea, or anything of the sort.\r\nMDMA is what made me completely appreciate dubstep and other electronic music. During Camp Bisco, we did it two days in a row, and it was significantly less effective on the second day, and nowhere near as enjoyable.\r\nI would recommend not using MDMA more frequently than once per month or 6-8 weeks, as it will lose its uniqueness and it becomes predictable, which ruins all the fun! I think that MDMA, used in moderation and in positive environments is an absolutely incredible experience that should be experienced at least once by everyone.\r\n[Reported Dose: '100mg - 150 mg']\n\n\n"
}