{
 "title": "Felt Disinterested after the Comedown",
 "author": "J",
 "citation": "   J. \"Felt Disinterested after the Comedown: experience with Methamphetamine (ID 8764)\". Erowid.org. May 13, 2004. erowid.org/exp/8764",
 "substance": "Methamphetamine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6 hits",
   "smoked",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8764",
   "Not Specified",
   " ",
   "Not Given",
   "May 13, 2004",
   "Views: 18764",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday I tried crystal meth for the first time.  I had been wanting to try a stimulant for a couple months.  A guy I work with was a tweaker and said I could try it out with him.  I gave him a ride to a relative's house so he coule pick it up, then we went to his apartment, and a girl we know from work joined us.</p><p>We were at his place for a couple hours, taking several hits each.  After my first big hit I felt an intense head rush, this faded away several minutes later, and what I felt then was that my head was very clear.  I could think very well and pretty fast, and we started talking a lot.  Then we stopped smoking so we could go to work at the movie theater we worked at.  </p><p>For the first time I was happy to work.  I was moving around everywhere getting so much done and I was happy to do it.  My back and feet usually hurt at work but I felt fine that night.  I wanted to talk to everyone I saw, little kids, old people, customers and other employees.  I had to watch myself a little to make sure I didnt talk to much.  I also was cautious to act normal around the managers, but I was never paranoid.  I also was constantly drinking water because my mouth was always dry.</p><p>We got out around 1 a.m. and went back to his place to smoke more.  We still hadn't come down and we were feeling great.  This time another guy from work joined us.  We smoked some more and kept talking and talking.  It was great.  I was so interested in all the conversations.  I wanted to talk about everything.  </p><p>What I hated was that I knew I had to be home before my parents woke up, and they wake up early.  But I was having so much fun talking that I didn't want to leave.  Finally I left and got home at 5:30 a.m.  I was still very spun out, but I was incredibly bored because all I could do was lay in bed and talk to myself.  </p><p>After my parents left for church, I got dressed, and my sister and I went to church, still spun out.  I felt guilty but not too bad.  I've heard people crave more speed during the comedown, but I actually wanted the feeling to go away.  It was kind of frustrating because my body wanted to keep moving but my mind wanted me to stop.  I had been active for 15 hours and wanted to calm down.  </p><p>Another thing I didn't like is for a little while after the comedown I felt disinterested in anything.  Nothing really seemed fun or exciting.  I wanted to do something, but nothing seemed worth doing.  But this feeling faded too.  Now it is around 10 p.m. of the night following my first time trying speed.  I feel fine now.  </p><p>Speed was fun, very fun, but after hours and hours of it I just wanted to calm down, but couldn't because it lasts kinda long.  Next time I do it I think I'll try to just do it once instead of twice.  I don't want to be spun out for days like some people.  Weed is definitely still my drug of choice;  I think I'll do speed only occasionally for a change of pace.</p>"
}
