{
 "title": "Not to Be Taken Lightly",
 "author": "GBIFS",
 "citation": "   GBIFS. \"Not to Be Taken Lightly: experience with JWH-018 (ID 87665)\". Erowid.org. Feb 12, 2011. erowid.org/exp/87665",
 "substance": "JWH-018",
 "bodyweight": "150 lb",
 "header": [],
 "footer": [
  [
   "2010",
   "ID: 87665",
   "Male",
   " ",
   "Not Given",
   "Feb 12, 2011",
   "Views: 6211",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nT+15: Nothing, nothing, maybe a little light headed but that'd come from whatever I might smoke. Finding various ways to test its supposed analgesic quality I can pinch myself to the edge of breaking skin, proves no pain. My phone vibrated on my lap and I only noticed because it was so loud. Interesting.</p><p>T+30: Woah I can barely stand up I'm going to lay down.</p><p>T+40: Starting to like it a bit more, but after this I probably won't do it or any other drug ever again. Then again I can't feel anything right now and I'd probably laugh at you if you tried to hurt me physically. </p><p>[Keep in mind all these times are not accurate because I can't keep track of time]</p><p>T+45: I can barely find the right keys on the keyboard but I manage. Hoping for it to end soon. Have found if I look at text on paper I can get back to life breifly but accurately. Taking videos of myself to see what I look like when I come back down to Earth. Wobbly walking around, running into stuff and laughing about it like a mental patient.</p><p>T+50: Calling to people and asking them if I sound normal. I can tell a bit that I don't. Still can't wait for it to be over. Take a piss because it's supposed to calm down an unpleasant trip.</p><p>T+60: Less fun, but still not a bad trip. Cannot stand up still. Laughing at the most inappropriate times. No way I could be acting normal physically throughout this trip, however that comes in time (and depends on whether you're actually going to try something again that scared you half to death your first try).</p><p>This time is probably 10 minutes off each... Just use that as a rule of thumb, this is lasting longer than I thought but what the hell, no where to be...</p><p>T+1:05: Well this is still lasting longer than I thought, I was always told it lasts half an hour and I'm still pretty messed up. Definite no no for me in the future. Still twirling around when I try to walk down a hall, losing track of time. Going to lay down until it's over.</p><p>T+1:30: Lasting a lot longer than I thought, this is getting weird. </p><p>Well I have another 4  hours before I really have to be anywhere and if I'm still high at least I'll get in a record book for something.</p><p>T+1:35: Starting to come down I can walk mostly normally again. Still a little screwed up but laying down for another ten minutes should take care of that.</p><p>T+1:45: Almost done, yeah! I will never willingly do this stuff or any drug again.</p><p>Overall it was a bad trip, unpleasant, disturbing, and time-consuming. I'd suggest don't waste your time unless you've already had the real stuff and love it.</p>"
}
