{
 "title": "Real or Fake, Very Nasty",
 "author": "Lucy ",
 "citation": "   Lucy . \"Real or Fake, Very Nasty: experience with 6-APB (ID 87844)\". Erowid.org. Oct 28, 2010. erowid.org/exp/87844",
 "substance": "6-APB",
 "bodyweight": "167 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   " ",
   "6-APB",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "87844",
   "Female",
   " ",
   "27",
   "Oct 28, 2010",
   "Views: 18051",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I feel the need to relate this experience with some urgency as it appears this chemical is not only fast gaining popularity, but it is also one of the least easy to identify safely on the net. It seems nobody knows what they've taken, including myself, and the dubious 'genuine' descriptions are still not enough of a deterrent to dissuade people (including myself, usually logical yet reckless around the persuasive brilliance of my anticipation, which was easily stoked reading of 'amazing high, euphoria, better than MCAT' etc etc).</p><p>Since taking (for ease Ill call it benzofuran, but as I said it could be anything) this for the first time yesterday at 11am, I havent slept, so my experience may be inaccurate. I believe most of the things I felt were reasonably judged however, due to the odd side-effects of this substance including dogged attention to detail, awful feeling of clarity tainted by negativity and emptiness, and a weird feeling of being mentally in control yet physically falling apart.</p><p>I erred on caution and took dabs of about 10mg  probably 40mg max in 2 hours. Slow and gradual come up, maybe initially half placebo, but certainly speedy. Cleaned thoroughly for 2 hours with moments of compulsive ordering of things as Ive felt on amphetamines, mildly (though I dont attribute to drug in hindsight) elevated mood.</p><p>SO between 2pm and 5pm I dosed about 30mg more. Pulse slowly faster, constantly reviewing my state of mind. Here it goes awry  was it the chemical or did I have an individual reaction and become paranoid and really anxious? Never had it so bad before. By 6pm I was describing every tiny occurrence in my head and body to my boyfriend, in the hope of some reassurance. I became suspicious of the appearance of the drug  it was resistant to dissolving for half an hour (bizarre to me) and it crunched between my teeth like glass. But we deduced it wasnt glass when it finally dissolved. </p><p>I deteriorated pretty fast. Any communication stressed me to the extent I was frightened of cardiac arrest or stroke or permanent brain damage  probably paranoia  but my heart kept going up to 110 bpm, my neck felt constricted, my face flushed (and still is) and I was to spend all night pressing cool objects on my cheeks. The only way I could describe it then was like a drug designed to avoid all the usual advantages of any drug; euphoria or empathy or even an inflated sense of one's importance and a need to talk one's important self into the minds of others and leave an indelible mark of one's brilliance. It was a chemical shortcut to the feeling after a 48 hour mephedrone binge, or during a panic attack, or else just before a nervous breakdown. An intact and functioning human being wired up different to all the rest.</p><p>Later after 2 others had significantly smaller doses, they corroborated my feelings. Coming up without the up.  Angry without the intent to react. Depressed but missing the empathy to indulge the emotion. All night just an ugly precipice and a longing, oh hell, for it to be over. I cant explain how terrifying it was, and this lasted from 6 until 12am. I spent much of that time checking my pulse, colour pupils, etc and reading (bad idea) for advice online.</p><p>The weirdest thing is my pupils were not dilated for the first 12 hours!?? Then at 1am they grew huge (not quite as huge as on Exstasy). My mood changed, I felt interested and rode a wave of happy confusion with comedown fears  I cant watch tv, no I need to, no not this program  a h h, this is good, oh Im going to die again... and so on. I took some herbal calmers with hops and passilora etc...nothing. Ate bites of pizza, grapefruit and cake, and spat most out. No appetite. The hours between 3 and 8 (while my boyfriend slept) I shook, quivered, raced, and worried, reading all kinds of things online, just unable to contemplate sleep. At 8 my knees were blue, my face puffy and flushed, my eyes looked bruised as tiredness has never made them before, my palms could have been scalded  blotchy and streaks of red, but white backs of hands. No jaw grinding or lip-sucking but tenseness all over. I took a dioralyte sachet for my electrolytes and dehydration.</p><p>Okay this may not be an acceptable rendering of my benzofuran experience (and I only used my shortened term once!) for publication. I just hope its a warning not to risk one's life on chance highs, on chance chemicals or on time between doses and the speed of onset. My former worst experience was pacing the room after 30 hours of mcat, actually unable to speak, and sobbing in terror that I was dying. All I can say is this was weirdly worse.</p><p>11am, still no sleep  24 hours, last dose 4am (about 5mg max). Still racing.</p><p>[Reported Dose: 'between 200 240mg']</p>"
}
