{
 "title": "False Positive for PCP",
 "author": "rktrevi",
 "citation": "   rktrevi. \"False Positive for PCP: experience with Spice and Synthetic Cannabinoids (Pineapple Big Bang) (ID 87865)\". Erowid.org. Oct 29, 2010. erowid.org/exp/87865",
 "substance": "Spice and Synthetic Cannabinoids (Pineapple Big Bang)",
 "bodyweight": "131 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 87865",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Oct 29, 2010",
   "Views: 11479",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been an avid smoker of marijuana for 8 years and when I had to quit you can imagine that I wished for other ways to do the trick. I about shit my pants when I found out about spice in smoke shops. I thought the effects were so similiar, while still maintaining a high that was all its own. I had my concerns about it saying, 'NOT FOR HUMAN CONSUMPTION' on the bottle, but hey, I wasn't about to argue. I purchased 5 grams of pineapple 'Big Bang!' spice at a local smoke shop, the sticker read, '100% High Quality Damiana.'  I have at this point been drug-tested frequently and have been peeing clean for about a week.  </p><p>Five days ago (Oct. 15th 2010) took my first hit of spice, a moderate sized one, and held it in for 10 seconds. I started to get a feeling that my eyes were getting red almost immediately and had a strange panicky feeling in my chest. I walked to the gas station and by the time I was there I felt semi-retarded. By the time I was home I took another small hit for good measure and eventually went to sleep after laughing a bit for no good reason. I followed this pattern of 2 hits a night until today, Oct. 20th, where I had another drug-test at my doctors office. I came up positive for PCP.  I stressed to my doctor that I had never even seen the drug in person, let alone used it, and that the only thing I had done was spice. He lectured me about how spice caused not only positives for PCP, but also caused mild psychotic episodes and with heavy use can induce what he simply called, 'tripping out'.  I felt a lot like I was on acid during a few of the nights I had smoked and several times during my high I was absolutley certain that there was loud knocking on my door, enough to make me jump for being startled, but alas I live alone. One of the knocks even came in musical rhythm. It scared the hell out of me to have produced a sound like that in my head. </p><p>On one occasion I saw a lot of neon purple appearing in the dark in random order, sometimes only in dots. This was followed by an extremely unpleasant feeling near my kidneys.  I don't know much about PCP or spice, or if any of these things are common in their use, but I also feel... a need, or rather a near overpowering want for spice. Is it addictive? even just psychologically? My doctor said it was both, but I don't know where to draw the line on him telling me fact and him telling me what's best, to try and discontinue my use.  A lot of the spice around here comes from local distributers, as I imagine it probably does most everywhere, so maybe it had something to do with the particular brand I had bought?  I know of many people who smoke spice and pass the drug tests at their works with no problem at all. And even my doctor mentioned that not everyone that uses it tests positive for PCP, but claims it has happened on multiple occasions with his patients.</p>"
}
