{
 "title": "Helped My Hypertension",
 "author": "Joe Pie",
 "citation": "   Joe Pie. \"Helped My Hypertension: experience with Nutmeg (ID 87886)\". Erowid.org. Jul 16, 2011. erowid.org/exp/87886",
 "substance": "Nutmeg",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "1 nuts",
   "oral",
   "Nutmeg",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 87886",
   "Male",
   " ",
   "Age at time of experience: 40",
   "Jul 16, 2011",
   "Views: 4213",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The most significant effect of nutmeg is as an anti-hypertensive.  I have taken it regularly for over ten years for this reason.  I have recommended to one other person in the past because he had high blood pressure that no prescription drugs were reaching; It was dangerously high, 195/150 sort of thing, it worked great for him this way as well.</p><p>A side effect is a mild to strong sensory enhancement, and there is also some mystical/insightful sense enhancement as well.</p><p>The stuff can potentiate with other CNS depressants, such as alcohol.  One evening, for example, several years ago, I had a couple of glasses of wine.  This about knocked me out, and checking my blood pressure then it was 85/45.</p><p>I regarded the potency and psychological flavor of each nutmeg as unique... one may be stronger or weaker than another of the same size.  Too, in my experience, the larger ones tend to have more of a blood pressure reducing effect, the smaller ones seem to have more of a mood-enhancing effect.</p><p>The recipe stuff one sees out there about nutmeg is abominable, and definitely it is not a smokable thing. Yuck!  Dosing is simplicity itself!  For my first time I would get a nutmeg the size of my index finger nail.  No grating or any such nonsense.  Just pop it in my mouth as I would a hard candy.  In a minute or two it will break up just as hard candies do, with a little crunching tooth pressure. I chew it up good and swallow it, and wash it down with a good glass of water.</p><p>Nutmeg effects last a long time.... the peak is about 14 hours after I sink one.  The effects last for 24-36 hours in my experience.  It can be a bit disorienting so I would definitely not drive or use complex equipment for that time.</p><p>[Reported Dose :  'Variable about 1 Medium per day']</p>"
}
