{
 "title": "Fast Times and Hallucinations",
 "author": "Sinistersaint",
 "citation": "   Sinistersaint. \"Fast Times and Hallucinations: experience with Products - Bath Salts, Plant Food, etc. (ID 87881)\". Erowid.org. Sep 2, 2011. erowid.org/exp/87881",
 "substance": "Products - Bath Salts, Plant Food, etc.",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 87881",
   "Male",
   " ",
   "Age at time of experience: 27",
   "Sep 2, 2011",
   "Views: 6356",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  </p><p>I was first given a small dose of this powdered substance [MDPV] a few weeks ago and found it very pleasant, and so I decided that when I got paid next that = would purchase some for myself to expirement with.</p><p>I drove over to the local porn shop that carried the substance as a 'condensed bath salt' and I, being the fool that I am, was do0ped into buying two 500mg containers instead of one to save $10. I was very excited.</p><p>I randomly snorted a line in the car before I started my drive home. I felt very good within 5 minutes and even better in the 15 it took me to get home. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  It was very much a 'heady' high. Pressure in the eyes and such. Slight euphoria. I continued doing lines/bumps when I started feeling a come down. Now I must tell you all that I did this without researching the chemical or knowing proper doseage >.\n</p><p>After about 2-3 hours of indulging in what I thought at first was an amazing thing I decided to take a drive. The lights in the street were very bright and there were sunbursts from every source of light. My eyes became enraged and I quickly went home. I knew then that I shouldn't do more but did anyhow. I spent the whole night up peaking out of windows.</p><p>The next day I had off of work and the MDVP just kept coming. Come morning I was still awake, very paranoid, and I believe I was seeing and hearing things. My apartment didn't feel like my apartment any longer. In fact it felt like I was in an entirely different world only backwards or 'bizarro' like on Seinfeld. Gratz if you get the reference :p ... anyhow throughout the day I swear to you I could hear my neighbors having sex next door. I truly believe this was happening. Two car loads of guys were going in and out and this carried on for hours and into the night. I remember texting my girlfriend explaining that the people next door were having an orgy and I felt like calling the police so I didn't have to listen.</p><p>When I sent the text I heard very loud sex noises outside my window and so I took a peek. There were lights on in the back yard of the neighbors behind and I saw a man walking towards a shed in towards some shadows (kinda looked like a cop.) The noises continued and I heard some hollering. By this time I had moved my bedding into the living room to avoid the noises. Soon after the noises stopped. All of the cars that were there left except one. I decided it was ok to return to my room. As soon as I lay down I heard a shower kick on and sex through the walls! This was short lived and then the last car left. Hallucinations? Who knows.</p><p>I also witnessed my coffee table float up about 6 inches. I felt like a jedi. I wasn't sure if it was really moving so I held my foot still and it still moved up. When I looked at its legs they were still on the ground... weird.</p><p>All of this was followed by extreme bad mood... severe depression... eye inflammation which caused 'flashing blue lights' look it up... and extreme red eye among other things.</p><p>All together around 500-550mg in a 2 night binge not a good idea.</p><p>Proceed with great warning and respect everything you try by being educated first. Psychosis is not fun!</p>"
}
