{
 "title": "Snowflakes In The sky",
 "author": "Michael H",
 "citation": " Michael H. \"Snowflakes In The sky: experience with Bromo-Dragonfly (ID 87885)\". Erowid.org. Oct 28, 2010. erowid.org/exp/87885",
 "substance": "Bromo-Dragonfly",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "250 ug",
   "oral",
   "Bromo-Dragonfly"
  ]
 ],
 "footer": [
  [
   "2010",
   "87885",
   "Male",
   "",
   "18",
   "Oct 28, 2010",
   "5492",
   " "
  ]
 ],
 "report": "<p>background information: i have experience with 2C-E, THC, opiates, benzos, alcohol, salvia divinorum, cocaine, DXM, and a couple others.</p><p>BDFLY is the 2nd psychedelic i've ever ingested, 2C-E being the first    </p><p>here is my experience, the highlight of my experience was when i was outside. i HIGHLY recommend going outside and watching the sunrise on any psychedelic voyage.</p><p>1:45 am - ingested ~250ug bdfly sublingually</p><p>2:00 am - feeling some auditory changes, i'm sure its just placebo, though one can never know</p><p>2:15 am - same feeling as above</p><p>2:30 am - feeling of 'something' happening, although i can't exactly pinpoint whats happening</p><p>2:45 am - time dilation starting to become apparent same feelings as mentioned above still present</p><p>3:00 am - feeling positive mood :)</p><p>3:15 am - great mood uplift feeling of well being and happy all throughout</p><p>3:30 am - great warm feeling in the lower abdomen lots of gently rushing euphoria coming in waves feels amazing no complaints so far :)</p><p>3:45 am - feeling something i would like to call... comfortable anxiety</p><p>4:00 am - went outside found the backyard very interesting and amusing :)</p><p>4:15 am - still outside</p><p>4:30 am - just came inside starting to feeeeel</p><p>4:45 am - just got in shower feeling good</p><p>5:00 am - just got out of shower feeling fine</p><p>5:15 am - playing some online games feeling alright</p><p>5:30 am - had a phone convo my cognitive thinking seems to be improved not impaired</p><p>5:45 am - planning to watch the sunrise; will report back for details</p><p>6:00 am - heading off to watch the sunrise</p><p>6:00 am to 8:45 am - vivid awesome hallucinations like i have never seen before on any type of enthenogen, +++ on shulgin scale almost got to a ++++ gorgeous Open eye visuals and Closed eye visuals. I was absolutely engulfed in the visuals beautiful hexagonal snowflake like (mandalas?) patterns in the sky rotating slowly clock wise and counter clock wise they were huge and they seemed so real it was amazing... i could have had a ++++ but i chose to not let my mind drift in that direction, i was not prepared to experience what bromodragonfly had in store for me... so i 'drove' the trip back towards home</p><p>10:09 am - still tripping heavily</p><p>12:08 pm - effects slightly diminished still a ++ on shulgin scale</p><p>1:00 am - effects almost completely gone ready to go to sleep! took some melatonin and Valerian root to calm down whatever psychedelic fuzz remained.</p><p>4:00 am - finally go to sleep</p><p>next day i felt amazing and refreshed and happy to be alive, i feel the experience has definitely softened my ego and showed me the beauty of nature</p><p>i felt so much ability to think about ideas and communicate with people while on bdfly.</p><p> it was a mind opening life changing experience... the most powerful i've had to date.</p>"
}
