{
 "title": "Aliens Reprogrammed My Brain",
 "author": "Mitra",
 "citation": "   Mitra. \"Aliens Reprogrammed My Brain: experience with MDMA & 2C-T-7 (ID 8793)\". Erowid.org. Aug 17, 2001. erowid.org/exp/8793",
 "substance": "MDMA & 2C-T-7",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:30",
   "10 mg",
   "insufflated",
   "2C-T-7",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8793",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 17, 2001",
   "Views: 24509",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nA word of warning. 3 days after this experience, I was told about a number of deaths occuring from the same combination. This has lead me to beleive that what I did was not safe and thus I probably will not repeat the experiment. This I find very unfortunate as I found it to be the single most useful combination to date.</p><p>10:30 pm - took 1 pill very strong mdma.</p><p>11:15 pm - start rolling quite hard.</p><p>1:00 am - my roll is tapering off and I feel very grumpy that I do not have another pill or any acid to bring me back up. I find the I usually don't get the most interesting part of the roll until I bump. I remember that I have some 2CT7 in the closet. I had previously done a small quantity of it and had not been very impressed. Then some of friends did some of my 2CT7 and they all puked and complained so I had never tried it again. Temporarily forgetting about the negative parts of my friends experiences, I went to the closet and retreived a premeasured 20-25 mg (not exactly sure) bundle. I snort roughly half of it (~10 mg).</p><p>1:10 am - suddenly rolling vary hard again with some visual disturbances.</p><p>1:20 am - feeling slightly (very slightly actuallly) neaseated but feel like I should probably go to the bathroom.</p><p>1:25 am - Start puking. I am very matter of fact about it. It isn't pleasant but it doesn't really bother me. I don't really feel that bad, my body just wants to cleanse itself. </p><p>1:35 am - finally stop dry heaving. wipe tears from eyes. breath deeply and relax after that trying experience. Realize that I am feeling entirely better. Realize that I am rolling VERY hard and that there is starting to be some very bright colors coming out of everything. I manage to brush my teeth and then I head outside for a smoke. I have a very hard time navigating to the front porch because the visuals are suddenly so plentiful that I can't see where I am stepping! </p><p>2:00 am - realize that I still havn't lit the cigarette in my hand. I have been watching the trees in front of me in amazement. With each heartbeat, which I can feel throughout my whole body, a second image of everything in front of me breaks off and goes spiralling off into infinity changing colors as it goes. My entire feild of vision is a kaleidoscope of bright neon colored overlapping copies of the original scene zooming in fractal spirals. slight movements of my head send the spirals moving off in new directions. I light my cigarette and realize that I am having physical hallucinations too. I move my arm to flick the ash off the cigarette and I feel a hundred extra arms spiral off towards infinity just like my visuals are doing. I put out the cigarette and start moving about playing with this. I am the insect-yogi. I contort my body into the most amazing yogic postures as I dance about. I realize that I do not have even the slightest beginings of an understanding as to the nature of the game that this combination provides and I wish that I had friends along with me to figure the games out with. </p><p>7:00 am - I have just realized that it is 7:00 am. I have been playing with this bizzare new form of trip for 5 hours and I didn't notice the time pass. For that matter, I don't seem to have come down very much. The visuals have subsided a good deal I decide. They are only 10 times more abundant than on anything I have fealt before. I wonder if I am going to come down any time soon and start to get stressed because it is daytime already. </p><p>7:10 am - I am really stressed out and have become convinced that I should go to bed and go to sleep. I try to do this which, obviously, does not work in the slightest. However, this is when the interesting part starts. I am getting some neat very brightly colored closed eye visuals and then something organizes them into some alien combination lock. I realize that it is the password protection machanism too my mind and something is trying to hack the code. Said something is very good at this and the pieces start falling into place. As each piece falls into place, I feel something shift and open in my mind and a coresponding physical shift and opening in my body. When something finishes dialing in the correct combination, everything unlocks and opens up like some sort of puzzle box and I am in hyperspace. By hyperspace, I mean what I have read in descriptions of the most extreme DMT excursions. I am in another place entirely and this place is incredibly intricate. There are thousands of entities flying around. Nearby, a group of 10 or so of them have me tied down and they are performing surgery on my mind. Or maybe they are hacking it. Either way, it feels really invasive and disturbing to have them in there and I become quite frightened. I reach back to another place that I remember used to exist and I run a command there called 'open the eyes' this works and I snap back into my body and open my eyes. Everything seems reasonably normal except that I am high and failing to sleep. Then I realize that this is only a part of me here in the room and that another part of me is still back where I left it and that I am not there to witness what they are doing to it. I close my eyes again and instantly, my body falls apart and dissapears. I am back in hyperspace with the entities still working on my mind. </p><p>9:30 am - I have moved to the couch. With my eyes open, things are mostly normal but frightening and I don't want to look at anything. With my eyes closed, I am still in hyperspace interacting with the entities. They are being more interactive now. THey are still working on my mind but they want to play games too, maybe to see how things are going. Now I begin to find out what this has all been about. All of my carefully constructed mental shields start coming down. I realize for the first time that I have been in a deep state of denial about a great many things. I begin to see clearly all the ways in which I behave in self destructive or self decepting ways. I see clearly all the ways that I am self absorbed and selfish. I see all the ways that I am cruel or insensitive to my wife and friends. I see that I have been engaging in a number of addictive type behaviors. If this had been acid, I would be sobbing and feeling like killing myself but in this state, I am able to look at it all honestly and from an objective standpoint without getting too upset about it. It is more like I feel a sense of obligation to deal with it. Instead of getting down on myself for it, I begin to have a sense of pride in myself. I realize that I have too much pride and self respect to continue behaving like this. I feel that it is a matter of pride and principal that I fix these behaviors immediately and even go to far as to make reparations for the damage that I have done. I set out an honest and realistic plan on how to go about fixing my relationship with my wife. I promise to quite smoking, start exercising regularly, stop abusing drugs and only use them appropriatly. (at the time I was doing mdma every weekend and doing up to 6 pills in a night often in combination with a lot of alchohol, MJ, acid, nitrous, and anything else that I could get my hands on. ) I began planning how I was going to start taking responsibility for a whole lot of things that I had been shirking. By the time the entities were done with me, I had a very long list of things that I had to fix or make up for. </p><p>11:00 am - the entities have finally left. They closed up my mind and hyperspace went away. I feel shaken by the whole experience. I still have the feelings of pride in myself. The world looks mostly normal again but colors are still brighter. There is still no way in hell I am sleeping but I am ok with that now. After all, I have a lot of work ahead of me.</p><p>11:30 am - my wife wakes up and wants to go do things. I decide that I am ready to interact with the ourside world and we leave.</p><p>11:30 pm. I finally go to sleep</p><p>---------</p><p>It has been 3 months since then. I have straightened up my act. I have succeeded in most of my goals from that night. My relationship is much better. I have quit smoking and I am involved in an exercise program (Hap Ki Do and Yoga) which I love. My drug use is down to a reasonable (in my mind) level, if not even what one might call an ascetic level. In the lst 3 months, I have gone through 2 mdma pills and 2 hits of lsd and I have smoked pot a couple of times and only been drunk 5 or 6 times. I am doing well at work and I have a sense of responsibility. I also have what one might term a descent level of self respect and pride in doing what I do right. </p><p>I think that it is very unfortunate that this combination is so dangerous because I think that it may well be the most useful theraputic agent yet encountered by man, not to mention really interesting and fun. Anyways, if it should turn out that it is safe after all, I certainly hope that there is a deeper investigation into this combination.</p><p>That is all, </p><p>Mitra</p>"
}
