{
 "title": "Is it All in my Head?",
 "author": "morchella",
 "citation": "   morchella. \"Is it All in my Head?: experience with Cannabis (ID 8796)\". Erowid.org. Jul 1, 2005. erowid.org/exp/8796",
 "substance": "Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8796",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 1, 2005",
   "Views: 7449",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I used to be a regular smoker.  Every day, or every other day, very involved in the pot culture, lots of friends and good times.  Who has kind?  Who has the fattest grow-room?  Who wants to hang out and listen to this crazy cd?  Who wants to get blazed and go hiking?  Very mellow and enjoyable, very chill and natural.  And I don't know, maybe I've been naturally inclined towards anxiety for a long time - certainly I've experienced a kind of crushing depression, and I really think that anxiety is a twin sister of depression - same genre of feelings, but manifested as panic and fear instead of sadness.  Anyway, little by little these feelings of anxiety would blossom and engulf me every time I smoked.  At first I tried to hide it.  Calm down, I told myself, don't be stupid, you've been smoking for YEARS ... it's entirely in your head ... deep breath, mellow, but I COULD NOT control it.  I'm convinced it MUST be something physical.\r\nAnd so I quit.  Two or three months ago I said enough is more that enough.  It was never any fun anymore - in fact, it was often absolutely terrifying.  I've had nights where I lay in my bed alone concentrating on NOT DYING - please oh please let my heart make it through this episode all the while pounding as if it may rupture the blood rushing in my ears and the panic so bad, so scary.  I'm afraid to smoke for good reasons. And yet ... and yet I really do miss it and feel sorry to be so left out.  There's this huge rift between myself and my friends now, even my husband.  He loves to smoke, and I can't blame him, and so I never would ask him to quit, but still things are different and, well, seperate.  IS it all in my head?  CAN I control the panic attacks by sheer will power?  Is it chemical or physiological or is it health related (like is it a heart condition?)  Sometimes I really think the root of it all is anxiety - if I could just conquer my anxiety all would return to normal.  The drug is merely a catalyst.  But I'm so afraid to smoke - really I guess afraid to die.\n\n\n"
}
