{
 "title": "A Professional White Male Walks Through Crack",
 "author": "WASP Crack Smoker",
 "citation": "   WASP Crack Smoker. \"A Professional White Male Walks Through Crack: experience with Crack Cocaine (ID 88)\". Erowid.org. Mar 8, 2001. erowid.org/exp/88",
 "substance": "Crack Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Crack",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "ID: 88",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Mar 8, 2001",
   "Views: 22055",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As a college-educated professional, I can afford many diverse and challanging hobbies.  I love to ski, rollerblade, lift weights, play guitar, and travel.  But my most challanging hobby is smoking crack.  I moved to a new city three years ago for a great job that paid a ridiculously high salary.  I had always smoked weed recreationally and when I ran out, I needed to find a new source in a new city.  Being a danger-seeker, I went into the worst neighborhood in the city where you can buy any drug under the sun on every street corner.  I found a guy who had twenties of weed and bought three.  He also gave me two small clear bags with white rocks in them and told me it was a free sample.  I knew what crack was and what it did but I had never tried it.  </p><p>As soon as I got out of that neighborhood, I pulled out my bowl, loaded up some weed, and put one of the rocks on top.  As I took several hits, I experienced the most intense high I will ever know.  I sat in my car for the next hour sucking on that bowl like it was my best friend.  I next went to an ATM and took out $100.  I sped back to that same corner to the same guy who knew what I wanted as soon as he saw me.  I spent the next 14 hours smoking crack.  I spent the next week wishing away the days until Friday after work.  I spent that entire weekend smoking $450 worth of crack.  </p><p>I have smoked crack in every resturaunt, mall, concert, and sporting event in this city.  I have smoked crack in several other states and even took some with me on my honeymoon to Hawaii.  No one who knows me has the slightest clue that I spend at least four days a week driving into the ghetto buying crack.  I know the dealers on the corner better than I know my own co-workers.  The sad thing is that I have a great life and have everything to lose if I am caught by either the police or my wife.  And one of these two things is inevitable because I can't see myself stopping.  To anyone who is thinking of trying crack, all I can say is: don't.  While I have the money and skill to support and conceal my habit, it is only a matter of time before it catches up with me because I can't stop.</p>"
}
