{
 "title": "Tryptamine Dreams at a Darkpsy Party",
 "author": "Doctor DiMiTry",
 "citation": "   Doctor DiMiTry. \"Tryptamine Dreams at a Darkpsy Party: experience with AMT, MDAI & 4-HO-MiPT  (ID 88045)\". Erowid.org. Nov 4, 2010. erowid.org/exp/88045",
 "substance": "AMT, MDAI & 4-HO-MiPT ",
 "bodyweight": "77 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "smoked",
   "AMT",
   "(powder / crystals)",
   "  T+ 1:00",
   "1000 ml",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 2:50",
   "150 mg",
   "oral",
   "MDAI",
   "(powder / crystals)",
   "  T+ 5:20",
   "150 mg",
   "oral",
   "MDAI",
   "(powder / crystals)",
   "  T+ 6:45",
   "21 mg",
   "oral",
   "4-HO-MiPT",
   "(powder / crystals)",
   "  T+ 9:30",
   "250 ml",
   "oral",
   "Alcohol - Beer/Wine",
   " ",
   "  T+ 14:00",
   "1 hit",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 15:00",
   "0.25 mg",
   "oral",
   "Pharms - Triazolam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2010",
   "88045",
   "Male",
   " ",
   "22",
   "Nov 4, 2010",
   "7998",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A short summary of the substances consumed</p><p>T0: 00 - T +1:00 ~ 30mg AMT, smoked</p><p>then 1 litre of beer</p><p>T +2:50 150mg MDAI</p><p>T +5:20 150mg MDAI</p><p>T +6:45 21mg 4-HO-MIPT</p><p>T +9:30 ¼ liter of beer</p><p>T +14:00 hit of cannabis</p><p>T +15:00 0.25 mg triazolam</p><p>Psykovsky in Vienna!</p><p>Of course I could not miss that, despite a little chill.</p><p>The plan was to take some aMT at first to warm up, as a base for a dose solid of LSD, which I intended to buy at the party. Obviously I could not rely on this, so I took a plan B with me.</p><p>The evening began with smoking of about 30mg of AMT from tinfoil within an hour at half past 8. In principle, a quite large smoked dose, but previous attempts in the range 15-20mg did not really get me where I wanted to be. Obviously, quite a bit of smoke escaped, especially since it is difficult to completely evaporate the whole stuff, without giving rise to very unpleasant pyrolysis products (a horrible feeling in the lungs ...)</p><p>Anyway, this time I reached my sweet spot. It came on very quickly, leaving me in a serene, dream-like state. The trip can be described as a mixture of MDA, without its intrusive component, and LSD (largely) without visuals. Meanwhile I am beginning to appreciate the pleasures of AMT itself, but its real strengths manifest in mixed use with other tryptamines.</p><p>Contrary to my intention not to cloud my mind with any kinds of downers that night, I drank 2 beers on the way to the party, to prevent the expected muscle tension, which worked at least for a time. I walked all the way in a state that felt like a lucid dream, with a big grin and even bigger pupils.</p><p>At 11 we reached the location. It was not much going on yet. My buddy bought a bottle of iced tea should that should accompany me the whole night (I still have it, that bottle is kind of special in the way that it experienced exactly what I experienced that night ;)). We washed down each 150mg of MDAI. Soon it became apparent that the MDAI harmonizes excellently with the aMT. So much, that 150 mg (and the stuff is relatively impure - dark brown colour, etc.) were almost a bit too much. An incredible euphoria filled me. It was so strong that I had to sit down at times, while my buddy - who did not use any aMT that night - wanted a re-dose 40 minutes after the first one. </p><p>The next hours were marked by alternating dancing like a manic and sitting on the stairs to rest. My mental state was unbelievably pleasant, but physically it was quite tiring. The stomach never felt too good, plus a feeling of weakness and problems with temperature sensitivity. Regardless, shortly before 2 am I took another 150mg of MDAI, since it showed its best side today. Furthermore the search for acid to was in vain until then.</p><p>Psykovsky began at 3. My plan was to take 21mg of 4-HO-MiPT at half past 3, but my buddy was impatient and so we threw it about a quarter of an hour earlier. I could still feel the paper from the bomb in my throat when another buddy showed up in front of me, holding a blotter, stating '300 micrograms. The LSD will always find you eventually.' Very bad timing! Reason prevailed and I politely declined. We went to chill outside where I noticed after the substance arriving at my receptors after a short time. Dizziness, accompanied a drifting off and a fluidity of my thoughts. I was freezing outside, so I quickly went back into the club. A good idea, because this time the miprocin was in a hurry!</p><p>Back on the dance floor it quickly became clear that I would be facing a wild ride. The rather unpleasant come-up effects could be countered very well by dancing and I quickly fell into a trance. The concept of reality vanished fast ...</p><p>Previously I was not entirely sure if Psykovsky would harmonize with the trip, but I was quickly convinced of the contrary. The sound full of variations and twists, turned out to be the most psychedelic music at all for me  if music would be the right word to describe the productions of Psykovsky anyway! This guy really seems to have an awesome ability express his trips through synthesizers</p><p>I did not know who or where I was anymore. Only an experiencing spirit floating through the room, receiving colours and geometric forms driven by the music, left of me. Spirals and waves rained down on me, fractals formed in this chaos. Suddenly, a stamping bass line brought back some order into that mess. This acoustic interplay captured me completely. No, I was not anymore, that Russian guy had taken complete possession of me. Brief flashes of ridiculous notions, 'mankind is made of air bubbles enclosed in glass.' Inexpressible. Divine!</p><p>In that short moments of relative clarity, I felt an incredible euphoria and put on a manic grin. Any contradiction dissolved into nothing. It was the pure essence of experiencing. Then I slipped back into the dream world. Plastic structures, which I formed with my hands. No difference between visual and auditory stimuli. Unbounded freedom without the limiting properties of everyday reality!</p><p>After about an hour, the peak effects gradually subsided. At least I was again in control over my body and was able to get some water. Although that is not absolute - a typical effect of miprocin for me is the feeling of being shifted halfway out of my body, so that as worst side effect very unpleasant muscle tension emerges at the end of the trip.</p><p>The next hours were also awesome. I met my friend again and he was just as blown away as me (and I had been wondering if 22mg would be enough for him without priory taking AMT  it depends a lot on set and setting...). He was so off his face, that he had lost his wallet. Fortunately, the crowd was exceptionally lovely, so someone handed it in and he eventually got it back. Oh how do I love the underground psytrance scene</p><p>The trip was less intense now but nonetheless impressive. Before, the focus had been on sensual experiences, now it was on mental processes. Memories and experiences flashed through my mind, now enlightened by the ability to look upon them from completely different point of view. The trance-like dancing, the music still had me in its grip.</p><p>Sometime exhaustion and the strenuous bodyload took their toll in the form of unpleasant tensions. A beer offered very little relieve, especially since my tripping stomach did not allow me to drink more than half of the bottle. But Psykovsky did not let go, and neither did I. His set went for nearly 5 hours!</p><p>After that I could barely stand straight and needed a half hour to gather myself enough to be able go home. With a wonderfully luminous afterglow, eyes and mouth wide open, I went for my long way home. Still very high I arrived, smoking a big hit from the bong, what caused the trip to return to a degree. My room shone in a golden glow, with closed eyes I saw fractals dancing to the darkpsy still ringing in my inner ear. Not exactly sleep inducing!</p><p>I thought about the experience, but was too exhausted to make something useful out of it for now. Consequently, a Halcion turned my lights off at half past 10.</p><p>What could I take with me from this experience? The significance of set and setting for a fulfilling trip. 25 mg miprocin on a summer day in the garden did not quite bring me where I wanted to, 400ug LSD taken at a festival confronted me with absolute emptiness at times (although it was a very instructive trip after all), but this time there was nothing more to be desired. If the trip develops properly on such events like psy parties, the trip becomes incredibly intense despite a relatively low dose. For me, at least.</p>"
}
