{
 "title": "Too Much for a Small Person",
 "author": "Silly little girl",
 "citation": "   Silly little girl. \"Too Much for a Small Person: experience with 4-Methylmethcathinone (Mephedrone) (ID 88089)\". Erowid.org. Nov 9, 2010. erowid.org/exp/88089",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "45 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 88089",
   "Gender: Female",
   " ",
   "Age at time of experience: 2010",
   "Added: Nov 9, 2010",
   "Views: 6131",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In retrospect, this was not a good idea. I nearly lost my friends and my mind to mephedrone. This drug in my opinion, is dirty, and since taking it for the first time in January, I have done cocaine and ended up in hospital for possible MDMA overdose. The joyous drug spiral. I had extended experience with high doses (for someone my size) of mephedrone.</p><p>A friend (A) and I bought 2g of mephedrone, split it equally. The original snorting setting was in a park, from which we went to my friend's house. On eyeballing dose, and checking the baggie after insufflation, I had snorted approx. .25g in two lines. As we were walking through the park, that initial stimulant/ euphoric rush kicked in. As did my gurning. All was good and well, this was around 15 minutes after dose, and I 'felt' like I was coming down already, time for redose, this time, I insufflated a single line of around .1 - .15g. Continued having a good time upon return to this party, music was blaring, conversation was flowing. Managed to do another .1 - .15g line in the toilet, no one suspected. </p><p>When I went back into the kitchen, people were commenting on how fucked I looked, my only response was 'yay, i really want more'. I should have used their comments as a warning. A and I then went back to the park for our final dose, we hung around in the park for a bit, and finished the mephedrone within 20 minutes. </p><p>I knew something was wrong at this point, I was beginning to get physiologic nystagmus - never a good sign. I had to sit in my friend's bathroom, locked in. Because the park was so muddy, A unlocked the door to find me obsessively cleaning the floor of mud. The second time A returned, I was curled in a ball staring at my hands, I recall this is because 'it looked like strobe lights'. At this point she got seriously concerned, I assured her I would be fine, I just needed to sit and relax. Then came the vomiting, which scared me, as any drug-induced vomiting is never good, yet I still maintained a calm air. </p><p>I was informed about half an hour after final dose, I had to go home with my friend (B) whose house I was staying at for the night. B informed me that she'd come get me in 10 minutes, she came back to find me cleaning the hallway, and having the Father of the girl who's house it was, saying 'Are you alright?' B laughed. On the walk to the bus stop (approx. 20 minutes) I thought it would be a great idea to run, which resulted in me on the floor puking. I puked numerous times before getting to B's house, yet found sleep surprisingly easy. </p><p>I have had bad experiences with mephedrone since, now upon dosing, I end up with serious ulcers (that bleed as biting of cheeks occurs) my tongue feels burnt for weeks on end, despite not having had boiling food, my nose will bleed for around 2 weeks, and bits often come out. </p><p>It's just not worth it anymore. And I do believe I now have a drug problem, probably related to the fact I took a like to snorting.</p>"
}
