{
 "title": "High on a Wave on a Dream",
 "author": "Chemical Reality",
 "citation": "Citation:   Chemical Reality. \"High on a Wave on a Dream: experience with JWH-018 (ID 88133)\". Erowid.org. Feb 8, 2011. erowid.org/exp/88133",
 "substance": "JWH-018",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 mg",
   "sublingual",
   "JWH-018",
   "(powder / crystals)",
   "  T+ 0:10",
   "2 mg",
   "smoked",
   "JWH-018",
   "(powder / crystals)",
   "  T+ 0:10",
   "  ",
   "smoked",
   "Tobacco",
   "(plant material)",
   "  T+ 2:00",
   "1 mg",
   "smoked",
   "JWH-018",
   "(powder / crystals)",
   "  T+ 2:00",
   "  ",
   "smoked",
   "Tobacco",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88133",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Feb 8, 2011",
   "Views: 5246",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nTable of Contents\r\n1) Intro and summary\r\n2) Experience notice\r\n3) JWH-018 notes\r\n4) Just before the Experience\r\n5) Experience\r\n------------------\r\n1) Intro and summary:\r\nThis is split into sections divided by lines of hyphens. Feel free to skip through the report. Please tolerate when the language has been simplified. This is to reduce the time it takes to type notes, as well as provide voice to my writing.\r\nMethod of consumption: sublingual/intrabuccal, then smoked. Potentially smoked minute amounts later on. Thought about insufflating it, but have never snorted and would rather a more experienced user attempt to qualify the experience compared to other insufflated drugs. I am interested in whether or not insufflation works. One initial report on Erowid was disappointing (no effects). Sigh.\r\nSummary of experience: good. Feeling creeped up smoothly. Hit me in waves. Initial phase was clear in the head but had a significant body high and desire to eat. Second phase was hazier and felt more intense. Very warm body high, synesthesia, and sense enhancement. High lingered for a very long time (~6-7 hours). Able to 'work' (did not want to deal with responsibilities during the experience), type, communicate. Not couch locked. Could meditate well. Empathic; am sensitive to energy. Nice come down (no bad mental effects, no pain, no aching). Had an intense 'headache' at one point, but was not very bad and did not last long. Non-addictive. I could care less about doing it again, but would not mind doing so. Have never had addictive experiences or short term repetitive use of drugs. I usually trip once a week at most, usually with a few months or years in between experiences.\r\nIn retrospect: the small bits of oral and sublingual consumption may have caused the significant elongation of the high.\r\n------------------------\r\n2) Experience notice:\r\nI consider myself hypersensitive to the effects of chemicals, and CB receptor stimulation in particular. I.e. I am a super light weight. I have gotten puke sick multiple times off of cannabis, even without the presence of alcohol (cannabis alone). By light weight, I mean that I've gotten sick off of a single bong rip. I usually take 1-3 rips from a typical/classic glass pipe. Finishing a bowl by myself is unheard of.\r\nI am usually of the dissenting opinion. I consider myself a shaman, but am an apprentice in comparison to those who use entheogens outside of modern cultures. I have never restricted myself to the use of biologically produced chemicals, and as such, have little problem experimenting with some synthetics. I am not a fan of stimulants, and primarily stick with entheogen-like compounds. As of this report, I have tried:\r\n-LSD\r\n-Various strains of cannabis (low quality and the best I know of; some home grown) smoked and oral\r\n-Oral oxycodone\r\n-Smoked Salvia divinorum several times\r\n-2C-I oral\r\n-Piper methysticum oral\r\n-Nicotiana tobacum smoked (mass produced cigs, cigars, rolled cigs using loose tobacco, and shisha through a hookah)\r\n-Plenty and various types of alcohol, sometimes mixed with tobacco and/or cannabis.\r\n-Spice. Two different brands. First unknown, second 'Funky monkey' or something like that. So, this was my third time trying a synthetic cannabinoid agonist.\r\n-----------------\r\n3) JWH-018 notes:\r\n-It is NOT soluble in water.\r\n-Pure doses are TINY. Powder sticks to surfaces like a bitch.\r\n-It lasted a long time. It felt like other times I had tried commercial spice.\r\n-Reported by the community as appearing as different colors, I had pure white (baking soda/sugar-like white). \r\n-----------------\r\n4) Just before the Experience:\r\nDuring the few hours prior to the experience, I was researching techniques on consumption and handling. It is a very difficult material to work with. The powder is sticky like powdered sugar. That being said, I first tried tasting/eating little bits of the powder as it stuck to my finger tips. It has no flavor to me, but perhaps the small amounts (~0.5mg) may not be enough to trigger my taste buds.\r\nMy first attempt was an idea to dissolve it in alcohol and dose a cigarette with it. This was a stupid idea. I do not have a dropper. I used a plastic water bottle cap and poured some 40% vodka in it. There was too much.\r\nAfter mixing the JWH-018 into the vodka using the pin of an earring (after washing it), I poured it onto a spoon. From the spoon I poured it onto a rolled cigarette. The cigarette got soaked in vodka, more than I had wanted. I let it dry on a napkin. I played with it too much during the drying process, and the paper tore slightly while it was still moist. My friend took another cigarette tube and pulled off the paper and split it. He licked the paper to get it to stick around the cig, but wasn't effective. He used the liquid from a jelly container and smeared it on the paper before wrapping it. He held it for a while, then we let it dry. Approximate dose was ~1mg, but a lot of the liquid got absorbed by the napkin. If it was actually 100% dissolved (it wasn't), then there would have been some lost to the napkin. I do not feel that the amount here was significant. My friend smoked it later and I took three drags off it about half way. Tobacco definitely enhances the effect for me.\r\nI then attempted to smoke it off of foil. This was a stupid idea (ineffective) and it took me an hour to figure out a way to attempt it. I took the bowl off of a hookah and cleaned it out. I spread foil out across the top so it would have a relative flat surface, and I conformed it to the edges of the bowl. My friend held a lighter underneath. It wasn't very effective and snuffed out the lighter so I punched a single hole off to one side. The lighter held, and it heated up. I tried to inhale it using a long cardboard tube from a paper towel roll. It was too long. Get a smaller one, like from a toilet paper roll. Vapor/smoke appeared as it heated, but it was appearing all around, even from the sides of the bowl. This was really weird and it was bugging me so I stopped inhaling. I did not get high off this in any way, but felt a weird sensation. I joked around that I got a 'foil high.' As if I had been foiled...\r\n--------------------------\r\n5) Experience:\r\nMood: normal, slightly positive. Partied last night, slept well, had a solid breakfast, warm day, no stress, played lots of video games. Had tripped a few days prior.\r\nSetting: room. Warm, good people I trust around me.\r\nChemical: pure, white JWH-018 powder. Fluffy like powdered sugar. Packs firm. \r\nT+0:00\r\nSmall dose, unknown amount, maybe ~1mg. Sublingual/intrabuccal. Tried to keep it under the tongue, but ended up swishing it around to cheeks, and rubbing more on the cheeks.\r\nT+0:6\r\nNo effect at this point (none expected), but planned to take a smoked dose, regardless. Packed a 7 inch steam roller (bowl is like 2cm in diameter and 2 cm deep) with two pinches of loose tobacco and a small bit of JWH-018 (described at T0:10).\r\nT+0:10\r\nSmoked ~1-3mg of JWH-018, specific dose unknown. Small puffy square, looked firm. Used a Paper Mate black pen, pen cap. Tobacco filled the bowl, but was packed loosely. Kicks in INSTANTLY. Could be from the tobacco. Knocked me sideways (in retrospect, this part was definitely a mix between a strong nicotine high and being 'domed' when I feel my brain blood saturated in chemicals).\r\nT+0:20\r\nStill feeling something. Warm, tingly, and bouncy. Could dance. Reminds me of a sativa high. Limbs are warm, especially when touching (i.e. I can feel the heat transferred, feint but noticeable). Going to get some food. Ended up eating three large slices of pizza (a little over a half of a large pizza from Little Ceasars or Dominos) and some chicken nuggets. I usually can't eat more than one slice and maybe something extra (like an apple).\r\nT+1:30\r\nI am high, but it's an abnormal feeling.\r\nT+2:00\r\nVery warm, slightly hazy. It comes in phases. In waves. This is ridiculous. I took like three drags off of the rolled cigarette with potentially ~1mg JWH-018 and vodka. Black Owl Cool Mint with a Top Premium menthol king size filter tube. Felt pretty good. Smoothest tobacco/cigarette I've ever dragged on.\r\nT+3:10\r\nMy friend has me play Wild Child by Enya on YouTube. AMAZING song. I had never heard it before, but it gave me large waves of synesthesia and I wanted to just sleep. I had significant memory recollections of the feelings I had as a kid going to sleep. I really wanted to sleep. The song took me back out. I was just amazed. I thanked him for knowing it and having me play it.\r\nT+3:20\r\n'I am tripping so hard.' It was like the spins minus nausea. Very intense body high. I played All Is Full Of Love by Bjork. Amazing song and video combination. Huge waves of bright, overwhelming energy. It is synesthesic. I can see these bright yellow waves wash through me like I'm sitting on a solar beach. Glitches in time... slowing waves, like salvia divinorum. Energy empathogenic effects very similar to 2C-I and cannabis.\r\nI start watching one of my favorite bands' music videos. I feel like I'm being raised up. Each note reverberates through my flesh and up to the top of my skull. My leg is touching a piece of furniture that is touching a sub woofer. The distance between sub and my leg is ~2 ft. It's really intense when the sub holds a quivering note. The vibrations make my leg feel like Jello. It's a strong, significant rippling effect. Audio was definitely enhanced in terms of how I sensed it and how energy felt.\r\nI watch another of the band's music video. Purely amazing. All of it. So good.\r\nSome random phrases of the experience:\r\nA lyric: 'Yeah I am high on a wave on a dream.'\r\n'You're a magician gypsy woman'\r\nT+3:45\r\nStill going strong. Amazing plateau of effects. Ascii representation of the time versus intensity: \r\nStart_/Slope for an hour------Peak & Plateau-------\\Slowpe (slow slope)____integration/ending.\r\nAudio is so vibrant. Hazy. Definitely warm and fuzzy. 'Dizzy' without the spins.\r\nT+4:10\r\nStill going. The 'headache' effect just set in as I started typing again. It feels like two bolts are being pressed against my temples. They are the size of a 50 cent piece or a little larger, like the circumference of a didgeridoo. I am fairly unfamiliar with headaches. I have never had a migraine.\r\nT+5:00\r\n... This is going to be a long night. But I will sleep well. This is pleasing. I am very satisfied with the experience.\r\nT+5:45\r\nVery cooled down. Maintained clear conversation over the phone. Something is still there, but no haze, and no significant sensual enhancement.\r\nT+6:20\r\nNo body high. Kind of physically tired. Head tired, not hazy, but sort of full. Unique feeling. Soft, a little annoying. I don't mind.\r\nT+6:40\r\nSame as last. It's all good. I have been spending most of the experience alone, browsing the internet and writing this report.\r\nNovember, 2010.\n\n\n"
}