{
 "title": "You Never Really Know What You're Getting",
 "author": "Elroy",
 "citation": "Citation:   Elroy. \"You Never Really Know What You're Getting: experience with 6-APB (ID 88190)\". Erowid.org. Nov 10, 2010. erowid.org/exp/88190",
 "substance": "6-APB",
 "bodyweight": "15 kg",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "6-APB",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88190",
   "Gender: Male",
   " ",
   "Age at time of experience: 26",
   "Added: Nov 10, 2010",
   "Views: 14810",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nFirstly I'm not sure if this actually was the real deal before I go any further, I ordered it from a trusted supplier who used to also deal with mephedrone and MDPV, I don't have any previous experience to compare to with this substance but here goes.\r\nAll doses were eyeballed and insufflated. I have a long history with chems however have been clean for the last 6 months. I was also drinking, 6-8 cans of export during the night (1 pint before I got home)\r\n12:40am - first line. Standard coke size line, I separated the 300mg I had into 3 piles looking as equal as I thought they could. The first line was about a 5th of that 100mg roughly. BURNED LIKE HELL FIRE, I thought meph was bad, this stuff is ridiculous, tears coming from my eyes.\r\n12:45 - 5 mins later a rush like MDMA. \r\n12:55- 10 mins later another much smaller line, again a rush like mdma for a while but less pleasurable. I should add at this point it ABSOLUTELY stank of TCP, very much like previous MDPV I had had.\r\nBetween 01:00 and 02:00 - I must have finished the first 100mg. Feeling quite hot, a little bit like the old MDMA days but with an element of trippyness, like sort of an LSD like kick to it.\r\nbetween 02:00 and 04:00 - Really started to feel quite spaced out. Did another decent size (10mg is big when it burns this much) line and all of a sudden it hit me. Feels exactly like MDPV (and smells the same) but mixed with a 2c-XXX of some sort. Ive done 2c-b and its not too dissimilar in effects, I wonder at this point if the stuff I got was just an old stock of MDVP mixed with something to make you feel trippy. Open eyed visuals like shrooms, closed eye a bit but not enough to keep my eyes closed for. \r\n04:00 + Decided to write this out to record my experience, quite impulsive and focused but still feeling like im on another planet, or out of body a bit. Want to keep doing more but I think thats just my nature not the chem itself. I wouldnt recommend sniffing it but maybe bombing would have been more intense a rush due to it being in a larger quantity and focused in more of a steady come up. Feel wired and not anywhere near sleep yet, still got about 50mg left but think ive had enough of it for one night. Will try to play black ops for a bit but I cant imagine being able to concentrate on it.\r\n05:07 - Just did another small line. Felt like my face was going to burn off. Really dont think this is the real deal now it smells far too much like MDPV. It came with a free pellet (pink badly pressed) but again I think this could just be MDPV or something else. Still tripping big time, not like LSD or shrooms but a bit more like 2c-b. Still drinking so its taken the adge off it a bit, dont think it would have been much fun if I had no alcohol. Far too erratic and unpredictable. \r\nIm going to sign off now or I will go on forever. I dont think this was the real thing but if it is then I dont see much point. If you want visuals, do ACID or 2c-b, if you want rushy theres MDMA. It gives a kind of rounded feeling of both but neither overpowering enough to take hold. I suppose the real benefit here is that its legal....for now. Ive read more and more that theres all sorts of stuff being sold as 6-APB so treat it with caution, you never know what your getting.\n\n\n"
}