{
 "title": "A Breathrough!  Finally!!",
 "author": "Blue skies",
 "citation": "   Blue skies. \"A Breathrough!  Finally!!: experience with Salvia divinorum (homemade extract) (ID 8820)\". Erowid.org. May 19, 2004. erowid.org/exp/8820",
 "substance": "Salvia divinorum (homemade extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8820",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "May 19, 2004",
   "Views: 5441",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>For quite sometime, I have been experimenting from Salvia divinorum.  I have smoked unenhanced leaf, 5x, I have vaporized 10x off of foil, and I have tried the quid method using about 10 grams of rehydrated leaves.  The most I ever got out of any of this (particularly vaporizing the 10x leaf and smoking a large quantity of 5x in a pipe) was extreme disorientation, an occasional voice in my head, silly thoughts, and deeper thinking.  I never had the mindboggling alteration of consciousness until now.  For all of you reading this who might be Salvia hardheads as well, here's what I did.  </p><p>I decided to try making my own extract.  I found it really is as easy as they say it is.  The preparation came to about 15x, when I weighed the leaf I ground up in a blender and compared it to the pile to be enhanced.  I used 91% isopropanol as a solvent (cheap and very easy to get).  I did the extraction in a thermos.  Took 2 days total.  I would say it worked very well, and it's cheaper than buying extract.  Anyway, onto the experience.</p><p>Please note, the trip was done without a sitter. NOT A GOOD IDEA.  The FAQ is right.  I got away with spilling water and a small burn on my hand because of this.  It could have been worse.</p><p>I ordered a small waterpipe from an online vendor (for 13 bucks) because so many people seem to get better results that way.  When my extract was ready, I thought I'd take some hits of it in the new waterpipe to test it out.  Usually, 6 or 7 hits of 5x extract only make me feel disoriented, so I expected very little -- just enough to let me know the extract was active.  Well, that's not what happened.  I loaded a pinch into the pipe, took a hit using a microtorch, and WHAM...  EXTREME disorientation.  It felt like a train hit me.  Well, I knew it was active!  I decided that I've come this far, might as well do another hit.  Then I realized I was no longer in my room, but in a dollhouse. !?>  I thought 'my god, this stuff is kicking my ass!'   I looked at the ceiling of my room, and saw rivers of color in the corners.  Complete open-eyed visuals.  It was very mushroom-like in that sense, but the Salvia had completely taken away my ability to move as I pleased (very unlike shrooms).  I was still thinking relatively consciously, but seeing something else.  I was on my bed, and I managed to crawl to one side of it.  </p><p>I looked at my room, which was totally unfamiliar at this point, still I knew this dollhouse-like place was indeed my room.  I crawled to another side (moving was an extremely difficult task), where I saw my waterpipe.  I looked at it with extreme respect, knowing that that pipe was the doorway.  I wanted to take a 3rd hit, as I knew that what lay in store for me if I could just take another hit was mindboggling.  However, I was so uncoordinated, there was no way.  As it progressed, I said aloud 'oh my god.. WOW' several times.  I saw an ocean form briefly on my ceiling.  Then I felt a presence in the room.  A dark ball of light (yes, an oxymoron, but I don't know howelse to explain it).  I thought it was my best friend, but upon harder thinking, I remembered that I was alone.  Then another thought came -- he should be here.  Perhaps it was the Salvia/my subconscious telling me I should not have done this alone.  Following that thought, the trip began to subside and I returned to sobriety, completely shocked.</p><p>Two hits of this extract did this to me.  I have tried 7 or 8 times for results, and this is what it took.  The trip didn't have too much meaning, and my mind remained slightly grounded, but the gates have finally been opened, and what this incredible plant has in store for me leaves me very stoked.</p>"
}
