{
 "title": "She Sang to Me",
 "author": "EntityEclipsed",
 "citation": "Citation:   EntityEclipsed. \"She Sang to Me: experience with Salvia divinorum (10x extract) (ID 88271)\". Erowid.org. Feb 13, 2011. erowid.org/exp/88271",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88271",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Feb 13, 2011",
   "Views: 3224",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nA bit of background:\r\nI have had experience with a few 'hallucinogenic' substances; namely marijuana and ecstasy. I had never 'tripped'. These experiences should not be compared to the effects of Salvia in my opinion. This drug is in a class by itself.\r\nThe setting:\r\nLate at night, at a trusted friend's house. Just him and I. We'll call him 'C'. In his bedroom, with a computer, and some Salvia.\r\nThe expectations:\r\nI really went into this thinking just what I had read: It was short and very visual and vivid. I had seen videos online of people smoking Salvia and decided it made you space-out for a couple minutes. Boy, was I wrong. Overall, though, I was relaxed and comfortable, if a little anxious.\r\nThe experience:\r\nC had packed the small metal pipe he used for visiting the 'Goddess' (Note: All of the information I obtained about 'The Goddess' was obtained AFTER the experience, and applied as read in my report). He told me to take 2 hits, holding the first for about 20 seconds, and the second as long as I could. The first hit tasted like... I guess what you would expect fish food to taste like. It wasn't pleasant. As I exhaled the first hit, I started to feel... different. I can't really place it. Perhaps a buzzing in my entire body and the feeling of anticipation. Like going up the first big hill on a rollercoaster.\r\nNOTE: The rest of the experience is described chronologically to the best of my ability. In retrospect, it felt as if all of this happened in a minute or two's time, but I had no concept of time while it was happening.\r\nThe second hit was taken, and held for approx. 30 seconds. As I exhaled the second hit, the feeling was (to use the former metaphor) like being blasted down the giant hill from a cannon. I immediately set the pipe down on the bed I was seated on and was immediately overwhelmed with the need to laugh hysterically. I laughed harder and more exuberantly than I'd ever laughed in my life. I instantly felt like I was pulled backwards from my body, but I still felt my body where it was on the bed. The best wasy I can describe it is an 'out-of-body experience'. I spent the rest of the 'trip' transitioning from my body to my spot behind the bed.\r\nI was still laughing hysterically, and C told me that my laugh was amazing, as he had smoked it with me. He was more experienced and seemed more in control of himself.\r\nThe drug seemed to make me feel heavy and it was hard to move or speak. I was yelling to C (who was 5 feet away) that I felt amazing and was in awe of the 'visuals' I was experiencing. I use 'visuals' loosely because I don't think I ever 'saw' anything with my physical eyes. It was all experienced with my mind's eye. I 'saw' shapes and colors I didn't know existed, all swimming in my periphery with the entire universe. I felt content and awed, and very absorbed in everything.\r\nI felt physically very high, somewhere way up above everything I've ever known, while still sitting on the edge of the bed. I was flying, and could see myself way below myself. (I don't know if this makes any sense)\r\nStill enveloped in hysterical laughter, I fell back on the bed, where a fan was blowing. The air moving from the fan felt like it was going to blow me off the bed, into the wall. I gripped the edges of the bed and yelled between laughs that I was going to be blown away. C thought this was hilarious and joined me in my delight.\r\nI started to become a little more grounded and came down from my second perch way above. I still felt an overwhelming sense of contentment and pleasure. C got on the computer and played one of those swirling color visuals, along with some music I didn't recognize. The visuals were amazing, and I was experiencing them in a new way. As if I was looking at something much deeper than colors and patterns.\r\nA song came on that I recognized, a Tool song (don't remember which one). I heard an amazing female voice signing along with Maynard, as if she was soothing me and telling me everything was going to be great, forever. I asked C if he could hear the incredible woman who was serenading me, and he simply replied with a smile 'It's the Goddess.'\r\nI felt a glowing presence in the upper right corner of the room, some entity who was there to watch over me. Trying to describe it is difficult, but I would say it was a golden glowing something that was there with us. I looked up and physically saw nothing, but was convinced my eyes decieved me and she/it was there, watching.\r\nI lied back on the bed, and felt the edge of the mattress move over into the center of the bed, as I melted into it. I was sinking down and assimilating with the bed, and it was wonderful. The universe continuted to swirl around me and speak to me, as if it were unveiling all of it's secrets for just me to know. At some point, I felt as if I were at the circus (though I've never been to the circus). I don't know how else to describe it...\r\nI started to return to baseline, gliding down gently from my amazing experience. We walked outside and smoked a couple cigarettes, enjoying the morning light from the rising sun. I looked out at the trees, and felt, for the first time, that I was really discovering and appreciating the beauty of nature. I felt enlightened and relaxed, and felt even better than before I smoked it. There were no negative effects, which is unlike any drug I've tried. I felt happy and content for the next few days.\r\nSalvia is unlike any chemical I have ever experienced and I truly think it's an experience everyone should have in the right environment. I would do it again, and plan to one day.\n\n\n"
}