{
 "title": "The Big One",
 "author": "Wakkd",
 "citation": "   Wakkd. \"The Big One: experience with Mushrooms, DXM, Cannabis, Alcohol & Methylphenidate (ID 8829)\". Erowid.org. Dec 15, 2008. erowid.org/exp/8829",
 "substance": "Mushrooms, DXM, Cannabis, Alcohol & Methylphenidate",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "16 tablets",
   "oral",
   "DXM",
   "(pill / tablet)",
   " ",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(plant material)",
   " ",
   "26 oz",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  joints/cigs",
   "smoked",
   "CP 55,940",
   "(plant material)",
   " ",
   "  ",
   "insufflated",
   "Pharms - Methylphenidate",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8829",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 15, 2008",
   "Views: 11626",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSetting the scene, Halifax Canada. I looked at my watch, it read 8:30pm. I was getting off in one hour. My friends and I were planning to get a huge buzz that Friday night. The plan was ingenious, my friends would start at 8:30 at the party location with their shrooms and I was to start at work with DXM. So at the appropriate time I started downing sucrets, which do taste a lot better than cough medicine. Ten minutes later I had finished my pack of 16 and went back to work. BAD IDEA.\r\nI was walking around the store when the feeling first started. A feeling that put a spring in my step and a smile on my face. That is until I had to help customers, trip out didn't have meaning to me until that point. They all knew, all of them, how, oh crap how. An hour later I was leaving the store with a bigger smile on my face, it wasn't that I was wacked, just that walking like a robot (one effect of DXM) seemed funny at the time. I could barely contain the joy I felt as I walked home. A big buzz awaited me, and it didn't waste much time once I got there.\r\nThe first thing I saw after walking in the door was all my friends staring blank faced at a wall in the dark (they had already taken their shrooms).  This seemed strange, but once they had told me that they were looking for a pulse one of them had felt in the wall everything made sense. So once we looked for five minutes, I decided it was time for phase 2. I downed 2 grams of shrooms and started on my 26 ounce bottle of Jack Daniels. This was a great mix, after 2 hours everything started blending together in an intense mix of incoherence. What a great time to snort a few lines of Ritalin my friend said to me. Once my rubber arm was sufficiently twisted....  SNIFF........SNIFF..... and calm and focus descended upon us. We were philosopher kings, it was great until we remembered our weed. So we started rolling while I finished my booze. \r\nAbout 30 minutes and 10 joints later the only thing real to me was the rhythmic tribal sounds of Enigma's 'Eyes of the Truth' blaring in the background. It was there I experienced my first technicolor roller coaster. The coasters cars were powered by the music, powerful tunnels of color and light (imagine stargate on acid) out of body experiences became less frightening as I pulled an 'out of dimension experience'. I felt so peaceful, I had no concept of the world, no cares, no problems, just the struggle to keep from plunging over the side, leaving the roller coaster's car. The big fall, the one you never quite recover from.\r\nAfter 2 blessed hours of this, my friends who were also feeling pretty good at the time decided to dare me to drink a bottle of cough syrup to increase the buzz. More DXM,  I can't...... Ouch.... Ouch.... damn that rubber arm. Gulp gulp gulp gone. I can't tell the story from experience from here on in. Lets just say my friends filled me in the next day. The rest of the night unfolded with my friends watching TV , and for me, well, it was the first time I had ever slept with my eyes open, sitting up in a chair looking at my friends. The only movement I managed was the occasional sigh from my 'SLEEP'.\r\nIt was a good time all in all. Just remember, if you are going to fall asleep wacked, you might as well keep your eyes open, you never know what you will miss at a party like that.\n\n\n"
}
