{
 "title": "New Product at Local Headshop",
 "author": "thatoneguy",
 "citation": "   thatoneguy. \"New Product at Local Headshop: experience with Products - 'Molly's Plant Food' (ID 88341)\". Erowid.org. Aug 8, 2011. erowid.org/exp/88341",
 "substance": "Products - 'Molly's Plant Food'",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "1 capsl",
   "oral",
   "Products - Bath Salts, Plant Food, etc"
  ]
 ],
 "footer": [
  [
   "2010",
   "88341",
   "Male",
   " ",
   "20",
   "Aug 8, 2011",
   "Views: 8280",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Bath salts', 'plant food' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  </p><p>Recently after going to the local headshop they showed me a new product called 'molly's plant food' not sure how much is in it, but the package contained one pill/capsule.  I have since taken this 'plant food' probably 8 times.  </p><p>I've only drank and smoked cannabis, other then that I've tried ectasy one time, and cocaine one time.  Neither of which hit me to hard, as things seem to not affect that well. Anyways in the times that I've taken molly's plant food I've got the best results in doing it with near empty stomach.  Each time I've done it I also record how long it takes to feel anything.</p><p>Almost every time (unless Ive ate recently) the effects can be noticed almost right at the 20 minute mark.  With this, sense of euphoria comes over me.  Seemed very similar to ectasy to me.  Moving the limbs/stretching feels very good, but my favorite thing to do is go to my room, put in my headphones and jam to some trance music videos. Quite loudly I want to note that I NEVER listen to trance, nor have I before until I tried this, but seems to be like 'sex' for my brain when Ive taken the plant food. Noticable effects always seem to last between 1-1/2 hours.  After that, I just feel good in the sense of being in a good mood. My pupils do dilate, and my hands get a little clammy.  But other then that nothing to crazy happens except feeling really good.</p><p>Ive experimented with taking one capsule, then after 45minutes or so taking another, I would not recommend this as I think its a waste of money.  The pills cost $15 apiece here.  When I'd take the second one, I did get a slight upper, but nothing near the feeling of the first one, and it doesnt last much longer so not really worth it. Also, of all the times Ive tried it now, none have felt near as good as the first.  So this will be the last time I take it.</p><p>I was able to talk and function normally, just was slightly jittery at my peak.</p>"
}
