{
 "title": "Not Worth the Negatives",
 "author": "Perry-Noid",
 "citation": "   Perry-Noid. \"Not Worth the Negatives: experience with MDAI (ID 88416)\". Erowid.org. Jan 28, 2011. erowid.org/exp/88416",
 "substance": "MDAI",
 "bodyweight": "80 lb",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "oral",
   "MDAI",
   " ",
   "100 mg",
   "insufflated",
   "MDAI"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 88416",
   "Male",
   " ",
   "Age at time of experience: 33",
   "Added: Jan 28, 2011",
   "Views: 16143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Having been there and done it with pretty much the whole list of well publicised illegals, I have been recently, along with my best friend who is a year younger, and about the same weight as me, been trying a few of the RC's. Enjoyed Mephedrone, Methylone, although the older I get the worse the after effects of fatigue and comedown etc. My favorite drug nowadays is Ketamine as stimulants really aren't too 'life-practical'.</p><p>Anyway, we thought we'd give white MDAI a whirl as the many reports I had read described it as a non-neurotoxic selective serotonin reuptake inhibitor, with empathogen qualities and no stimulant effect.</p><p>We had eaten lunch around 2pm, it was now 7pm, and we ingested about 250mgs each.</p><p>The come up was subtle, and we both described it as 'feeling giddy', about an hour after ingestion. We felt light on our toes, generally in a good mood, no euphoria, and no empathy. The feeling would intensify sometimes into what could be described as a rush... Only without the rush.</p><p>Music sounded good, but only for a while. Without the empathy and euphoria, it was very easy to find fault in everything, or not find anything satisfying. There was definitely a feeling of confusion, without the sedation I had read about. It was a lot like being drunk, only without the feel-good factor.</p><p>We decided to snort a small line each about 100mg to try and get to the next level  should there be one. The line was quite horrible to snort. Ive put a fair few chemicals up my nose, and this was not one I will repeat. Two days later and I am still experiencing discomfort. The extra MDAI enhanced the feeling we already had, but not sufficiently enough.</p><p>The feeling of almost being high, but not, proved to be a bit dull, so we decided to smoke a joint between us as well. After we walked around the building talking bizarre randoms, enjoying each others company, and having a good time, although I am absolutely certain this would have been the case on just the weed.</p><p>It was a particularly cold night/evening, and we went back to the apartment. </p><p>This is when the unpleasant side effects of MDAI started to demonstrate themselves.</p><p>We were both FREEEEEZZZING!!! The apartments heating was turned up to the max, the room was really warm, but we were both soooo cold. I could feel the heat radiating from my neck, face, underarms etc, but we were so cold. We sat in our coats, hats, earmuffs and gloves, anything laying around, trying to get warm. Then pretty much at the same time, we began to feel sick. Very nauseas. The sort of feeling you get when you have drunk too much alcohol, and everytime you close your eyes the room spins and you know its just a matter of time before you puke. The internal dialogue arguing the case for feeling better once you do etc.</p><p>We kept ourselves hydrated drinking hot water, not able to stomach anything else.</p><p>We were watching TV by this point, and both of us suddenly developed a terrible head ache In our necks. The pain went from the base of our necks - between the shoulder blades -  and up to about the skulls halfway mark. REALLY uncomfortable, totally freezing for what was hours now. We smoked another joint which didnt reverse the feeling, or have any effect at all, and continued to watch TV.</p><p>I was desperately tired, and feeling very unwell, but everytime I closed my eyes, the nausea came, and the pain in my head/neck made it very difficult to get comfortable, although by now it was 0200am and we were both feeling a bit warmer.</p><p>I did not get one wink of sleep that night. My friend managed a fitful hour. I lay wide awake as if I had been doing crank all night, felt really sick but wasnt able to puke, and then at around 0600am, had two hours of extreme hot flushes. I was suddenly so hot, I half expected to fit.</p><p>I gave up on sleep and got up at 8am.</p><p>The end of the story is, we both felt terrible that day and head/neck ache is still lingering now, two days later. I got some sleep the following afternoon. But working last night was not easy.</p><p>Summary of my MDAI trip:</p><p>1.\tWas ice cold for 10 hours without any way of warming up</p><p>2.\tHad the worst hangover-esque pain in my head and neck for three days</p><p>3.\tFelt sick for 18 hours, not be able to eat, or puke</p><p>4.\tStayed up all night feeling like complete and utter cack</p><p>5.\tHad a hot flush so intense I worried I might end up with brain damage</p><p>Yeah, great stuff. </p><p>I think for people who have never tried any good stuff, the pathetic high of MDAI might suffice, but in no way is it worth the downsides. It was probably the most ill I have ever felt on any drug I have ever taken.</p><p>Happy travelling.</p>"
}
