{
 "title": "2-Close-Death",
 "author": "S.hawking",
 "citation": "   S.hawking. \"2-Close-Death: experience with 2C-D (ID 88425)\". Erowid.org. May 27, 2012. erowid.org/exp/88425",
 "substance": "2C-D",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-D",
   "(powder / crystals)",
   " ",
   "  ",
   "insufflated",
   "2C-D",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 88425",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Added: May 27, 2012",
   "Views: 3207",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One night I was having some drinks and decided I could go for a bit of blow. so I called a friend and he said, well I dont know where that is but I got some of this yellow stuff. So I asked him for a taste test. Not knowing what I was gettin myself into, I licked my whole finger tip covered it in this powder and said 'well that aint molly'.</p><p>So then for some reason that wasnt enough so I figured Id do a one inch rail(insuflate). I think I shoulda let the first 100 or so mgs kick in. So I did it and man was that a bad idea. Instantly my nose felt as if it caught fire and then the whole world spun around me and I was suddenly lost in my own head. Then it seemed as if I was trapped in a k-hole. </p><p>Nearly blind all I could see were mathematicaly perfect geometric shapes and the faint static outline of my friends around me. Then I turned to the guy who gave it to me screaming 'what did you give me' 'what did you do to me' 'Im goin to kill you'. By this point I could no longer breath and collapsed. I hear people say should call the ambulance (they did not) and everything started spinning again. I then crawled to the bathroom and puked a lot. Then came the blood.  Huge red chunks (maybe stomach lining).</p><p>So then my friends put me to bed and I passed out having the strangest dreams. Or maybe I wasnt sleeping I could have just been tripping realy hard. I remember being a rinocerouc being tranquilized, then I seen more shapes.</p><p>Now its been like 6 hours and Im in bed holding my kitten and he was in two places at once like litaraly.  His tail end was on one side of me and through some weird portal his head was on the other side (just to be clear he is alive he did not get hurt) I would watch him run and jump and it was like he would be in one spot then teleport to another as if jumping through black holes. Needless to say my world was upside down. I questioned everything I knew about physics. Up was down, If I dropped something I would see it float upward.</p><p>Into the wee hours of the morning I was still madly paranoid and hallucinated til 2pm. I was tasting cotten candy and having electric lips until 6pm. </p><p>So I did some serious damage that night. Im still seeing trails as I type this (it happend yesterday)</p><p>So is it a good chemical? Yes its amazing. But I shoulda been more careful with it. I had way too much. Thankfully Im alive.</p>"
}
