{
 "title": "Energy Motivation with OCD and ADHD",
 "author": "PsychonautRN",
 "citation": "   PsychonautRN. \"Energy Motivation with OCD and ADHD: experience with 4-Methylmethcathinone (Mephedrone) (ID 88574)\". Erowid.org. Jan 28, 2011. erowid.org/exp/88574",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "108 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "4-Methylmethcathinone",
   "(capsule)",
   "  T+ 1:00",
   "50 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "88574",
   "Male",
   " ",
   "24",
   "Jan 28, 2011",
   "6692",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>24 y/o male in good health, extensive experience with plants, fungi, chemicals, and pharmaceuticals. Only prescription meds are a DHT blocker, 50K IU vitamin D twice a week (deficit from the night shift?), and Ambien once or twice a week. Last dose at 2 am (22.5 mg) with no lasting effects.</p><p>Been without MDPV for a week after almost a week of daily use (and 3 months of less frequent use before that). Not counting what I snorted off a pair of shoes last night. (\n</p><p>Set: Today is my birthday. I haven't made plans, bored but in a neutral mood. Still not myself after the MDPV but feeling better every day. Bought this on impulse, tried it once before at a dose I don't recall, insufflated. The contents of this purple '500 mg' jar weighed in at 350 mg. Grr. Made 3 gelcaps of 100 mg and 1 of 50 mg, read what I could, and decided to start with 100 PO.</p><p>1700: Haven't eaten in 6 or 7 hours. Took 100 mg fine white powder in a gelcap with water.</p><p>1800 (T + 1): Nothing. HR in normal range. Insufflated 50 mg (25 each nostril). Not much of a burn, easily tolerable, sort of a sweet smell/taste. A peppermint completely masked the taste of the drip.</p><p>1815 (T + 1:15): Tachycardia, rate around 120 while sitting.</p><p>1830: 1.5 hrs post oral dose, 30 minutes post nasal redose, starting to feel it. There's the need to talk, text or IM, talking to my fiance who's in the room. Writing a to-do list. Heart rate still elevated. Kind of like MDPV without the edge, stimulated but not wired or edgy.</p><p>1850: Still getting stronger. Need to move.</p><p>1900: Still up and on, very productive, more productive than I've been in months! Trying to make best use of this while it lasts.</p><p>1940: Still stimulated but feeling more 'smooth.' Less urgency. Making lists. Lots of lists. Starting to feel rather OCD and compelled to write things down -- no short term memory without these lists.</p><p>2030: Feeling very social. Writing resolutions for 2011 -- 25 days early. Palpitations (nothing terrible), tachycardia, but feeling good. Spoke on the phone with my little bro. We don't speak often and I'm usually on something when we do so I'm not worried about sounding 'different.' Feeling much more open and emotional than the usual closed and numb. Mind is going in too many directions. Lots of energy, motivation, and ideas, which is useful for getting things in order, for planning. But not practical for productivity.</p><p>2045: Jumpy, flightly, very OCD. Good focus and energy but lack the attention span to direct it at any one thing.</p><p>2200: Resolutions got me thinking about gratitude, called my mom who knows I've recently quit MDPV (though I told her 'It's like Wellbutrin, just stronger'). She makes me aware that she's in the car with my dad (a hint because he doesn't know my history) which also tells me she either knows I'm on something or thinks I'm manic. Was on the phone for 50 minutes, talked to them both, am grateful for the chance to really express how grateful I am for everything they've done for me. Excess energy, pacing the floor, writing things down as I speak. Plans, lists, resolutions.</p><p>2240: Still feeling very sociable, very stimulated. Told my fiance what I've taken after she commented on my energy, surprised she hadn't recognized that I'm in an altered state. Much more sociable than usual.Tachycardia, palpitations, jumping when touched (even light, anticipated, repeated touch). Got a lot of wedding planning done. She gave me an oracle card reading and I covered a sheet of paper in tiny writing while listening, more lists. Hard to focus. Had to ask her to repeat things.</p><p>2315: Definitely feeling it still. Mild palpitations. They've been coming and going. Feels like energy gets redirected to the GI tract if I sit still too long. Noticed this with other stims. Wondering how long before I'll be able to sleep tonight. First signs of hunger: strong 'empty' feeling and esophageal dilation, but no desire to eat. Mouth is dry.</p><p>2335 (T + 6:35): Just took a shower. Still very OCD. Making lists, with additional lists to clarify those items which can be broken down further. Noticed that the toenails and knees are a bit bluish or purplish. DP pulse absent (or maybe I just couldn't find it). Capillary refill is slow but present at the toes, both feet. Resting pulse is 108, radial pulses weak but present and regular. First glass of water since 1700 -- a stupid thing to neglect. I'm a little apprehensive because I don't know what coming down will be like or when it will begin. I'm gonna try to rewrite and prioritize my massive to-do list until then.</p><p>Overall, huge increase in insight, creativity, and motivation. Brightened my mood, though not quite euphoric. Felt the need to organize things and plan and talk to people. Tachycardia, vasoconstriction, mild palpitations. Attention span went down to 15 seconds at best.</p><p>I'm glad I started with a conservative dose and did this at home. Might be useful for increased sociability, but very hard to sit still and focus, so maybe not. Next time, will either wait longer before redosing or start by snorting 50 mg. Avoids waiting for the onset and redosing too soon, decreases the amount (leaving more for later), and if it decreases the duration then I don't mind.</p><p>0025 (T + 7:25): Resting HR now 88. Palpitations, mild enough to ignore. Cold fingers. Still stimulated but it's a slow, easy comedown so far. Hungry but not hungry enough to motivate a trip to the kitchen. Losing the motivation, sociability, and OCD. Attention span is increasing.</p>"
}
