{
 "title": "The Night I Surfed The Ivory Wave",
 "author": "LightShadows",
 "citation": "   LightShadows. \"The Night I Surfed The Ivory Wave: experience with Products - 'Nightcap', 'Bath Salt' & Damiana (ID 88613)\". Erowid.org. Feb 19, 2011. erowid.org/exp/88613",
 "substance": "Products - 'Nightcap', 'Bath Salt' & Damiana",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)",
   " ",
   "1 bowl",
   "smoked",
   "Damiana",
   "(plant material)",
   " ",
   "500 mg",
   "oral",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)",
   " ",
   "1 bowl",
   "smoked",
   "Damiana",
   "(plant material)",
   " ",
   "1 bowl",
   "smoked",
   "Damiana",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88613",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Feb 19, 2011",
   "Views: 21306",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  </p><p>Strong language is used and I apologize in advance if it offends anyone in anyway I am just expressing myself and I am a very open minded calm person I feel as if strong adjectives are not necessary, but will rather help describe the experience I underwent and to better inform you, the people, about it.  I am just trying to express and warn you, the people, about what I went through so that others may learn from my mistake and wont have to undergo the misery and pain I went through doing this horrific drug, and to describe to you, the people.</p><p>The night I surfed the Ivory wave, was the night I thought I would meet my grave.  As I walked into the gas station I used to go to in Metairie, LA, at least twice a day for a while, I greeted the clerk and asked him for the usual 1 gram of Blackjack (100% Damiana Leaf) for thirteen dollars.  He informed me that he had a new product in and this caught my attention because I am very curious to try new things.  He pointed to it and it read Nightcap 500mg, he told me you grab any old drink such as a PowerAde or Gatorade and to pour the contents of the bag into the bottle take a few sips or drink it until you get the Euphoric or High feeling he said if it starts to wear off within 3 hours drink more. Now Im thinking to myself this has got to be the biggest rip off in the world what in the world could be in this stuff that you dont smoke and it gets you high for three hours?. Well curiosity got the best of me and I bought the 15 dollar product I drank half of it at my friends house and I had become frustrated because I did not feel anything at all and thought wow what a waste of money.</p><p>We drove around the block and smoked a bowl out of a steam roller of the damiana leaf (Blackjack). After the first hit I still didnt feel anything, at least so I thought, after a few minutes I felt amazing, and I had a feeling of Euphoria, I had never felt anything like this from smoking damiana so I knew it was the nightcap kicking in because I had forgotten about a little thing called digestion. Now to inform you I have Chronic Pancreaitis which is extremely rare for an 18 year old to have and the chronic pain I always feel in my Pancreas and GI tract went away. This only happens when I smoke marijuana and unfortunately Im on probation.</p><p>That night my friends and I had extremely good heart to heart conversations.  It made me very talkative and very friendly, I had the ability to walk up to people I had no idea who they were and could hold conversation with them and generally Im a shy person, and it also gave me a massive erection. It also gave me a speed like high because I was talking very rapidly, sometimes my friends could not understand what I was saying I was talking so fast.  The nightcap gave me a very clean high, I went on it feeling good and I went off it surprisingly feeling great. I also realized my heart rate had increased a little bit.</p><p>The next week I went back to the gas station and greeted the once again and he told me that there was yet again another new product a substance known as Ivory Wave Bath Salt and it was the same dosage as nightcap at 500mg, the difference this was labeled at 30 dollars for 500mg and he told me since we were cool he would give it to me for 15 dollars so just as any normal person, curiosity yet again got the best of me ,and I bought it, what a bad choice I had just made and little did I know I would have to pay the price for it later.  When I opened the container I looked at it and looked at my friend D, who is in my passenger seat, and said this looks like light brown granulated cocaine or something and D laughed and said yea thats why Im sticking to nightcap tonight, my friends dont wish to experience new things like I do I guess you can say if it worked well on me then they would want to try it, they call me the test subject funny right?</p><p>Well anyway I poured all 500mg into a drink and it tasted like garbage.  The nightcap I had drank the week before I could not taste it at all, but this shit was just nasty.  It tasted extremely strong, but me being the ignorant 18 year old that I am and having the mentality of a stoner to getting a little jiggy again I drank the whole thing in about 30 minutes and then went and smoked a bowl of blackjack out of the steamroller and..OMG I said to myself this is not the same as nightcap. I felt like I had just snorted a line of coke, while hitting some crystal meth, and freebasing some crack, because I suddenly had a crazy surge come over my body, a rush, and not only was I Chasing the dragon, but they were chasing me about 10 of them as a matter of fact.</p><p>I was seeing a lot more shit then just dragons, as I sat in my car at the Point (a place us teens go hang out at sometimes if were bored) and I was looking across the lake and you can see the causeway bridge from there but when I looked at it I thought cars were somehow driving off of the causeway and over Lake Pontratrain and running in to my car and going right through my truck and through my stomach. Right as this was happening my Pancreas became enflamed and I had to sit in my seat leaning forward to stop the pain. Now the causeway is a good 30-50 miles away from where we were at but its the longest bridge in the world so its really hard to miss and at night its lit up.</p><p>After that little experience I got out my car and went to stood next to my friends and I could have sworn five feet in front of us were cops running right at us, yeah VERY bad Paranoia and hallucinations that were insane and intense. I wish I could recall some of them but it was that hard of a trip. Anyway I got back in my truck feeling terrified for my life and my friend D came and sat in there with me and A, his g/f, got in the back along with this kid, well just call him cry baby, and this other girl (dont rember her name) got in next to him.  D, crybaby, and I began to smoke yet another bowl. I usually never spin out or get bad highs so thats why I smoked again even though I was already tripping really hard, same goes with D, but not crybaby no one really likes him because hes weird and he follows people, but he took one hit and as my friends and I would say he Camd out which just means he could not handle the smoke anymore which is fine.</p><p>After that the Crybaby and the little girl he was with got out of my truck and I do not rember what happened to them all I rember is looking up after chose a song to listen to (I believe it was Hit Em up, by Tupac) and I looked up and they were gone.  Poof just like that gone, but no where as near to gone as I was because I was OUT of it. Lets just say my head was in the sky and I was so high that I could give Jesus a high five, I have a tendency to rhyme sometimes, sorry. Any way we left at about 12:30 or 1:00A.M. after a cop drove by and shined his light in my car and went about his business and about after 10 minutes of me arguing with D and A to give me the steamroller because more cops were coming, I was positive of it, well you know it was bad because the steamroller was in my hand and they had told me that about 5 times yet I persisted that I did not have it and when I finally realized I did in fact have it I passed it to D and he put it under the seat.</p><p>After we left the point we went to the Boat Launch (about 20 minutes away from the point). I pulled in and met my friend R, M, and T, but we never got out to greet each other because the cop that was parked in the main parking lot drove up behind us and proceeded to drive up and down the parking lot, I had assumed he wanted to run us out because he kept driving back and forth behind our parked cars and I caught a glimpse of the word K-9 on the side of the car, (I thought I was just hallucinating this, but was reassured I was not by my friends) and I started freaking out because I had a few nightcap packets and a couple of pieces of paraphernalia in the car.  We left the Boat Launch at about 1:20 A.M. and we got about 5 minutes away from where we were and caught a red light and guess what here comes the K-9 cop, pulled right into the parking lot next to the red light I was stuck at and there was a cop behind me as well. People say weed makes you paranoid, well lets just say marijuana does not have shit on this paranoia feeling I was experiencing and I knew these werent hallucinations because my friends yet again reassured me that they saw them too. It was very difficult for me to drive on the Ivory Wave, it was also difficult for me to function properly too, and the hallucinations I saw looked very life like.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>Well we got onto the interstate and thats when it began to get worse everything was moving so fast and moving side to side. If you have ever seen the documentary film, called Most High about a man who becomes addicted to crystal meth, the scene when he is driving on the interstate and his perception is basically shot to hell, well thats how I saw everything basically exactly the same as he did. Basically everything was blurry, and I was very speedy, also everything was moving side to side very rapidly and things began to partially melt. I felt extremely paranoid and began rambling on about the cops again and how I was almost 100% positive the cop knew where I lived and he was going be waiting for me at my house or waiting around the corner waiting to nail me for anything he could.  I even put 20 bucks on it, but luckily my friends are not douche bags and they knew I was just out of it and didnt make me pay up.</p><p>When we got back to my house D and A got in As car and went back to Ds, I chose to stay home because I felt so wired, I went inside and talked to my mother from about 2:00 A.M. till 5:00 A.M. My mother and I are best friends you could say, weve been through a lot of bullshit together that honestly neither of us deserve especially her and if you are reading this, I Love you Mom! I went upstairs and I was lying in my bed with the lights off and I thought Dragons yet again were flying in my window, crawling on my wall and eating me.  I thought spiders were running on me as well and I tried to kill them, but obviously nothing was there. I thought well maybe if I smoke some more it will knock me out.. Well I was wrong.</p><p>Prior to this experience I would smoke Damiana to help me with insomnia and it worked, but not with the ivory in my system. Instantly it brought the Meth, crack, and coke feeling back again and the intense hallucinations also came back and they didnt knock on the door this time or ask to come in, they just charged right on in and they came in hard.  I saw cavemen hitting each other over their heads with clubs on my TV (and it was off), I saw an assembly line of tiny Gorillas flying around my head, and for about 10 minutes I stared at a blank piece of loose-leaf paper and thought cartoons were being played on it.  As I was sitting on my couch in my room after about 10 minutes after I smoked I heard my door trying to be forced open (hallucination) as well as I heard my father screaming my name and I thought it was coming from outside my window. He passed from lung cancer the day after my 18th birthday last April 3rd 2010, I Love and miss you Dad!</p><p>I obviously knew that this was also a hallucination, but I still looked out the window hoping to see him and it was about 6:00 A.M. and I did not see my father, but I could have sworn I saw my neighbor across the street pointing a .12 gauge shot gun at this man who had done garden work for him, so I ran downstairs and as I was running down the stairs I heard shots and a loud thump. I went outside and of course no one was there. My mom sleeps on the couch in our living room so when she heard the door close behind me she woke up and came outside, my mother became suspicious I had done something else as well as smoke that night when I began to ramble on about how that asshole killed him and brought his dead body in the house and that I told her to call the police and when she asked Why I said because that prick just shot his Gardner and dragged his body inside you dont see the blood all on the driveway? She looked at me as if I was insane and I realized I was hallucinating yet again.  O fuck I thought to myself and started to walk back inside. O yea I forgot to mention I dont know about snorting but when consumed through drinking its like fucking truth serum. Well I began to  pour out my emotions and all that good stuff which resulted in me telling her what I was really on, I was so wired and was speeding so fast and it sounded like I was drunk as well, so hold on a minute and picture this, a rapid talking drunk whose eyes are dilated to where you cannot tell that they were blue and they were red as can be and well, Thats me!</p><p>After this little dilemma I went upstairs and layed down in bed at about 6:30A.M. And guess what? I had work at 10:00 A.M. (in four hours) and I was tripping my ass off still, I had to call in sick and didnt go to sleep until about 2:00 P.M. the next after noon.  It would hurt to keep my eyelids closed which resulted in me lying in my bed wondering when I would be able to close my eyes. So on hour 30 of no sleep I felt like my brain was fried or a better term zapped; I would slur words very badly and fumble up words and could not get out what I wanted to say no matter how hard I concentrated on saying it and I thought at the time that I would be like that the rest of my life in the state of word fumbling and word confusion I also was talking in a different tone than I usually would. When I say word fumbling I mean for example I would say mop instead of broom, or plane instead of car etc.  I managed to somehow stumble to my laptop and preceded to Google Ivory Wave Bath Salt.and guess what? Well if you already knew or you somehow guessed and I kid you not when I say I bought synthetic cocaine-like drug from a fucking gas station!!! I had watched a documentary about the use of Meth in America the day before ironically and the high I had was comparable to meth from what I saw in the video.</p><p>I didnt really have a comedown I just didnt sleep for 35 hours and my brain was fried from not sleeping. I guess you could call it a comedown because I felt pretty shitty. I also noticed my heart rate drastically slowed down as I was laying in bedto the point where I could not feel it beating anymore.I began to wonder that if I would see my dad soon and thought I was going to die and I felt it begin to beat yet again.  I finally went to sleep at 2:00 P.M. Sunday afternoon and woke up at 4:00 P.M. and I did not get much sleep the next night either which resulted in me missing class so on Monday so that I could sleep all day. And thats how the night I tried to surf the Ivory Wave, I got caught in the under toe and almost drowned..</p>"
}
