{
 "title": "Skating on Thin Ice",
 "author": "bombodil",
 "citation": "   bombodil. \"Skating on Thin Ice: experience with LSD (ID 8865)\". Erowid.org. May 13, 2004. erowid.org/exp/8865",
 "substance": "LSD",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3 tablets",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2001",
   "8865",
   "Male",
   " ",
   "Not Given",
   "May 13, 2004",
   "4967",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Skating on Thin Ice</p><p>This is a rewrite of a dream labeled 'Lousy Dream Lived Out with LSD' posted elsewhere.  I choose to rewrite it because that report was written approximately five hours after the dream ended, and was my attempt to solidify the events of the night, it does not focus on what I learned that night. At that point, I had no idea just what I'd learned that night. Of course. </p><p>At approximately 9:00 PM I injested 3 microdots. I had taken two of the same distribution on a previous night. Call it the magical wheel of dosage, I chose to take three. :) Me and a friend who was not on anything at the time travelled over to a friends house and I parked and locked up my car, putting a note on my steering wheel reminding me not to drive until 5AM the next day. I have never had to read this type of note to avoid doing something stupid, but I write them to make myself feel better. </p><p>We sat comfortably in the basement as I began my space-out. About an hour and a half later, the people I was with decided they were going to visit someone else who lived outside of the town we were in. I decided I would be better off going along with those I knew than walking around town looking for someone else I knew to spend my time with. It can be a long night by yourself if you're not comfortable and at home. </p><p>I hitched a ride with two people I did not know, and I spent the ride mostly watching the interior lights of the car. When we arrived, I had not realized how many people who I had never seen before would be there. They all seemed friendly enough and after sitting at the kitchen table for a while I went into the basement to have a look at the musical equipment that was down there. A complicated system with a large stereo being monitored, sampled and equalized by a computer. I sat for quite a while in a chair tuned into the music. It was almost hypnotic, I can not describe it and I wonder if I would recognize it if I ever heard it again. I can not remember a single thought from this period that was not related to what was going on around me. I kept reaching for my pack of cigarettes but didn't manage to make it all the way to smoking one for quite a while. I was sitting there simply blown away. After a while people started to go upstairs and I chose to go with rather than sitting in the dark basement in a house owned by people I didn't know. </p><p>Before I went upstairs, I spoke to a group of people I didn't know who were sitting in another lighted section of the basement. I said hello and they replied in kind and asked how it was going. It was an effort to say 'I took three microdots at nine oclock and I have no idea what's going on.'. It felt to me like someone was rapidly pushing a reset button in the back of my head. Thoughts came and went, trying to hold on to them was totally useless. A young man sitting at the table replied 'That's ok, you don't have to know what's going on.'. I laughed, said thank you and went upstairs. I appreciated and appreciate that very much. </p><p>We sat at the kitchen table some more, and a friend rolled a huge joint. I smoked it with them, just because it was what I would usually do. I talked with drunk people I didn't know. I told everyone that I had a personal conversation with that I was on LSD, and to please excuse me if I was acting strangely. I am sure I was managing to act fairly normal, the energy buzzing beneath my skin was amazing. It was a concious act to keep from gritting my teeth and tightening every muscle in my body. </p><p>People went out on the back porch and played some hack. Normally I'm able to play well enough but didn't quite feel up to it. :) I followed because most of the people I knew went that way. A friend kept urging me to play but I didn't quite feel up to taking my feet off the ground. A few minutes later the people in the room stopped making sense. They would talk almost constantly but with disconnected words or short phrases, I must admit it was all fairly stupid and I can only assume reflects upon my thoughts on those people. </p><p>While I knew I was tripping, I had never before hallucinated in this manner. All my hallucinations had been gentle and interesting and had not included people at all. I decided that everyone was playing a trick on me. (Great idea right?) I had an idea that it had something to do with the people that had been playing music in the basement. I waited for a while for them to give it up, said 'you people are crazy' (hehehe) and walked into the kitchen. People continued to talk nonsensically and someone in the kitchen said a rhyme about Jesus Christ (Christian religious figure) to the purpose of him being blessed with the spirit of god, coming down to earth and having nothing to do but 'piddle de ding dong dingus'... </p><p>At this point I was starting to get a little scared. I went down a hall looking for the door, and talked to a young lady who I did not know. I told her about my problem, but she did not understand. I did not use the correct words, because there are no words to explain the manner in which people were talking. She asked me if I needed help, needed to talk to someone, and I replied that I did not because I had the strong feeling that she was talking about police. I decided I needed to leave the house, go outside and chill out. </p><p>I believed that everyone was playing a trick on me. I was displeased about it (I was rather disconnected from emotion at this point.) and decided to walk down the street in the direction I guessed was home. I had never had problems deciphering reality from hallucination while dreaming of LSD and chose to stick to my guns. I began walking down the street in the direction I guessed was home but then walked back, deciding that I was not going to let anyone trick me into getting myself arrested on the long walk back to the town my car was in. I sat on the porch waiting for them to come outside and end the game. I began to wonder if I wasn't passed out somewhere and all this going on inside my head. (Another bright idea.) A short time after, my friends going back to the town my car was in came out of the house. Too short I thought.. </p><p>Unfortunately, they were still talking garbage. People got into their cars and I asked one of my friends where we were going. He urged me to get into the car I had come in. I decided this was a good idea and did so. I thought that they would just drive me back to this house after driving around the block a few times. I asked them to stop the car so that I could get out. The driver said 'ok he has 15 seconds to get out or I'm taking off again'. </p><p>This was a critical choice: A thought that just kept on recurring to me was: 'If I stay here, nothing ever happens...'. </p><p>I got out and began walking home without another word. I had never been to this house before. I had no real idea of where I was. As I walked I thought of the two possible explanations I had thought of before the people came out of the house. One being that I was tripping and that people had played a cruel trick on me, the other that this going on inside my head. That I would live forever in this strange world where everyone talked garbage and went no where. My hell for a mistake. I had yelled loudly in the driveway when this thought occured to me. </p><p>I believed that one of these two things could be happening and that my choosing the correct path back to the town in which my car was parked was connected with my returning to my reality. Believe it or not, I followed the roads that seemed more lighted, even after I had left the residential areas and there were no street lights. I followed the path that occured to me first. I decided that I would simply walk until I came down, and ask directions then. Or if I got lucky and got home, so be it. </p><p>As I walked, I worried about what was actually going on. I thought for a while that I should stop and spend the night in a grove of trees. I had to be home sometime the next day and so I decided I had to get to my car that night. I thought I would go (?) insane if I did not keep moving. I decided to rid myself of my paraphenalia, and to put my drivers license under the insole of my shoe. </p><p>I decided that I had decided what I was going to do, so I had better just stop worrying about it or I was going have bigger problems. I decided to count 1,2,3,4loop as a way of keeping my mind occupied. After a while I noticed that I had timed my counting to my breathing, a short while later I noticed that I had timed my steps to my breathing. After that it became much easier to walk. I later learned that this is a Buddhist practice: walking meditation. A good book on walking meditation is 'The Long Road Turns to Joy', written by Thich Nhat Hanh. </p><p>I had many thoughts over this period of time, but I let them flow by me. I held onto the only rock I had, which was not to think at all. The unfortunate result: many of these thoughts are buried deep in my memory. Every day new thoughts from that experience return to me. Over this period of time, my reality and who I was faded till it was just a memory. I did not think of my name at any time during this trip, so I do not know whether I knew it or not. I believed that if I forget my reality, I would not go back to it at all, that I would be stuck in the nonreality that I was in for the rest of my life. </p><p>After a long period of the walking in this manner, I experienced a blip. My everything was ripped away for a split second. I recognized that reality was more my creation than I had ever realized before, I saw the death rebirth process. Everything was quiet, and I looked about the void. I saw nothing around me, and thought 'Well... What now?'. I saw a point of light in the unimaginable distance, it moved towards me with immeasurable speed. As it approached I recognized that it was immeasurably large. It approached till it engulfed me and I was slammed back to reality. </p><p>At the time, I did not know or did not choose to think about what had just happened. I felt only relief. I knew I was coming down, that I would be ok. I spent the rest of the walk thinking as little as possible. All this happened on my way to the freeway, I did not know if I was north or south of where I was trying to get and went the wrong way up the freeway for a good long time. I stopped at a populated exit and asked directions. I hitched a ride from a trucker just before daylight. I appreciate that immensely, the warmth of that cab was extacy after my walk in the cold. To this day I pick up hitchhikers, just to give back a little. </p><p>When I got back home, I went to sleep shortly after writing a report of this and posting it to another website. Four hours later, a friend who lived in the area dropped by and walked into my bedroom. I looked up and he said something I didn't catch. He seemed to move a little too quickly into the room. I jerked up and awake and drop kicked the young man out of my house. :) I followed him outside and told him that it was NOT a good time and not to call me, I would call him later. </p><p>All in all, I tripped for approximately 9 hours. I have a crystal clear memory of everything that went on, although I imagine that I will be piecing together my memory of my thoughts for the rest of this life. As closely as I can calculate I walked 25 miles that night, the soles of my shoes are almost completely flat. For approximately 2 hours I exhibited the sensory input and thought patterns of a paranoid psychotic. At no time during the trip did I lose control of what I was doing, the fight was to control my thoughts. The trip was at no time bad or good, it just was. I spent every moment after I left that room in emergency mode, thinking only of what I needed to do to be as safe as I could. </p><p>The reality fracture that I had that night is as real as anything I have ever experienced. I was forced to choose a direction, but didn't really know it at the time. In the end I chose a very unique path. All through the time that I was at the house and with the others I felt the strong presense of other higher beings. They spoke to me through the movements and words of those around me and through my thoughts. Occasionally, I would get a reoccuring thought that was usually a statement. 'If I don't go, nothing ever happens.' etc. It seems to me that I thought clearly throughout, but that the problems remained. I am not implying that the silly and incorrect thoughts I had that night were placed in my head, but that I was able to choose to think above them... Or not. </p><p>For about two weeks after that experience, I could see any situation from an infinite number of points of view. One was not any more or less real than any other. Some were plausible, some were not. I had only to choose from the ones that seemed most correct, the ones that I wanted. At the time that I am writing this report, things have solidified. </p><p>A lot of my problems with people have simply dissapeared. I am left with the habits of my old thought. I have a long way to go before I complete what I started that night: the raising of my conciousness. It is a constant battle for me not to slip back into my old ways of thinking. </p><p>As of the writing of this report, my ego has reattached itself stronger than ever. It has started to overshadow the surety that I had. Fortunately, it now yells and screams so loud that I can often recognize it for what it is. It's going to take a long time to break down the imprinting of a life time and return to balance. </p><p>I stood on the edge of my world and looked off. Every choice I had that night corresponds to a way of thought, and I believe that I chose the only one that would let me see correctly. One thing I know, if I had chosen differently, I would never have known that I had chosen incorrectly. Whichever way you go, you 'know' it's the right way. </p><p>My life is changed, I am changed. I am unbelieveably lucky, in that the change was for the better. I'd like to thank everyone who helped me to see the experience correctly. They have opened up many doors for me, gently and persistantly helping me to see the only way to deal with this experience. Things still might have gone badly for me in the end, had I not had help. As it stands, I have no worries. </p><p>There is a lesson in this for everyone who has not learned it already. LSD IS NOT A TOY! I have only taken LSD five times in my life, each months or years apart, and this dream has shaken me to my core. It doesn't take much, it's entirely unpredictable. LSD dreams can be used to remove clouds from your eyes, and they can be used to reinforce ways of thought, and they can be used to build huge new clouds in front of your eyes. If you use it in a setting that causes you to think in a certain way, you will create thought habits that keep you thinking that way. You can not escape being changed by an LSD dream unless you know exactly what you're doing, so make sure that you change for the better. </p><p>'If you should go skating,</p><p>on the thin ice of modern life,</p><p>dragging behind you the silent reproach,</p><p>of a million tear stained eyes,</p><p>don't be surprised when a crack in the ice,</p><p>appears under your feet.</p><p>You slip out of your depth,</p><p>and out of your mind,</p><p>your fear flowing out behind you,</p><p>as you claw the thin ice.'</p><p>Alright, I couldn't help the quote. I've always been into Floyd, and all the meanings in Floyd's albums have flip flopped since I dreamed this up.</p><p>Happy trails folks!</p>"
}
