{
 "title": "The Day I Was Going To Die",
 "author": "Nickster",
 "citation": "   Nickster. \"The Day I Was Going To Die: experience with Spice and Synthetic Cannabinoids ('Space') (ID 88761)\". Erowid.org. Jan 14, 2011. erowid.org/exp/88761",
 "substance": "Spice and Synthetic Cannabinoids ('Space')",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88761",
   "Gender: Male",
   " ",
   "Age at time of experience: 15",
   "Added: Jan 14, 2011",
   "Views: 5592",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hello, my names nick. I have been smoking space,spice,K2 products,ect, for about 5 months. Everytime I had done it, it had been pretty nice and relaxing......untill this day. So my friend had made about 2 ounces of some spice using marshmellow  leaves and a gram of JWH-018. I had been smoking this for about two weeks prior to my horrible expierience. I had ran out of the home made spice and decided to go buy a gram of 'Space' ,and had decided to save it for the next day when I would go to the lake and chill with my friend chris. The next day I had opened my brand new gram of Space incents and loaded a fat bowl while at the lake with Chris. He doesnt smoke. Thinking it wouldnt get me that high, I chiefed a whole fat bowl cashing it in 2 hits. The high hadnt hit me yet so I decided to load another fat bowl. Again.... I chiefed on it cashing it in about 2 hits again. </p><p>I started to feel the high come on, and as soon as I did, I had realized I was the highest ide ever been in my whole entire life and that I completely fucked up. Feeling my heart going a million miles an hour, I thought I was going to have a heart attack and die right where I was sitting on the bank of the lake. My vision started to vibrate and blur and everything seemed 3D to me. About 20 minutes later I was tripping balls. Trying to hold on to a thin thread of life that I felt was being pulled away from my body. As soon as that happened I felt a massive amount of guilt come over me and started having memories of my childhood. All of a sudden I had a glimpse of a car crash that me and my whole family had just got in and my mom and dads mangled bloody body sitting in front of my eyes. At that moment I decided that I was going to die right now. An extreme surge of pain shot up my left Jugular vein and everything turned white. I though I had just died at that exact moment until about 10 seconds later everthing came back to me. </p><p>I grabbed my friend Chris's arm with a tight grip and told him I was tripping and that I was going to die. He told me to relax and take deep breaths.... So I did. Still feeling my heart racing I started getting scared again. So I took some more deep breaths and drank a mountain dew.... I continued taking the deep breaths until I felt the horrid high start to wear off. I went home about 2 hours later and decided that I never wanted to do it again because I knew that if I did do it again..... I wouldnt survive it the next time. I got rid of my piece, lighter, and eyedrops and planned to never do it again.</p>"
}
