{
 "title": "High Dosage Orally",
 "author": "MTB",
 "citation": "   MTB. \"High Dosage Orally: experience with JWH018 (ID 88776)\". Erowid.org. Jan 16, 2011. erowid.org/exp/88776",
 "substance": "JWH018",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "JWH-018",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 88776",
   "Male",
   " ",
   "19",
   "Jan 16, 2011",
   "Views: 5708",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been smoking weed for the last six years mostly on weekends and more consistently over the past year. Recently I started experimenting with JWH018 because of the inclement ban of the substance. After ordering multiple grams I decided to play with it some, I layed it on plant material, and got used to the high by smoking that, I found my quite tolerant of the substance because of personal chemistry and my regular weed toking. I found I was smoking aproxatmately 18mgs (what was in a standard half gram joint) and not getting high enough.</p><p>Being concerned about my lungs because of a cold I had I decided to make cookies and brownies that were laced with 018, and I did the cookies were aprox 8mgs and the brownies about 24mgs. I went slow and tested the water with a cookie on an empty stomach I could feel something about 20 minutes in so I had another few cookies and had quite the nice evening. I continued to eat the cookies for the next several days increasing my dose and not smoking so much, both tobacco and pot, after a few days I wanted to test the higher doses. Eating the cookies after I baked is not a problem, let me tell you bub,  On a few Occasions I dosed over 100mgs over the course of a day the highest being about 120. These all went well helping me sleep without coughing. The highest dose I ate in one sitting was approximately 70mgs and I got really high from this, there was none of the fear that others have described but I did have trouble with my coordination I had a very difficult time focusing was unable to hold a conversation I was way out of it but it was great buzz man. Its finals time and all my worry about that was gone. I also found these doses useful in not smoking cigarettes, I get so stoned I forget to want a cigarette was great a pack lasted me like 4 days. </p><p>I found the very high doses to be very medical, I was able to sleep and be more comfortable with a heavy chest cold I smoked less when on that dose, and it relieved all sorts of anxiety, though I was not ideally functional I could operate light machinery on this dose (like a toaster oven) certainly not a car though.  And I drive baked pretty damn well, just saying not condoning even my behavior. I do not recommend doses this high of 018 for the non experienced stoner or and even may be for those who are but have never dabbled in JWH's before. I found doses this high to be recreational with some medical bennifits because I was sick at the time. That is just a short retrospective on 018 from my use over the last few weeks.</p>"
}
