{
 "title": "Usage Multiple Times",
 "author": "cny psychedelic ",
 "citation": "   cny psychedelic . \"Usage Multiple Times: experience with MDPV (ID 88799)\". Erowid.org. Jan 13, 2011. erowid.org/exp/88799",
 "substance": "MDPV",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "MDPV",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88799",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Jan 13, 2011",
   "Views: 8847",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is a 'I've done this in a couple different forms and about 6 or 8 separate times' report. My experiences with this psychoactive chemical is it can be dangerous if you don't know what your doing but if done for a short period of time and at 'safe' low doses it can be extremely pleasant but at large doses it can cause some negative anxiety related stimulating effects especially when used over a period of time. \r\nI have done a 3 day binge with the stuff with no eating or sleeping and raised my tolerance to the substance very rapidly and if I didn't raise my tolerance as quick as I did I probably would have overdosed from the amount I was doing per dosage. A close friend of mine did it for 8 days without sleep and didn't eat (to my knowledge he didn't but might of had a snack maybe a couple times) and was also on a couple other drugs like nicotine, phenazepam and maybe some psychedelics like methylone, mephadrone, lsd, ketamine, mushrooms, some of the 2c family, dmt, maybe opiates (probably roxicodone if anything) and possibly marijuana (we were trying to kick a strong heroin addiction so we did a lot of drugs to try and stop cravings, he did more than me but had more access to a larger variety of psychoactive substances than I) and as of now we were successful.\r\n(I'm on mdpv now so I might be getting off topic a little) So far I really enjoy it, I had one binge and one time I took one dose that was was way too strong. The day after my binge I slept about 4 or 5 hours and woke up and did approximately a 25 to 60 mg iv shot, it was my 4th day without eating anything and I had to do yard work all day, it was horrible I could barely do anything I was shoveling gravel and kept stopping because I couldn't keep going, I had bad tachycardia, anxiety, paranoia, nausea, and mild opiate withdrawal. But other than those two times I have had generally good experiences with it, I find that small doses are more pleasant and more efficient but even if I get real zooted if I take smaller and smaller doses farther and farther apart the comedown is not nearly as bad, but on the other hand if I get real zooted and do the same size or larger dosages towards the end the comedown will not be so mellow and can be quite harsh depending on the dosage and duration of usage. So I would recommend caution when using this substance but I would also say that its a very enjoyable substance if used carefully and correctly.\n\n\n"
}
