{
 "title": "I Got Research Chemd Out",
 "author": "ToSeeEye",
 "citation": "   ToSeeEye. \"I Got Research Chemd Out: experience with 2C-I & JWH-018 (ID 88804)\". Erowid.org. Jan 17, 2011. erowid.org/exp/88804",
 "substance": "2C-I & JWH-018",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "45 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 3:00",
   "  ",
   "smoked",
   "JWH-018",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "88804",
   "Male",
   " ",
   "18",
   "Jan 17, 2011",
   "5422",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Just for the record, I am experienced with the following psychedelics: 2C-B, 2C-I, 2C-E, LSD, psylocybin, mescaline.</p><p>So this experience was a solo trip. I trip alone every now and again to evaluate whatever chemical I'm on fully. Sometimes when I'm tripping with other people I'm not able to fully explore all the possibilities of a psychedelic. Some people keep me grounded.</p><p>Setting: My house in my room</p><p>People: girlfriend (not tripping but experienced tripper)</p><p>0:00+ Dosed 45mg of 2C-I. I normally snort it but today I was gonna try something else. I put the 45mg into a small amount of water and let it dissolve completely. 2Cs are very water soluble.</p><p>0:30+ Hardly any effects yet. Starting to notice slight visual distortion. Every time I do a 2C I always get this thought into my head 'what have you gotten yourself into this time?'</p><p>0:45+ The visuals begin setting in. The 2C mindset sets in. When I do 2C-I, it feels like there's this little switch in my body called the party switch. And 2C TAPES it into the on position.</p><p>1:15+ We begin watching the movie 'Paprika'. Just as the peak sets in we begin watching this movie. Its the first time I've seen it. My girlfriend keeps noting how trippy it is. Let me tell you, this is one of the most trippy movies I've ever watched on psychedelics. This movie had alot of emotion inside it. And on 2C-I I could just feel the emotions consuming every fiber of my being. I was IN that fucking movie.</p><p>3:00+ I decide to vaporize some of my pure JWH-018 that I ordered off the interwebz. I don't have a scale so I just put tiny amounts into the meth pipe I have. I call it a meth pipe for lack of a better name. A eucalyptus inhaler I guess. After about a 10mg bowl I begin playing super mario bros for wii. </p><p>3:20+ The JWH supercharges my trip basically. I was just starting to come down from the peak and BOOM. I started tripping like 5 times harder. I remember thinking 'JWH doesnt last that long so calm down'. I was almost tripping too hard. The trip felt very synthetic at this point. All psychedelics have the potential to be eye opening and spiritual. But I would have had to try wayy too hard on this one.</p><p>4:00+ Still tripping pretty hard. I decide to rave to some dubstep. That's always fun on 2C-x's. Mostly 2C-I though. 2C-I is the closest I'll get to MDMA without actually being ecstasy.</p><p>5:00+ It's really late. My girlfriend fell asleep a while ago. She wakes up because I'm making alot of noise and decides to vape some JWH with me so she can fall back asleep. Normally when I smoke weed while I'm tripping, it'll chill me out a little bit. Yeah thc's a psychedelic and will make me trip a little harder. But not like JWH-018. It takes the trip and sends it to the moon. Doesn't really chill me out. I felt really stimulated and a wee bit anxious. Which kinda sucks because I was wanting to chill out at this point. Instead, I just tripped harder.</p><p>Overall the trip lasted about 6-8 hours. I liked the JWH+2C combo. I enjoy 2C-x's. I think they're interesting and go off in their own little way. The feeling they are trying to convey is pretty complicated and hard to understand. But as far as synthetic psychedelics go, none compare to LSD. I'll do 2C only if I can't find any acid. And in my opinion, nothing beats the natural psychedelics like mushrooms and mescaline containing cacti.</p><p>Happy trippin'</p>"
}
