{
 "title": "You're Just as Adorable as a Muppet to DMT",
 "author": "AdamDivesDeep",
 "citation": "   AdamDivesDeep. \"You're Just as Adorable as a Muppet to DMT: experience with DMT (ID 88824)\". Erowid.org. Nov 12, 2012. erowid.org/exp/88824",
 "substance": "DMT",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  bowls",
   "smoked",
   "DMT"
  ]
 ],
 "footer": [
  [
   "2010",
   "88824",
   "Male",
   " ",
   "28",
   "Nov 12, 2012",
   "4551",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I smoked DMT the other afternoon and remembered that everything really is OK.  It may be a struggle to realize that at times, but this would only be due to what I may impose upon the limitations of my consciousness.  So, I may as well recount this recent memory of eternal unburdening before the accrual of personal consciousness obscures me of the bigger picture.  Here it goes.</p><p>I waved goodbye to my room-mate, feeling a body load swiftly build upon me.  I cleared the rest of the smoke as I could, and put the empty bong down.  A shimmer was noted, in everything I saw; in each and every point of my environment.  Geometric images of manifold designs began to appear and move along every alignment possible. I closed my eyes, pondering how the world my eyes perceived was but a narrow portion of the real world that my sensory apparati could detect, moments after that real event had actually occurred.  My eyelids closed to shut out the world limited by them, and my mind was subsumed into direct experience of a reality beyond my comprehensions.</p><p>I did not see a cosmic elf, trying to gift me, or feel hugged by the clouds, as my roommate had recounted his own experience on the chemical.  I did, however, completely lose my body.  Aware only of my vision, smile and physical feeling of infinitude, I was not otherwise contained.  I was a part of the world, reflecting on itself.  The world was... more vast than imaginable, yet simplified enormously.  A bright, luminous sun glowed no more brightly than the green hills that the sky sloped into.  Noting a sensation of encapsulation, it seemed I was as central to this sphere as any other point within it.  My world and sky were one.</p><p>This world did not exist for me with machinery, as many DMT smokers may report, and had actually lacked all angles as they had been known to me.  The curvature was sublimely unending, a dynamic unfurling of luminous wonder.  If angles were to be conceived, it was as a vector may; each point I would reflect upon would sparkle, as though a hologram.  This seemed to be the arising between the intersection of worlds.  Yes, this was a place primordial to time of consequence yet a place of confluence where these (and all other things) passed inconsequentially through each other.</p><p>This world laughed at my sense of cause and effect.  Referred to as the businessman lunch due to its metabolic brevity when smoked, I had 45 minutes to burn until baked potatoes needed interference, I thought nothing before experiencing the DMT.  This silly thought, of a responsibility aside from wonderment of which I was an inextricable part, intruded my appreciation of this world.  The potatoes, some stubborn part of my lucid mind would assert.  I would open my eyes to see the digital clock suspended within the well-intended mockery of the realler world.  Of course my roommate would be responsible, if need be, for me.  The entire arch of my trajectories from and to, presuppositions of cause and effect, was undermined by the immanency and utter depth of the world beneath it.  It is OK, the world would remark as the conscience of my guilty self.  Is OK, was OK, will be OK... OK is eternal, and this joy is ever flowing, this world would calmly whisper.</p><p>A black field.  I am ensconced, but know of nothing other than vision.  I see black.  Then, and I am sure for this happened several times (SO similar, but never identical), the most adorable, invitingly furry, bipedal creature that I had ever seen walks from right to left.  Best resembling a lemur or other prosimian animal with supernaturally cute features, this object of my endearment walks, from right to left, with purpose.  Before reaching its destination, it looks to its left and meets me in the eye.  This is where things unexpected enter.</p><p>The animal astounded by the creatures reaction.  It looks at me with astonishment, clear from its physical and facial reactions.  I recognize that look... the creature bounds over to me, kneels down and begins to pet me as though I am the most adorable creature it has ever beheld.  Although hands, feet and body in general had ceased to exist for some time now, I was aware of this creatures enfolding embrace.  It felt SO good, to be pet and loved as I loved so much! My insides were utterly tickled.  The smile I wore seemed larger than all space.  My grin seemed to wrap around my everything, keeping me warm.  This happened several times, in each rendition the muppet projection of myself diverted from its straight and narrow path to love the unexpected beauty it had nearly passed.</p><p>My breath was realized, for what seemed the first time in ages.  It felt so good, to simply aspirate.  To take in the world, my eyes still closed, to breath in my environment I became more myself.  I and environment were not so separate.  My legs returned, and I felt my seat.  The grin, though still cast wider than the horizon, could be localized to my cheeks.  I began to talk with my roommate, first uttering thank you and I love you.  My life was changed, like a born again Christian, a dear friend justly summarized for me.  The world beneath my fingertips, tapping on a key board, playing a violin of the cilia in my ears with the vibrations of the air, sliding down my nose in the form of prescription glasses; my sense of what is important in the context of things, everything I feel to be real in the world of death and taxes- none of this is more compelling than that richer realm facilitated through DMT.  This world is simply more accessible than that other world, but no more real to my mind than the other.</p><p>Going back to my last cogent thought before the chemical took hold entirely, my real world, composed of dear people known and unknown to (but entirely apart of) myself is a sliver of the past.  Vibrations of sound traveling through the air, a photons journey from the event to my eye, even the sensations of my very skin are delayed as they are transmitted to the awareness of my mind.  Our window is too narrow to take it all in, and the grand breeze of what is will not hit us until squeezing through the prison of our subjective removal from reality.  We wont know what is going on until it becomes a fragmentary history, distorted by our conclusions of it.  This is what is so accessible, a set incapable of inducing conclusions of how wide an array existence may take.  I think the DMT communication, if you will, or lesson that I construed was that joy and infinite astonishment, a deep and fluid indivisiveness of being at its grandest, lays beneath all moments in time.  I dont fear death, nor speculate what may come after it.  Perhaps reincarnation, hell, or nothing at all.  Whatever it may be, it seems incapable of circumventing the juncture DMT brought my mind to, a palatial crux of all things from which only itself can arise.</p><p>Now, what is so important?</p>"
}
