{
 "title": "Not Too Great",
 "author": "MK",
 "citation": "   MK. \"Not Too Great: experience with Cocaine (ID 8883)\". Erowid.org. May 12, 2004. erowid.org/exp/8883",
 "substance": "Cocaine",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8883",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 12, 2004",
   "Views: 13293",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI've done coke twice and I honestly believe that it's a waste of time and money.</p><p>My first time, I snorted four small lines for a total dose of a quarter gram, all over the course of about 10 minutes.  The numbness hit, then the high.  Ten minutes after I had snorted, I got an exhilirating rush that was damn near overpowering.  It reminded me of a more powerful ecstacy, but minus the emotional openness (which is one of e's better attributes).  I was mildly dissapointed because the high from $15 worth of coke wasn't really any better than a $20 pill that lasted several times longer.  The comedown wasn't too bad and I was glad that I had tried it, but I wasn't at all impressed.</p><p>My second time, I snorted a half gram in two massive lines.  This batch was much weaker than the first.  I barely got numb at all, and I wasn't much higher than the last time, even though I had snorted twice as much.  The high wasn't even great.  It came and went without warning.  One moment, I'd feel sober, the next I'd be too fucked up to stand.  All I could do was sit on the ground and stare off into space with my eyes crossed.  I gritted my teeth and talked about boring shit.  This high lasted longer than the first time; I was very messed up for about an hour before the comedown started.  I was almost relieved when I started coming down because I was finally able to walk without getting dizzy and nauseous.  But when the comedown started, a little voice in the back of my head was saying 'If you snort more, it'll be good because you're finally getting used to it.  Another half gram right now will put you in heaven.'  Even though I had just had a fairly lousy experience, I still craved more.  I can see how binges happen.</p><p>Well, all in all, I have found coke to be a pretty lame drug.  The high is good, but the side effects, being physical, mental, and financial, definetely outweigh the high.  It's just not worth it.  I'm putting coke on my list of 'Last Resort' drugs.</p>"
}
