{
 "title": "Too Much, Too Fast.",
 "author": "Cardinal Biggles",
 "citation": "   Cardinal Biggles. \"Too Much, Too Fast.: experience with Ketamine (IV) (ID 8884)\". Erowid.org. Jul 7, 2002. erowid.org/exp/8884",
 "substance": "Ketamine (IV)",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "IV",
   "Ketamine"
  ]
 ],
 "footer": [
  [
   "2001",
   "8884",
   "Male",
   " ",
   "Not Given",
   "Jul 7, 2002",
   "31166",
   " "
  ]
 ],
 "report": "<p>\nMy friend and I, both of us doctors, were standing around in theatre one day. We had just administered ketamine to a patient and were watching her face as the drug took effect. </p><p>'Looks interesting,' I observed.</p><p>'Does rather, doesn't it,' he replied mildly.</p><p>'Do unto Others . . .?' I questioned subtly. </p><p>Anyway, we continued with our work, but the unspoken agreement that we were going to give this a try was enough to make a vial of the stuff disappear before the end of the day, and so we met three days later at my place. A delapidated hovel in the bush, but it's a home to me. (Luxury! We used to dream of having a hovel . . .)</p><p>I put on some nice relaxing trancy tunes. We were quite excited, and were expecting wonderful things. We hadn't taken anything else, because we wanted our perceptions unsullied, the better to record the experience. In hindsight, something to effect amnesia would have been an excellent idea, but there you go. Working on the theory that 2mg/kg was an induction dose for anaesthetic, we surmised a quarter thereof would in fact get us to where we wanted to be. First mistake.</p><p>So I drew up 45 mg for each of us, and injected my friend. He passed out immediately. I thought that might be a bit worrying, but I didn't want to get left behind, so I gritted my teeth and mainlined myself too. I felt very cool to be doing it, 'cos I had seen trainspotting plenty of times, and mainlining was so hardcore. Second mistake. Now I get a bit hazy on the details, because I was unconscious by the time the plunger was in, just managing to whip out the syringe. (Bleeding calmly onto my couch.)</p><p>My first memory is of panicking that my land lord was going to come in and find me in this condition. An odd random thoght. (Look, I came here to do ketamine, I wasn't expecting some kind of spanish inquisition) Then I started asking myself: 'What is this condition?' I had no idea. I realised that I was not entirely sure who I was. I had no clue who the person lying next to me with the glassy eyed stare was. He scared me. He was just staring at the ceiling. Was that normal? I wasn't sure. I couldn't move. Or I could, but I wasn't sure what movement was either. This train of thought, of not knowing ANYTHING at all, only sensing things, but not having a model of the universe to fit them into continued for maybe ten minutes, but I have no way of knowing.</p><p>Slowly I came to my senses. I knew that someting was wrong, desperately, desperately wrong. But I didn't know WHY. I had no idea that it was because of ketamine, and I was starting to belive that this was how the universe was. Totally disjointed. The train to reality came roaring past again, and this time I managed to hang on by a fingernail.</p><p>I suddenly apprehended what was happening and flew out of the lounge and started pacing and mumbling, experiencing an emotion much like the anxiety component of a bad acid trip. It lasted maybe five minutes.</p><p>By this time my friend was coming round. I desperately wanted to talk to him. I needed people. Unfortunately, he was capable of repeating the word 'fuck' over and over, but not much else.</p><p>We spent about another half hour together, during which I vomitted once, feeling much better for it. We tried to talk about what had happened, what we had experienced, but only kept on yammering about how terrible it was. We were back to the appearance of normality after 90 minutes. </p><p>There was nothing visual or auditorty here. It was all emotion, and most of it bad. Anxiety, paranoia and transient mental retardation. I cannot give detail, because mercifully much is forgotten. Ketamine is a powerful analgesic, and I remember my skin feeling like parchment. Dry and numb. I am sure I would have been totallly unable to feel pain. (Careful! Pain has a purpose.)</p><p>I have tried ketamine again since then, orally, and still consider it not worth the health risk. But here are the lessons learned, if you would like to give it a whirl and see where it takes you:</p><p>1. Never IV Ketamine</p><p>2. Max 1/4 mg/kg/dose</p><p>3. Only with people you trust, not at a big party.</p><p>4. Never any sedative antipsychotics to take the edge off (from further experimenting and reading on the net.)</p><p>Lastly, if there are any other doctors reading this, I would suggest you try this drug on yourself before dishing it out to your patients. It really is not fun. If your hospital can afford it, go with propofol where possible, otherwise ample sedation. (I work in the third world, and ketamine is a popular anaesthetic here - for many reasons, some of them quite good ones.)</p><p>*An aside: Feel free to ignore the Monty Python. It came out of nowhere, but it made me laugh.</p>"
}
