{
 "title": "Unusual Reaction Five Hours Later",
 "author": "raui",
 "citation": "   raui. \"Unusual Reaction Five Hours Later: experience with 5-MeO-DALT (ID 88867)\". Erowid.org. Jan 15, 2011. erowid.org/exp/88867",
 "substance": "5-MeO-DALT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "5-MeO-DALT",
   "(capsule)",
   "  T+ 5:45",
   "  ",
   " ",
   "Various",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 88867",
   "Male",
   " ",
   "Age at time of experience: 25",
   "Jan 15, 2011",
   "Views: 8903",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>12/21/10</p><p>3:35 - Two subjects orally consume 50mg each of 5-MeO-DALT in a vegicap.  Both subjects have smoked 5-MeO-DALT as a blend before.  One subject has smoked some of this specific batch on top of some blend, though this batch is in the salt form.  Both subjects had eaten a light breakfast in the morning and a sandwich around 1PM,  popcorn was consumed prior to ingesting the capsules however.</p><p>5:45 - This experience is only noted in the body mostly.  Subjects do not feel great.  A pear was eaten and some blend was added to the mix.  Surprisingly, the blend did not kick off any more activity.</p><p>7:56 - One particular subject started to feel the effects after eating dinner (Fish fillets, though pretty greasy from being fried in oil). It worries them a bit that it took so long to kick in.  Here is where I'll begin to actually describe the experience overall.</p><p>Pupils never dilated during this experience, which they usually do for this subject on psychedelics.  Some jaw tension was noted as well as some energy in the lower region.  </p><p>It was a dissociative feeling in the body, the subject felt almost as physically messed up as if they had consumed DXM; there was some trouble typing even.  As much as the subject felt a bit panicked that the experience shouldn't have taken so long to kick in, their body felt very relaxed and slowed down, like an intense mellow.</p><p>While no mental effects were noticed, the one subject experienced visuals which lead them to believe it was more the 5-MeO-DALT rather than some strange reaction to the food; Still uncertain whether it really was or not though.  There was some slight morphing and vivid detail of the wall in the bathroom but the most intense visual was the flickering of the light, which is a common visual effect they experience.</p><p>The effects intensity wouldn't have been minded so much had it not been unusual that it had taken so long to kick in... if it even was this substance at all. The effects intensity wouldn't have been minded so much had it not been unusual that it had taken so long to kick in... if it even was this substance at all.</p><p>The duration of this reaction was pretty short overall (About the length of Pink Floyd's Animals album.)  The effects intensity wouldn't have been minded so much had it not been unusual that it had taken so long to kick in... if it even was this substance at all.  </p><p>This subject is not new to psychedelics, though they do not generally consume heroic doses.  Regardless, consider that in their opinion, this felt like an intense reaction in the body and they are not familiar with ever feeling that way from an orally consumed psychedelic. </p><p>There was no particular body load noticed, though that's pretty much the only effect the other subject noted other than a slight body buzz.  This other subject spent much of the experience constantly going to the bathroom, though they also felt sick the next day and wonder whether they were just not feeling good in general.</p><p>Trying to find out how much to research next time is going to be tough.  Initially the one subject thought 50mg of 5-MeO-DALT was more underwhelming than 40mg of AMT even, but after the odd reaction 5 hours later has no idea whether they want to increase the dosage next time.  May try consuming it in liquid or perhaps a different ROA.  If anything, would possibly consume 55mg next time.  Still, not going to research this one again any time soon which is a shame because they thought this substance could have a use in the right setting.</p>"
}
