{
 "title": "Week Long Test",
 "author": "MountaintopJ",
 "citation": " MountaintopJ. \"Week Long Test: experience with K2  (ID 88895)\". Erowid.org. Oct 15, 2011. erowid.org/exp/88895",
 "substance": "K2 ",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 Tbsp",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2010",
   "88895",
   "Male",
   "",
   "25",
   "Oct 15, 2011",
   "5275",
   " "
  ]
 ],
 "report": "<p>For a while now I have been hearing all the news about K2 and these other incenses that contain JWH-018, and it has gotten me very interested.</p><p>I did some research on line, read about peoples horrible experiences, and there was a common trend amongst most of them  these people underestimated what they were dealing with, expected it to be weak, smoked way too much and had a horrible experience.</p><p>I bought some K2 ultra, which was supposed to be the strongest concentration 1gram JWH-018 per ounce of herbal blend. Keep in mind I hadnt smoked pot or anything in over 4 years. Mostly because I had been getting very paranoid while smoking it so I quit.</p><p>My first experience was very intense. I packed about a tsp amount of herbal blend into a pipe and took a pretty strong hit and held it in for about 20 seconds. Upon breathing out I realized I took one hell of a wicked drag. I waited a couple minutes, and noticed only slight changes in consciousness so I took another hit.</p><p>10 minutes in it was coming on hard, very hard and very fast. Everything was in slow motion and the old paranoia I was feeling from pot years ago was coming back hard. But for some reason I had a grip on these thoughts and talked myself out of it, sat down and watched the military channel and relaxed with a big glass of water. Overall effects reminded me of some decent nugget. After about an hour I was relatively normal again.</p><p>Next day I took it easy and took smaller hits with longer intervals in between. The effects were great, I was high, laughing like a fool, in a good mood, it was like pot used to be for me 10 years ago. This time no paranoia. I felt as though yesterdays experience was therapeutic in that I learned how to control my mind in such a situation and erased the paranoia.</p><p>I smoked every day for a week after that and it was very predictable, Im actually quite fond of this chemical.</p><p>One thing I have noticed is very abstract dreams, very vivid and memorable.</p><p>I also drank a few beers while smoking which may have eased the anxiety feelings as well, or kept them away.</p><p>My impression is that if you keep your head and dip your feet before jumping in, you will have a good grip on what you are getting into and at that point you can figure out what you can handle. This is definitely no joke, If I had taken 5 hits like I would of pot the first time, I think I would have lost my mind. This shit comes on like a hurricane and doesnt give you much warning or time to adjust to your mindset. But it has been a very pleasant treat. The day before they made this chemical illegal in my state I bought 3 ounces of it for 100 dollars at a local shop. When you figure the cost was 44.95 for 3 grams a month ago, that is a hell of a deal.</p><p>I dont recommend this to someone who doesnt have experience with crazy psychoactives, or at least plenty of experience with crazy stong pot. This is definitely 5 times more potent than pot, at least to me.</p><p>Know your mind, Know your Body, Know your dose, Know your source. Keep everything in perspective and dont underestimate this machine. If anything over estimate it, you can always smoke more. Beer definitely helps ease anxiety.</p><p>Dont be like the idiots that buy pure jwh and smoke 25mg ontop of their pot, no fucking wonder they freaked out and ended up in the hospital. A dose like that first time would scare the hell out of anyone.</p>"
}
