{
 "title": "Incredible Zingy Feelings but Awful Comedown",
 "author": "Scribblenipple",
 "citation": "   Scribblenipple. \"Incredible Zingy Feelings but Awful Comedown: experience with 4-Methylmethcathinone (Mephedrone) (ID 88909)\". Erowid.org. Feb 10, 2011. erowid.org/exp/88909",
 "substance": "4-Methylmethcathinone (Mephedrone)",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "125 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 0:00",
   "  repeated",
   "oral",
   "Alcohol",
   " ",
   "  T+ 0:30",
   "125 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 1:20",
   "125 mg",
   "insufflated",
   "4-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88909",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Feb 10, 2011",
   "Views: 9966",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis was the first time I had ever tried stimulant drugs with a view to actually getting high.  I had previously tried bombing drugs like MDMA but they very rarely had the effect I desired.<br>During this time, mephedrone had just become illegal in the UK and I was keen to try it.  I had a friend come to my halls in uni and he brought 2g of mephedrone with him. We had a few drinks to unwind and then he brought the packet out.  It was about midnight.<br>00.00 - Railed 125mg.  Stings like fuck.  He rails about same amount.  The stinging seems almost too much to bear, like when you get chloriney water up your nose in the swimming pool.  It quickly started going to the back of my throat and I can feel something trickling down, it tastes horrible.  I really dislike this drug right now.  We carry on talking, trying to forget the pain and horrible taste.  I drink more alcohol to try and clear it away.<br>00.10 - Feel some stimulation.  Only a little bit right now.  Nose has stopped stinging but the horrible taste is still there.  My eyes are already completely, fully dilated - I literally cant see any iris at all.  I tell my friend who turns the light on and looks into my eyes and laughs.  He says to just sit and wait for it to start working.<br>00.15 - Can feel myself coming up.  It's making me feel a little bit nauseous - not unlike MDMA, but its not unpleasant as such.  I think maybe the noradrenaline has been released first; I can feel my heart rate increasing, it's thumping quite a bit harder and I'm sweating.  I start jittering and getting cold and hot 'wash' sensations over my body, I drink more alcohol and take deep breaths to try and relax.  The nauseating feeling gradually gets better and I carry on coming up.<br>00.20 - Feeling of becoming incredibly awake, happy, and have a powerful, 'zingy' desire to laugh.  Low down in my abdomen, I feel a sort of electrical feeling, and its making me feel amazing.  The surge of dopamine is washing all over me and it doesnt reach plateau any time soon - it carries on going up and I feel like I want to scream in pleasure.  My friend is on my bed, looking at me with a huge smile because he can see how much I'm enjoying it.<br>00.30 - High as fuck.  Really, incredibly, intensely intense high.  I rail another 125mg in the hope that it will prolong the high.  Feeling a lot of sexual stimulation now too.<br>00.45 - Amazingly high.  Vision is a little bit blurred and I am experiencing mild hallucinations - The computer is on at the other end of the room and the people on the web page that's currently up are sort of motioning at me.  But i know they arent, I'm still in the real world - I'm not hallucinating enough to think it's real.  My mate is completely monged out at this point, so I decide to look at some porn.<br>00.50 - Masturbating feels unbelievable.  Cannot reach orgasm though, which is frustrating.  All the porn on the screen seems so much more horny than usual.<br>01.20 - Somehow my mate has fallen asleep which I can't understand.  I don't feel tired.  I'm starting to feel like I'm coming down and feel a HUGE compulsion to re-dose.  I rail another 125mg line and wait for it to hit me.<br>01.35 - Painfully high.  Like, I feel amazing but I want the high to be slightly less intense because my heart feels like its gunna pop out and I'm actually feeling a bit paranoid.  Auditory hallucinations are occurring now.  Also, I return to the computer and could swear my mate (who is still asleep) is shouting at me but he's not, I'm imagining it.  He jerks his leg and kicks over a glass of coke on my desk - which makes me leap up from my chair like someone's plugged me into the mains electric.  I'm jittery but happy about it.  Somehow, the coke falling all over the floor is the funniest thing I've ever seen and I laugh as I clean it up.<br>02.00 - Coming down again, but can't sleep.  I try to sleep because I worry about how addictive the drug is.  <br>04.00 - Finally sleep.<br>12.00 - Wake up feeling awful.  I have a sharp, banging headache and breathing hurts.<br>All in all, an amazing drug, which I did pay for in the morning.\n\n\n"
}
