{
 "title": "Seizure from Serotonin Syndrome",
 "author": "theguy",
 "citation": "   theguy. \"Seizure from Serotonin Syndrome: experience with Syrian Rue & Mimosa tenuiflora (ID 88928)\". Erowid.org. Mar 7, 2011. erowid.org/exp/88928",
 "substance": "Syrian Rue & Mimosa tenuiflora",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 g",
   "oral",
   "Syrian Rue",
   "(ground / crushed)",
   "  T+ 0:30",
   "15 g",
   "oral",
   "Mimosa tenuiflora",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2010",
   "88928",
   "Male",
   " ",
   "30",
   "Mar 7, 2011",
   "5511",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I just had a terrifying experience with an ayahuasca analogue.  I took 4g syrian rue ground and in gelcaps, and then a half hour later I drank tea made from mimosa hostilis...I'm not going to go into great depth as to my exact preparation methods, as I don't want to participate in any way with anyone else using this stuff. The purpose of this trip report is to stop others from taking ayahuasca.</p><p>My background with drugs is very extensive...I have done a lot of LSD, mushrooms, DMT (smokable), cocaine, marijuana, opium, MDMA, DXM, etc....I don't mean that I have taken these things once or twice, I've done a lot of drugs...I'm not trying to brag but it needs to be clear that I am not a first timer who had a bum trip, I've had bad trips before though never this bad, and in the end it wasn't the tripping that caused my problems. This was my 3rd experience with this ayahuasca recipe. I spent a good 6 months on the internet researching this stuff and gathering materials, I am rather particular about what drugs I will take and I tend to research them very carefully and for at least a couple months before I take anything. So here is what happened...</p><p>7:30pm took the rue </p><p>7:45pm noticing slight effects from the rue nothing to write home about but a feeling like it was doing something.  </p><p>8:00pm drank mimosa brew...</p><p>8:15pm tripping very hard...this is my last real memory until 12:30am when I came to in...you guessed it THE HOSPITAL</p><p>I'm going to try and give a description of what I experienced during the 'lost time' but as any psychedelic user can tell you...words sort tend to fall short of describing the experience.  I was caught in various loops, time loops, thought loops, I felt as though any stimulus I received was regenerating in my head echoing infinitely.  I remember talking to my spirit guide his name was Nate...I remember thinking it was weird that he had a name.  I remember strange lights and aliens doing things to me... This was difficult to get my head around because both spirit guides and aliens doing weird stuff to you is fairly familiar to those of us that have experience with tryptamines... About now is when I realized that I have not purged... now I am concerned... this is when I realized that I wasn't in my room anymore... this is when I realized that Nate was not my spirit guide he was a paramedic... after this realization I tried to focus on keeping still and relaxed... I tried to avoid fighting anything that the paramedics where doing to me.</p><p>12:30am I am starting to come down and realize how fucked I am... I can finally have a 'coherent conversation' with the nurse but only barely and that takes a lot of effort... it is now that I found out what happened... I had a huge seizure, due to serotonin syndrome... I'm still tripping really hard but I can understand what the nurse is telling me... I decide that the best thing to do is be quiet and wait for the aya to wear off... of course the nurses and paramedics are asking me what I took.</p><p>1:45am I am not back to baseline but the effects are very much diminished about on the level of extreme marijuana doses.  this is when the doctor came in.  I explained to the doctor what I had taken. She of course had never heard of ayahuasca... She agreed with me that the DMT was not something to be worried about but the Harmine was what caused me to seize... my heart was beating irregularly, and extremely fast, my blood pressure was very low...</p><p>3:00am the doctor says she feels ok with me going home.</p><p>4:00am after tons of paperwork and questions I can finally go home but very much humbled...</p><p>I'm not going to go into the legal and financial problems this experience has caused but be aware they are severe!!! </p><p>The point is this...no matter how smart I was, and how much research I did ayahuasca was not safe,  I don't mean that it was psychologically unsafe.  Mentally I feel stable at least as stable as usually after an intense psychedelic experience. I mean this stuff is MEDICALLY UNSAFE... I almost died tonight and not in a metaphorical sense in a very real biological sense.  </p><p>I also want to point out that this happened on my third attempt the other two times I took this were great, despite the exact same preparation.  This wasn't even the heaviest dose I've taken, my first time I took 6g Rue and 20g Hostilis.  That is what is so scary about this stuff it is plant medicine and by it's nature unpredictable... while that can be tolerated with plants and fungi that don't contain any really harmful chemicals using MAOI's safely requires precision that I cannot get from the ayahuasca preparations.  </p><p>BE VERY VERY CAREFUL</p>"
}
