{
 "title": "IV. Good Gracious.",
 "author": "StigmaShadow",
 "citation": "Citation:   StigmaShadow. \"IV. Good Gracious.: experience with MDPV (ID 88980)\". Erowid.org. Aug 11, 2011. erowid.org/exp/88980",
 "substance": "MDPV",
 "bodyweight": "134 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco - Cigarettes",
   " ",
   " ",
   "125 mg",
   "IV",
   "MDPV",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88980",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Aug 11, 2011",
   "Views: 9151",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: The author of this report initially stated that the substance they injected was 4-MMC, but later told us that it was the product 'Ivory Soft', which appears to have been MDPV instead. Ivory Soft was found to contain MDPV, not 4-Methylmethcathinone as the author originally thought. See http://www.stsfirst.com/blog/index.asp?date=Wed,%20May%2018,%202011.]\r\nLet me start off by saying I have used a number of drugs, in just about all routes of administration (RoA). From Cannabis to Diluadid, to Methamphetamine to MDMA. But nothing quite compares to the experience I had with intravenously injecting MDPV (sold as 'Ivory Soft').\r\nI have used MDPV once before. I had even IV'd it after constant redosing, but never had just an IV. So I thought I would try it this night...\r\nI begin loading my syringe with a good amount of water-infused MDPV. I decided to try and shoot more since last time I didn't get a 'rush' so to speak. After my shot is ready I sit on the couch, grab my belt for a tourniquet, and uncap the syringe.\r\nI stick the needle in, just perfect into my bicept. Draw back the plunger and watch blood fill the syringe. I take a deep relaxed anxious breath and push it all the way down. At first I was expecting a rush while pushing down, but nothing... I remove the needle from my arm, cap it, pull the tourniquet off and sit back and wait...\r\nAfter about 10 seconds my ears slowly start to ring, then louder, and louder... Next I can't really explain what happened. I won't lie, I was scared. I thought I was overdosing, and almost yelled like a baby for help. But I knew I could work through this. 'Just keep breathing', I told myself. 'Just keep breathing'. And I did. An odd chemical taste started in the back of my throat, I swallowed it down, ears ringing. Next the room started to sway, or maybe it was my head swaying, I'm not sure. My body was overcome with euphoria. I kept thinking, 'oh my god I might die right here'. The waves and waves of euphoria poured over me as my head swayed from side to side. My brain couldn't comprehend what was happening. I'm pretty sure I had completely drained my brains reward system right then and there. But as I lay there in euphoria, ears still ringing. I feel a bit nauseous, but not to the point of vomiting or dry heaving. I sit there still swaying. Time seemed to go by so slow. I couldn't feel my heart beat, but continued to breathe. I checked my fingers for blueness (a sign of MDPV overdose), but they were still flesh colored. I was relieved. I tried to stand but fell back down into the couch... My jaw started to get tight. I started to feel a bit normal again, kinda like after insufflating it... I had returned from Heaven.\r\nI finally gained the strength to stand and went to the bathroom to check myself. My eyes were so dilated, it seemed like part of the white of my eyes were overtaken by black. My jaw continued to clench and I stepped outside for a smoke.\r\nOverall the experience lasted no more than what seemed like 5 minutes, maybe less. Maybe I'll time it next time (if there is one). I still cannot believe how this made me feel... After shooting hydromorphone, oxycodone, and even cocaine, nothing compares to this feeling. I absolutely love the nod of opiates, and have always hated uppers. ALWAYS. Methamphetamine left me with a lot of bad memories and nasty withdrawals. I write this report about an hour after the experience. My jaw still clenches and I feel a bit nauseous. I really have no desire to try again tonight. The feeling I experience I just can't get again, and I realize that. I have quite a bit of MDPV left, and am left wondering what to do with it.\r\nIn conclusion, I have insufflated and IVed MDPV. Insufflating I would compare to a dose of MDMA. While IVing as much as I did, as dangerous as it was, brought on a feeling I have never EVER felt before....\r\nI was initially mistaken about the identity of the substance and thought it was mephedrone (4-MMC), but after purchasing several other products and reading about the testing done by law enforcement, I determined that this substance was MDPV. \r\nProceed with caution.\n\n\n"
}