{
 "title": "Easily Tickled",
 "author": "Zono",
 "citation": "   Zono. \"Easily Tickled: experience with 2C-C (ID 88995)\". Erowid.org. Oct 4, 2011. erowid.org/exp/88995",
 "substance": "2C-C",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 88995",
   "Gender: Female",
   " ",
   "Age at time of experience: 28",
   "Added: Oct 4, 2011",
   "Views: 5044",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSo for New Years, after reading the trip reports available and trying to gain as much information as possible about 2c-c, my partner and I decided on the following doses:<br>I ingested 40mg 2c-c dissolved in water and mixed with juniper berry soda. He ingested 50mg dissolved in water and mixed with vanilla cream soda.<br>Wed heard reports on epic doses and reports on minor doses and decided that dividing what he had in half (more or less) was the best option.<br>We wrote down the time we dosed but decided against checking the time at all through the trip. While we waited for the onset we decided to put on some music with visualizations and cuddle up in bed.  Between kisses and cuddles the music started to take on distinct and detailed layers (as it tends to when Im high on anything) but I wasnt feeling much on the 2c-c as far as physical effects go.  <br>We proceeded to make-out and get naked; this seemed par for the course as we regularly have our own mini-orgies on 2c-i.  As we rolled round together I began to feel the muscles in my body spasm at random intervals.  It felt as though wires suspended my body and each cord was being cut away violently. Every part of my body felt as though it was being loosened and then left slack. This sensation started in my legs and moved randomly throughout the rest of me.<br>We decided to smoke a little weed to help the trip along. As we started having sex I felt as though I was continuously climaxing without actually having an orgasm. To me, it felt as though it would be difficult to actually come although on 2c-i neither of us had problems. Everywhere he touched me I could feel the ghosting of his touch against my skin; it was an incredible sensation.<br>Eventually the sex started to wind down back to cuddling. At some point we debated what time it was although neither of us could say for sure and we didnt want to look and my partner decided to use the washroom. It felt like he was gone for more than 20 minutes. In that time, without him (and the feel of him) to focus on, my attention shifted to the colors the visualizations were throwing on the walls and ceiling. My body felt weirdly silhouetted against that. I stretched my arms towards the ceiling and played with my fingers against the colors. My fingertips felt like they were full of electricity.<br>When my partner finally returned he announced that he had had difficulty escaping the distraction of the bathroom floor. Later and sober he explained that he looked down while he was standing in the bathroom and the green linoleum patterns looked like waterfalls falling away beneath his feet while he stood on a sheet of glass above them.<br>He got back into bed with me and we started to cuddle again but every touch suddenly seemed a lot more sensitive. I should probably mention that sober I have a problem with being tickled. I dont handle it well, Im extremely ticklish and I am fully capable of working myself up into an agitated frenzy.<br>He tickled me a little  I think as a joke  but it felt so much worse. I couldnt stop laughing, even the sheets started to take on an odd sensation as I thrashed around in them.  He tried to touch me sensually but now it felt as though the wires between tickles and pleasure had been completely crossed.  I tried to communicate this to him but he took it to mean that maybe tickles could now be sexualized instead of the opposite way around where sex would now become an unbearable ticklish mess.<br>He couldnt hold me still, he couldnt keep me quiet  and in fact, when he tried it made matters much worse. I would calm down if he wasnt laughing or touching me but if he touched me or squeezed me the wrong way I would start right back up again. His laughter only made me laugh harder. <br>As I kept thrashing around in the blankets I began to notice extremes in hot and cold, too. Id get to warm under the covers but then out of them I would be freezing.  The cold made me spasm the way the first onset of the trip had. When I tried to hold on to my partner for warmth and for solidity he declared that I felt like a newt against his skin.<br>Suddenly the word newt became just as aggravating as being tickled and I begged him to take it back. Every time he said it or I said it the word only proved to send me back into a tickled frenzy. My laughter started to turn to full-out crying as I begged him to take it back but as soon as he hugged me and said hed take it back I just went right back into fits of giggles.<br>Laughing and crying became completely interchangeableI was between sobs with tears rolling down my face and total hysterics. It was completely bizarre; when the crying would start I would feel genuine sorrow and then the laughter would send me right back into a frantic mania. The two feelings seemed so close together that I was having a difficult time separating them again.<br>Eventually I did calm down and we rested in bed against each other. I think I must have been sliding in and out of sleep because before I know hes popping out of bed and suggesting dinner. I didnt feel completely down but I was no longer in the trip, either.<br>The world around me just seemed to have a weird and plastic quality to it. Lights had a bloom/halo around them and walls seemed misplaced  like kitchen shouldnt have been cordoned off from the rest of the world.<br>As he made dinner I sobered up pretty quickly and we smoked a little more weed.<br>It felt like it should have been at least 11pm; the actual time was 9:45pm.\n\n\n"
}
