{
 "title": "I Became One with the Floor",
 "author": "Zaphod",
 "citation": " Zaphod. \"I Became One with the Floor: experience with Salvia divinorum (ID 8901)\". Erowid.org. May 19, 2004. erowid.org/exp/8901",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(dried)",
   "",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8901",
   "Male",
   "",
   "Not Given",
   "May 19, 2004",
   "5402",
   " "
  ]
 ],
 "report": "<p>A few years ago I had tried Salvia at a friends house. But I couldn't remember the trip. So after some research I bought an ounce of salvia leaf off the Internet when it arrived I eagerly loaded a leaf into the slider from my bong. After a couple hits my perception sort of rolled back a few years.(level 3?) This meaning that I felt as if I were reliving smoking salvia only as if I were a little kid in a friends house. During this initial trip I had wandered into my living room. Anxious to go farther I loaded a full bowl of finely crushed leaf into a 7-inch water bong and smoked it as strong as I could stand.</p><p>My mind some how connected itself to the bowl on the bong, probably because I was staring at it trying to take another hit when the trip started. Anyway I managed to lay down on my bed and close my eyes, saying that I was burning my brain. After my eyes were closed I saw my mind as a large black mass about the size of a swimming pool and at the bottom were the glowing embers of the smoked portion of a salvia bowl. The perimeter of the burning ran the full depth of my mind that is from the ash all the way up to my point of view. I felt that when the expanding burn had consumed my entire mind that I could progress to the next plateau.(from L-4) But the vision faded before it could complete itself. </p><p>Disappointed I decided to try again the next day again with a full bowl of nearly powdered leaf. This time I laid down and closed my eyes before the onset. Immediately I could feel my body filled with my spirit. Then my mind started to withdraw, shrinking inside my body. I could see the inside of my body as a shell drawing further away and could sense an entity disconnecting things as I got nearer to the next plateau. It disconnected something important so I said 'hey I need that' Unfortunately the experience faded before completion.(still L-4) I tried a couple more times without success. Frustrated I bought a quart of acetone and proceeded to leech out the salvorin from the rest of the ounce. Now I have the nearly complete extract. A small amount of leaf covered in black tar. The tar has minute crystals throughout if examined closely.</p><p>At t0:00 I smoked a half a bowl of my extract, which turned out to be 8x by weight. Twenty seconds later the salvorin was in effect it was fairly strong but I was still in control and by t 0:04 most of the trip was gone I wanted to get to the elusive plateau so, at t0:05 I loaded a fairly large leaf about (45x13mm) and tried to smoke it. The effects of the last dose were still with me, and by the time I exhaled the first hit I was tripping again, I kept trying to communicate with myself in third person and it wasn't until t00:07:30 that I could concentrate sufficiently to finish the bowl. At about t0:08 I became one with the floor.(L-5) As funny as it sounds that was the best way to describe the experience. I was sitting in my room by myself on the floor listening to techno as I smoked and after the last hit I melted into the floor. I felt as if I were a liquid of high viscosity slowly being absorbed by the floor. I realized that I was sprawled on the floor at t0:15 and decided that I probably wouldn't be able to go any further without a trip sitter. </p><p>I strongly am in favor of using an extract of some form to try salvia. I found the smoke from the plain leaf is harsh and it was difficult for me to get a good experience of any intensity this way.</p>"
}
