{
 "title": "Worst Fears Confirmed",
 "author": "Tae Guevara",
 "citation": "   Tae Guevara. \"Worst Fears Confirmed: experience with 5-MeO-DALT & Cannabis (ID 89044)\". Erowid.org. Jan 16, 2011. erowid.org/exp/89044",
 "substance": "5-MeO-DALT & Cannabis",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "5-MeO-DALT",
   "(powder / crystals)",
   " ",
   "  ",
   "sublingual",
   "5-MeO-DALT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 89044",
   "Female",
   " ",
   "Age at time of experience: 20",
   "Added: Jan 16, 2011",
   "Views: 8671",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>    * body weight & gender-male 140lbs age 25. Female 180lbs age 20.</p><p>    * dose taken-* UNKNOWN* see * warning below</p><p>    * route of administration-oral, insufflated, smoked on top of bowl, vaporized on foil</p><p>    * Setting: in what environment it was taken-friends house/garage</p><p>    * duration of main effects-1-2 hours</p><p>    * main effects-altered perception, heightened sexual senses, no OEV's however tracers were apparent, mild CEV's, dream like state</p><p>    * side effects-low to mild body load, nausea, terrible after taste (imagine biting into an Aspirin pill)</p><p>    * after effects-chemical burn when taken orally directly through the tongue. Usually not apparent until the day following usage but is comparable to having one's tongue scalded by a hot beverage or perhaps ingesting bleach. NOT COOL!</p><p>    * rating of the experience-4/10</p><p>    * addictive qualities / abuse potential-varies from person to person. This substance has the potential for abuse in some individuals when used over an extended period of time.</p><p>* Dosage Warning* WHILE THIS WARNING CAN BE CONSTRUED AS COMMON SENSE SWIMS EXPERIENCE THAT I WILL DESCRIBE BELOW WILL HOPEFULLY REINFORCE IT'S SERIOUSNESS. NEVER EVER, UNDER ANY CIRCUMSTANCE CHOOSE TO EYEBALL A RESEARCH CHEMICAL!!! IF YOU DO NOT OWN/OR DO NOT HAVE ACCESS TO A SCALE ACCURATE AT THE MILLIGRAM LEVEL THEN RESEARCH CHEMICALS ARE NOT A VIABLE OPTION FOR YOU!!!</p><p>Background information. Swim has been a daily consumer of cannabis for the past 7 years. Over the summer swim was introduced to synthetic cannabinoids and immediately incorporated them into his daily routine. Swim has a high tolerance for natural cannabis and enjoyed the added boost that the synthetics seemed to give to the natural cannabis. Swim started off lacing cannabis with herbal blends, however, within three months no longer quite pleased with the results swim began to acquire pure jwh-xxx compounds. Swim has experience with jwh-018, 073,081, 200, as well as RCS-4. While swim was initially pleased with the effects of his experiments with jwh-018 he quickly noticed that more and more of the compound was needed to achieve desired results and within two month's time swim was ingesting up to two grams of jwh-018 in a week. Swim had heard about this amount of jwh-018 lasting other users two months or more! It is quite possible that swim was addicted to jwh-018 without fully recognizing this fact while on his binge. </p><p>*Fast forward* this thread is not about jwh-018 but I believe this background information helps set up the experience report that follows. After the DEA [proposed] ban on jwh-018, a certain internet vendor began to stock a variety of research chemicals which included the chemical 5-meo-dalt. Swim had dealt exclusively with this vendor in his experiments with jwh-xxx compounds and since jwh-xxx was no longer available through this particular vendor he decided to order the 5-meo-dalt instead. In retrospect swim's actions were foolish. Swim had no experience with tryptamines and NO SCALE ACCURATE AT THE MILLIGRAM LEVEL.</p><p>While Swim mentioned all of the routes of administration experimented with 5-meo-dalt above, swim readily reports that the oral roa is the only roa known to produce the effects outlined in this report.</p><p>Swim received a foil package marked 5-meo-dalt containing a small zip-lock baggie of a pure white crystalline like substance with a slight chemical smell via USPS. Swim was eager to test the effects of his new substance and quickly headed to the kitchen to grab a knife. Swim did not own a scale but had used the knife method with jwh-xxx compounds with little negative consequences besides the occasional bout of paranoia when dosing was a little off. Swim dipped the tip of the knife into the white substance labeled 5-meo-dalt and dug out a tiny amount, after a little hesitation swim placed the tiny white pile on his tongue letting it dissolve. This initial experiment was intended to test for negative side effects and none were reported. 6 hours after placing the tiny amount of 5-meo-dalt on his tongue swim could not report any effects resulting from ingesting the chemical. Based on this experience swim foolishly assumed that 5-meo-dalt would be 'safe' to eyeball in much the same way that jwh-xxx had been eyeballed for the past few months.</p><p>The next day swim decided to introduce this substance to his girlfriend. Swim reported that he had not personally felt any effects from ingesting this chemical but had heard reports of this chemical being similar to a low dose of mdma (reports vary) or perhaps magic mushrooms (debatable). Swim's girlfriend was very eager to try the chemical. Swim advised his girlfriend that he did not know a lot about this chemical and was unsure of what a proper or safe dose might be, his concerns were magnified in light of the fact that he did not own a scale. Swim's girlfriend advised him that he was being a 'worry wort' and accused him of 'killing all the fun'. Swim prepared his girlfriend a 'knife dose' much larger than the one he had originally prepared for himself and placed the white powder under his girlfriends tongue. Swim's girlfriend eager to experience the effects of the chemical insisted that swim allow her to take a dose on top of her tongue as well and swim complied.</p><p>10 minutes-no effects reported by swim's girlfriend.</p><p>20 minutes- swim's girlfriend reports a detachment from reality. swim's girlfriend reports that it feels as if she is in a dream.</p><p>25 minutes- swim's girlfriend reports feeling 'tripped' out and uncomfortable in her current environment which includes swim's family. Swim's girlfriend reports not being able to follow conversation going on in the room as she reports that everybody is talking in a charlie brown 'womp womp' voice. Swim and his girlfriend decide to go to the garage to smoke a bowl and calm down.</p><p>30 minutes- after one hit of the bowl (cannabis) swim's girlfriend reports feeling nauseated and decides to sit down.</p><p>35 minutes- swim's girlfriend reports despite feeling nauseated that she feels 'good' all over similar to having an orgasm. Swim notices that his girlfriend appears intoxicated and his unable to carry on a conversation in any meaningful way. Swim's girlfriend still reports being in a dream.</p><p>40 minutes- swim's girlfriend begins to violently vomit. swim becomes concerned.</p><p>42 minutes- swim's girlfriend reports that she can not breathe and begins to panic.</p><p>43 minutes-swim's girlfriend reports heavy chest pains and thinks that she may be having a heart attack. Swim's girlfriend slides out of the chair she is sitting in clutching her chest, she is no longer coherent. Swim's girlfriend hits the floor and begins to shake violently back and forth, she reminds swim of a fish out of water and swim becomes very worried!</p><p>44 minutes- Swim now scared out of his mind decides to call 911. The 911 dispatcher advises swim that his girlfriend is most likely having a seizure. Swim following the orders of the 911 dispatcher promptly clears the area in which his girlfriend is having a seizure. The total duration of the seizure lasted around 10 minutes as swim's girlfriend did not come to until the paramedics arrived approx. 10 minutes after the start of the seizure. After coming to swim's girlfriend was very confused and unable to recall the seizure.</p><p>1 hour 30 minutes. Swim's girlfriend decides to check out of the hospital despite feelings of not 'feeling real'. Swim's girlfriend is worried about the possible legal ramifications of ingesting 5-meo-dalt as she is a single mother and does not wish to disclose the real reason of her seizure to medical officials due to a lack of trust in the system.</p><p>Swim's girlfriend reports that the main effects of the chemical have now worn off although she reports a lingering dream like state that continued until the following morning after sleep.</p><p>Swim is confident that his girlfriends seizure can be attributed to an overdose of 5-meo-dalt and he is equally confident that this episode was potentially life threatening.</p><p>Both swim and his girlfriend had ingested this chemical daily for 4 days prior to the experience outlined above with negligible negative effects aside from a minor body load and a nasty chemical burn left on the tongue after ingestion (imagine drinking a beverage that is too hot). Due to the potential health concerns when dealing with this fairly unknown substance and the pure fear associated with an overdose swim would recommend steering clear from this RC as the positive effects of the 'high' associated with this drug do not out way the negative effects of an overdose.</p><p>Swim also thinks that it is important to note that it has been over 4 days since either he or his girlfriend have ingested 5-meo-dalt via the tongue and the chemical after burn is still present! Swim recommends extreme caution to those who choose to ingest via this method as this reaction clearly does not seem to be positive. Swim is not aware of the long term effects that 5-meo-dalt may have when ingested via this method and is not willing to experiment any further. Also swim is curious to know what this substance may do to other bodily organs if ingested through perhaps a gel cap. This S*** is harsh and swim would not be surprised if it ate through your organs like acid, but this is just swim's opinion.</p><p>I hope this report is useful for those who were considering ordering this substance. IT IS NOT WORTH IT.</p>"
}
