{
 "title": "Dreaming on Salvia",
 "author": "Pennumbra",
 "citation": "   Pennumbra. \"Dreaming on Salvia: experience with Salvia divinorum (ID 8905)\". Erowid.org. Jul 7, 2002. erowid.org/exp/8905",
 "substance": "Salvia divinorum",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "6 drops",
   "sublingual",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8905",
   "Male",
   " ",
   "Not Given",
   "Jul 7, 2002",
   "Views: 6742",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nIt had been a rather stressful day emotionally. I'd just returned from vacation and was still making the reentry to normal life. I'd gotten past all the issues that had come up that day, but it was late--about 11:30 PM--and I was getting quite sleepy. But I'd been looking forward to the salvia experience the whole time I was away, so I decided to go ahead. I did the usual physical preparations: brushing tongue and mouth surfaces with toothbrush, rinsing with mouthwash. I also spent a few moments in prayer, as I try always to do before salvia. (Believe it or not, I'm a moderately conservative Christian.)</p><p>The dilution was enough to reduce the burning sensation of the tincture's alcohol content. It also greatly reduced the salivation I'd experienced before while holding the tincture in my mouth. I swallowed after six or seven minutes.</p><p>By this time I was already very sleepy so I went to bed immediately and began to drift off to sleep. Even before I had settled into bed, though, I could already feel a little of what I call 'slow vertigo'--the feeling that I'm slowly rotating and drifting in free space, and the gravity-like sensation many others have described with salvia.</p><p>Before long I was far enough into both sleep and salvia that I felt uncertain whether or not I was asleep and dreaming semilucidly, or just experiencing salvia's effects. My first clear, visual salvia effect this time was as follows,</p><p>I stood somewhere outdoors surrounded by a landscape of nondescript trees, hills, and small buildings. My arms extended, I felt myself slowly rotating about one or more unfamiliar axis or axes. As I rotated, my range of senses, even my body itself, seemed to sweep outward through my fingertips, to encompass vast expanses of the space and time surrounding me, even the lives, joys, and sorrows of others as well as myself. The spacetime-scape seemed laden with memories, and as my sense-fingers swept across it I caught brief deja-vu flashes of sights and emotions tied to each point I touched.</p><p>Briefly, I was confused about what was me and what was not-me. Certainly I don't really include in myself the entire scope of things I was experiencing. Then I remembered: 'Oh yeah, it's the salvia.' I managed to awaken briefly and opened my eyes for a sort of sanity check. Sure enough, the familiar, ordinary bedroom still stood there, with me still snugly in bed.</p><p>I can only vaguely and briefly describe the remainder of the experience. I was swept with cascades of sweet and bitter emotions both my own and not my own, deluged with flashes of spreading landscapes known and unknown (yet deja-vu familiar again), and carried up by unseen wings into a realm where some understanding of all this was possible. And this is what I learned:</p><p>God, as it were, had spread out before me a glimpse of the cosmos as He saw it, but infinitely compressed and folded up to make it accessible to my small self. Compared to all that vastness, and especially to Him, I was a mere infinitesimal. Yet He had made me, and all those creatures 'in His image' (as Genesis puts it), to live and experience there, and had provided that they and I might someday realize His penetrating understanding of and empathy with our own joys and pains. By no merit of mine, I had been given a tiny glimpse of it all.</p><p>For obvious reasons I don't know how long the peak of the experience lasted, but subjectively, the flow of time seemed almost completely suspended.</p><p>There was an aura of sacredness to the experience when I eventually came out of it enough to awake normally. When I returned to sleep, my dreams were very vivid but entirely normal.</p><p>It is not an experience I expect to repeat, but one whose memory I will ponder for years.</p>"
}
