{
 "title": "'Ban-Compliant' Spice You Tell ME",
 "author": "TravisB_from_Indiana",
 "citation": "Citation:   TravisB_from_Indiana. \"'Ban-Compliant' Spice You Tell ME: experience with Spice and Synthetic Cannabinoids ('Funky Monkey') (ID 89056)\". Erowid.org. Jan 23, 2011. erowid.org/exp/89056",
 "substance": "Spice and Synthetic Cannabinoids ('Funky Monkey')",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "  T+ 0:20",
   "  ",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "  T+ 1:50",
   "1 cig.",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 89056",
   "Gender: Male",
   " ",
   "Age at time of experience: 28",
   "Added: Jan 23, 2011",
   "Views: 9832",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: This report contains a common misinterpretation of the DEA's Nov 24 2010 notice of intent to emergency schedule five synthetic cannabinoid receptor agonists. For current law updates about Spice-like products and synthetic cannabinoids, see Spice Law Page] \r\nWhen I first found out about 'SPICE' or Synthetic Cannabinoids. I thought, 'yeah right'...Well in September of 2010 (long before this experience) I was first introduced. So when I found out the DEA, at the end of November 2010, put 5 of the highest potent Cannabinoids (JWH-018, JWH-073..etc..) on the Controlled Substance Act [See Erowid Note above], making it a schedule 1 drug, which by the way is the worst list of schedule drugs to be on.\r\n                       ***THE PURCHASE***\r\nAfter being informed of this before it happened by my Local Head Shop Owner, , he assured me that there will be 'BAN-COMPLIANT' Cannabinoids/Synthetic Cannabis. So when the Act was signed, I figured it would be a waste of time to go. However, one day I went. The stuff I used to buy 'Funky Monkey' was still there, however I didn't notice the new sticker on the bottle. It said, 'Ban Compliant  Does Not Contain JWH-018...etc' So like anyone else, I was indeed skeptical. The spice did in fact look different. So I purchased the same stuff I always have for 4grams for $15.99, and to me that is a very good deal.\r\n                        ***THE EXPERIENCE***\r\n7:00 pm.  After getting into the car, I kept saying, 'DAMN!! There are no refunds here, I Hope I didn't make a money mistake.'\r\n..I didn't want to wait until I got home, so..\r\n7:10 pm I rolled a Pin Pin Pin, and I mean small little joint of it. Just enough to taste it!! As soon as I tasted the first hit, I knew it was different. \r\n(7:30 (pm)  smoked a couple regular sized bowls.  \r\n(9:00 pm)  I rolled a Regular Sized Joint. \r\nI have to admit, it does the same thing as the ILLEGAL kinds, that the DEA chose to make ILLEGAL at the end of Nov. 2010. It takes maybe 3 more hits than normal to achieve my normal level of high. So in other words, the 'BAN-COMPLIANT' Synthetic Cannabinoids/Spice is not as potent, but trust me, it does what I am expecting. TRUST ME!!\r\n11:45-11:55 pm (2 or 2 and a Half Hours after the Regular Sized Joint) feeling stable and good while typing this. It is amazing how little I need to achieve a 'good high'. A half or a whole  Regular Metal Bowl is all I need, and my tolerance is some-what high. I do want to smoke another couple of bowls before I call it a night.\r\nSo to put a long story, and a good one, short.. The 'BAN-COMPLIANT' Synthetic Cannabinoids/Spice does do what I want and expect it to do, however it is NOT as potent as the ones that are BANNED by the Drug Enforcement Agency. Would I Recommend It To Someone Else? Yes, I guess all Cannabinoids do the same thing, just some do it better. LOL! Overall, My Experience with Synthetic Cannabinoids on Januaray 4th, 2011 was worth the money spent.\r\n***********Now I am anxious to know what Chemical (JWH-018,JWH-073,etc..) is in the 'BAN-COMPLIANT' version.***************\r\nAll in All, I enjoyed my night!!\n\n\n"
}