{
 "title": "Entertainment While Sleeping",
 "author": "Alco302",
 "citation": "   Alco302. \"Entertainment While Sleeping: experience with Kava (ID 8912)\". Erowid.org. May 12, 2004. erowid.org/exp/8912",
 "substance": "Kava",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "4 capsls",
   "oral",
   "Kava",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "8912",
   "Male",
   " ",
   "Not Given",
   "May 12, 2004",
   "15459",
   " "
  ]
 ],
 "report": "<p>I have been using Kava for about a year.  This experience took place about 5 days ago when I used Kava to get my self asleep one night.  I was in bed at about 11:30 pm when I swallowed the 4 capsules (with 70% kava-lactones each); after they were down I laid back and waited for them to kick in.  After watching TV for around a half an hour I felt the effects coming on.  Thats when I turned the TV off, rolled over and fell asleep in a matter of seconds, around 12:00 am.  </p><p>When I awoke the next day around 1:00 pm I was quite rested and thinking to my self that I havent slept like that in a long time.  But that all faded when the memories of the dream that I had that night came to light.  That dream, was probably the single most mind-blowing experience I have ever had.  As far as I can recall the dream lasted from the moment I fell asleep to the point of awakening.  The thing that was weird about the dream was that I was totally immersed into it. I could control my actions and was quite coherent in the dream.  It felt like a movie where I was the star, with the point of view of a camera following me around.  The dream was complete with each of the 5 senses and it was more detailed than any other dream I have ever had.  I even felt emotions and pain in the dream.  Its hard to put words to this experience so please excuse the bland details.</p><p>Over all, the experience didn't change my life but provided me with some entertainment while I was sleeping.  I have had very in-depth dreams before but none as far in as this was.  I was in a very clear and levelheaded mind set when I took the pills, and the experience was set in one of my more favorite places, my bed.  I swear by Kava, I feel its a safe and effective way to relax at the end of a long day and then eventually fade off into a deep, peaceful sleep.</p><p>Alco302</p>"
}
