{
 "title": "Annihilation: Entering the Warehouse",
 "author": "Panty",
 "citation": "   Panty. \"Annihilation: Entering the Warehouse: experience with Salvia Divinorum (60x extract) (ID 89135)\". Erowid.org. Apr 1, 2011. erowid.org/exp/89135",
 "substance": "Salvia Divinorum (60x extract)",
 "bodyweight": "119 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 89135",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Apr 1, 2011",
   "Views: 10734",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuring the summer of 2009, me and my partner decided to try some 60x Salvia . She wasn't as experienced as me, only having had lower extracts twice before, whereas I had at least a dozen trips on various extracts, 5x-40x (all positive, fun experiences). This trip was something else altogether, I feel it's going to take a good portion of my life to understand what exactly happened. <br>Just to get the boring bit out of the way: it was late at night, summer's eve, in mine and my girlfriend's flat, when I decided to take a hit. We were in the living room, a space I was very comfortable in mainly because the room was red with my partner's paintings painted directly onto the walls, something my parents would have never let me done at home. I expect we'd spent the evening with friends as usual, probably smoking a few joints earlier on in the day/eve.<br>The first section of the trip is a blank. I have vague memories of reality splitting open, taking me into a cartoon-like dimension. Eventually I come out in what I can only describe as a huge warehouse-like place. I was way out of my body, in a completely different world. Here my personality was moving along a vast conveyor belt land, amongst hundreds of other personalities, represented by faces on square panels. My instincts were telling me that this is where people go when they die. If you think of a shop and think that the main bit where you sell stuff is life and then the bit where all the boxes of food are sorted is the afterlife, then you should get the gist, that's what was connoted. I remember feeling a mixture of fright and extreme sadness at this point, mostly at the fact that I didn't get to say good-bye to my life and friends and because it was all over so abruptly.<br>Then it dawned on me that my old personality/life wasn't real, it was just an imprint, one that's used over and over again by this system on people alive in this world. This concept is quiet hard to explain but it was like there is a finite amount of these personalities (the square panels) and each of us is nothing special, nor unique, just part of repeated pattern.<br>At some point, the personalities started to come to what I can only describe as the 'teeth of the machine'. You could see in front that as the personalities went in they got completely crushed and chewed up. The 'teeth' yank you a bit closer, than pushed you back a bit, but always pushing you in closer more than they pushed you back out. It was terrifying. I think it's safe to say that pain exists in that realm, but it's a different sort of pain then what we encounter here. Again memories are vague, but I think this part of the journey was in 2D.<br>This is where it gets a bit more conceptual and even harder to explain. Imagine a long block of wood. Slowly, one end of the wood is burning away, disappearing into nothingness. This block of wood, represents every moment of my life, all of which are happening at once. So at the start of this block, you have me as a baby, and at the end, my death. This block is meant to always exist as a full block. I was looking down on all these parallel universes from above, watching as this force destroyed my timeline, starting at the end of the block, wiping out my future and slowly moving into my past, erasing it. Then I honed down on one of the me's about to be destroyed.<br>Everything went black. I had no sense of scale. Neither big nor small. I could have been there for ages, I'm not sure. But I believed then that I was being giving a glimpse of my future. That when this force reaches this one universe of all the fractal universes, the one I'm writing and living in now, everything will stop and that is all I ever will know, this horrible nothingness.<br>Again, my recollection is hazy, but I believe at the end of my trip I came out of this black space and saw hundreds, if not thousands of parallel realities, all of them me, in my flat, tripping away. It was like the same image repeated in broken glass. It took awhile, but slowly I honed down on one these realities and went back into my body.<br>When I came back to 'reality', it's safe to say that I was shocked, confused and afraid. However, as time went by my sense of well-being sky rocketed. Maybe I was just happy to alive, but, to be fair, Salvia generally leaves me in a rather happy state. Research with Salvia and depression is something I hope people will look into in the future. I remember seeing a businessman walk out of a news agent the next day and I couldn't help laughing at him. His life seemed so stupid and meaningless. <br>While I was fine after my trip, my girlfriend was left shocked and confused for weeks. I didn't think her taking a hit after my trip was a good idea but I knew she would have resented me for a long time if I didn't let her go on a journey. <br>I feel like 60x is too much and I just hope that the plant was giving me a smack on the bottom for being so stupid as to take such a strong extract of it. I hope I can return one day to the positive places I've experienced with Divinorum. It goes without saying, but becoming a flower is a much nicer experience than being utterly annihilated.\n\n\n"
}
