{
 "title": "Strange Pseudo-Trip with Odd Chemicals",
 "author": "Robert Arctor",
 "citation": "   Robert Arctor. \"Strange Pseudo-Trip with Odd Chemicals: experience with Cannabis, Gabapentin & Unknown (MDPV?)  (ID 89171)\". Erowid.org. Jan 31, 2011. erowid.org/exp/89171",
 "substance": "Cannabis, Gabapentin & Unknown (MDPV?) ",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "insufflated",
   "Unknown",
   "  T+ 6:00",
   "  ",
   "smoked",
   "Cannabis",
   "  T+ 6:00",
   "  ",
   "insufflated",
   "Unknown",
   "  T+ 6:00",
   "  ",
   "oral",
   "Pharms - Clonidine",
   "  T+ 6:00",
   "1500 mg",
   "oral",
   "Pharms - Gabapentin",
   "  T+ 8:00",
   "  ",
   "smoked",
   "Cannabis",
   "  T+ 8:00",
   "  ",
   "oral",
   "Pharms - Gabapentin",
   "  T+ 15:30",
   "1/2 ",
   "oral",
   "Pharms - Clonidine",
   "  T+ 0:00",
   "750 ml",
   "oral",
   "Alcohol - Beer/Wine",
   "  T+ 0:00",
   "1.5 mg",
   "sublingual",
   "Melatonin"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 89171",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Jan 31, 2011",
   "Views: 3435",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nRecently there have been a number of 'bath salt' products showing up around the head shops. There is quite a variety, but the one I chose to ingest was called 'Ivory Fresh' and came in a small, round, plastic container of 250 mg. Now, I can only guess at which drug the product actually contained. It's definitely some sort of legal stimulant - maybe bk-MBDB, or MDPV? [Erowid Note: Without knowing the identity of the substance(s), it's impossible to verify legal status. Some analyses of 'legal highs' have revealed the presence of controlled substances.]  For all I know, it could be a mixture of several different substances. All I can say for sure is that it was an off-white, tannish-yellowish powder with a distinctive 'fresh' aroma, that is active by the insufflated route at doses well below 250 mg.<br>I've enjoyed this substance several times so far without killing myself, but this experience report will document a pseudo-psychedelic trip that I experienced after combining Ivory Fresh with gabapentin (which I have taken many times before).<br>A little of my drug background: I have experience with a wide variety of psychoactives: Many different benzodiazepines, opiates, meth/amphetamine, cocaine, alcohol, pure MDMA, pure MDA, DXM, nitrous oxide, LSD, mushrooms, and salvia. And probably some one-offs that I'm forgetting. At the time of this experience, I was taking no medication on a regular basis. I had been a daily pot smoker for years, but I had abstained for a week or two prior to this experience.<br>----------------------------------------------<br>Now, on to the report of the events as they happened. On this particular morning, I was due in court to answer for a charge of marijuana possession. I tried to maintain a positive mindset despite the gravity of the situation. I decided to consume Ivory Fresh on my court date to be more awake, amiable, and to be in higher spirits.<br>8:30 AM.<br>I find cheap parking a few blocks from the courthouse. In my car, I snort a nice big bump of the Ivory. By the time I walk to the courthouse, go through the metal detector, and up the elevator to my assigned courtroom, it's hitting me in full force. I get all the effects I usually experience - increased energy, increased sociability/talkativeness, and a pleasant euphoria. The euphoria isn't overwhelming like with MDMA, and it doesn't come close to good cocaine or methamphetamine, either. It gets me halfway there, but if I try snorting more than a good dose, I only become jittery and raise my blood pressure and heart rate. There is no corresponding increase in euphoria.<br>11:00 AM.<br>I go before the judge and we discuss some interesting topics. About how he smoked in college. We talk about roach clips, blunts vs. joints, dro vs. schwag, and he even makes a reference to Cheech & Chong. That made everyone in the courtroom laugh. I took the plea deal and plead guilty for possession of marijuana, and was sentenced to 6 months of probation. He said he'd give me 30 days before any drug test, to give me a chance to clean my system out. To me that means, 'Smoke up today! Quit tomorrow.'<br>2:30 PM.<br>When I finally make it back to my side of town, I meet up with my homegirl who has some herb. We smoke a few joints, and we both snort some more Ivory Fresh. I take a larger dose than I intended, because I tipped the container on accident while snorting it, which makes all the stuff fall over to one side and mix in with the bump I had set aside to snort. Feeling my blood pressure rise, I ask for and receive an 0.1 mg clonidine tablet, which I take immediately. I feel my blood pressure drop a little: relief! She also gives me 1500 mg of gabapentin, that I also take.<br>4:00 PM.<br>I'd decide to go to the college book store to try selling books for money. A friend I've tripped with several times just happens to pull into the parking space next to me, so I say, 'Hey, let's split the rest of this Ivory Fresh and snort it', and we promptly do so. After discovering the book store is closed, he follows me back to my homegirl's house to smoke.<br>4:30 to 5:30.<br>We smoke some more herb, and my homegirl gives me 600 or 900 mg more gabapentin. Pretty soon I decide to leave, and by this time my driving is getting somewhat dangerous. I can't focus very well on the task of driving, and I get just a hint of double vision from time to time. But, I manage to make the drive home while staying in the lanes. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] <br>6:00 PM.<br>I get home and step out of the vehicle, and realize that I can't walk very straight. I've had that effect from large doses of gabapentin before.<br>But once I get inside, the really interesting effects start. I start getting classical closed-eye psychedelic visuals, like Albert Hoffmann described seeing when he took his famous bicycle ride. Sitting in front of the computer, I can't help but close my eyes (it feels very satisfying). When my eyes are closed, I see visions, places and scenes, different things that change up every few seconds. They aren't as brightly psychedelic as with LSD, the visions seem to be in grayscale. Toned down, less vivid. Nonetheless, here are these random scenes flashing behind my eyes. I decide to lay down in bed and just enjoy the trip and the visuals.<br>12:00 Midnight.<br>I awake in my bed, the clock reads midnight. I can't believe I passed out for so long. I can't believe I'd passed out at all - the Ivory has a tendency to keep me awake for a looong time.<br>In order to get back to sleep, I drink a bottle of Boone's Farm wine (750 mL, 7.5% abv) and take half a clonidine tablet (0.05 mg). I also take 1.5 mg of melatonin sublingually. By 1:30 AM, I've finished my Boone's Farm and crawl back into bed and sleep the rest of the night.<br>----------------------------------------------<br>Post-trip analysis.<br>Gabapentin and Ivory Fresh are interesting substances on their own, but both of those plus weed, made for a very surprising pseudo-psychedelic experience. It wasn't anything life-changingly profound, like what can happen with LSD or mushrooms. But it had some visual effects and tactile sensations that were reminiscent of a full-blown psychedelic trip. Whatever kind of mickey-mouse MDMA analog is in Ivory Fresh, I believe contributed greatly to the visuals. It's got to have some kind of effect on the serotonin system.<br>Gabapentin is a bit of a downer (sedative) on its own. Combined with weed it's even stronger. But I was very surprised that it could bring me to sleep, after consuming so much of a strong stimulant. I guess I underestimated the strength of several grams of gabapentin. Gabapentin is a marvelous drug on its own, and especially combined with benzodiazepines. I won't go into more detail here, but I have used gabapentin on and off for a few years, and will continue to do so.<br>Overall, I enjoyed the experience. However, I'm not willing to repeat it. Comparing the effects I get from Ivory Fresh with what I've read of MDPV, leads me to believe that what I snorted was primarily diluted MDPV. (Although I could be completely wrong!) In any case, it felt *very* hard on my body - it's not something that I plan to use again.\n\n\n"
}
