{
 "title": "Help With Opium Withdrawal",
 "author": "Tritogeneia",
 "citation": "   Tritogeneia. \"Help With Opium Withdrawal: experience with Opium Poppy Pod (ID 89185)\". Erowid.org. Nov 9, 2012. erowid.org/exp/89185",
 "substance": "Opium Poppy Pod",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Poppies - Opium",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 89185",
   "Female",
   " ",
   "Not Given",
   "Nov 9, 2012",
   "Views: 4095",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First some background.  I have a poppy tea habit that goes back 15 years, to the time when pods were a well-kept secret and could be bought at Pier One for $7.50 a dozen.  I truly hate the rising profile (and cost) of tea use and I particularly resent the weenies presenting themselves for medical detox after developing a small-to-medium habit; nothing is surer to alarm authorities and invite the attention of law enforcement.  If you can't handle a little pain, don't get addicted to opiates; it's as simple as that.  Be a weekend warrior, be an internet poseur; I don't care.  As a regular user, however, I experienced withdrawal, likely more than once, and it hurt.</p><p>I recently discovered, initially by accident, a way to reduce the pain.  What happened was this: right before Thanksgiving, a freak snowstorm hit my isolated community, which was completely unprepared.  Unplowed, the back roads turned to ice, while more ice brought down trees and power lines, blocking the main roads.  The UPS delivery I wanted and needed was delayed for days, and I was already out of pods.  All I had were some once-used grounds in the freezer and some stems, and I was in no mood to detox just then.  So I boiled up the grounds the first day, the stems twice the second day, then the grounds again the third day.  I didn't feel great, but I was okay: a little weak and sweaty, but far from full-on w/d.  During the night of the third day, however, I woke up in early w/d.  Feeling a bit panicky, I added the stems to the grounds and boiled them again; the brew was barely yellow in color and completely tasteless, but the sensation of w/d receded, and I fell back asleep.  I boiled the whole mess again in the morning and drank the watery result, amazed that it was holding me.</p><p>Perhaps I should pause to say that I was dealing with a 3-year run of 20-30 large pods per day, reduced to 15-20 when the supply dried up and prices soared this fall.  Not the most addicted I've been but no baby habit either.</p><p>The afternoon of the fourth day, I walked out to see how icy the roads were and pick up some groceries.  On my way home, I saw a UPS truck, flagged it down, and, to my immense relief, finally got my package.  As I was climbing the still-icy hill to my house, marveling at my great luck, I suddenly noticed that I felt good--and not just because I had a box of pods in my arms.  The sensation was like the initial return of well-being after the miseries of w/d, and I asked myself whether it was possible that I had managed to taper off so dramatically that I weaned myself.</p><p>Nah, I decided, brewing up a good strong pot of tea.  Not possible.  Normally, I can count on 5 days of complete wretchedness and two weeks or more of insomnia.  I was probably just feeling the little boost that I sometimes get right before real w/d sets in.</p><p>Fast forward six weeks, and now I do want to detox.  I have some things I want to do that require all of my brain cells firing smartly, and I'd also like to scale back my tolerance.  Remembering my Thanksgiving experience, I decide to test the possibility that a radical taper dramatically cuts w/d time, though I prepare for a regular detox as well (clonidine, immodium, feigning 'flu so I'll be left alone).  I've been saving once-used grounds and stems, though I'm not very confident, as my habit has crept up a bit.  So I draw the sequence out some:</p><p>Day 1: Second boil of 4-5 days' pod residue.  Feel fine.</p><p>Day 2: Third boil in the morning, fourth boil at night.  Lethargic but fine.</p><p>Day 3: Fifth boil in the morning, sixth at night.  Some nocturnal restlessness, hot & cold sweats, but okay.  Still sleeping.</p><p>Day 4: First boil of stems (about 100 3-6 inches each).  Feel good.</p><p>Day 5: Second and third boils.  Very lethargic but holding. Some nocturnal restlessness, hot & cold sweats, but okay.  Still sleeping.</p><p>Day 6: Fourth and fifth boils.  See below</p><p>The sixth night, I woke up with restless legs, churned them a bit, then fell back asleep.  The next time I woke it was morning, and I felt tired but okay.  I could tell immediately that my body was in post-acute w/d, which, for me, just means insomnia, sneezing, and cravings. So I threw away the now-useless plant matter, and called it a detox.  That was four days ago, and those few hours of leg agitation were the worst my w/d got.  I won't say I'm sleeping well, but I do manage to doze off for a few hours each night, nothing like the 18 straight days of increasingly psychotic wakefulness that marked my worst regular detox.</p><p>Truth is, I'm amazed this technique worked.  Do the increasingly watery re-boils have a placebo effect, or do they supply just enough opium to keep the locus ceruleus neurons relatively calm?  Is there something unusual about me, or will this kind of taper work for others?  I suspect it's unique to long-acting, multiple-alkaloid opium, as I know a tiny fraction of heroin won't hold me when I have that kind of habit.  </p><p>So, fellow opiophiles, try this taper before you go running to your doctor for bupe.  It's easier, cheaper, and likely to keep you flying under the radar.  Don't want to fly anymore?  Fine, but please have a thought for those who do.  In the current climate of prohibition, there aren't many drugs as safe as this one, certainly not in the opiate family.</p>"
}
