{
 "title": "Overwhelmingly Intense Experience",
 "author": "sir_jeans",
 "citation": "   sir_jeans. \"Overwhelmingly Intense Experience: experience with Cacti - T. bridgesii (ID 89217)\". Erowid.org. Feb 9, 2011. erowid.org/exp/89217",
 "substance": "Cacti - T. bridgesii",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE:",
   "450 g",
   "oral",
   "Cacti - T. bridgesii",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 89217",
   "Male",
   " ",
   "Age at time of experience: 23",
   "Added: Feb 9, 2011",
   "Views: 12900",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>INTRODUCTION:</p><p>What follows is an account of my first strong experience using psychedelic cactus. I consumed what I expected to be a low-to-mild dose of T. Bridgesii. However, it turned out to be extremely potent. The experience lasted all night and was so overwhelming that I could barely handle it. This was largely because I was in considerable pain and discomfort from some injuries I had. I have tried to write this experience report in a more-or-less scientific manner. For those who are not interested in the details of my background, the preparation of the cactus or the set and setting, skip ahead to THE EXPEREINCE below. </p><p>BACKGROUND:</p><p>I am a highly educated 23-year-old male. I am generally a happy, successful, confident and highly resilient person. Although I have experienced a couple of Level 3 trips on Mushrooms and LSD (as well as having tried Ecstacy, Ketamine, Nitrous Oxide and plenty of Marijuana), my only other cactus experience resulted in nothing more than a headache and nausea. This failed attempt followed the ingestion of about 18 of T. Pachanoi about a year ago in the form of a tea. I was recently given some cuttings from an old, mature T. Bridgesii cactus (Note that it was not the monstrose form). Having heard that this species can be highly potent, I decided to be cautious with my dosage. I used a midsection cutting that weighed 450g fresh and was about 5 long. Contrary to my expectations, the trip that ensued was overwhelmingly strong. This might be partly attributable to my method of preparing the cactus.</p><p>CACTUS PREPARATION:</p><p>The fresh cactus was skinned. Care was taken not to waste any of the dark green tissue directly underneath. The core was removed, and discarded along with the skin. The remaining plant material was blended with water. I didnt use any other ingredients like lemon.</p><p>I tried to strain the resulting green froth. I had heard that heat might degrade mescaline somewhat, and realized that the first (uncooked) batch of filtered cactus juice would probably contain a significant amount of mescaline. I hoped that I could then simmer this first batch for only a half hour or so to get it down to a manageable quantity, thus minimizing its exposure to heat, whilst I boiled the remaining solids separately for several hours. However, the blender had whipped a lot of air in with the cactus slime, making it virtually impossible to separate liquids from solids. </p><p>I put (all) the contents into a large pot and cooked it for about 30 minutes. Over this period, the slime seemed to break down and the air escaped, leaving a liquid with a more normal consistency. I was able to strain this (using a T shirt), and in line with my original plan, I put this first batch of liquid aside. I then put fresh water in with the solids and cooked them on low for about 3 hours. I then strained this, producing a second batch of liquid. I once more added fresh water to the solids and boiled them for another 30 minutes, this time on a fairly high heat. I then strained off the liquid and discarded the solids.</p><p>I now had three batches of liquids, each in a separate pot. I very lightly simmered them until most of the liquids evaporated away. When only a half an inch or so of liquid remained in each of the pots, I combined them into one (small) pot and simmered them very lightly until only a sticky black tar was left. In the final stages of doing this, I would light the gas under the pot for only 5 seconds or so, and then leave it for 10 minutes or so for the heat to help evaporate the moisture content of the tar. This was then laboriously scraped out using a butter knife (a box-cutter blade was ineffective), and then put into capsules. Rolling the tar into a long thin sausage and then freezing it made the process MUCH easier. I ended up with 16 00 capsules filled with cactus tar.</p><p>SET:</p><p>I had been dealing with a debilitating leg injury for several months that had prevented me from being capable of sitting down or otherwise putting weight on my arse. As one can no doubt imagine, this was (and is) extremely inconvenient for me. From standing up so much (to avoid sitting) I had developed some upper back pain, and I also had bruised my left heel to the bone by going on a long walk in inappropriate footwear earlier in the day. Although these kinds of pains generally dont affect my happiness or my spirits, they did strongly influence my experience with the cactus.</p><p>SETTING:</p><p>The whole experience took place in my bedroom. This is a place where I feel comfortable  it is a good size and has warm, pleasing lighting from my lamps (lighting is important to me, especially with psychedelics). It has one large window and an even bigger glass sliding door leading out to a balcony where my extensive cactus collection resides and where one can enjoy the amazing view of the plains below leading to the ocean on the horizon. My dad was also in the house, around whom I am completely comfortable discussing and taking psychedelics (although I rarely do the later). He mostly left me to my own devices. It is a warm and pleasant night.</p><p>THE EXPERIENCE:</p><p>10.00pm </p><p>I consume half of the tar-filled capsules. I swallow them with unsweetened orange juice, hoping that its acidity will benefit my stomach by neutralizing some the alkalinity of the cactus. </p><p>10.30pm </p><p>I consume the other half of the capsules.</p><p>11.00pm </p><p>I can feel a mild buzz and feel a little intoxicated. My stomach feels pretty ok. I listen to some music while I wait for the cactus to kick in.</p><p>11.30pm</p><p>The buzz is getting more intense. I try and play guitar, but my stomach feels just a little too woozy for me to want to continue. I lie in bed.</p><p>12.00pm </p><p>Stronger effects are kicking in. I feel really quite affected, and visual distortions like warping of objects are increasing in intensity. I am surprised that it is so strong, and (naively) feel glad that it is unlikely to get much stronger.</p><p>12.30pm </p><p>Fuck! By this point it is getting very, VERY strong. Colors are everywhere, everything is warping and my mind is going into overdrive. This was perhaps the most pronounced effect for the night  having my mind in overdrive. I feel quite uncomfortable and am still in bed. The only tolerable positions are lying on my stomach or on my side.</p><p>1.00pm </p><p>It is still getting stronger. It is a challenge to handle it. I have limited control over my thoughts  whatever I think of becomes extensively elaborated upon by unconscious cognitive processes that are beyond my control. They have a tendency to be slightly ominous (but not intense or dark enough to be frightening). There was a definite visual element to this, and it didnt seem to have much connection to whether my eyes were open or closed. I guess it could be described as overdrive daydreaming and it only really happened when the lights were off. Whenever these elaborate visions became ominous, I tried to shift my thoughts to something new and unrelated. But inevitably, the tranquility of what I chose to think of became corrupted and elaborated into something ominous or uncomfortable. For example, at one point I started thinking about the serenity of a nice, warm, calm beach. But within 10 second or so, my vision transformed into a scene where I was clinging to a flimsy raft out at sea, being buffeted by endless waves and wind during a violent storm. </p><p>I am in great discomfort because of my leg injury, my stomach feels very woozy (but not quite nauseous) and I generally feel as though I dont know what to do. I watch the clock waiting for the experience to end. It is bearable, and I am handling it ok, but I just dont really want it to be happening anymore. The minutes pass by agonizingly slowly.</p><p>1.30pm </p><p>I seem to have finally reached a plateau. I try to make myself throw up. My stomach doesnt want to let go of its contents, and only gives up a fraction of them despite my best efforts. This brings me no relief. I ask my dad if he can make me a lemon and ginger tea. He kindly does this, and it helps somewhat. Despite the intensity of the experience, I can still have a normal conversation with my dad and am quite lucid. </p><p>2.30pm</p><p>Im still in bed and its still incredibly intense. I can feel the alkaloids in my flesh, especially in my hands. It makes me feel a bit like how characters in horror movies must feel when they are just about to transition into a vampire or a warewolf or something. I can feel it coursing through my body, and it still has a very firm hold on me. I have been feeling compelled to tightly clench my hands and my jaw. Every time I do this, I release the tension very soon after because I want to try and relax. </p><p>I look at the fan mounted on the ceiling. It jumps around a bit, and then starts to rotate  not as though it was turned on, but so that the blades on one side were turning down towards the floor, whilst those on the other side turned up towards the ceiling. My brain struggles to pull this off, and my percept of the fan snaps back to normal. </p><p>I try to relax and let myself go. Several times I felt almost comfortable until something strange happened  an ear-piercingly loud buzzing sound (lasting a second or two) blasted me out of my near-relaxed state. It felt like an electrical storm in my brain, and it happened several times during the peak. Its hard to express in words just how intense this was  it felt like someone had removed the top of my skull and pressed a few 9 volt batteries right onto my brain (it didnt hurt though). It wasnt worrying or scary, but it was extremely disruptive and disturbing. I had never experienced anything like that before. The mescaline seemed intent on making it impossible for me to relax or get comfortable.</p><p>3.30am </p><p>I can feel the mescaline slowly releasing its grip on me, but the effects (mainly mental overdrive wooziness and visuals) are still quite strong.</p><p>5.00am </p><p>I am still in bed and the intensity is waning. It is becoming more tolerable. I eat a nectarine, but not because I especially want to  it just seems like I probably should. I doubt this probability several times while eating the nectarine, and I dont finish it. I lie down again and resume waiting for the experience to end.</p><p>6.00am </p><p>Its dawn now. I am now in control of my mind once more  the raging storm has passed. I go for a very short walk and eat half a banana while watching the sun come up. It is very calm and beautiful. I sit down, but physical pain and discomfort prompts me to go back home after about 10 minutes. I have a shower and then go back to bed. I manage to fall asleep by about 7.00pm</p><p>12.00pm</p><p>I wake up. I feel pretty ok except for the effects of sleep deprivation. The mescaline doesnt seem to be affecting me at all anymore. I take a couple of paracetamol tablets to insure against a headache. I eat a good breakfast and have no trouble driving, cooking etc for the rest of the day.</p><p>COMMENTARY:</p><p>The whole experience was far more intense than I had expected. I thought I was in for a fairly mild experience. My physical condition was not appropriate for the experience I had, nor was my mind prepared for it. Also, I would have preferred to trip during the day. I think that the inappropriate conditions under which I took this large dosage caused me to be consumed by discomfort and feelings of poor wellbeing. These things in turn prevented me from being able to explore the psychedelic experience as I would have liked to  I would have very much liked to go for a walk, do some meditation, contemplation, play/listen to more music etc.</p><p>From my stomachs perspective, the experience was a lot better than I might have expected. The nausea was not particularly strong, and there was no stomach pain. Putting the cactus into capsules was well worth the effort. I did not taste it at all, not even when I burped or when I threw up. Infinitely better than the horrific ordeal that is drinking cactus tea. </p><p>Despite the unpleasantness, I feel that the experience was worthwhile. I feel a little more mentally strong after enduring it. I no longer feel nervous about taking cactus, because I have proved to myself that I can handle even a very large dose under poor conditions. I have also seen first hand just how powerful it can be, and this makes me want to explore it more. I still have many meters of this cactus left, and I look forward to having a lower dosage (300  350g fresh) under better conditions.</p>"
}
