{
 "title": "Mentally Stimulating but Lacking",
 "author": "MorningTripper",
 "citation": "   MorningTripper. \"Mentally Stimulating but Lacking: experience with JWH-018 (ID 89219)\". Erowid.org. Dec 12, 2013. erowid.org/exp/89219",
 "substance": "JWH-018",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "JWH-018"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 89219",
   "Gender: Male",
   " ",
   "Age at time of experience: 39",
   "Added: Dec 12, 2013",
   "Views: 289",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPurchased 1g pure JWH-018 to compare with mj as an economical alternative.<br>Usual MJ use is once every other day, similar alcohol use, no other drugs used (except tobacco). MJ use is primarily for creative stimulation/mental buzz and comfortable body feel (body glow).<br>Overall review:<br>PROs -<br>- a good mj alternative for the mental effects, <br>- very manageable duration (1.5h),<br>- fantastic economic advantage ($50/3 month daily use),<br>- Still legal in many states<br>CONs - <br>- Dosage control, prone to unpleasant trip with excessive dose<br>- Lacking mj's pleasant body effects<br>- Headaches and possibly other blood pressure related effects<br>Detailed experience:<br>The pure jwh-018 arrived as a white grainy powder in a small Carmex-like jar. Other experience reports indicated 3-10mg as the dosage, and that it was easy to overshoot the dosage by many 10s of mg. So, a dosage calculation was needed. Handling the pure confirmed it was difficult to get a consistent amount using tools at hand (matchsticks, paper fold, etc.). Working with such small amounts also resulted in an unacceptable proportion lost to spillage/static bits.  <br>First try, day 1, careful to deposit only a few grains (~3mg) on top of a bowl of sage, resulted in a weak experience. Nice mental buzz and activity, but low peak and short duration (~45 minutes noticeable). No noticeable body effects.<br>Second try, day 3, turned out to be an overcompensation (~20+mg on top of bowl of sage), with an immediate rush that quickly became unpleasant. Strong mental wawa effect, with noticeably uncomfortable bodily reaction. A quick vomit 5 minutes in to the experience brought my body feel back into line for 5 minutes, another bout at 10 minutes as the intensity escalated. I held on by mediating as best I could and purging two more times until the trip peaked at about 45 minutes. Once it was no longer strengthening, I could relax and enjoy the rest of the trip. Mental buzz for another 1.5 hours, but mainly preoccupied with gauging my own reactions. <br>Subsequent half dozen doses were more carefully measured and enjoyable. I finally decided to cut the bulk of it with sage to make it easier to use with a dugout. First used 1:10 (jwh-018 to sage), but found random variation produced some spots with an unpleasantly high dosage. Settled on 1:20 and mixed well.<br>Consistent effects obtained at ~8mg, 1-2 minute onset, mental buzz and creative stimulation peaking at 45 minutes, little to no noticeable body effects during, total experience lasting for 1.5 hours.<br>Continued to smoke for 1 week at every other day with no noticeable side effects. Clear mental buzz, but sadly lacking the comfortable body glow of mj.<br>Increased frequency to test for side-effects. 2 weeks daily, I noticed occasional headaches, which I almost never have. 2 weeks three times daily, occasional headaches and occasional limb going to sleep. I was doing a fair amount of work with my hands at the time, where I have seen a similar limb effects. However, I still wonder what the effects are on blood pressure and circulation. Headaches were clearly a side-effect of jwh-018. Nothing more than an occasional nuisance that lasted for 2 minutes until noticed, but, as said, it is very unusual for me to get headaches.<br>Resumed once a day morning usage for the remainder (2+ months!). Continued to have the occasional headaches. Limb numbness tailed off at the same time as I reduced working with my hands and finished remainder, so no clear relation.<br>Overall, well worth the time, would do it again, but will not use more than once per day on a regular basis.\n\n\n"
}
