{
 "title": "A Good Night, A Horrible Morn",
 "author": "John_iv",
 "citation": "   John_iv. \"A Good Night, A Horrible Morn: experience with Opium (ID 89212)\". Erowid.org. Jan 26, 2012. erowid.org/exp/89212",
 "substance": "Opium",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Opium"
  ]
 ],
 "footer": [
  [
   "2002",
   "89212",
   "Male",
   " ",
   "27",
   "Jan 26, 2012",
   "15538",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>We had hiked six hours into the jungle, somewhere in North Thailand; a typical hill trek to a Karen hill-tribe village that the backpackers and tourists commonly do.</p><p>After dinner, after the rest either went to bed or drank with one of the guides, I took the other guide aside and expressed my interest in opium. I did not want to ask any of the hill-tribe members directly, lest it be taken as offense. Nor did I want to let any of the other backpacker folk know of my intentionsas much to avoid the anti-drug sneers as to avoid recruiting other smokers, who may have been less interested in having a new and true drug experience in its proper historical and cultural context, as opposed to just getting fucked up.</p><p>The guide said that the hill-tribe did indeed grow opium, and that there were some regular smokers in the village. He went and talked with the chief, as he called him.</p><p>We waited for the drinkers to go to bed, and then the guide and I entered one of the huts (a large wooden structure on wood-stilts, with rooms partitioned by blankets. The chief had set up a makeshift opium den for usthree Thai-style cushions with pillows where we would each lie prostrate, set around the smoking set.</p><p>By candlelight, the three of us took turns smoking 5 pipes each. Each pipe consisted of a round pill of fresh opium mixed with some ash, smoked through a bamboo pipe with a round bowl at the far enda traditional-looking opium pipe as compared to the more ornate ones I had seen at the night bazaar in the city.</p><p>I was a fairly regular user of codeine, and I had had my share of heavier opioids. I knew codeine was one of the main alkaloids from Papaver somniferum poppies, and because of this, I assumed a similar subjective high I received from codeine on a regular basis (though perhaps more pronounced); I also figured I would tolerate the raw opium quite wellHowever, it was another experience entirely.</p><p>After the first five pipes, I felt light-headed, as though on a small dose of codeine perhaps. I was a bit chatty, and the chief persuaded me to shut up and lie down and let it take effect.</p><p>At ten pipes, I felt very hazy, though it still seemed comparable to a strong, pleasant codeine high. </p><p>I lost count, and smoked between 2025 pipeswe lay there in this makeshift room for what could have been hours. When I went to bed I felt as though walking in a dream. I was surprised I made it down the ladder from the hut without falling. Each motion seemed slow and delayed and unreal, dream-like. The jungle village we were in was pitch black by this time, and this and its pure silence added to the dream-like state. When I returned to my sleeping area, I proceeded through the night in a complete trance, unable to tell if I was awake or asleep. </p><p>I attempted to write, and only got about a paragraph down before nodding out. I would then realize my eyes were still open, and I hadnt actually fallen asleep, or if I had, it was impossible to tell how long. The entire night seemed like a waking dream, and Im not sure how much actual sleep I got, if any. The pure darkness and silence of the jungle definitely added to this confusion.</p><p>As light broke through the village, I became aware again of my surroundings. I was exhausted in the morning, and I had a piercing headache. I held back a horrible nausea until I simply couldnt contain it. I ran out from my mosquito-netted area, and threw up violently behind our sleeping area. A village woman looked up at me with a half-smile, knowing exactly why I was sick. She didnt seem angry, cynical, or amused, just accepting of it. On my end however, I felt somewhat guilty, as I knew there were village children around, and I didnt want my ongoing vomiting to be seen by them. Children can be exposed to opium in these villages at very young ages, and while it may be inevitable that they will eventually grow to use it, I didnt want to be any part of that youth-corrupting equation (though, in defense, my extreme hangover and violent vomiting could easily have had a dissuasive effect).</p><p>After at least fifteen minutes of horrible, projectile vomiting, I was empty. The headache and nausea did not stop however. Being way out in the jungle, with another 6-hour hike out of the jungle, suddenly became a major survival issue for me. It was do-or-die. I got down as much water as I could take for re-hydration, and was able to eat a bit of dry toast. And then I walked on out, drinking as much water as possible to keep hydrated. And slowly the opium hangover subsided.</p><p>Retrospective:</p><p>It was a beautiful state while it lastedcomplete chimerical experience beyond pleasure or fear. I was just existing in a state between waking and asleep. But this was Not anything like a typical nod-out on other opioids.</p><p>I met with the guide the night after back in the city. He told me most tourists that try opium tend to smoke no more after the first session of just 3 to 5 pipes. I had smoke four-to-five times this, and my experience and tolerance to other opiates/opioids really didnt prepare me for my first attempt at straight opium.</p><p>Despite the Horrible hangover, I actually see the above as a positive experience, as hiking out of that jungle became a major survival moment for me. I knew I had to just pick myself up and keep walking, regardless of how awful I was feeling.</p><p>I would not be averse to trying opium again (and indeed, I have in successive trips), but I am much more moderate and careful with the amounts I smoke/ingest. </p><p>For potential first-time users, I would take the above as a warning against going overboard. Stay minimal, especially if it is your first time smoking. As I said, even being a very experienced user of drugs that are directly from and/or based on Papaver somniferum opium poppies, didnt prepare me for the real thing.</p>"
}
