{
 "title": "A Pocketful of Molecules or Zero Milligrams",
 "author": "Tumbleweed",
 "citation": "   Tumbleweed. \"A Pocketful of Molecules or Zero Milligrams: experience with Cannabis (ID 89297)\". Erowid.org. Feb 22, 2011. erowid.org/exp/89297",
 "substance": "Cannabis",
 "bodyweight": "126 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   " ",
   "0 mg",
   " ",
   "4-HO-MiPT",
   "(capsule)",
   " ",
   "0 mg",
   " ",
   "4-AcO-DMT",
   "(capsule)",
   " ",
   "0 mg",
   " ",
   "2C-B",
   "(capsule)",
   " ",
   "0 mg",
   " ",
   "Amphetamines",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 89297",
   "Gender: Male",
   " ",
   "Age at time of experience: 27",
   "Added: Feb 22, 2011",
   "Views: 3179",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I meet Ani at the club. The music, minimalist techno in one room and anthemic electronica in the other, is pumping out of a state of the art sound system. I am bathed in texture. I haven't been out dancing in months, and I've come properly equipped. Many molecules have been burning a hole in my pocket all night, and now, a little past midnight, I am ready to dive in. I find Ani on the dancefloor and we navigate closer to where Donato Dozzy is spinning records, dancing as we watch him.</p><p>'So, do you want anything?'</p><p>Ani considers and calls into my ear over the loud music. 'What do you have?'</p><p>'Well...I brought options. You could take eighteen milligrams of 2c-b, or fifteen milligrams of 4-AcO-DMT, or 25 milligrams of one of my personal favorites - 4-HO-MiPT. I also brought some speed.'</p><p>A wealth of options. Ani seems a bit dazzled as to which direction to choose. Singular experiences, combinations, the warmth of tryptamine consciousness or the neural electricity that phenethylamines bring. Or, just an upper to keep going. The party goes until six AM - at least, so we think for now.</p><p>Ani decides to wait before taking anything, and because I don't really feel like tripping alone, I decide to wait too. The speed is burning hard through my pocket, because I did not sleep well the night before and I feel lethargic. Still, I opt for sobriety. We bounce from one room to the other and then Ani suggests we go out to her car to smoke.</p><p>We talk about Krishnamurti and Joseph Cambell while she rolls a joint. I've missed her. I fumble through the two small containers in my pocket and fish out a 15mg capsule of 4-AcO-DMT. That's my choice for the night. We get out of the car and walk around the block to smoke the joint. I'm holding the capsule the whole time. Back in the club, I slip it back into my pocket and continue dancing.</p><p>Every once in a while, I get an itch to take something. But the itch is really the most interesting aspect of the thoughts in which it swims. I parse through the thoughts. I attack the itch, and then I embrace it. This is kind of awkward, being in a dark room filled with bodies and attitudes and everybody dancing. There is a lot of raw sexuality, attractive men behaving like boys and rubbing against one another, sensuous women carrying themselves with an air of erotic unattainability, a lot of people on cocaine or ketamine, their stern faces looking at me with a lot of judgment in their eyes. I am dressed in lighter colors, have a smile plastered on my face - always, drugs are not at all necessary - and my hair is wild and fuzzy and free. They have an idea of what dancing to techno should be, and I am sure I do not fit in.</p><p>But of course, though there is an 'in' crowd here, I am failing at life by turning myself and Ani into 'us' and everyone else into 'them.' God, but this is awkward, and psychedelic drugs would really help me deal with that. I would perceive the oneness that suffuses all life, it would render these aggressive and combative tendencies in others laughable in the face of the unity that permeates all things. It seems attractive to take something. It also seems too easy.</p><p>Sometimes, I get lazy about dancing. Which is a shame - dancing is sweet release for me, and I dance hard on drugs and have ecstatic spiritual experiences of oneness with my body. Tonight? I'm just kind of tired. I dance, or I watch. I'm horny. Many different bodies are bumping up against me here and there. We step outside and we smoke another joint. I get insanely high this time, and when we get back it is actually a bit too much. It is then that we find out the party does not end at six AM.</p><p>We receive wristbands to an afterparty in the upstairs loft where a DJ I absolutely love, Derek Plaslaiko, is spinning until noon. This changes everything. What to take?</p><p>The 2c-b?</p><p>Or 4-AcO-DMT, my first instinct?</p><p>Or...4-HO-MiPT dancing through the sunrise through a kaleidoscope of raw rainbow sexuality. That does sound lovely.</p><p>And of course, whichever, with about 40mg of racemic amphetamine paste, some speed, is going to just really carry me all lovely-like.</p><p>We get upstairs to the loft, see friends we haven't seen for hours. They are tripping hilariously hard on LSD and channeling Hunter S. Thompson caricatures through their warm selves and cartoon glasses. It is great to see them and I am eager to join them in their construct of reality.</p><p>Ani turns to me. 'You know,' she says. 'I do have a lot to do tomorrow. Would you want to just go home now?'</p><p>It really doesn't take more than a split second to make a decision. It's 6:30 AM and I have plans later that night for dinner with a girl I am very excited to get to know. I don't want to be a zombie when I see her.</p><p>'Sure, let's go.'</p><p>At the exit, our coats half-zipped, Ani pauses.</p><p>'Aaahhh. I don't know. I think I could totally go back in there and take something right now and dance my ass off til noon. What do you think?'</p><p>Though we have been at the club together all night, in a way I have remained passive and let Ani drive. I want her to drive now. Her car. To my house.</p><p>'I think I'd rather go home, actually.'</p><p>Because we are spirit brother and spirit sister til we die, whatever I say I decide is fine, and Ani is totally cool with going home. I pinch some pot off of her, and when I get home I smoke a bit before even taking off my coat. Then I undress. I empty out my pocket full of molecules, my simple but dazzling array of opportunities for neurochemical enhancement. Outside, the sun is rising and orange-yellow rays are searing through my window-blinds. I feel pretty fantastic.</p>"
}
