{
 "title": "Splitting in Two",
 "author": "Cody",
 "citation": "   Cody. \"Splitting in Two: experience with Salvia divinorum (ID 894)\". Erowid.org. Nov 6, 2000. erowid.org/exp/894",
 "substance": "Salvia divinorum",
 "bodyweight": "140 lb",
 "header": [],
 "footer": [
  [
   "2000",
   "ID: 894",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2000",
   "Views: 24179",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nMy roommate and i had obtained 1 gram of 5x Salvia divinorium.  Upon looking at the vial, in respect to the wide range of reports which i'd researched eagerly on erowid and the lycaeum, i really wasn't sure what to expect.</p><p>Quite honestly, mental rape would be a light description of what occurred.</p><p>i don't know what all those other psychonauts were smoking when they talk about seeing entities, or projecting into other lives, as the experience i had was vastly more disturbing and disorienting than i was prepared for, and vastly different than the aforementioned reports.</p><p>I smoked about two full tokes and a third, lighter inhalation, and after setting the pipe down (i used a black TATTOO pipe), i was immediately transported into what i can easily describe as the most frightening experience i've had with a drug.</p><p>The environment is still there with eyes open, but it's as if there is some strange, digitalized visual 'noise' which breaks it down into a picture much too distorted to be recognizable.</p><p>That wasn't so bad, but the somatic/bodily effects caught me completely unprepared.  It was as if i was split in two; right brain/left brain and their corresponding body parts became essentially two different entities, independent of one another.  Imagine, if you will, a single entity consisting of a leg, some torso, and an arm, connected to a relatively identical, yet opposite entity by what felt to be mere elastic material (skin).</p><p>i lifted my arm and my hand looked alien and visually displeasing--the fingers seemed more like thick, animalistic appendages, each distinctly individual. </p><p>It was as if the salvia broke my perception of self into its true, separate components, and allowed my Self to explore them on that level.  Instead of seeing a hand, i saw 5 almost tube-like appendages connected by a bit of insignificant flesh.  Instead of feeling my Self as one thing, i felt every facet in its separate existence and relationship with one another.</p><p>Other visuals crowded in which i can barely remember correctly to convey; however, my immediate reaction to this physical disorientation, especially since the 'feel' of it was so vastly beyond what i expected, was panic.  The only thing that kept me (if i could've done it) from killing myself was the knowledge that the salvia was so short acting.</p><p>I tried it again last night, with similar results, except this time i had some music playing, and i had the wherewithal to ease into this experience with some previous frame of reference.  Closing my eyes, it seemed that the music and every thought i had would move in a strange counter-clockwise square-like pattern underneith my eyelids.</p><p>This drug seems to 'hold' you in place unless you truly let yourself go.  The more one resists, the more caged and psychically claustraphobic one feels. I didn't leave my body or the environment, but provided there is no distraction, and provided one lets go absolutely, i could see how such 'projection' could be conceivable.  Admittedly, i was resistent; something i hope to rectify in the future.</p><p>Short acting trip, tapering into something immediately much more tolerable and mentally stimulating.  This drug does not activate any emotive response from me--it seems entirely mental, and after the trips, i noted an increased sharpness in my perceptions, in color, touch and especially thought.</p><p>This is NOT a recreational drug.  This drug makes liquid acid seem like sugar water.  I can see how this particular 'diviner's sage' would be for the serious student of the mind and perception.  </p><p>As such, i was quite impressed.  I've always been very adaptive due to the nature of my own existence, so my recovery despite its extreme nature was relatively immediate, as was the value i received from the experience in retrospect.</p><p>First of all, it reminded me of the very real nature of my physical existence, which is the beautiful and fascinating coordination of an intricate biological machine.  Separate components acting as one in an automatic sense.  Remarkable, and truly something i'd forgotten to appreciate.</p><p>Second, it showed me that consciousness in the typical 'sober' state isn't nearly as challenging as i, and others, sometimes believe it to be.  This mundane life is easy, even if it is boring.</p><p>We may very well have only touched upon the point before breaking through to the plateaus/hyperspace so often portrayed in the reports i've read.  To determine this, my friend and i will be trying the 10x shortly.</p>"
}
