{
 "title": "Just Keeps Going",
 "author": "HomeGrower",
 "citation": "   HomeGrower. \"Just Keeps Going: experience with Dextromethorphan Polistirex (ID 8940)\". Erowid.org. Nov 5, 2008. erowid.org/exp/8940",
 "substance": "Dextromethorphan Polistirex",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 5:30",
   "3 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 8940",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 5, 2008",
   "Views: 10865",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At 1:30 AM I downed 3 oz of Delsym dextromethorphan polistirex Extended-Release Suspension 12 Hour Cough Relief. It tasted like I was drinking throat spray so I took sips of coke between the syrup. I should note that about 9 I had smoked two small cones of marijuana. By 1:00 the high had worn off, but I was still left kinda burnt and a bit tired from a long day. I had just worked an 8 hour shift and didn't sleep much the night before either.</p><p>About 2:15 I went outside to go smoke a cigarette. By that time I was feeling like I had a beer or two. Went I sat down the 'beer' buzz just disappeared. Walking or any physical activity seemed just playful and fun. It's kinda hard to describe. When I walked or stood I felt like I was leaning or about to fall over, but I actually had pretty good control. My mind was drunk, but my body wasn't. Again it's hard to describe. But I'm trying.</p><p>I went back inside and sat on my couch with only the tv on in the room. I sat there for about 45 minutes then went to get on my computer. That's when the trip really started to kick in. It turned from a drunken type of buzz to an acid type of trip. I didn't have visuals though. I no longer had to move to notice the effects. Time seemed to last forever.</p><p>3:00 AM I could no longer type and got annoyed because I couldn't do any math. I tried to calculate how much of this stuff I would have to take to overdose. I tried like 3 times and once I had to rethink, 'Did I just take too much!'</p><p>About 3:30 I decided to go lay in bed. I planned on turning the light out, but at that time I just didn't feel like it. I just slid under the comforter and cuddled up. I felt comfortable and peaceful. I just stared at the ceiling or the wall for like an hour. </p><p>It was close to a meditative state, but definitely not one. I felt like two minds, but just trapped in one body. The other mind had a constant flow of thoughts and distractions rushing through. But my mind or the one I was in now was clear. Normally I have one or the other, clear or unclear, but now I had both. I felt disgusted because for some reason I couldn't control the 'other' mind. I had cleared one, but not the other. Again it's hard to explain.</p><p>About 12:00 PM (noon) I wake up and it immediately hits me. I'm still fvcking tripping!!! It was amazing. It felt like a full blast rush, I was rolling harder than I was before I fell asleep. I got something to eat and mostly sat around watching tv and playing with my dogs. The trip was a lot like acid, but a bit different. The body/mind part was a lot stronger than acid though. My trip finally came down about 4:00 PM. Then I was left very clear headed and kinda uppy.</p>"
}
