{
 "title": "Bad Effects",
 "author": "JWH CAUTION",
 "citation": "   JWH CAUTION. \"Bad Effects: experience with Products - Spice and Synthetic Cannabinoids (ID 89505)\". Erowid.org. Feb 26, 2011. erowid.org/exp/89505",
 "substance": "Products - Spice and Synthetic Cannabinoids",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2009",
   "ID: 89505",
   "Not Specified",
   " ",
   "19",
   "Feb 26, 2011",
   "Views: 8279",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I work for a packaging company recently hired by [brand name deleted] to package their smoking blend. We were told that it was all herbal, and that no protective masks were needed. Since prolonged exposure to JWH I have experienced terrifying symptoms. I have been evaluated by approx. 5 doctors including a neurologist, cardiologist, and psychiatrist. the compound known as JWH-018 / JWH-024 are the only possible connections they can find. I had never been admitted to the hospital before exposure to JWH and whatever else they put in their product... in fact these are my first serious health problems in over 10 years. I have had 2 CT scans and 1 MRI that showed no masses in my brain that would cause these symptoms. I have low blood pressure and am considered low-risk for heart attack or stroke.</p><p>Symptoms included:</p><p>TIA-like (mini-stroke) episodes within 2 months of exposure: loss of vision in R eye, extreme confusion, inability to speak, numbness/limpness in R leg, loss of consciousness, overall change in mental status.</p><p>6 day pressure headache in R temple accompanied by extreme confusion, feelings of complete detachment from body, frequent muscle twitching, difficulty breathing, sudden sweating and feelings of disorientation, and rapid heart beat.</p><p>Prolonged episodes of confusion, feelings of complete detachment from body, frequent muscle twitches, disorientation. Chronic sinus infections.</p><p>When I have smoked weed after these episodes, I have had what felt like a severe allergic reaction with difficulty breathing and blurred vision. Keep in mind that before exposure to JWH I smoked weed with all good reactions.</p>"
}
