{
 "title": "Cosmic Happiness",
 "author": "Anon",
 "citation": "Citation:   Anon. \"Cosmic Happiness: experience with 4-AcO-MiPT (ID 89501)\". Erowid.org. Jan 30, 2012. erowid.org/exp/89501",
 "substance": "4-AcO-MiPT",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "4-Acetoxy-MiPT",
   "(powder / crystals)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis - Hash",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2009",
   "ID: 89501",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Jan 30, 2012",
   "Views: 3304",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had obtained a 100mg sample of 4-Aco-MiPT. The setting was a friends house near a forest and a park. My mind was clear and i had no worries. I took 25mg.\r\nT+30min: Im starting to feel something. It feels very friendly and happy. The vibrations/energy felt good. At this point my friend took 15mg as i thought it was safe.\r\nT+60min: Its definitely here now. I feel very cosmic and social. Very good vibrations. My friend is also very happy. Slight nausea was present. This was not noted with 4-ho-MiPT. There was a definite tryptamine feel to it and the patterns were typical of tryptamines. At this point we went outside to the park. It was dark outside and the stars were very clear. I had always wondered how people saw constellations in the stars. I understand now. I saw a bull, people and other complex things in the constellations. It was very powerful and i felt that the first people who ever looked at the stars and saw constellations, must have been on some hallucinogen or other drug.\r\nT+90min: We went back to the apartment and made some tea and went outside again. We found a nice place to lie down and look at the stars. It was very silent. The conversations were very far out and deep. We really got to know each other.\r\nT+120min: We went back inside. There was still slight nausea, but it was bearable. My friend out on some music and we chill and laugh for some time and talk about life. \r\nT+180min: There is clear OEV and CEV. Beautiful patterns emerge from nowhere. Colors are very intense. I spend a long time analyzing my hallucinations and my friend does too. Still a little nausea. However my friend has no body load at all.\r\nT+240min: The peak is definitely over and im coming down. We had a little hash witch intensifies the trip. The nausea seem to disappear at this point. The next hour is spent rolling around in pillows laughing.\r\nThis is incredible material. It has everything. I woke up the day after feeling refreshed and very happy. The nausea was only noted by me and not my friend. However it was present for the duration of the trip. But it was bearable. This is definitely one of my favorites. It can be compared to mushrooms and the duration was nice. It was a beautiful experience and my friend and i bonded very closely that night. 5/5 incredible\n\n\n"
}