{
 "title": "Interesting But Strong",
 "author": "ChemBob",
 "citation": "   ChemBob. \"Interesting But Strong: experience with MDPV (ID 89580)\". Erowid.org. Sep 3, 2011. erowid.org/exp/89580",
 "substance": "MDPV",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "MDPV"
  ]
 ],
 "footer": [
  [
   "2011",
   "89580",
   "Male",
   " ",
   "55",
   "Sep 3, 2011",
   "19089",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I read about mdpv and decided to try it before it was pulled off the market. I bought one gram from a self-claimed lab supply source instead of the bath salts form. I took approximately 0.100 gram and divided it into ten visual portions and dissolved one portion, approximately 10 mg, in some juice and drank it around 7:15 a.m. My scale is a gram scale with 100 mg increments, so Im estimating the actual mass was 10 mg +/-  5 mg. </p><p>By 7:30 a.m. I felt more energetic, with increased respiratory and heart rate. By 8:00 a.m. I was speeding my buns off: rapid heart beat and compulsive lip, tongue, and jaw motion. I felt euphoric enough, a typical amphetamine high Id say, however, next time I try this (not today for sure) Ill half the amount to around 5 mg, which should be sufficient for a nice buzz, as 10 mg seemed a bit much for my 165 lbs. </p><p>By 8:30 a.m. the energy was very high, accompanied by shortness of breath with normal activity. There was a bit of pressure in my chest, probably due to 100 bpm heart rate, my arms felt a bit tingly, mouth was dry, recommend staying hydrated with this stuff. That my arms were actually tingling from elevated blood pressure due to approximately 10 mg of mdvp suggests one should take this substance seriously and dose accordingly. More than 10mg could induce tangible cardio-respiratory problems and shouldnt be taken lightly. Occasional mild angina presented. Persons with a history of heart problems would be wise to avoid this drug.</p><p>Other effects:  talkative with streaming optimistic ideas, thoughts and voice clear and lucid, but also feelings of anxiousness and restlessness.  Appetite suppression was obvious. The anxiety was relieved by focused activity like writing this report, for example. By 9:00 a.m. I seemed to be plateauing, which was good as around 10 mg seems about the threshold of enjoyment for this substance, and more might have resulted in a dysphoric experience in my estimation. Interested in trying smaller doses in the future, but am also suspicious of potential neurotoxic effects on the dopaminergic neuronal circuitry, as this substance is largely unstudied. Some extant studies have documented acute liver failure associated with mdvp use, so some toxicity is present, along with sufficient documentation on the potential to induce mental psychosis. The best high of course is to love oneself and be healthy in mind and body, so proceed slowly and respectfully with this chemical.</p><p>By 9:30 a.m. effects were subsiding slightly, with a very mild frontal headache noticeable. The energy and euphoria were still in effect, but I could detect my brain/body tiring from two hours of this high-octane speed. Unfortunately, the happy wood never presented, different strokes I guess. By 11:00 a.m. my motor was starting to slow, and began feeling a bit spacey and washed out, heart rate was 78 bpm. At 11:30 a.m. decided to take 7.5 mg hydrocodone and have a cigar to mitigate any potential crash discomfort. </p><p>Overall it was a cheap, legal, and wild speed experience that afforded sufficient cognitive and physiological functionality at 10 mg +/- 5 mg. Mentally, my thought processes were rapid and optimistic, while physically, my cardio-respiratory activity was very elevated for a period of around four hours. Personally, I would not recommend this dosage as recreational and do not intend to repeat it, though I do intend trying a 5 mg +/- 2.5 mg dose at a future time for potential recreational purposes.</p><p>Hope this helps. Stay safe, smart, and healthy, ChemBob</p>"
}
