{
 "title": "Next Time I'll Try More",
 "author": "Lucid",
 "citation": "Citation:   Lucid. \"Next Time I'll Try More: experience with 5-MeO-DiPT (ID 896)\". Erowid.org. Nov 6, 2000. erowid.org/exp/896",
 "substance": "5-MeO-DiPT",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "5-MeO-DiPT",
   "  T+ 2:30",
   "5.0 mg",
   "oral",
   "5-MeO-DiPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 896",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 6, 2000",
   "Views: 7876",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nOur first 5MeO-DiPT experiment:\r\nWe had just gotten home after a satisfying meal of  falafels at our favorite middle-eastern restaurant. D drew a bath while I did some cleaning up and setting the mood for an evening at home (candles, incense, music, etc.). Earlier that day I had prepaired our doses,10mg for D, 15mg for myself, wrapped in a small square of toilet paper,  a trick I learned from an older friend of mine who says that it takes longer for gel caps to break down and you don't have to taste it when it's mixed with water or juice. Although I did take a little lick earlier just to taste it (quite a little bitter chemical taste on the tip of my tongue), I would definitely not recommend trying this one sublingual!\r\nAnyway, at about 9pm we both swallowed our little paper packets. D hopped into the bath and I went outside for a smoke and a walk down to the end of the street. When I came back I sat on the couch and checked the time (T+:15). I had a slight warm sensation in my stomach and realized that I was already coming up, but not quite sure what I was in for. D had come out of the bath and I asked her how she felt. She said she had a heavy head, but I could have been from the bath. We both settled in on the couch to watch the movie Unforgiven, which I would recommend to anyone who likes westerns. Just before the movie started I went outside to smoke and to see If anything felt different. \r\n(T+:30) The first things I noticed upon going outside were that my vision had become noticeably clearer with sharpened edges, and that bright lights like car headlights had a sharp starlike pattern and warm glow reminiscent of the visuals I had seen on a small dose of peyote. I came inside and asked D if anything was new for her. Things look sharper and I can see further, ' was her reply.\r\nWe laid back and started the movie about 15 minutes later.\r\nD told me that she felt sort of nauseous, so I rubbed her tummy and noticed a slight body tingle and enhanced sense of touch. I felt quite warm and was sweating on my hands and feet, but it felt nice. D said that my rubbing made her feel better.\r\n(T+1:00)\r\nWhile watching the movie I noticed sound seemed to have an enhanced hall-like reverb and the sound from the TV seemed to come from different directions.\r\n(T+2:30)\r\nD said that she was seeing subtle LSD-like patterns and that the bathroom floor was breathing.\r\nI decided that I liked where I was at and wanted to experiment with a  supplement of approximately 5-6mg. I had slept in until 3pm that day and wasn't feeling tired in the slightest.\r\n(T+3.5) \r\nI went  outside for a smoke  and felt nothing more than a pleasant lightness in mood and I was very awake, but when I came inside I stopped in the bedroom for something but quickly forgot what it was I was looking for, when I noticed that the light in the room was pulsating, and shimmering and when I looked at a painting on the wall it seemed to ripple and breath.\r\nAfter drinking some apple and ginger juice, I started to feel a slight stomach cramp. D said she felt the same.\r\n(T+4:00) \r\nWe put on some trippy music (KOXBOX: The great unknown) and a video I had made earlier that week of some super stroboscopic video wallpaper. The music was awesome, the depth of it was greatly enhanced and the video seemed to relate directly with the sounds.\r\nWe had a great conversation that flowed really well about the complexity of the two combined sources of stimulation. It felt rather easy to convey complex thoughts and easy to understand as well. We also had an almost painful laughing fit seeing one of our cats completely tranced out to the video. Listening to the music with closed eyes produced some interesting flowing mirror image fractal patterns.\r\n2am (T+5:00)\r\nD was feeling sleepy, so I tucked her into bed and gave her a rather long back rub. I was feeling restless and it kept my hands busy, but when she fell asleep I couldn't lay still so I went for a little walk around the block. Walking was enjoyable, I felt light on my feet.\r\n3am  (T+6:00) \r\nAWAKE, but not high at all. I drank a beer hoping it might make me sleepy but it didn't work. I turned on the TV and Twin Peaks--Fire Walk with Me the movie was on. I could only watch a little bit because it started to creep me out.\r\n4:30am (T+7:30)\r\nI took a walk outside and saw the predawn green glow in the sky and decided I would try to go to sleep. I think It only took about half an hour to fall asleep.\r\nI slept in until about 3pm the next day and woke up feeling great, not even the slightest sign of a hangover.\r\nAll an all, this substance wasn't that spectacular. I had fun. \r\nAt this dosage (10-15mg), it could be fun at a public event, like a street fair or dance, but If you're looking to get any serious internal work done or don't like to take drugs recreationally, I would not recommend it at this level. I don't know about higher doses, though. Next time I will try 25mg. \r\nTo sum it up--\r\nPlus side: minor LSD-like visual distortions, a warm glowing body feeling, slightly enhanced audio depth perception, lightness in mood, mellow come down and no hang over\r\nDown side: stomach cramps, nausea, restlessness, nothing too spectacular or too interesting at 15mg\r\nWell, I hope someone finds this information useful,\r\n-lucid\n\n\n"
}