{
 "title": "Toga Party in the Botanical Gardens",
 "author": "Morgan",
 "citation": "   Morgan. \"Toga Party in the Botanical Gardens: experience with Mushrooms (ID 8964)\". Erowid.org. May 12, 2004. erowid.org/exp/8964",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "4 capsls",
   "oral",
   "Mushrooms",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8964",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 12, 2004",
   "Views: 5705",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was my 21st Birthday, and my flatmate and i had our hands on ten caps from a local guy that does his own gardening.  He grinds the shrooms up and puts them into gel caps to avoid the taste.</p><p>We had a bag of fresh fruit and nuts, and a few bottles of fruit juice, and we sat with a few other non-tripping freinds in the Botanical Gardens.  A beautiful place when sober, but amazing when altered.  We were wearing togas (just a bedsheet wrapped around our otherwise naked bodies) and we chilled out for the two or so hours it took to get into the trip.  We played hackey sack and threw the frisbee around until we went for a walk.</p><p>While out walking, the full effect took place and we began to take notice of the way people were looking at us.  We were discussing deep spiritual issues and finding our place in the universe, a kind of cosmic love of nature, i could hear the trees talking to us.  The other people were looking at us like we were the kind of people who walked through the gardens wearing robes, discussing cosmic love and out relationship with god/goddess. So, as we walked further, we found ourselves becoming the kind of people who walked through the garden, wearing robes and talking about cosmic things.</p><p>It was a feeling of total love and compassion, of connection to the universe and global one-ness.  It filled me with hope for the world, and a love for all people.  I wish that all people could feel this way all the time, world peace wouldn't be such a fairy tale.</p><p>I love mushrooms, and i love the world.  drugs have made me a better person and opened my mind to a world that i never knew existed.</p>"
}
