{
 "title": "The Green Fairy in Canada",
 "author": "DoctorStrange",
 "citation": "   DoctorStrange. \"The Green Fairy in Canada: experience with Absinthe (ID 8970)\". Erowid.org. Jun 7, 2004. erowid.org/exp/8970",
 "substance": "Absinthe",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE:",
   "180 ml",
   "oral",
   "Absinthe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8970",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 7, 2004",
   "Views: 32143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First I'd like to make clear the legal situation in Canada (to the best of my knowledge):</p><p>- Absinthe is currently being reviewed by individual provinces; federally, thujone concentrations in food/drink are limited to 0.5ppm with an exception being made for alcoholic beverages, Quebec & Ontario have reportedly set a limit of 10ppm for alcoholic beverages (in line with EU limits), BC has set no limit (yet).</p><p>- Quebec, Ontario, and BC liquor boards now stock absinthe.  BC currently only stocks Hill's Absinth (yes, no 'e', with a thujone concentration of 1.5ppm), but is considering other brands.</p><p>- Any brand of absinthe (regardless of country of origin or thujone levels) may be imported for personal consumption in small quantities (I interpret this to mean one case or less).  I personally have imported 6 different brands from 3 different countries, and had no customs bother at all (the packages had been opened, presumably to check quantity, but otherwise OK).</p><p>- Home distillation is NOT legal!  Don't make your own, unless its via maceration and not distillation (maceration usually tastes repulsive)</p><p>Now onto the good stuff!</p><p>I decided to focus this experiment on a variety called Suisse La Bleue (or Swiss La Bleue).  This variety is difficult to obtain, as it is produced on the sly in Switzerland where absinthe production can land you with a $20,000 fine.  But it also has one of the highest thujone concentrations at 70ppm, and the icing on the cake is how smooth it is.</p><p>First I created the desired setting: subdued lighting, ambient music, etc.  It is important to start sober - excess alcohol in my system just dulls the whole experience.  Also, I'd recommend that if you eat anything in the two hours preceeding, make it a light meal. I brought out the items necessary for the 'ritual': ice water, a goblet, absinthe sugar spoon (a decorated slotted spoon that fits over the rim of the goblet), sugar cubes, and of course the absinthe itself.</p><p>Next, I mixed.  Pour an ounce of absinthe in the goblet, place the spoon on top, put a sugar cube on the spoon, and drizzle ice water over the sugar (about 4 to 6 ounces).  Watch as first swirling density gradients occur, then quite suddenly the whole solution clouds up and turns milky.  Do this slowly, both to take in the fascinating scene (one can imagine clouds building on the verge of a summer storm), and to relax and get in the proper mindset.</p><p>Then, sip slowly.  The taste is quite pleasant, sort of like licorice candy, with a slightly bitter edge.  I had several objects to focus on nearby, which seems to help get in the mood.  I had several glasses in this manner, finishing a total of six in about 3 hours.  As the evening progressed, I started to find little things quite fascinating, the light refraction through ice cubes, the minute features of a candle flame, note progressions in the music... I was exploring the fractal patterns in the ice for a full 45 minutes before my observer (and partner in this endeavour) brought me back to 'real scale' by asking what I found so enthralling.</p><p>The overall effect was quite interesting, but not unlike ordinary alcohol intoxication.  I found that the main differences were that my mental faculties remained pretty much intact, even though my body was definitely impaired.  I still possessed linear thought and could still think logically, and according to my observer I was very lucid for the duration.  After the second glass my senses began to change - first my hearing became heightened, almost crystal.  My vision was what you'd expect from alcohol, perhaps with more vivid colours.  My sense of touch was greatly heightened, as if I had become aware of every last nerve ending and each last one of them was sending pleasant signals back.  And finally, my sense of taste was incredible!  If you try this, do yourself a favour and eat something, anything (well, preferably something you already enjoy), at the point where you notice your senses altering!</p><p>About an hour after my last glass (at this point I had had 180mL, estimated 12mg of thujone in total), the unusual effects started to wear off, and all I was left with was alcohol numbness.  I decided to take that opportunity to go to sleep...  heh, the rumours are true.  Historically, absinthe is said to produce dark, vivid, violent, and obscene dreams...  I eventually ran through the entire range.  I must stress that it was quite an active night, and I'm not entirely sure I was actually asleep - at least, I don't remember waking up, just slowly transitioning from the dreams to real life over about two hours or so.  I felt somewhat on edge and disquieted (and more paranoid than usual) for the entire day after waking up, with frequent recollections of my dreams for days.</p><p>Overall, I'm definitely trying this again, but next time with a tape recorder and/or notepad at hand.  I spent several days trying to remember all the wonderful thoughts, ideas, and images I'd had (or at least remembered having), with only limited success.  I'd also love to know if I said anything during my dreams...  my observer/participant was unfortunately in a similar state.</p>"
}
