{
 "title": "Beautiful, Simply Beautiful",
 "author": "Hairylee",
 "citation": "   Hairylee. \"Beautiful, Simply Beautiful: experience with DMT (ID 89731)\". Erowid.org. Apr 6, 2012. erowid.org/exp/89731",
 "substance": "DMT",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "70 mg",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 89731",
   "Male",
   " ",
   "23",
   "Apr 6, 2012",
   "Views: 1820",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Words cannot begin to describe the visuals and emotions my 3rd DMT experience gave me. However, Ill try my best.</p><p>When the 3rd hit of the pipe had been taken, I held my breath as long as possible, sipped some water (quickly) and sat back in to a meditative position. It was here the fun began. Geometric shapes and patterns covered in a rich deep royal blue were folding infinitely through and around each other. Then all of a sudden amongst these ever swirling and colour changing patterns a silhouette of a man and a woman appeared. The woman was with child, and as the man got behind her he reached around her and felt the bump and the baby inside it. At this moment in time I was completely perplexed and enveloped in the moment. I could literally feel my soul having a connection to this couple and their child to be, I could feel pure love passing between them and me on a spiritual chain tied between all of our chakra points and souls. This raw uplifting emotion completely enveloped me and continued to whilst I saw the most amazing and intricate fractal patterns changing colour over and over again. Deep glowing purples, followed by bright reds and then glowing neon greens and every shade between. I decided to just feel my face as I acknowledged I still existed, and to reassure my mind. It was incredibly intense; I opened my eyes but could still feel very strong remnants of emotion, my hands shook. As I sat there meditating on what had just happened I thought of how I could describe the experience and how I felt, and that was one word  beautiful.</p>"
}
