{
 "title": "As a Scientist I Find It Hard to Take In...",
 "author": "Hannah",
 "citation": "   Hannah. \"As a Scientist I Find It Hard to Take In...: experience with DMAE (ID 89903)\". Erowid.org. Mar 2, 2011. erowid.org/exp/89903",
 "substance": "DMAE",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "DMAE"
  ]
 ],
 "footer": [
  [
   "2011",
   "89903",
   "Not Specified",
   " ",
   "53",
   "Mar 2, 2011",
   "Views: 7712",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm a professional psychopharmacologist (really!) who has 'dual' US/EU nationality. I became interested in the so called 'smart drugs' while I was hacking away at my PhD. I became interested in DMAE due to its low toxicity coupled with its status as an endogenous compound and not a xenobiotic, i.e. it is a compound that we all have naturally in our bodies (as a pre-cursor of the neurotransmitter acetylcholine) viz. its not a drug. It also amused me that it is present at appreciably high concentrations in fish - in Ireland fish has always been said to be brain food (the favourable fatty acid content adds extra weight to this homily).</p><p>In addition on mainland Europe DMAE and a host of conjugated derivatives, e.g. Lucidril (centrophenoxine I think?) have always been available on (and off) prescription as treatments for ADHD, fatigue, 'neuroasthenia' (feeling whacked out essentially!) and so on. In fact during the late 1950s and early 60s in the US it was seriously considered to be capable of increasing intelligence. It was available as the prescription drug 'Deaner', indicated for ADHD, again a conjugate - until the FDA insisted on proof of efficacy (as well as safety and purity) at which time the PDR became somewhat thinner!</p><p>Cutting to the chase, I apologize for rambling a bit - I myself suffer with ADD (you wouldn't guess!) - I decided that DMAE was relatively safe and might help me focus more during my PhD project. I believe it did help in a subtle fashion, quite unlike the traditional stimulants; Dexedrine, Ritalin that provide many ADD sufferers with near immediate relief from the symptoms. I simply felt a gradual quickening in thought and a moderate improvement in focus. I didn't notice any ill effects so I kept on taking the stuff and intend to carry on.</p><p>Now this is the weird bit ... I'm a 53 year old ... with a minimal bit of slap (make-up) .. I pass 10-20 years younger. Some people actually think I am taking the piss (lying) when I reveal my age. I smoke (fags ... sorry cigarettes) and have done on and off since high school. I have indulged in other ways also on and off. I am now aware that DMAE is also touted as an anti-aging agent and is present in a host of skin creams of US origin.</p><p>I'm now getting a bit paranoid being in mind of Dorian Grey and his fate. As I say I'm a scientist and am finding it hard to appreciate that a simple molecule like DMAE gave me an edge!</p><p>PS. Probably not relevant to my account but I am an inter-sex (46XX,47XXY) and I am a bit concerned that an 'alternative' site like this follows the mainstream polarization of gender on this input page. The reality is that biologically the population contains many shades of what you call gender. OK I'm an extreme case being what is generally termed a 'true hermaphrodite', but around 10-20% of the male population are to some degree Klinefelters (47XXY). Please follow the example the Australians are setting...  </p><p>[Reported Dose: '\t300mg of the bitatrate salt a day for 25 years']</p>"
}
