{
 "title": "The Life and Times of a Paradox",
 "author": "Shin Alex",
 "citation": "   Shin Alex. \"The Life and Times of a Paradox: experience with Salvia divinorum (5x extract) (ID 89909)\". Erowid.org. Mar 22, 2012. erowid.org/exp/89909",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 89909",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Added: Mar 22, 2012",
   "Views: 1376",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Backround:</p><p>My experience with psychedelics is limited.  Other than weed, I have had four experiences with LSA (morning glory seeds), smoked Salvia Divinorum once before, and most memorably had one experience with LSD.  Just a note, when I smoked Salvia for the first time years ago it hardly gave me any effects at all except I had the uncontrollable giggling and maybe a little of the common afterglow effects.  </p><p>Experience:</p><p>I purchased two grams of 5X and on the first day of getting it I smoked about a third of a gram to no effect.  I figured it would mirror the effect of weed where it doesn't get you high the first time and then if you smoke soon after waiting a day that it will have a strong effect.  I was absolutely right, because the second day I had the shit I got a pretty crazy experience.  I tried smoking a little bit of the stuff on the second day just to test my hypothesis.  I sat on the grass in my backyard looking at the trees and after the experimental hit took effect the trees became incredibly full of leaves and I felt really high.   For some reason I thought clumps of the leaves were purchasable, yea I don't know what the fuck I was thinking.  Anyways, this was a very light experience compared to my next one.  </p><p>Since the experimental hit was successful I thought I'd go for the real thing.  I went into the woods and put a pretty big pinch of salvia into the bowl.  I took a nice big hit and felt warmth and prickles on the back of my neck.  All of a sudden I felt like I was getting really high, like really high.  At that moment I remembered an account on erowid where some guy felt like he was falling.  I was like oh shit, I'm going to start free falling.  That didn't happen, but I got up and attempted to walk out into the street and that's when shit got crazy.  I froze in my tracks because I started to feel incredibly heavy . I then realized that my physical body began to extend into the distance and it continued to extend infinitely.   I was frozen, I couldn't move, and I knew I was going to be stuck there forever.  It's hard to describe, I became a paradox that extended forever.  It felt like reality had unfolded into forever and I was the unfortunate soul that this happened to.  This all sucked, because I had an itch that I couldn't itch and I wanted to be in my comfortable room.  After what seemed like 3 minutes I immediately came back to reality still feeling pretty high, but at least back.  It was a pretty short, but very interesting experience.  </p><p>Conclusion:</p><p>Overall, at the moment I would say Salvia is an interesting experience that any aspiring psychonaut should try.  Don't overdo it though, one good hit of 5X, which is one of the weakest extracts out there, will absolutely put you on your ass.  Don't be an idiot and buy 60X thinking it's going to be super happy fun time.  The only reason my experience didn't scare me is because I have had experience with some pretty bad trips before, so it didn't bother me (Severe depression + strong LSD =  Incredibly bad trip lol).  Oh, and by the way don't be an idiot like me, HAVE A SITTER PRESENT ALWAYS.  I got up not being able to control myself and ended up 10 feet from where I took the hit.  I could have wondered into the street or something, be careful.  I will only do this with a sitter present from now on.  </p><p>To compare it to LSD, the trip feels much less abstract than an LSD trip, while no less intense.  Personally I prefer LSD by far.  LSD has so much power in its experience, feels much more profound, and is much better at beating things like depression.</p>"
}
