{
 "title": "Cosmic Trigger?",
 "author": "Evildweevil",
 "citation": "   Evildweevil. \"Cosmic Trigger?: experience with Salvia divinorum (5x extract) (ID 8995)\". Erowid.org. Jun 1, 2004. erowid.org/exp/8995",
 "substance": "Salvia divinorum (5x extract)",
 "bodyweight": "12 kg",
 "header": [
  [
   "DOSE:",
   "0.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 8995",
   "Male",
   " ",
   "Not Given",
   "Jun 1, 2004",
   "Views: 7438",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>As a preliminary note, I am very interested in the expansive qualities of psychoactive drugs and as such believe that the trip is a mutual arrangement between myself and the drug.  If this is a respectful arrangement then the most can be gained.  More than any other drug I have come across, this is most true of Salvia divinorum.</p><p>Before I talk about the 5x strength trip I will place that in the setting of my other experiences. I have tried S. divinorum twice before: the first time was with dried leaf and I only had a threshold experience despite smoking about 4 bowls.  I've talked to other people and they have had similar experiences; it appears that you have to introduce yourself to salvia and her to you.  The second trip, briefly, was a dip/slip into the reality of Salvia but was really only a taster for what was to come.</p><p>I am personally very interested in chaos magick; my friend and I were taking a weekend away camping for ritual magick etc and the Saturday evening would culminate with a psychonaut 5x salvia trip.  We had already prepared with meditation and chi kung exercises to get the energy flowing.  After a small joint for relaxation purposes (i was quite nervous), we gave a thank you to the salvia for the opportunity to partake of her, my friend did the sitting, then I loaded the bong and fired...</p><p>I had the now familiar sensation of the firmness of this reality slipping away, and a sense of peace.  I lay back and shut my eyes.  I fell away from reality about 20ft; I was looking up my body which was floating on the surface of reality which was itself like water.   There was this cavernous space beneath this water/ reality surface and my awareness, within which I began talking to myself; relatively banal things like 'boy, am I tripping!' and then another voice would laugh at that.  I was using some books as a pillow (the joys of camping) and their hard corners suggested geometric tessellations which then started moving over the surface of reality.</p><p>I then became aware of my body encapsulating space which was expanding and contracting in time with my breathing- it was a lovely physical sensation.</p><p>I slowly came to and started relaying my trip to my friend.  I had lost all sense of time, I couldn't work out if I was making sense to him, if he was responding to what I was saying or even if I was actually talking to him at all...which led me to think that I was still tripping. And I most definitely was...</p><p>I lay back again and had one of the most intense experiences of my life.  I became aware of an entity, I couldn't fathom its nature but it began talking to me.  I intuited that it was an alien.  It spoke in a voice of absolute compassion which was fantastically beautiful.  This was roughly the conversation we had:</p><p>me 'Who are you?'</p><p>the 'alien' 'We are what you will return to...But you aren't ready yet.'</p><p>'When will we be ready?'</p><p>'Do not worry; when you are...We are waiting for you and we love you'</p><p>At this point I became aware that i was having sensations of awe like a religious epiphany and was amused, even in the middle of this intense trip, that I may wake up like a born again Christian...</p><p>Me 'What is this reality?'</p><p>The 'Alien' 'Reality is like the surface of a puddle and your lives are the splashes across the water'</p><p>Me '(Non sequitor) but I am too tired to return to you.'</p><p>The 'Alien' 'Yes you must rest now.'</p><p>(I was absolutely knackered)</p><p>Then the entity left and I became aware of this woman of light which I intuited to be salvia divinorum; she merely smiled and was gone almost as soon as she appeared.  Then I was confronted with a vision of the pyramids.  The tip came of the pyramid and there was an eye on every side of the pyramid.  It then began to spin round and ascend upwards throwing light out of each eye (akin to a UFO).</p><p>Then I quickly returned to ground zero.  Aside from the trip itself being a very beautiful intense experience, from the point of view of the psychonaut the subject is interesting.  What I saw was straight out of the Cosmic Trigger by Robert Anton Wilson which I had been reading recently.  There is a lineage from ancient civilizations right the way through Crowley, to Leary and Wilson of communications with aliens using psychoactives.</p><p>The question for me was, was I merely projecting what I had read in the form of an hallucination or was it 'for real'?  But the fact that I could even be in a position to ask the question is testiment to the phenomenal power of Salvia divinorum.</p><p>Message to anyone entering into a relationship with her: treat with respect in all senses of the word.</p>"
}
