{
 "title": "Microdot- The Best Trip I Ever Had",
 "author": "crystalship",
 "citation": "   crystalship. \"Microdot- The Best Trip I Ever Had: experience with LSD, Cannabis, and Tobacco (ID 89955)\". Erowid.org. Jul 7, 2012. erowid.org/exp/89955",
 "substance": "LSD, Cannabis, and Tobacco",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 2:00",
   "1 hit",
   "oral",
   "LSD",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 89955",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jul 7, 2012",
   "Views: 4431",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe best psychedelic experience I ever had was produced by a substance I can't be sure of. My cousin R and I had bought two small orange pills, called Microdot. We assumed it was mescaline in a pill form, but being so young and naive at the time, we didn't really even know what mescaline was. We just wanted to experience a nice high. I had a feeling it would be a very LSD-like experience. R was the same age as I (born five hours before me), and was a close and trusted cousin and friend. My memory has lost some of the details from this night from so long ago, but I do remember the more important aspects. <br>We met at some point in the evening at R's small, 70's-retro, but cozy little apartment (fake wood paneled walls, goofy wallpaper, a cheap steel-tube television cart with fake wood platforms and plastic casters, etc.). There were most likely a small group of friends there hanging out for a while with us, probably smoking some marijuana, as we were complete 'heads.' No cable, no internet of course, just a radio with a cassette player was all we had for entertainment.<br>At some point, maybe sometime after 9, some friends left, and around maybe 10, we ate the microdots, one each for R and myself. I can't remember the wait for the drug to kick in. It may have been around a half an hour or so. We were laughing and joking and having a great time. We probably smoked some more pot, which of course enhanced the pre-peak feeling. Having been through around a half-dozen regular LSD trips before this microdot experience, I knew the good and bad effects of LSD. I had experienced some fear and anxiety before with LSD, but also exhilaration and mellow euphoria. I knew that common factors for having the best experience (environment, friends, even weather) were crucial to avoiding a bummer. <br>Further into the night, the great buzz and mellow beauty of the trip intensified, but never awkwardly veered anywhere near bad. After the aforementioned sitting around and laughing period we had, we found ourselves down on the carpet, still giddy and interactive with each other, but in this complete mellow, fantastic, meditative haze. Being a smoker, I had probably blown through a bunch of cigarettes at this point. <br>I had brought over with me some music cassettes of The Doors, a couple of live bootlegs I had recorded from a radio broadcast. I popped in one of the cassettes and we just slipped ever so blissfully into a different meditative state, one of great concentration but also relaxation. It is hard to fully describe. We were just lying there, on a carpet, completely comfortable, totally happy, listening to this incredible music, which sounded amazing (and still does). It was way, way past midnight and we were wired yet still peaceful and relaxed.<br>We may have tried to fall asleep, but we couldn't. We continued laying around on the floor all through the early morning hours, listening to these Doors tapes that seemed to just go on forever. Eventually, a bit of light crept in through the closed venetian blinds. We had stayed awake past dawn. Soon, the golden summer morning light emblazoned the entire window, and the venetian blinds suddenly began to 'flutter' when I looked at them. If I looked up and down the window, the fluttering blinds would move with my eyes. This was the only hallucination or 'visual' I had, or can recall. By this point, we were feeling exhausted as the effects of the microdot were rapidly wearing off. R decided to crash in his bedroom. I walked home, only 1/4 mile away or so, and fell asleep. <br>As I write this, nearly 14 years later, I still can't understand what it was R and I had taken. Maybe it was LSD in very pure form, but a smaller dose. Maybe it was mescaline. But after reading a bit on this subject, I have to think it was LSD. The fact that a usable dosage of mescaline could not fit into such a tiny pill affirms that this could not be mescaline.<br>Yet, this trip was actually very un-LSD like. It didn't have the jaw-clenching, mind-racing intensity, and restlessness of a typical LSD trip. This trip was completely opposite of anything I had experienced before with psychedelics. Mushroom trips I had had were usually topsy turvy, yet generally more mellow than LSD trips. <br>But this microdot was fantastic. It was as though my mind was so careless and free that I didn't have any room for negative thinking or anxiety of any kind. What the trip may have lacked in visual colors or hallucinatory visions, it more than made up for in physical and mental wellbeing, even while listening to the often intense Doors music. <br>This experience was incredibly fun and worthwhile. I never again tripped on microdot. It was always very hard to find, for whatever reason. I only saw it one other time. Only a few months later, while away at college, I had bought one from somebody. A college friend of mine, a girl whose name I can't remember, had a single blotter hit of LSD. She asked if I'd trade with her, which I did. I dropped the acid that same evening, and she ate the microdot. Unfortunately, she reported to me the next day that the microdot didn't do anything at all. I had a complete psychedelic experience with my hit of LSD, and tripped all night. I felt bad about trading her a bunk microdot, but she reassured me it was all right, as she didn't want to take the LSD she had traded to me anyway. <br>I am glad I experienced a microdot, even if it was just that one time. At this point in my life, I have long since ceased using psychedelics and marijuana. Again, out of the many mushroom and LSD trips (mostly mushrooms) I had between 1996 and 2005, this one microdot experience was the best.\n\n\n"
}
