{
 "title": "Like a Slideshow",
 "author": "NyghtOwl",
 "citation": "   NyghtOwl. \"Like a Slideshow: experience with Amanita muscaria (ID 8996)\". Erowid.org. May 12, 2004. erowid.org/exp/8996",
 "substance": "Amanita muscaria",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "4.5 caps",
   "oral",
   "Amanitas - A. muscaria",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1993",
   "ID: 8996",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 12, 2004",
   "Views: 10118",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI am 32 and have long been interested and using psychotropics / power plants. In the autumn of 1993, I picked about 100 amanita caps and dried them out over a warm radiator. My friend and I made a curry and when it was about 2 minutes from being cooked we added the pieces of 9 amanita heads which, before drying, were about 8 - 10 inches diameter.<br>The hit took about an hour to come on. I had been using psilocybes in doses of 100 - 1000 for several years and I knew that the high would be different. It was, in away, milder than psilocybes...less wild and definitely more controllable. It was, I suppose, a bit like an hallucinogenic 'slide-show'. I find that when I have a full-blown psilocybe hallucination, i get first a rush then BAM whatever I am seeing is just 'there' and I am totally caught up in it. But with amanita, it was more gentle...there were several 'true' hallucinations, (by this i mean that I saw something that was not there, as opposed to mistaking(or tripping) an object into something which it is not...like a tree becoming a man or whatever). Thats what I mean by like a slideshow..there was no rush with the hallucination.<br>Walking was kind of strange: It seemed that a destination took ages to get nearer. But there were no 'colours' or 'tracers' of light. Music did not seem to take on any extra properties, as it does for me with psilocybe and acid.  It was, all round, a good experience; one which I undertook many times after that.<br>BUT, later that night, I felt a weight in my gut....I didnt feel sick, but I knew I was going to be because of this kind of dead-weight in my belly. I went to the lavatory, and projectile vomited right into the pan (good shot, eh). There was no retching or the crap that one gets when puking after too many beers. I just puked, lol. This mushroom CAN kill, btw. YES IT CAN matey. But, like many other plants and fungi, it can also teach :-)<br>*waves*\n\n\n"
}
