{
 "title": "A New Way to Smoke",
 "author": "plutonic",
 "citation": "Citation:   plutonic. \"A New Way to Smoke: experience with Nicotine (E-cigarette) (ID 89968)\". Erowid.org. Mar 5, 2011. erowid.org/exp/89968",
 "substance": "Nicotine (E-cigarette)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nicotine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 89968",
   "Gender: Male",
   " ",
   "Age at time of experience: 29",
   "Added: Mar 5, 2011",
   "Views: 9151",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n48 hours ago I quit smoking.... kind of. After careful research and a feeling of the product finally being mature enough, I changed over to an Electronic Cigarette, specifically the Ego-T. I chose that particular one because of the option of various batteries (650mAH, 1000mAH) and for the tank system it uses to auto load nicotine juice vs the old style cartridges.\r\nYou receive the following when buying a 'starter kit'. 2 Ego-T atomizers, 2 650mAH Lithium-Ion rechargeable batteries, and 7 refillable tanks. The batteries charge via USB adapter in about 5 hours (car chargers are also available) 48 hours in I'm still on the original battery's charge. You order the 'juice' separately, which comes in a range of nicotine strengths (0-24mg) and many various flavors. The tanks take about 1.2ml of juice when full and last about a day (equal to about a pack of cigarettes).\r\nUsing the E-Cig could not be easier, fill the tank, insert it into the end of the atomizer (the tank acts as the mouth piece) and screw on the battery. When you are ready to vaporize you press a button on the battery and inhale from the tank, this feels mostly natural and my worries about the button being annoying were unfounded. The feel of vaporizing is very close to smoking a cigarette, there is a visible vapor and you can feel the vapor hit the back of your throat. The vapor does not linger and there is no left over smell. The instructions say to only take 3-4 puffs at a time before letting it sit for 30 seconds, so you end up using it differently then a regular cigarette, instead of sitting smoking for 5 minutes every hour or however often you smoke, you take 3-5 puffs every 15-30 minutes (I'm sure this differs with everyone). Since I have switched I've felt very minimal cravings for a regular cigarette.\r\nThe heath benefits of using an E-Cig are as of yet undetermined, the 'juice' is mostly Propylene Glycol and whichever concentration of nicotine you choose, along with a little bit of flavor. I'm located in Canada and as of right now the juice containing nicotine is technically not approved for use by Health Canada but is sold by online E-Cig retailers anyways. I personally feel that this is a much healthier alternative to smoking, even after only 48 hours my sense of smell is starting to return and my lungs feel more clear then usual. An added benefit is the now draconian smoking laws present the world over do not apply to E-Cigs and they can be legally smoked anywhere. In speaking to other users this seems to vary quite a bit with some establishments allowing them and others not.\r\nOverall I'm very happy with the switch I have made as the product has worked out better then I expected. I recommend anyone who smokes cigarettes to look into one of these E-Cigs, there are various different ones on the market to cater to different tastes, and for me where smoking is very expensive (about $10 a pack) I'm saving about 90% over the cost of smoking cigarettes after the initial investment. It's also nice knowing I'm not feeding into the profits of large tobacco companies anymore.\n\n\n"
}