{
 "title": "The Cosmos As Id Never Seen Before",
 "author": "crystalship",
 "citation": "   crystalship. \"The Cosmos As Id Never Seen Before: experience with Mushrooms - P. cubensis, Cannabis, Tobacco (ID 89971)\". Erowid.org. Jul 7, 2012. erowid.org/exp/89971",
 "substance": "Mushrooms - P. cubensis, Cannabis, Tobacco",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:30",
   "1 hit",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 1997",
   "ID: 89971",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jul 7, 2012",
   "Views: 3562",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was attending the University Of Maine At Farmington for one semester. I had become close with a small circle of friends, a collective of young hippie coeds who loved to mostly get together and smoke pot. But on this particular night, in early October 1997, our experiences together would prove to be unforgettable. Well, at least most of it anyway. <br>I was with EC, B, and ER. ER was a girl, and was dating B. So it was us four together this night. I believe E and B had managed to score a 1/4 ounce of common cow patty mushrooms (typically dried, golden orange caps, white-gray stems). I may have offered some cash to them for sharing with me (I can't remember). They probably refused it because they were always very generous and kind. We were all 18 or 19, but experienced with psychedelics.<br>We ate the mushrooms on campus, and a short while after departed in EC's car, heading north, into the countryside. We probably listened to some live Phish bootlegs on the ride. It took maybe 15-20 minutes to arrive at our destination. Once we arrived, the sun had made it's slow descent and dusk was settling. To our left, or west, was a dense forest (I'll have to write about this psychedelic forest in a later story, as we had also explored this place in my time at school). To our right, or east, was a wide, gently down-sloping field with many clumps of clover among the grass. We walked down a ways and found a nice spot to sit. <br>There was still some early autumn light, and the weather was great. We slowly could feel the effects of these mushrooms intensifying, but I was feeling a mellow high. ER packed a glass pipe with good, gooey pot and we passed this around as we quietly talked and enjoyed our peaceful states. We were all very high now, each of us in separate states of bliss. The dim dusky light had now turned into a pale blue glow at the horizon, and the upper night sky revealed a billion secrets. We had all lied down on our backs on top of these beds of clover, which was very comfortable and never became itchy. <br>The universe was before us, in tremendous glory. Being so far away from a town or city uncovered one of the greatest sights I had ever seen. It wasn't the Magellanic Cloud (as this is only visible in the Southern Hemisphere) but was probably the defined edge of the Milky Way. The stretch of stars was panoramic, and didn't seem to end until it reached the very edge of the sky's periphery. As I gazed into this thick band of stars, I did feel that common 'oneness' vibe with the galaxy and universe. I realized how very small I was, a simple rationalization for me at the time at such a young age. There may have been a couple of meteors that shot through the atmosphere, blowing my mind a little more.<br>At some point later on, we watched silently as this cloud slowly rolled through and obscured the Milky Way. It suddenly started sprinkling. We continued lying there, not flinching. I didn't mind the strangely warm feeling of raindrops hitting me. It didn't rain hard at all, and I believe EC, B, and ER also enjoyed this gentle little shower.<br>We watched as the cloud slowly rolled away to the east, the sky clearing slowly before us. After what seemed like a very long time, the sky was completely clear, and the universe was again in full display. We continued staring into the Milky Way for a while longer. I had probably burned through a couple of cigarettes to this point. I remember feeling as though time didn't really exist. We all had felt like we had been there longer than we probably were. Still, we definitely were lying there for well over two hours. Talking about time now, in my older age, is a heavy topic, one that I'd rather not discuss too heavily. But back then, when I was naive to such heavy concepts, it was just a thought; while tripping on this night, I simply felt that time didn't exist, and I didn't think any more of it. <br>At some point, the four of us stood up and stretched out. I was still tripping, but was beginning to come down some, and I believe the others were also. It was pitch black out in the field. Someone suggested we all walk down to the bottom of the slope. We thought there were some woods down there. I ended up leading the walk. It was a good 150 yards or so from our original spot. I don't believe we had a flashlight. Once I felt the land flatten under my feet, I slowed up a little. Thankfully I did, because the next step I took was right to the edge of a body of water. There was a pond or lake in front of us, and we nearly walked into it. Luckily, I only ended up with some mud on my shoe. We decided at that point to get back to the car. We trudged up the gentle slope, found EC's car, and took off, perhaps smoking another pipe load of good pot. <br>Looking back, I have very fond and warm recollections of this night. I was in the company of the right people (although I didn't return for the following semester, and somehow lost touch with them. I do miss them dearly), and in the right place, at the right time. I witnessed something and felt something incredibly spiritual and awakening. Being a Catholic from a suburb didn't always allow for me to see other aspects of life. This experience was instrumental in my growth from a boy into a man. This night will always stand out for me as one of my top 3 best psychedelic experiences ever.\n\n\n"
}
