{
 "title": "Forgetting Myself, Over and Over",
 "author": "Aerosnale",
 "citation": " Aerosnale. \"Forgetting Myself, Over and Over: experience with Salvia divinorum (40x extract) (ID 89980)\". Erowid.org. Apr 2, 2012. erowid.org/exp/89980",
 "substance": "Salvia divinorum (40x extract)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "2010",
   "89980",
   "Male",
   "",
   "18",
   "Apr 2, 2012",
   "1834",
   " "
  ]
 ],
 "report": "<p>After weeks of thought, a friend and I decided to purchase a gram of Salvia from a local head shop and chose 40x to be the one.  I don't have much experience with psychedelics but I had smoked weed nearly every day for years, so I have experience with smoking.  I had been doing a lot of reading  on it and knew I should probably use some sort of a water pipe along with a torch lighter, because its active ingredient is released in smoke at a hotter temperature  than a normal lighter allows.  So after obtaining one gram of 40x  'purple sticky salvia' in a half-dollar sized purple plastic case, we stopped and got a novelty torch lighter at a gas station and grabbed my bed-time bubbler from my house and continued to the beach where we parked and smoked in the car.  I put some headies at the bottom of the crater and sprinkled the salvia product on top, completely burying the bud.  The product itself smelled like tea, was green but dark in color and contained small leaves as well as these dark clumps... definitely a heterogeneous mixture of plant matter.  I took one rip and cleared the glass and put it down immediately.  The sensation I began to feel was hilarious.  It felt like the force of gravity along with the sudden panic of falling back in a chair, (which is a funny feeling if your sitting in your car) constantly for 30 seconds or so until the effects slowed down and wore off.  My friend felt a similar effect and we laughed for a while and in 10 minutes i was dead sober and I drove us back somewhere.</p><p>Later in the night we decided to see if the salvia would have any effect again, with another friend of mine.  We continued to my car where we could play some music and be warm to sit and smoke.  I packed the pipe with the same ratio I had used previously and let my friend from earlier go first.  He clicked the torch lighter on, cleared the pipe, and began an endless laughing fit for 5 minutes or so, during which I grabbed my pipe, ignited the torch and cleared the pipe myself.</p><p>..... no thoughts at all, probably for 60 seconds or so</p><p>followed by my vision starting to return, but I could only see dark colors and geometric borders.  It was quite wierd, but I couldnt comprehend what was going on nor could comprehend anything at all, it just felt like a lack of everything.  When I could finally see enough to produce a real thought, that thought was 'WHAT.'  like I had just been placed in my body in that situation for the first time ever and I had to figure out what was going on... Like, what the f is going on. my memory seemed to be re-setting itself every second, so I was saying WHAT. WHAT. WHAT. without even realizing I stated the previous 'what'.  Eventually I could gather my life again without forgetting it, finally realizng where I was, who i was with, and what i was doing FOR GOOD.  I feel like i was able to come to that conclusion multiple times but my memory would re set and I'd have to figure it out from the start... how frustrating.</p><p>Anyways, I find it incredible that despite how many times I forgot my life, that I remember  the entire experience and have a good idea how long it took place for. Also, during the period of forgetting my life every single second, I did wierd things like turned my cabin light on, took my key out of the ignition, put it back in, started my car, opened and closed my door, probably just because they were habitual things I did that kept me in reality or because I just had no idea what in the world I was doing.  But when i was back to normal,  I wanted to locate all my things and start putting stuff away, but I had to spit.  As soon as i opened my door to spit, I had the most real deja vu experience of my life.</p><p>I continued to turn the cabin light on to gather my stuff... that too was part of my deja vu and so was everything i did.   I realized the root of my deja vu was my salvia experience I had just gone through minutes earlier.  All of the  wierd things I did during my WHAT.WHAT freak out were the things I was immediately having deja vu over.  It creeped me out, especially after reading a ton of stuff about time travel and the 10 demensions we can comprehend, it was kind of blowing my mind.  I felt the need to smoke some weed during this comedown because sometimes it brings me to a familiar place faster than it takes to become strictly sober, and then I was completley regular 20 minutes later and drove home.  Total out of body experience</p><p>Overall, the experience wasnt exactly enjoyable because I didn't have a mind to enjoy it with while I was high on it.  So it wasnt bad either.  Since it is an amazing story, I am glad i have the experience under my belt.  To be or not to be, that is the question i suppose</p>"
}
