{
 "title": "My Cluster Headache Cure",
 "author": "Austin",
 "citation": "   Austin. \"My Cluster Headache Cure: experience with Nitrous Oxide, Alcohol & P. cubensis (ID 90001)\". Erowid.org. Nov 18, 2011. erowid.org/exp/90001",
 "substance": "Nitrous Oxide, Alcohol & P. cubensis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "  ",
   "oral",
   "Alcohol",
   " ",
   " ",
   "8 ",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 90001",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Nov 18, 2011",
   "Views: 3910",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOne evening, me and my friends acquired some nitrous and alcohol for a good time. After several drinks and about 5 or 6 pleasant nitrous balloon inhalations, I began to experience pressure in my skull, like a bad headache was coming on. I decided to retire after drinking plenty of water and taking some tylenol. At around 5am, I awoke with excrutiating head pain. It was the worst physical feeling I have encountered before and I decided it was a result of my recent indulgences. These attacks would start very fast and without warning about 3 times a day, almost always occurring in the early hours of the morning and would last for a couple of hours. My mom took me to several doctors, including a neurologist. I was diagnosed with cluster headaches and prescribed many different types of medication that did not work. The only medicine that even dulled my symptoms were opiates, which would not completely stamp out the problem. <br>I did some research and, to my surprise, found that psilocybin was a possible effective cluster headache treatment. I mentioned this to my mom and got what I expected: a firm disapproval. Being an experienced user of psychedelics, I decided to make a trip to the fields the next time it rained and harvested many fresh Psilocybe cubensis mushrooms. My friend and I ate around 8 fresh mushrooms (approximately 3 grams dried) and had a great trip. The next night I had a full 8 hours of sleep with no cluster headache attack and haven't had one since. I hope this information helps with the possibility of nitrous causing cluster headaches and the effectiveness of psilocybin for the treatment and elimination of cluster headaches.\n\n\n"
}
