{
 "title": "First Rebirth",
 "author": "CrucifyTheEgo",
 "citation": "   CrucifyTheEgo. \"First Rebirth: experience with LSD (ID 90120)\". Erowid.org. Dec 30, 2013. erowid.org/exp/90120",
 "substance": "LSD",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   " ",
   "LSD"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2005",
   "ID: 90120",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Dec 30, 2013",
   "Views: 680",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nEverything and nothing that you had possibly imagined...\r\nAll the preparation, reading, learning, seeking & understanding has been futile, until you experience it yourself..\r\nMild anxiety, watching, waiting...feeling. Is anything happening? Is it working? Am I ok? What have I got myself into? The rollercoaster ride has just begun, you strap yourself in, a willing passenger. No turning back now my friend, why would you even if you could? This is what you waited for, this is what your life had been leading up to.\r\nThoughts begin melding into one another, to and fro, Pow! Pow! Pow! Tiny explosions in the mind...the ride growing ever faster. Soon enough you can't keep up with your own thoughts. Life itself spirals in your mind, your past, your future, the present. What is the present? How did I get here? Who...who am I? What is I?? Why do I need an I?\r\nYou let go.\r\nEgo less and in the moment\r\nThere is no I, there is no You.\r\nThere is one. One humanity, One mind, One consciousness.\r\nStreaming in all at once...the reducing valve of the mind has been unplugged...nothing is held back now, all is in front to take in, to see, to be. Distant memories brought to the forefront, reliving childhood moments as if they were real, but that was only a second in time.\r\nTime, the one constant, now lost. Lost in the swirling multitude of thoughts, ideas, inspiration. If there is no I, there is no Time. Time ceases to exist...\r\nLandscapes flood in through the third eye, urging you to dig deeper, to delve further into this unexplored territory. Not yet, you tell yourself, not this time...\r\nColours come to life, swirling and joining in a joyous cosmos in front of you. As clear as day, as vivid as anything seen before! This is how we could see you think? This! This is how we should see!\r\nThe thought is fleeting as ten thousand more pummel down the neurological paths...\r\nDistant now so as not to all be fully remembered, yet there inside somewhere...waiting to once again burst forth...\r\nTime eventually takes its toll. Emotions run high as your body and mind are overworked, overtired and over zealous when you really need to sleep. Just when you give up and admit defeat to this idea, a tear springs forth and begins a stream emotional refuge, pouring out any demons you had carried, any baggage, any negativity towards the world...\r\nYou hug your mother and tell her just how much she means to you while still more tears run down your face...\r\nHer motherly instincts direct you to the waiting pool...\r\nYou dive in and at once feel cleansed, floating under the water you reflect on the last 12 hours, sometimes horrifying, beautiful, insightful, joyous...incredible...\r\nYou emerge from the water...\r\nReborn.\r\nThank you, Albert Hoffman.\n\n\n"
}
