{
 "title": "DMT 423",
 "author": "Flotsam",
 "citation": "   Flotsam. \"DMT 423: experience with DMT (ID 9024)\". Erowid.org. Aug 25, 2001. erowid.org/exp/9024",
 "substance": "DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1999",
   "9024",
   "Male",
   " ",
   "Not Given",
   "Aug 25, 2001",
   "Views: 45833",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>At some point in our past, Jetsam and I were blessed by a dear friend with a large vial nearly full (4-5g) of lab grade DMT. Thus ensued much experimentation amongst the 2 of us and several of our closest friends. I won't go into descriptions of what occurred during or what we emotionally brought out of those experiences. What I want to discuss here is what we learned to make the experience the most meaningful and enjoyable. </p><p>\n Smiling\r Low level lighting\r Music, preferably with few or no lyrics\r Quiet environment otherwise; especially no talking\r Comfortable seating\r Smiling\r Pipe holder (and guide)\r A focal point\r Smile!\r Chanting\r Breathing deeply</p><p>\n</p><p>OK, so you have the chance to do DMT. You should feel good. It's not too often one gets such opportunities. Think about that for a second. Now, before you do anything else, smile. Just look around you and smile. Smiling has more effect on a DMT experience than any other variable. \n</p><p>Low lighting is very important. Darkness isn't too bad, but bright light is terrible. Avoid sunshine. Just enough light to make out the color of objects around you is best. \n </p><p>As with any strong psychedelic experience, music can play a crucial role. The 'flavor' of your musical selection can greatly influence the experience. Think about different choices beforehand. The one thing to avoid is anything with a lot of lyrics. Words, in general, seem to greatly diminish the experience (more on this in the next paragraph). Volume can be whatever you're comfortable with, although overly loud has shown to be unpleasant. One thing to keep in mind is that the peak experience only lasts 5-8 minutes with another 5-10 of re-entry, so choose songs accordingly. \n</p><p>Other than whatever music you might choose (or not, all quiet is good too), the environment around you should be relatively quiet. No talking!  Where smiling brings about good things, people talking nearby has the opposite effect of either bringing one down or darkening the experience. A distant hum of people is fine, but the act of processing language while in the midst of a DMT experience invariably is a Bad Thing. Without music, the sounds of a house are incredible. Also, bug sounds at night outside can be quite stimulating (maybe too stimulating for some). \n</p><p>By this point, you've probably already decided where it is you're going to be for the experience. Fluff it up. You want a comfortable place where you can either sit or lie back without fear of hitting yourself against anything. [One particularly intriguing way is to lay your head in a trusted someone's lap while they concentrate on you and perhaps gently hold your head.] \n</p><p>OK. You've picked your place and your sounds and made your proverbial bed. Before you lie in it, its time to smile again. Check it out! You're about to do DMT! And, you're about to do it in style! That's definitely worth a big SMILE. Take a moment to calm yourself, think of something wonderful, and smile. \n</p><p>Until you've done DMT several times, a pipe holder (someone who holds and lights the pipe for you) is strongly recommended. In the best case, this person doubles as a guide, having a number of DMT experiences under hir belt already and able to cast their own [positive] variables into the stew (as a guide, I whisper a single word with positive conotations in their ear just as they exhale the last hit. My default word is, of course, 'smile'). </p><p>Otherwise, this person doubles as a sitter, there to hold the pipe and maybe your hand during the experience. In any case, it feels much better to have someone there. \n</p><p>We found that a focal point while taking the hits can produce the most unbelievable take offs. Find something with contrast to focus solely on until you reach the peak. A candle flame or a plant in front of a plain wall both work well. It goes way beyond any concept of kaleidescope. \n</p><p>Here we go! Its not like you can read a step-by-step from here on because at this point you're inhaling burning plastic! Get over the taste. With time, you may even come to like it, similar to oysters or escargot.  \n</p><p>So, what's left to tell? The very last thing you should do when you are  exhaling the last hit is.... SMILE! Something about moving those particular muscles makes all the difference in the world. Even if its the foulest thing you've ever tasted, force yourself to smile during the experience. You'll be glad you did. \n</p><p>Once immersed in the peak, some people find chanting some meaningless sound or mantra helps. Remember to breathe normally. I've had the common sensation of feeling as though I haven't taken a breath in some time, when actually I just wasn't aware of it. A nice, deep breath in those cases feels great and serves to remind me my body's ok. \n</p><p>Try these guidelines for yourself. Submit a writeup of your results to Erowid. I wish you many smiles. :) <p>"
}
