{
 "title": "Pure Empathy",
 "author": "Newt",
 "citation": "   Newt. \"Pure Empathy: experience with Mushrooms (P. cubensis) (ID 9035)\". Erowid.org. Nov 18, 2002. erowid.org/exp/9035",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "2.0 g",
   "oral",
   "Mushrooms - P. cubensis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9035",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 18, 2002",
   "Views: 18748",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAugust 19, 2001<br>The ritual begins at 2:45 AM. I have been waiting 5 years for this moment right now.  I first became interested in mushrooms when I read about their use by the Aztec Indians in Mexico.  I'm in my friend's garage that has been changed into a hang out room.  It has chairs, a CD player, couch, and a pool table.  I have two dried grams weighed out.  I love the taste of mushrooms.  To me they taste something like raw potatoes.  I'm with three friends, R, C, and D.  D is drunk on 14 beers, C, R's girlfriend is sober, and R has taken 1.5-dried grams.  We are taking Psilocybe Cubensis mushrooms.  I can tell because they are bruised blue where the person that had harvested them handled them.  The Doors are on. R recalls the time in our 11th grade English class, when I did a presentation on Jim Morrisons poem Celebration of the Lizard King. <br>I have loads of trip toys: A glowstick, gum, tic-tacs, a hand-mirror, bouncy balls, whistles, a hackey sack, a balloon, candy, a koosh ball, Silly Putty, a blue light on my key-chain, an empty film canister, a deck of cards, and Magic Eye Books.  I'm not the Moderator of the Shroomery's Trip Tips forum for nothing! I keep checking my eyes with the mirror to see if they're dilated.  I am laughing like hell at D who is wearing my Raccoon hat.  There's a metallic taste in my mouth.  I wonder what time it is.  It's too bad I took off my watch. We're talking about the differences in the Mario Brothers Nintendo games.  My purple Kool Aid looks pretty good.  When I was sober it tasted like Dimeatap cough syrup.  I wonder what it will taste like when I'm shrooming.  D is singing 'Touch Me'.  R's brother comes in for a beer and gets made fun of.  I tell everyone that I like beer, but I'm afraid of getting a beer gut. D says to sacrifice food for beer.  Coincidentally D works at a beer wholesale store.  <br>My lower back and legs feel kind of numb.  I smell Oldspice.  The smell is so strong it seems as though someone has sprayed some in the room.  We are listening to Phish's 'Farmhouse'.  I'm not seeing any CEV's or OEV's.  More talking about the use of cocaine at Ivy League schools.  I feel like I'm really stoned or almost a drunken feeling.  Reminds me of the time I ate 2g of schwag on some Leary Biscuits.  The plywood in front of me looks rather orange.  Also the dark brown hair on my arms and legs appears to be black.  Then I say 'Reality Check.  I have eaten mushrooms'.  R thinks that I am about to freak out.  I keep having abstract thoughts such as about close friends and family of mine.  D says to just go with the trip.  R, C, and I are talking about highschool, tattoos, and people we know.  C talks about how she was homeschooled for a few years.  We all talk about school and how it should be changed.  R, C, and I all went to the same middle and highschool.  I pay attention because after all I want to be a teacher someday.  I tell R and C that intelligence is nothing without the drive and motivation to work.  I notice several patterns.  A Polynesian pattern in the rug that looks like one of the tattoos the men wear on their faces.  In the Magic Eye books R and I see faces in the patterns on the pages.  I see Spanish faces R tells me he sees African faces.  The faces I see are very Picassoesque.  They remind me of the faces Picasso used in the painting Les Demoiselles dAvignon.    I think this is because of my immense travels in Spain and seeing paintings by Picasso.  In the foreground of one of the pages there is a tiger.  It has red eyes.  When I am sober its eyes are black as midnight.  R looks in the back at the answers.  One of them is Beethoven.  We talk about how incredible both he and his music are.  I wish I had brought one of my dad's classical CD's.  <br>I see the face of an old Native American in the brown couch.  He reminds me of Ken Keseys character Chief Broom in One Flew Over The Cuckoos Nest.  I put on some Jazz, Miles Davis' Kind Of Blue, but nobody except me seems to enjoy it.  D puts on some rap that I don't like.  D and R go outside to the yard to talk. C and I stay inside.  I draw a bit in my book and talk to C about shrooming.  In my book I have drawn myself, the face of an eagle, a cube, and a pinecone.  I take out the Silly Putty and C and I play with it.  I change the CD to Phish's Story of the Ghost.  I'm glad that D, C, and R have all taken mushrooms before.  They know what I'm going through.  For me mushrooms are much more introspective than LSD.  I like the body high, visuals, and general feeling of the way they make one trip.  I even like them more than pot, which makes me paranoid.  However the only thing I don't like is the disorienting feeling during the come-up.  I also don't like the fact that I can't really tell when my bladder is full or empty. One minute I will be sweating and the next minute I am cold.  I pick up an oil candle.  I feel like a child discovering a new toy.  I gasp aloud in delight.  Its made out of hand-blown blue glass.  Right now its iridescent like sunlight shining through a sapphire.  There is a clear one that looks like mother of pearl.  On the fabric of my pants there is a grid that is woven on them.  I see it float up and move around.  D and R come inside. D wants to go to the local graveyard.  This thought scares me for a couple of reasons.  D is drunk and I never ride with drunks.  I dont want to ruin my first trip.  Im guessing that its sometime around 3:30AM and we would have to break into the graveyard.  Plus R told me that there are usually lots of cops around his neighborhood at night.  D decides not to go and I breathe a sigh of relief.  D asks me what I keep writing in my book.  I show everyone what I have written in my book so far.  They all like what I have written.  D says, 'You've got a glowstick? Bust it out.'  I take it out and I am about to break it when R says to wait until we are in his room.  It goes into the freezer.  <br>Vividly I see faint trails in the air and noticeable tracers off of Ds face.  The wood on the pool table is swirling, breathing, and bending.  Kind of like a flowing river of wood.  I see indecipherable writing on R's dad's workbench.  I hear crickets that just sound like a long buzz.  R's brother comes in to say goodnight.  If I were on bud and that happened I would be paranoid as hell.  I'm fine and not paranoid at all.  I think this is the peak.  I blow up the balloon and ask C to take pictures of me.  D sees her taking pictures of me, gets mad and says 'No picture time!  Wanting to appease him because he is drunk I put on a Tom Petty CD.  We sing American Girl.  When I'm sober Tom Petty sounds good, but on shrooms he sounds awesome.  I hear echoes in Learning to Fly.  I take out the glowstick and we all throw it around.  Tom Petty ends and I put on Belle and Sebastian's The Boy with the Arab Strap.  At one point Rs voice sounds almost Scottish.  I see a Native American bent over playing a flute, or perhaps a Capricorn goat that's a scar on R's head.  D passes out and R, C, and I talk some more.  We talk about religion.  Both C and R are Atheist.  I tell them my theories of creation and how I believe there is something after death. I say how Buddhism might appeal to them. I tell them that in Buddhism there is no God figure, the religion is based purely on the self.   I play with the lighter and look in the mirror. It's still me.  R tells me that he used to like the taste of grass as a child.  C and I tell him it was probably Onion grass he was eating.  R says he can prove us wrong.  He brings in a tall piece of grass that is split with two leaves.  He shows me the white part and instructs me to bite off the end piece with the dirt and eat the white part.  I do just that, and like the taste. I tell C and R about how scientists theorize that early man ate mostly grasses and modern mans appendix shrank.  Then we discuss the use of drugs by primordial man.  We conclude that alcohol, mushrooms, and Cannabis were the first drugs.  Alcohol because early man would have eaten rotten fruit that would have fermented.  Mushrooms and Cannabis because early man gathered for plants.  I tell both C and R how I've been to Europe and Canada.  We talk about the differences between our families.  The sun has risen, D passes out on the couch, and C goes home.  R and I go into his room since his dad is about to get up in an hour.  <br>Since R loves mushrooms his room is all decked out.  It's a tripper's paradise! R shows me his setup for his legal Shitake mushrooms.  He grows them so he can hide the illegal ones from his parents and have all the growing equipment around.  R is going to college in about a week so he has stopped growing the psychedelic kind.  R tells me that he has grown Australian mushrooms, P. Cubensis, and Pan Cyans.  He tells me that he tripped the hardest he ever has in his life off of 1g of Pan Cyans.  R shows me all of the artwork that he has done.  One drawing is a crossword of C's name.  Another is made up of inkblots.  The most incredible piece of work is a spiral made up of pen dots.  It took R 21 hours to finish.  R's room has tons of blacklights, blacklight posters, and objects that glow in the dark.  R and I talk about how it's unfair that people in society such as writers, poets, artists, and musicians get paid squat while entertainers such as sports stars are millionaires.  R turns off the florescent lights and puts on the blacklights and lights some incense.  We talk and I play with the glowstick while R plays with the blue light on my key chain.  We talk about school, Beethoven, and how Magic Eye is made for trippers. I have my watch on and try not to look at it.  But when R and I are talking it seems as though at least 30 minutes have passed when in reality only two have.  I have to make a conscious effort to move.  R has a curtain up in his window.  He wants it taken down.  Not wanting to inconvenience him I tell him I will get up to take it out.  It takes me about an hour to will myself to get up and take it down.  <br>I see the posters bleed, bend, and breathe.  I close my eyes and see some orange swirl-like closed eye visuals.  I also see Mesoamerican Indian patterns in R's rug.  They look like the Mayan calendar.  R shows me the tribal design tattoo that he has drawn and C wants to get on her back.  It is symmetrical and perfect on both sides.  R also shows me the second tattoo he wants to get.  It is a jester with smoke coming out of both eyes.  An ex-tattoo artist at Rs workplace drew it.  During all of this time in R's room I have been busy touching, holding and biting the glowstick.  It feels warm and playable, almost like flesh or warm clay.  We talk about Hunter S. Thompson.  I tell R how 'Hell's Angel's' has lots of speed use in it.  I tell him how Amphetamine was easy to obtain back in the 60's, how it was used in OTC diet pills.  This of course was before it was found out that Amphetamine is 'bad'.  R and I made up a theory that someday they'll find out that something simple like Aspirin is bad for you and we'll all have to buy it on the black market.  R and I talk about our future plans.  R's dog is with us.  R tells me how animals such as dogs and cats can tell when a human is tripping.  He says dogs get freaked out because they are not sure what is going on.  I wish we were at C's house or my house so I could play with a cat.  R and I talk more about our futures.  R and I look at a cotton shirt underneath of the blacklight.  In regular light it is dark green and grey.  However under the blacklight it appears black and white.  R asks me where I purchased it.  I am thinking of the place in my mind and am about to tell him when he finishes the sentence and tells me the exact place I was going to tell him! One more effect I notice are the patterns in the conversations I was having with my friends that night.  We were all on topic and each new topic would branch from the old one.  If this is empathy then MDMA must be pure love. I plan out most of my future.  R and I are pretty much sober so we decide to get some cereal.  I get some Life cereal.  It's more fun to play with the cereal than eat it.  I know that I haven't eaten for more than 6 hours so I force myself to eat a few bites. I love the fact that I can plan out my whole future in the course of 6 hours! This was an excellent first mushroom trip.  I feel as though I have bonded immensely with R, C, and D.  Before this night we were all practically strangers in each others lives.  I say a silent prayer thanking God for the creation of these wonderful fungi.  It's no wonder why they are called 'The Flesh of the Gods'.  Two grams is a perfect amount.  The only things I don't like about mushrooms are how they can make one's body temperature change.  I also hated the fact that R could sleep after tripping, but I couldn't.  Next time I trip I want to eat one and a half grams and smoke some weed or inhale some n2o.  I know I saw all the patterns I saw because of knowledge.  I have studied Polynesian, Mesoamerican, and Native American cultures. I also feel as though they have lead me in the right direction for what to do for a job.  As a moderator I love helping out people who are new to tripping and have fears and questions.  <br>In conclusion I feel as though everyone should try mushrooms; especially artists, writers, and musicians.  There is so much to gain from psychedelic drugs.  That is if you go into them with the right mindset.  You should go in knowing that they are not a toy or game and that they can screw up your mind.  Moderation is also key.  I could not imagine myself eating them more than once a month.  I do not however feel that those afflicted with depression or any other psychological disorder should take a psychedelic of any kind.  Also one should be in a general good mood before taking them.  That night I learned that instead of trying to control things I should just go with them.  Kind of like what Ram Dass says in BE HERE NOW.  I hope next time I trip I can watch a movie or take a walk in the woods.  Mushrooms, for me are a much more benevolent hallucinogen.  In the words of C 'They want to make me skip along a path on a bright sunny day like a child'.\n\n\n"
}
