{
 "title": "Mixed Results and Dosage Issues",
 "author": "troyw88",
 "citation": "   troyw88. \"Mixed Results and Dosage Issues: experience with Desoxypipradrol (2-DPMP) (ID 90368)\". Erowid.org. Jan 3, 2012. erowid.org/exp/90368",
 "substance": "Desoxypipradrol (2-DPMP)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Desoxypipradrol  ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 90368",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Jan 3, 2012",
   "Views: 11525",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI just happened to have procured 2 grams of this material [2-DPMP) mainly just out of curiousity. I am a 22 year old male, very expierenced with drugs in general (stimulants like e, mdma, coke, amphetamine. Psychedelics lsd mushrooms morning glory. Dissociative ketamine and dxm and alot of pharmceuticals opiates, downers). Recently a friends and I have been purchasing RC and remembered about desoxypipradrol.<br>After waiting a month for it to arrive, the long lasting ultra potent stimulant finally came and I eagerly opened the bag eyed out a tiny piece (it came in small soft white clumps and powder), busted it up, made a line maybe 2 cm long and 1cm wide cut it in two and snorted it back. <br>T0:00 it immediatly burned my nostril, I waited for the effects to start before I would finish the line. This is where the mistake was made, I was overly excited and after about 25-30 minutes I didnt feel any effect so I finished the line. 11 am would have been initial time of ingestion<br>T1:30 Feeling awake now but still weak. Music is improved and a definate mood lift. I call a few friends and also clean my room, definatly similar to methylphenidate or amphetamine. <br>T3:00  Mistakes were made with how potent this chemical really is. It take time to show itself but once it did I was jacked in hard. At the 3 hour point I was at my friends house, I had already redosed at my house and some more at his place while drinking a coffee, it hit me and I was jacked for 9 hours before any drop in intensity. During this time I mainly talked, played video games and smoked dope and did a few oxys because I realized I wasnt sleeping any other way<br>T3:00-12:00 This time can be described as being very focus on video games, I  had not realize the amount of pressure on my jaw until my walk home at T13:00. I also had other plans that day but I completely forgot just jacked in the zone mario galaxy was my goal. seriously focused<br>T13:00- ??? I walked home very focused on moving quickly also ingested another 10mg oxycontin. I cant remember much about being on the walk even though its rather long one, I know I got home was wired for sound for a day and a half and even ate a 60 mg morphine the next day. Morphine seemed to innteract negetivly with 2dpmp, screwed with my breathing...avoid. oxycontin was fine<br>All in all I've used this substance a bunch of times much more responsibly. A few friends ate it and enjoyed it, expierencing mild side effects mostly prolonged wakefulness, sleep usually occuring with in 24 hours of ingestion. I've found very little problems dont take too late, dont do more than a dose, and this may allow you to see well ..... ghost<br>A few were very sensitive and were affected greatly, maybe an inability to metabolize the chemical? It induced hallucinations of seeing ghost, both friends were effected this way much like a deliriant. Both expierenced effects for a long period of time and lack of sleep definatly contributed to their expierence. I assumed it was just too much dopamine floating around and lack of sleep but 3 nights ago I felt a cat jump on my bed walk up by me put its nose close to my skin, felt a small cold area when this occured I opened my eyes to see the shadow like transparent cat named slash... my cat. a few months before a similar incident occoured in my basement but thats another story a sober story.<br>so I've used still expierencing no real overwhelming negitives and at night time I've expierenced some trippy things, more test in this field will occur.<br>All in all good like long length, high like amp or methylphenidate. my friends also ate multiple dose ages one ate like a bunch over 7 days and looped him self. so be smart. peace<br>[Reported Dose: '10-30mg']<br>-------<br>Follow-up Five Weeks Later:<br>I reported once on this substance and made mention of friends almost going psycho delirious .... datura like effect... one small proper dose is good 4 all day, three of my friends snorted and snorted and all them ended up with delirious effects. One went to the hospital on his own, which I've mention before. Another just rode it out and the third the latest one was stupid and did the 300 mg I gave him. In 3 or 4 days .... He saw people breaking in to his house, called the cops, once the cops seen him, they took him to the hospital. I've expierenced some problems as well due to its long half life, it almost accumulates in my body, well it does accumulate. Mild amphetamine-like psychosis but then I would take a break and be good.   <br>[Reported Dose: '10-20......300mg in 4 days']\n\n\n"
}
