{
 "title": "A Glowing Light of Life",
 "author": "J. Flanagan",
 "citation": "   J. Flanagan. \"A Glowing Light of Life: experience with 2C-E (ID 90452)\". Erowid.org. Mar 2, 2012. erowid.org/exp/90452",
 "substance": "2C-E",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 90452",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Mar 2, 2012",
   "Views: 1497",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Recently, I ingested 30 milligrams of 2-ce, orally.  </p><p>First and foremost, the public is generally not very much educated about 'research chemicals'.  The purpose of this experience report is to inform YOU, about my experience for educational purposes.  </p><p>In my experience, 2-ce is all about 'set and setting' as Tim Leary put it.  In other words, the chemicals effect was influenced by my current state of mind, and the vibes of the group I was hanging out with. My friends girlfriend came into town for the weekend, whom I met for the first time while I was tripping.  I felt UNEASY as I tried to make an impression that I was a somewhat NORMAL person and I was just under the influence which is why I was acting so strange.  </p><p>I felt as though when I tried to express my thoughts as words, the order of my words were mixed up. For example, 'how do you? said meant do did I?  Did I just say that?! Not like this I..., No! NEVERMIND!!!' </p><p>Socially I felt awkward and uncomfortable as I tried to talk to this woman. Visually, I was astounded.  I could see, touch and feel the energy each person was radiating in the room, and each person seemed to have a different tint to their energy.  All of the 'waves' seemed to end up to a specific place on the ceiling.  It was like a glowing light of life on the ceiling.  All the energy of the room was flowing into this one specific spot.  My words do not do this beauty justice.  So I will stop.</p><p>In Conclusion, I believe 2-ce is a great tool when I am around people I  know and trust.  In the right settings, I suggest the use of 2-ce as a tool to enjoy life, bond, find some sort of 'truth', and think.</p><p>Thank you for reading.</p><p>Peace and happy tripping.</p>"
}
