{
 "title": "Slowing Down Into Death",
 "author": "M",
 "citation": "   M. \"Slowing Down Into Death: experience with H.B. Woodrose (ID 90458)\". Erowid.org. Dec 17, 2013. erowid.org/exp/90458",
 "substance": "H.B. Woodrose",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "11 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "2011",
   "90458",
   "Male",
   " ",
   "23",
   "Dec 17, 2013",
   "Views: 662",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wanted to try HBW seeds for a long time because I heard about their hallucinogenic properties. I have had a lot of experience with other hallucinogens so I know 'the drill' so to speak. </p><p>So I got the seeds and chewed them as well as I could before I swallowed up the paste. They tasted quite nice - almost like nuts but not quite. </p><p>The come on was quite rapid and only took about 20-30 minutes. I could feel myself wanting to yawn and was starting to have trouble walking around. At this point I knew that I was tripping. </p><p>So I went to bed to lay down and this is where it really hit me. I could feel my whole soul, my being, my consciousness, my life slowing down to a halt. Like a train with breaks on. The descend was not fast, but fast enough to be noticeable. </p><p>There were no visuals, but rather very deep thoughts. I could literally feel my self imploding on the self that was me - but not the same way as you would implode on some other drugs. More of a slow wrap up into myself. I covered myself with a blanket and just wanted to go deeper into myself as the trip progressed. </p><p>BEING INSIDE</p><p>This is where I felt anxiety. I felt as though I was coming closer and wallowing in my own spiritual pain. I felt as though I was 'there'. This is where my pain was originating from. My bleeding soul. I wanted to cry. I could see how my life was very deficient in some very obvious ways. I could feel all the suffering that my soul was experiencing on a day to day basis - but now I was there, inside the spirit chamber. </p><p>The time started slowing down even more. I was dying. At first I wanted to panic. I would have panicked if I had never experienced this before but my I could steer my subconsciousness ashore by 'knowing' that it was only a trip. Everything would be fine. </p><p>Usually when I go deep into my trips I wiggle my foot and hold on to my dick - because I can't feel my upper body so doing so is a good way to remind my brain that I'm still alive. I don't know why I do it, but I guess if I knew that I was going to die then I'd hold on tight to my dick and hope that it was only a dream. That's probably just me though.</p><p>I felt as though some tremendous healing was taking place inside my soul. I had a voice in my head, like the voice of an oracle that was telling me what was happening. I said that everything will be fine. It said that what I was planing to do next week would surely help me in many ways. And that felt good - getting this kind of confirmation. </p><p>DEEP SLEEP / MEDITATION</p><p>For periods of time I went in and out of deep, comatose, REM-like sleep. I was awake and yet I was deeply asleep. I suddenly realized what people who have made The Matrix must have been taking because it was exactly like The Matrix. The time was slow. The experience was like either thinking really fast when the time is slowed down speeding up the time while thinking really really slowly.</p><p>It was like experiencing the bullet time. Although my hearing was entirely unaffected by this trip. I could still hear the trains and cars go by so I was entirely conscious but I couldn't see and I couldn't move. I was deeply in the thought world where I was walking around the temple of my soul. </p><p>THE WRAITH</p><p>Another interesting thing that I have experienced was fast forward time where I was taken many years forward and shown me being old and sick and ready to die. It was like being attacked by the 'wraith' from Stargate. It was as though I was taken to the day when I was going to die. A voice inside me was saying that I still had a lot to do in this life and that it was not my time to die - but that the time would inevitably come. </p><p>I would also occasionally wake up and feel like I wanted to throw up. So I remember myself walking to the toilet to throw up and then hanging on the toilet lid for what seemed like ages. Then I finally threw up - but this time on the floor. The puke was so acidic that it hurt my teeth it seemed. It tasted like vinegar. </p><p>Finally the trip was coming to an end. This was about 9 hours after I have first taken the seeds. It was the middle of the night and I had a meeting the next day (where I was still slightly tripping I must say - but I was hoping nobody would notice). </p><p>NEXT DAY</p><p>The next day I felt happy. I felt as though my depression was not there. I mean it was still there but I was very alert and happy. I stood on the wet train station and I could see every detail around me. I was present, here, living the life. I felt extremely joyful inside. There was definitely a halo on that day. I could effortlessly speak to people and it felt great. Everything was so soft, so colorful, so beautiful. </p><p>These seeds are definitely interesting, although if you have never experienced 'fake death' before then you are in for a ride. The seeds showed me that we are all indeed mortal and that we are going to die some day.</p><p>I think that there is definitely a deep potential for severe anxiety if the user is not mentally prepared for a trip so I don't recommend large doses and do recommend ensuring that you are prepared for an experience that will take you to the 'cementary' - not the other side - but close enough.</p>"
}
