{
 "title": "Nothing More Than a Novelty",
 "author": "Genesis",
 "citation": "Citation:   Genesis. \"Nothing More Than a Novelty: experience with 4-Methylethcathinone (ID 90453)\". Erowid.org. Jul 1, 2011. erowid.org/exp/90453",
 "substance": "4-Methylethcathinone",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "insufflated",
   "4-Methylethcathinone",
   "(powder / crystals)",
   "  T+ 0:15",
   "50 mg",
   "insufflated",
   "4-Methylethcathinone",
   "(powder / crystals)",
   "  T+ 0:45",
   "1 line",
   "insufflated",
   "4-Methylethcathinone",
   "(powder / crystals)",
   "  T+ 2:00",
   "1 line",
   "insufflated",
   "4-Methylethcathinone",
   "(powder / crystals)",
   "  T+ 4:00",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 90453",
   "Gender: Male",
   " ",
   "Age at time of experience: 17",
   "Added: Jul 1, 2011",
   "Views: 18210",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI recently had the opportunity to try 4-Methylethcathinone at an anime convention, but I had very little cash, so I only got to sample a small amount.  Then yesterday a friend of mine let me know that the shipment of 4-MEC he was expecting had finally arrived. A small history of my past drug experiences include LSD, MDMA, MDAI, MDA, 4-MMC, 2C-I, 2C-E, Psilocybin mushrooms, DMT, 5-Meo-AMT, Cocaine and I am also a daily cannabis smoker. \r\nGetting back to the report, I went halves on a gram with a buddy of mine. What my buddy had received from online was quite a nice product, consisting of beautiful rice shards and nice crystalline chunks. I was surprised by the great quality because what I had tried at the anime convention was very clumpy, like some of the lower grade Mephedrone Ive seen around my area.\r\n+0:00  I weighed out 50mg to start out with. When I tried it at the anime con I had done 80mg of the clumpy impure stuff and I had been fairly high. So I thought Id begin my night with a smaller dose, since this was the crystalline stuff after all. I snorted the half point and to my surprise the burn was nothing near as bad as with Mephedrone. \r\n+0:05  Definitely already feeling it kick in. Having tried this chemical before, I already knew 4-MEC was nothing fantastic or extremely euphoric but if I were purchasing this substance without prior knowledge of its effects, for say an EDM show, Id most likely be disappointed. Its simply a novel cathinone, nothing to rely on to enhance my night.\r\n+0:15  Feeling full effects of my 50mg line, I decide to take another half point bump to get things going. Once again, nothing extraordinary or unique, feels like mephedrone without the intense euphoric edge. Talking is easier and I can barely sit still. Increase in appreciation for music but nothing too incredible is noted.\r\n+0:45  Times flying by and I can barely keep focused on one thing or another. I weighed out another line, thought Id do about 70-80mg this time around. Snorted her up, this time is burns a little more. Probably just wearing on my nasal tissue from the previous bumps. \r\n+1:30  Pretty energized, thoughts are kind of scattered but watching a couple episodes of random TV shows proves interesting and easy to follow. Usually on mephedrone or when Im rolling I can never focus on TV or movies, but with 4-MEC this wasnt the case.\r\n+2:00  Weighed out and snorted another 70-80mg line, not really feeling an elevation from each bump anymore, but rather I feel like Im just extending my current level. Typing is easy and thoughts are flowing pretty nicely considering how antsy I feel physically.\r\n+3:00  Coming down very nicely in comparison with mephedrone. I always get such a horrible craving for more when my drone runs dry but I even have some of this 4-MEC left over which Im going to save for tomorrow or the next day. Sleeping seems like a great possibility rather than a daunting task that will never get accomplished which I feel with a lot of stimulants.\r\n+4:00 - I drank some calming tea and smoked some of the resin in my bowl, after which I proceeded to lay down and fall asleep with no major issues. A little tossing and turning at first but nothing like drone.\r\nOverall, 4-MEC is nothing more than a novel research chemical which has a few perks of its own but they are overshadowed by its lack of euphoric effects. One of my favorite things about this substance is the lack of any serious cravings afterwards. I always just feel so dirty and depressed when the fiending after mephedrone hits but I didnt experience anything close to that with this stuff. Today I feel fine, no hangover and Im not completely drained either. The bottom line is its nowhere near going out of one's way to acquire it.\n\n\n"
}