{
 "title": "Foggy Dream Or Reality?",
 "author": "Sivvy Stilts",
 "citation": "   Sivvy Stilts. \"Foggy Dream Or Reality?: experience with Oxazepam & Alcohol (ID 9051)\". Erowid.org. May 5, 2004. erowid.org/exp/9051",
 "substance": "Oxazepam & Alcohol",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "60 mg",
   "oral",
   "Pharmaceuticals",
   "(pill / tablet)",
   " ",
   "  ",
   " ",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9051",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 5, 2004",
   "Views: 22340",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI post this partly as a warning; what was experienced had the potential to be very dangerous and could of resulted in some very very bad results. \r\nThree friends and I had just rented a hotel room in a different state, we had a box or two of beer/wine coolers and other softer drinks.  The plan was to just enjoy youth, alcohol, and the weekend miles from responsibility.  One afternoon, as we were getting set to drink, I pulled out four 15 mg white SERAX pills from my stash tin.  The background of these tranquilizers is that their chemical name is Oxazepam, being a sister drug to the infamous Diazapam, or, as you may know it, Valium.  Anyway, they were prescribed to a friend to help quit smoking, and generally calm the patients nerves.  I had used them 2 or 3 times before, but not at such high doses, and not with alcohol. I wasn't too impressed, they just made me relaxed and a feeling of well- being.  So, when I put them in my mouth and washed them down with three hard lemonades, that's what I was expecting, a impaired state of well- being.  But, it's known to happen, I was wrong, very wrong.\r\nI went down to the lobby about 5 minutes after they slid down the hatch; I was feeling buzzed off the alcohol with no noticeable effects from the Serax. I stepped into my room, a little gidy, and that's when I lost my memory.  I woke up 9 hours later perfectly sober, my friends were there along with some guests I have never met.  Still confused I looked out the window at the lake on the outskirts of our hotel, it was dark, but I could still see the geography of it. That's odd, I had a dream about that lake that fit the physical characteristics exactly. I scratched my head and sorted my way through these people I have never met towards the bathroom.  I was upset and began to wonder where my 9 hours went. As I peed I noticed I didn't have any underwear on. Where'd they go... I exited the bathroom and thought the Serax just put me to sleep with strange foggy dreams.  As I began to talk to the strangers... which I found out my friends met and invited... I told my best friend, Shawn, about the lake in my dream. I explained how, in my dream, I felt lost and couldn't find my way home, and that I went around the lake looking for it.  Shawn laughed and said that that really happened.\r\nMY DREAM \r\nAfter the lobby... According to my friends, I then opened a gallon of Jack Daniel's Punch and refused to share, drinking the whole thing by myself.  I only remember a snapshot of this, pouring my cup and spilling all over the table and my lap.  After drinking this, they said I just passed out on the bed asleep.  They figured I was okay and they left to check out a festival that was happening across the street. Three or four hours passed and they decided to pick me up from the room so I could enjoy the festivities.  According to them, I was still lying in the same spot on the bed.  Apparently, I seemed fine, so they told me to walk with them outside.  Keep in mind, I have no recollection of this.  I have done Datura several times before, and that this bad combo of booze and tranqs were somewhat similar, in the sense, I was out of my mind delusional.  We were walking on a trail by the lake when I got angry with them and yelled 'Fuck off' to them and started walking another way through the crowd.  They ignored me and kept on walking.  The story gets really fuzzy because no one sober was there to recollect it.  All I have to go on is the snapshot memories I had. Anyway, I walked across the lake, and my feet were very tired, I was getting frustrated and wanted to go home badly, but I didn't know where I was.  I  remember I asked this biker 'Which way is my house'. I don't remember his reply but he had to of thought that I was on something.  Next, I was on the bank of the river and I was so happy to see my brother, Klint. He told me that we could cross the lake to get home, and I remember seeing stepping stones magicaly appear on the surface of the water to walk across.  My brother was really 300 miles away, the person I saw was a hallucination that I had a long conversation with.  This is what I mean when I say it was similar to Datura.  Anyway, 3 or 4 hours passed and my friends started to look for me, one of them found me, I was barefoot in the lobby sitting on the couch talking to someone who wasn't there.  I don't know how I got back to my hotel, but I was found and brought up to my room before anything more happened.  I fell back asleep on the bed.\r\nWell, It was very dangerous, mostly because I had no idea it would do all that to me.  I have only a dozen of snapshots of that day, one of the strongest of which was me trying to stand up but I couldn't, I kept slipping and rolling all over the grass. I said to myself 'this must be a dream, I'd be arrested by now if it wasn't.' But that was mostly it.  So the moral of the story; be careful with the substances you take it could end up being very bad, or in my case almost very bad.\r\n  -SIVVY STILTS\r\nP.S. My underwear is still MIA... could've ended very bad.\n\n\n"
}
