{
 "title": "A Truly Amazing RC",
 "author": "Ravunker",
 "citation": "Citation:   Ravunker. \"A Truly Amazing RC: experience with 2C-E (ID 90584)\". Erowid.org. Nov 9, 2012. erowid.org/exp/90584",
 "substance": "2C-E",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "35 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 90584",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Nov 9, 2012",
   "Views: 980",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI thought I would take the time to write about one of the greatest experieneces I've ever had in my journies with Research Chemicals.\r\nI would consider myself a rather experienced person when it comes to the mind being altered. I've done several of the popular illegal items like Mushrooms, Extacy, Coccaine, Heroin, and then also a lot of obscure rare RC's that would take me forever to type out.\r\nI was really intrigued about any phen after reading some of Shulgin's reviews and reports in his infamous books. He listed 2C-E as one of his magical half-dozen, so I figured as a start, this would be the wise one to choose.\r\nI ordered from a very trusted and reliable RC source, and began the night watching TV. I weighed out 35mg, which is on the heavier side of dosing, but I didn't want to have a weak trip for my first time. I parachuted it with some water, had a meal an hour previous, so I was hoping to avoid the nausia some of described.\r\nAt the 1 hour mark, I started to feel something come over me. I turned on some music and put on visuals to go with it on my flat screen and got in a relaxed position.\r\nAt the 1.5 hour mark, it really started to kick in. I didn't feel any of the nausia, so this was a total plus. My visuals started having trail effects, and colors were becoming distorted. The music was completely taking over me, and was allowing me to connect to a deeper state of mind. The trip just kept getting better and better, and the visuals on the TV were really insane. The bass from my sound system was creating a vibration throughout my body that was simply amazing.\r\nHonestly the best part of this trip was how much the music was controlling everything. I was laying down most of the time with my eyes closed having insane CEV's that were moving with the music. To really dumb down this trip, I would say it was like taking Extacy with LSD. I had an awesome sense of well-being, and it was like I was in a crayon world visually speaking.\r\nThis lasted for about 2 hours, getting me to the 3.5 hour mark where the trip started to slowly ware down. The comedown was completely easy, and I started to get up at points and realize the bliss I just experienced.\r\nAfter 5 hours total, I was basically at a baseline state, but with an amazing afterglow. It was well into the morning, and I proceeded to my bed for sleep. My dreams were even amazing that night, fully vivid and colorful.\r\nThe next day I couldn't help but smile all the time thinking about how astonishing my trip was, and how there was literally no side effects, not even a headache.\r\nSince that first trip, I have done it approx. 12 times. The thing is, I believe towards the end of those trips, I was taking it too frequently, and 2C-E lost its magic at around the 10th trip. My last trip was a disaster as I had combined it with 2 other RC's, and its been close to 7 months since I've touched an RC since that trainwreck of a trip.\r\nAll in all, 2C-E is simply outstanding, but just respect it, like with any other phen. \r\nPerhaps one day I can be reunited with the feeling of nirvana that I had my first time, but I believe even that once was enough to effect me for the rest of my life, leaving an anti-depressent impression with me.\n\n\n"
}