{
 "title": "First Time...Bad",
 "author": "sparkles",
 "citation": "   sparkles. \"First Time...Bad: experience with MDPV (ID 90675)\". Erowid.org. Jul 28, 2011. erowid.org/exp/90675",
 "substance": "MDPV",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "MDPV",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   " ",
   "3 mg",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2011",
   "90675",
   "Female",
   " ",
   "20",
   "Jul 28, 2011",
   "Views: 12982",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I snorted the first bump of the gram I had gotten at 5:00 pm. I hardly felt it so I figured it was not as potent as other things I had gotten before. I was supposed to get Mephedrone, however my dealer said they ran out and gave me a gram of the MDPV. When I first opened the bag it was strange because it was not very like powder at all, much denser. But I got my scupula and took out enough to do a line, which turned into three because the effects started kicking in very early; I suppose I hadnt eaten that day since noon which might have had a part.</p><p>After only 10 minutes I had already started to grind my teeth and had to make a trip to the gas station to get a pack of gum. After about 30 minutes to an hour different effects came in, it felt like I was rolling. This lasted for about two hours, the euphoria feeling that is, then the adverse effects of the drug began. It now felt like I had smoked crack and was coming down, but it didnt end. The restless feelings became irritating because I was tired and wanted to go to sleep. I did not get 10 minutes of sleep that night. It was terribly difficult to focus on anything because my mind would not stop racing, and I couldnt concentrate on anything for more than a minute.  I got terrible twitches every time I would begin to get comfortable. The coke/crack feeling lasted for about 6 hours. Now I have been awake for a couple days, but hallucinations have not started yet.</p><p>I have found that nothing will make the feeling go away. I drank a screwdriver to begin with to mellow down my racing heart, I was tired for an hour, and then all effects of the alcohol were gone. I then took 3mg of klonipins as well as many over the counter sleep aids. This did not help either for then I was still wired in my body but my brain wanted to sleep, which lead to a night of tossing and turning in my bed. I feel that if I had taken a lower dose this would not have been so bad, I know now that a little is a lot, and it is much more effective and longer lasting than cocaine. It was worth the experience, now I know to not take as much late in the evening, it seems like a rave or day drug at high quantities. I should have looked at these posts before, 25mg is plenty and I took four times as much, not thinking. But we all learn from mistakes. I hope the next experience is better.</p>"
}
