{
 "title": "Shifts from Calm Stimulation",
 "author": "TreeStar",
 "citation": "   TreeStar. \"Shifts from Calm Stimulation: experience with 4-Fluoroamphetamine (ID 90766)\". Erowid.org. Aug 9, 2011. erowid.org/exp/90766",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 90766",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Aug 9, 2011",
   "Views: 10089",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n4-fa summary:\r\nI have tried 4-fa many times in the past 3 months.  Given the rising popularity of the substance, I decided to share my experiences.\r\nFirst Time:\r\nThe first time was unique. A group of us each swallowed 150 mg.  15 minutes after administration, the first alerts arrived. My mind became much calmer, and I spent time completing each thought before moving on to the next. The comeup plateaued 15 minutes after the first alerts arrived. Unlike dextroamphetamine, the body feels very relaxed just like the mind. Almost a stoned feeling. After 2 hours of great conversation, the drugs effects started coming in waves. The waves manifested in the conversation as periods of silence.  At 3 hours, everyone was noticeably irritable, and the group broke up.  A constant state of agitation was experienced until 5 hours after administration.\r\nSummary of other experiences:\r\nAt no time did my pupils ever dilate in the way they would under the influence of other drugs. I never again felt as stoned as I did the first time. Also, the wave effect is not noticeable. I found that the drug shifts from calm stimulation to a state where the mind looks for something to mildly worry about 4 or so hours after last administration when doing tasks alone. When with another, the worrying mood is not as strong. \r\nI noticed the most profound effects at dosage levels between 150-180mg. I used 4-FA as a study aid with doses between 80-100mg following up with a 50mg redose an hour an a half or two hours after the first dose.  The redose lengths the calm stimulation period while only mildly increasing irritation later.\r\nI had problems sleeping ~6 hours after a 150mg dose. I would just lie awake, but be unable to fall asleep. Subsequently, I discovered that a bowl of marijuana smoked when the irritable effects begin or when I wish to fall asleep is a godsend. Insomnia no longer becomes an issue, even two hours after the last dose. The only negative body signs I have experienced are slight aches in my joints and muscles the morning after.\r\nThe most 4-fa I have taken in a single day has been 300mg: 150mg initial, 50mg at +1:30, 100mg at +2:30.  The next day I did not notice any negative effects, but I was still stimulated from the last dose until about 16 hours after I had taken it.\r\nI have noticed a mild craving for the substance when I am bored, but nothing that cannot be easily ignored. On two occasions I experienced two days of back to back 4-fa use with sleep in between. I did not notice any tolerance effect on the second day. \r\nThe most pleasurable parts of this drug are the way conversation and ideas flow and how it decreases my irritability in the first part of the high. Situations or people I would avoid because it brings me stress no longer stress me during the first part of the high. Music appreciation is definitely increased, and towards the later part of the experience my horniness increases dramatically. Walking around seeing girls is very pleasurable. No problems experiencing an erection while under the influence, either.\r\nI hope that this was informative. Please use this research chemical responsibly so that it continues to stay under the radar.\n\n\n"
}
