{
 "title": "The Day Sally Took My Virginity",
 "author": "Clarkadacious",
 "citation": "   Clarkadacious. \"The Day Sally Took My Virginity: experience with Salvia (ID 90818)\". Erowid.org. Nov 7, 2011. erowid.org/exp/90818",
 "substance": "Salvia",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 g",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 90818",
   "Male",
   " ",
   "Age at time of experience: 15",
   "Nov 7, 2011",
   "Views: 2503",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>'The time police are coming!!'</p><p>It was a very nice day out in October. The sun was shining, The sun's energy was warm on my skin, yet it was still a bit chilly out. I and a few friends decided to buy a half ounce of some bud, but something was just different about today. And thats when it happend, My friend D and his cousin B, and her boyfriend A, were all talking about buying salvia in the car. I looked over so fast at D i could have sworn his face almost got ripped off, and said, 'since were all feeling like a boss today, I think were all ready to try salvia for the first time together.' (Let me remind you we are a very close and tight group of friends, and have already done a huge variety of drugs together mostly LSD, MDMA,DMT and Bud) </p><p>So, we went to our local head shop and picked up 3 grams of Purple sticky salvia, 40x. The guy that ran the place advised us that this stuff was no joke, and some pretty powerfull stuff. We thanked him and left. On to our destination. We decided to go to a very special spot to us, On the side of a mountain that has a path going up to it, and on the mountain were railroad tracks. All the green tree's, the warm sun, No clouds, soft gently breeze, it was absolutely fucking orgasmic. </p><p>Well, we got out of the car and I carried our mini-hooka, while A had the salvia. I told him not to lose it, Or i'd rip his cat's tongue out and play the piano with it. He laughed. We finally got to our spot, I sat down on the train tracks, D was sitting not to far on my right, A and B were sitting on a log straight infront of me. 'I wanna go first, I want sally to rape me hardcore.' So, A handed me the salvia and I started packing the hooka. I'm not ganna lie, I was kinda nervous, But finaly got over it and was ready. I cleared the whole bowl in 1 hit, holding it in as long as I could. I wanted my money's worth, and I got slapped in the face by what seemed to be sally's giant cock. </p><p>The first noticeable effect was this pressure I felt on my shoulders, it felt like someone was standing on my shoulders, and kept getting heavier and heavier. I looked around, everything was all so weird to me. Then it started. The laughing. I couldn't stop laughing, I was laughing so hard that my laugh had a laugh. I looked at D, B, and A and they looked like those canadian people off south park. It made me laugh even harder. I slowly leaned to my left untill my whole body was on the tracks. I couldnt get up, I was stuck there. The pressure was kind of getting overwhelming, but no sweat really. Then, my head touched the iron of the track, and my head seeped into the iron. I couldnt lift my head out of the iron! it was like, my head was part of the track but my body was free. </p><p>Then this is where things got really weird, and I'll try my hardest and best to explain. I couldn't see my body anywhere. I was outside of it, In some weird color'd dimension where the only color was red blue and green. I was the red color, Trying to get away from the other colors but they trapped me within them.(remind you i could still hear myself laughing but couldnt see ME) I finally broke free from the colors, and when I did, BAM! I felt something grab me and completely rip me out of that dimension, and got ripped through space and time. As i was, I seen sirens and heard on a loud speaker, 'He's escaped' Over and Over. And instantly i was back into my body, and I kept screaming, 'THE TIME POLICE ARE COMMING! THEIR AFTER ME!' </p><p>And out of nowhere i could finally get up, and i tried to walk foward, took a few steps, and something seemed strange...I WAS SITTING ON THE TRACK STILL! I tried again to get up and walk foward, but it didn't matter how many times i tried because i'd still end up back at the same spot i was in before. It was like I was stuck in a 4 second loop, going on and on and on. I was getting frustrated, so i gave up trying and just sat there. I looked around, I was deffiantly comming down but still pretty fucked up. I got up to try and walk to D, and it worked finally....Or so i thought. NOOO!! WHY DO YOU HAVE TO BE SUCH AN ASSHOLE SALLY?!! It felt like she shoved her hand into my ass, Elbow deep, and started playing an orchestra of anti G spots. I thought Sweet sally was raping me violently, The terror i felt was unbelieveable. I got up and ran, Holding my hiney, and B was laughing at me. </p><p>I finally came off the trip, and had a very good body high for about 20 minuets. But still had that pressure feeling on my shoulders. But all went away, and all was good. Smoked a blunt and was back to normal.</p><p>CONCLUSION,</p><p>Goddamn! sally is nothing to be disrespected. I for one can say i enjoyed this trip alot, Even though i can say im the first guy that has ever been raped by a plant. I've had many salvia trips since then, and enjoyed everyone of them to the fullest. Next time I should have asked her nicely to bring some lube atleast. Happy Tripping Folks!untill next time brotha mangs.</p><p>Clarkadacious, Out.</p>"
}
