{
 "title": "Spiritual Trip",
 "author": "YellingAtScience",
 "citation": "   YellingAtScience. \"Spiritual Trip: experience with 2C-P (ID 91018)\". Erowid.org. May 16, 2011. erowid.org/exp/91018",
 "substance": "2C-P",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-P",
   "(capsule)",
   " ",
   "  ",
   "insufflated",
   "2C-P",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "91018",
   "Male",
   " ",
   "16",
   "May 16, 2011",
   "7983",
   " "
  ]
 ],
 "report": "<p>To begin, I was having an extremely interesting day, lots of activity and general amount of good vibes all day long. Then after making the decision to somehow continue my escapade of happiness throughout the rest of the night, I decided to dose up on some 2c-p. Now the only problem with this is that me and my close friends that I commonly trip with have only ever known the amount that adds up to 10mg. Now this is a common dosage, with moderate effects, but on this night with my newfound happiness of the day I decided I wanted to trip extremely hard to the point of overwhelming myself in the best way you can. </p><p>After ingesting around 10mg of 2c-p through use of a cap. I decided that I should snort some, great idea, anyways I snorted around 2-3mg of it extremely hard to determine (eyeballing the entire time) the dosage I didn't care too much. After I snorted it and got rid of the horrible face pain and watery eyes I wanted to take a shower (which me and my friends after tripping alot off 2c-p have decided is a good way to hold off any un-necessary nausea or actual vomitting) and I got out and had to hurry home so as not to trip while driving and endanger other lives than mine.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  45 minutes after ingesting and snorting my eyeballed amount I had made it home safe and happy, now begins my most amazing trip I've ever had on 2c-p...</p><p>After preparing my room and myself for the oncoming trip I finally laid down on my bed at about the 1 hour mark completely ready for just about anything. I had two bottles of chilled water, pre-made hot pockets (in case I some how become hungry, even though I never did), and a massive amount of trance and house music on playlists pre-made to present different types of trippy songs at different times. Almost as soon as I started the music around 1:15 into it I started having intense tracers and slight close eyed visuals, along with the regular wall and ceiling movements. I put on some trance at this point deciding it was time to lose my fucking mind!! As soon as the weird sounds of Vibe Tribe came on at around 1:25 into this trip, I was thrown into close eyed visual tunnels of of spiralling patterns and oddly enough for the first time numbers constantly changing (as stupid as it looks written it was amazing). At this point I fell out of actual concern for reality and the world around me due to the intense realistic awe-inspiring visual show I was being presented. </p><p>I then only became aware for about a minute or so around 2:00 into the trip realizing I was going to start peaking very soon and I decided to keep my eyes focused and open on the corner of my bedroom. At around 2:15 into it, a new trance song came on and almost immediatly stars or orbs of light were thrust out of the corner at and around me engulfing me in what I preceived as space. I was slightly over-whelmed by the intensity and realistic look and feeling of this at first but then I confirmed it, I was now in space floating endlessly for now reason. I then came upon a shaking material that I thought was some sort of white dwarf star, but I soon realized it was an atom of some sort, I then touched it and everything stopped right where it was... Time was completely frozen and a large chill shot all over my body because I was actually convinced that I had done something to permanently stop time and the universe itself. </p><p>At this point I felt as if I were not alone any longer, as if some being or other existence was in the company of me. I then heard a small voice tell me, 'life is the journey to death, and death is our purpose in life. When you die, and you will, it is the most universally natural thing you will ever accomplish. You must accept this, embrace it even.' I then was thrown out of my un-conscious state of tripping COMPLETE BALLS and realized that this 'space trip' of mine lasted around 3-4 hours of trance music and rolling around in my bed like an idiot. I felt completely changed but continued my trip anyways the rest of the night almost completely conscious until I became exhausted and passed out around 10 hours into the trip.</p><p>After waking up, not knowing or caring what day or time it was, I decided to eat breakfast and smoke a bowl or two of some ganja. I started to finally recall the events I had undergone and decided it was the hardest I've ever tripped. The best part is this was my first spirtual trip on a psychoactive not very common with spirtual effects. 2c-p is now one of my favorites.</p>"
}
