{
 "title": "Piracetam Good for This Old Guy",
 "author": "Max",
 "citation": "   Max. \"Piracetam Good for This Old Guy: experience with Piracetam (ID 91076)\". Erowid.org. May 31, 2011. erowid.org/exp/91076",
 "substance": "Piracetam",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "7200 mg",
   "oral",
   "Piracetam",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2011",
   "91076",
   "Male",
   " ",
   "66",
   "May 31, 2011",
   "20949",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Im into nootropics, antiaging, and supplements in general. Ive been taking Selegiline and Phosphatidylserine for a long time but I heard about Piracetam so I had to try it.</p><p>The first night I took 2400 mg and went to sleep. I had the most amazing vivid dream! It was truly wonderful, unlike anything ever... so I was jazzed and I continued with the Piracetam at 2400 mg 3x/day for several months. I didnt have such vivid dreams but the effect was that my brain hemispheres started working together. Im an intuitive/thinking person by nature, Myers Briggs ENTP. Intuition is right brain and thinking is left. Thats all fine but at puberty men lose the communication between hemispheres and that is the biggest problem for any NT male. I got it back with Piracetam. Planning went from drawing flowcharts and straining to get things done to just doing them naturally. Meeting and getting along with women went from a strained thing to just naturally telling them what I think and feel. Life got considerably better. I started remembering names of people I went to grammar school with and all sorts of pleasant childhood things. I started writing poetry and some of it is very well received. The downside was that I felt very tired a lot of the time and sometimes it was sort of a sudden onset tiredness I started taking Choline Bitartrate with every dose of Piracetam to the tune of about 1:2 and the tired thingy went away pretty muchly I cannot get enough choline from eating eggs if I take large doses of Piracetam afaik.</p><p>I had some of my female friends try some Piracetam and they reported that it did nothing. That makes sense to me, women have good communication between the brain hemispheres. </p><p>Id say that Piracetam is good for men and nearly essential for Intuitive-Thinking ones</p>"
}
