{
 "title": "Re-occuring Death Trip",
 "author": "Damselindistress",
 "citation": "   Damselindistress. \"Re-occuring Death Trip: experience with Nitrous Oxide & Unknown ('Love Drug') (ID 91086)\". Erowid.org. Aug 10, 2011. erowid.org/exp/91086",
 "substance": "Nitrous Oxide & Unknown ('Love Drug')",
 "bodyweight": "50.8 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)",
   " ",
   "  ",
   " ",
   "Unknown",
   " "
  ]
 ],
 "footer": [
  [
   "2010",
   "91086",
   "Female",
   " ",
   "18",
   "Aug 10, 2011",
   "5015",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Love Drug' could refer to MDMA or MDA, what it is isn't specified in this report.]</p><p>I really need some insight or something! Ive been having this trip which has been disturbing me every time it happens. It started last Christmas and happened again last night in my sleep, it seems like if it happens when I'm partying, it will appear in my dreams when I get home, one or two nights after, in the same severity and scariness. </p><p>Basically, the trip starts when the music goes to an eery drone noise, or even a noise that sounds like a mechanism or engine going into meltdown, or shutting down, that kind of whirring noise which gets slower and slower. That's when I start to panic because something doesn't feel right. And depending on the scenery or room I am in (colours, etc.) the trip will reflect that. So for example, a couple of weeks ago I was in a dominantly red/orange room and so I looked up as the whirring noise scary noise was happening, and the people around me looked like devil demons, kind of ghostly and glassy eyed, all looked at me, I felt this HORRIBLE feeling of being liquidised, I could feel, see and hear death catching up on me, like I had killed myself and I had to watch myself die. I looked down to see my hands sort of dissolving, and this carried up my arms too, like everyone started melting into the ground. The trip releases me just after I accept that I am going to die which leaves me feeling extremely panicked. The trip can also come into my dreams in the same way, just 30 minutes ago it happened but in a different way, the same thing happened, the noise, the melting, the feeling of doom, but it was like the people and I was dissolving in sewage or something, like our bodys were sewage and we were dying. </p><p>I managed to calm myself abit more in that trip, it seems I'm getting kinda used to it but I still get that initial panic feeling which makes me feel so unbelievably horrible. I mean, why is this happened, and how do I combat it? I hate it!!! I know N02 can be a very strong substance, but I dont have to binge on it for this to happened, and not even breathing c02 back into the balloon, which some people say could be the issue here.</p><p>[Reported Dose: 'Not alot']</p>"
}
