{
 "title": "Break-Up on The Akashic Plane",
 "author": "Lytesbre",
 "citation": "   Lytesbre. \"Break-Up on The Akashic Plane: experience with 4-AcO-DMT (ID 91102)\". Erowid.org. Jan 23, 2012. erowid.org/exp/91102",
 "substance": "4-AcO-DMT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 91102",
   "Gender: Male",
   " ",
   "Age at time of experience: 52",
   "Added: Jan 23, 2012",
   "Views: 2629",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Dose - 15 mg ACO-DMT  ('K')</p><p>       20 mg ACO-DMT  ('V')</p><p>850 pm - drank powder dissolved in water</p><p>910 pm - felt a heavy vibration, palms sweating</p><p>We sat on a couch , holding hands, that's when we noticed our palms were </p><p>sweating. Indian raga music playing on stereo.DMT like visions with </p><p>closed and open eyes.</p><p>K--I entered into a golden realm with a bright deity present, who said </p><p>very clearly 'Not with him' which snapped me back to the awareness of </p><p>sitting on the couch. I asked V 'What does that mean?' And V, </p><p>flabbergasted, twisting and turning,said 'What do YOU think it means?'  </p><p>My response was indignant and I wanted to go after the entity that had </p><p>said this to me!</p><p>V-I was deep into the music and felt like I was entering a sacred realm. </p><p>Suddenly I got to a point where I was being told where this realm and </p><p>music is only for those entering with a single heart and pure love. I  </p><p>could go no further till I had expressed my pure heart. I took K by the </p><p>hand and said let's go lie down on the bed. We cuddled and preceded with </p><p>our trip.</p><p>K-Upon cuddling, I entered into a beautiful moving colorful oneness with </p><p>V. I sensed V taking my hand, approaching a golden being, where he had a </p><p>conversation with it, requesting us to enter together into the entryway </p><p>beyond the being.V pulled me into the entryway, where we became as one </p><p>and back into the beauty of the oneness with V again. I was loving this </p><p>so much and I said to V, this is so beautiful, where are you taking me? </p><p>and V responded , 'That's what we're going to talk about..'</p><p>V-I confessed/explained that my heart was not int the same place as K's </p><p>and that I had to be 110 % honest before we continued this journey </p><p>together. K told me to chill out and relax and we continued to embrace.</p><p>K- I went back into a huge golden space that the entity had permitted us </p><p>to enter, it was beautiful but I as I went further into the entryway,  I </p><p>came upon the essence of some kind of accident/ train wreck/distortion, </p><p>preventing me from going any further. Very clearly, I was now told to </p><p>listen and be quiet. I was not permitted to speak..However, I was </p><p>blurting out things I was not suppose to say, and constantly reminded to </p><p>be quiet at least four times.I.I perceived V to my left as a golden </p><p>being on a throne,and to my right was the entryway with the being </p><p>inside, I was dressed all in blue, veiled, with bangles all over my </p><p>dress. I was in a realm of intense blues and golds.I laughed at V, and </p><p>said 'You will not be my God!' V, angered said 'You will laugh when I </p><p>tell you to laugh' I responded with silence.</p><p>V- I remembered saying to K, I like to hear her laugh, it is interesting </p><p>that she heard it a completely different way.</p><p>K- in my anger, I now possessed a staff in my right hand and I went into </p><p>the chamber where the entity was and proceeded to tell it that it was a </p><p>false god and that Jesus  was the real God and that he had created </p><p>everything, including them. I raised my staff and struck the being and </p><p>it vaporized. I did this repeatedly with many entities, I was angry and </p><p>like a warrior princess archetype. I was now thrown back on the bed, </p><p>noticing how I would go in and out in waves. V and I were astonished at </p><p>how beautiful we both looked to each other and commented on it. and we </p><p>cuddled and kissed...even with all the ongoing craziness of it we still </p><p>had a love for each other.</p><p>V-We had some intense conversations on our relationship and due to my </p><p>personality and her religious beliefs that there were some </p><p>irreconcilable differences. K pointed out some very astute observations </p><p>on what my problems dealing with woman were. Boy, did she nail me! These </p><p>were some valuable insights. I realized and said that I was like a wolf </p><p>stalking his own heart .We also discussed our very different spiritual </p><p>beliefs. This took place over a span of  several hours as we would </p><p>alternate intense conversations as the effects of the drug ebbed and </p><p>flowed in waves.</p><p>K- I would drift back to the beauty constantly, but I could only go so </p><p>far until I encountered the vision of a trainwreck. This happened four </p><p>times, I didn't want to face it and on the fourth time I realized that </p><p>the trainwreck was V's relationship with me..and I was now trying to fix </p><p>it.</p><p>At 5:30 am the most intense parts had passed, sleep was difficult,so we </p><p>both took Xanax.We were both shocked at waking up at 5:30 pm on the </p><p>next day !</p><p>V- Basically this was an incredibly potent substance, but like MDMA I </p><p>believe that this has strong empathogenic and therapeutic properties. We </p><p>both joked that we had saved thousands of dollars in therapy bills!</p><p>K- With the right person, the person you love, this could be the best </p><p>experience of oneness one could ever have in this lifetime.</p>"
}
