{
 "title": "Craving, Trouble Breathing",
 "author": "mrseriousbiz",
 "citation": "   mrseriousbiz. \"Craving, Trouble Breathing: experience with Products - Bath Salts, Plant Food, etc. ('White Horse') (ID 91209)\". Erowid.org. Aug 30, 2011. erowid.org/exp/91209",
 "substance": "Products - Bath Salts, Plant Food, etc. ('White Horse')",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 91209",
   "Gender: Male",
   " ",
   "Age at time of experience: 34",
   "Added: Aug 30, 2011",
   "Views: 4535",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  </p><p>Started out with small lines about 8 pm. It had a similar effect to coke but way more haunting. Noticed that my balance was off and I started losing focus. Into fifth hour I started to enjoy the powerful high. At 5 am finished last line and began to crave more. The drug made me extremely paranoid, off balance, drool and the crash was horrible. I had to concentrate hard just to speak. I craved the drug so much the next day, I drove to get more knowing I barely could control my car. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  </p><p>Day two was a better experience but this time my crash ended with trouble breathing, my heart beating out of my chest, and pains I'm my muscles. When I used the bathroom my urine was dark. I began to panic as I felt as if I was slipping away. At this point I had a family friend drive me to the emergency room. This drug landed me a three day hospital stay with kidney and liver damage. I do not recommend bath salts.</p><p>[Reported Dose: '500 mg in 2 day span 2 packs']</p>"
}
