{
 "title": "Potent Stuff but Not All That Great",
 "author": "Inquissitive",
 "citation": "   Inquissitive. \"Potent Stuff but Not All That Great: experience with 2-CE, 4-FA, Methylone & Butylone (bk-MBDB) (ID 91390)\". Erowid.org. Jan 11, 2012. erowid.org/exp/91390",
 "substance": "2-CE, 4-FA, Methylone & Butylone (bk-MBDB)",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "2C-E",
   "(powder / crystals)",
   "  T+ 2:00",
   "200 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   "  T+ 2:00",
   "200 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 2:00",
   "100 mg",
   "oral",
   "bk-MBDB",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 91390",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Jan 11, 2012",
   "Views: 2153",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A bit about myself, I'm 23 years old, healthy, athletic, and a professional, and I've only have had experience with research chemical type items. As far as psychedelics, Ayahuasca in South America. I experiment 5-6 times a year at most. Anyways, on to the report:</p><p>It was a lazy Sunday afternoon at my apartment and I was feeling particulary more bored than usual so I decided to dig through my old stash of RC's and mix something up. I noticed an envelope crumpled in my closet and found 10mg of 2-CE that I forgot I had even ordered. I said 'What the heck' and ingested it orally with water. I waited about 2 hours and felt absolutely nothing and figured I must have bought some fake stuff so I proceeded with ingesting about 200mg of 4-FA, 200mg of methylone, and 100mg of butylone orally. I started feeling very calmed and relaxed as everything began to settle in and I decided to go run some errands and cruise around town (Please dont be dumb and drive like I did)[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]. </p><p>After about 3 hours of buying stuff, fixing my car, and chatting people up, all the RC's I ingested pretty much wore off and I started heading back home. I still felt nothing from the 2-CE and figured I must have bought some fake stuff and didn't think much of it until I started driving on the freeway(Again DUMB), and started seeing fractals in the artwork lining the freeway and hues of green colors in the sky. I concentrated very hard on the road and getting home, which made all the preliminary visions subside until I got home. I felt kind of like crap as the other RC's left me feeling both tired yet full of anxiety(which I blame on the butylone, a shitty substance that I do not recommend to anyone).</p><p>I felt very tired/exhausted and a bit nauseous but not enough to throw up and decided to lay down and take a nap. Every time I closed my eyes, I would feel myself start drifting into a deep sleep but be abruptly awakened by visions that were getting more and more powerful. I started seeing fractals, spiraling eyeballs, Aztec architecture, strippers, monstrosities, and all kinds of random images that just kind of popped in and out of my vision. Every time I opened my eyes and drifted off to sleep, the visions would only get darker and darker, where I started seeing skulls, flames, blood, and weird demon looking pac-man things with rows and rows of saw-like shark-teeth grinding side to side all glaring at me with pure evil. </p><p>Annoyed at the fact that I couldn't fall asleep without falling into a nightmare hellish world, I went and took a shower. At this point, I'm having open eye visuals, with Mayan/Aztec hieroglyphics popping up in everything wooden in my house, white walls breathing, and water coming from my shower that felt as if it were piercing through me but in a strangely refreshing/awesome feeling way. I felt more cleansed than I have ever felt in a long time after that awesome shower, but the dark visuals persisted every time I closed my eyes, let alone blinked. I decided to watch a movie(Approx 2.5 hrs) to wait out the 2-CE and by the end of it, the visuals had all but stopped.</p><p>Perhaps I didn't ingest enough of 2-CE or maybe the other RC's might have interfered(doubtful) but I was left was a very poor impression of 2-CE. The psychedelic aspect of it felt very 'mechanical'. Yes there were powerful visuals, vivid colors/fractals, and a sense of exploration, but it was all devoid of emotion or any deep insights, basically like watching an old grainy movie that skips all the time with no sound/color/ or text to give you a clue as to wtf is going on. Definitely not my weapon of choice for personal growth and insight, I'm sticking to Ayahuasca, which is leagues ahead of this stuff.</p>"
}
