{
 "title": "New Lands",
 "author": "Alexander Satya",
 "citation": "   Alexander Satya. \"New Lands: experience with Ayahuasca (B. caapi & P. viridis) (ID 9140)\". Erowid.org. Sep 13, 2001. erowid.org/exp/9140",
 "substance": "Ayahuasca (B. caapi & P. viridis)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "100 ml",
   "oral",
   "Ayahuasca",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9140",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Sep 13, 2001",
   "Views: 29619",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI found a recipe online that was quoted to be the amount that the Peruvians use for a single dose of Ayahuasca; it said about a 12 inch piece of vine of Banisteriopsis caapi and 50 fresh leaves of Psychotria viridis.  I used half of this (and i recommend that you should too, more on that later)...I whittled down a 6 inch piece of B. caapi with a utility knife and used about 30 dry leaves.</p><p>I broke up the whittled pieces of B. caapi with my hands until they were fairly fine fibers.  I boiled everything at one time in a glass pot (Terence McKenna says that an aluminum of a pot can negatively effect the brew)...I boiled everything (a rolling boil) for 1 hour and then poured off the liquid into another bowl; then added new distilled water and boiled it again. I did this for a total of 4 times until the liquid that I was pouring off was more of a clear yellow.  I threw out the plant material, added up the liquids and very slowly boiled down the liquid until I had about 200ml of liquid that had the color of nice, deep, chocolate milk.  I drank 100ml.</p><p>I've had two other experiences on Ayahuasca before this. They were very nice and 'euphoric', with very organic, strange, geometric visuals.  But this third time I knew I did a better job preparing a stronger brew.  But I did a much better job than I could ever imagine.</p><p>But first, my recommendation to you; go very slow, i mean, certainly don't drink a lot your first time.  Slowly, over time, build up the amounts you drink.  Test your brew's strength before you drink a big dose.  I think you know what I mean; but let me tell you my story so you will become cautious and respectful of this drink, because I wouldn't want anyone to go through what I had to:</p><p>I did not eat 4 hours before drinking.  After an hour of drinking this bitter stuff, in an instant, without warning, I was very panicked and very afraid.  Terrified.  My world was replaced with something else that was not 'here'.  Everything was TOO vibrant, sounds did not sound 'right'.  It was very very scary, I paced around, freaking out, trying to not be 'there', but I realized it was useless to try, this scared me even more.  I ended up sitting up on my bed, back against some pillows, drenched in sweat that I could not control.  I was trying to relax.  I was in this 'world' for only a few minutes, but it seemed like forever.  This place was the most frightening thing I have ever seen.  This 'burst' or 'glimpse' faded into another 'world'...into a 'lower world'...distinctly different from the first but not as 'fast'...but almost as equally terrifying.</p><p>Let me pause here for a moment. If you do this: I noticed that people near-by (i mean, the apartments near me) experience something too, even though they don't drink the brew.  I did not like this at ALL!...it made it much harder to deal with.  I would have been much better off being somewhere that was miles and miles away from anyone, especially since my experience was so powerful for me.</p><p>Ok, this 'lower realm' scared me very much.  I was teased by something.  Basically, I wanted a big experiance and the answer I got was: 'ok, here you go! we will REALLY give it to you. we will make you very frightened, and you will be humbled'.  Terence Mckenna put it a good way: 'Their [the 'fairies'] idea of 'fun' might not be your idea of 'fun'.'  I was kind of laughed at...it was not fun for me at the time.  At this point I just wanted it to end, and I was trying to wait it out...but it took a very long time (almost 2 hours).  I was trying to fight it off and calm it down, but it was persistent on me.  I was shown many things, and 'taught'.  It was a very personal experience.  After it was done I thought: Oh my GOD! I got through it!  The day after I was still very shaken up.  After a few more days of thinking about it, I was very happy that I did it and got through it; even though it was deathly terrifying at the time.  </p><p>It's not that this place IS a 'scary place', but I think we 'perceive' it as being a very scary place indeed.  I had many experiences during this time that go far beond 'hallucinations', and where far more real.  I believe I caught a very small glimpse of what's 'really going on'...and this 'small glimpse' was quite a lot for my human mind to see.</p><p>So, what have I seen to be what is 'really going on'?...I won't say. :) Most everyone would never believe me... nor would want to, because it's just too weird! :)  But what's great is that our human minds are capable of seeing this 'truth'!  That's the fun part.</p><p>Be safe and respectful of Ayahuasca; I would recommend building up your 'levels' slowly, that can make it much more confortable. You could drink a bunch, but it could really freak you out more than I could ever explain -- you would get through it!, but your experience can be very terrifying.  Good luck.  :)</p><p>After this experience I have learned enough to not have a desire to visit this place for awhile.</p><p>At a lower dose you feel wonderfully euphoric and you can slowly enter...'something'!...for me it was a extremely real parallel dimension that is always with us, but we don't usually see it.  And this place is very welcome of visitors.  It's a mischievous place, but they welcome you.</p><p>Good luck and I wish you safe and comfortable choices.  :)</p>"
}
