{
 "title": "Brownies",
 "author": "Cartman",
 "citation": "   Cartman. \"Brownies: experience with JWH-018  (ID 91424)\". Erowid.org. Aug 10, 2011. erowid.org/exp/91424",
 "substance": "JWH-018 ",
 "bodyweight": "200 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "JWH-018",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2010",
   "91424",
   "Male",
   " ",
   "35",
   "Aug 10, 2011",
   "5543",
   " "
  ]
 ],
 "report": "<p>JWH-018 is just so hot right now.  I did not enjoy smoking it, short-lived and intense effects followed by a much larger brain fog. [...] Being the nerd I am, I decided I only wanted to mess with pure JWH so I made brownies and recorded the following experiences in 110 lb female and 200 lb male:  </p><p>12.5 - 15mg in the female subject induced severe paranoia and vomiting.  Subject had great difficulty speaking and responding but had normal vitals with slightly elevated heart rate.  Subject had trouble falling asleep despite being exhausted after vomiting had subsided.  Vomiting lasted nearly 40 minutes with a 2nd relapse of dry heaving about 30 minutes later. Subject described being so detached from reality that responding to yes and no questions became difficult.  Subject also reported time perception was greatly distorted.  NOTE:  Subject had a similar experience with hash brownies but never with smoked THC.  </p><p>10 - 20 mg in male subject: both doses produces similar symptoms with the larger dosage simply being more intense.  Vision greatly blurred, reading became hard.  Driving would be dangerous, use extreme caution.  Paranoia was present but minor.  Noticeable increase in sex drive as well as slightly elevated heart rate.  Generous increase in appetite.  Mild euphoria.  Peak symptoms within 3.5 - 4 hours with symptoms subsiding within 7 hours.  Less brain fog than when smoked, but fog lasts longer.  Overall enjoyable body high with mild (10mg) to moderate (20mg) cognitive effects.  </p><p>JWH-018 can be an enjoyable substance to consume orally, but it can also be terrifying.  Use extreme caution, start at low mg dosages and wait a few hours before consuming more.</p>"
}
