{
 "title": "Unusual Activity",
 "author": "A Man",
 "citation": "   A Man. \"Unusual Activity: experience with Modafinil (Modalert) (ID 91435)\". Erowid.org. Jun 11, 2011. erowid.org/exp/91435",
 "substance": "Modafinil (Modalert)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   " ",
   "Modafinil"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 91435",
   "Male",
   " ",
   "Age at time of experience: 26",
   "Added: Jun 11, 2011",
   "Views: 8035",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>When I woke up, I noticed the Modafinil pills had arrived. I took a half, since was going to be my first time.</p><p>My plan was to go to a symposium right after. When I arrived I was still myself, a little bit of anxiety took over because I just took something that I have never taken before. While sitting on the chair and listening to many different stories, suddenly I feel something coming up. I was getting really heavy, and my heart rate was going up. Kind of anxiety attack. Every time I started breathing out, I felt a rush. This continued for about 15-30 minutes. At one point I didn't want to stay at the symposium at all, I just left while they were still going on to go for a walk outside. Then I decided to go back again. It was so hard to sit still and focus on one point, I was looking around me all the time. Then at the break I talked to a few people, I noticed I got more compassionate with people, and I also noticed that when a conversation was leading nowhere I changed the subject really fast or just walked away politely. During the come-up of the drug, my body started feeling really tired. </p><p>I didn't stay at the symposium till the end. I left to go to a friend of mine, then I went home. But before that, I went to the supermarket. And I didn't exactly know what I wanted, I was thinking really logical. And I decided to not buy some things because it will just be too much etcetera. When I was walking around in the supermarket I was getting a little bit paranoia, felt like people were watching me all the time. And also when I was outside this was the same sometimes.</p><p>It was a weird experience. I was nicer to people, I managed to do things faster instead of leaving it to be. I was feeling a higher temperature and heart rate. Some anxiety and paranoia were there too.</p>"
}
