{
 "title": "Easily Overdosed",
 "author": "Diddy",
 "citation": "   Diddy. \"Easily Overdosed: experience with JWH-250 (ID 91443)\". Erowid.org. Dec 27, 2012. erowid.org/exp/91443",
 "substance": "JWH-250",
 "bodyweight": "275 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "JWH-250",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 91443",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Dec 27, 2012",
   "Views: 1047",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So a few buddies and I decided to quit weed b/c of obvious reasons: looking for jobs at the end of senior year in college. My boy ordered a gram or two from an online site. We got it a few day later. It was the real deal. Crystal-like powder, becomes oily once you put heat on it. We smoked it out of a bowl. It was great for about a week then we ran out and ordered more. </p><p>Funny thing is the standard dose is about 8-10 mg. Even that gets you about as high as a blunt to the face for about half an hour. Other funny thing is that after about half an hour it's all over. So you gotta smoke more. So that's the first word of warning...this stuff is highly addictive.</p><p>So I ordered more and had a shit ton for a while. Lost the bag of it in my room for about a week. When I found it I happened to be very very drunk, which is usually around more than 15 drinks for me on average. I got back home from the bar one night during senior week and packed more than 15 mg for some reason...maybe the whole bag which was around 30-40mgs.</p><p>All I remember is falling down an endless black and yellow tunnel after a few minutes. God (or some higher being) was there with me, shining a flashlight in my face and asking me why I smoked so much and several other serious questions about my life. I remember trying to explain this whole story to him, but he didn't buy it and pretty much told me that I was going to die. Then everything went black.</p><p>I remember feeling the worst I've ever felt in my life. It was pretty much the worst bad trip I've ever had and a huge mind fuck that still bothers me to this day, about a month after. I'm sure I'll get over it at some point. Also, I've been smoking weed since eighth grade (no pun intended), so I've been uncomfortably high before, but this was totally different.</p><p>After ten or so minutes of hallucination, I was the happiest I've ever felt, because I was glad to still be alive. My friends told me that I acted very surprised but ecstatic to see them after freaking out for about ten minutes. Apparently, while I was falling down the tunnel I tossed a bunch of shit around in the room and had to be restrained by my friend who's bigger than I am.</p><p>Anyways, I definitely remember getting back to my senses and appreciating life for the first time in the past 4 years. I was still very dazed after and fell on my face a few times trying to get to my room downstairs. </p><p>When I woke up in the morning and reflected and couldn't believe it. Luckily my friends didn't give me too much shit then or now about the event.</p><p>The moral of the story is just smoke weed and don't smoke crap synthetics. B/C you can smoke as much weed as you want (of weed) and at the end of the day all you have to do is avoid the cops rather than your subconscious.</p>"
}
