{
 "title": "Madman",
 "author": "XoOn",
 "citation": "   XoOn. \"Madman: experience with Salvia divinorum (ID 9153)\". Erowid.org. Dec 5, 2003. erowid.org/exp/9153",
 "substance": "Salvia divinorum",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1.5 bowls",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9153",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Dec 5, 2003",
   "Views: 32971",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI was at a friends house, lot of people there. I picked up the salvia 2 days before and tried it with minimal effects. This time I asked my one buddy to accompany me in the car while I did it.  I get into my car and pack the bowl and start hitting it. After I was done, I went completely numb, I felt as though my body and brain were completely dead. I sat in this expierence for a couple minutes when the song that was playing in the car said 'step inside'.\r\nWell that must have fired something off in my brain because seconds later I was desperately trying to pack the bowl with more salvia, I thought that if I smoked more I would be able to 'step inside'. First hit off the bowl and I was gone. It was like the first bowl just kept me on some plateau and the next hit blew me into space. I definitely got to step inside, but that wasn't a good thing. I was transported to some crazy place... and all I can imagine was a lady that was showing me something. I can't even put words to it b/c it was just like raw emotion. At this point I got extremely terrified. More scared then i've ever been in my life. I frantically wanted out of the car and to lay on the grass, i thought that was my only escape. Once I got out of the car, I completely changed.\r\nInto a MADMAN.\r\nI started laughing  hysterically, not a fun laugh, but a very very evil laugh. I was kneeling in between my car and the car door. I started to swear and say horrible things. A pizza delivering boy was coming up the drive way and I kept talking about killing him. And killing people at the party. It was disgusting to say the least. After a while I went back into the car. I couldn't even control my head, it kept going back and forth and hitting the side of the car. Then I had to go to the grass again. I hit the grass and started to swear and spit. After a while it wore off and I was back to normal. To even try to explain a salvia trip is nearly impossible. I don't think there are words to describe what you feel. Anyway, that is the last time I'm going to do salvia in a loong time.\n\n\n"
}
