{
 "title": "Not Good for Anxiety",
 "author": "Nimrod",
 "citation": "   Nimrod. \"Not Good for Anxiety: experience with Modafinil (ID 91639)\". Erowid.org. Jun 30, 2011. erowid.org/exp/91639",
 "substance": "Modafinil",
 "bodyweight": "61.6 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Tea",
   " ",
   "100 mg",
   "oral",
   "Modafinil"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 91639",
   "Gender: Male",
   " ",
   "Age at time of experience: 39",
   "Added: Jun 30, 2011",
   "Views: 7143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is a short experience report on Modafinil taken from the prospective of someone who suffers with chronic anxiety. \r\nI started suffering with tiredness and lethargy and was looking for something to aid mental focus. I knew Modafinil was a stimulant type drug but I wasn't quite prepared for just how stimulating.\r\nI took 100mg in the morning after a light breakfast. The only other substance I took was caffeine from tea (very strong tea I might add).\r\nwithin about 30-40 minutes I felt the effects of it which built up gradually and lasted over 10 hours. I felt very agitated and jittery, just as though I had drunk too much caffeine (I can normally only tolerate one cup of tea). I was very on edge all morning, the slightest noise would make me jump.\r\nI was able to do work and found I could focus better, but the physical effects and anxiety was quite unpleasant for me. By physical effects, I mean body tension and extra stress. I felt a tightness in my chest, pains in my neck and shoulders. It was almost like border-line anxiety attack. My mood was also negatively affected. I felt slightly bad tempered and easily angered by things. \r\nIn short, although the drug did help my concentration and productivity, I wouldn't recommend it all for anyone suffers with anxiety or stress. It's just not worth it and may make the symptoms worse.\n\n\n"
}
