{
 "title": "Best experience ever...",
 "author": "White Fire",
 "citation": "   White Fire. \"Best experience ever...: experience with DXM (ID 9169)\". Erowid.org. Sep 9, 2001. erowid.org/exp/9169",
 "substance": "DXM",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9169",
   "Male",
   " ",
   "Not Given",
   "Sep 9, 2001",
   "Views: 100294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It has been 22 hours since I last dosed with DXM. I can safely say that it was the most pleasant experience of my life. I had the extreme pleasure of going Robo-tripping with a close friend last night and discussing deep emotional, metaphysical, and philosophical issues. </p><p>I could not possibly have hoped to spend my night better.  I spent a night mellowed but not sedated, stimulated but not overwhelmed.  It was great.  That said I will commence with a deeper explanation of the experience.  </p><p>For last few weeks I have been feeling a bit depressed about how meaningless my life had become, the complete lack of direction was getting to me.  I knew I was going to college, but that just wasn't enough for me.  I was going to spend another bored night staring blankly into the computer monitor when one of my best friends came over looking for my brother.  My brother would not have been back for many hours so my friend and I sat around discussing the nature of the astral planes.  I finally asked him if he wanted to dose with 4 ounces of cough syrup.  Surprisingly he agreed.  You see my friend has a bit of a problem with his stomach.  It dislikes cough syrup.  The only time he has ever managed to keep down cough syrup has been under the influence of large amounts of pot. </p><p>Fortunately he had his glass bowl that was encrusted with weeks worth of resin, and he had not eaten for several hours, as had I.  I abstained from the pot but he smoked up a little and took an aqueous suspension of dried ginger to control his upset stomach.  I am fine with Syrup so I just downed it.  We both dosed at around 11:50pm.  </p><p>We then sat around in the TV room waiting for the effects to begin.  At about 12:20am he and I went out to the porch for a smoke.  I began to feel the effect shortly after going outside but did not peak until at least half an hour later while we were walking around in the yard.  As we sat out on the porch I began to feel a little dizzy and got a very mild headache, the first symptoms I feel of DXM. I then began to feel my scalp itch, which is a sure sign that the effects are kicking in. My family seems to react strangely to DXM. My scalp itches and gets a little inflamed, but the symptoms go away after a while. My friend is fortunate not to have such side effects.</p><p>In a few minutes I could feel that my mind seemed active. I felt like moving. I could sense the motion of my body differently. You could almost describe the feeling as though you are floating, or that you feel light.  The dizziness that occurs as a side effect is more than some people would like, but I like intense experiences. My friend and I walked around in what amounted to a controlled drunkenness for a few hours discussing matters of importance and recalling previous great drug experiences. We were both in agreement that we felt great.</p><p>Of note is the fact that the DXM did nothing to confuse our minds, if anything the DXM seemed to make our conversation more fluid and understandable. My friends having smoked pot reduced his attention span and short-term memory, but not horribly. We were both having full-blown body trips, but our minds were clear. </p><p>We walked a lot in the two hours that we were outside. We walked around during a beautiful September night under the near full moon enjoying a nice gentle breeze that was rolling through. We walked through the fields surrounding my house. As I walked I felt the most unbelievably heart warming happiness of knowing that I was having the BEST TIME OF MY LIFE.  I have done Acid several times. I have tried opium. I have smoked pot. I have smoked a LOT of pot, but nothing has ever compared to last night. More so than the drugs was the company.  The company of a good friend mad the experience wonderful. Our primitive language can not express haw good it felt.</p><p>At approximately 2:30am we saw and heard my brothers car approaching.  We convinced him to stay outside and talk to us.  We lay there sprawled out on the porch enjoying the company, the weather and the experience. Soon though my brother needed to go to sleep. My friend and I went out into his car and sat there for 2 hours speaking about everything that two men traditionally would never speak of. We spoke without social inhibition. It was enlightening. We could sit there in his beater completely comfortable and content. </p><p>By this time the powerful disorientation of the DXM had worn off and the acid like effects were very prominent. I could close my eyes and see limited Closed Eye Visuals. We both had a minor body buzz going, and I could feel the fluidity of thought that acid brings. We were definitely coming down, but it was a nice gradual let down. It took over 2 hours for us to want to go to sleep. We were relaxed, but did not have the urgent desire for sleep that acid seems to bring during the come down.</p><p>At around 5:00 we went inside and went to sleep. I ended up encountering my father before I went to sleep, but could act completely normal. He found it strange that I would be up so early, but eccentricities are not investigated in my family. I slept soundly for the next six and a half hours. When I awoke and went to go take a shower I looked at myself in the mirror. Wow. I could see that my eyes were dilated to at least 75%. It was interesting that the dilation of my pupils would occur only after the main effects had worn off. Soon they constricted some, but remained dilated some until mid afternoon. I was clear minded, could act normal, and hold conversation coherently. Ahhh... the great blessing of DXM, almost no after effects.</p><p>Definitely worth it. Though DXM must be used with care as it can cause brain damage, and can easily cause bad trips. It is more dangerous than Acid in every way. One must thoroughly research the effects and the additives often added to cough syrup. Be careful.  May you find enlightenment and peace in your life.</p><p>(Subject was taking a variety of herbal supplements that may or may not have effected the experience. Subject had experiance with DXM in past. Subject had experiance with similar drugs in the past.)</p>"
}
