{
 "title": "Beauty",
 "author": "Charlie",
 "citation": "   Charlie. \"Beauty: experience with Unknown ('Ectasy thizz') (ID 91706)\". Erowid.org. Jun 30, 2011. erowid.org/exp/91706",
 "substance": "Unknown ('Ectasy thizz')",
 "bodyweight": "146 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Unknown",
   " ",
   "1 tablet",
   "oral",
   "Unknown"
  ]
 ],
 "footer": [
  [
   "2011",
   "91706",
   "Male",
   " ",
   "16",
   "Jun 30, 2011",
   "3790",
   " "
  ]
 ],
 "report": "<p>First off, I will start by saying I have no idea what I really took. I went to the club with my sister and we took a molly earlier that night. When we decided we wanted to go home we found a guy at the club who was selling yellow cranes. So my sister bought three and took one as we started heading home. The drive from the club to our house takes about 50 minutes.</p><p>Everything was fine until we were about 5 minutes away from our house. My sister said the pill was starting to give her weird visuals. I dismissed this because I knew sometimes pills did that. </p><p>We got into the house and went into my room.</p><p>1:00</p><p>My sister said her visuals kept getting more and more intense and she felt like she was starting to trip. She kept telling me to take one of the other pills because she wanted me to experience what she was feeling too.</p><p>She takes one of the other pills thinking it will be just another normal roll.</p><p>1:50</p><p>I get pressured into taking the last of the three with her to feel it too.</p><p>2:10</p><p>I begin feeling the normal sensations of a normal roll (incresed heart rate, increased sexual desire, euphoria)</p><p>3:00</p><p>Suddenly the roll switches from a euphoric body high to a low mental high.</p><p>3:20</p><p>My sister looked over at me and told me that she was feeling really weird and that her body felt like it was vibrating. Still not thinking anything of it I just told her to enjoy the roll.</p><p>After a little I turned on some Daft Punk so she'd have something to listen too. I grabed my ipod and put on some Crystal Castles. My friend had rolled a few weeks before and suggested that I listen to them next time I rolled because they sounded a lot more awesome under the influence of X.</p><p>So I put on Crystal Castles and began the most beautifully horrific trip of my life.</p><p>3:45</p><p>I want to say this... My sister has taken many drugs (2C-I, LSD, Mushrooms, 60x Salvia) and she told me she was seeing things and feeling things like she never had before.</p><p>The second Crystal Castles come on it entered my ears and grew with such depth. I have never even imagined understanding music in this way. I looked at my sister and she was just looking up at the ceiling smiling and saying that the music sounded beautiful.</p><p>With each half and hour that went by the drug became more and more intense.</p><p>My sister left my room in an attempt to sleep.</p><p>4:20</p><p>At this point I felt like it was never going to end because there was no peak in my experience. It just kept getting more and more intense. I set my ipod to shuffle hoping that I would just relax and let the music settle me. Another Crystal Castles song came on and went through ever part of me. I knew at this point that what I had stumbled upon was incredible. I hit next a few times and that's when life became beautiful. The Good Times Are Killing Me by Modest Mouse began playing and I just felt complete bliss. I don't know how to explain what I was feeling. The song starts off with people talking and just hearing that sounded so soothing. It seemed like each pitch, tone, and key made sense. Each sound, even when slightly tweaked has its own feeling.</p><p>A few seconds into the song a guitar comes in. Right when that happened I felt more incredible than I ever have. The sound went inside my ears and felt like it was playing inside every part of me. Then the bass comes in. Right when that happened my mind, body, and spirit felt perfect. I looked around me and everything lost its shape. Nothing had a solid outline. Everything was just somewhat of a blur. But the music made everything begin to glow. There's one instrument that comes in and to me it felt like a wooden spindle made of rainbow that began weaving the threads of my brain together. </p><p>My ipod was still on shuffle so I hit next and I Remember by Deadmau5 came on. I couldn't listen to the song too long because of how it made me feel and what it did to time. Because of all the sounds in the song and speed in which it plays, it made time seem to go backwards. The universe moved with the music. I didn't want to stop time so I took off my headphones.</p><p>4:50</p><p>The light in my room was on and I wanted to see what it would be like without the light so I turned it off. I began feeling like I would be stuck like this and I would become insane. Then I got scared that my parents would come into my room. That's when things started getting bad.</p><p>5:20</p><p>I looked over to my closet where I have few stuffed animals. I looked at them and they all looked at me. They knew I was there, they knew I was scared. They smiled at me and I had to look away because I felt like they were going to kill me. I looked at my fan to turn it up more because I felt hot and my fan knew I was there. I got really hot at this point. My heart had been racing and pounding for the past few hours. I noticed it at that point and got really afraid that I was going to die. I accepted death though. Why? Because I understood music. Everything around me was moving and shifting but one thing that had structure and made sense was music. Whatever I took made me understand music so I felt like it was ok to die because I understood the only thing that mattered.</p><p>I ended up throwing up a few hours later but didn't stop feeling the effects until about 6:00 PM</p><p>I have no idea what I took but it was beautiful.</p>"
}
