{
 "title": "I Wanted to Trip Hard so I Did",
 "author": "Fireup",
 "citation": "   Fireup. \"I Wanted to Trip Hard so I Did: experience with 4-AcO-DMT (ID 91726)\". Erowid.org. Jan 11, 2012. erowid.org/exp/91726",
 "substance": "4-AcO-DMT",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "91726",
   "Male",
   " ",
   "18",
   "Jan 11, 2012",
   "Views: 15876",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had been messing around with psychedelics for about 2 years prior to this experience, and i was very strongly craving that deep spiritual experience you read about everywhere. So much, that i was willing to take ridiculous amounts of a substance just to get there.</p><p>I had some experience with 2c's, lsd, and dmt before, but nothing mind blowing to say the least. I had tried 4-Aco-DMT once before (10mg) and had a very relaxing controlled experience, but i was still missing that cosmic awakening i kept reading about.</p><p>So i loaded up ~50mg of 4-Aco-DMT on a scale, dissolved it in some water, and swallowed it. So far so good. A little nervous, but i was sure i could handle it.</p><p>I was surprised to feel it kicking in within 5 minutes of taking it. Last time it took at least 45. I started to get a bit worried so i went online only to have it remind me that 50mg's was considered an 'extremely large dose'. That got the anxiety going.</p><p>Within 10 minutes I'm sitting there with a racing heart, and I'm noticing black spots appearing allover my vision. Noticeable open eye visuals like i had never seen before. I threw on my jacket and was about to spend my next few hours outside like i had planned. Unfortunately, as soon as i stood up i realized this was impossible. I was way deeper than i thought i would be, and it's only been a few minutes so far. This was supposed to last for a full 6-7 hours.</p><p>I realized quickly i was in trouble and that there was absolutely nothing i could do to stop it. It was going to happen, i couldn't get it out of my head and that was that. So i lay down on my bed, turned off the lights and prepared for the madness that was about to engulf me.</p><p>The next hour or two were composed mostly of me trying to hold on to my sanity and remain aware of where and what i was, as i felt these two simple constants already being torn away from me. All of my thoughts were modified, distorted, pulled, stretched, and illustrated to me in immense hyper-dimensional visuals too complex to describe.</p><p>I was extremely afraid, mostly because i didn't know how much deeper i would be pulled in, and because i was painfully aware that there was no 'eject' button i could pull to save myself when things were getting too dark. It was at this point that i realized there was no way to fight it, and i had to surrender myself completely. So i stopped all resistance, cleared my mind, and just lay there hoping i would somehow just pass out and wake up in the morning as sober as ever.</p><p>Somewhere during this time that i was laying there, the experience peaked. Reality melted away from me completely. Hands, feet, face, body, my bed and blankets were all but a distant memory. I was just a ball of energy. Floating out there somewhere drowned out in waves of energy.</p><p>At a point i realized that i was dead. My body was gone, I was gone. There was just the energy that used to be me. For a while i was afraid of my death, i wanted to go back, i wanted to live. Then i realized that there was no way to go back after seeing what i saw and feeling what i felt. I couldn't fit into the world anymore, i had to be pushed out. With these thoughts i accepted my death. Everything felt calm and silent. My mind stopped racing, and all the black and white energy around me swirled together to make an even shade of grey. It was incredibly peaceful.</p><p>It's very hard to write out the experience after this time. There is a fundamental difference between knowing and understanding, and although i could attempt to make others know what i felt, it is impossible to make anyone understand.</p><p>Sometime later i realized that i was slowly coming down. It was an incredible moment of relief, and euphoria filled every inch of me. I was not out of the woods yet. At times i would forget everything i knew and become blissful and ignorant. Then i would slowly become more aware of where and what I was, and i would get tired of the state I was in, and then i would slowly slip back into nothingness and become ignorant again. It was a process of rebirth that cycled over and over again far more times than i can remember.</p><p>Slowly i found myself laying in my bed, squirming around and laughing. For the first time in hours i was able to open my eyes and saw my ceiling which was still squirming and morphing above me. I felt my hand and raised it. It felt like it was at least a few hundred miles long. I couldn't count how many fingers i had but just the face that i was able to see them filled me with joy. I laughed and laughed, and after about an hour i was sober enough to stand up and take a shower.</p><p>By far one of the most incredible and horrifying experiences of my life, much more than I ever expected or desired.</p>"
}
