{
 "title": "Heart Failure Leading to Death",
 "author": "Draco",
 "citation": "   Draco. \"Heart Failure Leading to Death: experience with MDVP (ID 91728)\". Erowid.org. Jul 7, 2011. erowid.org/exp/91728",
 "substance": "MDVP",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "MDPV"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 91728",
   "Gender: Male",
   " ",
   "Age at time of experience: 25",
   "Added: Jul 7, 2011",
   "Views: 20426",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: Unconfirmed Death Report. This report of a death associated with MDPV is in the process of being verified. Erowid is choosing to publish this report to invite public comment and to allow anyone who knows about this event to submit verifiable details.</p><p>Neither this report nor any report of a death should be considered reliable without details that can be verified through hospitals, police reports, family members, or news reports. If you have information about this or other deaths directly resulting from the use of any psychoactive substance we cover, please contact sage at erowid.org.] </p><p>I want to publish this because I think it is important for others be more aware through education in making the right decision. Especially when taking unknown substances. Even known ones can pose problems depending on what a person is doing. This is coming from someone who has tried a wide variety of substances both legal and illegal, including what is coined Research Chemicals.</p><p>This tale comes through a very close friend of mine. Her daughter was in love with a young man who died a few weeks ago. His parents did not hear from him for about  3 days and decided to go over to his apartment. When they entered the room they saw him sitting in a chair as if he was resting but knew he was dead from the color of his skin. </p><p>It was later found that the cause of death was heart failure and the probable cause was MDVP in which high levels where found in his toxicology report. It was the only abnormal substance in his system.</p><p>After reading other reports on high dosages of MDVP and difficult experiences it makes sense as to why this death occurred. </p><p>I ask a question to all of you reading this. Does the risk outweigh the gain? There is always a high amount of risk when trying something you do not know or understand.  You can certainly gain more insight  on life if you have one no matter what you are taking.</p>"
}
