{
 "title": "It's a Wonderful Night",
 "author": "zophen",
 "citation": "   zophen. \"It's a Wonderful Night: experience with 2C-EF (ID 91746)\". Erowid.org. Dec 31, 2013. erowid.org/exp/91746",
 "substance": "2C-EF",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "2C-EF ",
   "(powder / crystals)",
   "  T+ 0:30",
   "5 mg",
   "oral",
   "2C-EF ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 91746",
   "Male",
   " ",
   "Age at time of experience: 48",
   "Dec 31, 2013",
   "Views: 997",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A footnote in Pihkal reckons that 2C  EF would be a winner if anyone ever made it & the dosage would likely be between 12 and 24 mgs. I was told the dosage ought to be between 6 and 12 mgs which is probably about right</p><p>T +O.OO 10mgs dosed in juice for me and my friend whom well call Kevin. Setting is my house during a weekday afternoon with my kids & dogs roaming about asking questions & barking respectively.</p><p>Theres definite activity at 20 minutes, at 30 minutes another 5mgs is consumed by me. I feel a little light headed & a good humour has come over me. Over the next hour the effects continue to increase with visual patterning on the walls and inside of the eyelids. The conversation as I recall it is mainly centred around the music were listening to & how good it sounds. This stuff seems to enhance nearly every sense, music sounds incredibly good, the grapefruit I ate was a thing of wonder as my teeth were sinking slowly through the juicy flesh I felt like it was as good as the first time I ever ate a citrus fruit. There is a body high which seemed to me to come in two frequencies, one is a continuous luxurious feeling the other occurs in waves and is more intensely pleasurable. Sex or maybe making love would be a more suitable way of putting it would most likely be a very delicious experience. I am however in a small room with Kevin & a couple of terrier dogs so nothing inspires me to actually do so. </p><p>Kevin at one point is moved by the spirit of dance ( something Im familiar with when on DPT etc) and gyrates stylishly around my living room, he may well make it as a pro if he practices & maintains the enthusiasm.</p><p>We spend a good deal of time saying things like wow I had no idea it would be this good & I feel absolutely amazing, so wheres the downside. The answer seems to be that there isnt a downside that either of us could discern.</p><p>On a personal level I found I was a little short tempered, then again Id gone into the experience with responsibility for carrying out peacekeeping duties as & when required, that requirement being when my teenage children open hostilities & cry out dad he did this she did that etc. I wasnt inclined to discuss matters reasonably with them & my instant response was short & to the point. Kevin has been doing shots of methoxetamine during the day & when he takes one at the height of the experience the obvious effects last less than a minute! The fact that I could consume 15mgs of 2C  EF & remain in a laid back fairly rational mind frame speaks volumes for the malleability of this drug.</p><p>At a couple of points around the three hour mark I felt myself close to slipping over the event horizon I didnt wish this to happen as I still had my parental responsibilities to carry out, ten seconds of concentration brought me right back to the consensus reality. The closed eye visuals at this point were intricate & beautiful & with my eyes open it was difficult to concentrate as so much was going on. Mainly OEV of warping, breathing patterning, the odd hole was opening up in the carpet & brilliant lights occasionally appeared from nowhere. Impressive as all this was the best part about the drug is how it made me feel both mentally & physically  Fanfuckingtastic would seem to be the best description I can think of.</p><p>From about three & a half hours until around five & a half hours I felt on a plateau with the drug & after that the effects dropped off quite quickly, although they hadnt dissipated completely until around the seven & a half hour mark. Ive waited several days to write this report to see if any after effects were noted & I can say Ive noted none at all.</p><p>For such a strong experience the drug produced no noticeable physical side effects. At no point was my pulse elevated (that I noticed & I was taking notice) there was no increase in temperature, no sweating or shivering no feeling of artificially induced stimulation or artificially induced euphoria, unlike say MDMA, the whole good mood thing was just that & it felt as near natural as it possibly could.</p><p>In the world of illegal highs this one is a winner, rarely have I enjoyed a drug as much as this one. There is so much about it that makes it a winner.</p>"
}
