{
 "title": "Seemingly Real Paranoid Hallucination  Hell",
 "author": "Trippy",
 "citation": "   Trippy. \"Seemingly Real Paranoid Hallucination  Hell: experience with MDPV (ID 91741)\". Erowid.org. Jun 30, 2011. erowid.org/exp/91741",
 "substance": "MDPV",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "MDPV",
   "(powder / crystals)",
   " ",
   "  ",
   " ",
   "Pharms - Alprazolam",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 91741",
   "Gender: Male",
   " ",
   "Age at time of experience: 34",
   "Added: Jun 30, 2011",
   "Views: 16036",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My g/f and I went through 1.5gms of this pure hell powder over a period of 4 days. I first read about this chemical in the news and thought wow just like blow huh? I read further online and found a local shop that carried it and picked up a gram. </p><p>We both started with a 5mg line and over the following 4 days consumed between 5mg and 10mg lines every 1 to 2 hours. We ended up picking up another gram after day 2. It started out nicely enough with the near exact feeling of blow but that's where the good similarities between the two substances ended! We never planned on being up for 4 days without food that's for sure so its very addictive and in our opinion extremely dangerous. We both usually get paranoid from blow and this has that negative side effect as well. The extremely bad thing about this substance for both of us were the extreme hallucinations both visible and audible of all things we were fearing from the paranoia. At the end of day 4 I dumped the last half gram to stop the complete insanity and the g/f got extremely angry with me and she didn't want to stop she went and got more that's when I left for home. </p><p>Another difference between blow and this is the fact that after stopping I still couldn't sleep for 36 hours and that's after taking 20mg of xanex and the g/f had the the same problem when she finally stopped 2 days later. This was the worst chemical we've  ever tried and we have done quite a few. We could have lost everything we had including our sanity due to 4 days of chaos for me and 6 days for her. She also almost died in my opinion after taking 50mg of xanex to try to sleep after her 6 day binge. We both agreed we would never do this again and only wished we had never heard about it in the first place! </p><p>In short its very addictive, the comedown is the worst of any substance we have tried, the paranoia and extremely vivid audible and visual hallucinations combined made for hell on earth. We lost our sanity for many days.  Be warned if your crazy enough to play with this and be prepared for the possibility of some rather severe consequences!</p>"
}
