{
 "title": "First Time Trial",
 "author": "zophen",
 "citation": "Citation:   zophen. \"First Time Trial: experience with 2C-TFM (ID 91745)\". Erowid.org. Oct 26, 2011. erowid.org/exp/91745",
 "substance": "2C-TFM",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 mg",
   "oral",
   "2C-T-FM",
   "(powder / crystals)",
   "  T+ 1:25",
   "3.5 mg",
   "oral",
   "2C-T-FM",
   "(powder / crystals)",
   "  T+ 9:45",
   "  ",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)",
   "  T+ 9:45",
   "  ",
   "oral",
   "Codeine",
   "(pill / tablet)",
   "  T+ 9:45",
   "  ",
   "oral",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 91745",
   "Gender: Male",
   " ",
   "Age at time of experience: 47",
   "Added: Oct 26, 2011",
   "Views: 37646",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nSet  Not perfect but Ive had worse. An hours sleep the night before makes me feel sleepy\r\nSetting  My House, kids due in from school  busy household  Im used to it\r\nT+0.00  Drink 3mgs of dissolved drug\r\nT+ 0.10 Faint perceptual changes, continue reading my book.\r\nT+ 0.20 Give up on reading as I cant follow the narrative, watch my dogs play fighting, grab a quilt & lie underneath it on the settee, start to feel warm yet shivery, this is a fairly standard physical effect I get from a 2Cxx.\r\nT+0.50 Feels warm & relaxed, introspective  then again Im alone with two dogs for company so intellectual discourse is out of the question.\r\nT+ 0.55 My wife rings to see if Im dead or ill from ingesting the drug. I toy with the idea of not answering the phone  however I do my duty and confirm that Im alive.\r\nT+01.10 I make a ham, mayo & pease pudding sandwich then eat it  delicious  so much so I make another. I have a noticeable tingling up my spine & the nape of my neck. This is feeling quite luxurious now. No visual effect to speak of it just feels good. I consider redosing; I consider for about 5 seconds then decide.\r\nT+01.25 - Take another dose of 3.5 mgs in orange juice.\r\nT+ 01.50  My kids come in from school  I orient my mind & begin giving standard instructions such as uniform in the wash  take the dogs out  put your bait box in the sink for washing  do any homework you have. My vision is becoming noticeably blurred as the second dose kicks in. Brief CEVs of women  very realistic - like flash frames.\r\nIm still perfectly able to carry on conversations so long as I feign tiredness when a I feel theres a slight lag in mental processing before I respond.\r\nI find myself in a dreamlike state & retire upstairs to have a bath  the timekeeping breaks down from this point as I got into what I was doing which was more interesting than writing stuff down..\r\nTheres a definite aphrodisiac quality to the drug  not in the same league as 2CE but definitely present. I coax my wife upstairs & we spend a while in bed. Orgasms achieved x2  who knows if there wasnt other activities going on (kids in & out of the house dogs barking etc) how that might play out.\r\nMy wife tells me there is marked pupil dilation.\r\nAt one point I get a feeling of anxiety  it lasts seconds & is dispelled by a unique sense of wellbeing that seems to emanate from the ether  like a superpowers pick me up.\r\nI begin to drift, my mind wanders, there are inferences of mind movie type visuals which dont quite materialise, hopefully some of you will understand this interim state.\r\nI find myself a little more clumsy than usual, dropping a couple of things getting entangled in my clothes as I get dressed to go out.\r\nWe set off into the foggy night  my wife driving  myself sitting with my eyes closed  just concentrating on feeling calm  which works rather well.\r\nI think Ive probably overshot the mark for going out maybe 4mgs would have been better suited as my concentration on external things is difficult to maintain.\r\nAnyway we watch the band.\r\nT+ 7.45 I suddenly come to life the internalising seems to vanish quite quickly & I find Im up dancing & having a great time & the show ends too soon for my liking.\r\nI find Im fired up in a low key way (I have a tendency to get very fired up & overly positive at times) & I talk most of the way home & chat with three of my kids when we get in, I find myself play fighting with my youngest son.\r\nT+8.45 Eat donner kebabs  they taste foul but so moreish  I imagine that cannibalism has a similar effect  you take a bite & think yeuch yet are compelled by some strange force ( AKA greed) to eat more.\r\nT+ 9.45  The children are despatched to bed, my older son leaves & goes to his house & we eat a couple of diazepam, some codeine & smoke some dope  which puts my on my back in short order.\r\nT+ God knows when  I fell asleep\r\nOverall a very positive feeling from the drug, at some points I felt lovely/ laid back blissful, there was some mild confusion at times, though this could have been due to sleepiness & the fact I tend to get confused anyway. I enjoyed it. I shall sample it again in a single higher dose next time and hopefully in a better mindset.\n\n\n"
}