{
 "title": "Severe Addiction and Effective Treatment",
 "author": "Yesterday",
 "citation": "   Yesterday. \"Severe Addiction and Effective Treatment: experience with GBL (ID 91760)\". Erowid.org. Aug 24, 2011. erowid.org/exp/91760",
 "substance": "GBL",
 "bodyweight": "182 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "GBL",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 91760",
   "Male",
   " ",
   "24",
   "Aug 24, 2011",
   "Views: 8128",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had had a very troublesome year with severe depression and was not responding to various SSRI's and SNRI's. I ended up with some GBL and took a dose of around 2ml. My depression instantly lifted, as well as all of my anxiety and I was able to function normally. Once it's effects had worn away, I re-dosed.</p><p>I found myself in a pattern of frequent dosing, at the worst point I was re-dosing every 2 hours or less. I had developed a massive tolerance for the substance. After several months I was collapsing more and injuring myself after taking it. I was unable to hold down more than 2 hours sleep at a time as my body would wake me up to re-dose. Also I have read about a possible 'dopamine rebound,' that being that when you take GHB/GBL dopamine levels are supressed and rebound after a few hours...making you more alert and anxious. I can say that I most certainly would feel these effects.</p><p>I was literally a mess, I couldn't function properly anymore, nobody wanted to be around me and I couldn't go anywhere without taking GBL with me. </p><p>I decided to cut down my use in an attempt to stop, taking a lesser dose less often. I went to bed and woke up a few hours later not knowing where I was, who I was or what was going on. I was in such a state of confusion and my whole body was shaking violently. I began vomiting everywhere. After a few moments I some how instinctively had a shot of GBL and all of these withdrawal symptoms evaporated. </p><p>I knew then that I needed medical help to stop my GBL intake. I sought help and found it nearly impossible and none of the doctors seemed to know what it was. I spent two days educating different groups of doctors and being passed from one place to the next.</p><p>Eventually an addiction specialist contacted a GHB/GBL specialist in London, whereupon he was immediately advised on the correct course of action.</p><p>I was prescribed up to 80mg of diazepam a day, but was allowed to take up to 125mg if needed for the first 3/4 days. Diazepam however works on the GABAa subset of receptors, and not the GABAb subset (GBL/GHB work on GABAb receptors) and so Baclofen (an agonist at the GABAb receptor) was also presribed to be taken 3-4 times daily. My withdrawal symptoms went and I was able to go without GBL. I continued on baclofen and 30mg valium a day for about 3 weeks and then stopped.</p><p>After being addicted to GBL you feel hollow and anxious for about a month or so afterwards. You don't feel right AT ALL...but it really does eventually go away and you DO return to normal. It is important not to take anymore GBL/GHB in this time as addiction becomes likely all over again. Diazepam certainly helps with the anxiety, but doesn't take it away. </p><p>If you are suffering from an addiction to GBL/GHB then please try to advise your doctor on the above treatment method as diazepam alone will not work. </p><p>Be careful, and good luck.</p>"
}
