{
 "title": "Trading One Fix for Another",
 "author": "Matt Baze",
 "citation": "   Matt Baze. \"Trading One Fix for Another: experience with Vicodin, Dexedrine & Adderall (ID 9181)\". Erowid.org. Jul 4, 2005. erowid.org/exp/9181",
 "substance": "Vicodin, Dexedrine & Adderall",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "7.5 mg",
   "oral",
   "Hydrocodone",
   "(pill / tablet)",
   " ",
   "15 mg",
   "oral",
   "Amphetamines",
   "(capsule)",
   " ",
   "20 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9181",
   "Male",
   " ",
   "Not Given",
   "Jul 4, 2005",
   "19321",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In the fall of 2000, I became addicted to Vicodin.  I would spend every day completely out of touch with reality.  Not knowing what was going on or what I was doing.  Somehow  I managed to go to college full time, and work full time.  On my way to catch the train on my way to school each morning I would pop three or four Vicodin.  By the time my second class of the day came around I would take three more.  I sat in class each day in a complete fog, not grasping the concept of what my professor was teaching.  Not that I cared in that state of mind.  During half of my classes I would nod out, waking up when everyone was leaving.  I would get back on the train to head home and then to work, but hell what is a train ride without a couple of Vicodin.  So another two would be thrown down. Then I would get home and get changed for work.  I tried not to look to horrible when I got into work, being that I am the boss of 150 people.  I would sit at my desk and answer my phone helping people as best I could in my fog.  I would pop a couple more during work.  (It's funny how wonderful a cigarette tastes when you are all pilled up.)  Finally the night would be over and I would make my way home.</p><p>By April the pill popping had worked its way into my daily routine.  I could not function without taking a few pills.  To do a simple task, I had to take a few Vicodins first.  By June, I was taking almost twenty a day and I knew I had to get off of them.  I had become disgusted by the sight of myself.  I had balloned up to about 200 lbs.  and my skin was terribly broken out.  My first concern was to get myself looking better.  I figured, if I looked better then my self-confidence would be boosted, thus making it easier for myself to get off of the pills.  I tackled the skin problem easily, but the weight was really hard to control.  Then I found Dexadrine.  Good old Dexadrine, I began taking 15mg Dexadrines in mid June, and by the beginning of July I had dropped about 30 lbs.  Everyone I knew was saying how wonderful I looked.  I got a promotion at my job, and the world was looking up.</p><p>But these pills to began to creep into my everyday routine.  I would crash hard, and not be able to get up in the morning, because I had been speeding the whole previous day and was in a very deep sleep.  Soon I began took look emaciated.  My skin was hanging off of me, my ribs were showing through.  I went from being a six foot 190lb.  man to a 145lb man.  Plus I think I shrank in that time too.  But I really like looking good, so I decided to stay with these pills.  However like any other drug I became very accustomed to them and found it quite difficult to find any relief from one 15mg pill.  I felt that taking two 15mg pills at once was too much, because I knew I would be taking mor latter on in the day.  So then I moved to 20mg Adderal.  There was something about these pills that I liked.  Maybe it was the fact that they were not time released like the Dexadrine, or maybe it was the fact that they were blue (Hey I was a junky, colors amazed me.) Anyhow I really liked them, but the fact that they were not time released ment I had to take more to keep my feeling of euphoria from fading, but hell the Adderall was easier to get my hands on so I did not mind.</p><p>Then the nervous ticks began, and the heart pains.  I knew it was time to get off......And let's see if I can.</p>"
}
