{
 "title": "All Praise The Fan",
 "author": "Ness",
 "citation": "   Ness. \"All Praise The Fan: experience with DXM (ID 9182)\". Erowid.org. Aug 13, 2007. erowid.org/exp/9182",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "750 mg",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9182",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 13, 2007",
   "Views: 24051",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One night my friends and I were very bored. Earlier in the night my friend 'D' had asked me about what I thought about tripping on cough syrup. We got into quite a heavy discussion about it, and against my other two good friends interests we decided to take some. He had of course researched the drug quite nicely and we set off for a nice 11 o' clock jaunt to the local 7-11. </p><p>Once there, we bought red bulls for all of us, candy, peanuts and two bottles of robotussin cough syrup with the only ingrediant being DXM. Once our tasty treats had been acquired we continued to walk home. Once home we were pleased to see many glow sticks ( not sticks but the long stringy glow whips you often see at carnivals) in my friends living room. This would be very fun. 'D' drank the whole bottle down, while I finished my peanuts and red bull. About 20 minutes later I decided to drink the second bottle. We had no idea what would happen in an hour and a half. </p><p>We watched crappy music videos and had some nice in depth conversation on interacial dating until finally 'D' and I were starting to feel the effects. My friend 'M' realized what was happening and wanted no part of it, while my two friends 'J' and 'B' were curious to see what was going to happen and proceeded to turn the lights off, blast the techno, and bring out the glow whips. At first d and I were doing quite well. Enjoying the music very much and having a great time. Then d started feeling sick and went outside and threw up. This is when it started kicking in for me. I realized I didn't want to throw up and decided to just lay down on the floor, D shortly joined me. We sat on the floor as my two other friends made figure eights and rainbows with the whips. However the effects of DXM were starting to kick in, and for me the entire room was glowing green. The glow blurred in with every in my field of vision. I then remembering my two friends getting the brilliant idea to tape the whips to the fan. Little did I know, soon the Fan would be my God and Savior.</p><p>Two tape the whips to the fan they needed to turn on the lights. They warned me the light would be bright, and for the first second of feeling the bright light hit my body, I felt so much hate and rage against all light. I felt that darkness was my master and that all light should be destroyed. According to my friends I started saying how bad the light was, and my plans to completley destroy all light. Then seeing as how much I hated the light, my friends through a black blanket on top of me, when the blanket hit my body, I felt as if I rose above my body and floated to Universal Citywalk. Everything was so real, I was above the walk and looking down could see all the people there. I was there for about 15 minutes, but it seemed so much longer when the blanket was taken off me and I was snapped right back in my body. Once back my friend and I recognized the new pal given to us, the glowing fan. We sat directly below it and watched as it's dazzling speed and colors amazed us. I felt as if this was my leader, my God. It had ruled over me for my entire life and nothing was as powerful or strong.</p><p>Soon I began hallucinating. The middle of the fan was suddenly like a camera, like I was looking inside the shutter into a scene of an asian man with a straw hat on. He was fishing and he then put down his rod. And began flying over the moon that had replaced the center of the fan ala super man( with the arms stretched out in front of him) I then proceeded to see many faces of Ashton Kutcher( from that 70's show and dude wheres my car) because I saw dude wheres my car earlier that day. After that my memory began to fail me.  </p><p>The few things I do remember were strange, and not many actual activities but just feelings. The few activities I do remember were stumbling through my friends house until I entered the kitchen. There D and I jumped up and down for about 10  minutes and had such a fun time doing it. It was as if the ground was moving up and down and we didn't know when we would hit it. Then I just remember such a feeling of euphoria that was a world was a wonderful place, but also feeling that the world consisted soley of my friends house. His living room, the throne of the master fan and center of the universe and just other rooms being small galaxies. Then I remember having a horrifying feeling of identity loss, like I forgot who I was. I remember asking everyone in the house who I was, and what my name was, and why am I living. Then after that D and I sat side by side and just looked up at the ceiling. There I saw some blurry objects and shapes, nothing real cool though. It appeared the trip was ending.</p><p>The next morning my pupils filled up my entire eyes. The hangover lasted for two days, and consisted of trouble with coordination and a 24 hour fever that was not pleasant. The hangover actually really really sucked. But the trip was very interesting and quite a bit of fun. But get prepared for the hangover, mine was worse then my friends, I don't really know what causes the certain type of hangover, weight, dose, or anything. If anyone has information on it, I would be quite curious, thanks for reading.</p>"
}
