{
 "title": "Too Much Behind the Wheel",
 "author": "Scott",
 "citation": "   Scott. \"Too Much Behind the Wheel: experience with GHB (ID 91896)\". Erowid.org. Sep 12, 2011. erowid.org/exp/91896",
 "substance": "GHB",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "GHB",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Alcohol - Hard",
   " "
  ]
 ],
 "footer": [
  [
   "2009",
   "91896",
   "Male",
   " ",
   "30",
   "Sep 12, 2011",
   "Views: 2877",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Used GHB or Gee Bee's as we called it here for a good 12 months on a regular basis. Seen many occasions of OD's and been through a few myself.</p><p>My first embarrassing event on this drug was in combination with alcohol while at a club in my then hometown Canberra. Having already consumed some amount before reaching the place, I with a friend consumed another dose right before entering the venue. Once inside and with a drink in one hand the later dose kicked in and suddenly I was swaying everywhere and making a total fool of myself. I remember the full glass of Bourbon and coke slipping from my grasp and in slow motion falling to the ground and shattering at my feet. After that I only remember falling over tables and taking other peoples drinks before the rest of the night became a blur.</p><p>My friend filled me in on the rest and explained I had been kicked out of the club understandably and then with him helping me return to the car had gone on to throw up on  the street in front of police. He then drove me home [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] in my nice Subaru via a football oval where he decided to take my car to do a few AWD donuts with me in the passenger seat although I remember none of this. At his place he let me sleep on the bathroom floor and decided it would be funny to video me and throw glasses of water at me when I jumped up in shock then swayed and fell unconscious again. This lasted a couple hours before I woke up and felt good and clear headed. I then watched his home video and then saw my car covered in grass and mud. The memory of the glass dropping and being a dick came back to me. This is a classic G overdose.</p><p>Ive since then had many occasions of too much. I've passed out in my car while holding a hamburger to wake up some hours later still holding the burger still with burger in my mouth and wearing the seatbelt (foolish). </p><p>I've seen others pass out too. I witnessed a friend measure a 25ml dose out of a bottle finish the dose then to accidentally wash it down with the bottle it came from. Ive seen 'hero's' that had never done it before insist they can handle a big dose to then be sleeping on the patio 10 minutes later for the next 4 hours.</p><p>In short it can be dangerous in the wrong environment but the drug is very enjoyable. It enhances the effects of other drugs well and is great with mdma. The fact it can be used as a date rape drug and to spike drinks probably gives it a bad name. Used in public you may embarrass yourself and be in danger but no much worse than alcohol. I really like GHB and would be happy to do it again. I haven't done it for over a year now or any other drug really but it will show up again some day.</p>"
}
