{
 "title": "Recovery: Nausea, Off Balance, Dizzy",
 "author": "MyndBndr",
 "citation": " MyndBndr. \"Recovery: Nausea, Off Balance, Dizzy: experience with MDMA (Ecstasy) (ID 91905)\". Erowid.org. Jul 13, 2011. erowid.org/exp/91905",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "2 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "",
   " ",
   "",
   "Alcohol",
   "",
   "",
   "1 capsl",
   "",
   "MDMA",
   "",
   "",
   "1 capsl",
   "",
   "MDMA",
   "",
   "",
   "1 capsl",
   "",
   "MDMA",
   ""
  ]
 ],
 "footer": [
  [
   "2011",
   "91905",
   "Male",
   "",
   "30",
   "Jul 13, 2011",
   "4780",
   " "
  ]
 ],
 "report": "<p>June 2011, five friends and I began our long-weekend holiday of partying for three days.  Luckily we all wanted the same experience, and so all had the same pills and powder, MDMA and cocaine.</p><p>Fri night: 2 lines of cocaine and alcohol</p><p>Sat daytime: 1 MDMA</p><p>Sat nighttime: 1 MDMA</p><p>Sun nighttime: 1 MDMA</p><p>This report is about the after-effects, but wanted to insert a note that I am very experienced with most amphetamines, having partied for 10 years with pills and powder.  Accumulated total within the ten years I have probably had between 400-450 extacy pills, and about 20 MDMA capsules that always claimed to be PURE.  Until this experience I rarely thought about negative impact of MDMA on my body.</p><p>Recovery:</p><p>Monday all five of us were tired and had very little appetite, which I have come to expect over the years.</p><p>Tuesday, we suddenly had feelings of extreme nausea [3 of us puked over 4 times], and what caught us off guard was our dizziness, and off-balance feeling.  I would describe it as a feeling in my stomach and brain, similar to a fast spot in a rollercoaster at the top of the biggest hill, where your body goes up in the air and your legs are keeping you inside the ride.  My stomach went up into my throat and it felt as though gravity was pulling my brain out of the top of my head.  One of my other 4 friends also described it as...when you are in the backseat of a car and you come to a stop, but then look out the window and the car next to you looks like it is moving...the sudden stomach uneasiness and improper perceiving of gravity gives the tickle in your stomach and a confusion in your brain as it tries to compute.</p><p>Wednesday, same as Tuesday, and at night I had violent nightmares.</p><p>Thursday, most intense day of recovery [day 4] and I took it off work.  Worst night of mood, violent nightmares again and soaked sheets when awoke.  Visions of devils, ants and bats when I closed my eyes.</p><p>Friday, small subsiding of effects:  no more nausea, but dizziness and balance still weird.</p><p>Saturday, finally felt like my brain was going to recover, and I no longer felt the fear of </p><p>Sunday, tried going to the gym and still a bit off balance in heavy lifting so I went back to jog on treadmill.</p><p>Monday, today I feel like Im about 98%, and have sworn off hard core and feeling lucky to have survived this week of hell.  This is by far the LONGEST and most violent body recovery from MDMA, and I read about Serotonin poisoning / MDMA overdose and think this might be it.  Very little else found on this, so thats why Im writing.</p><p>Urgent Note:  Attempting to heal my brain with 5-HTP only made my anxiousness worse and nightmares more intense.  Not sure if this was the reason I was unable to sleep.  Also, the only thing that seemed to calm my nausea was to lay down on my sides, not my back or belly, and to sip on sugar drinks, and protein shakes.  I slept [tried] for about 9hrs each of the recovery days [Mon-Sat], so the whole week was a write-off.  Luckily, all five of us felt the same and so it was comforting that we knew it was the capsules and not something else like environmental factors.  I also wanted to say that I got the MDMA from a very reliable source that I had been buying from for 7 years.  This post is to encourage readers that if you feel the above  HANG IN THERE, and sleep as much as you can.  This was the only thing that seemed to work.</p>"
}
