{
 "title": "Breakdown",
 "author": "Flance'",
 "citation": "   Flance'. \"Breakdown: experience with Salvia divinorum (5x extract) & Cannabis (ID 9191)\". Erowid.org. Jun 24, 2004. erowid.org/exp/9191",
 "substance": "Salvia divinorum (5x extract) & Cannabis",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "3 bowls",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9191",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2004",
   "Views: 4601",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have worked with the Salvia 5x, both standardized and not about six or seven times.  My results have been from disappointing, to fairly substantial.  However this last encounter created an experience that has caused me to reevaluate everything I think I know.  </p><p>I had been working closely with friends on a film project all summer, I rarely if ever was alone the whole time.  When the project was over, I found myself sitting in my room alone for the first time in a while.  I was reading some Allen Ginsberg and listening to some nice Live Dead,  Marijuana sounded like the right thing to do so I smoked several bowls and continued reading and listening and enjoying the moment.  I wanted to push it further so Sally seemed like a nice thing to explore, I had never introduced Mary and Sally together, so I thought now would be a perfect opportunity, I packed a water pipe with a large amount of a non standerized 5x Salvia preparation and smoked the entire bowl in one inhalation, I held the smoke for as long as I could and exhaled.</p><p>I immediately stood up and walked to the door, when I reached the frame of the door, I forgot what exactly I was going to get up and do.  It didnt seem out of the ordinary, I just thought I was being forgetful.  But as I was trying to remember, I suddenly forgot where I was, I didnt recognize anything,  not because everything was so visually distorted, but I couldnt reference anything as familiar, and then at this point I forgot who I was.  Eventually I forgot what I was.</p><p>This is a very humbling thing to experience.  I have never completely lost my sense of self so completely with any psychoactive substance or situation like I had at that moment.  Everything slowly went away,  my life as I knew it was not just forgotten, but gone.  Living and life had become something extremely foreign to me.  Life became a completely different concept to me.  The last semi rational thought I had before leaving my body was Oh God, who knows what I unleashed.  I think then I came upon my bed,  I dont know whether my eyes where closed or open or if I even had eyes at all.  Their was a sense of everything breaking down, slowly.  All of my senses, my perception, everything sort of slipped into a new form, I became more and more basic, breaking down until, I was no longer anything that I had ever been before, In the most basic form, I became shades of color.  I became a shade of red and a shade of blue,  breaking down even further.  I was at Ground Zero right in the epicenter.  I had no fear or desires or anything else at that point.  I remained like this for an infinite amount of time.</p><p>I then was able to experience a conception of myself.  </p><p>Slowly just as everything had gone, it came back.  I could feel layers returning.  I witnessed the rebuilding of my former self, Everything.  I lay on the bed, slowly catching glimpses, slowly coming to the realization of the experience.  When my body was real I still did not move for a long time.  I only got up to turn off the light and music and return to bed.  I pulled the covers over my head and began to laugh, I slept. </p><p>Technical Notes:</p><p>I dont know why I was never able to achieve these kind of results with the 5x before.  It may have been that since I had started smoking semi heavily during the film, I was able to inhale large amounts of smoke for long periods, or perhaps mixing it with Marijuana enabled me to break through the barrier, most likely it was a combination of all of these things.  I am grateful I did not give up on this substance, Its potential exceeds anything I would have ever expected.  Sally has taken me a little closer to knowing myself, and for that I am forever grateful.</p>"
}
