{
 "title": "Not a Positive Experience",
 "author": "FirstTimeSnorter",
 "citation": "   FirstTimeSnorter. \"Not a Positive Experience: experience with 4-Methylethcathinone (ID 91913)\". Erowid.org. Jul 12, 2011. erowid.org/exp/91913",
 "substance": "4-Methylethcathinone",
 "bodyweight": "310 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "4-Methylethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "91913",
   "Male",
   " ",
   "39",
   "Jul 12, 2011",
   "7647",
   " "
  ]
 ],
 "report": "<p>About me 39 years old male 310lbs and 6foot 3inches tall</p><p>Past drug experience:</p><p>ALCOHOL: Drinking alcohol to the point of puking / spins / knows what its like to feel slurring speech drunk / intense buzz of alcohol done via shots and repeated cocktails</p><p>MDMA: Tried 1 500mg pill of pure MDMA once at age 23, literally came in my pants at onset, rolled naked for 8-hours with an erections each time the roll of pleasure hit and masterbated each erection, got cum to shoot out of my penis 14-times while on it  decided never to try it again unless with a woman who dug me and have the most glorious sex ever</p><p>MARAJUANA: Tried marijuana twice, once in a sticky green bud brownie after puking  from a night of heaving drinking, stopped the puking immediately and gave me on of the most pleasant relaxing sleeping-while-awake stoned experience (bud was very high content THC). Second time tried smoking it, had never smoked anything before, coughed up half a lung after trying to hold the hit in for more than 10-seconds; very high content THC used again felt like laying down and sighing to myself and snuggling/spooning with a woman for 6+ hours, very night feeling but coughed up grey bits of lung the following morning and  decided to do it again till I need it medicinal purposes- havent tried it since.</p><p>KRATOM 15X EXTRACT  4 teaspoons every time mixed with warm grapefruit juice and chased with 2 11oz bottle of mikes hard lemonade, takes about 15 to 30mins to swallow all that- experienced 10 different times- gives an alcoholic buzz enhanced with tingles and then an overwhelming feeling to laydown and relax, body feels like its very soft and melting into the bed, very nice relaxing potion but after 2 hours the need to puke almost always happens and kills the relaxation / full body buzz</p><p>After discovering and reading other peoples experiences with chemicals like kratom and also the very hard stuff like cocaine, heroin and methamphetamine I decided to stop abusing my liver with alcohol and start trying other ways of alternating my consciousness, that and I got a 2nd DUI so I decided never to drive again while consuming any chemicals since cops hate dealing with my high/drunk dumbass and will layeth the smaketh down severely.  I ordered a large quantity of 100oz kratom 15x extract from reputable shamanic site online and began my experimentation / adventure into recreational legal highs.  Even with chatting with straight-up drug dealers in my DUI classes I havent been able to score a gram cocaine, heroin or crystal methamphetamine because none of them can guarantee getting me as close to 100% pure stuff (Ive offered $500 for a gram of pure coke and none could come up with any) so until I am around those-in-the-know who can guarantee what Im trying is real I finally gave in and decided the next research chemical in a stimulant category I will try it.</p><p>I went to the research chemical seller online and secure 4grams of nearly-pure 4-MEC.  4-MEC is a very clean looking white chemical, crushes very easily with a credit card.  I remember to hit the tare button on the scale before measuring / trying the dosages below.  Because I am a very large man I probably need larger does than other reported using, but being cautious I started with a very small dose and worked my way up to larger dosages as the afternoon progressed.  </p><p>Open package revealing silver sealed pouch with 4grams of 4-MEC in smaller resealable plastic baggie.  I havent drank any alcohol or kratom since December 2010 and the most chemicals I have in body now are caffeine from soda and the shopping list of ines from a redbull or 5 hour energy occasionally.  All I have had today is 1 five hour energy 8 hours before insufflating first 4-MEC line and 5 diet cokes, last was 1-hour before insufflation while eating a burger and fries lunch from in-and-out burger.  Measured the dosage, note unless otherwise-noted 3:30 = 3mins 30seconds into the experience etc.</p><p>NOTE: THIS IS MY FIRST TIME EVER SNORTING / INSUFFLATING ANY KIND OF DRUG SO I MAY DONE IT WRONG AS YOU READ FURTHER</p><p>+0.00 30mg unwrapped mcdonalds straw, cut 4 piece, chopped 30mg line with credit card, straw in right nostril, suck and voila instant burning in nose  this makes me excited since other who experience real pure stuff noted a burning immediately too</p><p>+7:00  still burning in nose, feeling bit more relaxed, experiencing burning drip in back of throat  annoyed not feeling more</p><p>+9:00 acid burning feeling more strong in throat</p><p>Not sure if did enough</p><p>+10:30 feeling normal</p><p>So burning sensation is only thing I strongly feel  very annoying</p><p>+12:30 relaxed feeling returning, forehead feeling thicker</p><p>+13:00 burning finally dying down, acid drip still in back of throat</p><p>Debating whether to try 100mg dose</p><p>+15:00 feel like lying down</p><p>+16:00 feel like being up</p><p>Still biggest sensation felt is burning in nose</p><p>+18:45 feel normal, burning almost gone</p><p>+21:30 insufflated 100mg into left nose, used right nose to suck up specks missed</p><p>Burning not as bad</p><p>+23:50 body feeling heavy, burning still there</p><p>+24:30 hurts to breathe through nose</p><p>+25:30 forehead feeling heavy again</p><p>+26.30 feeling disappointed</p><p>Even time I breath in through nose it burns, acid drip returned to throat</p><p>+27:45 movements feel slowed down</p><p>Very bad taste in drip in back of throat</p><p>+28:30 almost feel like body not responding to commands</p><p>This must be disassociative feeling others have reported</p><p>+29:45 starting to sweat a bit on forehead, still no buzz or euphoria</p><p>Bitter / acid drip still there</p><p>Starting to think might have to snort much larger dose to feel any sorta euphoric high</p><p>31:30 movements feel slowed down</p><p>:32:40 harder to move mouse / type</p><p>33:30 thinking to self if this is what recreational chemicals are this legal high sucks wishes had a *real* illegal drug illegal drug like coke that actually work since snorting the lines not as bad as though it would be</p><p>34:30 every time I swallow I taste the yucky drip, not much burning left in noses</p><p>Still very acid taste every time swallow</p><p>35:30 wonder if I snorted it correctly / didnt chop-up the grains enough</p><p>36:00 cheeks on feel numb but then goes away</p><p>Thinking might try 200mg since not feeling anything close to a high</p><p>+38 feel like lying down, will see if that improves sensations</p><p>+41  body feels heavy but lying down makes me notice burn in nose more plus acid drip</p><p>+42:30 I feel very slowed down, almost drunk but without the nice buzz that alcohol gives</p><p>+43:00 notice can hear quiet sounds better, notice fan on coputer is very loiud</p><p>Typing not so good any more</p><p>Go through moments of feeling normal and moments of tired/slowed down</p><p>+44 nose still burns but just slightly</p><p>Still notice acid taste every time swallowing, getting water</p><p>+46 water makes taste in back of mouth / throat worse</p><p>Now not sure if should redoes / if is worth the burn</p><p>+47:45 whole body suddenly feels hot / like been in sun too long</p><p>+48:10 hot flash gone away</p><p>Thinking did not do enough but unsure if will try more since all Ive felt strongest is the burning in nose</p><p>+50:00 feel total sober, forehead sweating</p><p>+51 back to feeling tired / disassociated from body, still noting burn every time I breath in</p><p>+52 back to feeling slothlike, wonders if did not grind up powder enough, still feeling drip and burn in nose</p><p>+53 very unhappy not feeling any high / euphoria, maybe rectal method is better</p><p>+55 feel like sleeping</p><p>Debating whether try 200mgs or save for different day and start with larger dose</p><p>+60 snorted 200mg, went up very smoothly this time, also chopped w/ straw much longer</p><p>+63 not as much burn, nostril feels stuffed</p><p>+64 slowness returns</p><p>+65 disassociated feeling from body returns</p><p>+66 drank more water, little burning / acid drip</p><p>+67 can hear my breathing very clearly and heartbeat</p><p>Kinda like this feeling hearing my body</p><p>+68 still able to hear breaking and heart, it like they not mine</p><p>+68 heart rate seems to have increased</p><p>+69 acid drip in throat returned, drank more water</p><p>Put on Orbital, Halcyon sounds AMAZING</p><p>+71 put on headphones. Still hear breathing over the groove</p><p>+72 heartrate still elevated can hear it it and breathing over music</p><p>Both ear feel like their plugged with cement, taking off headphones</p><p>+73 can still hear breathing, thinks this would be awesome shamanic trance / deep meditation</p><p>+74 still no euphoria or high feeling</p><p>Wonders if shouldve started with 200 and then redose once burn drip subsides</p><p>+75 burped, some lunch came up, swallowed back down, very unpleasant taste</p><p>+76 acid taste in back of throat very strong</p><p>+76:30 ear starting to feel not clogged</p><p>+77 cant hear breathing or heart as well as before</p><p>+77:30 feeling hot again, forehead sweating</p><p>Thinking of snorting rest of gram</p><p>Wonder if the ears feeling clogged sensation was what euphoria high is supposed to feel like</p><p>+79 still can hear breathing very well, wishes I felt SOMETHING POSITIVE start to go back to feeling disassociative</p><p>+finished first 12oz of water, went and got 2nd 12 oz, took sip</p><p>+81 notice back of throat now feels numb / not burn / no acid taste but feels like loogie in back of throat</p><p>+82 feel normal cept for can hear breathing really well</p><p>Really wondering if this is all this recreational chemical has to offer, being drunk is a far better experience so far</p><p>No desire to do more / feel tired / worried not doing lines right but wishes could feel a euphoric high like when I ejaculate</p><p>+85 seem to slowing down more, played with penis, did not respond / wont get erect / cant masterbate dammit</p><p>Sipped more water, acid taste returned</p><p>+87 forehead sweating again, still vividly hear breathing</p><p>Really frustrated not feeling high / euphoria, forehead starting to feel like in a squeezed vicegrip, almost headache on top of head</p><p>Thinks 200mg snorted before meditation or trying to connect w/ inner-spirit might be the way to use this stuff, does not seem to get one high like mdma alcohol or mj</p><p>+91 drinks more water</p><p>Still freeling bit of acid burn in throat, if inhale deeply through nose both nostrils burn</p><p>Debating to try 250</p><p>+93 feeling close to normal, still feel a bit hot/flush</p><p>+93:30 tried standing up, whole body feels very heavy</p><p>Wonders if should go online and buy another 4mg or whatever large quantity can get as research chemicals</p><p>Thinks not doing large enough dose or 4-MEC cant get me euphorically high</p><p>96:30 noting time going by a bit faster / Im slowed down</p><p>Wishes he could get an erection, would love to see if makes cumming sensation better/worse</p><p>+98 drank more water, almost done with 2nd 12 ounces</p><p>Notices legs have been sweating and socks are wet with foot sweat</p><p>+99 feeling much more normal sounds returning to normal</p><p>Still wishes could feel a euphoric high, might go 300 / do rest of gram</p><p>+101 notices hands a but sweaty too</p><p>Half of me wants to do more other half wants to stop and sleep</p><p>Really wishes he would feel something much stronger than felt so far</p><p>102 read posting that 4-MEC is MDMA ULTRALITE I would say super featherweight ultralite, great for meditation but not get stimulant high / rush</p><p>104:40 come to conclusion very UNstimulant high, closest feeling was lite drunk buzz / tired</p><p>Finished 2nd 12oz water</p><p>106mins body still feels slow / like drunk slowness but without the spins</p><p>Very small hint of acid burn in throat, nostrils feel burnout</p><p>Still deciding whether to do more</p><p>109mins looking at bag, admiring how clean-looking 4-MEC is</p><p>Still have a 2 hour and 20min window to do more before kids come home, feel like if they came right now would be able to handle them but would hate hearing their high pitched screams when @ play / screwing around in the house</p><p>111mins feeling sober but hearing is going in and out of sensitivity</p><p>113mins seriously, if this is what getting high is all about it is really lame, how in the hell do people become drug addicts if this is all it has to offer?</p><p>114mins start to get brave to try the big dose and see if anything changes</p><p>115min feeling like baseline cept for nose in still slightly owie / tender feeling</p><p>Decide to do 250mg in each nostril</p><p>Restarting stopwatch</p><p>0:00 took 2 snorts each nostril to insufflate the 2 250mg lines, 250 into each nostril</p><p>Needed sip water to help with throat burn, notice burning in nostrils not bad at all this time, feels like the powder is mostly sitting in my sinuses this time, realize first few time may not have had straw far enough up nose</p><p>3:00 acid taste is back of throat now more of a chemical taste, licked mirror where did lines, mirror taste just like back of throat</p><p>3:45 definitely starting to feel something different this time</p><p>Drank more water, throat burned intensly</p><p>5:00 the ear clog feeling returned</p><p>Beathing and heart sound neato</p><p>5:20 forehead starting to feel heavy</p><p>5:20 starting to sweat all over</p><p>6:00 vision bit blurry middle of head feeling like in vicegrip</p><p>Feeling pressure on both side of temples</p><p>6:49 hope this sensation is going to continue but suddenly dies down, heart rate starting to elevate, forehead sweating</p><p>7:35 vice grip feeling kind painful, notice teeth clenching</p><p>8:15 feeling like the chemical tastes  bad and acidic</p><p>:8:42 feel like might throw up</p><p>9:00 teeth clenching hurting checks in face</p><p>:9:30 hand starting to shake hard to type feeling a bit anxious if this is precursor to euphoria</p><p>Drank water, hands uncontrollable shakey for 5 seconds</p><p>10:47 vision blurry agaiun, haard to focus</p><p>10:48 sweating everywhere now</p><p>Notice right nostril is running, going to mirror to see if drug in mucus, mucus looked clear looks blacks of pupils, dilated at 75% full dilation (if I am noting it right, the black part of my eye looks like it is a circle covering 75% of the surrounding brown color circle) even with very bright bathroom lights</p><p>13:15 hands very shakey, whole body sweaty, took another sip of water</p><p>14:00 feel odd, kinda sedated think might have adrenaline coursing through me / body doesnt know what to do with 4-MEC</p><p>15:20 still sweating burning in back of throat needs more water</p><p>Still wondering if this was high enough dose.</p><p>17:11 eyes blurry is a bit hard to focus, still sweating profusely, teeth clenching to point notice jaw muscle aching</p><p>Wonders if the come-up feeling at initial start to feel different was peak of euphoric activity, felt good while coming up to the point of feeling something before the sweats came on</p><p>19:52  breathing and hearts seem normal, still sweating profusely</p><p>20:40 feel like puking returned sipped water, nose burning a bit acid chemical taste in back of throat I appear to be getting used to</p><p>23:00 sweat feel very cool on skin, wonders how shower would feel but too lazy to turn on water move much.  Walking very hard</p><p>25:14 whole body feels very heavy, still sweating</p><p>25:15-52:00 suddenly had to projectile vomit, thought at first could keep it down  body gave one warning burp w/ upchuck in it. Vomiting is total buzzkill no more come-up feeling.  Spent last 27-mins cleaning carpet and bathroom, 4-MEC made me not really care / feel bad / annoyed at the task.  Body was sweating whole time, could feel sweat drops running down my face, when removed vomit stained shirt could feel sweat roll down my back and chest, very nice cooling sensation much enhanced by the 4-MEC. DO NOT EAT BEFORE TRYING LARGE QUANTITIES OF 4-MEC.</p><p>Noticed both nostrils slightly bleeding, not sure if from 4-MEC crystals cutting sinus membrane or putting straw too deep in nostrils or puke coming out of nose when projectile vomiting.</p><p>56:00 just drank a sip of water and a sweatbead rolled into my mouth, GOOD GOD DOES SWEAT TASTE SALTY ON 4-MEC  wonders if the extra salt he put on his french-fries at lunch 4 hours early contributed to sweat taste</p><p>Would really like to try the 250 (250 and wait for come-up and then redose the other 250) in each nostril again on an empty stomach and see what happens, maybe in 48 hours when I have another 8+ hour window to experiment with currently legal research chemicals.</p><p>74mins while type the above looked down at my crotch to see it also covered in vomit, decided to handwash shirt and shorts, sweat still coming out of body all over, felt kinda nice being naked and squeezing the soapy water and and out of the clothes, drank another sip water, acid burn feeling returned to throat,  right now feel like I just finished running a few miles at about a 7-minute-per-mile pace  definitely producing same amount of sweat as that run. Put new part of shorts and shirt on, body still sweating</p><p>82mins still sweating, wondering if the puke was my first-ever OD on a chemical, never snorted anything before, might be nerves or combination of newby / poking straw too deep / too much additive effect over the 2 hours and 5 mins of snorting the first to last doses.</p><p>90mins pupils down to 40%, eyes look more brown than black now, when doing again will see how far the black will grow in my eyes, body definitely clearing system of the 4-MEC.</p><p>92MINS- both nostrils feel raw / hurt when in breathe in through, breathing out tingles a bit / not as ouchie.  Feel tired / drained like I did a heavy workout on treadmill or stairclimber  seem to have sweated about as much as a workout, new shirt is very sweat stained, drank another 6oz of water</p><p>94mins since insufflating the 250mg in each nose, forehead starting to feel like a headache is building; this must be the dreaded crash / comedown starting to accelerate.</p><p>I have no desire to redose right like I have many cocaine and meth and mdma users report, wonder if would feel different if hadnt puked.</p><p>+96mins feel pretty relaxed / normal can deal with kids and evil wife if they walked in right now.  Check nostrils in mirror, no blood or caked-on blood visible inside nostrils, mustve cut the sinuses with the straw, dammit better eat tons of vitamin c to stave off infection.</p><p>+100 spoke too soon, just had a major involuntary teeth clench, head feels light body feels lazy / lethargic kinda like the calm I feel with a high dose of Kratom extract mixed in grapefruit juice, starting to hear deep breathing in head again</p><p>+110 got a phonecall, jesus phone ring sounded loud and made head hurt effint at&t cable internet sales, burning sensation in acid taste returning in throat and nose, nose feels dried out / crispy</p><p>+156mins feet still very sweaty. Head and body stopped sweating, still thirsty / drinking water when feeling like it.  Read reports putting 150mg up-anus in water via an enema is best way to get full body high may try that if insufflation on 100% empty stomach doesnt work / makes me yak again.  Very mild headache in frontal lobe of head so far. Hope this report helped any of you thinking of trying 4-MEC  So far not a positive experience.  Now that I know I wont sneeze and that it feels kinda groovy snorting-up powder I really want to find that pure gram of the superhardcore stuff and see what the rest of you out there have experienced.</p><p>[Reported Dose: '830mgs insufflated over 4-hours']</p>"
}
