{
 "title": "Mean and Clean",
 "author": "Mephistopheles Prime",
 "citation": "   Mephistopheles Prime. \"Mean and Clean: experience with Methoxetamine (ID 91939)\". Erowid.org. Jul 14, 2011. erowid.org/exp/91939",
 "substance": "Methoxetamine",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   "  T+ 1:10",
   "60 mg",
   "sublingual",
   "Methoxetamine ",
   "(powder / crystals)",
   "  T+ 0:00",
   "10 mg",
   "oral",
   "Methadone",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 91939",
   "Male",
   " ",
   "Age at time of experience: 42",
   "Added: Jul 14, 2011",
   "Views: 14778",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In later stages of slow detox off Methadone (current 10mg daily) But in reasonable health. Have not done any dissociatives for years so I doubt my tolerance is very high.</p><p>Setting:</p><p>I have the house all to myself for the next few hours. Practice guitar if I can, computer. Lots of experience with Psychedelics and Dissociatives... Never have had a bad experience on any of these 'cortical vitamins' even the scariest contained sacred gems of wisdom that made life more meaningful. I've done a lot of digital architectural work/graphic design with relevant training and designed 3d game levels </p><p>and some basic C+ programming. I've been a professional musician for years, but its currently on the shelf... Also have done a lot of reading and study around theology, mysticism, anatomy and brain biochemistry in an effort to keep as safe as possible when experimenting with altered states. I believe that a solid foundation in these disciplines helps provide a useful framework that can guide me back to familiar territory if needed. And it has. Many times. Knowledge and Faith can help to preserve sanity when one is exploring the edges of madness.</p><p>10:20am 5mg nasal allergy test  - No allergic reaction, just start of good vibes, so I progressed to; </p><p>11:30am 60mg sublingual</p><p>Started to feel a clean DXM-like come-on 10 minutes later. Within 5 minutes after that I was in a second plateau DXM -like state and rising! No nausea, very clean. On my way now.....hope to remember the experience! Typing then became impossible so the rest is from memory.</p><p>I think I may have blacked out for an hour or two while sitting in front of my computer trying to type. It was 2pm when I next checked the time!</p><p>Now in an incredibly dissociative state, I very quickly 'turned into an alien' and my hands felt too weird and far away to possibly play guitar! (Little electronic alien paws wiggling - craaaazy shit!) My hearing range moved up to higher and higher frequencies, and I lost the low ones completely. Picking up digital and radio signals with no radio or TV turned on in the house/nearby. Best way I can describe this is like the opening credits to the film 'Pulse'. I could see the data streams and </p><p>radio waves as well as hear some of them. An intense euphoria accompanied the vision.</p><p>Turned on FM radio and did a scan through some stations and ACTUALLY found a couple of them. I could hear the song playing via my radio as well as my expanded awareness picking it up! Due to the fantastic nature of the experience though it's impossible to discern the truth about this at the moment unfortunately. Next time may try </p><p>some tests with another person present to confirm.</p><p>Had an idea to try to create a 'Virtual Avatar' of myself mentally. To visualise this into a perceivable form I used the concept of quantum-level full resolution digital avatar such as in The Matrix, where the digital self has fully functioning  bio-systems mirroring that of the physical body. Sitting on my bed I visualised my Avatar standing next to me then my awareness transferred to the 'ghost'. There was something intensely electronic about the composition of my 'Digital' body. Looked a bit like the way Neo sees the Matrix, but I was made of white light. I strolled around the house trying to interact with physical objects but I was as insubstantial as a ghost. Thought I heard somebody knocking and this disrupted the experience.</p><p>Closed my 'eyes' and when I opened them again I was lying in my bed back in my body. Unfortunately from then on I kept expecting people to turn up and kept hearing them talking in the house. (I think this was just people in the neighborhood talking elsewhere) so I concentrated on trying to straighten myself up before I was seen shuffling around by visitors! Still buzzing till about 6:30 pm, I drank a lot of water and lay in bed listening to Opeth and smoking bud until I fell asleep. Slept soundly and woke at 8am, a little haggard but otherwise fine. Overall a positive on this one!</p><p>I cant help thinking that the little bit of Methadone in my system may have stopped me reaching the upper echalons of consciousness this time. I know from experience that high enough doses of psychedelics can break through opiate sedation, but the side effects from doing this are BAD. Thought I was dying last time I tried that. Lots of vomiting kind of ruins the trip.</p><p>Think I'll wait a while before trying M-ket again, but I rate this magical chemical very very highly!</p><p>It worries me a bit that kids or unstable types might get hold of it and that will ruin everything and lead to Methoxetamine being unfairly demonised and restricted, like what has happened with many drugs around the world. I for one will always treat it with the respect and caution it deserves.</p><p>*Oh and a friendly word of warning. Please DON'T take Dissociatives any more than once a week MAXIMUM. If you do you are most likely going to end up manic, and the over-confident, muddled thinking can trick a person into taking it more and more </p><p>then - addicted, which descends into HELL with suicidal depression. The stuff stops giving a good buzz and just kind of pickles the brain like long term alcoholic binge drinking. I know from experience years ago with DXM. I saw a few DXM users fall into this, and had it happen to me for 3 months. Took a long time to recover. Methoxetamine may be far less toxic than DXM or Ketamine, but I'd be willing to bet we can get into just as much trouble if we abuse it.</p><p>---------</p><p>SEPTEMBER 2011 FOLLOW-UP</p><p>Alright, time has passed and I've been able to carefully explore the limits of this completely new substance on average once a week, with doses varying between 50 - 100 mg. Absence of negative after/side effects and a couple of problem-free full medical/psychological check-ups have made me realize that MXE is VERY safe at these levels of usage.</p><p>First - a warning. Mixing higher doses with ANY amount of Methadone can prove very dangerous in a way, as it CAN depress breathing to a fatal level. I was lucky to have been with a sitter and he snapped me out of my catatonia with a slap around the chops and cold water to the face! What I saw in those few minutes of standing on the edge of the Abyss has changed my life forever. For the better!!! That said, I do feel lucky to have avoided any harm and I would not recommend people get too slap happy about taking MXE. Wouldn't it stink if the narrow minded 'authorities' decided to classify and illegalize it because of casualties due to careless use? (to preserve their P.R. standing and political votes -  not because they give a damn)</p><p>It is my firm belief at the moment that MXE should ONLY be used in conjunction with positive personal growth techniques such as Spiritually based (not religious....Spiritual) belief systems centered on Life and Love, and a burning desire to change one's life and to climb out of the self imposed hells of addiction and guilt.</p><p>In years past living under the agendas of other people's expectations had reduced my life to a tiny fraction of it's potential and the internal conflict was such that it drove me to heroin addiction - which is hell on Earth once you become dependent...</p><p>There are many decent enlightenment systems out there at the moment, but after much research I settled on Michael Jura's Remote Viewing Workshops and Burt Goldman's Quantum Jumping course.</p><p>All this activity has opened my eyes to a Brave New World of Truth and Holistic Health. It has allowed me to move beyond the tiny arena of Mundane game playing and Methadone addiction (legally prescribed) and re-kindled my love of Education, the Arts, and of course Sex!!!</p><p>PLEASE behave intelligently people - we may be on the cusp of a revolution here and legal Ethnogens being demonized by the ignorant will not only make them illegal, but will deprive a great many of the healing catalyst that is Methoxetamine.</p><p>[Reported Dose for Follow-Up: '100 mg']</p>"
}
