{
 "title": "Serious Problem",
 "author": "Yasmina",
 "citation": "   Yasmina. \"Serious Problem: experience with Ketamine (ID 91936)\". Erowid.org. Jul 23, 2011. erowid.org/exp/91936",
 "substance": "Ketamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Ketamine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 91936",
   "Female",
   " ",
   "Age at time of experience: 27",
   "Jul 23, 2011",
   "Views: 6017",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'm from and live in England. I'm a party girl and love dance music, clubs and drugs. </p><p>I loved K from the day I found it when I was 18 but back then found it hard to find. When I did it was fun. </p><p>When I was about 22 I made a friend that could get it more easily and we would enjoy it maybe weekly or every two weeks. Again this was fun and never really had any bad experiences. It was when I must have been 26 my friend stopped taking it and I set out to find my own source, and I did. From then on I could get K whenever I wanted. Fabulous! I was very happy! Me and and the now ex would get K every weekend, sometimes mid week too (for a treat!) We were very, very happy. Life had never felt so good! Aparently K is an antidepressant. Sex was good, life was a giggle. The worst effect we felt was being tired some days, but the tired I would feel the next day was a really happy, sleepy tired. Tired never felt so good!</p><p>My non drug taking friends started to notice I was on drugs much of the time, I started acting out of control when drinking, people wondered how I had lost so much weight. I didnt care. That was their problem, not mine. I started taking K daily, a nice big line for breakfast then drive the car to work! Get home then more K. Started taking GHB too and falling asleep at the wheel. Still very happy, friends are NOT happy but screw them, they don't understand. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>Anyway, I thought K is not addictive, turns out if you spend a year constantly snorting it every hour you are not at work, it is. I would end up with the worst, most painful abdominal cramps that result in being taken to hospital in an ambulance, screaming in pain having overdosed, it is. My body being covered in a rash that burns and itches like crazy after the unbearable stomach cramps, it is. And after each OD I would still crawl back to the dining room table where I left my lovely pile of ket and still couldn't resist shoving it up my nose, then, that my friend is an addiction.</p><p>I could bleat on all night about this but I wont and just think if people are using K daily and not yet seeing the down side then maybe they might take it easy after reading.</p>"
}
