{
 "title": "Fractally Intricate Tendrils of Ecstasy",
 "author": "sakithin",
 "citation": "   sakithin. \"Fractally Intricate Tendrils of Ecstasy: experience with LSD, DMT & Salvia apiana (ID 92016)\". Erowid.org. Jul 25, 2011. erowid.org/exp/92016",
 "substance": "LSD, DMT & Salvia apiana",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "sublingual",
   "LSD",
   " ",
   "  ",
   "smoked",
   "DMT",
   " ",
   "  ",
   "inhaled",
   "Salvia apiana"
  ]
 ],
 "footer": [
  [
   "2011",
   "92016",
   "Not Specified",
   " ",
   "31",
   "Jul 25, 2011",
   "Views: 2363",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This experience occurred on a Sunday, so in the expectation that I'd need some time to sleep and recover before work the following day, I sought to take my LSD at 10am. I was a little slow starting my day, so I didn't actually dose until 10:30.</p><p>I was hosting a psychedelic picnic for the day, and two of my guests had already arrived (D, and her partner S who was planning to observe the picnic sober). My psychedelics were in my storage locker, so I was dosing there. My locker-neighbour (PG--an aging machinist with a homemade 2-chamber water pipe in his locker) was at his locker, so the three of us chatted as I began to come up.</p><p>D was interested in taking 2C-E for the first time during the picnic, and we discussed my concerns about the reported difficulty of the substance, and that her difficulties might spill over into my trip. She opted for a lower dose. At some point in the conversation, I decided to withdraw into my thoughts for a few moments to cope, looked at a nearby bush, and had a ++++.</p><p>Shortly after this, we headed to the meadow where the picnic would be taking place, realized that there was no propane (we had a camp stove and a double boiler full of chocolate chips for the enhancement of our seasonal fruits). I phoned another guest (PH) and asked him to pick up some propane on the way over. Most of the guests weren't expected to arrive until around 1:30-2pm (and by this time it was closing in on noon). I was a little anxious that people would flake out, but PH getting propane was reassuring, so I was better able to enjoy my trip.</p><p>A neighbour-family with whom I wasn't terribly well acquainted came by, and I showed the daughter how to play on the playground-type object that I had made and brought. This put me a little on edge, but once they left, D and S assured me that I had probably passed for sober.</p><p>After being reassured, I decided that I was near enough to the LSD peak, and on the descending side of it (it was now a little after 1pm), which was my planned condition for taking the DMT.</p><p>I had selected a tree-ringed, flat-topped knoll deeper in the meadow as a suitably magical site for the combination, and asked D to accompany me there. The path through the meadow to get there was somewhat winding, and passed behind a cluster of vegetation just before turning in to the knoll. The vegetation was lush, and the day was humid enough to look almost, but not quite misty; this enhanced the magical appearance of the site as we approached, and I commented on the teasing, seductive nature of the path leading to it. I was still a little anxious about having a good trip, since my most recent breakthrough dose of DMT had been difficult (though all but one of my more recent sub-breakthrough doses had been quite lovely).</p><p>I entered the site, and began to set up my materials. I keep my DMT pipe wrapped in an emproidered white linen placemat, inside a box that also contains a lighter, a glass vial of my DMT, and some other materials. I laid the placemat over the box like an altar cloth, loaded the pipe, placed it on the cloth with the lighter and then got up to go and pee (as I frequently find that if I do not pee before taking DMT, I have a hallucination that I've peed myself, and it detracts terribly from the trip).</p><p>While peeing, I was awed by the beauty of the lush vegetation of the meadow, and the stand of birch trees which I was facing. I realized that I was peeing in the exact same place where I had been peeing when I had had a ++++ moment on 2C-I the previous fall (that trip was also reported) and had another ++++. I decided that this was a favourable omen, and mentioned it to D upon returning to the pipe. While I was doing this, she showed me that she had cleaned all the residual soot off the outside of my pipe. It was now quite clear that there was enough residue on the inside of the pipe for loading not to have been pharmacologically necessary, but I had still felt it to be ritually necessary.</p><p>After this, I lit a couple of white sage leaves that I had brought along, wafted them under my nose, smudged my immediate surroundings, and placed them on one of the stones of the nearby fire pit to continue smouldering while I took my trip. The smudge removed any lingering anxiety quite effectively. </p><p>I put the pipe in my lips, lit the lighter, held it to the pipe, inhaled the DMT, held it, exhaled, and then lay on my back. I became immersed in cosmic light, caressed by fractally intricate tendrils of ecstasy. I could feel, hear, or somehow perceive myself moaning in a pan-sensual quasi-orgasmic delight (though when I asked D about it later, she told me that I was silent then entire time).</p><p>As I began to withdraw from the DMT sensorium, I could make out the tendrils of ecstasy transforming into the branches of the trees ringing the knoll, and the cosmic light diminished to the blue brightness of clear, early afternoon sky. I gave a brief description of my experience to D and repacked my materials while waiting to recover enough to stand up. I exited the knoll by the slightly more direct and more barren path back to the picnic site, and returned to picnicking.</p><p>Some number of hours later, I found myself experiencing the phenomenon I'd heard described by some other friends who had tried this combination before, where the marvels of the (tail of the) LSD trip seem considerably less marvelous. Also notable is that while taking the DMT, I didn't experience any of the caustic/painful sensation which I normally associate with the practice (probably an analgesic effect of the LSD, similar to my inability to perceive the hotness of spicy foods while tripping).</p><p>After-effects are not really reportable owing to the consumption of additional substances during the remainder of the picnic.</p>"
}
