{
 "title": "Worst Night of My Life",
 "author": "CasualAbuser",
 "citation": "   CasualAbuser. \"Worst Night of My Life: experience with Products - Bath Salts, Plant Food, etc. ('White Stallion') (ID 92062)\". Erowid.org. Aug 30, 2011. erowid.org/exp/92062",
 "substance": "Products - Bath Salts, Plant Food, etc. ('White Stallion')",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "92062",
   "Male",
   " ",
   "28",
   "Aug 30, 2011",
   "8666",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  </p><p>I first heard about bath salts from a friend who told me the drug was similar to adderall & cocaine. Of these two, I had only ever done adderall. So, I purchased a small container of 'White Stallion' bath salts from a drive-thru. I stuck a straw straight in the container and took a decent sized snort (no idea of the dosage). For roughly the next 2 hours I felt great. I was speeding damn good, similar to a high dose of adderall but more euphoric. I felt on top of the world, extremely alert, and euphoric. It was a GREAT feeling. So great, that while I was peaking I told myself that I would have to control myself with this new drug--it was legal and thus easily accessible, and I loved the feeling it gave me. I began to think about how I will have to have some serious self control over abusing this stuff or else I might blow all my money on it, or end up cracked-out-addicted.</p><p>The experience then took a gradual, but intensely strong twist.</p><p>After about 2 hours the speeding feeling was pretty much gone. Instead I began to feel paranoid, agitated, and odd. This was much more than a simple downbuzz. Before I knew it I had become a different person, and I cannot say that any better. It was AWFUL. I was extremely agitated and depressed (for NO REASON) and could not focus on any one thing or hold a single thought for more than a minute. The 'coming down' was more intense than the high.</p><p>I was biting my lips like a madman (similar to meth I hear). I put every ounce of effort I had into trying to stop this. I would have to solely focus on refraining from biting my lips in order to not bite them. With hundreds of paranoid thoughts racing through my mind, I would start biting again within the minute. I attempted to stop biting my lips at least 100 times. I had lost control over my thoughts and remember thinking, 'I could see someone easily committing suicide while experiencing this.'  After about 2 hours of battling this indescribable paranoia, I decided to try to just sleep it off. The battle continued for at least another 1.5 hours in bed before I finally fell asleep. While in bed, I remember giving up on trying to snap back to my old self. I had tried everything imaginable to return to normalcy with zero success. There I laid in bed, calling it quits and just praying for morning to arrive quickly so that I could feel normal again, like myself.</p><p>I had only got about 4 hours of sleep since I had to get up early for work. I felt much better that next day, but still more unhappy and strange than I typically am (I'm actually a pretty happy guy). After work I threw out the rest of the salts, for I would never think about doing them again! The high certainly was great, and if the downbuzz was not so horrifying I would probably use salts every week. It was incredibly eerie. I had never felt so unlike myself and so terribly frightened, agitated, and paranoid. I lost all control on that down buzz!</p><p>I have read about other people having a good time on salts and only experiencing a mild, tolerable downbuzz. But I do not recommend them to anybody, if that's not obvious by now haha. Seriously though, it was the worst night of my life and even though it happened over 3 months ago, I almost get chills when thinking about that night. If you're thinking about trying this drug and think it may be safer since it is legal, at least do some more research before you make the choice. I am definitely not the only one whose gone through the hell of bath salts.</p>"
}
