{
 "title": "Potent and Long-Lasting",
 "author": "Revelator",
 "citation": "   Revelator. \"Potent and Long-Lasting: experience with JWH-122 (ID 92117)\". Erowid.org. Jul 26, 2011. erowid.org/exp/92117",
 "substance": "JWH-122",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "JWH-122",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 92117",
   "Male",
   " ",
   "25",
   "Jul 26, 2011",
   "Views: 9553",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background on me Im an artist living in New Zealand, where cannabinoids are now class D, which means anyone over 18 can purchase and consume them. Cannabis is class C, weird laws, but great for consumers. I got this in the mail from the USA. </p><p>I have tried the mainstream things a huge amount of pot am in my twenties but have had far too many exp too name with a huge range of substance. Im very well educated in there usage and effects, anyway previous to this I have had not pot in a year smoked the incense occasionally and now with the pure chem...</p><p>T>00  take 2 hits of JWH-122 and mint blend. Pipe was metal bullet one. I put roughly 5-10mg of the compound in.</p><p>t- 5 coming on strong a lot like JWH-018. General stimulated stoning very much like sativa cannabis. Anxiety is present this dose is too high for a beginner this is strong in your face high. My mind is racing being chased by a general anxiety in my head. Is something wrong? Nothing is this dose was too high for a comfortable stone. Use 3-6 mg next time. A lot stronger than JWH-073 and JWH-018 in effects, Im totally blasted. </p><p>t- 10-  A++ rising euphoria reality is blinking in and out very strobe now its more euphoric. Its quite like a longer lasting JWH-250. The same trippy feeling coming up but now its leveled to a nice stoned body relaxed. Music sounds good. This is pretty strong cannabinoid. It feels like a higher dose of the usual ones. Im interested to how the duration is on this one. No dry mouth but anxiety as parents are headed home. I cant be stoned here. Feeling passed. No red eyes. Few. And its like strong herb, like  my first experience with weed not knowing what would happen. </p><p>15- mins  more body stoned some audio hallucinations. Its still going up. Its hard to type now. </p><p>40 mins  very high, scared,  its very potent not like hallucinations just my mind is in overdrive. Slight body high, chest pressure and slight pain left of chest. Hmm will research that. </p><p>Well chest feeling weird, heart ok. It seems common but also this was a higher than usual dose. I wanted to see the pronounced feelings this gave. Also I hate not having a scale. This is settled to a very body high music sounded awesome. Trippy high its up down up. Thoughts are scattered eyes feeling heavy fingers way colder. The experience and duration is very surprising as Ive tried most the other JWH-. Its been 1 hrs since the pipe it feels like 10 hours later. Its dying down now. Its like a medium mellow high. Still euphoric eating cornflakes is better than usual. Mind a lot more relaxed now.</p><p>1.30 hrs. Well, conclusion: its like a sativa indica strain very potent long-lasting more potent than JWH-018 or JWH-250 by weight. A mind stimulated chem at first then settles to a nice relaxed body stone. Not too much euphoria but a strong stoned feeling. Its still going on so duration is a good one. Does have some physical effects like chest pain that worried me but it was a lot to do with dose so aim low with this one to avoid Im guessing a lot of physical discomfort.</p>"
}
