{
 "title": "Disturbing",
 "author": "Andy Gara",
 "citation": "   Andy Gara. \"Disturbing: experience with Salvia Divinorum (ID 9212)\". Erowid.org. Jul 4, 2005. erowid.org/exp/9212",
 "substance": "Salvia Divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "0.5 g",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9212",
   "Male",
   " ",
   "Not Given",
   "Jul 4, 2005",
   "Views: 3477",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nFirst experience with salvia occured in a very familiar and comfortable environment, surrounded by individuals I know well and trust. Salvia smoked through a bong, and entirely burned up within one hit. Very easy to smoke and retain in the lungs: I hold it in for abour twenty seconds. Ten seconds later I seem to mentally black out in some way. I look around the room, and I fail to recognise where I am, who I am, who these people around me are and what time it is. This - reality - feels like a dream from which I am waking up. I feel very slightly paranoid, which I should point out is extremely unusual for me. Next comes a very strange sense of being displaced and trapped within my own body. This is all too much and I cover my eyes with my hand in an attempt to catch my bearings. I open my eyes again and I appear, for a very brief moment, to be hanging out of, or in, my body at an unusual angle. Depth perception is very mildly distorted. I'm now starting to remember where I am and who I am, although everything around me appears to have happened in the past. I feel extremely and uncomfortably warm. The effects have worn off within five minutes, although during this short time my perception of time had converged and collapsed. No real enhancement or alteration of visuals, and music sounds no different during this experience. Overall, neither pleasent nor unpleasent. Just very wierd. I have no desire to repeat this experience any time soon, and I can't imagine anybody wanting to use this substance with any degree of regularity.</p>"
}
