{
 "title": "Just Delightful",
 "author": "Zeke Ralston",
 "citation": "   Zeke Ralston. \"Just Delightful: experience with 2-CB (ID 92169)\". Erowid.org. Aug 14, 2011. erowid.org/exp/92169",
 "substance": "2-CB",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "2C-B"
  ]
 ],
 "footer": [
  [
   "1979",
   "ID: 92169",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 14, 2011",
   "Views: 11596",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[This report originally appeared as a typewritten page pasted into Book 3, pages 346 of the Shulgin Lab Books.] </p><p></p><p>REPORT OF EXPERIMENT WITH 2-CB</p><p>Date: December 2, 1979</p><p>Participants: Maggy and Carl N, Elizabeth and John, Jake, Zeke and Holly Ralston</p><p>Dosage: 16 m.g. for Elizabeth; 20 m.g. for all else</p><p>Start: 11:00 A.M.</p><p>I noticed the first alert in about 15 minutes when I went outside to let the dogs out of the car for awhile. It came on in levels: I would notice some effects, and they would level out, then a higher level would come on and level out, and so on. In 30 to 40 minutes the effect was quite intense. Then I would be surprised to find it mounting to still another level. After an hour or so, I began to wonder just how high it would go. The effects in general were quite euphoric, bringing enhancement in light, energy, and aliveness. However, for the first hour I suffered from an underlying tendency toward nausea. It never became pronounced, but lies in the background. I also felt some other rumblings which kept the experience from being as purely euphoric as had been the MDOH experiments.</p><p>However, there were many wonderful aspects to the experience. Walking in the back yard around noon was delightful. The warm, supportive feelings from the other members of the group were marvelous. Colors were beautifully enhanced. Maggy looked marvelous, and the color of her clothes and styling seemed perfectly chosen for the occasion. Everyone looked bright and alive and euphoric. The feeling going inside was most pleasant. This would have been nice to explore, but I preferred to stay in touch with the others. We had many wonderful discussions, full of humor and insight. Many times I experienced that marvelous place when minds are working creatively together, uncovering new insights and understandings, which is the most enjoyable and rewarding part of good communication. At 1:30, no one could believe such a short time had expired, as we seemed to have been together and experienced many, many hours.</p><p>The experience kept growing in intensity for me until about 2:00 p.m. Up till this time, there were some underlying unpleasant feelings. These began to wear off leaving the purely peaceful feeling of contentment going with good friends. Carl talked about being hungry between 2 and 3 p.m., but I had absolutely no interest in food. Carl was extremely alive and outgoing, and I couldn't help but appreciate the progress he has made since we first met him.</p><p>Later in the afternoon we took a long walk through Tilden Park. It was just delightful. Everything was beautiful; we were blessed with a nice warm afternoon, although foggy. We all had a marvelous time walking and visiting and enjoying nature.</p><p>We came back to marvelous meal which we all enjoyed very much. Everything tasted exquisite. We spent a leisurely evening, reluctant to break the circle. We finally left around 9 p.m. I drove us back to Woodside, with no strain or tension, must less tired than after the MDOH experiment at Maggy and Carl's The after-affect was marvelous - a general feeling of aliveness I felt for several days after the OH. Driving back to Barstow one week later, we still very much felt the effect of the experiment, and our journey was very enjoyable and enhanced in many ways.</p>"
}
