{
 "title": "A Happy and Fluffy Afternoon",
 "author": "Purple Grass",
 "citation": "   Purple Grass. \"A Happy and Fluffy Afternoon: experience with Codeine & Cannabis (ID 92249)\". Erowid.org. Jul 22, 2013. erowid.org/exp/92249",
 "substance": "Codeine & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "220 mg",
   "oral",
   "Codeine",
   "(extract)",
   "  T+ 1:30",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2011",
   "92249",
   "Male",
   " ",
   "22",
   "Jul 22, 2013",
   "1353",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So, I'm 22 and since my teens have dabbled occasionally in common psychedellics and stimulants, with some experience with opiates. I have come to favour cannabis and MDMA but have had meaningful experiences with LSD, Psilocybin and once with DMT (it was a strange but very interesting experience with a big existential tinge that I will likely not repeat). Anyway, I was using codeine in my late teens on occasions, mostly in the autumn and winter months as I found it to be a very pleasant remedy against seasonal depression. I was always considerate of the potential for addiction and of course the risk associated with extracting codeine from co-codamol tablets (it is a good idea to learn how to do a Cold Water Extraction properly). Thanks to being cautious, I have happy memories of fluffy and peaceful days goneby. </p><p>On to the experience: I was home from university for the summer and had agreed to look after someone's house while they were holidaying in Spain. It was a nice victorian terraced house in zone 4 in London, which is a fairly slow-paced area for such a big city like London. I had to spend most of my time in the house, as there were cats who needed to be fed twice a day - they seemed to only be around when it was feeding hour. I wasn't bothered by all this, as I had planned to set up my home studio there and spend a couple of weeks focusing on music - actually, it was a perfect situation. Well, with all this time spent inside, I naturally sought about getting some things to alter the experience there. I met up with a friend one morning and she kindly made sure I had plenty of ganja. On the way home I walked past a chemist and it occurred to me to purchase some co-codamol as well, since it had been about half a year since I had last drunk an extraction. Anyway, back at home I was ready to make some music and fancied seeing if codeine could be of any help, so I made an extraction immediately by crushing 32 (8*500) pills into a fine powder, and then dissolving it in 100mg of cool water with the resulting solution being filtered through kitchen paper). I lost a small amount of solution when I poured it through the filter, but still estimate that I had approximately 220mg of codeine and a non important amount of paracetamol in the final product.\r[Erowid Note: 220 mgs of codeine is considered a high dose, see Codeine FAQ] </p><p>My mindset is calm and pleasant. </p><p>4pm - Drink solution, which turns out to taste quite bitter.</p><p>4:30pm - The effects have been building for about 15 minutes and by now they are very noticeable. They are like an all over body-fuzz with warmth and relaxation floating around me only to taper off in to calm and lack of worry briefly before returning with slightly more intensity which brings mild to moderate euphoria. I sit and enjoy, talking on the phone for a bit and using the laptop. </p><p>5pm - By now I am very relaxed, still happy and can feel the effects have yet to reach their peak.</p><p>5:30pm - The peak of the effects brings an exciting but calm outlook on life, with desire and interest in it, without the actual worry of trivial matters. It is clear that this is a very doable drug, as it is not soul destroying or energy draining like stronger opiates are thought to be, but better described as confidence inspiring and focus giving. Yes it is a depressant on the respiratory system and doesn't make me want to operate at 100mph and chat for hours like a stimulant might, but it does certainly not affect my ability to walk and talk around and get on with my day - but I wouldn't drive on it. It's once again apparent why I do this drug on occasion. Respect for its addiction potential is given and I light up a joint, which welds a stone and an opiate buzz together very well and just seems to increase the warmth and euphoria.</p><p>8pm - The effects are a lot less noticeable now, but there has been such a gentle decline that it leaves me feeling acclimatized and orientated. There is a lovely afterglow for a couple of days usually, and sometimes going to the toilet might not be possible for a day afterwards. There was definite positives to the music making process as well, but this is only a subjective conclusion on one instance.</p><p>All in all it is a very nice, pleasantly subtle mood lift sandwiched between warmth and fuzziness which is easy to enjoy and integrate, but needs more attention directed at not using it too frequently. It is also an incredibly cheap and convenient way to treat the spirit.</p><p>I hope this has been helpful, peace!</p>"
}
