{
 "title": "Driving for 24 Hours",
 "author": "rossifer",
 "citation": "   rossifer. \"Driving for 24 Hours: experience with Adrafinil & Sleep Deprivation (ID 92261)\". Erowid.org. Feb 8, 2012. erowid.org/exp/92261",
 "substance": "Adrafinil & Sleep Deprivation",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "900 mg",
   "oral",
   "Adrafinil",
   "  T+ 11:00",
   "900 mg",
   "oral",
   "Adrafinil",
   "  T+ 22:00",
   "900 mg",
   "oral",
   "Adrafinil"
  ]
 ],
 "footer": [
  [
   "2011",
   "92261",
   "Male",
   " ",
   "40",
   "Feb 8, 2012",
   "4287",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: Driving while intoxicated or sleep-deprived is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>I needed to drive a truckload of possessions from San Antonio to Los Angeles quickly, and I did not want to cross the desert in Arizona and New Mexico during the day, so I resolved to push straight through with the help of modern pharma.</p><p>I normally take 600mg adrafinil on 'hard to wake' mornings, so am somewhat familiar with it's effects on me, including the ability to focus and feel more awake.</p><p>The morning of the drive, I slept in until I naturally woke, ate a savory breakfast with a large coffee.</p><p>Started driving and took 3x300mg adrafinil at 10:00am (all times will be Texas time unless otherwise specified).</p><p>Late lunch (can't remember what I ate) at 2:00pm.</p><p>Burger/Chili for dinner at 8:00pm.</p><p>Truck stop coffee at 9:00pm, but I began to notice my eyes feeling heavy after getting back on the road.  Since adrafinil seems to have about a 12 hour effect, this was expected.  Took 3x300mg adrafinil at this time.</p><p>30 minutes later, I'm back to smooth cruising again with good focus.</p><p>Overnight, I was snacking on sliced cheese and salami.</p><p>At 3:00am felt tired but not very sleepy.  Found it difficult to concentrate on the audiobook I was using for entertainment.  Took 3x300mg adrafinil immediately.</p><p>3:30am tiredness retreats, but I'm definitely feeling jittery and have an unexpected burst of nervous energy.  Now I'm not very focused on the road, but it's because I'm focused on EVERYTHING.  All trash in the truck got cleaned up and I almost tried to reorganize my backpack on the seat next to me but held off.</p><p>The sky started to brighten as I crossed the California border, and around 8:00am (6:00 PDT) I had a huge yawning fit where I was a little apprehensive that I couldn't clearly see the road while yawning.  3x300mg more (the last dose).</p><p>10:00am two egg McMuffins for breakfast and more coffee (incidentally, these are the only two McDonald's food products that I'll eat).</p><p>Arrive at home at 10:00PDT.  I feel tired and expect to crash, but I pop open the back of the truck to show my wife the contents, and I'm taken by an irresistible urge to pull down a box and start unpacking.  By 1:00pmPDT I've unpacked half the truck, moved a bunch of furniture into the house, reorganized garage storage and several bookcases in the house, etc.  This was a significant manic episode, but highly controlled and not at all chaotic.  Each time I completed a task, I wanted nothing more than to find the next task and jump on it immediately.</p><p>Began to crash during dinner with in-laws at 7:00pm PDT.  Stayed awake until 10:30pm PDT with only moderate difficulty, woke at 7:00am PDT feeling very sore all over but otherwise completely normal.</p><p>Conclusion and warnings.  I'm probably a moron and you shouldn't do this unless you know what you're doing.  Driving while sleepy is about as dangerous to you and others as driving while drunk.  Even so, as long as I remembered to bring the adrafinil, I would feel comfortable repeating this experience after several days of regular sleep.  The adrafinil allowed me to fend off sleepiness to the point that except for a few minutes during the yawning fit in the morning, I never felt unsafe.</p>"
}
