{
 "title": "AMT with Friends and Loved Ones",
 "author": "Noj",
 "citation": "   Noj. \"AMT with Friends and Loved Ones: experience with AMT (ID 9238)\". Erowid.org. Sep 5, 2001. erowid.org/exp/9238",
 "substance": "AMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "AMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9238",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 5, 2001",
   "Views: 10971",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAfter reading post of this drug I was weary to even try it.. a few of my friends tried it said it was like nothing you've ever done before a mix of coke, rolling, and acid.  Never doing coke I didn't now what to expect.. <br>The Setting was a country home in the back woods where you can hear only crickets at night. We  dosed about 8 o'clock. prior to this experience we thought ahead and bought some toys we thought would entertain us.  2 photon lights  and an electronic fortune teller.  After we dosed we realized we may need something to drink so we all gathered in one of our cars and took off.  Me being the light weight when it comes to drugs started feeling affects about 20 min after I took it.. My stomach was ill feeling just as if I was about to start rolling .  I bought water and a Grape flavored Gatorade hoping the flavor would make me stop thinking I was going to puke.  We arrived back at the house rolled up a joint and started smoking.. A few times I had to stop and think to myself 'Just puke get it over with you'll feel better.'  But it never happens...<br>hour 2<br> I laid on the futon they had sitting in a dark room with all sorts of lights playing Ragga Jungle and playing with my mediation balls  which I found to be very relaxing. After about a half hour of my sickness went away and I wondered out of the room and the intensity got greater... I picked up the photon lights and started the usual figure 8s you know doing the things you see at raves.. Trails were very intense they would almost put you in a daze like you were rolling. I started seeing trails on everything that had light.. I looked out onto the country side and it was as if it was still light out side. Hours seemed to be minutes and minutes seem to be hours.  After a few more bowls we all sat down and watched South Park. The episode where Mr. Garrison does drugs,  'Drugs are bad, Don't do Drugs.. .ummmmm k' This put all of us in a such a laughing state we could barley control our selves. A few times we would pick up that fortune ball and ask it a serious question.. the ball seemed to be almost alive answering my questions with the answers I wanted such as 'is this drug going to change my life' it answered 'YOU BETTER BELIEVE IT'. After the show we started to just talk.  To me everything seemed to be in an endless loop.  We could talk about one thing and you'd see what was goin on from their prospective as if you understood what was goin through their head... Jokes were made things were said but everything seemed to be in an endless loop everything came together as if it was supposed to.. It was like this drug opened my Mind to a door that was locked before... 6 hours into it we were still awake but feeling as if we were coming down.. I did start to get a huge headache like a bad hangover.. so my female companion looked at me and said 'You know what you always tell me is the best remedy for a headache.' well what I always tell her is sex will cure a headache.. so we say good night to our friends head to the room we are staying in and start to make love.. Lemme tell you this is an experience like no other.. if this would have been acid I would never have thought of doing this nor would I if I was coming down off X.. but AMT made every touch sensual every feeling 10x what norm would be.  After about a half hour or so  I felt the need to let it go... so I do as I normally do but nothing came out... Let me tell you I had the feeling of busting a nut like no other but nothing came out... was AMT playing tricks with my mind?  I don't know... that had to be the strangest thing that happen to me that night.. after that.. of course I passed out just like I always do.... My companion said she didn't get to sleep for another hour or so but I was unconscious to the world I had at least 100 different dreams that night.. We woke to the smell of a nice warm breakfast but it was around 1 pm Sunday afternoon.. Sunday was rough didn't accomplish much we ended up going to bed around 1am Sunday and waking up around 1pm Monday... AMT.... a drug that opens doors? does this drug do things like this to everyone? Could this be the drug that people with relationship problems should go to?\n\n\n"
}
