{
 "title": "My First, My Worst",
 "author": "anonymous",
 "citation": "   anonymous. \"My First, My Worst: experience with Cannabis & Amanitas (ID 9239)\". Erowid.org. Jun 29, 2004. erowid.org/exp/9239",
 "substance": "Cannabis & Amanitas",
 "bodyweight": "148 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Amanitas",
   "(tea)",
   "  T+ 3:00",
   "9.0 g",
   "oral",
   "Amanitas",
   "(plant material)",
   "  T+ 5:00",
   "8.0 g",
   "oral",
   "Amanitas",
   "(plant material)",
   " ",
   "  ",
   "smoked",
   "Amanitas",
   "(plant material)",
   " ",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9239",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2004",
   "Views: 20300",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend got about 1Lb of mushrooms one day and we have been waiting them for so long. So we started taking them at 2:00 p.m. We first started off boiling about 14 grams and then drank them. After that we smoked 2 bowls and just chilled out and played guitar waiting for something to happen. We played for about 3 hours and nothing happened except the effect from the marijauna. So I gobbled down another huge cap which weighed about 9 grams, b/c I had to go home for a bit to get some stuff and eat some food. </p><p>By the time I got back to my friends house which was around 7 I still didnt feel anything from them. So we didnt think anything was going to happen so we ate more, well I did. I ate another huge cap that weighed about 8 grams and about 3 stems and smoked a bit of one. Then we had some fiends over and smoked about 4 pipes and a bong. We were all just chillen having a good time and the shrooms havent effected me at all yet. A bit later my friends left and me and my bud decided to watch a movie, wrongfully accused which was mad funny. And in the middle of the movie we were laughing histerically at it. My body was totally relaxed and I didnt want to move. At about 10:30 P.M. the shrooms kicked in and it kicked me so hard. I wasnt really feeling anything except just feeling like I was really drunk. But then my vision got so blury I couldnt even see the T.V. which was kind of funny at the time but at around 1130 my vision got so bad I couldnt see past 6 FT in front of me. </p><p>15 minutes later I decided to go home and chill out. So I got home and everything was so dizzy and blury. I couldnt take not being able to see anything so I found my way to my bedroom and turned on all my blacklights and looked at all the stars all over my room, which I could barley see so it was all like a big glowing wall. As soon as I turned all of my lights off and tried to sleep my mind was going crazy. I was sweating so much my sheets were soaked. As soon as I shut my eyes I thought I had to kill myself in order to fall asleep. I saw my body leave my body with colors like a rainbow all around flying away and not knowing if it was gonna come back. I thought that if it didnt come back I was going to die so I mentally was looking for my body all over. Then wack it came back to me and I was like what the hell, I thought it was back but it really wasn't. </p><p>Then I mentally saw people standing on peoples hands one after another which was what the world was made of when I saw it. Also I saw my body like it was made up of throw up, in which I had to throw it up to make myself fall asleep. I dont know why I was thinking that, it was like my body was telling me I had to throw them up so I couldnt stand it anymore and and it made me throw up all over. I couldnt believe what was happening to me. I was going to go and call 911 for myself because I was goin crazy and didnt think I was going live through this. When I was leaning over the toilet to throw up too I saw it in there before it even came out. It was such a horrible experience for my first trip. After all of the puking I still didnt think my body was back so in my mind I was walking all over the place entering other peoples bodies b/ I thought they were mine. There was so much more but half of it I cant even explain the shit I saw. I hope no one else experiences what I did.</p>"
}
