{
 "title": "Dizzy-Hood-Over-Head-Descending",
 "author": "Alexander Shulgin",
 "citation": "   Alexander Shulgin. \"Dizzy-Hood-Over-Head-Descending: experience with DMMDA (ID 92428)\". Erowid.org. Sep 9, 2011. erowid.org/exp/92428",
 "substance": "DMMDA",
 "bodyweight": "",
 "header": [
  [
   "DOSE: T+ 0:00",
   "18.3 mg",
   "oral",
   "DMMDA",
   "(powder / crystals)",
   "  T+ 11:00",
   "  ",
   "oral",
   "Alcohol - Hard",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 1962",
   "ID: 92428",
   "Gender: Male",
   " ",
   "Age at time of experience: 37",
   "Added: Sep 9, 2011",
   "Views: 4044",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[This report originally appeared as handwritten notes in Book 1, page 40 and 52-53 of the Shulgin Lab Books.]</p><p></p><p>DMMDA</p><p>Date: Sept 25, 1962</p><p>Subject: Alexander Shulgin</p><p>Observers: AO, AQ, AP</p><p>Dose: 18.3 mg (0.2 mg/Kg) (6:50 AM)</p><p>At 0.5 hrs drove to Pittsburgh - no indication of nausea or any peripheral symptoms. Aided Sue with a distillation - seemed to gradually become intoxicated. 1.5 to 2.5 hrs. talked with AP, Teri, Sue, others - distinctly wound up and intoxicated. 2.5 to 3.0 hr. spend in driving back to Walnut Creek. Wild drive. Feeling of speed of car not accurate - would observe mountain moth motions, overlay of scenery as my car's elevation changed - philosophized on all relative motion (advancement, retreat, ascension, decline,) completely dependent on motion of observer as well. Then I would think to watch the road again, etc. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] From 3.0 to 4.5 hrs. this high period persisted. My actions must have been noticeable but no one commented. During period 4.5 - 5.0 there was a noticeable drop off of intoxication and was able to play a very acceptable game of bridge 5 - 5.5 hrs. The knowledge of 'not-being-me' lasted on, however, and at 9. hrs I drove home. This drive was still a little detached and unreal, but was nevertheless under control. A martini at 11. hrs. completed the work out - no after effects, no sleep problems.</p><p>This is a marginally active dosage of what may be quite a CNS or psychotomimetic drug. Must approach higher dosages with caution.</p><p>This drug showed several effects that are best explainable in terms of TMA and of mescaline.</p><p>The overall effect, described as 'dizzy-hood-over-head-descending' is directly from TMA. In it one has good vision, good sense of hearing, and can think and talk satisfactorily. It is that something all around you, possibly over you as well, is restricting you, from the world. An extremely loud nose, deafeningly loud, which you can't hear. One may sit for a while, be aware of being able to think well, no problems, to stand up with the stated conviction that the whole thing is psychosomatic, an imaginary illusion, but there it is - the DHOHD all around you. True, you can't hear it, see it, feel it, but you know it is there - no one else around you is ever aware of its existence. With MMDA-2 it was there for a couple of hours. With TMA it appeared and actually closed in on me, eventually to the point of threatening to cut off my vision and my hearing. Perhaps with MMDA-2 at higher dosages it may close in too. If so, watch for TMA-like hostility.</p><p>One thing must be said for this 'hood-effect'. It in certain ways insulates you from extraneous distraction, if you want it to. Admittedly, sounds, sights come through, but you can ignore them - at higher levels, without doubt, you will have internally generated sounds and sights to help distract. Perhaps this is a valid imitation of initial schizophrenia.</p><p>The philosophical flexibility and wit were very reminiscent of mescaline intoxication. As recorded in my notes 'my mind won't concentrate on my chemistry'. Actually this was said because I wouldn't trust myself to correctly weigh out several samples of a material in the lab, for aqueous screening - I couldn't be sure of the right weight, right bottle, etc. But the play of my own chemistry, (biochemistry) with the drug, coupled with the lack of mental concentration, gave rise to a humorous train of thoughts. This mescaline-like philosophy was present again in sitting in my office, looking through the window into the lab, and seeing Xenon and Yago intently discussing a problem. (I was aware, that they were preparing to set up the zone-refiner for the purification of Benzine acid..). I could watch the show, strip away the hypocrisy of it all, and recognize the farce inherent under all their acts. Quite a movie and it went on and on. But I was the only one watching, and I knew it was worthless for them to try to impress me.</p><p>The absence of physical toxic manifestations was noted and appreciated. There were very little muscular effects, slight eye dilation, no nausea; however, the thought that it might be difficult to urinate recurred (as with DMMDA). Slight difficulty during intoxication, none afterwards.</p>"
}
