{
 "title": "Felt Good",
 "author": "Cadillak",
 "citation": "   Cadillak. \"Felt Good: experience with 4-Fluoroamphetamine (ID 92420)\". Erowid.org. Jan 11, 2012. erowid.org/exp/92420",
 "substance": "4-Fluoroamphetamine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)",
   " ",
   "60 mg",
   "oral",
   "4-Fluoroamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 92420",
   "Gender: Male",
   " ",
   "Age at time of experience: 25",
   "Added: Jan 11, 2012",
   "Views: 6179",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI decided to try 4-FA after reading about it being similar to ecstacy and amphetamine but milder and since I had done ecstacy a few times and enjoyed the cleaner mellow rolls especially mixed with Cannabis.<br>Anyways back to this report, the first night that I got it I was a little nervous to take a full dose so I did about 40 mg...I just weighed it out on the digital scale and then ate it..The effects from this small dose was alot like cocaine but milder and lasted alot longer I wasnt really tired anymore and had energy and felt good even though just before I had eaten it. <br>I was thinking of maybe getting a good sleep then taking it the next night...I also found that smoking weed produced zero munchies even on this light of a dose.<br>The next time I did about the same 40 mg except this time I ate about another 60 mg about an hour after the 40 kicked in and yea it was definatly stronger and felt alot like a very clean ecstacy roll... My pupils got big, I kindve got the chills a little but not bad and everything felt and sounded awsome.....The Peak Lasted about an Hour an a Half but all in all Id say a great overall high and it made for two nights of awsome fun on like less than 200 mg.  You cant beat that.<br>4-FA is a great alternative to ecstacy and very clean.\n\n\n"
}
