{
 "title": "A Little Goes a Long Way",
 "author": "Noirceuil",
 "citation": "   Noirceuil. \"A Little Goes a Long Way: experience with Datura metel Roots (ID 9242)\". Erowid.org. Sep 5, 2001. erowid.org/exp/9242",
 "substance": "Datura metel Roots",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "2 shots",
   "oral",
   "Datura",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9242",
   "Male",
   " ",
   "Not Given",
   "Sep 5, 2001",
   "33229",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n  I am relatively new to the drug scene, and do not believe in taking things slow. After a few unsucessful bouts with marijuana, an unpleasant experience with morning glories and a pleasant experience with mushrooms, I decided (after much reading and deliberation) to try the infamous Datura. I ordered an ounce of dried roots and immediately began to prepare a beverage the moment I received the powerful plant substance.</p><p>  I boiled two large roots (3 inches X 1 1/2 inches each) in a standard cooking pot, the diameter of which was about 12 inches. After an hour and a half of boiling the matter, the water took on a brownish color. I let the liquid cool, placed about four teaspoons of Tang into the mixture to mask the reputedly awful flavor, stirred, and poured the liquid into an empty, thoroughly-washed coke bottle for future consumption. As an added bonus, I took the cooked roots (which had become quite soft from the boiling), tore them to pieces and placed them into the bottle. </p><p>  After the bottle sat on my bureau for a week, I took two sips, JUST TWO SIPS, of the liquid and went about my day.</p><p>  30 minutes later, my vision became blurred, and I became extremely lightheaded and dizzy. I had that floating feeling that accompanies the onset of mushrooms, as well as confusion. This unpleasant state, not unlike drunkenness, lasted for an hour.</p><p>  I can only imagine what would have occurred had I imbibed a few more gulps of the beverage, which I will be doing the next time I have a few days to set aside for delirium and potential unconsciousness.</p>"
}
