{
 "title": "Subjective Evaluation",
 "author": "Alexander Shulgin",
 "citation": "   Alexander Shulgin. \"Subjective Evaluation: experience with MMDA-3a (ID 92430)\". Erowid.org. Sep 9, 2011. erowid.org/exp/92430",
 "substance": "MMDA-3a",
 "bodyweight": "178 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "MMDA-3a",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "1963",
   "ID: 92430",
   "Gender: Male",
   " ",
   "Age at time of experience: 37",
   "Added: Sep 9, 2011",
   "Views: 4669",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[This report originally appeared as handwritten notes in Book 1, pages 66-71 of the Shulgin Lab Books.]</p><p></p><p>Subjective evaluation. MMDA 3A</p><p>6/8/63</p><p>Time 10:15 AM (0 hr.) - dose 20.0 mg as Hcl BJ-> 245.5->209 free base, and at 178 lbs</p><p>Chronology: This transcribed verbatim: [except brackets]</p><p>11:30-12:00 (1 1/4-1 3/4) aware.</p><p>12:10 (1 11/12 hrs) decide not to tell BK [this all was at farm, sat.] Seem to be aware that the max is controllable.</p><p>12:20 (2 1/12 hrs) time creeps - marvelous world of insects, the -OCH2O- really rewards me.</p><p>12:45 (2 1/2 hrs) try eating - completely confident - will use wine [crossed out] 7-Up.</p><p>1:15 (3 hrs) if it stayed forever like this, I would just have to let my apparent personality [concept can be recalled - see discussion].</p><p>1:30 3 1/4 hrs -></p><p>1:45 3 1/2 hrs rest.</p><p>2:00 (3 3/4 hr) out to bricks.</p><p>3:00 (~ 5 hrs) out of drug.</p><p>Elaboration upon, and explanation of this chronologically expressed diary follows. adjoining is the actual transcripts.</p><p>The initial dose was taken at the lab, as noted, at 10:15 AM.  Employing the analogy gained heretofore, there would be, comfortably, at least an hour before effects, if any, would become debilitating. During the 10:15-11:15 period of grace, I drove the incredible Studebaker truck to Lafayette to procure a 1/2 yard of sand, and had a spirited contest with a highway patrol officer whom, I was certain, was more concerned with the 1/2 quart/10 mile oil-contribution to the smog problem then to my abilities as driver. In any event, there was no incident. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>Some time after an hour, I became aware of some intoxicative effect, while I was talking to the man who did the discing around the farm. I had opened two tall beers, one for him and one for myself, and although the day was hot, I could not drink more than a sip of mine.  I immediately thought of the experiment and deduced that beer, regardless of how deficient in EtoH might have an adverse or confusing effect  on the outcome.  So I listened to him talk for 1/2 hr, while I made what must have been inane and inconclusive conversational ploys.</p><p>He left to make a phone call, and then returned to his tractor & discing equipment. I returned to my bricks and knew that it would be futile to mix mortar. I could indeed lay bricks if necessary, but I had no heart for it. The piles of bricks (some 20 bricks high, i.e. 2x10 or about 2 ft.) had that 'continuous-in-motion' style of falling associated with mescaline. It was extremely enjoyable to watch the bricks in continuous performance.</p><p>At this time I had my first serious thoughts about telling BK of the experiment, but decided not to. Somehow, I knew that I could probably fool her, and her not knowing would provide me with convincing evidence of the apparent normality of my actions. There was also an element of selfishness in it as well. Incidentally, there was quite extreme pupillary dilation at this point--there had been absolutely no indication of nausea or physical malaise with this material.</p><p>At about this time I became motivated (as I had with mescaline) with the captivating world of insects. I found a measuring worm, and with great tenderness and patience picked him up, observed his fore - and aft 'feet' and finally placed him down on a leaf and watch him acclimate himself. There was also a spider on the bricks, and I was compelled to watch him in action. I was grateful that I was not being observed, so that I should not have to appear dutifully employed. Time was quite slowed. I checked periodically with the kitchen clock - it moved quite slowly. It was necessary to move, intentionally, slowly, as to not exhaust myself.</p><p>As mentioned in the chronological display (page 66) it became apparent to me the extent of the pleasure-giving (and possibly activity-enhancing) properties of the methylene dioxy group as contrasted to the analogic dimethoxy pattern. Compare: Amos reported grey doughnuts and more on ~ 126 mg, 3,4-methylenedioxyamphetamine, whereas there was nothing on the dimethoxy analog (same conference). This, as least supports the potency argument. There rests the enigmatic report of 'no improvement over mescaline' description of 3-methoxy-4,5-methylenedioxy phenylethylamine. MMDA appears possibly more active than TMA, and distinctly of more gentle effects. Also, MMDA-2 looks to be comparable to TMA-2, but certainly none of the individual panic that accompanied TMA-2. Here, it is true, that TMA-3 is untested (in truth as of the moment still in the nitro-styrene stage, so still not even synthesized), but already, I am quite willing to at retest MMDA-3a, as it allowed a friendly experience.</p><p>At 12:45 PM BK made some sandwiches as lunch, and I volunteered to share them. My customary habit of a bit of Pinot C. with tuna sandwiches was converted to 7-Up over ice. The sandwiches were uneatable. BK comment mid-way that the pickles were bad, and I was overwhelmed with the recognition that I was unable to distinguish bad from not-bad. Intellectually I knew that the sandwiches were OK, but they filled my mouth unreasonably, and I gave up. Instead, I watched birds circling above the newly plowed field (we ate on the new patio) and sipped (and enjoyed) 7-Up and Ice.</p><p>The concept soon arose (in the notes, about at 3 hrs) that this condition might be permanent. True, this consideration has often arisen before, with LSD, as well with TMA-2 and Mescaline. However, with all these other materials, on all previous occasions, the rational had been set forth that it would be possible, even necessary, to learn and imitate the behavior of normal individuals so as to perpetuate the sham of normalcy. In other words, one could and must set about learning to act in an acceptable normal manner, so as to conceal the true state of affairs.</p><p>With MMDA-3a, the concept flashed but the mind was totally opposite and is recalled here as well as possible. Here, it was, as mentioned above, considered a real possibility that the changes observed might be irreversible. The challenge appreciated was not only to imitate 'normal' behavior as would be necessary to fool ones associates but to plot an existence campaign of gradual change of personality so that, after a period of weeks or months, one could relax back into this pleasurable escape and have it accepted as usual behavior. In other words, the capacity for intellectual plotting was, far from being lost, quite available.</p><p>It must be held noteworthy that both; 1) this was quite recherche concept was totally recallable, and; 2) this attitude may well represent the approach employed by endogenous schizophrenics, in the concealment of their problems. It further is undoubtedly coincidence that this concept first appeared under this specific drug. It might be me.</p><p>Between 3 1/4 and 3 3/4 hrs (~ 3 hrs was max. effect) I rested, on the pretense of sleepiness, actually to avoid brick-laying and also to try closed-eye effects. The results were questionable. I couldn't lie still. In pseudo-darkness, there would be some structured illusions as with LSD (commonly called eyes-closed hallucinations, but actually closer to the so-called brain-movies of MMDA. These were interpreted in an erotic framework, not unpleasantly extended by the awakening experienced by BK at 1:45 PM. If left alone, I could have enjoyed my own company. The effects were pleasant.</p><p>There was a precipitous decline of intoxication from here on out. Soon, there were no mental retreats, and thus laid bricks all afternoon, and had martinis before dinner.</p><p>Afterthought - test of car - drivability during intoxication probably impossible.</p><p>Overall conclusion . a) will explore when BK or Gladys soon; also, will repeat. pleasurable and perhaps rewarding.</p>"
}
