{
 "title": "Strong Introspective Spatial Effects",
 "author": "Blaze",
 "citation": "   Blaze. \"Strong Introspective Spatial Effects: experience with Methoxetamine & Bupropion (ID 92431)\". Erowid.org. Aug 22, 2011. erowid.org/exp/92431",
 "substance": "Methoxetamine & Bupropion",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "Pharms - Bupropion",
   " ",
   "  T+ 0:00",
   "20 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   "  T+ 0:05",
   "30 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)",
   "  T+ 0:07",
   "50 mg",
   "sublingual",
   "Methoxetamine ",
   "(powder / crystals)",
   "  T+ 0:15",
   "50 mg",
   "sublingual",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 92431",
   "Gender: Male",
   " ",
   "Age at time of experience: 27",
   "Added: Aug 22, 2011",
   "Views: 5357",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[Methoxetamine vs Ketamine]</p><p>Strong effects last for at least 4 hours and up to 6+ hours. Unfortunately, lasting anti-depressant benefits were not evident, apart from that the experience was pretty remarkable!</p><p>Fairly slow onset for me (~25 minutes) led to re-dosing as follows:</p><p>(t - 0 minutes)  20mgs insufflated</p><p>(t + 5 minutes)  30mgs insufflated</p><p>(t + 7 minutes)  50mgs sublingually</p><p>(t + 15 minutes) 50mgs sublingually</p><p>(t + 25 minutes) strong onset, laying down in bed is good</p><p>(t > 40 minutes)</p><p>Definitely similar to ketamine, strong introspective spatial effects. Sense of being completely self-absorbed, in my own world which I am right at the centre of, the world is in myself. Colours are more vivid and external experiences feel internalized in an epic way. Everything takes on a sense of being 'Totally Epic' - the best way to describe it. For example, I started watching Black Swan and it felt like a monumentally epic story made just for me!</p><p>Movement is springy and weird. I feel light and quick on my feet but in a drunken way. The is a lack of co-ordination but I feel 'fast'. Couldn't go to sleep, took everything 3 hours before bed time but stayed awake all night. Talking slurred and  appear 'off my face' although I didn't feel classically drunk, I would appear to be wondrously staring at things & completely self-absorbed. (Trip Sitter says).</p><p>Was on a low dose of Bupropion (I didn't take my usual anti-depressant dose of 450mg that day). Apparently Methoxetamine has some DRI effects and I didn't want any interactions.</p>"
}
