{
 "title": "Absolutely Gorgeous with Nausea",
 "author": "Holly Ralston",
 "citation": "   Holly Ralston. \"Absolutely Gorgeous with Nausea: experience with Psilocybin (ID 92449)\". Erowid.org. Aug 16, 2011. erowid.org/exp/92449",
 "substance": "Psilocybin",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Psilocybin"
  ]
 ],
 "footer": [
  [
   "1980",
   "ID: 92449",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 16, 2011",
   "Views: 8223",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>[This report originally appeared as a typewritten page pasted into Book 3, pages 402 of the Shulgin Lab Books.] </p><p></p><p>9/16 Holly Ralston - Psilocybin - 10 mg - empty stomach</p><p>Approximately 40 minutes after the start, there was a flutter and a very high, stimulated feeling, and gradually things began to move very rapidly. It was astounding. When I closed my eyes I saw so many fantastically beautiful patterns, textures, colors. Everywhere I looked, eyes open, the colors were brilliant. The house looked absolutely gorgeous and nature was simply spectacular. I know that Zeke was having some negative happenings, and I continued to experience the imagery when I closed my eyes. It was a little frightening, almost too exciting, after the gentleness of other substances.</p><p>I could not believe that I was doing it, and that I had the power within myself to see such beauty. I don't know how long this went on, but the motion was so rapid that I felt a sort of motion sickness. Then I became quite nauseated and remained nauseated the rest of the day, until things quieted down in the evening, and then I felt absolutely wonderful.</p><p>This substance has had adverse reactions in my body before, but this was pretty bad. I really got in touch with my body, and just know that this is a message to ease up on all the high calorie food and drink in my diet. I need to lose 10 lbs. But somehow, food is such fun at this stage in my life. As a child I never enjoyed food, so am making up for it now, it seems.</p><p>A few job pressures had me bothered. Working in the community affords a wide look at Barstow. Heretofore, I was just 'passing through' but now I've stopped to look. Many problems exist here and the most serious seems to be lack of funds. Chamber of Commerce is just about broke so it is depressing. I became emotionally involved for a while, and the fact that the gal who left to go to Ridgecrest (better job, more pay) had spent four years of blood sweat and tears to get things done, got to me. She was bitter about leaving after a long uphill struggle to get things done in the town. Her bitterness rubbed off on me and was beginning to get me down. My hide isn't a tough as I thought.</p><p>Zeke and I went down under the cottonwood trees and talked about it, and after a few minutes, he claimed I looked much better. It was better after a sounding board and father-advisor like Zeke.</p><p>We came back into the house, listened to Mahler and I began to find the peace that I had wanted earlier. Soup and crackers helped the emptiness and the nausea was gone. We wondered if we shouldn't have had breakfast before the experience.</p><p>- Holly</p>"
}
