{
 "title": "The Robot Voice",
 "author": "Life-enjoyment",
 "citation": " Life-enjoyment. \"The Robot Voice: experience with Cannabis (ID 9248)\". Erowid.org. Jul 4, 2005. erowid.org/exp/9248",
 "substance": "Cannabis",
 "bodyweight": "270 lb",
 "header": [
  [
   "DOSE:",
   "2 bowls",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "1 cig.",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9248",
   "Male",
   "",
   "Not Given",
   "Jul 4, 2005",
   "3261",
   " "
  ]
 ],
 "report": "<p>Cannabis usually makes me one of two things each time I smoke it.  I either get real excited, not nervous but my mind is clouded and has a hard time thinking.  If I dont get the above stated, I get deeply relaxed, muscle tension fades, and it feels as though a door has opened and my brain expands until there is ton of open space around my current thoughts.</p><p>One such experience was last Saturday.  Two friends of mine named Scott and Russ (nicknamed S and R for easier reference) bought some bud and got high before heading to the mall.  We packed a few bowls, two namely and smoked then rolled a blunt with the rest of the weed.  Between the time we smoked our bowls and rolled the blunt, I was feeling slightly giddy and giggly, yet not high.  We rolled the blunt and smoked it to where we couldn't hold it the put it in the bowl and finished it off.  I went to stand up and I couldnt.  I was feeling as if air was as heavy as water and I could only move my head really slow.  When I did finally figure out how to move my head again, it seemed as though my head stayed still but my body and the world are the ones that turned....</p><p>We made it into the mall, neither one of us could stop smiling.  We were walking around when I was hit with an instant of personal realization.  Im not talking about just getting messed up and heading to the mall for kicks.  I instantly realized how big the world actually was.  It felt as though time for me stopped but everyone else kept going at the exact same speed, I caught a glimpse of everyone past the mall doing their daily lives.  I stopped and took a minute to thank god for letting me see such things and experience such a nice life.  For about twenty minutes after that, it felt as though my mind and brain were two different things.  My brain seemed to take control of my body and move it for me while my brain laid in the back of my mind and enjoyed the ride... I was doing the same.</p><p>Somehow I reached the food-court and we chilled for a little bit at a table when I was staring at S and he was talking in a weird language and telling me to buy a book at Wal-Mart without moving his lips.  I asked him what he was saying and he told me I was hearing the Skytron monitor.  The Skytron was a huge TV above the food court that played constant commercials.  Anyway I stopped and watched the beautiful scene and let my worries fade when R looked at me and asked me if I heard the robot.  I was hearing a constant sound for a while now, not realizing it was a robot till R said something.  Normally I would get freaked out about something like this and hate myself for smoking bud.  This time I said , 'yeah' and sat back and relaxed and lived/loved life for what time I had left till the robot came to kill me.  It never did.</p><p>I came to realize later on that the robot was nothing merely other then the large jumble of voices eating their lunch and enjoying their life.... that made me happy to see that other people were enjoying their day also.  I was coming down from my high by the time we were leaving the mall, however that didn't stop Russ, Scott , and I from enjoying a laughing fit in the car so hard it made my chest hurt.</p><p>Smoking weed is fun... I believe it's something for everyone to try at least once and see how they like it.  As with beer, if I find myself getting messed up once a week or more, I'm going to cut back.  I have such a fun time each time I smoke the sweet herb, and I encourage everyone to be safe and have fun.</p>"
}
