{
 "title": "Eeriedisturbing",
 "author": "Raid",
 "citation": "   Raid. \"Eeriedisturbing: experience with Dimenhydrinate (ID 9250)\". Erowid.org. Jun 24, 2004. erowid.org/exp/9250",
 "substance": "Dimenhydrinate",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "500 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9250",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 24, 2004",
   "Views: 21338",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've used dramamine a total of 5 times now (500-750mg), over the course of half a year. Each and every time, with the exception of maybe one dose which was too close to a previous one, I've achieved a very overwhelming 'high'. </p><p>It's very difficult to make anything I experiance on dramamine profound, ussually everything is just a sarcastic, sinister mockup of reality. It has no purpose or goal, it's just like aimlessly wondering through an illogical funhouse. </p><p>The intoxication onset comes quickly, ussually over a period of 15-30 minutes, the body feels extremly heavy and awkward, as if intoxicated from alcohol. There is often a rushing feeling, as if something popped out of nowhere at me. It is at this time that visual hallucinations are most vivid and distinguishable from reality. Common things I experiance at this stage are...</p><p>- Changes in illumination, like camera flashlightning</p><p>- Textures 'twitching' and moving in quick, small motions.</p><p>- Visual 'disturbances' in dark settings. Color, entities.</p><p>After this initial phase, the entire high seems to fade a bit. I vividly recall wondering if the effects of the drug had worn off my first time. Though after this, the effects become far more... scary. It is then that my mouth becomes dry, so dry that it is hard to talk. Often the jaw or chin becomes numb and tingles. My friend's bottom lip constantly grows to at least twice its proportion while at the mid-section of a dramamine high. It is here that I plummet from reality into 'Gravol-Land'.</p><p>Talking to people on an invisable phone, which I swear I'm holding, though my hands are in my pockets, tickly clenched into fists. Seeing mist and incandecent jellyfish everywhere, and often times, a feeling of dread, death, rot or decay. I'm not sure if I'm the only one who observes this connection, but I sense a connection to death, inanimacy, it's hard to describe, it feels almost as if I've become a corpse. I suppose it would be hard to comprehend unless you've been around dead bodies, maybe it's just me. (geez, getting scary-shivers thinking of some experiences, stuff can get very..VERY eeriedisturbing on it)</p><p>There is one good thing about a dramamine trip however, if at any time I  have a feeling of fear and want to terminate my trip, it's as easy as laying down on my bed and closing my eyes, if I catch myself talking to vapourus manifestations, it's better to let myself then try and convince myself they're not all over the place. I may feel odd the next day, but I'll be well rested.</p><p>Those who like watching horror films alone would enjoy a dramamine 'trip'. Dramamine is unique, but it's a very 'irresponsible' drug IMO, and it doesn't teach me anything the way other true psycoactives do.</p>"
}
