{
 "title": "Food for the Mind",
 "author": "saturn-aurelius",
 "citation": "   saturn-aurelius. \"Food for the Mind: experience with 5-MeO-DALT (ID 92506)\". Erowid.org. Aug 23, 2011. erowid.org/exp/92506",
 "substance": "5-MeO-DALT",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "5-MeO-DALT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 92506",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Aug 23, 2011",
   "Views: 11769",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had thoroughly researched this chemical quite heavily before using it and it still defied everything I expected. I am writing this almost a year to date after having taken it so I apologize for the lack of a timeline. However I have done considerably more research on this chem than most and im here to say its not for junkies and its not for people looking to get high. It is a door-opener it is 'the path', its primary function is mental and emotional rather than visual. </p><p>When I took it the first time I expected a larger change in visual perception and was disappointed to see rather little. I lay back and attempt to relax ( caused mad leg cramping) I felt restless, turned on some trance music and laid on the floor. Upon closing my eyes I was stunned by the insanity flowing through my head like a raging river! This was like lsd for in my head! I soon found I had complete control of the experience and could visualize anything almost before I finished the thought. I found I could leap back into dreams long gone and walk around in them! Touch them even! It was as if I had the key to the vast stores of my mind! Truly enlightening experience. Saw things that do not have words or even a true existence. This is a trance drug. A look inside chemical. Drugs for your imagination.</p><p>I felt a lil fried the day after mostly I think from a lack of sleep (was up till 6am) but had muscle pain from severe leg cramping leading me to believe that it causes mild to moderate CNS damage.</p>"
}
