{
 "title": "Taking Life One Line at a Time",
 "author": "Sprite",
 "citation": "   Sprite. \"Taking Life One Line at a Time: experience with Methamphetamine (ID 9252)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9252",
 "substance": "Methamphetamine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  lines",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9252",
   "Female",
   " ",
   "Not Given",
   "Jul 5, 2005",
   "Views: 12122",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Well it all started because I was having a bad day. My bad day turned into a bad month, then a bad year. I really don't remember what I did in that year but I remember how I felt. I had tried every other drug there was to try and meth was the last one for me. I was getting ready to graduate from high school and go to college. I went out one night after I quit my job and was really depressed. One of my friends at the time told me that he knew of a good way to make me feel better. We went back to his house and he pulled out a few grams of this stuff that looked like little crystals. Well we did about 3 grams the first time I ever tried it. It was a new feeling and I liked it a lot!!!  I never wanted this feeling to end. I had more energy than I ever had before, I was happy, and I was not worried about anything. We stayed up for a week and then ran out. The feeling that I got when I started coming down was a feeling of total exhaustion. All of my energy went away and I could not even focus on what was real and what was make believe. We were driving down the road and my asked me what I was feeling, I told him I felt tired but could not sleep, hungry but could not eat. He told me that was the best description of strung-out that he had ever heard.  The next week we went and did it again. It got so bad that I could see bushes turning into people and walking up to me! Not fun when you are sketched out and geeking.</p><p>I stayed up on meth for a little over a year. I know you probably don't believe me but that's your opinion. I lost control of the world around me and could not tell if people were talking to me or not. My ears were ringing non-stop and my mouth was so dry. I went from a size 14 to a size 6 in two months. I loved it all. My mind went blank and nothing mattered to me. The only thing I wanted was more, more, more. All of my friends stopped talking to me and I got kicked out of my house. That is all I really remember from the 14 months that I was jacked. I really wish that I could control my use of this highly addictive drug, but I can't.  I only stopped using twice. The first time was when I went to jail. They arrested 32 of us in the same town, some of us users got light sentences others are still in jail now. The second time was when I found out I was pregnant. I had already miscarried twice because of this drug and was not going to again. I started using again when my daughter was only 2 months old. I can't help my self the drug honestly has control of me and I actually enjoy it. I am an addict!  I'm can't tell you if it is the right drug for you or not the only way you will find that out is to try it and see if you like it as much as I do. I have been a meth head for 5 years and I will be for the rest of my life. </p><p>By the way if any of you saw me running around in 1997 let me know what happened. This drug will eat away at your brain until you are just like me. I have no short term memory at all. I forget to eat, drink, sleep, I even forgot how to drive a 5 speed once. I have an expensive habit because I can never seem to get high enough. I always want more and I always get more. I have no desire to stop doing what I like to do. My doctor told me yesterday that I was destroying my muscles and my bones by doing meth. I really don't care. I take care of my little girl by myself (her daddy is still in jail). I am able to go to work and pay my bills, but instead of a cookie jar with extra money I have a cookie jar with extra drugs.</p><p>Well I guess that's all I really wanted to say to all of you. It's time for another line now. I'm taking life one line at a time.</p>"
}
