{
 "title": "Becoming Lightwaves",
 "author": "Glitterbaby",
 "citation": "   Glitterbaby. \"Becoming Lightwaves: experience with Unknown Substance ('Peace'?) & Salvia divinorum (10x extract) (ID 9254)\". Erowid.org. Jun 29, 2004. erowid.org/exp/9254",
 "substance": "Unknown Substance ('Peace'?) & Salvia divinorum (10x extract)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Unknown",
   " ",
   " ",
   "100 mg",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)",
   " ",
   "1 hit",
   "smoked",
   "Salvia divinorum",
   "(extract - 10x)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9254",
   "Male",
   " ",
   "Not Given",
   "Jun 29, 2004",
   "10331",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I already came to the point where I doubted my ability to receive a hallucinogenic effect out of salvia, because I smoked it four or five times before today and nothing happened, I smoked less today compared to the last time I smoked before.  </p><p>To describe my state of mind before I took the salvia:  </p><p>1.) I realized that I had spent my life until today without doing anything useful. </p><p>2.) I had quit the relationship with my girlfriend.  Ugly day... Mindbomb...  </p><p>So I decided to seek 'shelter' and spent my day with my best friend.  We know each other and we're doing our 'drug testing' together. The  place couldn't be better, good music in the background ( Plaid ),  really comfortable leather couch, some drink in range, the perfect  setting, besides my real devastated mind, filled with bad emotions. I really wanted to feel bad, but salvia just sucked me  out of my body...   Before the first salvia hit I had already smoked a good hit peace [Editor's note: don't know to what substance 'peace' refers] and was already a little numb in the stomach. After I finished  complaining about nothing, my pal decided to do me some good and  prepared a 0.1g hit of 10xSalvia. I smoked it almost completely with  one turn and laid back after it. Another hit got prepared and I  smoked it also, just feeling the first tickles under my knees. After  the second hit I had to lay back must faster, more falling back than  moving normally.  The best way to describe what I felt was that I got sucked out of my  body. Like a large air vent behind my back or something. </p><p>I mentioned  that it would be better to lie on the floor to enjoy the flight. I  spared some words to my friend that I will tell him later. But I hadn't  much time to think about this funny feeling because I came back  converted to some kind of lightwaves. After being sucked out I had  the feeling that I was separating or bending in salto-fashion and  transformed further into a flowing wheel of orange-green light pulsing to the beat of the music. That's next to what I felt most from all possible non-verbal expression, after all my english skills are lousy  too. I almost visualize music in my head in geometrical figure and  patterns, coloured somewhat between orange and green, some neon-like  colour. The figures and patterns are flowing and transforming according  to the flow of the music and the beat. On peace I can visualize this in  my mind pretty easy, but with the salvia I became a geometrical figure  myself, pulsing to the beat. </p><p>I never had any halluzinogenic experience before and if this is it, I  will do it until I die of old age. After the first two or the three  minutes floating in some wave-shape through a dark mindscape glowing  in my own light, I realized that I was in a trip and I got the feeling  that I am able to control the trip. I recognized that I was opening my  eyes intuitively I forced them closed. And it work, I was  incredibly happy, Soon I started mentioning that the music will end after the song has ended and I began complaining silently, but the trip got me  back. The next two minutes I was fighting with myself not to let reality  back in my thoughts, because I don't wanted to loose this floating feeling. I worked quite good, but after this two minutes reality came back bit by  bit. It took some time for me to get the first words out and I fully  recognized that I had an awesome experience. A deep feeling of luckyness  and satisfaction filled my head and the only thing I could do was laugh  and smilr while trying to explain to my pal how great this trip was.  Soon after this I decided to let other people know what happened to me.</p>"
}
