{
 "title": "A Pleasant Surprise",
 "author": "DarkTryptamine",
 "citation": "   DarkTryptamine. \"A Pleasant Surprise: experience with JWH-018 (ID 92549)\". Erowid.org. Dec 17, 2012. erowid.org/exp/92549",
 "substance": "JWH-018",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "JWH-018",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 92549",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Dec 17, 2012",
   "Views: 2203",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>To clarify, I am a 20 year old psychonaut, 19 at the time of this particular incident, and my previous experiences with psychoactive chemicals had covered a wide range at that point. I had experienced the effects of cannabis, psilocybin, LSD, MDMA, cocaine, DMT, 2C-E, salvia, DXM, opium, amphetamine, many various benzodiazepines and prescription opiates, LSA, and unfortunately fentanyl. Anyway, I am fairly small in stature, weighing only 130 lbs, and in generally being a very skinny guy, however surprisingly enough I have a remarkably high natural tolerance to opiates. To get back to the point, I had smoked K2 many times before the time of this particular experience, but the chemical seemed to be very weak in comparison to cannabis, and I did not think much of it; that is, until it became illegal in my state and a friend of mine began selling his own blend of JWH-018 drenched herbs that held a much higher concentration of the chemical than the K2 I had previously smoked.</p><p>T+ 00:00 - I had been given about two bowls worth of the JWH-018 blend by a friend to try, as he was trying to push his product and knew that I was a skeptic of any type of synthetic cannabinoid at the time. I did not have any paraphernalia at the time other than some zig zag rolling papers, so I rolled the material into a medium size joint and smoked the whole thing in about 3 minutes. I believe the chemical was sprayed on Damiana herbs.</p><p>T+ 5:00 - The effects of the chemical hit me like a train! I had completely underestimated the potency of this particular blend, as my perception shifted into the usual cannabinoid realm of feeling completely spaced out, imaginative, and as with very potent cannabis, I experienced very vivid closed eye visuals and a mild but pleasant body high. I was impressed to say the least.</p><p>T+ 10:00 - I was listening to music at that point, Animals As Leaders to be precise, and felt completely absorbed in the music, feeling each note and noticing each polyrhythm with acute attention to the most intrinsic details, decoding every aspect of each song's structure. I was completely zoned in on the music, seeing my computer screen through tunnel vision, which rarely happens to me, as well as seeing some slight movement in the lettering on my itunes page. That's right, I actually was getting mild open eye visuals from what I had previously written off as a joke, and I had just finished the joint less than 10 minutes prior!</p><p>T+ 30:00 - At this point I had been staring at my wall for about 20 minutes, oscillating between intense focus on the music, in which I had found to have many qualities that I had never noticed before the experience, and from blocking out the music entirely as countless thoughts of all kinds flew through my completely detached mind. I realized that this was the highest I had been in months, in fact, in some ways the high was more intense than anything I had experienced with cannabis! I decided to turn on the television and see what was on, I turned the channel to Adult Swim and started watching an episode of Aqua Teen Hunger Force that I had seen too many times, yet it seemed totally new and foreign to me, and to my surprise, I also found through watching the screen that I was still hallucinating!</p><p>T+ 45:00 - Effects are starting to diminish, yet I am still so spaced that I feel as if I'm in another world, no longer getting any open eye visuals. I couldn't believe that I had received such profound effects from such a small amount of material! It became clear to me that my friend had sprayed way too much of the JWH-018 on the herbs, and I had a whole new perspective on the chemical, now giving it the respect it deserved as potentially the closest synthetic cannabinoid to the real thing. </p><p>T+ 1:30:00 - I was feeling very stoned for an entire hour and a half after smoking the substance, the second half being milder than the first of course, but by this point I felt pretty close to baseline, though I had the usual headache that comes with the comedown from JWH-018. All in all, it had been a very pleasant experience and had blown my insignificant K2 highs out of the water.</p><p>AFTERTHOUGHT: JWH-018, when taken in a high dose, felt eerily similar to cannabis in many ways, yet it still lacked much of the depth a cannabis high has, though it was far more intense in other ways. Also, as with many chemicals, this substance felt like a manmade chemical, as it can be rather easy to tell the difference between natural chemicals and synthetic ones if that makes any sense. There's just a different feeling that comes with the synthetic stuff, a good example being the differences felt between LSD and Psilocybin. I had basically just experienced a mild psychedelic trip due to the amount of material I had ingested, and I enjoyed the experience immensely, but in conclusion, I still prefer THC, for as hard as people may try, nobody will ever be able to fully mimic the wonders that THC has on the brain. Hope this report was helpful in some way, and I'll be posting more soon!</p>"
}
