{
 "title": "Similar to Meth but Pounding Headaches",
 "author": "moxy",
 "citation": "Citation:   moxy. \"Similar to Meth but Pounding Headaches: experience with Products - Bath Salts, Plant Food, etc. ('8 Ballz') (ID 92543)\". Erowid.org. Aug 30, 2011. erowid.org/exp/92543",
 "substance": "Products - Bath Salts, Plant Food, etc. ('8 Ballz')",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Products - Bath Salts, Plant Food, etc",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 92543",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Aug 30, 2011",
   "Views: 5838",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  \r\nBACKGROUND: I was a heavy/chronic meth user for 6 years. I have been mostly sober for a year and a half, having used only a very small amount a couple of times during this period.\r\nEXPERIENCE:\r\nI tried some 8 Ballz bath salt. I understand why people would use it as a legal alternative to meth, because it is probably the closest thing they will find. It causes the same 'amp' as coke and meth while still producing a similar mental high or euphoria as meth that I don't get from coke.\r\nHOWEVER:\r\nThe main problem I found with it is that I get pounding headaches immediately upon use that I don't get with meth. Also, I had serious restless leg syndrome, and was much more overheated/sweaty after using bath salts than meth. The good effects don't seem to last as long as meth's. And then of course there is the crash.\r\nUSE AGAIN?:\r\nI think the only way I would use this again is if I had a serious craving for meth and just needed to 'scratch the itch' and snort something similar.\n\n\n"
}