{
 "title": "Potent, Savage Nature",
 "author": "Grnd Galactc Inqstor",
 "citation": "   Grnd Galactc Inqstor. \"Potent, Savage Nature: experience with Psilocin (ID 92564)\". Erowid.org. Jan 23, 2012. erowid.org/exp/92564",
 "substance": "Psilocin",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "26 mg",
   "oral",
   "Psilocin",
   "  T+ 0:25",
   "  ",
   "smoked",
   "Cannabis",
   "  T+ 0:00",
   "11 mg",
   "oral",
   "Psilocin"
  ]
 ],
 "footer": [
  [
   "2011",
   "92564",
   "Male",
   " ",
   "26",
   "Jan 23, 2012",
   "Views: 3238",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>By some miracle of god I came into ownership of some synthesized 4-HO-DMT or Psilocin, about ~100mg.  Here is my first report with this rare substance:</p><p>pill A - 15-17mg 4-ho-dmt</p><p>pill B - 10-12mg 4-ho-dmt</p><p>10:30am - pill A ingested</p><p>11:00am - yawning more, feeling my body relax more, some stomach flutters, but nothing serious.</p><p>11:10am - first signs of visual distortions, slight bending, only noticeable because I'm looking for it.  I'm feeling a bit chilled now, I should wear a hoodie.</p><p>11:25am - the visuals, relaxation, and stomach flutters are all increasing.  Getting harder and harder to get up and write on the keyboard.  Smoking some high quality marijuana now.</p><p>11:37am - I am full-on tripping now, and it feels closer to mushrooms (obviously) than say 4-aco-dmt.  Some more marijuana.</p><p>11:50am - pill B ingested</p><p>12:10pm - This is the last point where I'm aware of what time it is and capable of communication, at least effective communication.  I made a note in my voice recorder about the differences I was noticing between 4-aco-dmt (which is described on Erowid as possibly being metabolically converted in Psilocin, or 4-ho-dmt) and 4-ho-dmt.  Here is the transcript of the 30 second voice recording:</p><p>'The color alteration is definitely different from 4-aco-dmt, it's more like an earthy, less, like, red, bright red.  4-aco is just like a, just bright red, this feels more like earthy... I guess, I don't know, like, the wood almost looks black right now, I guess it could be the lighting, but... I don't know.  It's definitely distinct from 4-aco-dmt.  It is not the same thing, by any stretch of the imagination.'</p><p>Now, obviously, I know they are not the same thing, I was just referring to the information on Erowid's 4-aco-dmt vault which says:</p><p>'4-Acetoxy-DMT is an uncommon synthetic psychedelic. Its effects and duration are similar to those of psilocybin/psilocin. It is probably metabolically converted into psilocin in the body, but there are also reasons to believe that 4-acetoxy-DMT might itself be active in the brain, producing effects that are distinct from psilocin.'</p><p>I've used 4-aco-dmt a dozen or more times in the last year or so, and even if it's metabolically converted into psilocin in the body it is very different from taking 4-ho-dmt itself.  4-aco-dmt provides more rainbow type visuals with a distinct red-ish hue/glow to it while 4-ho-dmt is more similar to mushrooms than 4-aco-dmt.  4-ho-dmt did not give me the red-ish glow of 4-aco-dmt, but there was a sort of color deepening effect.  Browns seemed black, and whites seemed closer to tan.  Everything seemed to have an Earth-like glow to it.</p><p>Shortly after 12:10pm, probably around 12:30 or 12:45, the 2nd pill was kicking in and the visuals became intensely powerful.  After careful consideration I believe this experience with 4-ho-dmt to be the 2nd most powerfully visual experience I've ever had, behind Salvia Extract smoked from a bong, with a full out-of-body experience (basically I broke through for 5-10 minutes).</p><p>The visuals started getting more and more intense as the 2nd pill made its way to my brain, I started having a harder and harder time distinguishing between open and closed eyes.  The imagery was also much darker than other drugs I've taken, with wild animals and splatters of blood.  I have no fantasy involving this... but at one point in the CEVs it felt and appeared as if I was being urinated on by some sort of large creature (Jaguar, Panther, something like that) which I could only interpret as a visual representation of the ego-loss I was experiencing as a result of the drug.  Surely being peed on is pretty degrading, and I'm not one to enjoy being subjected to that kind of thing voluntarily, but of course the effects of the drug prevented me from caring or reacting, at all, to these bizarre visions.  At one point I also distinctly remember seeing a blood spray across the visuals I was seeing, in a Ralph Steadman sort of fashion, whom I am an admitted fan of.  The visuals during the peak were savage and animalistic, with no fractals or intricate designs, but rather creatures and people and blood and sex and death and other such things.  </p><p>Also during the peak I felt distinctly tiny.  It felt as if my body was shrinking, quite literally, and the objects and even the room itself around me became much larger. I believe this to be another visual representation of ego-loss.  Also, at some point, I became paranoid that my brain was dropping pieces of itself down my sinus cavity and into my throat, causing me to consume my own brain.  I realized that this was a completely ridiculous notion and was capable of not freaking out, but this belief sincerely inhabited me for a good 2 minutes or so, when I realized I just had some snot in the back of my throat, drank some water, and was fine.  One thing that I was considering while still tripping after the peak, however, was the digestion of this drug versus mushrooms.  Taking 4-ho-dmt is as easy as swallowing a gelcap, which removes some of the ritualistic aspect of the preparation and consumption of the drug.  When taking mushrooms people usually add it to food, prepare a tea, or consume several grams of dried mushroom material (usually, pretty disgusting, and not at all easy, at least for me) and try to keep it down.  This extra time spent preparing the mushrooms forces the mind to consider the events soon to follow, while weighing and swallowing a pill only takes about 30 seconds.  </p><p>Similarly, digesting dried mushrooms, or even mushroom tea, is not as direct as taking pure 4-ho-dmt, since the stomach has all this non-active material to work through as well.  As a result the ride on 4-ho-dmt is much more intense with a STEEP peak.  Mushrooms are much more like a long 4-6 hour plateau, while pure 4-ho-dmt, even in a gelcap, feels like a roller coaster ride from hour 1 to hour 3, and then tapering off pretty quickly by hour 5 or 6, and back to baseline by hour 7 or 8, at least at the doses I used.</p><p>Clearly staggering my doses did not effect the intensity of the trip, but many Psilocin studies were done at .45mg/kg and .9mg/kg which would be about 30 and 60mg respectively.  I took ~27mg spread out over 80 minutes and still had, what I would consider, at least a +3.5 or +4 experience.</p><p>I've never smoked DMT before, so I can't claim to know what it's like, but I have to imagine that the ~30 minute peak I experienced on 4-ho-dmt to be similar in intensity to the visuals of DMT at just below break-through dosage.  I certainly intend on trying this substance again, and I have a couple more doses that I intend to play with later this year, but not anytime soon, I'll probably wait a couple of weeks before dosing again, but not too long, because the material is degrading pretty quickly, and I'd like to ingest it at as high a potency as possible.  Next time I might consider dosing something like 22mg in one dose instead of 2 separate dosages.  Also, I might use some of this batch to mix with 4-aco-dmt.  I'm curious what a combination of the two might be like.  I'm thinking of trying 10-12mg 4-ho-dmt and 14-16mg 4-aco-dmt, all in one capsule.</p><p>In conclusion, Psilocin is a fantastic compound, but it is by no means a party drug.  The potency and savage nature of it make it the tripping man's drug, with some of the most powerful visuals I've ever experienced.</p>"
}
