{
 "title": "Wide Awake for 48 Hours",
 "author": "Crestfallen",
 "citation": "   Crestfallen. \"Wide Awake for 48 Hours: experience with Products - Bath Salts, Plant Food, etc. ('Trance') (ID 92568)\". Erowid.org. Aug 29, 2011. erowid.org/exp/92568",
 "substance": "Products - Bath Salts, Plant Food, etc. ('Trance')",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "Products - Bath Salts, Plant Food, etc",
   " ",
   " ",
   "300 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 92568",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Aug 29, 2011",
   "Views: 9857",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.]  <br>I am 21, in college, and I have issues with substance abuse, most likely stemming from my depression/anxiety. Therefore, I take 300mgs of Wellbutrin XL (NDRI) a day. A little off topic but I thought you should know. Onto my experience... <br>I heard about a new stimulant type of drug that was legal, supposedly giving the user an 'amphetamine/cocaine'-like high. I have ADD and I have taken prescription amphetamines such as Adderall on a weekly basis for a year so I am very familiar with its effects. I have never tried cocaine, which I hear feels similar to amphetamines but last way shorter and is a bit more intense. This new designer drug is sold as 'bath salts' or 'plant food' in my local headshop. Being a sucker for new drug experiences, I decide to try it out. The first headshop I went to only had 1 brand (Pure) and it was in rock form in a small glass vial. I then saw the crack/meth pipes being sold above it (indicating it was meant to be smoked) which turned me off pretty quick. I then decided to check out the other headshop, which offered 2 different types. One was called 'Trance', the other I forgot. There were sold in .5g baggies covered by an envelope with the advertising on the front. I decided to try it out once before they outlawed it. I bought it, went home, and decided to try it out. <br>I usually do hours of research before trying a new drug, determining what the correct dosage is etc... There really wasn't a whole lot of info, just news reports. I did read that the actual chemical substance could be a variety of research chems like MDPV, Methylone, or Mephedrone. I opened the package and found a very small ziploc baggie w/ pot leaves all over the front(something like what you would get from a dealer) which told me somebody made this crap in their home locally...sketchy. <br>I decided it would be best to start out with a low dose bump. I dump out the powder and rail a small line. FUACKK this shit burns! After 10-15min, I feel something..but figured it was a placebo effect because nothing changed after 45 minutes post insufflation. I then decided to do a bigger line, which is when I started to feel a slight come-up. I noticed my mental clarity had improved and I felt more awake. It reminded me of the first time I took Adderall. Satisfied with the results but wanting to achieve euphoria, I continued to bump small lines throughout the night until half the baggie is gone. I never achieved that euphoria but it was a positive experience none-the-less. Music sounded deeper, especially electronic music like DJ Houst Dark and Armin Van Buuren. I stayed awake all night until I remembered I promised my parents to help paint one of the rooms in our house the next day. After being awake for 24 hrs, I started to feel fatigued but I knew I had a cheat. I railed the remaining .25g of the powder over a period of 6 hours and got my chores done. I could not sleep until that night, staying awake for 48 hours. I felt a small crash, which I countered with 1mg of Klonopin.<br>All in all, I would say this was a semi-positive experience. I didn't have any cravings to try it again but I did have an abnormal amount of bugers throughout the next week lol. I enjoyed the feelings of deeper music appreciation and alertness of the drug but it had a 'dirty' high feeling (the super sketchy packaging didn't help any). I think Adderall is a much better choice. Pharmaceutical grade amphetamines that I don't have to worry about the purity or whose kitchen it came from. These 'bath salt/plant foods' were outlawed in my city 8 days later. I took a big chance even trying it, not knowing wtf was inside of it. At the very least, it was a learning experience for me and I have no reason to regret it. Stay safe everyone!\n\n\n"
}
