{
 "title": "Smile. This is Quite a Ride",
 "author": "Neurotic Optician",
 "citation": "   Neurotic Optician. \"Smile. This is Quite a Ride: experience with 4-AcO-DMT & 2C-B (ID 92582)\". Erowid.org. Jan 11, 2012. erowid.org/exp/92582",
 "substance": "4-AcO-DMT & 2C-B",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "4-AcO-DMT",
   "(powder / crystals)",
   " ",
   "18 mg",
   "oral",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 92582",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Jan 11, 2012",
   "Views: 7219",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Hello. I will attempt to write about my most recent psychedelic journey, though these words are just the shade of the experience and will be brief when compare to expansive nature of the trip. Many things about the night are going to be completely left out, but this should give you some insight into  my experience. I suppose I will start out with some background. </p><p>This was my second experience with 4-aco-dmt and my first combination with the drug. My first experience (40mg) was, well, interesting. While not overwhelming (I tend to have a high tolerance to psychs), most of the night was defined by confronting problems that I had been ignoring or perhaps lying to myself about, so most of that experience was not necessarily pleasant, despite how rewarding it ultimately proved to be. Months later, I decide I will revisit this chem and bring along a good buddy 2cb as well, hoping for a more pleasant yet equally profound trip.</p><p>An ice storm rolls through Texas, class is cancelled so my Thursday night is now free, and it is the day after my roommate and life-long friends birthday. He wants to trip on 2cb, and I decide to join in along with 4aces. Spontaneous trips are always the best in my experience. It is 10:30pm and I parachute 50mg of 4-aco-dmt and 18mg of 2cb at the same time on a fairly empty stomach. I begin to load a bowl to smoke once we start coming up, which should be in the next hour or so.</p><p>Wait. No way, it cant be. Its only been 5, maybe 10 minutes. Okay, wow its been 15 minutes and I am now coming up hard. What did I get myself into? I close my eyes and I see visuals more complex than anything I have ever experienced: vast fields of swirling patterns, columns extending in uniform to infinity and then collapsing on themselves, colors stretching and splashing, caverns of fantastic geometric patterns dancing and rearranging. Its been just 20 minutes! I have never come up this fast from a drug taken orally. </p><p>My mind begins to race and I feel unable to focus my attention on any one thing for very long, whether its the music or my increasingly fantastic visuals. I am bouncing from place to place inside my head. While coming up, I am currently unable to sit back, carefree, and simply delight in my senses as I am often able to on PEAs, this trip was unavoidably deeper than that. I do remember looking at my roommate around the 30 minute mark and saying man, this shit is deep. He was only on 2cb and was just starting to feel it, while I already had begun to lose my connection to reality and time would warp substantially from now on.</p><p>At some point I open my eyes and stare at the ceiling. The popcorn texture finish of my ceiling begins to scramble and shift, sometimes in random chaos, sometimes in unison. I feel myself falling into or through my couch. I am dissolving. I feel I may have just died and now my atoms are redispersing into the universe, but I can not be sure as my memories are dissolving as well. I know I am losing myself, my reality, and I feel my memories fade into oblivion. I am being stripped of all points of reference, until all that remains is my essential soul. So obviously heres where things begin to become difficult to explain. </p><p>I am only my essential essence. I can not remember who I was and I am largely disconnected from my thoughts, while my emotions are still very strong. I am confused and even a little scared. Im aware that I have lost something, and I no longer have any points of reference to help me understand myself and my environment, and now I am just me and in that moment, seemingly floating between dimensions.</p><p>I begin to sense I am not alone in my headspace, and then I feel negative energies swirl around me and begin to attack and grate at my soul. I believe my first experience with 4aces helped prepare me for this moment. Anyways, I felt crowded by these negative energies attacking and provoking me. I am confused and scared and then then the most wonderful thing happened. I smiled. Haha it is bringing tears to my eyes just remembering this moment. I smiled and I suddenly felt joy bursting from my soul. The negative energies which seemed poised to overwhelm me now fade and in its place what emerges is so profound I will/can not put into words. They smile and laugh with me, and basically tell me, Well done. It was a test, and I passed. I laugh and cry from joy, from appreciation. Life became a river and I sat at the bottom of its waterfall and let it wash over me; I was so very happy.</p><p>It is strange describing something I felt and understood so completely, yet there were no accompanying visuals or auditory hallucinations to necessarily pinpoint, I just completely felt the experience. I had limited control over the direction and coherence of my thoughts during this period; I was mainly working with emotions. I felt a supremely satisfying connection with something larger than myself, and I really felt like 4-aco-dmt was not only a vessel to that connection but a guide to understanding it. I saw the mystical nature of the tryptamine finally, and Im in awe.</p><p>2cb seemed to add a more pleasant body load then from what I remember of 4aces alone, and certainly amped up the visuals, but 4-aco-dmt was definitely the star of the night. I was peaking for about 4 hours, with a slow come down for about 4-5 hours. When we started coming down we watched the most recent season of Curb Your Enthusiasm (with the Seinfeld reunion story arc) in its entirety. I feel such a connection to Larry David, Jerry Seinfeld, and their nihilistic brand of comedy, especially when tripping, its hard to truly convey.</p><p>Well, that's all I really have to say at the moment, hope you enjoyed the read.</p>"
}
