{
 "title": "Pleasant and Goofy Ride",
 "author": "jaydub",
 "citation": "Citation:   jaydub. \"Pleasant and Goofy Ride: experience with 2C-I (ID 9263)\". Erowid.org. Sep 6, 2001. erowid.org/exp/9263",
 "substance": "2C-I",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "16 mg",
   "oral",
   "2C-I",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9263",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 6, 2001",
   "Views: 7490",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nAfter having heard positive reviews of the substance 2C-I from a couple of trusted sources, I eagerly accepted the offer the sample this phenethylamine for myself.\r\nAt approximately 11pm, 16mg of fine white powder in a gelcap was consumed. The environment was outside in the desert with hundreds of people flowing in and out of my space during the course of the experience.\r\nWithin one hour, the first feelings begin to be present. From about t+1 hour to t+2.5 hours, the predominant effect of this substance was, to me, similar in nature to MDMA. By this I mean that there was a profound sense\r\nof happiness and serenity. I found myself full of physical energy and a desire to channel that energy into the appreciation of music. Unlike MDMA, this energy was not of a form that one might refer to as 'body load'. It was more of a mental manifestation of physical energy rather than jittery legs...\r\nFrom t+2.5 to t+8 hours the experience plateued at a level where visuals were prominent, but never overpowering. Because it was dark out, colors were not perhaps as vibrant as they might have been if it was daytime but nonetheless there was a red and green shifting pattern of color surrounding\r\nmost inanimate objects around. Looking up at the moon I could see a very detailed halo and it seemed as if I could see the flow of the air around me, lit up by the moonlight.\r\nDuring this phase of the experience, my mental state was one of profound joy and connectedness both with those there that I am close to as well as those that were total strangers. For lack of a better word, this happiness and joy was mixed in with a feeling of goofiness, as if everything was just\r\na bit funnier than it should be.\r\nAt t+8, the experience began a subtle downshift, coinciding with the sunrise. As the day began to take form, the steady increase in the ambient light brought a new dimension to the visuals, enhancing the sense of color and especially the details of near and faraway objects. With the music no longer present, the sounds of nature (mostly the wind) created an intense sense of calm and serenity. With the environment now back down to a dozen people or so, a more reflective tone to the conversations took over. The tone was empathic very much like a small group mdma experience. Once the sun finally broke over the mountains, the most amazing pink sunrise i have ever seen presented itself to me. Feeling amazed that this substance was still going strong, I continued to soak up this eye candy for as long as possible. \r\nAttempted to sleep around t+9.30 but could not. Closed eye visuals were still substantial, in this case driven by the sound of the wind outside. Finally got to sleep around t+10.30.\r\nAfter having had a negative mushroom experience several days before (negative thoughts endlessly looping), the one thing that I can say about my experiences with this substance (and with 2C-B) is that I LOVE the fact that I feel like my mind was in complete control the entire time. Let me stress that there was no mindfuck or mental confusion of any sort. I also believe that part of the reason for this may have been a very positive set and setting for this experience.\r\nOverall, this one is a top tier psychedelic exprience and i look forward to further exploration with this substance.\r\njaydub\n\n\n"
}