{
 "title": "Early Low Dose Trials",
 "author": "Roy Duncan",
 "citation": "   Roy Duncan. \"Early Low Dose Trials: experience with 4-Flouroamphetamine (ID 92654)\". Erowid.org. Aug 30, 2011. erowid.org/exp/92654",
 "substance": "4-Flouroamphetamine",
 "bodyweight": "205 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   " ",
   "4-Fluoroamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 92654",
   "Gender: Male",
   " ",
   "Age at time of experience: 29",
   "Added: Aug 30, 2011",
   "Views: 8232",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Thought I'd submit this primarily to help figure a dosage range for this stuff.  Not many reports as of Aug 2011, and on other sites I see a lot of people with amphetamine tolerances and poly-drug addiction problems telling me to start at 300mg if I want to feel anything. </p><p>Our guinea pig is a 29 year old male 205 lbs </p><p>No amphetamine tolerance to speak of.</p><p>In general, I am an open, positive, warm, friendly kind of a guy, they tell me.  </p><p>I consider 5-10mg of adderall to be PLENTY</p><p>I consider 100mg of MDMA to be PLENTY</p><p>I have no experience with cocaine or methamphetamine, street speed of any kind, or any of the other 4-subbed stimulants newly available.</p><p>The 4-FA is a very fluffy bright white sparkly powder. Always using a very accurate milligram scale, on normal days where I was going about my business as I would otherwise, I started with 5, 10, and 20mg doses a couple days apart.  No effect there.  </p><p>I tried a 25mg dose a couple days after that.  Possible brightening/energizing, possible placebo.</p><p>3 50mg trials produced effects which were not placebo.  All three times (spaced days or weeks apart) the effects were basically the same.  A very pleasant brightening in mood and energy.  This stuff makes me enthusiastic.  Ebullient.  Very much inclined to respond enthusiastically to requests, supply information enthusiastically, get absorbed in what's happening around me.  This makes this substance different from the amphetamine salts in Adderall, which tend to put me into either an automatic-robotic grunted response mode, or a 'talk your ear off for an hour about anything' mode.  Neither of which are really desirable, if you think about it.  The 4-FA at 50mg keeps me at a normal kind of 'knowing when to stop talking' place.  None of that NEXT thing NEXT thing NEXT thing impatience either.  Yay.  </p><p>Body feels good.  Almost reminiscent of MDMA but nothing to make me want to roll around on the floor.  I might want to roll around on the floor at 125mg, based on how it feels.  I don't have any of the physical symptoms of amphetamine or caffeine stimulation (jaw clenching, teeth grinding, pacing, repetitive fidgets).  That's a huge plus. After 6 hours the effects are still at plateau.  Seem to drop off between 8 and 10 and I did not find it difficult to sleep.</p><p>This has a friendlier character, and less of a physical load, than the other stimulants I have tried, at least at this dose.  So, 50mg is plenty for me, and maybe it would be plenty for you, depending on what you're after.</p>"
}
