{
 "title": "For Study",
 "author": "Policethepolice",
 "citation": "   Policethepolice. \"For Study: experience with Methiopropamine (ID 92674)\". Erowid.org. Aug 31, 2011. erowid.org/exp/92674",
 "substance": "Methiopropamine",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Methiopropamine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2011",
   "92674",
   "Male",
   " ",
   "Not Given",
   "Aug 31, 2011",
   "15327",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've been investigating methipropamine as a study drug, so far it seems leagues above ritalin in that it gives no comedown, or other aftereffects. About the same 6 hour duration too. Shame it's completely unresearched, but having used it 6/7 days last week there seem to be no noticeable aftereffects, which is always a good sign.</p><p>Have used between 30-70mg/day in the last week, and have settled on 35mg +15mg as great for 5+ hours of solid theory work, followed by 3-4 hours of still increased attentiveness. </p><p>35mg typically comes up within 20-30 minutes, providing an ideal level of stimulation until t+2, after which it begins to tail off, the effects are not particularly noticeable after t+4 but effects do seem to remain until around t+6. Taking after a large meal seems to reduce the effect by about 25% but doubled the effective time, removing the need to redose.</p><p>Redosing twice (35+20+15 and 25+15+20) seems to cause stomach discomfort resembling trapped air. Neither cannabis or anything else seems to shake it, but it is relatively minor. </p><p>Not much appetite suppression at this level, no need to eat but perfectly able to, no need to snack as I work like I normally do to excess. There does seem to be a certain amount of mild time dilation, in that I am not particularly aware of the passing of time and am unable to guess it nearly as well as normal.</p><p>All ROAs oral, measured with a decent lab balance.</p>"
}
