{
 "title": "Toading Saturday Night",
 "author": "Dwreck",
 "citation": "   Dwreck. \"Toading Saturday Night: experience with Toad Venom (ID 92707)\". Erowid.org. Feb 29, 2012. erowid.org/exp/92707",
 "substance": "Toad Venom",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "smoked",
   "Cannabis",
   " ",
   "  repeated",
   "smoked",
   "Toad Venom"
  ]
 ],
 "footer": [
  [
   "2010",
   "92707",
   "Male",
   " ",
   "22",
   "Feb 29, 2012",
   "5243",
   " "
  ]
 ],
 "report": "<p>My cousin and I decide to try the venom of the Bufo alvarius I had recently acquired online a few weeks ago. He is 20 and is experienced with many substances. The psychedelics of which include MDMA, LSD, and psilocybin amongst many other non psychedelics and marijuana. I, two years older, have done about all the same at fairly decent sized doses. My cousin has done vastly higher doses of these psychedelics than I have. Either way we both share a decent amount of psychedelic experience. </p><p>We milked the toad as best we could trying to be respectful as well as it was our first time attempting to do this. We got a decent portion of venom and let it dry out for many hours. I must make a note we had smoked marijuana off and on all day before the venom at least four or more times spread throughout the day. Both of us also smoke tobacco too as well as my cousin had one beer about an hour before the venom. </p><p>At about 10:30 pm it was time after we went fishing while the venom dried. We scraped it into a pile but since I don't have a scale that registers that low of a weight I don't know for sure what the doses actually were. I took about a third of the pile and packed it in a regular weed pipe atop fresh weed and then covered with ash to protect from the flame. I took the first rip off the pipe and inhaled the nasty smelling vapor although its not untolerable. Came on pretty quick but slower than I expected from reports I've read. I definitely didn't take a large enough hit to get full psychoactive potential but it definitely was working no doubt. </p><p>I took a few more hits until the pipe was cashed but it didn't raise the intensity much but it did some. The overall feeling was pretty good body wise and no really distinct visuals were apparent. Things just took on a very realistic look although it was so real looking that everything looked kinda fake if you can imagine that. I have experienced similar effect with other substances. I guess the best thing to compare it to is coming up on shrooms because it just took on that feel as I was laying on my bed. </p><p>I should have mentioned that this all takes place laying on my bed with my cousin filming and my wife watching and the room was lighted and not dark. While I was still going but coming down my cousin loaded all the remaining venom in the pipe and lays down on my bed for his turn. He rips it like a pro and gets a better hit for sure not to mention its also a bigger dose. Upon him breathing out he said, 'oh man things are going crazy.' He had a more intense experience but still was aware of everything and didn't have extreme visuals or anything. Within an hour or less we were totally normal for the most part but the most intense parts were done within 20 minutes probably. </p><p>The only slightly undesirable effect was that it was a little heavy on the head but again not untolerable and left a slight not bad head ache. My thoughts the next day were clear for the most part but the brain still felt kinda heavy for a lack of a better way of saying it. My cousin didn't express any negative feeling on his part or atleast didn't mention anything. He was greatful he tried it and said there's no feeling like that although he agreed it was similar to coming up on shrooms. We both said we would have no problem trying it again sometime. Definitely worth a try if your willing. Peace.</p>"
}
