{
 "title": "Sleeping Pill Suicide Attempt 2010",
 "author": "mark1",
 "citation": "   mark1. \"Sleeping Pill Suicide Attempt 2010: experience with Diphenhydramine (ID 92795)\". Erowid.org. Dec 25, 2011. erowid.org/exp/92795",
 "substance": "Diphenhydramine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3200 mg",
   "oral",
   "Diphenhydramine",
   "(capsule)",
   "  T+ 1:25",
   "1600 mg",
   "oral",
   "Diphenhydramine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2011",
   "92795",
   "Male",
   " ",
   "19",
   "Dec 25, 2011",
   "14480",
   " "
  ]
 ],
 "report": "<p>May 13th, 2011 (I didn't know this at the time, but apparently it was friday the 13th.  Weird coincidence)</p><p>I was on skype one night with a very close friend of mine, and another person who was a friend of hers.  For this report I'll just call my close friend J, the other girl we'll call C.  So me and J got in a terrible argument, I won't go in to details.  I got extremely upset and we all ended the call.  So I thought 'fuck it, I don't care, I'm done'.  I went in to the bathroom and grabbed my pocket knife and made several deep cuts into my leg, repeatedly.  I then grabbed my wallet, keys, cell phone, and proceeded to sneak out of the house with the sleeping pills I had already bought several days earlier, I had two boxes of Equate brand extra strength sleeping pills.  50mg each, 32 in each box.  I got in my car and drove around my city for a while.  I was contemplating whether I should take the pills or not.  I truly felt as if I had Death in those two bottles, waiting to take me.  </p><p>After 30 minutes or an hour I made up my mind and bought a bottle of water so I could take the pills.  I drove back to my neighborhood but not at my house.  I turned off the car and opened the bottle of water and proceeded to take the 64 pills, it took about 2 minutes.  I waited 1 hour for the effects to kick in.  While I was waiting, I was just messing around on my smartphone, I kept thinking 'any minute now'.  Nothing happened.  I was confused.  So I stepped out of the car, did like a 'physical check' of sorts which included a small jump, moving my arms, legs, turning my head, measuring my eye sight for any blurring or slowness.  Everything checked out fine, I was still under 'normal' condition.  I got back in the car, turned it on, and drove to walmart to buy another box.  [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I stepped out of my car, walked in to walmart, I still felt perfectly fine and it had been 1 hour and 15 minutes. I proceeded to go to the medicine aisle and bought a box of 50mg 32 in each box equate brand sleeping pills.  I bought them, and got back in my car and took all 32 of them.  So far, it had been roughly 1 hour and 25 minutes.  So my total was 96 pills, roughly 4800 mg so far.  </p><p>I was a little hungry, so I went across the street from walmart and ordered cheese sticks from Sonic.  And this is when my memory blanks out.  I remember absolutely nothing from this point on.  I assume I blacked out or something.  During this whole blackout period, it felt as if I were dreaming.  I remember my hands being strapped down, I was weak, my hands were INSANELY shaky.  I was in a bed of sorts.  I saw a priest who touched my head, he looked familiar.  I remember telling the nurse I had to go to the bathroom right now, and she told me 'you can't, you might fall' and I promised her I wouldn't fall and I begged her to let me go but she wouldn't.  I remember looking to the left, only to jump and freak out when I noticed my mom to the right of me.  I did that like 8 times, it freaked me out really badly for some reason.  I then remember lying down almost completely flat on the bed, and no matter how hard I tried I couldn't lift myself up more than an inch or so before giving up.  All of this felt like a dream.  It would feel identical to dreaming any other night, the only different would be a slightly more vivid dreaming experience than normal.  </p><p>I was awake during most if not all of this time, but I did not gain coherent consciousness until about monday/tuesday, and I took the pills friday night.  I was in the hospital the whole time I thought I was dreaming.  I was told that my heart rate was racing, my blood pressure was incredibly high, and my pupils were massive.  I was told by the doctors that had they not found me, I would have died.  I was then isolated in a wing of the hospital with other people that had attempted suicide, were skitzofranic, or had other severe mental issues.  It wasn't a nice place.  I have never been to prison, but from what I've seen on tv and movies, I'd call this place a 'nice' prison.  All the windows were caged, the walls were brick, the glass windows were either plexiglass or shatter proof.  The place was locked down.  There is no conceivable way to escape.  I stayed there for one week.  I was then relocated to a state hospital for further monitoring because I was evaluated to be at a 'high risk' of a second attempted suicide.  </p><p>So I was at the first place from May 15th until the 22nd.  From the 22nd until June 3rd, I was stuck at the state hospital.  Both of those places were absolutely horrible and mentally scarring.  There were weird people there, mentally unstable people.  And the boredom there, it's massive.  Pretty much the only thing you look forward to is breakfast, lunch, and dinner.  And they don't give you enough food, and that's coming from someone who was 125 lbs at the time.  Everyone always asked for more food, the doctors kept saying that they were putting us all on 2000 calorie diets.  Some of those guys in there were 200+lbs.  </p><p>Regarding long term effects to a Diphenhydramine overdose (not long term usage): I took 4800 mgs, as far as I can tell I'm still in excellent physical condition, both mentally and physically.</p>"
}
