{
 "title": "Making Music High",
 "author": "Brian",
 "citation": "   Brian. \"Making Music High: experience with Cannabis (ID 9280)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9280",
 "substance": "Cannabis",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "1.0 g",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9280",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 5, 2005",
   "Views: 5627",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWell, I was sitting around my house thinking about what to do because my parents were gone for the week.  I decided to call up a few guys and toke a bowl or 4.  Friend A and B came over and we toked in the backyard.  It was some really good weed, but thats typical for oregon.  It was one of those 'one nug' eigths.  Once we we're extremely high, friend B started playing super mario 64.  Me and friend A decided we'd go out to the drum room in the garage to play some music.  I got on the drumset and Friend A got on the guitar, even though he didn't play!<br>Now, I'm a pretty good drummer sober, but when I'm high, the playing of drums takes on this spiritual, intense quality.  The drums sounded just perfect and the sticks felt like natural extensions of my hands.  I put on Tool's new CD 'Lateralus' through the headphones and played to it.  To my disbelief I hit everything exactly.  For some reason...my ability to percieve the timing of a song increases incredibly while high.  The beat naturally nestles itself in my mind and stays there, allowing me to improvise naturally over it.  Also, my mind strays to these complex thoughts about the 'importance' of my playing, and the general 'coolness' of hitting drums with sticks in different patterns.  Also, my creativity levels are at an all time 'high' will high (excuse pun).  My brain seems to be able to spontaneously come up with ideas more readily when stoned.  This all goes for the guitar too.  All the little riffs and techniques that are slightly beyond my sober grasp allow themselves to be played when im stoned.  Odd timings, emotional influxuations, almost sexuality permeate the guitar and amplifier.  <br>I can definately see how many of the world's most respected musicians are High 24/7, because of the incredible creative power THC seems to impart.\n\n\n"
}
