{
 "title": "Seizure and Hospital Trip",
 "author": "back on track",
 "citation": "   back on track. \"Seizure and Hospital Trip: experience with Alprazolam (Xanax), Ephedrine, & Caffeine (ID 9281)\". Erowid.org. Jun 22, 2004. erowid.org/exp/9281",
 "substance": "Alprazolam (Xanax), Ephedrine, & Caffeine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Alprazolam",
   "(daily)",
   " ",
   "75 mg",
   "oral",
   "Ephedrine",
   "(pill / tablet)",
   " ",
   "  ",
   "oral",
   "Caffeine",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9281",
   "Female",
   " ",
   "Not Given",
   "Jun 22, 2004",
   "Views: 37142",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>[Erowid Note: Although the author attributes their problems to ephedrine use, there are a number of medical case reports of seizures following abrupt cessation of regular alprazolam (Xanax) use.  It may well be that the problem they experienced was related more than the alprazolam than to the ephedrine or (more likely) a combination of the two.]</p><p>As a long time, regular ephedrine user, i never would have imagined calling mini-thins 'dangerous.' i had previously been addicted to crystal meth for about 2.5 yrs, but had quit over one year ago. in order to deal with the major withdrawal symptoms and get up for work in the morning, i had been taking maybe 60-100mg daily. an unsatisfactory substitute, but relatively harmless, i figured, and it allowed me to function. compared to meth, which had me coughing/ sneezing up blood, deeply in debt, and losing touch with reality, ephedrine seemed like no big deal. to compensate for the accompanying irritability and nervouseness, i would often take xanax or ghb in the evenings. while i was not on either at the time of the seizure, i wonder if the fact that i had quit taking xanax fairly abruptly a few days before might have had some influence.</p><p>anyways, i had driven to chicago for a day's vacation one hot, humid summer day. i had taken about 80 mg over several hours to stay awake while driving. i remember feeling unusually crabby and nauseous after eating a meal at a restaurant. walking back to the car through the crowds, the last thing i remember is feeling horrible and drenched with sweat, boiling and freezing at the same time. next thing i know, im waking up in an ambulance, being rushed to the emergency room.</p><p>the story as told to me later by my boyfriend: i got into the back seat of the car and we drove away. while talking to his friend, my boyfriend caught sight of me in the rear view mirror, flailing around. he thought i was joking, but when i didn't respond, he turned around and realized that my lips were blue and i was having a full-on seizure. i have no medical history of anything like this. they pulled the car over and called 911, and followed directions to keep  me from choking, etc. by the time ems arrived, i was no longer seizing. apparently, (i don't remember this) i adamantly refused to go with them at first, but when i tried to walk, found i could not, and began vomiting violently, i agreed to follow them. in the hospital, they could not find anything wrong, except for an out of whack blood pressure and blood sugar level, which they quickly stabilized and released me. it was a busy inner-city hospital, and i was hardly a priority. they gave me an anti-nausea prescription and sent me on my way.</p><p>worst of all, i was so used to ephedrine, i dont even remember if told them i had used it. it was only in retrospect, as i researched ephedrine on the internet, that i realized that it was the most likely culprit for having caused my seizure.</p><p>since then, i have, of course, quit. to my unpleasant surprise, however, i have found fairly severe withdrawal symptoms. i am constantly lethargic, and my brain is fuzzy. still, i am much happier, and realizing what could have happened (what if i had been DRIVING when i had that seizure!), would not go back for the world. please, fellow travelers, don't go down this road!</p>"
}
