{
 "title": "Wow...Awesomeness",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Wow...Awesomeness: experience with Adderall (ID 92851)\". Erowid.org. Jun 16, 2013. erowid.org/exp/92851",
 "substance": "Adderall",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "60 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "  T+ 0:30",
   "30 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 92851",
   "Gender: Male",
   " ",
   "Age at time of experience: 16",
   "Added: Jun 16, 2013",
   "Views: 8816",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It all started roughly at the age of 10. My mom and I both thought that I had ADD/ADHD but never had credible proof. We decided not to see a doctor for the big reason that the drugs prescribed to one with ADHD typically are highly addictive and can damage a developing brain.</p><p>Fast-forward a few years to 8th grade. My discipline and behavior in school was horrid to say the least. Around the middle of April, I first tried smoking cannabis and I instantly fell in love with the drug. I smoked many many times and I thought it would be cool to try something different. At the age of 15, I took 240mg of DXM after extensive reading and comprehension of the drug. It was an eye-opening experience that clicked something in my mind that said 'Wow, I never knew that other drugs could be this fantastic!' I soon put on my mental bucket list to do every drug that can give a sense of intoxication once. Honestly, all I wanted to do was try a drug every couple of years, and reflect on my experience as a drug enthusiast.</p><p>Now at roughly 16, my friend WM that I met previously but never really talked to, was on my bus. He showed me the 7 adderall 30mg capsules he had since he had a prescription. He doesn't know the first thing about selling drugs, so I took advantage and bought the 7 pills for 5 dollars! I had intentions of selling the drugs but after not finding anybody to buy (most of my friends do pot and alcohol strictly) I decided to try it to see what the hype was about. WM takes 2 30mg capsules a day so I figured to do the same dosage. This is my experience:</p><p>T+0:00. I swallow 2 pills and just kinda fuck around on Facebook until the effects started to kick in. I was decently hungry at the time and also very jittery and my thought process was all fucked up (as usual).</p><p>T+0:30. After not really feeling anything, I decided to take another pill. Afterwords I felt my heart started racing and I felt a little different. I decided to play xbox for a little bit and soon afterwards in started to kick in and I didn't even know.</p><p>T+1:30. Now the effects are apparent throughout my whole body. I become light-headed like after a couple cigarettes and I felt absolutely normal. Now, take into account that I thought before this that I might have ADD or ADHD, and now I'm 100% positive I do. For some strange reason, I was more relaxed and still at this point, a feat which is obliviously impossible sober. No dilated pupils or any physical signs that I had even taken an amphetamine.</p><p>T+2:00. I feel much different than I did 2 hours ago. I felt very calm and at ease, which I thought was strange because I heard of people having intense and wonderful euphoric feelings coming from this drug. After a little bit of thought analysis and research, I found that 90mg of adderall is a moderatly-high dosage for a first time user. I self diagnosed myself with ADHD right at that very second. I always talk to myself for some strange reason, but on this stuff...wow. I couldn't stop talking, I wanted to talk to anybody whomever they may be, and soon had a full-blown conversation with myself which I actually enjoyed very much (sat down in front of mirror and acted like I was on camera being interviewed by myself on the drugs I have taken and the feelings they gave me). Hell, call me crazy but I think it's healthy for anybody and everybody to talk to themselves. You can see yourself for who you really are.</p><p>T+3:00. Everything is at peace with me and my surroundings. I felt incredibly comfortable and could lay down, sit, or even stand completely still. This was a wonder drug for me, and I soon came to reasoning that I should do my homework and see if I can do it more efficiently. I finished the assignment within 10 min which would have easily been a 30min-1hr assignment sober. I felt accomplished at my good deed (since I usually lack motivation to do any homework at all).</p><p>T+3:30. We are now in the present time of writing this at approx 6 o'clock. I have no desire to eat, sleep, or masturbate which I always feel the need to do those three things at any time of day. Further research concluded that low sex drive, awakeness, and no desire to eat were all side-effects of the drug. I am usually a terrible writer and never write things in my spare time unless if I'm stoned, but I think after writing this I should see if I can turn this into my English teacher for extra credit lol.</p><p>Overall, thus drug works absolutely fantastic for someone like me. I have social awkwardness (but do have a lot of friends), insomnia (which can be resolved from the come-down), and now another self-diagnosis to the list ADHD. I am thinking about telling my mother about this experience today to get me a prescription of this. There is no greater sense of euphoria then to realize you were absolutely normal, even under the effects of a very powerful stimulant. I am also thinking about taking 30mg tomorrow morning to help me focus in school and see if it can improve my attitude in school positively. However, I also thought that taking some codeine before school would be pretty fun too, but I'm not sure if mixing those two drugs are safe.</p><p>All in all, I give this drug a 9/10. The only thing it lacks for me is a sense of intoxication. To give you some insight on my 1-10 scale, I will also show what other drugs on the scale rank for me (my experience at least).</p><p>Caffeine: 1/10 (because I am never any different after I drink coffee) probably because of my condition.</p><p>Alcohol: 9/10 (only 1 point off from 10 because it's obviously bad if you want to drink more, but your puking your guts out).</p><p>Cannabis/Weed/Pot/Whatever people call it: 11/10 (sill my number 1 drug of choice)</p><p>Tobacco: 6/10 (almost no noticeable buzz after many times smoking, but it is very enjoyable to smoke for me).</p><p>DXM: 8/10 (only reason why this is barely shy of nirvana is because I feel that this drug can be harmful if done alot overtime, unlike cannabis which can be smoked everyday without remarkable drawbacks mentally, and none physically).</p>"
}
