{
 "title": "Experimentation Successful",
 "author": "BigRed",
 "citation": "   BigRed. \"Experimentation Successful: experience with 25C-NBOMe (ID 92870)\". Erowid.org. Sep 26, 2011. erowid.org/exp/92870",
 "substance": "25C-NBOMe",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "250 ug",
   "insufflated",
   "2C-C-NBOMe",
   "(liquid)",
   " ",
   "250 ug",
   "insufflated",
   "2C-C-NBOMe",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "Alcohol - Hard",
   " ",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 92870",
   "Male",
   " ",
   "20",
   "Sep 26, 2011",
   "Views: 7438",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This report is of me and three of my friends first experience with 25C-NBOME or Boom. The doses were administered on a Saturday afternoon. All three of us, me, M, L, and A, were all mentally prepared and experienced with natural psychedelics and 2-CX analogues prior to this trip. My friend M had acquired a large quantity of this substance through an online dealer and it was extremely pure and accurately weighed. The doses of this chemical are SO SMALL that a scale or precise dilution measurement is necessary. We prepared the solution so that each hit was 125 microliters of ethanol/water solution and equaled 250ug in mass of 25C. My friend has a room extremely conductive to psychedelics, and we were all in a very familiar setting. We all lay down on the floor and 250ug was administered nasally.</p><p>T+0:00  =  dose is administered to me , M, L, and A. The mixture produces a moderate burning sensation and nausea. </p><p>T+0:05 = First effects are felt. General sense of uneasiness. I have a feeling that I cant move from the bed Im lying on and I vomit for another 5 or 10 minutes. After puking I drink some soda and start to feel much better.</p><p>T+0:30 = FULL effects are hitting now. The whole room is breathing and waving smoothly, and the air conditioner in the room begins to sound like a synthesizer that began to change pitch. I am astounded by how quickly the chemical has hit me, and I cant think about anything but my surroundings. I am hit with a very similar wet feeling like 2ce. After puking, it becomes a very clean trip. The strobe lights and lazers in the room are amazing and I feel like all the posters in the room are becoming 3d. There is a beatles poster on the ceiling that demands my attention, I feel like it will keep me sane, although it looks liquid in form.</p><p>T+ 1:00 = M, L, A, and I begin to settle into the peak of our trip. L has to constantly use the bathroom, but is still enjoying herself. A has began eating candy and playing with lazers. I start to glowstring in the corner and Im AMAZED by the trails and colour changes I get on this chemical. I also feel a very enjoyable body buzz. Similar to M1 or MDMA.  </p><p>T+1.30 = We all take a walk around the town and the sun and atmosphere is very enjoyable. Visuals outside are intense but very satisfying. I feel like I can control my trip, much like I can on lsd. We sit outside and smoke cigarettes then go inside for a redose.</p><p>REDOSE at 6.15 = Much easier than the first dose. We all lay down on the floor for a good hour for this dose. Being comfortable makes an enormous difference on nausea. Continued to trip very similarly for the next hour. We all noticed same drastic temperature changes on this chemical. We went from being very cold to very hot in a matter of minutes. Conversation was fluid and intellectual, but as we started to come down it became scattered. </p><p>9.00pm = visuals have subsided for the most part but we are still definitely tripping. Me and M go back to my place and party with a large group of friends. I have some 100 proof vodka and smoke a few joints and I find it complements the trip very nicely. I am unable to go to sleep until 7am, however, and sleep until 5pm the next day. An afterglow was felt the next day but I was definitely not feeling fried.</p><p>In conclusion: I would highly recommend this chemical. It is captivating and the visuals are astonishing. It is the closest feeling to lsd Ive ever had with an RC, and as long as you are comfortable on the comeup there is no nausea. Redosing is a valid possibility on this chemical, and it seems like the trip can be increased by an extra 3 hours per redose. I expect the drug itself, without a redose, should last around 5-6 hours completely. With the peak coming on in 10-30 mins and lasting 2 or 3 hours. Future experimentation will include different ROAs, including sublingually and anally. Dose will also be increased to 400ug. Thanks!</p>"
}
