{
 "title": "The Addiction Saviour",
 "author": "Yesterday",
 "citation": "Citation:   Yesterday. \"The Addiction Saviour: experience with Baclofen (ID 92881)\". Erowid.org. Jun 4, 2012. erowid.org/exp/92881",
 "substance": "Baclofen",
 "bodyweight": "77.9 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Pharms - Baclofen",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 92881",
   "Gender: Female",
   " ",
   "Age at time of experience: 24",
   "Added: Jun 4, 2012",
   "Views: 5805",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had suffered from moderately severe depression for a couple of years. I had been drinking heavily during this time. I was obsessed with the idea of dying...I wanted to be dead and had researched the lethal dosage of a few drugs and taken a dosage higher than that which I had read about. After being prescribed five different SSRI's/SNRI's, as well as a couple of benzodiazepines...and my depression not responding to any of them...I decided to try something that would apparently instantly relieve my depression.\r\nGBL (which converts to GHB in the body) really did instantly relieve my depression. It made me more sociable, destroyed my anxiety and actually made me get things done...for a while. I re-dosed constantly (after every 2-3 hours...and then after a few months I would re-dose once an hour). After a couple of months I decided I was taking too much because it was starting to have a very negative impact on my life. I was withdrawn, falling asleep all of the time and becoming hyper-sociable. \r\nI STUPIDLY didn't realise that it was physically addictive and went to bed without taking ang GBL one night. I awoke about three hours later shaking, hallucinating and vomiting. I then read more online and realised I was physically addicted.\r\nThis went on for a further 6 months. I put my family though HELL supporting me through my addiction...relapsing...it being CONSTANTLY on my mind...stealing...getting more GBL...collapsing...being hospitalised...going to rehab.\r\nI had been prescribed baclofen (an agonist of the GABAb receptors...just like GBL...and so stops the withdrawals) but had only been prescribed 30mg a day (3X10mg doses a day).\r\nOne day I was so sick of the neverending addiction (which was literally HELL) I decided to take my full 30mg allowance at once. It completely ERADICATED my psychological need for the drug.\r\nI titrated my dose to between 80-100mg a day and for the first time in what seemed like forever, I had completely stopped thinking about GBL. I began functioning normally...like I was before my depression and addiction. I have also noticed a massive decrease in my desire for alcohol.\r\nMy family and friends re-found their trust in me. Everybody has commented on how much I seem normal again.\r\nIt was around this time that my depression, for the first time in years, felt suddenly lifted too. I am now of an apparent normal state of mind. All of my wonderfully strange personality remains...baclofen has taken nothing away from me and given me everything back.\r\nI understand that stopping the use of baclofen can have horrible withdrawals...but in time I will slowly decrease my use of baclofen.\r\nFor anybody that is struggling with their GHB/GBL addiction (or alcohol addiction) then please consider baclofen. I have a few friends that were addicted to GBL, and after advising to them about baclofen...have also experienced the same amazing results.\r\nGood luck, and stay educated and safe.\n\n\n"
}