{
 "title": "Very Bad Night",
 "author": "Beader",
 "citation": "   Beader. \"Very Bad Night: experience with Morning Glory Seeds (ID 9288)\". Erowid.org. Aug 25, 2002. erowid.org/exp/9288",
 "substance": "Morning Glory Seeds",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "300 seeds",
   "oral",
   "Morning Glory"
  ]
 ],
 "footer": [
  [
   "2001",
   "9288",
   "Female",
   " ",
   "Not Given",
   "Aug 25, 2002",
   "Views: 15043",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nHello.  This is my first time submitting an experience, but I think it will be worth it if someone can learn before they do it.</p><p>Yesterday a friend of mine dropped off a conatiner of 300 morning glory seeds that were the consistency of a a very fine powder.  I was alone when I consumed and experienced it.  I mixed it all with applesauce and just ate it...it had the consistency of bran mixed in the applesauce.  (Funny thing is, after I poured about half the mixture in to the applesause, I paused, thinking 'I wonder if this will be too much?  Nah....') I did not eat a meal prior to the applesauce, by the way.  I ate it about 7:30-7:45pm.  I was feeling well and have not been sick, like with the flu or anything like that.</p><p>About an hour later, I started feeling the typical nervous jitteriness that accompanies an LSD trip.  My muscles in my shoulders ached, and I noticed a very light numbing to my extremeties and face. Not to forget the accelerating visual hallucinations. The nausea that followed wasn't severe, in that I didn't have really bad cramping or anything....it was more like just the thought of drinking water or putting a cigarette in my mouth was nauseating enough.  It became difficult to follow my solitaire game on the computer, so I decided to just turn out the light, turn on the tv and put a fan directly on me.  I watched a show about underwater cave diving that was just phenomenal.  Then the 'fun' part ended.</p><p>This is where time ceased to exist.</p><p>I experienced absolute uncontrolled sweating...I mean it was just pouring off my face and arms for probably 2 hours, but I'm not sure, despite the fan less than 5 feet from my face.  It became difficult to concentrate on the television, as my vision became SO hallucinated that everything surrounding me shifted, moved, blended in with everything else.  This part is hard to describe, but there was this extreme nervous pulsing that my whole body felt...as I lay there it felt like every 3 seconds I was falling off of a cliff or something...a very vertigo-ish sensation.  And this part was almost the worst:  My body acted like it was going to cease breathing involuntarily.  I had to consciously inhale-exhale-inhale... and if I didn't, my body just laid there motionless....I could have stopped breathing altogether if I so chose to.  I had to keep moving moving my body...I was afraid that if I did I'd die.  And the fear of dying right there wasn't just part of the hallucination....I had no idea how far this was going to go.  I also for a brief 'time' was faced with some spiritual challenges I had been ignoring...not surprising, since I thought I wasn't going to wake up in the morning.</p><p>I began the diarrah-bout, losing SO much water in the process.  I could barely get myself to the bathroom because my surroundings were so hard to comprehend.  My body felt like an automaton, which I am grateful for, or else there would have been REAL trouble.  I couldn't really cry though I desperately wanted to, because I think there was literally no water left in me.  I couldn't get up and get water.  I just laid there wondering if I was in fact killing myself, as my body was responding so severely to the morning glory seeds.  </p><p>I ended up calling my brother, who was out of town on business.  If it weren't for his calm rational words I don't know how long I would have lasted.  My senses were totally out of control, and the idea of calling 911 frightened me even more.  I didn't want to be seen in the state I was in.  Too damn proud, I guess.</p><p>So I kept the tv on, just to have some sort of external stimulation there in the background to remind me where I was.  Then after I went to the bathroom (again), I threw up big time.  Granted it left me much more relieved...the vertigo pulses subsided, and my muscles stopped twitching as much as they were.  I remembered to brush my teeth after the fact, too.  But I was still very worried about dehydrating to a dangerous level.  My body was exhausted, my mind was reeling into oblivion, and I just gave up.  I finally managed to relax to the point where I wasn't so afraid.  I don't know what time I finally dropped off into a dreamless sleep...I think I remember last seeing the clock around 1:30 am.  </p><p>The phone rang at 7:45 am...my brother called to check on me.  I was so relieved to be able to answer it!  I still had some jitteriness and my vision was very sensitive to sharp edges and texture.  I had to move slowly.  </p><p>I'm sure the dose was just way too much...300 pure grounded seeds.  No additional preparation other than that.  I intend to use much less next time, if there is a next time.  The hallucinatory visuals got very extreme but in and of themselvs did not scare me as much as the physical purging and involuntary twitching/breathing problems that accompanied it.  I think that if someone had been home, I would have ended up in the hospital, which I'm grateful didn't happen, as I don't have insurance.  Stupid point, I know.  But it was definitely on my mind during the 'trip'.  What would my mom think?</p><p>If anyone out there hasn't done it and is thinking of consuming the seeds, BEWARE!  I know everyone's threshold is different, but go easy on it...don't do 300 for your first time.  I've done morning glory seeds before, using various evaporation techniques, but they were just an infitesimal fraction as severe as my experience last night.  I don't know if I'll do it again...I probably will, but just cut way down on the dose, to MAYBE 1/10th the volume of seeds consumed.  I enjoy an occasional psychedelic experince, but this was just WAY TO REAL.</p>"
}
