{
 "title": "Like a New Born Baby....",
 "author": "RebornOnARoll",
 "citation": "   RebornOnARoll. \"Like a New Born Baby....: experience with Ecstasy (ID 929)\". Erowid.org. Oct 10, 2000. erowid.org/exp/929",
 "substance": "Ecstasy",
 "bodyweight": "153 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2000",
   "929",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 10, 2000",
   "Views: 7098",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI am a very bored person, if that makes sense to anyone. I used to always look for ways to amuse myself, including drugs and alcohol. I had just gotten involved with this guy, he was a raver and he had done ecstasy a few times. I saw this as a chance to try a new drug. After a long talk about what it was like, he took me with him to a rave. This was my first. I was very nervous at the rave, it being something completely new to me. I immediately sat down and started smoking. My boyfriend asked me for my money, and I gave it to him knowing what it was for. He told me he was going to go dance a little bit and then try and get us some pills. </p><p>After about 15 minutes of me sitting by myself, shy and nervous, he came back with a present for me. I got so scared, I had never done this drug before, had no idea what it would do to me, and had no idea what it was really. I just ignored my doubts, knowing that if I passed up this chance I would always wonder. So I took the pill by chewing it and then swallowing with lots of water. The taste was very, very bitter. I started to freak out inside. I was scared that I had just taken a drug that could possibly kill me, make me very sick, or just plain give me a bad trip. I just sat there for the next 20 or so minutes, my boyfriend had gotten up to dance. I would not dance with him, I had never danced before and I was very shy and nervous all the time back then. </p><p>So I was sitting there keeping to myself completely, mainly wondering if I would fit in at this scene. Some girl came and sat by me, and she kept trying to talk to me, which made me uncomfortable because I was so shy and all. All of a sudden it's like I heard water or something, like a waterfall, and I started to feel very lightheaded and odd. I was getting very scared, I knew the pill was kicking in. </p><p>I got up to go find my boyfriend, once I found him I told him I needed to get outside, before I passed out. On the way out the door I started to actually feel good, and happy, and warm. I looked at the world outside, and saw so much beauty. There were about 30 or so trashcans, mainly red and orange, all together in a corner. As my boyfriend was walking to his car, I veered towards the trashcans. He thought I had gotten lost on the way, but when he got over to me, I just told him, 'Shh...be quiet and look....is that not the most beautiful thing you have ever seen in your life?' He just stared at the trashcans and then at me and said, 'oh my god that's amazing.' After probably 2 minutes of just looking at them, we started our walk to his car once again. </p><p>Once we got in the car, I told him to close his eyes, and I led him into a fantasy world. I told him to picture a lake in the brightest time of the day, with the water a golden color reflecting the sun's rays. Although he should have been my guide, I became his. All of a sudden I was the E expert. Any questions he had I had an answer for, it was like I had memorized word for word everything I had ever read about this drug. We talked about all things, I started telling him about my life in great detail, things were coming out that I had never told another living soul. Nothing but truth and confession. I had held so many things in for so long, and it was like MDMA helped me push through this giant wall. Once everything was out, I felt such a tremendous amount of freedom, I felt reborn. I was looking at the world with a whole new perspective, everything held so much beauty and amazement for me. I sang and it was so beautiful. He told me all about his life in great detail also, and I understood everything. I was like a new born baby, completely innocent and full of hope and new prespective. </p><p>I found something wonderful that night...I found myself.</p><p>I have done ecstasy many times since that first magical night. It has always been the same for me, a truly spiritual experience, only now I find I become a mommy, taking care of everyone. :)</p>"
}
