{
 "title": "Demonic Parallel Universe",
 "author": "mindexplorer",
 "citation": "   mindexplorer. \"Demonic Parallel Universe: experience with DiPT, Etizolam & MDMA (ID 92924)\". Erowid.org. Feb 6, 2012. erowid.org/exp/92924",
 "substance": "DiPT, Etizolam & MDMA",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "DiPT",
   "(powder / crystals)",
   " ",
   "  ",
   "oral",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 92924",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Added: Feb 6, 2012",
   "Views: 16402",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Trial 1:</p><p>35 mg DiPT</p><p>.5 mg etilozaam</p><p>.1 MDMA  2.5 hours later</p><p>Report 1:</p><p>Felt virtually nothing. I feel as if the etilozaam just completely counteracted the effects. There were no cognitive effects. Body-wise, I felt kind-of warm. I was at a shpongle concert, and I was in the mood to dance and have fun. Auditory-wise, there was only a mild deepening of voices that was barely noticeable. While at the concert, I bought some molly, and the molly mixed well with the DiPT. The effects of molly were basically all I felt that night. The DiPT did virtually nothing.</p><p>Trial 2:</p><p>70 mg DiPT</p><p>0:00 - Decided to take 70 mg of DiPT, mixed with water. The substance tastes terrible! I just drank it as fast as I could.</p><p>1:00  I feel normal. Very slight deepening of voices, but nothing that special. I dont feel nausea, but my friend J does. My friend J is trembling, producing mucous, and feels very nauseous. He almost had to throw up, but didnt. No cognitive effects whatsoever for either of us.</p><p>2:00  These time frames are just arbitrary, but sometime between the 90 minute and 2.5 hour mark, the effects of this drug had fully manifested itself. This is certainly a strange one. Cognitively, me and J felt stupid. It just made us think slower, and there is this tryptamine feeling in our heads. But basically, you feel normal. Visually, when we went into the park, we noticed a wave-like pattern in the grass and sidewalk. It was very mild, but kinda cool. J was physically effected very strongly by this drug, and felt like he should be experiencing powerful hallucinations, but we werent, visually at least.</p><p>In terms of auditory effects, we felt like we had entered this demonic parallel universe where people had no souls. Music sounded terrible. Everything was flat and out of tune. We listened to gorillaz, and it was just god-awful. Music just sounded broken, and evil. I played dj-hero, and listened to other music as well. Honestly, it was really entertaining, because this drug just effects the auditory cortex in the strangest ways. Some songs sounded normal. Some parts of songs sounded normal. The deeper the notes, the more 'off' they became. Really deep sounding instruments or notes sounded like they were filtered through metal, or some demonic machine. It sounded machine-like and just weird and chopped up. The middle-to-low range notes were the strangest though. Just out of tune. Everything was just out of tune, and not out of tune together. There was this asymmetrical alteration of music where the notes were non-linearly out of tune with one another.  Sometimes when playing a song twice, it would sound different than it did before. Everything just sounded demonic, like we had entered a Star-Wars parallel universe, where robots produced music, but nobody had like the creative drive of humans. </p><p>Music I would recommend listening to: Gorillaz, Screwed/Chopped music, boards of Canada, and in general, songs you are very familiar with. WARNING: DO NOT LISTEN TO MUSIC THAT YOU LOVE. It will ruin it. Youll just never feel the same about that song. Listen to music you like. I purposefully did not listen to Pink floyd or the Beatles. </p><p>6:00  The effects were dissipating. I felt completely normal, but there was still some auditory distortion, mild though. Fucking weird compound. Im relieved I dont have to live in that demonic universe anymore.</p><p>Next morning: The effects are basically gone. Gorillaz still sound ever so slightly out of tune, but nothing like the previous night. Screwed and chopped sounds normal. Boards of Canada sound normal. Actually feel pretty good. Felt great for about a week. I was a little depressed before the experience, and the depression left.</p>"
}
