{
 "title": "The Fiery Borderland Between Realms",
 "author": "Powerwolf",
 "citation": "   Powerwolf. \"The Fiery Borderland Between Realms: experience with Ayahuasca (ID 92949)\". Erowid.org. Jul 11, 2013. erowid.org/exp/92949",
 "substance": "Ayahuasca",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Ayahuasca",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 92949",
   "Male",
   " ",
   "Age at time of experience: 23",
   "Jul 11, 2013",
   "Views: 505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Several years after first hearing of the legendary vine of the soul, it was finally time for me to travel far beyond the regular frame of mind. Alone in the dark of my apartment, the winter wind howling outside, a brew was made. It's vile and bitter taste was a small price to pay, considering the reward that was now slowly approaching.</p><p>Waiting for the journey to begin, I meditate in front of the music video 'Euchari' by Garmarna. It's based on an old medieval christian chant, and though I'm not christian myself, the song and imagery are mysterious and fitting for tonights event.</p><p>The first thing I notice, is this sense of connection to something mighty... Something holy... I find myself feeling the agony of the man in his deathbed in the video, and I feel deeply present in the ruins of the withered cityscape. I'm compassionate, but as an outsider looking in...</p><p>Nausea. Trails of light when moving eyes. Strange lines of color on top of my ordinary vision. The contures of my hand are moving in wavelike motions. A brightly colored bag of dried berries on the table appear to breathe, reminding me of some rainforest frog. My sense of smell strongly increased, to my great fascination. Looking up on the wall, I discover how the wallpaper patterns have turned to ancient-looking hieroglyphs!</p><p>Standing up, a space shuttle filled with euphoria is launched within me. I feel tall by miles, and my arms reaching to each end of the room. My perspective is disturbingly skewed, making my furniture look like Picasso paintings. I close my eyes, entering a dark landscape burning with blue flames. I burn along with them - with life, and might, and it is a sensation I hope will last forever!</p><p>But suddenly nausea hits me hard, and the time has arrived for 'la purga'. In a nearby bucket, I puke out negative and evil emotions, along with foul remnants of the brew. It's not as bad and lasting as I've expected, and I immidiately feel better, leaving me thinking 'That's it?!', as if I'm being welcomed by the plant spirits.</p><p>The glyphs on the wall... They're now moving! Turning into living figures - humans and animals. Scenes of hunting, funerals, breeding, magical rituals - all aspects of ancient human life seem to be represented in this wild flowing drama - like a cave painting turned into a movie screen!   </p><p>While deeply immersed in this experience, I'm able to snap out if it, realizing I should turn off the computer, humming in idle on my desk. Being 'under the influence', I fumble, and accidently click up this youtube link of the bodybuilder Dorian Yates, posing to orchestral music in the Mr.Olympia show during the 90s'. The music sounds warped, it's tempo speeding up, echoing like a cathedral hooked up to a powerplant! I can somehow feel Dorian's quest for glory, his gathered pain and effort from years spent in a cold hard cellar gym. Also, his hair has turned green and his skin purple, reminiscing an eggplant. Hmm?!... I manage to shut the computer down.</p><p>Then it hits me for real. Now at first, I feel a degree of fear. What have I gotten myself into? A regular tsunami of fragmental thoughts surges through my mind, and the grip on reality feels very frail. There's no going back now...</p><p>On my way to the couch, my initial fear gives in to a sense of wisdom and security. 'This is right', is my last thought, sitting down, before being sucked into a green organic glow, as my senses explode in beauty. Behind closed eyes, I'm having a behind-the-scenes tour of the very creation itself. Millions of cubes are arranged in perfect combinations, and an eternal flow of orange geometry shapes and reshapes.</p><p>Dreams I had forgot from years ago, return clearly. Time seizes to exist. It's impossible to finish a complete sentence. Bombarded with an infinite number of impressions, there is nothing else to do but to go with the flow. I reach insights about myself and the origins of human behaviour in general. The sacred plant compounds  have unlocked the full hidden abilities of the brain, and the road now lies open ahead.</p><p>With effort, I go to the bathroom to look in the mirror. My pitch black eyes stare at the face of a hundred different people from past lives, as my face keeps changing. This morphing reminds me of the transformation scene from 'An American werewolf in London', and I laugh inside in a sinister way. Turning the light down low, using the dimmer, I take note of three mist like entities behind me, wearing robes like the Nazguls from Lord of the rings. For some reason, this is not scary at all, but rather significant somehow. </p><p>I turn the lights all out, giving the room a cave-like quality. Small amounts of light seeps in from the closed door, having it appear like some kind of mysterious portal. I lean against the wall and melt through it for the longest time. Is this a way to other dimensions? Trough solid objects? An unknown amount of time passes, before I return, and leave the bathroom.</p><p>I go to my bed. I lie down, and the moment I close my eyes, I see skulls. Lots of them. Big piles of skulls and bones, against a brown and soily backdrop. But this turns to a dark forest right away. I come across a woman leaning forward, and she turns her face towards me - the face of a horrible witch-demon! Concepts of evil and abandonment passes me. </p><p>This is then replaced by a warm comforting presence, and soon I'm travelling through an inner world of vast green jungle. Treetops, fields of flowers, all wonderful. Suddenly I start rising up through the skies, space, and even the whole universe. On my way, I'm being confronted by archetypes such as the warrior, the wise old man, different types of rulers and so on. Ancient scenery taking place - Aztecs, pyramids, relics held up to reflect the sun, men with armour of gold. I reach a level where something epic appears - a face or ceremonial mask shining brighter than the sun, in shifting swirling colors. It is in a perpetual state of recreating itself, and cannot be fully comprehended. It's like divinity taking form, hovering in a volcanic eruption of unlimited energy.</p><p>This vision then turns to a magnificent rainbow in 3D, and to a divine blue creature wearing royal jewellery, pointing toward a field of corn. I'm flying into the spiralling DNA of the corn cells, revealing a growing human embryo. Many other chaotic impressions occur, of which I have no memory...</p><p>Slowly I regain my regular consciousness. I observe a poster in my room, depicting a mountain and a beach. I 'absorb' this image for a long time, feeling almost as If I'm there - on that beach by the mountain. I can feel the warmth of the sun, the breeze of the wind. Harmony, perfection.</p>"
}
