{
 "title": "Like Listening to your Favourite Songs for the First Time",
 "author": "peruviankush",
 "citation": "   peruviankush. \"Like Listening to your Favourite Songs for the First Time: experience with DIPT (ID 93112)\". Erowid.org. Feb 3, 2012. erowid.org/exp/93112",
 "substance": "DIPT",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "DiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 93112",
   "Gender: Male",
   " ",
   "Age at time of experience: 1920",
   "Added: Feb 3, 2012",
   "Views: 3441",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my retrospective view of DiPT. </p><p>For those unfamiliar with the chemical, it's a tryptamine that tends to alter sound instead of visuals.</p><p>When I bought it, I thought I was getting DPT, but the site didn't use abreviations but rather the full name. I missed the extra 'iso' in the name and bought DiPT by accident. </p><p>I smoked a dose the size of the head of a thumbtack more or less the first time.</p><p>I used the 'lightbulb vaporizer' method to smoke it. It was a beige powder that frankly smelled like feces, which most tryptamines do I find.</p><p>One full hit from the bulb produced a severe drop in pitch in most sounds. </p><p>A second hit would result in more disharmonious music. It was quite interesting actually. Background sounds seemed to move to the foreground and vice versa. It was almost like listening to your favorite songs for the first time. I found great interest in music, and listened to lots of different kinds.</p><p>In general the sound was about an octave lower it seemed, and this applied to peoples' voices as well as music and noises in general.</p><p>Further hits turned almost all sounds into a metallic bell sound. Guitar solos would sound like someone striking metal bells.</p><p>At 3-4 full hits from the lightbulb, visual effects were noted. I would see ripples and distortion visually. This only lasted maybe 20-30 minutes.</p><p>Physically the only negative effect was bloating in the stomach after the first hit. Eating a couple of ''Tums'' tablets cured this instantly, and from there it was comfortable.</p><p>I really enjoyed this chemical, but I'm writing this report with a word of caution:</p><p>I probably consumed about 350-400mg smoked myself. A friend helped with the other 100-150. I experienced mild tinnitus (ringing in the ears) for about 3 months after using DiPT for roughly 3 months.</p><p>At the start, it was just annoying enough to merit using headphones with music to sleep.</p><p>It stopped after a few months. It seemed to gradually disappear. </p><p>So just a word of caution. This material is fascinating and amazing, but should be used sparingly so as not to acquire any ear damage. </p><p>Otherwise, I highly recommend trying DiPT smoked. It's an experience unlike any other.</p>"
}
