{
 "title": "High Dose 24 Hour Trip",
 "author": "Chester Drawz",
 "citation": "   Chester Drawz. \"High Dose 24 Hour Trip: experience with 2C-I (ID 93199)\". Erowid.org. Dec 25, 2012. erowid.org/exp/93199",
 "substance": "2C-I",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 0:30",
   "50 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 6:30",
   "1 tablet",
   "oral",
   "Pharms - Diazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 93199",
   "Gender: Male",
   " ",
   "Age at time of experience: 21",
   "Added: Dec 25, 2012",
   "Views: 848",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPast drugs:<br>Alcohol (student, so nearly too regular)<br>Cannabis (regularly in the past, no longer at the time of trip)<br>MDMA and ecstasy pills (every other weekend for few months before trip)<br>Speed (two or three times ever/in the past year) <br>Cocaine (two or three times, negligble effect, shit coke in the past few years)<br>Mephedrone (several times in the past few years)<br>Ketamine (multiple low doses in the last few years)<br>Salvia (many times, 10x, intense full visual trips, found confusing but enjoyable and wanted to repeat)<br>2C-B (one small yellow pill at a festival, done on its own, once. Very, very enjoyable and manageable. Wanted it to last forever)<br>Have many friends who have done acid, other 2c-xs etc so I know what to expect around people on them. Having done 2c-B once before and loving it I decided that 2c-I should be even more manageable. I did 2c-B at a festival and it lasted for several hours and was a trip I was able to dip in and out of almost at will.<br>I acquired a capsule of 2c-I from a friend of a friend at a price of £10 (although it cost me £5 as I took it off a lady friend of his with no hallucinogenic experience whatsoever who could have easily gone insane if she'd done it instead I'm sure). I have since learned that buying a capsule for £10 is not a normal way to go about acquiring a 'dose' of 2c-I, which I was 'reliably' informed by the 'dealer', was 0.1 g. Having never been much of a chemist, I split it into two bombs and seeing as it appeared a minuscule amount believed all was fine.<br>Quite stupidly, in my eagerness to try it and to stop doing MDMA which all my friends were doing at the time, I was the only person on 2c-I. None of my flatmates going with me had done hallucinogens before. I also did at it midnight, in an extremely busy club, after half a bottle of vodka. I took both bombs within about an hour of each other because I was feeling drunken bravado. Regardless, had it been 0.1 g of regular 2c-I, what happened next should never have occurred.\r[Erowid Note: 100 mg (0.1 g) of 2C-I is considered an extremely high dose, see 2C-I Dose Chart] <br>T+1.30 I realised about an hour later that I was seeing tracers and trails and feeling quite trippy. Soon the entire ceiling looked like honeycomb and there was a distinct but very enjoyable matrix feel about the club. <br>T+3.30 However, it got more and more intense until about 3.30 in the morning when I realised it would be best to go home. The friend with me all night described me as being 'extremely calm, walking around with the swagger of Andy DuFraine in Shawshank' during the whole night despite my state. The vodka also makes this time period quite quick and hazy but definitely good fun and what I wanted from the drug<br>T+4.30 After shocking the taxi driver about what I had took (he was unaware of PHIKAL unsurprisingly) and having a good joke I loose my memory properly.<br>T+5.00 Next thing I know I am surrounded by buzzing and morphing colour and can barely make out faces, walls or even myself as a distinct entity. I spend some time in my bedroom taking small sups of air out of my window while watching paintings, walls and the very air in front of me morph into 100% visuals.<br>My friend comes back into the room and realises I am in distress so takes me downstairs to sleep. I vaguely remember getting some sleep shivering under a blanket.<br>T+6.30 My other friends come home from the club waking me up from my quick sleep, gurning but on sociable MDMA comedowns. He is with two of his friends who I barely know but enjoyed meeting earlier in the night when just a little tipsy. We laugh and joke about each others state for several hours as they try and make cups of tea. My hallucinations are no longer all encompassing but instead peoples faces have the appearances of smashed kaleidoscopes or googly mirrors. Everything on the tables and shelves morphs and changes in cartoonish ways. One of my friends friends gives me a valium which I had never taken before to ease me through and tells me he has done a 2c before and it was all fine in the end.<br>T+8.00 I become able to stand and walk, and after accidentally sipping on a small amount of smoke machine fluid (animal fat) believing it was water. However, everyone else in the house is passed out from heavy antics the night before and I, unable to focus or speak to anyone, pace round the house working myself up into a state for two hours still tripping. I cannot use the internet to find help as the screen is a blur of colour and often quite intimidating.<br>T+9.30 - I knock on my friends door, a girl who stayed in all night. She has never done any drugs but studies pharamcology. I tell her that I think the worst is over but I am quite scared. Suddenly a second wave strikes and her face resembles an ever changing smashed up mirror. She tries to tell me everything will be okay, a drug is a drug but she has to leave to go home for the weekend.<br>T+10.30 After another half an hour, where I became convinced that one eye was causing the hallucinations due to optic nerve damage internally, causing a Scanner Darkly style split in my brain, I knock on my friend who took me home and sat with me much of the night. His face morphs in cartoonish ways as soon as I see him, but I soon manage to acclimate to this and see him normally.<br>We sit down and he researches the drug on the internet. We come to several conclusions which we still stand by:<br>Either, it was a huge dose of 2c-I. Or it was not 2c-I but 2c-e, 2c-p etc. Or it reactive with a pharmaceutical, ranitidine, I borrowed off the girl who studied pharmacology to stop my face going red when I drink (it combats asian-style alcoholic flush as a side effect). The drug was 150 mg pill and contains H2 antagonists leaving me unable to process the drug as fast as well as tying to amino acids in my stomach I believe?<br>T+11.30 My friend, and soon three of my flatmates, walk me round the park a bit telling me that this has to stop and I'm not broken. We even laugh as we see various things which would be trippy to someone not on any drugs in the park anyway (a small woman flying a kite in a multicoloured rain coat in no wind etc)<br>T+15 I ring round a few of my friends as the visual morphing is still continuing. Everything appears mildly cartoonish and I have a definitive feeling I am broken. I get in touch with a friend who is an experienced raver who has tried every 2c. Him and his girlfriend inform me over the phone very reassuringly it will stop eventually.<br>T+16 I have still not slept more than an hour since ingesting the drug. The visuals continue to morph mainly my friends faces and TV images.<br>T+22 I fall asleep for an hour after a film which despite being hard to watch, kept my focus.<br>T+24 I wake up and realise that the hallucinations are 90% gone and I can use my PC again. I ring round friends I spoke to earlier saying I am not broken.<br>T+36 I wake up today to find only perhaps the slightest visual twist left and feelings of joy that this hell is over with. I am not broken, or psychotic, or suffering from major HPPD or seratonin threatening illnesses like I managed to convince myself.<br>Do I have lingered HPPD? Perhaps, but it is still not even 48 hours since ingenstion. I am still tempted, now I am in a clear state of mind, to go down the hospital for peace of mind about my vitals. If I do this, I will write a further report.<br>As for now, no more drugs for a long time. A long, long time. I think its for the best - I've done my fair share.\n\n\n"
}
