{
 "title": "Better for My Toilet Than Me",
 "author": "sc1554",
 "citation": "   sc1554. \"Better for My Toilet Than Me: experience with Methylone (ID 93221)\". Erowid.org. Oct 14, 2011. erowid.org/exp/93221",
 "substance": "Methylone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 93221",
   "Male",
   " ",
   "Age at time of experience: 27",
   "Added: Oct 14, 2011",
   "Views: 5464",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had a single previous experience with methylone about a year ago, which was quite pleasant with no urge to redose. Fast forward to late 2011 and hey, my guy is having a sale ahead of the impending scheduling of the stuff. $36 for 3g is a deal in my book.</p><p>Either I, or this substance has changed drastically over the last year - I'm almost convinced that it was not methylone.</p><p>Previous dose was around 250mg oral followed by hourly bumps of probably 30mg. It was pleasant and there was no come down to speak of, no problem getting to sleep.</p><p>The 30 capsules I just flushed down my toilet are another story - very speedy, strong urge to redose in perpetuity. I got caught in a loop a few weeks ago and had to give my friend my stash so I could leave it alone and get some sleep.</p><p>less than 200mg insufflated kept me going for well over 24 hours. This is not typical of methylone.</p><p>Last night I decided to try again with smaller amounts, about 80mg total over 6 hours. Total MDMA like empathy followed by hours of self loathing, insomnia, and immunity to beer. When I did get to sleep, I kept waking up literally drenched in sweat. Not fun.</p><p>Maybe I got a bad bag or something, but I'm off this shit for good. I'm not one to toss drugs but I couldn't deal with having this stuff around any longer.</p><p>On the plus side, it did allow me to do some major mental house cleaning, both on the 24 hour binge and last night, so it wasn't all bad, just not what I remember it to be and with way more side effects than clean molly (Though at $10 a gram, it's easy to overlook methylones shortcomings)</p>"
}
