{
 "title": "Stairway to Enlightment (Rocket Brain)",
 "author": "Doctor Stupid Ph.D",
 "citation": "   Doctor Stupid Ph.D. \"Stairway to Enlightment (Rocket Brain): experience with 5-MeO-DMT (ID 9325)\". Erowid.org. Sep 9, 2001. erowid.org/exp/9325",
 "substance": "5-MeO-DMT",
 "bodyweight": "50 kg",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 9325",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 9, 2001",
   "Views: 19332",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\n   I inhaled. </p><p>              I exhaled. </p><p>A few seconds later, I was overwhelmed by the drug. The feeling was of urgent distress. I felt stuck, both physically and mentally. I could hardly move, but I crawled towards the balcony to look outside. I looked over at the building across from the one I was in. The wall was bending and swirling. I kept getting higher and higher.</p><p>                Rocket </p><p>                      brain.</p><p>Regret set in, I wished the feeling would go away. As soon as I made the wish I realized it would not come true. I was on a drug, it was taking effect, and I had to bear that effect until it expired. I wanted to make the feeling go away. Throwing up and banging my head against the walls crossed my mind. I didnt do any of these things, I just kept sitting in front of the balcony door, watching the wall swirl and twirl.</p><p>                Say goodbye </p><p>                           to what you </p><p>                                       'know'.</p><p>Eventually I stopped getting higher, at which point I gave in to it. I accepted the feeling as part of me for the rest of the trip, and thoroughly enjoyed the comedown.</p><p>The secret... let it flow through. I was trying to figure out the feeling... I was trying to gain control over it. Once I realized I had no control... once I gave up and let it push my mind around, I saw some incredible things.</p><p>                    THE DOOR </p><p>                          IS </p><p>                            OPEN NOW.</p><p>Everything around was alive, breathing, vibrating, communicating, with me. I was at a friends house, and his mother has a thing for frogs. There was a stuffed toy frog between me and the balcony door. I looked down at it and it told me a lot about what life at that particular apartment is like. It didnt open its mouth and speak, no. Just by looking at that frog I got a feel of the permanent mood of the apartment, and the people in it. </p><p>                    Life...</p><p>                            is enigma.</p><p>That night I learned quite a few important lessons. In this life, the only thing you actually control is your own reactions to what is happening. Everything else is beyond your control. If you look carefully, a tiny rock on the side of the road could teach you a lot about the journey you are on. Nothing is insignificant.  </p><p>Open your eyes, open your mind. Look around, at the big big wide picture. At our world, in which everything is the way it is. Why are YOU HERE? </p><p>                     HAVE FUN</p><p>                              trying  </p><p>                                    to solve it!</p>"
}
