{
 "title": "Constant State of GREAT!",
 "author": "J0336",
 "citation": "   J0336. \"Constant State of GREAT!: experience with 4-Fluoromethamphetamine (4-FMA)  (ID 93284)\". Erowid.org. Jan 18, 2013. erowid.org/exp/93284",
 "substance": "4-Fluoromethamphetamine (4-FMA) ",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "insufflated",
   "4-Fluoromethamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 93284",
   "Male",
   " ",
   "23",
   "Jan 18, 2013",
   "Views: 2255",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is my experience on 4-FMA (4-Flouromethamphetamine). This is my play by play experience. I'm using insuffalation as I have a very lovable sense of nasal usage. A little background information on my drug history. Used Cocaine in my early 20's (20-22yrs old) and extensive marijuana usage as I consider it my savior. I had a 9-month RECENT addiction to bath salts and PURE MDPV as I had a consistent and very good supplier. Since the illegality started to take over I decided to try some different research chemicals (RC's) and was able to to obtain a sample of 4-Flouromethamphetamine as I heard good things about it. Always have used nose as my main route of administration but have used a syringe a half dozen or so times but have recently VOWED never to use one again as I loved it too much. Here is my experience with 4-FMA </p><p>T=Min</p><p>T=5 Having a wierd sense of stimulation. Euphoria starting to come on after 2 small lines may be placebo though. 20 mg total. Nasty drip and VERY PAINFUL when putting it up the nose. Using a Benjamin (100$ bill) for usage which was how I've always used powder stimulants. </p><p>T=10 Euphoria is moderate after the first two lines and I decide to take another larger line for a full effect. Heart rate is elevated but I'm also smoking a cigarette which has consequently went out as I'm very focused on my spelling in this experience and find it kind of difficult. The line burns like hell again and my eyes are watering extensively from the pain. relighting my cigarette.</p><p>T=20 Feeling twitchy and keep shaking my leg.... Very little anxiety and paranoia and am VERY HAPPY about that as MDPV caused SEVERE paranoia to the point where I called police more then once. Lucky I was never arrested. the cigarette feels very good and is helping me regulate the shaking of my leg but its more of a habit then anything though. Doing another bump now. The pain is holding me back, I decide that later I will parachute it after few more lines.    </p><p>T=28 Very speedy but same amount of Euphoria. Talkative and lively. My GF is at the eye doctor but says she will partake when she gets home but is reluctant because of the (METH) part in the name. Very clearheaded. Decide to do another small line and head to the store for smokes. Music seems like a good idea too.</p><p>6 Hours since starting..... FEELING LIKE JESUS CHRIST HIMSELF!!!!! I parachuted like I said I would and it has just kicked in because a SUDDEN sweat just came over my body. My gf has not anything has happened as intense tho she parachuted half of what I did. Thrilled that so much came in a sample. Music is awesome to listen to and libido is raised slightly and sex was great. Went and bought a new phone which was slightly impulsive but I needed one anyway. This drug is somewhat psychedelic my vision is altered. This is like a low grade MDMA high. </p><p>Running low on whats left but will probably finish it tonight. Overall great drug. A nice steady high without being to speedy.</p>"
}
