{
 "title": "Insignificantly Numb",
 "author": "zero",
 "citation": "   zero. \"Insignificantly Numb: experience with Mushrooms (ID 9328)\". Erowid.org. Jun 29, 2004. erowid.org/exp/9328",
 "substance": "Mushrooms",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1.7 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2000",
   "9328",
   "Male",
   " ",
   "Not Given",
   "Jun 29, 2004",
   "Views: 5011",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was about three weeks ago when my best friend R suggested we experiment with mushrooms, having never tried them before. We were experienced marijuana users so I figured I would go ahead and trip. R, (having more connections than me) bought the mushrooms from 'his guy'. We didn't really plan where or when to take them so we just ate them on my couch (parents were away at fall festival). We sat there for a while waiting for them to kick in and after about ten minutes of feeling nothing we decided to walk downtown, which isn't really a hoppin' place considering there are only 1000 people populating our village. </p><p>About half way down I felt a difference in my presence. I couldnt describe it but I knew it was there. The sun became three times as bright and I watched it shine on my friends face. I wondered what he was feeling, but I didn't ask. We saw our friend B taking a lap so we pulled him over. He rolled down the window and as I looked at him his face began to stretch out like a rubber band. Nothing that he said made any sense. It sounded like a lawnmower to me and I became restless so I told him goodbye (or I tried) and R and I continued on our voyage. For some reason I kept having this reoccuring flash of light in my mind and in it I saw what I thought to be jesus although It didn't resemble him.  I wasn't raised in a very religious home so I didn't know what to think of it. When I pulled myself back to reality I found that we were already downtown and about to enter a convenience store. When I smoke pot I refuse to go into public places but for some reason on the shrooms I didn't mind at all. </p><p>When I walked in I looked to my right and saw the cashier writing something down. This really bothered me. I wanted to know what she was writing about my friend and I (I was in a state of confusion and parranoya) I stared at her for a moment and then made my way to the back of the store. I didn't know why we were there because neither of us were carrying cash. I suggested to R that we leave (fast) I wasn't feeling safe. As we left the cashier said something to us and it sounded like 'get out of here dream team 3' What the hell did it mean??? I pondered the words for the next half an hour but finally decided to give up.  At this point my girlfriend C (whom I had been together with for almost two years and was madly in love with) was in front of me. I was happy to see her. She and I smoked pot together all the time so I wasn't worried about her seeing me in this state. She sat down next to me and asked me why I didn't call her earlier.  I wondered if she really asked me this or if I imagined it but I answered 'I did but noone answered' (which was true). </p><p>After that I stared into her eyes for what felt like hours and although she wasn't tripping I felt a connection to her closer than I ever thought I could have. She smiled at me and I felt very warm surrounded by her and my best friend.  Then R's father pulled up in his truck and told him to get in. I was ripped from my happy state of mind and thrown into a spiral of anger and confusion, wondering if he was in trouble and if his father knew we were tripping, and if he knew would he tell my parents? C said something after that but I couldnt understand, My mind was somewhere else. I felt very unsafe and suggested we go to my house. When C and I got there she put in a CD. It was pink floyd 'dark side of the moon' as the first song began to play I ripped it from the cd player, It was scaring the hell out of me for some reason. I suggested we watch tv, so I put it on cartoon network. Watching looney tunes sent me back to my childhood and I saw myself in my old house eating spagettios and watching these cartoons. I saw what a good kid I was then and what I drugee and a loser I was now. C asked me if I was ok and I just put my arm around her. Being this close to her I felt better. I sat there with her until I felt normal and the shrooms wore off. </p><p>Although these words cant completely describe my experience, I was forever changed having seen everything and everyone in a different way. Shrooms are scary but they are very enlightening and mind opening. I will always remember that day.</p>"
}
