{
 "title": "My Descent Into Madness",
 "author": "Stickingtoweed",
 "citation": " Stickingtoweed. \"My Descent Into Madness: experience with Products - Spice and Synthetic Cannabinoids (Cloud 9) (ID 93426)\". Erowid.org. Oct 19, 2012. erowid.org/exp/93426",
 "substance": "Products - Spice and Synthetic Cannabinoids (Cloud 9)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93426",
   "Male",
   "",
   "Not Given",
   "Oct 19, 2012",
   "1500",
   " "
  ]
 ],
 "report": "<p>This documentation is about my trip with the 'potpourri' brand Cloud 9. This is the one that says on the front 'Cloud 9 Extra Strength'. </p><p>Previous experience : Heavy Cannabis smoker, Salvia 120x, various incenses, Cocaine, 2c-e, various amphetamines, Various Opiates, and Mephedrone.</p><p>After a 10 hour day at work tearing down houses, my uncle took me to a gas station to pick up some new 'Incense'. I wasn't looking for one in particular; I just needed a substitute to hold me over until I got my drug test over with. This was the brand that the clerk strongly suggested, he said people buy it and keep coming back. So,of course, this is the one I went with. </p><p>When I got home I immediately ran upstairs to my room and packed a bowl in a socket, slightly packed. I used a water bottle to put the socket in. I lit up, held it in, and before I knew It, I had lost my mind. </p><p>The onset was much faster than expected. It kind of scared me, to be honest. I remember freaking out and running to my closet and hiding my things, for no reason at all. Then all of a sudden this crazy song started going off in my head. It wasnt an actual song, more like just an insane trippy mindfuck. Soon after, it started to look like I was going back in forth insanely fast, sort of like a low dose of salvia. It seemed as if my vision was zooming in and out to the beat of the song in my head. </p><p>I started to really freak out, so I thought maybe I could go to sleep and it would go away. But while I was in my bed I started to think that I was dying. I kept on thinking, over and over, Holy shit, this is the hardest trip I have ever had. I am dying. Brace for impact. It literally felt like I was lying in my bed tripping for days. I got up and checked the time and it had only been 20 minutes. This completely made my mind lose control. The trip was coming up on its peak.</p><p>I decided to go outside, because I thought maybe this would help calm me down. It sort of helped, but I was still having the insane trip before. I went and sat down on a brick wall with a view of my pool. My cousin and her friend down there swimming. I started listening to what they were saying, and I clearly heard them talking to the cops on the cell phone to arrest me. Keep in mind this wasnt what actually happened, I was just tripping the fuck out. I heard them saying things like, send a team around the back and from the front because he will try to run. I started freaking out and ran to my cousins house and hid in the basement. </p><p>All of a sudden I started to trip really hard once again. I started to think I was dying again. I started shaking uncontrollably, but I didnt feel cold. I thought that I was having a seizure. I started telling myself I will never smoke this shit or anything like it ever again. I kneeled down by the couch in the basement and started praying for it to stop. After I finished my prayer I just laid face down on the couch. I thought I was dead. I stopped shaking, I stopped hearing everything, it felt like the world had stopped. I have no idea how long I was in this state. But when it was over, the entire trip was over. The high just stopped. However, I was not back to normal. I felt like I was detached from the world, like I was viewing my life in a 3rd person view. I continued to feel this way for weeks.</p>"
}
