{
 "title": "Sucks Donkey Shit",
 "author": "sleepy",
 "citation": "   sleepy. \"Sucks Donkey Shit: experience with Methiopropamine (ID 93490)\". Erowid.org. Jan 2, 2012. erowid.org/exp/93490",
 "substance": "Methiopropamine",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "rectal",
   "Methiopropamine"
  ]
 ],
 "footer": [
  [
   "Exp Year: 10211",
   "ID: 93490",
   "Gender: Female",
   " ",
   "Age at time of experience: 41",
   "Added: Jan 2, 2012",
   "Views: 7951",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI'm baffled by the rave reports on this chemical. I tried to post on the site I bought it from to warn others and it won't post, but I'll copy my experience and subject's response below:\r\nVERY unpleasant effect that, 18 hrs and five sleeping pills later - my subject can still not fall asleep. my subject reported the following:  \r\nfirst: 1-2 hrs some nausea, increasing steadily, and you should know that this was not due to stomach irritation as my subject didn't ingest it orally, in part to avoid such stomach upset, then took two prescription nausea meds which didn't help at all - didn't touch it - \r\nnext 2-4 hrs a general feeling of BAD - feverish, shaky, cold sweat, weird, extreme pains from surgeries she'd had six years ago.\r\n4 hrs - 6hrs in took subject's vitals and was not surprised to see they were dangerously high, and  \r\nher resting heart rate was higher than safe -- my subject used to be a competitive athlete and still works out out every day therefore resting heart rate and blood pressure are usually uncommonly low my subject has had A LOT of ENJOYABLE experiments w/both anmethatimes and meth - the heart rate thing has never been a problem, probably because I was enjoying myself and not feeling feverish, in pain, nauseous and developing a migraine, and by this time terribly dehydrated. even on high amounts of meth my subject never got dehydrated or sick.\r\nThis is one analog that missed the boat entirely.\n\n\n"
}
