{
 "title": "Good God Make the Pain Stop",
 "author": "Krazy_Calvin",
 "citation": "Citation:   Krazy_Calvin. \"Good God Make the Pain Stop: experience with Tobacco (second hand smoke) (ID 9350)\". Erowid.org. Nov 24, 2001. erowid.org/exp/9350",
 "substance": "Tobacco (second hand smoke)",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Tobacco"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9350",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 24, 2001",
   "Views: 25520",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nThis report is about Migraine Headaches (cluster type.)\r\nEver since I was a small child, I have had migraines.  I have had CAT scans and other tests to try to find the cause, but it is just genetics.  My mother had them and I now have them (I hope to god that my future children won't be forced to feel this.)  My mother has more problems with it than me.  She doesn't have any real triggers (it seems), but she has about 1-3 a week.  \r\nUnlike my mother, I have one major trigger for my migraines, Tobacco.  Not really smoking it, but inhaling the second hand smoke.  If you have never had a migraine, trust me when i say you do NOT want one.  What happens is, whenever I am around anybody who ever smokes a cigarette, a mild headache starts up.  After about a half an hour, I feel a very large amount of pressure on my brain.  It seems almost as two people are pushing as hard as they can on all the sides of my head.  Any light/sound at all will just make my head start pounding.  Its hard to keep anything down, all I want to do is throw up, get everything out of my body.  Any tylenol or advil I take will not help much because, like I just said, I would just throw it up.  All I ever want to do when i have one is just lie in the darkest room in my house under a large blanket.  \r\nI have never found out why tobacco causes this, but i don't even smoke it anymore.  I am almost positive i am allergic to it.  The last time i smoked a cigar, I got pleurisy (i am positive thats not spelled right.)\n\n\n"
}