{
 "title": "Plasma and Smooth Metal",
 "author": "Radium",
 "citation": "   Radium. \"Plasma and Smooth Metal: experience with 3-MeO-PCP (ID 93525)\". Erowid.org. Jan 3, 2012. erowid.org/exp/93525",
 "substance": "3-MeO-PCP",
 "bodyweight": "55 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "sublingual",
   "3-MeO-PCP",
   "(powder / crystals)",
   "  T+ 5:20",
   "25 mg",
   "sublingual",
   "3-MeO-PCP",
   "(powder / crystals)",
   "  T+ 6:35",
   "15 mg",
   "sublingual",
   "3-MeO-PCP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93525",
   "Male",
   " ",
   "20",
   "Jan 3, 2012",
   "2870",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>A little information about me first:</p><p>Im currently studying towards second year chemistry and have always had a great interest in dissociative substances.  I first tried ketamine roughly four years ago and have developed a moderate usage habit since (around 2-4 grams per month). I have extensive experience with ketamine, nitrous, methoxetamine and have had three experiences with 4-MeO-PCP. In my opinion I find that nothing has compared - in magnitude of incredible experiences - to ketamine and that methoxetamine, 4-MeO-PCP and the such are just easily-available but not-so-good replacements. Dont get me wrong, Ive had great experiences with methoxetamine and 4-MeO-PCP but still feel there is something glaring missing from their experiences.</p><p>Hopefully (with the acquisition of 50mg 3-MeO-PCP from a highly trusted source) I will be able to find a little gem within the chaos that many call the current research chemicals market. After some major derping about on the postal systems part, I received the package today and opened to find a small bag of pure white, fine powder. Here is the trip report as I experience the effects.</p><p>Weight: 125lb/55kg</p><p>ROA: Sublingual, held for a few minutes then washed down with water</p><p>Dosage: Initial trial, 10mg, 25mg booster then 15mg booster to finish.</p><p>Mindset: Excellent mood, anticipating trying this substance albeit a little tired from a long day in college. Nothing to do tomorrow apart from spend time relaxing at home.</p><p>Experiment begin.</p><p>17:55pm</p><p>T+0:00:</p><p>10mg is weighed accurately by difference and placed under the tongue for 2 minutes. Powder sticks to everything so care is taken not to spill it. The amount of powder is miniscule! Last meal was at 12:45pm.</p><p>T+0:10:</p><p>Possible first alerts - feeling slightly wobbly. Could be a placebo or quick first effects from sublingual ROA. Walking to the station to go see a showing of Persian music with my mum.</p><p>T+0:20:</p><p>Feeling some body warmth and a slight unreality to the train journey. Music may sound slightly enhanced and I've got a smile on my face! Main effects haven't seemed to have materialised at this point. From what I've read it may be an hour or longer until it fully kicks in. Not sure if this substance cross-tolerates with any other dissociative (my main concern is cross-tolerance with methoxetamine and ketamine) but I havent used a dissociative in a couple of weeks.</p><p>T+0:45:</p><p>Definite increase in effects, everything feels slowed down; time feels dilated, typing on my phone seems to take an age to complete a sentence. Reading has become difficult on the tube and walking to the next platform has become slightly wobbly and off-balance. Walking along a flat, airport-style conveyor belt in Waterloo Station is great fun! There's a building sense of wonder in everything around me and things look odd, but not threatening. Very excited, still got a smile on my face.</p><p>T+0:53:</p><p>Effects still increasing, being packed onto a rush hour train was disorientating but highly amusing! I kept getting the urge to laugh out loud. This is unlike ketamine, which makes me feel extremely awkward and alien in public - especially on brightly lit trains. Not entirely sure how much more the trip is going to develop but I'm about to meet my mum so we shall see how conversation holds up. Skin is feeling slightly tingly and depth perception is certainly on the blink. Going up in the lift was a bizarre experience.</p><p>T+1:12:</p><p>Just got into the theatre to see the music, feeling excellent! Conversation is flowing freely and mood is greatly improved. A slight sense of motion is noticed but nothing overpowering; a perfect dose for being in public and communicating with others. I have noticed slight muscle twitching and cramping but nothing major. There's a slight sensation of shifting/motion and the occasional visual flicker.</p><p>T+2:45:</p><p>Just got out of one of the most incredible musical performances I've ever seen. The music was fantastic and the atmosphere was electric. The musicians seemed to have an almost telepathic communication and the way they interacted was very special. The effects of the drug plateau'ed a couple of songs into the performance and getting out I realise I am still slightly off-balance and speech is slightly impaired. If anything it seemed the music enhanced the drug! No other effects materialise. I'll stop here and it's highly likely I will redose a higher amount when I get home to continue the experiment.</p><p>*\t*\t*</p><p>T+5:20 (23:15pm):</p><p>Ive just arrived home and am about to redose this highly interesting compound to better explore its effects. In a more stable environment I believe I will be able to investigate better.</p><p>25mg was weighed accurately by difference and placed under the tongue for 4 minutes. The dose was then washed down with water. The chemical taste is more noticeable and is very (but not overpoweringly) burnt/bitter. Had a meal about an hour ago just before 10pm so stomach is fairly full.</p><p>T+5:35:</p><p>A sudden sharpening of the vision announces the beginning. Something has definitely changed but I cant define what. Still have a slight bitter taste in the mouth from the sublingual dose. I believe Im in for a ride. Some nausea present but nothing unmanageable  may have something to do with the fact I ate so recently.</p><p>T+6:05</p><p>30 minutes later and I still feel on the cusp of something big. Somewhat frustrating but I am going to wait at least an hour before the redose to even consider taking the rest.</p><p>T+6:20</p><p>Effects seem to be increasing slowly but steadily, theres a definite warp in perception but seems very colourful and sharp. Everything seems to have taken on a very slight motion and Im suddenly finding things fascinating! Noticeable wobble in my walk and I feel a warmth (or a numbness?) at my forehead and extremities. The token dissociative static hiss is present now and its volume seems to be increasing. Nothing major yet but I am getting extremely impatient and am considering dosing the rest (~15mg) to kick it up a notch.</p><p>T+6:35</p><p>Lost my patience and dosed the last 15mg of the 50mg I have. Hopefully Ill really see this compound shine now. The last 15mg was administered sublingually and held this time for 5 minutes before washing down with water.</p><p>T+6:45</p><p>Currently feels like a low-dose methoxetamine trip but much much sharper. Objects seem very well defined and there seems to be a building euphoria. I can make out the individual cracks in my skin as I am typing! Quite unlike any dissociative I have done before. Considering the amount I have taken this seems like a light trip so far but am expecting more (I hope). Very slow to build but may have something to do with the full stomach issue earlier.</p><p>T+7:00</p><p>Im in a nice place right now, feeling very warm and woozy but am still somewhat disappointed with the lack of major effects. Hopefully effects will increase but Im unsure to what degree. Feeling very tingly and theres a slight pressure on my temples. Nothing groundbreaking</p><p>T+7:10</p><p>Everything is simultaneously wavy but sharp, unsure if effects are still increasing or not?! This drug has a very High definition feel about it  very crisp, clear. Seems like these are the peak effects and judging by the fact I can still type properly I think I have reached a plateau. Exciting effects but not enough material to explore this properly. Not to be disappointed, I believe this material has great potential and will conduct another experimental next weekend.</p><p>T+7:30</p><p>Oh wait, I suddenly realise I am pretty gone. Typing and expressing words has become difficult. Theres a definite buzz to this but Im having fun reporting it down :D Im watching video walkthroughs of the game Tombi and alternating between the two. OooOOo. Theres a very nice pressure on my head and Ive got great energy! Should I try to make some music maybe??</p><p>T+7:45</p><p>Music production greatly hindered, getting the same feelings coming down from methoxetamine but with a much smoother ride. Feels much more friendly .</p><p>T+8:50</p><p>Still coming down from this compound, still feel great. Very bubbly. I  have to say I doubted it.  Nice stuff.</p><p>The morning after:</p><p>In retrospect, this is a very special compound. It has all the basics there for an essential dissociative but it also has a real sparkle on the side. It definitely whizzes past methoxetamine and certainly 4-MeO-PCP. Im putting this compound right up there at the top along with ketamine and MDMA. Theres a very high-definition feel to its effects and I find theres a very inter-dimensional aspect to the dissociation. More metallic-feeling than ketamine certainly, this substance radiates the feeling of smooth metal and plasma.</p><p>The comeup time was long, being around 1.5 hours in these experiments (although the full stomach may have had a part to play in that) and the plateau I think lasted around 1-1.5 hours if I remember correctly. Sleeping was fairly difficult afterwards but not in any way uncomfortable. 25mg of diphenhydramine was taken to help nudge me in the direction of sleep (which still didnt come for a couple of hours after the last report entry).  I experienced some of the most intense and bizarre dreams Ive ever had last night, many of which involved fire, being on fire, dreaming I was a pastry in an oven e.t.c. These were not frightening but extremely intense and very vivid and colourful, something I think was greatly potentiated by the diphenhydramine taken before bed.</p><p>To conclude, I cannot wait to experiment with this compound again in a different environment. Theres so much potential here and this has given me a great deal to think about. Physically, I do not feel it put a huge pressure on my system, although my heart rate was increased for the duration of the trip and has not completely returned to normal the day after. I advise caution for anyone who is going to indulge in this as it is a little-researched compound. I hope this report has helped map out some new territory, be safe.</p>"
}
