{
 "title": "Great Peak, Great After Effects",
 "author": "P.S.",
 "citation": "   P.S.. \"Great Peak, Great After Effects: experience with LSD (ID 9355)\". Erowid.org. Jan 5, 2005. erowid.org/exp/9355",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 6:00",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9355",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 5, 2005",
   "Views: 7415",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI live in small town Vanderhoof, BC. Once a year, we have a music festival in which lots of old rock legends and the ocational new artists appear. Just this year, we had Wide Mouth Mason and Uriah Heep and many others. My friend and I had hoped to find some acid that weekend. We had never done it befor and really wanted to. Luck was with us because withing the first five minutes, a guy who was high on something and looked very much like a 40 year old hippie walked up to us and offered as blotter! We bought a quad together and were on our way. The man had advised us that the acid was very strong, and only to take a half hit our first time. I really dont think it was that strong, maybe 125 mics per tab. My friend didn't want to do it at the festival on accounts of that his father was there with us since we are only 15. So we waited till the next weekend.<br>The next weekend we set up a tent, far from my house to avoid interuptions. We ate half a tab, and sat anxiously in the dark waiting. I thought I might have felt something after an hour, but not much at all. We started smoking pot for a while, and ended up being VERY stoned. Next my friend played guitar for a long time and amazingly well in the dark. It wasn't until after that that we realized we were on acid. When we turned on the flashlight to smoke more pot, it brought us down in a way, and the rest of the night was mostly sleeplessness and being stoned. That experience was pretty thresh-hold, and the only real hallucination I remember was once, when I stared into my friends eyes in an evil fashion, I remember his eyes turned into frightening, glowing felion eyes similar to those in Dr. Gonzo's head in the movie Fear and Loathing in Las Vegas when Duke take the adrenachrome. The entire experience seemed to be stronger for my friend, who said my eyes moved to the side of my head, stretched towards him, my optical nerve looking like a snake, and then slithered back into my head.<br>We waited two weeks to make sure we had no tolerance, and then dropped acid again. This time we took the other 1.5 hits. This was about 200-250 mics since the second tab was about twice the size of the other one of which we had only had half! We did this in a cabin with many preperations made. We had weed, booze, our acid, a TV, a Dreamcast, a VCR with Fear and Loathing, and an N64! The funny thing is, we ended up mainly running the intro demos to Mario Kart 64 in the background all night! At one point in one of the demos, Mario comes around a corner and looks right at you. My friend kept saying Mario was looking into his soul. We decided watching a move would be stupid because after watching about 45 minutes of it, we realized time flew and we wanted to enjoy this trip. I'm going to take you through the trip from the top now. This was one of the funnest experiences I have ever had!<br>About 15 minutes after ingestion I could feel a weird ice in my stomach. This was surprisingly faster than last time. About 45 minutes in I was already pretty high. We were listening to an Incubus CD which we had previously listened to on Mushrooms. This was loud, fast music and energized us to the point of jumping on beds. I felt an odd feeling that made me feel almost insane. I remembered this feeling, because when we had eaten Mush, I had the same thing. On the Mushroom trip we realized that this was due to the fast music. Once we turned it off, we calmed down and went about our trip in the cabin.<br>The cabing had walls of wood, with an ugly looking table, a bathroom and shower in another room, and 70's style orange chairs. We would have no aim or goal. We would walk towards one end of the cabin with bedsheets hanging around us like capes and stay there for a while, keeping ourselves busy by talking or playing with objects. Soon, we would move on to another corner of the cabin and do something else. I remember on activity involved eating little snacksized Skittles packages. We referred to it as eating colors. The walls at this point were moving, shifting and popping. But for me, with all psychodelics, this only happened when I actually look at the walls. We had some very acid friendly bed sheets with outragous colors and designs on them. I remember at one point the walls turned neon purple and spun and multiplied in crazy patterns and designs.<br>Towards the end of the 6 hour peak, we got into and argument that consisted about me arguing that since the time electricity was discovered to the time a Nintendo was made, no more than 500-1000 years had passed, man could have created a Nintendo system a 1000 years his coming into existance. It took my friend about 30 minutes to make me understand that that is not posible. Now I realize how stupid that must have sounded. After this we were pretty down and decided to smoke some weed and go to bed. So we did this, but when we layed down, we were extremely surprised to be peaking all over again. There is a secret to acid we seem to have found. If you smoke pot in the 6 sleepless hours after a trip in which people are usually 'feeling something, but not enough to call tripping', you can turn it into a whole new and amazing peak!<br>When we first started smoking pot, the first toke had a relaxing effect on me. This was normal, but by the time my second toke came around I was already peaking on acid again. The long, thing stream of smoke coming out of the pipe transformed into a colorful beanstock, out of which the leave transformed into the words POT, ACID, LOVE and many others, all in fat, 70's style colorful psychedelic colors. We layed in bed for 6 more hours listening to one Cake CD over and over. This CD was Comfort Eagle and I HIGHLY suggest everyone listen to this CD when on acid. It is simply the greatest CD with the most ingenious lyrics filled with hidden mesasges and funny sayings. What made this even more amazing was the fact that my mind was making an awesome visualization of the music, a million times better than any Winamp visualizer!<br>This consisted of green energy worms crawling around the knotholes in the wooden wall, the lines on the wall rearanging themselves like pictures of a cartoon Smirf Elvis, to crazy patterns and flourescent shapes! There was a bright spot on the wall where a picture had once hung, and I used this as a canvas in which I could draw with my mind.<br>I don't have much recollection of the timing of this experience. It just happened and I'm not even sure if the events I mentioned are in sequence. The experience was not as mind expanding as mushrooms and had more of an edge as opposed to the dreamy state of mushrooms.<br>This was truly one of the best experiences I have ever had and I look forward to the next time.<br>I advise anyone who plans to take acid to bring some pot for the after effects. The after effects were almost better than the original peak!\n\n\n"
}
