{
 "title": "To Finally Understand Electronic Music",
 "author": "kb",
 "citation": "   kb. \"To Finally Understand Electronic Music: experience with 2C-B (ID 93579)\". Erowid.org. Nov 20, 2012. erowid.org/exp/93579",
 "substance": "2C-B",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "2C-B",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 93579",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Nov 20, 2012",
   "Views: 2250",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIt was my first time trying 2C-B. I picked up 3 capsules from my friend earlier in the day because later that night I was heading into Chicago for a Halloween party. I had already tried 2C-I and also had experiences with other drugs, mainly MDMA, LSD, and obviously cannabis.<br>9:00  Me and one of my friends are in my basement waiting to get picked up to go to the city. I take the capsule, pop it open, pour it out, crush it up a little bit, then poured about three-quarters of the capsule into a vitamin water bottle. I do not drink it.<br>9:15  Our ride arrives and we head to the city.<br>10:30  After receiving bad directions, we finally arrive at the party. I smoke one more cig and then go inside. I went into a kitchen my friend was drinking some beer. He offered me one so I told him to hold on and I chugged my 2C-B vitamin water. Then I had a beer. He then packed a bowl and we smoked, followed by another beer.<br>10:45  I start to feel different. Sound becomes more muffled but music sounds cleared. I start to pace back and forth, not knowing why. My coordination was failing. I could barely walk and stand straight. I decided to sit and observe.<br>11:15  I am feeling even more messed up now and I get up to go outside to have a cigarette. One of my other friends who was aware of what I had taken asked me how I felt. I replied this is really fucked up. He asked if I had anymore, and without thinking at all I gave him what was left in the capsule, about one-quarter.<br>11:30  Most of the people had moved to the basement but a few people were still upstairs. I walk into a room with a lot of art in it. Then I got a burning sensation in my stomach. Not a fiery burn but more of a tingling burn. I experienced this for a few minutes and when the sensation subsided, my vision blurred extremely. It had been about an hour since I had originally taken the 2C-B and it just hit me super hard. When my vision cleared up, everything was breathing. The walls, the curtains, the floor. Objects trailed across the room. My friend dressed as a cowboy spun a gun around his finger and his hand turned into a silver ball. A painting with a stick like object in it came to life and the stick was 3D. Everything throbbed with life, shadows moved, paint was sparkling. People were being replayed, I saw a friend of mine look in a direction over and over while a Bob Dylan song played. I talked to a mask like it was my friend.<br>12:00  What seemed like hours had only been roughly a half hour. My friend (who had taken the rest of the 2C-B) and his girlfriend were starting to get tired so they decided to leave. I was tripping so hard so I left with them. When I left the house, the street elongated. It was not this long before. We approached the car and on a nearby wall a painting of stars shined at me. I probably would have a approached them but it was extremely cold so I just wanted to get in the car.<br>12:30  sitting in the backseat of the car, everything is still trailing, patterns are everywhere, and I feel amazing. However, the driver (my friend's girlfriend) had smoked earlier and sort of got lost. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] This was not good at all because the little amount of 2C-B I gave my friend just hit him. Being lost while a drug hits you is a terrible environment to trip in. Anyways, I am loving everything. <br>1:00  The driver finally got back on track and we were headed home. Once were on the highway, she puts on some techno music. I think it was Afrojack. As soon as this was on it felt like my entire body was orgasming which sounds disgusting but thats how it felt. I dont know what it was but this was more stronger than any mints, rolls, molly I've taken at shows or concerts. It was amazing. My friend said he finally understood electronic music.<br>1:45  I arrive back at my house still feeling amazing, still seeing visuals. Walking up to my house I see a bunny rabbit. It was really there, haha. It was just a good thing to see I guess.<br>1:50  I open the door to my room. I slow motion scan my entire room. Everything seems normal, then I get to a painting that a girl made for me. There is an eyeball in the center of the painting, the eyeball was watching me. I looked back and eventually I embraced its presence.<br>2:00  go to the bathroom<br>2:30  go to the bathroom again<br>3:00  go to the bathroom again. I am starting to scare myself. I think I am getting dehydrated. Instead of standing to pee, I sit down because I am trying to relax. I look at the floor. In my tiles there are black dots. The black dots turn into worms crawling out of my floor and are inching towards me. It almost sounds scary, but this is what made me relax. I started to laugh; I loved it.<br>3:05  got a glass of water than got into bed. Put on a visualizer while listening to Royksopp. They are amazing. The visualizer was blowing my mind. All the visuals I was getting combined with this and the music was the perfect combination. I was in paradise.<br>4:00  I start to get tired a little bit so I shut my computer and turn off the light. I turned the light right back on because it sort of just freaked me out. I looked at stuff. The eyeball was still watching me. The curtains were breezing in my windless room. A hoody hanging on my door was slithering. <br>4:15 - I enjoyed the visuals a bit longer then turned on some music and closed my eyes to see if I could sleep. The music was playing in my head. The closed eye visuals I got on 2C-B were comparable to the ones I had on DMT. I saw things I cannot describe. I can try though. Think of a city throbbing with light but at the same time it's in pure darkness. I saw myself walking the streets of it.<br>In conclusion, many of the people I've talked to have told me that they felt messed up on 2C-B but never experienced visuals. Some other people told me they experienced some trails but thats about it. For me, I'd say it gave me the most intense trip I've had so far. Almost too intense.\n\n\n"
}
