{
 "title": "Completely Tuned In",
 "author": "Vera",
 "citation": "   Vera. \"Completely Tuned In: experience with 2C-T-4 (ID 93572)\". Erowid.org. Apr 11, 2012. erowid.org/exp/93572",
 "substance": "2C-T-4",
 "bodyweight": "186 lb",
 "header": [
  [
   "DOSE:",
   "15 mg",
   "oral",
   "2C-T-4",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93572",
   "Male",
   " ",
   "19",
   "Apr 11, 2012",
   "3270",
   " "
  ]
 ],
 "report": "<p>15mg sub dissolved in 8ml distilled water. Nausea 30 minutes in, subsided after an hour. Felt confident the whole night, and an intense connection to conversational partners. Picked up on all emotional and vocal subtleties, and really freaked people out by finishing their thoughts, or saying what they were thinking. I don't believe in ESP; i attribute this to a dissolved ego, combined with enhanced perceptions, and the ability to think on a deep level for a looong period of time. This gave me a huge confidence boost, and i was the main driver in the conversation. Pupils were almost fully dilated, and visuals were wavy, like 5-meo-amt. Didn't feel much dissociation, but a very wholesome and clear headspace. This would be an incredible meditation aid, but i felt compelled to share my thoughts with someone. No one in my company would have been suitable, so i kept a lot of the deeper stuff to myself. I took the substance at 9pm and the effects lasted until 8am, couldn't sleep until 11am. I didn't really care because i was thinking on a profound level during the night, and am happy that i realized so many things. This could def bring a couple closer together, although no sexual desires were present. I also looked in the mirror at 4am and felt so happy that i was who i was(not to mention good looking), but then again, people call me a narcissist.  </p><p>Sidenote: this would be good for skinny girls who think they're fat. They'll learn to accept themselves when they look in the mirror. ALSO, a friend confirmed the empathy-boost. He swore that he was perfectly tuned into the girl he was speaking with, over the phone, and the girl was freaked out by his intuitive awareness.</p>"
}
