{
 "title": "Worth a Second Look",
 "author": "vanitykills",
 "citation": "   vanitykills. \"Worth a Second Look: experience with bk-MBDP (Pentylone) (ID 93598)\". Erowid.org. Mar 12, 2012. erowid.org/exp/93598",
 "substance": "bk-MBDP (Pentylone)",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "oral",
   "bk-MBDP",
   "(powder / crystals)",
   "  T+ 0:45",
   "10 mg",
   "insufflated",
   "bk-MBDP",
   "(powder / crystals)",
   "  T+ 1:45",
   "20 mg",
   "insufflated",
   "bk-MBDP",
   "(powder / crystals)",
   "  T+ 3:15",
   "30 mg",
   "oral",
   "bk-MBDP",
   "(powder / crystals)",
   "  T+ 0:00",
   "30 mg",
   "oral",
   "bk-MBDP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2010",
   "ID: 93598",
   "Gender: Female",
   " ",
   "Age at time of experience: 20",
   "Added: Mar 12, 2012",
   "Views: 5605",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So in my search to find a rc equally as amazing as methylone I've come accross pentylone and this is what I experianced. </p><p>I started my night at 9pm with a rediculously low dose of 10mg taken orally. Waited about 45 minutes didn't feel much of anything so decided to redose this time I snorted another 10mg the feeling was very similar to a bump of coke. I was unimpressed to say the least. But after another hour I decided to try again. This time I snorted 20mg and the rush was much more noticed. Much like coke but a tad more rolly feeling. I was tempted to do more right away but refrained so that I wouldn't overdo it. So I waited about an hour and a half and decided to try dosing orally again because its my personal favorite way to dose. This time I took 30mg and the effects took about 25 minutes to become noticed but when they did I was pleasently surprized by the roll like feeling to it. As I peaked from that dose I felt it was safe to do another 30mg orally from there I was more than comfortable with my body high and head rush. </p><p>All and all for a first impression this rc wasn't to bad. I would like to try it again and start off with a higher dose to start. I was just being careful this first time as I am everytime I try something new. But for me its for sure worth a round 2.</p><p>In low doses it produces a coke like feeling (10-30mg)</p><p>In higher doses pentylone is more of a roll (30-60mg)</p><p>Anything higher than that is a mistery to me for the moment but I'm curious enough to find out.</p>"
}
