{
 "title": "Too Many Caps",
 "author": "Celly Cel",
 "citation": "   Celly Cel. \"Too Many Caps: experience with Mushrooms (P. cubensis) (ID 936)\". Erowid.org. Dec 12, 2000. erowid.org/exp/936",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "24 caps",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 936",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Dec 12, 2000",
   "Views: 7284",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Let me begin by saying that I am a very spiritual person and have been blessed in this lifetime with a third eye with which to observe reality. Any tale of triptronic proportions coming from me may seem a bit far-fetched, but let me say that I'd been seeing visuals before I knew what drugs were.  I'm that kind of person.</p><p>My third time shrooming was quite intense. The first time, I ate two grams and had a mediocre, happy, childlike trip. The second time, I upped the dosage to seven grams (having been a regular user of LSD for three full years before ever eating of the shroom, and usually a big dose, too) and had an exhillirating, virtual earthscape of a spiritual mindtrip.</p><p>I don't know what I was thinking this third time. Two friends and I had gone out shroom picking in some secluded cattle fields, and we had enough to binge, so we did. At about eight-thirty we poured out the contents of a huge garbage bag and started picking out the caps. We had over a hundred, so we each took two handsfull and munched out. I have very large hands, so several days of thinking led me to believe that I ingested at least thirty grams worth of caps. My mindset at the time of eating the caps was that of pure, unadulterated anticipation. We finished our meal in about three minutes (we were hungry!) and lit a large marijuana cigar to celebrate our catch (after all, all this stuff I just ate was free). Well, this is where things go goofy. As soon as I got a toke of the blunt, I was floating off. We were out in the middle of a field, three guys, surrounded by darkness, smoking too much and eating too many shrooms. Half an hour into the trip and I already couldn't understand a word of what my friends were saying. I would see their mouths moving, trying to communicate with me, but all I heard were strange dialects and noises, stops and starts, like an alien was watching a video of our trip and screwing with all the buttons. Pause...drift off, speak to a voice that's ten voices in one...rewind...trippy deja-vu...fast forward...first you're lighting the cigarette, suddenly it's gone. 'Where did it go?' I ask my pal. 'You just smoked it and finished it, man.' And then there's the visuals. Ah yes, the distortions of space and time that one can witness under the power of too many potent shrooms. My two friends' faces were clay lumps for my imagination to toy with (from animal heads to mountains to balls of energy and light). And the entire time there was no communication going on. We couldn't understand each other! It got to be too much at one point and we had to sing a song to know that we weren't in completely different worlds. The auditory and visual hallucinations continued for a strong seven hours, but when they started to fade out, the most interesting thing happened. I don't remember going to sleep that night, but I woke up at four in the afternoon the next day. My recollection of the trip goes from laying out in the field with my two friends looking at the stars, to a dreamlike state of being out in space. I felt as if my consciousness had shifted from ego to the whole, and I was cradling/being cradled by god. The dream felt like it was an eternity long, and when I woke up I felt healthy, hungry and refreshed.</p><p>Although the large dose of mushrooms kept me on the edge for most of the night, the spiritual level of health I attained while in that very high place made me feel loving and energetic for a long time.</p><p>I'd like to hear more people's spiritual/visual adventures, especially those dealing with altered consciousness and dream states.</p><p>Celly Cel</p>"
}
