{
 "title": "Weightlessness",
 "author": "11David11",
 "citation": " 11David11. \"Weightlessness: experience with Methoxetamine, Aniracetam & Propanolol (ID 93623)\". Erowid.org. Jan 19, 2012. erowid.org/exp/93623",
 "substance": "Methoxetamine, Aniracetam & Propanolol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   " ",
   "oral",
   "Aniracetam",
   "(daily)",
   " T+ 0:00",
   "40 mg",
   "oral",
   "Pharms - Propranolol",
   "",
   " T+ 0:00",
   "10 mg",
   "",
   "Methoxetamine ",
   "",
   " T+ 2:00",
   "20 mg",
   "",
   "Methoxetamine ",
   "",
   " T+ 4:00",
   "30 mg",
   "",
   "Methoxetamine ",
   ""
  ]
 ],
 "footer": [
  [
   "2010",
   "93623",
   "Male",
   "",
   "40",
   "Jan 19, 2012",
   "3406",
   " "
  ]
 ],
 "report": "<p>For over one week, I had been sampling very small quantities of methoxetamine on a nightly basis.  The amount was small - 10mg, sometimes supplemented by one or two additional 10mg dosages.  This was done out of caution in response to experience reports already published by Erowid, in which possible overdoses were consumed with sometimes frightening consequences. Aniracetam (750mg) was consumed twice daily during the week as an experimental smart drug regime.  Propanolol (40mg) was consumed as a precautionary measure against possible panic as a complication.</p><p>After several days, I grew comfortable with M.  Upon reaching the weekend, I increased my dose to 10mg, then supplemented two hours later, after effects began to fade, by another 20mg, Two hours later, as I returned to baseline and approached bedtime, I did a final booster of 30mg.  Full baseline was never fully achieved after the first two doses, and effects were largely additive throughout the evening, requiring a couple trips to lay down on the bed for closed eye visuals.</p><p>Lower dosages that evening, and in the prior week, were mostly philosophical, detached, non-verbal explorations on what can only be described a global level, accompanied by a sense of an infinite timeline and not grounded to any particular place or time.  Frequently, my view of living creatures, whether people around the world, or life forms deep in the sea revealed countless similarities and shared consciousness, way beyond any kind of practical common sense understanding.  On a more physical level, aches and pains would vanish momentarily and stretching exercises revealed new flexibility and pleasure.</p><p>With the final dose, I prepared my bed for the final leg of the trip and as the M-wave began to soothe my body and as gently racing thoughts took hold, I crawled under the covers for a spectacular visually beautiful trip into space.  My body dissolved into weightlessness and I felt very free, with little physical sensation except very intentional, slow deep breathing.  Relaxation was nearly infinite and although I could not feel it, I must have been very pleasantly smiling.  Finally, I recognized, my childhood fascination with astronauts was satisfied.  I had finally experienced zero gravity.</p><p>The nightly doses are over now, and Ill be saving my remaining M for the other right times and places.  I started very small and built on that, very gradually.  Larger doses are not to be rushed.  A full 8+ hours of sleep should be part of the plan, after which more free time for a little reflection would be a very good idea.  Enjoy the afterglow and relaxed feelings.  From other accounts, beyond 60mg there is little gained except for duration, and you will probably want more for another time in the not too distant future.</p>"
}
