{
 "title": "Subliminal Magic",
 "author": "Morninggloryseed",
 "citation": "   Morninggloryseed. \"Subliminal Magic: experience with 2C-T-7, DPT, Nitrous Oxide, & Cannabis (ID 9362)\". Erowid.org. Jan 5, 2002. erowid.org/exp/9362",
 "substance": "2C-T-7, DPT, Nitrous Oxide, & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "oral",
   "2C-T-7",
   "(capsule)",
   "  T+ 5:30",
   "30 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   " ",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2000",
   "ID: 9362",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jan 5, 2002",
   "Views: 13768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nEarly December, 2000\r\nAt the time of this experience, I had slipped into a very dark place in my mind.  Any motivation to do work beyond what was required of me was hard to come by.  Depression had seeped its cold ugly head in, and I experienced an almost complete loss of control over my emotions.  A past high dose 2C-T-7 trip had unexpectedly acted as a catalyst to the release of built-up and repressed emotion.  The outcome was unbelievably positive, so I decided to reserve my next free night for some psychedelically induced negative-rut destruction, hoping the material would help.\r\n50 milligrams of 2C-T-7 was weighed and encapsulated in the hopes that it would give me a much-needed psychedelic shake-up.  It was the same dose I had used in the past.  I chose to have this experience alone because I wanted/anticipated a major emotional release at some point.  I must, at this point, add that 50 milligrams is a very, very heavy dose and should only be taken by someone who is already very familiar with the substance, and extreme altered states of consciousness in general.\r\nI took the pill around 3:00 p.m. and felt an alert within 15 minutes.  By the 45-min point I was at a plus 2.  As usual, the 2C-T-7 made me quite nauseous and I vomited after about an hour.  My body recovered very quickly afterward.  I spent much of the first 2 1/2 hours just sitting in the dark thinking about nothing too particular.  Occasionally, I would start reminiscing about past-relationships and such, but I couldn't really force myself to deal with all of the issues that had been plaguing me during those days.  Finally, I got up and decided to do something a bit more uplifting.\r\nI plugged in my base guitar and put on 'Scar Tissue' by the Red Hot Chili Peppers, which then runs into 'Otherside', and played alongside the record with a ferocious intensity.  Both are songs my brain strongly associates with the past.  The emotional effects of 2C-T-7 always overwhelm me, and the ones I felt from listening and playing along with the music were incredibly intense.  The emotional effects 2C-T-7 has for me is probably my favorite property of that substance.  I think subconsciously I put all of the hurt and pain I had been feeling at that time into my fingertips because I played that base like never before.  As any musician knows, playing can be both an emotional release and a mystical experience.  I got to have both of those occur while in the midst of a 50 milligram 2C-T-7 peak!  Very nice.\r\nI can't possibly describe what was going on in my mind at the time but at the height of all of this, my ego dissolved and became instilled in the space surrounding my body.  I could see my soul in objects around me, such as the clock on my wall, or in nearby furniture.  I simply existed as an empty body that reverberated with the energy of the music being played.  No worries, no issues, no sadness, no pain, just the energy of the song driving along this force.  Oh that was powerful.\r\nUnderstandably I felt pretty good after that experience, and for about an hour or so I just basked in the afterglow of it all.  I took some time to play with the absolutely overwhelming visuals 50 milligrams of 2C-T-7 will cause.  They were unbelievably beautiful, intense, and indescribableso I won't bother trying.  There is no way to put what I saw into words.\r\nPsychologically, I noticed being very much in control of my thoughts and emotions for the first time in weeks.  I never really focused directly on the issues that were causing me so much pain at that time in my life during the trip, but I definitely let go of something.  Somehow, the medicine had sneaked in and subliminally worked its magic.  I felt very clean and renewed afterward.\r\nAfter a bit of time (maybe 5 hours into the trip) I decided to take a shower and afterwards, I invited some company over.  Before my guest arrived, I had a balloon of N2O, and then insufflated 30 milligrams of DPT.  The interaction between the two materials was incredible.  By the time company was arrived, the DPT was going off like fireworksliterally.  It arranged 2C-T-7's flowing visuals into more organized geometric shapes and patterns.  Everything around me became very, very active and exploded in colorlike fireworks.  Also, my surroundings appeared a lot 'heavier' than before, as darker and cooler colors were now being produced.\r\nMentally, there was a major intensification of the experience.  Somehow, DPT's usually aggressive and demanding personality managed not to surface.  Just as well.  I laid down on my couch, shut my eyes, and then dissolved into nothingness as my friend played his classical guitar.  What I experienced was simply blissful.  Absolute universal joy.  My friend and I spent some time talking, playing guitars, smoking cannabis, and just generally having a good time.  Also along the way, I also managed to discover that 2C-T-7 and DPT do not enhance my ability to play chess.  Eventually my friend and I parted ways, and I fell asleep around 3:00 a.m.\r\nI awoke the next day feeling quite renewed.  Somewhere along in the journey, I shed a lot of emotional baggage.  It's very interesting considering I had no conscious release of emotion during the trip, as did happen the first time I took the substance.  If it is ever possible to get a better idea of 2C-T-7's safety record, this psychedelic could have potential as a therapeutic agent.  Wonderful material.\n\n\n"
}
