{
 "title": "Trip to the ER",
 "author": "SobeDog",
 "citation": "   SobeDog. \"Trip to the ER: experience with Kratom & Hydromorphone (ID 93736)\". Erowid.org. Mar 18, 2012. erowid.org/exp/93736",
 "substance": "Kratom & Hydromorphone",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "0.25 g",
   "oral",
   "Kratom",
   "(extract)",
   " ",
   "  repeated",
   "IV",
   "Hydromorphone",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93736",
   "Male",
   " ",
   "37",
   "Mar 18, 2012",
   "Views: 44903",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So I bought this Kratom Extract that is supposed to be the strongest concentration ever, .25g being equal to 10g regular kratom. The reasoning was that it would be easier to drink, since the taste is outright nasty.</p><p>I will divide the experience into two. Day 1, took .25g and felt the regularly reported effects; euphoria, slight buzz... I felt good. The day after is when things got ugly: I developed a horrible stomach ache that radiated to my back, I could barely breath. I felt as if I had indigestion and constipation, in an effort to clear my painful intestines I downed some milk of magnesia. The pain had me unable to go to the gym for a week, I was almost bed ridden for these days.</p><p>Fast forward to day 2; 2 weeks later, I decide to give Kratom a try again since I didn't think that the pains and Kratom were related. Boy was I wrong. downed .25grams again and same as last time, I got the feeling of euphoria, light buzz and well being set in rather quickly (20 min). I enjoyed this for 3 hours and went to sleep sober at about 11pm. The real fun began at 3am when I was woken up by stomach pains. I woke up and went to the guest bedroom so as not to wake up my wife, and played some X-box waiting for this feeling to pass so I could get back to bed. That didn't happen; 45 minutes later I was on the floor of the bathroom in fetal position gasping for air, it was the same pain that I had two weeks ago, only stronger, it had radiated to my back and I could barely breathe. The pain would last for about 20 minutes, and suddenly go away...  only to come back again 5 minutes later. I lasted in this roller coaster all of 5 hours, when I decided to drive myself to the ER.. the pain was so intense I was very worried about crashing on my way there, even if the ER is only 15 blocks away. if I pressed my hands around my gallbladder I felt I was being stabbed.</p><p>I got there and I was immediately administered an IV with 1mg dilaudid and that was the best relief I had ever felt in my life.  tests and questioning began:  EKG, Ultrasound, bloodwork, CAT scan with contrast... doctors did not find anything with the exception of two very elevated liver enzymes, ALT was at 340, AST 250  (6 times normal)  so I had to spend the night, with more dilaudid being administered every 3 hours religiously, 1mg at the time. (strong dose)</p><p>Next day my liver hormones were trending down, and took a full week 3 days were back to normal. The doctors were all baffled as they had no clue what did this to me, from the ER chief to the Chief of GI/internal medicine. I did not disclose Kratom, as I knew that they had not idea what it was and they'd be quick to blame it. I wanted to get all tests first.</p><p>I was released with a 'no raw seafood' warning, since it was my last meal before this  (my wife ate the exact same thing I did, and she was fine) as a testament of the doctor's absolute ignorance as to what was wrong with me.</p><p>As soon as I got back home, i threw the Kratom away, and vowed to do more research next time I experiment with something. I still have residual pain, I hope it will go away quickly...</p>"
}
