{
 "title": "The Metaphorical White Powder",
 "author": "FlowGnome",
 "citation": "   FlowGnome. \"The Metaphorical White Powder: experience with DPT (ID 9385)\". Erowid.org. Feb 11, 2002. erowid.org/exp/9385",
 "substance": "DPT",
 "bodyweight": "132 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)",
   "  T+ 0:30",
   "50 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9385",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 11, 2002",
   "Views: 13722",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nMe: College Junior very interested in psychedelics and exploring new mental spaces.  Very experienced with most common (and some uncommon) tryptamines & a few phenethylamines.<br>Set: Very good mood, little of the usual depression here and there but nothing bad. Looking to explore an extra universe or two before school started and decided this might be the fuel I needed to get there.  Wanting to test out the vibe of the new house, and get fully settled in there.<br>Setting: At home in my new place.<br>I had tried DPT once before at the 50mg level, and was not overly impressed, but realized that I had probably not arrived at my correct dosage, and was concerned that tolerance from the LSD/Ketamine the night before may have interfered. With 100mg left, I decided to go for the gusto: try 50, and if I was still not getting anything exciting, go for the full 100mg. This turned out to be a wonderful idea, and it has given this compound a new place among my favorites.<br>After getting some housework done, and making sure my friends wouldn't bother me (of course this didn't work), I insuffulated 50mg of DPT in the early evening, by myself at home. Then I waited... and waited... the first signs of psychedelic were not visual, but mental. I caught a thought train that spun off from a memory of a trip report on DPT about broken glass being used to wash the poor person's legs when he had done too much. <br>This resulting train was not especially positive or negative, but it was fairly stupid and when I traced it back I realized about what mental state I was in... It also made me remember not to think about other people's reports or mistakes while on the substance, just to trust myself and let it flow. something reminiscent of a few hits of acid. This was nice, but there was more to be done with this stuff I felt, so the other 50mg went up my nose. This is when things got exciting.<br>After another 10 minutes or so, the room began to move... and twist, and turn, and everything else that I would expect it to do had I eaten 1000mcg of acid. The difference was, I was no longer thinking in anything resembling english, but in a system of twisted cartoonish metaphor imagery. This imagery was obvious with eyes open, although I am not sure how. With eyes closed, it became visual, and the knowledge of the physical body all but disappeared, being replaced by whatever perception of it the visual decided to take on.<br>Some of the more interesting body sensations included that of my body being bent into a sine wave, the representation of time and memory as a filing cabinet, each frame of time being a file shoved in, and the body dissolving into space entirely, only to rematerialize when I opened my eyes. This is by far the most difficult part to explain, as it is so alien to normal thought processes that it simply must be experienced to be understood. <br>Music became a living part of the body. Sudden changes would shock the physical body into opening the eyes or moving around. Thoughts were driven by the music I was listening to, which I had fortunately decided should be slow ahead of time. Even Shpongle seemed too fast at times. This phase was altogether very relaxed, with much less of the nervousness I associate with mushrooms or acid. Everything was going very nicely, until suddenly a knock at the door jarred me awake. It was my friends A and W. Now I had no problem with W being there. He is a very interesting person, who never does drugs, has never done psychedelics, but is always fun to hang around tripping. Although in my current state I wasn't capable of much english, he didn't bother me. The one who did bother me was A, the typical immature braggart who liked to fuck with people as much as he could while they were tripping.<br>A. decided to start reading entries out of the dictionary for exciting words such as crack, ecstasy, and all the other simple words he could think of. For Some Reason(tm) I was in no condition to tell him to shut up or leave, so I just sat there listening while the imagery flowed, now based on what he said rather than the music.<br>Luckily, I knew that I only had somewhere around 15 minutes of the intense part left before something more managable appeared, so I ignored him for the time being as much as was possible. He also decided to start talking to me about his favorite hobby, drug dealing, which confused me to no end as I had somehow gotten the idea that A and W were police when they walked in, and this only confirmed it. A was trying to get me to confess some crime so he could haul me off to this hyperspace prison I was visualizing at the time. Keep in mind that A and W were completely recognizable as themselves, it was just that common concepts and standard logic had been tossed so far out the window that their identities were no longer static at all in my eyes. From past experience with ideas like this, I knew it was best to wait it out or leave if possible. Since leaving my own home with him in it was out of the question, I agreed to go hang out at his apartment.<br>The drive there was very weird, as everything went black and white on me, complete with film grain, scratches, and old movie sound effects/themes. After we arrived, the DPT tapered off slowly for about another 3 hours or so, until it was finally gone. I got a ride back, after yelling at everyone for dragging me into a car and over to their house for no reason while I was too out of it to really make any decisions. Sleep was easy about 5 hours after ingestion, with no remaining effects, no tiredness, and a general feeling of well-being.<br>Looking back on this trip, there were not many important realizations, but as I went into this looking to explore new hyperdimensions rather than myself and common reality, this is not too surprising.<br>I would easily rank this the most powerful substance I have tried, mentally beyond very high dose AMT (150mg) and 2C-T-7 (60mg). Unlike the others, there were no disturbing physical side effects or vomiting at any point, making this very high on my list, right up there with AMT and LSD, my other favorites. I cannot speak for ayahuasca, because no dreams have been fully realized as of yet.\n\n\n"
}
