{
 "title": "A Crazy Ravepaint Party",
 "author": "RDTMDP",
 "citation": "   RDTMDP. \"A Crazy Ravepaint Party: experience with 6-APB (ID 93879)\". Erowid.org. Oct 7, 2012. erowid.org/exp/93879",
 "substance": "6-APB",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "6-APB",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2011",
   "93879",
   "Male",
   " ",
   "19",
   "Oct 7, 2012",
   "Views: 2406",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friends and I were picking up some bud from another friend and he told us about  6-apb. We thought we would try it and we just happened to be going to Dayglow the next week, so we decided to do it then.</p><p>I took the 6-apb at about 8:00 pm and it didn't hit until about 30-60 minutes after and we were already inside. At first we thought it was kind of weak because we weren't getting the usual molly/acid rave feeling. Once it hit, though, we knew immediately and the whole thing became awesome. I didn't really get too many visuals during the show, but that may have been because of paint being thrown all over the place. I did get the really happy and excited feeling that I get from molly. Everything felt really awesome. I had some nausea at first, but that all subsided. </p><p>After the show, 5 and a half hours later, we went outside and sat in the car for about 30 minutes while the parking lot emptied out, still feeling the effects. By this point we were all tingling all over, talking a lot, enjoying our good moods. We drove to a gas station to get something to drink and use the bathroom, both of which felt great. As the driver, I can say that driving while on 6-apb was awesome, but probably not the safest of things to do. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>On the two hour ride back home, the tingling went away, but the euphoric moods remained for the entire drive and then early into the morning. The visuals also started on the drive. For me, the lines on the road were rising out of the ground, like light boxes stretching upward. Other cars and trucks also seemed to have some glow to them.</p><p>When we got back, we were still just as talkative and energetic. In the peace of a dark room, I sat with my eyes covered, not thinking about what I was doing, and began to have intense visuals. I saw planes be built, first from wood, then eventually out of metal. There was a doctor's table in an empty room, except for a gear about twice the size of the room at the end, which replaced the wall, and was spinning. A bar was coming out of the middle of the gear and over the top of the bed with a blanket covering the part on the bed. There were also a lot of lights and shapes moving around and morphing and I think I may have seen the universe form. The visuals lasted until about 7:00 or 7:30 am. They were some of the best visuals I've ever had.</p><p>I don't know if smoking ganja had any effect on the trip at all. We didn't smoke until the ride back home. It may have caused to visuals to appear more. I think the whole thing lasted about 10-10.5 hours. It was all pretty awesome.</p>"
}
