{
 "title": "New Bliss",
 "author": "Sup",
 "citation": "   Sup. \"New Bliss: experience with 25C-NBOMe (ID 93933)\". Erowid.org. Dec 18, 2011. erowid.org/exp/93933",
 "substance": "25C-NBOMe",
 "bodyweight": "63 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "insufflated",
   "2C-C-NBOMe",
   "(liquid)",
   "  T+ 0:15",
   "1 hit",
   "insufflated",
   "2C-C-NBOMe",
   "(liquid)",
   "  T+ 1:00",
   "1 hit",
   "insufflated",
   "2C-C-NBOMe",
   "(liquid)",
   "  T+ 5:30",
   "0.5 hits",
   "insufflated",
   "2C-C-NBOMe",
   "(liquid)",
   "  T+ 12:30",
   "25 mg",
   "oral",
   "Pharms - Quetiapine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93933",
   "Male",
   " ",
   "23",
   "Dec 18, 2011",
   "6771",
   " "
  ]
 ],
 "report": "<p>26/11-2011 12:30 PM</p><p>Set: Stressed, exams soon, saturday, at little anxeiaty, winter depression</p><p>Setting: at my GFs house alone.</p><p>25C-NBOMe (NBOMe-2C-C)</p><p>I couldnt get my english spell checking to work, so please bare with the gramma ect.</p><p>Material was waighed on a mg scale (8mg) and was dissolved in water (4ml) to a consentration of 2mg/mL. This should have been done on a more accurate scale or with more material, but i did my best with the equipment/material at hand.</p><p>T+00:00: 400µg (0,2mL) was drawn with a 1mL syringe, head tilted back and the liquid snorted (yeah this is how i did it :)). No sting, but very slight discomfort.</p><p>T+00:05: First alert. Enegic phenethylamine feeling, Plesent. Slight visual stimulation. Clouors more vibrant.</p><p>T+00:15: Decide to snort 400µg more.</p><p>T+00:20: Shaky and deffinately over baseline. Very slight nausia. A feeling between phenethylaminbes and tryptamines. Very hard to define, but pleasent.</p><p>T+00:50: Reminds me of LSD but much more pleasent and without 'the push'. Very clear headed. OEV are starting to become more intense. Patterns and colours and a big smile on my face. Very beautiful.I find my bed very comforting, same as 2C-C alone. I put on psycdelic chillout and start to  look at beautiful animated pictures.</p><p>T+01:00: I feel extremely good and at a solid +++ and decide to do 400µg more to see where it leads me. At this point its very hard to mesure dose and i spent some time doint it. I am confident that i got it right.</p><p>T+01:05: INTENSE OEV and CEV. I have NEVER seen anything like this. Beautiful 3D structures floating thrue the space infront of me in all clolurs, morphing, traces, breathing and bright flashes of white light. Cosmic. Stunning. At this point i might have reached a ++++ at times, as i recall very little and my notes are mostly unreadable/drawings. Old childhood memories flash by.</p><p>T+02:00: K comes by randomly and i recall have a very hard time finding and opening the door. Last dose was a little over the edge. But i dont regret. It goes really easy on the ego and its very smooth. Easy to work with. T takes 400µg.</p><p>T+02:40: T say 'this is the new shit' and we spend the next hours lying in bed listening to music and looking at pictures. At this point the still pictures we look at are extremely lifelike and look like short movies. Time-lapse like. We could see the wind blow on the nature pictures ect. It was very impressive. Maintaining a conversation is hard for both of us and we forget the subject we are talking about several times. We laught alot. Im at a +++ at this point. T is at ++(+). Insanely visual and extremely easy to work with. I write down 'follow your heart, not your head'. I miss my GF alot.</p><p>T+03:00: Cant figure out time. It feels like ages have past. But im right here. Clear thoughts. I can control the direction of my thouyghts. Very nice body feeling. I write down 'long time no see' to myself. We talk alot about time. Extreme time dilation for both of us. This is really EXTREMELY visual. I have never tried anything like this and i have a long history RC use. There is really magic here.</p><p>T+05:30: I start to feel the comedown and i dont really want to come down. So i decide to redose again and take 200µg more. So does T. Im maybe at ++ at this point</p><p>T+05:45: Blast to a solid +++ for both of us. T lies still with eyes closed and relives old memories. He came back with a big smile on his face. I also feel extreme lucid and can easily put myself into imaginary situations. We still have a hard time remembering the subject we talk about, but we really laught alot. T want to try again in the future and so do i. This is really magic.</p><p>T+07:00: Still a +++</p><p>T+09:00: ++</p><p>T+12:30: T goes home and i take 25mg of seroquel (quitiapine) and go to sleep.</p><p>Wake up a little grudgy. Might have been the seroquel. What a night it has been.</p><p>Conclution: Wonderful, magic, lucid, EXTREMELY visual, intense and absolutely uniuqe. It feels very easy but should deffinately not be taken lightly.</p><p>-We love you N :)</p>"
}
