{
 "title": "Extreme Relaxation",
 "author": "Samuel",
 "citation": "   Samuel. \"Extreme Relaxation: experience with AH-7921  (ID 93949)\". Erowid.org. Mar 31, 2013. erowid.org/exp/93949",
 "substance": "AH-7921 ",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "10 mg",
   "vaporized",
   "AH-7921",
   "(powder / crystals)",
   "  T+ 0:20",
   "20 mg",
   "vaporized",
   "AH-7921",
   "(powder / crystals)",
   "  T+ 0:30",
   "10 mg",
   "vaporized",
   "AH-7921",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93949",
   "Male",
   " ",
   "Not Given",
   "Mar 31, 2013",
   "Views: 7505",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I received this from a reputable lab with all the independent lab testing done before any consuming was done.  This is the base form and the HCL form will be tested in a few weeks.</p><p>10mg vaped (do not try putting base up your nose!) - Very relaxing and pleasant but nothing special.  Maybe equal in euphoria and pain relief to 3mg of hydrocodone. </p><p>20mg vaped (20 min later) Now I can feel more of what this is all about.  This is VERY relaxing like morphine can be as opposed to the more stimulating effects with things like oxycodone and hydrocodone.</p><p>10mg vaped (10 min later) Very happy with this chemical and plan on getting more if the price is good.  The base form results went better than expected and look forward to nasal and oral tests with the HCL.</p><p>The chemical in base form vaporized seemed to last a total of 4 hours.  After beginning very shortly after vaping, the peak lasted around 1.5 hours (seeming like a relaxed morphine effect that helped very well with pain mixed with a medium oxycodone/hydrocodone buzz).</p><p>It seems very similar to morphine but with a slight codeine edge to it.  No other effects notices other than warmness of body, extreme relaxation, pain killing effects, medium euphoria, and my right eye was squinting just as it does with other opioids like kratom or other pills.</p><p>It works and I believe the demand for this will grow in the near future.  I just hope people will be responsible with this and more professional lab testing can be done to find out any possible negative short or long term effects.  I also think this could be a good prescription pain killer as it works well for pain without getting you extremely high and the addiction potential seems to be less than that of even hydrocodone for some reason in my limited experience with a few grams so far.</p>"
}
