{
 "title": "Shouldn't Have Railed It All at Once",
 "author": "anonymous",
 "citation": "   anonymous. \"Shouldn't Have Railed It All at Once: experience with DPT (ID 93940)\". Erowid.org. Mar 13, 2012. erowid.org/exp/93940",
 "substance": "DPT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "120 mg",
   "insufflated",
   "DPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2010",
   "93940",
   "Male",
   " ",
   "Not Given",
   "Mar 13, 2012",
   "Views: 2767",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In retrospect I should have read more about this drug than what (VERY little) the wikipedia page has to offer: mistake number one. in addition I hadnt yet tried dmt, I had only tried 5meo-DMT once before and 2c-i once before that. mistake number two. that said, this was the typical 'i feel like im going to die' psychedelic experience. I did and still do tend to take my psychedelic experiences as they come so there was no real preparations made other than the taking of it.</p><p>1:30am approx.</p><p>At around this time I railed the full 120mg. this I think was mistake number three. if I had taken the dose in increments of 40mg or so I might have been fine. I think the fact that I did it in the same nostril and all at once would be what got the trip off to a bad start and made the drip so unpleasant. Not as painful as 2c-i but this stuff still made MDMA seem like nothing. after I had already been underway for a couple of minutes a friend whose house I was at took his share (same amount) and almost immediately started complaining about how painful it felt. I was fine until the substance started dripping onto one of my tonsils a little later.</p><p>1:35am approx.</p><p>within about five minutes I think my perception of things started to change. the only source of light was from the TV and so whatever color which was most present was spilled into the whole room. that was mistake number four. jackass was playing and one of the first questions I asked my friend the next day was 'why did you put on jackass?' I think the video playing along with the credits in slow motion was what made the 'choppy' sort of vision and hearing I had started to experience (not to mention the feeling of anxiety) more intense. </p><p>1:40am approx.</p><p>Visually at first there were red and yellow triangles that lined the edges where walls doors and the ceiling met and the typical sort of wave-like motions. More intense visuals were something along the lines of a complex grid of violet triangles that covered the surface of everything in the room and the room itself, like a kind of three dimensional grid. along the grid were six pointed stars that were composed of the different colors of triangles. the colors alternated from red green and blue within the stars and made them appear to pulsate and move across surfaces. if had encountered any entities those would have been it, but around this time I had started to bring attention to my throat.</p><p>1:45am approx.</p><p>the drip felt like it caused my throat to swell up and due in part to that anxiety I hadnt yet overcome. I feared I wasnt going to be able to breathe soon. drinking and gargling water did little help and this is around the time when I puked, miraculously getting very little on myself. everything immediately became much less visual and outside of myself, switching over to within myself and more about thought and feeling. it actually took much time and coaxing from my friend (who seemed impressively levelheaded despite having been as experienced as me) before I acknowledged the fact that I puked.</p><p>2:00am approx.</p><p>this was about the time I stumbled into my friends bathroom after calling the guy who I purchased from and asked what it was he gave me exactly. He had told me earlier that it was '100% pure' which raised some levels of skepticism as I dont know him that well. the emergency vehicle noises I was hallucinating made the situation worse. this was also about the time that I had begun to experience the 'dying' aspect of the trip and I suppose what you would call ego death. </p><p>The thought of having a name seemed sort of obscure to me, and I had trouble remembering who I was and where I came from and where I fit in the world. soon after those thoughts passed was when I felt completely detached from reality and the dying began. curled up on the bathroom floor and eyes closed it felt like I was experiencing time fast enough to the point where I would age and die, have all my atoms scatter through outer space, and then somehow reassemble into new life. this feeling repeated itself very rapidly and took over all other sensory input.</p><p>2:30am approx.</p><p>after cleaning myself off and having the peak subside I felt very reluctant to find myself breathing and okay psychologically. Luckily and I think due to the way I reacted my friend didnt really have any sort of trip and was able to help me. Lying down back in his room hallucinations were for now and the next couple of hours just dim patterns that didnt present themselves very easily. No altered thought was present at this point.</p><p>A few days later I already had the feeling like I would want to give the drug a second go but with the way my throat felt like it was closing up. I feel like I might be allerigic, which probably isnt the case but still. Definitely would take it in more gradually though and now that Im  a little more psychedelically seasoned (lsd, mush, 2c-i, dmt, 5meo-dmt and of course dpt) that would certainly help.</p>"
}
