{
 "title": "Parade Of Lights",
 "author": "Michael H",
 "citation": "   Michael H. \"Parade Of Lights: experience with LSD, Mushrooms & Hash Oil (ID 93952)\". Erowid.org. Jun 24, 2013. erowid.org/exp/93952",
 "substance": "LSD, Mushrooms & Hash Oil",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 17:00",
   "100 ug",
   "sublingual",
   "LSD",
   "(blotter / tab)",
   "  T+ 22:00",
   "4 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 0:00",
   "1 hit",
   "smoked",
   "Cannabis - Hash",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 93952",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Jun 24, 2013",
   "Views: 1901",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is my 3rd time doing LSD \r\nThe first time i did 150 micrograms, which was very powerful, this time i will be doing 100 micrograms...\r\nI have experience with a variety of psychedelics \r\nsuch as, but not limited to; 2C-B, 2C-E, 2C-T-2, 2C-I, mushrooms, 4-AcO-DMT, 5-MeO-DiPT, Bromo-DragonFLY & DMT\r\n5:00 ingest 100 micrograms of LSD\r\n5:20 first alert\r\n5:33 positive mood lift is felt along with a creeping/rising euphoria, i can tell that this will get stronger/better :)\r\n5:45 going to a parade, this should be fun!\r\n5:45 to 8:45 - attended the parade, it was amazing! i had headphones on and was jamming dubstep during the whole parade\r\nwhich made it even better!  it was sooo beautiful! it was everything i thought that it would be and more! :) \r\ni thought that the cops would know how high i was on LSD so i tried to look way, \r\nwhen they drove by so they wouldn't see my pupils!\r\n8:50 - tripping pretty significantly, the euphoria is amazing!!! music is excellent! listening to some diplo :) \r\n9:15 - chillin with my cat and he is purring in my lap this is sooo sweet!\r\n9:35 - loving life :):\r\n9:35 to 1:00 - My trip was dying down at this point and i got upset with my exgirlfriend so that didn't help either\r\nand at this point i thought that my night was pretty much over...when i get a call from a friend, i'll call him 7.\r\n7 tells me he's coming over, which was nice because i was pretty upset and melancholy, 7 comes and picks me up with a few other people who I will call R & C. R is driving and is on 7 grams of shrooms, so is 7, and C had consumed mushies as well [Erowid does not condone or support operating any vehicles while under the influence of any substance].  They offered to let me trip mushrooms and i felt like i was up for my first combo so i ended up taking 4 grams of mushrooms when we arrived at R's apartment... i convinced myself that the LSD was pretty much done at this point... boy was i wrong. in about an hour or two i could tell that the LSD was still lingering, because i had insane visuals. \r\n1:00 to 6:00 - i lost track of time at this point... R's apartment had writing all over the wall and the words were shifting and moving all over the place, i was staring at the wall like it was TV... dubstep made the words move and shift and sway and expand and all sorts of wacky stuff... i loved it, it wasn't too intense at this point... but all that was about to change,\r\nmy friend 7 gave me a dab (hit) of hash oil, and this is where i felt the intensity of the LSD return along with the mindfuck of the mushrooms... i had a complete ego death... along with intense visuals both closed eye and open eye. \r\nwhat was i? who was i? where was i? \r\nThe way i felt was unexplainable, I felt like I was in an alternate universe where the rules of time, physics, and gravity didn't really apply... for a second I felt like I was going to freak out, and my heart rate seemed faster than usual, \r\nMy thoughts started to race and i was slightly nervous... luckily i was able to calm down pretty quickly and talk myself out of freaking out... I remember at one point thinking to my self 'good job dude you just calmed yourself down, that could've been bad.  The intensity of the hit of hash oil lingered for about 30 minutes or so, it sent me flying into a wild and disconnected headspace... i fucking loved it, next time i would take a smaller hit of hash though, it was quite intense.\r\nluckily i've been through much worse (2C-E overdose) so i was used to the feeling and knew that i would return to normal soon enough. i remember feeling like i was 'reset' or like i was a new person after the hit of hash oil. i was so happy to be alive, and was in a really great mood.\r\n6:00 to 8:00 - i layed my head next to the speaker on the floor and thought about lots of stuff, like my ex girlfriend and relationships and my life... i think its possible that the argument i got in with my exgirlfriend may have contributed to the intensity of my trip, shaking up my emotions a bit and changing the feel of the trip... it was quite an amazing experience and i don't think i would do it again any time soon, but i am very happy to have had the experience, i also feel that it may have helped with some anxiety issues i've been having lately i felt alot more calm the next morning, and all day the next day... this is a combo i reccommend for anyone that needs to have a quick reality check and \r\nit was a humbling experience... ego death is never something to mess around with, but it can't help you very much with becoming a better person... i hope you enjoyed my trip report.\n\n\n"
}
