{
 "title": "It Has Pros and Cons",
 "author": "Sabrina",
 "citation": "   Sabrina. \"It Has Pros and Cons: experience with Amphetamines (ID 93959)\". Erowid.org. May 22, 2013. erowid.org/exp/93959",
 "substance": "Amphetamines",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Amphetamines"
  ]
 ],
 "footer": [
  [
   "2010",
   "93959",
   "Female",
   " ",
   "18",
   "May 22, 2013",
   "Views: 1286",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So it's finals week at college and what better way to study than with a little orange pill. I have never tried Adderall before, so I was a little nervous going into it, but I had only heard positive things about it. Not to mention, I was ultra stressed out and to cram weeks worth of information into my head in a matter of 24 hours. So I found a quiet study spot, took the pill, and began studying. For the first hour or so, I didn't really feel any of the effects. All of a sudden, I felt motivated to go to my TA's office hours across campus, so I decided to take the 30 minute walk there. </p><p>Walking there, I felt perfectly normal, but as I walked back I realized that all I could think about was the subject I was studying for. As I came back to my study spot, it started kicking in hard. I felt super antsy, like I needed and wanted to finish studying. I couldn't take my eyes off of my notes, and history all of sudden became the most interesting thing. Not once did it cross my mind to take a break or go on facebook. It was like reading a really good book that you cant put down, but better because I never got tired of staring at my computer screen or my notes.</p><p>Although I never felt hungry, I did try to eat while I was studying, because I figured it wouldnt be wise to skip meals while I was on it. However, I only ended up having a few snacks and completely skipping dinner because I was so engrossed. I literally sat in the same position for almost 5-6 hours straight, without getting up once to use the bathroom or eat.</p><p>It felt great up until about 8 hours later. At around 9 pm (I took the pill at 1), I started feeling nauseous. Luckily, I was almost done studying so I quickly got out of there and tried to eat something. But I felt nauseous up to the point where I literally could not eat anything. I tried going to sleep at around 1 am but my mind was still racing. At around 3 am, my head started to hurt like crazy. That, combined with nausea was absolutely awful. I ended up throwing up in the bathroom and taking an aspirin to calm my headache. I didnt sleep the whole night because I felt terrible. But luckily in the morning, despite how tired and sleep deprived I was, I felt much better and absolutely killed my final. I finished with an hour to spare and cranked out a 6 page essay.</p><p>So overall, Im still weighing the pros and cons of Adderall. I dont know if the side effects were from the fact that this was my first time taking it, or if I should have eaten more while I was on it. But its definitely very useful for a cram session. I would only use it if I was really desperate/stressed out and I would just make sure to eat, drink, and stretch frequently while on it to lessen the side effects.</p>"
}
