{
 "title": "Diaries of a Dealer",
 "author": "Dormroom Traphouse",
 "citation": "   Dormroom Traphouse. \"Diaries of a Dealer: experience with Caffeine (ID 93999)\". Erowid.org. Jul 12, 2013. erowid.org/exp/93999",
 "substance": "Caffeine",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "350 mg",
   " ",
   "Caffeine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2011",
   "93999",
   "Male",
   " ",
   "19",
   "Jul 12, 2013",
   "1181",
   " "
  ]
 ],
 "report": "<p>In the most recent semester of college, I came across some No-Doz Extra Strength Tablets. Free from a gas station, they came in packs of two, which seemed to be the most obvious dose to take. At 400mg, it was a sizable dose, equivalent to 4 or so cups of coffee. The effects were good for studying and for social occasions, as caffeine mixed quite well with alcohol, allowing the user to party into the early morning. Relaxing one day, two friends and I realized that caffeine was available on a website for incredibly low prices, just $9.99 for 100 grams of pure caffeine anhydrous. We further realized that we could probably sell the pure caffeine in capsules for a profit. </p><p>After spending $45 on caffeine, capsules, a cap machine and dime bags, we made our first batch of caffeine pills. Originally we had planned to charge $1 for 100mg in a capsule. However, the size 0 caps that we had held about 350mg of caffeine in the bottom (larger) portion. The cap machine made it very difficult to pre-weigh doses out and fill them quickly. On a hunch, we simply filled the bottom of the capsules all the way to the top and weighed them. In whole the capsules weighed 450mg, 100mg of which we knew was the capsule. As such, we decided that we would raise our cost from $.02/pill to $.05/pill and fill each with 350mg. The cap machine held the bottom portion of the capsule and let you pour caffeine in and then fill the caps evenly to about 350mg. A scale was used to ascertain that each batch of capsules was within the acceptable limits of 300 to 400 mg of caffeine each. </p><p>We then began marketing the pills within our circle of friends, charging a single dollar for a single capsule. We sold them not as caffeine pills, which were (contrary to what we thought) incredibly inexpensive, but as a far superior replacement for expensive coffee and sugary and fattening sodas. Paying $1 for 350mg of caffeine simply made more sense then going to get coffee, paying $4 and getting maybe 150mg of caffeine mixed with a bunch of milk and sugar. Additionally, we spent a dollar on marketing and gave caffeine pills away to those who would try them. The response was amazing. </p><p>Instantly people began to buy the caffeine capsules. The dose was far more than what people were used to. 350mg of caffeine provided a noticeable 'buzz' that was very good at providing energy. People reported that it was the first noticeable benefit they received from caffeine. There were three primary reasons people bought them. First, as a bad substitute for Adderall. People needed to study, and in late 2011 Adderall became more and more difficult to find. So caffeine enabled people to study for long periods of time. Second, people needed to stay up for extracurricular commitments. It worked as intended. Third, and in the category I mostly fell in, was recreational use. Caffeine is incredibly fun when drinking, as you could stay up all night, similar to mixing Adderall and alcohol or the original blend of Four Loko, which had been banned just the year before. As such, people would often buy caffeine pills before a night out, enjoying plenty of energy to dance and drink the night away. Further, it was discovered that unlike caffeine pills made with binders and other nasty things, pure caffeine could be snorted for a nice buzz relatively quickly. People quickly became fans of doing a caffeine pill and then some more caffeine later to keep going. </p><p>In the end, I had made my initial investment back quickly, and then some more after. Eventually I stopped selling caffeine capsules, essentially out of boredom, and a little out of guilt. My customers were honestly excited to pay a dollar for 350mg of caffeine, a mark up of $.95. Later we learned that people were under the impression that our caffeine pills were any different than the kind of pills you could buy 50 for $5 at the store. Somehow (unbeknownst to us, the people who made the pills) a rumor had begun that Vitamin B12 or B6 was blended in with our caffeine, making them somehow superior. Really the only difference was the concentrated dose above the FDA legal maximum per serving (350 vs 200mg).</p><p>Overall though, the semester of caffeine was a fun and profitable one.</p>"
}
