{
 "title": "Very Surprised",
 "author": "Mental Confusion",
 "citation": "   Mental Confusion. \"Very Surprised: experience with Nutmeg (ID 9401)\". Erowid.org. Nov 20, 2004. erowid.org/exp/9401",
 "substance": "Nutmeg",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 nuts",
   "oral",
   "Nutmeg",
   "(tea)",
   "  T+ 1:00",
   "1.75 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 2:00",
   "1.75 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 4:00",
   "2.5 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)",
   "  T+ 5:00",
   "2.5 nuts",
   "oral",
   "Nutmeg",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9401",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Nov 20, 2004",
   "Views: 17853",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nCurrent time 4:10pm\r\nAt 10:30 am this morning I began to grind and consume what would be 10 nutmeg nuts. I put 1 ½ nuts into hot water and milk with lots of sugar. I began to drink it. It was disgusting. It wasnt so much the taste that I couldnt stand just the feeling that I was going to throw up a few seconds after it reached my stomach. With this method of ingestion I decided to bomb the rest of the nutmeg (wrap the powder in rolling papers and swallow them like capsules).\r\n10:30 am to 12:30 PM Wednesday- ground nutmeg and bombed it. Total 5 nuts.\r\n12:45 PM- used Internet to see other peoples nutmeg experiences and the amounts they took. Decided have more nuts.\r\n1:15 PM to 3:25 PM- ground and consumed more nuts. Total 10 nuts.\r\n3:30 PM- no change. Decided to watch TV.\r\n3:50 PM- started to feel slightly stoned. Light sinking feeling. Decided to write up experience so far.\r\n4:10 PM- started writing. Now feel very stoned- like ive had a 2/3 spliffs. No nausea. Eyes not red.\r\n4:15 PM- quite difficult to concentrate. Mind feels blank.\r\n5:45 PM- just been for a walk. Almost got hit by a bus. Getting very hard to write.\r\n6:25 PM- Feel VERY VERY stoned. Very difficult to write. Eyes turning red. Will definitely use as a weed substitute.\r\n9:25 PM- hard to keep my balance. Feels like my heads floating off the rest of my body. I walked my girlfriend to her bus stop (she was going to work). I couldnt tell how far away she was from me. Feel tired. Feels quite trippy. Better than MJ buzz. Felt a bit it intense at times. Walked into a few lampposts and bins.\r\n10:00 PM- very clear closed eye visuals rapidly changing into different things (mostly geometrical).\r\n8:00 am Thursday- woke up in bed. Cant remember much before I fell sleep. Still feel very stoned.\r\n9:00 PM- still feeling stoned and very relaxed. Keep having very clear memories from my childhood that make me feel VERY comforted and warm.\r\n1:15 PM Friday- feel a lot more normal. Still a little stoned though. Feel lazy and occasionally dizzy when I stand up.\n\n\n"
}
