{
 "title": "Vision Quest",
 "author": "G",
 "citation": "   G. \"Vision Quest: experience with 25C-NBOMe & MDMA (ID 94041)\". Erowid.org. Jan 24, 2012. erowid.org/exp/94041",
 "substance": "25C-NBOMe & MDMA",
 "bodyweight": "78 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "2C-C-NBOMe",
   "(blotter / tab)",
   "  T+ 2:00",
   "150 mg",
   "oral",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 94041",
   "Male",
   " ",
   "21",
   "Jan 24, 2012",
   "Views: 4429",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting: Bush camp with friends</p><p>Set: general good mindset, however still some issues in everyday life</p><p>At 6:15 PM I place the blotter in between my gum and cheeks, holding it for 20 minutes. Shortly after, the surging energy from 25C-NBOME ramps up my spine. My brain tingles, feeling electrified as I notice my breathing becoming increasingly heavier. We embarked towards an area near the camp site for further exploration as the others wait for their LSD onset. </p><p>My body feels light and my feet bounced along as if I was gliding. My face contorts to a perma-grin, stimulation gets stronger and so do the waves of euphoria. The next hour or so, the feelings of stimulation and euphoria reach its peak. My mouth numb as if local anaesthesia had been administered, it did not bother me in the least however.  I did not notice any brighter colours or visuals at this point however.</p><p>We make our way back to the camp fire, watching the flames dance was hypnotic. Patterns of eyes arose in the middle of the flames, staring back at me. I didnt break eye contact, laughing as I realise the absurdity of the situation. The majority of the others seem to be around the come up and peak of the LSD, and the general energy and vibe was still positive however two friends were feeling uncomfortable. Increased empathy from the drug amplified my feelings of hopelessness and it depressed me greatly that they werent enjoying the experience as much as the others. Rationalising that the psychedelic experience is an internal one and ultimately an individual one, I decided that there was nothing I could do to alleviate the experience but to be supportive if needed. </p><p>Soon after, I dosed 150 mg of MDMA at roughly 8:15 PM along with two other friends. We also decide to make our way to the lake, letting the others find their comfort zone.</p><p>We make our way to the toilets, sitting outside waiting for a friend. We stared at the sand, and I was mesmerized. It glistened like stars, and the torch light we used shone on an ant. Life under the scope amused me greatly. Shortly after we found ourselves at the lake, and as we sat in the sand the MDMA had begun to onset. It begun with my already weightless body feeling even lighter, my legs however felt like jelly. Eye wobbles were noticed, along with empathy becoming increasingly more evident. We eventually make our way back to the flames. Visuals were more noticeable as well.</p><p>At 10 PM, there was a lunar eclipse and we lied under the stars watching and admiring the sheer beauty of the night sky. I noticed specific stars shining brighter than their neighbours, and soon after I noticed them connecting as if it were a connect the dots drawings for children. The empathy from the MDMA was obvious, along with the increase in talkativeness. Talking and connecting with others was amazingly easy, a task that is usually very exhausting and difficult for me as I am quite introverted and have been struggling with social anxiety for the majority of the recent year. Talking with the others was however a very tranquil and beautiful feeling, and left me feeling content. Lying down was another pleasurable feeling, as it felt soft like marsh mellows cushioning my very body. I would realise how painful it was to sleep on the floor the next day sober.</p><p>We eventually make our way back to the camp site, and sat around the fire once more. I stared at the moon, only to realise I was able to fully concentrate my visual sensors on the moon as the trees slowly faded and their textures were replaced by the night sky and the stars. The moon eventually stared back at me as I noticed the red round moon morph into an oval shape. It became an eye, and I felt the presence of an omnipresent entity staring back and just taking care of me. I was content, and eventually found myself sleeping in the tent with ease. It also surprised me at how easily I was able to overlook issues that didn't matter and get straight to the big picture. This was something I struggled with in life, especially when it came to academic studies where I'll waste too much energy and effort on things that were detrimental.</p><p>What I was unable to fully describe was how these two chemicals helped alleviate a lot my problems I was having in my recent life. The introspection of both allowed me to look at issues without any bias. Some of the feelings were blunt and harsh but much needed. My feelings of alienation, guilt and anxiety melted away and I found myself finally content filled with the serenity. Im not able to fully write out the introspection and the problems that I was able to work out, as they are deeply private and personal issues but ultimately it is also because my writing skills would not be worthy enough to entail the full extent of a psychedelic experience, and any less would be an insult. </p><p>I am currently in the process of quitting smoking, along with a long break from all forms of psycho-actives.  I've also begun confronting some past ghosts that Ive been hiding from. The chemicals have ultimately served as a catalyst that has made me hungrier to live out life to the fullest. I acknowledge that an insightful and good trip has always gave me a false sense of delusion that 'everything was going to be alright,' but this is finally the first time I have taken action. I truly believe now that it is ultimately the individual that has to truly want something, all these valuable chemicals can only serve as a catalyst and nothing more. I will never place drugs on a pedestal anymore, but I will always continue to treat them with the respect they deserve.</p>"
}
