{
 "title": "Sacred Desert Teachings",
 "author": "teonanancatl",
 "citation": "   teonanancatl. \"Sacred Desert Teachings: experience with Psilocibe Cubensis (ID 94043)\". Erowid.org. Jun 13, 2013. erowid.org/exp/94043",
 "substance": "Psilocibe Cubensis",
 "bodyweight": "74 kg",
 "header": [
  [
   "DOSE: T+ 11:00",
   "6 g",
   "oral",
   "Mushrooms",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2011",
   "94043",
   "Male",
   " ",
   "30",
   "Jun 13, 2013",
   "1293",
   " "
  ]
 ],
 "report": "<p>This report is about my most planned experience with mushrooms. I'm a experienced mushroom user (more than 70 trips). Usually I take from 2 g to 3.5 g of dried Psilocibe cubensis. Always from the same supplier. I have tried several others ones here in Chile, but this one is far the best quality I can get here. al the mushrooms were from the same strain of mycelium (a selected one). I do not take any kind of regular medication, dietary supplements or anything. Just a few aspiring per year for headache.  I fasted for 72 hours prior the intake. I usually fast for 24 hours. Since this time I planned to go for the 6g I decided to fast for more time to avoid interactions and be with less toxins in my organism. My last mushroom trip before this one was about 2 months ago (I like to give 'space' for the trips to avoid tolerance). Exactly a week before I was in a ayahuasca ceremony with a peruvian curandero, but that's DMT!</p><p>So, I decided with my couple (C) to travel to the Atacama desert looking for a real quite, with no humans, no machines place to take the mushrooms. I really hate machines, and noises produced by machines when I'm on mushrooms.  I flew with C on a wednesday to Atacama Desert from Santiago (1 hour aprox.) rent a cabin (with no electricity) in a place called 'playa la Virgen' (Virgin beach) in the coast of the middle Atacama desert. We spent the entire next day just being calm for 'mind packing' since we both work on a very tight agenda (I'm a fashion photographer and she is a Clothe Designer) On the next day, at 9 AM we walk for 2 hours deep in the desert to find the right spot. As some of you know, shadow is the most appreciated thing in the desert so we find a hanging stone passage in a rock hill looking for shelter from the sun. Once we get there, we meditate for an hour in this kind of cave before eating the mushrooms at 11 AM. I usually meditate in/on mantras to make my mind clearer before tripping. It allows me to maintain my ego experience further in the psilocibin realms and get the most of the experience.</p><p>The only other thing I take was water to swallow the semi grinded mushrooms. Me and C began to eat them slowly... but after the 4 grams it was almost impossible to not to regurgitate, but none of us puke.</p><p>After 20 minutes of eating the complete 6g (6 for her and 6 for me) we began to feel the effects, I was very dizzy at that point. Also the usual pattern movements began to emerge. All the textures began to breath in a higher way than I expected and the color shifting was remarkable.</p><p>One hour later we were feeling the complete effects and we noticed that we were surrounded by 6 vultures flying in circles around us. I integrate the flying pattern of the vultures into my visions and I was able to 'see' the air masses floating around them, how they dance in these air masses in a kind a ritual dance. At that moment I wasn't afraid of them, in fact I felt they were nature observers of what was going on in my mind.</p><p>Soon the complete landscape begin to dance, all the rocks in the far distant horizon were moving in a river os sand and rocks. The effects on vision were so intense at this point I decided to close my eyes but at that point being with the eyes closed or open was meaningless. I wasn't  able to distinguish my thoughts/visions from open-eye objects. All my perceptive apparatus was melted. Just after I realized this I experiment the most strange thing I ever experienced with mushrooms, I begin to feel an electrical feeling in my legs and arms, a kind of force that was pulling me to the center of the earth in waves, more and more intense to a point I fell the splitting of my mind in four egos. I was able to see myself from above, below, fron and back, but seeing myself and at the same time being the four observers.  Once the four observers (me) join their vision in myself light begin to come out of my heart in a radial spirals. I saw every living tissue of my body trying to reconstruct itself over and over again. I was able to put my consciousness in the force that destroy and reconstruct my body and as soon o do that, a whole landscape of radial circles composed os spikes was moving in front of me. </p><p>At that point I forgot I was in the desert or with C. I was alone experimenting my own and deepest organic fluctuation connected with earths roots. All that came later defy explanation. </p><p>Two hours later I begin to regurgitate again but every movement of my stomach was perceived by me as a 'cleaning' procedure that earth was giving me as a gift. I begin to cry, laugh and puke all at the same time. The electrical feeling was so intense at that point that I thought I was having a seizure. But I wasn't, just remind myself to keep calm and continue. </p><p>The other feeling I always have when I take 4g or more doses is that I can't breath and my heart stops. There is a moment I call 'the eye of the storm' when suddenly I can't hear any sound, can't feel my heartbeat, can feel my breath and all the textures cease to move. I wasn't ale to distinguish who I was, why I was there but feeling the most lucid state of mind I ever had felt in my life. I saw myself entirely, all my karmic relationships going in and out. I felt the presence of entities all around me whispering in my ear. The 'mushroom voice phenomena' on steroids. This is a place where you just can experience and think after, this is a place of pure onthologic beings. There is no division between in and out, subject-object (or whatever you may call it), no division of think and act... everything is and act and the 'beings' there are waiting for you to behave in that way. They showed me all the thing I have to do from this moment to the future. Just after they do this, they 'say' to me: 'this is it, now you have to come back and spread the word about what you have saw here, if you don't do this you won't be able to come here again'. Now I'm organizing a cycles of conferences about the Gaian Impulse and mushrooms.</p><p>It was 18 PM when I look again to the clock, I realized I had taken all my clothes off. C had walked away from me going deeper in the desert. She came back an hour later. We drank more water and begun to walk back to the cabin. We were still tripping when we walked out and at that hour all the desert's insects go out to eat. It was a gift to saw them in this state of mind and after all.</p><p>This was the most transformative experience I ever had in my entire life.</p><p>Sorry for my english as it is not my mother language.</p><p>A L W A Y S plan your experience.</p>"
}
