{
 "title": "One Whole Big Mush of Sensations",
 "author": "geesh",
 "citation": "   geesh. \"One Whole Big Mush of Sensations: experience with Mushrooms (ID 9408)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9408",
 "substance": "Mushrooms",
 "bodyweight": "128 lb",
 "header": [
  [
   "DOSE:",
   "1.75 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9408",
   "Male",
   " ",
   "Not Given",
   "Jul 5, 2005",
   "Views: 3317",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I started smoking weed at the beginning of the year last year, and I got very into it. I liked it a lot, but I wanted to try something more intense and mind altering. I was thinking about acid, but older, more experienced users told me that shrooms was the way to go at first. So me and my friend got luck and found and eighth of shrooms. People had told me that about half an eighth would be a good amount for my first trip and that I probably wouldn't trip too hard. Boy were they wrong.</p><p>We decided to do it at my friends house at night with his parents asleep. Everyone told me this was a stupid idea but I didn't really think much of it. And his room is far away from the rest of the house and his parents cannot hear anything that goes on in there.</p><p>Since they literally smelled like dog shit, we looked on the internet for a preparation to take away the taste. We found one that said to blend them with orange juice in a blender. We agreed to do that, and right after we took it out of the blender, my friend's sister who is 10 kept asking us for some of it, thinking it was a normal smoothie.</p><p>We drank it at 10:30 PM, and couldn't even taste the shrooms. I am a pretty anxious and nervous person by nature, so as I expected I was pretty nervous about taking them with his parents home. But I did it anyway. I practically live at my friend's house so I felt pretty comfortable with setting. </p><p>After about 20 minutes I could feel an indescribable 'something' going throughout my body that continued for about another 20 minutes. At about the 45 minute point I broke out into a hysterical laughter that I couldn't control. I kept running around his room laughing like a lunatic. Then he told me that his dad might still come in to say goodnight and that I needed to act normal. He told me to sit at the computer with him and pretend like I was watching him do something on it, but all of a sudden all the colors on the computer were changing and I couldn't stay focused. My friend was getting mad at me and threatened to gut me and kill me if I was not quiet. He thought I had not taken him seriously because of my reaction, but it stayed in my mind for the whole night.</p><p>After about 20 minutes of hysterical laughing, and at about the 1-1:15 hour point I was in a completely different world. He had black lights set up in his room and I was totally tripping off of them. I could see rainbow colors floating through the room, and repeating geometric patterns everywhere. I could not differentiate from any of my senses, everything seemed to be one whole big mush of sensations. </p><p>At many points throughout the night my friend wanted to leave the room and explore the house, which I thought was a bad idea. I thought he would do something stupid and get us caught. After I realized that I would not be able to keep him in the room, I just accepted the fact that we were going to get caught. There was no doubt in my mind that we were in deep shit. I tried to escape this feeling by closing my eyes. BAD IDEA!!! The second I closed them I was engulfed by random colors and patterns flowing into one another, all forming one giant being that was chasing after me. I opened my eyes and thought, 'well at least some time passed by and I'll be coming down soon'. ONLY ONE FUCKING MINUTE HAD PASSED!!!! I knew it would be a long night.</p><p>I was so tripped out that all I could do was lie on the bed with my shirt off and poke myself in the face. </p><p>After about 3 and a half hours of hard tripping I was starting to come down. Me and my friend just laid in his bed and talked for 3 hours about everything. We fell asleep at 6 AM and slept until 11:30 AM.</p><p>Overall it was an extremely intense, but fun experience. There were points during the trip where I got scared shitless and thought I was having a heart attack, but those feelings disappeared as quickly as I felt them. I have since shroomed again with a lot less paranoia and it was a great trip! HAPPY TRIPPING!!</p>"
}
