{
 "title": "NahHuhWellOkay",
 "author": "CrackerJack",
 "citation": "   CrackerJack. \"NahHuhWellOkay: experience with Nootka Lupine (ID 94173)\". Erowid.org. Dec 22, 2011. erowid.org/exp/94173",
 "substance": "Nootka Lupine",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "5 bowls",
   "smoked",
   "Nootka Lupine",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2011",
   "94173",
   "Male",
   " ",
   "19",
   "Dec 22, 2011",
   "4530",
   " "
  ]
 ],
 "report": "<p>So, i grew up in Southern California and ive tried just about everything you can think of, weed, acid, shrooms, hells bells, morning glories, meth, coke, 2C-E, DOB,salvia, DMT, and more so ive done my fair share. ive always been kindof lightweight but never one of the guys whos trippin out for no reason and despite some crazy ass trips i can only say ive had one bad trip, and that was the seventh time i did hells bells, btw that shit is not for the sane or weak minded. </p><p>On to the nootka, id been homeless for about 4 months and never had enough weed. Id seen nootka loopine on erowid and id read the report, one day i saw the unmistakeable purple flowers and leaves on a nature trail so i grabbed the whole plant. I pulled all the leaves off and kinda de-stemmed it, then i took all the purple flowers and put them by themselves. I dried the leaves and flowers and chucked everything else. A few days later i sat down with my little binger and packed 3 fat bowls in quick succession. although after the second hit i just fellike my eyes wanted to open up a little wider, and the next hit...a bit wider, and after that wider still until i felt like my eyebrows were about to climb off my head. i could easily close my eyes but it just felt comfortable to have them wide open looking all around like i was cracked out. i smoked 2 more bowls and, I didnt really feel high, but i knew i wasnt sober and when i tried to think i realized i was pretty scatterbrained. eventually i got up and walked around, went to hang out with some friends and pretty much forgot i was high, but i was definitely not sober, it was a strange feel. </p><p>All in all it was a mildly stimulating, barely euphoric drug. I definitely got high, but its not worth even comparing to anything find something else.</p>"
}
