{
 "title": "The New Cure for the Atomic Bomb",
 "author": "Phil",
 "citation": "   Phil. \"The New Cure for the Atomic Bomb: experience with 25C-NBOMe & Cannabis (ID 94261)\". Erowid.org. Dec 31, 2011. erowid.org/exp/94261",
 "substance": "25C-NBOMe & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "1 mg",
   "insufflated",
   "2C-C-NBOMe",
   "(powder / crystals)",
   " ",
   "  ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 94261",
   "Male",
   " ",
   "Age at time of experience: 21",
   "Dec 31, 2011",
   "Views: 5707",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I had ventured into many explorations using research chemicals, cannabis, san pedro cactus you name it I probably did it(except heroin and meth). </p><p>It was 2 days after Christmas that I decided I would try this new novelty substance known as 2C-C-NBOMe. It became something quite epic. I had gotten it from a reliable source with good purity. It was 2-3 small white rocks of powder. I decided to go with the nasal route and it worked.[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article] </p><p>Within 5-10 minutes after I took my hit, I was feeling the usual psychadelic head feeling. This led into the next 20 minutes of me preparing to go on a walk outside at night. I grabbed my skateboard and my PsP and tripped more than I ever have.</p><p>Everything starting coming to life about 30-45 minutes into it and my time cruisin on my board had me thinking about my life. I was torn apart from a relationship and I had guiltiness from all the bad things I had done up to this point. I had some anxiety too and this seemed to diminish rather quickly. I couldnt feel any pain, but sounds were enhanced by 5x and my body felt extremely electrified and content in my mind. I rode around the neighborhood lookin to the sky hoping I could pissibly cure any mental issues I ahd and by the 1-1:30 hour into it, I was back home seeing trails and playing Call of Duty. I was so into the game like my attention was totally focused 1000% more. This chemical has been proven if you explore your mind right to be even more potent and beneficial than LSD. I approve of it more because the ergot fungus LSD is made from has a lot of issues with vasoconstriction and it's pretty much a risky call with that in high doses. 2C-C-NBOMe has done more for me on the trip than LSD ever could probably do. I feel like I want to go outside more and not be afraid of what's next. Music was amazing. All you wanna do is love and feel like your one with the universe. HT2A receptors are where people have genes that affect depression mood and other mental abilities. These agonists not antagonists, help inhibit anxiety, improve your social life, improve pain and nerve damage, and also improve your total outlook on life if you seek out the real purpose of its use and not just trip to be cool. overall it was about 5-8 hours and I had cannabis at the end which made me sleepy and didn't alter my mind or mood. Research into these chemicals should be evaluated and not be criminalized substances. They help people overcome mental disabilities. I feel good. Maybe you can someday too. Peace</p>"
}
