{
 "title": "Green Gnosis",
 "author": "Lizard",
 "citation": "Citation:   Lizard. \"Green Gnosis: experience with Salvia divinorum (ID 9431)\". Erowid.org. Sep 14, 2001. erowid.org/exp/9431",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9431",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Sep 14, 2001",
   "Views: 59883",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nUnder the stunted oak I waited for her\r\nthe Green Lady\r\nclothed in the black of the mystified, the lost,\r\nbut more truly, naked and unshriven, seeking a dying moment.\r\nUnder my tongue, the bitter mint\r\nabove my head, invisible leaves,\r\nknown only for the moonlight they intercept\r\nbelow my back, the green grass that saw me through my youth.\r\nShe came to me in a spirograph body\r\nwings twined with ivy in curliqued ringlets\r\nher fingers the thorns of roses pointed with the blood of the unworthy\r\nthe edges of her smile reaching up to the stars, her teeth, barbed spikes\r\nI had not expected fear, but terror came with her\r\nand tho I sought a dying moment, she showed me a dying eternity\r\nand tho I sought to bring wisdom into the real, she tore the real from me\r\nand I was no more, and in unbeing, I lost my fear\r\nShe made me into a mist, expanding slowly until I was all\r\neverywhere, blown by the wind of her breath\r\ninto eddies and whorls within myself\r\nand it was I that her wings beat, to keep her aloft\r\nShe flew in me, acrobatically spinning and turning\r\ncasting off parts of myself in colors I have never seen\r\nI flowed across her wings, she breathed me\r\nand I flowed through her grasslike hair\r\nSoon, oh, too soon,\r\nboundries encircled me and I contracted, condensed\r\nand rained myself on the stunted oak, and dripped from it in rivulets\r\nand froze beneath it into this mortal body, clothed in black of the still\r\nmystified, but no longer lost.\r\n© 2001 Lizard\n\n\n"
}