{
 "title": "The Final Maddening Space btwn Life and Death",
 "author": "i hate cannabinoids",
 "citation": "   i hate cannabinoids. \"The Final Maddening Space btwn Life and Death: experience with AM-2201 (ID 94563)\". Erowid.org. Jan 23, 2012. erowid.org/exp/94563",
 "substance": "AM-2201",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "AM-2201",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2010",
   "94563",
   "Not Specified",
   " ",
   "20",
   "Jan 23, 2012",
   "4871",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I've at this point read several posts online about an 'overdose' of AM-2201. I am going to share my experience of a large dose of AM-2201 and my journey to the final maddening space between life and death.  </p><p>I ate two brownies of what I now know to be a very potent batch of AM-2201 brownies. At first I was feeling wonderful but about 2 and a half hours after dosing things began going south. I laid down and got off my computer to try to let myself sleep it off... Or just trip out. The intensity began to build and I felt shocks build around my body. I started to believe I would soon have a panic attack if I let go... So my mind was trying to hold onto life as much as possible.  As the trip deepened I began to hear my conscious separate from the rest of my mind.  I began experiencing maddening thoughts between do something and don't. I began to believe I was dying and no matter what I did or told myself there was no way to stop my death... I overdosed on a powerful cannabinoid and it was what I deserved after all. I began envisioning life and death and my conscious was telling me that I had no chance to survive and negated anything positive I could yell myself.  My body began to shut down or so it seemed but I strived with all my being to live. My conscious voice began telling me that no matter what I did, it would result in death. </p><p>Back and forth I went and after almost 3 hours. I started FINALLY coming out of the bad trip.  I managed to turn the TV on and get back on my computer to finish the NFC championship game.  Almost 12 hours later my ego is shattered, destroyed, raped, and murdered.  I can't believe I survived and would never wish anyone to experience this type of trip with AM-2201 or anything else for that matter. Yesterday I was trying to think of something so awesome it's actually terrible... This trip is that.  Luckily I've been listening to UNKLE or I'd be in shambles still.</p>"
}
