{
 "title": "It's a Huge Scam",
 "author": "NYC addict",
 "citation": "   NYC addict. \"It's a Huge Scam: experience with Ibogaine (ID 94635)\". Erowid.org. Jan 27, 2012. erowid.org/exp/94635",
 "substance": "Ibogaine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE:",
   "3 g",
   "oral",
   "Ibogaine"
  ]
 ],
 "footer": [
  [
   "2010",
   "94635",
   "Not Specified",
   " ",
   "24",
   "Jan 27, 2012",
   "Views: 7174",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I went to an Ibogaine program in Mexico about a month ago. For quite some time before this I had been researching and I cannot believe what people on this website are saying about this garbage. I am convinced that employees and owners of these places are fabricating reports. I was in a group with an alcoholic, 2 OxyContin addicts, a heroin addict and myself (I am a heroin addict but I went to this program to get off methadone which I was maintained on for several years at a dose of 110mg daily). We all had the same experience even though we were isolated from each other during the actual 'treatment'. </p><p>The first thing you notice when it kicks in is a very annoying buzzing sound that continues all night. Theres a lot of trails, light sensitivity, the doctor almost looked like he had aztec war paint on his face. Other effects are you can barely walk, one patient slipped and gashed his head while trying to piss. There is no profound aspect to this trip, it is nothing like LSD or psilocybin or 2C-B or anything of that sort. Like I said, we all had more or less the same experience. For the next 10 days at the program we all felt like complete shit. The claim that ibogaine stops withdrawals may be true but I couldn't tell because it fucks your body up so bad you might as well kick cold turkey. None of us could eat, sleep or even walk around much for the remainder of the treatment. After crossing the border to fly home, the other heroin addict and myself had about 8 hours to kill so we copped some tar, which was a first since we both come from the northeast. We got a gram and did less than 0.1 and it got us high as hell. What I can conclude from this is that ibogaine does scrub opioid receptors clean and wipes out tolerance so Be Very Careful if you go back to your drug. </p><p>So, a month after the treatment, I live in a midwest state now, wouldn't know where to find dope if I wanted to, but if a bundle fell into my lap I would do it. My desire to use and my addiction have not been affected by ibogaine, I just can't afford to be a dope fiend right now, I have too much to lose. The lingering effects of ibogaine after treatment are insomnia, loss of appetite, aches and pains lasting several months. At the program they gave us large doses of benzodiazepines every night and even sent us out with 3 valiums for the plane ride. I will not say ibogaine is useless, it does act on the opioid receptors and it seems to really flush the drugs out but all the experiences on this website are ridiculous to me.</p>"
}
