{
 "title": "A Good Roll But Moreish",
 "author": "4TBT",
 "citation": "   4TBT. \"A Good Roll But Moreish: experience with 4-Methylethcathinone (ID 94630)\". Erowid.org. May 16, 2012. erowid.org/exp/94630",
 "substance": "4-Methylethcathinone",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "4-Methylethcathinone",
   "(powder / crystals)",
   "  T+ 1:30",
   "50 mg",
   "insufflated",
   "4-Methylethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "94630",
   "Male",
   " ",
   "20",
   "May 16, 2012",
   "4052",
   " "
  ]
 ],
 "report": "<p>I bought a bunch of 2ci from an online vendor, but to get free shipping I had to buy a little bit more. Looking at what else they had I noticed 4-MEC. I've never tried an RC stimulant before, but after doing some research on it I thought to myself 'what the heck?' and ordered a small amount.</p><p>When I opened my package I got a small baggie of the 4-MEC, 'rice crystals' as the vendor described it, which was spot on because they were off white and the size and shape resembled uncooked rice. Weighing out 150mg on my scale, I put the 4-MEC on a small sheet of toilet paper and rolled it up to make a parachute.</p><p>T+0minutes: Down the hatch, no real queasiness or anything in my stomach, so far so good.</p><p>T+0:15 - Nothing so far except for a bit of anxiety. Most likely just the anticipation for the effects that will come.</p><p>T+0:30- Definitely in a positive mood that can only be due to the 4-MEC. </p><p>T+0:45 - Wow I feel great! There's a grin on my face that I just can't shake.</p><p>T+1:00 - Everything feels great to the touch, almost like a good MDMA roll but not quite. Considering rolling around on my shag rug</p><p>T+1:15 - Rolling around on my shag rug. Definitely not as much energy as I'd have on MDMA but still good.</p><p>T+1:30 - The euphoria and sense of touch are wearing off, and I have the strong urge to have more. I weigh out 50mg and insufflate it. There is a definite burn, and the drip tastes very bad.</p><p>T+1:45 - Feel good but not as good as the first dosage. I lay down on my bed and think about all the people in my life and how grateful I am for them, another effect similar to MDMA.</p><p>T+2:30 - Down to just a bit of euphoria but still definite stimulation. Urge to take more but I decide against it.</p><p>T+3:30 - After a good experience, I am ready for bed.</p><p>Waking up the next day, I experienced what is probably my favorite part of this drug: no hangover. In fact, after having only 5 hours of sleep I felt surprisingly chipper and ready to take on my day.</p><p>In retrospect I find 4-MEC to have great euphoric properties, but the entatogenic and empathetic effects, while worthwhile, are not quite as good as MDMA. I would be, however, more likely to choose this over MDMA in a club setting, purely because there is simply no crash. The only serious drawback I can find is that there is a strong desire to take more during the roll. Long-term, however, I find that I have very little urges to try it again, so I'm not too worried about addiction potential. Definitely buying more.</p>"
}
