{
 "title": "Subtle and Pleasant",
 "author": "jaggerjack",
 "citation": "   jaggerjack. \"Subtle and Pleasant: experience with bk-MDEA (Ethylone) (ID 94687)\". Erowid.org. Mar 12, 2012. erowid.org/exp/94687",
 "substance": "bk-MDEA (Ethylone)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "bk-MDEA",
   "(powder / crystals)",
   "  T+ 1:10",
   "100 mg",
   "oral",
   "bk-MDEA",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 94687",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Mar 12, 2012",
   "Views: 4932",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nIm a freshman in college with a pretty decent amount of experience with psychedelics and expanding experience with empatheogens. I did 6-APB around 3 weeks ago, 4-FA about a week and a half before that, and Adderall a week before that so there might be some slight tolerance. I have tried bk-MDMA three times with the last one being four months prior.\r\n9.20: 150 mg bk-MDEA (E1, Ethylone) taken dissolved in grapefruit juice. The juice almost completely masks the taste, to the point that I might not have known there was something up if I didnt mix it myself.\r\n9.30: Is this a first alert? I know stuff hits me fast but wow. \r\n9.35: Yep, feeling light and warm. Smiling some. Talkative. Attempt to masturbate since I probably wont be able to later. Cant get a hard but find watching porn very nice. Usually I just do it because its easier to beat off but I was appreciating it as an art form. \r\n10.00: Feeling very warm and bubbly. Slight euphoria and very talkative. Music is sounding pretty great. Im quite excited to talk to my girlfriend later tonight. Im not overwhelmed by feelings of wanting to rub or hug anything so except for my dilated eyes I could easily pass for sober. \r\n10.30: Still very subtle so take a booster of 100 more mg. Played Super Smash Bros. Brawl while waiting for my girlfriend. The idea of playing teams was very appealing and it was nice to just mess around. \r\n11.00: Not feeling the booster. Talk to my girlfriend on skype for a while. While on 6-APB or bk-MDMA the euphoria and lovey feelings are quite forced and almost uncontrollable but bk-MDEA is more about an appreciation of my love for her. Talking to her mom was fine and she had no idea what was up. A bit more lovey than 4-FA but with less euphoria and very little physical stimulation. \r\n1.00: Finished talking (and I did a lot of talking), effects are starting to wear off. \r\n2.00: Eyes still slightly dilated but main effects mostly worn off. I feel slightly warm and fuzzy but this could easily be confused with giddiness due to being tired. Im still mentally happy but not nearly as much. A bit hungry (although when I start eating I cant eat much) and still digging music but I always do. Brushed my teeth to get rid of a foul taste, I had this on 6-APB as well. I dont know if its the substances themselves, the fact that I drank them, or something else entirely. \r\n4.00: Not really tired but could probably sleep. Hungry with a slight headache. Still difficult to get an erection and orgasm was very unsatisfying. \r\n4.45: Take a nice warm shower which feels very good and go to bed. \r\n6.00: Woke up and cant fall back asleep, feeling fine just a bit groggy. I dont know if its the drugs or the temperature of the room but sleep is impossible. Easier to get an erection and orgasm was good.  \r\n8.30: Quite hungry so I waited until the cafeteria opened to get an apple, orange, and croissant. The fruit was especially easy to eat and the croissant wasnt bad. \r\n9.30: Finally fall back asleep although if my girlfriend had woken up I definitely would have talked to her for a while. \r\n12.00: Wake up, feeling groggy and struggle to fall back asleep. \r\n1.30: Wake up feeling fine (better than expected with such little sleep) and go get some food. Meat was hard to eat but I did get some food down. No hangover to speak of. No headache, not even really tired. Maybe a bit muted emotion wise but that could just be normal. Jaw slightly sore but not much.\r\nThroughout the day it was hard to eat a lot of food in one sitting. I had no trouble staying up late the next night.\n\n\n"
}
