{
 "title": "Wow",
 "author": "Kevykev",
 "citation": "   Kevykev. \"Wow: experience with 2C-P (ID 94769)\". Erowid.org. Apr 24, 2012. erowid.org/exp/94769",
 "substance": "2C-P",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "2C-P",
   " ",
   "10 mg",
   "oral",
   "2C-P"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 94769",
   "Gender: Male",
   " ",
   "Age at time of experience: 22",
   "Added: Apr 24, 2012",
   "Views: 3260",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Began by taking 10 mg orally on empty stomach.  Took forever for this chemical to begin, so took ANOTHER 10 mg. Sure enough though, the first round kicked in. </p><p>It began as the build up of anticipation, the feeling something big was going to hit. I got the body high first, a crazy rush that lasted and lasted, then the strong visuals gradually took notice. Everything came alive it seems, just bubbling with energy waiting to be released. I achieved clarity with my thought processes, so I could hold a normal conversation - even though I was severely hullicinating. </p><p>Everyone around my friend and I, had absolutely no idea what we could possibly be going through. When I first noticed that the second round kicked in... It felt like time slowed to a stop. Every second dragged by as I tried to come to terms with what I was actually witnessing. What I really just put my mind and body through. This chemical really took a strong hold on the perception of my mind like I never would have anticipated. </p><p>I kept thinking I may have taken too much, for the reason of how much more intense it got and would not slow down. Reality had to be put on hold, because things that shouldn't normally be present seemed to come alive. Like the creatures lurking in the back of my mind, took the form of realistic monsters right in front of me, but always disappearing back into the shadows before I could catch them. </p><p>This chemical lasted an extraordinarily long time. Many an acid trip seemed to last 'forever'. But the longest pales in comparison to how long the intensity of this chemical lasted. I can't even begin to transcribe all I experienced, it would sound like the ravings of an asylum ward. If you are really looking for the trip of a lifetime, be careful if you choose this chemical, it grabbed me and wouldn't let go...</p>"
}
