{
 "title": "A Calm Euphoria",
 "author": "Chemboy7",
 "citation": "   Chemboy7. \"A Calm Euphoria: experience with 4-Methylethcathinone (ID 94798)\". Erowid.org. Mar 1, 2012. erowid.org/exp/94798",
 "substance": "4-Methylethcathinone",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "225 mg",
   "IV",
   "4-Methylethcathinone",
   "(powder / crystals)",
   "  T+ 2:00",
   "200 mg",
   "IV",
   "4-Methylethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "94798",
   "Male",
   " ",
   "29",
   "Mar 1, 2012",
   "5064",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: 225 mgs of 4-Methylethcathinone is considered an extremely high dose, see 4-Methylethcathinone Dose Chart] </p><p>This is my first full experience with this substance. I had had a couple threshold dosages a few days prior, just to test the water with it.</p><p>Anyways, let me give you a little background on myself before I get started. I became interested in 4-MEC shortly after Mephredrone became illegal. I was planning on trying some Mephredrone (hearing glowing reviews of it) but, given that wasn't an option I went with the slightly less potent 4-MEC. I was looking for a nice rolly empathogen that had a good rush IV and wasn't subject to the rapid tolerance of the Pheneythylamines. I am well versed in both empathogens and Cathinones (all stimulant classes really). I have been an IV drug user for the better part of the last 15 years and also know my way around the RC market better than most. Anyways, so I was looking for a rolly empathogen with a decent rush. 4-MEC didn't disappoint me totally. Allow me to explain.</p><p>It's just turned 2am and I'm feeling a bit randy. I don't feel like drinking tonight, I can't afford any coke at the moment, been sober on Opiates for to long to fuck that up... but pot just ain't gonna cut it tonight. I decide it's time to give the 4-MEC it's fair shake. I measure out 225mg. It goes completely into 0.5ml of luke warm water with only minor stirring needed. Completely clear solution. I hit pay-dirt and got a flash on my first try. There is no taste after injection. The rush is a slowly building one, over the course of about 8-10 seconds or so. Very mild, but the euphoria starts in under a minute. Very reminiscent of MDE as it is euphoric, but it comes short of the magic of molly.</p><p>By 4 am I am feeling more and more like I am coming to the tail end of this thing. There is a bit of a crave to this thing. Comparable to comedown of doing maybe one line of coke. Either way I decide to spike another 200mg. Increased the effects, but was much less potent than the first shot.</p><p>By 6:30 I am able to sleep with the aid of a few Unisom tabs and a bit of Valerian root. The next day had no after effects, but there was no afterglow to speak of either. All in all, I'd say it's a cool little chemical. By no means overpowering or long lasting, but that can be a good thing sometimes. If you're looking for a killer rush, it's not here though. I would give the rush a 4 out of 10. I'd rate the euphoria about the same. There is also a clean Amphetamine kinda feel that is always slightly in the background with this. Not intense, just a gentle push of energy. I'm looking forward to trying 350mg IV; given my experience at this dose I bet that'd be a good hit.</p>"
}
