{
 "title": "Insufflated vs. Oral, Caffeine Comparison",
 "author": "cowardsCoke",
 "citation": "   cowardsCoke. \"Insufflated vs. Oral, Caffeine Comparison: experience with Caffeine (ID 94854)\". Erowid.org. Mar 7, 2012. erowid.org/exp/94854",
 "substance": "Caffeine",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "insufflated",
   "Caffeine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 94854",
   "Male",
   " ",
   "Age at time of experience: 20",
   "Mar 7, 2012",
   "Views: 24316",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I would like to intimately detail my experiences with caffeine and Adderall and their different methods of ingestion.</p><p>When I was 14, I started drinking coffee. I usually drank only a half cup (about 80-100 mg caffeine) because any more would cause jitters. I found it greatly helped my ADHD and improved my mood. I continued drinking only coffee for several years. I occasionally drink up to 3-4 cups a day. I also enjoy energy drinks such as Red Bull, Full Throttle, NOS, Amp, etc.</p><p>Recently I've taken to caffeine pills because they are readily available and very cheap. I can get 200 mg pills for \n</p><p>I was so ready. That's the best way to describe it. She said it was like smoking cocaine (not crack, just regular cocaine). You just feel ready, ready for anything. You feel stimulated, but calm at the same time. It makes me want to take a nap, but it doesn't, just like coke. It was so similar I thought to call it 'coward's coke' (It's clever because it's yellow). She disagreed saying it was close enough to just call 'coke'. </p><p>It was surprisingly euphoric and powerful. The effects come in about 30 seconds. I felt lighter and lighter as the substance surged into my blood stream. </p><p>Some interesting comparisons:</p><p>--Insufflated caffeine pills--</p><p>-Pros-</p><p>Quick, very noticeable onset; wonderful before doing work, gives a powerful 'signal' that it's time to get up</p><p>Smaller dose needed, 100-200 mg is typical for me, 600 mg is too much and causes nausea and appetite suppression</p><p>Little to no light-headedness; normal doses (200 mg or more) of oral caffeine cause light-headedness and sometimes fainting</p><p>Little to no stomach pain</p><p>Greatly increases motivation as compared to oral, likely due to sudden increase in energy; I want to get up and do something!</p><p>Much more euphoric; the euphoria is secondary, not as a direct result of the drug, but rather as a result of increasing the pleasure of doing activities. Tasks become easy and therefore the joy in doing them isn't overpowered by the effort it requires. It also increases the activity of my mind's eye, making imagination much more vivid.</p><p>Come down is mild or absent</p><p>-Cons-\t</p><p>Nausea can be overwhelming if too much is taken (600 mg is too much for me), I've only had it from oral use once. It was 600 mg taken with little tolerance.</p><p>Nosebleeds happen after a few days of insufflation</p><p>Nose pain develops with too much use</p><p>Increases chances of getting sinus infection (I got one in two weeks because I didn't clean my sinuses out)</p><p>Increases nasal congestion sometimes or causes runny nose.</p><p>Bitter drip (but not nearly as bad as other pills or drugs and practically unnoticeable with less than 200 mg)</p><p>-Notes-</p><p>Likely to have shorter duration of action; I haven't noticed it because I continue to work even after it wears off.</p><p>Pills should be very finely powdered, more drug is absorbed and pain is much less noticeable.</p><p>Unlike other pills (such as lortabs or tramadol) the pain is almost unnoticeable and the drip is subtle and only mildly bitter.</p><p>After 10 minutes or so, you should flush your sinuses with saline solution until you can't taste the bitterness anymore. </p><p>Caffeine is mildly caustic and any pill will cause damage to your sinuses over time. Clean that stuff out!</p><p>Benzedrex or Vick's inhalers are great for clearing the nose prior to insufflation.</p><p>Some brands are better for insufflation than others; don't use No-Doz brand, it contains an acid to speed onset (ouch!) and is pricey, but it'll work in a pinch.</p><p>Western Family brand is good, about $0.25 each when bought in 16-packs.</p><p>Equate brand (from Walmart) is even better, less dye and about $0.05 in bottles of 80.</p><p>My favorite brand so far is Jet-Alert double strength. It's about $0.04 in packs of 90, has even less dye, has less other ingredients, and is the most potent by weight (thus less fillers are inhaled) but contains lactose (which some might be allergic to). It also breaks into a finer powder than the above. It's silky smooth!</p><p>--Oral caffeine--</p><p>-Pros-</p><p>Easy and convenient; doesn't require anything but water.</p><p>Easy to find; tea, coffee, energy drinks, caffeinated gums, shampoo, etc.</p><p>Caffeinated beverages are delicous!\t\t\t</p><p>-Cons-</p><p>Causes light-headedness in small quantities (200 mg) and fainting in larger quantities (400 mg or more)</p><p>Causes stomach pain (especially acidic coffee)</p><p>Drinks can be expensive: Red Bull 80mg for $2, Pill 200 mg for $0.05</p><p>Milder effect and slower onset are hardly noticable for me.</p><p>Come down is very noticable, yawning, dizziness, and sleepiness are common.</p><p>-Notes-</p><p>More likely have laxative and diuretic properties, esp. coffee. This goes away quickly as tolerance increases.</p><p>--Other caffeine notes--</p><p>Caffeine works by blocking the action of adenosine, the substance that makes you sleepy.</p><p>Caffeine tolerance builds rapidly withing a few days, for me, it stabilizes around 400-600 mg per day.</p><p>Caffeine has laxative and diuretic properties, but the effect drops off rapidly with tolerance.</p><p>Taking breaks to decrease tolerance does work, but it seems to be more effective overall if used every day, it also tempers the effect so overdose is less likely.</p><p>I have ADHD, so caffeine tends to have an opposite effect on me, that is, it helps me calm down, focus, and actually promotes sleep. I often snort 2 pills (400 mg) and then take a 'caffeine nap'. I lay down with my eyes closed and just relax. I have a very light sleep for 10-15 minutes and them I'm REALLY ready to go. It doesn't prevent sleep, it just makes fatigue less noticeable.</p><p>It has an effect mostly on the body, as compared to amphetamines (Adderall), which stimulate the mind more. When combined, they work to have a powerful effect on my motivation. I just want to do everything. Everything I do is enjoyable which is great because I've always had a low level of joy. Every task seemed like such a huge effort that I couldn't enjoy anything. Now the effort seems trivial. This combination has turned mountains into mere anthills. It increased my functioning to that of a normal person and even more! </p><p>Amphetamines, however, have side effects. They can completely eliminate the desire for sleep, and they cause dry mouth, an unusual taste, dry skin, acne, weight loss, and over-stimulation. They can make me unable to slow down. I feel my legs getting tired, but I don't care and keep working until I'm exhausted.</p>"
}
