{
 "title": "Detached and Out of Touch",
 "author": "BC",
 "citation": "   BC. \"Detached and Out of Touch: experience with Cannabis & Alcohol (ID 94859)\". Erowid.org. May 22, 2013. erowid.org/exp/94859",
 "substance": "Cannabis & Alcohol",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   " ",
   "4 hits",
   "vaporized",
   "Cannabis",
   " ",
   " ",
   "1 shot",
   "oral",
   "Alcohol - Hard",
   " ",
   " ",
   "1 glass",
   "oral",
   "Alcohol - Beer/Wine",
   " "
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 94859",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: May 22, 2013",
   "Views: 697",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background: I am an 18 year old male college freshman. I am 5'7' and about 165 lbs. I have dysthymia (chronic, moderate depression) and am on 75 mg of Zoloft. This took place in a small house with about 8 other people. I knew one very well and two moderately well. The others I had never met before, but I trusted them and had no misgivings.</p><p>I had smoked marijuana 5 or 6 times before this instance, but had felt mild (if any) effects. The first two times, I felt nothing at all. The next few times I did so, I would feel mildly giddy and a bit 'looser', some 'munchies', and some weird physical sensations like heightened awareness of my teeth, increased sense of smell, mild headache, bodily tingling. During these experiences, my friends were all much more affected than I was, even though we had smoked the same amount (or I had smoked more, even). I thought that I knew what it was like to be high, that marijuana just didn't affect me as it did others, but I was apparently wrong.</p><p>My friend told me that he wanted to finally get me properly high, and I agreed, though skeptical that it would actually happen. Around 10:30 P.M., the two of us and another acquaintance smoked from my friend's pocket vaporizer as we walked to another acquaintance's house. It was probably a bit under 30 degrees, so we were all very cold. As we walked, I could tell that the two of them were getting high, but I couldn't tell about myself. In total, I think that I took 4 hits. Around 15 minutes after I had taken my final hit, I began to feel slightly different. I felt 'looser', especially in my shoulders and back. I also felt a bit clumsy.</p><p>When we stepped into the warmth of the house, things started feeling surreal for me. I figured that the cold weather had halted my experience of the high. I felt quite odd as I shook hands with my friend's housemates, and yet also at ease. After some amount of time, we walked down the hall into the kitchen. We were there for a while, but I have no idea for how long. I only know that that was when I started to really, really feel things. I felt unsteady and as though I were in a dream. Time began to be extremely distorted; what was really ten minutes felt like two hours. Things also almost felt as if they were wobbling or moving. I had completely forgotten what the rest of the house looked like, even though I had probably just seen it. I just felt very, very strange and dissociated. At one point, I felt as if I were in an anti-drug PSA. Even at the time, this was funny to me, but for some reason I had the intense feeling of this. I also had the feeling of being an absolutely stereotypical college student, and kept fixating on that. Around this time, I also had 3 jello shots which supposedly each contained 1/3 of a shot of Everclear. I was feeling weird. I'm not sure if I would say that I was feeling 'good', just weird. 4 or 5 friends came in to the apartment, talked for a while (again, I have no idea for how long), and then left. </p><p>Eventually, we all went upstairs. My mouth was feeling very dry, so I got a glass of tap water. That tap water tasted so fucking amazing! It was like liquid gold. I also started nursing a beer around this point. My movements felt somewhat slowed. I started playing a (bad) game of Beer Pong with a friend. My hand-eye coordination did not seem that impaired, but then again it's not normally spectacular. Someone came out and started playing his electric guitar on a tiny amp, and it sounded absolutely awesome to me. The music just seemed to flow.</p><p>I shotgunned a beer with two people and then went into someone's room. The two people I came with took a couple more hits, but I abstained. I was still nursing my first beer. The interesting flavor was wearing off and it was once again beginning to taste unpleasant. I took a few sips of someone's Pepsi/Bacardi concoction.</p><p>We went back downstairs and played a game of Super Smash Bros on N64. I was playing, but I completely lost track of my character and wasn't playing correctly; I died very quickly. I went and sat in another chair; I don't really remember anything specific happening after this. I just sat there for a while and people may have been talking. After a while, someone announced that pizza was being ordered. I was told that I needed to experience this stuffed breadstick thing, and that it would be amazing. It probably took an hour or so to be delivered, but it felt like an eternity. It arrived, I ate it, and it was quite good. The cheese and grease was spectacular. I was starting to feel tired and knew that I should head back to my dorm and go to bed. At this point, it was about 2 A.M. The two people that I came with headed back to our dorms. I don't really remember the walk back, except that my acquaintance and I both said that we'd felt we had been in an anti-drug PSA. </p><p>I got back to my room and climbed into bed after brushing my teeth and changing. I put on my iPod and listened to two songs by the band Foals, which sounded quite nice. It was like sound was alternating nicely between my ears. I went to sleep around 3 A.M., and woke up at noon feeling fine. A previous time I'd smoked, I had woken up the next morning and had felt like complete shit. I was groggy and had a headache for the entire day. I was glad that I didn't experience that again.</p><p>Being high like this was not what I expected. I had thought that I'd get more positive, 'fuzzy', warm feelings. I had expected to be giddy and euphoric, maybe contemplative. I didn't get any of that, and instead felt very detached and dissociated. The time warp was weird and unexpected. I'd call my experience weird, but not good or pleasant, exactly. I will probably do it again.</p>"
}
