{
 "title": "The Perfect Experience?",
 "author": "Morgan",
 "citation": "   Morgan. \"The Perfect Experience?: experience with 25I-NBOMe (ID 94865)\". Erowid.org. Feb 14, 2012. erowid.org/exp/94865",
 "substance": "25I-NBOMe",
 "bodyweight": "188 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2 hits",
   "sublingual",
   "2C-I-NBOMe",
   "(blotter / tab)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 1:30",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 94865",
   "Gender: Male",
   " ",
   "Age at time of experience: 24",
   "Added: Feb 14, 2012",
   "Views: 9170",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Male; 24; Weight 188lbs</p><p>25I; Blotter; 550ugx2=Total 1100ug</p><p>Cannabis; Smoked; 2-3 grams rougly.</p><p>I've done Shrooms, LSD, 2ci and Molly.</p><p>10:23pm: Under the tongue.  Very bitter and numb sensation.</p><p>10:42pm: Dissolved quickly.  Tongue felt very numb.  Noticed the early signs of the comeup.  Increasing headspace.</p><p>11:04pm: I could tell my pupils were dilated because there was a crazy amount of extra light in my vision.  Slight nausea that turned into a warm and calming feeling.  I couldn't help but grin.  It was about to start.</p><p>11:27pm: The drop ceiling in my room always provides a good show when I trip.  As always, my ceiling was flowing.  My friend/sitter had just left the buy cigs, leaving me alone.  Smoked.  I put some music on and within minutes I got pulled way deeper into the trip.  Don't know if it was the herb or music or both but my visuals went from flowing to crystal-like patterning.  Haven't quite seen it like that before.</p><p>11:35pm:  I was going pretty by hard then.  I felt a little too warm so I went outside.  It was really windy and really cold.  My friend got back with the cigs, smoked one.  The moons brightness kept burning into my vision.  I could see so many stars.  The clouds were moving fast that night because of wind, but they were all small and spread out.  When they passed front of the moon it looked crazy.  They were swirling so much, I honestly couldn't tell if it was me or the wind.  Talked on the phone.  Had my wits about me.  My two friends said they were bringing some intense herb over.  Excellent.</p><p>12:00am:  I was mind blown that it was only 12.  Felt like 4 hours had passed.  I liked that.  My sitter and I smoked a couple more bowls.  Tried playing some games but I didn't get any visuals from it so I stopped.  Watched Trailer Park Boys instead.  Felt good to stretch out on my bed and relax.  With LSD I always have a writhing sensation and can never relax.  I tell my sitter I'm really digging it.  My phone's screen looked like it had depth.</p><p>12:20am:  My two friends arrived.  We smoked up.  I started staring at my ceiling again.  They saw the euphoria on my face and asked what I was seeing.  I explained the flowing and the crystal-like patterns.  They couldn't believe how calmly I was explaining all of this to them.  They thought that was neat and seemed intrigued. </p><p>1:20am:  Mind was blown again at the revelation that it was only 1 am.  I seriously thought that it was around 3 o'clock.  We moved into another room and played the old Simpsons arcade game on PS3.  My sitter had just ordered a pizza and it smelled really good.  Everyone passed out while playing games, except me.</p><p>2:30am:  Went back to my room to watch something and smoke a little more.  I was becoming a little groggy, sure sign of a comedown for me.  Called a friend.  Talked for a few minutes.  Watched a few episodes of Mobile Suit Gundam.  Thought I saw my tv moving downward.</p><p>3:30am:  Definitely felt the comedown.  Flowing visuals had decreased.  My friends that came over came in my room to say bye.  I fell asleep not long after.</p><p>I'd rate this highly enjoyable.  Personally, I prefer the trip and feeling I get from Shrooms, but this and 2ci have made serious impressions on me.  LSD has been my least favorite, but only because I never get a full trip.  I always get caught in a strange limbo headspace.  This felt very similar to LSD headspace wise.  The visuals were very 2ci-like to me.  With 2ci I didn't have to focus hard on something for it to flow, unlike LSD.  25i was similar in that way.  I think I may try again next weekend during the day.  Now that I know what activities work the best with this I want the perfect experience.</p>"
}
