{
 "title": "A Positive Response",
 "author": "Pharmaphile ",
 "citation": "   Pharmaphile . \"A Positive Response: experience with Methylone (sold as MDMA) (ID 94868)\". Erowid.org. Jun 27, 2012. erowid.org/exp/94868",
 "substance": "Methylone (sold as MDMA)",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "94868",
   "Male",
   " ",
   "175",
   "Jun 27, 2012",
   "3993",
   " "
  ]
 ],
 "report": "</p>\n[Erowid Note: This report is marked as a methylone report, but readers should be aware there are aspects of it that suggest the identification is speculative.]  </p><p>Insufflated Methylone Trial- 2/13/2012</p><p>Subject 1(Author):</p><p>\tGender: Male</p><p>\tWeight: ~125 lbs/57 kg</p><p>\tBirth Date: September, 1994</p><p>\tAllergies: None</p><p>\tMetabolism: Relatively fast</p><p>\tDiet: Balanced, nothing special</p><p>\tLast Meal: Bagel w/ Cream Cheese @ 7:00 AM</p><p>\tDose: 50-100 mg Insufflated</p><p>\tNote: Broke ankle around a month ago, had surgery and am still recovering, although out of cast, foot has been bothering me lately because it still hurts.</p><p>\tSubstance Use History:</p><p>o\tAlcohol (No longer use.)</p><p>o\tMarijuana (Use almost daily.)</p><p>o\tDXM </p><p>o\tDPH</p><p>o\tPassion Flower</p><p>o\tCodeine</p><p>o\tHydrocodone</p><p>o\tAmphetamine</p><p>o\tLisdexamfetamine</p><p>o\tLSD</p><p>o\tMorning Glory</p><p>o\tPsilocybin Mushrooms</p><p>o\tSalvia</p><p>o\tMDMA</p><p>o\tCaffeine </p><p>o\tNitrous Oxide</p><p>o\tValium (IV in hospital)</p><p>o\tKetamine (IV in hospital)</p><p>Subject 2:</p><p>\tGender: Female</p><p>\tWeight: ~130 lbs/59 kg</p><p>\tBirth Date: March, 1995</p><p>\tAllergies: None</p><p>\tMetabolism: Relatively slow, Thyroid disease, takes metabolism speeding medication daily.</p><p>\tDiet: Vegetarian</p><p>\tLast Meal: ???</p><p>\tDose: 50-100 mg Insufflated</p><p>\tSubstance Use History: </p><p>o\tAlcohol</p><p>o\tMarijuana</p><p>o\tProzac</p><p>o\tTrazadone</p><p>Substance Data</p><p>\tSource: MDMA dealer sold as 200 mg MDMA or Molly. Claims to know the chemist responsible for synthesis of substance, and chemist claims it is pure MDMA.</p><p>\tPrice: 20 $ per pill. (This is a gross overprice in my opinion, but when it comes to the black market the customer isnt always right.)</p><p>\tForm: Salt grain sized clear white crystals in gel caps.</p><p>\tMecke Test: Turns orange at first, slowly turns to more of a red-brown color. Lots of bubbles suggest reaction is very fast and substance is very pure.</p><p>\tMarquis Test: Turns bright yellow. Lots of bubbles once again.</p><p>\tSimons Reagent Test: Turns solid darkish blue.</p><p>\tConclusions: Clearly this substance is not MDMA, from the online data I could collect, and from an anecdotal account of a friend who had tried the same substance, I concluded that there is an exceedingly high probability this substance is in fact </p><p>bk-MDMA (Methylone, M1, etc.). I suppose the chemist just ordered some on the internet and was ripping off the MDMA dealer. I informed my dealer. I dont think he really cared either way since Im probably the only guy who he sells to who cares to check what theyre putting in their bodies. I own a scale which is accurate to .1 g. It really is meant for marijuana. It usually doesnt respond to anything less than .2 g and when I placed a single pill on the scale it did not respond. This leads me to believe that there is in fact less than 200 mg of substance; however, by eyeballing it I am confident that there are at least 100 mg of substance.</p><p>Substance Report:</p><p>\t3:00 PM- Subject 2 and I adjourn to my bedroom; I use a gift card to grind the crystal against a glossy magazine into an extremely fine powder. I cut it into one long line, split the line into two even lines, and then those lines into two even lines, leaving me with four ~25-50 mg lines. I insufflate one into each nostril, and so does Subject 2. Effects are felt almost immediately, within two minutes I feel extremely stimulated with a calm euphoria. Subject 2 reports the same.</p><p>\t3:05 PM- We have moved to the basement and effects are in full effect, I feel a stimulated clear-headedness mixed with a euphoric fogginess, I notice a slight analgesia as my recovering foot does not seem to hurt at all. The drip is bitter but I do not mind and almost find it pleasant.</p><p>\t3:10 PM- We are feeling each other up on the couch and tactile sense is amazing. I am rolling pretty hard and definitely feel very horny. No problem achieving erection. I feel extremely intimate with my Subject 2 and she feels the same with me.</p><p>\t3:15 PM- Peak is hit, and we have intercourse for the next thirty minutes, as we have sex I stop taking note of effects and just have really amazing close sex. It feels great.</p><p>\t3:45 PM- Sex is done. Subject 2 reports that effects have faded but I still feel them. She is not nearly as tuned into her state of consciousness as I am so this comes as no surprise to me.</p><p>\t5:22 PM- The main effects have tapered into an amphetamine like stimulation with a slight euphoria. </p><p>Conclusions:</p><p>\tI like this substance.</p><p>\tInsufflation was nearly painless. Another plus.</p><p>\tThe short duration was handy in my opinion.</p><p>\tThe high was very similar to MDMA, and I cannot form a real distinction at this point, I dont feel as though I have enough experience under my belt.</p><p>\tI hope to try it again, maybe orally so I can form a more informed conclusion.</p><p>\tThe openness I felt was very sincere, although I have not had any major breakthroughs or anything like that.</p><p>\tI will purchase a mg scale because it is definitely worth the money.</p><p>\tExperienced no negative side effects. Very Cool.</p>"
}
