{
 "title": "Illuminating the Emotions",
 "author": "Violette",
 "citation": "   Violette. \"Illuminating the Emotions: experience with 2C-P (ID 94914)\". Erowid.org. Feb 17, 2012. erowid.org/exp/94914",
 "substance": "2C-P",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "6 mg",
   "oral",
   "2C-P",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 94914",
   "Gender: Female",
   " ",
   "Age at time of experience: 22",
   "Added: Feb 17, 2012",
   "Views: 4457",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nWith an unexpected visit from an associate, I acquired a substantial amount of the phenethylamine 2C-P, enough to start my research. I weighed out 50mg of this ultrafine white powder, measured 50mL of distilled water and made a solution. \r\nAt around 14:00, I poured exactly 6mL into my dosing apparatus and consumed this intensely bitter liquid. The taste was very similar to one of my previous encounters with 2C-E. I sat down at my computer and returned to working on a personal project while waiting for the chemical to take effect.\r\nI began feeling the first alerts on my perceptive centers at around 16:30. Over the course of the next two hours I noticed the gradual building of what I can describe as a trancey, vibrant and elated state of my mood. My senses of sight, smell and touch were heightened, and my emotions became very un-muddled and logically clear, easy to sort out. I wasn't particularly focused on or distracted by the visual effects which were much more apparent during my 2c-e experiences. It was a much more emotionally focused trip. This may or may not be due to the low dose.\r\nOver the next six hours I engaged with some electronica music and wrote about my feelings. I drifted off into a very restful sleep and upon waking the next morning at around 08:30, immediately noticed that there were still some residual effects. I opened my eyes, and my visual field didn't activate immediately, but very noticeably bubbled into play by means of a field of almost evenly spaced dots across my visual field. I opened and closed my eyes a few times to confirm this effect, and went about typing out my experiences that I had written down in my notebook.\r\nI noticed, similarly to other psychedelics, during the peak effects the perception of the speed of passage of time (and relatedly, visual effects) is very heavily mediated by the bodily component of the trip, most notably in areas of physical or emotional discomfort - I think it could be referred to as anxiety. It was very easy to work through these situations and end up on a positive note, feeling good about myself and my life, and honestly I don't think there's any other way to deal with this kind of anxiety on psychedelics. Anything short of therapeutic self-analysis left me feeling very uncomfortable.\n\n\n"
}
