{
 "title": "My Very First Overdose",
 "author": "Pandora Spice",
 "citation": "   Pandora Spice. \"My Very First Overdose: experience with AM-2201  (ID 94928)\". Erowid.org. Mar 1, 2012. erowid.org/exp/94928",
 "substance": "AM-2201 ",
 "bodyweight": "118 lb",
 "header": [
  [
   "DOSE:",
   "42 mg",
   "smoked",
   "AM-2201",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 94928",
   "Female",
   " ",
   "Age at time of experience: 43",
   "Added: Mar 1, 2012",
   "Views: 9768",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have come into various forums more than once touting my skills as an advanced, mature and responsible researcher. I have also been very harsh when folks basically have what appears to be a panic attack or psychological freak-out, then make dire posts about AM-2201 or similar compounds being the route causative factors of dire physical reactions or ailments, regardless of what else might be in their personal histories or systems at that time.</p><p>Last night's research with AM-2201 was the first time I ever felt I got into a space that was uncomfortable with these compounds.</p><p>I was on the very tail end of a low MXE dose of 25 mgs. A friend had told me he smoked 50 mgs of AM-2201 and tripped so hard he 'joined the carpet.' I knew this was a precipitously high dose for this compound, but I also had my skill set and decades of cannabinoid tolerance . . .</p><p>I was already stoned.</p><p>I loaded 42 mgs (A favorite dose for me of many things . . . ) into my spoon pipe on top of a bed of Casey Jones weed. I took one single small hit. Nice. Then a huge, massive rip - definate chemical flavor to my exhale.</p><p>Effects came on hard, fast, aggressive and overwhelming. I could no longer effectively communicate either via keyboard or verbally with my husband. My open eyed vision was significantly distorted, even 'hazy.' I couldn't stand up straight and be stable. Sitting up I kept falling over and 'nodding off' into full blown tripping.</p><p>Other than feeling positively bowled over this felt okay.</p><p>But, then the midlife thing that haunts me sometimes hit hard - I started overheating. It was very difficult to manage. I shed all clothes, poured water over my head and finally gave in, sat down in the bathtub and in that position took a quick cool rinse off, kind of combo shower and very shallow bath. Even coming out of that I still felt very hot, but no longer like I might be in some sort of overheating trouble.</p><p>I lay back down and again was nailed - every time I tried to sit up it was a no go and I felt more than a bit dizzy and nauseaus.</p><p>I remember laying there hot, tripping with my eyes closed. I did a quick, internal self-assessment. Ego intact and not too panicky - knew who I was, where I was, what day it was and why I was in this situation - 25 grams MXE + most of 42 mgs AM-2201. Body radically overheated but heart beat felt stable (bit fast) and breathing was hypnotically even and deep - just focusing on my auto-breathing instilled utter calm and pasted a huge grin on my face. Heh - typical! Body just fine, mind completely OD'd overwhelmed. I started chuckling out loud - only one single person to blame for this mess!</p><p>My husband asked me if I wanted to smoke a bowl - he didn't realize how deep I already was. I replied, 'No I'm utterly OD'd on synthetic cannabinoids and just need to go to bed.' He understood but was a bit dismayed - it's pretty bad when Pandora decided not to smoke a bowl . . . .By the time I lay down for bed, having done my teeth and other bathroom chores, I felt super high/stoned but a lot better.</p><p>Woke up feeling fucking WONDERFUL! I don't feel like I am stoned or have a residual high but I definately have that squeeky-clean, golden feeling that sometimes comes after a heavy experience, be it glowing or difficult.</p><p>I'm glad I finally got a bit of a taste of the tip of the iceberg - now I know what folks are talking about when they say they OD on these compounds and no doubt for them it feels much worse and more panicky. I've had a lot of trips, including bad ones in my life. I tend to deal with difficult experiences very calmly, not moving or saying much, mostly telling folks around me I'm freaking out or OD'd . . . .Last night was pretty much my norm for when I feel I've gotten into a bit of personal trouble.</p><p>If it had gotten worse, I would have asked my husband to assess me and maybe even have considered a hospital trip. NOT because I felt I was poisoned or dying but for a significant time I felt I could not get my body temperature/vaso-dilation under control and was in danger of significant over-heating. . . .</p><p>Just thought this might be worth sharing to indicate, a.) Even she up on the high horse gets bitched slapped down on occasion and b.) Getting into personal trouble does NOT mean one needs to freak-out. My response of basically just calmly letting it run its course, communicating basics to those around me and managing noxious physical symptoms (e.g. overheating) paid off in spades AND I cannot believe how GOOD I feel today. Time is my (and your) ally when things get sketchy. What goes up must come down. Everything with a beginning has a middle and end. If this trip is going to kill me I knew I was going to die someday anyway and at least I'm going out high as a kite . . . .</p>"
}
