{
 "title": "Psychedelic Cocktail at the Beach",
 "author": "Krip",
 "citation": "   Krip. \"Psychedelic Cocktail at the Beach: experience with 2C-E, 2C-I & LSD (ID 95013)\". Erowid.org. Mar 8, 2012. erowid.org/exp/95013",
 "substance": "2C-E, 2C-I & LSD",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "sublingual",
   "LSD",
   "(blotter / tab)",
   "  T+ 2:00",
   "5 mg",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 2:00",
   "15 mg",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 95013",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Mar 8, 2012",
   "Views: 1470",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>0:00 I and a friend who I'll refer to as P begin by placing our tabs on our tongues, about 2 hours go by and I feel a slight euphoria, but no real distinguishable effects. I have a feeling it was some very weak acid.</p><p>2:00 P and I decide to split a bottle of water which has 30 mg 2c-e and 10 mg 2c-i mixed together in it, we divide the liquid as equally as possible and cheers each other and then chug our drinks. Instantly after drinking this everything is off, I cant put my finger on it, but I felt very strange. A surge of energy was buzzing inside me, while at the same time I felt drained and lethargic, I layed down in my bed for about 15 minutes in a state of paranoia and fear, scared of what I might have done to myself. (Let me explain the fact that I have never tripped on any substance besides Psilocybin a handful of times.)</p><p>3:00 P throws out the option to go for a walk, reluctantly I agree. At first I was still overwhelmed by all of my mixed emotions, and bizarre thinking patterns, but as we began walking the sights were so amazing it was calming, The thing I remember most was a large tree that as we walked by turned into a sea anemone flowing in the ocean currents as I by it. I had a sweater on while walking, and for a moment my body felt as big as my body looked in my peripherals (i.e. my body was the size it was with my jacket, or I forgot I had a jacket on.) then I moved my arms and I felt them go inside my body, until I noticed that I had a jacket on and what had really happened. </p><p>4:00 Music has been extremely overwhelming and intense, playing with my emotions in ways I've never thought possible. </p><p>8:00 sun is rising and I've noticed I lost track of time, the past few hours have been extremely enjoyable, I feel as though I'm rolling, but with much more too it (obviously)</p><p>unknown time: at one point in my trip my hand was changing age as though it was my hand from the future, the hand of a more mature me, I even compared it to my other hand and it was bigger/ more matured/ and more worn.</p><p>unknown time: I would be holding a part of my body, i.e. my chin and all of the sudden it would expand and feel much larger than it was, I had to check in the mirror a couple of times to make sure.</p><p>17:00 P has to leave, We have come down a lot, lingering effects are barely noticeable at this moment, so I drive him down the road to his girlfriends.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  We walk past my dad while leaving and a horrible vibe goes through me, I was scared to go back home so I drove to the beach. while driving I would see people on the side walk popping in and out of my vision, at this moment I realized how dangerous it was for me to be driving, feeling as if I have no choice I continue, when I arrive, I remember my headphones were in my car and I decided that they had been waiting here this entire time just for this very moment, I put on my iphone and listen to music while walking down the beach to a secluded area. down the beach line at the distance where you would start to see mirages, people were again popping in and out of existence, I saw a beautiful woman off in the distance, but as I looked closer it was just some old guy in a speedo. lol. I layed down in the sand to relax and enjoy my music. I decided to put my shoe under my head as a pillow and look up at the sky. some of my favorite music is playing, and for a moment I am in pure euphoria, greater euphoria than I've ever felt on mdma. As I stared at the sky, I forgot where I was and I felt as though I was floating in this empty space that extended for infinity, I was floating in this vast blueness with hazes of white that were clouds. the wind blew from around me. this moment was pure bliss, so incredibly comforting. As I came back to reality I was still in a state of euphoria.</p><p>20:00 I begin to drive home from the beach, as I am very hungry and very tired. ( I havent eaten since -4:00 [full 24 hours] ) </p><p>20:20 when I get home I layed around in bed for a while and tried to sleep, my mind was so full of thoughts and energy that I couldnt even think of sleeping, laying in bed in the silence made time freeze, and made me feel as though I'd never stop tripping. I tried listening to some music, and it was stressful to my brain, it felt as though it was causing too much activity while my brain was so drained from the lack of sleep and the experience of the drugs themselves. </p><p>21:00 still a bit trippy, I fall asleep around this time</p><p>23:00 I wake up, completely sober.</p>"
}
