{
 "title": "Chillin On a Tuesday Night",
 "author": "Dillon",
 "citation": "   Dillon. \"Chillin On a Tuesday Night: experience with 2C-D (ID 95090)\". Erowid.org. May 28, 2012. erowid.org/exp/95090",
 "substance": "2C-D",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "5 mg",
   "insufflated",
   "2C-D",
   "(powder / crystals)",
   "  T+ 1:00",
   "25 mg",
   "oral",
   "2C-D",
   "(powder / crystals)",
   "  T+ 1:30",
   "8 mg",
   "oral",
   "2C-D",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 95090",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: May 28, 2012",
   "Views: 2294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First off I snorted about 5mg of 2C-D as an allergy test to make sure it would be safe to take a full dose. I actually felt a head change; sort of like I was more focused. It kind of felt like a dose of adderal.</p><p>An hour later I weighed out about 25+/- 5mg and swallowed it</p><p>20min in I felt something, maybe a little more bit excited or giggly and a bit stimulated</p><p>40min. I felt like I was coming up on MDMA, music sounded great. I was a little bit euphoric, rubbing my face felt good because my skin felt soft and warm. I had stimulation that made me want to jump up and dance to the electro music. I also had closed eye visuals of stuff that I would look at right before closing my eyes which would then morph into other things/patterns</p><p>40-120min. (I would say this was the peak) I continued to be euphoric for about 20 more minutes and then the stimulation pretty much subsided. We had electro/dubstep blasting with the visualizer on the T.V. This was very entertaining to watch and just overall looked crazy with all the patterns. I felt really 'into' the visualizer. There was a slight movement of objects in the room as if they were shifting positions, nothing crazy though. </p><p>I remained giggly for this time as well. Conversation came easily and my mind was pretty clear when I would focus on 'sober' things/thoughts. Somewhere in this period I re-dosed with another 8mg or so. (I wish I had just taken a full dose at the beginning)</p><p>After a while of watching the visualizer I seemed a mildly agitated/angry. Nothing really seem that interesting, it seems like I had grown bored of the trip. </p><p>120-180min At this point of time I was still tripping a little bit but was coming down slowly. My friends and I watched some funny shows online and also went outside to go get some candy from the gas station across the street. I was still a bit giggly to some random things, especially talking to the cashier at the gas station.</p><p>Soon after this time period, I was what felt like completely sober, the feeling of being high had left my body and my mental/visual processes were completely normal. Sleep was super easy! I went to bed at my normal time of 1:00am (about an hour after the trip had ended). I did have some closed eye visuals all the way until I fell asleep-very mild ones though</p><p>The day after there was no hangover, I feel great! Although I do not feel more refreshed than normal.</p><p>Keep in mind that the above timeline is very rough as I did not take notes during the experience.</p><p>I can say this for sure:</p><p>-by 40 minutes in I felt great, almost at a peak</p><p>-I tripped for about 2 hours and the whole experience from beginning to end was about 4 and a half hours</p><p>-The trip didn't have a defining feature, it's like it didn't have much of a personality although at the early part of the trip it did feel close to a trippy version of MDMA</p><p>-I have great closed eye visuals (it reminded me of the MDA pills I took in the past)</p><p>-My friends (who also researched this chemical with me) and I decided we wouldn't use this at a club but we would use it again in a chill setting at home to hang out and smoke weed on; it was very laid back/relaxing after the early stimulation went away</p><p>-When I was completely peaking, I went in the bathroom and the colors just seemed distorted, it was kind of weird to be honest. When I left the bathroom into the dark I saw a bunch of colorful waving lines flowing sideways in front of me but it wasn't right in front of my face</p><p>-There weren't any moments where I was like 'OH FUCK IM TRIPPING BALLS' haha</p><p>-There was little or no pupil dilation</p><p>-I have had a hard time writing the trip report because the trip wasn't anything that sparked my interest/it wasn't 'amazing'/ it was a tad boring</p><p>-I would do it again!  But I would take 40 or 45mg at once instead of staggering the dose</p><p>-I took a hit of weed which did seem to increase visuals for a short amount of time</p><p>-My friends who smoked weed the whole time on 2C-D said it had great synergy and seemed to increase the visuals</p><p>Conclusion: This a very chill substance thats great to hang out on. At low dosages I could see its value as a smart drug. I would recommend it for other people to try out but I plan to research 2C-C before I return back to 2C-D. 2C-D is a very interesting chemical in it's own sense :).</p>"
}
