{
 "title": "G at the Club",
 "author": "Hank M.",
 "citation": "   Hank M.. \"G at the Club: experience with GHB (ID 951)\". Erowid.org. Oct 16, 2000. erowid.org/exp/951",
 "substance": "GHB",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 3:00",
   "  ",
   "oral",
   "GHB",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2000",
   "951",
   "Not Specified",
   " ",
   "Not Given",
   "Oct 16, 2000",
   "16946",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI went to a club recently with some friends and took GHB as a way to expand the experience.  This was not my first time taking GHB so I was aware of the dosage I would need for a satisfying experience.  At probably T+3 hrs we 'bumped' with about one half the original dose.  I spent virtually the whole night on the dance floor stopping occasionally to smoke a cigarette and drink a little water.  As it turned out I was apparently drinking too little water.  At probably T+3.5-4 hrs I headed for the rest room, feeling the need to empty my bowels.  After sitting on the pot for a few minutes I began to feel nauseous, this led to intense vomiting which apparently got security called in.  Fortunately, the security and cops on hand thought I was simply drunk and they told me to leave.  My friends rounded me up and we headed to a friendly house where I continued vomiting while trying to rehydrate myself.  When I finally passed out I slept soundly for about four hours and awoke with no negative feelings.</p><p>The key to this experience was failure to take care of my body like I should have.  Even without the GHB, I should have been drinking much more water given the amount of dancing I was doing.  The G just kept me from feeling it as much. This is what I have taken from that experience:  always have knowledgeable friends on hand, and take care of your body, regardless of what you are doing.</p>"
}
