{
 "title": "Awful Side Effects",
 "author": "Moonchaser",
 "citation": "Citation:   Moonchaser. \"Awful Side Effects: experience with 6-APB (Benzo Fury) (ID 95121)\". Erowid.org. Mar 5, 2012. erowid.org/exp/95121",
 "substance": "6-APB (Benzo Fury)",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "Pharms - Sertraline",
   "(daily)",
   " ",
   "100 mg",
   "oral",
   "6-APB",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 95121",
   "Gender: Female",
   " ",
   "Age at time of experience: 19",
   "Added: Mar 5, 2012",
   "Views: 9917",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI went to a party that night and decided to take a benzo fury as MDMA was too expensive. I had done benzo the week before and had a great time-however the come down was horrendous-I thought at the time that was due to mixing it with alcohol and weed but this turned out to be wrong.\r\nSo back to the night, I decided not to drink as I didn't want to feel so bad after and at the time of ingestion I had an empty stomach hoping this would make the effects more intense. I took the pill at 10.40pm -which claims to include 100mg of 6-APB in it and went off to the party(at the time I was taking 50mg of Sertraline and had been for the 4 months previously). The party was held in an old abandoned house and was the perfect setting as there was cool grafitti on walls, chill areas and it was just the right location. \r\nIt took about an hour to kick in, which seems slightly longer than the first time and if anything I would say it was a better high when drunk. The effects mimic my experiences with MDMA but only to a certain extent. I felt very warm and fuzzy, very loving to people and hugged an awful lot of my friends but it's not as intense as MDMA. I didn't feel as attracted by the music and the same need to dance as I have with MDMA, but it was more social and lasted a whole lot longer. \r\nMy eyes didn't dilate but I did gurn a lot. I was still feeling pretty good at 9am the next morning (not high, just good and not hungover or anything) but by about 11.30 I felt as awful as I had the first time. It felt like my worst hangover ever even though I didn't drink a drop and have never had a bad comedown from MDMA. \r\nI thoroughly enjoyed the high, although it wasn't as intense as I would have preferred but I have vowed not to take it again as it just isn't worth it for the awful after effects- my whole next day was a right off and spent being violently sick and with an awful headache.\n\n\n"
}