{
 "title": "Limit of Interpretation",
 "author": "Synaps3",
 "citation": "   Synaps3. \"Limit of Interpretation: experience with 2C-I & Zolpidem (ID 95214)\". Erowid.org. Jun 1, 2012. erowid.org/exp/95214",
 "substance": "2C-I & Zolpidem",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "2C-I",
   "(powder / crystals)",
   "  T+ 6:00",
   "  ",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 95214",
   "Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jun 1, 2012",
   "Views: 12309",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Originally, I was not interested in trying any substances because of the general negative connotation of drugs. I just simply thought they were addictive and 'make you feel good'. Psychedelics seemed a little more interesting, but not enough that I thought it was a good idea to try them. I thought I might see rainbows or something, but doubted that anything else might happen.</p><p>I had a friendish that I met in high school that got me interested. He didn't appear to be a lazy bum which is the type of person I used to associate drug use with. He was very smart and interested in the same things I was. This made me start to doubt what I had believed and made me think that there was something I was missing. I did some research and found that psychedelics are not addictive and not harmful. Then why is it illegal/looked down upon by society? At that point, I knew I had to try some and find out what it really was.</p><p>I obtained some 2ci because I was told it was a mild trip suitable for a noob. Looking back on it, I would have much rather started out with a little mushrooms. At that point I hadn't even tried weed and I am actually glad I hadn't because I probably wouldn't have thought of going further. I thought I'd see some colors, but never imagined the depth and realness of what was about to happen.</p><p>5:00pm: I open my bag of 2ci and take a very small amount orally. I didn't have a scale at the time (I REALLY should have bought one before trying). The amount I took was about the size of a pencil lead.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article] </p><p>5:30pm: Still no effects present</p><p>6:00pm: Not feeling anything, I decide to take two more doses both about the same amount as the first.</p><p>6:30pm: I begin to feel the rush of serotonin. I feel very happy and seemed to laugh at things I would usually never notice.</p><p>7:00pm: I feel the serotonin more than I could have with placebo, so I know it's working. No visuals.</p><p>8:00pm: I begin to feel over energized and tweaked. I wasn't expecting to feel like that. I thought psychedelics were dreamy and chill, so I was kind of confused and thought maybe I had been given MDMA or something. The entactogenic effects were getting really intense. I am still not seeing any visuals, but I experience different vibes by looking at patterns. Almost like the patterns cause some buzzing in a part of my brain other than just the visual cortex.</p><p>8:15pm: I begin to pace around because I feel tweaked and agitated whenever I try to sit or lay down. I am still not noticing any visuals, so I decide that maybe I just need some more stimuli. I open my blinds. It's still a little light out. I stare out the window still thinking that I had been given MDMA. After about 10 seconds, I notice it. I realized that I just need to stare at something for a few seconds to see the visuals. I always thought they were forced visuals, but they're not; you make it happen. After staring at the pine trees for a while, I see the most beautiful thing I have ever seen. I almost cried (and I am not someone who does that very often). Every pine needle on every branch starts to shimmer and move. It's not smooth; it seems like an animation where every frame takes about a half-second to change. It also seemed like the sun would change brightness/hue like clouds were passing over every few seconds. And it wasn't just what I saw; I could feel everything that I could see with a different part of my brain and that's what made it so much more than I expected.</p><p>9:00pm: I am feeling very agitated now even when walking around. It is really bothering me because it is distracting me from the experience. I feel soooo good. Everything seems like love, but there is also something mysterious at the same time. The mysterious part of it almost seems evil (like evil power) and I don't like it. Then I realize that it is not the drug, but that evil part of it is me and the drug is just bringing all of me out, not just the good. I decide that I should actually try to use it to help me away from those bad feelings of evil power. I start thinking about some of my friends from high school who I know are trippers and I notice something. Most of them are all really nice people who seem very genuine except one who is an asshole. He was very controlling and might have even been narcissistic. I have an epiphany and then I understand why. He is such an asshole because he must have been trying to bring out that evil power feeling when he tripped and he must have loved it. Now I realize that I don't want to go in that direction, so I try to focus all of me to the love part of it.</p><p>9:30pm: My heart is beating really fast and it is starting to make me nervous. I used to run cross-country and it was beating even faster than it would during a race. I decide to take my pulse so I walk over to my clock. It's an old analog alarm clock. I hold my wrist and begin trying to count. Each time I look at a number on the clock, a different color goes swirling around past each number and back to the 12, making it difficult to read. This happens about five times and then I flip shit. Instead of seeing just colors, I see weird characters and symbols swirl around. I quickly back away from the clock in awe. I begin to panic and think that I may have taken too much because I really didn't know exactly how much I took. I decide that I should force myself to puke just incase (my tripped out mind doesn't realize that I had ingested it about 4 hours ago so all of it must be in my brain). After puking, I felt a little better, but still tweaked out at an uncomfortable level. When I stand up from the toilet, I close my eyes. I see a yellow square shaped spiral form inside my head and at the center of the spiral I see something that looks like a tag with a word in it. It says god (not explicitly, I could just feel it). I start crying and think that I am going to die.</p><p>10:00pm: I begin feeling a little better and I assure myself that I am not going to die. The amount that I had taken couldn't have been more than 50mg. I decide to close my eyes again because I want to see more of that :) I close them and at first I see nothing, but after a few seconds I start to see some patterns. The patterns then start to turn into weird codes that I don't understand. A computer mouse appears and starts to move frame-by-frame across my brain. (I am a computer programmer, so it makes sense) It blows my mind as it moves across my eyes. It scares me because of level of realness of it. The level of resolution of it was the level of resolution of my brain (not my eyes). It was soooo real and detailed that it kind of made me sad because I knew that what I was seeing was the limit of my brain's level of interpretation (or the limit of the drug, which I hope was the case).</p><p>11:00pm: I take some ambian because I am starting to want to come down. After taking the ambian, the 2ci seemed more like what I had expected in the first place except for the memory block. I have trouble remembering this part of the trip, but I do remember seeing some face with my eyes closed and some water or liquid pouring from its mouth.</p><p>12:30am: The ambian has worn off and the visuals are gone, but my heart is still beating pretty fast.</p><p>1:00am: I lay down for bed. It takes about an hour to fall asleep because of the excess stimulation.</p><p>The next morning I wake up and laugh. I feel great. Minimal tracers remained for about a month. I don't know why that happens with 2ci, but I don't think it's HPPD because there are no other effects.</p><p>If you are a beginner, then first don't trip without a scale (if it's powder) and second, try a tryptamine.</p>"
}
