{
 "title": "Improper Use and Subcutaneous Emphysema",
 "author": "Nick",
 "citation": "   Nick. \"Improper Use and Subcutaneous Emphysema: experience with Nitous Oxide (ID 95222)\". Erowid.org. Apr 10, 2012. erowid.org/exp/95222",
 "substance": "Nitous Oxide",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 95222",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Apr 10, 2012",
   "Views: 4924",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nThis weekend at a party, a friend and another friend were doing some whip-its (nitrous oxide cannisters) using a [whipped cream dispenser] where you crack the canister into the container, then use the 'regulator' knob to release the gas into your mouth as you inhale. Well, one of my friends decided to reach over to my other friend to give him a whip-it out of the container. Usually, they would each control the gas flow of their own whip-it, holding the dispenser themselves. This time however, my friend held the dispenser, and put the nozzle up to my other friend's mouth. My other friend obliged, put the nozzle in his mouth, ready to inhale the whip it, and let my friend control the gas flow for his whip it.<br>Well, the person controlling the gas flow pressed the regulator down far too much, and caused a large volume of nitrous oxide to flow forcefully into the other person's lungs. Since he was not the one inhaling it, it was difficult to tell that it was too much. My friend doing the inhaling did the typical 'spew gas out the mouth' thing one does when inhaling too much nitrous, but after it was over mentioned that his throat area was sore. We didn't think much of it until the next morning. <br>My friend who had complained about a sore throat area the next morning was in even more pain, and upon feeling the skin around the base of his neck and top of his chest, experienced a very peculiar sensation. It felt as if there were a bunch of little, tiny bubbles of air or gas, trapped just under his skin. We could move them around, and could feel them popping, almost like the popping of rice crispies. Our friend, a trained EMT, immediately identified it as subcutaneous emphysema.<br>I've never really heard that it's possible to develop this (hopefully temporary) condition from improper use of a nitrous dispenser. His doctor assured him it would go away without any treatment, but it's definitely caused him much soreness. <br>I would just make a note that you should always control the air/gas flow for your own nitrous experience, never let someone else do it because they can not accurately gauge what is too much or what is the right amount. As this weekend has shown, intaking an amount of gas that is too large for the body's respiratory system to handle can result in subcutaneous emphysema, a temporary but painful and strange condition (as well as some seemingly more painful and severe conditions!). Of course, this warning might seem like common sense to many, but since I'd never heard of this happening in all my experiences or readings, I thought I would share it.\n\n\n"
}
