{
 "title": "Adventure Into Mathland",
 "author": "Thurston",
 "citation": "   Thurston. \"Adventure Into Mathland: experience with Mushrooms - P. cubensis (ID 9528)\". Erowid.org. Jul 6, 2005. erowid.org/exp/9528",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "4.0 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9528",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 6, 2005",
   "Views: 3150",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The night I am about to describe was definitely the oddest night I have ever experienced. </p><p>Several days prior to the experience one of my friends, that well call J (fairly experienced drug user), who lives in another state called me and explained that he was going to be visiting his mom over the weekend. This came as no surprise because he usually visits once a month or so and is often able to stay the Friday night that he arrives at my house. </p><p>Well not only was he calling to give me warning of his plans but he also mentioned that he hoped to bring down some shrooms so we could trip. Well I had never tripped before off shrooms or anything else, (my drug experiences were limited to marijuana use, and a few MDMA usages) but I was ready to try. </p><p>The night of Friday arrived and me and 2 of my other friends (that we'll call S and B (both had never used any drugs other then MDMA)) were sitting around chatting and the phone rang. It was J informing me that he would be arriving at my house in 20 minutes. </p><p>When he got there we decided that it would be a good thing to find some weed so we set about looking . . . sadly we werent able to locate any so me J and S began ingesting our shrooms B didn't want any because he had to go home soon. </p><p>I ate my 4 grams without the assistance of any other foods I did however have a large glass of grape juice to help me down the shrooms as quickly as possible since I found the taste to be very foul, J ate his 5 grams without any assistance from food or drink because he said he liked the taste, and S (who had 3 grams) found the taste to be even worse than I had thought it was, and he began gagging a bit. He did manage to keep everything down though. </p><p>At this point another friend R who doesn't use any drugs called and we invited him over. S didn't want R to know he had taken anything for some reason though so it would have to be a secret that S had eaten any shrooms, until R left. </p><p>So R arrives and we all just lounge around my room talking about various things and watching J play a multiplayer game on the computer. All of a sudden I just started laughing, at this point it was probably 20 minutes after ingestion, I was laughing at anything that anybody said and I had no clue why other then that it was extremely funny for some reason. No one else but me had this problem. </p><p>So now I would say 40 minutes after ingestion all of us J, S, R, B, and I decided to go outside, J informed me that he was tripping mildly and then proceeded to lay down in my street which has a fairly small amount of traffic. I could tell that things definitely seemed odd and I had a smile on my face for no apparent reason. J then got up and showed us a few things with some glowsticks that he had on strings it was truly an amazing show. Then R, and B decided it was time to go home so they left and just the 3 trippers remained. </p><p>Now that R was gone S was free to inform us that he too was tripping, we proceeded to go back inside up to my room to chill out where we tried to set up the N64 to play Mariokart that was truly a difficult task that took what I would estimate to be 45 minutes because we would always get really into a conversation we were having and lose track of what we were even trying to do. </p><p>We finally did get it set up and me and J played on 1 on 1 racing mode. We found it an impossible task to actually concentrate on the game however, and instead just got into conversations about really weird things while we somehow mindlessly navigated around the course. </p><p>After we played the videogame for a while we decided to go for a walk, this is where things began to really get strange for me. We went downstairs and J, and S decided they wanted something to drink before they went outside, while they did this I decided to go on ahead into the garage. Once there I stood in the dark by myself and had a conversation with myself, which consisted of random gibberish and a statement that went something like Im tripping and I love it and I could never be scared of this. </p><p>After that I was joined again with my friends and we proceeded to walk, as I walked I felt as if I was expanding in some way, some perfect way honed by evolution over the years, I know that makes very little sense but I felt everything I did was a carefully calculated move made by evolution to help ensure that the universe was progressing and getting better at the fastest possible rate. I felt incredibly small yet a extremely important part of everything. </p><p>Then as we walked down the street and I was thinking of how nothing was random and everything is just one huge extremely complex math problem, I began to see everything with a graph covering it and everything made sense all of a sudden the way the trees grew and the branches branched and the pattern of the leaves and the way it all fit together and not just the trees, everything was like that, it was amazing I truly felt I understood why everything was the way it was and it seemed so obvious and it made me incredibly happy and I proclaimed to my friends that I was in Mathland! Mathland the glorious place where each and everything automatically and intuitively makes sense and there needn't be any questions, Why would you ask a question of anything if everything was obvious? Its the kind of thing where you just know somethings true. You may not always be able to put your finger on why it's true but it just obviously is. </p><p>Well after some time we headed back to my house. When we arrived we sat down in my driveway and we had some discussions on God and if he exists or not. Then J wanted to smoke a cigarette but my sister was out that night and could have been arriving any moment, and J didn't want my sister to see us in this tripped out state or him smoking a cigarette, so he suggested we take a walk. Normally I would have been all for this idea, as Im very paranoid about getting caught in an altered state by my family members. This time though I just shrugged it off and said Who cares if she sees us? It's no big deal, everything will work itself out.</p><p>So J just finished his cigarette and we went back up to my room to chill. </p><p>While in the room my brain began picking up patterns in the way that me and my friends were interacting with each other. Using that pattern I began to start making predictions in my mind of when someone would talk or sometimes even what they would say. Each and every prediction I made came true. It got to the point where if someone was about to speak if they werent looking I would point to them and just when I would point they would say their line. </p><p>Usually I wouldn't know if they were about to speak if no one was talking but once the first word was said I could predict the rhythm of the entire conversation from that point perfectly. </p><p>Also at this point I started realizing how humans interact with problems. We have a problem and then we fix them. That concept seemed so amazing to me at the time cause I was seeing problems everywhere and everywhere there was a problem we fixed them. Seems stupid to talk about now but that was so amazing to me that I began chanting it You have a problem, and then you fix it. You have a problem, and the you fix it, over and over again I said that. Another chant I began alongside that one was Always getting better. Always getting better.</p><p>Another thing I began to think about was that crappy things would keep happening and then they would get fixed and that would be good. Kind of like how your alarm clock might go off early for some reason and your pissed off because you dont need to be waking up yet but then you turn it off (fix it) and you realize how good sleep is and your so happy that you get to go back to sleep. Without that problem you wouldn't have appreciation for that extra sleep you got. As I was thinking about this that seemed to be happening everywhere, there was always a problem and when it got fixed I would be so happy no matter how small the problem was, but then a sense of dread crept over me as I began to feel caged in, I know something bad was always going to happen and I would only have a brief moment after I fixed each thing before something else would pop up and need fixing and I was trapped into this cycle, normally this wouldnt have bothered because all the things I was fixing were little things that I would have never noticed had I not been tripping like my jeans slightly sagging too much I would fix it unconsciously, but while tripping I was woefully aware of everything I did. </p><p>I remained trapped in this state for most of the rest of the night. One time the problem was that my friends wanted to go to Wal-Mart and they wanted me to come. I really didnt want to go though so to fix it I tried all the excuses I could. </p><p>Every time they would say Hey lets go to Wal-Mart and I would say What time is it? I would then turn the TV channel on and check the time on the weather channel. </p><p>Then they would say We got plenty of time lets go, then I would feel in my pockets and encounter my keys which I didnt know if they were just some change that was in my pocket or if they were really my keys so I would say Are these my keys or is it change? without ever taking whatever it was out of my pocket to show them then they would say Its your keys then I would say that I didnt want to go and they would leave me alone for a bit then the exact same scene would happen again. </p><p>We must have went through that scene at the very least 4 times and it always happened the same way . . . the TV was always off (I wondered why the TV would end up being turned off, I know I didnt do it) and I would turn it on to check the time and everything happened just like it did the first time. I would always ask the same questions and they would always say the same thing. </p><p>Eventually the cycle that was happening made me so mad that I just had to break it so I decided to go with them. Once in the store J pointed out a bottle that said Super Goat Weed on it and I thought that was strange and then S began to explain what it was and I got very annoyed at him for some reason. J ended up buying a plastic alligator, some assorted candy, melatonin, and a rubber ball which he promptly popped with his cigarette once we were inside the car. </p><p>By the time we got home I felt like my trip was pretty much over and we all went to sleep. </p><p>The lesson I learned from my first trip is that it truly does let you think in a way that's un-inhibited by all the things that usually restrict your thought process on a subconscious level namely society in general.</p><p>I plan to do it again. Soon hopefully.</p>"
}
