{
 "title": "All in the Family...and Becoming a Nightmare",
 "author": "crimson and clover",
 "citation": "   crimson and clover. \"All in the Family...and Becoming a Nightmare: experience with Alcohol (ID 95380)\". Erowid.org. Mar 24, 2012. erowid.org/exp/95380",
 "substance": "Alcohol",
 "bodyweight": "121 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Alcohol"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 95380",
   "Gender: Female",
   " ",
   "Age at time of experience: 29",
   "Added: Mar 24, 2012",
   "Views: 4542",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>On August 20th, 2010, my mother collapsed and stopped breathing.  Her boyfriend called 911, and then my dad at work.  My dad called me at 730am to tell me what had happened.  I had just gotten back from sleeping in my car all night after a fight with my husband.</p><p>My mother was an alcoholic.  So was her boyfriend.  My first reaction was that it was more of her 'drama' and that she probably fell down drunk, or had a seizure and that she was fine.  </p><p>I dropped my son off at school and then headed over to the mobile home park she had recently moved into.  As I turned into the park, my stomach began to swim.  I suddenly had a bad feeling.  The paramedics were standing outside of her mobile home.  She was either fine or dead.  I had a sick feeling that she was gone.</p><p>I walked up to the paramedics, who looked pale and apprehensive as this 7 month pregnant woman was approaching them, crying.  I asked if she was gone, and they nodded.  </p><p>I walked in and saw her body on the floor by the foot of her bed, she was covered with a bloody sheet, and I refused to look under it.  </p><p>The cause of death was acute liver failure, due to excessive drinking.  She was 48 years old.  </p><p>She never got to see my son who was born 2 months after her death.  I did get the chance to say I loved her two nights before, but it preceded a bad fight about 'getting her life together.'</p><p>My drinking was also out of control.  When I got pregnant this time, I swore I wouldn't let it get as bad as it was again.  Unfortunately I would break down occasionally and guzzle 2 or 3 beers once a week while pregnant.  My relationship with my husband was and still is a nightmare, and we had to move back into my father's home with my brother, which resulted in constant fighting between everyone.</p><p>I strayed from drinking heavily for a few weeks, but it quickly caught up with me.  My home situation was and still is wearing on me.  It's been 18 months and I drink enough some nights that I  black out, and not be able to do anything the next day.  My son missed school today because I just couldn't get out of bed.  And here I am, drinking some more.  I haven't gone a day without a drink in about two weeks.  Some nights I drink four or five beers, some nights I drink ten.  </p><p>I am so tired.  I LOVE to drink.  It relieves my anxiety, it gets me to sleep, it makes me want to be social and to enjoy things.  My drug of choice is hydrocodone, and I actually drink much less when I take it, but I only get so much a month, and the other days I have to fend for myself.  </p><p>I just don't see an end to this, and I cannot believe I would let alcohol take over my life, as it destroyed my childhood and robbed me of my mom.  It's a sad story.  Alcohol is not evil, but people need to understand the power of drugs and to respect it.  It can sneak up on you, trust me.</p>"
}
