{
 "title": "Not a Good Idea At All",
 "author": "Akhenaten",
 "citation": "   Akhenaten. \"Not a Good Idea At All: experience with Dextroamphetamine & Nortriptyline (ID 95404)\". Erowid.org. Mar 29, 2012. erowid.org/exp/95404",
 "substance": "Dextroamphetamine & Nortriptyline",
 "bodyweight": "310 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Amphetamines",
   " ",
   "25 mg",
   "oral",
   "Pharms - Nortriptyline"
  ]
 ],
 "footer": [
  [
   "2010",
   "ID: 95404",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Mar 29, 2012",
   "Views: 4224",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was reading about nortriptyline because I found a bunch in my medicine cabinet, I also had some dexies, and I read that nortriptyline will potentiate dexedrine without giving you seratonin syndrome. </p><p>So here goes.</p><p>T:0:00- I take two extended release 15mg dexedrine with one 10mg instant release, alongside a 25mg nortiptyline. Downed it with a glass of milk and a few cookies. And then I left for school.</p><p>T+0:30 I took two tums to help potentiate the dexedrine further.</p><p>T+0:45Dexedrine is kicking in, feeling the odd disassociated effect I get from antidepressants with the rush of dexedrine.</p><p>T+1:30-2:00 Very disassociated, detached and apathetic. But also very chatty and energized like an average adderall high, but the body high feels less like dexedrine and more like a heavy dose of caffeine. And not in a goody way, I feel like I'm on a constant adrenaline rush, but not in a good way. I'm in my AP world history class, just a lecture and a movie. It's easy to focus on while I'm also browsing the Internet on my tablet.</p><p>T+2:10 Feeling nauseated as all Hell, I feel confused and disoriented. Major headache. This is no longer fun, I'm considering throwing up, it might make me feel better.</p><p>T+2:20 Girlfriend is driving me to her house for lunch, I told her about my symptoms she told me that she would often get nauseous and antsy (like on caffeine) when she takes adderall XR, especially on an empty stomach. I'm still nervous because the drugs.com interactions checker says to monitor patients who take nortriptyline and dexedrine, and to look for tachycardia, fever, and headache. And I have all three.</p><p>T+3:00 I took a massive shit, stomach pain is gone. Ate half a quesadilla, nausea mostly left. I've decided that I no longer want to be high, so I took two activated charcoal capsules and drank a tall glass of lemonade to acidity my insides. Feeling worlds better. </p><p>T+4:00 Got a wave of drowsiness, I think the first round of amphetamines wore off, the XR should kick in soon.</p><p>T+4:15 Tiredness gone, very slight nausea, but other than that, I am feeling fantastic. Basically just like every other dextroamphetamine venture, I'm focused, chatty, witty and sharp.</p><p>T+4:15-12:00ish The rest of the day was just like any other amphetamine experience, wore off around 9:00, redosed on dexy and played video games with my brother most of the night. </p><p>All in all good day, shitty morning. I don't think it was the drugs' fault, I think it was my empty stomach. I wouldn't recommend this however, because the nortriptyline removed my ability to engage in personal conversation like I normally do on amphetamines, because it made me so detached. Contrary to my reading, it seemed to dull the high, not potentiate it.</p><p>Thanks for reading :D</p>"
}
