{
 "title": "I've Made a Mistake",
 "author": "Mr.B",
 "citation": "   Mr.B. \"I've Made a Mistake: experience with 2C-B (ID 95416)\". Erowid.org. Nov 29, 2012. erowid.org/exp/95416",
 "substance": "2C-B",
 "bodyweight": "14 kg",
 "header": [
  [
   "DOSE:",
   "1 line",
   "insufflated",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 95416",
   "Male",
   " ",
   "Age at time of experience: 38",
   "Nov 29, 2012",
   "Views: 2392",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I'll start by saying I like the thought of tripping off somewhere but I don't like the psychological affects as I tend to get paranoid, I've probably only had 2 good trips out of 10 attemps.</p><p>For a while I've been looking for some 2c-b after a friend told me it would be like some trippy pills I'd taken some years earlier. Only recently I managed to obtain some, initially I gave up when it got banned but the internet provided some in the end.</p><p>My wife likes MDMA and we take it together but she does not take anything else, she knows I try different things but she does not like me smoking and snorting.</p><p>This particular night my wife fell asleep on the sofa and I chose this moment to sneak a quick snort. I read you can snort it but you shouldn't eyeball your line, in fact I eyeballed it and although I thought I made a good effort, my calculations were a bit off, silly mistake, the pain was pretty nasty in the nose but that became insignificant to what I was about to experience.</p><p>I quickly sat down to watch the football on my big screen and within a few minutes the plasma visuals started, this surprised me as it was coming on strong and it was soon intense and getting stronger by the second (i've heard the term hitting you like a freight train).  I realised I'd made a mistake and started to panic as I had not done a lot of research and didn't know what was happening, I really thought I'd made the ultimate mistake.  I woke the wife and told her I'd f**ked up and I laid down with her and she told me I would be alright and this helped a little.</p><p>I had to turn the sound off the TV as the music in the adverts was changing my mood emotionally and I didn't want to put myself in a bad trip (just listen to the new Strongbow ad without watching it). There was no point keeping my eyes open as the ziggy zaggy plasma colours were so intense I was struggling to make things out.  I didn't know where it was taking me and I was scared, I thought I'd overdosed and was worried I might die or go insane.  I didn't know what to do, where to turn, so I decided to curl up with my wife, close my eyes and go with it.  </p><p>I was thinking about things that I didn't want to think about, dark things, problems in life etc... and was worried about going on a bad one.  I couldn't stop the thoughts and the visuals, the bad feeling towards myself so at that point I thought... just go with it. Reading the internet later I will probably describe this as an ego loss but when I let go it all became much easier.</p><p>Time slowed down and I went on a trip in my mind, I forgot about my body and just felt, well there.  My mind travelled somewere were I felt I'd been before, I was welcome here and I felt like I could stay here if I wanted and leave life behind only I'd been sent to earth to learn.  This may sound crazy but it's what I felt, I heard nothing, but I felt it, and that I was the son of something important.  In any case I wanted to go back to life and my wife's gentle snoring sounded out like a homing beakon reminding me that I have a human life, wierd, but I felt safe with this.</p><p>I came back, visuals were intense and thoughts still wondered but I could now hold a conversation with the wife.  I tried to be humourous and said that I wouldn't wish that experience on my worse enemy.  I told my wife to put the 2c-b in the intergalactic dustbin, I never want to see it again. </p><p>After the experience had worn down I did find that in a weird way I did actually sort of enjoy the experience.  I was scared as hell but I now understand the loss of an ego and what it means, it might help me out in future experiences.  It might not have had much meaning but it was very intense and certainly I went on a journey like I've never been on before.  If I'd known what was to happen then I'd have chickened out but I'm glad it happened.  I can maybe also learn that I was better to take a breakthough dose than to take a nearly dose, not break though and be paranoid as a result.</p><p>DMT next, once I'm ready, cross your fingers for me.</p>"
}
