{
 "title": "A Life-changing Chemical",
 "author": "Kingjames",
 "citation": "Citation:   Kingjames. \"A Life-changing Chemical: experience with Piracetam (ID 95413)\". Erowid.org. Jun 26, 2012. erowid.org/exp/95413",
 "substance": "Piracetam",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Piracetam"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 95413",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Jun 26, 2012",
   "Views: 5879",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nImagine having something hilarious to say to a girl you are out with, but it will only be funny if you say it the right way, at the right time, and you're unable to do it. Or when asked your birth-date at the doctors office and are expected to give a perfect response instantaneously, imagine you can't, or you might awkwardly pause and try to speak. Your mouth moves a little but no words come out. And the people you're speaking with just stare, and look at you with a strange look.\r\nIf you've imagined all of that as I described, you're now a stutterer. That's what I, and I can only imagine many others, have to deal with. The first time I took piracetam, it was between 2 and 3 grams. An hour later I was talking faster, more precise and stutter free; better than I ever have in my entire life. Not to mention fully alert and in an extremely wakeful state.\r\nWhen people say it takes several weeks or at least days to notice the effects of piracetam, I suspect they are either not taking enough or are very unobservant of their current mental state (assuming they are taking real piracetam). For me almost all of the effects are noticeable right away. The only thing I gain with time is an increase in memory. This takes at least a week to be noticed. \r\nThis drug has been extremely useful to me and I talk constantly of it's power. I believe everyone should take it, and why not? It seems we live in an age of insane possibilities but nearly everyone acknowledges or takes advantage of that. Anyways, this report is done. I hope it was informative and useful. / Back to the boiler room.\n\n\n"
}