{
 "title": "Nuances of the Mind",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Nuances of the Mind: experience with Mushrooms (ID 95422)\". Erowid.org. May 20, 2013. erowid.org/exp/95422",
 "substance": "Mushrooms",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2012",
   "95422",
   "Male",
   " ",
   "17",
   "May 20, 2013",
   "1474",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was given the opportunity to take mushrooms for the first time just yesterday. I took this offer, seeing as I have been particularly curious for a while now. Unfortunately, I lost all sense of time, so I'm going to try and describe the different aspects to it. The effects I describe are from ~2.5 grams of mushrooms made into a tea.</p><p>Setting:</p><p>I was with a couple of friends who were also tripping. The first half of the trip was spent climbing a mountain, and the second half spent downtown looking at art and walking through parks.</p><p>Mental:</p><p>I found the headspace of mushrooms to be extremely interesting. This was perhaps my favorite part of the experience.</p><p>What is likely the most enjoyable part of this headspace was the strange connection I felt to everything around me. It's as though I was looking at everything for the first time, and I couldn't help but feel so in love with it all. It's all unique and unusual, but extremely beautiful nonetheless. It's almost as though I was a little child, just standing in awe at everything around.</p><p>On the other hand, it's as though some alien spirit invaded my brain for a little bit, so that everything I looked at just felt ﻿foreign. ﻿﻿I found myself looking at my own arms and hands, confused at their existence. My brain felt ever so slightly attached to my body, as I acted effectively on autopilot. But the moment I think about what I was doing, I felt extremely dissociated and couldn't help but contemplate my own existence.</p><p>What I found to be the most interesting part of it all is that I felt completely and utterly mad. It's so bizarre how blissful this sort of insanity is, but that's the best way to put it. I was completely aware of my own psychosis, and at the same time I was content with it. I couldn't even remember how 'normal' people think because I was just so far gone. Perhaps the most astounding thing was just thinking that within only a couple of hours that I would be sane once again, even though I couldn't even imagine what being sane was like.</p><p>Body:</p><p>The body high of mushrooms is honestly rather uninteresting in comparison the the other aspects of the trip; it was likely the least important part of the experience. It generally just felt as though gentle waves of euphoria were washing through my body, most noticeably my arms. Unfortunately, there was also a great amount of physical exhaustion. This was most apparent when climbing the mountain, as scaling these large boulders is no easy task to begin with. But beyond that, rarely was it the focus of the trip.</p><p>Visual:</p><p>I didn't get very many visuals from mushrooms, which was likely due to the dose I took. I got the usual things waving slightly and objects breathing. These particular visuals were most apparent when I was climbing up a mountain. The boulders were all breathing, and the dirt and plants were morphing around. My favorite visual however was when I was admiring the art downtown. The way paintings would move and breathe and flow was so incredibly fascinating. The painting would quite literally come to life. Rivers would flow, clouds would move across the sky, trees would sway in the wind. It was extremely hard to talk to any of the curators, because the sheer beauty of the paintings was so distracting. There was a point where I almost asked if a rather large painting was one of those digital picture frames that cycles through pictures, just because that's how real it looked. I luckily bit my tongue and realized that I was just tripping before I said anything.</p><p>Aural:</p><p>Sadly, I did not get to really experience very noticeable change in music. For whatever reason though, I found the sounds of nature to be extremely interesting, almost as though every ambient sound of the area was creating it's own little song. I even began to whistle my own sort of melody that fit in with the sounds around me, even though there was virtually nothing there to whistle to.</p><p>Conclusion:</p><p>Overall, it was an amazingly intriguing adventure, one which I absolutely plan to explore more thoroughly. This experience comes highly recommended.</p>"
}
