{
 "title": "The Infamous Woodstock Brown Acid",
 "author": "Ocrocker",
 "citation": "   Ocrocker. \"The Infamous Woodstock Brown Acid: experience with LSD (ID 95433)\". Erowid.org. Mar 27, 2012. erowid.org/exp/95433",
 "substance": "LSD",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "1969",
   "95433",
   "Male",
   " ",
   "20",
   "Mar 27, 2012",
   "Views: 12983",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Many of you have heard the announcements in the Woodstock movie warning about the brown acid. The truth is that the only problem with the brown acid is that it was so pure that it wasnt accompanied by the usual body rushes caused by speed and other adulterants in use at the time. As a result multiple doses of acid that was very strong to begin with were sometimes taken, and some trips got way out of hand.  I knowbecause I gave away a bunch of it.</p><p>I was 20, and thanks to my father I was asked to work at Woodstock, delivering and setting up machines that sort and roll up coins. The vendors there expected tons of change to be flowing in and wanted a way to manage it. If my father had known that I was already an acid head it never would have happened.</p><p>So, as unprepared as one could possibly be, I loaded three very heavy (80+ lbs each) machines on top of a blanket in the back seat of a Pontiac Tempest. The blanket  and a battery operated light (the kind that are white in front, red in back) were the extent of my camping equipment, and I had $200 to last for what I thought would be 5 or 6 days.</p><p>As soon as I drove through the gates it was a cornucopia of drugs. I was only interested in one, though, acid. Kids would jump onto the hood and trunk of the car for a ride, and it was very slow going. I saw a painted VW van advertising acid, and I gave one of the kids a $50 bill and asked him to run over and score me a few tabs. Traffic sped up a little, and I lost sight of him and the van, and kissed my $50 goodbye. Then out of the rear view mirror I see him running up to the car behind me.  They dont have change of a $50do you have anything smaller, they are $5 each. I thanked him and told him, f**k it, just get me 10. Sure enough, he comes back with 10 brown tabs, and the guy's phone number. He expected I might want to get in touch with him in the future!</p><p>I finally got the car parked, it was getting dark, and there was no way I was going to find the people I was supposed to deliver the machines to that night. There was nothing else to do, since the music wouldnt be for 2 more days, so I did the only logical thingdropped a tab. And man was I pissednothing after 20 minutes (when the body rushes usually started for me), nothing after 40 minutes, nothing after about an hour. $50 down the drain.</p><p>It was getting cold, and I needed to get the blanket out from under the machines. I couldnt summon up the strength to take even one of them out, so I tugged on the blanket, ripping it in a few places, but finally got it out. I put it over my shoulders like a shamans shawl, grabbed the light, and started to walk in search of some real acid. All of a sudden I get a rush..totally electricand it stops. A few seconds later, another rushand it stops. I walk past a couple coming the opposite away and they comment on someone they see Wow, he is f**kd up. Another rushand it stops. I finally realized that 1) they were talking about me and 2) the rushes were coming and stopping whenever the red light on the back of the lantern flashed on and off. Without knowing it I had gotten deep into a trip.</p><p>It was an extremely pleasant buzz, lots of colors, lots of visual distortion and auditory effectseasily the best acid I had ever had (and I was VERY experienced).</p><p>Two other experiences from that night stand out. I met a pregnant girl, a Hog Farmer, and we sat on a rock and talked for what seemed like hours, sharing my blanket. She was the proto-typical hippie girl I had always fantasized about meeting. I dont know if I even kissed her, but after we talked and she needed to get back I gave her $100 of my remaining $150.</p><p>Then I came across a kind of natural amphitheater where people were camped out for the night, and I settled in. There was some brief acoustic guitar from the stage that was the bottom of the amphitheater. Someone told me the next day that it was Jorma K, but I never found out if it indeed was. So Im settled in, drifting in and out of some trippy thoughts, when someone yells I need a shovel, with some faint echoes bouncing off the trees (or my somewhat handicapped ears!).  A few minutes later I need a shovel, and  then I need a f**ing shovel, someone get me a shovel. Im not sure how long his pleas went on, but finally someone yelled What do you need the shovel for?, and the first guy giggles Uhhhh.I forgetand everyone in the amphitheater laughed in unison.</p><p>I wound up trading half the remaining tabs for food and wine, although  most people would share freely without the barter. I gave fair warning not to take more than half a tab, and not to think that it wasnt coming on and take more. Others might not have gotten or heeded that warning, hence the announcements and need for some talking down.</p><p>I did call the guys who originally sold it to methey were from Chicago as I recall, and had thousands of tabs. There was no way I was going to drive from NJ to Chicago unless I could  score enough to resell, and I just didnt have the cash for that. A great disappointment, because I never found any as pure or strong after that. </p><p>I probably did acid over 200 times in a space of about 3 years, at one point 3-4 times a week.  I dropped out of college twicein my 8th semester. Its impossible to say how much acid contributed to or was a result of other psychological problems/pressures. The spectre of VietNam, a break up with a girl that I took very hard and hanging out with a very Rock and Roll crowd didnt help Im sure! I wouldnt blame any of it on acid really, never having a bad trip and having a couple of other very memorable experiences (fraternity hazing and the release of Abbey Road come to mind!)</p>"
}
