{
 "title": "Useful but Not Entirely Pleasant",
 "author": "Aurantiaca",
 "citation": "   Aurantiaca. \"Useful but Not Entirely Pleasant: experience with Ethylphenidate (ID 95438)\". Erowid.org. Apr 5, 2012. erowid.org/exp/95438",
 "substance": "Ethylphenidate",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)",
   " ",
   "100 mg",
   "IV",
   "Ethylphenidate",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 95438",
   "Male",
   " ",
   "29",
   "Apr 5, 2012",
   "Views: 10660",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I got some ethylphenidate from a RC vendor I trust, and thought it sounded interesting so I decided to give it a go.  I have never tried methylphenidate, so I cannot compare it to that, but my experiences are as follows.  (incidentally, I have lots of experience with cocaine and amphetamines, and some experience with 4-methylmethcathinone).</p><p>Based upon other reports, common dosages seem to be between 50-75mg.  I started out with 5mg insufflated just to make sure I didn't have any unexpected allergic reaction.  I didn't feel any effects from this dose, but after a couple hours, I was satisfied that nothing of that sort was going to happen, so I began the actual experiment. </p><p>11:00am- I insufflated 50mg (25 in each nostril).  It burns, but not terribly.  Within 10 minutes I was beginning to feel some effects.  My mood became somewhat elevated, but I was not particularly stimulated, just in a slightly better mood.</p><p>11:30- Feeling some euphoria, but nothing profound.  I'm actually feeling a bit lethargic, with no desire to do anything but lay on the couch and read.  Reading is more enjoyable than usual, and I'm really getting into my book.  I feel more focused.  This dose seems like it would be good to aid studying or other desk work. </p><p>12:00pm- The effects are starting to decline, so I insufflate 75mg more.  The burning is more intense this time.  This time within minutes I feel more euphoric than I did from the first dose, and I'm beginning to feel more energetic.  I now have the urge to do something a little more active, so I go outside to water my plants and such.</p><p>1:00- I insufflate another 75mg (the burn is still worse than the last dose, and my nose becomes very clogged), which motivates me to do some serious house cleaning.  I don't have the frantic, intense need to clean the entire house with a toothbrush like I get from meth, but I just have that little extra motivation to get it done.  This substance isn't entirely fun.  There is some euphoria, but there's also an underlying feeling of malaise, but it's nothing I can't handle.  I'm experiencing some tension in my jaw, but nothing like from other stimulants I've tried.  I feel like this could get worse with higher doses. </p><p>Once I get finished cleaning, I think that maybe I could have another dose, but I am able to fight off that urge.  By about 4 or so, I feel a little anxiety starting to kick in, so I take 1mg clonazepam, and that knocks the anxiety right out.  I eat dinner around 6, and I'm hungry, and the food tastes good, so it doesn't seem to affect appetite.  I'm mostly feeling back to baseline.  I go to bed around 10, and it takes me a little longer to fall asleep than usual, but once I am asleep, I sleep well, and I feel fine in the morning, except my nose is really stopped up, and when I blow it, there's some blood in the mucus. </p><p>Two days later, I decide to try another experiment.  By the 3rd insufflated dose last time, the pain was almost unbearable, and it left my nose stopped up afterward, so I'm not real hot and biscuit to put more up my nose, so I decide to slam some and see how that goes.</p><p>2:00pm- I IV 50mg.  In less than a minute I feel a euphoric rush, much more euphoric than insufflating.  Once again, I am not particularly stimulated, but mostly want to sit down and enjoy the rush.  This wears off in about 30 minutes, and I'm left feeling a little anxious.</p><p>3:00- I IV another 50mg.  Once again, I get a good euphoric rush, but that fades into anxiety shortly after.  The rush is nice, but I decide the following anxiety is not worth it, so I decide not to dose again.  I take 1mg clonazepam, and feel better shortly once the anxiety fades.  I briefly wonder what it might be like to IV another dose now that the clonazepam has kicked in, if maybe that would ameliorate the anxiety and malaise and allow me to enjoy the euphoria more fully, but I decide against it.  There is some residual stimulation, and some jaw tension, but not much.  Within two or three hours, I feel mostly back to baseline, and I am able to eat and sleep normally afterward. </p><p>In conclusion, although this substance does have some pleasant effects, the unpleasant side effects make it undesirable as a purely recreational substance.  It is useful for somewhat increasing motivation, which made me able to get some work done around the house, but I don't suspect it's good for much more.  Intravenous administration results in more euphoria, but also more anxiety, so I don't feel that this is the best ROA.  The pain from insufflation gets pretty intense after the second dose, so that discourages me from insufflating it again.  If I try it again, I'm going to dose orally and see how that goes.  It's not a bad chemical, but it's not great either.</p>"
}
