{
 "title": "Born Again",
 "author": "Mat",
 "citation": "   Mat. \"Born Again: experience with LSD (ID 9545)\". Erowid.org. Feb 9, 2005. erowid.org/exp/9545",
 "substance": "LSD",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 hits",
   "oral",
   "LSD"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9545",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Feb 9, 2005",
   "Views: 4714",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I used to be a heroin 'junkie', an 'addict'.  That was how I defined myself.  I was the classic, tortured artist junkie.  I didn't know any other way drugs would be used other than to just feel good and to create an image for oneself.  I later quit and swore off all drugs all together.  That was the next way I defined myself, a preacher of the gospel of dangerous drugs.  After some time, talking with my roommate and friend Eric, and some thought I realized it was not drugs that abused me, it was I that had abused them.  I was the one that needed to change. I began experimenting once again, this time I listened to my experiences, in an attempt to not only have a good time, but to better myself.  </p><p>A few months later me, my roommate and my friend Lee decided to take 8 hits of LSD.  We'd all done it before, but never more that 3-4 hits, this was something new to all of us.  We all woke up early that day, Lee and I both took 8, and Eric decided his mood was off so took 2.  We all made our way to brunch, talked to people and headed back to our rooms.  I was having a cigarette so I was finishing it outside when the initial body rush hit.  I went upstairs and saw Lee and Eric experiencing more or less the same thing.  We decided to go for a walk, so we all bundled up.  It was a warm winter day, but a winter day none the less.  While walking we all realized that we had become walking machines, our bodies whole existence became walking, and with my body, my mind became a walking machine as well.  I scanned for all possible paths, chose the one that would be the path of least resistance, and contracted the appropriate leg muscles to make that happen.  Suddenly my walking machines processor was shattered by a sight so unexpected that I shrieked (at least I think I did).  A llama farm.  Three llamas standing tall, one staring at each of us.  They where mirrors of us.  And if they where mirrors of us, we where mirrors of them, so we must be llamas.  With that dilemma solved we proceeded down the road.  </p><p>Our bodies remained walking machines, but our brains took in the sights of the day.  Towering trees and houses that dwarfed us all.  We realized how insignificant we where.  Just roaming bags of water and carbon.  Then, another earth shattering experience, someone flew past in one of those machines that allow you to sit and move at the same time.  A person hung out the window and screamed something.  It was just Even and Ace getting stoned, no worries.  we then reached a steel bridge that spanned over the most incredible stream I had ever seen, the snow was melting, and the stream was babbling.  We climbed through the bridge and discussed the probability of the chap stick I had was made in some guys basement.  </p><p>After a full day of such exploits we returned to the campus.  We stopped at the athletic center and our friend Karl was working.  He made us ham sandwiches.  We went back to our rooms, and Eric had to work.  So me and Lee decided to go with him.  There was some sort of concert, so Eric, Lee, and I became speaker moving machines.  After the night was done we returned to our rooms, and attempted to sleep, but sleep would not come.  So we watched movies until class.</p><p>That was one of the most pleasant days of my life.  We didn't climb Mount Everest, or go over Niagara Falls.  We didn't have sex with super models or party with Motley Crue.  We just had a nice time and learned a lot about ourselves in the process.  This was what I was missing before.  Drugs aren't some sordid little toy, there something that should be shared, with family and friends.  Like a picnic at the park, or a summer BBQ there a way to have a nice time and learn about yourself and loved ones.</p>"
}
