{
 "title": "Mass Amount of Awe",
 "author": "Munchman",
 "citation": "   Munchman. \"Mass Amount of Awe: experience with 4-HO-MET & Alcohol (ID 95460)\". Erowid.org. Mar 24, 2013. erowid.org/exp/95460",
 "substance": "4-HO-MET & Alcohol",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Alcohol",
   "(liquid)",
   " ",
   "  ",
   "oral",
   "4-HO-MET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 95460",
   "Gender: Male",
   " ",
   "Age at time of experience: 16",
   "Added: Mar 24, 2013",
   "Views: 1588",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDidn't really expect to take 4-HO-MET the night I did, but a good situation came up and I figured it would be a good time to try it.\r\nI'm not exactly sure on the dosage, my scales a little iffy. It could have been anywhere between 18mg and 10mg.  Well, here it goes.\r\n9:30 PM: Arrive at house party.  Meet up with a few people, enjoy a beer and a mixer.  I mixed a gatorade with about tequila and vodka, enough to get me a bit more than just 'tipsy'.\r\n11:15 PM:  We leave the party, it's starting to get huge and might get busted soon.  I originally drove to the party but passed off my keys to a friend who only smoked a little weed.\r\n11:30 PM:  Get back to friends place, figure why not test our 4-HO-MET. There's 4 of us, and since I was the one who bought it I figured I'd take the biggest dose measuered out.  I hand them all 9-11mg pills, and I take the 14mg baggy (I ran out of pill caps, so I just poured it into a baggy with powdered suger).  I down what's in the baggy, making sure I get it all by mixing it with water and drinking it.  One of my friends takes a pill, and the other 2 wait to see what effects are shown first.\r\n11:40 PM: I'm starting to feel it.  Colors are starting to intensify and the ground appears to be 'bubbled'.  I feel nausious and sit down.\r\n11:45 PM: Oh boy.  I think I might have overdosed.  I start to freak out when it gets kind of heavy to breathe.  I warn my friends of this, and I attempt to purge my system by puking unsuccessfully.  I just want to go to bed and not be drunk/high anymore.  I put on my music and hope for the best.\r\n11:55 PM: It's only been 25 minutes? Holy hell. My friend who took the pill still isn't feeling anything, although he is a bit high from the weed.\r\n12:05 AM: I'm starting to see a lot of visuals.  I'm not nausious anymore at all.  I tell my 3rd friend this and he takes his cap.  We go on facebook and talk to a girl.  I don't remember any of this, I'm too busy lying on the seemed-to-be comfortable cement floor, laughing my ass off at a can of peace tea.  \r\n12:1? AM: My friends start to feel the MET.  We go into the bedroom, where my friend has a blacklight and glow-in-the-dark stars on the ceiling.  Woo-hoo!\r\n12:20 AM: We convince my 4th friend to take his pill.  The shapes of the stars can't keep a constant size.  The blacklight is amazing.  Regular light seeping into the room appears orange, beautiful.\r\n12:40 AM: I am in complete and utter awe.  I'm amazed at my body features.  I've been laughing so hard and been in so much awe that tears have started to form.  For some reason I rub them all around my face and exclaim about all the fluids falling out of my eyes.  I feel my teeth and start making out with my fingers.  The shirt I was wearing that was a size too small felt like it couldn't contain me.  The plain white towel hangning on the door looked as though Yoshi was printed on it.  I walked up to the Soviet flag hanging on the wall and entered the USSR, while my friends explored the galaxy.\r\n12:50 AM: Effects still going strong.  It feels like it's been days since I washed down the metocin.  Parents are upstairs asleep, so we have to contain our laughter.\r\n1:30 AM: Start feel tired, but how could I ever sleep on this awesome drug.  I don't feel a bit drunk anymore.\r\n2:30 AM: I'm starting to come down.  I go to the bathroom, which has wooden panels for walls.  In one of the knots, I see a dwarf with a long nose.  He winks at me and I continue to piss.  I look in the mirror and I look like starecat.  My pupils are dilated beyond belief.\r\n3:30 AM: Visuals are gone.  Friends coming down, I'm left with a mental high feeling, like weed.  Friends are down in a matter of minutes, we decide to go to bed.\r\n4:00 AM: Can't sleep, so we talk a bit.\r\n5:00 AM: Finally catch some sleep.\r\n5:50 AM: Friend #4 (took it last) finally falls asleep.\r\n11:00 AM:  My God, I look like a train wreck.  I slept in my contacts, eyes deprived of fluids and feel sticky.  Don't know how I'll go home looking like this.\r\n12:30 PM:  Drive home, pupils are small now, eyes a bit better.  Mom asks if I'm really hungover, I play it off all cool and just say I slept in my contacts.  Whew.\r\n1:30 PM: Still really tired. Go take a nap.\r\n4:00 PM: Get up for a bit, well rested.  Finish the day relaxing.\r\nWell, that was the extent of my trip.  Hopefully next time we'll do it during the day, and now I know not to mix tryptamines with alcohol.  I regret doing that, feels like I could have had way more out of it.  Next trip we'll do it in a light, relaxing room, maybe outside, and enjoy the trip to its full extent.\n\n\n"
}
