{
 "title": "Impossible!  Elven AA",
 "author": "JMT",
 "citation": "   JMT. \"Impossible!  Elven AA: experience with 2C-T-2 and Piracetam (ID 9563)\". Erowid.org. Jul 8, 2002. erowid.org/exp/9563",
 "substance": "2C-T-2 and Piracetam",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "3600 mg",
   "oral",
   "Piracetam",
   " ",
   "10 mg",
   "oral",
   "2C-T-2"
  ]
 ],
 "footer": [
  [
   "2001",
   "9563",
   "Male",
   " ",
   "Not Given",
   "Jul 8, 2002",
   "Views: 11953",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI'd been taking 2400-4800mg of Piracetam daily for about three weeks when I decided I'd take 2C-T-2 again.  Piracetam on it's own for me produces a nice body 'feeling' and an interesting sense of cognitive enhancement-not particularily stimulating like deprenyl, but more 'sharpening', for lack of a better word.</p><p>I'm very familiar with 2C-T-2 and so thought very little of dropping about 10mg on a bite of my donut one morning.  As it came on perhaps an hour later I decided I'd attend an Alcoholics Anonymous meeting as I'm a regular there.  Arrived at the meeting well beforehand and decided it appropriate to insufflate a bit more 2C-T-2 as the 10mg orall was kicking in nicely.</p><p>To say the least, the effects of the 2C-T-2 that day were far and beyond anything any previous T-2 trip.  Most marked were the visual 'effects'.  *Never* in my life have I seen visuals like those and can best describe them as 'impossible'.  Objects would become transparent so that I could look at, say, a person, and they would 'turn clear' and I could see right through them.  Things would unpredictably dissassemble into 'frames that would re-organize themselves systematically in different locations, if that makes any sense.  I.e.- while looking at say, two people, one would split neatly into sections(head, torso, legs) and the sections would rearrange themselves so that the head would be on the floor and the legs where the head went.  </p><p>Meanwhile the person next to them would in some cases look 'normal' aside form the colors and trails and whatnot.  What was interesting to me was the neatness that my reality was diced up- perfect, razor like frames- no blurring or 'morphing' of any sort.  As neat as watching a computer screensaver or some such thing in action- 'Windows' for the mind so to speak.</p><p>It seemed completely obvious to me that my reality/consciousness/subjective experience was being manipulated by a higher power or intelligence(and for both of our amusement's and my astonsishment!).  What I would describe as the endogenous DMT elves 'demonstrating their powers', to quote John Lilly from a ketamine experience of his.</p><p>Finally I must add that when I spoke with someone or interacted with anything, it would appear in perfect resolution- so that my 'functioning' was in no way impaired.  I'd sit and chat AA material with various concientiously sober people while occasionally glancing past them to watch the bio-computer software show.  Everything had deeper meaning and I learned an enormous amount ;-)</p><p>Also noted was the absence of prominent 'body buzz'- usually very strong for me with T-2.  In addition, the effects lasted a good 12 hours and residuals for the next day...</p><p>I can only attribute the fantastic magnification of the T-2 experience to the Piracetam as it was the only new variable in the equation.</p>"
}
