{
 "title": "The Dentist's Face was Melting",
 "author": "Crack Monkey",
 "citation": "   Crack Monkey. \"The Dentist's Face was Melting: experience with Nitrous Oxide (ID 957)\". Erowid.org. Nov 13, 2000. erowid.org/exp/957",
 "substance": "Nitrous Oxide",
 "bodyweight": "111 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 957",
   "Not Specified",
   " ",
   "Not Given",
   "Nov 13, 2000",
   "Views: 12867",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI can remember about a year ago when I was preparing to get braces. I needed 4 teeth pulled (to allow room for my other teeth to straighten out) and 5 fillings. The first trip I was to get 2 fillings and 2 teeth pulled. I was in the chair and just out of the blue the dentist says, 'We're going to give you something to help you relax, it's called Nitrous Oxide, or laughing gas.' I just casually replied okay, but inside I was getting excited. I'd never had Nitrous before and I always wondered what it'd be like to try it.</p><p>So they strapped the thingy on my nose and told me to take deep breaths through my nose. So I did. The Nitrous smelled horrible, but I didn't care. After about 15 seconds I started to feel just a little dizzy. After about a minute I got double vision. I didn't notice this until I looked to the left of me, saw the dentist, then looked to the right of me, and saw the dentist over there, too.  And suddenly I was off the chair, floating in the air, and I thought for sure I would hit the ceiling but it seemed that something kept me just an inch away from it. The dentist would talk to me, like tell me to open wider, or ask me how I was doing, and his voice sounded like it was coming from below me, from the left of me, and from the right of me.</p><p>He told me that he was going to leave me alone for a second, and when he left I began breathing the Nitrous more rapidly, breathing in and out very fast. While I was doing this the music playing in the background began to slur and everything I looked at seemed to be swaying and dancing to it. I could also see the music flowing through the air. It looked yellow and red. When the dentist got back he said, 'How ya doin', experiencing any pain?' I just replied by saying, 'I okay.' But it probably sounded more like, 'Ahhh okeeee.' I heard him say, 'He sounds pretty messed up,' and that just made me let out a little chuckle. His face looked like it was melting. All of a sudden my head popped off and I was looking down at my body. I tried twitching my fingers and I could see my fingers twitching below. Anyway, it was pretty much like that for the rest of the visit and when they took away the Nitrous, it felt like I fell out of the sky. It sucked. The Nitrous was cool. The ride home sucked.</p>"
}
