{
 "title": "What Love Really Is",
 "author": "LightSeeker",
 "citation": "   LightSeeker. \"What Love Really Is: experience with H.B. Woodrose (ID 95704)\". Erowid.org. Apr 15, 2012. erowid.org/exp/95704",
 "substance": "H.B. Woodrose",
 "bodyweight": "54 kg",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 95704",
   "Gender: Male",
   " ",
   "Age at time of experience: 27",
   "Added: Apr 15, 2012",
   "Views: 7386",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The sun rose and I decided to take some Argyreia seeds which I had bought from a near gardener. It would be the first time that I was taking them, and so I was a little bit expectant about the coming trip.</p><p>I was, in the last days, thinking seriously about my relationship with my wife, with my relatives, with people in my family, and with God. Nothing was really bad in my life, but still there was a kind of lacking in my heart, a sense that I needed to do more than I was doing. So that was the primary reason for me to take this seeds: understand myself, and how should I associate with people.</p><p>7 a.m. I went outside, got in a nearby church, made my prayers and put 5 seeds (no outward layer) in my mouth, chewed them and let it there for nearly 20 min; then I went outside, spit half part and swallowed half.</p><p>Walking back home I started listening to some good interview on the radio  nausea was coming.</p><p>8:30 a.m.  Got home, my wife was working in a essay, I sad to her I was slightly sick, and then I went to bed. </p><p>With the passage of time my heartbeat was getting much faster then the usual; I could not focus in anything outside, and so I kept my eyes closed. There was no mood for introspection though  the agony and confusion in my mind was overwhelming.</p><p>10:30 a.m. I was suffering a lot in bed, impossible to rest, my wife kept helping, always coming by my side, giving me water and praying with me for this experience, which was turning itself into a nightmare, to go away. (Her love was inspiring!)</p><p>11:30 a.m. Tried to puke, nothing came out. I was constantly looking at the watch, eager for the time to pass quickly and let me out of this trouble. What did I do!!  I kept thinking with myself  if this keep on growing Im going to die! </p><p>I started to think that I had to purify my body quickly, so I began to drink lots of water.</p><p>12:30 a.m. I could not bear the suffering anymore... I felt I was collapsing. I could barely walk; I hadnt eat anything by then.</p><p>13:00. I started to feel a little better. Laying on the bed I contemplated, through the window, the clouds in the sky and enjoyed a slightly pleasant sensation... At this moment I could feel the blessing that my wife was to my life, and how her character was unsullied, and her personality angelical: Im grateful, my God.</p><p>However, this insight didnt last. Soon came some more discomfort  I was for sure still poisoned.</p><p>13:30. Suddenly I felt more at ease and I thought that I had already spent much time suffering in bed (more than 5 hours)  I decided to go outside for a walk. </p><p>Walking through the streets and seeing the trees in it was in fact very much pleasant, so I kept on walking. I felt delightful to see all things: objects and people. </p><p>However, I started feeling dizzy, my sight was becoming dark  I realized I was going to faint at any time. I ran inside a big department store on the corner hoping to get some fresh air through their air conditioner. I got in, sat on a bench, but the symptoms didnt went away.</p><p>15:30  I fell on the ground, almost unconscious; immediately came the police, they called to my wife, and she came along with more 3 friends... I could see nothing more...</p><p>17:00  I was in the hospital, and was starting to feel better. The events of that day was all I could think about. I felt the great love of my friends.</p><p>19:00  I came back home. I was breathing relief and gratitude again: I didnt die. If so I would have ruined everything and left behind the most loving parents, wife, kids... all of them in enormous agony.</p><p>For the next 3 days, due to side effects, I had virtually no sleep, with pressure and cardiac alterations. </p><p>At that moment I reflected that the real hero in life is he who has the courage to face all his great challenges without using drugs.</p><p>Well, I began this journey seeking a deeper understanding of my life; even though the psychedelic effect of the seeds had been buried under the awful intoxication, by the end of it all I ended up with the answers!</p><p>Realizing all the help and care I received that day (and in my whole life) I had a glimpse of what love really is.</p>"
}
