{
 "title": "Stare & Irritability",
 "author": "A",
 "citation": "   A. \"Stare & Irritability: experience with Butorphanol (ID 9577)\". Erowid.org. Jul 27, 2004. erowid.org/exp/9577",
 "substance": "Butorphanol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "3.0 ml",
   "insufflated",
   "Pharms - Butorphanol",
   "(liquid)",
   " ",
   "50 mg",
   "oral",
   "Pharms - Amitriptyline",
   "(daily)",
   " ",
   "1000 mg",
   "oral",
   "Pharms - Divalproex",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9577",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 27, 2004",
   "Views: 12002",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>If you have not heard about Stadol it is a nose spray prescribed primarily for migraine headaches.  I have taken many painkillers over the years but yet have I found one to help with my headaches like Stadol.  I am also taken 50mg of Elavil and 1000mg of Depakote daily to help with my migraines.  This combo seems to be working quite well.  Anyway, back to Stadol.  As I said it is a nose spray which means it will go to work very fast(usually within minutes).  The first thing I feel is a very calm feeling all over but mostly in my head.  I have actually sat for a hour without saying a word to anyone in the room.  If I do like three or four 'squirts' up my nose I will get a drip in the back of my throat sort of like a cocaine drip.  It will actually numb my throat for a little while.</p><p>But there is one down-side to Stadol.  I have found that it can make me extremely irritable and frustated at the most stupid things around me.  I dont know why this happens but just about anything can set me off.  Also, as you might guess, Stadol is very addictive and very hard not to do when I have nothing else better to do that day.  Anyway, thats my two cents worth.  I'm just waiting till Monday so I can get my script filled.  Hope this has educated someone out there.  Later..</p>"
}
