{
 "title": "Not Going to Consume Again",
 "author": "m1fan",
 "citation": "   m1fan. \"Not Going to Consume Again: experience with bk-MBDB (ID 95788)\". Erowid.org. Jun 21, 2012. erowid.org/exp/95788",
 "substance": "bk-MBDB",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   " ",
   "bk-MBDB",
   "  T+ 2:00",
   "75 mg",
   " ",
   "bk-MBDB",
   "  T+ 2:00",
   "  repeated",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "2011",
   "95788",
   "Male",
   " ",
   "19",
   "Jun 21, 2012",
   "4593",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Chemical experience: Experimented with many chemicals, in recent years have done Cannabis (daily), mushrooms, bk-MDMA, Adderall, Vyvanse, LSD, 4-FA, MXE</p><p>Set/Setting: At my apartment, Saturday before Finals week, had a bit of a headache and was out of adderall, so looked to this due to its supposed similarity to bk-MDMA, which I was quite a fan of, and thought it would be a good get things done while enjoying myself drug to take with my GF.</p><p>Took the chemical on a partially full belly (had eaten a hamburger roughly 15 minutes before or so, wasn't stuffed or anything). As I came up, I laid back in bed, just as I like to on bk-MDMA. Within a couple minutes (maybe 15?) , I was definitely feeling it, as was my girlfriend. I felt very excited, and actually almost identical to how I do on bk-MDMA. Very entactogenic feelings in the beginning, we immediately began to have a very deep conversation, although it didn't last for a long time, we just really got to the core of the issue and resolved it within a few minutes, and moved on from there.</p><p>From here, we went out for a cigarette. On most uppers/RCs, I constantly crave a cigarette, and am almost uncomfortable if I'm not smoking. This was the case with bk-MBDB, however, smoking was very unenjoyable (they tasted bad, didn't like the feeling), but it was still better than not smoking. </p><p>On bk-MDMA, I consistently have a couple hours where I am very extroverted, then a couple hours of what I call quiet time.  This is a feeling of wanting to talk and communicate, but not really knowing what to say, and getting really in my head. On bk-MBDB, I had a couple minutes of energy and non-stop talking, and then I'd have about half an hour to an hour of quiet time, and then something would trigger me into talking non-stop for a short while, and it would cycle through like that. I felt a strange separation between my internal thoughts and external actions, like that I wanted to sit down and figure out what I had to get done (because my thoughts were going everywhere), but also that I wanted to quit thinking and just run for hours. To try to knock myself out of this quiet time, we bumped another 75mg a piece after about 2 hours on the drug.</p><p>Furthermore, I had very little bladder control on this drug. I was urinating every half an hour or so  definitely not one that I would take at a club. I had some stomach aches. And, on a little more graphic note, I defecated green slime twice on the drug, and once more in the morning that followed. </p><p>After a couple hours on the substance alone, I smoked a bowl. This helped my stomach pains a little bit, but mostly I just got this weird feeling that this chemical would be much more pleasant if the ratio of marijuana to bk-MBDB in my system was more skewed towards the marijuana. At this point, as well as thoughout the night, I was completely unable to stand still, so we went for a walk. Conveniently, a friend of mine called us, wanting to smoke a blunt (really convenient timing, it was just after I decided I wanted to smoke a lot of cannabis, but had no means of doing so).</p><p>On the way to smoke this blunt, I had to buy wraps at a gas station. I was totally fine, absolutely zero suspicion from anybody that I was on drugs, and I was not worried at all. It was very functional in that sense.</p><p>Once I got very high, I lost that guilty feeling I was having about not getting any of the work done that I wanted to (although I had cleaned my apartment a little and done laundry). My stomach also started to feel a bit better as I laid down, but I had a really weird headache come on. It was seemingly centered in the core of the left-hand side of my brain, and for some reason I felt as though my brain was glitching. I think this may have been a high-manifestation of my body trying to tell me that this was not the chemical for me, but I'm not really sure. It was definitely weird.</p><p>This next morning, I have not had the hangover I would usually have on bk-MDMA. However, due to the poor experience I had (although it wasn't overwhelmingly negative, just uncomfortable), I won't be putting this substance in my body ever again. My girlfriend did seem to enjoy it, and she was much more productive than me, but she had also eaten quite a bit more than me shortly before we took the drug.</p><p>All things considered, it wasn't the worst in the world, but it was very far from the best.</p>"
}
