{
 "title": "Intense, Overpowering and Utterly Lovely",
 "author": "Apollo",
 "citation": "Citation:   Apollo. \"Intense, Overpowering and Utterly Lovely: experience with LSD, MDMA, and Nitrous Oxide (ID 9585)\". Erowid.org. Jul 8, 2002. erowid.org/exp/9585",
 "substance": "LSD, MDMA, and Nitrous Oxide",
 "bodyweight": "58 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "  T+ 1:00",
   "1 hit",
   "oral",
   "LSD",
   "  T+ 7:45",
   "0.5 hits",
   "oral",
   "MDMA",
   "  T+ 8:15",
   "0.5 hits",
   "oral",
   "MDMA",
   " ",
   "  ",
   "inhaled",
   "Nitrous Oxide"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9585",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 8, 2002",
   "Views: 37997",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI was brought up in a relatively drug-free environment. I knew my dad used to smoke weed, eat shrooms and lsd, but we didn't really talk about it much till rather recently. At 16, I got a job at a movie cinema, working with angry young teenagers in a job where you really feel like you're trash. Ecstasy and raves came around, I first tried MDMA shortly after getting my job. Next came weed, which produced oddly hallucinogenic results for me... Friends smoking the same stuff would remark at how it sent me to la-la land so quickly. I should add that it was extremely psychological (which I loved) but it's unplesant effects outweighed any enjoyment I derived from the psychological effects... LSD interested me greatly. All of it's effects, other than the extremely frightening possibility of 'unwanted spiritual change' and a bad trips, beckoned me to try it. I didn't just want a hallucinogen, I wanted a psychoactive... \r\nBeing 17 and in my final year of school didn't help much... I read endlesly about LSD and finally got some information out of my father on it. It's interest grew on me inexplicibly. I was eager to try it, but knew if I did it as an 'on the spot' thing, I'd probably fuck my mind up terribly. I had to plan it out... Have a small dose with good friends in a lounge environment. This was what I thought... \r\nMyself, one long term friend, four others I've known for about six months and one stranger gathered on a belt of grass which looks over Sydney Harbour, namely the Opera House. We had one goal - to be at Home Nightclub by seven in the morning so someone could hook up... I knew some of them were tripping, and personally I thought I might down some DXM as it seemed like a stupid place to have my first acid experience... Busy city, late night, etc. I sucked down one hit of blotter paper at 9.15pm. After an hour, sitting in the same area, the others begun laughing like there was no tomorrow... Keep in mind I had never even been around anyone who was tripping before, so I had to have it explained to me that this was the trip coming on. I felt nothing. At 10.15 I reached for my wallet and took a second one. \r\nAt eleven, just under two hours since I'd taken the first hit we moved along the belt, parallel with Macquarie street and the Botannical gardens to an artwork on a hill were the strip of grass came to an end. It was an arrangement of sandstone shapes, all of which were girders, arches, etc from fallen buildings. I felt strangely intoxicated... My mind felt as if it had been strangely lubriacted by some chemical... My thoughts were powerful, deep and strange. Sitting on one of those sandstone blocks which was supposed to be a coloumn for an old building, talking with (of all people) the stranger (who shall be known as T from now on) I realised I wasn't focusing on anything. I was moving my eyes every few seconds... I looked straight down and focused on the grass. Every single blade was vibrating and pivoting at the root at the same time... the individual blades had little purple tinges around the edges of them... Utterly astounded by this, I stood up and watched as they continued their vibrating & pivoting across the whole field... Blink after blink, it didn't cease. T whipped me into it with her trippy behaviour. It was time to move, we walked to the street and under an overpass... It had a plain grey wall, on it I noticed what looked like a glass pannel (it wasn't) over a vibrating mass of confusing holograms... I put my hand on it and felt rushes up my arm... I thought I saw colours at my finger tips where I was making contact with the hallucination. \r\nI felt very odd, but in a pleasant way. I looked up at the high rise buildings, which rippled (they bent and reshaped) with my thoughts... Whatever I put into my mind somehow manifested into hallucinations. Next came what must make some old time trippers nostalgic... A series of street lamps (lighting up the path we were on) were not quite the way they usually are... Their poles were bending and moving in a circular fashion. The large perspex sphere on top changed in that it looked like a stress ball getting squeezed... The circle of light they each provided moved around on the ground accordingly. It made me think of the fairy tales and such that had been inspired by the drug. I felt like my mind was a powerful, creative machine... Pumping out thoughts, vibrations and emotions in different ways... All showing up in my hallucinations, which were everywhere & so intense by this point (it was about 12) that I could hardly make out what was twenty meters infront of me... \r\nWe had a slight problem. The only other person whos first trip it was, B, was freaking out something vicious. Even our nannies were tripping, so moving from place to place took hours. We reached Hyde Park at about 1.30... The visuals I was getting took me over... I clung to T, not scared but a little edgy. I wont explain my hallucinations in the park, but I'll use the following words and you can get an idea yourself: colours, shapes, time, emotion, feeling, overpowering, everywhere and reality?\r\nAt this point, roughly 2am, I realised I couldn't tell you where I was, other than saying 'Hyde Park' as I'd been told that's where we were. A friend of many years turned up. He sat on the bricks infront of me and proceeded tesselate with and melt into them... I smoked a cigearette - I felt it spread through my body, like a polluting force... I could almost see it happening too. The fountain did not take a solid form in the entire time we were there. Myself and F named a tree in the dark and pissed on it. My urine was extremely colourful, and it carried its colour on to the tree, before dropping onto the surrounding leaves. \r\nCompletely dumbfounded by this astonishingly creative and dreamy state of mind I had slipped into I talked a little. My thoughts raced, they pumped through my mind, developing and evolving as the words came out of my mouth to the point where when I uttered a few words to myself they'd changed with my thoughts as I spoke... Hence 'cantbelievintensohmcoloursarmythoughts' and such... I suppose that example doesn't do justice to the complexity, depth and rapid changing nature of the thoughts passing through my mind at that point. For many hours I could not compose a sentence.\r\nSeventeen years old, tall & thin, with equally intoxicated friends in Hyde Park on a friday night... Sounds like a recipie for disaster? I was not at all frightened. I could have let go - let fear taken me over, I know it... But I held on, and T congratulated me for not losing it as she had done on the same dose the week before... I had always thought of myself as a bit of a 'cosmic tripper', if you will... I love speed (not the drug), heights and other things... Flying a space ship through an asteroid field in a Star Wars video game was just so much fun... LSD is the drug I had been looking for. I can't quite word how I felt LSD connected with my mindset, but I'm sure others know what I'm talking about regardless of wording.\r\nWe decided to move down to Darling Harbour. I clung to T on the way, unsure of where the real roads were, which cars were real and watching the huge, towering buildings warping in and out with my thoughts. Colours spewed from neon signs, lights wobbled & danced in circular patterns... If it were not for T, I would have crawled into a hole and waited for it to wear off. We walked past a loud, thumping party. I could see the music pumping out in translucent waves of colour... We got to Darling Harbour. \r\nMy mindset changed a little... Cockle bay wharf and in particular Home Nightclub have very odd designs... The water shimmered and mirrored my thoughts... My senses seemed to combine... I could feel what I could see, taste what I could hear, smell what I could feel... And thought was at the back of all of these... It was as if there was a tree graph of senses... Thought at the top, tieing taste, smell, touch, hearing and seeing together (which is normal, thought being my brain and the others my senses). The conneciton paths between them however, on LSD, had become two-way and new ones had grown to connect them all. \r\nWe sat in a playground, near the Imax theatre and below two freeways. I continued to trip balls... Everything that was vertical waved around, grew, shrunk, etc. Shadows turned into pools of water, then started shrinking... While they shrunk, I'd notice there was a gap in the bricks sucking them down... Vines grew from uncanny places, etc. I described what I was seeing to a long time tripper who replied that she'd 'give the devil a blowjob' to be where I was... \r\nAt about 4.30am, I started coming down. The visuals were much less intense, but my thoughts were still just as fucked. I got a bit wobby. A few friends who were in Sublime@Home that night came out to say hi to all of us... I got a Green ? of one of them and ate half of it at 5am... At 5.30, the MDMA packed little sucker hit me. The familiarity of MDMA crept through me... The acid came back on with it. I dropped the other half at 5.45 or so.\r\nSitting outside Home Nightclub I looked across the water. The sun had come up, it was almost 6. The novotel was waving... Pulsating with my heartbeat, the sun casting a golden glow across the windows, which, with every heart beat and shimmer of the building looked like they were spitting out little gold sparks... It was wonderful, intense and overpowering... I plan on candyflipping again. My mind was relatively weakened by this point, but I was off my chops. Body rushes, the city waving, my feet melting into the ground... I referenced back to T, my symbol of the real world for most of the night... \r\nI bought all the nitrous bulbs we could find (40) and we walked to Centennial (spelling?) Park. We sat down and had them. They kicked the acid back in a little... I came down off the pill at about 9am. I was still tripping a little... Tiny vibrations though buildings, people, etc. I caught a bus home and had a very tricky discussion with my father at about 12 mid day. My pupils were still the size of saucers... \r\nI sat in my room, collecting my thoughts, etc. I should add that I had an attention span of about 10 seconds, my eyes were tired and I felt really worn out. I was scattered as all shit... Any MDMA user will know what I mean by that. Combine MDMA scatteredness with acid scatteredness and you have one really boring, silent and pathetic day. I slept at 1pm, till 5pm. Ate some food, put on some music, spoke to a few friends and went to sleep for the night. \r\nI was scared of LSD. I thought it would drive me insane in an open environment, or even if I just went for a drive with someone when tripping. LSD utterly amazing... I couldn't explain it in a sentence, so the conclusion here will probably be directed at the use of acid, not its effects. This is my notice to first time trippers that they should not be afraid of bad trips or unwanted spiritual change as it can be easily avoided if you know your mind. This may sound cocky, but I've known I have a strong mind for a long time. If you think you don't go easier than I did... Step it down... Go for the lounge setting or a smaller dose... Get closer friends to look after you. I had an awesome time on a heavy dose, with a total stranger (now a good friend) in the middle of the urban jungle. \r\nEnough rambling from me... I hope I've helped in some way.\r\nGood luck and remember that acid is a truly rewarding experience... Don't be afraid of it.\n\n\n"
}