{
 "title": "Similar Effects to Pot, Minus the High",
 "author": "William",
 "citation": "   William. \"Similar Effects to Pot, Minus the High: experience with Catnip & Tobacco - Cigarettes (ID 9586)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9586",
 "substance": "Catnip & Tobacco - Cigarettes",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)",
   "  T+ 0:05",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)",
   "  T+ 0:15",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)",
   "  T+ 0:30",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)",
   "  T+ 0:45",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)",
   "  T+ 0:50",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)",
   "  T+ 1:05",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)",
   "  T+ 1:35",
   "1 bowl",
   "smoked",
   "Catnip",
   "(plant material)",
   "  T+ 1:45",
   "1 cig.",
   "smoked",
   "Tobacco - Cigarettes",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9586",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 7, 2005",
   "Views: 38809",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Today I decided to smoke some catnip. I haven't smoked anything but cigarettes in a long time, and tonight felt like one of those nights when a good bowl is in order - catnip will do for now. I drove to Kmart and got a bag of the stuff, under the pretense that it was for the cat (heh heh).</p><p>Later, at 10:00 PM, when all were sound asleep, I smoked a small bowl. I really didn't feel much, but my nose cleared, and the crap in my lungs loosened up, which I coughed out. At 10:05 I decided to smoke another, slightly larger, bowl. By this point I felt somewhat relaxed, but nothing major. As I smoked a cigarette a little later, I started to notice some things - my muscles relaxed, and I kept seeing things out of the corner of my eye. My night vision went completely down the toilet, and I tripped over a cat bowl sending cat food everywhere.</p><p>At 10:15 I went online, read my mail, and browsed sites about smoking catnip.</p><p>At 10:30, I felt rather drowsy, but I got up and smoked a huge bowl of the stuff, constantly puffing for 15 minutes or so. My night vision got even worse and I tripped over my cat, who smelled my catnip and wanted some. When the bowl was about cashed, my little brother walked outside. This freaked me out, making the drowsy feeling disappear. Luckily I was behind some laundry, so he didn't see me. I finished the bowl off, went to the upstairs porch to have a cigarette, and tripped over my ashtray sending butts and ash all over the porch floor - drowsy feeling even more gone. I sat down, and smoked cigarettes for a while. While I was doing this, I was starting to feel a good hint of a genuine high. Whenever I went into deep thought, I would unconsciously move my eyes around quickly. My limbs started to get heavy.</p><p>At 11:00 I started to get the munchies pretty bad, and went inside to have my usual munchie attire - tuna sandwiches and cheese pretzels. By the time I was done eating at 11:20, the high feeling had gone away, and the drowsy feeling turned into just dull generalized fatigue, like you get from staying up till 4 in the morning. I went back on the computer, read more mail (40 down, 200 to go). By 11:30, I felt completely sober, but a little more tired.</p><p>At 11:50 I decided to go have another bowl. I got up from the computer, and noticed my muscles were rather stiff. I smoked a decent bowl, and at 12:05 went up to have a cigarette. While I was smoking the cigarette, I started to feel a pretty decent moderate high. At 12:15 I went back to the computer to read more mail. I'm not tired anymore, and am very alert. After reading the mail my energy level goes to hell, my brain is slowing down, and I'm craving milk. At 12:35, after 5 minutes of chugging half a gallon (not kidding), I go out for my fifth bowl. I ended up coughing into the bowl, sending cherry into the air and onto my hands.</p><p>At 12:45 I sit down and smoke a cigarette, feeling very calm, content, and very tired. My night vision has come back, and I can see very well now. I've completely lost my concept of time, my only reference is my watch now. At 12:50 I go back to the computer, try to read some stuff, and realize that if I read another word my brain will overheat, causing cellular meltdown, turning my skull into something resembling the World Trade Center. </p><p>My experience with catnip has definitely been a positive one. It has similar effects to pot, minus the high. Definitely recommended for those times where pot would be good, but there's no pot around, or for stress relief, insomnia, or to clear your nose and lungs. I don't recommend it if you need get anything done, cause its hard to concentrate. Cigarettes are a must with this one - the tobacco easily doubled the effects of the catnip.</p>"
}
