{
 "title": "Almost Insane for the Rest of My Life",
 "author": "Gio",
 "citation": " Gio. \"Almost Insane for the Rest of My Life: experience with Mushrooms (ID 9590)\". Erowid.org. Sep 23, 2001. erowid.org/exp/9590",
 "substance": "Mushrooms",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9590",
   "Male",
   "",
   "Not Given",
   "Sep 23, 2001",
   "8423",
   " "
  ]
 ],
 "report": "<p>\nOn Friday evening I went to see a friend of mine, he had a whole bush of morning glory growing in his backyard. We both looked for seeds and all together we found about 80 seeds. I went home and around 11 PM I got so bored that I started to eat the seeds. An hour later my friends left and I went up to my room. I laid down on the bed, waiting for the effects to set in. But eventually I fell asleep and nothing happened.</p><p>The next day I got a call from a friend who had some Mexican Mushrooms for me. I went over to his house and bought 5 grams of mushrooms. When I came home I decided to make some mushroom tea for later that evening. While I was making the tea, I ate a bit. I cannot remember how much I used, but looking at what was left after the trip, I guess it was half of what I had bought. After the tea was made I sat down on the couch and started to watch television. </p><p>Effects came on very quickly, as fast as five minutes after drinking a bit of the tea and eating a couple of small mushrooms. I first noticed the ceiling moving, as if it was a fluid. In about five minutes everything I saw was moving and twisting into and around each other. I enjoyed what I saw and I can remember I was talking aloud to myself, but after I while I could not remember what caused this situation. I did not realize it were the mushrooms, I had forgotten all about them! I could no longer keep my thoughts together. Still it didn't really occur that something was wrong, I was in a dreamstate of mind, but I am sure that I was awake. I walked over to the mirror and saw a person that I did not recognize. The image of myself was constantly changing shape. Time passed and I kept wandering through the house, until a friend of mine walked in. I tried to explain what was happening, but I could not express myself, nor could I keep my thoughts together for longer than a second. I also had hard hallucinations on his posture. </p><p>Then it came to me that this was not normal, that this was dream nor nightmare, but that I had no more contact with reality. After a few minutes my friend understood that something had gone wrong eating the mushrooms. So he took me outside for some fresh air and away from my house, because my parents could return any moment now and they would be pretty shocked, if they found me in this state of mind. He took me to my girlfriends, so maybe she could ease my mind. Be the time we got there I was able to communicate a bit, but my girlfriend started laughing at me. She said she could not pity me, for I had been messing with dope for far too long now. The drugs took hold of me again and the stronger visuals I had before were back, but even more cruel and twisted. Eventually my buddy explained to her that it wasn't the time for telling me this, because it would only make things worse. So eventually the both did their best to comfort me and I came back to normal, rattling about things that made no sense at all. Eventually it was all gone, except for a very painful headache.</p><p>Maybe this is daily stuff for some people, but for me this was a very frightening experience. For I had been totally away from reality for more than 2 hours.</p>"
}
