{
 "title": "Was the Right Choice",
 "author": "Blinds8",
 "citation": "   Blinds8. \"Was the Right Choice: experience with Baclofen (ID 95934)\". Erowid.org. Jun 4, 2012. erowid.org/exp/95934",
 "substance": "Baclofen",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "30 mg",
   "oral",
   "Pharms - Baclofen",
   "(pill / tablet)",
   "  T+ 4:00",
   "30 mg",
   "oral",
   "Pharms - Baclofen",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2012",
   "95934",
   "Male",
   " ",
   "23",
   "Jun 4, 2012",
   "3949",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My sister received a prescription for Baclofen for an injury she got at work but never finished the pills. Having suffered from alcoholism and other mental illness, I am in recovery and take Lithium, Seroquel and Ulcer medication, not to mention the various 'muscle relaxants and narcotics' for a hip injury. Seeing the Baclofen and not knowing what it was, I looked on the internet for answers and found it is used to treat addiction and severe muscle disorders in MS patients and figured at a high enough dose it could help me with my leg/hip pain. </p><p>I took three 10 mg pills at roughly 8 am in the morning. I was in my usual stressed out mindset for the next 3-4 hours until I began to feel a slight lightness in my body and my perpetual headache seemed to stop. Attributing that to the Baclofen I proceeded to take another 30mg and almost immediately felt the aggression, pain, and stress melt away so fast it felt as if I had taken several drinks and smoked several joints without the side effects of alcoholism or drug addiction. No paranoia, no high just a very pleasant calming effect stronger than opiates and safer then benzo's. No hangover effect the next morning and no craving for more. This drug makes me angry at my doctor for not suggesting it earlier opposed to opiates. I will do this drug again when feeling that inner tension.</p>"
}
