{
 "title": "Surprise - Very Empty Feelings",
 "author": "Bong Fish",
 "citation": "   Bong Fish. \"Surprise - Very Empty Feelings: experience with Magic Mushrooms & Cocaine (ID 9594)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9594",
 "substance": "Magic Mushrooms & Cocaine",
 "bodyweight": "142 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.0 g",
   "oral",
   "Mushrooms",
   "(fresh)",
   "  T+ 2:00",
   "2 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "  T+ 3:15",
   "2 lines",
   "insufflated",
   "Cocaine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9594",
   "Male",
   " ",
   "Not Given",
   "Jul 7, 2005",
   "Views: 15203",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was Friday night and most of my friends were at this party that I wasn't invited to so I was a bit down in the dumps and bored.  This guy I know called J calls me up and say's let's hang out, I don't really feel like it so I stay home for a while and eat 2 grams of magic mushrooms out of self-pity.</p><p>It all begins with the mushrooms.</p><p>0:00  Chew on mushrooms for about 5 minutes on an empty stomach.</p><p>0:10  Smoke a little bit of catnip.</p><p>0:40  Mushrooms have taken a hold, I feel relaxed and start getting heavy feelings of tranquilisation... I've taken mushrooms about 20 times so I don't have very hard trips off 2 grams anymore.  My friend J calls, 'Come on man, we'll score some mushrooms' he says.</p><p>1:00  I find myself walking with a big grin on my face up the street to meet J.</p><p>1:20  The mushrooms are making me a little bit unbalanced, giggly, I feel good inside, like Ive drunk about 5 beers.  J announces, 'Man, we're gonna snort some coke.' I'm a little nervous Ive never snorted coke and that is a definite step up in the drug chain, I feel the drug chain starts at pot and goes: pot-mush-ecstasy-DXM/acid-crystal meth-coke-heroin. With lots more in between.. Anyhow.. I was only at the acid stage and was taking a huge step into the world of heavy drugs. However... I'm bored, not invited to a party and feel like trying something new, feeling open-minded, happy, and experimental.</p><p>1:40  A car pulls up, we hop in, a guy hands us the coke and some pot.</p><p>2:00  J rails a line, his eyes glaze a bit. He says his throat hurts. I'm excited and rail 2 lines at once. My throat was burning so bad. It felt like Id swallowed battery acid, my eyes watered, and I got a weird feeling of disgust.</p><p>2:04  Wow, I lost all physical feeling in my body except for a slight discomfort in my throat. I feel like I am bullet-proof, I get a huge energy rush.</p><p>2:10  Walking very fast to Starbucks, we could run but we stop ourselves.</p><p>3:00  The speedy feeling starts to end, followed by a mushroom feeling. I notice with the coke that it pushed the mushroom feeling away.  I felt very fast, invincible, and pain-free, I noticed I enjoyed the trip if I was walking or moving fast, however I felt nauseous and disgusting when in a movie store or sitting for a moment.  J and I decide to rail the rest.</p><p>3:15  I rail another 2 lines, J's nose bleeds but we ignore that and he rails more.</p><p>3:30  It's not as intense this time, it is very controllable, my heart is beating fast, I feel fine, bullet-proof, paranoid, sketchy. But I'm having a lot of fun, this drug is very different to Pot, and Mush and ecstasy and hallucinogens. It isn't a funny drug really. It didn't make me giggle.  It gave me courage, strength, speed, and more. All in all it was a lot of fun.</p><p>4:15  those lines die out into a mushroom feeling which is a little bit empty.</p><p>Next 4 hours  Very empty feelings.</p><p>Next day  I wanted to do it again but firmly said no.</p><p>Be careful if you are doing cocaine. One time and I understand the addictive potential.</p>"
}
