{
 "title": "Dont Do This to Yourself",
 "author": "aHndz3",
 "citation": "   aHndz3. \"Dont Do This to Yourself: experience with  Smoking Blends (Mr. Nice Guy & Mary Joy) (ID 95963)\". Erowid.org. May 14, 2012. erowid.org/exp/95963",
 "substance": " Smoking Blends (Mr. Nice Guy & Mary Joy)",
 "bodyweight": "143 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 95963",
   "Gender: Female",
   " ",
   "Age at time of experience: 21",
   "Added: May 14, 2012",
   "Views: 4245",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have smoked spice for around a year and a half. For around 6 months I used to smoke it every day in large doses, but the last 10 months or so I only smoke it occasionally, that would be maybe 2 times a month. Although I do not suggest anyone should smoke spice, overall I like it. However, for some reason the 'Mary Joy' line makes me have very bad trips. Every single time I smoke it brings forth very bad feelings, which I will explain. I used to think it was because I associated Mary Joy with a negative feelings and that brought the bad trip, but it happens even when I do not know I am smoking it.</p><p>Today, I took a few hits of my friends joint, maybe 3. It was a new type of spice called Mr. Nice Guy Chrome, and it also had some Mary Joy Dead n Berried mixed in. I am fully convinced that it affects me differently than anyone else, especially since my friend could not stop laughing throughout my trip. </p><p>My trips on Mary Joy are always the same, but this stronger type almost killed me. We were in my friends car when the familiar feelings started coming. My heart was beating fast, but that was not what was worrying me. As my friend was driving, I felt that we were going to crash, I could see the accident happening so perfectly. I was terrified, but this has happened multiple times before so I tried to shut my eyes and listen to the music. This time it did not work. As she drove, I could feel how fast the car was going, each little turn made me feel like my head was going to explode. My window was slightly open and the wind blew so hard into the top of my head, it brought along this feeling of having my head smashed into the window. </p><p>I noticed my hands, they were so sweaty and cold. The other painful and familiar feelings came. I imagined being caught under the tires of the car when it was at full speed, I thought of a very sharp knife cutting right through my tear dot, and the left side of my brain right behind my ear started to hurt. It was like nails on a chalkboard inside my head. And I might have been imagining the pain, but I felt it in a very real way. I opened my eyes and I would see myself crashing. Usually I can calm myself down to know its the spice, but today the feeling was as intense I covered my face because I truly thought we'd crash. My head hurt so much, I kept saying, this is not okay! mostly to myself, since my friend was having the trip of her life. I was desperate I thought that as soon as this was cover Id go to a psychologist or someone who could help.</p><p>Eventually, as I knew (hoped) it would, the effects started wearing off. However, my brain felt exhausted, for the first time after smoking I was completely out of it. I felt like a zombie walking. I have researched Spice and I know what it is and I know how it works, but fuck me I can't find WHY it does that! Im starting to believe it must be something psychological, some component of this chemical must interact with a part of my brain related to painful and unwanted feelings. No other brand of spice does that to me. Even worse, I smoke weed very often, and after my first bad trip on spice, sometimes when I smoke weed, the same feelings will come, never as strong but still painful. </p><p>It was a very scary experience and it would be somewhat comforting to know I am not alone, even though I do not wish this unto anyone.</p>"
}
