{
 "title": "Stopped Cluster Headaches But ...",
 "author": "Exekiel",
 "citation": "Citation:   Exekiel. \"Stopped Cluster Headaches But ...: experience with Ibogaine (ID 95977)\". Erowid.org. Jun 11, 2012. erowid.org/exp/95977",
 "substance": "Ibogaine",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "1.25 g",
   "oral",
   "Ibogaine",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 95977",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Jun 11, 2012",
   "Views: 5383",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had originally read about ibogaine in terms of the possibility of self-exploration and enhancement from a transhumanist website in an article titled 'does superman really want to know himself?' about whether or not those who would physically improve themselves would dare face an honest examination of themselves brought on by the drug.\r\nI decided that was awesome, but I'd never try a drug for a reason like that. However, I also heard that it was a 1 time fix for cluster headaches that could cure them for very long periods of time, being a suffered to an extreme degree, the headaches had gotten so bad I had become desperate for a solution, but I would never do any drug on a regular basis, so this came as the perfect solution.\r\nI found a reputable source and they recommend this enormous/ridiculous dose, which tasted so bad as a pure powder I had to put it into capsules to take.\r\nIt was a pure form of Ibogaine HCL. I took it around 7pm on an empty stomach in capsules, and laid down in bed for the duration of the trip, except very difficult bathroom breaks. I was in a happy mind set and prepared for it, with my girlfriend by my side the entire time. I took dicyclomine, fiber, probiotics, melatonin, ginger, vitamin B daily at the time.\r\nThe trip started after about an hour as a gentle pulsating sound alternating between ears, and slowly visual artifacts (mostly numbers, like those from a clock) started to appear.\r\nOver time, my thoughts became less able to focus and my ability to carry a train of thought barely extended beyond a few words, but I was getting some interesting self exploration in, as well as exploring interesting concepts about life. The visual artifacts expanded and took up most of my vision, and the gentle pulsating sound was intense, but didn't interfere with what else I could hear.\r\nUp to this point, it was very enjoyable and interesting. However, around 7 hours after ingestion, the visuals had encompassed 100% of my vision and became overbearing, my thoughts had become completely and total inhibited, and my hearing almost nil. Even though it was dark, everything was bright to me. My body and mind seemed completely overwhelmed, and I vomited. Not much, as my stomach was empty, but I dry wretched for about an hour after that, and I was incredibly dizzy. \r\nAfter reaching the tipping point and wretching, I had regained some ability to understand what was up, but my thoughts were still relatively incohesive. I had taken the dose at around 7pm, and reached the tipping point around 1am. It wasn't until 7am that I was able to get out of bed, and then only enough to pee and get back, barely able to walk. I just wanted desperately for it to be over. Also, evidence points to the peaking event also containing a cardiac event that weakened my heart substantially, and it took me several weeks to get my strength up enough to feel comfortable walking up stairs again. \r\nFor 3 days I could barely stand and was too dizzy to do much of anything, I wasn't hungry enough to eat a serious meal for almost a week, and nothing particularly profound happened. In fact, it was terrifying how long the trip lasted and how invasive it was. Whenever it was dark I was stilling seeing trails of objects for almost a month, quite intensely, and I was worried about impacts on my long term well being. \r\nHowever, my terrible, life destroying cluster headaches had been gone until recently, almost a full 6 months. I was given a sedative in a hospital that I reacted very poorly too, and triggered a cluster headache, almost a month ago, and today was full of them for the first time since I took the ibogaine, and it is likely that today was a fluke of some kind. \r\nI highly recommend that you do not take such a high dose unless for opiate withdrawl, and in fact take less than you need. You might not get the full effect, but you don't need that much. Be very careful when taking it and make sure you don't have anything planned for a few days and don't have to drive at night for at least a couple of weeks.\r\nOverall, I would say the trip was bad, due to the cardiac episode, the days of debilitating dizziness, the weeks of visual artifacts, and the raw length of the trip, which even if it went well would not have been pleasant. \r\nBut a good part of it was fun, made me feel really good inside, reduced my need for sleep for about a week, and not only cured my cluster headaches but reduced my irritable bowel syndrome and made me just a bit healthier. Dicyclomine interaction was probably negative, and made things worse, as it blocks a certain neurotransmitter, which leads to negative effects on its own, without such a powerful drug involved.\r\nIf you are going to do this, be physically and mentally prepared for doing so. Be happy and ready to take it on, and have people around that are willing and able to help you live for days to come, and if possible do so inside a clinic with medical professionals that can help if something like a cardiac episode happens.\n\n\n"
}