{
 "title": "A Teaching of Time and Consciousness",
 "author": "satori",
 "citation": "   satori. \"A Teaching of Time and Consciousness: experience with Mushrooms & Cannabis (ID 9603)\". Erowid.org. Jun 29, 2004. erowid.org/exp/9603",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "3.5 g",
   "oral",
   "Mushrooms",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9603",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 29, 2004",
   "Views: 5119",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>It was a cool March evening and I had planned to eat some mushrooms with a friend and take a drive to my friend's pond out in the country.  My girlfriend was going to drive us since she wasn't going to trip. C (my friend) had already eaten a couple of grams before we picked him up.  I had just eaten my 3 and half grams in a bowl of spaghetti before we left to pick up C. As we headed out to T's pond, T didn't ever know we were on his land, I began to get antsy as I anticipated the coming experience. I have had much experience with mushrooms and never take them until a little voice inside me says it's time. </p><p>We pulled up to a gas station and I could feel the psilocybin entering my bloodstream.  My thighs began to slightly twitch, I often experience minor muscle spasms at the beginnings of hallucinogenic journeys.  With C already tripping and in fact he had already peaked but was still up there, I think he may have sped up the effects of my mushrooms.  I remember him sort of complaining about how he had given away the rest of his mushrooms and that he wanted to eat some more now but when he was peaking he felt so high and happy he was being generous with his little fun-guys. Busta Rhymes was on the radio as I waited for J (my girlfriend) to come out of the gas station, the music sounded very foreign, Busta Rhymes has a very unique style and it was remixed over a Drum n' Bass beat, and I was enjoying it very much, at that moment C and I noticed something at the same time, I looked back at him from the front seat and we both had enormous grins on our faces because of an individual we both saw outside the gas station. </p><p>It was a woman of extraodinary girth but she didn't seem fat she was just very wide to almost comic-like proportions, It wasn't that we were making fun of her appearance in any malicious way but perhaps the mushrooms exaggerated her appearance to a very surreal almost nonbelievable way and she was also very short for her mass which probably added to the oddness of it all. I have never seen anyone that looked that surreal ever. So we headed out to the country side.   We arrived at the desired spot, in a field next to a pond with a sand beach and willow tree hanging over the beach.  We got out of our van and smoked a couple of bowls of very potent cannabis it was very cold outside so we didn't stand around too long but I enjoyed the full moon and the reflections on the pond for a few moments and stood awing at the purple night sky, then I returned to the van.  </p><p>After talking a little bit about I cant' remember but I know it was fascinating at the time because C and i came to a point in the conversation that I had remembered having before, we were listening to a bjork song and the lines in the song were about throwing things off a cliff and hearing the clash into the rocks below and C says 'This song always reminds me of someone taking a big shit' and think to myself why? because of things clashing into rocks at the bottom of a cliff then C says because of the video C2YK where they slip in a scene of someone taking a shit and then that bjork song comes on. But what fascinated me was that I had the exact same thoughts and in the exact same order as last time C said to me that this bjork song reminds him of someone taking a shit. Probably not so fascinating to you so I'll get on with the teaching. Heading back into town on the highway is when the mushroom entity really started talking to me. I was listening to an electronica song on the radio that had a very 'walky' repetetive rhythm to it with words 'and again, and again' being spoken over and over again and the song seemed to go in a circle sort of. </p><p>So while this song was playing I was peaking and my thoughts were going in circles I was in an extremely strange state of mind I had the notion of trying to catch my thoughts or try to explain why each thought occured for what purpose and I would try to think about nothing which was impossible at the time so I went around in circles inside my head my thoughts chased each other around in a never ending circular cycle.  So basicly I was trying to get ahead of my thoughts and be in the actual moment, but so long as I was trying to catch the moment with my conscience thought, it had already passed and I could never catch up because the synapse in my brain which causes a thought is still delayed a fraction of a fraction of a second.  So the mushroom was telling me this is time, we bounce along following each moment with our thoughts, the mushroom took me by the hand and said let's do this together and and I experienced each moment and watched it as it passed by and we bounced along together always one step behind. He told me 'this is how we experience time where I come from, and I could experience time this way because of the symbiosis I had with the fungis'....................</p><p>my thoughts that evening traveled a million different other paths which the mushroom led me through showing me the sacredness and splendidness of nature and this planet with its richly developed organic lifeforms from a tree to the human being to the mushroom and all other natural forms of life.</p><p>I learned a great deal from this experience and I encourage others to experiment with this wonderful gift of nature and one will know when the right time for that is if one listens to intuition.  Mushrooms have an ability to blossom one's spiritual growth and can vastly expand one's knowledge of the universe and this planet we call Earth.</p>"
}
