{
 "title": "Lethal Interaction?",
 "author": "Sad Friend",
 "citation": "   Sad Friend. \"Lethal Interaction?: experience with 5-MeO-DiPT, Ecstasy, Alprazolam (ID 9608)\". Erowid.org. Sep 25, 2001. erowid.org/exp/9608",
 "substance": "5-MeO-DiPT, Ecstasy, Alprazolam",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "oral",
   "5-MeO-DiPT",
   " ",
   "6 tablets",
   "oral",
   "MDMA",
   " ",
   "15 tablets",
   "oral",
   "Pharms - Alprazolam"
  ]
 ],
 "footer": [
  [
   "2000",
   "ID: 9608",
   "Male",
   " ",
   "Not Given",
   "Sep 25, 2001",
   "Views: 28618",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nErowid Note:  Unconfirmed Death Report.</p><p>This report of a death associated with 5-MeO-DiPT, Ecstasy, and Xanax was submitted with no verifiable details, no contact information, and no way to confirm any element of it.  Erowid is choosing to publish this report to invite public comment and to allow anyone who knows about this event to submit details which we can verify.</p><p>Neither this report nor any report of a death should be considered reliable -- nor much weight given to it -- without details that can be verified through hospitals, police reports, family members, or news reports.  If you have information about this or other deaths directly resulting from the use of any psychoactive substance we cover, please let us know</p><p>\nA old friend died some time ago of an overdose of 5-MeO-DiPT, Ecstacy, and Xanax. I am not sure what the listed cause of death was, but he died of a brain hemorrhage and massive internal bleeding. I hope this serves as a warning, and also provides valuable information about what not to mix together. I would urge care when combining these drugs, even in smaller quantities, particularly 5-MeO-DiPT, which has little known about potentially lethal interactions. </p><p>He took about 50 mg of 5-MeO-DiPT orally, 6 or so pills of ecstacy, and around 15 Xanax (I am unsure of the dosage of each pill). Not long afterwards, he started bleeding out of his ears and nose, and the capillaries in his eyes burst. He died of massive brain hemorrhaging before he could be taken to the hospital.</p><p>Individually, it seems to me that none of these drugs would be lethal.  I think taking 6 pills of ecstacy is acceptably safe in a moderate environment (he was in a home). 7.5 to 15 mg of Xanax is quite a sizable dose, but not enough to overdose according to the toxicity information (although some information from people who have taken larger doses would be helpful). Erowid's reports on 5-MeO-DiPT suggest a dose up to 30 mg, so he was significantly above this level but I am unsure if 50 mg would be sufficient to kill someone alone. There is another report on Erowid of someone combining 50 mg of 5-MeO-DiPT with 50 mg of AMT with negative consequences. While one person overdosed and needed medical attention from taking 50 mg, another person who took the same dose seemed fine. Significantly, the onset of the problems was not immediate, but hours after the drug was taken, and the symptoms were not nearly as severe. This leads me to suspect that some sort of interaction was the cause of the hemorrhage. </p><p>Various reports on combining Xanax with alcohol indicate that people have died from alcohol poisoning after drinking drastically less than would normally kill someone, which might suggest that Xanax somehow makes 5-MeO-DiPT lethal at a lower dose than normally would be expected.</p>"
}
