{
 "title": "M-Hole in the Hospital",
 "author": "Soluiminia",
 "citation": "   Soluiminia. \"M-Hole in the Hospital: experience with Methoxetamine  (ID 96086)\". Erowid.org. Aug 8, 2012. erowid.org/exp/96086",
 "substance": "Methoxetamine ",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96086",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Aug 8, 2012",
   "Views: 3344",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nOn this particular day I wasn't even planning dosing any MXE, I was planning on saving it for mixing it with other psychedelics since I've found it greatly increases my CEV's. It was storming pretty hard outside and the power had just gone out due to a tree falling on the power lines. With my computer battery just running out and with absolutely nothing to do until the power comes back on I figured a little MXE wouldn't hurt. I got a flash light and dumped a small pile onto my table. Due to the darkness I couldn't tell how much I really poured out. But nonetheless I got it into a line and snorted it. \r\nAt this point it had stopped raining and I figured I would go outside and walk around a bit until I started to feel it. After about 10min I decided it would be a good idea to go inside before it hit me too hard. This is where my memory starts to get a bit fuzzy. I remember going down into my room and laying down with my eyes closed. Then after that I have no idea how much time passed but I'm sitting at the end of my stairs thinking about 2012 and how the world was going to end. At about this time my dad came inside and they had just finished fixing the power lines. He noticed that I was obviously on something and told me to get into the car. After I struggled to put my shoes I stumbled to car and off we went.\r\nI wondered where we were going but didn't question it to much. Once we got to there I still hadn't realized where I was at yet. He half carried me inside and I  remember a nurse leading me into a small room and taking my blood pressure. The next thing I remember happening is that I'm being wheeled around on a stretcher and at this point I still don't know where I'm at but know something is wrong is start becoming worried. The next thing I know I'm somewhere in the basement of the hospital and they tell me to into some big looking machine thing. I think they were taking a cat scan but I don't remember actually getting inside it. \r\nAfter this the next thing I remember is being inside an emergency room and looking all around just realizing that I'm in the hospital. This is were I start becoming very worried. I thought that I had just woken up from a coma and that my entire life was just a dream and it never really happened. I also thought the sole reason I was woken up was so that I could spend a final few minutes with my family before I died since my parents and sister were crowded around me all sad and distressed looks on their faces. My mom told me that I kept asking her if I was going to die and kept telling her that I didn't want to die yet. After that I started to come down and began to really grasp what was going on. At this point it gets pretty uneventful. I pretty much just joke around since I'm still pretty fucked up from the MXE and ask questions about what happened. \r\n[Reported Dose Estimate: 100 mgs]\n\n\n"
}
