{
 "title": "Better Than Methylphenidate",
 "author": "MooDog",
 "citation": "Citation:   MooDog. \"Better Than Methylphenidate: experience with Ethylphenidate (ID 96095)\". Erowid.org. May 27, 2012. erowid.org/exp/96095",
 "substance": "Ethylphenidate",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Ethylphenidate",
   "(powder / crystals)",
   " ",
   "20 mg",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)",
   " ",
   "20 mg",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)",
   " ",
   "1 mg",
   "insufflated",
   "Etizolam",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96095",
   "Gender: Male",
   " ",
   "Age at time of experience: 25",
   "Added: May 27, 2012",
   "Views: 11385",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have previous experience with methylphenidate (generic/instant release) and found that it was an excellent mood enhancer and short-term study aid. In the past I have combined methylphenidate with alcohol and found the combination to be significantly more euphoric than methylphenidate alone. Given these good experiences, I was excited when I found ethylphenidate available online from a reputable supplier. \r\nBefore taking a serious dose I first conducted an allergy test (est. consumption 1 - 5 mg). When no ill effects where experienced I proceeded to take the equivalent of a 20 mg oral dose. After about twenty minutes I began to feel focused and alert. At this point I decided to take a trip to the liquor store to get some red wine for later in the evening. I drove with the windows open and the breeze felt much better than normal - almost enough to give me pleasant chills but not quite. I felt aware and cognizant of all other vehicles on all sides of my ride. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] \r\nAt the liquor store I found myself fluidly making small talk with the cashier as I paid (a rare feat for me. After an enjoyable ride home the first dose was wearing off and I decided to try insufflation. I lined up about 20 mg of the powder and proceeded to insufflate with the rolled up receipt from the liquor store. It kicked in nearly instantly with a mild burning sensation in the nostrils and a medicine-tasting drip in the throat. Whereas an oral dose was like methylphenidate but shorter-lived and more euphoric, the insufflated dose felt more like low quality cocaine than anything else. I felt instant dopaminergic stimulation and an unbearable drive to play Rocksmith on the PS3.\r\nAfter getting high scores in a number of songs and beating previous records and starting to feel a comedown I decided to have another line. The effects were not diminished in comparison to the first line. After that dose started to wear off I had a glass of wine and a 1 mg etizolam. This successfully combatted the effects of the crash and allowed me to fall asleep easily. All in all, I found ethylphenidate to be an excellent and well-tolerated stimulant.\n\n\n"
}