{
 "title": "Twitchy Euphoria and a Great Stimulant",
 "author": "Sinister",
 "citation": "   Sinister. \"Twitchy Euphoria and a Great Stimulant: experience with 25I-NBOMe (ID 96136)\". Erowid.org. Jun 11, 2012. erowid.org/exp/96136",
 "substance": "25I-NBOMe",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "buccal",
   "2C-I-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96136",
   "Male",
   " ",
   "Age at time of experience: 25",
   "Jun 11, 2012",
   "Views: 3522",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Long time reader, first time author. I have a very large history with recreational drug use, including, but not limited to: Marijuana, Meth, Coke, Mushrooms, Molly, XTC, Heroin, Mephedrone, MDPV, and some others. I smoke a pack per day, and drink lots of coffee in the mornings. On this day, I had smoked a little marijuana, and drank about 4 beers within 6 hours previous to taking the drug. Although I'm writing this review a few days after the experience, I remember it in depth, and I should also mention I'm currently under the influence of MDPV. This story is my 2nd experience with 25i-NBOMe. </p><p>I purchased 20 tabs of the strange product from an online market (advertised to be 550 mic/tab), knowing very little about it, but my curiosity forces me try every mind-altering substance I come across. I assumed it would be more of a psychedelic than a stimulant, but I was very wrong. Had I known this earlier, the product wouldn't have sat in my fridge 2 weeks before trying it.</p><p>[T-0:45] I quit drinking beer and open an energy drink.</p><p>[T+0:00] It's about 9pm and I want to stay up for the opening of Diablo III. Having a stimulating experience the first time, I figure this would be a great time to have another go at it. I dry out my upper gum with a paper towel and lightly scratch my gum with a fingernail to increase absorption. I carefully remove the 2 thick paper tabs from the tinfoil and place them in my gum.</p><p>[T+0:30] I begin to taste the bitter chemical as my saliva finds it's way to the tabs. I'm curious if it's a placebo effect at this point, but I just feel 'different'.</p><p>[T+1:00] Things are definitely changing. I have a grin that cannot be removed from my face, and I'm feeling very chatty, so I chit-chat with the g/f for awhile, while remaining very focused on the television show we're watching. </p><p>[T+1:45] Colors are very vibrant and the grin remains. Around this time, I'm feeling a bit jittery, but comfortable with it. It can only be compared to a mixture of Xanax and Adderall. This was the peak of my experience, but it persisted throughout the night. The g/f has gone to bed.</p><p>[T+3:00] Still feeling chatty, I have an abnormal amount of FaceBook chat windows open, as I impatiently wait for the Diablo III servers to go live. Colors still very vibrant. </p><p>[T+3:30] It's dark outside, and I'm smoking a cigarette. My peripheral vision is getting creative. Objects are appearing to move in the distance, trees are waving in a non-existent breeze which I found rather entertaining.</p><p>[T+4:01] It's game time! ...but the servers are flooded as 3.4 million people attempt to log in simultaneously. I'm persistent in my mission to play this game during it's infamous grand-opening. I feel a little A.D.H.D. at this time, but it doesn't compromise my persistence.</p><p>[T+4:50] I've successfully logged into Diablo III and find the game very amusing. The detail is much greater than while sober, and I'm drawn in by the story line which isn't something I typically take interest in.</p><p>[T+7:00] I notice it's been a very long time since I've had a cigarette, so I go outside once again and the visual effects have increased, most likely due to sleep deprivation. I have a little paranoia at this time, simply fearing the idea of fear itself. I smoke the cigarette quickly and run back inside, returning to the game.</p><p>[T+13:00] Still not tired, sipping a 2nd energy drink, I stop playing my game to watch TV with the g/f as we do every morning before she heads to work. I find little amusement in the show, which was hilarious the night before. Feeling gross around this time, as if I had been up on crystal meth all night.</p><p>[T+15:00] The g/f has gone to work, and I return to the game, almost as if I've entered a psychotic obsession with it. Nothing else is entertaining. I'm barely even enjoying the game, but it's the only thing I'm capable of doing.</p><p>[T+16:30] Slowly eating a muffin and sipping coffee, I acknowledge this is the only sustenance I've consumed for over 20 hours.  </p><p>[T+18:00] I decide to take a break. A sudden sexual urge flushes through me, so I wank one out, and it was one of the most amazing orgasms I've had. The euphoric rush gave me enough energy to take a quick shower.</p><p>[T+18:30] By this point, I was absolutely exhausted. I turn on the most recent episode of Game of Thrones, but only made it approximately 10 minutes in before passing out. </p><p>[T+20:00] Waking up after a 90 minute power nap, I'm very groggy, but can't go back to sleep. Back to gaming I suppose...</p><p>Ending thoughts: This drug could become a habitual ritual for me. If you like Meth, Adderall, or other stimulants, I highly recommend this substance, but know your limits! Next time, I may try 4 hits (2200 ug) in attempt to bring out more of the psychedelic effects. If I survive to share my experience, you just might find another publishing. Thanks for reading!</p>"
}
