{
 "title": "Finding Peace After a Busy Day",
 "author": "Tomtom73",
 "citation": "   Tomtom73. \"Finding Peace After a Busy Day: experience with 2C-C (ID 96169)\". Erowid.org. Jun 22, 2012. erowid.org/exp/96169",
 "substance": "2C-C",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 mg",
   "insufflated",
   "2C-C",
   "(powder / crystals)",
   "  T+ 0:28",
   "5 mg",
   "insufflated",
   "2C-C",
   "(powder / crystals)",
   "  T+ 0:32",
   "5 mg",
   "insufflated",
   "2C-C",
   "(powder / crystals)",
   "  T+ 0:35",
   "5 mg",
   "insufflated",
   "2C-C",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96169",
   "Gender: Male",
   " ",
   "Age at time of experience: 40",
   "Added: Jun 22, 2012",
   "Views: 2195",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHi there, this is my first trip report here, so I hope, it's useful for someone. Ive got a lot more, if you like 'em.\r\n2C-C\r\nsetting: at home, after a quite demanding working day.\r\nset: curious, no big expectations\r\nT=0.00 1mg insufflated (allergy test) fine white sparkling powder, bitter and harsh chemical taste\r\nT=0.28 5mg insufflated - burns like hell, Im coughing. \r\nT=0.32 5mg insufflated - still burns, other side of nose.\r\nT=0.35 5mg insufflated - palms begin to sweat, Im feeling something undistinguishable coming slowly.\r\nT=0.50 whoaaah :-) this feels very much like MDMA.  My throat does really ache. I have to rinse it with sea-salt nose spray. washing my face, water feels 'sloshy'. optics are slow, peripheral vision is more colorful, draws things like chewing gum.\r\nT=0.55 watching a short porno. this is too real. coming up was with a little body load, but not too demanding.\r\nT=1.00 suddenly I have a great clarity in my head. now Im there! :-)\r\nT=1.05 sex - I realize, that I have to look at each moment individually, no purpose must influence my feeling. purpose and sensitivity don't fit together. I can watch myself and still feel the sensations. orgasm is incredible and sparkles colorful like 'disco'. extremely smooth and warm and soft.\r\nT=1.15 Im feeling a little cold, Ive to get a jacket, although it's 22°c. writing works astonishingly well. my fingers feel a little itchy.\r\nT=1.17 my geometrical reception is very distorted. all lines and angles are bended. I feel comfortable, haven't been in such a state of mind for a very long time. it's a little bit like coming home (had a very psychedelic time back then).\r\nT=1.18 have to burp from all that sparkling water. Im afraid, if someone was here now, I'd have a big urge to talk to him/her quite a lot.\r\nT=1.20 going outside and lay down in my sun-chair. the sky is dark-violet and has an unusual depth. the trees seem to bend into an additional dimension. Im aware, that those visuals come from 2c-c. a friendly drug. I feel a bit broken-hearted, although my girlfriend will soon be back.\r\nT=1.22 closing my eyes and listen to 'cafe del mar'. music is very pleasant, with closed eyes I can see and feel the music a little, but just marginally. A higher dose will surely enhance those synesthetics.  time seems to run slower, although everything feels fast.\r\nT=1.30 having a shower, the sensation of water is overwhelming, very euphoric feeling. \r\nbadly, I feel, that Im already over the plateau and the effects start to fade slowly.\r\nT=1.50 Ive more and more 'everday thinking' in my head.\r\nT=2.00 sex. the feeling is not such empathic as before, but still deeper, more directly. orgasm is very intensive, it literally sucks my balls. ;-)\r\nT=2.15 eating a water melon. Im not hungry, anyway I feel, how my body draws out the water and the nutrients.\r\nT=2.20 drinking a magnesia/calcium drink and a multi-vitamine tablet, to prevent a bad coming down or hang-over.\r\nT=2.25 watching national geographic channel. colors are still very intensive, hd looks like ultra-hd. the geometrical distortions are gone. moving around feels good.\r\nT=2.30 light dragging pain in my head. still have that light-footed feeling of 'swaying'\r\nT=4.30 tired and somhow sedated\r\nT=5.30 finding sleep is no problem\r\nNext day:\r\nno hang-over, light dragging pain in my head, but could also come from the air condition in the airplane (have been abroad today).\r\nSummary:\r\ngreat MDMA-like psychedelic, sex is intensive and 'disco' like, very empathogenic, a bit sedadative. nice visuals (colors, morphing, 'hi-res'), music is great, feeling of lightness, not much body load.\n\n\n"
}
