{
 "title": "I Was a Screensaver",
 "author": "Reward50p",
 "citation": "   Reward50p. \"I Was a Screensaver: experience with Methoxetamine (ID 96197)\". Erowid.org. Jun 19, 2012. erowid.org/exp/96197",
 "substance": "Methoxetamine",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE:",
   "250 mg",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96197",
   "Gender: Female",
   " ",
   "Age at time of experience: 24",
   "Added: Jun 19, 2012",
   "Views: 12574",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: 250 mgs of methoxetamine is considered an extremely high dose, see methoxetamine Dose Chart] </p><p>I tried MXE for the first time a couple of months ago.  Spurred on by the news that a ban in the UK was becoming effective, I went online to a reputable source and bought half a gram.  </p><p>Ive taken ketamine quite a lot in the past and was very intrigued by this methoexetamine substance.  Having read up extensively online, and without scales, I started off with a tentative tiny amount sublingually.  I felt no effects.  After half an hour I decided to try and snort some bumps as I wasnt confident I was doing the under the tongue method effectively.  </p><p>Over the next couple of hours I felt vague feelings of maybe being on something but nothing discernible, certainly nothing like the experience I expected from research.  I read a few chapters of The Hound of the Baskervilles with no trouble.  Somewhat frustrated, I moved on to mid-sized lines.  </p><p>Fairly suddenly, things started to change.  I first noticed the effects when I went to give my girlfriend a hug.  She was sitting on a wicker sofa and as I looked at the interweaving straw, its hard to explain, but I kind of got stuck in the pattern.   I then became fascinated by my hands, it almost freaked me out, I felt disassociated but my perceptions were accurate.  Walking around felt bouncy and new.  I was consciously taking a lot of care with everything I did because it was my first time with this drug.  This stage was basically like ketamine but without the complete body wipe out.  It was kind of like the come on of ketamine where things feel separated/different/new but it lasted for a long time and wasnt followed by a body paralysis.  </p><p>I do remember trying to explain things to my girlfriend and being completely lost for words, similar to ketamine when you cant speak.  My girlfriend was going to bed and staying up alone didnt appeal so I tanned a couple more lines, caution out the window, and headed upstairs.</p><p>Laying down in bed the real, unique, effects started.  Again, it is hard to explain.  I felt that kind of spinning/rotating on the edge of oblivion like you get in a k-hole except it was a more active/dimensional/visual experience.  As I was spinning on the edge I was completely trapped in an endlessly turning visual distortion.  I thought I was a small piece in an optical illusion, the building block of a far greater, ever changing and moving, puzzle.  The best way I can describe it is I felt like I was a pixel in a trippy screensaver that keeps looping.  Each time the loop came to an end I felt I was going to go over the edge and maybe die, then I was brought back and the process repeated.  </p><p>I had some connection to reality throughout and though I had moments when I thought maybe Im going to die I was always fairly sure it would be ok.  My experiences with ket helped me and I convinced myself that I would be ok, and I was.  </p><p>At other times I felt like a cell or a building block of something greater.  My bed felt endless and I was grateful I had a loving partner beside me.  Though she felt a world away, when I put my hand on her skin I felt a transfer of energy and a feeling of being one.  After enjoying the crazy visuals of the m-hole I fell asleep with no trouble.  I dont remember falling asleep anyway, so it cant have been a struggle.</p><p>The next day I basically felt fine.  Memory was a little impaired and confused.  For example, when I went to find an item that I definitely knew the place of yesterday, I would end up looking in the wrong places, places the item had been months ago.  This did my head in a bit and led me to decide that, although I like the craziness of MXE, the jumbled up effects on the brain that lasts a few days means that I will only take this when I dont need my brain in the near future i.e. after exams.  </p><p>A week later I bought accurate scales and worked out I had in total taken 250mg-260mg over a few hours.  For me, it took quite a lot to get me to the stage I wanted to be.  After I was there, I took some more.  I was fine, I had fun, but I could have easily freaked out.  Its fun but not very social.  Watching a film or going for a walk etc. is nice but to get the m-hole it took quite a bit and required a commitment, because I was there for a while.</p>"
}
