{
 "title": "Visitation from Beyond",
 "author": "AnneX",
 "citation": "   AnneX. \"Visitation from Beyond: experience with 5-MeO-DMT (ID 96190)\". Erowid.org. Jun 22, 2012. erowid.org/exp/96190",
 "substance": "5-MeO-DMT",
 "bodyweight": "156 lb",
 "header": [
  [
   "DOSE:",
   "8 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96190",
   "Male",
   " ",
   "21",
   "Jun 22, 2012",
   "Views: 2820",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was at my friend's, or caretaker if you prefer, house, we shall call him John. John is a more frequent user than I, in fact I am and have always been seemingly his private chemist for things of this nature. I decided before that I wished to try my creation akin to a baker trying his baking. </p><p>We setup the room so that nothing that could be harmful or disrupting was near the couch and he would grab the lighter and pipe after I had taken my breath with the substance as I often do for him. He stood nearby and had a pad of paper and a pen to document the experience from his perspective as often is done in reverse. I will offer my perspective as he wrote little as I did little activity but will interject his comments at the appropriate times.</p><p>After smoking, but before the collapse of my consciousness of the reality around me I instructed that he note the foul taste that I tasted. I have approximately half of the tastebuds of a normal human due to burn injuries from my childhood, but this was a strong taste, I am understandably unable to compare.</p><p>After telling John to note the taste I had completed sitting down on his couch, reality as I saw began to diffuse away similar to how a drop of blood diffuses its colour when dropped into distilled water. The colours I saw were very similar to the room, a Neutral Beige, a Pine needle green, a sky blue and an Apple red, they kept diffusing amongst each other over and over. Even writing this gives no justice the visual that I experiences nor do I think I could ever find humanly diction that could describe this. </p><p>For what felt like 5 minutes I basked in the visuals, stunned like a young child seeing christmas lights covering a whole house, but then two forms approached through the visual and distorted them such that I could sense their presence, without seeing them, akin to finding a black hole or an exoplanet without being able to visually see them through the distortion of gravity.</p><p>These forms communicated with me in a way I would consider telepathy, however without actually observing them I am unsure as to how to describe this communication. They seemed to be able to search my memory like it there was a function to do so and chose to represent themselves as Amonkira and Kalahira which are two fictional gods of the drell people in the Mass Effect universe. They seemed to understand my nature and comforted me as they understood the effect was difficult to comprehend for one such as me implying that I am human. </p><p>They informed to look at this, and the diffusing colours parted in the middle in what seemed to be the triple circle inwards on a dart board, and I saw a what seemed to a map edition of Orion, it showed all the stars in great detail, I thought that it looked like Orion and they confirmed the thought that was in my head. The circle then moved slowly towards the innards of Gemini (John noted here that I raised my head up and to the left corrisponding with the direction of Gemini in proximity to Orion), and zoomed in, this was a disturbing zoom in that it felt as though I travelled from a far distance away to an exceptional close up. It had zoomed in on a particular star which I cannot name and I was able to see the planetary system that had surrounded those stars, but one planet was highlighted in particular which was the second one from the star and it changed from its color to the same pine green diffusion color. They then transmitted the word Destiny and I wondered what its coordinates in the sky would be and we rocketed back to Orion. (At this point my head abruptly snapped back to its original position) Two stars from the belt and Betelguese an unknown purple light in the middle of the three all had solid lines form around them. I was unaware of what this meant and the thought they transcribed was arrow.</p><p>The circle then faded and they wished to talk on more personal issues, but did this by transmitting 'You'. I will neglect to discuss the personal part of this experience as much of it is contextual and very difficult to convey through words without going into my personal life that I wish to remain personal other than this short statement of how they felt my Spirit was strong and that the negative experiences I had had made this so.</p><p>After the discussion which felt like it lasted hours, I felt their presences start to dwindle and I thanked them and wondered if they wanted prayer, their leaving response was to not pray as they do not wish for it, but to be thankful.</p><p>Upon coming back to reality the colors of the room seem to diffuse less and less, until it got to the point where when I focused my vision reality was all I saw. Eventually I could move my body again and it was an odd feeling as though I had just remembered how to use them after forgetting. The period between regaining semi consciousness and regaining mobility was about 10 seconds. Objects still diffused their color slightly but I felt alright enough to stand so I stood up. John asked if I was alright and I responded that I needed the pen and paper, what I could recall from the experience was starting to dwindle and this story is what I wrote down but It feels incomplete. I then drank some water and felt mentally exhausted. The time between the beginning and then in reality was actually about 35 minutes, but it felt like it was a week. After about 2 hours I had no more diffusing colors, I decided to watch TV in the interim period and noted how where I focused didn't have the diffusion but the other part of my vision did. </p><p>Once the diffusion stopped I decided to go home, I spoke to my then girlfriend about the incident and she was fascinated by it and at one point laughed and remarked about how she should be comforting me but was so fascinated. After going to sleep I had a dream that consisted of the Vision of Orion with the lines and the zoom in on the star in Gemini, and the parting statement of the two entities.</p>"
}
