{
 "title": "Colored Filter With Heavy Time Dilation",
 "author": "shuddupayoface",
 "citation": "   shuddupayoface. \"Colored Filter With Heavy Time Dilation: experience with DOB (ID 96256)\". Erowid.org. May 31, 2012. erowid.org/exp/96256",
 "substance": "DOB",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "4 hits",
   "oral",
   "DOB",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96256",
   "Male",
   " ",
   "21",
   "May 31, 2012",
   "Views: 3100",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: This report is marked as a DOB report, but readers should be aware there are aspects of it that suggest the identification is speculative.]  </p><p>This is an account of my first (and it wont be my last) experience with DOB. I am writing this the morning after my trip.</p><p>At approximately 12:15pm I ingested 3 blotter tabs of what I had thought was LSD just up to the point of ingestion, when I found out it was in fact most likely DOB. I did some quick and not very thorough research on DOB and found it to be pretty similar to LSD and was not worried. At 12:30pm, I swallowed the tabs. My mouth became numb like I had an anesthetic in place, yet had a very metallically and bitter taste, which lasted for approximately 45 minutes.</p><p>The setting: Js apartment. J is tripping for his first time and takes 2 hits. C stops by and hangs out for about 2.5 hours and smokes cannabis intermittently for the whole 2.5 hours. C is the one who told me is was most likely DOB as he is pretty versed in hallucinogens. We are watching Van Wilder on Comedy Central until 2:30pm.</p><p>A little about me: I am a 21 year old university student who has taken LSD once before, is pretty familiar with cannabis, has smoked Spice and K2 once each, and is a regular consumer of alcohol.</p><p>T 0:30  First effects are felt. There is a slight discomfort in my stomach, but nothing to worry about. I hadnt eaten anything since approximately 3pm the day before, so I know there is nothing in my stomach to really get upset. I am beginning to see things with a green and red aura about them. Not quite a +1 yet, but I can sense a strong trip is coming very soon.</p><p>T 1:00  I am correct, the strong trip is here. It came on much quicker than what I had read about DOB, so I confirm with J to see if he is tripping yet, to which he says not really at all, leaving me to believe that I just reacted quicker given my empty stomach. I am losing concentration on the movie and looking back, I couldnt tell you what happened in it even though I sat and watched the entire thing. I was so transfixed on what my mind was seeing. By now, objects didnt just have the red and green aura. My vision became overlaid with red and green and some blue lines. Kind of like a watermark or a filter. I could still see everything in the real world, but through this filter. These lines would morph around characters in the movie based on the mood and attitude of the character for a given scene. Tracers are very noticeable, but only for about 10 minutes.</p><p>T 1:30  Time has come to a crawl. I am sitting on the couch, in a different state; a different mind. I am at about a +3 right now. I begin to see what looks like a black hole. Then another black hole, and another. They are eating each other! I watch in amazement as black hole after black hole folds in on each other. While this keeps happening, I start to also see space-time. Very quickly space-time steps in and eats the black holes! I cant believe what I had just witnessed, time closing in on itself! This must be the end of life. Once you have seen this, there is nothing left that could impress you or make an impact on you. I am very grateful to have been given this experience and wish to thank someone. I am not religious; I dont believe in a god, but I also dont not believe in a god, I just dont really care. But I desperately wish to thank someone for sharing the end of life with me! Oh well, that feeling passes and I come out of the trance. I just lived and witnessed infinity lifetimes. Surely it has been an hour or more. Nope, 2 minutes! Man, how much of this stuff did I take? Thats right, 3 hits, only one more than J, so why isnt he seeing what I am? Dont worry, he will have his turn.</p><p>After that experience, I get up to go pee. I am standing over the toilet for what must be a good 5 minutes (which in reality was about 5 seconds). I get lost in the bathroom. I begin to pee. Wait, no I dont. Why cant I pee? Something is preventing me from peeing. I fight this force for a moment until I come out victorious and pee. This has to be the greatest piss I have ever taken. I hear some noise coming from t living room and realize E must finally be here. E has been at the river all morning and said he would stop by between 2 and 3pm. I quickly hurry up to see him, only to realize he is not there and J and C are still just sitting in chairs and relaxing. Total time gone and spent in the bathroom: maybe 1 minute.</p><p>T 1:45  I sit back down on the futon and resume watching the movie. I talk to C for a little bit about different drugs and tell him if he ever gets a hold of 2cb or 2ct7 to give me a call.</p><p>I then retreat to some self-reflection, but still in the living room with J and C. I get a feeling of sadness. I am not sure about what or why, but it is definitely there. I then pinpoint the feeling, it is loneliness. But why? I am with friends and will be all summer. Not immediate loneliness, but overall, life-long loneliness. Again, why? Eventually I remind myself of what I had watched earlier in the day, The Life of Brian. Always look on the bright side of life! This cheers me up and I come out of that sad state.</p><p>T 2:00  Still very visually hallucinating. It has become apparent to me that it is like an ice-box in that apartment, so I step outside to the balcony for a while. It is hot outside, but I dont mind. I watch the trees breathe and the cars change colors. I can feel the heat beating into my back. I dont think about anything, I am just there. Eventually I realize that I am still outside and once again, I realize I have been out there for way to long and go back inside. And once again, it has only been about 3 minutes.</p><p>When I go back inside, I enter into one more trance-like state, but cannot remember anything about it to this point. I dont know if it was beautiful, scary, disturbing, enlightening, or what. All I remember is coming out of it when I see C pick up his things to leave. He mentions cooking at his place tonight and told us we should stop by if we want. Right as he leaves, J calls E once more to see where he is. Turns out he is right out the door and basically entered right after C left. This amused me, as it is like all sitcoms. You dont want too much going on in the scene, so you have the characters finish their conversation, and then magically right as they leave, someone else walks in. Am I in a sitcom?</p><p>T 2:45  E has been drinking all morning, but has sobered up enough to drive me and J around. Its a scorcher, so we head to a swimming pool at a nearby apartment complex. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] We get to the pool and find a plethora of people, this makes both Jason and me uncomfortable, so we head across the street to a different pool. Same situation. However, during that walk, we do a time dilation test. E times 30 seconds and J and I are supposed to tell him when we think 30 seconds is up. I yell stop! 16 seconds. J keeps going. He yells stop, 26 seconds! He was so close, but those 10 seconds between us felt like 10 minutes. We then head back to the first pool and walk through the gate this time. We turn the corner and there is another section that was hid from us that has even more people, J and I keep walking. E is not pleased with us, as he just wants to swim and there were about 90% girls there. We then walk back to his car and relax there for a few minutes.  E tries to explain to us that any pool we go to this day will be full of people. Eventually we compromise and head out to get milkshakes.</p><p>T 3:30  By the time we get milkshake we are close to my place. And I convince E and J to just go to my places pool, where I know it will be less crowded. They oblige and drive to my place, but then, I am confused. Why did they drive to my place? It doesnt have a pool! I tell them this and E gets visibly angry while J just laughs at how stupid I could be. I then tell them the pool is at a different apartment complex, where my leasing office is. I had somehow realized that all people and things are connected and just assumed they would know where it was. I begin to wonder if E is actually mad, or just annoyed at that statement. He knows the state I am in, oh well, the next time I see him, we will all have a laugh about it. We eventually get to the pool and relax. It is all grad students and E makes a comment about how lame it is. I dont see what the big deal is, as grad students are typically much more laid back and not loud or obnoxious. E eventually sees this and is fine. We sit there for a while and eventually I just want to go on a walk. I go to the gate to leave, but Ill be damned, I cant figure out how to open the thing. I quickly give up and sit down in a chair next to it, so as to not draw too much attention to myself, though Im sure sitting there did that anyways. I relax there and actually start to feel really good. Eventually some girls leave and I sneak out behind them. Looking back, I must have looked like a complete moron at that pool.</p><p>T 3:45  I begin my walk. Campus is about a 90 second car ride from that pool, but I walk it and make it there in about 25 minutes. The entire walk, I start to sweat profusely and am sure I am extremely dehydrated. I decide to make the student center my destination, as I know it will be open and I can get some much needed water and relax in the air conditioning until E and J come pick me up. The entire walk, I dont really hallucinate and begin to think that aspect has worn off. Everything is just so pretty and I focus on that. Eventually I get to campus, but am still about a 4 minute walk from the student center when E calls and says they are finished at the pool and come to pick me up. We head back to Js apartment to relax and watch some tv. In the car ride back I learn that the pool was to J what Van Wilder was to me. Of course, it had just hit him later! I also notice that I am not in fact finished hallucinating as I am still seeing colored lines whizzing around objects and at one point, saw the door next to J open up mid drive.</p><p>T 4:45  We are back at Js. I am extremely grimy and sweaty, but dont care because I am still feeling great. We watch a couple of episodes of Pawn Stars. E slips in and out of naps the entire time, while J just sits there, appearing overcome by everything he has seen and done for the day. By now I am about a +1, maybe a very week +2. At one point in an episode, they talk about the Geneva Convention banning certain types of knives, but not others. I realize how silly that and the entire human race is. We come together to create a civilized way to fight war. That just seems extremely contradictory and amuses me greatly. I tell E and he too laughs, probably at me for realizing it in my state.</p><p>T 6:15  E leaves to get some dinner with his roommates leaving me a J. J goes to sit outside on the balcony and look at the sky. He calls for me to look at the clouds, to which I do. I am no longer hallucinating and obviously cant see what he sees, but I do see the utter beauty of them nonetheless. I suddenly wish it would rain, the idea of sitting and watching a storm roll in sounds amazing. We quickly decide to go for a walk. We walk for about 20 minutes, discussing things we had seen and thought about throughout the day. J tells me how much he loved it. We get back to his place and decide to go to Cs for dinner. J assures me he is able to drive, as he too has now stopped hallucinating and is at the same stage I am, a +1, just taking the world in and seeing the beauty.</p><p>T 6:45  We head to the store to pick up some food and beer. I went to pee while at the store, and to my surprise, I could still see the wall tiles breathe and shift a little bit if I let them!  This made me happy as there was still a little bit left in me if I so chose to go that route. We get to Cs and make dinner. I am starting to feel the beer as a calm relaxed feeling washes over me. Combining this with the euphoric feeling of coming down from my trip, and I am a very tranquil and happy person. Just as the sun sets, we all go outside to throw a Frisbee around. Eventually I get bored with that and sit to watch the sun slowly set beneath the mountains. It is beautiful and I begin to feel like I am in a Grateful Dead picture.</p><p>T 8:45  We all go back inside to watch some basketball. I realize my trip is all but gone, and just relax and enjoy the alcohol taking effect. M comes over and takes a few bong rips with C, then we all decide to go play the card game Asshole. I am slowly getting drunker.</p><p>T 10:30  R arrives and me and J run out to the store to get more beer before it closes. We make it just in time and head back to continue Asshole. Eventually we stop because C says he is too drunk. R heads home and shortly after me and J head back to his place. I realize I could probably drive home, but didnt see a need to other than to take a nice long shower. But really, why would I need a shower when I feel this good? I go to sleep on Js futon, sometime around T 13:00.</p><p>I had no trouble sleeping and had some very odd and bizarre dreams. I cant really remember any details other than me having no idea what was happening in them. I get about 7 hours of sleep, then wake up and head home to get a shower and then write this, approximately T 22:00 after ingestion.  I have a very slight headache which I attribute to the beer and lack of sufficient water consumption throughout the day.</p><p>Overall, I am not 100% certain what I took was DOB, but after doing some more research this morning, I am almost 100% certain. The only thing that doesnt quite fit is the duration of the trip. Mine seems to be slightly shorter than what I have read about, though to combat this, Js trip was more in line with the time duration I have read about. Combining my research, Js trip duration, and the fact that C was almost certain it was DOB, I would say I am about 98% sure.</p><p>I feel like I could up my next trip to 4 hits, but am slightly hesitant about this. I feel if I went up to 4, those two trance-states I was in earlier would overwhelm me and I would be stuck in them for a much longer time, maybe hours. I would have to have a completely sober sitter with me, as I am not sure what I might see. Doing on trip with 4 sounds beneficial, just to get that trance-thought, however, I dont know if it will be as fun overall as this trip with 3. The visuals were a lot of fun and I cant wait to return to them!</p>"
}
