{
 "title": "Ridiculous Rolling",
 "author": "spiritguide",
 "citation": "   spiritguide. \"Ridiculous Rolling: experience with 6-APB (ID 96261)\". Erowid.org. Oct 7, 2012. erowid.org/exp/96261",
 "substance": "6-APB",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "220 mg",
   "oral",
   "6-APB",
   "(capsule)",
   "  T+ 1:15",
   "110 mg",
   "oral",
   "6-APB",
   "(capsule)",
   "  T+ 1:15",
   "  repeated",
   "oral",
   "6-APB",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96261",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Oct 7, 2012",
   "Views: 2578",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Some background info - I have lots of experience with mdma, 2c-e, 2c-t-2, lsd, 25i-nbmome, doc, and mxe. As well as experience a plethora of uppers, downers, and psychedelics. </p><p>Mindset - Very positive, my last experience with 6-apb was intense and amazing, and my friend, who I will call M, had just re-stocked on some more. I had just gotten off work and we were planning on rolling at my place, but soon we were informed that there was to be a large camping party in the woods. Very positive vibes were felt.</p><p>The Pre-Game - M and I prepare for the party, and as we go to the house of our friend, T, who will give us a ride, we each drop 4 capsules with ~55 mg of 6-apb. I have a very high tolerance to MDMA/MDA, so this is a slightly higher than mild dose. (only small amounts could fit in the tiny capsules due to the fluffyness of the powdered substance.) We make it to our T's house and M is starting to feel his. (Last time I ingested this substance, it took me close to 2 hours to start to feel the effects) This time it took about an hour and fifteen minutes. I started to feel it while we were at T's house for a few. I drop my other two capsules, and we head out after T and his 2 room mates, B and C, drop their capsules. </p><p>It was a long drive out to the camping location, and our driver was feeling the effects pretty heavily about 3/4 of the way there, which usually makes me nervous, but I trust our driver. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>Anyways, we arrived, and by then I am getting the most extreme nystagmus I have ever gotten. I was looking at the clock in the car and I was seeing 2-3 of the neon colored numbers. But I relaxed and it went to normal, by that time, the visuals had kicked in and the ground was morphing and swirling, and the patterns were very, very tiny fractals and more intricate and calculated than I have ever gotten. Very strange. Yet the euphoria was greater than I could have ever imagined.</p><p>I spent a lot of the night bonding with people I didn't really know, people that I used to know, and showing my love for my best friends who were there, it was a truly amazing setting, aside from the drunks who I tend to avoid. Everybody was loving it and could not tell it apart from any mdma that they had ever had. Most people that took it were taking approximately 100-200 mg, which manifested strong feelings of euphoria, love, and bonding, identical to mdma. The only differences between MDMA and 6-apb are the incredible amount of stimulation, and the nystagmus and bruxism seem much worse. Though the duration has been approximately 8 hours in my experiences.</p><p>There is also very strong tracers, distortions, and patterning, though that may have been due to the strong dose thatt I took, as throughout the total experience, I consumed roughly 550 mg of 6-apb, after my first 330 mg I was just keeping the party going. I have never seen people connect in such a way, or show so much love towards each other, even on mdma. </p><p>I really wouldn't recommend this chemical until further research has been done, and definitely at my dose. If it proves to be as safe as mdma, I would prefer it to the original chemical. One more thing, the comedown was far weaker in intensity and duration!</p><p>Stay safe everyone, know your limits and your body.</p>"
}
