{
 "title": "The Perfect Mood",
 "author": "Curious",
 "citation": "   Curious. \"The Perfect Mood: experience with Pregablin (ID 96309)\". Erowid.org. Jun 2, 2012. erowid.org/exp/96309",
 "substance": "Pregablin",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "600 mg",
   "oral",
   "Pharms - Pregabalin",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96309",
   "Gender: Female",
   " ",
   "Age at time of experience: 22",
   "Added: Jun 2, 2012",
   "Views: 12132",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI first tried Lyrica after finding an old bottle at my house in 2011. At that point I'd had pain and stiffness in my neck and shoulders for ten years - even after trying many channels (doctors, MRIs, chiropractors). After researching this medicine a little, I decided I'd see if it helped my pain. Previously the only medicine I found any relief in using was Lortabs, which dulled the pain but didn't take the uncomfortable stiffness away.\r\nThe bottle had 90 capsules at 50 mg each. Even though I knew you were supposed to ease into taking this medicine, I knew I didn't have enough pills to make it to taking a normal dose every day. So I just began taking two 50 mgs two or three times a day. The relief I found was amazing! Previously one fo the non-medicinal treatments was popping my neck and back constantly (minimal relief was found with applying heat or exercise, especially since the stiffness and pain made exercise unbearable).\r\nAt the aforementioned dose, I mostly just noticed a reduction in pain and stiffness. I still popped my neck and back but the effect was 300% better. Sometimes I noticed a little slight reduction in fine motor skills. The only other side effect was increased difficultybut definitely not inabilityto orgasm. \r\nSeveral months later, I finally found a doctor who I thought might help. I described my symptoms to him and told him Lyrica helped a lot. He said it made sense for me to take this medicine if it helped, and even though he was unable to find a reason for the pain and stiffness he prescribed me Lyrica. \r\nFor one month I took 200 mg twice a day. The first few weeks I became acclimated to the medicine and found my symptoms were reduced by 80% or so. I was ecstatic that I had finally found something that helped me. I also noticed that it was a social lubricant as others have called it. I am a shy, introverted person and Lyrica has definitely helped me be more social and assertive. I also noticed a few others side effects (in additional to all the ones I have already mentioned). While the dose of 200 mg was in effect I experienced slight muscle twitches/spasms and decreased fine motor skills (basically making me a little clumsy).\r\nThen I began to notice that the doses effects only lasted about four hours. I would take one dose at 7AM, and by the time I took my second dose at 1PM the first dose had completely worn off and I was in pain again. The same thing happened with the second doseby 5PM I could tell the medicine had worn off and I was in pain the rest of the night.\r\nSo then I began taking a third dose of 200 mg every day and noticed that dosing schedule covered the entire day. As a result of doing this I ran out of my first filled prescription too early, and I was left without any pills for about four days until I could refill again.\r\nA couple of weeks later, I called my doctor and asked him to increase the dose, and he did. Now Im happily taking 200 mg three times a day.\r\nHowever, so far I have only described Lyrica for its intended use. I discovered it had some recreational uses as well. I took four 100 mg capsules and drank two beers one night, and I was pleasantly surprised at its effect. It was similar to being a little tipsy, but not as sloshy. At this higher dose I have also found that its difficult to see thing close up with both eyes  its easier to cover on eye and look with the other. Perhaps this is because my eyes feel slightly asymmetrical and had difficultly synchronizing. However, I was very socially lubricated and finally enjoyed a night with the company of other people, free from my social anxiety. The benefits definitely outweighed the side effects.\r\nIn summary, I found this medicine to be effective at significantly reducing my undiagnosed neck and shoulder muscle pain/stiffness at my prescribed dose. Higher doses result in sort of drunkness; loss of motor control, trouble concentrating, etc. (but no nasty stomach pain, vomiting, or hangovers!). This medicine seems to increase the effects of alcohol as well, making a night at the bar much less expensive (given that your insurance covers this mediciation). I highly recommend this medicine if you have similar symptoms!\n\n\n"
}
