{
 "title": "Supreme Clarity",
 "author": "Jostie",
 "citation": "   Jostie. \"Supreme Clarity: experience with Mushrooms - P. cubensis (ID 96311)\". Erowid.org. Dec 4, 2013. erowid.org/exp/96311",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "88 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)",
   "  T+ 2:15",
   "4 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96311",
   "Male",
   " ",
   "30",
   "Dec 4, 2013",
   "391",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is a report of my first time using the mushroom in dried form. Also the first time I made it into tea. The mushrooms are Psilocybe cubensis of the B+ variety which I have grown myself. Of this particular flush I had already eaten about 40 grams (1/4 ounce) of fresh ones. The rest was thoroughly dried, pulverized and stored in the freezer for about 8 weeks. My last experience was about 2 months ago with the aforementioned fresh ones. My girlfriend does not like my substance usage and I had promised her to refrain from anything until my classes were over. I am currently in the process of finishing my Ma in Philosophy. I have extensive experience with cannabis, LSD, mushrooms, 2cb, MDMA and some other stuff. I am reasonably fit and practice yoga on a regular basis.</p><p>Personal preparation:</p><p>As Tuesday was the day of my very last class I had already decided that this week something was going to go down. Turned out the following Thursday was the best day schedule-wise. I had been preparing myself mentally for the whole week. This basically entailed deciding whether to take mushrooms or acid. I had been reading some report about making mushroom tea and decided I wanted to give it a try as well. I spent Thursday running some errands and spent most of the afternoon buying a folding bike for the upcoming holiday. I own a big campervan you see. Somewhere around the end of the afternoon I ate some Bara and had some nuts and chocolate. At eight I went to my yoga class. Currently I am practicing hot yoga and I had a very nice and thorough sweat out. I went home, kissed my girl goodnight (she had to work the next day) and dragged the extra mattress downstairs and put it in the living room. I then started to prepare the special brew. </p><p>Substance preparation:</p><p>I put some water to boil. Out of the bag of approximately 8 grams (0.28 ounce) dried shroom I eyeballed about half into an empty water bottle. After the water boiled I let it cool down for a bit and filled about half the bottle. I let the mixture sit for about fifteen minutes, now and then shaking it vigorously. I then used a coffee filter (one of those old school triangular ones from before everyone started using pads) and poured myself a cup. The tea had a very subtle blue tint, smelled somewhat mushroomy and tasted not bad at all. I mixed in some honey and downed the cup in a couple of gulps.</p><p>11:00: Drink tea. I go and sit at my computer to download some movies for later. After psychedelics I usually have trouble sleeping and like to watch movies until sleepy enough. Read some more about mushroom tea and see multiple warnings about drinking it slowly due to the fast onset. For me it still took about half an hour before the first signs manifested. I lie down on the mattress.</p><p>11:30  01:00: Spend a couple of hours on the mattress looking at the ceiling and thinking deep thoughts. At the yoga studio a couple of guys where talking about how they did not feel relaxed after class. For me it was obvious they approached the whole yoga thing wrong. Yoga, for me at least, is a very mental thing, and I believe that if you treat it like a regular workout it will be just that, a regular work out. I wanted to tell them how it is a tool for focusing the mind. Sitting in the dark in my room I was having this internal dialogue with them. I felt like a real teacher. The visuals were nice too. The blinds were rippling and turning different shades of deep blue and green. At first I had one lamp on, one of those rice paper ones, and the light took on a solid quality. Later I preferred sitting in the dark. I find that darkness really brings out the glow in objects. When I closed my eyes I was surprised by the crispness of the visualization. Usually mushrooms give me somewhat fuzzy colourworks. I felt burst of energy throughout my body and kept wiggling and twitching my arms and legs. A big smile was fixed on my face. Mushrooms usually make me very emotional, at least for some time, and this time was no difference. I was thinking about broken friendships, losing one's parents and the human condition, basically suffering in general. Some tears might have been shed. Around one o'clock I had this sudden sensation of waking from a dream and felt almost back to baseline. After what felt like a long time doubting whether or not to make some more tea I finally decided to make another cup of tea.</p><p>01:00 - 01:15: Repeat the process, using the rest of the bag (another 4 grams). As I was standing in the kitchen I noticed I was not as sober as I previously had believed. But by this time the tea was already brewing. I did, however decide to drink this one slowly. Guess it was gone by 01:30.</p><p>01:30  02:30: Back on the mattress. Had a small moment of some nausea and anxiety as my body noticed it had just received another load of psychedelic substance. But it soon passed and I felt myself coming up again. During my years of using psycho actives I have noticed the focus is shifting from the visual element to the purely mental. But this was spectacular! The ceiling dissolved into a heavenly sphere. Stars where bursting from the ceiling and around the lamp. Empty space itself was gaining solid qualities. I had the distinct feeling I could feel my ego as a solid object within my own mind. The mushroom was using different tactics to break through it but failed. I remember clearly saying to myself how the mushroom put in a good effort but failed to break the ego. I felt great and suddenly I understood. I understood what it meant to be enlightened. I fully realized I was not there yet but had a true grasp of what it meant to let go of the ego. I believed I was but one step from true enlightenment. It was a moment of supreme clarity! My entire brain felt positively aglow with the brightest purest light. I nearly cried with joy and felt like my face was split in half with a grin. There was however a price to pay for this insight.</p><p>02:30  04:30: I am guessing the ego is not as strong as I previously believed it to be. I feel the experience is becoming overwhelming. Confusion is getting the better of me. I start to feel nausea and lose the ability to form proper coherent thoughts. Definitely not having fun anymore. Time slows to an absolute standstill and slowly starts to lose all meaning. There is a much defined loop like quality to the way I am thinking. I use a yogic breathing exercise to try and calm myself down, this seems to work for a moment, but then the nausea increases, freaking me out, so I have to resort to the yogic breathing again. This continues for what felt like forever, but was actually only an hour and a half. From previous bad trips I have learned to stay calm and trust in the fact that it will pass but is was difficult. I was sweating and uncomfortable. I wanted to go to the kitchen and eat some sugar or something but could not remember how to walk there. I did manage to go the toilet a couple of times and piss. But for some reason as soon as I was lying down again I felt like I had to go again. Time was acting in the most bizarre way. I have a mantra I use when things get overwhelming. It is 'I am still here'. Taking deep controlled stomach breaths in combination with this mantra usually helps me a lot, but all I could say now was how stupid I was to take a second dose, how I was having a hard time, and how I brought this on myself. There were visuals but my focus was on the way my mind was warping itself in impossible vortexes. I tried watching a movie. I had downloaded a science fiction movie about some dude on Mars, but I could not look at it. Half the screen was a blur and every face had Maori-art like patterns dripping of it. So I put on episode one of The Sopranos but that did not work either. The feeling of déjà-vu was too intense. Back to the mattress. I kept looking at my watch and just wishing for the feeling to stop. I tried to let go and just relax, but is was impossible. Somewhere I tried and eat a small peace of cake but it turned into ash in my mouth and I had to spit it out. I had difficulty understanding what it meant for there to be a day and night as it felt like I was stuck in the same moment forever. My whole life and especially previous bad trips felt like making up the same eternal moment. I guess the focus on time comes from my current work on my thesis; experience of timelessness in mystical experience.</p><p>As the night progressed my feeling of shame increased. My girlfriend is very against the whole drug thing, she has never even tried a cigarette, and both of us do not drink alcohol. A couple of years ago, before we lived together, I had a very bad acid trip that lasted for 36 hours and after trying to check myself into the hospital, stopped by her house in the early morning an emotional wreck. Since then she is really against it. Every time I tell her I will be careful, I know what I am doing and so on. And here I am again, tripping out. I think about waking her up, but know that I will regret that later on. So for fear of her seeing me like this I collect some things (this takes forever as I keep forgetting what I am doing) and go outside. Around the block our campervan is parked and it is the perfect place. It has two double beds, pillows and sleeping bags. Getting to the actual van was a bit difficult and I hope there were no neighbors awake to see me shuffling along clamping the walls. In the van I have to clear out some stuff from the bed but eventually am able to lie down in the top bunk. There is a small window which I open. Fresh air blows directly in my face and it feels awesome. Covered in sleeping bags and pillows I enter a fugue state. I see visual distortions and color swirling but my consciousness just cannot be bothered anymore. There are a couple of times that I sort of pass out, but the sensations of falling of flying makes me awake with a start, only to sink back into the fugue state.</p><p>04:30-05:00: Suddenly I have the same feeling I had the beginning of the evening, like waking up from a dream. Within 10 minutes I am almost back to baseline. I eat some cake and already feel a lot better. The funny thing is that although I have cursed myself for taking drugs again I immediately feel like doing it again in the near future. The workings of the mind are curious indeed. Around five I walk back home. Off course there is a neighbor walking his dog as I climb/stumble out of the van, and he laughs at me. Back home I am suddenly ravenous and eat a load of stuff. I put on The Soprano's again and it is awesome. I already feel stronger for getting through this by myself and have learned valuable lessons about life, consciousness and correct dosage.</p><p>05:00-12:00: I chill out, watch Soprano's, kiss my girl good day and go to the swimming pool for some laps. It was very crowded and filled with dudes in too tight swim shorts going at it like crazy, but I was taking it easy and spend most of my time floating under the water. Get some stuff from the supermarket. They have doughnuts on offer and I buy and immediately eat five of them. Back home I feel energetic and clean the kitchen, watch some more Sopranos episodes and go to sleep at noon. Wake up at six as my girl comes home, make dinner, sleep some more, go to work where I am now writing this report. Putting it all down on paper feels really good and helps putting the night in perspective.</p><p>Namaste</p>"
}
