{
 "title": "The King of Benzos",
 "author": "smally biggs",
 "citation": "   smally biggs. \"The King of Benzos: experience with Flunitrazepam (ID 96313)\". Erowid.org. Jun 3, 2012. erowid.org/exp/96313",
 "substance": "Flunitrazepam",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "2 mg",
   "oral",
   "Pharms - Flunitrazepam",
   "(pill / tablet)",
   " ",
   "1 mg",
   "oral",
   "Pharms - Flunitrazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96313",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jun 3, 2012",
   "Views: 6781",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I like to do benzos occasionally and just happen to come by some flunitrazepam by chance. Roofies are hard to find where I live so I jumped at the opportunity and bought a blister pack of 10. I didnt have work for the next two days so I decided to take some later that night. I settled down at my computer and took two 1mg pills (also I should note that I hadn't taken anything previously or had anything alcoholic to drink, call me a purist if you will but I like experience drugs by themselves); I basically just wanted to relax that night. So what happened next (at least what I remember) happened like this:</p><p>T + 0:00 - Took two pills, decided to do some programming and wait till I start to feel something.</p><p>T + 0:15 - I feel a bit of light headedness, I would describe it as being mildly drunk.</p><p>T + 0:30 - Yeah I definitely feel it now, my body is getting heavy and its also kind of hard to concentrate. I decide to stop programming and play some video games for awhile.</p><p>T + 1:00 - Feeling pretty heavy now, Im very relaxed. I try to stand up and stagger, feeling pretty sedated but not quite where I want to yet. So I popped one more pill and sat back down to mess around on my computer for awhile longer.</p><p>T + 2:00 - Well....Im fucked up now to say the least, my body seriously feels like I have lead in my legs and arms. I tried to go downstairs to make something to eat which almost made me fall down the stairs, would probably have been pretty funny to watch.</p><p>T + 2:30 - Im feeling tired and still extremely heavy, I lie down on my bed and just sit there.</p><p>T + ? - I woke up around 5:30pm the next day and have no memory of what happened after I laid down on my bed, a bunch of clothes were scattered all over my bed though (maybe I was trying to make some kind of blanket out of them?). I still feel a bit heavy right now but I can function though.</p><p>Not really an exciting night but sometimes its fun to just kick back and do nothing for awhile. Dont take these if you have things you need to get done that day because you wont, trust me. I weigh 200 lbs. and am no light weight when it comes to benzos, but with these things (or at least for me) two will make you good and three will knock you the fuck out.  Floozies are one of my favorite benzos but I can see how they could be dangerous, just keep a close eye on how many youve taken because it can be easy to forget (especially if youre drinking) and if youre out with your friends let them  know just in case.</p>"
}
