{
 "title": "Acidception",
 "author": "ATP",
 "citation": "   ATP. \"Acidception: experience with LSD (ID 96331)\". Erowid.org. Jul 12, 2013. erowid.org/exp/96331",
 "substance": "LSD",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 1:00",
   "  ",
   " ",
   "Cannabis",
   " ",
   "  T+ 4:30",
   "0.5 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 5:15",
   "  repeated",
   " ",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96331",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jul 12, 2013",
   "Views: 3271",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n0:00 1 hit Acid (blotter)<br>+1:00 marijuana<br>+4:30 ½ hit Acid (blotter)<br>+5:15 marijuana (repeated)<br>I am 19 at the time of the experience and writing this.  I take no supplements or prescriptions.  I follow a vegan diet, which may or may not effect things.  I have had plenty of previous exploration with acid, mushrooms, MDMA, DXM, mary jane, salvia and a host of stimulants and downers and things.<br>It was a gorgeous day out, I had just smashed a job interview (in a good way) and lucy was in town.  My friend J and I had decided to take our acid this weekend since a large group of our friends were headed to Bonneroo in a week, and we were going to be missing out on the festivities.  <br>Armed with a strip and an sack, I headed to J's new apartment (we moved him in last night) and got cracking.  We took one hit at 2:00 and decided to wait to come up before dropping the second.  I wanted to see how good this stuff was before having more- it was supposed to be top notch, better than the last stuff we'd had, which had positively blown my mind.  <br>We watched American Dad for a while, which was quite surreal by the time we turned it off.  It was much more apparent that the acid was kicking in now.  How long had it been?  We laid back and watched the dots on the ceiling move around.  We sat up, and began messing with all of the crazy new energy that was in the room.<br>We pulled string of energy from our foreheads.  They were like little sensors.  When I waved my fingers around above my eyebrows, it was like there was a whole bush of them growing out.  I could feel with them.  I began to play with the air, grabbing it and bending it, forming compressed cubes and balls, then letting them dissipate.  J began to glove barehanded- he perfected a new move that looked and felt as if he were peeling away space-time with his fingers.  I felt the urge to spin, but my nunchuka were at home.  I made do instead by building my own toy.  I built a large geometric framework in the air, and began to play with it.  I could feel it's weight and shape, and I tossed it around in the air, catching it, spinning it on my fingers, getting a feel for my new flow toy.  J told me he could see it, and I realized that I could as well... just not with my eyes.  I played with this new sensory perception for the entire trip.<br>I let my toy dissolve.  I looked at my hands. Every time I moved them, the lines following my pointing fingers created a new solid shape between them.  I could feel them pressing against my hands.  J decided to throw on some Gurren Laggen, and it was too visually intense for me.  I stood up and drew on the dry erase board on J's door, listening to the show instead.  During one particularly ridiculous string of techno jargon shouts came a phrase which we used for the rest of the trip, and are planning to use from now on: Probability Alteration.  It became the center of what I was drawing.  I realized that all that my life is is me altering probabilities. We laughed about this, and decided that this would be a new trump card for reality.  The anime turned off, and I laid down to watch the ceiling again, which was now gently boiling.  I looked at the time- 4:20.<br>We tried to decide whether or not we were stoners at the moment, and did we still do that thing and smoke at 4:20?  It seemed unlikely.  I used the dry erase marker as an impromptu poi (it was on the end of a cord) feeling the gravity of the tiny marker as it spun around me.  I put down the marker, and J grabbed a peach I had brought over and cut out some slices.  The peach reminded me of my synesthesia.<br>I have synesthesia cause by acid- it's not a bad thing, I actually love having my senses connected in a new way.  It happened earlier this year on an acid trip when I ate a tangerine. The flavors turned into a sunset that flowed out of my ears. Something that I could taste, hear, and feel all at the same time, yet not quite any of those at all.  It's stuck with me, but it's much more pronounced on psychedelics and much more... visual? Ugh, the limitations of language! Anyway, back to the story.<br>I thought about the Allman Brother's Eat a Peach and felt content.  I played with a thin piece of plastic that the doses had been wrapped in.  I could feel the thing in the center of my head, similarly to the sensor bush on my forehead, just in a flexible plane, not strands.  <br>We decided to play some X-Box for a while, to see what it would be like to pilot an avatar.  We cheesed out for a while on there, and I noticed an incredible improvement in my marksmanship and maneuvering.  I felt very one with the controls and the representations on the screen.  At about this time, J's controller abruptly stopped working and we turned off the video games. <br>+4:30 We decided not to eat an entire second hit because I had a friend coming into town who wanted one (this was my last one) and this shit was already intense.  We decided instead to see what it would be like to have a half hit now and just draw out the comedown.  Under the tongue!<br>We left J's soon after that to meet some friends at my place.  <br>The walk was fantastic. We had to wait to cross the street, between cars coming from both directions.  I watched as the cars moved by in four dimensions, and I crossed the street in the same four.  Even though the cars and I were at the same coordinates in the of the dimensions, we could both occupy the same space on the road because we had different coordinates in time.  Fascinating!<br>We trouped into my apartment, and my neighbor, Z, caught us right before we went in- he had had a bad day at work, but a few minutes of trip talk with us and he felt much better- I just felt like I remembered the right way to think, you know? He said.  It's true- the universe shows us exactly what we need to see all the time.  We just have to be aware enough to catch it.<br>The half hit was definitely kicking in now- a strange juxtaposition began to occur.  We came up on acid from a base line of acid.  Both the coming up and coming down energies were very distinct, and they interplayed with each other.  Being in a trance state already, however, made the come up super normal and comfortable.  We just melted into a new state.  It was like acidception- acid on acid.  The blanket I was sitting on looked as though there were balls of all sizes rolling around underneath it.  I threw on some Sky Tree and we soaked up the music, which described the mindset we were in to a T.  I could feel it running through my head, the sides of my face and through the room.<br>Some friends came over.  We rolled a blunt and went outside to enjoy that.  J and I appreciated the depth of the clouds as the sun set.  Our friends dropped J and I off back at J's place, and we watched Shanghai Noon while smoking several bongs.  The movie was like watching a play on screen- the acting seemed fake, we could easily pick out miniature sets and green screens, bad cuts, slip ups in lines, etc.  It was also interesting looking at how much popular film technique had changed in the past ten years- too many close shots, lots of shots from the floor... We had each seen the movie enough times that it made enough sense.  But we were still tripping more than hard enough for the whole thing to be totally absurd.  <br>It was ten or eleven something at this time, and we threw in Cheech and Chong's Next Movie to more fully appreciate the comic genius of Tommy Chong (with more marijuana enjoyed throughout).  After this I headed home (around 1:00 am).  On the walk back, I stretched my energy around me, into large fans of veins that acted like giant ears.  I flexed them with relish. <br>I laid down on my bed to watch the ceiling do its last crawl.  I thought about the Buddha, and realized that he used a sort of positive karmic feedback loop to generate his insane amounts of karma-  in each life he could reinvest his previous karma, thus creating a nearly exponential loop.  It may take a while to get it rolling, but once you get it going, the thing would create stupid amounts of good karma.  I thought about how to apply this to my life, and realized that it was something I was already in the midst of, and that I needed to reinvest my energy to continue the cycle.<br>I went to sleep after that, and experienced a fantastic afterglow the next day.<br>In retrospect, this was an A++ experience.  It gets two thumbs up and my stamp of approval.  The clarity and strength were unmatched in my experience, and I was able to play with the world's energy in some crazy new ways.  I felt completely recharged, cleaned out and one with the universe.  Another beautiful entheogenic experience brought to me by LSD.\n\n\n"
}
