{
 "title": "An Interesting Experience.",
 "author": "Craaw",
 "citation": "   Craaw. \"An Interesting Experience.: experience with BOD & Nitrous Oxide (ID 96356)\". Erowid.org. Jun 5, 2012. erowid.org/exp/96356",
 "substance": "BOD & Nitrous Oxide",
 "bodyweight": "123 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "19.4 mg",
   "oral",
   "BOD",
   "(powder / crystals)",
   "  T+ 5:00",
   "  ",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96356",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jun 5, 2012",
   "Views: 9701",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDuration: 10 to 12 hours (hard to say, effects got pretty subtle at the end) + lingering after effects for about 4 hours. <br>Setting: House party of 30 something people,(that's number of people, not age) most of which were on some sort of psychedelic.<br>Come up was very gradual and took awhile to even start, visuals took even longer to develop. At about T+90 minutes, a psychedelic mindstate began to take hold, accompanied by a bit of queasiness. Not enough to warrant going to the washroom incase of vomiting, just enough to generate a bit of mild discomfort. At this point much effort went into avoiding areas of the house that were crowded or had loud music. <br>Effects continued to increase gradually for another 2 hours or so until a plateau was reached, and some visuals developed. Now even being in a quiet room with a few close friends was a bit intense. Eyes were closed and covered by hands to keep out the light, which had become rather irritating. Very nice CEVs were noticed at this point. They were very subtle at first, but gained depth the longer eyes remained closed. After about fifteen minutes of this, I was able to handle the light and some conversation. Body load became less intense but visuals continued to become more developed. Every now and then a wave of queasiness would pass over but there was never any vomiting. This is definitely a drug that just keeps going and going. <br>Visuals continued to become more developed until about T+ 6 hours after which they stayed the same for awhile. The visuals were not very colourful in nature, and consisted of warping and shifting shadows and white lines pulsing over objects in my vision. (Although, all of my visuals on a number of different psychedelics have been like this lately, a notable exception being 25i-NBOMe). As mentioned in PIHKAL, there is definitely great humor with this one. Things that would normally be funny were absolutely hilarious, and there were many hours of laughter throughout the trip (A few drunken tripping friends contributed greatly to this). Backtracking to T+ 5 hours, 8 grams of nitrous oxide was added. This did not add much to the tripping mindset interestingly enough. Visuals became colourful for a brief 2 minutes and the 'pixel vision' was overlaid on top of the moving shadow visuals and was very pretty to look at. There was also the classic nitrous euphoria of course. There was great difficulty getting the nitrous out of the canisters, which resulted in more laughter. About 8 hours in the visuals were still going strong, but I began to get quite tired. (It was afterall, about 7:30 A.M at this point). I did not end up sleeping, but was comforted by the fact that I could if I wanted to because of a nice little collection of benzodiazepines. I try not to use them unless necessary though, because it feels like I'm wasting the trip by interfering with the integration phase. <br>About 20 minutes were spent giving a friend a foot rub while the sun came up. It was comforting to have something to do with my hands and it became automatic after awhile. At this point a few people began doing lines of 6-APB. I was slightly tempted to partake, but my better judgement told me to hold off if I didn't want to be dead in class the next day. (I was already going to be exhausted enough as it is, serotonin depletion definitely wouldn't help matters as fun as it would be. Also, I try to keep my tolerance for serotonergic substances as low as possible so that I get the most out of them). <br>At T+ 10 hours, the visuals began to very slowly wind down and mostly disappeared by the twelfth hour. I was now very tired and kept putting off going home (2+ hours away) while lying down in the only bed that wasn't completely occupied (There were three people in it so I was able to nudge my way in). I felt very sleepy and lazy and lacked the will to leave even though I knew I had to at some point and it would be best if that were done before too late. <br>Eventually I ended up going home, crashed and slept for a long time until my alarm went off. I would say the trip was a success and I was satisfied with the material. Will I try it again? Mostly likely, but not for a long time. There wasn't really anything completely unique to the chemical, it felt like an amalgamation of various 2C-X chemicals with added duration. The timing for taking it was not perfect (11:30 P.M is a bit late to take something this long acting) but I had already put off trying it for a few months and I wanted to contributed an anecdotal report on this mostly unknown substance.\n\n\n"
}
