{
 "title": "Pain, Arrhythmias, Hospital Stay",
 "author": "stbot32",
 "citation": "   stbot32. \"Pain, Arrhythmias, Hospital Stay: experience with Cannabis, Methylone & Amphetamines (Dexedrine) (ID 96360)\". Erowid.org. Aug 8, 2012. erowid.org/exp/96360",
 "substance": "Cannabis, Methylone & Amphetamines (Dexedrine)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   " ",
   "Methylone",
   "  T+ 0:00",
   "  ",
   "oral",
   "Alcohol",
   "  T+ 24:00",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96360",
   "Gender: Male",
   " ",
   "Age at time of experience: 33",
   "Added: Aug 8, 2012",
   "Views: 8612",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nBefore starting I should note that I consider myself fairly experienced with psychedelics and a plethora of other mind-altering chemicals and herbs.  I've tried a fair amount of R.C.s over the years and for the most part, I've had good experiences.  I also have taken low doses of the stimulant dexedrine for studying and working, typically 5mg, on and off when available (typically when I can find reliable pharmaceutical dexedrine, so about ~10 low doses a year, for the past two years).\r\nRecently I decided to try Methylone, after much of what I'd read on the web said it was easier on the body than other cathinones (eg Mephedrone, which I have also tried on numerous occasions).  I took Methylone a few times over the past few months, with mild euphoric experiences and pleasant stimulation typically lasting 6-8 hours.  Typically I'd take a break of a few weeks or a month in between doses, although I did binge and do it twice in the span of a week a couple of times.\r\nTen days ago I tried taking a very low dose of Methylone one afternoon (about 50mg) to see if it would act as a nice light stimulant in place of dexedrine.  The mental component was not as clear as dexedrine however I ended up cleaning my entire apartment (I was at it for hours).  I redosed throughout the day, a total in the end of maybe 200mg, which as I understand it is not all that big a dose (that is often a single recreational dose).  I drank mostly fruit juice and water (I try to avoid mixing stimulants with other drugs).  I did at one point during the evening break this rule though and have a couple drinks spread out over three hours, a shot of scotch and a glass of sangria with food.  All in all it was a pleasant experience with no other effects to speak of other than an elevated heart rate (which comes with any stimulant use).  I turned in and got a decent sleep.\r\nThe next evening, I took a few drags off a joint and sat down to relax and play video games.  I've used cannabis for years, I never get anxiety from it.  However suddenly within minutes, I was being stabbed in the chest with intense pains radiating down my left arm.  My heart was racing out of control.  It was very painful and felt very much like I was having a heart attack.  I nearly went to the hospital. The only valid connection I can come up with is that I had been up on M1 with mild tachycardia for hours the previous day.  I decided to cease all substance use, but still ten (long) days later, I have arrhythmias, skipped beats, palpitations, and panic attacks.  Nearly every time I stand up my heart races and I feel dizzy.  This happens too sometimes when I'm sitting down.  Things are perhaps getting mildly better today, but it's still too early to tell for sure.\r\nI went into a hospital a couple days ago and they gave me a full medical check-up.  I spent a night in acute care being monitored, listening to a homeless drug user next to me repeating two nonsensical sentences on loop for 10 hours straight like a broken record.  It turns out that I may have damaged muscles in the area of my heart (necrosis as one doctor put it) but after repeated ECGs, enzyme tests for heart injuries and vasospasms (they sometimes find these problems in long term heavy speed, cocaine and E users), they said that otherwise I was perfectly healthy, my heart was fine, and I was free to go.  Also, I needed exercise.  Getting things fully checked out definitely has helped with the panic attacks, but even so I still get waves of dizziness and heart palpitations and a feeling of tightening in the chest on and off throughout the day.   Getting things fully checked out definitely has helped with the panic attacks, but even so I still get waves of dizziness and heart palpitations and a feeling of tightening in the chest on and off throughout the day.  I am still quite fatigued.  Exercise and rest helps.  I go for good walks every day and I hope with time normality shall resume.\r\nInformation I got from experienced professionals who deal with front-line problems in health services all day, every day, that I should share:  In my area they are now getting a sizeable amount of cases of people who have used cathinone drugs who have come in with chest pains and arryhytmias/paliptations.  Those who have problems sometimes find that it takes a good two weeks for the pains to subside following a single night out.\r\nI just wanted to share this because it seems on the net, most people don't have any problems.  Which is great.  However, the word on the street is that Methylone is 'safe on the heart' and it should be noted that there is no such thing as a stimulant that is entirely safe for one's cardiovascular system.  In my case I have decided that anxiety, overuse, or whatever it was, nothing is worth this--I've sworn off of all stimulants for good, and I'm going clean for a while regarding everything else, to let my body heal.  I feel like stimulant use has finally caught up with me (and several acquaintances of mine, ex stim users as well).  In the words of Philip K Dick in A Scanner Darkly, 'people who were punished entirely too much for what they did'.\r\nAs in all things, moderation is key, and informing yourself is vital.  But in my case I believe I was relatively careful (I'll let the reader be the judge of that), and I still had quite an intense, adverse reaction.  Perhaps combined with the odd bit of low dose dexedrine use (once or twice a week during the preceding three weeks) I did in fact overdo stimulants, and all it took was a relatively mild dosing to push it over the edge one day.  Maybe I'm unusually sensitive to stimulants.  In any case, I thought it was important to share this experience and the little information I gathered on these newer and still relatively unknown chemicals.  \r\nHave fun, but stay safe!\n\n\n"
}
