{
 "title": "A Journey to Hell and a Journey to Heaven",
 "author": "C.O.C",
 "citation": "   C.O.C. \"A Journey to Hell and a Journey to Heaven: experience with Ketamine (ID 96394)\". Erowid.org. Jun 19, 2012. erowid.org/exp/96394",
 "substance": "Ketamine",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "Ketamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2005",
   "96394",
   "Male",
   " ",
   "21",
   "Jun 19, 2012",
   "5415",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The giant line lay in front of me. Long have I been using and experiencing the beauty of Ketamine. Today however I would travel into a world of terror and emerge a new man. Never before had I been so in contact with my brain, my inadequacies and my own being.</p><p>I took the line and lay in my bed as I often did. My eyes closed, unable to open. A drum roll began, I recognised it, but couldn't figure out from where. Darkness fell upon me, the sound of the last beat of the drum echoed into an eternity. A booming, yet somehow relaxing, male voice began to speak to me. It explained that I had taken ketamine and explained in great medical detail, what my body was going through, the sedative had closed my eyes, I would be unable to open them until the trip was over. </p><p>From the darkness I entered into a tunnel of light, the voice was guiding me, explaining why I was paranoid in my everyday life, why I feared that people were talking about me, why I was unsuccessful in most relationships and how my lies are making me a terrible person. It also explained to me that deep down in my body there were issues relating to my use of Ketamine, Marijuana, tobacco and alcohol. I was not dying, but I was slowly killing myself. I was poisoning my body with chemicals and I must stop before I do great damage to myself. I felt greatly reassured by the voices presence. </p><p>I emerged from the light into more darkness. The relaxing voice had gone, its last word echoing into the eternal darkness like the final drum beat I heard earlier. The darkness lasted for a while longer, the feeling of peace started to turn very uncomfortable, like the most unfathomable evil was approaching. What followed could only be described as the most horrific imagery I had ever seen. I was presented with dead and mutilated bodies. Depictions of human and animal cruelty of the most despicable kind were presented to me. Children were crying over the liquefied remains of their parents in obviously war torn countries. Corpses being violated by necrophiliacs, children being sexually abused, muggings, violent crimes, scenes of death which began to tear away at what I felt, what was my very soul. </p><p>I became very unsettled and I wanted to open my eyes, but could not.  Another very different voice spoke over the imagery; it explained why people in the world were as evil as they were and how they needed to be destroyed. As this voice spoke the deep voice returned to speak over it keeping me up to date with my progress, it was explaining that my body was now in the worst stage of the trip. </p><p>Even though both of the voices were talking over each other, I could understand both with equal clarity. As if I was two different people, in two different lectures.  My mind was now at breaking point, the vile imagery being presented to me was relentless and I felt violated. The deeper voice assured me that this would soon be over. The violent images stopped and I was back in the darkness with both voices droning on, becoming more and more distant until they disappeared. </p><p>The evil I could feel began to fade and a more pleasant feeling began to overwhelm me. I felt that I had died. There was darkness and silence. I had no function, all I could feel was pleasant warmth surrounding my body. A tiny speck of white, like a grain of sand on a vast dark plain was ahead of me. Slowly it grew larger. Approaching me. As it got closer and closer it was clearly a human head. The head had no bottom jaw, yet it was making a juddering noise like it had one. It came straight for me and as soon as it collided with me my eyes sprang open. I was looking at my bedside table. The deep voice appeared again, it explained that my journey was over and that I would be unable to move for 5 minutes. It explained that my gift of life was precious and that I should always spare a thought for those in the world who were less fortunate than me. </p><p>When I was able to move I went downstairs to my mum. With an overwhelming sense of pride and admiration for her, I embraced her with a cuddle and told her how lucky I was to have such an admirable person in my life. She was going through some hard times and I could feel the warmth and security she got from my statement. </p><p>It was unusual that such a violent and unsettling experience was to give me such a life changing opinion on people and of life in general. I have had many eye opening experiences on Ketamine, but none so humbled me in this fashion. Maybe its purpose was to show me that despite the hardships we endure in life, there is always someone worse off. Maybe it was to show me that with such great evil in the world, we need more good people to balance the equilibrium on the stage of life.</p><p>All I took from it was the latter, we cannot change the great evil in the world. But with a few kind gestures, no matter how insignificant they seem to be, we can change the world bit by bit and make someone less fortunate than us a little bit happier. </p><p>Thanks.</p>"
}
