{
 "title": "The Night I Lost My Mind",
 "author": "Hugh Mann",
 "citation": "   Hugh Mann. \"The Night I Lost My Mind: experience with Spice and Synthetic Cannabinoids (' Down To Earth') (ID 96438)\". Erowid.org. Aug 8, 2012. erowid.org/exp/96438",
 "substance": "Spice and Synthetic Cannabinoids (' Down To Earth')",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96438",
   "Male",
   " ",
   "Not Given",
   "Aug 8, 2012",
   "4616",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>One evening after work I drove up to a neighbor's house (I'll refer to him as B) to unwind after my shift. I had asked B if he had any weed for us to smoke, but he informed me that the last had been smoked up the night before. After a few minutes of idle conversation, B mentioned that a nearby gas station sells Spice - which would be better than having nothing at all...'sober nights are shitty nights!'. At this point in my life I had only heard of Spice perhaps once or twice, and had absolutely no idea what to expect...however, my curiosity overcame my prudence. We hopped in the car and made our way to the Xtra Mart to retrieve the 'goods'.</p><p>On the way back to his house B advised me that, since it was my first time experimenting with this product, it would be best to take a small hit to see how I would react. He told me that the first time is always the roughest when it comes to this stuff - and 'rough' turned out to be a bit of an understatement. We pulled into the drive way and made our way to his room. Without a moment wasted I ripped open the pouch and packed a fat bowl. Being an avid pot smoker, I hit the bowl as if it were packed with weed...in my excitement I had completely disregarded B's warning. </p><p>With the exhale came an instantly noticable effect. The first minute or two felt comparable to a marijuana high - sound amplification, a relaxed sensation sweeping across the body, a dazed perception. After B took his hit, He reminded me that we left a pack of cigarettes in the car and suggested we retrieve them before we got 'too high to function'. As I stood up from the couch, the high kicked itself into overdrive. I began to have Salvia-like visual distortions and found it incredibly difficult to maintain balance. As I stumbled towards the car, I pulled out the keys and attempted to press the unlock button (with no luck). It felt as though I had been standing outside my car for hours simply attempting to unlock the door...I had become so lost in my attempt to push a button that I had completely forgotten why I had come outside. After eventual success, we returned to his room with the cigarettes in hand.</p><p>Upon sitting back down on the couch, the high reached yet another level of intensity.  At this point I experienced a complete breakdown of coherent thought and my awareness collapsed to a point of confused isolation.  I looked over at B and saw him as nothing more than a hunk of meat emitting sound...I had lost all concepts of 'people', 'the earth', and indeed, my own personality. I reclined upon the couch and stared blankly at the ceiling, absorbing the seemingly guttural sounds coming from his television. As I looked about the room, I no longer knew where I was or what anything 'meant'. I had come to the conclusion that I was about to die, which sent me into an even deeper state of terror.</p><p>An intense pain jolted through my stomach, which prompted me to jump from my position and race out the door. I fell to my knees and began to vomit profusely upon his lawn for what must have been a solid half of an hour. During this time, my perception seemed to have split into two fragments - my conscious perception and some other dream-like state of existence. I can not recall what sorts of things I experienced in this dream-like state, however at the time I felt as though I was simultaneously experiencing my life and that of another's. This experience was interrupted when B came outside to check on me, which sent me back to a more manageable frame of mind. As I returned to my spot on the couch, I let out a few more dry heaves and steadily returned to my 'normal' state of conscious perception. With my mind at ease, I drifted into a deep sleep.</p><p>Even as I write this report, I still can not determine if what I experienced was legitimate insanity, or a most profound state of PSYCHOnautic exploration...</p>"
}
