{
 "title": "First Two Experiences",
 "author": "Wsup Den",
 "citation": "   Wsup Den. \"First Two Experiences: experience with Butalbital, Caffeine &  Acetaminophen (ID 96443)\". Erowid.org. Jun 12, 2012. erowid.org/exp/96443",
 "substance": "Butalbital, Caffeine &  Acetaminophen",
 "bodyweight": "152 lb",
 "header": [
  [
   "DOSE:",
   "  repeated",
   "oral",
   "Butalbital",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Caffeine",
   "(pill / tablet)",
   " ",
   "  repeated",
   "oral",
   "Acetaminophen",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96443",
   "Male",
   " ",
   "18",
   "Jun 12, 2012",
   "10004",
   " "
  ]
 ],
 "report": "<p>First off let me start by saying that I have had a brain/ upper spine and back surgery three years ago. All drugs I abuse have been prescribed to ME over one year ago. Obviously I was prescribed some nice shit for pain. At the time I had no desire to get fucked up, but I now recreationally use my leftovers several times per year, with an occasional small dose in between.</p><p>I just found a bottle of ten (10) Butalbital/caff/APAP in my cabinet that were apparently prescribed for 'tension headache'. All 10 tabs were in the bottle and I have never used this substance before.</p><p>Yesterday I took one tab on a full stomach in the late evening. I felt relaxed and tired. More so than Cyclobenzaprine (Flexeril) or Diazepam (Valium). I felt no euphoria or high, but it was pleasant. I'm 18 and haven't drank before, so I can't quantify my feelings against being drunk. I felt like your mouse cursor when you put the comet trail setting on. That's the best way to describe it other than 'relaxed/tired'.</p><p>An hour ago I took two tabs of Butalbital on an empty stomach and then 20 minutes later ate a full dinner. I started off feeling tired, then melted in to a relaxed state like my previous experience. I soon developed a subtle feeling of euphoria and 'this shit is nice'. It's not the all-around orgasm feeling that opiates produce. It's radiating from my chest and it's unique, but very pleasant. I'm about to take 60mg of codeine. I have a final in the morning and don't want to get an opiate hangover and feel groggy.</p><p>Overall, this is a nice drug to take if you want to spend an evening doing whatever you like to do that's quiet and relaxing. The euphoria for me is about what I'd expect from 60mg codeine alone. To give you perspective, I will take 360+mg codeine or 6-8 Percs over a 3 hour period if I want to get nice and high for the afternoon. I used to take a shitload when I as going through my surgeries. I have a tolerance, but not like an addict. All that to say, this is better to just relax in to than to get high from.</p><p>100mg butalbital = good study aid for my fucking MTH111 final. By the way, it does fuck with your memory slightly. If you try to think of a synonym of a word for example, you might have great difficulty.</p><p>As I'm finishing up this submission, the euphoria is getting somewhat better, now it's radiating in to my head from my chest and it feels SO good if I change body position. Same thing about the comet-trail-cursor shit. I feel like little bits of my body are a split second behind the rest of me.</p>"
}
