{
 "title": "He's Lost His Marbles",
 "author": "disorder bro",
 "citation": "   disorder bro. \"He's Lost His Marbles: experience with 4-AcO-DMT & Methoxetamine (ID 96455)\". Erowid.org. Jul 1, 2013. erowid.org/exp/96455",
 "substance": "4-AcO-DMT & Methoxetamine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "rectal",
   "4-AcO-DMT",
   "(liquid)",
   " ",
   "35 mg",
   "rectal",
   "Methoxetamine ",
   "(liquid)",
   " ",
   "1 tablet",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96455",
   "Male",
   " ",
   "Age at time of experience: 16",
   "Jul 1, 2013",
   "Views: 1868",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I have been interested in psychedelics and their potential for over a year now and they have changed my life in ways I cannot begin to describe. I've experienced marijuana, alcohol, various prescription sleeping pills, benzodiazepines, stimulants and opiates, salvia, mushrooms, lsd, MDMA, nitrous oxide, 25i-nbome, pure psilocin powder, 4-AcO-DMT, 4-HO-MET, MXE, DXM, 2c-c, DMT, and a few others I dont remember.</p><p>35mg MXE and 12mg 4-AcO-DMT were dissolved in 1mL water and administered rectally via an oral syringe. Low doses I know but the synergy of these things astounds me. Or maybe I'm just a pussy. Who knows. I laid back ready for whatever may come next but nothing could have prepared me. Eyes closed, relaxed, I start to feel a buzzing start in my core and slowly work its way though me. A similar disassociation set in as I begin to feel my extremities being ripped apart and stretched off to unfamiliar landscapes. Then I switch my focus to my head where the real action is taking place and I can feel every one of my neurons rewiring itself to provide me with this experience. Every inch of me is flooded with dissociated orgasm. Euphoria like I have never known and in the midst of this the CEVs and the audio hallucinations set in.</p><p>This is my second time mixing a tryptamine with a dissociative. First time was at a dubstep concert at a local bar and since I've noticed dissociatives have a way of working with memories, my brain remembered the feeling and I started hearing dubstep. I've never been too huge a fan but what I was hearing was PERFECTION. It's as if Mozart came to the future, learned dubstep, and teamed up with Shpongle and Bassnectar, who all had a foursome with Jesus and injected the collective semen straight into my astral being. I would kill to hear it again. Then the visuals took over right as the music made itself known. Deep, swirling, organic, spiraling fractals filled with eyes. One of the few times that I've actually glimpsed deep into the other side. The visuals had a very dark, ancient feel to them. The music began to change from beauty to something far more sinister. A laugh that sounded like an evil clown. Sadistic, evil giggle echoing though my head as I began to see an malicious figure rising out of a cube, hunching over its tortured victim. But I'm a sick bastard so I was unfazed.</p><p>I looked past the clown and the AAAAAHAHAHAHAAAA's turn into a WUBWUBWUBWUB similar to nitrous but far more beautiful. Then a humming noise in my core begins and spreads to my head. My ears are ringing like crazy as I am filled with a flash of bright white and I cease hearing the noise and actually become the ringing as it overpowers me. Orgasm. Every inch of me filled with pleasure far beyond any sex or MDMA I've ever hard. Because the pleasure was not only physical, but mental and spiritual as well. Eventually this ends and I am back to winding my way through this ancient, sinister, beautiful, dark, cryptic hyperspace. I am a snake, winding my way up a vine pulsing with some dark energy, and I slip though a sliver of light above me. I enter a room. 4 walls all connect at one point on the top to form what looks like a double sided canoe. Each of the walls is made of stained glass consisting of thousands of sorrowful eyes and a beautiful, wholesome light permeates through every inch of this strange structure and a girl, entirely black, pulsing with some strange light and emitting thousands of rotating black squares that float up and through the room. The light from the stained glass eyes fluctuates between colors, each one unseen by my sober eyes, and each more beautiful than the one before it. I leave this room and am seeing my life from the nucleus of an atom. Surely I must be dead. I've only experience this sort of dissociated insanity once before on DMT. </p><p>I open my eyes to check if I'm still alive. This is where it gets bad. Yes, I'm still alive. My racing heart proves it. The first thing I notice is how many miles and miles of depth is between me and my ceiling. It goes on for lightyears. Looking around, I'm noticing dimensions and space I've never noticed. The tunnels in my folded shirt stretch for miles, the hair on my arm contains many galaxies. The distance between two fingers is greater than the milky way itself. Everything was alive. My bedstand, no longer just a piece of wood with a stereo, becomes a 4-legged creature, the stereo becomes the head of this strange beast and the incense and candles I have on top of the head are antennas used to send information about my activities to the government. Everything in my room is a piece of living machinery placed by the government to monitor every second of my life. I. Am. So. Fucked. Then, I realize that I'm just as much of a machine as they are! Our brains and bodies have become so used to and dependent on unnecessary technology that we, in turn, have become a piece of unnecessary technology.</p><p>Then, a voice in my head. Not just an idea, or a though, but I mean I actually hear a fucking voice in my head, a calm, relaxed voice saying 'no, don't worry, you're just on drugs, there is no government spying on you. This is America, they wouldn't do that' but I was not convinced. Then, another voice. 'it's the fucking CIA bro you gotta destroy everything in your room' then another 'freedom should not be trusted to such a silly race. This. Is. Necessary.' FUCK. By watching so much TV and spending so much time on the computer, I had become a machine. I was not an organic human being, I was a radio through which many different personalities and consciousnesses operated. I had hundreds of channels and each one was a different person tapping into my body and controlling my thoughts and actions. While my true being was still in my body, it had to sit and watch this schizophrenic multi-personality crisis unfold. Thousands of voices, faces and thoughts all clashing, conflicting, giving their opinions on what I should do. This was too much. I had to take some Klonopin and shut this off. It had been a very long, very stressful week and tripping so hard made me officially fucking snap. Bonkers. I was fucking insane. I make my way down to the bathroom to swallow this godsend of a pill as thousands of voices are screaming their take on the situation.</p><p>'NO! MORE DRUGS WON'T HELP THIS SITUATION!' 'TAKE IT FOR GOD SAKES YOU NEED IT!' 'YOU NEED IT BECAUSE YOU'RE SUCH A FUCKING ADDICT, THAT'S WHY!' 'WHILE YOU'RE AT IT, TAKE THE REST OF THE PILLS YOU MISERABLE FUCK! HOPEFULLY YOU'LL DIE AND WONT HAVE TO FACE EVERYTHING YOU'VE FUCKED UP!' 'EVERYTHING WOULD BE BETTER IF YOU WERE NEVER BORN YOU SLEAZEBAG!' 'NO WE LOVE YOU DON'T TAKE THIS PILL!'</p><p>I was still in enough control to take the Klonopin and I looked in the mirror and saw a truly insane man. Eyes dilated and bloodshot, hair standing up on every end, lip bleeding from biting down on it, and somehow, I was naked. I made my way upstairs to meditate and hopefully get some sleep. After another half hour of different personalities and people screaming and operating through me, some voices almost making me overdose, or stab myself, some screaming I LOVE YOU over and over, but the Klonopin began to take effect and I was gently brought into a calm state. The voices were gone. I put my clothes back on, cleaned up the room a bit, and got some much needed sleep. </p><p>In conclusion, one of the craziest fucking trips of my life. It felt like a prolonged combination of salvia and nitrous oxide. I highly recommend you try it, but make sure you're in a completely worry-free, calm state of mind. I did this combo at the end of 2 crazy weeks. Final exams, job hunting, mind taxed from doing so much Ritalin...usually I don't take prescription meds or stimulants but it was finals week. I was already on the breaking point and this combo pushed me over the edge. I plan on trying it again when I return from my 2 week vacation, with a sitter, detoxed and relaxed. Kudos to anyone who was patient enough to read this whole thing and I sincerely hope that you never have to endure what I did that night. Peace and love to you all.</p>"
}
