{
 "title": "Never Again",
 "author": "Ryan420",
 "citation": "   Ryan420. \"Never Again: experience with 6-APB (ID 96536)\". Erowid.org. Jun 21, 2012. erowid.org/exp/96536",
 "substance": "6-APB",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "6-APB",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96536",
   "Male",
   " ",
   "Age at time of experience: 31",
   "Jun 21, 2012",
   "Views: 5036",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Being an experienced drug-user I decided to try a new substance called 6-apb. I read report after report with good and bad divided pretty much equally. some felt it was the closest thing to MDMA others said they didnt feel anything. I love MDMA so decided to give it a shot. I ordered two 50mg tablets from a respectable vender online. Various reports seemed to say 100mg was a good dose, and so I thought, being experianced would help me along with this new drug. How wrong I was.</p><p>I recived my package late afternoon, around 4, and decided to go ahead and take both at once. I hadn't had any good X in such a long time I was excited and a little nervous.I took one at a time and chewed them both and swallowed. Bitter and nasty they were, but nothing that bad. I went to go have a cig while I waited.</p><p>About 30min. later I noticed the usual effects starting to happen. Heart beating faster, cold feeling, apprehension. I smiled thinking this was going to great. Wave after intense wave rushed through my body building greater and greater to an intensity I didn't think I could handle. My body was shivering yet sweating. I felt really really fucked up. but not in a good way. 0 euphoria, 0 empathy, all this fuzzy, dizzy, puky feeling in my head and body. I was so fucked up I couldn't even walk. Pleasant waves ran thru me but another feeling was quickly overtaking it. Nausea. Intense horrible nausea. </p><p>I rushed into the bathroom and projectile vomited around 12 times or so. My head was buzzing and my body was sweating, pouring sweat, yet I was shaking and feeling extremely cold. A headache began to devolop and I was vomiting constantly. I was getting so hot and dehydrated but everytime I took even the smallest drink, i would throw it back up again. I looked at the clock and saw only 2 hours had gone by. I was miserable. I felt like i had the flu and then a horrible migraine developed. I layed in bed for 12 hours shaking moaning and in pain. Everytime I changed positions in bed I would throw up. It was awful. Horrible. One of the worst experiences in my life. I should've taken only one at first. Be careful and do your research first. Peace.</p>"
}
