{
 "title": "Whatever You Want",
 "author": "Bill S.",
 "citation": "   Bill S.. \"Whatever You Want: experience with 4-HO-MiPT (ID 96583)\". Erowid.org. Dec 24, 2012. erowid.org/exp/96583",
 "substance": "4-HO-MiPT",
 "bodyweight": "119 lb",
 "header": [
  [
   "DOSE:",
   "12 mg",
   "oral",
   "4-HO-MiPT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 96583",
   "Male",
   " ",
   "Age at time of experience: 20",
   "Added: Dec 24, 2012",
   "Views: 1501",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I measured out 12 mg of the substance. Placed it within a small piece of tissue and down the hatch it went. I then decided to go for a walk. I went down by the lake and tried to forget about taking the drug. On my way back up my house I could feel the drug taking hold of my mind. Real speedy feeling, and a dryness in my mouth, I could feel my muscles begin to tighten and twitch as the drug coursed through my veins. The tremors aren't really that bad at this point, but at higher doses I couldn't imagine. It feels like your entire body is flexing all at once, that can't be healthy if its happening for 5 hours. It just doesn't feel right.</p><p>My visuals don't get too crazy, no mind blowing geometry, but definitely some interesting patterning going on. I feel myself getting cold and the tremors are getting annoying, a shower sounds great. The warm water felt amazing, the steam seemed to wrap around me like some sensual blanket of sexy mist, it was weird. I also stared at the formation of condensation on the shower door for quite some time, it looked like some really futuristic alien hieroglyphs, I kept looking into them trying to understand what they were, I gave it a good fifteen minutes of wonder and concluded that it was just condensation and not a secret alien language.</p><p>I got out of the shower and found the task of drying and combing my hair to be very difficult, I eventually gave up on combing it and just dried it tangled. At this point I'm peaking, the visuals haven't gotten any more crazy but the brightness and vividness has become more intense, I feel as if I'm being attacked by every pigment of color in the room, they're like reaching out at me trying to catch my eye, that coupled with the ever present body flexing made the next hour of the trip somewhat unpleasant.</p><p>A really good movie was on television and I just tried to focus on it, I felt really connected to the characters in the film as what was going on was similar to events happening in my own life. Lots of introspective thoughts about myself, who I am, and some more personal things. It was interesting.</p><p> Soon I could feel the body clenching let go, it was about 3 and hours from ingestion, minor visuals still persist. Find myself still a bit scatterbrained, contemplated whether or not to make a trip report, I feel confused as to how people are managing higher doses because the body tremors are just fucked up at times, its like the worst cramps ever constantly cramping over and over, and you almost have to like relax and just let that shit cramp.</p><p>Overall a neat drug. For me the physical downsides make it a rather not, with just 12mg I'm getting terrible body tremors and high blood pressure that makes my head feel like its about to pop, and a constant thirst that reminds me of speed and MDMA. I feel like I should just be taking 4-ho-Dmt instead of this synthetic knock off. Don't get me wrong though it is still a powerful chemical, and should be respected. The trip was still positive, and I am still alive so that being said my report comes to an end.</p>"
}
