{
 "title": "Rain Drops Pounding Down my Soul",
 "author": "Dan-NY",
 "citation": "   Dan-NY. \"Rain Drops Pounding Down my Soul: experience with LSD, Weed (ID 9660)\". Erowid.org. Jul 7, 2005. erowid.org/exp/9660",
 "substance": "LSD, Weed",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(gel tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9660",
   "Male",
   " ",
   "Not Given",
   "Jul 7, 2005",
   "Views: 3618",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>AGE: 17</p><p>I've done acid a pretty good amount of times. I've had at least 2 bad trips before. But there is one that stands alone. </p><p>I had come up for a visit that weekend, and gone to my sister apartment where she lives with her boyfriend and my older brother. I was there for a night or two. The next day my friend called me up and told me he tripped-out the other day with a mutual friend of ours. He told me he tripped real good off two geltabz, and that he saved two to sell to me (we often do this). I told him I would meet him later that day after he had got off work, I had my sister's boyfriend drive me over. I told my sister's boyfriend I was going to chill for a night and go back home tomorrow night. </p><p>I met my friend right after he got off work, at the front of his private road. He told me that they were really potent. I told him I'd only take one because I had to go home the next day. I bought it for $7. He ate the other one for some reason, and we peaced-out. I started walking to my other friends house (the one my friend tripped with the other day). I took the tab at about 11:14 pm on the walk over. </p><p>I got to my friends house at about 11:40. We went up to his room and smoked up. I was feeling it good by the end of the smoke session. Me and my friend played video games for a while. He soon got tired, he claims it was because he didn't sleep good after he tripped last night. I was somewhat irritated because I remember a night when he was trippin and I just stayed up with him for the hell of it. He went to bed around 1:00 am, and that's when my trip got very bad. It was about 1:15 am, I was watching a movie I found in my friend room. I was sweating a lot and felt very hot and uncomfortable. I felt like I had to go outside and get some fresh air, maybe smoke a bowl. I eventually got up enough guts to go downstairs. I rushed down the stairs, fast didn't want any interaction if anybody woke up. But when I got downstairs I noticed somebody sleeping on his couch in the living room. I couldn't leave out the door I came in. There was two other doors but one had big blinds on it and I remembered it was noisy. I started fumbling with the middle door. There were two locks on it and no matter what position I turned the locks it would not open. Then I remembered other times people tried to open that door and did not succeed. I was still struggling with it when the person on the couch said 'what are you doing' (it was my friends sister) I remember saying 'Im trying to open the door'. When I heard myself speak it sounded brain-dead and emotionless. She said I could just go out the door near her (the one I came in). She didn't question my leaving so damn early in the morning, thank God. On the way to the door I grabbed my bag. Now a trip for some fresh air resulted in me not having any place stay. </p><p>I got to the street and it was 1:30 am. I was very worried about where to go. I decided to stash my chronic and pipe and walk back to my other friends house (the one who gave me the acid). I figured he would have to be up and walkin around like he told me he did the night before. I started up the street, the whole time I remember being out of breath and smelling the chlorine in my nose from when I went swimming way earlier that day. I felt detached from society a wondering mad-mad or a drugged up psychopath. (1:50am) I remember passing the Mobile station and hearing Eric Sermon feat- Marvin Gaye 'Just Like Music' at a very high volume coming from a car parked there. There were a couple people there just standing around cars. As I walked by I remember feeling like the people were talking about me, but when I looked over I couldn't tell if they were even looking in my direction. I felt threatened by the situation and thought best to keep on walking. Even as I got farther away the music was still echoing in my head and driving me crazy, It sounded so loud.</p><p>At about 2:05 I got to my friends private road. I remember walking past the spot where I bought the LSD and feeling like it was days ago. I was walking in and it started to drizzle, the rain felt cold. (2:15) I got to my friends house and didn't see him anywhere, the sky and trees looked demonic and nightmarish. There were colors and distortions everywhere. I look at his window and no light was on, then I saw a person I never seen before in his living room walkin around. Then I remember him telling me earlier that week that his aunt and cousin were staying at his house for the weekend. I walked over to a spot near his house and lied down on the wet grass soaked to the bone, I almost started crying but felt no good would come out of it and sucked it back. I laid there for about 20 minutes. I got up at about 2:40am. I felt like the rain drops were falling on my soul, and beating me down. Almost like there was no hope with rain. I stood up and decided I had no choice but to go back the way I came, to the Mobile station and call my sister up. </p><p>(2:50am) I remember leaving the private road when the rain picked up, it was pounding down on me. Then I had a vision of my nephews, who look up to me. I thought of my family telling them I was a horrible druggie, and I thought I would never see them again. I'm not sure how this came to mind but it hurt my feeling and made me angry at myself.</p><p>(3:00am) I got to the Mobile station. Luckily I found a quarter in my bag and called my sisters house. I knew I would have to tell them about the acid, and the bad trip, they would be mad. I again sounded brain-dead and emotionless even though I was full of emotion. I told her I was having a bad trip, she sounded concerned and told me she would be there right away.</p><p>As I sat there I thought about a lot of things. Most thoughts made me feel horrible and irresponsible. My self esteem was shattered. The Rain kept on pounding down but at this point there was a little relief. At about 3:20 am they arrived. I got in the car ready and willing to hear some bitching from either my sister or her boyfriend. My sister asked me again what happened and if I was OK. I talked as little as possible, still sounding like I had half a brain. They weren't mad just worried. The rest of the ride was silent except for the rain I heard still pretty loud. I felt better and the rest of the night was easy and short lived. Sleep came pretty quick.</p><p>Its been 4 months since that horrible night, and I've done acid again since. Why? I don't know. </p><p>I will never know why I do the things I do.</p>"
}
