{
 "title": "Travels on the Healing Road",
 "author": "sganesh88",
 "citation": "   sganesh88. \"Travels on the Healing Road: experience with MDMA (ID 96611)\". Erowid.org. Aug 13, 2013. erowid.org/exp/96611",
 "substance": "MDMA",
 "bodyweight": "105 lb",
 "header": [
  [
   "DOSE:",
   "150 mg",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "footer": [
  [
   "2011",
   "ID: 96611",
   "Female",
   " ",
   "19",
   "Aug 13, 2013",
   "Views: 936",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I was first introduced to Ecstasy in the spring of 2007, while recovering from a car accident that was nearly fatal and left my facial features permanently disfigured. A friend suggested I go to a rave with him, and while I had no interest in drugs I decided to go just to see what a rave was like. Shortly after arriving, I decided this just wasn't for me, and knowing the friend was my ride home and would stay til it ended I said eh what the hell and asked him for a pill. This single experience, which will be described in another experience report, forever changed the course of my life. I had been struggling to overcome the memories and the pain caused from the accident, was very depressed and sometimes wished the wreck had done me in. MDMA opened me to emotions and feelings I hadn't felt since the wreck and feared I would never feel again, and reminded me who I was as a person. An interest in psychedelics was born, and shortly thereafter I stumbled upon an article about MDMA psychotherapy. Having recovered from a depressed slump caused by post-traumatic stress while using this substance, I studied the principles of MDMA-assisted psychotherapy heavily over the next couple years. Several friends over the years, after hearing me talk about the subject, expressed interest in going thru an MDMA therapy session of their own, and using my knowledge I have obliged in a few cases, acting as the therapist. The following report is about my most recent experience performing psychedelic therapy, an experience I feel important to share. The weight, age, substance and dosage are those of the young woman receiving the therapy, not of the therapist, as this report is of her experience from my point of view.</p><p>My friend Holly has been going through an extremely difficult time in her life. She's 19, mother to a 3-month old girl, and living with her parents after leaving the baby's father. We hadn't talked in nearly 2 years at this point, her ex having told her she couldn't talk to any other guys, and by the time of this session we had only been talking again for maybe 2 weeks. Holly is a beautiful young woman and I remembered seeing her once at a rave so I felt obligated to tell her about MDMA psychotherapy. We discussed it and once I let her know I was comfortable with playing the role of therapist she told me she wanted to give it a shot. We decided on doing it a few days after Halloween while her baby was with the father. I obtained 300 mgs of molly, 150 mgs each, which I reagent tested and knew was extremely pure, and on Nov. 2nd picked her up right before midnight. At this point, our adventurous night together began.</p><p>I showed her the capsules and then we began driving towards a nearby canyon I was rather fond of. The canyon was closed, so we then turned around and headed for a different canyon, one with several ski resorts and which I knew had a road which led over the mountain to Park City. During this drive we talked about the usual things friends talk about, then before reaching the canyon she asked how this therapy session was going to work. I asked her what she wanted to accomplish through this therapy session, she responded by saying she wanted to know what she should do about the relationship with her ex, and whether or not to keep their baby or give her up for adoption. Putting it simply, I told her to remember those goals and that when the MDMA began taking effect to bring the subjects up when she felt ready. The canyon to Park City was surprisingly open, and I let her take her capsule right as we began the journey over. </p><p>+0:00. We drove through the icy canyon to Park City. She said she wasn't feeling anything yet.</p><p>+0:40. We stopped to get gas in Park City, at which time I chose to take my dose of MDMA. We began the journey back through the canyon. However, the road was too icy, so we turned to head back to Park City.</p><p>+1:05. After driving barely a mile back toward Park City, the MDMA hit us both and hit us hard. Having a hard time focusing on driving, I pulled over into a small lookout until the rush passed. I had recently purchased a pair of crystal Poi and brought them out, and we played around with those for a little while. </p><p>+1:30. Once I felt okay driving again, we continued the journey back to Park City. During the drive down, our therapy session began.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>+1:40. While driving down the canyon, Holly began talking about how her and her ex first met. Immediately, I turned the radio off and listened intently. They met during her senior year in high school, at a time where she partied a lot and was with a lot of different guys. As the story went on, I came to learn just how much this guy did for her, supporting her through an alcohol problem and staying with her despite being cheated on several times. At the time, she didn't really know how bad it hurt him when she cheated, a fact she'd told me on several occasions, and over time she stopped cheating and learned how to be in a relationship. She became pregnant, and though adoption was discussed they chose to keep the baby. </p><p>+2:00. As she told me about their past, I noticed that both her voice and facial expressions were very blank, almost like she were possessed by these memories. We got to this point when suddenly she began telling me what she called 'realizations,' connecting these memories to her current personal values and realizing the values she now has came in large part from being with him. We talked about this more, but then realized we were in an unfamiliar neighborhood and tried to get back on the canyon road.</p><p>+2:20. We came to a main highway only to discover that we took a wrong turn somewhere, as we were nearly 20 miles from Park City now and just about to enter Heber City. As Heber connected to a highway which would lead us back to the main freeway we needed to get on to go home anyway, I turned towards Heber and got on that highway. We continued discussing the things she had discovered while telling me about their relationship, and I could already tell that she was going to benefit from this therapy session. </p><p>+2:30. The next hour was spent trying to decide on and get to our next destination, eventually deciding to go to Draper, a city which had a really nice view of the Salt Lake Valley and many places to park. We eventually stopped at a church parking lot, and once parked her second period of memory recall began.</p><p>+3:25. On the way up to Draper, she discussed how her ex's mother was in a similar situation as her, currently going through a divorce and living with family there. She mentioned that her ex's dad had been abusive, and while mentioning in passing that her ex had also been abusive (a fact I did not know at the time), she chose to pick up where she left off. Her ex, Jeff, won a half million dollar lawsuit in high school, and as a result both his house and his car were fully paid off.</p><p>+3:45. She began discussing her alcohol problems, which she went to rehab for and eventually overcame, but that were very damaging to their relationship. By the time she had become pregnant, she had quit all drugs except marijuana and was loyal to him, never cheating or even talking to guy friends during this time. Her ex seemed to be ignorant of the fact she had changed so much for him, and didn't believe any of the changes would last after the child was born.</p><p>+4:15. The discussion then turned towards the abuse, and I was really proud of the fact she was telling me about this with the same straight face and calm features as her first memory recall. Physically assaulted several times, she eventually came to realize that it was a bad environment for their child and 3 weeks prior to Halloween moved out.</p><p>+4:25. Once again, she snapped out of the memory and began to make new connections. It was also at this time that the major decision she had set out to decide, what to do about her ex and whether to keep their child, began to form itself. She came to realize that whatever was good about their relationship early on was now gone, and they would never again be like they were then.</p><p>+4:30. We began driving back down towards another nearby city, Bluffdale, where we wanted to try and rest a bit since it was almost sunrise and she'd said she was sleeping at a friend's house. Discussing her revelation that things were over, I was convinced she had hit a turning point, and that the therapy had shown her which path to take: putting her ex in the past and moving on.</p><p>+4:50. We didn't sleep once we got parked in Bluffdale, though we did watch a news special from a few years back, Ecstasy Rising, that led to us discussing her views on the therapy. As Holly described it, this was like no ecstasy experience she had ever had, and she was amazed at how easy it was to look back at these memories without feeling the pain she usually felt even thinking about him.</p><p>+6:20. After talking and watching Ecstasy Rising, we left Bluffdale and I went to take her home. Over 6 hours had elapsed since taking the MDMA and I felt we had made a lot of progress this night, but she wanted to drop by and say hi to my parents first so we headed to my parent's house.</p><p>+6:40. Shortly before getting to my parent's home, her 3rd memory recall episode occurred, but due to the drug mostly having worn off she wasn't as prepared to handle it. Beginning to cry, she began asking why he abused her, how could anyone claim to love you when you beg them not to physically hurt you as they ignore your pleas and assault you so badly you fear for your life? We arrived at my parent's house and I was able to explain to her how this memory just reinforced the fact things would never be the same. If she went back, he would just beat her again, it would never stop, and this memory came to solidify her conviction to put whatever love she had for him in the past.</p><p>+7:00. While I hadn't taken it into consideration, seeing my family at this point was one of the best things that could occur to help her sort through the events and memories we discussed that night. My mother and stepfather are both very friendly people, and as my stepdad let me in he recognized Holly from years ago, giving her a hug and telling her how great it was to see her again. That he remembered her after only seeing her once over 2 years before caught her off-guard, and I could tell she was touched by this as well as the hug. My mother then arrived and welcomed us in, offering Holly a drink and a seat by the fireplace, then asked what we were doing out there at 8 am. Choosing to tell part of the truth, we told her about our adventures through the canyon, getting lost and ending up in Heber. Amused, she teased us about the fact neither of us ever sleep at night. My mother and Holly got along really well, and talked about gardening and eventually she told my mother she had a daughter. This also proved to be an unintentionally good choice, for my mother was a single parent of 3 during most of my childhood. They began discussing the difficulties of being a single parent, but as my mother made clear it was well worth the effort. My mom essentially picked up where I left off, telling her nearly the same things in response to the abuse he had inflicted and suggesting she gain full custody then raise her baby as a single mother. </p><p>+8:45. We left my parent's home after nearly 2 hours, with Holly arriving home around the same time as they live within a mile of each other. She thanked me for the night, we hugged then she went inside to get some sleep. I found it interesting to note that, even though it had been over 8 hours since taking the capsule, I still felt the euphoric, peaceful effects of the MDMA quite strongly.</p><p>She and I talked the next day, and she told me once again that she felt like this experience was unlike anything she'd had before. To quote her exactly, 'I have been in therapy for 8 months, and I feel like last night did more for me than all 8 months of therapy did'. Over the next few weeks I noticed a definite change in her attitude toward life. Unfortunately, a month later she lost her job and the father of her baby was suing for full custody and planning to move out of state. She fell hard into using opiates, and was eventually admitted to rehab for heroin addiction. She's now gotten her life back together, and has joint custody with her ex, who never moved. Due to all the issues that erupted shortly after this therapy session, she has asked me to do another one, which we plan to do in the next few weeks, to help reinforce our first session.</p><p>While this experience report is told mostly as my own observation of another's experience, I chose to submit it because I feel this experience shows the benefits of MDMA psychotherapy, and as I took the same dose as her, this is a story about an experience we shared on MDMA. Holly reviewed this report and told me not to change a word, and specifically asked I post this experience report so people could learn the benefits of MDMA psychotherapy from her experience.</p>"
}
