{
 "title": "The Real Natural Ecstasy",
 "author": "Roundablock",
 "citation": "   Roundablock. \"The Real Natural Ecstasy: experience with Yohimbe (5x extract) & Cannabis (ID 9663)\". Erowid.org. Apr 15, 2002. erowid.org/exp/9663",
 "substance": "Yohimbe (5x extract) & Cannabis",
 "bodyweight": "230 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Yohimbe",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "1995",
   "ID: 9663",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Apr 15, 2002",
   "Views: 27956",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nThis herb combination was always the best to me. Better than the herbal X that was all the rage at the time, which we all know was overpriced crap for fools. For the same price a good yohimbe extract was a better and more economical. All other reports ive read on yohimbe experiences seemed like its a disappointment. used in proper dosage and in absence of unfriendly drugs ( like DHEA, speed, cocaine,alcohol, stimulants in general)its incredible.</p><p>For a year or two in 1994-96 I regularly used yohimbe extract in the morning, along with a joint or two. I usually took 2-4 dropper fulls either in cokacola or in OO gelcaps. the extract was a 5x ethanol extract. in about twenty minutes id get the most elated feeling ive ever gotten next to mdma, but only with cannabis. I'd also smoke a joint or two. My daily trip to work consisted of a goodly walk, then hour bus ride to work. Id be very high, but alertness which I dont usually have with pot. The sun would shine, birds would sing, the world was a beautiful place. During this period I was usually very down. This was one of the most pleasant drug combinations Ive ever had. Overdosing to enhance the effects is seriously dangerous. One time I was down to the bottom of a bottle of the gaia brand and couldnt get the stuff in the dropper, so I poured it into a shot glass. I thought it was only 3-5 dropperfulls, onle 1/5th an inch in the shotglass. I added soda, swallowed and almost vomited, that itself shouldve been a clue that I took too much. I started my normal route to work, and it was a miserable day. Rainy, though I usually love them, and cold. By the time I reached my transfer, I was vomiting. I shook all the way to my job, where I hid in the dumpster area puking again.This was the only bad experience Ive ever had. After about three hours I didnt feel like death. Respect the herbs of the earth, and they will respect you. Dont abuse drugs.</p>"
}
