{
 "title": "A Wonderful Substance",
 "author": "pentypolly",
 "citation": "   pentypolly. \"A Wonderful Substance: experience with Pentylone (ID 96666)\". Erowid.org. Oct 3, 2012. erowid.org/exp/96666",
 "substance": "Pentylone",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "bk-MBDP",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96666",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2012",
   "Views: 3067",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nPentylone, overall, has become my drug of choice,having tried all the classic mainstream - including - hard drugs (heroin, meth, etc).\r\nIt is a very unique and interesting compound. I say unique because each ROA produces markedly different effects- although the 'base' properties are of a euphoric, entactogenic, sedating and calming yet stimulating drug. I can stay up for days with this or take one dose and be asleep within 6 hours. Pupil dilation does not really occur unless I have taken a massive dose or have been on it for a day or more.\r\nMy first experiences with it were strictly IV. This produced one hell of an intense rush for sure, and was almost overwhelming. The cool part about this is that the rush lasted from 30min-1hr and subsided over the next 3-4 hours, slowly fading, with the high all the while there in the background. IV does fuck with my coordination somewhat, and I had some trouble walking straight.\r\nNext I tried vaporizing it with foil and was very surprised. This method gave a rush almost equal to that of IV, with much less material required, but it grabbed me by the balls less, and had much less bodyload with a much shorter duration overall- maybe 1 , 2 hours tops. Additionaly, it produced pronounced paranoia and a compulsiveness which was nonexistent with all other ROAs. I would not recommend doing this often anyways as the vapour/smoke is VERY harsh on the lungs.\r\nInsufflation seems to be the way to go with this one. The effects were very, very pleasant, and not fiendish at all. I still feel it immediately, with the high then gradually ... filling in. This ROA was the most mellow, and I'd say the most euphoric and MDMA-like. I can definately still function while being high as all fuck, and it isn't all that noticeable.\r\nHave nothing to report about oral, but have a feeling upon trying this I may be surprised yet again. I gave a friend who was in need of a 'pick-me-up' a 60-80mg bomb and he was as all smiles within an hour. Everyone I know who's tried it loves the stuff.\r\nThe only downsides to this compound were that with IV, my back hurt from being so tense. Aside from that, the rapid weight loss uncharacteristic of other stimulants, even while staying nourished and hydrated.\r\nEven with days of repeated dosing there was no chemical hangover, just the expected physical exhaustion due to sleep deprivation, etc.\n\n\n"
}
