{
 "title": "A BODacious Night",
 "author": "Starburst",
 "citation": "   Starburst. \"A BODacious Night: experience with BOD & Nitrous Oxide (ID 96679)\". Erowid.org. Aug 22, 2012. erowid.org/exp/96679",
 "substance": "BOD & Nitrous Oxide",
 "bodyweight": "60 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   "oral",
   "BOD",
   "(powder / crystals)",
   "  T+ 5:00",
   "1 cart.",
   "inhaled",
   "Nitrous Oxide",
   "(gas)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96679",
   "Not Specified",
   " ",
   "22",
   "Aug 22, 2012",
   "4352",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Setting: summer house party of university/college-aged people, around 30-40 people, most on psychedelics, some drunk, some both.</p><p>Duration: 12h</p><p>Coming up was gradual, started at about T+45 minutes, which began with a psychedelic mindstate. Shortly after, queasiness set in. It was hard to handle, actually - it was a burning sensation in my stomach. I spent a while lying on a couch, then felt the need to vomit. Spending a few minutes in the washroom, I tried to vomit, but nothing would come out. At around this time, I could hear people at the party yelling that candles would be lit, and that they needed to find me (it was my birthday a few days prior, but I had no idea the people at this party made arrangements to celebrate it!) The uncomfortable feeling in my stomach, and the psychedelic mindset, strong at this point, did not permit this to be good timing to blow out candles, especially since all this was a surprise! After psyching myself up a bit, I left the washroom and was greeted by a massive, colourful homemade cake. Blowing the candles out, I declined on eating cake just yet due to stomach pain, but thanked my friends very much for their lovely gesture.</p><p>At about this point (T+1.5 hours?), the visuals developed. They were fairly intense, colourful, and focused on objects warping and blurring. Strong CEVs as well. I also found myself much more sensitive to sound, moving to the quietest rooms of the party whenever the present setting became too loud for me. The mindset was also very interesting - I felt a lot of insight to what was going on in my life, and spent a lot of time coming to interesting conclusions about my life,  the world around me, abstract concepts, my friends, etc. Since the mindset and visuals were powerful experiences, I found myself not being very talkative throughout the night. This drug was also wonderfully humorist. I found everything to be a lot more hilarious than otherwise. I spent a long time listening and laughing while one of my friends who was drunk and also on BOD going on very long rants about silly things, and even serious matters made highly amusing by how he was conveying the topics. (On that note, said friend insufflated his dose of BOD, and found it was very painful. Worse than 2C-E, according to him).</p><p>At around T+5 hours, I inhaled a small balloon of nitrous oxide to complement the experience. My mind felt spacier, as expected, but the sensory experience became much more intense. The visuals, in addition to what I was already seeing, were composed of all objects and people in view suddenly gaining several sharp, dark contour lines around them. These contour lines, along with the object/person, would pulse madly. Sounds became much more echoed. I felt like I was sinking and spiralling into a dark, deep corner of myself. Truthfully, for a moment I felt that what I was experiencing may have been too intense to handle, but that feeling passed quickly, and the different visuals and sinking sensation became much more manageable.</p><p>By T+8 hours, the visuals and mindset began a very steady and slow decline that would last for another 4 hours. The decline would occasionally be broken by a small spike of returning psychedelic feelings, but would then fade shortly after. I spent a while trying to encourage some friends to leave with me, since we all had a long commute in the same direction back to our homes, but eventually became lazy and relaxed on a bed with a few others, unable to sleep. At about T+12 hours, I take a friend's ride, along with my boyfriend, heading back in the direction of home. By this point, I would say the high was entirely over, except for some lingering after effects that persisted until I returned to my boyfriend's house and crashed (T+16 hours, perhaps?)</p><p>All in all, I enjoyed this substance very much and would definitely do it again, although not any time soon. The initial stomach pain, and the hilarity reminded me of 2C-B, while the mindset and duration reminded me of LSD. The visuals were pretty unique. I enjoy how it combines a deeper mind experience with lighthearted fun - two things I love most about substances.</p>"
}
