{
 "title": "Social to Solo to Crisis to Salvation",
 "author": "Anonymous",
 "citation": "   Anonymous. \"Social to Solo to Crisis to Salvation: experience with Mushrooms - P. cubensis (ID 96677)\". Erowid.org. Oct 15, 2013. erowid.org/exp/96677",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1.3 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 96677",
   "Gender: Male",
   " ",
   "Age at time of experience: 26",
   "Added: Oct 15, 2013",
   "Views: 590",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Myself and a friend, let's call her N, prepared 2.6 dry grams of Psilocybe cubensis in a tea form. I held a low boil and tore apart the mushroom flesh gradually as it boiled. This lasted for a few minutes while the water darkened.</p><p>We split the resulting liquid and threw out the solids, which I was considering eating but decided not to.</p><p>Half an hour to 45 minutes into the experiment, we both began to feel the bare hint of the effects. The most apparent earliest on were the tactile effects I tend to get on mushrooms, which are nearly impossible for me to remember or describe. The best I could do is to say it's like a lot of shifting tingling sensations rolling through my body, and a drunkenness.</p><p>We were sitting outside and the weather was somewhat cloudy. As the effects progressed, we began to see shifting of the clouds, as if layers were separating and wobbling back and forth, breathing, wafting, as if screens of the image were being pulled out of phase with each other.</p><p>The patterns in the clouds were intensely interesting and it seemed as if I could see them better stoned than not stoned. This corroborates with the scientific finding I had heard that visual acuity is increased by small doses of mushrooms. I particularly recall perceiving the clouds to have fractal patterns, and I've heard that fractals exist all over nature so it wouldn't surprise me if this were another perception of the real world enhanced.</p><p>When I closed my eyes, I could see various visual effects flowing and forming and warping in my visual canvas. </p><p>They appeared to be geometric, vine-like or snakelike, with many eye-like shapes, and lots of repeating shapes strung along like the component pieces of polymers. It had a somewhat South American feel to it, but also somewhat of a paisley look.</p><p>Some time was spent occupying the dog, making sure she was happy. I couldn't possibly allow her to sit alone and be sad about the absence of Dad, who was out with his girlfriend. I felt compelled to throw her stuffed squirrel toy around to make her happy and playful.</p><p>This was rewarding in a special way, due to the empathy mushrooms tend to give me. The dog gets so lonely sometimes and makes such lonely howling sounds when she's in that state. I refused to let the mushrooms interfere with my ability to care for my prime responsibility, as I was on dog duty and would be upset at myself if I couldn't fulfill my duty because of inebriation.</p><p>After a couple hours or so, my Dad and his girlfriend showed up. Soon they hung out with us and I was drawn away from the fascinating visuals and into the realm of social interactivity. It seems mushrooms don't inhibit my ability to function socially and think straight under 'talking in person' circumstances, and may even enhance my social functioning. They do however make it very difficult to type and text.</p><p>Eventually, N had to leave because she was working in the morning. This was roughly 5 hours into the experience. She told me she had come down and would be just fine driving. I was surprised that she'd come down, but she had recently used similar substances so her liver may have been quicker to destroy them than mine was. </p><p>She made it safely home by the way. While trying to text her to be reassured that she made it home alright, there was a very interesting glow about the screen and the text.</p><p>As soon as she left though, I isolated myself in my room to try to enjoy the rest of my trip in solitary peace. </p><p>Well it just so happens that every time I'm solitary on mushrooms I'm far from at peace. A pleasant experience of drunkenness and visual novelty in a social setting immediately turned into an introspective crisis.</p><p>There was a lot of dwelling on things, and I had a misunderstanding trying to explain my experience to a sober friend (let's call her J) who sees all highs as the same. Mushrooms are impossible to explain to someone who thinks they're no different from pot, especially when you're on them. This feeling of isolation from a best friend didn't help the introspective crisis.</p><p>I spent some time thinking about how alone I feel in this world. I'm a loner by nature, and I have social anxiety issues, which had come up in conversation earlier with N. I'm comfortable being a loner while sober or while on cannabis, but mushrooms makes the solitary experience so much more difficult to cope with. It makes me feel the need to cling to someone.</p><p>A stoner friend of mine from across the continent, let's call her K, became my source of social comfort on MSN at some point, during which I told her how difficult a time I was having and talked with her about my anxieties and worries and my loneliness. She helped me to feel loved and understood in a way my sober friend couldn't.</p><p>Before really getting things out and dealing with them though, while she wasn't quite available to talk to, I resorted to laying down while listening to my brainwave entrainment music. It was a very calming modifier for my experience, as I'd expected it would be. It helped a great deal but I still had some tensions. Between that and playing a computer game, I distracted myself while I waited for K to respond.</p><p>After a while, she became responsive enough, available enough, to talk me through some of my frustrations. She asked me what I wanted to talk about and I insisted to talk about my negative thoughts and feelings despite her efforts to steer me away from them. I felt the need to bring it all out into the open instead of let it swirl in the background of my mind out of my conscious reach.</p><p>I explained my feelings of loneliness and isolation from the world, my regret at how being so introverted makes me incapable of maintaining a true social life. I told her I felt that the mushrooms were telling me to be more social, that I'm not happy the way I'm living right now. My sober mind is repelled by the idea that I should try to modify my social habits because of a drug, but mushrooms have told me this same thing before, that I was neglecting my social life.</p><p>I also felt sad about the general condition of living in my hometown and not belonging, not having very many friends nearby. I told K about how I wish I lived with my best friends on the coast where I felt I belonged quite perfectly.</p><p>After crying out my frustrations, with the love and support of my dear friend K, I felt saved, cleansed, mostly free of tensions though I definitely felt physically tense especially in the jaw. I also felt like I'd figured something out about myself and this was relieving.</p><p>I continued to pass the time alternating between laying back and listening to Terence McKenna talk about the mushroom and its potential role in human history, and playing a videogame. McKenna definitely helped me to think positively about the mushroom instead of worrying about my social inadequacies. When I felt almost 100% sober and somewhat tired, I finally went to sleep. This was roughly 8 hours after ingestion. N had felt sober roughly 5 hours after ingestion.</p><p>In summary:\nTrip began with interesting visuals and lots of tactile sensations, and a general drunkenness.\nTrip was steered into a social setting by the invasion of sober people.\nTrip was steered into introspection when N left to go home.\nTrip became a crisis of confrontation with the self.\nFriend K began to assist me between periods of unreachability.\nDuring periods of unreachability I used video games, Terence McKenna, and brainwave entrainment to cope.\nDiscussion of internal issues with friend K resulted in crying out my tensions and feeling much better.\nVideo game allowed me to pass the rest of the time (comfortably) until sobriety.\nThoughts for the future, aka what I'm bringing with me:\nMushrooms will definitely be in my future again. I don't fear them as much as I did before and will try increasing dosages in the future, under more controlled, mentally safe circumstances.\nI intend to better understand their effects and how to guide them.\nI already know that I'd be best off knowing that I have someone like K to talk to the whole time, an emotional guide.\nSocial attempts to meet similarly minded hippies may be necessary in order to satisfy the mushroom's demand for a social life.</p>\n"
}
