{
 "title": "A One Week Retrospective",
 "author": "etal",
 "citation": "   etal. \"A One Week Retrospective: experience with 4-Fluoroamphetamine (4-FA, 4FMP) \t (ID 96866)\". Erowid.org. Aug 14, 2012. erowid.org/exp/96866",
 "substance": "4-Fluoroamphetamine (4-FA, 4FMP) \t",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "4-Fluoroamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96866",
   "Not Specified",
   " ",
   "1826",
   "Aug 14, 2012",
   "3926",
   " "
  ]
 ],
 "report": "<p>I did not see very much consolidated or entirely reliable information on this chemical previously. After spending a week with it and some friends, I learned a lot and thought it would be responsible to share this with the community that has helped me so much already. </p><p>It seems to me that most people that have tried 4-Fluoroamphetamine have used it at recreational doses of 100mg or more. The community seems unimpressed. After reading some reports, it sounded like an ideal drug for concentration while having less pure energy and speed than normal Amphetamine at therapeutic doses.</p><p>I work at a transcription service which means I type as fast as I can while listening to people mumble into cell phones with bad reception for several hours a day. A little bit of speed comes in handy, but most speed is too speedy for sitting down and being bored. 4-FA appealed to me as an ideal substitute for the usual Adderall or Ritalin.</p><p>Four of us tested multiple doses of 4-FA over about a week's time. We are adults aged 18 to 26 all weighing under 150lbs, two males and two females. We each have extensive experience with a wide variety of drugs, sticking mostly to psychedelics, empathogens or marijuana for our entertainment and myriad small doses (and a few binges) of amphetamines and related chemicals for productivity.</p><p>The four of us do a variety of drugs for their beneficial effects on our lives and are well educated on the chemicals being stuffed down our gullets (or diffusing into our mucous membranes). We took 4-Fluoroamphetamine at lower doses than usually reported for the purpose of productivity. These are general notes collected from a week's worth of testing. </p><p>Doses ranged from 20mg to 50mg, sometimes insufflated and sometimes taken orally. We decided that 40mg orally was happy and productive without being too distracting. Snorted, 20mg to 30mg was preferable, but the intense burn added a great deal of hesitation. Scar tissue was present after a single sublingual powder administration of 20mg. Higher doses than these are mentally pleasant as noted by other researchers.</p><p>Water intake was carefully measured during all testing.</p><p>It took nearly an hour for the effects to peak when taken orally on an empty stomach, even longer with food. The major effects seemed to last for four to six hours, depending on tolerance and route of administration, etc. A mild stimulation and desire for productivity was present until sleep. These did not necessarily prevent sleep**. Some day-after mood lift and focus was present and helpful.</p><p>**But one could (and many did) stay up all night being relaxedly productive and take another dose in the morning. Sleep was voluntary and refreshing, even with only four to six hours rest. There were no major negative side effects from staying awake for up to four days. Redosing was optional and seemingly non-addictive, though a few of us had fun staying awake for two to four days.</p><p>4-FA seems to lack the distinct speedy edge of typical amphetamines and similar compounds, but it allows one to maintain a calm and focused mindset with a mild stimulation and mood lift. Speech was easy, but there was no intense desire to converse.</p><p>Tolerance developed quickly. Redosing was difficult after two or three tries unless supplementing with 5-HTP (once a day or up to four times a day depending on amount of 4-FA per day). A healthy diet, vitamin supplements, and anti-oxidants were very helpful in potentiating effects and reducing the already minimal body load. There was almost no tachycardia present. Eating was easy enough, though there was a slight depression of appetite.</p><p>There was a healthy synergy with moderate doses of marijuana and/or alcohol. Creativity and sociability increased dramatically accompanied by a fine mood lift. An increased ability to avoid negative thought loops or anxious mindsets was noted in individuals predisposed to such, though this ability lessened with an insufficient diet or appropriate supplementation of 5-HTP.</p><p>Chemistry:</p><p>I'm planning to be a chemical engineer and have been getting my toes wet and using drug chemistry to further my interest on the subject. Since there is not much information out there, I thought it would be helpful to consolidate everything I've learned in total about this chemical through reading reputable sources, some background in chemistry, and personal experimentation.</p><p>With all amphetamines, there is some worry about neurotoxicity. I have seen some concern about the neurotoxicity of halogenated chemicals as well. The concern may come from the chemical fact that halogens tend to be volatile substances with a high electronegativity.</p><p>However, a F-C bond is the strongest single bond in organic chemistry with a reduced electronegativity thereby most likely increasing the molecule's stability and half-life. I imagine this would reduce neurotoxicity, but I have not verified this. This could also account for the long duration of effect. The positioning of the Fluorine atom may be responsible for the seeming anti-depressant and serotonergic qualities.</p><p>Based on my own subjective effects of this chemical, I would think that there is very little neurotoxicity. The come-up was easy and gentle as well as the come-down. There were no psychosis-resembling aftereffects that I have experienced with typical amphetamines. Long-term use did not seem physically or mentally taxing. The limiting factor for my enjoyment of this chemical seems to be the amount of serotonin present in my brain.</p><p>This seems beneficial since most 5-HTP supplements I have seen are required to be taken with food lest one vomit it back up; most people forget to eat on speed and this would help to enforce it, i.e. you have to stay healthy to keep up the fun. As well, dopamine seems to be the cause of most addictive properties of a given drug and this drug has few, if any, dopaminergic qualities.</p><p>Overall, I think 4-FA  supplemented with 5-HTP would serve as a useful medication for AD(H)D or depression or could be used as a productivity aid with few negative side effects. We will most likely continue to use it for work or aid in quiet creativity, but we would seek out something closer to pure Amphetamine or 6-APB for a fun and speedy time.</p>"
}
