{
 "title": "My Favorite Drug of All Time",
 "author": "BuddhaSeeker",
 "citation": "   BuddhaSeeker. \"My Favorite Drug of All Time: experience with 6-APB (ID 96884)\". Erowid.org. Jul 24, 2012. erowid.org/exp/96884",
 "substance": "6-APB",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "6-APB",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "96884",
   "Male",
   " ",
   "22",
   "Jul 24, 2012",
   "12898",
   " "
  ]
 ],
 "report": "<p>I had previously only taken this substance at 150mg, which yielded similar effects, but not as good.</p><p>Setting: Camp Bisco (music festival) 2012</p><p>I dosed at 8:00pm alone in the tent. I hung out by myself until 8:25 or so, and headed out to the main stage where my friends were.</p><p>At 8:35pm I was already feeling the effects. I thought I may have taken too much this time. I was feeling very antsy for the first few minutes, but then I realized I was in for a great time.</p><p>At 8:40pm Big Gigantic came on and I was rolling balls. The come-up was very quick. At 8:30 I felt nothing, and by 8:40 it had fully kicked in. It was so much more intense than I have ever rolled on MDMA, even on doses as high as 300mg of known pure substance. I was really excited for Big Gigantic, so when they came up I ran up into the rave.</p><p>At this point, I lost all track of time. I do remember generally what went down.</p><p>During the Big Gigantic show, I alternated between raving and standing there moaning, looking up at the sky with my hands in the air. When I say moaning, I was literally moaning in ecstasy. Long moans straight from the chest. I could feel the vibrations throughout my whole body and it felt better than anything I've ever experienced. I didn't realize it until after, but I think I was basically 'OHMing.'</p><p>When I decided to leave the rave and head to the back with my friends, I yelled out, 'I love you all! Peace to everyone!' which was definitely well-received by the people around me. I got a bunch of high-fives and 'dude... you're awesome!'s.</p><p>When I got back to my friends I got to sit in a lawn chair for the end of Big Gigantic. I was rolling ridiculously hard. The closed eye visuals were better than anything I've ever seen. Better than high-doses of shrooms, even better than DMT. I've found a few pictures in Blatte's backgrounds that are similar to what I was seeing:</p><p>http://imgur.com/a/rz4S8#1</p><p>Generally, they were spiral-based and had similar colors. Many of my visions were dark around the edges, with the 'action' taking place just to the side or in the center of my vision. Full-on visuals are cool when you're tripping, but when you're rolling as intense as I was, there's nothing better. The beauty was astounding.</p><p>Once Big Gigantic ended, Bassnectar came on. His music was blowing my mind. The build-up that goes into the drops were exploding in my brain. The amount of energy he brought to the place was unreal. The light show was was also amazing. It was so bright and vivid that I felt like I was getting pushed back by the energy. It almost felt like a very strong wind, but made of energy.</p><p>We decided to go on the ferris wheel. This was pretty much the highlight of my experience as we got stuck up at the top at least once. We got to watch this 'alien music' with thousands of people across a field raving to it. It was absolutely unreal and I almost felt like crying.</p><p>After the ferris wheel I pretty much started to come down. Some of the effects were still there, and I still felt like I was rolling, just not as hard.</p><p>All effects subsided about 5 hours after dosing, and I didn't have any trouble getting to sleep, which is a huge plus because I have trouble getting to sleep even 8 hours after taking MDMA, which has a shorter duration. No depression for the two days after.</p><p>Overall, this has become by far my favorite drug. I'm pretty sure that I will never trip (on non-DMT substances) or take any other form of ecstasy ever again. 6-APB takes all the best effects of those drugs, combines and amplifies them.</p><p>You can roll way harder than you could ever roll on MDMA, get better visuals than any other drug, and best of all I have not yet experienced a single adverse effect from this drug besides a bit of sweating.</p><p>My prediction: in a few years 6-APB is going to be 'the' drug.</p>"
}
