{
 "title": "Epilepsy and Ecstasy: A User Report",
 "author": "Respondent 34",
 "citation": "   Respondent 34. \"Epilepsy and Ecstasy: A User Report: experience with MDMA (Ecstasy) (ID 96939)\". Erowid.org. Jul 20, 2012. erowid.org/exp/96939",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 96939",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 20, 2012",
   "Views: 1735",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nThis is a query regarding the effects of ecstacy on a person with epilepsy. I have done some searching in books and on the web, but am yet to find much information on the subject. (I did notice it was mentioned in your book)\r\nThe reason I am writing to you is that everything I have read says that ecstacy and epilepsy do not mix and it is not something that I should try. Being young and inquisitive I decided to find out for myself, and in a very safe environment I have tried a couple of Es. From my experience the short term outcome was that I had no seizures on any of these occasions and for several days afterwards. This is from someone who rarely goes a day without a seizure. (I have temporal lobal epilepsy, involving complex partial seizures)\r\nI acknowledge that I am taking a risk in relation to long term affects, but with such a new drug I think we all are. (It is no more of a risk than the prescription drugs I have to take that are no more than 5 years old.)\r\nI do not expect you to have an answer to this question, but would be interested if you had heard of other specific incidences of epilepsy and ecstacy or know of where I may be able to find specific research. I also thought you may be interested in this experience for your own research etc.\r\nAs an aside I have approval from my neurologist to smoke marijuana to aid with my seizures. It is something that I noticed improved things for me, and I followed this up with similar searches in books and on the net to find that this was not an uncommon experience.\r\nAustralian man\n\n\n"
}
