{
 "title": "Contact with Dead Relatives on E",
 "author": "Respondent 55",
 "citation": "   Respondent 55. \"Contact with Dead Relatives on E: experience with MDMA (Ecstasy) (ID 96946)\". Erowid.org. Jul 20, 2012. erowid.org/exp/96946",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 96946",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: 25",
   "Added: Jul 20, 2012",
   "Views: 1064",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nNot too long ago my sister, my girlfriend and I took E and we began talking about all the people close to me that have passed away and that had an influence in my life. Mainly I am talking about my father who passed away 8 years ago and my grandmother (his mother) who passed away 1 year ago.</p><p>Anyway, to make a long story short my sister was, with the lack of a better word, possessed by my father and grandmother. They were able to speak to me through her for a time of 3-4 hours. At first I was only being given information but later I was told who they were and was able to converse, interact, and ask questions. I learned things about my mother's own past, for example, that even she did not know. (i.e. that her sisters were sexually abused by her father). I know this may all sound unbelievable but there are so many things that were said that nobody else could have known and all turn out to be true.</p><p>My sister only remembers bits and pieces. She is only 22 years old, and I am 25. They acknowledged the fact that we were on E and said that it was only necessary at first to become uninhibited. With practice, the E won't be necessary. The second time it happened we were also on E. The third time it happened during the day and there was no E, however, it was for only a shorter period of time and my sister was not as relaxed and was a bit scared. We talked about my father and I about how life is after death, what they can and can't do, I talked to my grandmother about the moment she passed away which only she and I witnessed. She brought up things that only she could know because I was there.</p><p>I know I was on a drug, however, I believe it only served to relax and uninhibit us in a way that would bring this to happen. Supposedly, they were trying to communicate to us for a while back, saw the opportunity and took it. It was also the first time my sister had done E and we did it together to try and talk and solve family problems. My sister now has the power to see through people. See whether they are good, bad, honest, sad, happy etc. The problem is she sees more about people than she is willing to know and it freaks her out. We also spoke with my Uncle that I had never met, and the brother of one of my best friends who died several years ago. We learned that his ashes have not been dispersed by the mother which was not supposed to be the case and turned out to be true.\rResponse [from Nicholas Saunders?]</p><p>This is all within the realm of transpersonal experiences which can be invoked with these substances. \rI will relate a somewhat similar experience</p>"
}
