{
 "title": "Raving on E Has Become a Religious Experience",
 "author": "Respondent 53",
 "citation": "   Respondent 53. \"Raving on E Has Become a Religious Experience: experience with MDMA (Ecstasy) (ID 96978)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96978",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "1996",
   "ID: 96978",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 1177",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI have taken E since November '96, and I can truly say that it has changed my life. Every time I have taken it, it becomes a practically religious experience. I have taken E at raves only.</p><p>Every rave has been underground, so most people are there because they heard of it by word to mouth, so everyone is connected to each other somehow and the vibes are brilliant.</p><p>Since I first took E, I have been able to tell if someone has good or bad vibes from the moment I meet them, it is wierd. E makes me feel real, as if I belong somewhere. Within the last year I have been reading a book about angels, and I now believe that they are around us all the time. After I took E, that feeling of closeness with my angels is even stronger everyday. At raves, when I am completely engulfed in E, I can feel and sometimes see my angels dancing. I can feel their white energy/light all around. At one rave a good friend was kicked-out, when I closed my eyes, I could see him standing outside, with an angel above him, pouring white energy all over him: it was incredible. E has changed my life around, I am now more friendly and sociable than before.</p><p>All the people that I have met during and after taking E, have been magnificent, all friendly and nice. Even if we are not on E, we are all great with each other, friendly, respective, and loving. We all came to the conclusion that E takes the bullshit away, and brings the real you out. E takes you to a level of consciousness, where we can absorb pure energy.</p><p>Thank you for the books and information in them, it makes things clearer and answers many questions.</p>"
}
