{
 "title": "Rocket to Enlightenment",
 "author": "Respondent 83",
 "citation": "   Respondent 83. \"Rocket to Enlightenment: experience with MDMA (Ecstasy) (ID 96983)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96983",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "96983",
   "Not Specified",
   " ",
   "Not Given",
   "Jul 23, 2012",
   "Views: 1159",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nContrary to popular belief, there is more to the ecstasy scene than raves, dance clubs and techno music.</p><p>This past summer I tried ecstasy for the first time. I was at an outdoor music festival in Ohio called Hookaville put on by an amazing jamband called Ekoostik Hookah. A friend of mine whom I had been to countless shows with came to me about 20 minutes before the first band came onstage and handed me a glass of water into which he poured. He then smiled broadly and told me to drink it and look for him in about 20 minutes...</p><p>I was rocketed to the highest point in the universe. I have been on a few wild rides in my time but nothing came even remotely close to this. It was as if the whole world was sending energy through my soul! The more the music played, the more I danced and the higher I flew. After 10 years of touring with The Dead, I thought my 'life changing drug experiences' were long gone, but here I was, filled with an energy and lightness that could only be compared to flying. The warm summer sky brightened with the light of the full moon and I danced and smiled and sighed to myself in a cosmic haze of pure enlightenment. The music sailed through my body, I became part of the ebb and flow of the rhythm, swirling around and around in my own personal bubble of happiness.</p><p>Since that day, I have had a number of amazing experiences with ecstasy, all of which have become part of who I am. While LSD often opens a door to your soul, ecstasy opens a door to your being and shows you what is inside. The bonds I have formed with my friends, the love I have shared, and the incredible feeling of fullfillment I get whenever we are all together on ecstasy is something that has enriched my life like nothing else ever has. The lessons learned during these sessions are those which guide me along in everyday life. Love is the most important thing in the universe and without it, nothing else matters.</p>"
}
