{
 "title": "A Binge",
 "author": "Respondent 47",
 "citation": "   Respondent 47. \"A Binge: experience with MDMA (Ecstasy) & Nitrites ('TNT') (ID 96987)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96987",
 "substance": "MDMA (Ecstasy) & Nitrites ('TNT')",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   " ",
   ".5 tablets",
   "oral",
   "MDMA",
   " ",
   ".5 tablets",
   "oral",
   "MDMA",
   " ",
   "2 hits",
   "inhaled",
   "Inhalants - Nitrites"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 96987",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 2025",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nA binge on TNT, cocaine, ecstasy and speed</p><p>My friends and I went out 3 nights in a row, and on the last I took about 3 E's (two 'Love hearts' followed by 2 halves of McDonalds) we also had 'Vick' (which we normally use) and on this occasion 'TNT' (some kind of nitrate that you can buy in sex shops).</p><p>As I was 'coming up' on the final half I took two huge breaths of the TNT. All I can remember is my mind leaving my body and going to another place, feeling so wonderful, blisfull, no feeling of my body, my  thoughts completely clear and a feeling of 'freeness', floating freely around bathed in white (but not bright) and a slit of something different ahead, no sound.</p><p>The only description I have for this place is heaven. I imagine that this lasted only seconds but it felt like forever. I remember then feeling myself slipping away, I then realised with such clarity that if I didn't come back now I was never going to come back. Suddenly I felt my heart racing my chest heaving and I was back inside my heavy body.</p><p>I managed to stagger to a chair and all I could say to my friends was that I'd just been to heaven. I don't know whether it was just a big trip or perhaps if the 3 days of drug use (cocaine, ecstasy and speed) really just came to a head and perhaps for a moment I did die? But it was the most frightening experience I've had using drugs.</p>"
}
