{
 "title": "Tripping on the Music",
 "author": "Respondent 79",
 "citation": "   Respondent 79. \"Tripping on the Music: experience with MDMA (Ecstasy) & Various (ID 96990)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96990",
 "substance": "MDMA (Ecstasy) & Various",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   " ",
   "  ",
   " ",
   "Various"
  ]
 ],
 "footer": [
  [
   "1998",
   "ID: 96990",
   "Not Specified",
   " ",
   "Age at time of experience: 28",
   "Jul 23, 2012",
   "Views: 1312",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI first became aware of the dance scene in the summer of 1991 in Orlando, FL. I was almost 21 at that time and was a patron to many clubs, mostly to meet with friends, do a lil dancing, and to drink sociably.</p><p>As I spent time in the clubs and the rave scene, I learned of the different types of drugs that were readily available just by asking (it was easy to do then). Acid (LSD) was my first experiment (I have also smoked pot on a regular basis over the years), that was a blast! After dosing several hundred hits, I learned the effects were sporadic at best due to varied potency and improper handling.</p><p>My next experiment was with mushrooms, they grow wildly in the region of the US that I am from and were a fun, natural high that was easily dosed and absolutely FREE! I must mention that before I ever went out looking for mushrooms (and all the drugs I have tried), I did research both at the local public library and with some friends who had been doing drugs for years to make sure I was picking the correct ones.</p><p>The next chemical I chose to try was Ecstacy. As I started my use of this 'Love Drug', I found a new and wonderful experience that I had never before been able to achieve, either sober or with any other drug.</p><p>After about 6 years of use, and a lot of time, money, 2 years of legal problems, and the loss of several good friends (may they rest in peace), I decided that it was time for me to stop. I have had a lot of great times that will forever remain deeply imbedded in my soul from the use and sharing of ecstacy and other drugs, but there are a lot of bad times also.</p><p>With any drug you may decide to try, please know what you are taking, and know the environment you are going into. I am now more than 2 years sober and still enjoy the music scene as much as I did when I was using...... well, maybe not quite as much as when I was on ecstasy, but the music is the main reason why I ever started dancing in the first place, and the reason I keep going back.</p><p>I want people to know that you don't have to check out of reality just to have a good time in the club/dance scene, the music is a trip in itself. Remembering the music is always better than not remembering the trip, and do it safe!</p>"
}
