{
 "title": "Disillusionment with E After Losing Friendship",
 "author": "Respondent 95",
 "citation": "Citation:   Respondent 95. \"Disillusionment with E After Losing Friendship: experience with MDMA (Ecstasy) (ID 96992)\". Erowid.org. Jul 23, 2012. erowid.org/exp/96992",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 96992",
   "Gender: Male",
   " ",
   "Age at time of experience: 16",
   "Added: Jul 23, 2012",
   "Views: 1018",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nEcstasy came into my life at the age of 16. I was at a club and one of my friends offered me this 'new' pill to us kids. I had absolutely no idea what it was, but me being the stupid, curious kid I was tried a half of one with someone else I knew. Well, nothing really happened and one of my other friends who wouldn't try it said he knew that it would be stupid. Well, we both soon got a hold of some more e and we did it very often. After having said that he would not want to do it at all, he became as an big e-head as everyone else did during this time.\r\nWe soon started doing it every weekend and promised ourselves that we would only do it at the club. I soon saw how much trouble it gradually could bring into someone's life, not very quickly, but gradually. Me and my friend would soon fight over stupid things, such as a girl, and I saw how our lives had changed from the use of ecstasy. If we had not started this drug, we wouldn't have even started big messes such as these. We finally did stop talking to each other and I really do believe that it was because of our ecstasy use together. I will admit, that because of this drug, we did become closer friends, but it is still what tore us apart.\r\nA big twist in this whole story is what brought us back together as friends again. We both did want to apologise to each other, but we never could we had too much pride in our own selves I guess to be the first to say hi. But, while dancing at the same club that I first introduced him to, we saw each other after about 5 months. We were both rolling off of ecstasy and during that night when we saw each other, we apologised and we talked for a long time about what we had missed in each other's lives. Since then we have only seen each other a couple of times, but we still now know that we aren't 'enemies' anymore. We will never ever be best friends again and I feel that E is what ruined it all. E is also what brought us back, not totally, but enough to recognize that we shouldn't be mad at each other.\r\nNow, after all of this mess, it's back again. That craving for more E. I feel like getting really messed up off of E because I'd sorta like to bring myself back to the good old days. Every time I think of this though, I just remember that the 'good old days' weren't really that good. The best friend of my life has been taken away, and the only thing that I can remember from our relationship as friends was our ecstasy use. As of now, I have a good life ahead of myself while many other people are still stuck in the 'good old days' where I'd like to go back to every now and then, just for the hell of it. I'm a curious person as I've already mentioned, and I just wonder all the time what it would be like to feel like that again. I'm pretty sure I'll do it again, at least a couple more times before the childhood is over, before I have to start my real life of working in the 'real world'.\r\nBut I do know one thing... from the first time you take that magical pill, your life will change from the moment it sets on your tongue.\r\n'Anonymous (hopefully former) ecstasy user'\n\n\n"
}