{
 "title": "Showed Me Love for Myself",
 "author": "Respondent 21",
 "citation": "   Respondent 21. \"Showed Me Love for Myself: experience with MDMA (Ecstasy) (ID 97003)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97003",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 97003",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 1116",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nEcstasy showed me love for myself that I still carry with me\r\nThe E experience definitely changed my life. Similar to my first acid trip it showed me that life was beautiful again, but in a different and more personal light. At the time i first took E i was working 3 jobs and going through grad school - life was hectic and somewhat unjoyful. I felt really out of sync and exhausted with day to day life.\r\nE showed me Love for myself again - that i was truly a Loving, Lovable person. I also gained some insight into my body, certain body emotions that i'd not experienced before which then lead to heightened senses thereafter w/o any drug use.\r\nTo this day i carry w/me the Love i remembered because of the experience as well as the beauty and realize i can in some ways always bring that back to myself. My life had lost the 'magic' in it and E had helped me remember that it was always there all along, waiting only for me to touch it again. I can't as deeply explain my sincere appreciation for the experience and it's forever felt tendrils. I can only maintain that everything i received from it was positive.\r\nThe first time i tried E i was 22 and in grad school. Previously, i'd been an avid tripper via both chemicals and mushrooms and had pretty much shied away from other drugs. I'd always Loved tripping and had been fortunate enough to have never had a bad trip. At the time (and now as well) i considered myself an educated drug-user and always tried to find out the most thorough information beforehand. I also saw it as\r\na therapeutic ritual as much as one of re-creation.\r\nThe night i first tried E it was with a large group of close friends. We were holding a rave in a cabin on a mountain, but the party started at a friend's apartment. After ingestion, a friend who'd already experienced E before couldn't stop talking about how great it was going to be and she also tried to massage me explaining this would somehow\r\n'induce' the feelings and help me relax. This only irritated me and pursuaded a less than calm feeling.\r\nWhen the first feelings, both emotional and physical, hit i literally felt stunned. I didn't like it at first because it made me feel 'touchy-feely' and i'm not a touchy-feely person. I tensed up and felt nauseous - i wanted out. But within minutes, it was reduced to sharp flashes of light and then tender emotions and an amazingly sensual physical presense. Somehow i'd let go and really felt the full measure of the chemical/spiritual alchemy created in my being.\r\nBy the time i'd arrived at the cabin i was .... well, in ecstacy. I felt so joyful, so loving and everything was so utterly, painfully beautiful. I'd fortunately worn a green velour hooded shirt with which i took great glee in touching and allowing others do as well. This simple experience was enough to create an even higher level of ecstasy\r\nand gesture of closeness with strangers.\r\nAt one juncture, someone requested a simple kiss. It was the longest and most pleasurable kiss i've ever had. Exquisite.\r\nEventually i got around to dancing, but my dancing was more of a trance spiral in the middle of the floor - spinning, twirling gently and gazing into the mirrors with much curiousity. I think the greatest contribution i gained from the experience was to learn that truly, i Love myself and that is the route to Loving others.\r\nI have experienced E since then - to a great degree for a few years after, but for the last 4 years i've not been able to for a variety of reasons dealing with moving, etc. However, nothing has ever come close to that first experience and acutally i'm sorta glad. But, i'd still like to do it again someday :)\r\nFrom 'a 29 year old computer professional with a penchant for poetry!'\n\n\n"
}
