{
 "title": "Reveals the True Self",
 "author": "Respondent 31",
 "citation": "   Respondent 31. \"Reveals the True Self: experience with MDMA (Ecstasy) (ID 97005)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97005",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97005",
   "Male",
   " ",
   "Age at time of experience: 22",
   "Added: Jul 23, 2012",
   "Views: 978",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nEcstasy reveals the true self</p><p>Let me tell you what Ecstasy has done for friends and me.</p><p>I take ecstasy about every six months. For me, that's the real bare minimum for a complete growing experience. Six months assure that you have progressed psychologically and emotionally if you're in a path of growth. I find that I can integrate the experiences and teachings perfectly to my daily life; to walking in the street with a friend, to listening to music, to loneliness in my room, to meditation, and to hugging my mother and father. LSD is really incredible, but its lessons can be pretty obscure. LSD is like a loving strict father. Ecstasy, however, is like a loving mother who gives It to you. Whether you can recognize It in both cases is up to you, and I find spacing the doses up is one of the best ways there are when this is concerned.</p><p>I do love ecstasy as a 'dance drug'. When I read what you wrote about the monk finding 'dancing on ecstasy' and 'meditating on ecstasy' as very distinct experiences, I knew exactly what he meant. I find it irreverent, though, to take the drug and thinking it was 'the pill' who did that to you, and then doing it every weekend. Whenever someone asks me about E, I always like to get friends to understand it's actually not the pill... It is irreverence, to YOURSELF, to think otherwise. How else can you realize this for sure, but [here I go again] spacing the doses in time.</p><p>The first time we did ecstasy, it was an incredible experience, but I did not</p><p>understand the possibilities. The second time around, with my best friend in the woods, it was the most amazing thing I have done in my life. Being able to sit at the table with your known problems, and other unknown ones coming up, as relaxed and objective as could be is what psychotherapy was supposed to be about. I realized my self-esteem was actually not that high at the time, and how some specific childhood problems were not completely solved. Better yet than therapy, E is what life should be like, albeit a little less dense, but just like that. My friend and I are intellectually-driven selves, though not confined anymore to that way of looking at life. We are very proud of our intelligence, though not arrogant about it. And she told me, after the experience, that if she found out that ecstasy could take away 5% of her intelligence, she could live with that. I, of course, know that is not possible, being an information junkie. But, tell me, what is intelligence but a tool, and being and staying in balance but THE GOAL?</p><p>Overall, the E experience has made me a more serene person. Everything feels like 'things work.' I feel reassured that this place is pretty well organized. It makes the spiritual teachings that the material world is fantasy very tangible. I understand now how involvement with the things of the world should not proceed as far as to make you lose your well-being and tranquility. My spiritual teacher once said, 'you should trade NOTHING for your internal peace.' And that notion is very present within my actions. I now do not know how much E has done and how much I have done myself, but I can assure you that E has played a part. I am now in the process of being able to rest while I act, and not surrender to agitation because of activity, as well as stopping the internal dialogue for more prolonged periods. You asked for a survey on 'spiritual' experiences on substances, and I can tell you that, in a way, my life is one.</p><p>People take ecstasy and their Selves are revealed. People take LSD and part of the universe is unveiled. Millions of people. And there are still wars and disinformation; we still supress women and indigenous people; millions of lives, energy and money are spent on the 'war on some drugs'. My friends, this is enough. The answer to the problems of the world is NOT in drugs. The problem is NOT the world, and the answer is in Yourselves. That has been said a million times by all religions, though mysteriously not noticed by most western philosophers (Erich Fromm being an exception). You can, and should, make the world a better place, but be sure to MAKE YOUR CONSCIOUSNESS A BETTER PLACE FIRST. Ecstasy is but a tool for that.</p><p>Why is ecstasy not an answer, but only possible further questions? I remember I was very impressed, though not surprised, when a friend returned from a trip to Spain and told me what follows. While on E, he and his best friend shared dancing at a rave. Around my circle, we are very used to understanding that E makes you wander inward. But when my friend started talking about personal stuff to his buddy, he just told him 'EVADE ALL THAT. JUST HAVE A GOOD TIME'. So, what is the moral of the story? E is, like the LaTour song says, 'everything and nothing at the same time'. If you're not going to work, the pill won't work for you. That way at least. Everybody's free to use tools any way they want, but I do find it wasteful.</p><p>On another front, I ask everybody to understand that for E, when it's gone, it's gone. Don't do more than a pill, or 1.5 pills at a time. That's asking for trouble. And, when experimenting with any substance, first reach out for information. Uncensored chunks of it are available on the Internet for you to read through by the tons. Do it, and keep them uncensored. Back up the people who do research and those who make it available.</p><p>From a 22-year old engineering student in Mexico City</p>"
}
