{
 "title": "Emotional Walls Came Down in the Right Setting",
 "author": "Respondent 94 / Brad",
 "citation": "   Respondent 94 / Brad. \"Emotional Walls Came Down in the Right Setting: experience with MDMA (Ecstasy) (ID 97010)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97010",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   " ",
   ".5 tablets",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97010",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 23, 2012",
   "Views: 1068",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI am writing to relay my first 'E'xperince in the hopes that it will encourage others who may be considering E to do so in a safe and sane way. I have been a casual drug user for some time but since I have been married (almost 5 years now) the only drugs I have done are extremely rare (once a year or so) alcohol binges and marijuana.</p><p>My best friend, Paul (names have been changed to protect identities) and I have had a long history of just being great friends, being able to share experiences and talk to each other about things that we would never let anyone else in on. For almost as long as I have been married we will get together every once in a while and smoke bud like crazy. He recently started taking E on a 'not too often' basis with a couple of friends. I personally hope his usage stays 'not too often' as both of our families have strong substance abuse histories. So far we have both been good at keeping things sane.</p><p>I am going into a bit about the setting as it is so important to your experience. Since he has been using ecstasy, Paul and his friends have been adding things to his room. He has a dark room that is now decked out with a nice stereo, big blacklight, and strobe light. In the corner with the blacklight there is a couch with 2 small speakers set fairly close to your head when you lay down (not too loud though). Those two walls and ceiling are covered with glowing star stickers and other things that react to the blacklight. In another corner he has the strobe. Across the room from the strobe is a spinning wheel with designs that do crazy stuff under the strobe light. There is also a 'liquid light projector' that projects liquid bubbles of different colors on the ceiling in another corner. Scattered about the room are other items that hold interest under blacklight or strobe or both.</p><p>An evening spent watching Paul and another friend take some E in that space and seeing the way they were acting clinched my decision, I was going to learn a little more about E and give it a try. That is when I came across ecstasy.org and I must have read for hours and hours.</p><p>Well, the night was last night. We got one other of his friends over who was also a first-timer, Larry. All told we had seven pills, five that were known by reputable sources to be really, really good and two that were 'even better'!</p><p>When I arrived, at about 11pm, were about five other people over there, smoking bud, all of them leaving at about midnight. None of the other people there had tried E before. Paul and I are not very big, so we each crushed one pill and took it. We decided Larry should take two since he is a big guy.</p><p>In about 20 minutes, we started to come up, and this is why I say set and setting are very important. The other friends were still over, but they were causing constant interruptions and some were making fun of the way we were acting, which really, really affected the first part of our high. Larry panicked slightly after the other people left, probably because his mind was not in the right place because of all the interruptions, and because he was nervous about his first time. Paul took the lead and we helped him to get some air and calm down after which things got MUCH better. Paul and I each took another half a pill. Before long things were wonderful. We were all dancing, or sitting and trancing on all the different stuff. We had deep conversations which all were good and I saw things in a light I had never seen them before.</p><p>The information on your site helped greatly enhance our experiences and in general we had a great time. Tactile experiences were amazing. Here is something I would suggest to anyone using E. We had a hairbrush with fine stiff bristles that we would run over our hands and arms and it felt simply amazing. Another good thing is vicks vapor rub. One little sniff will open you up and you can feel the chill slowly spread through your entire body, creeping down your arms and fingers. Playing 'drums' to the music on someones back with the side of your hands simply is like heaven! What really amazes me is that even with all the awesome things in the room, sometimes the best things to look at were everyday things you would not notice. We had set ourselves up beforehand with plenty of water and one pitcher we had was clear and frosted with about half-inch thick wavy lines running around the circumference of the jug. I noticed that if you were facing the strobe light and went to drink some water, the strobe caused a wild reflection of the waves in the water that we all must have stared at for half an hour apiece! The reflection would hold still for a minute then shimmer and change with one slight movement of your hand in ever changing rhythms and patterns. I had a laser pointer that we would take turns making it dance and jump in designs on the ceiling and floor that was simply amazing.</p><p>All the old mess that had built up in my mind over the years was simply released and my emotional walls were let down. This can be a little scary at first but was a very enlightening experience. I am forever changed.</p><p>My suggestions to anyone planning on trying 'E', try to get it from a reputable source, drink PLENTY of water, but not too much, and make sure you are with good friends who can share the experience well, whether they are using or not. Do not let you mind dwell in any one place for too long, and if you start to feel bad, try (but not too hard) to think about other things. If your mind set is right you can let the E take you to places you have never been in your life. Get up and move around some, whether dancing, or just jiggling (as is my case since I can't dance well)! Then find something that catches your eye and focus on it for a while.</p><p>As I said before, it brings stuff from your past up, and some of it may not be pleasant, but even people who have had the worst lives do have some good things in there. Think about those when coming up and let the good times roll.</p><p>Brad</p>"
}
