{
 "title": "Facing the Loss of a Relationship",
 "author": "Respondent 69",
 "citation": "   Respondent 69. \"Facing the Loss of a Relationship: experience with MDMA (Ecstasy) (ID 97012)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97012",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "97012",
   "Female",
   " ",
   "24",
   "Jul 23, 2012",
   "1082",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[also referred to as 'Ecstasy Compared with Psychotherapy' in Ecstasy.org collection]</p><p>At 20 years of age I engaged in two years of psychotherapy and learnt how to express my emotions instead of reverting to aggressive defensive behavior. I then got involved in a brilliant relationship which has recently ended after 2 years, leaving me completely devastated and torn apart. I was suicidal and completely shocked and hurt by the withdrawal of my partner from me and turned to sleeping pills and tranquilisers to get through the pain at night.</p><p>I decided to try ecstasy. After about two hours I felt at peace about what had happened with my relationship and furthermore could see with incredible clarity why it had all happened. I felt like I was connected to a 'higher power' that was providing me with all the answers with a message that 'everything is going to be OK, and this has all happened for a good reason'. I have taken 'e' once a week for the past three weeks and the confidence that I am OK and that life isn't that bad has persisted; I have a constant feeling of peaceful acceptance and self love.</p><p>I still feel the pain and hurt of the separation and feel myself slipping into a depression. But for the first time in my life I have been able to nurture myself through the process with the understanding that I can experience the pain of loss without becoming completely terrified and overwhelmed.</p><p>Ecstasy has activated a new found ability to nurture myself and love myself which psychotherapy took ages to even get near to. I have the confidence now that I can survive this separation and that I won't collapse or allow the positive I have learnt to be killed by this disappointment. The feeling 'everything is going to be alright' stays with me, it feels like a connection to a spiritual side that is feeding me with strength.</p><p>During periods of depression or trauma in my life I am prone to getting self-destructive on alcohol. I find 'e' is a far better experience because I am more conscious of the positive aspects of life, which when depressed you don't seem to see. Ecstasy has certainly made this difficult period of my life more bearable in an incredibly positive way.</p><p>Ecstasy has made a traumatic period of my life bearable and meaningful, I feel connected to this event as a process in the grand scheme of my life which I have a strong feeling of positivity towards now.</p><p>South African woman</p>"
}
