{
 "title": "Conflicts about Relationships",
 "author": "Respondent 52",
 "citation": "   Respondent 52. \"Conflicts about Relationships: experience with MDMA (Ecstasy) (ID 97021)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97021",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97021",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 909",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI am 17, independent and free-spirited by nature, and by weekend a user of E. I discovered the rave scene about 6 months ago and since then have acquired a 'family' that I love, tried new drugs, and my mind and eyes have been opened considerably to the real things in life - love, happiness, and being with those that you love and bring you happiness:)</p><p>I was extremely happy to stumble upon your website, complete with questions and intelligent answers to things I often wonder about. It is wonderful to find someone who understands the logistics and chemical explanations behind why I feel the way I do when I use E. </p><p>Unfortunately, the empathogenesis that I feel with others has led me into bad situations and conflicts about relationships and those types of things often lately. I have a particular story to tell you that might find very touching and sweet - I do but I experienced it so who knows?</p><p>At the second rave that I ever 'rolled' at, I was introduced through friends to a guy named Tim. Even though I was on LSD and a tab at the time, I felt a pull stronger than anything I've ever felt towards him - the second our eyes met there was a certain distinct seriousness in the air of something so incredibly special. It was unbelievable, and we  immediately sat down in the theater where the rave was and stayed together for the rest of the night. Our bodies fit perfectly and I was in love:) That morning at the afterparty he told me that he was moving to Los Angeles in early August (the date of that rave was June 28th). So I knew our time together was very limited. He didn't call me for a couple of days, but the next week was 4th of July weekend and we ended up spending a night together of swimming, watching Japanimation films, and sleeping together - and I mean merely sleeping - no sex involved. He lived about 25 minutes away so we didn't see each other the next week but that Friday night the 11th, everyone went to a rave and him and I stayed at his house and ended up sleeping together. It was sex - purely sex and nothing more - and he actually stopped right in the middle because neither of us felt right at all- the vibes weren't there, no passion, nothing. I am so serious when I tell you that it was the most horrible that I have ever felt, and I cried the entire night softly so he couldn't hear. </p><p>The next night we went to a rave together and all was well, we were together and the night was beautiful. I didn't speak to him the rest of the week, but that following Saturday I talked to a girl we were both close with, and she told me that he didn't like me. It was terrible. But I knew he was going to a rave in Birmingham that night so that I wouldn't have to worry about seeing him in New Orleans at the rave. I vowed to go and have the best time, through my tears, and when I got to the party at 2:30 am, sure enough, he was there. I straight up ignored him and walked off with my friends and we went off and all took some E. From there I found myself turned around by my brother who knew the entire situation, had talked to Tim and knew that Tim hadn't said that. So Tim and I kept meeting eyes from across the way and all of that, and I knew he wanted to talk to me. </p><p>We ended up walking off at about 4, and from that point on I knew it was hopeless to resist :) We sat together and talked about what he had supposedly said, why he hadn't called, etc., etc. Well, he didn't even answer me when I asked him why he hadn't kept in touch. He just started to cry! Then he told me that his dad was dying of cancer and that between his dad terminal and him moving in two weeks, that he was so scared of how strong the feelings he had felt for me were. Then I began to cry and for an hour we cried together and with the E it didn't even seem so bad after all. They were beautiful tears, and we both realized that neither of us had wanted to have sex, and that we both loved each other. The whole night is a vision of unbelievable emotions and happiness for me. It is hard for me to even describe. Well, we continued to see each other only at raves and talk, and be in love with the moment and each other, until the morning that he left - August 5th. </p><p>I stayed with his two best friends James and John the night before he left with the idea that in the morning we were going to wake up and go to the airport and see him off for the last time. I had seen him a couple of nights beforehand and he had hugged me and told me that he loved me, and I knew that was the last time that I was going to see him - that next morning we all three overslept and missed Shaun's plane by 5 minutes. We did go to the airport - Tim and James and John had this plan that they were all three going to take a tab before he got on the plane so that they would be upset and miss him but that the e would lessen the effect of his leaving. Since we missed Tim, I took Tim's tab and the rest of the day rolled with James and John reminiscing about all of our special times with Tim and about why we all loved him. We three were already so close to begin with- they adored Tim and they knew how we felt about each other so they treated me like a princess. We all grew so close that day- unspeakably close. We now all share that memory of the summer with Tim, the day that he left, and every time we each see each other we are reminded of how much we care for each other and what family really means. They've helped me out in such bad times, and watched out for me no matter what. So out of my relationship with Tim I made two beautiful friends who I still have, and we are all three going to go to Zen Fest, a big rave in Tampa this weekend.</p><p>Because of e, I believe, I have experienced some of the most amazing emotions human beings can hold within them, and now I have incredible summer memories, a dear friend in Los Angeles who I still talk to and love, and I can cherish it all. I am young, happy, and haven't always made the best decisions. But now I have grown by being with others, and know how special life truly is.</p>"
}
