{
 "title": "Euphoric and Jealous on the Same Pill",
 "author": "Respondent 64",
 "citation": "   Respondent 64. \"Euphoric and Jealous on the Same Pill: experience with MDMA (Ecstasy) (ID 97027)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97027",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "97027",
   "Male",
   " ",
   "19",
   "Jul 23, 2012",
   "Views: 1192",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI tried X for the first time 2 weekends ago. I can only say this, 'Un-fucking believable'. I went to a rave at the time I took the pill. I first started to feel tingly sensations and sort of a constant vibe throughout my body. Completely euphoric, I was truly in a state of mine that could not be described by words, for I have never known this feeling of joy before. I didn't realize at the time that having people I am close with around me definitely added to the experience.</p><p>I went to another rave, with the same type of pill from the same batch, but I did not have my friends with me at the time. I brung a girl, who I had just met that night, she took it as well. It did not take near as long to peak this time, maybe 15 to 20 minutes, and it made me into a complete and utter social animal. I was not in the same state of mind, maybe because I already was expecting a certain effect. I was very happy, and very talkative, and opened right up to this female that I have only known for 2 hours. She acted pretty much the same, and then she became somewhat distant, like she was in a world of her own. She told me this was normal for her and not to take offense, but when she talked to another man I became incredibly jealous and I became very paranoid. I found that dancing or looking at light sticks distracted me and got me back to the happy state I started off in. I fount myself socializing with complete strangers as if they were close personal friends, and I did not really care who they were. This is were I ran into trouble.</p><p>I was sitting down drinking water, which I was told to do, when I got into a conversation with some people who were known as Straightedgers. They do not practice any kind of drug use or drinking or any kind of mood or mind altering substance use/abuse. Talking to these people put me in a very bad mood, because I knew they looked down on people who choose to expand their horizons through chemistry. I found myself suddenly feeling very very depressed, and very very guilty for what I have done. I completely lost the happy feeling and wanted nothing more but to go home and be alone. I was not warned of the fact that MDMA can also have a negative effect as much as a positive one depending on your scenario. I tried to rid myself of these things and get back into the roll, but had no luck. In one split second, my experience had ended.\rFrom 'a 19 year old typical American guy'</p>"
}
