{
 "title": "Instant Connections",
 "author": "Respondent 84",
 "citation": "   Respondent 84. \"Instant Connections: experience with MDMA (Ecstasy) (ID 97037)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97037",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97037",
   "Not Specified",
   " ",
   "Not Given",
   "Jul 23, 2012",
   "Views: 941",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nThroughout my University years I have used many soft drugs such as cannabis and mushrooms. Each had its benefits and its drawbacks and I considered myself a pretty well-informed drug user. The crowd I hung out with were generally pot heads and drinkers, usually both.</p><p>However, something changed this past summer. I was sick of the constant drinking at the small town pub where I go to University and the local bars in the city where I spend my summers. I was sick of the laziness and my growing weight which I attributed to constant pot and alcohol use.</p><p>I had a friend come in from out of town one week early in July and we decided to go to an all night club with other University acquaintances. Most of them had tried E before and they asked me if I wanted to do it. Despite the bad reports I had heard in the media I figured that I would try it at least once. Well, what a great decision that was because I had one of the best times of my life.</p><p>Since then I have begun to feel an instant connection to other people on E. When I'm in a bar all I have to do is look at a person to know they are on E. After my summer of raving in the city I returned to my small-town University expecting the same usual mix of alcohol and pot. Much to my surprise the raver culture has arrived in this small town and all of a sudden I'm seeing a lot more water bottles in the hands of people that used to always have a beer bottle. The music is slowly changing from rock a roll to the music of the raver world.</p><p>The changes I've seen in people who have done E and the differences between users and non-users is pretty dramatic. Users seem more in touch with the world and generally seem to be better communicators. People who used to be drunk messes have suddenly reduced alcohol use, dramatically in some cases, and become much cooler and easy to talk too.</p><p>In my case, I'm a lot more into the music scene then I was before, and I don't drink very often at all although I still smoke a fair amount of weed. I'm also much healthier and more physically active. It has also diminished many of my inhibitions when speaking and interacting with people.</p><p>All in all my E experience has been a positive one. I would advise anybody doing E for the first time to go with someone who knows what you are about to experience and who can keep you in a good state of mind. I've seen a lot of people hurt themselves because they were first timers and lacked any real education about the drug. The misinformation about E in the media is frightening and the ignorance out there is pretty bad. I give kudos to the designers of this page for informing people about the drug.</p><p>A formerly unenlightened soul in the USA</p>"
}
