{
 "title": "Lesbianism Revealed by Ecstasy",
 "author": "Respondent 73",
 "citation": "   Respondent 73. \"Lesbianism Revealed by Ecstasy: experience with MDMA (Ecstasy) (ID 97036)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97036",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97036",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 1449",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nMy own experiences have shown me that, in psychotherapeutical terms, the use of ecstasy can be both immensely powerful and, if used with the active cooperation of the person concerned, astonishingly effective. At least, it has been in my case.</p><p>When I first took ecstasy I was in a miserable state. I think I can say that I was psychologically ill but unaware of it, which made my condition even worse. For about 10 years, since my childhood, I unconsciously repressed my true emotions. I am a lesbian, I would say dramatically so (I even thought about gender transformation), so this was a truly powerful part of me that I was hiding from my personality. Over these last 10 years my life was dominated by this fact, without me noticing it once.</p><p>After a very free and happy childhood in Germany I had begun to repress myself so my self-confidence shrunk to zero. I hid myself underneath the opinions of others and my unconscious goal was to please everybody in my environment, which isn't the easiest thing to achieve! To my great surprise when I look back now, I did somehow succeed in doing this but my behaviour then was very dishonest. I achieved excellent grades in school and was friends with everyone but I lacked a personality of my own. In the end I couldn't be happy with living like that and developed depression and escapist tendencies. I tried to kill myself once, unable to love anything about myself. I finally decided to go to England to get away from it all for a year and to come to terms with what I wanted to do with my life.</p><p>Here in England I met a gay co-worker who introduced me to ecstasy. This experience caused a dramatic change. I woke up. For the very first time I could see myself as what I am. I knew I was a lesbian. I felt more free and happy than ever before! The weeks after that I spent in a trance-like state of happiness and astonishment. Of course I also felt lost: everything I had lived for had vanished in one single night!</p><p>I carried on going clubbing with my new friend, taking ecstasy nearly every week and at the same time experiencing my 'new' sexuality. In the beginning, ecstasy helped me to accept being a lesbian, making me really sure about my attraction to women. I spent days thinking about myself and what a crazy place this world is. After a month or so I began to get more and more attached to my friend. He became my new family and in a way my point of orientation, something to hold on to while everything else was changing and had still to be discovered. It took me four further months to finally realize that I am my own person and can exist independently with the necessary distance towards others but it helped a lot to have my own 'guide' through this phase.</p><p>About 5 months after my first e I went clubbing, just as in the weeks before, but all of a sudden I felt the pill work for the very first time! Previously, I think my inner personality simply wasn't there to be revealed by it so I just felt free and a bit more confident about myself. But that night I felt the nearly spiritual power of truly being myself. Only then did I start to develop real self-confidence.</p><p>I still take ecstasy, and my experiences are taking on a more spiritual dimension. I have also started to practice meditation as it helps me to analyse what is going on with me and around me. I have nothing to hide anymore, I am aware of my personality, I have stopped caring about what other people might think of me. All because now I am confident and I truly love myself.</p><p>Sometimes I wonder what would have happened if I hadn't come to England. For one, I'm sure that this radical change from a really mentally disturbed self-hating girl to a self-aware, confident lesbian would never have been possible without the liberating effect of ecstasy. Not in a period of 5 months!</p><p>I'm certainly not saying that the pills made me into a lesbian! But they did assist the process. Together with very favourable circumstances and a large mental effort from myself, it was their catalystic effect that turned me around to self-acceptance.</p>"
}
