{
 "title": "Ecstasy and Pot-Dependence",
 "author": "Respondent 99",
 "citation": "   Respondent 99. \"Ecstasy and Pot-Dependence: experience with MDMA (Ecstasy) (ID 97043)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97043",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 97043",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Jul 23, 2012",
   "Views: 1381",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI'm a 19 year old art student from New York and I'd always been sceptical of the rave scene, because, like many music-subculture 'scenes', it's usually just a big bullshit contest of one-up-manship as to who's into 'the thing' more, as the whole point of the scene gets lost (the music, of course).\r\nSo anyways, for 3 years I've been experimenting with pot. The first few times it really got me high were amazing. From the winter to the early spring of this year I'd been smoking pot just about daily. There were times when I thought it was almost helping me get through the week - being an art student is a lot of work, and sometimes it made me want to work. Eventually, however, I realised that pot wasn't helping me at all, but actually just becoming a burden on my daily schedule, not to mention a big financial issue. I got to a point where I decided I should stop smoking and I got down to a few times a week. I didn't even want to get high, but sensed a bit of a physical addiction.\r\nA month ago, my school held an electronic music festival in the student union, so I decided to check it out. The party was pretty much what I thought it would be - the DJs spun drum n bass, hip hop and some progressive house. I finally decided to start dancing, until I was just a big ball of craziness. A girl who was rolling came up to me and said she liked the way I danced, and then asked me 'what are you on?' to which I replied 'nothing'. I told her how I was looking for some pot, as I had ran out and felt a bit of a void. Instead, she led me to a kid selling E. I bought and took a $25 pill.\r\nIt came on strong. I had some jitters of course, and was sweating profusely while just lying down and soaking in the beats. I decided I should go back to my friend's room and chill with people I knew well. When asked what it was like, I said 'Everything is exactly the same - things look the same, feel the same, and sound the same, but everything is better, everything is perfect.' It was true. I realised I was just appreciating life for what it's worth. Coming down was a pleasant experience, as I realised what just transpired, but could appreciate the lack of intensity I had a few hours ago while rolling hard. I slept long and well that night, and the next day, life was beautiful. Nature was gorgeous, and I was happy for once. I also had some amazing memories (and some interesting drawings!).\r\nThe most important factor, however, was the fact that my desire to smoke pot was entirely gone. my desire to smoke pot was entirely gone. I did smoke twice more, but only because I still felt a chemical dependence. After those times, I haven't done it since, and instead am learning about everything life has to offer me. Now, I drink water often (which is a smart thing to do anyways), and listen to music outside while taking walks around campus. I finally have a good balance of recreation and work and look forward to both. So many good things have happened that it seems obvious to put the blame on the E (which is something I would never have dreamt happening, as I'm a total cynic about drug epiphanies).\r\nI want to do it again, but it's an experience that should never happen often - rolling presenting a relationship to 'real life' which would be lost if done often. Somehow, this drug has made me appreciate the raw characteristics of life even when I'm not on it. I'm looking forward to my next rolling experience, knowing what it will feel like, and can only begin to imagine the happiness.\r\nSo that's my story, plain and simple. I'm a happy person now, and might just have to owe it to Ecstasy.\n\n\n"
}
