{
 "title": "E Lifted the World From My Shoulders",
 "author": "Respondent 78",
 "citation": "   Respondent 78. \"E Lifted the World From My Shoulders: experience with MDMA (Ecstasy) (ID 97048)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97048",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "LSD",
   " ",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97048",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Jul 23, 2012",
   "Views: 932",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nFor a long time I had been wanting to do ecstasy while just 'chilling' at some friends house instead of going to a rave. I think at a rave the environment can affect the empathy and flow of feelings somehow. Plenty of times I 'rushed' to friends and quickly expressed my feelings and than ran off and danced. I also think just sitting and relaxing lets your mind flow more and you can reminisce on aspects of your life...</p><p>I met a girl at a club when I first began doing ecstasy. Surprisingly, she came on to me (it seemed) and we hit it off well. As time progressed, and the new experience and atmosphere of ecstasy and raving entered my life, I was very cautious. I was kinda hesitant about having a relationship with her, she was a part of this new period of my life and I felt wary about anything related to it. I wasn't mean to her but I was very cautious. As time progressed we spoke on and off.</p><p>I leave for the holidays. I come back. She came down and hung out with me and my friends while we did e and lsd. I had wanted to try e again... I knew the crowns were good and I had really mellow and calm thoughts when I did them before and I was in a good environment so I figured the e would balance the intense feeling I got when I did lsd. And so it did.</p><p>We all hung out and decided to go to a bar. I couldn't get in but everyone else wanted to go so the girl says 'look let's go back to the house and just chill.' We get in the car and she pops some more e in for me.</p><p>We hung out all night.. didn't kiss.. didn't have sex... we DID TALK... let me tell you. I have read and heard people talk about having bonding experiences and being able to open up but I've never been in the right atmosphere. But this time I took full advantage of it.. I don't remember every detail but afterwards it felt as if the world itself had been lifted off my shoulder. We talked about us first meeting, why I was hesitant about speaking to her, I discussed my family, my mom, the list goes on. It was the best 'therapy session' I had ever had.</p><p>So, it seems to me, mdma CAN really open your mind, help you realize your thoughts, analyze ideas, and dream about reality and realize your dreams. I hope everyone gets to experience this.</p><p>I think the important concept to remember is you don't have to get 'fucked up' to take advantage of it - take nights to just sit and reminisce with friends, it is one of the best experiences I have ever had. Be responsible, don't let the drug take advantage of you, you take advantage of it. Everything you do, do with spirit.</p>"
}
