{
 "title": "E at Thirty",
 "author": "Respondent 50",
 "citation": "Citation:   Respondent 50. \"E at Thirty: experience with MDMA (Ecstasy) & Cannabis (ID 97058)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97058",
 "substance": "MDMA (Ecstasy) & Cannabis",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA",
   " ",
   "  ",
   "smoked",
   "Cannabis"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 97058",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 1282",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\nI am a 30 year old first time trier, having resisted the influence to do so for all my 20's on the basis that I was too old and it would be unnecessary/dangerous to do so.\r\nWhat bollocks. I stayed up all night with no fatigue and great enjoyment both emotionally, socially, physically and a little spiritually. Although the spiritual element was mainly during my first try when I was taking along with a friend/guide at his place. It felt like the Buddhist 'metta' of overwhelming, but in theory controlled, loving-kindness for all things.\r\nThis is bound to give an insight into yourself and those you relate with because awareness, compassion and empathy are at the root of metta and Buddhism, and thus you love yourself enough to see faults without wanting to suppress that knowledge and see others as they really are without being put off them as a result. Equally loving-kindness is so large a feeling that it pushes out the hungrier, narrower and selfisher feelings of lust/consumption/conquest/etc.\r\nMy second experience was much less spiritual, being a loud and busy party and then chill out with much smoking of cannabis. I still enjoyed the flight and looking back feel that I am learning more about the different rules that apply, but (and this is all part of it) I suffered strong paranoid flashes. I became quite convinced that everyone around me (all friends) were wishing I'd shut up and go away, that my behaviour was OTT, naive and irritating etc... I must add that they are all experienced takers and reassured me that this was not true. It tells me alot about myself in social situations, but, and this is important I think for an understanding of mixed drug experiences, this was the same E that I took on the first occasion when we smoked no cannabis. I have had paranoia before on grass and I think that was the stimulus for it this time, which was then picked up and magnified by the E.\n\n\n"
}