{
 "title": "Can't Help Spilling the Truth on E",
 "author": "Respondent 41",
 "citation": "   Respondent 41. \"Can't Help Spilling the Truth on E: experience with MDMA (Ecstasy) (ID 97059)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97059",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97059",
   "Male",
   " ",
   "Not Given",
   "Jul 23, 2012",
   "Views: 1480",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nMy first time dropping E was an experience I will NEVER forget. I had never experienced the drug but had heard sooooo much about it and finally decided to drop it at a rave. A girl I had been interested in for numerous months coincidentally bumped into me the day before a huge rave called 'MASSIVE', and believe me it was. (10-12000 people). She offered me free E and off we went leaving behind our friends to rip up the dance floor. After an hour the drug hit me like a fucking wall.</p><p>This sensation was so unlike other drugs. I've experimented with Heroin, Coke, LSD, Speed, but this sensation was so new. When it hit me I looked at her and she was looking at me with a sly grin. It had both hit us at about the same time. I told her it was my first time, so she gave me a Meltdown, I nearly collapsed from the sheer pleasure. She knew exactly how to trip out on the drug, I never knew giving someone a hug could feel so Euphoric. Also she carried hand cream and rubbed it all over my chest and arms. That felt dope! We then left the rave (and our friends) and danced outside listening to music by my car as I watched her dancing and exploring herself.</p><p>The one thing I don't like about E is that it is almost like a truth serum for me everytime I drop. I remember spilling my guts to her about how much I wanted her and I definitely wouldn't have told her if I was straight for fear of rejection, but at that point I didn't care. Thankfully she had said she felt the exact same way. I don't know if I would have been happier to hear that from her straight or on the drug but a feeling of COMPLETE happiness and Euphoria I'll never forget came over me when she said that (I think I was peaking). We're a couple now and and I thank E for really making our first date a night I'll never forget.</p>"
}
