{
 "title": "First Rave",
 "author": "Respondent 32",
 "citation": "   Respondent 32. \"First Rave: experience with MDMA (Ecstasy) (ID 97062)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97062",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "1997",
   "ID: 97062",
   "Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 23, 2012",
   "Views: 1320",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI recently (1/18/97) went to my first rave in Jacksonville, FL. When I first got there, I was kinda disappointed. There were a bunch of people standing around but only a few dancing. At about 2:30, a friend of a friend got me four tablets of X, called 'green turbo'. I handed one to my other 3 friends who were there with me, and we all</p><p>took them at the same time. I had read extensively on the topic of Ecstasy and I had made the decision (responsibly) to try it out. I had been wanting to try it for quite some time, so I was ready for it to kick in. </p><p>It hit me first. When I had my eyes open, I felt completely sober and coherent. But when I closed my eyes, it was the most unbelievable experience of my life. I didn't know everything could feel so good! After about an hour and fifteen minutes, it had gotten really strong. I was a little tipsy, but everything was controllable. If someone (like a cop or my mother) had come up to me to have a conversation, I could have kept complete control of myself. That was a big plus. I could close my eyes and feel the beat surging through my body. It was as if I was in touch with everything about myself and that was an exhilarating feeling, to say the least. I felt the fatigue in my legs and the dehydration beginning to start, but I could easily go and get water if I needed to. I could not believe how wonderful everything was. My friend had on a silver rayon shirt, and I couldn't stop touching her!</p><p>The weird thing is, nothing about the whole night was sexual. It was all sensual. Everyone was so friendly and caring, it seemed as if I was home with the family. Backrubs abounded and so did the touching. People would walk by and just touch you... and it felt so good!</p>"
}
