{
 "title": "Two Americans Rave in London",
 "author": "Respondent 23",
 "citation": "   Respondent 23. \"Two Americans Rave in London: experience with MDMA (Ecstasy) (ID 97060)\". Erowid.org. Jul 23, 2012. erowid.org/exp/97060",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "MDMA"
  ]
 ],
 "footer": [
  [
   "",
   "ID: 97060",
   "Gender: Male",
   " ",
   "Age at time of experience: 23",
   "Added: Jul 23, 2012",
   "Views: 1285",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\nI would like to relay a story of an experience I had in London this past summer while backpacking through Europe. This night occurred at the end of my six week adventure, and although I had a blast travelling with my roommate and seeing the world, this Friday night made the entire trip worthwhile for me.</p><p>I had the good fortune to know someone in London while I was visiting. My good friend had given me the name of a friend of theirs who was living in London at the time. I called him when I got into town and we went out the following night. Lucky for us, Zete was also into techno and raving. Knowing that the scene in London is spectacular, I pressed him to find a super event for us to go to. We found out what was 'on' that evening. It was Absolute at the Colloseum. Sven Vath and Mr. C (two world renound DJs) were spinning, and I was thrilled.</p><p>We arrived around 11:00pm and once inside, I could feel that it was going to be a spectacular night. The layout of the location was perfectly designed for this type of thing. One large room, another smaller room and a chill room in between. Video games. Smart bar. Unbelievable sound system, lights, lasers, the works! I spent the next half an hour casually asking around....I was looking for Ecstasy. After about an hour I found what I was looking for. The music was spot on, and I began dancing. Soon after Zete and his friends arrived. We hung out and chatted until I felt myself starting to 'come up'.</p><p>The Ecstasy was UNBELIEVABLE and the music was even better. The people there were lovely, the vibe was alive and growing! I spent the night in heaven, meeting people, hugging and dancing my brains out. During the course of the night I had met a bunch of people who were really friendly and outgoing. I talked to one guy for awhile while we smoked a joint. After finding out that we were from the States and were new in town, he invited us to their flat for a 'chill out' after the party. It was the kindest and most heartfelt gesture. Only a truly kind and generous person would invite two total strangers back to their place to share an experience after a brilliant night. And it was not like he was interested in me, we were/are straight.</p><p>We had an emotional night dancing. I was moved into such a deep state of trance, the music, the lights, the vibe from the beautiful girl dancing across from me...it was perfect! It was my roommate's first real experience on Ecstasy and raving. He had a grin from ear to ear all night long. He felt the vibe....he approached me and told me</p><p>everything I wanted to hear him say. How happy he was, how intense the vibe was, how cool everybody there was being. I felt like crying. It was a beautiful experience that culminated in us relaxing in a total stranger's house in a strange city, yet we felt comfortable there. My only regret was that I would not be able to spend more time with those lovely people and get to know them better. It wasn't until 10:30 the next morning that we phoned a cab for a ride back to our hotel. For me, that night in London defined what raving is all about.</p><p>A 23 year old American man working as a software product manager, living in California.</p>"
}
