{
 "title": "No Longer Look at Life and Death the Same Way",
 "author": "Respondent 55-B",
 "citation": "Citation:   Respondent 55-B. \"No Longer Look at Life and Death the Same Way: experience with Cactus (extract) & 2C-B (ID 97089)\". Erowid.org. Jul 26, 2012. erowid.org/exp/97089",
 "substance": "Cactus (extract) & 2C-B",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "Cacti",
   "(extract)",
   " ",
   "30 mg",
   "oral",
   "2C-B",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: ",
   "ID: 97089",
   "Gender: Not Specified",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 26, 2012",
   "Views: 1720",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n[Written in response to this report.]\r\nThis is all within the realm of transpersonal experiences which can be invoked with these substances. I will relate a somewhat similar experience:\r\nA friend of mine who had been in a religious order for several years invited me to share a cactus extract he had made. We began mid-morning walking on foot in the Sandia peaks and walked right along the edge, ice and loose rock all around. We then took a ride back to his place and continued our journey. As things were beginning to settle down from the cactus extract, some 2C-B appeared in a glass of orange juice and we both partook of about 30mg.\r\nSome evocative music was then put on the stereo and we both lay down and began the inner journey. We were still quite in the trance of the cacti when the 2C-B began to cross the blood brain barrier. A little while later my good friend got up to get himself some orange juice. It was at this point that i noticed his physical features, posture, and 'behavior nuances' had transformed.\r\nWhen I went to college many years ago I became very close friends with a fellow classmate. We were in a religious organization together (monks and brothers if you will). He was exceptionally intelligent (IQ over 180) but unfortunately was also manic depressive. Lithium helped, but he loved his mania, and would stop taking it. He eventually took his own life, some ten years before this event.\r\nMy friend became transformed into my dead friend. He appeared to be able to channel his spirit. He 'became' my dead friend for a period of time. We talked about many things we had done that only he and i would know about. He forgave me for not attending his funeral... As this was going on it seemed ever so natural. i didn't even think it was out of the ordinary. As the medicinals began to wear off a young man who had been studying with my friend as an apprentice stopped by and we shared some 2C-B with him. During this time things gradually 'morphed' back the way they were.\r\nI slept very well that night, and it wasn't until about halfway through the plane ride home the following day that I began reflecting on what had really happened. My friend, who had always been into a lot of this 'new age' psychobabble stuff, had transformed himself into my dead friend to allow me to 'be' with him again. Needless to say it was a transforming experience for me.\r\nWhat really happened? I have not a clue. But i certainly don't look at life and death the same way anymore.\n\n\n"
}