{
 "title": "Minimal Effects and Mild Disorientation",
 "author": "wd40",
 "citation": "   wd40. \"Minimal Effects and Mild Disorientation: experience with Morning Glory (ID 9710)\". Erowid.org. Jul 8, 2005. erowid.org/exp/9710",
 "substance": "Morning Glory",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "140 seeds",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9710",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 8, 2005",
   "Views: 3662",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nAfter searching online for legal ways to get high, two weeks ago I ordered 140 Morning Glory Heavenly Blue seeds through the mail.  I had read some reports of great trips just through chewing the seeds, so I was excited but skeptical.  I had breakfast around 9, but soon afterward defecated so as to have an empty stomach for the seeds.  <br>At 4 pm, I sat down to a dark and undisturbed setting in front of my comp and began to meticulously chew the first seeds.  I got the impression from the online files that finely chewing/crushing the seeds would lend to better results, so I really took my time.  I took one or two at a time, meticulously crushing them with my front teeth, then swallowing the pulp and continuing.  The seeds have a woody garden taste, which I tried to get used to, but rather they made me nauseous.  <br>At 5:15 I had only managed to eat 70, and I was really abhorring the taste, so I had to take a short break.  With the help of a root beer, I forced myself to slowly eat another 15.  At 5:50 I was feeling a little better but fed up that it was taking so long, so I finished off the rest in the next 20 minutes.  My overall rate was one seed per minute.<br>No real effects except for queasiness, and some associated mild disorientation, like after smoking some really weak pot.  I was really hungry though, and after discovering that root beer tasted *a lot* better after that nasty stuff, I walked from my dorm to the cafeteria.  It was a pleasant evening, and the mild pot-like effects made it even more enjoyable.  I purposefully took very small portions (I usually eat a very big dinner) so as not to hinder any possible effects.  However, I could only eat about 1/4 of what I took, and even then I felt like I had eaten too much.  I felt really sick to my stomach, even more disoriented, and so dragged myself back to the dorm.  I found a friend I could lean on the way back and told him that I thought that the effects were beginning.  All I wanted was my bed.<br>After turning on some trippy music, I crashed in my bed, and with the mildly enhanced sensory awareness and concentration, I had a good time masturbating, after which I felt exhausted and fell into a semi-sleep.  This was probably the best part.  Through yoga I have tried to let go of my mind while still being there, and have attained varied success.  I attained a semi-meditative state, but in which some of my nervous tendencies prevailed, greatly heightened; a previous nervous impulse was now a burst of acid from my leg to my brain.<br>After awakening, all the effects which I had previously began to feel had disappeared, except for the occasional moment of disorientation, and the constant brain numb which continues till now (4:30 am; its not because of the seeds though: I stay up this late all the time).  Overall, the 'trip' provided nothing that couldn't be accomplished through lack of sleep and mild sickness.  I plan to further experiment though, next time with some extraction method, on an emptier stomach, and all at once.  Chewing is definitely not recommended.\n\n\n"
}
