{
 "title": "The Bluest Pigeon",
 "author": "Psychedeliac",
 "citation": "   Psychedeliac. \"The Bluest Pigeon: experience with LSD (ID 9716)\". Erowid.org. Jul 8, 2005. erowid.org/exp/9716",
 "substance": "LSD",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9716",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 8, 2005",
   "Views: 4143",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My first experience with LSD occurred on June 22, 2001. It was with my friends L and G and A.</p><p>At 12 PM, I put the single blotter tab in my mouth. I was told it was triple dipped. We walked to the train station for about 20 minutes. I was very excited. I was ready for my trip. We got on the train and I started feeling a little euphoric. I felt simply good. I think L smoked while we waited for the train and I didnt really feel anything. We got to where G lives and L smoked again on the stairs down to the street and there I was twirling around and around, and I was having fun. Then we walked to Gs, this walk I dont actually remember. We went up to Gs and I got into her room and I looked at the posters and they seemed to be coming at me. Perhaps this is how objects appear to be breathing, yet they were more coming at me, it was amazing to see this. </p><p>G turned on the Chocolate Starfish Limp Bizkit song I like, Hot Dog something, and it was so good, great to listen to. We then went to the library, and on the way there, L smoked a joint. It was really annoying listening to L and G argue, I was a little pissed, but I got over it looking at the surroundings, which were actually rather boring. L got high, but not very high. Although she found it humorous poking me, because I felt funny, very, very funny and I was laughing at everything. When she poked me, I felt like I was being tickled, but mildly. </p><p>When we got to the library, G and A went in and me and L stood outside. L smoked and I was looking around. I saw this beautiful guy who looked exactly like this guy I always thought was hot. Im sure he was real, but maybe he looked like him because of my state of mind. It was there that I realized that my sight was incredibly clear, far clearer than usual. We continued from the library to this park.</p><p>We walked past the park where L smoked the roach of the joint she was smoking and I was walking around and thinking and my thoughts appeared ambiguous. They were a paradox. I looked at something and I wasnt sure if that which I looked at was what I was actually looking at and the realization that what Im looking at is what I think it is made me very happy. We walked around and soon crossed the street. I noticed that holes in space time were forming in the building we were near. The building appeared to be covered in black spots void of anything, yet it wasnt. </p><p>We walked down a block filled with trees and houses and it was dark there. It was there that I began to feel some of the more apparent effects of the acid. There were body sensations, like something was coming at me. As we turned to go to another block, I started to walk in the way that I remembered M, this guy Ive liked for a while now used to walk. And I believed M was like a God and I said to myself that I am like God because I was walking like M. L and G thought it would be funny to make me paranoid by making me believe there was a huge bee on my bookbag, and it worked, I got very scared but I let go of the fear. We were walking to this girl Js house and I looked at the street sign and I saw 6th street, and I got scared, I thought they were taking me away to kill me, I actually believed that to be happening, and I asked them about it. </p><p>They told me we were on 8th street, and I looked again and saw that it was true. We got to Js house and I was reaching the peak. I started looking at my hand while we were in front of her door and I could see the blood vessels and the veins and I put on my music and it did sound very different. I felt like I was moving everywhere while I was standing still. When I closed my eyes, although, I saw no visuals of any kind, but when I opened them, everything was coming at me. We left Js and we were walking to this park, and I was listening to music but then I stopped because it was uncomfortable. This was Visual Audio Sensory Theater, and I didnt enjoy it. I was walking and L and G were arguing. </p><p>I think and then they started saying things and I wasnt sure if it was real. They made me very scared and I spit out my tab and fell to my knees crying. They apologized and asked if I was okay and suddenly everything became ok and I was feeling great. The bulk of the heavy fear had passed and we went to the park. I was amazed at how different the park was from the way I remembered it to be. It was huge, yet its not. We sat down on a bench and planned the last day of school. I looked at Ls bracelet and I held it in my hands. It appeared to be getting wider and longer yet I knew it wasnt. </p><p>I looked around and I looked at one of the pigeons. Its feathers gained a unique blue color. It was the bluest pigeon I had ever seen. There were spots of color everywhere. Gs skin looked very bright and illuminated, as did Ls and for the first time I realized how bright Ls eyes are. I looked at everything and A tried to make me paranoid by wanting my to pet the squirrels but I knew they were rabid, or may have been. </p><p>A Jewish woman passed by with her three kids, one in a stroller. I looked at her eyes and they were shining green. The green was everywhere. I looked at the eyes of her children and they were the same. I was very frightened. When we left the park, very soon after that, the woman was in the dirt changing the baby and she looked at me and boy did I feel a shit load of fear. </p><p>While in the park, sitting down, I felt euphoria, my body felt very good everywhere. I was enjoying it all. We left and L called her mom and it was a little hard to be standing up. As I was walking, I felt very light and I said, What kind of a moron thinks they can fly on acidI can!!!!! I jumped up and falling down didnt feel like it, it felt like I was still walking. So we got to Gs house and we were sitting outside and I felt the acid rising and falling gradually. I didnt want it to go away. When I put my hands behind my back, it was weird, like they were no longer a part of me, yet they still were. G showed a CD cover which showed something wet and yucky and disgusting and she asked if it looks like a vagina and I was like... yuck, no, maybe. She was like, in a few years, youll know. I found it mean, as in I thought she was very homophobic, but at the same time I didnt feel threatened. </p><p>I was sitting there and me and L were talking about how we need to try other drugs. And I observed the trailing phenomenon on my hand. It was interesting. Ls parents arrived and we all got in. I didnt want to look at them and L was sitting there singing the sesame street on marijuana song. Her parents were so busy fighting that they didnt even notice. That was it, I realized thats what fucks L up a lot, and she wants attention. At that moment I could almost cry. </p><p>We were driving and I was looking out the window, and I couldnt tell where we really were, yet I could, yet I couldnt. We got to her house and I walked up the stairs and I lied down on her bed and I looked at her posters. It was then that I looked at a picture of Marilyn Mansons arm and saw hair on it and I realized that Manson is human. It struck me that I thought of him as something other than human, but he is. It was cool to realize it. </p><p>We later watched Moesha (for the first time in my life) and it was hilarious to watch it without sound because I could make it all up in my head. I thought that this episode was about facing racism in school, and it really wasnt. It was fascinating to watch it. TV on acid is fun. I ate some candy and oh my god, it was delicious. I enjoyed it. </p><p>Soon after I went home, I was driven and I made it home and I has hyper and great all night. I talked to people and listened to music and felt excellent, while enjoying some cute closed eye visuals. I looked at some of the classical period paintings in my room and they seemed to be moving. The horses and carriages of 19th century Paris came alive. The letters on my screen seemed to be floating off the screen, yet a second later they werent. </p><p>I watched the season finale of Buffy the vampire slayer in the dark and it seemed so much better. In this episode, there was a bright dimensional portal which seemed to be illuminating itself everywhere. </p><p>I went to sleep late and at 1:30 or so, I have to be honest and say, I jerked off. It was amazing to orgasm. I saw very, very, very interesting visuals in the dark. They were tunnelling and just surfaces. It was so cool. I experienced the very threshold of LSD and it was amazing. I wish I had gotten into conversation more and I need to do it again. Now that I look back, I feel like I was holding back the whole experience because I was too scared to let it out. I cant imagine the beauty I would have beheld in the world around me if I had let it out.</p>"
}
