{
 "title": "The Need For a Good Laugh",
 "author": "Don't fearthe Reaper",
 "citation": "   Don't fearthe Reaper. \"The Need For a Good Laugh: experience with Mushrooms - P. semilanceata  & Cannabis (ID 9725)\". Erowid.org. Jul 8, 2005. erowid.org/exp/9725",
 "substance": "Mushrooms - P. semilanceata  & Cannabis",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "100 caps",
   "oral",
   "Mushrooms - P. semilanceata",
   "(tea)",
   " ",
   "2 joints/cigs",
   "smoked",
   "Cannabis",
   "(tar / resin)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9725",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 8, 2005",
   "Views: 3165",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>With my first few trips into the land of Mushrooms being less than successful, I put my self down as not a Mushroom person, so when the season for them came round I wasn't going to bother.  When one of my mates asked me if I would help him pick as he wasn't 100% sure of what he should be picking I willingly agreed (I think picking mushrooms is a laugh, even if I wasn't going to be taking).  So after a day of slopping about in the pouring rain we finally came back with quite a few. After trudging about in the rain all day and a prospect of a pretty dull night, I thought 'go for it nothing better to do'.  We decided to wait until after tea to take them as it was getting late and we were both hungry. Slightly suspect of eating before Mushrooms, I had a bite to eat and proceeded to sort out my brew. </p><p>First I boiled a cup or so of water reduced the heat to a simmer then I added the shrooms (about 100) plus some lemon for acidity (helps break down the stuff that gets you mashed), then a little bit of ginger (I heard ginger helps settle you're stomach) and simmered it for about 5 min then left it to sit for about 10 min, strained it and the brew was ready.</p><p>For the past couple of days I had been feeling quite ill and was not sure of how wise it was (you're mind set has a lot to do with you're trip), I thought F*** it I feel ill any way I might as well be ill and tripping.</p><p>About 8:30 pm I drank the brew, feeling a little better after some food. After about 45min of playing Tekken 3 I needed the toilet, by the time I was back in my room I could feel it.</p><p>First effects of it was hard to define, the lights seemed to increase in brightness, the walls started to undulate, slightly at first all most undetectable but as time wore on it increased, after about 15 min of this, every thing was undulating. I switched on my TV to try and gain some perspective of what was normal but every thing anyone said seemed too stutter and repeat them selves. After a couple of min's I didn't know what I was watching or what they were saying. I turned the TV off. Now I was in my own little reality I searched for music but could not find anything I wanted to listen too. So I sat on my own in silence tripping, with nothing to concentrate on my thoughts turned inward, I started thinking about all the things in my life that weren't right, all my past mistakes things I should have done (I don't normally think like this).</p><p>I was getting further and further from where I wanted to be, the more depressed and wasted I became the less I wanted to be tripping. Just when I really started to regret taking the brew the doorbell rang, it was my mate who had helped me pick the mushrooms. He had drunk his and was having a good time.  As soon as he arrived the night improved.  No longer wallowing in self pity I had someone to talk to, someone to compare experiences with, more importantly someone to have a laugh with.</p><p>The trip improved immensely after this, I no longer felt depressed or ill, my mate spilled a whole bottle of lemonade on my bed and it erupted every where after that we started to laugh and didn't stop for ages.  All the worry and stress slowly dissipated the more my mind began to enjoy the trip. Every thing made less and less sense and became more and more amusing the smallest thing became a source of hilarity, cigarettes were funny, the music we were listening too sounded strange and amusing. The rest of the night was spent wandering about the town outside on a misty night (very trippy) speaking bulls**t and generally having a laugh.    </p><p>I would recommend Mushrooms to any one (I never felt too ill but I have before, maybe it was the ginger, I didn't use it in my last brews), but only if you have someone with you that's on the same wavelength as you. And more importantly you can have a laugh with.</p><p>P.S. Before brewing them I dried them for about 5 min in the oven at 190°C. Speaking from experience this did make a noticeable increase in there potency.</p>"
}
