{
 "title": "Smoked KAVA 'self made' Extract",
 "author": "Specter",
 "citation": "   Specter. \"Smoked KAVA 'self made' Extract: experience with Kava Kava (ID 9732)\". Erowid.org. Oct 3, 2001. erowid.org/exp/9732",
 "substance": "Kava Kava",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Kava",
   "(extract)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9732",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 3, 2001",
   "Views: 22352",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI made my own KAVA extract the fallowing way.<br>1/2 cup Kava was placed in the blender and was choped on hi speed for about 5 mins. <br>Powder was plased into a canning jar with enough acetone to cover all the powder and a spoon was used to mix the stuff around for about 5 mins. <br>The liquid was then strained through a coffie filter and the root matter was placed back in the jar and the process was repeted.<br>The acetone was evaporated off and I was left with a resin that when I scraped into a ball looked and felt like carmel 'the square candy kind' '-=CAUTION=- MAKE SURE ALL THE ACETONE IS EVAPORATED'<br>I then took a small chunck and smoked it in my favorite pipe. It tasted very much like I would think burnt rubber would taste and the smoke was a little harsh but surprising easy to hold in.<br>I felt the effects pretty quick first my mouth to my lungs got a numb feeling but not realy numb. Then my brain felt it 'its hard to describe its is a buzz I have never felt' I can think fine and altho I can seem to move fine as well I think I would feel fine just sitting and not moving at all 'I am still feeling the effects and I smoked it about 45 mins ago '.<br>I have no clue how long this feeling will last but I can say one thing for sure this is NOT A PLACEBO effect. It is very strong feeling and my mouth is still numb. if this dose is an indication it seems to have made 1/2 cup of root powder 'enough for 2 people in most cases' into enough for me and about 20 friends to enjoy. Now thats what I call getting my moneys worth.\n\n\n"
}
