{
 "title": "Best stimulant EVER!",
 "author": "Karmalander",
 "citation": "   Karmalander. \"Best stimulant EVER!: experience with Ethylphenidate (ID 97419)\". Erowid.org. Sep 13, 2012. erowid.org/exp/97419",
 "substance": "Ethylphenidate",
 "bodyweight": "50 kg",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 97419",
   "Male",
   " ",
   "Age at time of experience: 22",
   "Added: Sep 13, 2012",
   "Views: 11424",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Yesterday has just arrived a sample of 1g ethylphenidate. I (of course) got excited bout it and wanted to test it. It has the form of tiny white crystals, beautiful.</p><p>I proceded to crush a crystal sized like a salt grain and snorted this microscopic bump of (speculating) about 5mg. Slight mood elevation, no stimulant effects.</p><p>Starting to snort a relatively bigger bump every 1 or 1/2 hour to the point of snorting a tiny line. For the first two or three lines I snorted there was no real stimulant edgy effect just more and more elevated mood and lots of energy even under the hot summer sun.</p><p>Then I proceded to snort my fifth line. That was too much, a line that if it was coke could be almost ineffective pushed me totally over the edge. I started to be fucking SPEEDY! I had got to get out of home, went to wash my car and I was like a washing robot! I needed to do something, anything. It was too much for an everyday setting, that was a big party dose. I could have gone mad with so much speed in my system and nothing really to do.</p><p>So after about 1 h after the last line I smoked a little joint to calm myself down with the only results of getting more confused. Then I went to the park I chatted for about another hour with a friend when he got the right idea of having a bike ride.</p><p>So I rode my bike for almost two hours while I got from sky high to almost baseline, that is kinda nice cause if it was real amphetamine it would have taken an entire day to get down and calm from where I was.</p><p>Sooooooooo This is ethylphenidate!!!</p><p>It is a really cool and useful drug to use instead of amph or coke if I have to rate it I would rate it higher than both, cause it seems the a cross in between of them retaining all the best qualities and leaving most of the bad ones. only drawback, it is too powerful and I have to be careful to not overdose it.</p><p>Be Safe Have Fun!</p>"
}
