{
 "title": "Eschers World",
 "author": " The Ghost of a flea",
 "citation": "    The Ghost of a flea. \"Eschers World: experience with  25C-NBOMe (ID 97423)\". Erowid.org. Oct 3, 2012. erowid.org/exp/97423",
 "substance": " 25C-NBOMe",
 "bodyweight": "10 kg",
 "header": [
  [
   "DOSE:",
   "525 ug",
   "sublingual",
   "2C-C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 97423",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Oct 3, 2012",
   "Views: 6621",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI am a complete novice to the use of psychoactive compounds; apart from a few relatively unsuccessful salvia experiences this would prove to be my first psychedelic experience. The setting was predominantly at my home where I felt comfortable if things took a turn for the worst. \r\nI took 350mcg of 2C-C-NBOMe (25C-NBOMe) in blotter form as a trial; this was successful so the following week I upped the dosage marginally to 525mcg (1.5 blotters). The blotters were HPBCD complexed to improve bioavailability and absorption. I knew it was going to be a long day so I went for an early start of 8.00 am after a breakfast of fruit. I have my twin brother as a sitter, who has previously tried this compound at 350mcg.\r\nT +0.00, 8:00 am \r\nPlaced blotter under tongue, due to the HPBCD mild numbing of the mouth occurred after about ten minutes. No excess saliva production was evident.\r\nT +0:20 \r\nSlight heaviness of limbs and patterns appear on carpet under inspection. Increase in phosphene activity.\r\nT +0:40\r\nChew the remains of blotter before removing\r\nT +1:00 \r\nMove down stairs and patterns more prominent, covering most but not all surfaces, short-term memory loss and mild loss in concentration set in. I watch TV and my twin flicks on some childrens TV, (Childrens TV is really strange) which seems hilarious and I burst into laughter until tears run down my cheeks. I feel good; I am looking forward to the next few hours.\r\nT +2.00 visuals in full flow now, decide to go for walk through small wood, which looped, back to my house. Visual description- Patterns, repeated two-tone designs cover every surface there is a sense of continuation running between every object. They very much resemble the work of Escher in the way each pattern interlocks. The grass, sky, trees have an ingrained geometry. They all have a linear quality about them, not composed of purely straight edges but disorder is absent; under closer inspection they transform creating new 2-d designs. Some objects start flashing and I am bombarded with visual information that is hard to take in the true complexity that arises. The patterns tessellate forming perfect tilling. I keep commenting with exclamation about the breath-taking patterns to my sitter.\r\nThe sun is blazing illuminating a beautiful vista. A strong euphoric feeling surges through my body, not overpowering or electrifying but warm and fresh. As I continue walking the scenery constantly reanimates its self. It seems like a new iteration to a wonderful visual function is being performed with every step I take. My headspace is clear, no signs of any lingering anxiety or malicious thoughts. The occasional thought loop causes a lapse in concentration and short term memory.\r\nI close my eyes and am confronted with a kaleidoscopic world, which rotates around a central point. The internal world is intriguing but I am more fascinated by my opened eyed visuals. Such an alteration in perception is very interesting its a shame such little scientific literature exists on the exact mechanism of action on psychedelic substances and I hope research continues to receive funding. Infrequently a small patch of my peripheral breaths, this doesnt seem like a very spatial hallucinatory drug at low doses. Colours seem enhanced with rich hues and vibrant shades. There seems a lack of unconscious intervention in the formation of the visuals, as they do not take the form of identifiable objects or beings, they remain purely geometric. \r\nT  +3:00 \r\nWhen I get home the floor tilling starts animating, moving and swirling and flowing tile to tile like a slideshow. The pattern moved vertically up the kitchen cupboard. Listening to music in my room I enjoyed the moving visuals on the ceiling as well as an attempt to confront some internal demons, this was fruitless as I wasnt in deep enough to draw these problems to the surface that normally only manifest themselves indirectly through anxiety and intrusive thoughts. I think only a true mind-fuck would achieve this and since I have no intentions to try DMT or ego destroying doses of other substances I shall have to resolve these problems in a less radical way.\r\nThe Music sounds good but there is a lack of distinct auditory hallucinations just maybe the odd repeating sound that seems indistinguishable from a property of the music or an auditory distortion. I listen to mainly the Horrors, Neon Indian and MGMT; Fourth dimension transition is such a good tune to listen to whilst peaking. \r\nT +6:00 \r\nIntensity has dropped off and I am able to function properly with cognitive ability intact. I spend the next few hours just chilling and listening to music, my appetite comes back.\r\nT +16.00 I go to bed and I enter sleep with not too much difficulty.\r\nThe drug doesnt seem very introspective so I remain sceptical of its therapeutic potential. However it does seem very easy on the body, the come up was comfortable and the body load was very bearable with no evident nausea. It has a slight mental strain, as the duration is very prolonged. Although after seven hours the intensity had significantly decreased open eye visuals were still present 15hrs+ after. Even at 24hrs+ infrequent visual disturbance can be noted such as white sparks flying of objects or intense periods of phospene activity accompanied with minor colour distortion. \r\nThis compound is simply wonderful, after scouring the Internet I came across this compound as a contender. I was not disappointed and it certainly delivered. I have had no experience of LSD so I am unable to comment on the similarity, however I think this a great compound for anyone looking for psychedelic experience as the visuals are quite frankly amazing, I would urge the psychedelic community to keep making trip reports to help build on the limited number of trip reports. This compound has a potential risk for abuse as a heroic dose is likely to have some nasty implications and could prove potentially fatal (Vasoconstriction). I found the 500 mcg was a nice manageable dose and wouldnt be tempted to push it above 800 mcg. I hope you found this report enjoyable to read and informative.\n\n\n"
}
