{
 "title": "Nocturnal Glory",
 "author": "vi",
 "citation": " vi. \"Nocturnal Glory: experience with Morning Glory (ID 9743)\". Erowid.org. Jul 9, 2005. erowid.org/exp/9743",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "375 seeds",
   "oral",
   "Morning Glory",
   "(tea)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9743",
   "Male",
   "",
   "Not Given",
   "Jul 9, 2005",
   "3612",
   " "
  ]
 ],
 "report": "<p>After researching a bit on the internet about Morning Glory I decided to try it out with some friends.  I purchased about 100 g of the Heavenly Blue variety from an Internet botanical retailer.  They claimed that their products were pure are were devoid of any pesticides/chemicals.  I decided to try out a preparation I had also found on the internet, one using water as a solvent instead of the whole ethanol thing.  I choose to make 5 doses of about 250 seeds each or about 6g.  I powdered the seeds using an electric coffe grinder and then put the powder in glass jars.  I then added about 2 cups of water to each jar and shook it up.  I let the jars sit for about 3 days in a cooler, occaisonally shaking them up.  After the 3 days were up I placed the liquid mixture in one of those french coffee presses.  You know the ones where you mix the coffee with water together and then press the wand down which traps the coffee grinds at the bottom.  It worked perfectly for the morning glory gunk.  Then I just poured the mixture back into the jars.</p><p>Later that evening I met up with some of my friends and 4 of us decided to try the mixture.  We actually heated the morning glory mixture and mixed it with Hot Chai Tea.  This tasted very good, would definitely recommend it.  I was starting to feel it less than 20 minutes after ingestion.  Kind of that feeling you get in the pit of your stomach when mushrooms are starting to kick in.  On my part little nausea was felt but one of my friends ended up throwing up after only 45 minutes, but she was good after that.  The other 3 of us were just fine.  About an hour went by and the effects were definitely felt, but it wasn't quite what I had expected.  It was very smooth, you had complete control.  We decided to change the scene, so we loaded up into my car and drove around.  We decided to listen to some trippy bjork music which was just perfect.  I live on an island so all there is really to drive through is forest or roads along the shore.  Being in this environment was perfect for the trip, I dont think driving around in a city would be all that fun.  We drove down to the beach and walked out to the end of a long fishing pier.  We sat here for awile talking and smoking some hash.  This had a very nice affect on the trip, making it even more chill.  The moon and the lights from near-by Seattle reflected off the water playing tricks with our minds.</p><p>About 3 hours had passed at this point.  Since I wasn't really tripping all that hard I remembered that I still had an extra dose of the morning glory mixture, so a friend and I delt it up. This made the trip a bit stronger but not much.    </p><p>The only word to describe the evening was smooth.  There were no real visual hallucinations, just more like the same sort of body high you get from mushrooms.  I could definitely let my mind 'go' but if I wanted to be in control, I could.  One nice thing about MG is that I'm not so sensative to things as I am on mushrooms.  On mushrooms its easy to have a bad trip, like if I get yelled at or a situation is uncomfortable. There is not the same emotional connection with MG, and I definitely didn't have half the paranoia I would normally have on mushrooms.</p><p>I tripped from about 10pm until I went to bed at 4am.  And when I woke up the next day I could still feel its effects strongly.  I felt stoned the whole day.  </p><p>I would definitely try MG again, it was a great experience.  I might try more seeds next time to see if I can acheive stronger trip.  Maybe during the day time.</p>"
}
