{
 "title": "Barely a High With Come Down From Hell",
 "author": "hugsandrugs",
 "citation": "   hugsandrugs. \"Barely a High With Come Down From Hell: experience with Piperazines BZP  TFMPP (ID 97533)\". Erowid.org. Feb 20, 2013. erowid.org/exp/97533",
 "substance": "Piperazines BZP  TFMPP",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 ",
   "oral",
   "Piperazines",
   "(pill / tablet)",
   "  T+ 1:30",
   "0.5 ",
   "oral",
   "Piperazines",
   "(pill / tablet)",
   "  T+ 4:00",
   "0.5 ",
   "oral",
   "Piperazines",
   "(pill / tablet)",
   "  T+ 4:00",
   "0.5 ",
   "oral",
   "Piperazines",
   "(pill / tablet)",
   "  T+ 5:00",
   "1 ",
   "oral",
   "Piperazines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 97533",
   "Gender: Female",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 20, 2013",
   "Views: 1053",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nMe and my best friend 'H' were going to an EDM festival and wanted to roll or trip. My mind set was good because I was excited for the concert and I've been doing a lot of meditation and yoga, except many changes are about to occur which I've been stressing out about. H and I had just been ripped off when we tried buying tabs; so in a moment of desperation we bought pills that were sold as E from a last-minute source. Which was mistake number one.\r\nWhen receiving the green transformer cut-outs (6 in total), I automatically got a bad feeling because cut-outs usually aren't to be trusted. Then I did some research on them and found out that a lot of them were piperazines. I've never tried them before and when I looked up the effects it sounded close to MDMA. (I've done MDMA, E, speed, and smoke weed often) So I decided that it was better than nothing and to take the pills anyway. Mistake number two.\r\n11:30 a.m. - Me and H each take half a pill and go to the first set.\r\n12:30 p.m. - Slight wave of euphoria, only lasting 5-10 minutes, then gone.\r\n1:00 p.m. - Take second half of pill.\r\n2:30 p.m. - Feelings of coming up or on the verge of coming up but only lasting 5-10 minutes again. I start getting stomach cramps, back cramps, muscle soreness, and become very tired of dancing, very quickly.\r\n3:00 p.m. - We get lunch, just thinking that we haven't digested the pills completely yet and that we'll begin to roll after we eat.\r\n3:30 p.m. - Start getting a nice body-high going, smoke a cig (amazing), and then after 10-20 minutes or so, the buzz is gone. We both get pissed off and take another half of a pill.\r\n4:30 p.m. - In the crowd again and I am utterly exhausted, annoyed, and hate life. It's hard to enjoy the music because I feel so drained. We have both taken 2 pills at this point but still nothing.\r\n5:30 p.m. - Still feeling very sober, H and I take the third pill and chew it. Disgusting, chemical taste that refused to leave my mouth no matter how much water I downed.\r\n6:30 p.m. - At this point, we are so tired, hot, and de-hydrated we can't even stay in the crowd to watch one of our favorite DJ's perform.\r\n7:00 p.m. - We eat some ice cream and there is another intense body-high. We are both cracking up and saying, 'oh shit' because we thought all of the pills were about to kick in. To our surprise it was just another tease and we are 'sober' again.\r\n8:00 p.m. - We get some energy after eating a couple slices of watermelon and dance for an hour or two. We decide to leave the festival early because we are so worn out.\r\nWe kept saying that they were 'beat pills' but now I know (finally) we were pipe-bombed. The come-down is terrible. Insomnia, heart-burn, irregular heartbeat, soreness, and nausea. Seems like a case of some BZP's and TFMPP's from the other experiences I've read. \r\nI would recommend avoiding it if you can. It's not smooth at all and feels completely unnatural, plus the comedown just isn't worth it.\n\n\n"
}
