{
 "title": "Symbols of the Divine Language",
 "author": "nut",
 "citation": "   nut. \"Symbols of the Divine Language: experience with Mushrooms - P. cubensis (ID 9755)\". Erowid.org. Jul 9, 2005. erowid.org/exp/9755",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2.5 g",
   "oral",
   "Mushrooms - P. cubensis",
   "(fresh)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9755",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 9, 2005",
   "Views: 4294",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>The shrooms showed up. It was 10:00 pm. I began to eat my ration of shrooms, chewing them up and sitting the pulverized caps and stems between my lip and gum. I swallowed the original mouthful after 10 minutes or so and sucked on a cap for 1/2 hour, eating various parts and stems the whole time. As soon as I started to feel high, my friends and I set out on our journey.</p><p>We walked and walked, beshroomed and having a good time. We saw a cop, but he didn't fuck with us. Oh yeah where I live the cops are like a gang or something. They fuck with everybody. So this was a fairly important event. To me, not the story.</p><p>Closed eye visuals came to me about an hour and a half after eating my dose. They consisted of thousands of cubes, of which 3 sides were always visible. Each side of each cube had a different color, and they were always changing. After a few minutes, the cubes formed into an eternally morphing color changing mass that began to rotate on all axes. This was by far the most beautiful thing I have ever seen in my entire life.</p><p>After walking for 3 hours, I and my friends returned to the house, and I went to the back yard with one of my fellow spiritual explorers to enjoy the colors. I saw much of what I saw before, but now I experimented with it. By pure will, I could transform the experience into anything I wanted it to be, within the strange rules and laws of this strange place I was seeing. I could think of the word tunnel, and *snap* the landscape of cubes and colors would dip in the middle, and before I knew it everything was streaking past me. I thought of a spiralling twisting tunnel and got it. Unfortunately, the tunnel thing was so engulfing that I neglected to try some of the other things (falling, nothingness, white light, god)</p><p>I decided to enter the house and lay down. Now this house is a symbol of safety, security and happiness to me. It is a special place if you will. As I stepped through the doorway into complete darkness, my field of vision started to fill. I was losing my ability to walk, so I made for the couch. Upon laying down, I was flooded with a vision. In the vision, hundreds of characters of some divine language flowed past me. I did not know what the symbols meant, only that they meant something, and it was very important. I felt like a great knowledge was being bestowed upon me, but I figure I am not enlightened enough to understand it. </p><p>Nevertheless, I am eternally grateful for the glimpse at the book I cannot understand.</p><p>Mushrooms expand me. They make me love. Having seen what I have seen, I find it near impossible to inflict harm upon another human or other animal.</p><p>-nut</p>"
}
