{
 "title": "Interesting, but Nothing Special",
 "author": "who am i",
 "citation": "   who am i. \"Interesting, but Nothing Special: experience with 25I-NBOMe  (ID 97562)\". Erowid.org. Sep 13, 2012. erowid.org/exp/97562",
 "substance": "25I-NBOMe ",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "sublingual",
   "2C-I-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 97562",
   "Gender: Male",
   " ",
   "Age at time of experience: 16",
   "Added: Sep 13, 2012",
   "Views: 4130",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI bought 3 tabs of 25I-NBOMe from a reputable source (who also had DOB at the time, making it more legitimate in my opinion - 25I-NBOMe is an analogue and modification of DOB) with the intent to trip with two friends. It would be their first psychedelic experience (previous drugs for them include only marijuana, alcohol, and K2.) I have previously taken Vicodin, Diphenhydramine, 2C-E (both on and off of an SSRI), pure MDMA, weed, alcohol, K2 and pure JWH-018.<br>Before tripping with my friends, I decided it may be a good idea to test the drug first, as I don't want to spook them from psychedelic experiences, and the 25I-NBOMe does not have a ton of information about it online (many of it not so good.) I decided to take it at the start of an hour and a half long class, so it would start kicking in near the end of the class. A friend of mine who is fine with drugs and would be ready to keep me calm if I so needed is in this class and knew I was taking the blotter.<br>12:30pm (+00:00) - Put tab under my tongue. Plan to hold it there for fifteen minutes at which point I will swallow.<br>12:45pm (+00:15) - Swallowed the blotter. No effects yet. The blotter was very bitter, and my mouth has a numb/burned out feeling to it, especially under the tongue and on the inside of my lip.<br>1:00pm (+00:30) - Feeling the slightest hint of something, could just be excitement. Got a Sprite, some Donuts and a Mountain Dew. Sprite tasted nasty, due to the bitter taste left on my tongue. Donuts didn't have much taste, but did taste good for what I could taste. Mountain Dew was also quite bitter.<br>1:15pm (+00:45) - Definitely not at baseline anymore. No real visuals yet (although the brick wall in this class is looking pretty nice.) Realized I wasn't at baseline when it hit pretty quick. Just sort of feel weird about being in class all of a sudden, my perception of everything is a little different. Class looks different than it did previously.<br>1:30pm (+01:00) - Walls are breathing. Definite visuals. Itching to get out of class. I feel like I want to move, and being stuck in this class is not feeling nice.<br>2:00pm (+01:30) - This drug is nothing like 2C-E, which I mistakenly thought it might be similar simply by being in the 2C family. 2C-E gave much more intense effects in the sense that everything appeared more beautiful aesthetically, and I had an overall better feeling. However the body load is much worse on 2C-E. I feel completely fine in terms of body load, in very positive spirits, laughing more than usual, and it is definitely an empathogen. Also my friend touched her hand to my back, and it felt magnificent to connect with another human being on a physical level. Not erotic though.<br>2:30pm-3:30pm (+02:00-3:00) - Visuals are peaking. I am laying on the floor, very comfortable, my body feels warm and well. A friend is reading poetry by Andrea Gibson and I feel very affected by it. When her voice changes to anger, I feel real anger. When the poems get sad, I nearly want to cry, but not in a bad way. This is pleasant. I really enjoy this.<br>4:00pm (+03:30) - Pretty much back to baseline. Definitely still got a more creative flow, and I wrote a couple poems myself, that are better than I would usual write. I still feel affected in my mind and I still feel in very positive spirits, wanting to talk to people, hug, etc. but the visuals are long gone and any real mental alteration I had is gone too (although I was pretty lucid even during the peak.) I want to redose, although I don't think it's due to the drug. I'm simply curious about this chemical. I'd also like to try it at a higher dose.<br>8:00pm (+7:30) - Typing this up now. My mind feels cloudier than it did at 4:00pm, almost certainly due to the 25I-NBOMe. Hopefully a good night's rest will take care of this 'hangover'.<br>All in all, the trip was very nice. I do wish I could give an accurate idea of how much was on the blotter, but unfortunately I do not know. I was able to remain lucid during the entirety of the trip, although I definitely may have been perceived by some as much more giddy/happy/laughing/talkative than usual. Additionally at the peak I was stumbling over my words a little bit (as if they were coming in the wrong order.) Nothing too noticeable.<br>I much prefered 2C-E to this, and given the risk from 25I-NBOMe (e.g. reported brain bleeding, seizures, many reported overdoses even at reasonable doses) I don't think I'll be doing this again soon. The want to redose that occured around 4:00pm has definitely worn off. I actually want to be free of the two tabs still in my backpack. Not that the drug was bad, but I've been spooked from reading some stories about this specific NBOMe online, and it certainly wasn't more noteworthy than, e.g. 2C-E, which seems to be much safer in my opinion.<br>I don't think I'll be taking this when my friends take it, if they decide they still want to.\n\n\n"
}
