{
 "title": "A Strange Medicine",
 "author": "Turbinia",
 "citation": "   Turbinia. \"A Strange Medicine: experience with 5-MeO-DALT (ID 97566)\". Erowid.org. Jan 2, 2013. erowid.org/exp/97566",
 "substance": "5-MeO-DALT",
 "bodyweight": "87 kg",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "97566",
   "Male",
   " ",
   "42",
   "Jan 2, 2013",
   "Views: 1792",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>5 MeO DALT; a strange medicine</p><p>I am a healthy male in my early forties and have for many years experimented with psychoactive substances. The reasons for these experiences are aligned with curiosity and pleasure, rather than with escaping from an unpleasant reality. My life, as it is, is very fulfilling and I am surrounded every day by beautiful loving people whom I also love very dearly.</p><p>I used cannabis infrequently for several years until I gave up tobacco smoking, during my early thirties. For the last four years I have used phenethylamines and tryptamines, once a month or so, with some occasional use of stimulants, three or four times a year.</p><p>Heres a recount of my experiences with 5 MeO DALT.</p><p>I bought a one gram bag of 5 MeO DALT from a reputable source and after assessing the weight of the indifferent grey powder, I mixed it in a bottle of 300 millilitres of Japanese Sake, resulting in a concentration of 3.3 mg/ml. This is one of the safest and more precise ways of measuring substances when you do not have access to a milligram scale. </p><p>Initially I tried two doses of 5 MeO DALT; the first of 20mg, and the second of 30mg; both separated by a week to prevent tolerance from building up in my body. </p><p>As other researchers have written before me the effects of this substance are short-lived: just 10 minutes after ingestion I started noticing a peculiar change in the perception of time and space. </p><p>The come up period was gradual; my pulse was slightly higher than normal and I began to feel queasy in the stomach - a generic effect of these compounds that I have learned to solve by slowly sipping half a cup of sparkling mineral water.</p><p>Music did sound deeper, but I attributed this to a placebo effect and not to the drug itself. My appetite had been suppressed and my body registered changes in temperature in a slightly distorted way. I felt some shortness of breath and mild vertigo, and I also noticed that my train of thought was in disarray: my mind would wander aimlessly and then, somehow, it felt like being suddenly woken up from a daydream. </p><p>Taking a shower felt good as my tactile sensation was heightened. Eroticism was also heightened and reaching orgasm was not difficult, but it was not as special as when using other compounds. At these doses, I did not experience any visual or auditive changes.</p><p>The effects were wearing off by T+1:30, and by T+2:30 I felt back to normal. I did not feel hungry for the rest of the night and I went to sleep some four hours after the end of the experiment. Sleep was light and not very restful, but the next day I felt fine and my appetite was normal.</p><p>Even though the second dose was 50% greater, it was very difficult for me to establish a correlation between dose and effect. </p><p>At the time, I rated both experiences a ++ using Shulgins scale. Some mild excitement and minor perception changes were experienced, but nothing special. </p><p>One month after the last experience, I decided to try 5 MeO DALT again, but this time in a larger dose.</p><p>I measured 15 millilitres of Sake - giving me 49.5mg of the compound and proceeded to ingest the liquor with a small bite of dark chocolate, to mask the intensely bitter flavour. I find this compound to be one of the worst tasting of them all.</p><p>As before, the first noticeable effects started around the 10 minute mark but they were much more pronounced this time. The coming up phase was fast and I noticed for the first time that my body was feeling restless and uncomfortable: one of the typical effects I feel with tryptamines.</p><p>I decided to lie down and went into my room, which is one of my favourite places in our apartment. With ample windows and full of light, its a great place to relax and enjoy a experience in a safe and familiar environment.</p><p>The first definitive visual I noticed was the oil slick halo effect around sources of light: faint rings of iridescent colours that were growing stronger by the minute. The halos shift shapes and contours, much like oil slicks on water, and they are a classical indicator that I have ingested a psychedelic. After a few moments of visual enjoyment, I felt my limbs relax more and more, until I reached a point where I was simply too comfortable to care about moving them.</p><p>I had forgotten to bring a music player with me into the room, and was now too engrossed into the effects to be bothered by getting up to find one. But even as I thought about this minor inconvenience, I realized that the visual aspect was coming at a whole new level of intensity that I had not experienced before.</p><p>The lights coming through the window were intensely beautiful, with many coloured halos and reflections sparkling across the room, and the white ceiling looked velvety and inviting. I understood at that moment that this compound was visual and I started to look for surfaces where the effects would be noticeable; like textures of the curtains or the bedspread. This experience would be a strong ++ according to Shulgin.</p><p>For the next 20 minutes I was numb in my bed; looking at the play of lights and textures around me, and feeling deeply happy and grateful for the opportunities and experiences I have lived. I did not experience a breakthrough, but I did feel at peace. </p><p>The peak of the experience did not last more than 20 minutes and the come down was equally fast: I was baseline within four hours of first taking 5 MeO DALT. </p><p>Once the effects had worn down I had a quick shower and sat to watch TV for the rest of the evening. I did not feel especially hungry or tired, but I had an indistinct feeling of malaise; of not wanting to stay put in one place and not wanting to be alone with my thoughts.</p><p>The next day I woke up from bed feeling a bit tired, but hungry. After a nice breakfast I was ready to start another day full of activities and I thought no more of the experimentation with  5 MeO DALT. Until now.</p><p>5 MeO DALT has a very peculiar rate of absorption and metabolization, and somehow my instinct is not convinced about the safety of this product; even in relation to other tryptamines. I am convinced this is a strange product; with a small threshold between pleasure and pain.</p><p>I find 5 MeO DALT to be a superficial, mostly visual and possibly an undervalued research tool; but the body load and the malaise I felt is something I relate to more interesting and lengthy experiences with other compounds.</p><p>In all, it was not an earth-shattering experience and after rationalising the experience and writing these lines, I flushed the rest of the bottle down the drain.</p>"
}
