{
 "title": "Strong Euphoria Love and Smiles",
 "author": "25Bliss",
 "citation": "   25Bliss. \"Strong Euphoria Love and Smiles: experience with 25B-NBOMe  (ID 97629)\". Erowid.org. Oct 1, 2012. erowid.org/exp/97629",
 "substance": "25B-NBOMe ",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.5 hits",
   "buccal",
   "2C-B-NBOMe",
   "(blotter / tab)",
   "  T+ 0:40",
   "  ",
   "inhaled",
   "Cannabis",
   " ",
   "  T+ 5:00",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2012",
   "97629",
   "Male",
   " ",
   "24",
   "Oct 1, 2012",
   "14634",
   " "
  ]
 ],
 "report": "<p>I've tried 25i-NBOMe and 25c-NBOMe prior to this. I knew 25b would be amazing as well. The setting was in my room with easy access to music, drawing, and my computer. It was mainly a test to experiment this compound before doing it at another setting. Overall it was a relaxing day and I was quite excited to try this new NBOMe.</p><p>10:00PM - Placed ~500ug 25b on upper gums (half a blotter). Listening to a meditation online.</p><p>10:20 - I feel more awake. Prior to dosing I was a little tired. I feel weird physically. Maybe a little nauseous.</p><p>10:40 - I feel better. I also vaped a little bit of weed. I just walked/danced around my room singing softly with a big smile on my face. This song is bringing back a lot of memories.</p><p>11:00 - Patterns are much more apparent, how ironic. Brighter colors. I feel somewhat detached from myself and yet, somewhat closer to the real me. It makes me wonder who was behind all the words and emotions all day. Music is enhanced but nothing dramatic.</p><p>11:30 - Totally TOTALLY lost in my own music. I can visualize it in my mind. I almost can't believe I made this. The weed is making this the most chill psychedelic ever too. Amazing combo. The screen is full of colors. Strong euphoria, love and smiles. I am definitely in my own little world. I find it strange how we are all sharing the same reality. Awesome mellow visuals.</p><p>12:00 - Probably at a ++. Super happy. Feeling childish. I want to play. I can visualize ideas in my mind and they're crystal clear. My imagination is another dimension.</p><p>12:30 - I just meditated for 15 minutes. I am here now and it is perfect. This moment. Bliss.</p><p>12:45 - Giggling like a motherfucker. Everything is hilarious.</p><p>1:07 - Perfect psychedelic. Perfect dose. Not too out there. Just right. I love existing. I feel stimulated but very very relaxed.</p><p>2:00 - I'm close to baseline, but I still have that psychedelic frog look in my eyes. No wonder I couldn't sleep. These almonds taste almondy as fuck. I'm gonna smoke more.</p><p>2:30 - Healthy introspection time. Only slightly stimulated. Perception still altered. I can't tell if I'm experiencing vasoconstriction in my legs or if the soreness from working out is kicking in. Very minor but I thought it might be useful to mention it for those who care about body load. I feel more like a feather right now though. Very light, bright compound.</p><p>3:00 - Woah I smoked more and textures are crawling again. This feels so smooth that at times I think I am completely down but I guess I'm still tripping. A Shpongle song is playing inside my head in slow motion and it 'sounds' more clear than it does while actually listening to it. I suppose this is what my friend refers to as the 'third ear'. Feelings of increased confidence. I feel fearless but not manic or insane. Did I just say insane? Pointless scattered thought loops. I have a feeling I'm too stimulated to sleep so I'm enjoying the weed high and trying to be in bliss instead of thinking about sleeping. Tin foil hat moment, it passed. I just saw a cockroach that struck me with fear. I shared a moment of awareness and felt empathy towards this bug. I offered my love and compassion as I sprayed it with Raid like an asshole human being. But I guess he, I, deserved it. Karma. And the cycle continues. Life and death. Metamorphosis. Nirvana.</p><p>4:00 - Going to bed.</p><p>5:20 - Still can't sleep. I gave up on sleeping and I'm back on the computer. Everything is still really colorful but I wish I had a benzo to sleep. I need a breakfast burrito and let's get this new day rolling.</p><p>6:00 - Went to grab a snack and got lost in a painting and realized moving around. Still tripping.</p><p>I slept just fine sometime before 7. No hangover, headache, or any kind of 'fried' feeling. I didn't feel fried during the trip either.</p><p>At this dosage, it is light enough but still beautiful, trippy and meaningful. I only hope the possible side effects are not increased with a higher dosage because this might be my favorite feel-good NBOMe. I can't seem to compare 25i or 25c to this and I don't think I want to until I experience a higher dosage. I want to say this is still psychedelic but not a mindfuck, however I have a feeling the mindspace can get much deeper and psychedelic with higher dosages. I look forward to the next experiment with 1mg. It was so euphoric that I wasn't thinking about tripping harder or anything, but now I can definitely see myself wanting to trip harder than that. I really wasn't expecting much at this dosage though, I was just playing it safe because 25b is still relatively unknown. I'd compare it to acid in the sense that it is so blissful at times. By the way, I call it Bliss.</p>"
}
