{
 "title": "A Great Bad Trip",
 "author": "Tthom",
 "citation": "   Tthom. \"A Great Bad Trip: experience with 25C-NBOMe (ID 97632)\". Erowid.org. Sep 16, 2012. erowid.org/exp/97632",
 "substance": "25C-NBOMe",
 "bodyweight": "8.5 kg",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.25 hits",
   "sublingual",
   "2C-C-NBOMe",
   "(blotter / tab)",
   "  T+ 0:00",
   "  ",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 0:45",
   "0.25 hits",
   "sublingual",
   "2C-C-NBOMe",
   "(blotter / tab)",
   "  T+ 1:30",
   "0.5 hits",
   "sublingual",
   "2C-C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "97632",
   "Male",
   " ",
   "18",
   "Sep 16, 2012",
   "3323",
   " "
  ]
 ],
 "report": "<p>A few weeks ago, I got the pleasure of testing a relatively new research chemical, '25C-NBOMe'. I ordered 2x 500mcg tabs from a trusted online vendor, and received them the next day. From what I'd researched, 500mcg sounded like a relatively decent dose, and I'd never tripped before so decided to take a quarter at a time. Previous drug experiences- Cannabis, extremely low dose of magic mushrooms, MDMA. I was with a friend (J) at the time and we did a tab each.</p><p>T=0:00 (8PM)- Smoke a spliff with J, with a quarter of a tab underneath our tongues (125mcg).</p><p>T=0:45 (8:45PM)- Feeling a bit more high than I normally would, with a feeling of slight pleasant dizziness and a brightened perception of certain colours. Decide to take another quarter each.</p><p>T:1:00 (9PM)- Me and J both seem to lose the tabs within our mouths, not sure whether we have swallowed it or not, so we just decide to swig round our mouths with water then swallow.</p><p>T:1:30 (9:30)- Not really sure if this is working, but I do feel as though I have a permanent smile on my face that is hard to remove, feeling pleasantly relaxed and getting quite into playing Fallout 3 along with listening to some chilled music. We both pop the rest of the tabs underneath our tongues. This is very bitter tasting, and numbing my tongue a lot. Some slight stomach discomfort is noticed.</p><p>T:2:00 (10PM)- Stomach pain gone, however I am getting hot/cold flushes and shaking quite a bit. J is fine though, and I start to get scared that I might be having an allergic reaction or something similar. After a while though, this passes and we put on the film 'Finding Nemo', as I thought the colours would be excellent for the trip. I was correct!</p><p>T:2:30 (10:30PM)- Watching Finding Nemo, finding it very hard to concentrate, the drug starts to kick in slightly stronger now and I get some very strange CEV's, including multiple visions of Nemo's bright red face appearing in a tunnel shape. J is having a great time though, giggling quietly away to himself watching the movie.</p><p>T:3:00 (11:00PM)- Definitely pretty slammed, at least a low to mild +++ on the Shulgin scale. I'm still worried as J isn't noticing that much trippiness and I am nearing the edge of my sanity. I try to do multiple things to take my mind off it, and as stated with other reports, I can still think clearly, which I thank God for. I start to wish that the trip will end soon. </p><p>T:3:30 (11:30PM)- I play some pokemon on my gameboy hoping that it'd take my mind off things, but I kept feeling a wave of heaviness wash over me every 30 seconds or so. This forced me to shut my eyes, and whenever I did shut my eyes, I would see either fractal tunnels or images of pokemon and finding nemo. At one point I shut my eyes, but I could still see everything, and the path from the game I was playing left the gameboy console and joined with the TV. Not much in the way of OEV's, just brightening of colours and slight warping.</p><p>T:4:00 (12:00PM)- Finally it is starting to wear off, and the anxious feeling is leaving me. I'm left with a feeling of great confusion and almost relaxing bliss. </p><p>We go back to playing Fallout 3 and listening to relaxing music... J says that it hardly effected him at all, except he felt very happy and colours were brighter for him. This still confuses me, and as much as it sounds bad, the trip was actually a very interesting experience and I am definitely going to give it another try in the near future, perhaps do half a tab at a time instead of a quarter to ensure that my mind isn't stuck between reality and tripping- it needs to be one or the other for me!</p><p>P.S. I'd prefer to take this drug during the day next time, due to mixed reports and I felt like I wanted to be outside in the sun, but due to the time obviously I couldn't. </p><p>P.P.S. This is quite a new chemical so I'm glad I tried little bits at a time to ensure I didn't have any harmful reactions as the physical side effects of my trip were quite uncomfortable. </p><p>Thanks for reading!</p>"
}
