{
 "title": "Therapy not so Therapeutic",
 "author": "Cat",
 "citation": "   Cat. \"Therapy not so Therapeutic: experience with Bupropion & Caffeine (ID 9773)\". Erowid.org. Jun 14, 2002. erowid.org/exp/9773",
 "substance": "Bupropion & Caffeine",
 "bodyweight": "112 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Bupropion",
   "(daily)",
   " ",
   "  cups",
   "oral",
   "Caffeine",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9773",
   "Female",
   " ",
   "Not Given",
   "Jun 14, 2002",
   "22864",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nI had been on Wellbutrin now for nearly 4 weeks to treat my depression which had worsened this year.  Things had been going well.  During the first 1 1/2 weeks I experienced some anxiety, especially after my second dose 9 hours later.  That however seemed to go away.</p><p>Well, this week, the fourth week, I started experiencing some headaches and nausea and periods of  nervous 'excitement', but thought not much of it.  So on the 3rd day of the fourth week, I woke up and took my normal dose of 100 mg SR.  I proceeded to the store where I felt strange, almost anti-social.  My hands were shaking while I gave the cashier my money. I ate lunch and had a cup of tea and went to work on the computer.</p><p>After a few hours I became extremely hot, had difficulty breathing, I started seeing black spots, and: 'freeze frame'.  I got up to rinse my face off with cold water.  My body was shaking, my legs felt weak, my heart was pounding, the color left my face and my limbs got extremely cold and I could not sit still.  Basically, I had a panic attack and little did I know that the sun was going down and I thought it was still noon.</p><p>I had difficulty remembering names and numbers.  I could hardly speak.  All I had that day was a small cup of tea, mind you I felt strangely before this already.  Basically, Wellbutrin in my opinion is not that safe and people have died from it.  So please, people, be careful with how you use it.  I have now elected to stop taking it. I choose to cure my depression with something that won't make me freak out and feel like I am about to die.  Also, I do not have a history of panic disorder either.</p>"
}
