{
 "title": "The Students Drug",
 "author": "DreamManTom",
 "citation": "   DreamManTom. \"The Students Drug: experience with Methylone (ID 97747)\". Erowid.org. Oct 1, 2012. erowid.org/exp/97747",
 "substance": "Methylone",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "147 mg",
   "oral",
   "Methylone"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 97747",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Oct 1, 2012",
   "Views: 1278",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have tried methylone twice before (103 oral, 110 intranasal) before trying 147 oral, and I enjoyed it thoroughly.<br>0:00  I orally ingested 147mg methylone mixed in water with KoolAid.<br>0:10  Come up effects begin with out fail.  In other experiences I noticed the timeliness of this drug is impressive.  I feel light and bouncy, and as if I have a reserve of energy that I can choose to expend or not depending on my situation.  I feel sober even though it is obvious that I am on a substance.<br>0:30  I am interested in any topic that is presented, and I continuously ask questions because of this.  Conversation is easy and natural, and I experience joy by simply listening to my friend talk about something he is interested in.  Focusing is not difficult, and complex thinking can be performed same as in sobriety.<br>0:50  I feel a sudden drop in my energy like the feeling of a stopping car.  I am still enjoying conversation, but I do not ask questions or talk as quickly as before.  At this point I am enjoying talking and chilling, while before I wanted to talk and know as much as possible.  My drive to talk on this drug is out of interest, not out of stimulation.<br>1:10  I work on homework as I continue to converse with my friends.  It is easy and enjoyable to do homework (genetics) which is surprising to me, and I do not get too distracted from my friends. I feel comfortable talking about any topic, and open to discuss personal ideas and problems.<br>There were light after effects the next day, consisting of having a good day.<br>While on this drug I termed it to myself as the 'Good Day Drug' because its effect is a concentration of how I feel when I am having a very good day.\n\n\n"
}
