{
 "title": "Meaningless Synaesthesia, Metacommunication",
 "author": "Samanthe",
 "citation": "   Samanthe. \"Meaningless Synaesthesia, Metacommunication: experience with 2C-B (ID 9775)\". Erowid.org. Oct 3, 2001. erowid.org/exp/9775",
 "substance": "2C-B",
 "bodyweight": "124 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "2C-B",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "1997",
   "9775",
   "Female",
   " ",
   "Not Given",
   "Oct 3, 2001",
   "Views: 20226",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>\nSetting: Gaichi's house (the boyfriend) in the evening. No particular intention aside from exploring a known dose of 2C-B (in the form of 5mg tablets). We were alone.</p><p>We had tried 2C-B before, in powder form. I am overridingly cautious with compounds that are new to me. That, coupled with the fact that I was eyeballing the dose, had caused me to underdose Gaichi twice (he was less patient with small doses than I was). One of those times was a cooking paradise for me (see Mission Control Kitchen). </p><p>This time we ate the pills, and they came on in the predictably slow, long 2C-B way. We got fidgety and considered what we could do around the house. The visual effects were so distracting that we turned off the light. Then music didn't sound good or right, so we turned off the music. I felt like things were just out of my peripheral vision and would turn my head quickly to try and see them, forgetting that they were merely visual effects. This felt annoying. I wanted the comfort of a blanket wrapped around me. With my blanket, I shuffled down the hall, towards the bedroom. Gaichi behind me had an intense hallucination of me shuffling down a long hall and rapidly getting smaller and smaller, as if I were disappearing into the distance, which bugged him out. We were both uncomfortable with the level or trippiness, and couldn't get situated. Finally we just spooned on the bed and experienced about an hour of intense synaesthesia -- I couldn't tell where my body left off and his started, all our senses were blended together, we were in a puddle of stimulus even though we had turned everything in the house off. It didn't feel visionary or enlightening at all. </p><p>When the acute effects were (thankfully) wearing off, we experienced the most intense communicating of our entire relationship (we had been together about a year). This wasn't the fuzzy yummy connecting of MDMA, it was more mental, with 'metacommunicating' -- talking about not just content but context and process, like discussing the linguistic architecture of our relationship. Neither one of us was particularly good or experienced at this sort of communicating so it came as a sort of revelation. We felt focused and purposeful, and sat facing each other and giving each other explicit support and encouragement (not typical stuff for our relationship). We didn't feel that urgent, rolling high of MDMA, this felt like clarity. Unfortunately Gaichi was not interested in revisiting this level communication in our sober lives. That is one of the reasons we are no longer together.</p><p>The come down was gradual. The next day we felt no hangover. When I was falling asleep, I got closed-eye visuals that looked like neon line-drawings. </p><p>Neither one of us is interested in doing 25mg again. Since then, I have done 5-15mg every so often (when I had pills) because the energy it gave me for dancing is amazing, and it's a nice alternative to alcohol. One time when I was getting serious about quitting drinking, I took 5mg and went to a club. I started to cry at about T+3:00 and got a clear insight into some previously hidden aspect of my life. 2C-B definitely helps loosen up the psychological and emotional stuff and gives me pangs of clarity -- like crisp monosyllables of important information that is easy to understand (unlike fuzzier information via other compounds that has to be deciphered or comes as feelings that are hard to put into words). Of course, I can't remember right now any of those explicit messages so maybe they are not that important! </p><p>I have combined MDMA with 2C-B several times, taking 10mg or so at about T+3:30 of the MDMA. However this makes me feeled cracked out and I'm not sure I want to repeat it, at least not with that timing. Oh wait, I don't do MDMA anymore... Since I don't have scales and can't measure dose properly, I am hesitant to do 2C-B more than occasionally.</p><p>So the moral of the story is: 25mg is my upper (uncomfortable) limit.</p>"
}
