{
 "title": "A Tremendous Tease",
 "author": "Triglyceride",
 "citation": "   Triglyceride. \"A Tremendous Tease: experience with 25C-NBOMe  (ID 97774)\". Erowid.org. Oct 2, 2012. erowid.org/exp/97774",
 "substance": "25C-NBOMe ",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "sublingual",
   "2C-C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 97774",
   "Male",
   " ",
   "Age at time of experience: 20",
   "Added: Oct 2, 2012",
   "Views: 1928",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After a disappointing experience with some weak acid several days earlier, I decided to try 25c-nbome to explore the potential for mental exploration. I got together 2 other friends who had 600 micrograms each. We all started in my room. We used 600 microgram tabs made for sublingual consumption. 'A' is male 180lbs and 'B' is female 140lbs. We are all 20. Dissolved under our tongue within 20min and we swallowed the spit. B took an extra 20min for some reason and spat the disgusting tasting remnant fluid out. We all had the familiar tongue numbing.</p><p>At this point we decided to walk to A's place a mile away. The sun was just setting and the path to his house goes through some woods. It started kicking in as we walked out the door. Small visual distortions. As we walked, we told funny stories, noting the increase in color vibrancy. By the time we reach A's place, we all feel energetic and tingly. A is super-aware of his ankles and we are a bit of a giggly mess. We grab some snacks and hydration and head back. </p><p>Time is slightly dilated and visual distortion are pretty tame. We get back to my place at T+1:30 and it is fully set in. There are distinct tracers and mild twisting and melting. I see random eyes pop out of patterns. Music is slightly more interesting and absorbing, but that's about it. It was a happy feeling. Quite thirsty. We talked for hours and listened to music. A and I talked about how much of a tease it was and made us miss acid. B had never had acid so she thought it was fantastic.</p><p>The next day we were all exhausted and slept for hours extra. We were also extremely thirsty.</p><p>The experience was enjoyable, too much of a tease and the after-effects were very draining. Tolerance lasts for quite a while so we won't be able to satisfy the desire for a true psychedelic experience for a while, but it was educational with respect to what this chemical did to us.</p>"
}
