{
 "title": "First Experience With Hallucinogens",
 "author": "GK",
 "citation": "   GK. \"First Experience With Hallucinogens: experience with 25C-NBOMe (ID 97841)\". Erowid.org. Sep 8, 2013. erowid.org/exp/97841",
 "substance": "25C-NBOMe",
 "bodyweight": "62 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "sublingual",
   "25C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "97841",
   "Male",
   " ",
   "21",
   "Sep 8, 2013",
   "Views: 568",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My friend had taken a fair amount of this stuff and I had done a little bit of research but only so far as to find out if it was safe. I had no idea what to expect. My friend said he had some hallucinations but having never tripped myself I did not understand the true nature of psychedelic visuals and had no idea what they even were to be honest.</p><p>I spent the afternoon huffing nitrous and had a bit of alcohol and while I was just enjoying myself I decided to take one of my friends blotter paper tabs under my lip, just to try it out. I felt sick for 20 minutes and then put it under my tongue. The taste was bitter but bearable. After another 10 minutes I started to feel slightly strange. I felt disconnected from the world slightly.</p><p>After an hour I needed to go to my room and chill out. I went on the net and did some reading and I felt pretty excited and happy, I guess verging on euphoric. I had to keep reattaching myself to reality and lost focus on what I was doing very easily. After 2 hours it started to scare me how I was losing focus: every time I'd look away from the computer I would get a fright at how my mind would not co-operate. But then the amazing effects set in. Complete ego loss. I saw beautiful kaleidoscopes of colors and faces in everything I looked at. I saw dragons crawling over my walls in the shadows, as clear as day. I didn't want to go to the bathroom but I needed to pee and I found the walk there was amazing, peeing felt amazing, and washing my hands in icy cold water felt amazing. I noticed in the mirror my pupils were massive and I saw how beautiful I happened to look in the mirror. I went back to my room and for another 2 hours had the time of my life. I felt connected to everything and everyone and the only emotion I could feel was love for everything around me. I wanted to share my feelings with the world.</p><p>After 4 hours the visuals were still crazy and I was starting to get anxious. I talked to my friend on messenger because it was the only thing I felt was anchoring me to reality. I was scared I was getting sucked away into the trip, unable to think rationally and just generally freaking out. After an hour of this I started to feel ok and for the next 4 hours I lay wide awake in bed watching the lights of my laptop flash. It triggered the most insane visuals, it was just beautiful. I saw colors which didn't exist, even some reflective colors, which is weird thinking back on it. I listened to some Tool and it was the best music I have ever heard at the time, even though I'd heard the album a million times before.</p><p>For the following 2 hours, 8 hours after first taking it, I only had closed eye visuals. I couldn't sleep and was getting a bit restless but the visuals kept me distracted.</p><p>About 10 or 11 hours after dosing I had a 20 minute nap then I was wide awake again for the entire day. I had a 20 minute nap and stayed awake for 38 hours, I normally can't stay awake more than 20.</p><p>It was by far the best experience of my life, except for having incredible sex with the person I love. I would gladly do it again and have some more, I'm just waiting for the right time.</p>"
}
