{
 "title": "Dusted",
 "author": "Fluffanetti",
 "citation": "   Fluffanetti. \"Dusted: experience with PCP (ID 9788)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9788",
 "substance": "PCP",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "1 cig.",
   "smoked",
   "PCP"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9788",
   "Female",
   " ",
   "Age at time of experience: Not Given",
   "Jul 11, 2005",
   "Views: 33804",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I wanted to share some thoughts on PCP.</p><p>I woke up this morning still feeling slighty numb and 'fuzzy' from smoking last night. Not going to work, was not an option so here I am, reading about PCP.</p><p>No more than a couple minutes after smoking do I realize, wow I am fucked up. Having smoked before, it's expected. But - I feel the need to say 'I am fucked up'. I guess I thought it would be better for me to notice first before someone else did. Well I am only with my cousin, but he doesn't even seem to hear me anyway. So saying 'I am fucked up' does not seem to get my point across. I try to say 'I am confused'. Is that even a word? I spell it in my head to be sure. It still doesn't seem enough to get my point across, and saying 'I'm confused' just doesn't sound right to me, I am having trouble deciding still if 'confused' is even a real word or did I just make it up. I give up, and decide to think about it again later. I had errands I planned on doing but realize I'm in no condition to go food shopping, and start to wonder how I could handle ordering turkey at the deli counter - no way, it would have to wait. I figure I would just head home and enjoy my high.</p><p>We are driving to his house to drop him off, and although things seemed to go by in slow motion, we were at his house in no time. I have to use the bathroom, so I went up by myself and it was late so I crept in quietly, I still am not sure if this really happened or not, but I think there was a mattress in the kitchen, it was too dark, but I know I was trying to squeeze by something against the wall in the dark to get to the bathroom. I remember having to squeeze by it again on my way out and just wanted to get out of there so bad I didn't really care to think about why there was a mattress in the kitchen. I say good bye to my cousin and it's time for me to drive. I am in my car, but it feels like for the first time. My car feels smaller and compact, but so do the roads so it's OK. Everything seems bright yet blurry. I start to drive and the roads all seem new to me too, but I still know where to go. I get myself home and go to my room. I turn on the tv, but it seems too fast, I crave something slower and trippier, but there isn't anything so I just keep it on with the volume really low. My bed feels so warm, I can't sleep but I don't mind. I try to remember how I got home, and what I did yesterday, and why is my memory so bad? I guess I just dozed off.</p>"
}
