{
 "title": "Kavanilla Shake 1, 2, 3!",
 "author": "Catfish Rivers",
 "citation": " Catfish Rivers. \"Kavanilla Shake 1, 2, 3!: experience with Kava Kava (ID 9796)\". Erowid.org. Oct 3, 2001. erowid.org/exp/9796",
 "substance": "Kava Kava",
 "bodyweight": "240 lb",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Kava",
   "(cookie / food)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9796",
   "Male",
   "",
   "Not Given",
   "Oct 3, 2001",
   "21271",
   " "
  ]
 ],
 "report": "<p>\nHere's my favorite way to ingest kava. In this recipe I use kava emptied from gelcaps containing 425mg ground kava root each. I usually empty between 20-30 gelcaps for use in the recipe, although I have done up to 60 gelcaps worth to no ill effect, outside of a drunkeness and lethergy leading into sleep. Usually, I enter a nice trance like state. My thoughts settle down and my mind grows quiet. I find kava is an excellent meditation aid. Worries shed like fall leaves. The nuerotic inner Catfish hits the pines and takes a few hours off. I become more relaxed and sociable. It also seems to have a wonderful synergy with cannabis. Several times, I have noticed this combo to produce a digital block-like effect on my visual field. Everything appears to consist of blocks, as if I was viewing the images under high computer magnification. </p><p>While fresh root is admittedly more potent, I often find it much more convenient to just grab a bottle from the market when I am planning to 'shake' things up and settle into the kava groove. Make sure to buy gelcaps and not softgels, as the latter is a pain in the ass to pop and squeeze out the kava splooge. And now, without further malarky, here's the recipe:</p><p>Add the contents of 20-30 kava gelcaps into a blender with 3 large scoops of vanilla ice cream and about 8-12 oz milk. Add a few drops of vanilla extract and a few shakes of cinnamon and blend for about 5 minutes. Simple as 1,2,3...</p><p>Of course, any ice cream flavor can be used. Milk works best at 2% or higher. Also, the more liquidy you make the shake, the more kava powder that will settle at the bottom of your glass. Adding a teaspoon or so of vegetable oil seems to help better emulsify the kava. I find this an extremely easy, yet effective manner in which to sit and speak with the kava gods. Enjoy!</p>"
}
