{
 "title": "Dimension Shifter",
 "author": "Austin",
 "citation": "   Austin. \"Dimension Shifter: experience with LSD, Clonazepam and Promethazine (ID 97980)\". Erowid.org. Nov 16, 2012. erowid.org/exp/97980",
 "substance": "LSD, Clonazepam and Promethazine",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)",
   "  T+ 0:50",
   "3 tablets",
   "oral",
   "Pharms - Clonazepam",
   "(pill / tablet)",
   "  T+ 0:50",
   "25 mg",
   "oral",
   "Pharms - Promethazine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 97980",
   "Male",
   " ",
   "Age at time of experience: 18",
   "Nov 16, 2012",
   "Views: 6400",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "</p>\n[Erowid Note: This report is marked as a LSD report, but readers should be aware there are aspects of it that suggest the identification is speculative.]  </p><p>One of my buddies (no longer buddies anymore) sold me a hit of ''LSD''. This blotter square was slightly bigger than normal blotters, with no artwork, just a dark grey overlay. Assuming it was acid, I had prepared for just another normal not out of the usual fun trip. I was hyped up for the trip so I decided to go ahead and not wait for the weekend. This trip was experienced on a Wednesday night.</p><p>10pm: I put the blotter in my mouth, under the tongue as always. The first thing I notice is a very distinguishable taste. Normally my acid has no taste and if it does, its because it has other compounds such as 2C-I to increase visuals throughout the trip, which I have no problem with, makes it more fun. The taste was more of a burnt taste. It was very potent and sour to the point where I could only keep it in my mouth for around 10 minutes before spitting it out, to avoid vomiting. </p><p>10:10pm: I notice something is off. My tongue has completely gone numb and my tongue is stained with this awful taste. I rinse my mouth out with Listerine to try to overpower this taste. No cigar. Absolutely nothing can take the taste out or get my tongue to not be numb anymore.</p><p>10:30pm: Cold sweats are starting to happen. I just feel completely off. Something isn't right at this point at least because I was expecting an LSD trip which is fairly mild to me and enjoyable. I've officially made the decision that what I ingested is in fact not LSD at all. My heart rate is ever increasing. I've been sitting down on a couch under a blanket for the entire time and my heart rate is at the speed of if I had just sprinted a mile. </p><p>10:50pm: This is no longer enjoyable. At this point I can feel effects ranging from nausea, cold sweats, to a insane heart rate. I shuffle myself up the stairs and pop open my Klonopin. I then proceed to eat about 3 tablets, 3x my prescribed dose, because I know that benzos are a bad trip lifesaver. I also take a Promethazine 25mg that I have been prescribed in the past to kick the nausea away. </p><p>11:10pm: By now, in the case of anxiety attacks, the Klonopin will have already gotten into my system, especially since I chewed the pills to avoid the slow release of the chemical. My heart race is just as rapid, no difference. I'm starting to freak out slightly, because I know that if anything was to help, it would be the Klonopin. The sweating has progressed to my armpits, which are now soaked. My forehead is also starting to sweat at the hairline, but I'm very cold.</p><p>11:30pm: Shadows and lights are starting to transform and morph. I normally go to bed around 1am at night. Tonight is different, it is 11:30 and I'm calling it quits. I get my stuff and walk upstairs to my room to try to lay down to force myself to sleep. I do not like this at all. I'm not a stranger to visuals and transformers, but this is completely different. I'm contemplating the idea of driving myself to the ER because of my heart rate and the absolute strange feeling. I decide not to, as I'm on probation and this could possibly end up with me in jail and at this point, I would not be able to figure out how to operate my car, more or less even my keys.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] </p><p>11:50pm: Lights have become, in my state of mind, liquids. Everything is no longer normal. My normal mindset is gone. I want this to stop, but I know in my mind it's not going to. Just with MDMA and LSD, once it is ingested, there is nothing you can do but ride it out. My room is completely dark other than my clock which poses the time in a green font. My ceiling has now become a white light panel. The entire ceiling is lit up as it is a giant light. Yet when I look to my side, it fades and I'm still in a black room. </p><p>12am to 2am: The trip has finally hit with full fledged force. Lights are waterfalls, dripping onto the ground around me like glow fluid. The ceiling fan is moving clockwise, but stops and shifts counterclockwise. My covers no longer feel like they are on my body. I feel the warm sensation of being curled up in my bed but it almost feels as if I am levitating in a warm magnetic field. Sounds are extremely distinguishable. I can no longer just hear sounds, but I can distinguish frequencies and wavelengths of different tones. The sounds have a reverb that echoes multiple times for about a minute after they happen. My walls are starting to become transparent. My mind knows my house so well that it is projecting what is on the other side of the walls, making it basically see through. Behind the wall that by bed faces; on the other side is my shower. The wall no longer exists and I can see straight to my shower. Shadows are playing tag. The clock is projecting dim light making shadows of the bedside lights and other objects such as drawers. They are all shifting around and moving from wall to wall. Light tracers have become more than tracers. If I stare at my clock for a few seconds, I can look in a dark corner and still see the time, as bright as if I were staring directly at the clock again. My laptop light has a dim light (MacBook) that fades on and off as an indicator that it still has battery. It's no longer fading. The light is a constant white. If I take my phone screen, I can move it side to side and up and down and paint my entire vision white. It slowly fades away from where I first started to where I stopped, almost like a domino pattern. My perception of time is completely gone. My body and mind both feel like they are stretching in between multiple dimensions. I feel completely drugged (probably due to the large dose of anxiety medicine). I can feel the air. Not like when you are on a beach and feel a breeze, but I can cup my hand and feel a presence of gas. I'm no longer in a normal world. </p><p>3am: Dimensions and time are shifting. I have no recollection of where I am or what is going on. I feel like I'm in a spacial void and I have no idea what to think. My mind is absolutely confused at this point to where I couldn't complete my thoughts. I had been texting my friends at this point explaining my trip, and them texting me to keep me some sort of comfort. I can no longer text them anymore at this point. When I open the ''New Message'' option, the screens features are shifting at rapid rates and speeds. Every time I click on one of the letters, it floats off the screen into the air in my room and fades once it hits the walls. After stumbling and pressing every number and letter possible, my home screen is just a white page with no text, options, or buttons of any sort. Time is shifting. The numbers on the face of the clock are changing rapidly, they are all going through the course of 0-9 like a slot machine. I no longer have a sense of the time because I cant even understand my clock. I'm shifting around the room and the ceiling. My bed isn't against the same wall, I'm facing a complete opposite direction each minute. My bed also has gone from being on the floor to the ceiling and now the carpet is the ceiling and the fan is beneath my feat. It is thundering and lightning outside and I can feel the soundwaves and vibrations all over my body to the core of my bones. The reverb of the thunder last several minutes and the light of lightning isn't a quick flash anymore, when it happens the brightness stays, and slowly fades minutes after.</p><p>My heart rate has come down to a significant stable level, as I have accepted my trip and now I'm slightly more or less enjoying it. Patterns are all over the place and I can vividly see textures surrounding me. Lights are spinning just like fans and giving off pulses. I can see waves of lights in every direction I look. Keep in mind I am in a totally black room but it feels like all of my walls are LED panels and my room is rapidly changing colors. Every time I verbally speak, I do not hear the words until my sentence is finished, as if someone was repeating what I was saying after I was done. I can't understand anything. I no longer know where I exist, what I am, or who I am. I'm very educated in the field of science and astronomy so the intelligence is projecting spacial images and stars and such everywhere. I feel like I'm floating throughout the realm of space and time. </p><p>4am: The trip is slowly starting to decrease. My mind is coming back to my body, as I am piecing together myself in my room and I can now figure out who I am. I'm collecting all my thoughts as if all my years of learning are being crammed into my mind in a 30 minute period. I am relearning everything as if I was just reborn. I'm completely drugged, I've had enough depressants and sleep medicine to tranquilize a horse, but I'm still awake, yet I can feel the depressant in it's entirety. I get up to go to the bathroom because I haven't peed in several hours. I avoid looking into the mirror because I know that I will get lost in it. As I turn around after I'm done peeing, I catch a glimpse of the mirror. I try as hard as I can not too, but I end up staring at it. I don't know what its called, but I'm seeing one of those infinity type images. I can see myself hundreds of times like I'm looking through a tunnel and I can see the frame of the mirror multiple times as well. This is a complete mind trip so I stop staring a return to my bed. Every time I touch my sheets, instead of feeling a fabric my fingertips can feel each and every single thread. I can distinguishable feel the texture of the thread. </p><p>5-7am: My body and mind have returned. The sense of time and awareness of where I am has also returned. I know where I am, who I am, and I can finally realize that I'm just in my dark room, inside of my house. This trip was the most intense I have ever experienced, even more so than my previous trip on half a strip of acid in the past. Patterns are still shifting, but its not intense enough to not realize that this is just a chemical shifting my vision. Lights are still quite watery, and I can still hear lights and see sounds. Yes, hear lights and see sounds. I'm okay at this point, I've fully accepted my trip and I'm no longer scared of what is present. Patterns are crazy and I'm playing some new funk/electronic music that is very pleasing. I've never heard music in such a vivid form as this. I'm relaxed and laying in my bed enjoying the comfort and security of my covers.</p><p>7:40am: I finally pass out. The depressants and sedatives have beaten the trip. </p><p>10am: I wake up describing my trip to my friends as best as I could. I can type this experience up but there's no words to describe it. This is one trip that is a life changer and I will never forget this.</p>"
}
