{
 "title": "LSD's Crazy Uncle",
 "author": "Angel",
 "citation": "   Angel. \"LSD's Crazy Uncle: experience with 25C-NBOMe (ID 97997)\". Erowid.org. Sep 18, 2013. erowid.org/exp/97997",
 "substance": "25C-NBOMe",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "700 ug",
   " ",
   "25C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 97997",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Sep 18, 2013",
   "Views: 789",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Acid is scarce in my town and when I'm lucky enough to find some, it turns out to be ridiculously weak. As you could imagine, when my friend introduced me to a drug that's 'like acid but 5 times stronger and no come down' I was really excited. I met up with some friends later that evening and we decided to go to J's house which was one town away. The mindset for that night was perfect. We had some awesome music, a car, the night, and of course, the drugs. Please note that the driver was not dropping or drinking.</p><p>Preparation:</p><p>Before we dropped or left, some of us decided to have a few shots. I passed on the vodka, I just wanted to experience pure 25c-NBOMe. At around 8pm, we all dropped the tabs at the same time. YUCK! This stuff was some seriously bitter shit. We decided to walk to the store to get some soda to wash away the taste. Safe to say, by 8:15, I was already feeling it creeping up. Actually, creeping up is the wrong term. Acid creeps up on me, 25c was more like, it just walked right up to me and said 'yo, I'm starting now, hold on to your seat'. Walking back, my legs felt super weak, as if they were about to give in. By 8:45 we were in the car and we were all tripping balls. I was happy to finally be sitting down.  </p><p>The car ride:</p><p>Full. On. Visuals. Nothing like I've ever experienced. No matter where I looked, all I saw were designs, patterns and ridiculous light distortions/miss-perceptions. If I looked at my friends face, the shadows/shades on his face would morph from side to side, and turn from black, to purple, to orange, and back, within a couple of seconds. 9:15 - Everyone in the car was silent. It wasn't like LSD where everyone was laughing and talking about how awesome everything was, everyone was just silent, jaws on their laps, eyes fixated on whatever the hell they were looking at. It was at this point where I realized just how hot and stressed my body was. It felt like I was being squished together by fifty really fat guys sitting in a crowded sauna. After the experience I read that if you feel really hot you've taken way too much. Regardless of how fast paced and crazy the drug was, I never really had any bad thoughts. Everything was cool, so I decided to listen to some music (with headphones). </p><p>At 10:00pm I put on some Radiohead album I downloaded earlier that day. Oh. My. God. This sent me over the edge. The music came alive. I could smell it, feel it, touch it. If I closed my eyes, I could see the wave forms in 3D, wrapping around me and into my ears. Next, I just sat back and looked outside and looked at the stars. Naturally, I was then teleported through a portal in the stars to what I thought was heaven. I then had a discussion with whom I thought was the 'creator', pondering the meaning of life and all that. Around 12:30pm, I was already starting to come down, and by 1:00 it was as if I never took anything. I was fine, not tired, no comedown, no depression - nothing. That was the last drug I did.</p><p>Three months later - no matter where I look, I'm always seeing purple static and slight line patterns in the back of my eyes. If I stare at a white wall, I begin to see visuals again. It's seriously hard to concentrate in school. I'm always spacing out now because of the visuals. I hope it goes away eventually. </p><p>Please trip responsibly. Watch your dosage and be prepared for any consequences or experiences that you may or may not want.</p>"
}
