{
 "title": "Puking, Blackouts, & Pain",
 "author": "R. Johnson",
 "citation": "   R. Johnson. \"Puking, Blackouts, & Pain: experience with Amanita muscaria (ID 9803)\". Erowid.org. Oct 7, 2001. erowid.org/exp/9803",
 "substance": "Amanita muscaria",
 "bodyweight": "198 lb",
 "header": [
  [
   "DOSE:",
   "10 g",
   "oral",
   "Amanitas",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9803",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2001",
   "Views: 23569",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\nI recently got 15 grams of Amanita Musicara  from an internet site. The day they arrived i waited until i had the house to myself and took two medium sized caps. I then sat on my computer and waited for the effects to take over. I waited for about 45 minutes and I thought I got ripped off then all of a sudden my stomach felt like I had a terrrible case of the flu. I got off the computer and laid down on my bed.<br>The nausea was almost to much to bear. I found that not moving helped a little and I didn't have any weed to smoke so I just had to deal with it. The nausea went away in like 30 minutes and the 'trip' began. I got very tired and my vision was completly blurred, keeping my eyes open was pointless so I closed my eyes and had the wierdest closed eye visuals ever. Every memory I ever had flashed in my mind.<br>I could also make things appear in my head that I thought of. Everything was going fine until I just threw up all over the place. No warning just a blast of puke all over my room. I ran to the bathroom and puke violently in the toilet. I threw up more then what I had eaten.<br>I then blacked out for a few hours having some intense dreams. When I woke up I was treated to something that felt like someone was stabbing pins in my dick. (On all the reports I read on this site no one has ever said anything about that.) The pain was so unbearable that I was contemplaiting whether or not I should call someone and take me to the hospital it was so bad.<br>The pain eventually went away and once again I passed out. I woke up the next moring still kind of feeling the effects and fell back asleep and woke up again feeling refreshed. I would not recommend this to anyone, but if your going to try it start with a smaller dose. I might not of had some of the reactions I had if i just ate a few grams.\n\n\n"
}
