{
 "title": "Dancing Colors & Energy",
 "author": "S. Lennon",
 "citation": "   S. Lennon. \"Dancing Colors & Energy: experience with 25C-NBOMe  (ID 98034)\". Erowid.org. Nov 19, 2012. erowid.org/exp/98034",
 "substance": "25C-NBOMe ",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1 ",
   "buccal",
   "2C-C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 98034",
   "Male",
   " ",
   "19",
   "Nov 19, 2012",
   "Views: 1383",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I woke up to the plesant surprize of the early arrival of my package containg 3 freshly laid tabs of 25C-NBOMe without HPBCD.                                                        </p><p>This being my first psychedelic experience I followed all of the odd things online they tell you to do before taking this drug. So I brushed my teeth and put 1 800ug tab in my upper lip.                                                                                                       </p><p>11:00 A.M -  I place the tab in my upper lip and try not to swallow any saliva            </p><p>12:00 P.M -  the effects have nearly completly set in by 30 minutes in I felt a huge rush of energy so I went into my room and the wall begains to swirl. I turn on my Ipod and stare at the light that is coming out of my window. The ceiling and the wall seems to be breathing and the music is playing in halftime.                                  </p><p>1:00 P.M - I feel a little cold in my chest so I go outside to release some of my built up energy. If I remain still and lay on the grass the visuals become more intense compared to when I am running around dancing. Through out the whole experience I feel very at one and at peace with everyone and every thing around me the peace sign is my friendly hello.                                                                            </p><p>3:00 P.M -  I decide to step inside to get a drink but the OJ tastes metallic so I spit it out. And run outside and roll around on the grass for a few hours.                       </p><p>6:00 P.M -  a mild headache starts at the come down until the next day when I wake up feeling refreshed and energized.</p>"
}
