{
 "title": "Unpleasant Aftereffects of Combo",
 "author": "Withheld",
 "citation": "   Withheld. \"Unpleasant Aftereffects of Combo: experience with GHB, Alcohol & Methamphetamine (ID 9809)\". Erowid.org. May 26, 2004. erowid.org/exp/9809",
 "substance": "GHB, Alcohol & Methamphetamine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "4 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " ",
   "1 line",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)",
   "  T+ 1:00",
   "1 cap",
   "oral",
   "GHB",
   "(liquid)",
   "  T+ 3:00",
   "1 line",
   "insufflated",
   "Methamphetamine",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9809",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: May 26, 2004",
   "Views: 21669",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I attended a party with some friends and had consumed 4 pints of alcohol (assuming near 5% alc.), the last pint being finished about an hour prior to consuming the GHB. I had also taken an average line of speed (apologies about exactness of dose) about an hour previous to taking GHB. I was then offered GHB. Prior to this I had never done any research on this drug. I had no idea of the dangers of mixing it with alcohol, nor had I ever consumed it prior to this. I ingested a small water bottle cap-full of GHB (unsure of concentration) mixed with a little soda. About 2 hours later I took another average-sized line of speed. That is the extent of the intoxicants that I took.</p><p>The effect was wonderful after ingesting the GHB, almost enhancing the alcohol feeling. Touching felt very good, the sound of music was enhanced. It seemed to take away the 'tweeky' feeling of the speed as well. My awareness was full, no difficulty in muscle movements (4 pints of alcohol is not enough to inhibit my speech or ability to walk, etc.) and I was able to converse and dance normally. I'm assuming the speed deterred the effects of mixing GHB with alcohol.</p><p>My experience of coming down is the reason I am writing this. It has been 1 1/2 days since this experience and I am still barely able to ingest anything but water. About 12 hours after taking GHB, when the speed pretty much completely wore off, I began to get extremely nauseous. I attempted to eat some crackers but was unable to eat more than a couple. I did not throw up though. This nausea continued throughout the rest of the day and into the night (completing a full 24 hours since ingesting GHB). I attempted to sleep but was not able to. I eventually began a fever and this lasted for about an hour (I sweated it out and did not take anything but water). I was very 'dumb', was unable to think clearly and very weak (most likely the fever). I had short experiences of irregular heart beats, and my breathing varied sometimes involuntarily.</p><p>I eventually took a small hit of marijuana in the hopes to relieve the nausea and help me sleep. This worked and I slept for about 8 hours. I am still nauseous today, although it is mildly better, and was able to eat a small meal. I am still weak and 'cloudy' in my thoughts.</p><p>I do not know how much of this is a result of what drugs I took, or if I by chance contracted a virus or bacteria. I could not have had food poisoning, although it felt somewhat like that. I hope this information helps.</p>"
}
