{
 "title": "An interesting Combo",
 "author": "Timidtom",
 "citation": "   Timidtom. \"An interesting Combo: experience with MDMA & Methylone (ID 98103)\". Erowid.org. Feb 14, 2013. erowid.org/exp/98103",
 "substance": "MDMA & Methylone",
 "bodyweight": "58.7 kg",
 "header": [
  [
   "DOSE:",
   "60 mg",
   "oral",
   "MDMA",
   " ",
   "60 mg",
   "oral",
   "Methylone"
  ]
 ],
 "footer": [
  [
   "2012",
   "98103",
   "Male",
   " ",
   "40",
   "Feb 14, 2013",
   "Views: 1835",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>MDMA and Methylone (bk-MDMA) </p><p>I had a small quantity (60mg of each) of MDMA and Methlyone sitting around</p><p>in a draw and was bored so decided to try them together.</p><p>Having tested both drugs at this dose separately previously and knowing they don't have any positive effects at such low dose, I wondered if it would be safe to combine them. After a bit of research on the forums, I decided it was a safe combo, certainly at this low dose anyway.</p><p>I took them together in separate gel caps with a bit of water on an empty stomach and then had a snack about 15 minutes later. Although I began to feel some effects within about 20 minutes, it was very subtle, and as usual, the full onset took over an hour and came on suddenly. </p><p>It was much the same as taking either of these drugs separately. For me, they are both much the same. The room got brighter as my pupils became saucers. I felt the familiar feeling of being hot inside and a clammy coolness over my skin with a rushy speedy feeling and euphoria.</p><p>Within about 2 hours I was at the peak of the experience and it felt like I had taken a 130mg of MDMA by itself. I felt some empathy and 'loved-up' introspective feelings and listening to music was very nice.</p><p>The come down was gradual and the whole experience lasted maybe 4 hours. However after the experience was nearly over I found myself feeling very low and depressed with my thoughts becoming quite negative. I had been feeling a bit depressed before I took the drugs, and it was as if taking them and being on the come down amplified these feelings. I took a hot relaxing bath and was able to shake off the negative mood. I did feel very physically exhausted though, quite shaky and burned-out. I took 2.5mg Valium and had an early night.</p><p>Throughout the experience I had made a point of avoiding grinding my teeth and checking the inside of my mouth, since after my previous experience I had a very sore mouth! It wasn't very difficult to avoid doing it with a conscious effort. However I continually kept swallowing hard and this ended up making my throat very sore which sometimes happens to me on MDMA. I think this was partly due to not drinking enough water too as I had sweated a lot during the experience and was probably dehydrated.</p><p>For me, both MDMA and Methylone are not great drugs to take by yourself and need to be taken in the right setting. Also I think the negatives of these drugs outweigh the positives. For such a short period of feeling good, you have days of feeling like shit. Is it really worth it? In a party setting or night club, maybe..but not if you're just trying to get high and feel good.</p><p>Summary</p><p>MDMA and Methylone are definitely synergistic, probably due to them being so closely chemically related. If you're going to take these together, I would half the doses of each to achieve the same dose you would normally take if taking either separately. If you stack them (i.e. a full dose of each), I think you could easily overdose as they potentiate each other. </p><p>My feeling is that taking MDMA with Methylone will make the experience more empathic than if you had taken Methylone by itself. Also the duration will be slighter longer but less intense physically than Methylone by itself. Your mileage may be different.</p>"
}
