{
 "title": "Amplified Sensuality",
 "author": "champ",
 "citation": "   champ. \"Amplified Sensuality: experience with Methallylescaline (ID 98166)\". Erowid.org. Nov 4, 2012. erowid.org/exp/98166",
 "substance": "Methallylescaline",
 "bodyweight": "235 lb",
 "header": [
  [
   "DOSE:",
   "20 mg",
   "oral",
   "Methallylescaline",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 98166",
   "Gender: Female",
   " ",
   "Age at time of experience: 34",
   "Added: Nov 4, 2012",
   "Views: 4665",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Finally had the time to test this one out. As there were no reports on this batch specifically and almost no recent discussion of this compound on the internet I reagent tested it first. Took about 1 mg orally (I have a good scale but 1mg is difficult to weigh 100% accurately) and waited about 70 minutes to make sure there were no negative reactions. After about 20 minutes I felt a tiny first alert in the form of light headedness. I felt a bit nervous in general but after no further physical reactions I took another 10mg at t+70 minutes. This was obviously not enough but I wanted to be cautious. The light-headed feelings increased and I felt a bit shivery and almost rolly. It was obvious that this was a phenethylamine. I could already tell it was better than tma-2 which I took once and found quite unremarkable. Another hour goes by and I take one more 10mg gelcap. I am now up to 20mg or so and the effects are very much like mdma but not nearly as pushy.</p><p>Light-headedness, slight rushing feeling, physical sensitivity to touch and amplified sensuality. I am hungry and make a bowl of pasta which makes me feel nauseous for a while. MAL effects are a lot closer to mescaline than TMA-2 is, it is a bit more forceful than mescaline actually. I could have taken more but decided not to because it was so new feeling. The main effects were physical and I was clearheaded. The body load wasn't too bad, imo--it consisted of the mild but persistent nausea, jaw tension, some shaky tremors. Overall it was more lazy and languid than energetic. Not particularly social, some laughter. I didn't really take enough for the visual aspect to manifest itself but i could tell it was there. With just 20mg the proportions of rooms were all strange and lights were brighter, closed eyes were almost there with visual snow and strobing effects that didn't resolve themselves into patterns or imagery at this low dose. Music sounded better than usual. MAL was really just amazing for the erotic, can't recommend that enough. Next day I feel ok, not crabby no headache or anything unusual.</p><p>Overall: I wasn't sure about this one when I was on it. It seemed a little lacking in comparison to more dazzling and overwhelming compounds like 2ce or LSD. However, on reflection I think it deserves more of my attention because it shares some of the qualities I value in mescaline, namely the gentleness, positive push, contemplativeness and loving energy. Next time I will start with a 20mg initial dose and maybe ramp it up every 45 minutes or so by 5mg increments. I also would like to try it in a more natural setting like a park. Interesting compound with empathogenic qualities at moderate doses, has potential to be truly psychedelic at higher doses, not such a bad body load, feels different than the 2c compounds or tryptamines. Definitely more on a mescaline/mdma axis of effects.</p>"
}
