{
 "title": "Very Relaxing",
 "author": "Derek",
 "citation": "   Derek. \"Very Relaxing: experience with Mugwort (ID 98184)\". Erowid.org. Nov 7, 2012. erowid.org/exp/98184",
 "substance": "Mugwort",
 "bodyweight": "137 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "Mugwort",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 98184",
   "Male",
   " ",
   "Not Given",
   "Nov 7, 2012",
   "Views: 2452",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In November I decided I would try out some Mugwort I bought from my local health food store a few months back. First my brother and I went for a walk and smoked a few bowl packs of mugwort. It felt very relaxing, but if I tried to smoke it like it's marijuana it's quite harsh. We then continued back to my place, I still felt pretty good and everything looked a bit better, enhanced I guess you could say. In our case we did it at about four P.M. So it wasn't really time to go to bed. So we stayed up and by dinner time around six or seven we started to feel kind of rough for trying to stay up while going through the effects of Mugwort. So I decided that I would do some research and try differently next time. </p><p>So I did some research on my computer about the effects of smoking Mugwort. I found out it can be a dream enhancer making them more vivid, so pretty much a lucid dream. So that night I headed out to the garage with my piece and smoked about 6 bowl packs and headed off to bed. But then I got sidetracked from a phone call and had to stay up all night working on a project. So the effects wore off leaving me feeling like crap and then eventually dosing off.</p><p>I didn't want to give up on it so I did some more research. I found out you could make some tea out of it. So I got one of my mason jars, got two to three hefty pinches of mugwort and put it in the bottom of the jar and then steeped it in hot water. I knew I should have put it in a teabag but I didn't really mind scooping the mugwort leaves out with a spoon. After leaving it in the jar for about an hour or two I decided I should try to get some sleep. So I poured it into a tea cup and drank it while watching some T.V., it tasted pleasant and I immediately felt calmed by it. I then put a pinch of mugwort in my pillow case because I read that smelling it in your sleep can increase the chances of experiencing a lucid dream. I didn't fall asleep as quickly as I expected but I woke up later in the night, looked around and decided to go back to bed. The next morning I noticed that when I thought I woke up in the middle of the night that, that was actually a lucid dream because I remember having seven fingers on one hand and about three on the right. But at the time I didn't think that was unusual for some odd reason.</p><p>I was a bit upset that I didn't do more in my dream but I was glad to have experienced mugwort. It was very relaxing but I tried not to do to much I've heard it has a chemical in it that can be dangerous in large doses.</p>"
}
