{
 "title": "Sacred and Important",
 "author": "Willy Will",
 "citation": "Citation:   Willy Will. \"Sacred and Important: experience with DPT & Mushrooms - P. cubensis  (ID 98197)\". Erowid.org. Jul 10, 2013. erowid.org/exp/98197",
 "substance": "DPT & Mushrooms - P. cubensis ",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  ",
   " ",
   "Mushrooms - P. cubensis",
   "  T+ 0:00",
   "50 mg",
   "insufflated",
   "DPT",
   "  T+ 0:10",
   "10 mg",
   "insufflated",
   "DPT"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 98197",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Jul 10, 2013",
   "Views: 497",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI have had a vial of DPT for about 3 months now and have used it 4 times. This specific instance describes my fifth experience. Two friends and I were on Cubensis and having a good time, and since they have not had an experience with DPT, I wanted to show them. They had both done DMT but I didnt tell them what to expect with DPT. Little did I know, this would be my most intense experience so far. I cleared everything out of my room, turned on my ambient light, and played my spiritual DPT playlist. I laid out a 25mg, 40mg, and 50mg line. 50mg was for me. They laid on my bed and I was flat on the floor. \r\nAfter 10 minutes, I laid another 10mg and railed it and laid back down and closed my eyes. My spirit began to lose all sense of arrogance and ignorance. My character was non-existent; I became Student. Mushroom visuals moved aside, as the DPT Teacher took the stage. I opened my eyes to the ceiling where clear, tentacle-like arms, surrounded by light were reaching out for me, showing me that It was there. I close my eyes again. \r\nThe Teacher takes full control by now (30 minutes in), and the lesson has begun. We begin to telepathically communicate in Tongue, mostly me asking who It was, but He just began without answering. \r\nFirst: He pulls my mind to the very beginning of my memories. He shows me a slide show of crystal clear images of key points in my life as if I was experiencing them again. The slideshow lasted about 5 minutes.\r\n\tSecond: The Teacher decides to show me how my brain and body works. He brings me to the part of my brain that controls my heart function and says, Watch this. I feel my heart beat twice irregularly and then return to normal. Without letting me think about the fact that I could have just died, he takes me to the part that controls my lungs. It begins to become impossible to breathe, then He lets it go back to normal. \r\nThird: He says now watch this and pulls my spirit out of my body and takes us galaxies away. He points to the entire scope of time, selects 5,000 years out of it, and stretches it out like an accordion to show me what it looks like (impossible to comprehend of course), and then squeezes it back to its spot in the infinite timeline. Then he takes me back to our current place in time and puts me back in my body for one last lesson. \r\nThe teacher pulls a strand of DNA from my brain and brings it close to me so I can see the details. It is scrolling to the right as he explains that this is who I am and where I come from. I say, OK and then he goes on to split the strand apart, remove several nucleotides, and rearrange them and place them back, zipping the strand back together. I am now a different human being then I was. He sees that I am scared so He unzips the strand again and put the nucleotides back so my genetic structure is the same as before. This is what I can do, this is the power I have. Everything starts to fade and then I just sat there for about an hour discussing the experiences we each had. \r\nI came to conclude with an explanation of the difference between DMT and DPT. DMT tells you, while DPT shows you. I dont know what they are trying to teach, but I learn every time. I definitely recommend DPT for someone who is experienced and is willing to surrender control.\n\n\n"
}