{
 "title": "I Was Invincible",
 "author": "MisterFrappuccino",
 "citation": "   MisterFrappuccino. \"I Was Invincible: experience with Lisdexamfetamine (ID 98236)\". Erowid.org. Dec 5, 2012. erowid.org/exp/98236",
 "substance": "Lisdexamfetamine",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "40 mg",
   "oral",
   "Lisdexamfetamine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2010",
   "98236",
   "Male",
   " ",
   "18",
   "Dec 5, 2012",
   "1973",
   " "
  ]
 ],
 "report": "<p>Let me begin by saying I have experimented with several drugs including weed, alcohol, ecstasy, and prescription pills (Xanax, Adderall, Ritalin, Methadone). This entry is about the prescription medication, Vyvanse. It isnt my prescription, it is my brothers. He uses it on and off, but he lets me take them when he is not on them. We are two very different people. I am a self-motivated worker and achiever where as it can take him 10 years to complete something. He is diagnosed with a very noticeable form of ADHD; if you know what to look for you can see it in his eyes and his twitchy, yet slow nature. Although he has ADHD very bad, he is only prescribed 40mg (white/blue pill) because he is very thin. </p><p>I took my first single Vyvanse pill before school with a bottle of water. I also had a mug of coffee which may have enhanced the effects. Approximately 30 minutes later I felt its effect. The feelings of objects and my skin began to change, very similar to ecstasy. Every object I touched was smooth; it felt good. This was in my web design class and my friend was asking my questions on how to code this webpage. I became extremely annoyed and agitated. This was not like me as I am very helpful and kind. I noticed this agitation and tried my best to conceal it, but he eventually stopped asking questions as he could see I was impatient. In my mind I wanted to kill something that was how annoyed I was. Occasionally I would feel a rush of the drug, like it was coming in waves. The agitation continued throughout the day. I even became agitated when my friend offered me a piece of gum. I felt like I was Dr. Jekyll and Mr. Hyde. </p><p>Aside from the agitation, I felt good, really good. I was invincible. I felt like I could achieve anything I set my mind too. Anything felt possible. I would even go as far to say I even felt more attractive; it was that much of an ego boost. I just wanted to get straight As in all my classes. At the same time, I also felt like school was going to slow for me. It was too slow for my state of mind. Because of this, the drug was counterproductive as I would distract myself in class from boring lectures. </p><p>When I was coming down, I felt like my heart was going to burst out of my chest. The ability to regulate my bodys temperature was diminished. I found myself sweating while wearing a jacket and freezing when it was off. It was November in Florida, so it was fairly cool and breezy. The agitation wore off and there was no nice afterglow. I felt normal albeit less motivated than my normal self and I really did not feel like talking to anyone. I should mention that while on the drug I could not stop talking, I just loved to talk. If someone has social anxiety or low morale, this drug is definitely a boost; however the comedown will not be so fun. The overall time this drug lasted was about 6 hours with the peak at 1 to 2 hours from consumption. From this day knew I was going to be seeing more of Vyvanse. </p><p>After several months of on and off usage the agitation went away, completely. I feel very sexual while on this drug although maintaining an erection is quite difficult, reaching orgasm is a completely different and awesome experience. As I orgasm my whole body convulses in pure ecstasy, unbelievable. The effect of motivation and ego boost is still there but a little diminished (due to tolerance, possibly). I tried taking two pills (80mg total) and I felt like my heart was struggling to pump blood. Whenever I stood up, my vision would blur out and I felt like I was going to faint, which is a telltale sign of low blood pressure which upon my research this drug is known to cause. There have been a few occurrences where some extremities felt numb, specifically my left arm and fingers. Sometimes my toes would feel numb. </p><p>I try not to take this drug anymore because of the comedown. At first the comedown was almost non-existent, but now after recreational use over several months the comedown is not something I want to experience every few days. Now I feel like a zombie during the comedown. If I am at home, I will just sit in front of my laptop for hours, reading. I never read, but I feel like reading is the best remedy for this comedown. Sleep would be ideal but it is nearly impossible to sleep while on this medication unless you take it at 6am in the morning and plan to go to sleep at 10pm; even then it may be difficult. The next couple of days I have a brain fog. My thoughts just seem lost in a fog. Every conversation I have with family, friends or people at work seems forced. I have to force a reaction out of myself in order to seem normal to others, otherwise, people will think I am an emotionless zombie (which is what I feel like). This brain fog only lasts two days or so, but it is getting to the point where I do not feel like the recreational fun outweighs the comedown and extended brain fog. This brain fog does affect my performance at school and at work. So overall, I think I am breaking up with Vyvanse. We may get together sometime in the future for a night of induced invincibility but until then, I want to be my normal self.</p>"
}
