{
 "title": "All Around Beautiful",
 "author": "bawknee",
 "citation": " bawknee. \"All Around Beautiful: experience with DXM & Cannabis (ID 9825)\". Erowid.org. Nov 4, 2004. erowid.org/exp/9825",
 "substance": "DXM & Cannabis",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE:",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "900 mg",
   "oral",
   "DXM",
   "",
   "",
   "300 mg",
   "oral",
   "DXM",
   ""
  ]
 ],
 "footer": [
  [
   "1999",
   "9825",
   "Female",
   "",
   "Not Given",
   "Nov 4, 2004",
   "7415",
   " "
  ]
 ],
 "report": "<p>Over spring break I went to tennessee to visit a friend and this led to my first time on many a drug.  I had used DXM before but my dosage had been a mere 420 mgs but got my extremely loaded.  This time was different.  I had never taken DXM in a consintrated form.  My friend, joseph, who I was staying with was cooking some up after he'd picked me up from the airport, it was around 6 in the evening.  We'd gotten some food before going directly home so that we wouldn't be sick.  We smoked bowl after bowl of a brand new shipment of hyrdro-cronic bud and then the DXM was ready.  We all took 900 mgs of the DXM and then joseph put some music on.  Pink floyd - the wall.  We all sat talking for a while, about 2 hours, listening to the music and waxing intellectual about life, philosophy and whatever else a bunch of acid-headed teenages talk about.  The DXM started kicking very quickly.  I began feeling very disoriented and dizzy, nearly nausious.  Everything was dancing and I felt insecure about everything.  I decided that what I needed was to smoke another bowl and so I drug joseph and my other friend, cofee into the living room and we all smoked a bowl.  </p><p>I layed down on the ground and the ground felt as though it was moving and everyone sounded muffled and distant like wind down a quiet alley.  My whole body felt as though it was floating, especially my torso.  I could feel sounds going through me and nothing that anyone said made any sense at all.  My comprehension was moving like a snail.  Joseph gave me 300 more mgs of the DXM and we smoked three more bowls and I decided I was done for the night.  I felt incredibly inspired.  Everything moved in slow motion and lights seemed brighter. At this point it was around midnight and everyone wanted to go out but I wanted to stay in so cofee stayed with me and we watched the wall.  All of the DXM had kicked by this time and I felt lethargic and my breathing was erratic, as always on DXM.  It was my first time seeing the wall and although I could hardly comprehend any of it at all, I was moved in every way.  The drugs helped in understand in a different light.  My experience was all around beautiful.  </p><p>I fell asleep and woke up some hours later, still night time and I felt like a million bucks.  I was in a wonderful mood and my body felt like it was falling, like there was something both new and strange writhing around in my veins.  I love DXM.</p>"
}
