{
 "title": "Successful Extraction",
 "author": "F",
 "citation": "   F. \"Successful Extraction: experience with Codeine (ID 9829)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9829",
 "substance": "Codeine",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Codeine",
   "(extract)",
   "  T+ 2:20",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9829",
   "Male",
   " ",
   "Not Given",
   "Jul 11, 2005",
   "28173",
   " "
  ]
 ],
 "report": "<p>I read experience reports often, but have personally never tried any drug but cannabis and alcohol.  This makes this my first opiate experience.</p><p>My friend J had some leftover Tylenol 3 from a previous illness.  Having read about drugs for quite a while, I remembered reading a codeine extraction technique from a Codeine FAQ, and decided to give it a try.</p><p>The extraction was fairly easy, and it only took about a half hour from opening the bottle of pills to drinking the liquid.  My friend Z and I each had half, for a dose of 150 mg. He mixed his in grapefruit juice, I had mine straight.  We made a toast and downed the bitter solution.  This took place at about 8:40 PM.</p><p>I proceeded to call my mom for a bit, and when we hung up I had started to feel something.  My muscles felt heavy, and I was very much relaxed.  By about 9:30, I was at just about the peak of the experience.  I sat in a chair in the kitchen for about the next hour and forty-five minutes.  I felt totally relaxed and mellow.  It was as though all was well for a little while.</p><p>By about 11:00, I felt I was starting to come down from the codeine, so I decided I would burn a bit.  We happened to have some Northern Lights / Haze blend, and I had three hits of that.  The synergy is just fantastic.  The herb and codeine combination is highly recommended.  The THC high was just as intense as always, but mellower and more rounded somehow.  Just great.  About 90 minutes later, I went to sleep.</p><p>In conclusion, this is an excellent combination.  Just bear in mind that opiates are addictive. Enjoy.</p>"
}
