{
 "title": "Natural Human Vibration",
 "author": "flarephire",
 "citation": "Citation:   flarephire. \"Natural Human Vibration: experience with 5-MeO-DMT (ID 9832)\". Erowid.org. Oct 7, 2001. erowid.org/exp/9832",
 "substance": "5-MeO-DMT",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "5-MeO-DMT",
   "(freebase)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9832",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 7, 2001",
   "Views: 12013",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\n\n  Ok, So about a year ago I happened to have in my possession a good quantity of the celestial fire, pure bliss.  I had had numerous experiences with good results, in fact wonderful results.\r\n  (Flashback) the first time I take it, right, was around a month after my first reiki class.  I hit it, my breath begins to be very deep, I sigh, and fall back into the pillows provided.  Looking into the ceiling, white, I watch as reality begins coalesceing & dividing upon itself, I was instantly shifted into witness state, sound is greatly enhanced, bliss ensues, time expands, my molecules become infinite.  As I come out of it R asks me if I liked it, I am still deep, I lay back down.  This time when I get up I am coming down, if you can call it coming down, R asks if there is a resemblance of anything psychic, he's ambitious, I say no, lieing.  I was feeling the afterglow for days, I'm sensitive, with a good number of epiphanies resulting, I enjoy contemplating these.\r\n  NOW, back to the present/past, whatever.  Me and two of my friends, K & C, were chillin in K's room freebasing the FIRE.  So we had been hitting it up for a while, and had even gone so far as to chant aum, which was pretty cool.  After an hour of tiny hits, not even really leaving home base, we decide to take a binnger, one of the fated OBE hits, the kind that sends you to dreamland.\r\nSo I change seats, and get it ready. C takes two big hits, and blisses out, K takes one humongo, and lays back on his bed.  I prepare myself, and for some dumb reason think of the shakti in my spine, I take my hit and it hits, I stare into the corner of the room and let the waves of bliss encompass me, just as I begin to come down, if it could be called coming down, I return to the thought of the coiled serpent.\r\nJust that instant I feel this shake from my tailbone, I become startled, and tell K that I am scared, he pops up & says 'Hey remember what we said, no matter what happens, just go with the flow, remember', so I sit back and let go to the shake, suddenly I am enveloped in darkness, I am the house, the yard, LOVE, POWER, growing, I don't feel any rise, but I slowly come down and out of it.\r\nI am glad that it didn't rise, or at least I don't feel like it did, I look to K, and state my discomfort with the present situation, both him and C agree that it is some sort of natural human vibration. Since me and K are pretty close, friends since childhood, I agree, and with a little thought, and some time to come down, I begin to see what he meant. We decided to take it easy for the night, and if it wasn't for C, who I kinda feel wasted the entire experience, dwelling, we woulda had some intereting disscusion.\r\nThis is my Transcendant experience, Since this time my habitual use of marijuana, and misuse of visualisation, has lead me to a few negetive experiences with this force, and now when I smoke I get anxiety, which increased with the thought of my shakti.  This leaves me in my present situation, I am currently not smoking, and I have been practising Yoga to deal the sensitivity brought on by marijuana. \r\nI also think that I will be able to do some re-creation of the experiences achieved while 'intoxicated be FIRE' with yoga, and shamanic exercises which i have been investigating for a few years.  As a culture, most of us in America have lost respect for tradition, but it seems to me that with sacrement there are those who are findind the divine even in the machine, and its enviornment.\n\n\n"
}