{
 "title": "Adderall - Love to Hate",
 "author": "Aesthetically Cursed",
 "citation": "   Aesthetically Cursed. \"Adderall - Love to Hate: experience with Amphetmines (Adderall) (ID 9834)\". Erowid.org. Aug 3, 2004. erowid.org/exp/9834",
 "substance": "Amphetmines (Adderall)",
 "bodyweight": "189 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Amphetamines",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9834",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Aug 3, 2004",
   "Views: 41607",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My experiences with Adderall began when I went to a Psych for depression. A little history - I had been an avid MDMA user for several years (1991 - 1997) far exceeding the 225 mg maximum recommended dosage (often 1000mg pure per session) several times per week and was very close to the lab. No one knew what an 'over X-er' was going to end up like... Well, it's me. I had become a shell of the person I was and wanted to be. There seemed to be no chance at being happy again. My life was good, no complaints, and yet I still grew increasingly distant and down. I had no motivations and everything to live for but I just couldn't do it anymore.</p><p>I was first prescribed Adderall in July of 1999 for resistant depression. Within 2 weeks I had adjusted my dosage from 20 mg per day to 20 mg 3 times per day (usually broken into smaller doses). It seemed awesome. I could accomplish my duties as a network engineer, do the things at home, and be an active father/husband. Slowly I began obsessing more and more with my professional life. Having an aesthetic personality and heavy worrier already, the details became more and more intense. I was taking 80 to 100+ mg per day and sleeping the last week or two before refills.</p><p>I was working for a contracting firm and travelling much of my time. I began literally thinking myself into inactivity. I could prepare for a job forever and never be quite ready. Sure enough, my wife filed for a divorce on October 5th of 2000. I was so busy preparing for our future I had forgotten about the present. WHAM! Within a month I had resigned from my position as leading Network Engineer/Systems Integrator and began my descent to a hellish nightmare. My doctor left town and I was out of Adderall before Christmas.</p><p>Three months passed before I re-entered the world. I worked a crap job to pass time and keep from eviction. I was laid off a few months later and found a doctor to prescribe it again. Here I sit, taking 60+ mg a day and I cannot figure out why I came back. I also get Xanax for night time and this helps a lot... but it's 3 am and here I am writing this damned Novel.</p><p>If anyone knows of an alternative treatment I would love to know about it. Until then I suppose I will continue my Love/Hate relationship with Adderall. A strange twist, my tolerance seems to vary and some days I am lucky to be able to withstand 20 to 25 mg and then can't get enough? I hope this is a good sign. To sum it all up:</p><p>- Adderall seemed to be the perfect cure for my problem.</p><p>- It made me forget what my problem was to begin with.</p><p>- I lost sight of my personal life, consumed by everything else.</p><p>- I lost everything I cared about that encouraged me to seek help in the first place.</p><p>- I have found no comfort without Adderall and now none with it.</p><p>I give up, guys?!?!?</p>"
}
