{
 "title": "Very Overpowering",
 "author": "Smit",
 "citation": "   Smit. \"Very Overpowering: experience with 25I-NBOMe (ID 98382)\". Erowid.org. Jan 28, 2013. erowid.org/exp/98382",
 "substance": "25I-NBOMe",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "2.5 hits",
   "buccal",
   "2C-I-NBOMe",
   "(blotter / tab)",
   "  T+ 1:30",
   "2 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   " ",
   "  T+ 2:00",
   "2 hits",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 2:00",
   "2 hits",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   " ",
   "  T+ 3:15",
   "1 hit",
   "buccal",
   "2C-I-NBOMe",
   "(blotter / tab)",
   "  T+ 5:00",
   "1 hit",
   "smoked",
   "Cannabis",
   " ",
   "  T+ 5:00",
   "1 hit",
   "smoked",
   "Products - Spice and Synthetic Cannabinoids",
   " "
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 98382",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Jan 28, 2013",
   "Views: 3756",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I am experienced with using 25i-NBOMe and have tripped it around 15 times. I decided to test the limits and took a very high dose of 25i. </p><p>T +0:0 Dropped 2.5 25i blotters. Just listening to dubstep and practicing popping.</p><p>T +0:30 Feeling the come up of the NBOMe quite strong and there is no nausea. Music becoming more pleasurable.</p><p>T +1:00 At this point I am seeing strong visuals with flowing geometric patterns of yellow, red, blue, and green. Everything looks wavy.</p><p>T +1:30 Decided to take the trip to a new level. I busted out my Gods of Aroma 'Titan' spice (possibly JWH-018) out  and packed two one hitters. I took the entire hit on both packs and held in for 15 seconds. Next thing I know my vision is completely taken over by the combination and I am left mindfucked very mildly worried about if I may have taken too much. </p><p>T 2:00 All uneasy feelings disapate and am staring in awe at the colorshow that is taking place on my wall. I decide to pack a bowl of weed and spice mixed together and proceeded to do so. I held the hits for 15 seconds a piece and got 3 good hits out of it. This is where things get hazy. Time no longer exists and I am attempting to make a sandwich. It took close to 30 minutes to make because I couldn't see anything clearly or think.</p><p>T 3:15 Drop another 1,000 microgram blotter and put in in upper lip not swallowing any saliva as before.</p><p>T 5:00 I am losing touch with reality as the next dose has kicked in. I am motionless, breathing mildly hard in my bed still watching the lightshow as I also pack another bowl of spice and weed and smoke it, doing the same as before. </p><p>T 5:15 I am COMPLETELY GONE. I can no longer see nor think logically. I stared out the window at the fence and at the top of the fence stood what looked like Geico Geckos dancing on top of it. I stared puzzled for quite some time.</p><p>T 6:30 Space Ragner has reported back to Earth. I am off the peak and pretty much down. No uneasy feelings.</p><p>T 7:15 Fall asleep.</p><p>Summary: 25i is one of my favorite trips and I wanted to see what it would do in higher doses. It was very overpowering. Overall a very clean trip with a very mild body load sometimes.</p>"
}
