{
 "title": "A Successful Experimental Preperation",
 "author": "Heisenberg",
 "citation": "   Heisenberg. \"A Successful Experimental Preperation: experience with Amanita Muscaria (ID 98391)\". Erowid.org. Nov 28, 2012. erowid.org/exp/98391",
 "substance": "Amanita Muscaria",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 cup",
   " ",
   "Amanitas"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 98391",
   "Gender: Male",
   " ",
   "Age at time of experience: 26",
   "Added: Nov 28, 2012",
   "Views: 3333",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI live in the Pacific Northwest, and these beautiful mushrooms are growing everywhere in my neighborhood! I have been enjoying them for about three years now: picking them and drying them in my oven at about 170 F with the door open and consuming them a number of ways. I have found, however, that the decarboxylation of ibotenic acid into muscimol that is supposed to happen in the oven has been rather hit or miss. When these mushrooms make you retch, it is the ibotenic acid that is the culprit.\r\nSo I decided to find out everything I could about preparing these mushrooms and the chemistry of the ibotenic acid to muscimol conversion. I found out some interesting things. Apparently DMSO, an easy to obtain and low toxicity solvent, is exceptionally effective at converting ibotenic acid to muscimol. How effective is it? DMSO practically gets you a 100% yield of muscimol from your ibotenic acid overnight. At room temperature. Additionally, DMSO is effective at increasing the bodys absorption of nearly any drug, muscimol included.\r\nHere is what I did:\r\nI took 1 small, 2 inch amanita cap and boiled it in a sauce pan with about a quart of water for about 15 minutes, and then removed the cap from the water. I proceeded to let the water boil until there was only a half cup left, then transferred  it to a mason jar and let it cool. (I have seen muscimols boiling point quoted online as being 70 C, and this is simply false. You can boil off the water without harming either the ibotenic acid or muscimol.) I then added 2 tsp DMSO to the solution, and allowed it to sit overnight. The next day, I picked it up and gave it a swirl and drank it in a quick gulp. It did not taste good, but went down quick. I recommend having a chaser nearby.\r\nWithin 10 minutes of taking it, I was feeling the effects of the mushroom, and I felt not a hint of nausea either. This was a small dose, only 1 small cap, but I was feeling significantly more kick than I normally get from that amount. Within 30 minutes I peaked, with a thick calmness in my body and a strong alcohol like buzz but with a clearer headspace. I feel the hypnotic effects and a vague distortion in my peripheral vision. The euphoria does not seem to be amplified, by the DMSO, but is about where it normally would be. The high lasts its usual duration, about 6 hours.\r\nOverall, this has been very, very nice. Will be trying with a higher dose soon and posting results.\r\nJust in case you want to modify this tek, here are some guidelines:\r\nDont use more than 2 tsp. DMSO. It is a catalyst, so you dont need a lot. Also, you dont really want to ingest more than 2 tsp. of it because it does not have the best taste.\r\nDont put the DMSO on the stove. If you add it to the boiling water, and you accidently let it all boil off, you potentially have an explosion on your hands. This makes for a bad trip.\r\nDont try to make a resin for smoking with DMSO, as smoking could cause an explosion.\r\nDo some research on DMSO yourself, and get to know the substance if you arent familiar with it. It has plenty of other useful drug related applications for you to discover. :)\n\n\n"
}
