{
 "title": "An Introduction to Ascension",
 "author": "Past Morning",
 "citation": "   Past Morning. \"An Introduction to Ascension: experience with LSD   (ID 98408)\". Erowid.org. Nov 28, 2012. erowid.org/exp/98408",
 "substance": "LSD  ",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "3 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 98408",
   "Gender: Male",
   " ",
   "Age at time of experience: 20",
   "Added: Nov 28, 2012",
   "Views: 2814",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After months of meditating for the first time in my life (about 5 months), I ingested three hits of potent LSD rated at about 300 micrograms.[Erowid Note: Claims of measured microgram dosages for LSD are usually unsupported. Quantitative measurements for LSD are very difficult to do and cannot be done casually. Without further detailed information about how the measurements were derived, it is reasonable to assume that most statements of microgram dosages of LSD on blotter or in microdots are either misinformed or overstated.]  After dosing, I allowed about thirty minutes to pass to come up a bit and then I sat for a meditation session. I saw many visions that were infinitely complex in structure of goddesses, cities, and pyramids. It all built up to me seeing direct visions of what I perceived as Buddha in meditation posture.</p><p>It was only about an hour into the trip and I hadn't even peaked. At the peak of the trip, I experienced full blown ego death. What resulted were ultimate feelings of rising up into a state of pure bliss. I felt connected to the infinite now. This exceeded and went deeper than any of my previous LSD experiences. Further amusing by the fact that I wasn't even on a heroic dose of the substance.</p><p>Everything seemed to be great until I realized I wasn't coming down from the trip after about five to six days. I continued to meditate to alleviate the immense energy that I felt, but this didn't stop me for experiencing visuals and other characteristics of the substance at times, and I couldn't meditate as extensively as I could before. </p><p>I at many points had nearly made direct contact with entities, only to catch myself becoming delusional.</p><p>I ended up nearly destroying my TV and guitars as I shouted, I don't need these things! and pranced around my house naked, terrifying my mother, who managed to remain strong and calm through this episode.</p><p>After this I fell back to some state of stability, with a new found since of peace and ecstasy. My mom felt relieved, comforted by this and I was the happiest I had ever been, ready to take on my life and move on from the experience. This happened on about the fourth day.</p><p>It didn't last as feelings of paranoia and fear about darkness began to creep up the next day after. As time wore on with the substance in my system, I began to weaken with controlling my mental state again. When I looked in the mirror, I looked as if I was on the verge of death. Sleep was not a possibility for the week that I felt the effects of the substance, which might explain the immense fatigue that I wore on my presence.</p><p>After being unable to control myself again. I began to think that I was telepathically communicating with two friends of mine. I thought, without having communicated with them in person, that they were on their way to my house to pick me up and show me around the new world. That's right, the new world.</p><p>During the entire experience I thought that everyone of my peers, people around my age, were also coming to some state of spiritual awakening. I at many times hallucinated  as I looked at websites like reddit and such, that other people were on my wavelength, including the friends I thought to be picking me up. I also assumed that the world just managed to change drastically, to the point to where we were already on the verge of utopia. As my mom feared that I was getting ready to leave the house, on my own, in the middle of the night, she decided to cleverly convince me she would take me to see my friends. Instead, she brought me to the hospital, quite possibly saving my life.</p><p>There they put me on anti-psychotics and I was sent home after a few days of being in a psych ward for one day and a detox center for drug addicts the other few days. There visuals were still present at first, often being outlines of Buddha or some other figure meditating. After about a day or two in the detox center, the visuals began to subside and I calmed down, yet I felt some level of inner peace and calm I had never felt before, although nowhere near the level that I felt on day four, more than I had felt in many years.</p><p>A few weeks after being on the medications, the anxiety rose again to the point to where I couldn't successfully meditate and the inner peace and calm left me. I withdrew from the medications, but the anxiety worsened.</p><p>On one fateful night, it got so bad, I felt like I was on the verge of suicide, but I held on and went through it. The next day the peace, calm, and a light level of bliss come rushing back to me with a successful meditation session. I had found god and with it, tears flowed. </p><p>I am now happy AND stable; it's only getting better with each day and each meditation session.</p><p>I posted this for the psyhonauts that might have experienced similar and are attempting to reintegrate something of this nature. Honestly, I shouldn't have dropped acid. It was foolish and had it not been for my mother, great harm could have happened to me. I also think that I would have lost it completely and forever had I been genetically predisposed to schizophrenia and other similar illnesses. The only thing I've been predisposed to on a genetic level is depression and ADHD, both of which are continually lifting from me drastically after this experience.</p><p>This experience has gotten me to the point of renouncing all drug usage. I'll be reprocessing this experience for a lifetime and I also would like to see more research on LSD and meditation, because this only raises many questions about the substance, spiritual experiences, and psychological illnesses.</p><p>According to what I've read and seen on chakras, what I experienced is similar to what some describe as a pre-mature opening of the crown chakra, which often sends someone insane if their lower chakras like the root are not strong, open, and stabilized.</p><p>Disclaimer: This is not a how-to guide. I do not feel that I have found enlightenment. I feel like I had a spiritual awakening, but I am young and many challenges await me. What I experienced is possible for everyone if they are willing to work for it, but only the individual can determine the path they need to take for spiritual growth, which includes whatever it is to be done to get to the here, there, and everywhere. For some it may take months to get to this point, for other years. I hope that this can inspire others to take a much safer and stable path to arrive at that constant state of becoming.</p>"
}
