{
 "title": "Fun but Be Careful.",
 "author": "LumberJack",
 "citation": "Citation:   LumberJack. \"Fun but Be Careful.: experience with Zolpidem (ID 98413)\". Erowid.org. Nov 29, 2012. erowid.org/exp/98413",
 "substance": "Zolpidem",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)",
   "  T+ 0:30",
   "10 mg",
   "oral",
   "Pharms - Zolpidem",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 98413",
   "Gender: Male",
   " ",
   "Age at time of experience: 24",
   "Added: Nov 29, 2012",
   "Views: 5442",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI had heard that you could have a psychedelic trip on Ambien and prior to this event I was doubtful because the little effects I had were lack of coordination and a slight dissociative feeling but nothing too impressive.  I was after the real trip I had heard about.\r\n12:00 Am I popped two ten miligram pills in the living room and was not getting the desired 'trippy' effet.\r\n12:30 I had heard snorting the pill delivers a much stronger effect, so I crushed up the last ten milligram pill and snorted it, which brought me to 30 milligrams total.\r\nAround 12:45-? Because Ambien is a time warp, I cannot remember when the effects kicked in, but boy they did!  \r\nThe room suddenly expanded and walls began to breath and I felt very disassociated I decided to go for a walk on a semi busy road (somewhat dangerous) and as I walked in the middle of the street the Ambien visuals really kicked in.  \r\nThey are very hard to describe because they are subtle, almost like a thin shadow of a visual I would see on a traditional psychedelic, but very intense in it's own right when stared at directly  \r\nThey appeared as thin and grey and expanded outwards towards me until they froze and became brittle, at which point they would drift away and break like cobwebs.  I remember stepping over the ballooning, bubbling visuals on the asphalt like I would fall in 'quick sand' and swatting at others to watch them break away.  A short trip down the road almost had me lost, which caused great concern save for the landmark of a local school.\r\nThat guided me home.\r\n1:00 AM--When I returned home paranoia got the better of me and I kept seeing 'shadow people'. For instance any blanket or big cushion laying on the couch took the form of a person and I really believed they were people for a short while. I calmed down once I convinced myself that it was just me in the room, though it was a hard feeling to shake.  When I went to the toilet I viewed the most impressive visual of all--n ever expanding psychedelic bubble three feet deep expanding from the toilet bowl made out of the same greyish substance described earlier.\r\nAftermath next day--I am shocked I didn't alert neighbors or wake up my mother who I was staying with.  I ate an entire box of cream chipped beef and had no memory of it.\n\n\n"
}