{
 "title": "Great First Time",
 "author": "T",
 "citation": "   T. \"Great First Time: experience with 4-HO-MET (ID 98438)\". Erowid.org. Dec 16, 2012. erowid.org/exp/98438",
 "substance": "4-HO-MET",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "8 mg",
   "oral",
   "4-HO-MET",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 98438",
   "Male",
   " ",
   "Age at time of experience: 26",
   "Added: Dec 16, 2012",
   "Views: 1348",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Prior to detailing my experience, let me give a little back story;</p><p>I have not had much experience with psychedelics. I have certainly done a great deal of drinking and marijuana smoking though. I have done mushrooms one time. I did 1/16 oz. and really enjoyed it. I smoked salvia (leaves) once also. It had no noticeable effect. I used to be a regular marijuana user but the element of paranoia got worse and worse to the point where I could no longer enjoy it. Mushrooms did not make me paranoid by the way. I have have a heart condition, mitral valve prolapse, so I will not use uppers and am very cautious about any substance I use.</p><p>My girlfriend and I got four 15mg capsules of 4-HO-MET (metocin). I, being the overly cautious person I am, did as much research as I could and felt that it was a fairly safe drug. We opened two of the capsules up and dumped half of one into the other. I took the one that had roughly 7-8 mg, she took the one that had 23-24 mg. Prior to us taking them, we went to the store and got some things to do. Coloring books, things that had cool textures, etc. I am writing this the day after the experience.</p><p>2:00pm  We take the pills. I had read peoples experiences stating that it could take up to 2hrs for it to kick in. We put on a movie to make the time go by faster.</p><p>2:45pm  The drug starts to kick in. We are very surprised by how fast it started. At this point this just seem a little hazy and off. Almost like being a little drunk. It was a very comfortable transition. No nervousness, no stomach ache, etc.</p><p>3:30pm  The drug seems to have peaked. At this point, I expect that it is just one of many peaks and that the experience will be a lengthy process of ups and downs. </p><p>During this timeframe, certain patterns look cool (especially wood grain), colors and light (especially the light coming through the windows) seem more vivid. Silly things are very funny. My girlfriend and I color in our books, pet our cats, and just lounge around a bit. We both feel extremely happy and comfortable. The visual effects she describe to me are obviously much more intense then what I was seeing. I can understand what she is talking about at least and it was fun talking about them anyways. </p><p>We have wood floors in our apartment. Looking down at the wood, the grain pattern of different pieces seem to flow in opposite directions just slightly. One corner of the room seems to be further away than it should be; deeper. Playing with the textures feels so great, the ceiling fan breeze feels great, the cats feel great. I really take notice of the little details in our coloring books. Things like the pencil shading (from our colored pencils) are really interesting to take notice of and the realization that I am noticing such little details fills me with joy and hope. We talk a bit about life and reality. I notice that everything is waves. Water, fingerprints, wood, animal stripes, light, sound, etc. This realization makes me really optimistic about reality itself (normally, I am a rather cynical person).</p><p>5:00pm  The effects have worn off considerably. At this point I feel a bit groggy. My brain feels sorta fried. Im still hoping that this is just a down period and that I am in for another (possibly stronger) peak soon.</p><p>5:30  I feel the same. At this point I realize its definitely over. Pretty sleepy. If I laid down, I could definitely fall asleep.</p><p>6:30pm  Completely normal now. No longer groggy or sleepy. I feel refreshed and good.</p><p>Overall this was a comfortable and great (although short) experience. I do wish I would have taken more but, on the other hand, I am glad I chose to play it safe for my first time. I will definitely be doing this again and I will be taking 15 mg next time. Today I feel fantastic; better than I have in a long time.</p>"
}
