{
 "title": "Hotdog Stew",
 "author": "Jackoff",
 "citation": "   Jackoff. \"Hotdog Stew: experience with 6-APB (ID 98501)\". Erowid.org. Feb 14, 2013. erowid.org/exp/98501",
 "substance": "6-APB",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "6-APB"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 98501",
   "Male",
   " ",
   "20",
   "Feb 14, 2013",
   "Views: 1553",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This drug is unpredictable and rediculously enjoyable in a sense. When I first started taking this drug it enhanced music to such a degree I barely wanted to even listen to it without it. And then It turned into hell On my last trip.</p><p>I woke up in the morning feeling apathetic as I have been for the past week or so. I fucking hate winter. I had 5 days off of work so I decided to dose early in the morning, about 9:00. I had nothing to eat and had a full nights rest. No other drugs were in my system.</p><p>After an hour into it I began to feel a little different, maybe a little disorientated. Usually I feel pretty damn good, taking a warm shower on this stuff was as good as sex. But this time I felt pretty level. </p><p>I decided to play guitar and listen to music for a while. Music was enjoyable as always while on this but not as enjoyable as usual. And while playing guitar and singing I felt this kind of emptyness, like I had to force myself to keep playing. I also have to say that I felt a strong degree of jitteyness and uneasyness through the whole trip. </p><p>The trip died down after a while and I decided to eat some hotdogs so I wouldnt be starving all night, as I find 6apb kills my appetite. It also makes it extremely hard to get to sleep if taken past 12pm ish ;) pro tip.</p><p>The trip progresses and begins to die down. A super hard crash comes on, so for some reason I watch a documentary about fucking crackheads while I'm trying to lie down. I get a blistering headache, I feel like I'm sapped of all my energy and I feel like I'm gonna throw up. Eventually I do, and luckily I have a huge pot in my room I use to sterilize my brf and I chucked in it, making nice hotdog stew :). </p><p>All in all I would never fucking do it again. Fuck that man. It was great the first three times though. Almost down right amazing if it wasnt for the anxiety and jitters. That could just be me though, I'm pretty fucked up. All in all, peace, take care of yourselves and fuck this shit just do shrooms.</p>"
}
