{
 "title": "Exceedingly Tired",
 "author": "stupidlady",
 "citation": "Citation:   stupidlady. \"Exceedingly Tired: experience with Promethazine (ID 98576)\". Erowid.org. Dec 13, 2012. erowid.org/exp/98576",
 "substance": "Promethazine",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "100 mg",
   "oral",
   "Pharms - Promethazine",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 98576",
   "Gender: Female",
   " ",
   "Age at time of experience: 34",
   "Added: Dec 13, 2012",
   "Views: 5282",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nLast night I had an unfortunate experience with promethazine. I have a habit of taking 4 tramadols every day. Yes, I'm addicted to it but that is an issue I'm dealing with. 4 tramadols is part of my tapering down strategy. Anyway, last night I grabbed the wrong pill bottle out of the cabinet and took 4 25mg Phenergan. They are pretty much the same size and shape of the tramadols. I didn't realize I'd taken the wrong stuff and I went about my day. About an hour after taking them I started feeling exceedingly tired. I could not sit up. I then started seeing shiny things in my peripheral vision. I thought 'oh great, today is the day that ultram gives me a seizure'. But I didn't have a seizure. I had what felt like a stroke or something. I was hallucinating. I couldn't speak without losing my train of thought in mid sentence.\r\nEvery time I tried to walk, I'd just start leaning over. My husband wanted to take me to the ER but I convinced him to just let me lay down. I slept for 15 hours. I tried to figure out what happened and noticed that the promethazine bottle was in a different place than it was the day before. To any person out there who is considering taking this drug recreationally, let it be known that you are making a mistake. There was nothing pleasant to say about how it felt while this stuff worked its way out of my body. My limbs are still shaky.\n\n\n"
}