{
 "title": "Much Harder Than I Expected",
 "author": "Bob",
 "citation": "   Bob. \"Much Harder Than I Expected: experience with Mushrooms & Cannabis (ID 9858)\". Erowid.org. Aug 5, 2004. erowid.org/exp/9858",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "215 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.17 g",
   "oral",
   "Mushrooms",
   "(dried)",
   "  T+ 1:00",
   "  ",
   "smoked",
   "Cannabis",
   " "
  ]
 ],
 "footer": [
  [
   "2001",
   "9858",
   "Male",
   " ",
   "Not Given",
   "Aug 5, 2004",
   "Views: 5623",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>About one month ago I decided that I wanted to experience something new in my usuall weekend trend of beer and pot.  I am not into hard drugs and I prefer substances in nature rather than synthetics.  Mushrooms I decided would be my choice.  After two weeks I finally scored some fungus and now I just waited for the perfect opportunity.</p><p>When my buddy decided to come and visit me for the weekend I knew that this would be a good time.  By then I was well educated on the preperation, dosage, and specifics of mushrooms...I thought.  On the night that we would trip we decked out my room, we had a lava lamp, black light, chrismas lights and a trippy dvd.  My friend worried that 1/8 would not be enough for 3 people (him, I and my girl friend) but the seller assured me that they were premium. We took the shrooms at 9:00 and around 9:45 we began to feel a bit of a body buzz, and we were off!  At 10:00 we worried that we ate too little so we went out to the car to smoke a joint.  On the way out it started to really kick in.  The night sky looked amazing and we ran through the parking lot hiding behind cars and scaring each other.  This was the best part of my trip.  The fresh air felt sooo good when I ran around.  Then we sat down in the car and sparked one up, by the end I was fully tripping.  </p><p>We got out and started our long voyage to the apartment (about 100 yrds).  I popped a laffy taffy in my mouth and suddenly I was made of plastic.  My feet stuck to the ground as I walked and people stared as I walked by.  We entered the building and walked up the stairs.  I didn't have a clue what was going on around me.  I was completely tripping but I was not getting very strong visuals, it was more like I was just in a different place, like in a cartoon.  </p><p>When we got to the room things got really hairy.  I layed down on the couch with my girl friend and we were tripping hard.  She was watching my lava lamp and getting extremely turned on, but I was too fucked up to do anything.  I have to add that I have a very low tolerence to pot and alchohol.  I belive this is why I tripped so hard.  Two hours after blast off I was reaching my peak.  I was almost completely losing touch with reality.  My mind was going crazy, thoughts and visions bouncing around uncontrollable. I layed down on the floor and my eyes rolled back in my head.  My friend and my girl friend start to get worried they slapped my face and tried to talk to me.  This is what in my opinion kept a new experince from turning into a bad-trip.  My mind was like a carnival of lights and sounds,  I was concerned but never scared.  I was soaked with sweat and a few times I almost puked. For over an hour I don't remember what happened just that I was in a world where only my friends voices could reach me.  </p><p>After an hour I finally started to come down.  Little by little I could get back in touch with reality.  The shrooms were MUCH harder than I had expected.  After the hour long peak the trip was really cool again but I was uneasy and very tired, my brain felt warm and tired.  We just chilled and watched The Wedding Singer which relaxed me.</p><p>After experiencing mushrooms I have decided to stick to smoking pot, at least for now.  The mushrooms plunged me too deep for comfort.  Over all I don't regret doing it but next time I will not smoke pot. I felt that the pot made me lose control over the trip and allowed my mind to run wild.  I just recommend to others who read that mushrooms are a recreational and fun drug need to realize that its not as soft as you might think.  Next time I also would trip outside because it was so relaxing and amazing when we were out there, I think that the small room also made me feel confined and nervous...wierd.  Oh well a good experience, good enough to not have to do it again for a long while.</p>"
}
