{
 "title": "My Night in the Park",
 "author": "stoner_simpson",
 "citation": "   stoner_simpson. \"My Night in the Park: experience with Ecstasy & Cannabis (ID 9868)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9868",
 "substance": "Ecstasy & Cannabis",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)",
   "  T+ 1:00",
   "1 hit",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "  T+ 2:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "9868",
   "Male",
   " ",
   "Not Given",
   "Jul 11, 2005",
   "5880",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>My girlfriend always told me about the effects of ecstasy.  She told me that I would love it never experience anything better than the feeling of being on ecstasy.</p><p>It started out as being a bad night.  We were looking for some marijuana and ecstasy.  We were supposed to have a hook up for the ecstasy but somehow both our weed hook up and our ecstasy hook up were screwed up and we never ended up getting either to begin with.  We sat around my apartment when my girlfriend decided to make one last call to find weed.  She got a hold of a guy that could hook us up.  She went off to meet this guy and me and our 2 friends stayed at the apartment.</p><p>Well she was gone me and her friends decided that we would go up to one of the local after-hours clubs to find ecstasy when my girlfriend got back.  My girlfriend made it back about an hour later and we quickly smoked a bowl to get ready to go and pick up our ecstasy.</p><p>We hoped on the bus and we were talking and we figured the chances of getting Pure MDMA like we were supposed to get was out of the question.  We finally got up to the club to get and ran into someone one of our friends know. He sold us four pills and we stuck them into our pockets and hoped on the bus and headed home.</p><p>When we got home I was a little scared to take the pill so they told me to just take half.  I decided that I didn't want to be the only other one peaking when I took the other half so I took the whole thing.  We didn't want to sit around our apartment and we seen a park on the way home that we thought would be cool to sit in.</p><p>We left the apartment and started heading to the park about 30 minutes after we dropped.  About 15 minutes had passed when we stopped on the street.  We were all starting to feel it now and the 3 girls wanted to put sparkles on there face.  They stopped and kneeled down and got the sparkles on there faces and we continued to the park.  We reached the park and ran for the sand like a bunch of little kids.  By now we were starting to feel the effects pretty good.   We took our shoes off and played in the sand.  The sand around our feet felt so cool.  My friend pulled out her pipe and that would be the first of many bowls to come.  In between hoots my friend dug a hole deep in the sand.  We smoked a bit more weed and then there was a girl walking through the park which I would later learn was on Mushrooms.</p><p>We told her come smoke a bowl with us so she did.  We started talking with and then my friend took her over to show her hole in the sand.  She looked down in it looked up and said I gotta go and left never to be seen again that night.  We continued to play in the sand when a bunch of guys from across the street came over to tag the park.  We started talking with them and we smoked a bunch of weed with them.  By now I was feeling totally free not a care in the world.  Nothing was gonna bring me down from this high no matter what you did.</p><p>My girlfriend got her hands on a marker and started drawing a dragon on a beam in the park.  I walked over to see her and see if she wanted some of the weed in the pipe.  She looked up at me and I looked down at her.  She looked like she was having an orgasm drawing the dragon.  I could see the sparkles on her face and she looked so beautiful that I couldn't keep my eyes off her and I had this stupid smile on my face.  One more guy would show up and he and my friend went for a run leaving me and our other friend just walking around following this bowl.  Later on me my girlfriend and one of our friends stood on top of the slide.  We were talking about piercing and our friend showed us her nipple ring.  All I could say, and I was surprised that I didn't get slapped, is you got a beautiful nipple.  Everything looked a hundred times better.</p><p>Near the end of the night while we were starting to come down one of the guys went and got his guitar and played for us.  We were all sitting around when these 2 drunk guys came up and started making an ass of themselves.  Without a word we all stood up at the exact same time and left the park and went back to my apartment.  After that we just sat around and smoked weed in my cool bongs.</p><p>I have had one more experience since but I think that was the best night of my life and it started out so crummy.</p>"
}
