{
 "title": "Researching The Research Chemicals",
 "author": "W. Harade",
 "citation": "   W. Harade. \"Researching The Research Chemicals: experience with Ethylphenidate (ID 98740)\". Erowid.org. Dec 31, 2012. erowid.org/exp/98740",
 "substance": "Ethylphenidate",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "IV",
   "Ethylphenidate",
   "(powder / crystals)",
   " ",
   "  ",
   "IM",
   "Ethylphenidate",
   "(powder / crystals)",
   " ",
   "  ",
   "insufflated",
   "Ethylphenidate",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2012",
   "ID: 98740",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Dec 31, 2012",
   "Views: 2861",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nHello everyone. I would like to formally introduce myself to this site with my first experience report. This one will be more of a summary of sorts, but I can assure more details in the future. I am a college student studying pre-medicine and pre-pharmacy in the hopes to pursue psychopharmacological research in graduate school. In my reports, in intend to discuss the effects on the physical, mental as well as pharmacological state of my body. <br>Without further ado, here is my overall report of ethylphenidate:<br>Ethylphenidate (hereon abbbreviated EP) is a fascinating chemical. For me, the following dosages are effective for the mentioned effects. Pure powder/crystals were used from a trusted source. All doses were measured with a (semi)accurate milligram scale with an uncertainty 0.002+-g<br>IV/IM:<br>*Considering its high water solubility, intravenous/intramuscular injection was my first draw. For IM, I increased the doses by about 25mg. <br>   -Light: 25mg-75mg<br>   -Moderate: 75mg-125mg<br>   -Heavy: 125mg-175mg<br>   -Extreme: 175+mg <br>(I strongly discourage anyone to proceed above 175mg intravenous. I had to remain seated for the duration of the effects at 175mg. I was going to attempt 200mg, and I'm thankful some sanity set in.)<br>Insufflation:<br>*It should be noted that snorting this substance produced a notably strong burning sensation. It took about a minute to fade, but could be discouraging. Repeated use via this ROA has led to nasal bleeding.<br>   -Light: 10mg-100mg<br>   -Moderate: 100mg-200mg<br>(I have yet to attempt many doses above this due to the nasal damage that the chemical ensues.)<br>Effects<br>Duration: IV: 1hr. IM: 1.5hr. Insf: 2hr.<br>Anecdotal report overall, this is my favorite research chemical yet, and unfortunately, therefore, the most likely to soon be banned. The euphoria from the drug is simply amazing. When injected, there was an indescribable rush. It's similar to the injection of opiate related compounds, but the stimulation makes it even better. I can imagine one would ascribe it to cocaine injection, but I wouldn't be able to tell such. <br>Here is my best description: as I push in the plunger everything becomes perfect; I close my eyes; I crack them open slightly, and see the walls 'melting;' it's literally as if all of my troubles are melting away; I sit down on the ground and close my eyes again; it's the perfect feeling, no pain all pleasure, better than an orgasm. <br>The interesting thing about this drug is that it has a hallucinogenic aspect to it as well. Whenever I take a moderate to heavy dose, I have tracers and other aspects similar to a pre-delirium trip. That also makes this drug unique and somewhat similar to dextromethorphan (DXM); in low doses, I can feel giggly, stimmed, and happy, but in heavy doses, I have a strained heart and not want to move a lot, and also have OEVs and CEVs.  I will describe my simple method below, but first I will have my concluding thoughts about the pharmacology of the drug.<br>Intravenous (/intramuscular) preparation for ethylphenidate: <br>This drug is very soluble in water, so this will be your solvent. I recommend cleaning a small teaspoon with isopropyl alcohol (on a cloth, so a wipe is easiest) and measuring out your exact mass of EP (Do NOT eyeball. Period. This compound is very dense, and you will use too much), and disinfecting a 1cc insulin syringe. Add cold DI water (or tap water, just run it for a good minute), and lightly stir the solution. Heat the solution until boiling (its decomposition point is well above water's boiling point) and stir it again. If you used a large mass of EP (i.e. 100+) you may need to add water and heat again. Use your sterilization wipe to clean your injection vein (or intramuscular location) and enjoy. (Note for IM: it will burn slightly, this does not occur in IV usage).\n\n\n"
}
