{
 "title": "Out of Body Experience",
 "author": "LaChorrera",
 "citation": "   LaChorrera. \"Out of Body Experience: experience with Salvia divinorum (ID 9903)\". Erowid.org. Oct 11, 2001. erowid.org/exp/9903",
 "substance": "Salvia divinorum",
 "bodyweight": "147 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "Salvia divinorum",
   "(dried)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9903",
   "Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Oct 11, 2001",
   "Views: 19153",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I once had an OBE after toking 2 gigantic bong rips of Salvia Divinorum leaf.  I was holding the second blast in and I started to feel a tingle start in my limbs.  The next thing I know my astral body is being pulled out the back of my physical body and then through the wall of my house.  Down my block I went being pulled by an unseen force.</p><p>The feeling of having your conscience forcefully pulled out of your body is a pretty amazing and scary experience.  It reminded me of the way peoples spirits were pulled from thier bodies in the movie Final Fantasy: The Spirits Within.  I was about three houses down my block when I suddenly realized that I shouldn't go any farther for fear that my physical body might die if I went too far.</p><p>I had to fight with all my might to travel back into my house and back into my body sitting in a chair.  I entered my body the same way I left it, through the back.  At that point I opened my eyes and saw my friend who was there to watch over me while I was under.  He was laughing at me, which kind of bothered me cause I couldn't comprehend what had happened to me.  It felt as if there was magnet pulling back in the direction of my OBE (I checked later and the direction was exactly east).  I tried as hard as I could to turn around in my seat, because I was sure there would be some sort of tunnel or worm hole into hyperspace.  Of course there was no tunnel, but the effort to turn around was exhausting. </p><p>I've had breakthrough Salvia experiences all of the 6 times I smoked it out of a bong, but none of them have ever compared this humbling experience.  Haven't tried DMT yet, but for a legal, immediate, short-acting high Salvia is the most intense psychedelic I've ever tried.</p>"
}
