{
 "title": "A Wonderful Addition to the Family",
 "author": "Generous Slut",
 "citation": "   Generous Slut. \"A Wonderful Addition to the Family: experience with 3-Methylmethcathinone (3-MMC) (ID 99057)\". Erowid.org. Jan 23, 2013. erowid.org/exp/99057",
 "substance": "3-Methylmethcathinone (3-MMC)",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "100 mg",
   "oral",
   "3-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 1:00",
   "50 mg",
   "oral",
   "3-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 2:00",
   "50 mg",
   "oral",
   "3-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 3:00",
   "50 mg",
   "oral",
   "3-Methylmethcathinone",
   "(powder / crystals)",
   "  T+ 4:00",
   "50 mg",
   "oral",
   "3-Methylmethcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 99057",
   "Gender: Male",
   " ",
   "Age at time of experience: 42",
   "Added: Jan 23, 2013",
   "Views: 12433",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nI reluctantly ordered some 3-MMC from an online vendor because I cant seem to contain my fascination with the substituted cathinones.  This is one of those RCs for which there is very little data, so it is treading on new ground for the most part. Exercising caution is the wise way to go.\r\nI did not test the material, so I am assuming it is what they said it was, but without testing one can never be sure.  The material was a clear/white, crystalline solid that had the usual cathinone smell.  I spent some time previous to this experience doing a very careful bioassay, beginning with 1 mg, then 5, 10 and 25 mg respectively over the course of a day, ultimately bringing it up to a 50 mg insufflated dose the following day which lent only a mild stimulation and euphoria.   I decided it was reasonably safe to proceed with a larger oral dose.\r\nT=0:00 - Took 100 mg orally.\r\nT=0:30 - First alerts move quickly into full come up, lightheadedness, very alert and focused. Has a nice rush, but its far more subtle and not as debilitating/distracting as say 4-MMC.\r\nT=1:00  I feel generally wonderful, alert, and although Im more inebriated now, Im able to work fine. Dosed an additional 50 mg oral.\r\nT=1:30  Feel the additional dose coming on. Feels wonderful. Resting heart rate is slightly elevated but not by much  maybe 80 or so. Some mouth sucking and teeth clenching, but I am very alert and can think clearly.\r\nT=1:45  For the first time Im feeling a bit lethargic, but in a wonderful way. This would definitely be a nice cuddle drug.\r\nT=2:00  Took another 50 mg and soon after was thrust forth once again into a beautifully mild euphoric state. It still does not come on as strongly as 4-MMC, and I am able to continue working at my computer, but working is so much more fun and pleasant than usual. I feel none of the usual pain in my back that I feel from typing, although Im a bit jittery.  My heart rate feels good, just over normal, although I am sucking a lot, and my mouth feels dry and tense.\r\nT=3:00  Throwing caution to the wind I took another 50 mg just because I am enjoying this so much. I feel on top of the world, although I think I felt the slightest amount of crack out begin a few moments ago. The booster should alleviate that feeling.  I continue on with office work, which I am hating much less than I usually do.\r\nT=4:00 The last booster dose definitely worked to alleviate the cracked out feeling I was beginning to notice, however mild that it was.  I decide to take an additional 50 mg, bringing my total dose up to 300 mg. Not much has changed since before, just feeling generally stimulated, mildly euphoric, somewhat empathogenic, very content and clear-headed. I feel quite excellent all around.  This one reminds me a bit of Ethcathinone. It is more gentle and sweet than 4-MMC, but also less inebriating and euphoric. It might be better suited to intimate evenings at home rather than parties, for which I would typically choose 4-MMC.  I decide to stop here as I feel Ive eked out the nature of the material and that was my intent for this experiment.\r\nT+6:00 Over the past two hours Ive made a very gradual, linear return, almost to baseline now, with only a bit of residual stimulation remaining. I feel a bit weak and cracky, but surprisingly these feelings are quite mild and overall I feel quite good. The comedown of 3-MMC might even be milder than 4-MMC, which says a lot. A small snort more might stave off the crack-out but I think Im going to leave it there for now as the inevitable would likely arise in time anyway.\r\nT+7:00  Totally baseline and feeling very good about the experiment today. 3-MMC is a milder cathinone than 4-MMC, and although less euphoric, it still has merit in this regard. The head space has more clarity than 4-MMC, and therefore this material could be used to make a work day go by with more enjoyment (as it did), or to lubricate a low-key social occasion like hanging out with friends.  I suspect it would also be a pleasant addition to lovemaking, as the stimulation provided energy and the euphoria imbued me with a very happy, loving state of mind.  \r\nThis one is quite short acting, although I was able to flatten out the dose-response curve somewhat and extend the experience by taking multiple, smaller doses. Although it is difficult to say after this one experiment, I sense that the duration of the peak may only be about 60-90 minutes.  \r\nThis stuff is definitely weaker than 4-MMC.  Next time I would probably take 200 mg to start, with a 100 mg booster after an hour. In terms of total dose, I could probably take it further than 300 mg, but I never like taking too much of an unknown substance into my body, so that would be the one detractor.\r\nAll in all two thumbs up. I look very forward to trying it again.\n\n\n"
}
