{
 "title": "My Visit to Hell",
 "author": "Wack",
 "citation": "   Wack. \"My Visit to Hell: experience with JWH-018 (ID 99078)\". Erowid.org. Feb 28, 2013. erowid.org/exp/99078",
 "substance": "JWH-018",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "smoked",
   "JWH-018"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 99078",
   "Gender: Male",
   " ",
   "Age at time of experience: 18",
   "Added: Feb 28, 2013",
   "Views: 2154",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nApart from alcohol, I have one year of smoking weed and one mushroom trip under my belt, I dont really have a desire to do much else either. I dont know what it is about me, but getting too fucked up has always been a problem of mine. \r\nA couple friends and I had bought a bag of synthetic cannabis and after smoking it twice with them (with good effects).  I ended up with the bag. A few days later I had some time to kill and figured an hour long 'weed' high would be perfect. I packed a bowl and took two big hits out of my basement window.\r\nImmediately after I put my pipe down I could feel the effects and knew I was in for an ass kicking. My room was intensely bright in the summer sun and my heart had already started to race. I walked upstairs and paced around my kitchen, tried to drink some water but ended up spilling the water all over the counter. After this I was freaking out more than I ever have and was convinced that I was ODing and dying from a drug I knew nothing about, there was also an increasingly loud static in my right ear from here until the end of the trip. Everything was moving fast, and everything had a tint of yellow (think an extremely grainy photo with a yellow hue and over saturated). \r\nAfter being upstairs for around 5 minutes I was beginning to peak. I walked myself downstairs and on my way down, getting progressively more intense as I descended, my vision started getting lower and lower frames per second. By the bottom I was seeing a still image, then a couple seconds later it would switch to what I was then looking at (like a glitching computer game). This hallucination was more intense than anything from my mushroom adventure. \r\nI eventually made it to my couch and lay on my back. I rocked back and forth on the couch, sweating, feeling my heartbeat, and trying to calm myself down. After being on the couch for a while I started getting darker and darker thoughts. The most extreme depression Ive ever felt was upon me. For a few minutes it was as if I was floating above myself, able to see every single flaw in the kid that was tripping his face off on the couch. I was the scum of the earth; I was criticizing my entire being. I couldnt get these thoughts out of my head, I knew I didnt want to think them but every time I tried to think of something else the dark thoughts would come back and I would get sucked back into hell. \r\nI kept telling myself that even if this overdose didnt kill me I was going to kill myself once I sobered up, and how pathetic my death would look to everyone I loved. The voices in my head were as if a demon was on my shoulder, his voice screaming the same negative thoughts into my head like a skipping disc repeating the same thing over and over, each thought hit my self esteem harder than the last until I was in the fetal position trying not to implode with self-hate. I couldnt hear anything at this point, as the buzz in my right ear was now painfully loud. \r\nThings slowly got better and I was able to grasp the situation and remind myself that I was just high and would come down soon. I eventually came down into sobriety on the couch.\r\nBelieve it or not, I didnt die!! The whole thing lasted about 45 minutes. Apart from being terrified of what I had just went through, I suffered only a slight headache. This was by far the most intense thing Ive ever experienced in my life, and after having a flashback of the horror while high on weed the next day I havent touched anything except alcohol. \r\nI wouldnt recommend synthetic cannabis to anyone based on the off chance you have an experience similar to mine. It is my new standard for what hell must be like. I didnt and still dont suffer from depression or have any thoughts of suicide, so I dont know where this trip came from. Inner demons I guess.\n\n\n"
}
