{
 "title": "A Little Journey to the Forest People",
 "author": "The Guy on the Couch",
 "citation": "   The Guy on the Couch. \"A Little Journey to the Forest People: experience with Salvia divinorum (ID 991)\". Erowid.org. Jan 15, 2001. erowid.org/exp/991",
 "substance": "Salvia divinorum",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "  ",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2000",
   "991",
   "Not Specified",
   " ",
   "Not Given",
   "Jan 15, 2001",
   "Views: 6754",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>After deciding this was the night, I placed the table close to my bed and placed the bong on the table, along with a pile of Salvia 5X extract. A little nervous, but not that bad. Yeti (very soft tribal-like trance/travel music) was playing in the background. I took some of the Salvia and placed it on the screen, placed the tube from the bong in my mouth and inhaled all the smoke. I turned off the lamp and laid back on the bed with my eyes closed. The first thing i noticed was my pulse going berserk (or did i only feel that way?). My whole body kind of pulsated for a short while. I tried to look for CEV's, but i think i got disturbed by my pulse. I filled up the bong again. After inhaling, I felt like, 'now I'm going there,' like i did the time before, but in fact, i did not. I felt myself gliding trough a membrane of some sort, drifting, the music was there as it was supposed to be. I kind of zoomed down to some sort of landscape, but i did not see the landscape, only felt the presence of it. The ground was covered with leaves. At the moment i think i guessed i was in a forest, but now i think they may have been leaves from the Salvia plant. The leaves had life, a group of beings or maybe only one female?, pushing up out of the ground and the leaves covered the 'body' as it rose up. I felt the zooming again, I traveled backwards and the entity melted back into the leafy ground.</p><p>Amazing, this first experience. I only wanted to try the wings this time, maybe I'll see you again, Salvia.</p>"
}
