{
 "title": "Proceed With Caution",
 "author": "Antibody2",
 "citation": "Citation:   Antibody2. \"Proceed With Caution: experience with 25B-NBOMe (ID 99147)\". Erowid.org. Feb 28, 2013. erowid.org/exp/99147",
 "substance": "25B-NBOMe",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "vaporized",
   "2C-B-NBOMe",
   "(liquid)",
   "  T+ 3:00",
   "200 mg",
   "oral",
   "MDMA",
   "(capsule)",
   "  T+ 3:00",
   "1 cig.",
   "smoked",
   "DET",
   " ",
   "  T+ 5:00",
   "200 mg",
   "oral",
   "MDMA",
   "(capsule)",
   "  T+ 5:00",
   "1 cig.",
   "smoked",
   "DET",
   " "
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 99147",
   "Gender: Male",
   " ",
   "Age at time of experience: 40",
   "Added: Feb 28, 2013",
   "Views: 3105",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDesired effects: To go deeper than ever before\r\nIntensity: Overwhelming\r\nSource: RC vendor\r\nIve been experimenting with the NBOMe class of phenethylamines the past few months, mostly with 25C-NBOMe but also with 25I and 25B laid out as bottlers. In fact a few weeks ago I was at a psychedelic party and everyone took blotters ranging from 500ug to 1500ug. Some did the 25C some the 25I and some the 25B. Everyone had an enjoyable experience. \r\nAfter reading some trip reports I decided it would be interesting to freebase some 25B NBOMe and try vaping it. Some I prepared a solution of freebase 25B NBOMe at a 400ug/drop concentration in ethanol. The methodology was to heat the glass pipe, so that when the drop of solution was put in the pipe the ethanol would evaporate from the heat of the pipe, leaving the 25B NBOMe behind.\r\n9:30pm\r\nThree of us drove to another city for a big psy gathering and almost as soon as we got to the event myself and S head into the washroom to get things under way. S went first. I put what I thought was one drop in the bulb and S vaped it. I could tell immediately that S was a little overpowered by its fast onset. I went next and also vaped what I thought was one drop.\r\nIn hindsight, it is possible that in the dimly lit washroom, that more than one drop made its way into the pipe. \r\nI only had time to put the pipe/eyedropper/and vial away before the effects were felt. In the time it took me to walk back to the dance floor, the visuals were so strong I really couldnt see where I was going. 2d black light paintings on the walls all of sudden became 3d holographic projections floating all over the room, there were tracers on everything. I was effectively blind. \r\nI got halfway across the dance floor when I had to sit down it was so overwhelming. Our other friend R found me sitting in the middle of the dance floor and helped me to a couch. I told him that S was probably in worse shape than I was. At this point I wasnt alarmed, I just thought it will take me some time to get used to this, to recalibrate as it were. My headspace was completely intact. I could think clearly, and knew who and where I was. \r\nR went looking for S and found him leaning against a wall outside the washroom completely disoriented and brought him to the couch and told him to just breath and sit down. S is now groaning and wont stay put. He starts staggering around the dance floor, but he is so messed up that people are looking at him weird. We try and bring him back to the couch where he curls in a ball and starts moaning. The organizers get wind of this and ask us if S is with us, and then asks us to get him out of there. But S is so messed up we cant get his coat check ticket from him and its winter. S throws up all over the place and the promoter is getting pissed off. So we decide to take him back to the hotel room. \r\nR sends me out to get a taxi. I tell him that will be difficult because I cant see. R says this is your fault your responsibility, you take care of him. So out into the street I go, except the hallucinations are so strong all I see is streaks of light going down the road. I eventually ask some people standing outside for help to flag a taxi explaining about the hallucinations are making this impossible for me. We finally get a taxi and R brings S out into the street and puts him in the cab and says just pretend hes drunk when you get to the hotel. R goes back in the party.\r\n11:00pm\r\nOn the way to the hotel S is getting worse. He is trying to jump out of the taxi while it is moving and I have to ask the taxi driver to lock the doors. Then I decide, NO, we need to go to the hospital, this is getting out of control. S pleads with me to take him to the hotel room, which I do against my better judgment. I manage with some difficulty to get him to the hotel room. For a while it seems like this might work. I am able to get him to lie down, and I settle in to babysit. \r\n11:30\r\nBy now my visuals have calmed down enough for me to see, but they are still very pronounced, like these ethereal bands of smoke everywhere. S is agitated and requires constant attention, then at one point I can no longer get him to lie down, he is getting louder and louder and begins to scream my name, I tell him he needs to be quiet, but he is longer able to connect with me at all. He is trying to get out of the hotel room into the hallway. Its all I can do to prevent him. Now he is screaming I LOVE THE LIGHT and he has one arm lifted into the air like he is reaching for something. I can no longer control this situation.\r\nAt this point Im starting to freak out. I am convinced that I am completely fucked. The hotel room is filled with drugs and with the noise S is making its only a matter of time until the police show up. Im trying to gather everything up and put it in a bag, but Im still so messed up Im having a really hard time of it, and Im having to simultaneously keep S from getting away. I finally get everything packed up. I tell S he has to wait for me, Ill be back in 10 minutes, and head to the parking lot to hide everything.\r\nWhen I come back to our floor, I know as soon as I get off the elevator that things are out of control. I can hear S screaming at the wrong end of the floor, so I rush down there and three hotel security have S backed into a corner of the hall. I explain that he is my guest and that we have a hotel room and that S is having a bad trip. S is screaming and screaming. Im the only one that can get near him. The manager tells me the police and an ambulance are on their way. \r\nWhen they show up two cops wrestle S to the floor, but they cant hold him down, two more cops pile on top, a paramedic takes out a syringe and trys to give him a shot, but S has gone completely wild, biting the cops, they call for more back up and next thing I know there are now 12 cops trying to hold him down. The paramedic gives the shot, but it doesnt do much. The cops are still calling for more back up, the entire hallway is filled with cops, maybe 30 of them here by now. They finally get S cuffed and strapped onto a gurney and wheel him out. \r\nNow the cops turn their attention to me. They start interrogating me in the hallway, the walls and carpet are breathing big time. I tell them that I think he has taken some kind of phenethylamine. We go back to the hotel room to finish the interrogation. I ask if it is realistic to think he will be able to come home with us the next day. They say to call the hospital in the morning and that S probably will not be charged.\r\n12:30am\r\nI go back to the party and drop a cap of MDMA on the way back. The party is going full tilt, my hallucinations are pretty much over now. So I also smoke a joint of pot infused with DET. The dancing is out of this world and R buys me a drink. He is in shock when he hears all of what happened at the hotel.\r\n2:30am\r\nI drop another cap of mdma and smoke another joint of DET and lose myself on the trance floor for the next 4.5 hours. So glad I went back, I almost didnt, having been so traumatized by the evening.\r\n6:30am\r\nR and I make our way to the hotel room and there is a message from S that was left at 1:56am saying he hopes he didnt get me in too much trouble. Apparently around 2am he became himself again and they took off his restraints and gave him his phone and wallet back.\r\n8:00am\r\nIm asleep when I hear the door open and S returns and quietly gets into bed. His wrists are swollen badly because he struggled with the handcuffs so much, and he also has carpet burns on his face from the struggle. He doesnt remember biting the police or getting an injection. He explains that everything was covered in blood and he thought everyone was a demon trying to drag him away.\r\nAfterthoughts\r\nThis was by far the most intense psychedelic experience of my life except for short DMT blasts. My own trip would have been quite enjoyable if not for Ss experience. In hindsight I should have taken him to the hospital instead of to the hotel room. \r\nI also think anyone who is considering vaping this stuff should do so with a sitter the first time, preferably one who isnt vaping anything, and not in public. Ive been playing around with NBOMe for months and the blotters are no where near the same experience as vaping. Not remotely similar. This was kind of like a bomb going off in our face.\r\nA more responsible way to administer this substance would be to dilute the solution to 100-200ug/drop and take multiple hits rather than one big one.\n\n\n"
}