{
 "title": "Psychic Rollercoasters",
 "author": "platypus",
 "citation": "   platypus. \"Psychic Rollercoasters: experience with 25I-NBOMe & 25C-NBOMe (ID 99177)\". Erowid.org. Mar 2, 2013. erowid.org/exp/99177",
 "substance": "25I-NBOMe & 25C-NBOMe",
 "bodyweight": "250 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   " ",
   "2C-I-NBOMe",
   "(liquid)",
   " ",
   "  ",
   " ",
   "2C-C-NBOMe",
   "(liquid)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 99177",
   "Male",
   " ",
   "Age at time of experience: 22",
   "Mar 2, 2013",
   "Views: 2166",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Other/previous experiences: LSD, mushrooms, 2C-x, mescaline, DMT, 4-AcO-DMT, allylescaline, probably others. Combinations of 2-5 of the aforementioned, at high doses.</p><p>Dosage: Ranging from 300-3000 mcg for both 25i and 25c. I started at 300 mcg for each and worked my way up (I highly recommend doing this for these compounds). Dosed in a dropper that spat out around 300 mcg per drop. I've tried holding it under my tongue as well as snorting it. Snorting it seems to give less nausea and unpleasant physical side effects than taking it orally, though it comes on faster and more intensely.</p><p>Settings: I've done it inside, outside, combinations of inside and out, when it's been raining, sunny, and snowing. Overall, I'd say the most important aspect of the environment is that it's safe and low energy -- I'm plenty energetic from either compound, and too much going on can be confusing.</p><p>Duration: Both chemicals have similar timelines to an LSD trip for me, except for a very abrupt transition from 'come-up' to 'everything's fractal goo' around 2 or so hours in. I generally will expect to be awake for an additional several hours after the effects wear off (generally after 8-14 hours depending on dose), however.</p><p>Effects: 25i is especially speedy. I'd liken the experience to doing speed and LSD at the same time. 25c is calmer, but can take a speedy twist. The come up is quite frantic and a bit confusing, and it's when the physical effects are at their worst, but drinking some ginger ale and fading into my favorite music until I plateau has consistently steered me into a good trip. </p><p>I don't recommend a lot of physical activity until the plateau, actually. It's always made me freak a bit about my heart rate (which never really went above normal if I stayed calm) and it seems to exacerbate the physical side effects. Visually, both compounds are quite astonishing. Intricate fractal patterns can cover your entire reality quite easily. My head space is pretty clear on both, not really any out of the ordinary thoughts, though even a hint of confusion or fear has sent me on loops. It took me several experiences to realize having lots of different things to do around would be the most beneficial thing to my NBOMe experiences, as the time dilation is pretty extreme and concentrating on a single thing was quite hard on higher doses.</p><p>Interactions: Marijuana seems to interact with both compounds quite a bit. It can calm me down, but it can also intensify the visual effects, and elicit more confusion. Alcohol seems to do the same. Combining them with even small amounts of other psychedelics has sent me into a euphoric, rainbow-covered stupor for several hours. It was extremely intense and disorienting.</p><p>Overall, I like both compounds quite a bit. My favorite experiences with them have been ones with experienced trippers whom I trust and ones where I've thrown myself into making music. Both chemicals are quite unique compared to the others I've tried. While they don't have the same kind of 'trippy thoughts' effect as others, they can cause FAR trippier (and potentially fear-inducing) thought patterns, and have a profoundly different physical feel to them than traditional psychedelics. </p><p>As others have mentioned, looping thoughts and conversations are very common, and for myself, learning to recognize and break these loops with other thoughts and actions was the key to making my experiences with these compounds enjoyable. Insight into myself on these chemicals has been kind of minimal, unless I myself become the creative subject of my trip. Energy and creative thinking are definitely heightened, however.</p><p>Thanks for reading.</p>"
}
