{
 "title": "Life From Inside the Fishbowl",
 "author": "Rorgiastic",
 "citation": "   Rorgiastic. \"Life From Inside the Fishbowl: experience with 25C-NBOMe  (ID 99188)\". Erowid.org. Mar 22, 2013. erowid.org/exp/99188",
 "substance": "25C-NBOMe ",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE:",
   "300 ug",
   "sublingual",
   "2C-C-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 99188",
   "Male",
   " ",
   "16",
   "Mar 22, 2013",
   "Views: 4303",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Life From Inside the Fishbowl, Or How the Three Boys Lead Our Lives</p><p>Dosage: 300 micrograms of 2C-C-NBOMe</p><p>Age: 16</p><p>Height: 6 foot, 2 inches</p><p>Weight: 210 Pounds</p><p>Previous experience with psycho actives: Marijuana around a dozen times, alcohol usage</p><p>occasionally, tobacco use rarely, a low dose of LSD (50 to 100 micrograms), a low dose (1.5 grams) of mushrooms, a nice experience with Ecstacy (speculated it was MDMA with Ephedrine and Amphetamine), amphetamine, methylphenidate, lorazepam, tramadol, codeine,</p><p>hydrocodone, zolpidem, dextromethorphan, and pentobarbital.</p><p>It was a lovely Saturday morning in a city across the river from our Nations capital. I messaged my friend N, letting him know that he should come over. He said hed be over in a bit, as he had things to do. N and I had experimented with extremely low doses of 2CCNBOMe, maybe 50 micrograms each, which took us just off baseline, but with no strong effects. I had also experimented with an 100 microgram dose, but again, nothing that pronounced. This was our first true experiment with 2CCNBOMe. N arrived around 12:45 PM, and we ate a bit of lunch (Iworried that eating would hamper the effects of our Phenethylamine friend, but I dont think the eating affected the drug too much at all). </p><p>At around 1:30 I felt it was time to dose out, and we cut a 600 microgram tablet in half, measuring two equal sides (I know this most likely not 300 micrograms EXACTLY, but for the ease of writing this, lets just say it was, it falls in line with the</p><p>effects others got with 300 micrograms). Then, simply we put the tabs under our tongues and proceeded to grab a frisbee and walk to a park nearby. We were nervous, but not too nervous. I will now group the experience in time, as it may be easier to read that way, and it will be easier for me to mark down the things I felt chronologically.</p><p>1:30 PM Take 300 microgram tab, go to park.</p><p>1:35 PM We arrive at the park, and play a bit of frisbee.</p><p>1:50 PM The first notions of being of baseline appear, though I would be lying If I said we were truly affected at this point. Colors just looked rather brilliant, and a slight euphoria sets in. 5 or so minutes later the euphoria builds and we climb some trees in the parks open field. It could be easily said we were having a great time, but I dont know if that can automatically be attributed to the drug, as it is certainly easy to have a great time with friends without any substance. We then decide to walk down to a forest that provides a short, but rocky and tough hike that goes to these bluffs overlooking the Potomac river. Seemed like a perfect place to explore. </p><p>This trail means a lot to me, these rocky and somewhat dangerous cliffs overlooking the Potomac mean a lot to me. I used to (and still) hike there with my Father and Family, I smoked my first joint there, had my first beer there. I knew it would be the perfect place to go.</p><p>2:00 PM We start walking into the forest. We remark the forest looks like a painting, particularly a Romantic era painting, showing the real glory and vastness of nature. We walk further into the forest, looking at the world around us. I can certainly tell we are coming up, but it isnt something intense at all. A light buzz, like maybe one hit from a joint.</p><p>2:05 PM We sit down on a log in the forest overlooking a creek. The world looks very pretty, colors are fucking radiant and amazing. An ethereal quality starts building. Happy families walk amongst us. </p><p>2:15 PM We start walking towards the Potomac. The world is just really growing more and more beautiful, for the both of us. On the path, two trees are looming over us. I have this bizarre but wonderful feeling that they are both elderly japanese men, and they are looking over us. I spend a few minutes feeling them, just enjoying being there with those old men. We then decide to continue our hike, saying goodbye to our older buddies. The effects keep on coming, a euphoria and psychedelic feeling builds. The world seems to sway and breath together this is so fucking beautiful.</p><p>2:45 PM After more and more hiking, and close to our destination, we are coming up strong. We find a little boy in the forest, alone. He is maybe 2-3, and we help lead him to his family who he has lost. He lead us closer to our destination, an omen for our trip. He was lost, and as we would soon learn, we were lost in our day to day lives.</p><p>2:55 PM We reach our destination. Holy fucking shit. We are sitting on a rock that juts out to the Potomac. Its the most beautiful thing Ive ever seen. The river is creating paintings, and I am on the verge of tears. No artist could ever capture the beauty the world had at that moment. Rainbows shoot out from the other side of the river, sprites dance around my vision, creating geometric shapes. A group of hawks fly in formation but the formation is a naked woman in the sky. Really beautiful, even though these were probably the most pronounced visuals I got the whole entire trip, unless the amazing and flipped colors count. </p><p>We decide to walk down to the bank of the river, right up against the unusually high and rough water. I never felt so good as I did then. The world was beautiful, I was young, and everything was perfect. We smiled, waved, and helped all the hikers we could. We even just sat down and relaxed. It was really amazing. A rainbow glow had taken over the world. Was I crying? I dont know. It was just all perfect, and it</p><p>was perfect to be sharing it with a friend. Sitting on those rocks I feel like I learned a lot about myself. I saw my dog who had died the year before on top of a cliff floating into the sky, the dog that my family got the week after I was born, and died the week after my 15th birthday. It was the first true death I have experienced, sure family members and even some friends have passed away, but this dog was a rock in my life. After seeing that and feeling that, I know I am now truly not afraid of death, something that has relentlessly haunted me from a young age. It is all perfect.</p><p>3:45 We decide to walk back. N starts feeling a bit sour, and is frowning. He is thinking about his life and how little he has done, and how life is so boring. I agree, and we talk about it. He tells me the world and its imminent beauty scares him because he is just a kid, can not do anything. He has been having so many personal issues recently, and is now getting insight into them. Me too, even. I reflect on many personal things, how rude I am, how needy I am. I resolve to fix my issues. N is feeling so many things, and we think he is starting to have a bad trip. To worsen</p><p>things, we come across another young boy talking to an old man. He says to the old man what do you have to lose? you cant lose time. That was probably, in hindsight, one of the most important things Ive ever heard, how the little boy doesnt know that he is going to grow older and die one day. But hearing that, I felt confident, and most of all not scared of the future, of losing time. </p><p>N is telling me he is scared of the world after hearing that. I tell him, N, dont be scared. We have lived our whole entire lives looking at something behind a fishbowl, and it is extremely warped and we cannot tell what it is. Today we went inside the fishbowl, and we looked at it from inside the fishbowl, and I just dont think we are ready to see it clearly. We both find comfort in this. The world is warping, and the colors are changing. In one moment, I feel every emotion I have ever felt in my whole entire life. It is scary, but also beautiful. I feel the happiest and saddest I have ever felt in the same moment. This passes, and N and myself just decide to enjoy ourselves. And enjoy ourselves we did. Our walk back to my house was very very beautiful. We had both come to except ourselves along the potomac, to accept our fears and we worked out our personal problems. We had decided that it was perhaps the most important day of our lives.</p><p>4:30 PM We are walking back, and we see a mother and son, in each others arms smiling and being completely joyous. We see this as a sign of rebirth, and represents how we should live our lives now being completely joyous and happy with who we are with (family, friends, etc etc). We arrive back at my house, and N has to go home. We are still tripping.</p><p>5:00 PM My parents arrive home and I hug them both and they hug me back and we have a</p><p>lovely conversation. I am seeing patterns form on somethings and I find great pleasure just simply looking at things. The effects slowly start to taper off from here.</p><p>7:00 PM Most of the effects gone, but things still look different in a way.</p><p>8:30 PM I have a few drinks and I am completely back at bassline.</p><p>All in all, this was a lesson in psychedelic self exploration and an excellent euphoric afternoon with a friend. Even though some parts of the trip were hard, I</p><p>found them easy to work through, and I came out really changed. This was the first real</p><p>psychedelic life changing experience Ive had. Thank you. Love, Rorgiastic.</p>"
}
