{
 "title": "A Wonderful Evening With Beautiful People",
 "author": "anonymous",
 "citation": "   anonymous. \"A Wonderful Evening With Beautiful People: experience with Methylone (ID 99233)\". Erowid.org. Apr 29, 2013. erowid.org/exp/99233",
 "substance": "Methylone",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "150 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 0:30",
   "80 mg",
   "oral",
   "Methylone",
   "(powder / crystals)",
   "  T+ 5:05",
   "120 mg",
   "oral",
   "Methylone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 99233",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Apr 29, 2013",
   "Views: 3866",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nDose: 150mg<br>First, as a little context, my own experience. Over the last year and a half, I've drunk my share of alcohol, inhaled a ton of nitrous, smoked a bit of cannabis, despite the fact that it's never interested me particularly, dosed on acid six or seven times, my favorite thus far, and tried MDMA once. Earlier today (yesterday?) I tried methylone. This has been one of the most pleasant and relaxed evenings in recent memory.<br>Quick disclaimer: these times may or may not be correct. My sense of time went right out the window and they're guesses  based on starting time, redoses and ending time. I also tend to have a fairly high tolerance to most things for my weight and this didn't seem to be an exception based on my observation of other people, so please be careful with your doseage.<br>3:45 pm A friend recently acquired far more methylone than he intended and decided to share it among about 10 people. This is an excellent idea. Unfortunately, he doesn't have any gel capsules, so he doles out crystals in 150mg doses. We all grab water to wash it down and stay hydrated; the crystals are quite bitter. No big deal, but don't chew them. Bad idea.<br>4:00 Feeling a slight lightness and altered state of thinking reminiscent of the onset of MDMA, but it's not as insistent. I brace myself for the surge of elation and buoyancy. In the meantime, people found speakers and a mini laser show. Glitchmob starts up.<br>4:15 Nothing has changed, so I decided to redose. 80 mg, down the hatch. It's even more disgusting then last time. Our host discovers that exercising feels excellent, so I grab his doorframe and haul myself up for a pull-up. Damn, he's right. Noticing a little tension in my jaw, but not full on clenching that I've experienced with acid and MDMA. I have the tendency to click my back teeth together, but not bite down.<br>4:25 Oh boy, here it goes. Rather than surge upwards like a balloon released of its tether, this was a little more subtle. I feel light, happy and energetic. As a quick test, I hug my girlfriend. Even more wonderful than usual. I think that everyone needs hugs, and they all concur. My girlfriend and I dash to my room to get incense, deciding it would smell terrific. It definitely does. We also find a furry blanket we triumphantly bring back to the group. It's greeted with much enthusiasm. The sense of touch is highly amplified.<br>4:40 Noticing my throat is quite dry. People pass around water bottles. Ice cold water feels amazing going down.<br>5:00 Everyone is wonderful, and they deserve to know it. Someone grabbed a bunch of glowsticks, strings a couple together and begins spinning them in the manner of poi (Hawaiian fire spinning). It's pretty captivating, but not overwhelmingly so. I feel very connected to everyone in the room and suspect they feel the same. Someone proffers a pack of gum and I take a piece. It definitely helps with the jaw tension.<br>5:30 I sit down with my girlfriend and a couple people I don't know very well. They're wonderful people too, and we set into a rambling conversation, sharing deeply personal things with no fear of judgment. It isn't long before I know these people very well indeed. Of all things, someone has found lemon juice and suggests we place a few drops on our tongues. Now there's an interesting feeling.<br>6:00 We sprint down the hall once more to my room to get bubbles. Running feels excellent. I feel light and energetic, but also entirely present. No dissociative effects whatsoever. En route, a friend suggests my girlfriend lead an impromptu yoga class. We agree and while rummaging for the bubbles, I take her hand and let her know I love her and this sparks a brief, serious conversation. I feel so very close to her, but we agree to go back to the group. Time for us, alone, later.<br>6:30 Someone begins a backrub train. Excellent plan, human contact feels incredible; many more hugs are exchanged.<br>8:00 After hours of deep conversation with our new friends, we start our yoga class. 6 of us stand in a circle and my girlfriend leads everyone through a slow, meditative series of poses. Stretching feels amazing and my body is more flexible than it's ever been. I stretch past my feet and touch my wrists to the floor. The atmosphere is relaxed, friendly and talkative. The music (I have no idea what it is. Infected Mushroom?) is the perfect accompaniment. <br>9:20 We wrap up our class and decide to redose once more. I'm definitely most of the way down, but my body still feels good. I take another 120mg and wash it down, as does my girlfriend (perhaps with a little less). We bid our friends goodnight and head off to our room, jumping in bed and sitting face to face. The feeling of connectedness is stronger than ever. We've been having a somewhat rough patch lately (mostly my fault), but my feelings for her are stronger than ever, and I know she feels the same about me.<br>11:30 After a long and deep conversation, with the methylone beginning to wear off, I feel like I did when I first told her I loved her. This woman is amazing, truly so. We'll be together a long time yet. This evening has been so excellent, there's not much more could be done to make it better.<br>11:45 My girlfriend begins to feel some unpleasant comedown effects, a headache and nausea. I feel a little twinge in my stomach, but nothing major. I suggest we take a shower to unwind. We sit down in the warm spray and relax, letting the last of the effects wear off.<br>1:00am Back in bed, I no longer feel the physiological effects other than being a little overheated (common for me regardless of sobriety) but I still feel powerful waves of affection for my girlfriend.<br>2:00 Damn. She has a headache from the comedown and I'm becoming very aroused and sleepless. Kissing and touching her skin feels absolutely incredible, but the bulk of the effects are gone. It's very difficult to climax without her help, but kissing her lips feels highly erotic.<br>3:00 She's gone to sleep and I'm not tired yet (though this is probably due to the late wakeup at around 1pm and not to the drugs). Skimming around online, I decide to write up my experiences.<br>6:00 Not tired at all, but I want to sleep and am totally unable to. This is the only negative thus far.<br>10:00 I wake up from off/on, restless sleep. I feel fairly okay, but somewhat dehydrated. My muscles are a little sore, but I believe it to be induced by overstretching during yoga. A quick caveat, then: you're not quite as flexible and strong as you might think at the time. No real hangover to speak of, other than some lightheadedness, though my girlfriend still has a headache, so perhaps I got off lucky.<br>Overall<br>One of the most pleasant and relaxed drugs I've yet tried. For me, it's not dissimilar to MDMA, but much less insistent and with more feelings of empathy. Everyone becomes a wonderful, beautiful person to me, just as I am to them, and all feelings of tension dissolved away.. Jaw clenching also seemed much less bad, but it's still there to some degree. <br>This was a truly wonderful evening; I got to know some friends much better and improved my relationship with my girlfriend even further (and it was pretty great to begin with.) I appear to not have suffered any ill effects yet, but admittedly my sample size is quite small. The one downside I experienced was the fact that I only slept maybe two hours in total, in 10 minute segments, but that's probably due to the large-ish late dose I took. Based purely on my own experience, a hearty recommendation if you're with a group of people you're friendly with and want to become closer to, or if you want a deep heart-to-heart with someone you're closer to.\n\n\n"
}
