{
 "title": "Simply Good Time Stuff Nothing Deep",
 "author": "emkee",
 "citation": "   emkee. \"Simply Good Time Stuff Nothing Deep: experience with Catha edulis (ID 9937)\". Erowid.org. Feb 26, 2004. erowid.org/exp/9937",
 "substance": "Catha edulis",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "buccal",
   "Catha edulis",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "ID: 9937",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Feb 26, 2004",
   "Views: 15524",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>First news from this exotic drug must have reached me around well I don't know. Back in the day. On tv this subject came up: in dutch train stations in the bigger cities Somali people were selling the drug of their choice 'Khat'. My curiousity was aroused. Not long after this I found myself talking to this Somali guy at the trainstation. He was chewing branches. Language was a bit of a problem. But he was very relaxed and gave me directions to a house where Khat was sold. When I came there they seemed quit suprised seeing  me 'a native' interested in Khat. It must have been quite hilarious. Me coming in the room, crowded with khat chewing/talking man, Somali music on the background,  all lookin at me with this look. And then friendliness. They sold me a bundle of khat which were stems about 2.5mm thick 15cm long, they began reddish getting lightgreen to the top with some leaves on it. They were packed in a banana leaf with some kind of organic fiber rapped around it. </p><p>A few people started explaining how to use it. First of all the stems need to be fresh(very important). Pick a stem begin at the top. Bite it and chew very thoroughly just as much as is comfortable don't overdue it you got all the time of the world. The leaves and softer part of the stem can be swollowed. The harder reddish parts are just chewed and disregarded from the mouth in a civilised way. You keep doing this until you flush it with a sip of  tea or cola which they used because of the caffein content but never coffee!  I personally preferred tea and if I would use khat today green tea would be my choice. The taste is unexplainable most people will find it discusting but real freax (you now who I mean) just find it tasty. </p><p>You're chewing talking and preferably in a group. And slowly while your laughing about this strange custom over the course of a couple of hours your perception has changed. The weed no longer makes us stoned. Another sip of tea and YES. It isn't a psychedelic it is euphoric/empathogenic. Your breath deepens and you tune in on your body rhythms. Another toke of a joint and pass it to one of my friends. Who reaches to it and begins to tell a story. I listen and sink into the couch. On a other occassion me and friend were taken to a squatted house by a female friend of mine I suggested to bring some Khat. It was not the most friendly surrounding to be in. The squatters were a bunch of depressed people completely ignoring us. They seemed stuck in their private little world. But we didn't care we were having a good time anyway. Self esteem seemed raised along with the energy levels. The added surroundings blended very well: as they had space and electrical guitars, making it a playground. </p><p>After a while my body gets vibrant. I get somewhat sensitive to light and colors brighten. Compared with other known substances I would place it between ephedra extracts and MDMA. My friend who was their with me has a history of psychosis. And in the end of the experience when were home he felt his psychic state turn unstable. He was getting sad probably because of the action of the drug. It didn't result in anything harmful but I knew he would never do it again. Most people I know didn't like it or preferred pills or powders. My own personal experience was one of the perfect drug simply good time stuff nothing deep. Good for interacting, doing homework, cleaning up. With others or on solo journeys of self exploration. In my opinion Khat doesn't resemble cocaine and certainly not amfetamines. It's a class of its own. Sleeping afterwards was easy but it seemed like I was floathing above the bed. My mind would center in the frontal region and created spinning rollercoaster effects. </p><p>Its addicting but not uncontrollable (they sold it three times a week). There are very few after effect but they got worse the more I did it, like residue stimulation/shakiness and low enery levels.</p><p>Further I learned the active ingredient in Khat is cathinone and metabolites. It contains vitamin C (a good stimulant detoxifier) along with various minerals like magnesium. It kills parasites in the intestines. But its all a bit contradictional because one source says this the other that. Our national prince 'husband of the queen' stated in an interview he chewed Khat while working in Somalia. On the question if he liked it he just smiled and nodded so you know who is one of the real freax.</p>"
}
