{
 "title": "One Person Content, The Other Sick",
 "author": "Cuntankerous Judge",
 "citation": "   Cuntankerous Judge. \"One Person Content, The Other Sick: experience with MDAI (ID 99394)\". Erowid.org. Feb 25, 2013. erowid.org/exp/99394",
 "substance": "MDAI",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "50 mg",
   "insufflated",
   "MDAI",
   "(powder / crystals)",
   "  T+ 0:05",
   "130 mg",
   "oral",
   "MDAI",
   "(powder / crystals)",
   "  T+ 2:00",
   "400 mg",
   "oral",
   "Pharms - Gabapentin",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2013",
   "ID: 99394",
   "Gender: Male",
   " ",
   "Age at time of experience: 42",
   "Added: Feb 25, 2013",
   "Views: 1479",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Friday, February 22, 2013</p><p>Total Dose  180 mg</p><p>T=00:00 = 5:30 PM</p><p>T=00:00  50 mg Insufflated </p><p>T=00:05  130 mg Oral </p><p>The MDAI was purchased online from the Netherlands (routed through Portugal), and arrived as a white, slightly clumpy, chalky powder. The material was not tested for purity, but other RC purchases from the same supplier provided effects consistent with other reports.</p><p>The idea was to accelerate the experience by snorting some of the total dose up front, as it was nearing dinner and we wanted to have an appetite when the time came to eat. The setting was in a yurt, in a park, with friends.</p><p>Snorting 50 mg didnt burn much at all and wasnt overly unpleasant. It just smelled dry and dusty.  It began to come on quickly but was quite subtle. Typical empathogenic glow. We dropped the 130 mg oral capsule right after and went for a walk through the park and down to the river for sunset.</p><p>Over the next 45 minutes the oral dose came up and joined the insufflated dose, and there was a warm glow not unlike MDMA. At this dose the overall feeling was quite subtle and there was no particular rush or feeling of being over-stimulated, nor was it notably 'magical'. However, conversation was sincere and filled with empathy. It made me feel comfortable in my body and very happy to be sharing the moment with good friends. We sat by the river and talked out the recent loss of a friend.</p><p>Perhaps at about the 1.5 to 2 hour point the effects began to taper off. The come-down was fairly linear and I didnt really feel much in the way of a crack-out. It was simply a sobering-up process with no significant negative effects. I took some Gabapentin as a precaution anyway. I was able to enjoy a chicken dinner at the T=2.5 to 3 hour point and it was delicious. </p><p>Getting to sleep required sedatives 2 hours later, and I awoke to pee in the night and had a hard time getting back to sleep. So all in all I would say MDAI had a fairly significant effect on my ability to sleep. </p><p>The experience overall was reasonably rewarding, if not a bit underwhelming. I dont think this material quite rivals any of the other empathogens, but it is still a worthy substance to have on hand. Higher doses might prove to be more rewarding, and next time Id probably go with a 200 mg minimum starter dose with a 100 mg booster some time after. Interestingly though, I had gone into this experience feeling quite depressed, and on the following Monday I felt rejuvenated and quite happy. Spending the weekend with good friends probably had as much to do with this as the MDAI, but it is still quite encouraging.</p><p>It's important to note that my friend, who joined me in the experience, had a pretty rocky time with MDAI. She wasnt overly impressed with the positive effects at this dose, and as soon as the drug began to taper off she got VERY cracked out and spent the rest of the night curled up under a blanket looking somewhat haggard, crazy and uncomfortable, despite giggling at her situation in a maniacal way at intermittent times. She couldnt eat dinner due to nausea that she said came in waves and she had a very uncomfortable, rocky sleep. She even reported feeling cracked out when she woke in the morning, and she stayed that way well into the next day. Clearly the positive effects didnt justify the resulting negative effects for her, and she said she would be unlikely to want to do it again.</p>"
}
