{
 "title": "Like a Swarm of Locusts",
 "author": "Disorder Bro",
 "citation": "   Disorder Bro. \"Like a Swarm of Locusts: experience with Methoxetamine & 2C-T-2 (ID 99479)\". Erowid.org. Sep 13, 2013. erowid.org/exp/99479",
 "substance": "Methoxetamine & 2C-T-2",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "45 mg",
   "insufflated",
   "Methoxetamine ",
   " ",
   "10 mg",
   "insufflated",
   "2C-T-2"
  ]
 ],
 "footer": [
  [
   "2012",
   "99479",
   "Male",
   " ",
   "17",
   "Sep 13, 2013",
   "Views: 514",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>So here I am again, floating around...just chilling. Seeing the world through the eyes of a dying crab. Freaked at first, but some stony coffin-native comforts me. Shows me the cycle. I kill the crab, eat it, get nourished, live, die, rot, my body feeds the plants, the crab eats the plants, my offspring kills the crab again. Now that that's done...I'm serving drinks to 3 multi-dimensional spacewhores in a bar located in galaxies beyond. I note one has an engagement ring on her finger...and the other, leaves her wallet on the bar stool when she goes to the bathroom. I could take it, and get whatever money is inside, but no. I get good tips. The other spacewhore, the one with the ring, she starts flirting. No, I would never...</p><p>Fuck. It all dissolves into smoke and silver. Confusing, milky, sparkling brain matter before my very eyes. Walking through, manipulating, letting it slip through my fingers. All the memories, all the forgotten times, the walks in the woods, the fights with my little brother, favorite cereals. Dead cat. Dog got hit by a car...fourth grade crush. First detention. That time I pissed myself waiting in line when I was 8. Goddamn, and here it all is again, presented to me, manifested in the form of this swirling silver galaxy of nothingness. I walk through, open my eyes, the curtain above me is just a dot, a giant, gaping, swelling, pulsing electric dot. Thousands of dots, they fade to black as I go back in. Check my heart rate...yes, I'm still breathing. Then the breathing stops as I'm sucked back into the room, the swirling, sparkling, milky room of times forgotten. I see the shame in her eyes, I see the spider dying, I see it making its way across its newly-spun web. Stop, turn around. Headlights. Flashlights. Fluorescent light bulbs swirling into chaotic luminescence become the sun become the nurse checking to see if I'm still alive. What is life? The ability to breathe? To be aware? To choose, to fuck, to eat, to be complete in the arms of another? To gaze bravely into the gaping mouth of the beyond and boldly exclaim that I AM STILL FUCKING BREATHING?</p>"
}
