{
 "title": "A Wonderful Saturday",
 "author": "PsycheSpecialist",
 "citation": "   PsycheSpecialist. \"A Wonderful Saturday: experience with DOC & 25C-NBOMe (ID 99473)\". Erowid.org. Jul 29, 2013. erowid.org/exp/99473",
 "substance": "DOC & 25C-NBOMe",
 "bodyweight": "280 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "  repeated",
   "smoked",
   "Cannabis",
   "  T+ 0:00",
   "2 mg",
   "oral",
   "DOC",
   "  T+ 9:00",
   "425 ug",
   "sublingual",
   "25C-NBOMe",
   "  T+ 15:35",
   "  repeated",
   "oral",
   "Alcohol - Beer/Wine"
  ]
 ],
 "footer": [
  [
   "2013",
   "99473",
   "Male",
   " ",
   "22",
   "Jul 29, 2013",
   "630",
   " "
  ]
 ],
 "report": "<p>I just feel the need to put something down at the moment.</p><p>So at noon I orally ingested 2mg of DOC. First time trying DOC and got an early start due to the long duration. I was at a friend's apartment for the weekend and we planned on tripping that night. I had some 25C-NBOMe for later that evening when that friend, his sister, and another friend would be able to join me, but only had 1 dose of DOC so I figured I would go for a day trip. </p><p>Up until about T+4 or so, I was more or less by myself because my friend was still asleep and his sister was not home.</p><p>T+1:00. I started to feel the rush of the stimulation. The creeping euphoria was slowly increasing and I could tell something was definitely about to happen.</p><p>T+1:45. The euphoria was still increasing and the lighting of the room and colors began to become more pronounced, almost with earthy tones. I was in the living room where there is a glass sliding door that went to a porch outside. The door had brown/tan curtains that acted as filters for the natural light outside and created the earthy tones in the room. It felt very natural and relaxing. I could tell I was about to be in for a ride.</p><p>T+2:30. The CEVs really started to take off. I definitely moved into a psychedelic head state at that point, but it was a very smooth transition. There were times when it became trippier than others, but overall it was fairly clear-headed. I was feeling the vasoconstriction and cold sweats, but it wasn't all that bad. It was definitely more tolerable than 25I-NBOMe or 25C-NBOMe. I experience cold sweats and decent vasoconstriction from both of those substances.  </p><p>T+3:00-4:00. Mild OEVs and very nice CEVs. The body high is very speedy, but not too intense or overwhelming. Very smooth. I started playing some guitar and it felt and sounded amazing. I mainly played some Pink Floyd and some other 70s rock type stuff and it just felt right. Music was so fucking awesome. I could feel every vibration surge through my whole body and it was quite amazing.  </p><p>T+5:00-7:00. Plateaued between hrs 4-5 and kinda had waves of light tripping and visuals from then until about T+6:30-T+7:00 as it began to fade. Everything slowly became less pronounced, and I definitely would have felt comfortable dealing with people probably because I'm used to doing everyday things while stoned, but I was still feeling very stimulated.</p><p>T+7:00-9:00. My friend who was sober except for some weed earlier in the day had to go pick up his sister about an hour away. I rode along with him, feeling amazing, but not much in the way of visuals. However, driving around the city blaring music and singing our lungs out like a couple of damn fools was really awesome. And the lights of the city at night were still more pronounced than they would on a normal night. I was still able to get nice CEVs if I tried to zone out a bit.</p><p>T+9:00. Dosed 425ug 25C-NBOMe sublingually. </p><p>We arrive back to my friend's house, and now the main events we have planned for the night move into action. I thought the DOC would be more intense for a longer time, so I figured by this time my friends would dose the 25c and I would still be going off my DOC. I found this to be not true. I was still quite stimulated but I wasn't really tripping anymore. My friends each took ~1.3mg of 25c sublingually at this time also.</p><p>T+10:00. The 25c is beginning to kick in for myself and my friends. The DOC and 25c definitely have a synergistic effect. I would have been fine to take the full 850ug blotter personally but I couldn't find a lot of info on this combo so I figured better safe than sorry. I'm not sure how to best describe the next 3-4 hours as anything but having a great trip with good friends. I definitely had pretty good visuals off this smallish dose as I'm sure it was working with the DOC I had taken earlier in the day. There was tons of laughing, music, smoking, and tripping.</p><p>T+15:35. I wrote my preliminary report at this time, which is all contained within this report. All I did at the time of submission was add some more details that I remembered and fix some grammatical and verb tense errors to make it flow better. The visuals had subsided and there was slight color enhancement, but not much. I was just basking in the afterglow of a very long and awesome day. My friends were also slowly leaving trip mode and entering the afterglow. We all had a couple beers and were just chilling and smoking.</p><p>I'd say overall this experience was an amazing one. I could see another day like this happening except with maybe 3mg DOC and then a full (~850ug) dose of 25c at T+6-8, depending on how I feel at the time.</p><p>My only beef at the time of writing was still being stimulated off the DOC despite being exhausted and wanting to sleep. Might want some melatonin or a benzodiazepine next time to cut down on the stimulation effect.</p>"
}
