{
 "title": "Field Dispatch",
 "author": "totemist",
 "citation": "   totemist. \"Field Dispatch: experience with Ethylcathinone (ID 99515)\". Erowid.org. Mar 21, 2013. erowid.org/exp/99515",
 "substance": "Ethylcathinone",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "IV",
   "Ethylcathinone",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2013",
   "99515",
   "Male",
   " ",
   "24",
   "Mar 21, 2013",
   "Views: 1170",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>In regards to background I've been an IV heroin user of some four years and a methadone user for around two years. I'm familiar with many psychoactives from across most chemical groups.</p><p>Having seen how few reports there were regarding ethcathinone, I went ahead and ordered some from a reliable vendor.</p><p>The first thing to mention is that people with a greater knowledge of biochemistry than I expected ethcathinone to be more of an agonist at norepinephrine than at dopamine receptor sites, which I feel I can confirm. For me this chemical caused tachycardia, hypertension and peripheral nervous system stimulation long before a 'satisfying' dose was reached. Potential users should be aware of this. </p><p>I started by insufflating some 10mg, then proceeded to titrate an IV dose up to around a total of 300mg. This chemical is comparable to amphetamine, with less euphoria and an uncomfortable, ephedrine-like spikiness. While an increase in motivation was noticed, it was somewhat difficult to concentrate on a single task due to remarked akathisia.</p><p>In a separate experiment I injected a dose of >300mg, during which a resting heart rate of ~120 and hypertension was noted, with an uncomfortable level of stimulation accompanied by diaphoresis and bruxism. Oops.</p><p>I imagine any compulsion to redose with this chemical would be moderated by the uncomfortable side effects, but fiends will fiend. I just hope they've got strong hearts.</p><p>Expect little sleep, even for a stimulant.</p><p>Regards, </p><p>J</p>"
}
