{
 "title": "Seizures and Other Problems",
 "author": "Waldo Planisphere",
 "citation": "   Waldo Planisphere. \"Seizures and Other Problems: experience with 6-APB & MXE (ID 99588)\". Erowid.org. Apr 3, 2013. erowid.org/exp/99588",
 "substance": "6-APB & MXE",
 "bodyweight": "148 lb",
 "header": [
  [
   "DOSE:",
   "  ",
   "insufflated",
   "6-APB",
   "(powder / crystals)",
   " ",
   "  ",
   "insufflated",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 99588",
   "Gender: Male",
   " ",
   "Age at time of experience: 33",
   "Added: Apr 3, 2013",
   "Views: 1740",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThis is a report about some decidedly unpleasant effects from using 6-APB repeatedly in combination with a few other substances for about a week.\r\nFor the most part, we were not measuring our doses of MXE or 6-APB; we just did lines or took gelcaps of it whenever we felt like it. Overall, we were paying a bit more attention to the MXE dosage, since it's more potent than the phenethylamine. Besides these RCs, we were vaporizing Cannabis and drinking. [Erowid Note: Two samples of powder (even of the same chemical) with equivalent volumes won't necessarily weigh the same. For this reason, eyeballing is an inaccurate and potentially dangerous method of measuring, particularly for substances that are active in very small amounts. See related article] \r\nWe followed this regimen for about a week, but before the end we ran out of MXE and began drinking a lot less, so that we were basically just using large amounts of 6-APB. Toward the end of this week, things began to get strange. First, we lost all sense of place. The room we were staying in seemed to us to be located in a completely different building, on a different floor, on an entirely different street of the city. Even the layout of the rooms in the rest of the apartment seemed entirely new and different when we weren't occupying them. The only other time anything like this ever happened to either of us as a result of drug use (or for any reason, for that matter) was from taking lots of Adderall continually for four days in a row, but the 6-APB's version of this effect was much more pronounced. Perhaps this was some kind of phenethylamine-induced delirium, but I shouldn't speculate.\r\nNext came the seizure-like effects. I had trouble swallowing water. My throat would clench everytime I took a gulp, so that it was difficult to drink. My wife began to experience a different sort of negative effect. Whenever she would blink too rapidly, she experienced an aura like that which had preceded amphetamine-induced seizures in the past. She had to hold her eyes shut in order to alleviate it. \r\nAt the end of our delirious week, we ran out of 6-APB. This is when the sleep problems began.\r\nThe partial seizures (self-diagnosed, admittedly) which preceded sleep were the most unnerving negative effects I experienced. As I would begin to drift off, I would suddenly become very much awake but unable to move, with a vision from the dream which had been beginning fixed in my mind. I would be unable to think of anything else or to move any part of my body for what seemed like 30 seconds. This would happen repeatedly whenever I tried to fall asleep, for maybe two nights following the cessation of 6-APB. These experiences were thoroughly unnerving. I would not want to experience anything like them again.\n\n\n"
}
