{
 "title": "Profound Insight Into Beauty",
 "author": "Matt L.",
 "citation": " Matt L.. \"Profound Insight Into Beauty: experience with 2C-E (ID 99580)\". Erowid.org. May 6, 2013. erowid.org/exp/99580",
 "substance": "2C-E",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "oral",
   "2C-E",
   "(powder / crystals)",
   " T+ 0:00",
   " ",
   "smoked",
   "Cannabis",
   "",
   " T+ 8:00",
   "2 tablets",
   "oral",
   "Pharms - Alprazolam",
   "",
   " T+ 8:00",
   " ",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "footer": [
  [
   "2011",
   "99580",
   "Male",
   "",
   "20",
   "May 6, 2013",
   "1190",
   " "
  ]
 ],
 "report": "<p>Drug experiences prior: marijuana, cocaine, benzos, opiates, 4fa, amphetamines, mushrooms, LSD, DO(x), 25i, 25c, 4aco- DMT, mdma, tobacco, alcohol</p><p>Dosage: 20mg </p><p>*I have come to the conclusion that this drug (as well as the other 2c-x chemicals), do in fact have a reverse tolerance.</p><p>The experience shattered my reality, complete ego loss, and left me looking for meaning still a year later of what really had happened. None the less, it was simply in my top 5 experiences of my entire life.</p><p>Set and Setting: I was in my apartment with close friends, and a very neutral setting with all of the essentials- marijuana, trip toys, music. </p><p>It all began with a trip up to see a friend at the state university, and while out dabbling with 2 hits of 25i we came across someone that had this 2c-e chemical. Neither I, nor my friend had heard of such a thing and immediately started researching it. Having heard about Shulgin and all of his attributions to the psychedelic world, we decided to go ahead and indulge in this beautiful white powder.</p><p>*This experience is the day after the initial test trial of 15mg.</p><p>T 0.00: I began to measure out doses of about 20mg each and put them into gel capsules and proceeded to gulp them down with some orange juice with my close friends. After sending the chemical down the hatch, we thought it was a good idea to start smoking some pot to help curb the anxiety and queasiness of the come up.</p><p>T 30.0: It was a general consensus that the chemical was starting to do its job, because like before my stomach was on the verge of throwing its contents up.</p><p>T 45.00: Now this may sound strange, but it seems to be very common in other reports I've read. I began to throw up and cry hysterically, only for a short period of time (about 5 minutes if that).</p><p>T 1.00: After the vomitting and anxiety subsided, I began to feel the true nature of this chemical. Colors were very vibrant, I'll never forget looking at a poster and the colors were changing hues and fading in and out; warping in a serpent motion as if the colors were alive. The colors are alive, everything we take for granted is filled with beauty and life; the untrained eye is just unaware to appreciate it.</p><p>T 2.00: This is where I believe the box that my ego was in, had simply shattered. I remember sitting listening to music (Rise Against specifically) and being trapped in my mind. The room was melting and warping all around me, serpents were crawling out from the screen, divine fractals and lights surrounded me. I was lifeless, my soul was just a molecule with all of these other molecules. </p><p>T 3.00: It felt more than an hour by far, time had shut down. I was in the spirit world now, everything seemed non existent. Looking around at everything, and thinking what is happening? At this point, we had the same general consensus that it was uncomfortable and too much to grasp indoors, so we decided to take a walk to the local 711.</p><p>T 3.25: Walking outside was like being reborn, it was a euphoric change of reality. The wind felt like never before, the clouds looked beautiful, and the fresh air going through my body gave me feelings of content and direction. Lights and sounds were amplified, I could hear cars miles away and see lights in the stars that I never took the time to notice. A divine entity touched down from the sky and reached out with a friendly smile, and it made me feel so very alive.</p><p>T 5.00: At this point everything kind of died down as we went back indoors, and it felt almost like mdma. Just very euphoric and empathetic with those around me, and tracers of geometric patterns and waves.</p><p>T 8.00: Noticing signs of coming down, feeling very worn out and drained. Smoking more pot and taking a couple xanax to help me fall asleep. Sleep came somewhat easily, I was pretty much out until the next day with no real severe hangover or brain toxicity was felt.</p><p>This chemical was very promising, I have yet to touch it again because of the last experience being so profound. But I would love to try its relative mescaline to see what it has to offer. To this day, a year later I'm still left wondering what I encountered and what really went on. I can thank it for giving me profound insight on the sheer beauty of everyday life held within colors and textures that everyone seems to disregard and take for granted.</p><p>I wanted to share about this reverse tolerance, because I would advise doing any of these 2c-x chemicals spaced out with a week or so in between, because tolerance seems to build very rapidly and causes much greater experiences if done frequently.</p>"
}
