{
 "title": "Retrospective Summary of My Experimentation",
 "author": "Truthinnerlight",
 "citation": "   Truthinnerlight. \"Retrospective Summary of My Experimentation: experience with 2C-E (ID 99694)\". Erowid.org. Apr 10, 2013. erowid.org/exp/99694",
 "substance": "2C-E",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   "  ",
   "oral",
   "2C-E",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2013",
   "ID: 99694",
   "Male",
   " ",
   "33",
   "Apr 10, 2013",
   "Views: 696",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>This is not a true trip report but more of a collection of experiences which have marked 2c-e as a very special substance. 2c-e for myself is a rich and rewarding substance. It has allowed me to confront personal issues dealing with depression and anxiety and resolve them with positive emotional development, a very rewarding outcome. 2c-e is very confrontational in this respect and I think this is why so many people do not enjoy it as well as the heavy body load at dosages of 20mgs and greater. I prefer to keep to the very low end of dosages between 5-15 mg. I think too many people have accidental OD's or even slightly too large doses and this is where problems occur. 15 mg's is as large a dose as I care to experience of this substance.</p><p>At this moment I have dosed on 10 mgs of 2c-e. Pleasant light euphoria experienced after 1 hour of dosing. Closed eye visuals for the most part but colors are shifting and melding. Some muscle tension and nausea are experienced during the come up and come down phase of the experience but are quite mild at these dosages for myself. </p><p>This is not a party drug for me nor is it like an MDMA experience. It is far more insightful in my opinion than LSD. </p><p>Also noted are excessive mucous production at the higher dosage levels I have experimented with 25 mg's - 40 mg's. Being Asthmatic this tends to become very unpleasant, even scary. 40 mg's required a dosage of 3 mg's of xanax to reduce muscle tension and heart rate/BP. Open eyed visuals and one of the heaviest body loads of any drug I have experimented with ... which would cover most of PIKAL and TIKAL plus a wide variety of other natural and synthetic substances. Indeed the only drug I have never used nor would use is datura as this was used by women in Polynesian society to get rid of undesired pregnancy and Native American desert tribes to poison the wells of enemies... </p><p>Enjoy 2c-e but be safe ... I'd recommend starting low and building up from there.</p>"
}
