{
 "title": "A Case of DOI Anti-Inflammatory Action",
 "author": "Dr. Thurston",
 "citation": "   Dr. Thurston. \"A Case of DOI Anti-Inflammatory Action: experience with DOI (ID 99701)\". Erowid.org. Apr 5, 2013. erowid.org/exp/99701",
 "substance": "DOI",
 "bodyweight": "260 lb",
 "header": [
  [
   "DOSE:",
   "3 mg",
   "oral",
   "DOI"
  ]
 ],
 "footer": [
  [
   "2012",
   "ID: 99701",
   "Female",
   " ",
   "Age at time of experience: 40",
   "Added: Apr 5, 2013",
   "Views: 843",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>summary:</p><p>DOI - relaxing, opening mind-body connection, reduces inflammation and nervous twitching - increases flexibility. Experience is understandable, controllable, allows her to do things physically and be more sociable, understands metaphysical stuff better due to psychedelic experience. Prefers this to pharmaceutical pain meds and helped her get off of 60mg morphine per day.</p><p>I know of a case of a woman who has benefitted unilaterally from the therapeutic use of DOI. She is suffering from the consequences of a broken neck at age 2 and mishandling of the situation by medicine 40 years ago, including the use of iffy sites near the sciatic nerve to take bone grafts from and over-tightening of a neck brace causing diffusion damage to the temporal, parietal, and occipital lobes. It has caused astrocytes in the neck region and two sites near the sciatic nerve where bone grafts were taken out of the pelvis. Recently DOI has been shown to have anti-TNF-a properties. (1) She's ahead of the curve in this respect, because I believe it to be this that is responsible for the enhanced flexibility and reduction in nervous twitching considering that astrocytes produce TNF-alpha. (2,3). </p><p>Mentally, this psychedelic seems to help her cope with the consequences of the overtightened neck brace and various issues stemming from the abuse she underwent. Not only has DOI been psycholytic, I suspect that it may promote neurogenesis in the damaged regions. At one point, a very profound healing took place when a memory came forth of being in the hospital at 2yr, right after reporting an odd sensation in the affected area near the temporal lobe. This bears further study.</p><p>(1) http://en.wikipedia.org/wiki/2,5-Dimethoxy-4-iodoamphetamine#cite_note-4</p><p>(2)http://www.ncbi.nlm.nih.gov/pubmed/2109008</p><p>(3)http://stke.sciencemag.org/cgi/content/abstract/sci;295/5563/2282</p>"
}
