{
 "title": "Completely Engulfed Into the Human Condition",
 "author": "Quintillius",
 "citation": "   Quintillius. \"Completely Engulfed Into the Human Condition: experience with LSD, Ketamine & 25I-NBOMe (ID 99842)\". Erowid.org. Apr 19, 2013. erowid.org/exp/99842",
 "substance": "LSD, Ketamine & 25I-NBOMe",
 "bodyweight": "75 kg",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)",
   " ",
   "  repeated",
   "insufflated",
   "Ketamine",
   "(powder / crystals)",
   " ",
   "  ",
   " ",
   "2C-I-NBOMe",
   " "
  ]
 ],
 "footer": [
  [
   "2013",
   "99842",
   "Male",
   " ",
   "19",
   "Apr 19, 2013",
   "1408",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I will preface this by saying that I have had numerous experiences, with psychedelics and dissociatives, this was, however, my first experience with LSD.</p><p>I had, had numerous experiences tripping with other people, and although the social loops where often entertaining, I found myself unable to complete delve into the trip. I wanted to have one last trip, the one trip to rule them all.</p><p>I finished my paper, and took two tabs of acid. I bumped the ketamine in careful doses over the course of the trip. And took the NBOME when I wanted to completely melt into the blackness. This was to be an extraordinary journey, from which I would not be able to escape (primarily because my friend had taken my keys without me noticing, and I didn't want to call people at 3 AM with a head full of acid, having lost my keys).</p><p>I closed the lights and put a mattress in my living room, I fed the cats, and put on an 8 hour long playlist consisting largely of apollo by brian eno, and stars of the lid. When I finally did take the last bump of ketamine closed my eyes, and lied down, I could feel myself falling through multiple layers of soft enveloping blackness. I forgot myself, and experienced suffering and joy thousandfold.</p><p>The trip jumped through time and space and I saw numerous scenarios playing themselves out around me. I experienced killing native americans with a colt from horseback, and having my children killed by white skinned invaders, with strange weapons I didnt understand. I was both the perpetrator and victim of every single act of evil, but also of every act of kindness. I saw the girl I fancy being shredded in half by a circular, and I saw POW's returning to their families.</p><p>I felt like I was rocking a newborn with my left hand, and hunting slaves with a rusty spear with my right. I experienced countless events from all across history, all playing themselves out with me in the middle of them. Human nature showed all of its faces to me. I felt like I understood. No longer did I feel part of some small brotherhood of people with whom I could relate, people like me. But instead with all of humanity, with this extraordinary species, with all of our pain and malice, kindness and joy. Across history, the drops of causality, the actions of every single human being, had made the well stir in that exact fashion that created me.</p><p>I could see at my feet what I can only describe as a giant black vagina/flower, through the floors I could see the flowers of the people in my apartment. And I could see the tubes, the tubes that led to the singularity, which manifested itself as a giant tree. I knew that everything was a result of everything else.</p><p>Towards the end my brain let me have one single scene of pure unadulterated awesomeness, void of any imminent philosophical implications. I was standing on top of a cliff, at the bottom of which, only a few feet of sand separated the almost vertical wall from the ocean. I looked out over the endless waves, and from behind the sun an eagle appeared. I drew the string of a bow I didn't know I had (Kyodo style of course, holding the bow above my head, pulling it down and drawing the string, and then releasing, all in one swift motion) the arrow flew, and it was as if the air held it's breath in anticipation. While mid air, I felt the gravity of the world shift towards the arrow, suddenly the cliff was horizontal, immediately acknowledging this, I jumped into a diving position. Speeding through the air at terminal velocity, the arrow pierced the heart of the eagle only a split second before I caught it. Holding the eagle and the arrow, my ballistic arch gradually fell, and I broke through the surface of the ocean, barely stirring the surface and still holding my prey.</p>"
}
