{
 "title": "Amplified Hate",
 "author": "dearpsychonaut",
 "citation": "   dearpsychonaut. \"Amplified Hate: experience with Methoxetamine  (ID 99858)\". Erowid.org. Apr 30, 2013. erowid.org/exp/99858",
 "substance": "Methoxetamine ",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "50 mg",
   "sublingual",
   "Methoxetamine ",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2011",
   "ID: 99858",
   "Gender: Male",
   " ",
   "Age at time of experience: 19",
   "Added: Apr 30, 2013",
   "Views: 2138",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>Background:</p><p>A few years ago, I had some interest in diving into the dissociative realms of psychedelics. Ketamine was nowhere to be found, PCP isnt something I was ever interested in (probably due to its stigma), and at the time not many legal analogues were at my disposal. After some research, I found out about MXE, and I quickly procured a gram for myself and friends. </p><p>At the time I wasnt super experienced with psychedelics, and very inexperienced with dissociatives. I had done mushrooms, 4-aco-dmt, LSA, 2c-t-2, along with mxes cousin DXM, but I believe that was about it at the time. I didnt care for dxm, it made me depressed and lonely. I couldnt even stand listening to music. It pretty much felt like a drunken depressed stupor to me. </p><p>When I received my gram of MXE I weighed it up into 50mg capsules for myself and if any of my friends wanted some. At the time I wasnt fond of snorting things and decided a sublingual dose would be best. I tested a 20mg nasal dose to feel for the waters and just felt a bit drunk. A few days later I decided to take the 50mg dose under the tongue and delve into the waters of the dissociative territory of the collective unconscious.</p><p>Setting:</p><p>I was in my apartment on a late night, messy house but it always was. The MXE filled capsules were waiting for me in their usual hiding spot and I was pretty bored. Just sitting on the computer finding people to troll or people to talk to, and researching a bit on MXE. Pretty average night. </p><p>The Trip:</p><p>I took a gelatin capsule and put it under my tongue, and decided to let it sit for about 15 minutes. This stuff tastes like pure chemical shit. Something that you taste and think woah, thats probably not supposed to be in my body. I dealt with the taste (which after further experimentation with chemicals I realize isnt all that bad) and let it sit until the bottom of my tongue was pretty numb, without swallowing my spit. After 15 minutes I swallowed the chemical and the half melted capsule. </p><p>At this point my body was a bit loose and a bit drunken. My mind started to close a bit as if I had a few beers and it was pleasurable. I walk around a bit and find it slightly difficult, and the drunken feelings are definitely intensifying. The more I walk around my apartment the more I realize Im not just in for a feeling of being high, but a definite trip and full blown night. </p><p>Im about to step outside for a cigarette and I notice my first distinct difference between MXE and alcohol. Visuals. Not swirling fractaline beauty like on traditional psychedelics, but my normal vision waving and appearing somewhat liquid. It was pretty strange that the physical world seemed to soft and flexible.</p><p>I finally get outside and light up a cigarette. Im sitting on a wooden  outdoor staircase on my upper apartment looking down the stairs. There is a railing to my left and a yellow wall of the house to my right. As I smoke the cigarette my mind gets stimulated, I get more nauseas and I get a slight headache. I notice the wall of my house and the railing are both waving, as if the wind were pushing them. They wave more and more the longer Im out there and eventually they meet each other and jiggle sort of like jello together. While this was interesting my body wasnt feeling too good, and neither was my mind. I was worried, and extremely annoyed at every last thing in the world. </p><p>I get in the house and decide to lay down and wait out the trip. First I feel the need to vomit, and I walk into the bathroom and puke up some laffy taffys I had eaten earlier in the day. Bright green and red vomit, oh so appetizing. After the puke session is over I make the amateur mistake of laying in the dark while Im not feeling so hot. I start to feel an immense dissatisfaction with my life and everything that is going on in it. I cant stand anything that Im doing with my life or where it is going. Im crazy depressed and I hate my life. </p><p>My mind is going insane, I decide silence is too much, and I grab the first bit of music that I can find. The Gin Blossoms CD Ive had since I was a kid. While sober, I dont mind them, but dont love them. On MXE it was fucking horriblethe worst music I had heard in my life. Every last bit was disgusting and annoying. </p><p>I dont know how, but I eventually fell asleepand I really dont know how. My entire mind was full of hate and angerI hated everything. There was no pleasure in life or in the experience. </p><p>Post Trip Thoughts:</p><p>I dont like dissociatives, they put me in a bad place. While I was depressed and it was a bad time to partake in such an experience, the experience itself I cant see in a positive manner. I worked out a lot of my issues and even now dont want to go down that path again. Some people love dissociatives, Im not one of those people. Ill try ketamine one day, but thats about it.</p>"
}
