{
 "title": "Tripping With the Clouds",
 "author": "Scarecrow",
 "citation": "   Scarecrow. \"Tripping With the Clouds: experience with Morning Glory (ID 99909)\". Erowid.org. Dec 9, 2013. erowid.org/exp/99909",
 "substance": "Morning Glory",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "400 seeds",
   "oral",
   "Morning Glory",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2012",
   "99909",
   "Male",
   " ",
   "20",
   "Dec 9, 2013",
   "838",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "<p>I decide one afternoon to go buy some heavenly blue's because I read that they can cause some LSD-like effect. Went to the store and made my purchase of 4 packets of seeds each containing 100 seeds. I know that most garden supply stores they look out for this kind of purchase (but honestly they can't stop me from buying plant seeds), so the clerk was curious as to why I was buying so many seeds of one type, but I just said my grandmother couldn't get out to the store to get her favorite flowers to plant. After this heart waring lie the clerk said I was a nice young man for being so considerate of the elderly and finished the transaction. Little did she know I was really just going to eat them as soon as I came home.</p><p>10:30. As soon as I got home, I put the seeds in a mason jar with hot water and dish soap and agitated them. I repeated this process twice rinsing the seeds off soap. This is important because most seeds are coated with an agent that will make you vomit. I have never seen those packs with warnings so anyone could just check the label first. Also this get any other debris that might make you nauseous. Next I tried to find a way to grind them up. This is also important because eating the seeds whole yields little to no effect. I chewed a couple seed to see if that was an option, but they tasted foul. After that I realize a good option, I just put the seeds in a magic bullet and ground them into a good powder.</p><p>11:00. With the powder good to go I put the powder in a glass of water and drank the whole thing. It was kinda nasty but was not a long lasing taste in my mouth. I made sure I had also eaten a meal before hand since I had heard its impossible to hold down the seeds on an empty stomach.</p><p>11:20. Now I am starting to feel nausea and was afraid I might actually vomit. I started chewing some mint gum since mint helps with nausea and that actually helps greatly.</p><p>11:45. The effects of nausea start to fade and I could feel the LSA. My pupils started to dilate so I knew I was starting to come up.</p><p>12:30. At this point I feel very weird and felt that I that I would slur my speech if I started talking. From this point on my mood starting lifting and I felt relaxed. I was getting a good amount of energy too and there is no more nausea. I decided to just go outside for fresh air and notice how awesome all the colors out there seemed to be.</p><p>13:30. I am getting closed eye visuals and everything seems extraordinary, even just simple items around the house. My yard was like a jungle that I could explore. It was like seeing world for the first time enjoying and nature was so beautiful. It would have been very easy to just stay outside and take it all in, but I had other obligations.</p><p>14:30. My girlfriend picked me up to go out to her pool. The car ride there was really interesting, I just kept talking and playing upbeat music. My girlfriend thought that my amazement of such simple thins was hilarious so I was in a very good mood. This put me in such a energetic and relaxed state. The sun felt so amazing and watching cars on the road driving was awesome too. All the colors of the world were so much fun to look at because they seemed perfectly defined and vivid.</p><p>14:45. I got in the pool and the water was a very euphoric. I felt as if I was connected to everything around me. Soon I hopped on a tube and just laid in the water watching the sky and it was so amazing. My ears were underwater and the only thing I could hear were obviously auditory hallucinations. The clouds would make cool shapes and the sunlight coming through the clouds was the best thing to stare at not staring right at the sun of coarse. This was the peak of my trip.</p><p>15:30. After I had floated around a while we left the pool and my effects from LSA were not as strong. The sunset was still mesmerizing and I could see the rays out of it very vividly.</p><p>15:45. I started to feel kinda tired and even though I hadn't eaten all day I was not hungry at all except I kept eating candy. At this point I was enjoying the relaxation at my house watching TV.</p><p>17:00. I'm very tired and feel worn out and after sitting down I was really calm. The effects are almost gone. I laid down and just had a good feeling of relaxation. The rest of the night I just relaxed around the house and occasionally would get some feelings of the LSA and eventually fell asleep.</p><p>8:00. The morning after when I woke up my muscle were kind of sore and I all around felt crappy. I noticed that I had pinpoint pupils. Also my face was a little pale. This lasted throughout most of the day but eventually when away. The next day I felt fine and couldn't feel effects.</p>"
}
