{
 "title": "The Pure Hallucinogen",
 "author": "termite",
 "citation": "   termite. \"The Pure Hallucinogen: experience with Salvia divinorum (ID 9996)\". Erowid.org. Jul 12, 2005. erowid.org/exp/9996",
 "substance": "Salvia divinorum",
 "bodyweight": "120 lb",
 "header": [
  [
   "DOSE:",
   "0.125 g",
   "smoked",
   "Salvia divinorum",
   "(extract - 5x)"
  ]
 ],
 "footer": [
  [
   "Exp Year: 2001",
   "ID: 9996",
   "Gender: Male",
   " ",
   "Age at time of experience: Not Given",
   "Added: Jul 12, 2005",
   "Views: 3125",
   "[ View as PDF (for printing) ] [ View as LaTeX (for geeks) ]\n[ Switch Colors ]\n"
  ]
 ],
 "report": "\n\n\n\n\nThe three people living in my flat this year are all experienced drug users. We have all tried ecstasy, acid, and anything else we could get our hands on. At the end of last year, we ordered some s. divinorum leaves and sat around for a smoke. It was fun, we felt light and all that, but didn't think a huge amount of it in comparison to 'real' hallucinogens. Just for the hell of it, we decided to order some 5x extract the other day. It arrived yesterday evening and we all sat down for a smoke. The first round didn't do much: we felt light again, the same as last term. This was on about 1/12g each. We decided to increase and took 1/8g each. <br>Now this was different. In fact, it was probably my most powerful singular drug experience. After holding the smoke in and putting down the bong (apparently, I'm not sure I remember this), reality switched to something completely different. I was sitting on a bus, or plane waiting to go on a trip. It was bright daylight (7 pm in 'real' time, dark outside in the 'real' world), and I was really looking forward to this journey I was going on. There was a very strong awareness of people sitting somewhere ahead of me on the vehicle, but I did not actually see them. I somehow got pulled upwards, it was quite hard to move. I looked to the left side of my body and seemed to be dragging a world along my left foot. This was very hard and I had to move my left foot slowly whilst the right one moved normally: it's rather hard to drag a reality around when it's attached to your foot.<br>I was not aware I was in a room, or in this country, or anything else for that matter. According to my flatmates, I was babbling incoherently for a while, but my words seemed totally clear to me. Slowly the reality of the coach trip faded away via my left side and things began to return to normality. I couldn't say much for a while, I was rather overwhelmed. I mean, I thought this stuff may be rather strong, but I wasn't expecting the total switch in realities. With acid, you always have some awareness that the 'real' reality in some vague way exists. With Salvia, you don't. The experience is real, you've been living it all your life and that's that. This is a very, very powerful drug.<br>As for my flatmates: shortly afterwards, I came back into the living room after attempting to babble out something of what I was feeling just a few minutes earlier in the kitchen, I saw one of my other flatmates (let's call him A.) bouncing up and down on his knees, laughing hysterically and constantly asking me if I had 'started building on the island in the middle' yet. Turns out A. was seeing himself as a hamster running around a wheel, this wheel had some sort of island in the middle and in order to keep sane, he had to make sure I was building something on this island. A. is probably the heaviest drug user in the house, and I have not seen him act like this on any other drug. I can't emphasise enough how real this thing is. There is no awareness of 'normality'. It just isn't there, in any sense.<br>Anyway, a while later, while A. and I were returning to normal and talking about 'the most profound drug experience ever', J. came in from the kitchen, turned on the TV and grabbed the bong, not really believing a word we were saying. He loaded up the bong, sat down and took a hit. We sat and watched as he struggled physically against empty air, crying out and waving his arms and legs everywhere. This was not usual behaviour from him, usually being very calm and at least somewhat with it on most drugs. When he could speak, which took some time, we heard the story over and over: he was trapped in a spinning wheel, only being aware of reality when it spun to a certain point. Every time the wheel hit this point, he asked us if this was real, if we had gone to the same place and other such questions. He then made the mistake of looking at the TV screen. There was a program on about a hospitalised boy about to undergo an operation on his leg. J. felt himself being drawn into the television, unsure of what would happen once he was in there: he was sure he was the boy and didn't know what he would do if his leg was being operated on, it was just too real. J. physically struggled to get out of the TV. It seems anything as active as a television is not a good thing on Salvia. The environment needs to be calm. J. was not expecting anything of the sort to happen, and was very scared during the trip. I wasn't scared, but rather more curious, perhaps slightly apprehensive. It took some time for each of us to realise that we were in a room, that reality had changed and then changed back.<br>Salvia is a pure hallucinogen, and has changed my perceptions on psychoactives, perhaps even on life in general.\n\n\n"
}
