{
 "id": 1,
 "title": "Make Sure the Music's Not Too Complex",
 "date": {
  "submission": "2001-07-27T07:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "Alex Mahorn",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>This was the first experience that either my friend or I had had with salvia, and we had his housemate check up on us every 30 minutes or so to see that we were ok.",
  "We tried to smoke up at about 9:45, but we had some difficulty, mine came from general inexperience with a bong. (I'm used to joints, sorry) After getting maybe 2 solid hits, and my friend getting maybe 4 or 5, we lay back and waited for the effects. All we felt was a mild pulsing at the top of the forehead, and for me, at the bottom of my chin, as well as a very warm feeling. After about 30 minutes of waiting, we decided we'd missed our window, so we decided to try again in a hour. We sipped some white wine, and smoked a tiny bowl of weed, perhaps about 3 hits a piece, then we tried the salvia again.",
  "This time, the effects came and no mistake. I took about 6 hits, and then I lay back on the ground, I don't remember waiting for the effects to kick in. By the time I got the fourth one in, I was feeling it. It reminded me of the first part of an acid trip - millions of thoughts at once, they all tail off as if someone was holding them at one end, and burning them at the other. You have no sense of time, the sheer volume of thought, the recursiveness of the thoughts - by that I mean the repeating, connecting quality of them - totally shut you off from time.",
  "I tried to describe what I saw, but got nowhere. Then I couldn't remember if I had even tried to describe it to my friend, I sat up, or did I? I asked if I sat up, or did I? I had no idea then, or now, how many times, the next morning my friend said it was at least once.",
  "He was not getting as high as I was, so he loaded the bong up again with salvia, and started taking hits, one so big it made him puke. While he cleaned that up, (and retched some more) I think I got a couple more hits out. So all in all, I think I had eight hits of salvia,  maybe 5 or 6 hits of pot, and about a glass and a half of white wine.",
  "An hour seemed to take forever, and the effects only wear off very subtly and gradually. After another hour and the most intense effects had seemed to have subsided, we ate and talked for awhile, and conversation was not impossible, a bit difficult, but enjoyable. In the last two hours I was very into drawing and writing, free association is SUPER-easy on salvia. We went to sleep at about 1, and I was still feeling the halved-chopped memory effect. One crazy thing about this stuff is that it let me seek sleep much easier than acid. I think that has a lot to do with the hypnogogic quality of the closed-eye imagery.",
  "Due to the pure knock-out effects- by that I mean, time investment- weed or booze lets you drive quicker- I can't see doing this every day, and I think the deep qualities of salvia are probably something you get after more experience with it. This first time was just overwhelming and to be honest, I really wasn't looking for some huge metaphysical experience. I got pretty much what I wanted. Its different from acid (imo) in that its much milder as far as being in control. I wouldn't want to do acid more than a couple of times a month, maybe, but this, I could see maybe doing once a week. Acid seems to let you shove stuff to the left of your mind, to demand of your brain to stop thinking about something for a WHILE. It may pop up again tho?now, with salvia, you'll probably not remember too much about what you were thinking a minute ago, and if you think about anything too long, ie; 5 seconds, it'll just splinter and fracture into several other, related thoughts, which further fragment.",
  "What did I learn? Hmm, its a cliche of quantum theorists and the like that time is an illusion, but this stuff will definitely cure you of the idea that its a cliche. You seem to experience everything 4 times as much. Music gets an endless sort of remix quality, and the difference between memory of occurances and memory of thought is all but disintegrated. About music- you may wish to pick something that doesn't have a lot of changes, or dynamic shifts. lovesliescrushing fit nicely, enough changes to make incredible facets, but no so many that it overwhelms you-which another, much different record (i forget the title, but it was some sort of psychpop that had too many changes and textures) did. dub music is also highly recommended, we had some Adrian Sherwood thing on and it was perfect.</p>"
 ],
 "erowid": {
  "id": "100",
  "citation": " Alex Mahorn. \"Make Sure the Music's Not Too Complex: experience with Salvia divinorum & Cannabis (ID 100)\". Erowid.org. Jul 27, 2001. erowid.org/exp/100",
  "substance": "Salvia divinorum & Cannabis",
  "views": "12760"
 }
}
