{
 "id": 10004,
 "title": "An X Panic From Hell",
 "date": {
  "submission": "2000-10-05T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Aiwa",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Ok... this being my second time taking X I was fairly excited by the thought that I would have the same breathtaking experience that was present the weekend before. How wrong I was. I had been told that this kind of X was very stong and knowing that brought on a little apprehension but more curiosity than anything. But the thing was that that night I was short on cash, so being at a rave and all meant water cost an arm and a leg and I was dead broke after E and the door fee. This also brought on a sort of eerie feeling knowing that the only reported deaths on E were from over dehydration and heat exhaustion.",
  "I took the small red triangular shaped pill at about 9:30pm, feeling the euphoric effects about 30 minutes later. It was pretty much the same as before except I was only 5 minutes into the trip and already feeling the effects stronger that the peak of the pill I took before. What happend next is very hard to describe but I'll try my best. All of a sudden I noticed my heart was about to beat out of my chest and I found myself drenched in a hot sweat. Soon I found my mind running with intese thoughts that sent me into a panic I could feel throughout my whole body. Kind of a sharp warm feeling that wasn't pleasant at all. I thought if I stopped dancing and sat down it would go away. I was wrong. My mind was totally out of control, so I got up and headed to the bathroom to splash some water on my face. When I got up I felt a sort of extremely drunk sensation as I tried to walk (oh, and I forgot to add that during this whole time I had extreme jitters and I lost the feeling of what I was touching).",
  "But, somehow I made to the bathroom where I splashed water on my face, then I went back to sit down with my friends who had all consumed the same pill and seemed to be having a great time dancing. Soon this panic passed after lots and lots of deep breaths and self talk, and after I felt drained of all energy and plopped down next to a wall. The feelings that followed weren't exactly unpleasant, but I seemed to keep that state throughout the whole night.",
  "I think E is a great drug, but I'm afraid to do it again because of the bad effects it put me through."
 ],
 "erowid": {
  "id": "602",
  "citation": " Aiwa. \"An X Panic From Hell: experience with Ecstasy (ID 602)\". Erowid.org. Oct 5, 2000. erowid.org/exp/602",
  "substance": "Ecstasy",
  "views": "12049"
 }
}
