{
 "title": "Lost and Found",
 "author": "veritasliberabit",
 "citation": " veritasliberabit. \"Lost and Found: experience with 4-AcO-DMT (ID 100008)\". Erowid.org. Apr 30, 2013. erowid.org/exp/100008",
 "substance": "4-AcO-DMT",
 "bodyweight": "",
 "report": "<p>Been feeling a lack of motivation of sorts. Lately just lost in distractions, forums, video games. I have plenty I should be doing, but that sense of drive, urgency, passion ... just wasn't there. Taking to drink more than I care to admit.</p><p>Enough was enough. I'd tried this one before at a lower dose (20mg, oral), and it was great. Flights of ideas, novelty, awe, introspection. But nothing close to what I had in store this time.</p><p>Injection complete. I laid down and stared at the ceiling. Slowly the stucco starts creeping, and melding, and breathing. I put on my headphones and turn on a playlist of Shpongle. I'm not that into music, but I figured I'd have something for this trip. A brief inquiry online indicated that Shpongle was nice. And how right they were. 'Divine Moments of Truth' began playing, and I quickly lost myself to the music. The drug taking hold, reducing me to a pool of a madman.</p><p>By the second track however, something was off. I felt discomfort, desire to turn off the music, close my laptop. I wanted silence, but that was the last thing I got. I was bombarded with sounds.. the most curious of which. Like a flurry of quick phrases, in both English and my mother tongue. I felt sick, poisoned. I heard the voices ask me if I'm okay, talking amongst each other, almost as if I were in a hospital ward.. fighting for life. A near death experience it seemed like. I longed for silence, for it all to stop, thinking I'd made a mistake, this was it. I looked at the time and only 20 minutes had past.. oh dear.</p><p>I cowered trembling under my blanket, fighting for life, just trying to pull through. And yet slowly but surely I began to regain myself, listening to the entities get quieter. And that's when I when I had an explosion of thoughts. Language could only begin to describe them. A multiverse theory, except I was the god. It was all just a computer program, my ideas only further to make the program better. It all fit into place, I had all the time in the world. There was no time, death was just a recursion of the program, a newer version. I was the universe experiencing itself. But what is the point then? Well, to explore.. To Improve. And suddenly having lost the constraints of mortality I began to make notes, plans, meanings. I felt alive.. alone, yet purposeful. I could do anything I fucking wanted.. within reason of course. There were rules to the game.</p><p>The whole ordeal was reminiscent of a short story I read, 'The Egg' by Andy Weir. Most recommended.</p><p>As the tryptamine grip slowly dissipated, the jawed menacing faces turned benevolent, and dissolved back in to the darkness from whence they came. It was over.. yet I was touched. Not something I shall soon forget.</p><p>I don't usually write. But as I lay smiling, feeling learnt and reborn, I felt driven to share the experience. Make what you will of it.</p>",
 "year": "2013",
 "id": "100008",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2013-04-30T07:00:00.000Z",
 "views": "1169",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "IM",
   "substance": "4-AcO-DMT"
  }
 }
}
