{
 "title": "Strong but Calm: A Theraputic Endeavor",
 "author": "sal america",
 "citation": " sal america. \"Strong but Calm: A Theraputic Endeavor: experience with 2C-P (ID 100048)\". Erowid.org. May 6, 2013. erowid.org/exp/100048",
 "substance": "2C-P",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "6 mg",
   "oral",
   "2C-P",
   "(blotter / tab)",
   " T+ 0:30",
   "0.5 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>In preparation for this trip I cleaned my home thoroughly (a personal proclivity but one that I think improved the experience), took care to prepare food and water and notepads and prep myself by stretching and showering and sleeping.  I woke up, had breakfast and coffee, then dosed an hour later.  My dosage decision was an attempt to have a strong but controlled experience, with a preference for underwhelming instead of overwhelming errors. </p><p>- 730am: 6mg 2C-P, orally on blotter</p><p>- 8am: .5mg Xanax</p><p>- 9am: Body load beginning, not uncomfortable but restless</p><p>- 930am: Color enhanced, mood: uneasy- but acceptably so</p><p>- 10am: Sense that 'the psychedelic has begun', not too strong but into '1' territory</p><p>- 1045am: '2' apparent, a sense of accepting the experience while still waiting to find out what the trip will be about, listening to relaxing music and thinking.</p><p>- 11am: What some other reports described as the 'waves' of the experience, I would further clarify into a) slight pulsation effect of light in the peripheral vision b) a sense of the trip experience as alternating periods of'2' and then '1' and then '2' and so on- the waves in this way referring to the strength of the trip</p><p>- 12pm: Heavy headed, low '3'</p><p>- 1230pm: OEVs are here to stay, pulsing and somewhat thought controlled, CEVs very strong, external sound/mood causes sifts in imagery and color. I am having some coffee to compensate for lethargic effects. Tried some strawberries for kicks, but the tangy-ness was transferring to other sense modalities and this was unpleasant. </p><p>- 130pm: A plateau has been reached, a calm acceptance and a sense of sure</p><p>footing with the trip.  I've taken some small excursions out from my home, and am preparing to head off on a walkabout</p><p>- 230pm: Returned from a long and lovely stroll.  No issues dealing with</p><p>others, high euphoria to be out on such a beautiful day, leisurely pace was pleasurable.  Sense of smell was improved and pleasurable, visuals present but not intrusive, except that color enhancement made human faces (including my own reflection) a bit lurid.</p><p>- 3pm: I realize that I am tired from the walk and sun, ate  an avocado, and some health supps. (astaxanthin, Mg, fish oil) and had some herbal tea.</p><p>- 5pm: I have been comfortable lying down, in and out of semi-sleep/trance, relaxed and enjoying the serenity of my home and the company of my dog.</p><p>- 6pm: OEV still present but mild, the experience has moved from a low '3' to a '2'</p><p>- 7pm: Down to a '1', feeling tired and heavy, visual stimulation pleasant but mostly CEV, sense of serenity is the main trip now.</p><p>- 8pm: visuals close to kaput.  Some tracing still, color enhancement, but no longer 'psychedelic'</p><p>- 830pm: Used some MJ tincture to see if there would be any affect on the dwindling trip, did not find that there was any gain in this that would not be accounted for by the MJ</p><p>- 9pm: The trip is over.  I am heavy but not sleepy.  I will take a bath and then go to sleep, but (as I now know)I will have difficulty staying asleep.  If I could go back I would have taken a sleep aid.  In the morning I will feel fine, not inordinately sore or tired, but sadly lacking that lingering glow of some experiences. </p><p>I would definitely recommend at the below-10mg mark, the trip is fun and manageable, the setting was integral: I would not recommend a night trip as the visuals are pulsing/squirming and the images and sensations experienced were strongly influenced by the external environment.</p>",
 "year": "2013",
 "id": "100048",
 "gender": "Male",
 "age": "26",
 "timestamp": "2013-05-06T07:00:00.000Z",
 "views": "1030",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "6 mg",
   "administration": "oral",
   "substance": "2C-P",
   "form": "(blotter / tab)"
  }
 ]
}
