{
 "id": 10019,
 "title": "Unable to Relax, Irresponsible Drug Use",
 "date": {
  "submission": "2007-01-29T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "howless",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": " T+ 1:00",
   "administration": " ",
   "substance": "smoked"
  },
  {
   "time": "Cannabis",
   "amount": "",
   "administration": " T+ 3:00",
   "substance": " "
  },
  {
   "time": "oral",
   "amount": "Alcohol",
   "administration": "",
   "substance": " T+ 4:00"
  },
  {
   "time": "0",
   "amount": "insufflated",
   "administration": "Cocaine",
   "substance": ""
  },
  {
   "time": "0:00",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": " T+ 0:00",
   "administration": " ",
   "substance": "oral"
  },
  {
   "time": "Unknown",
   "amount": "(powder / crystals)",
   "administration": " T+ 7:00",
   "substance": "1 tablet"
  },
  {
   "time": "oral",
   "amount": "MDMA",
   "administration": "",
   "substance": " T+ 0:00"
  },
  {
   "time": "1 tablet",
   "amount": "oral",
   "administration": "MDMA",
   "substance": ""
  },
  {
   "time": "14:30",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Though this may sound like a rediculous and iresponsible combination of substances, it was over a period of 12 hours and at a student party with friends and strangers and I have regretted it since.",
  "18:00 - Arrived at the house and rolled a (moderately sized) joint to be smoke communally between my friends and I.",
  "The high feeling that comes from this set in shortly after/during and I was still able to legibly converse with my companions.  My mood was elevated.",
  "19:00(ish) - Another Joint.",
  "The high feeling that had been had sunken into the distance and we decided to have a topup.",
  "The evening went on with one or two more, and I began drinking at around 21:00 as the music was on and people were arriving.",
  "22:00 - I began feeling very lethargic and decided that a few lines of coke would pick me up, and it did seem to counteract the down pull of the cannabis.",
  "I finished the bottle of cider and continued drinking as the night went on, and aquired a bag of base (speed? was what he refered to it as) from somone we knew.  I couldnt really taste it but remember the feeling of dabbing and swallowing it being very close to that of a very fine dust, like chalk.",
  "1:00(ish) - I could feel a very big buzz from the base and alcohol, and decided it was time to drop the first of my two pills to wake me up a bit.  I felt the familiar rush from the drug and it was disorienting but pleasant, empathising with the fast electronic music at the party and feeling a need to dance.",
  "7:00(ish) - The music was still on but the party was coming to an end, I had consumed the second of my pills at some point but there are big blank patches in my memory.  Music still felt like it was everything to me, and talking to people took on a very meaningful tone though I am not sure i could really understand alot of what was going on around me.  Sleep was the furthest thing from my mind, dispite the time.",
  "8:30 - we had aided in the evacuation of most attendees of the party and i noted having trouble with keeping still and the alcohol had mostly worn off, leaving no noticable residue of after-effects yet.  As the sun was up i noticed my vision wasnt right, i couldnt make out lighting properly as everything seemed to be too vibrant and with a darker colour than normal.  Around this time we relaxed to talk about the night and had a few more joints.  I Halucinated mildly, seeing patterns and movement (pulsating?) textures on my skin and peoples faces but i was comfortable with it and i laughed about it with people.",
  "I couldnt sleep dispite how physically tired i began feeling, the overexertion from the pills being more pronounced in my legs than anywhere else.  The lapses in my memory were making me paranoid and worried about my actions in that intoxicated state, and even after I had slept I was very irritable with a very strong comedown that lasted around two days.  My appetite had completely gone and i didnt eat the following day.",
  "Overall i had a good experience but the come down was so incredibly soul destroying I will not be doing it again, though it did give me time to think of how much damage i could be doing to myself (and more specifically, my mind) and i haven't felt the need to touch the latter three substances since.",
  "For those looking for substances to aid the party atmosphere or to highten awareness, I hope you have found this useful though I would not reccomend mixing drugs unless you really know what you are taking and have good company to watch over you.  Individually, I have found these substances to be very effective and pleasant around large groups of people and music, making the social experience very rewarding."
 ],
 "erowid": {
  "id": "60259",
  "citation": " howless. \"Unable to Relax, Irresponsible Drug Use: experience with Alcohol, Cannabis, Cocaine, 'Base' & MDMA (Ecstasy) (ID 60259)\". Erowid.org. Jan 29, 2007. erowid.org/exp/60259",
  "substance": "Alcohol, Cannabis, Cocaine, 'Base' & MDMA (Ecstasy)",
  "views": "4308"
 }
}
