{
 "id": 1001,
 "title": "Speedballing",
 "date": {
  "submission": "2007-05-05T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Prankster290",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "0.5 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Last night, my friend M and I had some excess powder sitting about, and we decided to try the infamous combination of dope and coke, a.k.a. 'Speedballing'.  M and I had recently come across a source of cheap, very good quality heroin.  I hadn't done any dope in about 4 days, but I'd been doing coke most of the weekend.  At about 9:30 pm, we each insufflated one large line of cocaine, and one small line of heroin, about the size of our normal dose.  We proceeded outside to smoke cigarettes out on the bench in front of our dorm, as we normally do.  Heroin gives a warm, heavy, slightly itchy feeling of contentedness, while cocaine produces a jittery, euphoric, wide-awake high.  The combination is a mix of these two states...warm, drowsy, and content, yet somehow fully aware of what is going on and talkative and slightly jittery.",
  "We smoked cigarettes and walked around until the cocaine high wore off.  Still slightly wired at this point, however, the heroin mostly took over and I actually nodded out a couple of times.  We shot a few games of pool, and did one more line of cocaine to bring us back up.  We smoked more cigarettes, and M and I drank a beer to top things off.  After about an hour, my friend R offered to smoke a blunt of kb (cannabis) with us.  We proceeded to the usual spot, by now feeling more or less back to normal.",
  "After I took a few large hits from the blunt, 10 minutes later I had to sit down, suddenly overcome by the strength of the speedball.  My only guess is that the cannabis must have kicked in both the heroin and the cocaine all over again, and this time it was much stronger than it had been before.  It was about 1am by now, and I was able to make my way back to the dorm and up to my room.  I was feeling very ill and my heart was beating very quickly and erratically.  I sat for a while, unable to move but still very very fucked up.  I vomited a few times, and I felt better.  My heart continued to behave erratically, speeding along much faster than it should have.  Abruptly, it would slow down to somewhere near normal, but still not at a steady rhythmic pace.  It sped up and slowed down to its own accord for the next couple of hours.",
  "Physically, I was not in good shape.  I was pale and trembling, with a slight headache and cold, clammy hands.  Mentally, it was a beautiful feeling.  For a while I felt as if I was very close to dying, but at the same time I was consumed by beauty all around me.  I believed myself to be in a higher state of consciousness, at one with the universe or in sync with a unifying force, or something.  Interpret that however you want.  I slept through all of my classes the next day (today), and I've been rather 'out of it' and exhausted both physically and mentally.",
  "This experience is an unforgettable one, however it is very dangerous and I suggest that anyone planning to try this should know their reactions to both cocaine and heroin before combining the two.  Drinking any amount of alcohol with this combination was a very very stupid thing to do.  Luckily we only had one beer left to split, If I'd had more, I would've drank it, and I would probably be dead or hospitalized today.",
  "Note: I hadn't smoked cannabis for about a week prior to the experience, so that may have something to do with it's heavily magnifying effects on me."
 ],
 "erowid": {
  "id": "12899",
  "citation": " Prankster290. \"Speedballing: experience with Cocaine, Heroin, Alcohol & Cannabis (ID 12899)\". Erowid.org. May 5, 2007. erowid.org/exp/12899",
  "substance": "Cocaine, Heroin, Alcohol & Cannabis",
  "views": "16634"
 }
}
