{
 "id": 10016,
 "title": "Spritual Ecstasy",
 "date": {
  "submission": "2007-02-28T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "klanonymous",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "LSA"
  },
  {
   "time": "1:45",
   "amount": "20 mg",
   "administration": "",
   "substance": "2C-E"
  }
 ],
 "report": [
  "Spiritual Ecstasy",
  "I've taken LSA+2C-E once before and it was a great trip, but this second trip was far more intense and infinitely more satisfying. Since LSA has such a long come-up, I dosed in the sequence shown below hoping to get the two peaks to coincide.",
  "T+0:00  5-HTP 200mg (oral),  LSA 210mg (~12.5 seeds) (oral)",
  "T+1:45  2C-E 20mg, LSA 90mg (~5 seeds)",
  "On my previous LSA+2C-E experience, I came to terms with the fact that I pursue psychedelic states hoping to achieve something spiritually fulfilling and not merely entertaining.  Though I've had many very revealing trips before, there has never been that great ecstatic and blissful moment of epiphany and understanding I have so longed after.  After this experience, I realized, perhaps the whole of my life experience, encompassing all sober and psychedelic states, may have been the Universe conspiring and preparing me for this particular inward journey-- a perfect moment in time.",
  "The night began around 8pm, when two very good friends arrived at the house, one of whom would be partaking in what I can only hope was a similar journey.  The other, my roommate, chose to remain sober on the occasion, but hopes to replicate a similar trip soon.",
  "As we waited for the first dose to begin to come on, we listened to music, sat around, and soaked in the last bit of sobriety we thought we would have over the next several hours.  To both of our surprise, the sober character of our minds remained minimally altered throughout our trip, only adding to the beauty and complexity of our experiences. ",
  "Up to the point that we took our second dosing (T+1:45), we had both failed to experience the visuals normally associated with these types of psychoactives, however, we were both in agreement that we were experiencing a strong, but not super natural, euphoria and an intense freedom of both thought and experience.  Communication among all three of us was surprisingly fluid, uninterrupted, and uninhibited.  We were also struck with those general feelings of beauty, and were basking in the intense awe that only Life inspires.",
  "Within 20 minutes of our second dosing, we noticed a very intense and speedy climb to the plateau we would soon enjoy for several hours.  The words I've found most worthy to describe this climatic plateau of my life is Spiritual Ecstasy.  I don't consider myself an overly spiritual guy, but I can think of no other words to fit the infinite ecstasy that followed.",
  "We had just gotten back from a short walk around the block where we had smoked several cigarettes while enjoying the fresh air, if you'll forgive such an obvious paradox.  While we were out in cold, my sober friend had apparently also been conspiring with the Universe to make the Perfect musical selection for our return.  We came back into the warmth to be greeted by the sonic vibrations of 'Souvlaki Space Station' by Slowdrive.  (An album and song that I now must insist you buy, borrow, or steal.)",
  "Nearly as soon as I had taken off my coat, scarf, and hat, I found my self writhing on the carpeted floor as wave after wave of ecstatic joy, love, and human experience washed over me.  With eyes open or closed, I saw the tapestries of human experience and emotion unfurl and expand over every element of my consciousness, every ugly and beautiful thing, and every perfect thing in between.  All internal resistance had been dissolved, my mind had become a superconductor, a master conduit, to all of  existence.  If I have ever lived an enlightened moment, this was surely it.",
  "This state continued for several hours before beginning to wane.  I was at a moment concerned to lose this moment of continuous beauty and perfection, but soon realized that the knowledge and memory of  it's existence alone would persist for a life time. ",
  "It is possible that this experience was unique to this  moment in space and time, but even so, I will remain forever grateful to have at once quelled the currents of life, peered across the great blue divide, and seen even a glimpse of the golden shore that one can only hope awaits us all."
 ],
 "erowid": {
  "id": "60244",
  "citation": " klanonymous. \"Spritual Ecstasy: experience with LSA & 2C-E (ID 60244)\". Erowid.org. Feb 28, 2007. erowid.org/exp/60244",
  "substance": "LSA & 2C-E",
  "views": "15745"
 }
}
