{
 "id": 1002,
 "title": "Xanax the Electronic Drug",
 "date": {
  "submission": "2002-03-01T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Reptoid",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1.5",
    "grams": 0.0015
   },
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have been a Xanax user for about 2 years now, and it has saved my life. 2.5 years ago I went into a hospital, suffering from convulsions, and basically died. My body temperature dropped to 93 degrees, and my blood pressure so low I had to be revived. It was the most frightening time of my life. For 6 months I was given MRI's, EKG's, and blood work. They could not find the culprit of my problems. I was having panic attacks due to post-traumatic stress disorder. I was given heavy doses of Zoloft, the Paxil, then Effexor, until I was saved by Xanax.",
  "Xanax gave me the ability to relax, and to have my body feel as one again. I was lost. Xanax gave me a map to my life. I control it again and have for 2 years without any real problems.",
  "The most interesting part of this whole story is that I have not had a drink, or smoked, or done anything else besides Xanax for 2 years, and I am content! I am happier than I ever was on any other drug. The feeling of warmth and happiness is a hard one to grasp in this world of evil. I have found the one light in this darkness to see through the veil. How could I ever leave this?",
  "I only can speak highly of alprazolam, but I must stress that it must be taken wisely and ALONE to appreciate what it really does, and not mixed with alcohol, or any others drugs. I have watched many people have bad reactions to these combinations. People who say they have lost memory or felt like time was stolen from them, usually are combiners who drink alcohol or mix another drug with alprazolam. I actually feel smarter and more aware of my surroundings when isolating the drug by itself.",
  "thank you x",
  "REPTOID"
 ],
 "erowid": {
  "id": "12906",
  "citation": " Reptoid. \"Xanax the Electronic Drug: experience with Alprazolam (Xanax) (ID 12906)\". Erowid.org. Mar 1, 2002. erowid.org/exp/12906",
  "substance": "Alprazolam (Xanax)",
  "views": "134046"
 }
}
