{
 "title": "NBOMeternity",
 "author": "Azarado",
 "citation": " Azarado. \"NBOMeternity: experience with 25I-NBOMe (ID 100294)\". Erowid.org. Jun 6, 2013. erowid.org/exp/100294",
 "substance": "25I-NBOMe",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1200 ug",
   "buccal",
   "25I-NBOMe",
   "(blotter / tab)",
   " T+ 1:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "",
   " T+ 13:00",
   "3 bowls",
   "smoked",
   "Cannabis",
   "",
   " T+ 18:00",
   "1 hit",
   "smoked",
   "Cannabis",
   "",
   " T+ 24:00",
   "25 mg",
   "oral",
   "Diphenhydramine",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I consider this trip to be the most intense I have experienced in my stint as a psychonaut. I am writing this experience report 2 days after dosing. The experience lasted approximately 20 hours, with about 10 hours of it consisting of a psychedelic trip and another 10 hours consisting of after-effects, euphoria, and some agitation, probably as a result of over-stimulating my 5-HT2A receptors and sleep deprivation. I consider myself an experienced psychonaut and user of psychoactives. I do my best to practice harm reduction and I ALWAYS research a chemical before I decide whether or not I would like to have an experience with it. I frequently smoke cannabis, and have also used LSD, 25-C, magic mushrooms, 25-I, DMT, LSA, amphetamine, methamphetamine, heroin, MDMA, DXM, and various precription opiates and benzodiazepines. I also meditate on a regular basis, and practice Hakti and Kundalini yoga.</p><p>I take the 25-I around 8:30 pm. The sun is still out and this makes me very happy. It is taken buccally on a piece of blotter paper obtained from a associate who ordered it online from a company that pre-blots chemicals. The package they came in says that each hit contains 1200 ugs, a pretty high dose of 25-I. Knowing this, I am a bit anxious for the come up when the onset starts, but having experienced high doses of LSD (350 ugs), I am certain I can handle it. Me and my friend, who is sitting for me, decide to walk to the woods and smoke a bowl of high quality marijuana.</p><p>During our walk I notice disco ball-like orbs of light all around me, and the ground beneath my feet has a strong tint of purple. My body is experiencing a typical phenethylamine rush, breathing feels nearly orgasmic, and my head feels like frequencies are buzzing off of it. It's been almost an hour since I have dropped and I am definitely coming up strong. When we get to the woods, we start smoking and I notice immeditely afterwards a wave of fear, paranoia, and anxiety. My vision is filled with demons in the trees, and the ground beneath me has been replaced with gummy letters of the alphabet. It is getting difficult to walk (as HST said 'no footing at all'). I relay my thoughts of anxiety to my sitter and ask her to guide me back to our home. The walk back is hellish. I feel as if I am being chased by the demons I saw earlier, which frightens me. My field of vision has been completely obscured with tracers.</p><p>Upon arriving back home I go straight to my friend's room (I live with her) and lay down. She turns off the light, which makes the intensity of the hallucinations fade, but increases their number. As my anxiety ceases to be, we pop in a movie, which I find incredibly funny, and my friend falls asleep. I go to my room, not wanting to disturb her, and start to meditate. I have CEVs of an infinite and self-transforming ultimate being, which contains everything that ever was, is and will ever be. It looks eerily similar to Alex Grey's painting Net of Being. It communicates with me that everything we know to be, and everything that has been or will be is contained within our own consciousness, which is really just one consciousness that exists as a part of everything.</p><p>At this point of the trip I begin to feel my ego dying. It is not neccesarily negative, however, I wouldn't call it pleasant in the slightest. All of my senses are joining the universe, or rather, they were always one with the universe but I hadn't percieved this notion until this moment. Time stops completely. I am eternity. I am everything. I experience all of existence. It is the most beautiful and terrifying event in my entire life.</p><p>Upon my return I decide to engage myself artistically. My drawings looks amazing, some of my best work.  Most of the Visual effects subside at about 7:00 am, about 10 hours into tripping. I feel mentally exhausted, but physically I am still stimulated. I attempt to fall asleep but to no avail. I take a shower and shave, thinking back on my experience. The rest of the day is spent smoking pot and discussion of the finer things with some hippie buddies. A few times I feel agitated from over stimulation, and I had one incident where I had a brief flashback that consisted of me anxiously debating whether or not I had Serotonin Syndrome (I was exhibiting none of the symptoms in reality, but I was hallucinating them during the post-perceptive episode), but once the flashback ended I was fine. I took 25 mg of diphenhydramine at 8:30 pm to help me fall asleep, which occured sometime around 9:15 pm.</p><p>In retrospect, this experience was a difficult one, but in my mind it proved to be extremely beneficial. I know a lot of reports about the NBOMe class of drugs denote their worthlessness as an entheogen, but it is apparent that they do induce peak experiences (at least for myself) at high enough doses. However,I don't think that I will ever do a dose this high again, given the insane duration of the after-effects and the terrible crash. I am curious to try sub-psychedelic doses of the drug and observe the euphoriant effects. My advice to my fellow researchers and psychonauts is that if you do decide to experiment with 25-I or any of the other NBOMe chemicals, start low and work your way up. I would not recommend a dosage this high to anyone who is seeking a recreational experience. All in all this is a weird fucking drug and it is a potent one at that.</p>",
 "year": "2013",
 "id": "100294",
 "gender": "Male",
 "age": "18",
 "timestamp": "2013-06-06T07:00:00.000Z",
 "views": "1606",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1200 ug",
   "administration": "buccal",
   "substance": "25I-NBOMe",
   "form": "(blotter / tab)"
  }
 ]
}
