{
 "id": 10031,
 "title": "A Strange Herb",
 "date": {
  "submission": "2009-08-31T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Andrew",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Kava",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Hello, I am writing about an herb I discovered at a local headshop.  I have read about another herb called 'blue lotus', and I was very interested in trying it out.  To this day, as I write this, I have yet to try blue lotus, and I wanted to try a legal herb to take my mind off of marijuana and such.",
  "I can say I am quite experienced in the pot-smoking business, and am no stranger to the 'high', so when I smoke I am very responsible and still quite intelligent whereas my friends... well they were friends, just couldn't function as people normally under it.",
  "So I'd like to get to the point.  So I went to my local headshop with my dad (I'm under 18, and my dad is very cool with my potsmoking, but still sort-of discourages it) but they did not have any blue lotus there.  However, he still emerged with a bag of 'buddha's blend'.  So he bought an ounce (28 grams) for only $5.95.  Not bad!  And it came with 33 rolling papers as well.  So my dad rolls up a big beautiful joint (he was a HEAVY smoker in the 70's, and I've never seen such a marvelous joint before!) and we smoke it.  Well, the hits were quite rough.  The high did not hit me until 5-10 minutes after.  Very strange and slow onset for smoke, but when it finally hit me colors appeared... different.  Colors were not brighter or beautiful or awe-inspiring, but they were... different.  Hard to explain.  It was also, without any shadow of a doubt, a subtle body high.  I was very giggly and couldn't seem to sit still.",
  "As I say though, the high was very subtle.  But my dad kept claiming that he was 'totally fucked up'.  I found this rather strange, for I was not nearly 'tripping' as hard as he was.  It wasn't like a weed-high for him, but high enough for him to be 'fucked up'.  So I had my best friend, Allie, come over and we experimented with this herb.  We are both experienced pot-smokers.  So we loaded a large bowl in a 'water-pipe' and we ripped away.  The hits were incredibly harsh.  At first, according to her, she felt a subtle high as well, but like me her high came down in less than 30 minutes.  We reached the conclusion that if you were a pot smoker, we had an astounding tolerance to 'buddha's blend'.",
  "Another thing I'd like to point out was that I could only catch the BUZZ once a day, lasting 30-40 minutes, but no matter how much I smoked I couldn't seem to ever catch a buzz again until the next day.  The color effects and a very distinct lack of coordination strengthened with every bowl and joint- but only to a degree.  I felt pretty annoyed by this, having a 'pre-tolerance' to this stuff.  The buzz tolerance is shortlived, but builds up like a motherfucker.  I had gone through five bowls and three joints with Allie (about 10 grams) and just could not get a high.",
  "Overall, I think this is some pretty strange stuff.  It's relaxing, and for six bucks an ounce I can't say it's a substitution for Marijuana but if I am waiting on a prick-of-a-dealer, this herb will definetly help me occupy my time.  I still look forward to trying Blue Lotus, and I hear its not super or anything, that it just 'mellows you out' (according to my brother), but mellowing is just fine by me.  Afterall, I smoke weed to mellow out :)"
 ],
 "erowid": {
  "id": "60321",
  "citation": " Andrew. \"A Strange Herb: experience with Kava (Budda's Blend) (ID 60321)\". Erowid.org. Aug 31, 2009. erowid.org/exp/60321",
  "substance": "Kava (Budda's Blend)",
  "views": "15892"
 }
}
