{
 "title": "Mellow Out",
 "author": "The Moderator",
 "citation": " The Moderator. \"Mellow Out: experience with Catnip (ID 10037)\". Erowid.org. Jul 12, 2005. erowid.org/exp/10037",
 "substance": "Catnip",
 "bodyweight": "190 lb",
 "report": "<p>One evening after a hard day at work, I decided I was in need of a change of mind state. Since I didn't have any weed on hand and my source was unavailable, I decided to find something a little easier to get. After reading some info on legal highs, I found an article on how catnip would give you a mild buzz. It just happened that I had some fairly new catnip that I keep for my cat, so I decided to try it. I packed up one fatty bowl and started smoking it around 9:10 pm. It had a fairly pleasant taste, much better then weed or tobacco (I'm a avid smoker). I had no problem finishing the first bowl in like 5 minutes. After that I had a cigarette, which I later found out was actually supposed to increase the effects.</p><p>Around now it started to hit me, a real mellow feeling, not much different from coming down from a very strong cannabis buzz. Don't get me wrong, it was weak, but it was definitely noticeable. After about 10 more minutes, I decided to smoke another bowl. By the middle of it I was in a mild euphoric state, like a single strong hit off a joint. A feeling of immense relaxation came over me, just what I needed after a hard day of work. I started watching TV and it seemed like time was going slightly slower, but just barely noticeable. Concepts were harder to understand and I had a difficult time keeping the plot of the show, but nothing too terrible. The pleasant taste lingered and my breath felt 'minty'. After about 20 minutes of this semi-euphoric state, the effects started to leave, but the feeling of relaxation stayed around for another hour or so. There were no side affects that I noticed what so ever.</p><p>Overall, it was a very positive experience and something I may try again, maybe next time with some fresher catnip.</p>",
 "year": "2001",
 "id": "10037",
 "gender": "Male",
 "timestamp": "2005-07-12T07:00:00.000Z",
 "views": "19997",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  }
 ]
}
