{
 "title": "Sub-Perceptual Doses and Creativity",
 "author": "L. Drury",
 "citation": " L. Drury. \"Sub-Perceptual Doses and Creativity: experience with 2C-E (ID 100408)\". Erowid.org. Jul 9, 2013. erowid.org/exp/100408",
 "substance": "2C-E",
 "bodyweight": "65 kg",
 "header": [
  [
   "DOSE:",
   "750 ug",
   "oral",
   "2C-E"
  ]
 ],
 "footer": [
  [
   "2013",
   "100408",
   "Male",
   "",
   "55",
   "Jul 9, 2013",
   "480",
   " "
  ]
 ],
 "report": "<p>Heres a short report about a recent experiment with a 2C-E sub-perceptual dose (SPD). </p><p>On April 12 2013, at the art gallery I work, I had spent most of the time setting up a new exhibition, pushing aside every other task. It was so much fun working and chatting with the artist, a charming 24 years old young woman. </p><p>Late on Friday morning, I still had to clean and redecorate the gallerys boutique without anybody around to help. Its a task that usually requires a couple of days. A bit tired and drained from a rather busy week, I desperately needed a booster to energize and inspire me. I decided to ingest 750 g of 2C-E at 11:00. A moderate dose (10 mg) would have been inappropriate as the show opening was scheduled to take place at 17:00, followed by dinner at a trendy restaurant.</p><p>At noon, I couldnt perceive the drugs action yet. I was left by myself in the midst of a total chaos that had to be transformed into a harmonious and attractive store. While working, enjoying Psychedelic Goa Trance music, I became very involved and didnt notice the 2C-E onset. Psychomotor skills improved gradually. At around 14:00, I could go on efficiently at top speed, much faster and accurately than usual. </p><p>Difficulties became creative stimulation. I viewed the room like a huge 3D collage having a life of its own. I was totally into the moment, immersed in a burst of creativity but very calm and in control at the same time. It didnt feel like being under the influence of a substance as sensory perceptions were barely modified.</p><p>At 16:30 everybody (artists and creative people) were in awe at the sight of the boutique. After a quick snack, I changed my clothes in a hurry and was ready to socialize. As usual with 2C-E, interpersonal relations flowed. It was a wonderful evening. Back home at 22:30, still full of energy, I felt 35 years younger. I easily descended into sound sleep at around 23:30.</p><p>The next day, I enjoyed a relax state of mind. I was really pleased with the boutique look and nothing had to be changed. 2C-E SPDs seem to be a very effective way to boost creativity while going on with day to day life. But if setting is not an issue, set and the choice of substance and dosage are undoubtedly of the utmost importance.</p>"
}
