{
 "title": "A Couple of Bad Glocks",
 "author": "Daniel Renegade",
 "citation": " Daniel Renegade. \"A Couple of Bad Glocks: experience with Sold as Ecstasy (ID 100485)\". Erowid.org. Jun 16, 2013. erowid.org/exp/100485",
 "substance": "Sold as Ecstasy",
 "bodyweight": "120 lb",
 "report": "<p>I picked up two white ecstasy pills with a glock/pistol logo on them off my friend who tried them, and said they made her trip out sort of like 5-MeO-DiPT made her feel but stronger.  She said the person who gave them to her said they were laced with LSD. I find this very hard to believe. </p><p>But being curious, and seeing as she did not like or want them, I purchased them from her for five bucks.  Online reports have reported some of these to contain piperazines (although never tested) and one report suspected it contained a 2C- base with low MDxx content.  Other reports said they were great.  All I have learned is, pills are different everywhere, and hopefully it isnt piperazine.  Nausea is no fun.</p><p>It's a Tuesday, Im home alone until Im guessing at least 6pm. I'm kind of nervous, but thats to be expected when you dont know exactly what youre taking. </p><p>2:24pm  Swallowed both with a cup of OJ</p><p>2:34  The usual butterflies in my stomach I get after taking pills is present</p><p>2:44  Mild nausea, feeling very slightly off baseline.  Going to go take a hit from the bong to help my tummy</p><p>2:54  Go to the bathroom to throw up.  Lasts about a minute.</p><p>2:58  Eyes feel sort of tight, if that makes sense.  Starting to notice very slight visual distortions.  Nausea is mostly gone.</p><p>3:04  feeling simultaneously hot and cold, mainly on my back.  Probably just sunburnt.  No change in visuals</p><p>3:25  Nausea stays at about a 3.5 (of 10), occasionally moving up to a 6.5, but I havent thrown up again.  The visuals stay at the point where it feels like youre about to start a mushroom trip, but havent quite begun.  Just minor blurring out of the corner of my sight and what not.  Head feels slightly foggy.</p><p>3:28  Just had one of those full body pulses that rises up to the eyes, that usual happens to me on mushrooms or a fair amount of MDMA, although I feel almost no MDMA effects.  Maybe this is starting to pick up.</p><p>*After this point, nothing new happened, just nausea and the occasional body pulse and slight visual distortions*</p><p>I felt fine the next day.  My official guess on what the substance is, is going to be 5-MeO-DiPT.  It made me feel just like it, and it tasted just as chemically and gross on purging it up.</p><p>I do not recommend taking a substance if you are not sure what is in it, a better idea would have been for me to buy a test kit, but I didnt have the time.</p><p>-DSR</p>",
 "year": "2013",
 "id": "100485",
 "gender": "Male",
 "age": "18",
 "timestamp": "2013-06-16T07:00:00.000Z",
 "views": "1854",
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Bad/Suspect Ecstasy",
   "form": "(pill / tablet)"
  }
 ]
}
