{
 "title": "Depressed & Traumatic",
 "author": "TT Frank",
 "citation": " TT Frank. \"Depressed & Traumatic: experience with 25I-NBOMe & Cannabis (ID 100405)\". Erowid.org. Nov 14, 2013. erowid.org/exp/100405",
 "substance": "25I-NBOMe & Cannabis",
 "bodyweight": "13 kg",
 "header": [
  "DOSE: T+ 0:00",
  "3 mg",
  "buccal",
  "25I-NBOMe",
  "(blotter / tab)",
  " T+ 0:40",
  "1 cig.",
  "smoked",
  "Cannabis",
  "",
  " T+ 2:20",
  "1 cig.",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>Yesterday I had a traumatic experience with this drug. I am a fairly healthy male with no illnesses, diseases or allergies to anything, although I do suffer from mild depression and anxiety from time to time. I have tried a range of drugs: cannabis, AMT, MXE, MDMA, speed, LSD, shrooms, Tramadol and Valium.</p><p>I had experienced a nice trip from this substance the night before at a 1mg dose. Mild visuals and a nice headspace with not too much of a bodyload. I was looking for a stronger trip the next day and as I had read that this substance builds up a high tolerance quickly, I decided my next trip would consist of a dose of 3mg.</p><p>Although I cannot remember the exact times of this experience, I will try to post them as accurately as I can.</p><p>+00:00 - Placed 3 HPBCD complexed 1mg tabs of the 25i between my upper lip and gum. Held them there for approximately 30 minutes and swallowed.</p><p>+00:40  Smoked a joint and effects have started kicking in already. No visuals as of yet but starting to feel energetic and a different headspace.</p><p>+01:00  Arrive back at my house to find that the visuals have already kicked in extremely strongly. Fractals and patterns are appearing everywhere and everything is starting to breathe and morph. Still feeling a sense of euphoria and positivity. Start playing video games (GTA: IV).</p><p>+01:40  I give up playing as the visuals and headspace become even stronger and are completely distracting me. Numbers and letters have started appearing in a kaleidoscope form and everything is morphing even more strongly. I note that at this point the bodyload is becoming increasingly heavy, but think nothing of it. I also note that my method of thinking has started to change. I am starting to think about life differently and getting stuck in cycles of thought.</p><p>+02:20  I roll another joint and go outside to smoke it. Halfway through smoking I stare up at the sky to see a kaleidoscope of stars spinning and twinkling in the night sky. It really did look beautiful.</p><p>+02:30  I come back inside and get stuck in a cycle of thought about my life again. I am mainly thinking about my social anxiety and how I can change my actions, but why it doesnt really matter what I do anyway, fate will decide. Visuals keep increasing in intensity, as does the bodyload.</p><p>+03:00  I am starting to worry about the bodyload. It feels as though I am sinking everywhere I go and I just cannot get comfortable. I check my heart rate and it is pounding so fast I start to have a panic attack. At this point I am sure that I started partially hallucinating. I am not sure exactly what parts are real and what are me hallucinating.</p><p>+04:00  I am so worried about my heart rate that I call the emergency services. I explain that I have taken a drug called 25i, my heart rate is extremely fast and that I feel as though I am about to die. The guy on the other end of the call keeps asking what to me seemed like really stupid questions. He repeatedly keeps asking me what drug I have taken and keep saying let me just speak to my colleague. After putting me on hold for 3 minutes and me shouting down the phone at him he explains that from what I have said he can't call an ambulance out to me and that I need to be checked by A+E and I need to make my own way up there. At this point I thought I must be dying and completely hallucinating. It seemed so strange that they wouldn't send an ambulance out to me, I thought that because I explained I was on a drug the government were out to get me and were just going to let me die.</p><p>+04:15  I ring my friend, T, and explain that I am convinced I am dying and he needs to come down and help me as soon as possible. I go to meet him as I am scared as to what is going to happen to me and he tries to calm me down. I explain to him that the emergency services will not send an ambulance to me and we ring them up again. The same guy answers and is still asking me stupid questions. I explain all my symptoms and he keeps saying 'And why do you feel like that then?'. He eventually agrees to send an ambulance and I sit there waiting for the ambulance to arrive. I keep saying to my friend T, 'Are you sure that they are coming?' Most of the times he replies saying that everything is going to be alright but one time he replies, 'Why do you need the ambulance to come? Why do you feel like that?' I am not sure if this was me hallucinating feeling as if everyone is coming out to get me.</p><p>+04:25  I ring my mother explaining that I think I am dying. She immediately bursts into tears and drives down to my house. I begin to text the people closest to me telling them that I love them.</p><p>+04:30  - The ambulance and police arrive and casually walk in exclaiming 'What seems to be the problem then?' whilst endorsing a nice big smile on their faces. I explain my symptoms again and they explain that they need me to step into the ambulance. I lie down on the ambulance and they start hooking me up with lots of electrical wires. They are doing everything extremely slowly and I am sure that I am still experiencing an OBE and that I'm really lying on my floor having a seizure. My mum jumps in the ambulance with me crying her eyes out but I think nothing of it. I just accept the fact that I am dead and just ride this experience through to see what will happen to me. During the ride to the hospital the paramedic asks me 'Do you feel better now?' I did feel a lot better but I still think that this is because this is just a hallucination.</p><p>+04:45  I have pretty much accepted the fact that I am dead now. I arrive at the hospital and everything feels so robotic. It also feels as if none of the staff are taking this seriously, which is exaggerating the fact that I'm thinking as though I am dead.</p><p>+05:40  After an extremely long and painful process of numerous nurses checking my heart rate, whilst my mum is arguing with me saying things like 'Why did you do it?', the doctors explain that they think I am fine and that I am able to go. This is where I realize that I might not actually be dead. I am now completely confused as to what has just happened to me.</p><p>+06:15  I arrive home completely traumatized by the whole experience. I am still wondering if I am dead or not. I am also still experiencing visuals similar to the peak of my 1mg trip the day before.  I lie there just thinking, confused about the whole experience.</p><p>+24:00  And so I am sat here now writing this report. I'm not sure how long this confusion is going to last. I feel so depressed and confused about my life. My partner is refusing to talk to me, and my mum is still completely shaken up from the experience. I am not sure how long my depression will last for or even if I will ever touch any kind of drug again.</p><p>I would advise everyone to stay away from this drug or at least never do a dose above 1mg.</p>",
 "year": "2013",
 "id": "100405",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-11-14T08:00:00.000Z",
 "views": "583",
 "dose": {}
}
