{
 "title": "Lara Croft Style",
 "author": "noemie",
 "citation": " noemie. \"Lara Croft Style: experience with Methoxetamine, Alcohol & Cannabis (ID 100493)\". Erowid.org. Dec 8, 2013. erowid.org/exp/100493",
 "substance": "Methoxetamine, Alcohol & Cannabis",
 "bodyweight": "90 kg",
 "report": "<p>Setting: Friend's house, oriental style living room, relaxing electronic music, quiet party with a few people.</p><p>Previous experiences: Good experience with Methoxetamine at relatively high levels, lesser experience with MDMA, 2C-D, 4-HO-MET, Mushrooms. Heavy drinker, occasional joint smoker.</p><p>I'll decompose the trip in chunks of half an hour because this seems plausible but time was very distorted, so there may be inaccuracies. The dosages too are approximate, we didn't use a scale.</p><p>[T=0]</p><p>Had a few beers waiting for someone to arrive, it is about 8pm, feeling a little light-headed from the beers. The last guest arrives, and 3 of us insufflate about 15mg of MXE.</p><p>[T+30m]</p><p>Party goes on, all feeling the MXE kick in. The effect is mild, we are used to it, we know we'll take more.</p><p>[T+1h]</p><p>I need to go further, I have to wake up early in the morning so I don't wait any longer. I insufflate a second dose of about 15mg of MXE.</p><p>[T+1h30]</p><p>Starting to feel very relaxed and open-minded, having a few more beers.</p><p>[T+2h]</p><p>We all insufflate another dose (my third one), approximately the same dosage, probably.</p><p>[T+2h:30m]</p><p>I'm starting to go around the room and do stupid stuff with the things lying around, I'm starting to feel the power. Retrospectively I think I was only feeling the full effect of the second dose at this point.</p><p>[T+3h (now time is getting very distorted)]</p><p>I feel adventurous, I take a fourth dose (probably around 15mg, but eyeballed, so maybe more). I must precise that I'm not making the doses, a more sober friend makes them. At this point we're only two people left, just chilling listening to calm electronic/tribal music.</p><p>[T+3h:30m]</p><p>I'm happy with myself, I've got a good full on methoxetamine high. I don't feel the sting when I pinch the back of my hand, this makes me laugh. I'm saying I'll stay there, not go to work and enjoy the full night as a mighty being. My friends' roommates (a guy and a girl) come back from buying weed, we have a little talk.</p><p>[T+3h:45m]</p><p>A joint is rolled by someone. I desperately want to smoke on it. My friend tells me it is not wise, I say it can't hurt and insist (he caves, he's high too). I take three good puffs in a row on the joint. The joint is strong. It feels so nice because the MXE cancels any uncomfortable throat feelings.</p><p>[T+4h]</p><p>I'm feeling dissociation at an advanced stage, I feel like I'm not making any decision myself. I notice that my friends' roommates smell nice (they like quality perfume), so I start smelling their necks one after another, this goes on for a while.</p><p>[T+4h:15m (takeoff)]</p><p>I'm already very far gone, all of a sudden I experience a rush similar to that of MDMA kicking in. I go out on the balcony (9th floor, incredible view), I feel like the view is pouring into my eyes and I'm falling into the view at the same time. My friend comes to see if I'm alright, I hug him and at this point I notice that I'm looking at myself hugging him. I'm literally floating besides me. I go back inside, I hug everyone and say nonsense.</p><p>Then I become very scared, my heart is racing like crazy and I'm cold and I feel like I'm falling down endlessly. I need to get out, I rush out. My friend follows me with only one shoe on. I'm scared of the elevator, I take the stairs.</p><p>In subjective time walking down the 9 floors feels like hours. My friend tells me I kept bouncing off the walls so it might actually have taken some time to reach street level. We walk a bit around the block. I have almost no recollection of this part of the trip. I remember seeing myself from above and behind, exactly as you see Lara Croft in Tomb Raider.</p><p>I sometimes regain consciousness, only to be pulled away moments after. Each time I feel like I'm going to heaven. I feel like my life is pulled outside of me by a very strong hand, I'm free of all fears, I'm a pure spirit, I feel at peace, similar to when a loud  and annoying noise suddenly stops.</p><p>Have you ever realized that when you think, the thoughts seem to be localized in the area around your head? Not anymore, I don't feel my thoughts, I'm everywhere, I'm in the fabric of space and time, I've rarely been so happy.</p><p>[T+4h:45]</p><p>I still have flashes of dissociation rushs, but I'm mostly myself now. I go back home, I have a deep and mostly untormented sleep. I'm fine.</p>",
 "year": "2013",
 "id": "100493",
 "gender": "Male",
 "age": "30",
 "timestamp": "2013-12-08T08:00:00.000Z",
 "views": "340",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": " T+ 0:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  },
  {
   "time": " T+ 1:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  },
  {
   "time": " T+ 1:30",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  },
  {
   "time": " T+ 2:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  },
  {
   "time": " T+ 3:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine "
  },
  {
   "time": " T+ 3:45",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
