{
 "title": "Help Required Featuring John Gotti",
 "author": "Tony V",
 "citation": " Tony V. \"Help Required Featuring John Gotti: experience with 25I-NBOMe (ID 100504)\". Erowid.org. Sep 22, 2013. erowid.org/exp/100504",
 "substance": "25I-NBOMe",
 "bodyweight": "180 lb",
 "report": [
  "<p>I am not a very experienced tripper, only having done acid 4 times before. Though this time I had the most life changing experience. At 830 pm I was at a friends house fighting boredom. A family friend had killed himself the day before and I had been trying to get my mind off things.",
  "8:45. My good friend and tab dealer Tom invites me to trip and enjoy the city with some other friends of mine, Connie, Jason and Shannon. So I drive my car home have them pick me up and we head to the train station. I bring an expensive bottle of wine to carry around the city because I was really trying to put myself in a better mood.",
  "9:05. We take our tabs and wait for the train. Shannon takes 2.5, Jason takes half and gives me the rest and I gladly accept. Connie and Tom have 1 each.",
  "9:15. A cracked out 20 year old sits next to us and tells us he's tweaking. He also asked us to chill and I tell him were kinda doing our own thing. He smokes a cigarette on the train and walks around making weird conversations with others nearby, Shannon says she doesn't know what's going on and this guy says were all tripping out loud. We immediately get off at the stop we're at.",
  "9:45. We decide to head to the beach and I'm feeling confident with my bottle of wine in hand, not yet tripping. We have two blunts we plan to enjoy at the beach. As were walking we notice Shannon isn't with us, we turn around and she is stopped, we grab her and she says she doesn't know what's going on. We reassure her and keep walking.",
  "10:30. I'm surprised by stunning visuals as every light on the city streets seem to be shooting threads of light at my eyes. All I can say is every light is shining at me at once and a permanent smile overtakes my face. I feel like the only thing that's tripping is my eyes and I'm awestruck by this. Tom Jason and Connie agree, all sipping some wine. Not Shannon though.",
  "11:00. Shannon is on the ground asking herself if she has standards, repeating about loops then standards, then brazzers at some point. So me and Connie walk through the park trying to avoid that stress, and walk through a field of grass. Just for shits and giggles she then takes off her sweater and throws it, stating she doesn't want it, and I take it because I was feeling a little cold in my t-shirt and shorts.",
  "11:05. We head back to them and Tom is trying to take Shannon off the ground, bystanders watch as she looks like she is being raped. I don't want my friends arrested and I go explain to the people that she's on some really strong drugs. They believe me and go on. Finally we get her up and she seems to have pissed herself. We decided it was time to head home. On the way back a homeless man named Kenny tells me to hit my wine for him. He tells me to go to college and not end up like him homeless with cancer. I can never forget this.",
  "Shannon is rolling on the ground and trying to have sex with everything. Even me. I had to explain to the train officials what was going on as she rolls on the ground seeming to be cumming and grabbing her genitalia. We finally get her to the stop and I have to dress her because she only wants to remove her clothes and my mind feels sober for some reason. I have to stop her from rolling in front of the train as it comes but seem to have some surprising calmness handling this.",
  "11:10. We get Shannon in a cab and the cab driver understands her situation and takes her, Tom, and Jason to the train station. Me and Connie start walking to the train relieved we are done with Shannon, and I meet a homeless man named John Gotti. We tell him where we live and he takes us to the correct stop. My mouth is dry so he gives me some Altoids, I truly trusted him. I offer him my shirt because he only has one and he is too kind to take it. Me and Connie sit at the train station, waiting for our train.",
  "11:30. Tom picks us up after I tell john gotti I will look for him and get him tabs. Tom said Shannon's family wanted our numbers but I said f@ck that. I had him take me to my friend Tony's who wanted to see me trip. We then had a heart to heart all night which I cried about my friend, and my relationship with my mom. I stare at a chalkboard and the letters turn neon like a lightbright toy.",
  "12:00. Chasing visuals I stare at the fan for half an hour trying to get visuals and it works! The fan spin at 100 miles an hour and turns rainbow. The fan then almost hits me in face and I stand up. Last visual I had.",
  "I stay up all night with my close friend who was wasted and reminisce about practically everything. Craziest night of my life.",
  "P.S. During Shannon's sex freakout on the train, I stared at her and got her to hold a conversation. I asked her to stop and she literally said no, I never want this to stop. Some dickhead videotaped me restraining her. I slapped my ass and told him to 'videotape this'. If somebody finds this video, I was wearing Connie's striped sweater. I really want to know if this video gets out and really want to see it.",
  "What I Learned: Not even what I learned but what changed about me, I tell my mom everything that ever happened me, and never have been closer with her. I love  everyone around me everything and go on with a feeling of passion and true love for very detail of my life. I don't think I'll do acid ever again, but if I do. I will report again</p>"
 ],
 "year": "2013",
 "id": "100504",
 "gender": "Male",
 "age": "18",
 "views": "810",
 "dose": [
  {
   "time": "0",
   "amount": "900 ug",
   "administration": "",
   "substance": "25I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "submissionDate": "2013-09-22T07:00:00.000Z"
}
