{
 "title": "First Trip, Far From The Last",
 "author": "crym",
 "citation": " crym. \"First Trip, Far From The Last: experience with LSD (ID 100566)\". Erowid.org. Nov 3, 2013. erowid.org/exp/100566",
 "substance": "LSD",
 "bodyweight": "135 lb",
 "header": [
  "DOSE: T+ 0:00",
  " repeated",
  "smoked",
  "Cannabis",
  " T+ 6:00",
  "1 hit",
  "",
  "LSD",
  " T+ 19:00",
  "1 hit",
  "",
  "LSD",
  " T+ 23:00",
  "2 hits",
  "",
  "LSD"
 ],
 "report": "<p>For my first psychedelic/hallucinogenic experience of any kind, a couple friends and I organized a camping trip in rural Wisconsin and acquired some lysergic acid in tab form. I was excited in anticipation of the trip by the print of the Hindu goddess Shiva, hoping we would become acquainted soon. I couldn't verify the dose on each tab. We began smoking cannabis around 11am, pretty much continuously until we reached the campsite. After setting up camp, we dropped the tabs around 5pm and started a fire.</p><p>Feeling almost buzzed from the anticipation, I smoked a bowl of cannabis (approx. .3 grams) and began making myself a s'more on the fire. The fire was particularly pleasing to me, sporting what occurred to me, astoundingly, to be an intrinsic glow rather than a reflection of other light. While obvious, this seemed profoundly significant to me, so much so that I could only react with giddy, almost manic, laughter. It was about an hour after we took the acid that I knew I was fully tripping when I dropped a marshmallow onto the fire and it began to bubble and take the shape of a gargoyle-esque demon, though not a menacing one. I thought I would attempt to communicate with it but in seconds the ephemeral spirit decomposed into a lifeless, charred mass. I stood up, noticing then that the ground was moving away from my feet at the same rate that my eye level was elevating. Walking around, I was filled with astonishment and more of the giddy/bubbly feeling as well as a sensation throughout my body of being somehow electronic. Accompanied by a very mildly unpleasant (mostly due to unfamiliarity) numbness of the face and teeth, the idea that I was a human battery emitting electrical signals into the atmosphere permeated the subsequent hours of the trip.</p><p>Approximately two hours into the trip, I was bombarded with brief specific hallucinations such as trees appearing as knives carving up the sky, small gnomes/sprites conducting a turf war over a grassy field, and the walls of the tent inflating and deflating rhythmically. Throughout the experience, light was heavily distorted and cast a lively quality over any object it touched. Additionally, distance and depth were in constant flux, as if geographic boundaries were only as strict as my imagination keeping them in their predictable places. My perception of time went out the window fairly quickly; the first 3 hours seeming like an eternity while the next 4 vanished in an instant. There was a window of maybe 45 minutes whereupon staring into the night sky produced a kaleidoscopic effect with simple geometric figures blooming from a central point of focus in an array of vibrant colors. Conversation, while stimulating, was difficult to follow, mostly consisting of updates on each other's trip. At some point in the evening, likely around midnight, my friend performed a light show to a dubstep song using gloves with attached lightbulbs on the fingertips- an experience would describe in one word, amazing. I could trace the paths of the moving lights and see the patterns that remained. Before bed, we each smoked a cannabis joint and listened to psychedelic rock music, a combination that relaxed me and eliminated the undesirable 'edge' of the facial sensation described above.</p><p>I awoke the next day at 10am feeling unusually refreshed and alert. Reeling in satisfaction from the previous night's experience, I couldn't wait to repeat it. So, being a) thoroughly uneducated about the drug and b) an ignorant adolescent out for immediate gratification, I took another tab at 12pm. As one who knows anything about acid more than I did at the time, the tab had no noticeable effect since the dose from the night before caused a spike in my tolerance temporarily. Frustrated, I took two more tabs at 3pm. The only notable impact of the 3 tabs that day was a fairly undesirable feeling that my head had been scoured out with steel wool and found difficulty generating thoughts beyond simple responses to immediate stimuli. This lasted the rest of that day with no hallucinations or other effects.</p><p>To surmise, my first acid trip was more silly fun than spiritual or intellectual, but it primed me for future trips to absorb as much as possible from them since so much detail of this trip eluded me. I'd characterize my mood overall as euphoric and marvelled. I regret taking the 3 tabs the second day because they did not affect me and therefore were wasted. With that caveat, I proudly marked the starting point on the psychedelic journey I would continue for the rest of my life.</p>",
 "year": "2012",
 "id": "100566",
 "gender": "Male",
 "age": "17",
 "timestamp": "2013-11-03T07:00:00.000Z",
 "views": "822",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  "1": {
   "time": " T+ 6:00",
   "amount": "1 hit",
   "administration": "",
   "substance": "LSD"
  },
  "2": {
   "time": " T+ 19:00",
   "amount": "1 hit",
   "administration": "",
   "substance": "LSD"
  },
  "3": {
   "time": " T+ 23:00",
   "amount": "2 hits",
   "administration": "",
   "substance": "LSD"
  }
 }
}
