{
 "id": 10068,
 "title": "Just Adrenaline",
 "date": {
  "submission": "2009-07-21T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Acid Head",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Ever since I smoked my first joint, I've always been very interested in drugs.  One thing resulted in another, and ultimately I had tried pot, shrooms, salvia, ecstasy, oxycodone, nitrous, dexedrine, and had combined many of the above.  One day a good friend of mine happened to come into the possession of some crystal meth, and being the person I am, I told him I was very interested in trying it with him.",
  "My friend had smoked it a few times before, and he demonstrated the appropriate method for heating the crystal to the point where it released smoke and inhaling it.  He took a big hit, heated it for me and passed it my way.  After a few big hits, I felt the amphetamine rush many people describe as being the beauty of meth.  The best way I can describe the rush is an intense adrenaline rush, but feeling very euphoric to take the edge off of it.  My heart started beating quickly, and I felt so alive.  Everything felt crisp, any sleepiness I had was gone, and I felt fairly euphoric.  After the euphoria faded, I was left feeling energetic, and everything felt unusually crisp.  The energy was nice, and I could see it being useful if I had to stay up, but it wasn't anything special.  Though it was much clearer than the kind of energy I get from caffeine, and less edgy.  The rush was very nice, but when it boiled down to it, it was just a powerful adrenaline rush.",
  "The experience was nice, but it was not something that I feel any urge to repeat.  The energy was nice, but it isn't worth the health risks, or the potential for addiction.  The rush was definitely a beautiful thing, but when all is said and done, it wasn't all that much better than some of the powerful rushes I have experienced already in my life that have been completely unrelated to drugs.  When all is said and done, it's just adrenaline."
 ],
 "erowid": {
  "id": "60485",
  "citation": " Acid Head. \"Just Adrenaline: experience with Methamphetamine (ID 60485)\". Erowid.org. Jul 21, 2009. erowid.org/exp/60485",
  "substance": "Methamphetamine",
  "views": "6922"
 }
}
