{
 "title": "Nauseous, Thirsty, and Warped",
 "author": "delia",
 "citation": " delia. \"Nauseous, Thirsty, and Warped: experience with 25B-NBOMe (ID 100685)\". Erowid.org. Nov 17, 2013. erowid.org/exp/100685",
 "substance": "25B-NBOMe",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "25B-NBOMe",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>This was my second time experiencing this drug. Both times were at the beach and without clocks, so I'm not 100% sure what the time frame was. The first time I had taken 1.5 hits, and it was energetic and fun, giggly, and at times meditative and serene, and it took about 45 minutes to feel effects. It was a very positive experience, despite a slight tummy ache. However the second time was very different.</p><p>I took only one hit this time, on a blotter, from the exact same batch as the last time. It was bitter and turned my mouth numb, exactly the same as the last time, but this time I started feeling it slightly after about ten minutes. Maybe three or four minutes later, I took the blotter out of my mouth and gave it to my boyfriend who already had one in his mouth, because I didn't want it to intensify much more. It was at night, I started seeing 'shooting stars' and I was completely convinced they were real, until I kept seeing them over and over again.</p><p>Maybe an hour later, I started getting nauseous and thirsty. I drank some water from my boyfriends car, and told him that it must have gone bad, because it made me feel worse and it tasted sweet. He told me it was fine and he had bought it the same day, and took a drink just to make sure. A minute later I started vomiting violently. (however, I have a pretty weak stomach anyways.) I kept drinking water and throwing it back up, I drank the whole gallon from his car and a few bottles that I could bum off of other people from the beach. I was having a fun time, despite feeling sick. My thoughts kept racing, and people started looking different, and if I couldn't see something very well it would start changing.</p><p>There was a band playing at the beach and while listening to the music I looked at the clouds, which were swirling around unnaturally. One of my girlfriends had a rippling aura around her face, like a stone being thrown into a pond.</p><p>About two and a half hours after I had taken the drug, things had gotten way too 'real'. I didn't have any more water and I still kept throwing up, eventually dry heaving and sweating, and coughing up a salty phlegm (before even getting in the ocean). I'm 100% positive I (an atheist) saw Satan. Not with my eyes, but somehow with something.</p><p>I waded around in the ocean for a minute to cool off. My boyfriend was hardly feeling any effects and was able to drive me home, even after taking his hit and the rest of mine. The car ride home was a total light show. I started crying and getting upset, then happy, and upset again. In the low light, the inside of my boyfriend's compact car had taken the shape of an SUV, and he turned into a complete stranger, but I knew that was just the drug, and when I looked at him in better light he was himself again.</p><p>I finally got home, nervous hoping my family was all asleep. Everything was much bigger and taller, including myself, and perspective was all warped. The sound of my footsteps and the things in my bag was really nice. I got into my room and immediately felt so much better. I changed into comfy clothes, and put on 'Yellow Submarine'.</p><p>I kept throwing up for the rest of the night, maybe about 5 more times. Fizzy soda made me feel better, and the movie was the best thing for me at that time. It was fun and whimsical and colorful, random and fast as my racing thoughts, but a whole lot more fun and positive. (I highly recommend that movie to anyone who's having a bad trip.) I fell asleep, and woke up a couple hours later. I was still tripping, but it was much more mild and nice. The effects altogether lasted about 11-12 hours.</p><p>Moral of the story: different drugs affect different people differently, and the same people differently on different days. So be careful with whatever you do! I'm not advising anyone to stay away from this drug, or to try it either. Just know the effects can be very.... different. Happy tripping :)</p>",
 "year": "2013",
 "id": "100685",
 "gender": "Female",
 "age": "18",
 "timestamp": "2013-11-17T08:00:00.000Z",
 "views": "293",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "25B-NBOMe",
   "form": "(blotter / tab)"
  }
 ]
}
