{
 "title": "Fucked Up Amazing",
 "author": "Radu",
 "citation": " Radu. \"Fucked Up Amazing: experience with 25C-NBOMe (ID 100742)\". Erowid.org. Sep 13, 2013. erowid.org/exp/100742",
 "substance": "25C-NBOMe",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 hit",
   "buccal",
   "25C-NBOMe",
   "(blotter / tab)",
   " T+ 7:00",
   "1 tablet",
   "",
   "Pharms - Zolpidem",
   ""
  ]
 ],
 "report": "<p>Let me start by saying that I am a fairly experienced user of psychidelics, and many other substances. I have done LSD, psilocybin cubensis, DXM, prescription painkillers like oxycontin etc.</p><p>Anyways, here is my setting. I was at my local cemetery because is it seriously enormous.</p><p>T+ 0:00 Inserted tab in my lower lip. I did not taste the tab unless I touched the tab w/ my tongue. Very bitter.</p><p>T+ 0:15 Starting to feel my eyes tingle, and if I stared at the trees, my vision would slightly move, but probably placebo.</p><p>T+ 0:45 I start to feel a little anxious and happy at the same time. The clouds in the sky were starting to move in waves. The trees would extend, and then shrink. I started to feel very sweaty and my skin turned a little red.</p><p>T+ 1:00 Holy shit. Everything a extremely bright, and seeing patterns flashing before my eyes. When I stare at something it would look like it would dry out and there would be more detail from just staring at the concrete. I decided to leave the cemetery and ride my bike around my neighborhood.</p><p>T+ 1:30 I am very sweaty, so I head to my house where the A/C is on full blast and I drink some iced tea. Everything has a slight chemical after taste. I lay on my bed, and my ceiling, TV, posters, and walls are turning blue and every inch of anything I look at would swirl and move in its own direction. I would only see it in my peripherals because there is a swirling pattern of blue, purple, and teal. Wow.</p><p>T+ 1:45 I have stopped sweating and go ride my bike around my neighborhood, then meet a friend at the cemetery who was tripping on LSA. My whole body was tingling, I feel like I want to move constantly. Everything is morphing into each other and swirling different colors. This seriously is amazing.</p><p>T+ 3:00 I feel as I have hit the plateau of my trip. My skin is red, I am very sweaty, and I still cannot stop smiling. I begin rambling nonsense to my friend, my speech is just like, 'This hard is tripping making me.' Nothing else too significant happens except patterns and morphing.</p><p>T+ 5:00 I am still slightly tripping. Visuals are still going on, but I have calmed down and just watched TV, enjoying the A/C.</p><p>All in all, this shit is almost as good as 2 - 3 hits of acid if not as good. I had to take an Ambien to fall asleep because I was still rather awake. Next day I felt a little anxious, and I ate so much food because I did not eat much during my trip. This is something I can do every week if I could.</p>",
 "year": "2013",
 "id": "100742",
 "gender": "Male",
 "age": "16",
 "timestamp": "2013-09-13T07:00:00.000Z",
 "views": "493"
}
