{
 "id": 10076,
 "title": "As Sketchy as It Sounds...",
 "date": {
  "submission": "2007-03-15T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alex",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "IV",
   "substance": "5-MeO-DiPT",
   "form": "powder / crystals"
  },
  {
   "time": "0:30",
   "amount": "5.0 mg",
   "administration": "IV",
   "substance": "5-MeO-DiPT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "It all started when me and my friend (ill call him A) went on a random trip to burlington VT. We went in search of cannabis but instead we came to someone who told us he had 'foxie'. I have heard of this drug before and have always been skeptical of trying it but have always wanted to. I am a very experienced tripper and i would suggest that - at least 10 mg or up - anyone who tries this should also be experienced. Me and my friend got back home and we were very excited about this as we have heard so much about it. I went online to find out the best way to take this drug, and i came upon a post of someone shooting it. As sketchy as it sounds, and yes it sounded very sketchy to me, the report was too good to pass up. The following is my experience with 5-MeO-DiPT.",
  "0:00 - Me and A went to the mall thinking it would be fun to walk around. We shot 5 mg each in the parking lot and proceeded to the macy's entrance.",
  "0:05 - The effects immedietly kick in and the second we walk into macy's we are forced to turn around because the effects are so intense. I see colors, and the most noticable thing was the sound. A lady next to me was talking to somebody else and all i heard was 'waa-a-wa-wawa' me and my friend looked at each other and started dying with laughter because we had both experienced the same thing.",
  "0:15 - driving home from the mall was a very intense - yet fun but not reccomended - experience.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "0:30 - we arrived at A's house and decided to do a second 5 mg shot. Immedietly after i had a very intense rush of feeling and colors and it lasted for about 30 min before i went into a trip similar to LSD.",
  "1:00 - i feel now as if i am on MDMA, LSD, and cocaine, i feel great. i am tripping exceptionally hard but at the same time i have a clear head and i can think straight.",
  "2:00 - i now have alot less visuals but i feel as if im on ecstacy and this lasts for a few hours before the effects wear off.",
  "In conclusion, although i have never tried it any other way, as sketchy as it sounds i really enjoyed shooting this drug."
 ],
 "erowid": {
  "id": "60515",
  "citation": " Alex. \"As Sketchy as It Sounds...: experience with 5-MeO-DiPT (ID 60515)\". Erowid.org. Mar 15, 2007. erowid.org/exp/60515",
  "substance": "5-MeO-DiPT",
  "views": "4361"
 }
}
