{
 "id": 10098,
 "title": "Orgasmic Trip to the Land of Calm",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Geekchic",
  "gender": "Female",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 tablets",
   "administration": "oral",
   "substance": "Hydrocodone"
  },
  {
   "time": "0:45",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Hydrocodone"
  },
  {
   "time": "3:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Hydrocodone"
  },
  {
   "time": "3:15",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Hydrocodone"
  }
 ],
 "report": [
  "I feel extremely guilty about this, but to accomplish this trip, I stole the hydrocodone from my aunt's prescription. A moment of desperation to feel different on anything, I guess.",
  "It was about 9 PM, and I just woke up from a nap. Knowing I had the hydrocodone, I immediately took 4 of the 7 tablets I had. I took 4 because I knew that went fine the first time I did it.",
  "I made sure to lounge in my bed, instead of being active (like I did the first time, which made the onset longer than it should have been). I started feeling the effects about 45 minutes later. It started out as a very mild calm, then all of the sudden it whooshed in.",
  "I swear it was like a body orgasm. I took another, hoping to extend this feeling as long as possible. Everything felt good, and it seemed like nothing could ruin the trip.",
  "Sometime between 10:30 and 11:30, I got up from my bed and walked around my apartment. Everything was slow. I felt like I was walking normally, but when I really looked at how I was walking, it was a slow, basically tip-toe around the house. I got back into bed five minutes later, after the novelty of my slow walking wore off, and let the feelings of calm consume me once more.",
  "I took another tablet, sometime around 12. I really hoped this feeling would stay. I needed it too. It felt like I was going to cry once it was over. At around 12:15, I took the last one. I rubbed myself on my blankets, my stuffed animals, anything that felt good. I pet my cat, and it felt amazing. Everything was so calm, and I had a permanent smile plastered on my face.",
  "At around 3, I felt everything wearing off. I felt like crying because I already missed it. And I already exhausted my 'stash' of tablets, so I had nothing to look forward to having later. Then, it felt like I just blinked, and I looked at the clock again, and it was 6 AM. Somehow, I fell asleep for 3 hours, and it only felt like a blink. This happened the first time I was on it as well. Then, I had to get up to go to school. I was fine all through school, and I felt really peaceful all day. The only thing was that I already missed it.",
  "I love the feelings that hydrocodone gives me. Everything feels warm and fuzzy, and fantastic."
 ],
 "erowid": {
  "id": "60635",
  "citation": " Geekchic. \"Orgasmic Trip to the Land of Calm: experience with Hydrocodone (ID 60635)\". Erowid.org. Jun 14, 2007. erowid.org/exp/60635",
  "substance": "Hydrocodone",
  "views": "11469"
 }
}
