{
 "id": 10090,
 "title": "Lifesaving, Yes - Recreational Value, None",
 "date": {
  "submission": "2009-06-26T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Patrick",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "600",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "daily"
  }
 ],
 "report": [
  "I am currently taking 600mg of Seroquel per day. Because of the sedating effect (even after months on it) I can only take it within 1 hour of going to bed for the night.",
  "This drug saved my life.  I am bi-polar and in the Fall of 2006 my disease rampaged out of control.  I was admitted to inpatient lock-up at a psychiatric hospital 3 times in 3 months. I thought the end was near.",
  "My psychiatrist put me on Seroquel.  Ramped up quickly (2 weeks) from 25mg/day to 600mg. After 1 month on this drug, my life changed completely.  The racing in my head was gone.  The feeling that my head was always 'full' with racing thoughts and disabling anxiety cleared.  Things that used to freak me out with fear became easy and sometimes even fun.  My social phobia disappeared. My friends and family are amazed at the positive change. Life is great for the first time in 40 years!  I've now been on Seroquel for 4 months and have accomplished more socially and professionally than I could have in 4 years.",
  "I would suggest to readers that there is no recreational value in this drug whatsoever.  That is unless they find quick (within 1 hour), deep sleep recreational.  Seroquel is incredibly sedating.  It also gives me massive munchies....gotta watch it or my weight will balloon quickly. ",
  "My experience is that for some this may be a lifesaver.  For recreation......I'll pass."
 ],
 "erowid": {
  "id": "60604",
  "citation": " Patrick. \"Lifesaving, Yes - Recreational Value, None: experience with Quetiapine (Seroquel) (ID 60604)\". Erowid.org. Jun 26, 2009. erowid.org/exp/60604",
  "substance": "Quetiapine (Seroquel)",
  "views": "13536"
 }
}
