{
 "id": 10106,
 "title": "I Say Use A Sitter Too, Very Odd",
 "date": {
  "submission": "2002-02-08T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fool, overconfident.",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "A friend had used some sage in South America and she told me about it. I decided to check it out and got it from one of the many online sources. I tried it once, a few weeks ago with a sitter but I did not smoke enough.",
  "Last night I was alone, which was plan dumb. Find someone you really love who really never or rarely freaks you out. I also suggest a set up meditation, though I did a little bit, it was not enough. I was anxious before I did it. That should have clued me in. My reasoning for moving forward was a desire to 'see what I was made of'. I suggest not being this way. I got my ass kicked for the foolishness. But then again, why else take something so strong outside of a ritual experience with a culture to put the thing into and a guide etc... This is an entire other thing to write about.",
  "So, alone, I filled a bowl with screen and hit it three times. I was on the floor as it is suggested and I re-assert this suggestion. Be on the floor when this hits. It cherried nicely. As the third hit was being held everything went away. I got the little buzz first, for a second, it was similar to my first experience with sage where I did not smoke enough. I thought, oh am I gonna get off this time....I was floored. I have read you should close your eyes. I couldn't or I didn't. My field of vision was transformed into a bizzarre living cavorting thing made of little fragments of details from the last moment before the drug hit. They moved in gear like shapes and the whole world was breathing, space was infinite in  my apartment, the walls were gone, or see-through, I felt like I was being pulled to the floor, I could not get up, there was a man I know in my room all of a sudden,(he was not 'there') I saw farther than I could see, my eyes open on the floor, there I watched time elapse outside of my visual field, things happened with my family odd things transpired time passed, and anxiety filled all the spaces.",
  "I have been thinking about serious things in my life and I suggest not doing this drug when there is an ounce of anxiety in your life. Well, at least when there isn't a ton of it. The anxiety became the world with the gears moving the walls missing, sound like in a huge funnel, breathing, space on forever. This was about 30 seconds or a minute and then I looked at the clock and just thought 'GOD DAMN' there was alot of god damn last night. I couldn't believe how high I had been. I stood up, still high, but not as high. Everything was strange, out of place, charged with emotion, slightly anxiety coated. I was scared that I was too high, that 'doctors' were coming already to take me away. I lay back down and babbled into a tape recorder. Within the hour I was down, and by two hours later I wasn't even too revved up.",
  "Today I feel odd. After an early acid trip when I younger I remember feeling 'different' altered, and I was sad because I liked the 'old me' and I was scared. I have a similar thing today though as the night approaches I feel more like 'myself' whoever that is. I realized this morning that when I fuck with time and space in my head it doesn't make me feel closer to other people. It can be a little alienating. The worst thing I have experienced, though it too is wearing off, is a feeling under everything that NOTHING matters. And I am not that kind of person at all. Be careful with this drug. It's a freight train experience, I imagine somewhat like cliff diving or bungee jumping in its extremity."
 ],
 "erowid": {
  "id": "6065",
  "citation": " Fool, overconfident.. \"I Say Use A Sitter Too, Very Odd: experience with Salvia divinorum (5x extract) (ID 6065)\". Erowid.org. Feb 8, 2002. erowid.org/exp/6065",
  "substance": "Salvia divinorum (5x extract)",
  "views": "16024"
 }
}
