{
 "title": "Sedona Sunshine",
 "author": "MDon",
 "citation": " MDon. \"Sedona Sunshine: experience with AL-LAD (ID 101188)\". Erowid.org. Aug 31, 2013. erowid.org/exp/101188",
 "substance": "AL-LAD",
 "bodyweight": "180 lb",
 "report": "<p>Note- I had no recollection of time throughout this experience so Ill just describe the night as I remember it.</p><p>I had taken 1 blotter about a month before this and had a very nice experience, one that I thought was worth a trip report. Well, being in Sedona (one of the most spiritual places in the country) ON TOP of taking a higher dose, gave me an experience I will never forget.</p><p>My self and four friends were on a backpacking trip in Sedona and we arrived at the national park at about 5pm after driving 40 minutes on a dirt road. We were anxious to trip while the sun was still up so we rushed to our hike.</p><p>After about 45 minutes of hiking my friend T (remember: friend T is trippin) and I drop 1 and a half blotters each. We continue to find a good place to set up our tents.</p><p>30 minutes later weve arrived at a perfect clearing with beautiful views of the red rocks and horizon for the sunset.</p><p>Im starting to feel spacey and I start to get a little nervous, I havent even become acclimated to our campsite yet and Im already starting to come up, hard.</p><p>Somehow I set up my tent and look to my friend T. With an uncomfortable look on his face he says, I dont even know how you did that, Im TRIPPING.</p><p>Note- this was Ts first time trying a psychedelic drug and I was somewhat nervous for him and how he would handle it. Naturally, I start to worry a bit after seeing the look on his face.</p><p>I decide to remove myself from the campsite that there is literally nothing to do at so I can enjoy my trip and come up in peace.</p><p>I start to walk up this red rock hill looking for a place to meditate. There is no comfortable place to sit, anywhere. I keep walking, thinking to myself Cmon, youre tripping acid in SEDONA, the universe is going to give you a perfect spot to sit.</p><p>Sure enough, there is a single flat rock that looked comfortable to sit on with two little flowers growing on each side of it. I shit you not.</p><p>I sit down and start to focus my breathing. Instantly, Im in another world. My thoughts are so deep and complex that I completely separate from reality.</p><p>I snap back and I bring back a deep vibrating sound that continues around me. It was kind of a wub-wub-wub vibration. I thought to myself, its the earth. Sure enough, I hear a higher pitched vibration and I knew instantly that it was mine.</p><p>I open my eyes and for the first time ever, I see patterns. It was beautiful, I had read so much about psychedelics and about peoples experiences that I thought I understood what it meant to see patterns. But no, experiencing for myself was surreal. I saw the flower of life creating a dome around me along with fractals and many other geometric shapes. They didnt look solid, but almost holographic?</p><p>The sky was purple, and the orange of the sunset was created by each color of the spectrum and I could see it all.</p><p>In this moment, it felt like the weight of the universe was being pushed in on me all at once. It was very intense and I couldnt move.</p><p>Im convinced that the chemical is only half of the reason Im tripping my balls off. The other half was the landscape. Sedona is the most spiritual place in our country, with high electromagnetic energy, energy vortexes, and twisting juniper trees. This is so intense because this land is so high in energy  Im convinced.</p><p>I hear my friends M and T coming up the hill looking for me, they sound very worried. I called them over and the look on Ts face hasnt changed much. He is able to laugh at things but would regain that nervous look quite often.</p><p>The sun was going down so we walk back to the campsite. Light is bouncing off of all of the little plants on the ground making everything look spiky and like a cactus.</p><p>When we get back to the campsite, we face the same problem again. An empty space with nothing to do in it. I begin to try and explain the experience I just had to my friend and find that I cant, I would get half way through a sentence and my mind would be 10 steps ahead. It was very frustrating.</p><p>I look to T again and ask him what hes seeing. He responds, Dude, How are you even holding a conversation, I dont know how youre even doing it. I need to just go trip in the tent, Ill feel better in there. I joined him. We sat in the tent and tried to gather our thoughts. My consciousness leaves my body twice; my head just would float in to empty space. When I would come back to reality I literally had to check if I shit my self. Thats enough of that Im saying to myself and get the hell out of that tent.</p><p>At this point Im pretty sure Ive taken too much and Im not going to have a good trip whatsoever, because up until now it was just so much to handle.</p><p>I start to become anxious so I grabbed a glow stick out of my pack. My friend B makes a toy out of it for me and starts to swing it around in circles very fast.</p><p>B, you have no idea what you are creating right now. I said to him. At this point, I was not amused by the trails of the glow stick. I was amused by the patterns that were being created on the inside of the circle. It was a very vivid flower of life that became more complex when he would spin it fast and became simpler when he would spin it slowly.</p><p>After T and I had had enough of the trippy green light, we looked up at the sky. It was the clearest we have ever seen the Milky Way. At this moment, T and I both broke out of our intense come-ups and were peaking.  All we wanted to do was go back up on that hill and stare at the stars.</p><p>The Milky Way was so clear to me that it looked as if someone had been holding a flashlight behind it and was even moving it around. Allowing me to see each section of it in great detail.</p><p>We walked up the same hill I had meditated on and started taking open exposure pictures of the stars.</p><p>After an hour of talking about life, existence, materialism, perception, pretty much anything, I took the greatest picture of the stars. This beauty helped me come to realize with the help of M and T, the most beautiful life realization I couldve come to. To top it off, there were two consecutive shooting stars.</p><p>I started sobbing, I couldnt help it. I had never been so content, so sure, so happy, so amazed in my life, and for all of it to happen at once was incredible. It was the single greatest moment of my life and I couldnt believe it. It was as if my entire life had come full circle and there was nothing else except that very moment.</p><p>Unfortunately, the realization will be kept between M and T and the ones closest to me because it was life changing, and so personal.</p><p>After another hour of talking with M and T we heard a disturbing noise come from towards the campsite. It honestly sounded like a dying animal, the sound recurred 3 more times and we decided we should go make sure our two other friends were alright.</p><p>We never found out what the sound was but at this point we were coming down after what felt to be about 6 hours of a trip.</p><p>Before getting into our tents T and I just stood there in silence trying to piece together what happened those few hours. It was hard to think any more. Our brains felt like a library with no books left to read. We got into our sleeping bags and passed out easily.</p><p>Waking up the next morning was great; we watched the sunrise over the mountains and cleaned up the campsite. Feeling refreshed, and in a clear state of mind the trip was everything we had hoped. We hiked out and took one last look back on the canyon that had changed our lives, and then headed out.</p>",
 "year": "2013",
 "id": "101188",
 "gender": "Male",
 "age": "20",
 "timestamp": "2013-08-31T07:00:00.000Z",
 "views": "2425",
 "dose": [
  {
   "time": "0",
   "amount": "225 ug",
   "administration": "oral",
   "substance": "AL-LAD",
   "form": "(blotter / tab)"
  }
 ]
}
