{
 "title": "Definitely No Trippy Hallucinations",
 "author": "Rimbaud",
 "citation": " Rimbaud. \"Definitely No Trippy Hallucinations: experience with Absinthe (ID 10118)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10118",
 "substance": "Absinthe",
 "bodyweight": "175 lb",
 "report": "<p>Absinth has been made legal in the UK fairly recently, and luckily my flatmates mum gave him two bottles as a gift for our flat when we came back to university. after the summer. We went through the first bottle relatively quickly but we never got drunk (or whatever) on absinth alone, instead we would have a few drinks sipping it over some ice then proceed to drink or smoke whatever else. So when the second bottle was about a 1/3ish gone we decided someone should try drinking just absinth for the night. It was standard grade Sebor absinthe and the taste itself was not all that unpleasant similar to Pernod (which I believe is just absinth with the infamous wormwood oil taken out). But there's no denying this is potent stuff and definitely one to be careful with. I would definitely still say that drinking absinth is essentially getting drunk just like any other booze, but it is different. Similar to the way that getting drunk on wine I've always found is a bit different than getting drunk on beer.</p><p>However absinth was definitely something different. It seemed to me all inhibitions were gone like booze always does but my mind felt much more clear although that's not to say logical or rational. I don't honestly remember much and was mortified to find out the next day I ended up running around in my underwear in the garden and jerking off in front of my room mate. If my experience counts for anything I'd definitely say watch out with this in that I'd say it is definitely getting drunk but in a much stronger way and definitely a very wild experience. Normally when I get drunk I never seem that drunk or act it and people are often surprised when I tell them how pissed I am but with absinthe it was like getting drunk for the first time all over again and everyone was in hysterics over my antics. I honestly think I understand why Van Gogh cut his ear off, while probably pissed on the green lady. But definitely no trippy hallucinations of seeing things crawling out of the wall paper or whatever else. So if you want to do it buy it online and just be prepared for some mayhem.</p>",
 "year": "2001",
 "id": "10118",
 "gender": "Male",
 "timestamp": "2005-07-14T07:00:00.000Z",
 "views": "20488",
 "dose": [
  {
   "time": "0",
   "amount": "400 ml",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ]
}
