{
 "id": 10118,
 "title": "5-HTP can ruin Ecstasy",
 "date": {
  "submission": "2000-10-08T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Anonymous",
  "weight": 73
 },
 "dose": [],
 "report": [
  "I started reading many of the newsgroups that pertained to psychedelics.  Mostly, I was looking for information on how to improve my roll on ecstasy.  I had read on several occations that taking 5-htp (an amino acid which rebuilds serotonin) was reported to actually improve the roll.  According to what I read, it was advised to take 5-htp about 45 minutes before taking ecstasy.  This was reported to increase the high and lengthen the duration of the high.",
  "After I started following the preloading advice, I did notice a change in the way ecstasy worked on me.  The change was unfortunatly for the worse.  I had always thought that my dealer was giving me placebo pills because the high was either non-existent, or was very mellow.  It didn't even occur to me that an amino acid could have such an effect on such a powerful drug like mdma. ",
  "This dampening effect was most apparent on Friday night when I took 150 mg of 5-htp about 1 hour before taking ecstasy.  I took this ecstasy pill (brand name D&G) and waited almost 2 hours without noticing any effect.  To say the least, I was feeling kinda down because I had blown almost $60 on a couple of pills that seemed to do nothing. ",
  "So later that same night, when the bar was closing, I went outside  to go back to the car.  Upon going outside, I noticed the slight buzzing effects of the ecstasy; almost as if I was comming down from a high.  Apparently, I didn't even know that I was under the influence while I was in the bar.",
  "The next night I was browsing the newsgroups and had noticed and entry about 5-htp.  In this entry, it had stated that taking this amino acid right before, or while taking an ecstasy pill will actually diminish the effect, but prolong the duration.  According to what the guy said in his posting, he stated that you should wait a minimum of 6 hours after taking 5-htp before taking the ecstasy pill.  He said it was actually better to take the 5-htp right after you have come down from the roll; just before going to bed.  So, I decided to follow his advice before I went out. ",
  "I had not eaten for 8 hours, I had taken no preloading vitamins (this time), and only drank water.  I had a hit and a half of the same kind of pills I had Friday night.  I took both of them at once in fear of getting caught for possession.  I figured that I probably MIGHT roll a little harder but I wasn't sure.  So, I waited for about 45 minutes and still didn't really feel the efects of the drug.  I decided to buy another pill in the bar.  Again I downed the tab right way so I would not get into legal trouble.  About 5 minutes after downing the second whole pill, I started to feel the effects of the first hit and a half.  The roll started to hit me really hard, and I thought to myself....'Oh shit! What have I done now!'  I decided to warn my friends around me that I had taken 2 1/2 hits of ecstasy and told them to please keep an eye on me.",
  "This was the hardest roll that I had ever experienced.  I must have been on cloud 9.  The total peak time must have lasted a good 3 hours.  This legnth in time was starting to worry me, as the bar's closing time was only 30 minutes away, and I would have to be driving home soon.  Fortunately, my high was over right at the time the bar closed (how perfect).",
  "When I got home, I took 150 mg of 5-htp and went right to sleep.  This did make my waking up easier and I didn't feel like I had been hit by a train like I normally do after taking e.  So the guy's advice was correct.",
  "There are a couple of morals to this story.  First, don't believe everything that you read.  Secondly, wait at least an hour and a half before downing more than one pill; I could've gotten into a lot of trouble, but was pretty lucky this time.  Lastly, the best preloading is to wait at least 2 weeks (that's two weekends) without taking ecstasy.  Try to enjoy your weekends while being sober... it may not sound like it's fun, but it really is.  Just remeber that you can chose to be just as empathic as you are while you're on the drug.  What you throw out at people will always come back to you.  That's what ecstasy has taught me.",
  "Have fun and be safe & healthy!"
 ],
 "erowid": {
  "id": "607",
  "citation": " Anonymous. \"5-HTP can ruin Ecstasy: experience with Ecstasy & 5-HTP (ID 607)\". Erowid.org. Oct 8, 2000. erowid.org/exp/607",
  "substance": "Ecstasy & 5-HTP",
  "views": "27649"
 }
}
