{
 "id": 10110,
 "title": "I Can't Forget",
 "date": {
  "submission": "2008-04-18T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "somewilliepete",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "Sometimes I just don't get it...  How can the government make such beautiful things illegal, it makes me want to scream.",
  "Anywho, it was time for my friend J's last rave with us in the Arizona crew as he made his way to Cali.  We took a quick drive to [an event].  I had planned to take X again, so that was the first thing I was looking for.  Security confiscated my shopping bag of water, but let me keep my smokes. I got into the door and met up with M, K, Dee, Beezle, Bi, Hows, J, and Hed.  Hows got the X for us, it was two for $12, 'double stack' Blue Crosses.  I took two and so did nearly everyone else with the exception of M, K, and Beezle.",
  "Around 1Hr and 30 Minutes",
  "I finally hit, I could feel the tingle creeping up my spine, and began to instinctively bob my head to the music.  Five Minutes later I was swamped with it.  It was beautiful, I was covered in vibrating particles of bliss, and felt as if I wasn't even sitting on the floor.  Shortly thereafter I felt the need to burp, and it wouldn't come out.  The longer I couldn't burp the more I felt like my throat was getting closed up.  I gagged...  I realized I was going to puke.  It wasn't in my stomach, (the feeling that is), I just knew it was going to happen.  I stood up walked to the trash, and vomited.  The whole experience wasn't like puking with mushrooms or alcohol, it felt GREAT.  For a few minutes I thought I just puked my buzz away, but it came back.",
  "People who don't go to raves don't understand them, you can tell them, but they won't believe it.  People really are that nice, I was offered water every two minutes, given back massages by completely random people, got lightshows all the time, and returned the favor also.  I enjoy being nice to people.",
  "Things just felt great, even sober I have to say that I would be having a good time there with everyone.  My mouth started to hurt from the gum that I was chewing on.  I followed Bi around for a bit and finally got to know him, it was the first time I met him.  We ended up starting a little love fest in our corner of the room, and I laid for most of the next two hours kissing random women and girls, and writhing together on the floor.  Even though I was highly aroused, I just didn't get an erection.  I had only wanted one for a short while, but my attention span was pretty small, and I ended up using my mouth.  It was a bad choice that I would have made while sober, but I wasn't sober so it was even more fun for me.  There is something weird about the sensation of being so close to somebody, the smell, the heat on your face, the taste, the skin.  It just seems perfect.  She was a random person, and she was on X too.  When she was thoroughly satisfied, we both ended up giggling and laughing and saying thank you at the same time.  I invented a few new tricks to play on people who are rolling or shrooming that are based on my hypnotism techniques, but inspired and invented while I was rolling.  These only really work if one has the voice and the technique to work it.  I learned about hypnotic voices in books and on the internet.",
  "****",
  "Sit next to the recipient on the floor (indian style) with your body facing their right side. Gently rest your face on her temple and bring your mouth close to her ear.",
  "Me:'Can I hold your hand'",
  "Take their hand, and put your fingers between theirs, grasp loosely and lightly.",
  "Me:' Now close your eyes and imagine.  You can see the outline of the room now, and the outlines of people become clear.  In the room there is a hazy light yellow mist, that vibrates with a pure beautiful energy.  It is flowing from the people and through the room full of vibrant perfection.  And as we sit together my body begins to pull in the energy like a vacuum.  The more energy my body pulls in the hotter my hand feels.  I pull in more and more of the vibrant energy, and my body begins to glow a bright yellow.  My hand gets extremely hot'",
  "Grip her hand tighter, and pull in closer.",
  "Me: 'And as I grip your hand and get hotter and hotter my hand begins to melt into a thick hot liquid.  My hand coats your skin and it feels as if it is slowly flowing through your skin into your arm.  The hot energy comes with my body and fills up your arm, every vein is hot and filled with a vibrant and beautiful energy.",
  "Slowly blow hot breath from her hand up her arm, one or two times, SLOW AND HOT.",
  "Your body is now filled with a beautiful and vibrant energy, and your arms and skin vibrate with and intense energy.  It is so beautiful and perfect.'",
  "Blow on her face and neck with your nose, and then kiss her hand and let go.",
  "----",
  "It is taking me a little bit to finish this one, but I find that to be good.  Only because yesterday I felt pretty bummed, perhaps it was the X or maybe just J leaving.  Either way I felt sad.",
  "I love X, I have to admit it, I won't stop.  But in reality, X alone loses some of the special value that it has at a rave.  The whole atmosphere, the kindness, the music, the dancing and the fun.  That is what I want, I wish I could have that feeling forever.",
  "Now, only memories are left of the great time that I had."
 ],
 "erowid": {
  "id": "60665",
  "citation": " somewilliepete. \"I Can't Forget: experience with MDMA (Ecstasy) (ID 60665)\". Erowid.org. Apr 18, 2008. erowid.org/exp/60665",
  "substance": "MDMA (Ecstasy)",
  "views": "3614"
 }
}
