{
 "title": "Speed Freak Jive",
 "author": "Bill Samuels",
 "citation": " Bill Samuels. \"Speed Freak Jive: experience with Adderall (ID 10125)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10125",
 "substance": "Adderall",
 "bodyweight": "175 lb",
 "report": "<p>I finally convinced a quack doctor that I had ADD ('Oh, I can't concentrate, you see'). He wrote me out a prescription for ninety 10mg Adderall tablets. I remember kind of dancing and humming the Who's '5:15' as I waited for the local CVS to fill the script. I got the pills home, ground up four in my mortar/pestle, and dumped the powder in a cup of steaming coffee (the crushed pills dissolved completely).I sipped the hot java, smoked a cig, and watched Real World 10 on the MTV. A televised Coral was yelling at Mike about his insensitivity when the first wave of Amphetamine pleasure hit.</p><p>Suddenly, the Real World took on a deep significance. It really was the Real World, 7 strangers picked to live in a house, and wow Coral has a set! I sat rapt, coming up with deep sociological math problems to describe the cast's onscreen situation. I was so smart, these pills made me like Charlie in Flowers for Algernon.</p><p>Anyway, after the Real World was over, I had an urge to play my guitar. I inherited my Grandfather's Gretch Hollowbody Electric when he died, but although I'd had some rudimentary training with the guitar, I'd let the six-string gather dust in recent months. With my mouth doing all sorts of weird Mick Jagger movements (a annoying side effect of the Adderall), I plugged in the Guitar, and without thinking busted out the fattest, most evocative riff that I had ever heard, much less created. An hour later, I had written three new songs, good songs. One song dealt with the Columbine tragedy through the eyes of the killers. Another was a slow blues, a tribute to the Amphetamine mania that created it. And then there was my favorite composition: Arizona Traintrack Sunset.</p><p>I played the guitar for a few more hours, forming blisters on my fingers but enjoying my speed freak virtuosity too much to stop Hendrixing. And believe me, to my Adderall ears I sounded like a cross between Jimi Hendrix and Jimmy Page. I later went and hung out with my buddies, handing out the Addies like candy. I didn't charge money for them, for I truly believed that they were like some sacred medicine that needed to be shared with the world. My friends all seemed to agree! We went to a couple parties (where I felt like Hugh Hefner), talked deep for hours, and cleaned my buddies trailer from top to bottom, and smoked a lot of pot. Pot goes great with Adderall! The sun was coming up when I decided to try to sleep.</p><p>I went home, hopped into bed, closed my eyes, but sleep eluded me. I was still way amped. So I did what many people without a lover would do in this situation--I started masturbating. Her name was Mindy. In my mind she was as real, sharing my bed, her dark hair brushing my face as she succumbed to multiple climaxes. We made love for hours. When I finished my hand was numb and my penis just looked bad. I could almost hear it saying, 'Why bobby, why?'.</p><p>Over the next three days the initial pleasure morphed into a flying paranoia. As sleep deprivation set in, so did the hallucinations. Little Zelda men would run across the room, everything in my vision seemed to stretch out like taffy, and something happened in my front yard that was just plain weird, but indescribable. My heart raced and pounded beyond even my coke rate, and I thought that I had overdosed and would soon die of a heart attack or stroke. That was a very unpleasant feeling! Lines from the movie Deliverance kept circling my consciousness: 'You're ruined Lewis, ruined!,' 'Don't evah do dis agayin,' 'Why do come on these trips with me, Ed,' and most of all 'Now you get to play the game!' Those movie quotes were they best way my mind this extremely intense experience.</p><p>I lost 12 pounds over those four days, and for awhile I was scared that I had lost my mind like on a permanent basis. It was kind of scary. The depression following withdrawal was extremely harsh, even suicidal at times. I did not get my script renewed because I realized that Adderall is an extremely bad thing. It is like an angel that makes love to you, gives you all these powers, and than rips off its mask and says 'Hi, I'm Satan, welcome to hell!' Its been a month since that four day binge, and at times I'm still tempted to see that quack doctor 'one more time!'</p>",
 "year": "2001",
 "id": "10125",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-14T07:00:00.000Z",
 "views": "20845",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(ground / crushed)"
  }
 }
}
