{
 "title": "Where's My Bowling Ball?",
 "author": "the Paperboy",
 "citation": " the Paperboy. \"Where's My Bowling Ball?: experience with Dimenhydrinate (ID 10129)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10129",
 "substance": "Dimenhydrinate",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "1200 mg",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I had been wanting to TRIP for quite some time when two friends of mine, Stefani and Melissa, told me about Dramamine. I had heard a little about it, but people said it was weak and didn't work. They told me it did, and they had done it several times. So, of course I had to try it cause I wanted to trip. But the trip was very unlike LSD.</p><p>I ingested 24 pills, which I believe is 1200 mg, at one time. Why? Because Stef had always taken 24. Oh well. About 30 minutes later, I was supposed to be wigging out, but I just felt like I was beginning to trip, or that I would be tripping soon. I felt nervous and kept hearing things.</p><p>An hour later, and still not really tripping, my friend Ricky came by my house with everyone's favorite pastime activity, Marijuana, and offered to smoke a couple of bowls with me and the girls. That was it. I didn't know if I was STONED or if I was tripping. First, Ricky disappeared. That freaked me out. After that, the girls said I was walking around playing with movies and the VCR, which I don't remember doing.</p><p>Apparently, I got bored, so we went to the girls' house, about 30 minutes away. In the back of their car, I started looking at the stars and the clouds and the road and the trees and everything. I felt like I was rolling. Everything caught my attention. It was actually quite pleasant.</p><p>1 hour and 15 minutes after ingesting the pills I guess I was having a full-blown trip, but I did not even realize it. At the girls' house, I had horrible cottonmouth and couldn't drink or eat anything. I asked to go outside:</p><p>'I can see the earth revolving.'</p><p>'How fast is it going?' Stef asked.</p><p>'I don't know, its one of those miniature scoreboards that you see when you go to the baseball game. Do you see it?'</p><p>'See what?'</p><p>'The cloud of smoke just switched places with the stars. Holy shit my mom is home.'</p><p>'We're at my house, don't worry your mom is not here.'</p><p>'Can we go inside?'</p><p>'Sure.'</p><p>Inside, I started watching the TV, which wasn't on. The screen would remove itself from the TV set, float about five feet, and twitch and convulse and then pop back into the TV set. Wicked shit. Their were blue flames coming from my fingertips, the ceiling was crawling with bugs, and I couldn't play my video game anymore (which I thought I was playing, but wasn't). I was sitting in a field of marijuana. I was happy. I started removing buds from the plants and sticking them in my bowl. Keep in mind I'm tripping. After I 'smoke my pot' I sat quiet for about 10 minutes and blurted out 'Where is my bowling ball? Did Jason steal my bowling ball? It was just there.'</p><p>I don't remember much of the trip at all, and since then I have done it 3 times. Very real type of trip, but can be unpleasant as I learned in my latter tries with it.</p>",
 "year": "2001",
 "id": "10129",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-14T07:00:00.000Z",
 "views": "7933",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 ]
}
