{
 "id": 10121,
 "title": "Things I Won't Try Again",
 "date": {
  "submission": "2007-10-16T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "One Timer",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.125 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:30",
   "amount": "0.5 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(plant material)"
  },
  {
   "time": " T+ 2:00",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 2:30",
   "amount": "0.5 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>I was hesitant submitting this story due to privacy concerns, but since I didn't see any other listing for this combination I thought my story should get out there.",
  "A few months I took some mushrooms with a friend.  Since the quantity of mushrooms was less than desired I decided to put together a psychedelic sampler.  Per the title: won't do that again.  In the end I feel it was the Kratom which was the wild card.  The Mushrooms Cannabis Combo was something Ive had plenty of success with in the past.  We took approx. 1.125 grams of your standard magic mushroom.  One half hour later we took a 1/2 teaspoon of Kratom. What grade I couldn't say, but it must have been high-octane.  One half an hours after that, we smoked a joint of some high end hydroponic bud.  Time elapsed approx. one hour. ",
  "The effects of all three blended together creating an amazingly euphoric high.  We were discussing this as the 'trifecta of good times.  We felt like we'd discovered a whole new thing and wanted to spread the good news.  At this point I decided to up the ante with another 1/2 teaspoon of Kratom.  A half hour later I could feel the effects of this second helping of Kratom taking hold.  It's been a bit since this happened, so I can't get super specific about the buzz.  Visually I was having wavy, blurred, and distorted vision.  Physically I was warm & euphoric.  To this my friend decided he was going to try more Kratom as well.  This is where the wheels came flying off.",
  "He had decided to make it in hot chocolate, and went about preparing that as I sat down and had a cigarette.  As I was smoking all the sudden I was overwhelmed with a sense I needed to lay down.  Next thing I know, my friend is standing over me on the kitchen floor trying to wake me up.  I had convulsed at the table and passed out.  I was weak, disoriented and had trouble speaking.  After laying there for about five minutes, unable physically to do much, he/she tried to sit me up.  I immediately passed out again.  At this point my friend, who's a nurse, took my pulse.  I was running at between 35-40 beats a minute, which is exceptionally low from my understanding.  After a half hour I was able to stand up and walk to the bathroom. ",
  "While I was standing in the bathroom (I'd been upright for about 3 minutes tops) I felt myself passing out again.  Since it was coming, I decided to start heading in that direction while still conscious and somewhat in control.  Trying to yell for my friend, I again couldn't speak.  Groundhog Day!  I woke up to my friend standing over meagain.  This time he insisted we go to the ER.  I was able to convince him that third times a charm, and if that happened I'd go. ",
  "I was able to drag myself into the living to lay on a couch using only my arms.  At this point my legs weren't altogether cooperating and by raising my head too high I risked passing out again.  Then I'd be heading to the hospital.  Things had gone terribly sideways and I didn't know what to do other than ride it out.  But let me say this: I've ridden things out before.  This wasn't my first rodeo.  But in all my experience, this was the first time I didn't know if I was coming out the other side.  I started to wonder if this was what OD'ing felt like.  My friend, who deals with dying and nearly dead folk all the time, was terrified.  Both times I passed out he/she had trouble waking me up again.  I had nothing to gauge this experience against. ",
  "For the next half hour I fought off passing out because I didn't know if I'd wake up again.  I was really afraid Id close my eyes and never wake up.  After this time passed I began to feel the effects waning and I knew I had turned the corner.  About half an hour after that I felt fine, this being relative to the condition I was in to begin with.",
  "Total elapsed time, about 3 hours.  This was not fun or enlightening.  This was dead-ass bad news for me and my friend.  Both he and myself thought I was going to die.  To be honest, I took awhile writing this because I didn't want to put the story out in cyberspace-privacy concerns and what not.  In the end I decided to go ahead because I think people should know what they're playing with here.  I wrote it because Id feel horrible if this went even worse (death, coma, who the hell knows) for someone else and I hadnt done something to help.</p>"
 ],
 "erowid": {
  "id": "60718",
  "citation": " One Timer. \"Things I Won't Try Again: experience with Mushrooms, Kratom, & Cannabis (ID 60718)\". Erowid.org. Oct 16, 2007. erowid.org/exp/60718",
  "substance": "Mushrooms, Kratom, & Cannabis",
  "views": "17973"
 }
}
