{
 "id": 10138,
 "title": "Hello I Am Here, How Are You?",
 "date": {
  "submission": "2007-09-14T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tryphen",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "11"
   },
   "administration": "oral",
   "substance": "2C-T-21"
  }
 ],
 "report": [
  "I tend to take a substance tens of times before I write a trip report on it, but I think after only a few uses I already have the feel for 2c-t-21, and it is pretty much best summed up by saying",
  "Hello, I am here. Not much going on, how about you?",
  "That is pretty much what 2c-t-21 says to me when I take it. No great insights to speak of, hardly any psychedelic effects other than a very mild brightening of colors, headspace is pretty much everyday reality with a slight shift to the paranormal but nothing with much personality like other 2c-X chemicals. Stimulation is the most noted effect I have thus far discovered, and even it is mild. It isnt a",
  "clean your house and count your tooth picks stimulation, such as meth.",
  "It is more of a",
  "Hey dont go to sleep asshole, you have guests in your body and we are not going to leave for another seven hours!",
  "Not really a",
  "You want to sleep but cant sleep",
  "Stimulation, more of a",
  "you might be able to get to sleep but probably not, and why would you go to sleep anyways?",
  "Stimulation.",
  "Sort of a stoned feeling I guess but I imagine I could still get around to stuff. Stimulating as in I dont particularly want to sleep, stoned as in even though I cant sleep I am not particularly driven to do anything. Music sounds about the same as ever, perhaps a bit clearer? Taste seems about average. Touch feels softer but it sure isnt blowing me away.",
  "Nice compound and worth a try but it is far from my favorite phenethylamine. I think this  substance would do well with a person who has never tried a 2c-X compound before, provided they dont take a lot of it as I hear in higher doses it can be a bit more pushy.",
  "I will do it again I am sure. I think it would be a great drug to take for a relaxed yet stimulated sexual experience with ones significant other (although maybe only morning sex as sleep will no be easy.) Also a great drug for school or something, eye dilation didnt seem to be a big thing for me. Although my eyes are perma-dilated (I have big pupils naturally), and I have not used this enough to look at my eyes in the mirror frequently in order to remember eye dilation as being particularly bad or not so bad. But I dont recall it as being very bad at all. If my eyes are dilated I want to know why because the visuals are next to non existent =P.",
  "It is worth noting that I have been pretty much abusing psychedelic phenethylamines for the past week, 2c-t-2 every other day, 2c-e once or twice and 2c-X in the morning, so I am sure I have some (probably large) degree of tolerance.",
  "For all I know if I stay week for two weeks and try this again it will be much different. But some part of me doubts it for some reason."
 ],
 "erowid": {
  "id": "60808",
  "citation": " tryphen. \"Hello I Am Here, How Are You?: experience with 2C-T-21 (ID 60808)\". Erowid.org. Sep 14, 2007. erowid.org/exp/60808",
  "substance": "2C-T-21",
  "views": "6076"
 }
}
