{
 "id": 10135,
 "title": "First Trip With Uncle",
 "date": {
  "submission": "2000-09-18T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "George B.",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "This story is being composed in hopes to help anybody who might find themselves in similar situations while experimenting with hallucinogens.  The story begins...",
  "I was 17 at the time, and I had just finished high school.  I was in high spirits with it being summertime and all.  I have an Uncle from California (I live in NJ) who usually visits every summer.  He has always been great with me, so I try to spend as much time as I can with him for the short time that he's here.  Well, this was a time I would NEVER forget!!!  =)",
  "While my Uncle visits us in NJ, he stays over my Grandmother's (his Mother's) house.  So I decided to stay the night over her house to hang out with him, talk, listen to music, play guitar, or whatever, because he is really great to be around.  It must've been around 8:30pm as it was just getting dark.  We decided to go for a walk to the store to get a drink on that warm summer evening.  As we were walking back to my Grandmother's house, he suggested that we should 'trip' tonight.  I was a little surprised, as I wasn't aware that he had any LSD with him.  I told him that I had never done it before, and he seemed shocked.  He said 'Oh man, George!!!  We've gotta trip tonight!'  He seemed really big on the idea of it being my first time, and him being the experienced mentor.",
  "We walked back into the house, and upstairs to where the spare room was that he and I would be staying.  It was around 9:30pm now, and my Grandmother was in her room across the hall getting settled to go to sleep.  We closed the door to the spare bedroom, and discussed how much I should take.  He was fumbling around in his suitcase, and I told him that I thought I should only take one hit, since i'd never done it before.  He waved his hand at me as if to blow me off, and said 'Ahhhh, you'll be fine with 2!'  Now, you must understand that through his eyes, 2 hits of today's LSD IS nothing, because he comes from a time, the 60's of course, where people were taking 10 hits of much stronger acid, usually in the 400-600 ug (micrograms) range.  However, I reluctantly decided to place all of my trust in him, as he'd never done me harm before.  I took the 2 small tabs out of his hand, and put them in my mouth.",
  "He suggested that we go downstairs to watch some TV, as there would be a little time before anything would happen.  I followed the leader.  I was laying on one couch, and he was on the other.  We were flipping through channels, not really saying a word to eachother.  I was finding myself absorbed in the TV, but otherwise fine, not really feeling any different.  My Grandmother has a sillhoulette in the living room, which was right behind the couch I was lying on.  It had been about 1/2 hour since we initally dropped the tabs, and I was looking through the sillhoulette now, and noticing small colorless kalidescope like patterns all over it.  I blew it off as it just being the way the light looked behind it, through the silky material.  But I noticed that I couldn't help but to keep staring at it, and my body felt energized, electrically charged.  I suggested to my Uncle that we go back upstairs to the room, that I was starting to feel weird.  He must've not been feeling it yet, because he said to me 'Are you sure?  Already?'  I told him yes, and thankfully he agreed, and we walked up the stairs, and opened the door to the bedroom where we would spend the rest of the night.",
  "It seemed as though the moment we opened the door and walked into the room, it was like stepping through the door to another dimension, much like Alice going into Wonderland.  At this point, I realized that the trip must be in full bloom.  'I must be peaking now..' I thought to myself.  The lights were on in the room, and I decided to sit on the bed and play around with my acoustic guitar that I had brought over.  I passed that idea quickly when I realized that I could hardly play a note; the guitar somehow seemed foreign to me now, and felt very awkward in my hands.  I put it down, and sat back, talking with my Uncle.",
  "For some reason, my Grandmother came banging on the door.  She seemed to be mad about something, but it was hard for me to hear her with all the whirring and swooshing noises going on around me, or was it in my head?  =)  She walked in, and I broke out in hysterics!  I was laughing so hard on the bed at the mere sight of her!  She looked tired, with one eye open (obviously we had woken her up) and her hair seemed to not be attached to her head!!  It looked as though each single strand was an energy bolt of sorts, and was extending out, alive from her head!  The thought and sight of that caused me to double over in laughter.  Now understand, that this was strange for me.  This was the first time where I wasn't able to control myself.  I'd always prided myself on being a person able to deal with any situation that may arise while I was on drugs.  I had smoked pot many, many times before, and never was unable to control myself if I had to, whether it was near parents, cops, whatever.  Now, here I was laughing perhaps harder then I ever had, right in my Grandmother's face!!!  She was yelling something about us having the windows open in the room while she had the central air going.  My Uncle, obviously experienced in having to deal with situations while tripping, quickly patronized her, shut the windows, and rushed her back to bed.  We closed the door behind her, and decided to be a little quieter.",
  "We turned out the lights in the room, and went only by the street lights shining in from outside.  This was sufficient lighting to see each other and find things in the room.  I was really spinning now, I had a million thoughts going through my head at once, almost as a slideshow, but in a split second.  My Uncle decided we should listen to some music, and we chose the Beatles' White Album.  (For anybody that wants good music to trip to, listen to this!)  I laid myself back on the bed, and my Uncle sat near in a chair in a corner adjacent to the bed.  The music was strange and alive, and although I had heard this album numerous times, I heard things in it that I never had before.  My Uncle and I weren't talking at all now, just enjoying the music.  Well, at least he was.  I was far too caught up with what was going on in my head and in front of my eyes.  What was strange was how any sound I heard produced a corresponding hallucination.  I kept feeling as though I was slipping in and out of consciousness, but during the times of 'unconsciousness', I was fully aware of my being unconscious!  My eyes seemed to be closed, and I saw millions of patterns of cobweb and honeycomb like visuals, which would spin towards my field of vision, rotate, fade out, and then the next one would begin.  All the time, they would be changing color as well.  I remember green being a very dominant color in the entire experience though.",
  "I seemed to have 3 separate points of consciousness;  My main awareness, which knew that I was on acid, was at my Grandmother's in a room with my Uncle, and knew that I was lying on the bed tripping out of my mind.  Then the 2nd one, which was dealing with all of these images coming at me, and a 3rd which was completely emotional.  That part is the most memorable;  I remember going through every state of emotions in turn, in sequential order.  Each seemed to last only a few seconds.  I felt happy, then sad, then frightened, then angry, then depressed, and then it would begin all over again.  It was almost like a wheel turning, and at any given point on this wheel lay a state of emotion, which I would experience with each turn of the wheel. All 3 of these seemingly separate consciousnesses co-existed, harmoniously and accordingly.  No one interfered with the other; yet I was fully aware of all 3 at the exact same time, with my full attention devoted to ALL 3 together. At the points where I would seem to wake, or slip back into consciousness, I would look around the room, and the plants would seem to ooze, or melt.  I would close my eyes for a second, open them to look at the plants which would appear normal, and a couple of seconds later the oozing process would begin all over again.  This amazed and intrigued me!  Then something really strange happened;  I can only decribe it best as an out of body experience, for lack of better words.  I noticed that I was no longer on the bed, but rather in a far corner, suspended in mid air, watching the entire scene as if an observer.  I saw myself lying on the bed, with a cloudy greenish hue surrounding me.  I saw the entire room from where I was, and I saw my Uncle talking to me on the bed.  I saw myself answering him 'Yes', 'Yes', to whatever he said, although I knew that 'I' lying on the bed had no idea what he was even saying.  I could no longer comprehend language, only thought had any substance now.  At some point I found myself back in my body, but in a state of unconsciouness again.  Now I saw my life literally flash before my eyes, in all of 2 seconds, like a tape rewinding, but at a tremendous speed.  I acutally saw an embryo inside a womb, which I knew was myself.  I thought I had died.  This thought, though, was not at all unpleasant.  I felt content with whatever was happening, because I knew that I was useless in trying to fight it.  The time after this is blank, all I remember is my Uncle talking a whole lot to me, and me not understanding a word he was saying.  I remember that I just kept saying 'yea' and 'yes' to everything he said.  He didn't argue, although I was probably not making much sense.  He probably knew that I was far out, and decided to let me enjoy it and find my way, map my own realms.",
  "In an instant, I felt almost 'normal' again; something, which I can only describe as a great intensity, was no longer there.  It had been there a second ago, and like a flash of light, it was gone.  I could hear normal again, see normal, speak, and comprehend.  I didn't feel completely 'myself' though, and I knew the trip wasn't over, perhaps only the peak.  I felt detached, but this didn't bother me.  I felt enchanted, or mystified.  I felt as though I had figured out the keys to the universe, the answers to the unanswerable, and that I was almost God-like.  I knew I still wouldn't be able to fall asleep, as so many things were running through my head.  Not as they were before, but rather I was thinking about the things I had thought up before.  Everything now, though, didn't seem quite as baffling and perplexing as it had an hour before.  Either way, I felt as though I had been through a war, and came out victorious.  I had 'myself' back again!  I felt reborn, like a new person.  I felt as though my spirit had been cleansed, refreshed.  My Uncle suggested that we go outside on the porch and smoke cigarettes.  That sounded like the best idea i'd ever heard! About half an hour later, we retreated back into the room and I laid myself down to rest.  I knew I still couldn't sleep yet, but I started feeling worn, physically, and mentally fatigued.  My Uncle had CD's playing very softly now, and I lay on the bed as the morning sun rose.  I was awake to hear the very first sounds of the day.  Birds began to chirp, people were waking up and starting their cars to head out to work.  Everything seemed a little more crisp, with more life then ever before.  This was a nice thought to me.  I slowly drifted off into a peaceful sleep.  I remember my dreams that morning being more vivid than ever before in my life, and probably even up until now.",
  "I've tripped on LSD dozens of times after that, and on many more doses then the 2 I took that night.  But never did I have a trip again like I did with my Uncle.  Perhaps it was because I had complete trust in him, and because of that there was no paranoia.  Or perhaps I never had a trip like that again because I became so interested in LSD, I did months and months of research on it, and came to know almost everything there is to know about it.  Maybe because I knew exactly what to expect now, learned all about 'set' and 'setting', purchased the 'Psychedelic Experience' book, that I ruined tripping for myself?  Not to say I never had fun again on it, but it never had that magic it did that night....."
 ],
 "erowid": {
  "id": "608",
  "citation": " George B.. \"First Trip With Uncle: experience with LSD (ID 608)\". Erowid.org. Sep 18, 2000. erowid.org/exp/608",
  "substance": "LSD",
  "views": "10611"
 }
}
