{
 "id": 10134,
 "title": "Ice Cream Computer, but No Ego Death",
 "date": {
  "submission": "2007-03-11T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Slackwater Farmer",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.8 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "0.6 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>Ice Cream Computer, but no Ego Death",
  "I'm not an 'experienced' tripper from the point of having had a lot of intense experiences, but I eat psilocybin mushrooms maybe once a month. Usually on Friday night.",
  "Set: This evening, I am mentally in a good space. Aside from the usual concerns about money, my family is good and healthy, and I've successfully conducted a meeting for a youth group that my youngest son belongs to. These things always give me stress, although it's really 'no big deal.'  I purchased a 12-pack of non-alcholic beer at the grocery store, so I have something to drink. I don't drink alcohol or smoke marijuana, so my system's pretty clean in that regard. All, in all, my 'set' is good. My plan is to make some tea after midnight, then go to bed and enjoy the dreams and vision.",
  "Setting: At our suburban home, in the north-eastern USA, after a storm that has left about 21' of snow. Very cold outside. Everyone else is asleep in the house (7 puppies, two large dogs, four children, and my wife). My youngest son is sleeping in the master bed with my wife as he usually does on Friday.  I'm sitting at the computer browsing and reading the New York Times.",
  "Trip: I decide to mix two species. Because the wavy caps (psilocybe cyanescens) are extremely potent, I weigh out 0.8 grams of wavy caps and 0.6 grams of cubensis (stropharia strain). This doesn't sound like much but there are two considerations: 1) I am a lightweight, I don't take heroic trips *and* 2) I know from experience that these wavy caps are very strong. A friend of my dog's hairdresser cultivated them and they kick ass. The stropharia cubensis are typical strength. Both are bone-dry, so they're more potent on a per-gram basis than might be expected. But yeah, I know that 1.4 grams doesn't sound like much. Supply's not an issue, though, so I take what I need.",
  "At about midnight, I brew the tea. I put the shrooms and a tea bag in a cup.  The tea is apple spice flavor. I pour boiling water from the teapot onto the shrooms and teabag and let it sit for 10 minutes. Then I strain the mix after removing the teabag.  I drink the tea about 12:10 am. In my opinion, 'tea is the only way to go.'",
  "Effects: After 15 minutes, I feel like 'something's happening'. My stomach starts to churn a little bit, and I can feel the energy of the mushrooms begin to flow into my muscles. At 20 minutes, the tiny convulsions start.  Not the tendon jump that I have experienced with Amanita Muscaria, mini-convulsions is about the best terminology for it, kind of like the shivers. I put a blanket over my shoulders, it's a little bit cold in the room, as well, considering that it's about 4 degrees farenheit outside. At 30 minutes, I go upstairs to brush my teeth and go to bed.",
  "While I'm brushing my teeth, I can tell this will be a fairly intense trip, for me. I literally feel like I'm on autopilot when I'm brushing my teeth, rapidly and perfectly brushing. I look at a tibetian buddhist poster on the bathroom wall while taking a piss and it's not moving, so the visuals haven't begun at this point. But my perceptive center seems to be shifting.  My point of view is moving around within my brain is the only way I can describe it.",
  "After I lay in bed for a while, the effects begin to take hold. Firstly, there's the nearly overwhelming feeling that my mind is melting. The sensation that somehow, everything that I know will be lost, as the synaptic connections are erased. I 'know' this is not the case but it's somewhat disturbing. I can feel the psilocybin washing through my brain and as it does, the holographic representation within my head is distorting and 'melting.'",
  "I sense that this is the threshold of what people refer to as 'ego death'. I'm fearful of this happening. I don't want to freak out and wake my son or my wife, since they don't know I'm tripping. So I continue to ride it out, and to reassure myself that the relatively light dose that I took ensures that I'll be able to maintain. Like I said, I'm a lightweight, and given my personal situation, I'm not ready at this point for 'ego death' or to go beyond a level 3-4 trip.",
  "About 45 minutes after drinking the tea, the visions start. I remember from experience that I can control the trip at least to the extent of keeping it positive, so my fear begins to dissipate.",
  "For me, the best visions occur after ingesting fresh wavy caps (psilocybe cyanescens). With fresh caps, lots of times I see the Green Man, with really beautiful organic visions. With dried wavy caps, for some reason, I have a different trip. The metaphor that creeps in is 'the Ice Cream Computer.'",
  "The visions on these dry caps soon become extremely intense. In the dark, without my glasses, the objects in the room are all moving and swaying. My son and my wife are sleeping next to me, and when I look at my son, he looks 'normal' but I can sense my overwhelming love for him, and for my wife. But the visuals with my eyes open are getting pretty wild, so I close my eyes and get in a comfortable position in bed.",
  "The CEV's are incredible. Three dimensional, incredibly intricate patterns, many colors but blues, purples and greens predominate. Moving, evolving, three dimensional patterns. The sense that 'these are structures/machines/technology/art?? that intelligent beings can create' is imparted upon me. The fear that these visions, as they pass through my mind, will wipe away my memories, returns, but passes.  The visions are three dimensional, living, machines, folding and unfolding and evolving in continuous cosmic evolution. Incredible, raw intelligence. I have the feeling that the mushrooms open the mind and that external intelligence flowing through my brain. My normal thought patterns begin to distort, and it's a strange feeling to observe this happening, and again, I begin to wonder if it will be permanent. But that fear, too, passes.",
  "These aren't any specific images, nothing recognizable, but fantastic, complex patterns. I remember when I was young, seeing CEV's after smoking marijuana or good hash. These visions are orders of magnitude beyond that.",
  "The part that always amazes me is that the images are so consistent, although infinitely variable at the same time. It also seems to me that the wavy caps have their own character and psilocybe cubensis have theirs, although I haven't eaten enough of the stropharia cubensis to form an opinion about that.",
  "I need to write some of these thoughts down at the time, sometime, because the experiences are so damn interesting and I feel, extremely beneficial to my overall mental health and outlook. I can't say that I've met external beings, or experienced ego death, or brought back specific knowledge, but the feeling I get, in these late night visions, is that there is indeed a beneficial intelligence and beauty that permeates the universe, including human beings. We don't perceive it all the time because if we did, it would be difficult to function in the day-to-day world. However, it is there, and the mushrooms, help me in my own life, to experience these aspects of reality.",
  "I don't know if this is of much interest to the reader, but for me, this is fairly typical for a psilocybin trip. Originally, my plan for the evening was to take 2.4 grams of cubensis. However, I started to think that the wavy caps might be getting old, and decided to use some of them to supplement the cubes. Maybe next time, I'll go for the 2.4 gram cube trip.  I'm curious at times, that the experiences that I have on mushrooms don't seem to be typical as compared to many of the reports that I read. However, for me, they're really a tool for relaxing my mind. In the relatively low doses that I take, I still maintain control as an observer. To be honest, I'm afraid to 'lose control' but at the same time, I feel that a good brainwashing every once in a while is truly a benefit to my health.",
  "Peace",
  "Slackwater Farmer</p>"
 ],
 "erowid": {
  "id": "60796",
  "citation": " Slackwater Farmer. \"Ice Cream Computer, but No Ego Death: experience with Mushrooms - P. cyanescens & P. cubensis  (ID 60796)\". Erowid.org. Mar 11, 2007. erowid.org/exp/60796",
  "substance": "Mushrooms - P. cyanescens & P. cubensis ",
  "views": "4943"
 }
}
