{
 "id": 10131,
 "title": "Beyond the Gridline",
 "date": {
  "submission": "2008-07-21T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sandy",
  "gender": "Female",
  "weight": 49
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I have been waiting for the 'right time' since my first experience.  I had tried, without success, knowing it just was not 'right' so all I got out of it was some very heavy laughter the other 2 attempts since my first time.  It did not take me 'down' as it did the first, which was a rather scary experience, not ever doing hallucinating drugs before. ",
  "Today was different.  I was ready.  I went to a Yoga class last night.  I had acupuncture around noon today to 'balance my chakras' and 'karma clearing'.  When I arrived home from the acupuncture appointment, my sitter was waiting.  It never fails that after I have acupuncture from this certain lady here in town (I have been to others but her and I really 'click' because I feel that she has great energy and knows what she is doing very well!)  that I feel VERY clear, cleansed, whatever you want to call it.  She is amazing.",
  "Around 2pm today I said 'Okay I am a little scared but I feel it's the right time' and the sitter assured me it was okay and not to be afraid.  I believe the excitement of knowing it was the perfect time may have what made me frightened a little.  We went into my bedroom where it is extremely comfortable and even sitting on the bed you just sink into it, naturally.  When I sat in the middle of the bed I felt bigger than normal.  I felt like I was on my 'throne'.  Haha - anyway, the sitter sat next to me, ready to grab the pipe and lighter when I was not able to hold it anymore.  She said she felt like the bed was huge, in response to my comment.  I thought that was strange.  I just felt very present in occupying that space.  The acupuncture helped me here I believe too.",
  "The first hit, I was still aware of my surroundings but felt VERY different.  I really liked THAT feeling and hoped my mind could stay in that 'feeling' for eternity.  It was GREAT - was very very aware but of a different reality.  The second hit I coughed it away after holding it for a few.  The high I was in made me laugh at something but I was still 'aware' but the reality had shifted a little bit from the first hit.  The cough must have taken oxygen from my brain.  The sitter started laughing at me for saying something I guess and I pointed the lighter at her and said 'Don't laugh!'.  I was laughing but serious at the same time.  I wanted this high to go higher.",
  "The third hit - I thought I was going to DIE of coughing.  The bowl must have been emptied out on that one as it was not much taste, just an extremely STRONG burned taste.  I coughed and was still high of course but the coughing, OMG.  IT was bad but the thing was, I was still aware, as long as I kept my eyes opened.  I would close my eyes and feel like we (me and the sitter) were part of this whole ONE huge entity, like part of the skin of a being, keeping it all alive, or making it all 'gel'.  We were somewhere around the temple part of the face of this entity we all are a part of.  The reality I knew the sitter to be in was not the one I really knew anymore.  It seemed like an eternity and my mind was trying to figure out which reality was real.  I would close my eyes and feel this place of darkness that does not normally exist when my eyes are shut. ",
  "I looked over and the sitter was loading the bong with 25x!  I got up and said 'oh no', staggering as I'm trying to run to the bathroom because I'm laughing and did not want to pee my pants from laughing SO hard.  I told her she needed to come to the reality I was in and see if she'd want 25x to be snuck up on her!  It was funny.  She was bent over laughing as I'm running to the bathroom.",
  "I sat back on the bed, rather quickly, because I had not really gone where I felt I was going to be taken.  I was not too deep in the experience I just knew awaited me.  The fourth hit - damn lighter!!  I could NOT get it lit for the life of me.  The sitter tried to help but I felt the heat in my eyes and took the lighter back.  Finally got it lit and got the hit to be a very good one! ",
  "The fifth hit - damn lighter again!!  Numerous tries and the lighter just did not want to cooperate with me.  The sitter took the lighter and lit the bowl.  At first the flame was coming up towards my nose and all I remember thinking was 'my nose hairs need shortened a little anyway'.  LOL as I'm typing this!!  That's exactly what my brain was thinking.  How silly!  Finally the flame went down into the bowl and this time the hit was extremely strong, smoky, the sitter's eyes got very big, like OMG and I do not remember anything about the bowl/bong/pipe/lighter after this.  I laid back, shut my eyes and opened them.  I saw the sitter and she was there in that dimension with me but when I closed my eyes again I kept them closed.",
  "It was like this dimension was folded up and a new one appeared as the folding was taking place.  It was definitely nothing I have ever imagined.  The space my subconscious was occupying was its own.  My physical self or my 'ego' had been folded away as the unfolding of my subconsciousness became what occupied the dimension.  I remember speaking with someone and to the sitter but do not know what I was saying (until later the sitter tells me).  My subconscious went to this place.  It was dark and I could feel entities around me but it was like I had a main guide, like a friend, that was with me.  After examining this space for what seemed like a long while I was thinking 'Is this all there is?' and 'Where's the light, where's the ???'  The next thing I know, I was extended through time and space with like an elasticity which I was immediately (in saying 'I' I mean my subconsciousness, not my physical self) taken to a very serene and tranquil setting of a beach and very calm waters.  It was if my consciousness was there for real, seeing the image of a spirit or an angel, as what my subconscious was displayed as.  [Only trying to be descriptive, not at all trying to sound egotistical but in reading this, it does (sorry!)]",
  "The next thing I know I am extended by that elasticity again wherein it feels as if the space I traveled through did not know what distance was nor that it even existed.  These 'elasticity' lines look like rays of sunlight would look if they were colored nice blues and greens but suttle tones, very earthy colors.  I was taken to a place where this guy works, who has told me he may be 'developing' a crush on me and a few weeks later I shared my thoughts to him.  We are both very busy and really never see each other but I still thought it was sweet of him to say!!  I had been wondering all day if I should drop this book by to him, with an excuse to stop by other than dropping the book off, of course, but was not sure if I should.  I guess this was the underlying tone of my subconscious before I visited Sally today.  Anyway, of all places, my subconscious went there and it was like my subconscious was above him and some other guy that was standing there and I 'heard' his thoughts stating 'My name, my name, when is she going to come by!?'.  It is a retail establishment where I get the Sally from.",
  "When I regained my sense of my physical self the sitter looked as though she had been through something herself.  She was amazed at how I was talking to someone while my eyes were closed, some words she could comprehend that I said, some I mumbled.  The one that stands out the most is when she told me I was talking to someone and said 'You mean I can go ANYWHERE I want to?'.",
  "At 2:45 I was back in the kitchen, trying to sip some coffee.  My stomach was a little upset because I had no eaten in 24 hours - this was on purpose.  I wanted the spiritual aspect of visiting Sally.  I want to go there again and hopefully I will have a journey planned out.  In essense, it is the subconscious that was in control here with the ultimate hands on the controls being Sally's.  I totally enjoyed this experience.  I am still not sure if it was 'real' and I was really there, especially at my friend's place, but I do know my subconscious was NOT wondering today what was 'he' thinking.  It was Sally who showed me that.  So, was it real? ",
  "A friend of mine, who is a 3rd generation psychic, said I was astral projecting.  I believe the smaller doses then the larger ones really got me to this space.  I will do it the same way again, when I feel the time is perfect.  Definitely beyond the gridline that I experienced when Sally first took me 'down'."
 ],
 "erowid": {
  "id": "60777",
  "citation": " Sandy. \"Beyond the Gridline: experience with Salvia divinorum (15x & 25x extracts) (ID 60777)\". Erowid.org. Jul 21, 2008. erowid.org/exp/60777",
  "substance": "Salvia divinorum (15x & 25x extracts)",
  "views": "2347"
 }
}
