{
 "id": 10148,
 "title": "Time for Bed",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Side Effect",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "22 mg",
   "administration": "oral",
   "substance": "4-HO-DiPT"
  },
  {
   "time": "0",
   "amount": " T+ 0:00",
   "administration": "5.0 mg",
   "substance": "oral"
  },
  {
   "time": "Hydrocodone",
   "amount": "",
   "administration": " T+ 1:15",
   "substance": " "
  },
  {
   "time": "smoked",
   "amount": "Cannabis",
   "administration": "(plant material)",
   "substance": " T+ 4:27"
  },
  {
   "time": "750 mg",
   "amount": "sublingual",
   "administration": "Pharms - Triazolam",
   "substance": "(pill / tablet)"
  }
 ],
 "report": [
  "21:17   \t",
  "22mg 4 ho dipt, really bad taste, very bitter. I have to go pee.",
  "21:30\t \t",
  "My heart is a bit fast from anticipation, I took 5mg hydrocodone for some upper back pain Im feeling. Im starting to notice a skewing flex on perspective. But it disappears with constant focus.",
  "21:43 \t\t",
  "Noticeable change in vision, a bit fish eyed.  But no closed eye visuals as of yet, tested with the slurpee lights. Ive a smidgeon of heart burn.",
  "21:50 \t\t",
  "Im losing nimble in my fingers, Im making more typing mistakes, getting a bit of streaking on the edges of vision.",
  "22:01\t\t",
  "Not very visual, but the body high is pleasant. Closed eye visuals have a distant Mandelbrot look to them, but the light over powers the patterns. Listening to massive attack because it seems appropriate to where I want to be.",
  "22:11 \t\t",
  "Im feeling mostly a body high, no outstanding visuals.",
  "22:32\t\t",
  "Just got in from smoking some weed, I thought it would potentiate the effects. But Im feeling more of the weed now than the drug. Although, huge decreases in spelling and typing ability.  Im getting colors out of my vision now, jumping around, fait reds and greens, yellows, I cant spell or type worth a shit. Having a hard time matching up words to meanings, spellings to pronunciations.",
  "Synesthesia   fingertips to taste.",
  "22:37 \t\t",
  "The body high is great. Was thinking if I should redose on the 4-HO, but Im thinking not. I actually cant remember if Im capable of knowing if Im high  as I think I am. Wow, that makes no sense. Music is ok, but thinking is great. Touch is great. Really good tactiles.",
  "11:31\t\t",
  "Great visuals, closed eye, and I can bring them to open eye. Failings to imagine a perfect dark",
  "00:44\t\t",
  "Had a great talk with my brother, who happened to be just coming off a salvia trip on the other side of the country. Just a coincidence we tripped on the same night, same time. Im pretty awake, so I just ate 3/.25mg triazolams. Hopefully, Ill fall asleep. It felt like the visuals were completely because of the weed.",
  "00:50 \t\t",
  "I just finished dancing my ass off, trying to break dance and stuff. Had fun.",
  "00:53 \t\t",
  "I realized I didnt eat those triazolams, Ive been holding them under my tongue sublingual absorbtion.",
  "Our language obviates our ability to think freely.",
  "01:09 \t\t",
  "Not quite tired, but Im going  to bed.",
  "Sleep was tough, but the dreams were vivid. I had a hard time waking this morning from the 3 halcions and the Nyquil I took to quicken sleep. I did not the visuals did abate about the 2.5 hour point, the weed seemed to keep it up longer, make it more visual.. It gave me some gas, but no real stomach pains, some upper back soreness( could be mine) leg weakness,  Im worried about storing it, its hydrophilic and Im sure it will to waste before I use it all."
 ],
 "erowid": {
  "id": "60835",
  "citation": " Side Effect. \"Time for Bed: experience with 4-HO-DiPT, Hydrocodone & Cannabis (ID 60835)\". Erowid.org. Jun 25, 2007. erowid.org/exp/60835",
  "substance": "4-HO-DiPT, Hydrocodone & Cannabis",
  "views": "8266"
 }
}
