{
 "id": 10143,
 "title": "Totally Destroyed",
 "date": {
  "submission": "2009-10-10T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Josh",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Oxycodone"
  },
  {
   "time": "0",
   "amount": "37.5 mg",
   "administration": "oral",
   "substance": "Hydrocodone"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Promethazine"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Various"
  }
 ],
 "report": [
  "I did not eat all of these drugs at once, however they were consumed over about a 5 hour time frame. I began the experience at approximately 10:00pm and it consisted of taking 15mg of oxycodone and 15 mg of hyrdocodone. About a half hour after consumption I began feeling threshhold effects and they began to intensify rapidly.",
  "Over the next 4 hours or so I dosed continually, taking the promethazine, norflex and plenty of other pills of vicodan and percocet. I have consumed many a hard drug in my day and I can honestly say this is probably the most fucked up I've ever been in my life. I was lying down in my bed for most of the time enjoying the utterly orgasmic feeling these pills produced. I was so high just after the aforementioned initial dose but for some reason I continued to do more and more pills as though I was trying to overdose. And that is exactly what I thought I had done at a about 3:00am.",
  "At this time I was starting to get a little worried not so much with the amount of oxycodone or hydrocodone I had consumed, but more so with the ridiculous amount of acetaminophen I had consumed. I went on the computer and tried finding out the signs of a acetaminophen overdose and I had shown signs such as yellow eyes and an excrutiating headache. I could barely read the screen on the computer as my eyes were unable to focus and my head was spinning like you wouldn't believe. I told myself that I was going to stay up because I feared that if I fell asleep that I would definetely not wake up.",
  "However of course I did end up falling asleep because with that much drugs in my system its nearly impossible to stay awake. I woke up at about noon the following day thankful to be alive and I was also still absolutely blasted. By this time though it was a much better high and I felt like the definition of relaxation for the rest of the day. The only negative comedown effects that I felt was a pounding headache for the following two days. Other than that it was a fantastic experience.",
  "I must warn anybody interested in trying drugs such as percocet or vicodan that these are extremely addictive as I am currently on 45mg of vicodan. They are without a doubt the most addicting drugs I've ever done, with the exception of maybe demerol."
 ],
 "erowid": {
  "id": "60822",
  "citation": " Josh. \"Totally Destroyed: experience with Oxycodone (Percocet), Hydrocodone (Vicodin), Promethazine (Phenergan), & Orphenadrine (Norflex) (ID 60822)\". Erowid.org. Oct 10, 2009. erowid.org/exp/60822",
  "substance": "Oxycodone (Percocet), Hydrocodone (Vicodin), Promethazine (Phenergan), & Orphenadrine (Norflex)",
  "views": "20614"
 }
}
