{
 "title": "Hell on Earth: An Encounter with the Dark Side",
 "author": "Tomuch Mushrum",
 "citation": " Tomuch Mushrum. \"Hell on Earth: An Encounter with the Dark Side: experience with Mushrooms (P. cubensis) (ID 1014)\". Erowid.org. Jan 6, 2001. erowid.org/exp/1014",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "170 lb",
 "report": [
  "<p>It was a Friday night and my friends and I decided to head on out to a rave.  After we got there, we each pulled out one Snickers bar, one bottle of orange juice, and one baggy of shrooms, thought to be five grams.  I was a little curious about what this would be like; my previous experiences involved only 3 or 4 grams.  The shrooms went down smoothly and we were ready to enter the dance.  I was looking forward to some psychedelic light shows.  Half an hour later, I was starting to feel a little tingly sensation originating in my stomach and slowly spreading through the rest of my body.  I smiled and realized that my trip was starting.  I was in for a long ride.  Shortly after, I was tripping balls.  Somehow I lost my friends in the 3000 other people.  I began walking around to find them but could not.  I started getting a little paranoid.  Everyone seemed to be looking at me. ",
  "Gradually, my paranoia increased and I thought that the cops that were there knew I was fucked up and were coming for me.  I went to walk down the stairs toward the exit to escape but I saw flashing red and blue lights at the bottom.  They had me cornered!  I saw condom wrappers and thousands of cigarette butts on the floor among other things and *knew* that they were all mine and they represented all the bad things I had done.  Suddenly, all the people started coming down the stairs and I distinctly heard and saw multiple people saying, 'I'm getting out of here.  The people are doing some fucked up things.'  Everyone WAS talking about ME.  I walked back up the stairs and everywhere I went I saw cops.  I thought they were coming for me.  I remember thinking that I had really messed up and everyone would hate me for the bad things I had done and I would be in jail.  I walked over to a place to sit down.  I remember my friends finding me and talking about how much I had eaten.  It was surreal.  They tried to help me and give me water, but I thought, what was the point?!",
  "I eventually collapsed to the floor and entered hell.  I knew that I was suffering eternally, and that was what hell was - eternal damnation.  It was the worst terror in my life by far.  Eventually I realized that I could get up.  I raised up off the cubicle and saw people next to me.  I was not sure at that point what was real and what was not.  They said my friends had left a little while ago.  I left and found them.  Strangely, after 3 hours of the worst trip of my life, I was completely sober.  I found out a week later that my friend's scales were off by two grams and that I had eaten 7 instead of 5 g of shrooms.</p>"
 ],
 "year": "2000",
 "id": "1014",
 "views": "7345",
 "dose": [
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 ],
 "submissionDate": "2001-01-06T08:00:00.000Z"
}
