{
 "id": 10158,
 "title": "The Downward Spiral Little By Little",
 "date": {
  "submission": "2007-08-08T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "coke luver",
  "gender": "Female",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "My whole life growing up I always talked down on drugs.  But starting about my 10th grade year of high school (I am now 2 years out of school) I started to experiment with drugs.  I had already had alcohol before and I never thought it was a very bad thing. ",
  "At 15 was when I took my first hit of marijuana, which I never really cared for, but still was pulled into the 'glamor' of it.  It seemed that everyone around me was smoking and it would be uncool for me not to.",
  "A lot of people like to say that marijuana is a gateway drug, but I don't believe it at all.  Sure maybe it seems that people start smoking weed before moving onto harder drugs, but to me its because its more accepted as well as easier to get.  After I started smoking I started taking all sorts of pills at school as if it was uncool not to. ",
  "I've grown quite a lot since then, but that doesn't mean I've stopped using.  I don't do drugs anymore to look cool or because I feel peer pressured into it.  I have just grown into a life style of being surrounded by different narcotic substances. ",
  "I started snorting cocaine the end of my senior year because I was curious what all the fuss was about.  Little did I know that I would like it so much.  At first we would be able to let 1/2 a gram last a night between 2-3 of us. ",
  "The coke high was the best feeling I had ever gotten from any kind of drug.  Most would make me either drowsy and less coherent, but would just make me feel 'fucked up.' My body so light and relaxed that I was in a state of euphoria.  There was and still is nothing like the first line of a night.  With my heart beating faster and my muscles relaxing more and more, I felt like I should be on a cloud. ",
  "The high was so amazing, but the end of the night I would be wishing I was dead because my head would be so stuffed.  Breathing through my nose was a joke, and trying to make the throbbing headache go away was impossible.  Over time I learned other drugs to take in which would help me with my come down.  Tylonel PM works wonders as well as Benadryl. ",
  "If I tried doing the amount of cocaine that I had once started with today it would just be the biggest tease ever.  Imagine  being able to smell your favorite food, the craving you get for it as your mouth waters and your heart beats with anticipation.  Today to get me high it usually takes about 1/2 to 1 gram of coke to achieve the max feeling.  I try to stay away from it as much as possible because I know how much I love the feeling of it but somehow my friends and I are still constantly trying to get our hands on it, even if we cant afford it.  It's true that I love cocaine and if I could afford it, I would probably always have a supply on me.  Thankfully I am not an addict though, unlike some of my friends which have fallen into that path. ",
  "In my opinion the worst thing that could happen to a user, is become dependant upon it.  The craving for more almost eats at my insides because the come down creeps up on me.  Over time, experiencing a come down only happens if I've been on yay (coke) for 3 or more days straight.  but sometimes if it's 'nail polish' as my friends and I like to call it (really bad, unpure cocaine). ",
  "After I decided to experiment with coke, everything followed.  We started railing (snorting) oxycodones, black tar (a form of heroin), suboxone, and the most recent for me, crystal meth. ",
  "I have definately done quite a lot of things that I regret, but I would never take it back for the amazing highs of these drugs.  From pills like xanax, valium, and oxy's, to much harder drugs like cocaine, meth, and heroin.",
  "I am so glad that nothing has happened to me over the course of my experiences, but seeing close friends overdose made me take a second look at my life and what I was doing wih it.  I plan on quiting all drugs completely, eventually, but for now I still feel invincible. ",
  "I can feel myself being pulled into the downward spiral little by little as the drugs, especially cocaine, become the main focus of my life.  The more drugs I do, the more numb I feel, and the less I care."
 ],
 "erowid": {
  "id": "60881",
  "citation": " coke luver. \"The Downward Spiral Little By Little: experience with Cocaine (ID 60881)\". Erowid.org. Aug 8, 2007. erowid.org/exp/60881",
  "substance": "Cocaine",
  "views": "5104"
 }
}
