{
 "title": "Self-Doubt and Overwhelming Visuals",
 "author": "KimC",
 "citation": " KimC. \"Self-Doubt and Overwhelming Visuals: experience with 2C-D (ID 101539)\". Erowid.org. Oct 15, 2013. erowid.org/exp/101539",
 "substance": "2C-D",
 "bodyweight": "140 lb",
 "report": "<p>EXPECTATIONS</p><p>A reliable and experienced friend gave me her 2C-D that she had left over from her drug days, so they might have been sitting around for at least a year. She had done 20mg before and told me that it just enhanced colors, made her super bodily aware and some other mild visuals. These were my expectations.</p><p>I am almost totally inexperienced with drugs, I'd only ever tried weed a few times before. I didn't expect much to happen, and in reflection I wish I had done more research and fleshed out some expectations a bit more before diving in.</p><p>EXPERIENCE</p><p>I took a pill with 30mg in it with my 230lb boyfriend (also pretty new to drugs) who also took 30mg. Neither of us had anything to eat yet that day so we both had empty stomachs.</p><p>We decided to go for a walk in our quiet residential area. It was spring and the flowers had all just bloomed. We walked slowly for about 40 minutes and we started to think the colors were all brighter and that everything just looked so crystal clear.</p><p>We were both starving and even though our friend had warned us against eating, we decided to go to a nearby McDonalds. We sat and ate a combo each and then we decided to go home. We werent really feeling much yet so the plan was to go home (about a 30 min walk) and do 20mg more each. We exited the McDonalds and it hit me. A big glass building across the street looked as though there were waves rippling through it. In fact, this shocked me as Ive never hallucinated before. It blew my mind. My bf wasnt really feeling anything yet. I, about 5 minutes later, began seeing in double- there was two of everything and it was very disorienting. The cars going by felt as though they were going to blow me over and I couldnt help but brace every time a car went by. Crossing a bridge, I felt an extreme feeling of vertigo; my stomach was turning over on itself. I was overwhelmed and my legs felt too weak to walk.</p><p>Somehow we got home. By the time we got home it was maybe 2  2.5 hours into the trip. If we took any longer or if I wasn't with someone a little more sober feeling than myself, I dont think I would have found my way home.</p><p>At home, I sat on the couch next to my boyfriend who was starting to trip finally. He sat very quietly and looked as though he was thinking very deeply. My sober roommate was there and she sat with us while I tried to explain what I was experiencing. I was loud and couldn't control myself. I was mostly yelling stuff along the lines of holy shit, what the fuck, oh my god, etc. I was experiencing some serious hallucinations. The pictures on the wall were dancing. Peoples faces didn't look like faces; they were just mixed up and swirling. Everyones hair looked like it was blowing in the wind. Feather type patterns were dripping out of the walls. When I waved my arms I saw trails  my bf said he saw this too. But in the trails left by my arms there was this checkered pattern into which, I though some of the checkers were other universes. My hands were freaky and doubled and it looked like I had 20 fingers. Basically everything was still sort of doubled and looked like it was moving slightly. I felt like my body was moving without my conscious control, I felt like any moment I could have just let my bowels go, I dont know how that didn't happen. I communicated all of this to my sober roommate pretty well. I sat and experienced all of that for about an hour. Meanwhile, I realized my bf had moved to sit on the floor of the kitchen and quietly ponder.</p><p>At about 3.5-4 hours in, my memory is really fuzzy and I remember feeling super confused about what was going on. Basically shit started to go down. My roommates phone rang and she went into the other room (I dont remember this happening). But basically, my bf started to panic while she was gone, I think he thought there was something wrong with me, maybe there was something wrong with me, neither of us know what actually happened. The next thing I know Im lying on the couch and he is hugging me and shaking me and telling me to wake up and that everything is going to be okay. I came to, the last thing I remembered was him in the kitchen and me talking to my roommate. This little laps in memory is what really confused me. But I felt okay, I felt fine. I kept telling him that I was okay and he wasn't hearing me, he just kept saying all of these comforting things in a really panicked tone. I then realized that my roommate was in the other room on the phone, she was talking about us and the drugs wed taken and what was happening. I thought something had happened and she was on the phone with 911. It turns out she was just on the phone with a friend.</p><p>So she eventually came back. Me and my bf were worried and panicked, and she was pretty confused about what had happened to make us so scared while she was gone. I felt better now that she was back. But my bf was not calming down, he kept acting like I was dying or something and I kept getting these waves of thought thinking Oh shit, what if there is something happening to me right now and I just havent clued into whats going on. For probably an hour, we try to calm him now by basically telling him that everything is okay It was a really annoying back and forth. Then basically, he stopped being lucid maybe 5 hours into the trip. He lied on the floor, just drenched in sweat, lips blue, rambling on about non-sense (only a few sentences over and over). He never stopped talking but he was staring off into the distance and it was as if he couldn't hear us. I tried shaking him and hitting him and yelling at him and he just wouldn't snap out of it. He was basically talking about time and cycles and the universe and people. It always looked as if he was finally going to reach his conclusion, but then, he would get stuck and start all over again. He did this for, literally, a terrifying 2, maybe 3 hours. I was still tripping but I felt like I was able to think and communicate relatively clearly, though I kept having lapses in my memory where I would all of a sudden not know what had happen for the last few minutes which was making me confused.</p><p>My roommate started looking up 2C-D on the internet and considered calling 911 or something but she didn't. I trusted her to do all the decision making, if she wasn't there I probably would have called 911. Maybe 7 or 8 hours in my bf finally started slowly coming back to us. He could answer short easy questions though he would continue to ramble to himself. Eventually, we decided to try and go to bed because it was pretty late. I was not tired at all but I laid next to him in bed in the dark. He continued to talk to himself and spontaneously realize that I was there, then seemingly forget and go back to talking to himself. My entire body was extremely uncomfortable and I felt frustrated. We were both just tossing and turning. I was seeing elaborate explosions of patterns in the dark and even worse when I closed my eyes. We basically both laid there until the sun came up, not a wink of sleep.</p><p>This is probably 11 or 12 hours into the trip. Definitely not sober yet. I was still mildly seeing things, mostly patterns in the trees and on solid surfaces. He was back and able to communicate. I just wanted him to know what he was doing and what had happened, as he had no recollection of it at all. Apparently he had an awesome trip, thought hed figured everything out (all the mysteries of the universe) and he even thought that he was talking with me and my roommate the entire time. At about 15 hours I could say I felt sober again and I finally slept.</p><p>REFLECTION</p><p>Im not sure how I feel about this drug. Before my bf started freaking out, I was having an amazing visual experience. The visuals were way more intense than I anticipated. I was overwhelmed and anxious. I think taking less would have benefited me. I'm happy we didn't take more when we got home like we were planning. The way my bf reacted was probably the scariest thing I've ever seen in my life, yet from his perspective, he apparently had a great time. I am left with an icky feeling. I probably wouldn't do it again, once was enough.</p>",
 "year": "2012",
 "id": "101539",
 "gender": "Female",
 "age": "23",
 "timestamp": "2013-10-15T07:00:00.000Z",
 "views": "743",
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  }
 ]
}
