{
 "id": 10154,
 "title": "Toxic Cocktail",
 "date": {
  "submission": "2008-02-05T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Darkstar",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "2000 mg",
   "administration": "oral",
   "substance": "Pharms - Divalproex",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Pharms - Fluvoxamine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Risperidone",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0",
   "amount": "11.25 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": ""
  },
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": ""
  }
 ],
 "report": [
  "It was getting late in the evening in downtown apartment on a Monday night, when the phone rang. It was my fiends Jeremy who is the lead singer of a band. As usual, Jer was in search of some weed, and I was usually the guy who sold it to him. But, I had quit smoking weed for three months at this point, because I wanted to improve my OCD and bipolar disorder. Nevertheless, I ended up finding it for him anyway, and I could resist the temptation of smoking a cone.  It was especially tempting because I wanted to see how my latest prescription, Imovane, would react when combined with cannabis use.",
  "It was now a only  little while after taking my nightly regimen, that was to include a combination of the following: 2000mg Divalproex, 250mg Fluvoxomine, 2mg Risperidone, 45mg Mirtazapine, and the more recent addition, 7-15mg Zopiclone. Tonight I had only taken one and a half of the 7.5 mg Imovane tablets.",
  "After A while of sitting on the couch in my medicated daze, I began to obsess over the small amount of reefer that I had pinched out of the bag for myself. With in a matter of minutes I had rolled one up and was smoking it. Soon I was completely fucking blazed. Everything was fucking amazing for a while, and I felt like I had taken a small amount of mushrooms, smoked weed, and drank a bit of hard alcohol.",
  "Eventually I ended up in my bed, talking on the phone with my ex-girlfriend for about an hour. She told me that I sounded all doped up, and she also asked me if I was okay. But I felt absolutely fine..",
  "The suddenly, a wave of unbearable nausea came over my whole body, an my mind when into some kind of trance, sort of like the k-hole. I then felt like I had to take a shit and ran for the bathroom. I sat on the toilet and pissed out of my asshole for a while. Afterwards, I went back to lay in me bed but this time brough a garbage can to throw up in, and I did. I puked up the most acidic mixure ever concocted. This fucking shit burned my throat and mouth. This phase lasted about an hour and a half.",
  "When the whole thing passed I still felt like a can of smashed ass-holes, and I couldnt get to sleep. I decided to take another Zopiclone, and It was good night for me. I will never smoke weed again as long as I am on these medications. The consequences of doing so were not worth it. I blame it on the Depakote mainly, but who knows? I dont want to go through that shit again."
 ],
 "erowid": {
  "id": "60867",
  "citation": " Darkstar. \"Toxic Cocktail: experience with Divalproex, Fluvoxomine, Remeron, Risperidone, Zopiclone & Cannabis (ID 60867)\". Erowid.org. Feb 5, 2008. erowid.org/exp/60867",
  "substance": "Divalproex, Fluvoxomine, Remeron, Risperidone, Zopiclone & Cannabis",
  "views": "22268"
 }
}
