{
 "id": 10168,
 "title": "Not Good At All",
 "date": {
  "submission": "2002-02-12T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sugarbutt",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "Okay, so me and my friend started reading about the effects of nutmeg here on erowid.com and decide to give it a try.  I was really looking forward to the hallucinaginic properties it was supposed to have, so we went to Walmart and bought a couple of containers of nutmeg.  They were about 2 ounces each and cost a just a few bucks.  Then we went to get some food.",
  "4:00 pm",
  "My friend got a soda and went to a bathroom stall with it and his container of nutmeg to attempt to ingest some.  After I finish my food I proceed to the bathroom to see how he's doin' only to find him nearly gagging with a mouthfull of the stuff.  We switched places.  He took a break and went back out to sit down and it was then my turn.  I took of the lid, tipped it back and filled up my mouth and chased it down with some SoBe.  It was fucking disgusting.  I figure I ended up eating about half of what I had (about 1 ounce or 28 grams) when I decided to quit.  It was just too awful.  My friend was not so successful in trying to choke it down.  He gagged a time or two and ended up spitting some of it back up before eventually throwing the rest of his container in the trash.  I figure that he ate about 3/4 of an ounce or so.  Then we went to his house.",
  "4:30 pm",
  "I still had half of my container left so then we decided to make tea out of the rest of it.  We were really determined to feel what the effects were, so went weren't ready to quit.  The remaining ounce or so made two cups of potent nutmeg tea.  My friend had a slightly bigger cup since he hadn't eaten so much earlier.  He said it tasted kinda good, but I thought it tasted like shit.  It reminded me of having to choke that stuff down and made me sick to think about it.  After we drank it all my friend had to go to work so I left.",
  "5:00 pm",
  "I wasn't really feeling anything yet.  I watched some tv for awhile.",
  "6:00 pm",
  "I felt kinda funny, like I had a couple of beers maybe.",
  "6:30 pm",
  "Went with some other people out to eat.  I didn't eat very much.  My appetite was completely gone.",
  "7:00 pm",
  "I started to feel sick to the stomach.  I went home.  Since I had to be up to go to work by 2:00 am (I know, it's a sucky shift), I figured I'd better go to sleep.  I was hoping the nausea I was feeling would subside.  I probably crashed around 7:30 or 8:00 pm.",
  "9:30 pm",
  "I woke of with extreme paranoia.  I was feeling REALLY sick and dizzy.  I felt the need to vomit so I got up to go to the bathroom, but this was not an easy task.  I was soooooo fucked up.  Right when I got to the toilet I threw up and did a little dry heaving afterwards.  I didn't feel any better though.  Everything was spinning.  I went back to bed and ended up laying there with a lot of pain in my stomach for a long time before I got to sleep around 11:00 pm.",
  "Needless to say I called in sick to work the following morning.  Plus I was in bed for the entire next day.  I also had diarrhea for the next 2-3 days.  That's about it.  It sucked.  I'm not doing it again.  End of story.",
  "My friend, amazingly had a fairly good experience.  He never got sick.  He just told me that he just felt really happy for the rest of the night when he was at work and continued to feel the effects for a few more days."
 ],
 "erowid": {
  "id": "6092",
  "citation": " sugarbutt. \"Not Good At All: experience with Nutmeg (ID 6092)\". Erowid.org. Feb 12, 2002. erowid.org/exp/6092",
  "substance": "Nutmeg",
  "views": "6194"
 }
}
