{
 "title": "Wheels, Confusion, Short but Beautiful",
 "author": "ImNotHighMom",
 "citation": " ImNotHighMom. \"Wheels, Confusion, Short but Beautiful: experience with Salvia divinorum (ID 10160)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10160",
 "substance": "Salvia divinorum",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "smoked",
   "Salvia divinorum",
   "(extract)"
  ]
 ],
 "report": "<p>My standardized A enhanced fortified leaf finally showed up at my friend's yesterday. It was a capsule with 25 mg of the leaf in it. I was so excited when my friend told me it came over the phone. When my job training class was over I hopped right on the bus and went straight to his house. We got there, figured out a good trip setting, over at my friend (we'll call him C) C's because no one there has a problem with experimenting. He has a bong too, and his house is clean, comfortable, calm and relaxing.</p><p>We got over to his house and he got out the bong and I loaded the leaf in it. C had some weed and so did J (the person who was with me first). I decided we should smoke the weed to ease myself into any possible scary experience Salvia might hold for me. We got stoned and we all decided I was gonna smoke the salvia in C's room on his bed with strawberry incense burning and prodigy playing softly on the CD player. I sat down on the bed, got the bong ready and took the bong hit. when it was all burned I cleared it and held it in. Now the effects began right away. First, I heard C counting seconds like '12310' and I remember letting out some air at ten cause I was still holding the hit in. But later on I found out that C was never counting, he had a silent stopwatch going.</p><p>When I let out my first portion of air, my head just became really scrambled and I didn't know what was going on, where I was or who was with me. Then the scrambling started slowing down and everything started coming into focus and I realized my vision was a big wheel similar to the wheel of fortune and in each section was J's and C's face next to each other. I was moving slowly around the wheel. I faintly heard C ask, 'Are you alright?' and I think I got embarrassed cause I still didn't know much of what was going on and I think the embarrassment broke me out of the wheel trance cause then the wheel sections got bigger and there was only like 5 sections, then 3, then one and my vision was back and I looked around and the music I found was related to the way the wheel was moving and it sounded alien and mystical.</p><p>I couldn't talk and josh said, 'Is it working?' I didn't answer and he said, 'Lay down' so I laid down. Since I came off the wheel I felt like there was pressure all over my body trying to move my body around the room somehow. Kind of hard to explain. When I laid down C and J left the room and I felt like the effects were wearing off already but when I focused my eye on a part of the room for more than 20 seconds or so, everything around the part I was focusing on would start morphing like the room was gonna turn into a different room, but never changed. Then the part I was focusing on started morphing too. I sat there watching all of this and I decided to see what happened when I closed my eyes. I closed my eyes and the stuff you see normally when your eyes are closed was 3-D for me and I partially felt like I was part of it but partially not. I would get these feelings like I was gonna float down into my vision or start floating around everywhere but never went through with it. Stuff morphed and changed and I kept getting these entheogenic rushes throughout my body when I had my eyes closed.</p><p>Everything after that was very mild but I still felt like I was coming on to DXM or something or I was in a very, very strong DXM afterglow. Then when I was sitting on the couch like an hour and a half after taking the bong hit, These weird memories popped into my head that seemed like they took place while I was in the bedroom under the spell of salvia. But I don't remember them taking place but there was a faint memory of it. Very hard to explain. After that, the rest of the night, every time I smoked weed the effects of salvia came on strong again, only the body high though, no wild visuals.</p><p>When I got home that night I went to bed and fell right asleep. Throughout the night, I think I was dream trippin hard because when I woke up it seemed like I had been asleep for years. Also when I woke up I felt happier than I had been in a very, very long time. I started reflecting on what happened the day before I got even happier but still decided it wasn't what I expected, but well worth $18.50. Next time I get a chunk of cash, I'm gonna buy like 3 capsules of the 25 mg increments so that if it doesn't work right away or doesn't last long enough or I feel I'm aware enough to take another bong hit, I can extend the experience. Thank you so much salvia, you gave a lot of what I asked but nearly all of it. It was definitely enough though. I look forward to devouring your presence very soon. ASAP.</p>",
 "year": "2001",
 "id": "10160",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-14T07:00:00.000Z",
 "views": "2964"
}
