{
 "title": "Bringing Back the Child in Me",
 "author": "Synthesized Semen",
 "citation": " Synthesized Semen. \"Bringing Back the Child in Me: experience with Morning Glory Seeds (ID 10164)\". Erowid.org. Sep 28, 2002. erowid.org/exp/10164",
 "substance": "Morning Glory Seeds",
 "bodyweight": "154 lb",
 "header": [
  [
   "DOSE:",
   "15 g",
   "oral",
   "Morning Glory",
   "(seeds)"
  ]
 ],
 "report": "<p>Well it all begin around 4:00 PM when Whitt came by my house with his girlfriend, he had had been recently wanting something mind altering other than marijuana. I let him know of LSA and that it could be taken from Morning Glory seeds. So I went to my local stash of Heavenly Blue Morning glories and poured out 30g onto a digital scale. I then put those 30g into a coffee grinder and turned into a powder. I split the powder up so that me and Whitt would both have 15g. We took the powder like it was a 'goodies powder' washing it down with a soft drink. We decided to take a walk to a friends house and see if we could get a joint.</p><p>Within 30 minutes colors all around me started to become more brighter and brighter, i started to feel a slight euphoric sense of well being. The friends house we went to wasnt home so we decided to proceed to someone elses house. Upon going there the journey was very tyring, walking up hills was a massive effort on my part, my legs didnt seem to cooperative. We arrived at the peoples house, we finally got a good little joint smoked. I think thats where it set us off, the morning glories had started to really set in, my field of vision was wobbly, kinda like I was walking on something bouncy. We all got a big cardboard box so we could slide down a hill, to be honest I didnt know what we were doing  I just kinda watched them. We also played some stupid alphabet game. I couldnt do much games any more, my experience was becoming more and more mixed up and the hallucinations were starting. A big keleidascope colors swarmed my field of visions. About 3 hours had passed and I now had intense tracers, rainbows coming off of objects, I couldnt focus on a certain thing or though for over a second.</p><p>The body buzz was the hardest I have ever felt, harder than the 10 hits of blotter I have done (at once). We sat and talked with those people and then we decided to go home. On the journey home all the car lights I thought were cops and every sound we heard was loud, it sounded like I was wearing hearing aids turned up full blown. The paranoia was so intense and we laughed about how scared we were cause we knew how it was all in our minds. Walking was very very difficult with massive pupil dialation, we then arrived at whitts house and smoked another joint off of a sack we bought. We ate a whole bag of chex mix, each little bite tasted so strong and so good, thoughts of any kind of food overwhelmed my senses, its like I could taste food just by thinking of it.</p><p>We then went in his house, thats when the peak started, I was getting visuals and hallucinations extremely intense, staring at things resulted in patterns and distortions unlike any that I have seen, we got on the computer and ran some trippy programs like (Flasher, LSD Spiral, etc...) These programs were making things for the better, we proceeded to have a very nice trip until I went home. I got home about 12:00 AM and watched some TV ate and then went to sleep, i guess zoned out.</p><p>I woke up the next morning around 12:00 PM still feeling slighty euphoric, walking was kinda wobbly and still having that body buzz. Now im writing this its October 23, 2001 at 1:20 PM and I am still feeling good. This was an incredible experience which I highly recommend, I dont know what those folks are saying about the nausea, I never got it off of 15 GRAMS of GROUND seeds. No extraction, no cleaning, yep straight out of the bag. When getting seeds make sure they are untreated.</p>",
 "year": "2001",
 "id": "10164",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-28T07:00:00.000Z",
 "views": "6663",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "15 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 ]
}
