{
 "title": "Seeing the Two Halves of the Human Soul",
 "author": "Kronik",
 "citation": " Kronik. \"Seeing the Two Halves of the Human Soul: experience with Mushrooms (ID 10175)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10175",
 "substance": "Mushrooms",
 "bodyweight": "65 kg",
 "report": "<p>WassupI hail from New Zealand, and to be honest, I don't really have much in the way of scientific terminology when it comes to drugsthis report is about my first experience with magic mushrooms.</p><p>My mate and I have been smoking pot since we were about 15some other mates asked us if we wanted to try a mushroom trip. We thought what the hell and said yes. 3 of us cruised out to a lake and had a hunt for these tiny little mushrooms with a golden cap and purple stems/ribs. We ended up with a breadbag full. One of the boys threw about 50 into a pot and brewed them down into a juice which we then made into coffees.</p><p>Our mates who had already experienced mushrooms warned us of the possible effects, which was good. Forewarned is forearmed, after all. Within 1/2 an hour, I started to feel a bit light-headed, and sat back on the couch staring at a huge poster of Kurt Cobain on the wall, waiting for the full buzz to kick in. My mate who was also a first-time user suddenly fell asleep, and we couldn't wake him. All of a sudden, I noticed Kurt's lips moving. He was talking to me, but I couldn't hear what he saying. I thought, hey, this is cool, and sat back and just buzzed out.</p><p>My mate, asleep on the floor, suddenly started fighting in his sleep. We tried our hardest to wake him up, but he was completely underby now my trip was in full swing I felt a call of nature, went to the bathroom, sat down on the loo, and next thing I know, I'm seeing hands and faces coming out of the walls. I must've spent about an hour in there, just buzzing, laughing at the weird shapes I was seeing.</p><p>When I finally made it out, I found my mate twitching on the floor, crying and wimpering like a puppy that had just been beaten by its ownerunfortunately, the rest of us were too out of it to really care.</p><p>This is where the strangest and at the same time most amazing part of the trip occurreda friend of a friend is really into her spirituality and occult, and she started talking about how mirrors can act as a gateway to your soul, given the right stimulant. So she and I started gazing into the same mirrorI saw my face change shape, into things out of nightmares, and also into what I interpreted as visions of goodthis chick's face was changing all the time as well. The really freaky part was, we both saw the same changes at the same timeshe saw what I saw, and I saw what she saw. Now I'm a bit of a sceptic when it comes to anything supernatural, but this was fully freaking me outit was like we were two separate bodies with one pair of eyes (one mind??).</p><p>We must've spent hours gazing into that mirror, alternately laughing at the funny shapes our faces took, and shivering at the visions which I can only describe as evil. The day after, I had a heart to heart talk with this chick, and her interpretation of this phenomenon was that our minds had linked, and were seeing the two halves of the human soul in that mirror - the good and the evil</p><p>My mate had been nightmaring for about 9 hours straight on his trip. He woke up shivering and muttering to himself about 'the dark, the dark'.</p><p>He has never touched mushrooms or any other hallucinogenic drug since. I've had a few more mushroom trips, all of which have been mind-altering and enjoyable experiencesall have been different, but all have left me with a feeling of mild euphoria.</p>",
 "year": "2001",
 "id": "10175",
 "timestamp": "2005-07-14T07:00:00.000Z",
 "views": "3993",
 "dose": [
  {
   "time": "0",
   "amount": "16 caps",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(tea)"
  }
 ]
}
