{
 "id": 10172,
 "title": "IV Trial",
 "date": {
  "submission": "2007-04-27T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Loki",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "IV",
   "substance": "DMT"
  }
 ],
 "report": [
  "<p>This is not so much a trip report as it is an account of a botched preparation.  I noticed no one has posted a report on injected DMT salt, so I'll provide one.",
  "I've extracted dmt several times.  I've also synthesized it but I find that route is more trouble than it is worth for someone working with OTC chemicals (basicly I got shitty yields of poor purity and had no desire to flash it through a column).  I have recently improved my extraction work-up greatly, and as a result am able to obtain great yields of damn near pure product (clear needles recystallized from pet. ether).  So this brings me to my story.",
  "I've smoked dmt countless times and have had great experiences.  After reading the section in TIHKAL, I decided to try an IV injection.  I figure you use half the product and get twice the experience.  In TIHKAL, they mentioned some study long ago where a DMT HCl solution was used.  As HCl is the acid I had on hand suitable for use to make a salt, that is what I used.  I eyed out what I hoped was close to 20 mg (I only wish I had a scale that would measure milligrams).\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]",
  "I mixed a HCl/dH20 sol. to about pH 1.5.  .5 cc was pulled into an insulin syringe.  The DMT freebase was placed into a spoon and the acidic solution was squirted on to it.  Much to my dismay, the crystals did not dissolve.  I stirred with the plunger, it did not dissolve.  I tried heating, which merely melted to crystals.  It smoked a little, smelling strongly of DMT.  I was starting to get irritated, and quickly mixed up a stronger HCl solution, pulled .2 cc into the syringe and mixed it in the spoon.  Some of the melted crystals actualled dissolved, but not everything went into solution.",
  "I placed a cotton into the spoon and sucked up the solution into the syringe.  An insulin syringe is generally 1 cc, so it was damn near full.  I tied off, found a vein, and began to slowly inject the solution.  In about 10 seconds my heart was pounding and a became very anxious.  It takes forever to inject that much solution from an insulin syringe, and after about half of it was in, my hand started shaking.  The needle slipped out of the vein, I started to notice a swelling at the injection site, at which time I removed the needle. ",
  "The effects were minimal and included pupil dilation, some stimulant like effects, and slight visual disturbances.  There was also pain at the injection site.  The dose I was able to administer was only threshold level.  I would not try this again with the hydrochloride salt, it is just to much of a pain in the ass to obtain a solution.  I would love to know which salt Shulgin used.  Anyway, that's my story.  I don't think I could recommend this.</p>"
 ],
 "erowid": {
  "id": "60939",
  "citation": " Loki. \"IV Trial: experience with DMT (ID 60939)\". Erowid.org. Apr 27, 2007. erowid.org/exp/60939",
  "substance": "DMT",
  "views": "15794"
 }
}
