{
 "id": 10187,
 "title": "Fractal Eternity",
 "date": {
  "submission": "2008-02-06T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fluffsta",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum"
  }
 ],
 "report": [
  "Part of me despises my need to put things into words, for fear of overlaying something profoundly indescribable with a limited definition. On the other hand I want to do what I can to process and absorb it, and writing it down is my way of thinking it through.",
  "And there again, thinking it through seems the wrong way to go about it, too. The rational mind cannot compute the idea of opposites being simultaneously true: being and not-being, for example.",
  "To evolve, we need to be able to understand things in a way that is not confined to the rational perspective. But I can only start with thinking, and writing.",
  "There was no emotional content: no reassurance, no ecstasy. Nor any terror or danger. Nor was it the void. This was a place beyond either love or indifference.",
  "I was being pulled and drawn through patterned fractals. They were visible in an endless curving procession, leading into infinity  identical patterns, as though the same layer was strobing. I knew that this had been happening for ever and would go on happening for ever. I knew that I had been moving through it for all eternity, and always will.",
  "I was dimly aware that back in our dimension, on my right-hand side, my best friend was holding my hand. At the same time, and this astonished me as much as anything, the physical sensation of being twisted and pushed  upwards and around, following the curve of the fractals  was overwhelming. It was as strong as feeling a comb being pulled through me, travelling up my spine. I felt a brief anxiety about being split and torn apart, with part of me attached to something on the right and the rest of me being so forcefully extruded. Then I was simply there, moving swiftly, unaware of my hand any more.",
  "Looking up Mandelbrot set on Wikipedia this morning, I found an image that approximates what I saw (although the patterns were different, and you have to imagine everything curving and a strong physical sense of being twisted, forced through and along. The article has some amazing pictures  shame I have nofuckingidea what they are talking about!!!",
  "I felt as though each fractal represented another plane of reality that I might have stepped out into. But the relentless, uncontrollable forward motion meant that I kept moving through and past each fractal plane before having a chance to integrate. It was as though I could have incarnated at any of these points, but the onward motion was too pressing. Part of me felt dismayed by this. There was a sense of wanting to stop the ride and get off somewhere, a desire to be somewhere more familiar, or at least with familiar energies around me, not this endless, tireless procession of replication. The exact-sameness of it unnerved me slightly. It was very different from the volcanic diversity that I become aware of on mushrooms.",
  "Sometimes Outlook Express doesnt open straight away, and then when it does I get a few Outlook windows on the screen all at once. This was like that, only multiplied infinitely, and the sensation of it was rather like wanting to go into Outlook and instead being unable to stop the millions upon millions of Outlooks constantly opening on my screen before I had time to do anything with them.",
  "I gradually became aware that in a little bubble of brightness over on my right was the tiny illusion that we call reality, with my friend sitting on the sofa in it. I knew that when I opened my eyes, I would be drawn back into this illusion and it would start feeling real again. Although I was not happy where I was, I felt there was an element of helpless capitulation in returning to this bubble and accepting it as real. It seemed so insignificant. It also felt self-constructed. I identified strongly with it, but in the way that you might be reluctant to sell a picture that youd spent a long time painting. I had a sense of this clinging and reluctance being a human idiosyncracy that traps us at a lower level of evolution. But I was afraid to let go of my attachment to this world, in case I never came back to it.",
  "Such a paradox, feeling unable to let go of something that I now understood to be insignificant! I was unable to think or feel fast enough to deal with this dilemma. It was too much. Part of me just gave up, something along the lines of What the hell, I may as well go back, I need time to work this out.",
  "When I did open my eyes, everything was the same and not the same. Everything was intensely still. Things looked bigger and heavier. The silence was heavier. The words we spoke were slower and heavier. When I finally moved, I felt heavier. There was no doubt that this was the world I had left ten minutes ago. Yet, although nothing had changed in it, and it gradually settled back to normal, in some ways it will never be the same again.",
  "My investment in and attachment to the illusion of this dimension seems to be what perpetuates it, making it seem real and solid. I wouldnt have thought I was capable of creating and sustaining something so complex and convincing, but this doubt seems to be the only obstacle to grasping the power to generate a whole lot more besides.",
  "Out there, I had the sense of other intelligences having managed this transformation long ago. There is a lot of catching up to do.",
  "But then, since time and space have no meaning, there are no other intelligences and the catching-up was done long ago. For all of eternity, I have been, and always will be, both able and unable to exist as pure creative consciousness.",
  "I must still be out there now, except that the words still and out there have no meaning.",
  "Thinking it through, this morning",
  "What was this experience showing me? There was something plant-like about it (like being the sap travelling within roots as they push into the soil?), and yet I am human. I wondered a little about the fact that salvia is an unusual plant, cultivated mostly from genetically identical clones and whether this explains, on some level, the repetitious patterning of the consciousness that this plant shares with us.",
  "Or is it that the entire universe is not unique, but replicated ad infinitum? In which case everything I ever grieved to lose, or hoped to gain, is meaningless. Behind me are universes in which everything is already complete. Ahead of me are identical universes in which everything thats ended here is only just beginning.",
  "A lot of this information is not welcome. It will take a while to adjust to it. I dont embrace it with delight. I feel some resistance, which in itself will take me a while to locate and fathom out.",
  "Integrating this experience into the current state of play with my spiritual development, I found myself reading the following, this morning, with deep appreciation:",
  "Allegiance to the Void implies denial of its Voidness",
  "The more you talk about it, the more you think about it,",
  "the further from it you go.",
  "Stop talking, stop thinking, and there is nothing you will not understand.",
  "Return to the root and you will find the meaning.",
  "Pursue the light, and you lose its source.",
  "Look inward and in a flash you will conquer the apparent and the void.",
  "All come from mistaken views",
  "There is no need to seek truth, only stop having views.",
  "[Seng Tsan]",
  "Thought is time, and time creates fear.",
  "[Vivekananda]",
  "The only conclusions I can draw are:",
  "I am human and non-human.",
  "I am here and not-here.",
  "I am finite and infinite.",
  "I am me and not-me.",
  "There is no limit to the power of creation.",
  "I know that all these statements are true. But integrating them fully is going to take a while.",
  "When I start reading through what I have just written, my use of phrases such as our dimension and you have to imagine  already seems comically meaningless.",
  "Our dimension?",
  "You?",
  "Imagine?",
  "This may really bugger up my writing style. From now on, I might have to start putting everything in inverted commas.",
  "I pity the teenager who takes this for fun because it is sold in ready-rolled joints as a legal high."
 ],
 "erowid": {
  "id": "61015",
  "citation": " Fluffsta. \"Fractal Eternity: experience with Salvia divinorum (ID 61015)\". Erowid.org. Feb 6, 2008. erowid.org/exp/61015",
  "substance": "Salvia divinorum",
  "views": "5485"
 }
}
