{
 "title": "Smooth",
 "author": "Kev",
 "citation": " Kev. \"Smooth: experience with Ephedrine (ID 10184)\". Erowid.org. Jul 14, 2005. erowid.org/exp/10184",
 "substance": "Ephedrine",
 "bodyweight": "165 lb",
 "header": [
  "DOSE: T+ 0:00",
  "25 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 4:00",
  "25 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)",
  " T+ 4:00",
  "2 capsls",
  "oral",
  "Kava",
  "(capsule)",
  " T+ 8:30",
  "25 mg",
  "oral",
  "Ephedrine",
  "(pill / tablet)"
 ],
 "report": "<p>I decided to try Ephedrine after reading about it on the internet. I got some at the Herbalist in my neighbourhood mall, and they are 25 mg per tab. I had a regular cup of tea at about 11:00 am and waited till 12:30 pm to take the Ephedrine. I took one tablet and it took about a half hour to feel the effect. Very mild, not at all like caffeine. I did not feel wound up, and drove to another city 200 km away quite normally. I did not feel jittery or tight in the chest or head as on caffeine (coffee). I felt awake and my body felt quite nice. I decided to take another and took it at about 4:30 pm, and also took two Kava Kava capsules (which I also got from the Herbalist) with the Ephedrine. About a half hour later I noticed more of an effect. It felt really good, it was quite mild, but good. I would describe it as 'smooth power'. Although my hands were slightly shaky, that's all that I can say against it.</p><p>The Kava Kava made it smoother definitely. My breathing passages are quite clear. I was walking around, up stairs and through a mall and did not feel tired or winded and my heart was beating faster but not pounding. I had a good appetite and had a 22 oz beer without incident. At 9:00 pm I ate another Ephedrine and had a coffee with it. Awake for sure now! All in all it was good, and perked me up a lot. I felt quite alert, and very comfortable, with no undesirable effects, no headache, but a muscle in the top of my foot lightly twitched once in a while for about a half hour. I will definitely do it again, maybe three all at once, and probably with Kava Kava capsules. Thumbs up for Ephedrine!</p>",
 "year": "2001",
 "id": "10184",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-14T07:00:00.000Z",
 "views": "25872",
 "dose": {}
}
