{
 "title": "Pleasantly Unpleasant",
 "author": "NoStoneUnturned",
 "citation": " NoStoneUnturned. \"Pleasantly Unpleasant: experience with 4-Acetoxy-DiPT (ID 101980)\". Erowid.org. Dec 11, 2013. erowid.org/exp/101980",
 "substance": "4-Acetoxy-DiPT",
 "bodyweight": "144 lb",
 "header": [
  [
   "DOSE:",
   "25 mg",
   "oral",
   "4-Acetoxy-DiPT",
   "(capsule)"
  ]
 ],
 "report": "<p>Like most highly anticipated experiences, the reality wasn't as fun as the imagination of that reality. It was a Saturday and a friend and I arrived very early to a show that we didn't want to see the opening acts to. Within thirty minutes we both had gotten bored watching/ listening to repetitive electronic music. With DET as our other option we figured giving DIPT a go would make the most sense. We both took a 25mg cap each around 8pm. Haven taken a small dose of the chemical before I more or less knew what I was in for and didn't have any negative emotions or hesitation while going into the experience.</p><p>+8:45: Start to feel something minor in the way my body flows, I can communicate better with others.</p><p>+9:30 I am sitting alone by a wall because my back is in pain, I figure it's because I've been up since 4am. My head isn't racing, just traveling on a new path. I've noticed that this chemical induces a trance like state in my mind, once the mind was put to something it could seemingly do it forever.</p><p>+10:00 I am now on the other wall, feeling glued to it. My back hurts anytime I move it from a certain position. I can see my friend ahead of me so I go say hey, neither of us can seem to understand each other. Even if we could understand the words we are both misunderstanding the message being conveyed.</p><p>+10:30 ow, my back hurts, to be more specific it feels as if my entire lower back was pushed slightly out of place and then flexed extremely hard. I was able to sometimes stop the feeling by moving and relaxing a part of my back but it felt very strange to do so.</p><p>11:00 My friend has beat me back to the wall. Both glued to it trying to relax our backs. Exhausted and in pain it finally comes on. We only stay about an hour due to</p><p>the exhaustion.</p><p>11:30 Driving was not ideal, I had to keep reminding myself I was driving anytime my friend and I would start talking. My back felt better. I controlled my thoughts and we made it home.[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>12:00 for the next hour I proceed to laugh at nothing until I realize I need to sleep.</p><p>All in all this was too high of a dose for me, whatever it did to my back was not pleasant. At 12mg I had a good time, 25mg was on the unpleasant side. No visuals to be noted, everything is in the body, and it doesn't feel particularly good in any way. There is however no comedown or brainscrambling the next day, but with little psychoactive effect why would there be? This psychedelic will stay in the tool shed, probably never to be given away or used.</p>",
 "year": "2012",
 "id": "101980",
 "gender": "Male",
 "age": "20",
 "timestamp": "2013-12-11T08:00:00.000Z",
 "views": "284",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "(capsule)"
  }
 ]
}
