{
 "id": 10196,
 "title": "Not What I Expected",
 "date": {
  "submission": "2008-09-03T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "GBVsoldier",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Atomoxetine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:45",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Atomoxetine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Atomoxetine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am a 16 year old 130 pound male in reasonably good shape. To give a little background on my experiences, Ive done copious amounts of marijuana, salvia, methylphenidate, DXM, oxycodone, LSA (morning glory), and diphenhydramine. I went into the night with a positive mindset and environment at my friends house. The timeline went something like this:",
  "T = 0: I arrive at my friends house and learn that he has a prescription to Strattera (Atomoxetine). After doing a little research online, I could not find much information. I then decide to contribute to society and try the Strattera. I take one 40 mg pill on an empty stomach.",
  "T + 45 minutes: I start to feel a slight tingling sensation on my head and extremities. I decide that this is not enough and take an additional 40 mg pill.",
  "T + 90 minutes: I start to feel the full effects of the second and first pills combined. It is completely unlike the speedy rush feelings I generally feel from the methylphenidate. Its more of a marijuana body high, in that I feel a complete body calm/relaxation. Combined with this relaxation was an incredibly alert state of mind. I found that the Strattera appeared to be helping my thinking process. At first, my friends and I discussed politics, and I was able to think about the ideas from both mine and my friends perspective. The thoughts and points flowed articulately from my mind to my mouth. And the beautiful part was that as soon as we were done talking, my mind and body went back to a very relaxed state. Excited by how well it is going, I decide to take one last 40 mg pill.",
  "T + 125 minutes: Life is going very well. The relaxation of my body is reaching low oxycodone levels. Closing my eyes and just focusing on the feeling of my body is incredibly enjoyable. Just as before, my mind is as sharp as ever. Knowing that I am able to think more clearly than before, I purposely start a religious debate with my friends girlfriend. In the 35 minutes that we talk, I talk for about 25 minutes, but I barely notice the passage of time. My friends alert me to the fact that Im talking incredibly fast, which surprised me because I was consciously trying to talk slowly. I would believe that this was the peak.",
  "T + 165 minutes: I start to come down.",
  "T + 280 minutes: I feel as I did at T + 45 minutes.",
  "T + 345 minutes: I have come back down to baseline levels. The decent was smooth and pleasant, and only very evident because I was constantly thinking about my state of mind/body.",
  "The next day: I feel mildly tired, but most likely because I stayed up late. No other unpleasant side affects are present.",
  "Overall, I had a very enjoyable time. This is the kind of substance that would be ideal for a mundane school day, as it does increase focus with fun side effects. I can definitely see why this would be prescribed to kids with ADD, as it slows down everything while keeping the mind sharp. I would definitely consider doing it again. I believe the addiction potential is there because it is a pleasant feeling that I already, a day later, wish to experience again."
 ],
 "erowid": {
  "id": "61063",
  "citation": " GBVsoldier. \"Not What I Expected: experience with Atomoxetine (Strattera) (ID 61063)\". Erowid.org. Sep 3, 2008. erowid.org/exp/61063",
  "substance": "Atomoxetine (Strattera)",
  "views": "38701"
 }
}
