{
 "id": 10195,
 "title": "A Night of Vomiting",
 "date": {
  "submission": "2007-06-24T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bleh17",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Well I was home from college and was bored looking for something to occupy my mind when I stumbled across a bottle of 60x 50 mg tablets of Ultram. From what I had read it seemed to be fairly week so I decided to go big on my first experience with the drug and take 5 pills. Whoa!",
  "T+0:30 min- My vision is blurred significantly and I can feel my motor skills slowly fading away.",
  "T+1:00- Wow Im really starting to question if I should have taken as much as I did. Every 5 minutes are so I totally forget where I am and then all of a sudden I remember. Almost like taking to much X. I also have a quite euphoric body high, but the stomach ache seems to be countering the good feelings.",
  "T+1:30- Finished vomiting for the first time I feel significantly better now, its almost like being in a dazed stupor after taking a lot of morphine. I find I can no longer play counterstrike source because Im much to slowed down and I forget Im playing every other match.",
  "T+2:00- Im purtty sure Ive already peaked I can feel myself starting to even out. I went to the bathroom to vomit again...if it wasnt for the vomiting I would have really enjoyed this drug.",
  "T+3:00- I went to bed for about to hours woke up feeling quite refreshed and then I threw up all over the place, but after that the vomiting stopped and I felt purtty good throughout the day.",
  "Retrospect- Overall a good experience I enjoyed everything but the vomiting which I think could have been avoided had I taken a lower dose."
 ],
 "erowid": {
  "id": "61062",
  "citation": " Bleh17. \"A Night of Vomiting: experience with Tramadol (Ultram) (ID 61062)\". Erowid.org. Jun 24, 2007. erowid.org/exp/61062",
  "substance": "Tramadol (Ultram)",
  "views": "8859"
 }
}
