{
 "id": 10207,
 "title": "Open a Hot Door Carefully",
 "date": {
  "submission": "2000-06-23T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "MindScan",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "325 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>DXM is a truly powerful drug.  There are aspects of it that are completely unlike LSD or PCP, etc.  There are however, some very interesting effects of coming up and down.  Setting is the most important factor in controlling these.  Pictures on the wall of actions, such as a flock of geese landing in a pond, music, nothing heavy as it can freak you out, and company, make sure you have good friends who won't freak out as that can get to you too. Make sure that you don't watch a gorey movie as you could start to think about that and anything you think about could be turned into a vivid hallucination, especially at higher doses. ",
  "OK.  I'll start with my report. I bought one 4oz bottle of Robo Max. strength cough.  This has a little over 300mg of DXM I believe, it also has guifensen which can make you sick.  Upon return to my house and rooting through my cupboards, I came up with another partially full bottle and went into the living room, or the trip room as it was.",
  "I made sure that the CD player had some good techno, not too loud, not too fast, but a good beat to it.  I dimmed the lights, I have the wonderful reaction of pupil dilation, be sure to watch out for that if you're going to go out in public.  The first bottle went down pretty easily after about two to three shots of Schmirnoff.  The second, my dose is approximated because of the 'partially full' bottle, needed a little help.  A good idea might be to keep some Altoids near by because if you chew on about five of them, you can't taste anything for a while.  But the second was down and the vodka felt nice and warm.  I sat down and relaxed on my sofa, flipping through the channels to find something worth my time, theres never any trippy shows on when you need one... ",
  "The first effect was noticed about thirty five minutes after ingestion.  My balance was slightly off and the ceiling was forming interesting black and white patterns, I have a 3D ceiling with lots of random patterns in the plaster.  This made walking around the room very interesting as everything seemed more interesting.  My mind was almost more clear, like the drug was pushing out all the dust and opening some unused area of my brain. ",
  "The second effect, possibly called the first plateu (I think its supposed to be somewhere around ten times the effect of marijuana), was a dropping away of all worldly cares.  Extreme euphoria made everything O.K., but locomotion was extremely hard.  I had to crawl back to the couch.  Anything over 300 mg might be impossible to do out in public. ",
  "The third, and expected, effect occured about an hour after ingestion.  I glanced up towards the ceiling and almost hit my head on it, well, it looked like it was just inches from my face.  The picture on the wall, a flock of ducks instead of geese that were landing in a reed surrounded pond, and I mean that they were at that moment landing, swimming out of sight and coming around for another splash landing.  This was possibly the most interesting thing I noticed.",
  "During the hallucinatory part, my sense of hearing seemed to come and go.  I would notice that there was music playing, but forget about it moments later.  The same for the TV.  I would look at it and see a black screen, then suddenly, the show would be back, until I lost interest and it turned back into a black screen. ",
  "The biggest error I have ever done while tripping, is not locking my two cats in another room.  One of them sleeps on the couch and although seeing him there was only mildly interesting, when he yawned, I had to fight to keep control of the trip.  Seeing his teeth had a terrifying effect on me even though I understood that it was just a yawn.",
  "Control regained, and the effects wearing off, I tried to go to sleep.  I think I fell asleep about five-thirty am, ingestion was at eleven-thirty, and awoke to my alarm clock at eight-thirty.  The ceiling was still only inches away from my face, but no other serious hallucinations were experienced.  Although walking still had a trick to it, it was almost fun just to take a few steps in one direction and then in another.  Footfalls both before and after the hallucinations were slightly set apart from the actual placement of the foot on the ground, I felt it after I knew I should have.  Ther were no long lasting effects, but I became very tired at the end of the day.  Upon awakening I felt no traces of being tired, possibly due to the continued presence of DXM in my system.",
  "I must conlude that DXM is a very 'heavy' trip.  Although lower doses could be good for ametures, I must say that higher doses should be stayed away from if you don't know what to expect or how to control yourself.  The best part is, its legal, which DOES NOT MAKE IT SAFE, but does make the procurement slightly easier.  Just be sure that there are  no other active ingredients, or make Agent Lemon (extracted DXM from Robotussin).  Its not the DXM thats so terribly dangerous, its that acitominiphen and antihistamines, yes I know there's a whole lot more, are very dangerous in large quantities.  So do your research before you do your drugs!!</p>"
 ],
 "erowid": {
  "id": "611",
  "citation": " MindScan. \"Open a Hot Door Carefully: experience with DXM (ID 611)\". Erowid.org. Jun 23, 2000. erowid.org/exp/611",
  "substance": "DXM",
  "views": "5376"
 }
}
