{
 "title": "Afternoon Stroll",
 "author": "Bill L.",
 "citation": " Bill L.. \"Afternoon Stroll: experience with Salvia divinorum (ID 10208)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10208",
 "substance": "Salvia divinorum",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE:",
   "1 bowl",
   "smoked",
   "Salvia divinorum",
   "(plant material)"
  ]
 ],
 "report": "<p>Salvia is an incredible drug. It is a unique drug in that each person who smokes it has a different kind of experience. My friend refers to his experience as being 'trapped in the wall,' but I have yet to experience this. After smoking my salvia and holding my hit for a lengthy duration I sat on the bed to watch my friend partake. Within seconds it hit me, like a gun blast. Suddenly I was marching around the room with my eyes closed. I don't know if you've ever seen the cartoon of that guy with the big nose marching happily down the street, and the camera angle is at his feet so his shoes look really big and the background goes by but he never moves. Anyway, I was that guy for about a minute and a half. I marched around all happy, totally oblivious to all outside forces. For a moment I stopped and thought I came back to reality, but instead I sat on the bed and continued my trip. A silhouette appeared in front of me, holding an object like a baseball bat. I knew he was going to hit me with it, and I waited in suspense. He randomly smacked me with it. I didn't feel the bat, but I saw a flash of purple light. He did this repeatedly until I couldn't stop laughing. My light show continued until eventually opened my eyes and was completely sober. 'What the hell?' I thought, 'That was a fast transition.'</p><p>I watched my friend finish getting out of the wall, then we smoked some weed. Salvia is great for limited amounts of time. Whenever I get home from school and feel the need to trip before my parents get home, it's a 10 to 15 minute quickie that leaves me very satisfied.</p>",
 "year": "2000",
 "id": "10208",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-15T07:00:00.000Z",
 "views": "3093",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(plant material)"
  }
 ]
}
