{
 "id": 10209,
 "title": "A Good Low Dose Combo",
 "date": {
  "submission": "2001-12-09T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gandolf",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "6.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": {
    "number": "4.0",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Generally, when I go dancing, I prefer not to be too altered. I find that I usually need just a little chemical push to put make the trance dancing space accessible, and I also don't like being paranoid, bumping into everyone, or hung over the next day.",
  "I recently had a great experience combining two low doses of different psychedelics. I've been experimenting with the approach of using a low dose of one substance to nudge me just out of my normal state, and a low dose of another substance to slightly increase that state. Most of the time, the second drug will affect me stronger than it would have on it's own, almost as if I had taken a full dose of it, because the first substance acts as a path opener. The high that ensues is usually a subtle combination of both drugs, less overwhelming than a full dose of either, but usually enough for me to have a very good time.",
  "The two substances in question that evening were 2c-t-2 as a path opener, and 5-meo-dipt as the added boost. At 10pm I ingested 6mg of 2c-t-2 dissolved in water. I waited for the subtle change in perception and minor anxiety (that, for me, often seems to accompany the initial phenethylamine push) to integrate and plateau, and then at midnight, I similarly took 4mg of 5-meo-dipt, just before going to a dance event.",
  "By the time I had gotten there, relaxed, hydrated, and waited for the visiting DJ to make his appearance at the decks (1am), the 5-meo-dipt had smoothly sailed into my personal world, effortlessly combining it's own brand of intense physical energy with the mood lift that was already rolling through me from the 2c-t-2. I felt great. I danced, I shook, I let my limbs be taken over by the bass. During one rhythmic build, I had the clear sensation of having a ball of energy move up my spine in beat with the music, and explode above my head as everyone's arms raised to welcome another peak in the mix. Again, during all this, as with my other low dose experiments, I was able to stop it whenever I wanted, and coordinate myself enough to get water, talk to a few people etc...",
  "At 4:00 am, I had had enough, and left. Home by 4:45am, was able to fall asleep an hour later. Felt energized and calm the next day.",
  "As a side note: the days before I had been saddled with a debilitating crick in my neck that kept me from turning my head in either direction more than a few inches. When these occur with me, they usually take a week to resolve. It was my second day into this episode, when I decided to go dancing. The day after the above experience, my neck pain was completely gone! And remains so several day later. All in all, cheaper and more fun than a chiropractor!"
 ],
 "erowid": {
  "id": "6111",
  "citation": " Gandolf. \"A Good Low Dose Combo: experience with 2C-T-2 & 5-MeO-DiPT (ID 6111)\". Erowid.org. Dec 9, 2001. erowid.org/exp/6111",
  "substance": "2C-T-2 & 5-MeO-DiPT",
  "views": "15668"
 }
}
