{
 "title": "Amazing Experience",
 "author": "Jewfro",
 "citation": " Jewfro. \"Amazing Experience: experience with LSZ (ID 102017)\". Erowid.org. Dec 13, 2013. erowid.org/exp/102017",
 "substance": "LSZ",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSZ",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>1:20AM Placed the blotter tab on my tongue</p><p>1:45AM Not sure if I'm feeling anything, something's is definitely there.. not sober.</p><p>2:30AM Decided to take a short adventure in the snow with 2 friends, one on the same dose as me the other sober.  It's raining, freezing outside, but not enough to bother you mentally. -- Sleepy feeling, yawning from time to time.</p><p>3:00AM Back to the house, no visuals yet, extreme body load, slight discomfort here and there, nothing abnormal.</p><p>4:00AM Completely missed the past hour, feint visuals, similar to an afterglow of LSD, the discomfort here and there has gotten more intense, but nothing that bothers me.</p><p>4:30AM Not sure if I'm coming down or not, but it may just be the LSZ hitting me in waves like I usually feel psychedelics.</p><p>5:00AM Relaxed mood, very VERY feint discomfort here and there, still having fun, the urge to read & write is coming on more and more</p><p>5:32AM Here I am, watching Bob's Burgers, definitely coming down, still got a decent body load, and still feel good, but now I'm getting sleepy again.</p><p>5:39AM Some feint visuals are on the screen, making it look like what I'm reading or typing is my focus, while anything out of my focus is blurry or dimmed in light, The ONLY time I've felt the concept of time slipping away is when I think about it, time seems to pass just fine on this substance.</p><p>Honestly, this was the most relaxed trip I've had, and seems like LSD in so many ways, I hear stories of nausea during the onset, did not happen.  I felt really tired a lot during the trip, and can't see any reason to have trouble falling asleep.  Definitely good for someone who is interested in psychoactive drugs, and I would recommend it for the newb or even the intermediate. </p><p>I've noticed it doesn't play much of an affect on your mind, and can be controlled with ease!  The come down is lax as well, and as soon as it's over I plan on sleeping a full 8 hours, no problems.</p>",
 "year": "2013",
 "id": "102017",
 "gender": "Male",
 "age": "19",
 "timestamp": "2013-12-13T08:00:00.000Z",
 "views": "874"
}
