{
 "id": 10212,
 "title": "More Stimulant than Empathogen",
 "date": {
  "submission": "2007-04-12T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pogle",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Piperazines",
   "form": "pill/tablet"
  },
  {
   "time": "5:30",
   "amount": "80 mg",
   "substance": "MDMA",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "FOAF and his lady spent tuesday from 10.30 am to 2.00 am at home having fun with approx 180 mg MDMA crystal each, plus numerous joints made with medium quality hashish. They're both experienced users of MDMA, which they use either to enhance erotic adventures together, or when they're playing gigs-both being musicians. FOAF is a long term moderate to heavy cannabis user. Neither have any history of mental illness.",
  "Wednesday morning they were both pretty tired, and aware that they'd not eaten enough during tuesday-FOAF estimates that he'd consumed no more than 1000 calories. After a late lunch of beans on toast at 3.30 pm, they decided to try BZP/TFMPP party pills for the first time, to see if they were indeed an acceptable MDMA substitute.",
  "They'd procured a tub of Enjoi efx party pills from New Zealand. The tub cost just under 10 for 5 capsules, of 450mg each. The label claimed 100mg BZP and an unspecified amount of TFMPP, and vitamins C, B3 and B6 in each capsule. Apart from feeling a bit tired, they were both in a good frame of mind, physically comfortable, and being at home, were in happy familiar surroundings. Having read of some of the side effects of BZP they were feeling slightly cautious.",
  "At 4.30 pm they took one capsule each",
  "T+15 mins FOAF could feel a very mild rush coming on",
  "T+20 mins FOAF began to feel queasy-his lady had noticed no effect",
  "T+30 mins - both feeling queasy, and both slightly speedy, with a noticeable 'metallic' taste in the mouth",
  "T+1 hour - both feeling quite speedy now-surprised at the strength, but both feeling rather nauseous, which really spoils the speediness. FOAF notices his neck muscles tightening and makes conscious effort to loosen them as he suffers from spinal arthritis.",
  "T+2 hours - the speediness would be quite nice if it weren't for the nausea and the generally metallic feeling throughout one's body-a harsh and very 'chemical' feeling headache tries to start, and comes and goes. Mouth feels dry and fouled up.",
  "T+3 hours - still nauseous, find that physical exertion sadly makes it worse. FOAF picks up a musical instrument and has a play-notices easy high speed playing ability, much like cocaine or speed-after 10 minutes is feeling too nauseous to carry on. 3 hours is the time that the label says to take another capsule if required-no way!",
  "T+4 hours - still nauseous -both a bit disappointed and feel that it's been an endurance-nausea, muscle tension, peripheral headache. Both ate more beans on toast at this time-quite difficult, but feel a bit better for it.",
  "T+5 hours - no change-still both feel fragile. Notice time has passed quickly. Listen to music, and notice no enhancement of listening pleasure. Also notice no enhancement of physical/sexual feelings-just want to feel better.",
  "T+5 hours 30 - the nausea is now only spasmodic. Both decide to take approx 80mg MDMA crystal - he sub-lingually, her orally.",
  "T+6 hours -both coming up on the MDMA-feels SO much nicer-a much more embracing feeling-still occasional queasiness, but both feeling a lot better-very tired though.",
  "T+9 hours - have had sex a couple of times, but the BZP/TFMPP has made it impossible to climax-they don't usually have too much trouble on MDMA crystal. Still suffering from occasional nausea waves and very tired indeed.",
  "T+10 hours - decide to go to bed-both feel a bit wired but are so tired that they fall asleep quite easily.",
  "T+18 hours -the morning after... both exhausted and still feeling queasy!",
  "T+22 hours - still feel quite fragile and drained.",
  "Conclusion",
  "A powerful stimulant, which would have been ok were it not for the negative side effects. Might be ok for taking before going out to play a gig, but it would need to be when one was fully rested and fully nourished. As a replacement for MDMA it's a non starter. It has none of the warmth of MDMA, very little empathic quality, and is much more akin to speed or dexys-only more coarse, harsh and physically draining. Please do yourself a favour and think seriously before dropping two of these and going partying-you'll probably feel like shit for quite a time."
 ],
 "erowid": {
  "id": "61116",
  "citation": " Pogle. \"More Stimulant than Empathogen: experience with Piperazines - BZP/TFMPP & MDMA (Ecstasy) (ID 61116)\". Erowid.org. Apr 12, 2007. erowid.org/exp/61116",
  "substance": "Piperazines - BZP/TFMPP & MDMA (Ecstasy)",
  "views": "12541"
 }
}
