{
 "title": "Trip Around The World",
 "author": "Shroomer",
 "citation": " Shroomer. \"Trip Around The World: experience with Mushrooms (P. cubensis) (ID 1022)\". Erowid.org. Jan 6, 2001. erowid.org/exp/1022",
 "substance": "Mushrooms (P. cubensis)",
 "bodyweight": "130 lb",
 "report": "<p>It was a Friday night, and me and my best friend were looking for some fun.  We went to the local supermarket and found our friend there who sold mushrooms.  We wanted to try shrooms and it was the perfect night so he went back to his house and about 45 minutes later he came back with a fresh 1/8 of shrooms for us. </p><p>Me and my friend went back to his house, I was sleeping over there.  His mom went upstairs to sleep and we were downstairs watching tv. We knew that this was the time to trip.  We didn't really know that much about these mushrooms or their effects, we just had this curiosity to try them.</p><p>We went into his bathroom, split the mushrooms up in half and ate them.  They tasted awful.  We didn't know exactly how much time it took for the mushrooms to start effecting us.  We just both laid down on the couch and watched tv.  After about 15 minutes, we thought that it was a waste of money and nothing was gonna happen.  I was becoming very tired and almost asleep.  There was the tv on and a very dim lamp in the room.  I was just lying there and staring at that lamp, when the light started to move, I didn't know what it was from.  Maybe I was just very tired and seeing things.  Then I started feeling a little more awake and my tiredness was going away.  I still wasn't sure if this effect was from the mushrooms. I told my friend that I was feeling a very slight weird feeling, and he said that he felt nothing at all.  I stared at the blanket that was covering me.  It had pictures of Dick Tracy on it, and I then started to call out Dick Tracy. I was chanting Dick Tracy non-stop for about 10 minutes and then I started to laugh uncontrollably.  It was pretty loud too.  His mom came downstairs and told us to keep it quiet.  Then she went back upstairs, and I started to laugh again. By now, I was sure that all of this was from the mushrooms.  My friend started to laugh too.  I was talking uncontrollably also.  I just laid there on the couch, I felt like I weighed 1000 pounds and could not get up.  I was sinking into the couch like it was quicksand.  I just kept on babbling about random things and wouldn't keep quiet.  My friend went and got me a roll to eat so I would stay quiet, but I thought that I would choke on it if I tried to eat it, so I literally shoved it down my boxers and started to rub it on my penis, making believe that I was having sex with it, crumbs were getting all over the place.  I started to laugh and I was chanting, 'There's Millions and Millions of crumbs everywhere...' for the next 5 minutes.  I kept seeing these very strange images in my mind, and I was in a trip for a couple minutes and then I was out of it and I seemed totally normal, then when I least expected it I was sucked into another trip and I could actually see myself being sucked into it.  I saw myself traveling through a huge tube at almost the speed of light, and many of the trips were different.  I went back into the same trips a few times and they were familiar to me.  One of them was the 'HeHeHaHa' trip.  I would see different visions in each trip. And then checking the clock, what seemed to be hours was only a few minutes.  Then I just got totally uncontrollable and we were afraid of my friend's mom waking up and coming downstairs.  We had to leave the house.  My friend got his clothes on fast, but for me it took about a half hour.  I forgot how to get dressed when I was in my trips.  And then finally I was out of a long trip and was able to get dressed fast before being sucked into another one.  We then snuck outside.  I was surprised that I was able to do it without making any noise.  We went outside where it was freezing cold.  We were walking along the street and I was looking for any way to get warm.  I saw a garbage can and quickly ran to it.  I tried to jump into it, but my friend stopped me.  We just kept walking until we got to the woods.  We entered it and my friend said that I had to be totally normal before we could go back to his house. We walked through the woods and I could feel the trips getting shorter and wearing off. I was able to talk to him normally.  We talked about the experience and what we had learned and finally got back to his house at about 4am, and sat in his living room and talked about the experience.  Then we finally went to sleep.</p>",
 "year": "2000",
 "id": "1022",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-01-06T08:00:00.000Z",
 "views": "7977",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  }
 }
}
