{
 "id": 10220,
 "title": "Opiate With Druel...",
 "date": {
  "submission": "2009-10-03T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "chill",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Pharms - Clonidine",
   "form": ""
  }
 ],
 "report": [
  "After being an every day user of hero wan... for about 4 or 5 months, i decided one day to quit cold turkey (mind you, i was not shooting it, only snorting it, but i was doing anywhere from 6 to 10 bags a day, which is ALOT, enough to easily OD a non-user, or even an unexperienced user with slight tolerance) so ive felt the less severe symptoms of being dope sick when i stopped my one-bag-a-day habit the year prior (only snorting), and lemme tell you, that was no picnic. but only that time i didnt tell anyone, not even my parents, i just sed i had the flu and stayed home from school for about 4 days...feeling like a new man coming off the stuff.  Then a couple months later my dumbass started using again.  I decided to tell my parents bcuz this time i know i couldnt do it myself. i wanted to stop, but the craving to use would be so severe that i would end up using.",
  "so after letting my parents know (who had nooo idea watsoever) they were fully supportive and took me to the hospital.  they gave me a clonidine patch at the hospital and told me to take it off when i felt better.  the only thing i noticed was that it gave me a slight lightheaded feeling (most likely due to its blood pressure lowering qualities). thats about it. as far as helping me to get thru withdrawal..i couldnt tell you...i was so sick it was like being in hell...i did not get a wink of sleep for the first 3 days..then on the fourth day i felt a little better and by the fifth day my symptoms were just about gone but i still couldnt sleep...i decided to take the patch off and i slept fine..ive been clean ever since (that was june 2006)and always fight the urge to use heroin again...it is by far the most addicitve substance ive ever used..i strongly suggest to never try it..cuz i would say about 90 percent of people who try it WILL become addicts...the other 10 percent have to be extremely strong willed people to try it a stay off of it...it will slowly creep up on you no matter who you are, in retrospective of clonidine..i dont think the patch administers enough of the substance to feel any effects, however, i doubt it has any recreational qualtites, but i could be wrong..."
 ],
 "erowid": {
  "id": "61132",
  "citation": " chill. \"Opiate With Druel...: experience with Pharms- Clonidine (ID 61132)\". Erowid.org. Oct 3, 2009. erowid.org/exp/61132",
  "substance": "Pharms- Clonidine",
  "views": "13588"
 }
}
