{
 "id": 1022,
 "title": "Mind-Melt Blast Off Into the 9th Dimension",
 "date": {
  "submission": "2005-02-05T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nieztsche",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "325"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  },
  {
   "time": "0",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I'd like to detail a salvia experience I had last week. First of all, I've done salvia about 6 times and I thought I'd try to reach the highest plateau by doing a high dose of 10x (salvinorin ehanced)leaf. (for those of you not experienced with salvia don't even think of doing a large dose of 10x your first time.. unless you don't mind smashed furniture everywhere and being so terrified you'll scream bloody horror for your mommy while clawing at the walls)",
  "Salvia is no joke. It is a total mind-melting, shamanic blast-off strait to never-never land, especially at high doses. So I planned ahead. I recruited both my girlfriend and my roommate to be my guides (and to hold me down). I am especially interested in the multi-universe/dimension aspects of M-Theory physics and salvia has a way of ripping a gaping hole right into the space-time fabric of the universe. So, I prepared for my voyage be letting go of as much tension as I could by telling myself I have a good life and I'm generally a lucky person with a good heart and mind (The usual BS, ha-ha).",
  "I loaded the first large bowl on my glass Turkish water-bong with approximately 325 mg (1/3 gram) of the 10x (with MJ as the base), lowered the lights to almost total darkness, turned off all ambient sound, got onto my bed and had my sitters sit on either side of me. I proceeded to torch the bowl (lighter is right on top of the leaf for higher temps but an ice cube helped to reduce harshness) and began inhaling the thick smoke to my lung's end capacity (note: I can take pretty large bong loads and I think that ability is key to a salvia breakthrough). I held for exactly 16 seconds on the first inhale (I wanted to be able to hit it again!) and then prepared for the final breakthrough by taking another giant hit and then having my sitter count back from 20. (I've learned that salvia smoke must remain in my lungs for no less than 17 seconds to achieve a major breakthrough).",
  "I remember hearing 17, 18...and then I was no more. Spinning furiously and gaining momentum down a gaudy plastic colored vortex right into some grotesquely ironic inner dimension at the core of matter, time, space and thought. This was a very scary place because I got the feeling that I've now seen too much and there is no way I am going back (although the concept of 'back' was very vague and little memory existed of the 'real world'). I also got 'the joke is finally over' dj vu again in a major way (It is common with my trips to feel that life was all just a big, silly joke played on us humans) I  felt that the people behind the cosmic curtain facade were about to emerge and scare the living shit out of me. Who are these beings? They feel distinctively like someone we know very well but forgot about upon entering our earthly existence. It is very creepy yet somehow terrifyingly exhilarating to feel as though you are being watched by something beyond our dimension. Even after the trips this feeling remains somewhat.",
  "I have no idea whether my eyes are open or closed nor am I conscious of my bodys position or any of my surroundings. In fact, I cant remember having a body at all. All I feel are images of my childhood in all directions culminating and building up to an approaching presence.  There really was no hope of directing my trip to focus on enlightenment in the realm of understanding the universe in a way I could rationalize it. Salvia tends to take you where it wants you to go. The trip feels more like an exaggeration of the subconscious and it toys with your fears and expectations of how you emotionally view life and the universe. There seems to be little logic involved, just a blizzard of primal intuition; I feel like a three year-old kid in a very perplexing world and my fear or joy seems to shadow what comes next. This substance really does make one look at life in a different context and from a completely unique perspective. It is truly an out-of body experience. This stuff is really weird with a capital W.",
  "I realized something was holding me down. Flickering segments of a far-off reality were trying to tear into this crazy dimension. I heard a voice far off in the distance yelling something.I began to realize that it was my voice. I had been yelling help and hold onto me! hold onto me, Im falling in!. There were two entities at either side of my  stretched body. They were very far apart. They gave me comfort because I felt I would spin off forever into another unknown dimension if they let go. I began to realize that they were people back in the world I had come from. It was strange to think that they could be partly in this world too, sort of like the dwarf lady in the movie Poltergeist trying to hold on to the little girl from falling into the afterlife dimension. They were of course my girlfriend and my roommate, who were deeply disturbed by my yelling and horrified expression. In fact, they both vowed: To never, ever try that salvia shit in a million years after that, which disappoints me because Ive spent many hours trying to peer-pressure them into trying it!",
  "All in all, I think salvia trips are the best at higher doses. I feel once I understand' (ha-ha) this substance Id never settle for mediocre journeys again (if there is such a thing as salvia either tends to either just work very mildly or its wildly intense). So, I plan to get more 10x in a few months and have another go. I really cant do it too often because its such a crazy, kick in the ass experience; sort of like trying to water-ski without skis and your hands are tied to the rope. The only drugs I can even remotely compare it to are high-dose Ketamine/DMT experiences, but all packed into about 8 minutes. This substance- Salvinorin A (said to be possibly the most powerful dissociative/psychedelic in the world) has a big future. Yet, salvia wont be legal for long if people take it in the wrong setting and for the wrong reasons. People will end up in ER from carelessness. So please do as everyone else states emphatically: ALWAYS have a sitter and never be in public. Irresponsibility with this drug will just be nails in the salvia coffin and we really want to keep this legal for a while.",
  "It seems that it that there is a art to breaking through with salvia. So, for a breakthrough every time:",
  "I remain in a very comfortable environment (preferable my bed) with nothing around to knock over and with a sitter I trust. I use a water-bong and add an ice cube to the water.",
  "I use high-potency salvia (10x Salvinorin enhanced leaf from a reputable source works the best) and pack 250 mg doses into the bowl (unless its stronger than 10x!). I use MJ or tobacco underneath the salvia leaf as a base. Keeping the lighter right on top of the leaf the entire time I am combusting the material, I take in the most smoke my lungs can handle without coughing up (if I cough, I have to start over). I have my sitter count back from 20 when my lungs are full and do not exhale the smoke until at least 20 seconds. I try to take in short breaths of air while my lungs are full with smoke to circulate the smoke in my lungs. I repeat this process if necessary."
 ],
 "erowid": {
  "id": "12959",
  "citation": " Nieztsche. \"Mind-Melt Blast Off Into the 9th Dimension: experience with Salvia divinorum (10X extract) & Cannabis (ID 12959)\". Erowid.org. Feb 5, 2005. erowid.org/exp/12959",
  "substance": "Salvia divinorum (10X extract) & Cannabis",
  "views": "12332"
 }
}
