{
 "title": "Not a Kratom Substitute",
 "author": "Jimmy J",
 "citation": " Jimmy J. \"Not a Kratom Substitute: experience with Sakae Naa (ID 102254)\". Erowid.org. Jan 7, 2014. erowid.org/exp/102254",
 "substance": "Sakae Naa",
 "bodyweight": "",
 "header": [
  [
   "DOSE:",
   "5.25 g",
   "oral",
   "Sakae Naa ",
   "(tea)"
  ]
 ],
 "report": "<p>Nov 25 2013</p><p>I live in a state that recently controlled Kratom and have been looking for alternative plant sources with kratom/light opioid effects. After some research, I chose a reputable online vendor. The Sakae Naa arrived crushed, so you cannot see the whole leaves in my photo.</p><p>Sakae Naa (combretum quadrangulare) is sometimes sold as a kratom substitute. I had read that people think it smells and tastes like kratom.  To my nose, it does NOT smell like kratom, wet or dry.  The smell reminds me of the incense smell you get when you walk into a head shop.  It also doesn't taste like kratom,  but if you're hoping for a tasty tea look elsewhere.  Trust me, if you're going through kratom detox this will not give you what you are looking for.  If you bought it hoping it would then you will not be happy.</p><p>I made some tea making myself the guinea pig. There are some reports online, but not much that's solid. As I sit here, it occurs to me that I actually have no idea what is in my mug.  It could be oak leaves for all I know.  Hopefully it really is Sakae Naa and not some crap from China that's going to harm me.  I suppose that's the risk I am going to take.  Ahh the things we do in the name of research..  Yeah, that's the ticket!</p><p>After my first try, I'm not too impressed with Sakae Naa.  I started with 5.25 grams total in the tea. Drank half around 45 minutes ago and drank the other half 10 minutes ago.  There was some tea left, but but just couldn't drink any more of it. I flushed the rest.</p><p>After fifteen minutes, a minor body hit.  A little dizzy.  No euphoria.  A little confusion.  No nausea, but like I said I didn't drink it all at once.</p><p>At least there is no headache or worse - yet. </p><p>The next day, my notes indicated that I did get a little bit of a high, but it's not what I would call enjoyable.  It was more physical, and definitely not a hit on the pleasure centers of the brain.  There has been a sort of numbing at the base of my skull, if that makes any sense.  It definitely does NOT work on the opioid receptors as my nose is still running from my kratom detox.  Had it been an opioid my nose would be dried up by now.  What a shame.  I wanted to like it. </p><p>- - - - - -</p><p>Dec 9 2013</p><p>Preparation:</p><p>Boiled 1/3 cup water in microwave for 1m 15s.  Poured the boiling water over 5.25 gm ground Sakae Naa powder in a coffee mug.  Covered and let sit for a couple of hours.  Filled up the mug with orange juice.</p><p>16:05 - Drank approx 1/2 the mug</p><p>16:15 - Starting to feel slightly light headed.</p><p>16:20 - Starting to feel something more, but its hard to describe. </p><p>16:25 - There seems to be a numbing at the back of my head.  There is</p><p>sort of a high, not unlike a small hit of really mediocre marijuana.</p><p>16:30 - Drank the remainder of the tea.  The mug is now empty.</p><p>16:45 - Still have a slight high.  Relaxed might be a better term.</p><p>Listening to music is enjoyable.  Numbing has increased from behind my</p><p>head down my back a little.  There seems to be a subtle body effect.</p><p>17:05 - Still relaxing.</p><p>17:30 - Starting to wear off a little.</p><p>17:45 - Continuing to wear off a little more.</p><p>18:30 - Sakae Naaa has pretty much worn off.</p><p>Update:  Did 5.25 gm again the following afternoon.  Drank all 5.25gm in one gulp.  Got nothing from it so there must be a tolerance to it that builds quickly.  Sorry to break the bad news folks.  Sakae Naa has a mild effect when it works, and that is about it.  </p><p>- - - - - -</p><p>Dec 20 2013</p><p>I upped the dose from 5.25gm to 7gm yesterday.  Again, I got a little high from it.  I would rank it a 1 out of 10 if that.   It affects my body more than actually giving a good feeling euphoria, but again even the body load was short lived.  After about an hour I couldn't feel much of anything.</p><p>This Sakae Naa - if that was what was actually shipped to me - has been a big disappointment, especially since some places are selling it as a kratom substitute.  I would tell people not to waste their money on it as it just doesn't deliver the goods.  It also seems to have a bit of a liver load to it,  which makes me suspicious as to what I was actually sent.  Anyway, I'm done with it.</p><p>",
 "year": "2013",
 "id": "102254",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2014-01-07T08:00:00.000Z",
 "views": "114"
}
