{
 "id": 10224,
 "title": "The Second Time Around",
 "date": {
  "submission": "2009-12-02T08:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "TwoX",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "1:00",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "7:30",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Friday had finally arrived. The anticipation was mindblowing, the preparations, extensive. During the day I could barely contain myself, begging time to make an exception for me, for the sun to set just a little faster.",
  "Curiously, the days festivities actually began with a drug test - that I passed. You see, I had found myself compromised in regards to my recreational activities some weeks before, and was at the time facing the consequences of my carelessness. No matter, for without the imposed abstinance of my cherished trysts with the Lovely Mary Jane, this night would not have been possible. After pissing clean as the new fallen snow, I made my way to the setting-- the local science museum, which was holding its monthly light show, to the music of Dark Side of the Moon, a personal favorite.",
  "With the show to begin at 9, I took all four of the pretty little pieces of paper I had in my pocket at 7pm, relishing the mildly bitter taste as I sucked on them for my traditional 20 min, before swallowing to make sure none was lost. The onset was normal, with the clammy coldness that I have actually grown to enjoy creepying over my skin by approx. 8pm, before giving way to decent visuals and mildly abstract thoughts.",
  "I had taken these same blotters before, actually quite frequently over my period of impending drug tests, due to their indetectability, and was aware of their relative impotence, hence 4 hits. The night would have been rather lackluster had it not been for my first love, Mary. I had arranged for a friend of mine to bring a car as a secure smoking location (as the museum officials had finally become aware of the type of people who attended these shows), so we all piled in and went over to the darkest part of the parking lot. After a brief stint of irrelevant complications, I found myself with a small glass bong in my hands, packed to capacity with some succulent bud I had obtained.",
  "This was where it got interesting.",
  "Keep in mind this is all in the context of LSD, which was still working effectively enough that I didnt even notice there was no water in the bong. This realization came about mid-harsh-hit, but as I hadnt smoked for the better part of a month, the pungent aroma that I missed so, so, so very much was more than compensation. Ah, the payoff of my patience. Obviously, my normally shield-like tolerance was at baseline, at with the first, sudden blast to my receptors, reality melted around me. It consumed my body with the first hit, and I quickly passed the piece to my friend while absorbing the INTENSE sensations. Depth perception was out the fucking window, it was as if everything I saw from the backseat of that car was on a flat canvas.",
  "I only took 1 more hit from that bulging bowl and it was entirely sufficient for where I wanted to be. I quickly exited the stifling car and made my way towards the building. On the way there I saw several of my friends smoking in their cars, and made a weak attempt to acknowledge them, euphoric in the knowledge that I was lightyears past them. Another friend of mine approached me later, and I was fascinated to watch her talk and gesticulate-- it was as though she was a fluid cartoon, and her entire body was a monochromatic collage of blue (smerfette?). I finally reached the floor and laid down for the show, under the giant, colorful dome of the planetarium, and gradually reached a trancendental state, to the point where I can barely remember the show, just nitpicks of the songs, and the intense elevation I felt at climax of Eclipse, a moment I had eagerly awaited the whole show.",
  "I could barely find my way to the train station, but once on, just chilled and enjoyed the closed eye visuals, before eating at a pizzaria and walking home with my friend. Its a long walk, and there were many adventures in between, but the real peak of my night was actually yet to come. When we reached my house, I was starting to come down (2:30am), so we rolled the rest of my bud and his into one fat club of a spliff, and carted it outside with a fuckin forklift. We finished it after some time, and I just laid back, enjoying the twinkling, connect-the-dots aspect of the stars, before heading in. I was way stoned, but not exactly tripping, and laid down..gradually drifting off.",
  "KEEERRRR---POWWWW!!",
  "My eyes shot open and I saw only my digital bedside clock reading 3:23am. My universe had been remolded, repressed, processed and spit back out. The sensation I felt as the full power of the bud hit was indescribable. I stood up and walked around, and realized that I realized everything for the first time. I saw things for how they truly were, they looked the same, but I saw them entirely differently. It was a heightened awareness of the universe and everything, I had no idea what was happening. Gradually, I pieced together the conclusion: My name is ----, Im tripping on LSD, and these are the effects. The best way I can describe the sensation is as though before I was just an animal, such as a dog, and that I had just become self-aware as a human, suddenly realizing, I EXIST. I also pieced together that if I went to sleep, the feeling would go away. I laid down, but was continually touching my arms to bring my attention to the fact I had a body, as it would instantly disappear each time I was still, and I would become nothing more than an immeasurable point of awareness in the cosmos where thoughts-were-matter-were-energy, where everything was constructed of the same inexplicable material. This was the strongest I had ever felt these two drugs in combination.",
  "The feeling lingered for days, obviously not as intense. It wasnt exactly a good feeling, but definatly not a 'bad trip', that was months ago, and my tolerance is once more at baseline.",
  "Fuck if I cant wait to try it again."
 ],
 "erowid": {
  "id": "61159",
  "citation": " TwoX. \"The Second Time Around: experience with LSD & Cannabis (ID 61159)\". Erowid.org. Dec 2, 2009. erowid.org/exp/61159",
  "substance": "LSD & Cannabis",
  "views": "2598"
 }
}
