{
 "id": 10227,
 "title": "No High and a Near Death Experience",
 "date": {
  "submission": "2007-03-06T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "anon",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "9000 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I'm not sure as to why I decided to do it. Anything for a high I guess. But anyway one night near the end of the summer I took a bunch of my welbutrin pills. At first I didnt feel much. I got a little drowsy after about fourty minutes and I lay down and watched tv. I started to see little things on the floor and they looked like spiders but I knew that it was just in my head so I didnt care. And then I felt sick so I got up and tried to walk to the bathroom. It felt like the world was flipping violently from side to side. And I couldnt even make it out the door so I had to crawl the rest of the way.",
  "The rest of the night is extremely hazy to me but the things I do remember are that I spent most of it by the toilet and the rest lying on th floor out side the bathroom because I couldn't seem to get any farther than that. I remember thinking that I was going to die and hoping I would because I have never felt that bad in my entire life. My mother found me the next morning lying on the carpet in a pile of my own vomit. And the next couple of days were spent in my bed I was unable to walk properly for days and I chewed the skin off the insides of my cheeks. Im pretty sure I had a seizure (welbutrin is known to cause seizures in high doses) and my memory's been pretty messed up ever since.",
  "It was without a doubt the worst experience of my life. Trust me its not worth it."
 ],
 "erowid": {
  "id": "61164",
  "citation": " anon. \"No High and a Near Death Experience: experience with Bupropion (Wellbutrin) (ID 61164)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61164",
  "substance": "Bupropion (Wellbutrin)",
  "views": "14668"
 }
}
