{
 "id": 10232,
 "title": "True Tales of Bizarre Marijuana Experiences",
 "date": {
  "submission": "2001-06-24T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Brady",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "For egotistical reasons I will now relate a few experiences I have had under the influence of that wicked madness-inducing narcotic, marihuana:",
  "Bizarre Experience #1: I am sitting in a bathtub of warm dingy water smoking a small bowl of the pot. Enjoying mindless hoppy-go-luckiness of mind.  Splashing happy water. Eyes roving about, I spy whippits (Oh, JOY in a can!) and immediately determine to inhale their contents. I do so, inhaling one, then another. Frigid blue lips. I am enjoying dissociative effects and general WOOH WOOH WOOH WOOH of reality reflecting off bathroom walls ...when all of a sudden... a feeling of empty dead butterfly gutlessness occurs in my abdomen areas. I perform the cursory 'reality check' to make sure I have all my robots in a row only to discover to my aghast that quotidian reality has at some point in my absentminded reverie been sucked out of every toilet seat, wall tile, and faucet of my dingy bathroom world. Every surface of the room drips and vibrates with existential Nothingness. My mind leaps out into the imaginary spaces of the World searching for meaning only to find the rest of the World an identical crud-covered hell. This whole experience frightens me shitless (literally) and after evacuating my bowels I take off downstairs to watch some good ole T.V. About 15 minutes of this crap is sufficient to put me at ease.",
  "Bizarre Experience #2: I am again in the bathtub (I'm with Archimedes on this one...the bathtub is where it's at). I smoke a bowl of grass and get out drying myself in front of the mirror. Like the narcissist I am, I pause to ponder my alien countenance. I say alien because I always see a stranger staring back in any mirror I dare to peek into. I feel an intuition. It tells me...you could be a floating head...if you want. I decide that might be nice and pursue this feeling further. Within a matter of no more than half of 5 seconds, I have localized consciousness in my head to the exclusion of the rest of my body. That is to say: I became my head and erased my body. I check the mirror, it being a more objective source of knowledge I reason, only to find that my body has blurred away, still visible but fuzzy, and my head is illuminated, a corona of white light enveloping it. It takes an effort to maintain this state and the novelty soon wears off, returning me to full body awareness. I am bemused and ready for sleepy time.",
  "Bizarre Experience #3: Probably the most bizarre experience I've had with marijuana. A friend and I have walked out to a wooded area to smoke, hoping to avoid mindcontrol policestate authority figures. We find a clearing, smoke, and head back to his house. We are crossing a field between the woods and road, my friend nearby at my side, we aren't talking, just digging the outdoors, when on the way from hither to yon a most uncanny occurrence doth occur...that is to say, with no warning whatsoever my awareness seperates from my body and leaps above my body into the air. I see myself as if in a grand movie. My whole life an hour and so many minutes of videotape and this a scene of small importance. i am profoundly saddened by the realization that my life like a magnetic image on a VHS tape will fade and dissappear into nothingness. Of course, this is all quite fucking-well-disturbing, and I immediately feel disoriented and struggle to regain normal comfortable consciousness. Reality spins. I feel light, which is better than the previous feeling of not existing. And then I am back in my body. Stunned but otherwise none the worse for wear. Upon returning I realize I've fallen over and am on my knees reaching up to the sky to balance myself. I relate my experience as best I can to my friend, who apparently noticed nothing amiss, but he is on the marijuana too and shows little comprehension...."
 ],
 "erowid": {
  "id": "6118",
  "citation": " Brady. \"True Tales of Bizarre Marijuana Experiences: experience with Cannabis & Nitrous Oxide (ID 6118)\". Erowid.org. Jun 24, 2001. erowid.org/exp/6118",
  "substance": "Cannabis & Nitrous Oxide",
  "views": "13767"
 }
}
