{
 "id": 10244,
 "title": "Death, Fight for Life",
 "date": {
  "submission": "2007-03-06T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chris",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I know this is short but what I experienced can not be explained in words. I wrote this within minutes of the effects wearing off.",
  "My first few tries at salvia were met with minor effects. The gravity feeling. Tunnel vision. Felt like I was stoned. This was fun I thought. After work today I thought I might enjoy it again. I had been using small amounts (25mg) of 15x previously and figured 40mg might be good this time. Ohhh how I was wrong.",
  "The setting was my dark room. No music or sounds of any kind. Only light was a blue lava lamp. Temperature was about 22c (71 Fahrenheit).I was using a 381mm (15 inches) water bong and a butane torch lighter. Notably there was quite a bit of smoke this time. Within 10 seconds it came on strong. Massive gravity, I was being pulled down. I was becoming less and less aware of everything around me. Forget tunnel vision. It was like my vision was failing all together. The last thing I remember was taking a second hit and laying down on my bed. Then.. nothing. No memories, thoughts, or anything. I was dead. I say dead because suddenly it was like I had regained consciousness, not in our reality but somewhere else. I really thought I had died. I remembered I needed to get back to my body. I thought of nothing else, no memory of what I had done. The only thought I had was that I needed to get back. It frightened me that if I didn't try my hardest I wont ever be part of existence as we know it. It was just like when your dreaming and know it and you're trying to wake up but cant.",
  "Finally I found my self back in my body. My room came in and out of my vision. Kind of like someone was turning the lights on and off in a pitch black room. It was all I could do to get up. I could feel some force pulling me back down towards my bed. I didn't want to lay down. It might have taken me away again. The force kept trying to take me away. I needed to keep touch with reality. Scrambling I found my phone and ran outside. The light was so bright! Sounds were odd also. Like someone was turning the sound on and off. I called my friend and tried to talk. It was hard. Hearing their voice made me feel not so alone. Gradually it wore off. I had a hold on this reality. The whole time coming down the effects (light, sound, gravity) pulsed stronger then softer gradually fading away.",
  "I must say that this was the most intense experience of my life. I don't know if I will ever try it again. I have given the rest of my salvia to a friend. I will have a sitter next time for sure if I venture into that realm again. Listen to what everyone is saying! Use this herb with caution and respect. If you don't, it will kick your ass and frighten the shit out of you. Use a sitter! If you do decide to use it, I wish you luck in your journey.",
  "After later analysis I've concluded that I may have reached level 5 - 6 according to the salvia users guide. A lower dose may give me a more enjoyable experience but I am still a bit reluctant to try again."
 ],
 "erowid": {
  "id": "61215",
  "citation": " Chris. \"Death, Fight for Life: experience with Salvia divinorum (15x extract) (ID 61215)\". Erowid.org. Mar 6, 2007. erowid.org/exp/61215",
  "substance": "Salvia divinorum (15x extract)",
  "views": "3714"
 }
}
