{
 "title": "Once The Music Starts, We're All One Being",
 "author": "Spreadhead83",
 "citation": " Spreadhead83. \"Once The Music Starts, We're All One Being: experience with Mushrooms - P. cubensis (ID 10249)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10249",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "125 lb",
 "report": "<p>After coming to college, I decided that I would try out various psychotropic substances, since I was now free to do so.  I have been smoking marijuana since my freshman year in high school, but was always scared of drugs such as LSD (it makes you stare at the sun till you go blind, you know).  I had read up on mushrooms, though, and decided that I would definitely try them out if I ever got the chance.  I managed to find an 1/8th of cubensis at a Big Wu show one weekend, and figured that my first time with shrooms would be the upcoming Widespread Panic show.</p><p>I gathered the people I was going to the show with in my dorm, and managed to get 2 grams down with the help of half a bottle of V8 Splash.  The taste wasn't entirely awful, but my body didn't seem to accept the fungus as food, and my gag reflex kept acting up.  I got them down, and we started walking down to the venue.  The walk down was interesting; it was dark out, and I figured the lights should be getting brighter any time now, but they never did.  I didn't worry too much though, as I was 99.999% sure that I had eaten the right thing.  We got to the venue without incident, found our seats, and prepared for what was sure to be an interesting night at the very least.</p><p>After about fifteen minutes of sitting down and enjoying the scene, something happened.  One of my friends said something slightly amusing, and I started laughing.  Like an idiot.  For about five minutes straight.  Some combination of what she said, the dude in front of me complaining about expensive water, and the fact that i was about to start tripping in front of ~7,000 people really got to me, and I just lost it.  I started thinking I was going to break my face from smiling so hard, but that just got me laughing more.  After I finally managed to regain composure, I braced myself for the voyage to come.  A small problem emerged, though: the fact that I had downed a quart of V8 was coming back to me, and I had to go to the bathroom.</p><p>While I was standing in the line, just chatting with the phans around me, some old drunk guy comes around and starts yelling, 'Oh no, they've started!'  Looking back, it was obvious that he was just dicking around, but the wave of terror that swept over me was amazing.  I couldn't bear the thought of missing even one second of the show, but I really had to pee, so I stayed in line freaking out.  Then I realized the house music was still playing, which calmed me down somewhat, but it wasn't until I got back to my seat that I was fully able to relax.  I was trying to sort out what was happening with me, when Panic came on.  The first few songs were interesting: I could tell that it was good ol kick-ass Panic up there, but what was happening in my mind pretty much consumed my thoughts and emotions.</p><p>Finally, they broke out into 'Blue Indian.'  If you don't know anything about Widespread, this is one of their more mellow songs, and contains the line, 'How long till the medicine takes.'  As soon as JB sang this one, it hit me: this was the trip.  I started laughing again, and just let it all out, dancing like a fool with some guy in the aisle.  I later found out he was rolling, but that's besides the point.  The rest of the trip was basically guided by the music: when they played mellow songs, my thoughts turned mellow (feelings of childhood, etc.), and when they played heavier songs, my thoughts turned more introspective and serious.  One thought that consumed me all night was the feeling of community within the Panic crowd: how, once we get in there and the music starts, we're all part of one being.  I told this to one of the security guards who was trying hard not to have a good time, and she just laughed.  I explained that she was a part of it and didn't even know it.  I honestly think she appreciated that one, as I imagine most of the time they're just viewed by concert-goers as security and nothing more.</p><p>The only downside to the whole experience was trying to sleep: part of me wanted to stay up and play, and part of me wanted to get some rest.  Other than that, it was one of the greatest experiences of my entire life.  Like being seven again, where the entire world is new, and everything you come in contact with is just something else to be played with.</p>",
 "year": "2001",
 "id": "10249",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-15T07:00:00.000Z",
 "views": "3254",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
