{
 "title": "Growing Journal",
 "author": "JuanPacoLopez",
 "citation": " JuanPacoLopez. \"Growing Journal: experience with Mushrooms - P. cubensis (ID 10246)\". Erowid.org. Aug 16, 2004. erowid.org/exp/10246",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "",
 "report": "<p>Growing Journal</p><p>This is a log of my first attempt at growing my own psylocybe mushrooms. </p><p>---------------</p><p>Day  1:\tSept. 11, 2001.  Today I prepared the jars for innoculation.  I used Ball regular mouth (tapered) 1/2 pint canning jars.  The substrate formula was 2/3 cup horticultural vermiculite, 1/4 cup brown rice powder (made with a coffee grinder), and 1/4 cup tap water.  I sterilized for about 1 hour 15 minutes.  It took almost 5 hours for the pot/jars to cool all the way after sterilization, but I finally got the jars innoculated and stored in my closet.  I kept spraying the kitchen constantly with disinfectant to make sure there weren't any airborne contaminants. [Note:  I also spent all day with my eyes glued to CNN, unable to believe what I was seeing... scary world folks]</p><p>Day  3: Sept. 13, 2001.  First signs of growth!  Jar #2 has some white fuzziness at two of the innoculation points.  No signs anywhere else, but it's been less than 48 hours so I'm pleased.</p><p>Day  5: Sept. 15, 2001.  All jars are showing signs of growth now, with #2's growth almost tripling from the other day.  Also, no contamination yet!</p><p>Day  8: Sept. 18, 2001.  Making good progress...  The germination sites are intermingling and getting much 'fuller' and spreading to other quadrants.  Jar #1 is doing pathetic, but I'm not surprised as I only used maybe 1/2cc of solution for the whole thing (last jar).  Need to start on the terrarium soon.</p><p>Day 11:\tSept. 21, 2001.  Great progress all around... jars 3 and 5 should be ready in a few days and the other jars are doing great... no contamination yet either!  I found an ultrasonic humidifier today for $29 at Walgreens, so I think I'll get that and a digital timer for my terrarium setup (as well as the standard plexiglass and styrofoam cooler setup).</p><p>Day 13: Sept. 23, 2001.  I turned the jars upside down to speed colonization of the bottoms... most have mycelium all the way around or at least 85-90%, and just need to colonize the bottom.</p><p>Day 22: Oct. 3, 2001.  All the jars are doing great.  A couple have pulled away from the sides and one is colonized at about 98%.  I'm going to buy the stuff for the terrarium sometime soon.\tI decided to go with a giant rubbermaid and perlite for humidity (mostly because it's MUCH cheaper and supposedly works better).  The last little bit of growth is taking FOREVER.  I ended up puttind a lamp in the closet to keep them warm as I figured the recent drop in temps had slowed them down a bit.  Seems to be working, we'll see.</p><p>Day 23: Oct. 4, 2001.  PINS!!!  I went to check the jars today, and 4 out of 7 had pins growing right near the vermiculite interface!  They weren't completely colonized, but all were at least 85-90%.  I ran down to the local stores and picked up stuff for my terrarium.  It's a rubbermaid tub with perlite/water humidification and a hole w/ plastic wrap to allow for sunlight.  I even picked up a neat temp/humidity gauge at Target for $4.99!  The humidity seems to be stabilizing just over 92% which is perfect, and the temp is right at 76 degrees F.  Should have something to eat here in 5-7 days.  After hearing horror stories on a popular forum about difficulties with pinning, I'm happy.</p><p>Day 29: Oct. 10, 2001.  I've picked my first couple of shrooms.  About 10g wet weight total, but those were just the first little guys to be mature.  There are about 4 LARGE shrooms and about 11 medium ones on the way.  Myself, my girlfriend, and a friend of ours are going to sample the first bit Friday night... I can't wait!  The ones I picked I placed in the fridge to store until the harvest day, there's a SEVERE bluing reaction on the one I picked yesterday... time to post to message boards and see what everyone thinks.</p><p>Day 30: Oct. 11, 2001.  Good progress.  Looks like there will be enough for our little 'harvest party' tomorrow... but the cakes are going to be picked clean.  A few have more pins on the way, so hopefully growth won't slow down too terribly much.  I can't WAIT for tomorrow night! [We got impatient and tripped tonight...  I ate about 23 wet grams.  I tripped a bit too hard and almost had a bad trip, but it all worked out and I know now that my little guys are PLENTY potent!]</p><p>Day 36: Oct. 17, 2001.  I had to bury 3 cakes this week.  All of them got the same greenish-black colored mold, and all in colonized areas.  I think it's probably due to my excessive handling of them, so live and learn I guess.  The other four cakes I placed directly onto the perlite, which seemed to rejuvenate them and initiate a second flush.  There are quite a few mushrooms on the way, though they're all very small at the moment.</p><p>Day 41: Oct. 22, 2001.  I took the terrarium down to my girlfriend's parents so I could keep and eye on my little guys. They survived ok.  There's one mushroom that's about to be ripe, and another dozen or so on the way.  Things are looking good overall, though I think they got damaged in the heat down there.</p><p>---------------</p><p>That about wraps up the useful information I can put in this log.  We sampled some more Friday night... The ones I ate had been dried in a food dehydrator, and I didn't notice any loss in potency really.  We had a great trip and have many more shrooms on the way, so it all went pretty well.</p><p>Not only is growing mushrooms EASY, but it DOES WORK as long as I follow the instructions carefully.</p>",
 "year": "2001",
 "id": "10246",
 "gender": "Male",
 "timestamp": "2004-08-16T07:00:00.000Z",
 "views": "14307",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(fresh)"
  }
 ]
}
