{
 "id": 10251,
 "title": "Please Hallucinations Into Heavy Sedation",
 "date": {
  "submission": "2002-02-14T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Chillbert",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 nuts",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "Well, i did it.  and it wasn't all that bad!  here's how...",
  "--Went to the bulk herb section of the natural grocery",
  "--purchased 10 nuts of whole nutmeg",
  "--considered buying milkthistle and drinking a tea of that too (i hear that Nutmeg is hard on the liver)--but did not.",
  "--crushed the nuts and consumed...(i boiled mine in milk, but i don't think it matters much...just get that pile of gaggy-bitterness down the hatch in some way!)",
  "--i drank the potion at 7 p.m. and began to feel effects approximately five hours later, after eating and smoking some herb.  (it tasted awful)",
  "--it was late, i was alone...so i feel asleep a few hours later, thiking that nutmeg is an ok buzz...",
  "--i woke up, or rather, came to the next morning, feeling as though someone had slipped me some very heavy sedatives...i was washed out tired and was hallucinating too.  I was as dry as the sahara and weak as a kitten.",
  "--at around 11:00 i mustered up the energy to drag my weak self into the bathroom, where I looked at my eyes.  They were little slits, all red.  I looked like I was half asleep...they communicated my sensations...I was messed up.",
  "--following this I had a burst of energy, made some green tea, and enjoyed the buzz.",
  "--I am still recovering a day and a half later!",
  "-- believe me...if you do this make sure you are not committed to do anything else that weekend...if you are anything like me, you will be transformed into a zombie for at least a day to a day and a half.  The hangover is cool, if you dont have to accomplish a single thing...because if you do...the guilt of struggling with the exteme fatigue in order to accomplish things will be a serious bring down.  Trip out in a mellow super-weed way, then under heavy sedation, then sleep alot.  That's what i did! ",
  "(i really want to know more about Nutmeg and Nutmeg Liver, a scary sounding condition)"
 ],
 "erowid": {
  "id": "6125",
  "citation": " Chillbert. \"Please Hallucinations Into Heavy Sedation: experience with Nutmeg (ID 6125)\". Erowid.org. Feb 14, 2002. erowid.org/exp/6125",
  "substance": "Nutmeg",
  "views": "25865"
 }
}
