{
 "title": "Anybody Seen My Old Friend Molly?",
 "author": "ma-k-la",
 "citation": " ma-k-la. \"Anybody Seen My Old Friend Molly?: experience with MDMA (ID 10268)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10268",
 "substance": "MDMA",
 "bodyweight": "115 lb",
 "header": [
  "DOSE:",
  "1 capsl",
  "oral",
  "MDMA",
  "(capsule)"
 ],
 "report": "<p>This summer, at a festival called 'camp creek' in Maryahville, New York, I encountered an experience with ecstasy that was unlike any other trip I had experienced before it. Rather unexpectedly I was presented with a capsule that was about 3/4 of the way full of a lovely, fluffy white powder. I was told it was the purest roll I would ever eat. It turned out to be the most intense and unforgettable drug experience I think I may have ever had. The nickname of the cut was 'crystal shards' or 'molly' which is short for molecule. Pure MDMA. I think I must have been on the up for about eight hours altogether. I remember being completely awestruck by the intense beauty that I saw all around me. First I stumbled upon a spontaneous mini-rave out in the camping grounds, with four-six DJ's hooked up to a generator and people dancing everywhere. It was (obviously) completely free and it went on till the sun came up.</p><p>I met a boy that night, which I later discovered just happened to be exactly two days older than myself, and it felt like the first time falling in love all over again. We spent the next several weeks together, simply because we had had such a blast when we met. I know this is nothing new. Everyone is your best friend when you're rolling, but this was not the only seemingly fateful coincidence that happened that night. And on top of that, I am generally a shy person, even when bursting with waves of serotonin, but this night I felt like a child again. There was no edge to this roll. No teeth clenching, no feeling of wanting to do everything and go everywhere, but not being able to move a muscle (not even your brain) - I really could have gone anywhere in the world, or beyond, and flew there with wings to boot.</p><p>And finally, unlike most pressed pills, when I woke up in the morning, expecting to feel like I got beat up and my dog died, I crawled out of the tent into the sunshine and I felt as though I was new and whole. It felt so surprisingly good that I was suspicious at first. Then I knew that this pill really was pure. Amazingly so.</p><p>This was about 4 or 5 months ago. I haven't eaten a single pressed pill, and I've been looking for my friend molly ever since. Anybody seen her? I think she ran away with my childhood fantasies to the faerie realm</p>",
 "year": "2001",
 "id": "10268",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-07-15T07:00:00.000Z",
 "views": "15856",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  }
 }
}
