{
 "title": "Every Day Felt Like the First Day of Summer",
 "author": "Rutegar",
 "citation": " Rutegar. \"Every Day Felt Like the First Day of Summer: experience with DHEA (ID 10269)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10269",
 "substance": "DHEA",
 "bodyweight": "100 kg",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "DHEA",
  "(daily)"
 ],
 "report": "<p>Hitting the big 4-0 was a traumatic experience. I started to feel lethargic, and a malaise/mild depression/light blue funk settled over my suddenly middle aged brain and body.</p><p>I live in Canada, which is kind of like being 20 and still living with your parents. Its easy, usually comfortable, but you are forced to live under rules 'for your own good', even though they make no sense to you. If that's not bad enough, my mom & dad weren't in the hip pocket of the multinational pharmaceutical companies, like the Canadian government.</p><p>I did manage to find some DHEA from the US, sold under the counter to me by an acquaintance who runs a health food store.</p><p>I took 1 100 mg capsule each morning. After about one week, I noticed I didn't shriek  'Aw, shit!' anymore when the clock radio came on at 7:30 AM. In place of a heavy, tired, annoyed feeling as my feet hit the bedroom floor was a feeling of energy, a slightly buzzy, excited feeling that I used to feel in my early 20's as I would greet the new day. Every day felt like the first day of summer.</p><p>I felt greater confidence while using DHEA. My sex drive increased, as did the pleasure you get from completing 'the deed' (OH, YEAH!!).</p><p>I kept on the recommended daily dose. My goal was not to bulk up. It is a great mood elevator and confidence builder for male Boomers.</p><p>The drug company sycophants that rule this land have made possession of DHEA illegal, unless by doctor's prescription. I can't get it anymore. US companies won't ship it to Canada.</p><p>I really miss it.</p>",
 "year": "1999",
 "id": "10269",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-15T07:00:00.000Z",
 "views": "17423",
 "dose": {}
}
