{
 "id": 10277,
 "title": "Recreationa Meth Administrationa Done",
 "date": {
  "submission": "2009-10-01T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "comedown",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Methadone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "A 40mg 'waffer' of Methadone came into my hands from a friend who owed me a little money. I've had experience with some opiods in the past, such as Hydrocodone and Oxycontin but for the most part i would not call myself experienced with these types of pills. After reading several experiences on this website and others (I never take anything for the first time if I have not researched thoroughly), I was actually quite nervous about taking this pill. Many people had reported vomiting and illness lasting for several hours. I decided on splitting the pill with a friend.",
  "5:30pm we each took half of the 40 mg waffer. An hour and a half went by without feeling any real effects of the pill which i had read was normal since methadone is slowly released over a long period of time and takes longer to 'kick in'.",
  "8:00pm First real wave of euphoria and effects similar to what i'd experienced with Oxycontin in the past. Dry mouth, a little sick to my stomach, but a general feeling of well being.",
  "9:00pm Effects begin to escalate and nausea beings to deminish. I felt good. Really good. I felt like if i sat in the same place for the rest of my life i could be completely content.",
  "12:00am Effects seem to peak. I was feeling a little overwhelmed and very thirsty. Minor urge to vomit but nothing i hadn't experienced with any other opiod i'd ever taken.",
  "3:00am A little itchy. Still buzzing strong, but unable to sleep. Things start feeling very heavy, pulse rate is slowing and breathing is noticeably shallow but wasn't anything i was worried about.",
  "7:00am Effects start to wear off and breakfast is good. No morning nausea like i'd experienced with other opiods.",
  "All in all i'd say it was a good experience. The danger of overdosing on Methadone is high so if you are going to take any be sure to go slow and be safe. If you like other opiods recreationally you will probably like this pill. My friend and I had a blast, neither suffered from any vomiting or intense upset stomach. Each person is effected by drugs differently so things may not be the same for you. Peace."
 ],
 "erowid": {
  "id": "61343",
  "citation": " comedown. \"Recreationa Meth Administrationa Done: experience with Methadone (ID 61343)\". Erowid.org. Oct 1, 2009. erowid.org/exp/61343",
  "substance": "Methadone",
  "views": "18149"
 }
}
