{
 "title": "I Found Them Growing Right on the Ground",
 "author": "P",
 "citation": " P. \"I Found Them Growing Right on the Ground: experience with Datura (ID 10287)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10287",
 "substance": "Datura",
 "bodyweight": "215 lb",
 "report": "<p>[Erowid Note: The plant called morning glory in this report was most likely misidentified; it is probably Datura.]</p><p>I found what appeared to be a morning glory plant growing at the university I go to. I'd read about morning glory seeds and knew what the flowers looked like, so I stopped in my tracks, the getting-fucked-up part of my brain having been stimulated. I don't know what kind of morning glories they were, and they don't closely match any pictures I've seen, but I just figured they probably weren't poisonous. I had some trouble finding the seeds, which was unexpected. But when you think about it, I'm not a botanist, so how would I know? Anyway, the seeds were eventually found in these green golf ball-sized pods covered with thorns. Each pod contained about 150-200 seeds when I cut them open, which was very easy. I took them by just chewing them up until each seed was broken and smashed up and swallowing it all. I would classify the taste as unpleasant, but really nothing to complain about at all. Ingestion was very easy.</p><p>The effects were not as I expected. First of all, I started feeling really strange within 20 minutes, not 1.5-2 hours. There was no nausea, dizziness, or headache whatsoever. It was not like acid. The trip was milder and different from acid, and it made me really tired. I would compare it to a medium/low dose (maybe 2.5-3 grams) of shrooms, a few beers, and a bunch of painkillers. I've been on painkillers before, to the point where it was incredibly hard to stand up from a sitting position, because of the sheer force it took to push my body up. This was way worse than that. Standing up was almost impossible. My body was just limp. I used both arms and legs and willpower to stand up. Walking was really hard. I couldn't concentrate enough to look where I was going, nor did I have enough control over my limbs to go there once I decided where to go. I tripped and stumbled. The psychedelic aspect of the experience was different and definitely present, although weak. White lights looked bright yellow. There were mild open eye visuals.</p><p>Later, when I decided to abandon the idea of sitting up or doing anything physical, I lay on a couch for a few hours. During that period I was just in a weird trance with my eyes closed. I had strange dreams, like I'd imagine my friend standing over me trying to hand me something, only to open my eyes and see that there was nobody in the room. I imagined I could see through the couch, only to open my eyes and get a big eyeful of couch. Then the seeds finally made me so tired that I just had to go to sleep. I wanted to stay up until they were out of my system to experience the whole thing, but I was really, really fucking tired. I'd had plenty of sleep, too. The only thing that could cause my sleepiness is the seeds. I went to sleep about 4.5 hours after eating the seeds.</p><p>When I woke up, my vision was blurry and my eyes still dilated. I still felt funny. I'm nearsighted, and I wear glasses. With my glasses on, I could see things far away just fine. I couldn't, however, see anything within 2 feet of my face with any clarity if I had my glasses on. What's weird is if I took them off, I could see just fine up close (normally I see fine close and far with glasses on). What the hell does that mean? Anyway, this wore off 24 hours after eating the seeds. This trip was pretty cool, especially for something completely legal that I found growing right on the ground.</p>",
 "year": "2001",
 "id": "10287",
 "gender": "Male",
 "timestamp": "2005-07-15T07:00:00.000Z",
 "views": "9024",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "175 seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
