{
 "title": "For My Brain",
 "author": "Buba",
 "citation": " Buba. \"For My Brain: experience with Hydromorphone (Dilaudid) (ID 10286)\". Erowid.org. Jul 15, 2005. erowid.org/exp/10286",
 "substance": "Hydromorphone (Dilaudid)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.5 mg",
   "IV",
   "Hydromorphone"
  ]
 ],
 "report": "<p>Okay, to begin, I am 26 yrs old and have never done illegal drugs (or legal drugs done without prescription - as is this case) in my life. My girlfriend was into cocaine, pot, hash, LSD, and mushrooms and she had told me the stories of taking these. I, naturally, became very interested in the effects drugs have on the body. Although she insisted that I not do drugs (she is now much against it) I had to give it a try.</p><p>I initially wanted to do LSD and/or cocaine (but not together) but I have no suppliers around - not even a supplier for weed as I am but a beginner in the realm of drug use. I called a friend of mine who said she did have some liquid Dilaudid. I asked if she had anything stronger and, to my surprise, she said that this was a VERY strong drug to take (up there with heroin). Although I do not know much about drugs, I took her word for it and made the purchase.</p><p>I got her to mix the stuff up for me and inject it. She put it into the back of my arm and (her being a registered nurse) told me that this is the way it is done in the hospital. I felt an immediate burning sensation where the liquid was being injected. I felt nothing and asked her if that was normal. She told me to relax, that I will soon enough.</p><p>I began to feel a little euphoric (I think - this is my first time with this sensation). I felt as though I could say anything and so I did. My friend listened while I spoke about literally anything that popped into my head. Soon I began to feel slightly dizzy and noticed that a lot of strange designs forming around the room where we were at. I asked her if this was normal and she just smiled. Soon I began to have strange hallucinations. I panicked a little, but my friend (who latter told me that not a lot of people have this effect and that I am a little sensitive to hallucinating) reassured me that it was just the drug. I couldn't stand up without spinning. Things began to appear and disappear when I tried to inspect them. It was a very unusual experience. After about an hour of this, I began to calm down. The hallucinations stopped and I was able to just relax. I felt great. Soon, however, I drifted off to sleep. When I woke up, I felt the same as I did before taking the drug.</p><p>I don't know how often this type of thing happens on Dilaudid, as I said, my friend said not that often, but I had a great time while on it. Nothing seemed to matter (after I calmed down from my initial panic). I doubt if I'll ever inject anything again, but if I am actually that sensitive to hallucinations - I can't wait to try LSD if I ever find someone who sells it.</p><p>Bye for now.</p>",
 "year": "2001",
 "id": "10286",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-07-15T07:00:00.000Z",
 "views": "39449"
}
