{
 "id": 1028,
 "title": "Instant Calm",
 "date": {
  "submission": "2003-07-10T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "OHM",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "MBDB",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "All right, back for round 2. Last time my 185mg oral dose I reported on left me wondering if the dose could be cut in half with insufflation. Intrepid explorer as always.. I carefully weighed out 100mg (not that I think it was too important with MBDB.. the divide-and-conquer method would be fine with this material). Raked into one whopper of a line about 6' long.",
  "Background: quiet house. Peaceful mindframe after a long and harrowing week, happy to be relaxing and to have the perfect tool to do it with. Al Green songs playing at about 85% speed on Siren jukebox (slowing down already slow music is perfect for this, lemmitellya). Movies rented in anticipation of the calm and sedated lethargy. Learned my lesson from last time: rented only movies that would tickle me: Blow, Snatch, and Revelation (a silly apocalyptic movie).",
  "Couldn't really find any information on this route of ingestion, so I was a bit nervous about the burn/drip and how strong it might be going this route, as I could only find one person who even discussed taking it this way (and anecdotal evidence is not exactly convincing). Still, I felt the safety margin was enough to work with. The potential for burn/drip was my main concern.",
  "But damn, that was a pretty big line for something I couldn't much find information on... So.. in the name of science..",
  "Toot toot! First ~50mg of the line had a rendezvous with my right nostril. Burn barely present.. drip nothing suprising. Reminded me sort of speed, sort of coke, sort of roll.. hell really just reminded me of tooting powders up my nose. Nothing major here. So I let it settle and begin to drip, and I let the left nostril conquer the other ~50mg.",
  "Shit! Spoke too soon! Ouch! Not really too intense but MUCH worse than the right nostril, perhaps I was a bit congested? Ah well.. not bad enough to deter me from this route of ingestion.. there are much worse things a fella can toot.",
  "5 minutes later.. the tide breaks, and waves of calm crash and ripple over my body. Sweetly I surrender to the sensation. Much better than that hour and a half shit when I did it orally (then again, I did eat too much beforehand. I laid off the food this time, even though I was snorting). Al Green has never sounded so relaxing. I sink peacefully into a nearby cot, relaxing my body entirely and completely.",
  "I notice, this time, there is tactile stimulation. However, it's none of that 'blowing up' tingliness. It just feels exceedingly good and relaxing to stroke my body very slowly with the tips of my fingertips. It doesn't stimulate me.. it relaxes me infinitely.",
  "I do notice a few shivers when I toss my head back and try to get all the material flowing, but aside from that it's a very sedate evening. Comparison to rolls, I feel, are unwarranted. This is pure relaxation. The feeling is enchanting, but I have really no desire to do anything. Laying on the cot with my fingertips trickling up my thighs and belly feels absolutely divine. My face and neck feel very nice also. But I wouldn't want any of the aggressive massaging that feels so nice on related chems. This is a soft, cuddly, stroke-me chemical. I also feel that there's no release of emotion with MBDB. I feel totally reserved and totally at peace. No outpouring or empathy. (Note: although I was alone and that could have affected this, my last experience was with someone and the same effect was noted)",
  "No discernable 'peak.' Feelings pretty much plateau and stay as described for about 2 1/2 hours. A supplement would have helped, but I was tired from the week and felt perfectly fine letting the experience fade, leaving me content as if I had just witnessed a beautiful sunset. You do not ask the sun to come back out and play. I drifted off to sleep, still feeling wonderful in my bed but obviously down. Slept soundly. Woke with no problems (although I did wake later than usual).",
  "Merits of insufflation: Naturally quicker, doesn't 'creep up on you.'",
  "Is it cheaper? I'd have to say NO! It took half the material, but experience seemed to last half as long. Although I'd certainly be more inclined to insufflate it next time, I'll probably toot a bit and eat a bit, to give it more leg. Either way, MBDB is just not potent enough to bring the dosage down much.",
  "Nevertheless, 100mg was very pleasant up the snout."
 ],
 "erowid": {
  "id": "12970",
  "citation": " OHM. \"Instant Calm: experience with MBDB (Methyl-J) (ID 12970)\". Erowid.org. Jul 10, 2003. erowid.org/exp/12970",
  "substance": "MBDB (Methyl-J)",
  "views": "11206"
 }
}
