{
 "id": 10292,
 "title": "Alone and in Combination",
 "date": {
  "submission": "2007-03-14T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Sam",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Moclobemide"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Various"
  }
 ],
 "report": [
  "<p>A few experiences with the pharmaceutical MAOI moclobemide (trade names manerix, aurorix):",
  "On its own definitely gives a slight stimulant, energised buzz - I have more energy and motivation. Taken too late in the day it can cause insomnia. Has a fizzy, cerebral feeling at times, quite different from natural plant MAOI's.",
  "With alcohol: a friend and I took 150mg before going out. Energy and morale were generally higher, approaching people I didnt know was definitely easier (bear in mind it's been studied for the treatment of social phobia).",
  "With mushrooms and cannabis: Seemed to have a sobering effect on the weed, less tendency for stupor, more energy. With mushrooms, the trip was noticeably lengthened, with a gradual return to baseline. My friend and I again took 150mg an hour before consuming an unknown but large amount of cubensis mushrooms. Hallucinations were also extremely vivid and colourful. However, the moclobemide seemed to sober one up from the effects of the mushrooms - the dreamy feeling wasnt really present. There was also less tendency for stupor, with more energy to move around. I felt more inebriated than blissful, the mushrooms had lost a great deal of their organic, mystical and wholesome aura.",
  "Next day I felt tired and my head was clouded. Ive never had any form of hangover following mushrooms. I dont recommend this combination - moclobemide might be more suitable with DMT. Personally I plan to stick with Banisteriopsis caapi as my MAOI inhibitor of choice.</p>"
 ],
 "erowid": {
  "id": "61407",
  "citation": " Sam. \"Alone and in Combination: experience with Moclobemide, Mushrooms, Alcohol & Cannabis (ID 61407)\". Erowid.org. Mar 14, 2007. erowid.org/exp/61407",
  "substance": "Moclobemide, Mushrooms, Alcohol & Cannabis",
  "views": "5936"
 }
}
