{
 "title": "A Psychedelic Digression on Life",
 "author": "The Passenger",
 "citation": " The Passenger. \"A Psychedelic Digression on Life: experience with Morning Glory Seeds (Heavenly Blue) (ID 10300)\". Erowid.org. Feb 18, 2002. erowid.org/exp/10300",
 "substance": "Morning Glory Seeds (Heavenly Blue)",
 "bodyweight": "150 lb",
 "report": "<p>T - O hrs</p><p>My friend and I each eat about 2g of Heavenly Blue Morning Glory seeds to begin a day of mind expansion.  As we ate the seeds, we sipped mugs of chai tea that my friend's sister had prepared for us earlier, a nice compliment to the unique taste of the seeds.  Within a half hour, noticeable nausea had developed, although it was far from unbearable and easily defeated by one Meclizine anti-emetic each.  While waiting, we flipped through a rock climbing magazine, laughing with giddiness at the simplest of jokes and images.</p><p>After about an hour, neither of us felt like eating more seeds and we went to the porch outside.  The day was perfect for conversation, fall colors painting the maples and a light breeze in the air.  For about an hour and a half, we sat and discussed philosophy, primarily focusing on topics such as how to live a moral life and other topics from our high school philosophy course.  This was one of the most satisfying discussions of our lives, we were able to express concepts easily and accept change easily, free from all oppressing pride and dogma. </p><p>T - 3 hrs</p><p>After this discussion, we decided to get back into it.  We began by preempting our nausea with another Mezcline.  Grabbing our cups of seeds, we sat on the porch with orange juice and ate and talked and thought.  I found that the best method was to take a pinch of seeds, chew them all at once, and flush the mouth clean with orange juice.  My friend ate about 3.5 g and I had a comparable amount, to be followed with one gram over the next hour or so.</p><p>After another half-hour on the porch, we headed inside.  The nausea quickly proved to be too much for my friend, who vomited yet felt much better afterwards.  He proceeded to have a very positive trip, focusing on the point that he controlled the world around him and listening attentively to music.  Meanwhile, we called a friend of ours and he hung out with us until he had to go to a party.  His presence was very energizing and climactic, as we both begun to trip very legitimately. </p><p>After he left, I called a girl friend of mine, who came over with her friend a little later.  It was excellent to see them, although I believe they were somewhat bored with our silence and long pauses.  Their presence was somewhat sobering, as I had to speed myself up to try to make conversation.  When I allowed myself to slide back into the intensity of the trip, the world looked as an oil painting, a fluid medium for a bizarre world.  The trip began to fade when I began kissing the girl friend of mine, which was oddly pursued in an almost platonic manner, although with intense focus.</p><p>All in all, the trip was very positive and I highly recommend the 2-3 g dosage for people wishing to experiment with the threshold effects.  Typical OTC anti-emetics will easily take care of the nausea factor.  As with my previous experiences with this drug, I have found more things to apply to my day to day life.  During this trip, I realized that I need to relax more in life, have more respect for the people around me, and experiment more with art and music.  I have so far integrated these to great success and I plan to continue to do so.</p>",
 "year": "2001",
 "id": "10300",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-18T08:00:00.000Z",
 "views": "12361",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "1": {
   "time": " T+ 0:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Meclizine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 3:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Meclizine",
   "form": "(pill / tablet)"
  },
  "3": {
   "time": " T+ 3:00",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  },
  "4": {
   "time": " T+ 4:00",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(seeds)"
  }
 }
}
