{
 "id": 10301,
 "title": "Nineteen Hour Days Not a Problem",
 "date": {
  "submission": "2007-05-09T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lord Mayor West",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "substance": "Modafinil",
   "form": "pill/tablet"
  },
  {
   "time": "8:00",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "substance": "Modafinil",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "[Introduction]",
  "I took this drug for school. I have a terrible problem with excessive sleepiness, would possibly be classified mild narcolepsy, but have absolutely no desire to take amphetamines. Modafinil doesn't have the addictiveness of amphetamines, and acts pretty much transparently. No side effects noted, except for an oddly scented urine (not bad, better actually than usual).",
  "[Dosage and Timing]",
  "Taking two doses of 100mg (0500h and 1300h) I can wake daily at 0500h and go to sleep at midnight or 0100h, while doing mentally intensive tasks like poetry writing and calculus.",
  "[Experiences]",
  "I do not do and have not done any 'illegal' substances, meth, pot, anything like that. There is nothing I would assume to be a high, not even euphoria, but that's not why I want it, is it? Upon taking the first pill I noticed nothing. As the hours progressed, I found myself doing things I usually hate, dishes, laundry, cleaning my room, and completing homework with absolutely no feeling of sleepiness. At times, I sat and waited for the usual feeling of dozing off, but it just wouldn't come. I then completed all my tasks and fell asleep at about 0100h. I woke to my alarm, after unusually vivid dreams at 0500h, and went to an early morning meeting. The 'morning' feeling was gone. I wasn't lethargic, or falling over myself trying to shower or dress, and was basically ready to go. At times, I felt as if I were shivering, but I was not actually moving. Somewhat resembled an orgasm, in ways, not euphoric, but quite pleasant.",
  "[Conclusion]",
  "I recommend highly to anyone that feels that there are not enough hours in the day. This has, in itself, improved the quality of my life.",
  "-LMW"
 ],
 "erowid": {
  "id": "61457",
  "citation": " Lord Mayor West. \"Nineteen Hour Days Not a Problem: experience with Modafinil (ID 61457)\". Erowid.org. May 9, 2007. erowid.org/exp/61457",
  "substance": "Modafinil",
  "views": "21644"
 }
}
