{
 "id": 10307,
 "title": "Ibogainish?",
 "date": {
  "submission": "2009-12-15T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "As",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 seeds",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "(seeds)"
  }
 ],
 "report": [
  "Well, I read about Voacanga africana containing similar chemicals as ibogaine, and thought it would be fun to get fucked up on it. I purchased both the seeds and the rootbark.",
  "This stuff is seriously weird. It contains several chemicals with dissimilar effects. Several hours after the seeds have been chewed (not swallowed whole) I felt a strong sense of lethargy and sleepyness. I came up with this dose after some not terribly cautious experimentation. I would actually suggest setting an alarm for an hour later, as a different chemical/chemicals take effect. This is where things become interesting.",
  "Music began to sound very good. The electronica, of which I'd lately become bored, became interesting and fresh again. In between the songs, I discovered that I could make out what my neighbors were saying. The supplier claimed that some indiginous people somewhere used it for hunting. I believe this to not be because of it's stimulant properties, but rather because hearing becomes much much more acute. I was also struck by the realization that my neighbor's conversations were incredibly inane. Think - apartment chemical druggy warfare!",
  "These seeds also had a very strange effect on my spacial perception. It appeared to make things more 3d, in an impossible to explain way. I normally have a disorder which interfears with spacial perception (Gertsman's Developmental Syndrome or something like that). I noticed for the first time on my favorite 1st person shootemup game, that one of the levels was not quite physically possible. Bizarre.",
  "Along with my increased sense of space, came interesting mathmatical effects. I discovered, while attempting to up the dose, that I was completely unable to count above 30something. After 30something I would inevitably be unable to continue. This provided me with much amusement (Dude! I can't count! AWESOME!).",
  "The head space was fairly similar to other hallucinogens I have done - but somewhat less disorienting than say, equivalently strong doses of acid. Lastly the visuals were not terribly prominent. There was a bright sparkly texture to the air, slight swirlyness of vision, and such. For much more interesting visuals, I take a benzo (like ativan).",
  "Oh yes, this stuff contains ibogaine, and perhaps has antiaddictive properties? I have come to the conclusion that this, and most likely the iboga plant, is a placebo in that regard. At best it may cause mild, temporary remission of withdrawl symptoms (in this case nicotine)."
 ],
 "erowid": {
  "id": "61486",
  "citation": " As. \"Ibogainish?: experience with Voacanga Africana (ID 61486)\". Erowid.org. Dec 15, 2009. erowid.org/exp/61486",
  "substance": "Voacanga Africana",
  "views": "7389"
 }
}
