{
 "id": 10311,
 "title": "6 Hrs of Screaming, Foaming, and Pissing",
 "date": {
  "submission": "2002-02-15T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "DicoStein",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "8 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "<p>This last Saturday night, a few friends and I set out to do a little tripping... One of my friends was house sitting for a family that had a chill little house in the northern suburbs of Chicago.  My friend R and I took two doses of blotter marked with a sunshine symbol at 9pm.  We waited at the house for the other two, A and B, who were at a local bar finishing a pitcher.  When they arrived, at about 10pm, R and I had already started to feel the acid.  A and B both took three doses and we all started drinking beers and smoking bowls.",
  "This acid was very good; the doses were not very strong, but very smooth and clean.  We spent the first few hours of our trip listening to music, drinking beer, and smoking cigarettes and weed.  The mood was light, we were all laughing and having a good time.  I felt GREAT... I have tripped about 20 times in the past, taking 1-6 doses each time and this night seemed like it had the potential to be one of my best trips yet.  At about 12:30, 3 hours into my trip, we smoked a bowl of marijuana with a big pinch of Salvia extract on top.  We didn't intend to experience the breakthrough salvia trip, just add a little buzz to all the buzzing already in our heads.  The Salvia had seemingly no affect on the group and we continued our drinking and smoking. ",
  "At about 1am, the whole group was on the roof of the house smoking cigarettes and bowls.  We were all talking quietly about the nice weather and how beautiful everything was, but R kept raising his voice.  We asked him to be quiet because he would surely awaken the surrounding neighbors; R responded, louder than ever, that he understood.  However, R just got louder... He started talking about how he wanted a pillow and a blanket so he could sleep on the roof.  Soon it was evident that R didn't understand us and after a few minutes of trying to communicate with him, we ended up forcefully taking him off the roof so that he wouldn't hurt himself.  We walked him into the house and sat him on the couch.",
  "Inside the house, R continued to get weirder and weirder... All he would do in response to anything that we said to him was yell 'exactly.'  He went on for almost an hour, yelling 'exactly' and talking about 'the sounds, me and E (that's me) can control it.'  We realized that R was now so loud that even from inside the house, his yelling was audible throughout the neighborhood.  We decided that he needed to go into the basement.  We had tried to talk him down for about an hour now and he was just getting worse.  We couldn't get him to move, so we all sort of grabbed him and started to lazily push him to the basement.  He fought us with everything he had (thank goodness he's a skinny fucker) but we weren't on guard for what he was about to do.  He freed himself from our grip (which probably wasn't too hard considering we were all a little hesitant about having to physically restrain our friend) then he sprinted to the door.  Before we could stop him, he was outside.  A and I followed him towards the back yard but we stopped dead in the garage when we heard a woman's voice asking 'is he ok.'  We saw two female figures in approaching the garage while we listened to R screaming about how he was going to die in the backyard.  As the two women approached, it became evident that they were about 21, our age.  They asked if he was tripping, and offered to help talk him down. ",
  "The two girls (whose names I don't even remember, we'll call them Y and Z), A and I ventured into the backyard to retrieve R.  At this point, he was completely naked, running around screaming that he was going to die.  We fought him back into the house and this girl started trying to talk him down.  He was still screaming that he was going to die so we decided it was time to try and take him to the basement again.  We got him down there, and he was sitting between one of the girls and me.  I had him locked in a half-nelson, my arm locked up in his shoulders, so that he wouldn't get away, but as soon as he started to relax, I loosened my grip.  As I loosened my grip, R tried to get off the couch and run.  I punched him as hard as I could in the middle of the face; he barely flinched.  This was the first time I had ever punched anyone in the face... but I can honestly say that I was hoping I'd knock him out with that punch.  In retrospect, this all seems so messed up, getting violent with a good friend but it reveals the desperate nature of the situation.  A, B, and I were all really high and drunk and after three hours of dealing with this crazy kid, we were reaching our limits.",
  "We didn't know what to do... dropping R off at his house would have been ruthless - his parents surely wouldn't have understood... bringing him to the hospital seemed unnecessary because he seemed physically normal aside from an elevated pulse... but we all figured we'd end up in jail if he kept yelling.  We decided to just wait it out; at this point he had been tripping for six hours so it couldn't last too much longer.  The next three hours were bizarre.  We all watched R, lying naked on this girl who was trying to talk him down.  He did some super weird stuff like trying to hump the girl.  He foamed at the mouth for three hours, urinated all over himself, and kept repeating bizarre phrases while playing with his genitals the whole time.  He didn't look human at all... therehe wasn't R behind histhose eyes, just a blank confused stare. ",
  "As the sun began to rise, R had become very quiet.  Perhaps he had just exhausted himself, but the important thisthing was that he had stopped yelling.  He continued to mumble weird stuff and couldn't communicate with any of us.  Eventually, a sober driver showed up to take R to our friends apartment.  We argued for a while about who would do the honors and put on his underwear so we could drive him around, then we carried him upstairs while he fought us.  We stood him up at the front door of the house and attempted to dress him, but he fought his clothes off.  He was standing, but he wouldn't move so we pushed him across the driveway and into the car.  We drove about 10 mins to our friends apartment, pushed him into the apartment, and got him into a bed.  We sat back and smoked a bowl, relieved at having finally ending the night.  Just five minutes after going to bed, R emerged from the bedroom completely normal.  He didn't remember anything about the night... he vaguely remembered us pushing him into the car and he remembered the girl's face on a turtles body, but he thought he was asleep the whole time.  He smoked a bowl with us; we went out for a big greasy breakfast and passed out. ",
  "This was one of the most bizarre nights of my life; yet, I think that lots of good will come from it.  I have discovered that most of what I learned about drugs from school and the media was full of misconceptions and bias.  This discovery has perhaps made me skeptical of any negative effects of drugs.  Before this experience, I thought that only people that were really weird to begin with tweaked out on acid.  I figured that if I had a bad trip myself or was involved with a friend that was having a bad trip, I could deal with it easily.  Seeing my friend turn from a normal kid into what resembled a maniac mental patient gave me a lot of respect for the power of LSD.  First of all, I decided that while drinking on acid had become common it is a big mistake because lowered inhibitions don't mix well with ego loss and hallucination.  Second, I now believe in babysitters - a concept that I used to find absurd for relatively low dose trips.  Third of all, for all of you who like myself, think that they can control the mind-bending of acid, think of your friends because you never know if they can.  Monitor the people you're tripping with and look for signs that they might be loosing it, maybe you can stop it before it turns into the fiasco that I dealt with.  Believe me, you don't want to be put in a situation where you feel that you have to try and punch out your helpless friend.",
  "A little side note... I have seen people having bad trips before and they looked nothing like my friend.  R seemed inhuman, repeating weird stuff and fighting us; I really wasn't prepared for this - when I hear him say 'exactly', scenes from the night pop into my head.  I have a little theory about R... I think he may have had a six-hour seizure (I dunno if this is even possible.)  The last thing he remembers was mentally playing with the sounds of the music in his head, making them start and stop.  I suppose this could have triggered some sort of brain wave disruption and a seizure - oh yeah, he was having convulsions for a while too...  My theory is that going to bed for a couple of minutes in a dark room removed all stimuli and his seizure ended.  Anyways, Im not a doctor, just some ideas but Id appreciate input from anybody else that has dealt with a similar situation.",
  "All of you, enjoy your drugs, respect your drugs, respect yourself, and always make sure you're equipped to deal with the worst possible situation.</p>"
 ],
 "erowid": {
  "id": "6150",
  "citation": " DicoStein. \"6 Hrs of Screaming, Foaming, and Pissing: experience with LSD, Alcohol, Cannabis & Salvia divinorum (5x extract) (ID 6150)\". Erowid.org. Feb 15, 2002. erowid.org/exp/6150",
  "substance": "LSD, Alcohol, Cannabis & Salvia divinorum (5x extract)",
  "views": "37006"
 }
}
