{
 "id": 10329,
 "title": "Injecting Ecstasy",
 "date": {
  "submission": "2009-09-04T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Luna_invicta",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IV",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "[[Erowid Note: IV injection of crushed pills/tablets can be very dangerous due to unknown binders and fillers present in the tablets.]",
  "There isn't a lot of information available on the injection of ecstasy. I tried it twice. I'd like to share my method of preparation as well as reasons it's not worth it. This will be a concise and hopefully somewhat informative report.",
  "Background:",
  "Ive had a fair amount of IV experience with various opiates, methamphetamine, and cocaine. Exploring methods of administrating intoxicants has been a rewarding mental exercise for me.",
  "Preparation:",
  "Junkie style in a spoon after a thorough crushing. No heat applied. I ran them through several 18 gauge filter needles. The result was a cloudy mixture of sterile water and what I only assume is MDMA (and most likely leftover pill matter). I snorted a few of the pills several days prior to the experience and that is my subjective analysis. Note this isn't a chemical analysis, and I put myself at appreciable personal risk trying it.",
  "Intoxication:",
  "30-45 minutes in duration. Ive had some mind-blowing experiences on ecstasy, but not this time. While it was generally comfortable and pleasant, re-dosing every hour or so was a real pain in the ass. By the end of the night I looked like a pincushion. It was generally mellow and for some reason not as psychedelic as my previous encounters with X. Dosage ran the gamut from a very small test shot to  of a pill near the end of my experience.  In total I have injected 5 tablets worth of ecstasy.",
  "Retrospective:",
  "It wasnt worth the damage to my veins. I had a little more trouble getting to sleep than with previous ecstasy experiences. Intranasal and oral administration have given me better experiences in the past. Duration of peak was not noticeably increased with dose. Unnecessarily dangerous. After trying it twice, I have no desire to inject ecstasy again. Additionally, my desire to use the drug again has waned since then.",
  "g it."
 ],
 "erowid": {
  "id": "61583",
  "citation": " Luna_invicta. \"Injecting Ecstasy: experience with MDMA (Ecstasy) (ID 61583)\". Erowid.org. Sep 4, 2009. erowid.org/exp/61583",
  "substance": "MDMA (Ecstasy)",
  "views": "14457"
 }
}
