{
 "id": 10324,
 "title": "Unsuccessful Cold Water Extraction",
 "date": {
  "submission": "2009-09-14T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "DarkManX",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 g",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>I'll start off with my background.",
  "I'm a 21 year old male.  I didn't start drinking until I came to college three years ago, and first tried marijuana this past summer and have only smoked on a few occasions.  My only other experiences with drugs have been with LSD twice.  The first time I only took one tab and experienced a pretty mild trip.  The second time I took 3 gel tabs and due to the wrong mindset, I had a pretty bad trip.",
  "Even though I had a bad experience on acid that second time, I am still looking forward to trying it again in the future.  Because acid is really only available in the summer months here I had decided to look to other hallucinogens.  After reading up on the use of Morning Glory seeds and finding out that they are pretty readily available I decided to try them.  I purchased three 9g packets of Clark's Heavenly Blue Morning Glory seeds from Livingston Seed for $1.79 each.",
  "Since I didn't have a coffee grinder available I opted to instead spend two hours cutting up the seeds of one of the 9g packs one by one and then placed them in about 350ml of water to soak over night.  Here is the timeframe:",
  "Mach 17:",
  "-3:24pm - Begin cutting up seeds with scissors and placing them in a bottle with 350ml of water",
  "-5:48pm - All the seeds are cut up and the bottle is placed into the refrigerator.  From this point on, the solution is agitated every few hours",
  "March 18:",
  "-10:45am - Begin filtering solution through coffee filters.  One note, however, I feel that too much of the liquid was lost through being absorbed by the filters.",
  "-10:55am - Solution mostly filtered and replaced into refrigerator.",
  "March 19:",
  "-7:00am - Begin drinking solution",
  "-7:26am - Finish consuming solution",
  "-8:24am - Notice no significant effects other than feeling slightly weighed down.  No nausea is felt at this or any other point prior.  Try walking around outside to see if I notice anything.",
  "-9:46am - I can tell there is a higher appreciation for music, but don't feel impaired in any other way.  No OEVs or CEVs, no auditory distortions, and the weighed down feeling has changed to a general feeling of relaxation.  At this point I doubt that I'm going to trip at all.",
  "As of right now it is 12:30pm and I feel normal again.  Not really sure what went wrong during the cold water extraction.  One thing that I did notice, however, was that the solution wasn't the color most others have reported, it was more of a dark green/brown color.  Some potential things I think might have gone wrong could be that the bottle wasn't all the way clean prior to the extraction process or that it was exposed to too much light as it was a clear bottle.  I also may have simply used too small of a dose or perhaps too low quality seeds (they were only $1.79 for 9g as opposed to the same price for 1.5g for other Morning Glory seeds at the store)",
  "I am a little disappointed, but not unwilling to try it again soon.  I'm thinking at that point I'll just forgo the cold water extraction, however.</p>"
 ],
 "erowid": {
  "id": "61563",
  "citation": " DarkManX. \"Unsuccessful Cold Water Extraction: experience with Morning Glory (ID 61563)\". Erowid.org. Sep 14, 2009. erowid.org/exp/61563",
  "substance": "Morning Glory",
  "views": "5186"
 }
}
