{
 "id": 10326,
 "title": "Saying Goodbye to an Old Aquaintance",
 "date": {
  "submission": "2009-10-19T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Luigi",
  "gender": "Male",
  "weight": 47
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "Yesterday we made the decision to have our cat put to sleep. The vet found out that he had a tumor in his liver. He was put down yesterday and we burried him in the backyard.",
  "I wanted to do something because he had been my cat for 12 years. I decided I would wait until my family was asleep and take a chair out to his grave and smoke the last of my Salvia. There was roughly 1/5th of the 1gram vial of 20x standardised extract left. When my family went to be I took a chair out to my garden where my cat was burried and readied my bong and Salvia.",
  "I took a deep breath and then exhaled as much air from my lungs as possible and quickly put my mouth over the bong and set the flame to the salvia. I inhaled as much as I could and held it in. As usual there was no immediate effect but the effects slowly creeped in over about 15 seconds. I managed to hold it in for around 20 seconds then exhaled and took another breath of air, exhaled and put my mouth back over the bong and relight the lighter. As I inhaled the second hit I could feel the familiar feeling of reality slipping away. I was sucked into the back of the deck chair as the darkness around me froze and seemed to break. When the suction stopped the deck chair folded and folded me along with it, I had the feeling of being constantly folded and that soon I would be a mere dot.",
  "As a dot I began to travel without moving. I was going to a place that I can only describe as underground. I felt dirty as if I were in the soil but I couldn't see soil, I just had a filthy feeling. Slowy accelerating from the corner of my vision was a new place infront of me and I was soon encompased by it. I heard a flowing sound and I came to the conclusion that I was inside an eye because the world of different shades of yellow had begun to fracture with dark reds which pulsed in rhytym with the flowing sound.I assumed these were some sort of blood vessels.",
  "It was then that everything seemed to intensify and I felt a great sense of foreboding and intrusion but this feeling slowly melted into warmth, like recieving a loving hug of acceptance which I had experienced before when taking the same salvia. The warmth of the hug branched out from me and formed what looked like a string of distorted eyes of different shades of yellow. I knew in my mind that these were the same as the eye that I was inside. They orbitted me at a constant speed.",
  "I observed the percise and unchanging order of what was happening and realised that outside of the eye I was inside were a string of other eyes of the same size, orbitting around a larger eye and that this was infinite. I think I was being shown how everything is infinite or at least enegry is infinite and that my dead cat would be reabsorbed into the earth and become many other forms of life.",
  "The warmth slowly fizzled until it was no longer warm but cold. Darkness returned except for one rectangular light in the top right of my vision. I turned my attention to this light and watched it for a few minutes before feeling a wetness on my torso. I was once again aware of my body and of my surroundings and I realised that the rectangular light was just the light coming from my neighbours window. The wetness was the bong I had spilled over myself.",
  "This trip taught me that each form of life is equally as amazing as the next, a bacteria is just as amazing as a more complex organisim such as a human being. It was as if I was getting a lesson from my cat who throughout it's whole life could only comunicate in a different language but the language of pshychedelics is sometimes without words and can be understood globally.",
  "In light of this, I went in the house began soaking some Heavenly Blues and I planted 23 of them today below the fence right next to his grave. That way there may be more insights to be had and my cat's body will directly nourish the plants. It might seem corny or stupid because it's just a cat but it was still a lifeform, with a personality and was my friend.",
  "Thank you for taking the time to reading this."
 ],
 "erowid": {
  "id": "61567",
  "citation": " Luigi. \"Saying Goodbye to an Old Aquaintance: experience with Salvia Divinorum (20x extract) (ID 61567)\". Erowid.org. Oct 19, 2009. erowid.org/exp/61567",
  "substance": "Salvia Divinorum (20x extract)",
  "views": "2009"
 }
}
