{
 "id": 10327,
 "title": "Close To Losing It",
 "date": {
  "submission": "2002-02-15T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sarsen",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowls",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "First time",
  "Salvia divinorum 5x extract",
  "Smoked w/ water pipe",
  "Have been waiting to try salvia a while, so I was totally excited on the night, and in a very good frame of mind. With my bestest of friends in his car.",
  "As I pull the first cone and hold it, I start getting a tingling sensation across my skin that makes it feel as though my skin is getting tighter. As I turn to my friend who is packing for me, I notice that when I close my eyes, the image of what I was looking at still slightly remains, but appears to be a ghostish outline of what it was, and certain brighter edges are highlighted by an effect similar to the photoshop plug-in, bubble wrap.",
  "As I pass the bong back, it feels as tho my skin is constricting, and that there is a tightness in my existence (the word existence is pretty much from this point on going to describe my conscience reality, ie, as far as I can think)",
  "As I'm taking the next cone, I close my eyes and start seeing the previous image, but more two dimensional and with far enhanced colours. The smoke hits me quite strongly, and as I'm not a smoker, I get a gag reflex that I try to withhold. I cant and as I'm coughing out the smoke I get the feeling of releasing something that I'm trying to withhold, but in a visual sense. I cannot remember exactly what it is now. The colours seem to be wiggling, and separating.. As they do, it starts to appear to me as tho all the surfaces of the things I'm looking at are coloured in a layer of little sticks that look like dog bones.. As the layer gets quickly deeper, I notice that rather than sticks or dog bones. There is a layer of little people attached to the surface with their feet, and swaying around with their feet attached to the surface... As I look around, all the surfaces are doing this, and the depth of the layer is getting deeper.. The colours of each surface are made up by the predominant colour of the people. Suddenly, I realise that another cone will take me away, so I hesitantly turn to my friend (who I don't remember being made up of these little people) and ask for another cone.",
  "As I hold the third cone, I close my eyes and suddenly get the urge to cough (damn my feeble lungs). As I'm coughing, I imagine (cant remember whether eyes closed or not) my body as a two dimensional section with the smoke escaping. (as I remember this more, I think I may have had my eyes slightly open, and seen the smoke I was exhaling) it, and everything else is moving as tho rats in a maze. Its that type of wiggling motion that the world starts taking on. Its suddenly beyond little people on surfaces, but the entire matter of everything, especially closed eyes is made up of little coloured people moving and changing their positions. Some are in 'l' shape positions, others are standing or sitting, and other are moving their hands to make other shapes.",
  "I start getting really freaked by this, as the whole world takes on this great seething quality that I find quite disconcerting. I get out of the car and stagger over to a patch of grass. I lay down, and everything is still taking on this seething quality. The pattern of it almost looks like the markings on non-slip steel stairs, and is kind of coloured segments separated by a black outline. As I close my eyes, I see to little people in close up, and see them just in my field of vision moving and changing positions randomly. At this stage I'm getting quite worried that the whole world is going to remain like this and that I'm going to have to live the rest of my life in this seething world. (I now realise that as reported by other salvia trip reports, I had completely forgotten about actually smoking the drug, and had little recollection as to why all this was happening).",
  "I get up when I realise that going back to the car may help me regain a bit more control through familiarity. I stagger back, but being near the car feels just a bit too much for the moment, so I mumble something and walk about 40 metres over to a mossy patch of grass my friend and I were at earlier. I lay down again, and as I do the various colours of the grass seems to be seething still, but it seems to be getting smaller, and more like a pattern then absolute definable 'little people'. I suddenly feel urged to snuggle into my jack in an effort to get warm, but also just to snuggle down into something. I lay there. Looking up at the silhouettes of the trees wondering what would happen if this continued forever, and if I could continue my life as per normal if the seething didn't stop. I'm comforted by the fading of the effect, and a strange sound like fireworks gains my attention.",
  "It sounds as tho its coming from off to my left, so I get up (this is about the first time where I actually want to leave the ground. Previously, although the ground was seething, it still felt like it was the best place to be) and start walking over to the sound. As I'm doing this, I see my friend heading over in the same direction (he had also had another two cones strait after me, and I find it interesting that we were both drawn to the same sound).",
  "My head is starting to clear, and the sensation is no longer more than the closed eye 'herringbone' pattern. Closed eyes visuals after this simply are swirls of light and dark, but no other profound or recognisable content).",
  "My friend and I talk about how intense our experiences, and I start recollecting exactly what happened with perfect clarity.",
  "Later, I begin to have the notion that the seething period, where everything was like a rat in a maze (it was just not a visual, it was as though everything, matter it very self was made up of these wiggling sensations), was simply a transition stage to the so called, 'other world'. As time passed, what initially was like the sensation of escaping rats didn't fade so much as just get smaller, from rats, back to little people, and then to the herringbone pattern of everything. This leads me to believe that another hit would have let the seething actually become as big as myself, and would have allowed me into this 'world' between the gaps.",
  "My post trip mindset was very introspective, and although not startling, I felt that I was better able to grasp the issues in my life and see them for what they truly are. I was doing a bit of pre-sleep channel surfing, and found myself empathising with the characters in the movies. Wondering what their reasons for their actions were, and how they had come to the decisions to do what they were doing. Overall, I felt a surprising clarity to my emotions, as was able to dissect what I was thinking into its separate constituents, and determine how they interrelated to form each aspect of my life.",
  "I had been expecting some semi-lucid dreaming as reporting in other salvia experiences, but I only felt a slight insomnia when trying to get to sleep, and little if any dreaming (that I can remember). Although, I did wake up around 4.00am to go to the toilet, and as I stood up, I had a very clear closed-eye infinity tunnel visual, which broke into smiling mouths that formed one larger smiling mouth. No real emotional connection to it, just looked kinda cool.. :)",
  "Hope that this may be of interest to anyone wanting to try salvia. I've been reading a fair few reports of late saying that 'salvia is just bs' and that its a waste of money because it doesn't work. I can only emphasize its potenty. My next experiment with it will be at home, alone, with some gentle music playing and the ability to just take it a bit slower and give the experience time to develop itself."
 ],
 "erowid": {
  "id": "6157",
  "citation": " sarsen. \"Close To Losing It: experience with Salvia divinorum (5x extract) (ID 6157)\". Erowid.org. Feb 15, 2002. erowid.org/exp/6157",
  "substance": "Salvia divinorum (5x extract)",
  "views": "7245"
 }
}
