{
 "id": 10328,
 "title": "Interesting Trip",
 "date": {
  "submission": "2008-11-06T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Royal Nonesuch",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": "T+ 0:00",
   "administration": "15 mg",
   "substance": "oral"
  },
  {
   "time": "Amphetamines",
   "amount": "(ground / crushed)",
   "administration": "T+ 4:00",
   "substance": "25 mg"
  },
  {
   "time": "oral",
   "amount": "Pharms - Quetiapine",
   "administration": "(ground / crushed)",
   "substance": "T+ 4:00"
  },
  {
   "time": "15 mg",
   "amount": "oral",
   "administration": "Amphetamines",
   "substance": "(ground / crushed)"
  }
 ],
 "report": [
  "Last friday night at around 11PM I opened up a 30mg Adderall XR tablet and poured out roughly 15mg of the little beads. I then proceeded to crush them up wrap the powder in a small amount of toilet paper and 'parachute' it. (Note: I had smoked a good amount of weed earlier that night and was still fairly high.) Within 15 minutes I was feeling very energized and euphoric. I had trouble keeping still and my thoughts were rushing. Very similar to my one previous experience with Adderall only this time the onset was much quicker due to the parachuting (The previous time I ingested a 20mg tab whole).",
  "After about 30-45 minutes I noticed my guitar laying on the floor in my room, and I immeadiatly picked it up and began to play. I have it set up so that I can play my electric guitar though headphones and not disturb anyone else in my house, which is quite nice. After a bit a grabbed my iPod and stuck my earbud headphones in under the large studio monitor headphones I was playing though I played along with many many songs. Songs i had thought I had forgot how to play and I was playing very very well. This went on for quite a long time. And before I knew it, it was 3AM!! Over 4 whole hours had passed while I was playing. Wow! This drug does a marvelous job helping me concentrate. Then I made the decision I am going to take some before I take the ACT, SAT and AP (college credit classes while in high school) tests. Probably a smaller doseage though.",
  "I made my way down stairs to get a drink and decieded to take  another look at the medicine cabinet. I came across a bottle of pills called 'Seroquel' and vaugely recalled hearing of them being taken recreationally before. I would later find out that Lil' Wyte mentions them in his song 'OxyCotton'. I figured I might as well go online and do a bit of research. Most of the trip reports were negative because people complained that all it did was make them go to sleep and then feel like crap the entire next day. I got the bright idea to mix it with the rest of the Adderall tab. I've heard mixing uppers with downers is bad, but I've tried Diphenhydramine with caffeine and had a mild trip with out any ill effects.",
  "I go back up to my room, now with one 25mg Seroquel. I crush that up with the rest of the Adderall and parachuted it. I felt the initial kick from the Adderall but it wasn't as strong and I felt really groggy. I went to the bathroom, came back and started to play guitar again but my motorskills were greatly deteriorated. So  I decided to stop. I layed down on my bed and started to read a book and listen to some music. My vision got really blurry around the edges and I could only focus in the middle. At times I was seeing double. It goes with out saying, but reading didn't go to well. I layed there on my bed listening to my iPod staring at the lines on my ceiling, I felt as if I couldn't move. I was part of my bed. Then, the lines on my ceiling came alive and started to morph. They didn't become any specific things or act as a 'visulizer' for my music. But this blew my mind. I somehow got the energy and forced myself to get up. I wanted to see what other hallucinations I could see.",
  "This is where the night gets foggy. I wondered around my house probably like a zombie for a quite a while. The only time I remember seeing is 6am. I don't remember where I fell asleep but I woke up in my room on floor at around 11AM to my dad yelling at me to get up get dressed and go out to lunch. Damn. I felt tired and kept having little episodes where I'd space out all day. Nothing too bad just mild.",
  "Overall it was a good experience and I'd like to try it again with a larger dose of each drug."
 ],
 "erowid": {
  "id": "61570",
  "citation": " Royal Nonesuch. \"Interesting Trip: experience with Seroquel and Adderall (Amphetamine) (ID 61570)\". Erowid.org. Nov 6, 2008. erowid.org/exp/61570",
  "substance": "Seroquel and Adderall (Amphetamine)",
  "views": "10847"
 }
}
