{
 "id": 10335,
 "title": "Pleasant & Subtle Altered Perceptions",
 "date": {
  "submission": "2009-11-04T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CautiousExperimenter",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "tar/resin"
  }
 ],
 "report": [
  "One cold evening, I came back to my dorm after drinking 4-5 beers. I was tipsy and definitely feeling the alcohol (I'm a lightweight). I decided to smoke some of the 10x Wormwood Resin I had recently bought 3 grams of online. I put 1.5 grams into a bowl and smoked it.",
  "I took the following notes on the experience the day after:",
  "The dollhouse effect existed slightly, every object in the room seemed like it was in its 'right place'. Everything was good with the world, and I felt a very mild euphoria.  But it didn't hit me, there was no rush. The feeling was extremely subtle in its build-up.",
  "I felt extremely at peace with what was going on around me. My friends were coming into my room having partied all night, and I was glad to see and interact with them. I felt much less inhibited than normal, I'm an introvert and often listen more than I talk. However, my desire to interact and talk with others increased. In fact, I had a lot of fun talking to one kid who I find extremely annoying when I'm sober.",
  "I was definitely energized. It was going on 1:00 AM and the sedating effects of the 4-5 beers I had drunk were in full force, but after smoking wormwood, I felt highly energized. I was motivated to get out of bed (where I had smoked) and do things. I felt focused and motivated to be productive. Simultaneously, I felt relaxed, and content with my current situation. It was a pleasant mixture of calmness and a readiness to get things done.",
  "Interestingly, after about 4 minutes, it seemed that the wormwood had almost completely wiped away alcohol buzz (from ~4.5 beers). I became more in control  it was like smoking the wormwood sobered me up from being tipsy. When I say 'sobered me up,' I mean that the uncoordination from drinking alcohol went away.",
  "I became more introspective, and more thoughtful about everyday things. I had a discussion with a friend of mine who can talk for hours without realizing you don't care what he's saying, but I didnt get bored. I just wanted to know how he felt and wanted to let him know how I was feeling.",
  "There were no bloodshot eyes, no headache, and no dry mouth. The smell lingered for a while afterward, the next morning when I woke up, the smoked wormwood odor was apparent and unpleasant.",
  "When lighting the substance (which was powdered), it was hard to get it smoking.",
  "Over the course of the night, I dropped a shot glass out of my third story window (it had nothing to do with being uncoordinated form the wormwood, I didn't lose any motor control from it). Under normal circumstances, I never wouldve gone down the elevator, passed the guy who checks you in at the front desk, gone outside into the snow, and retreived it. But I felt motivated to do so, and did. Normally I'd be too lazy, but it felt like it would be easy to do - and was the right thing to do. So I brought it back.",
  "I experienced no visual hallucinations. However, everything seemed slightly surreal  I was in complete control of my body and mind, and I could see perfectly clearly, but it was as if there were a layer between the world and me. I experienced settings I was very familiar with (like my dorm room) in a slightly new way.",
  "It seemed like consequences didnt really matter that much, since everything was ok  i.e., I could go to my resident advisor and tell him I just smoked in my room, even though he could report me for that. I didn't do that and wasn't planning on it, it just seemed like the world was at peace and minor infractions weren't important.",
  "I fell asleep easily when I went to bed about 2 hours after smoking. Overall, it was not a body high at all  it was very much a cerebral high. I was clearheaded, but my perceptions of things were altered.",
  "I became more inquisitive and felt like talking (this is slightly unusual for me). And physical activity was a lot more fun than normal  my roommate and a friend were wrestling around in the foyer of our floor, and it was fun to watch and participate in the revelry.",
  "When talking to people, I maintained direct eye contact for more time than would be normal if I were sober. I looked into peoples eyes much more as they spoke (but not in an awkward way). I felt more connected and interested in other peoples' feelings.",
  "I also thought about a bad argument I'd had earlier that day with my girlfriend, and it didnt bother me as much  I simply acknowledged it and thought, 'everythings okay.'",
  "I smoked some more in order to intensify the experience (and hopefully achieve some visuals), but it seemed like I had reached my limit and couldn't get any higher than I was. This was slightly frustrating, as I wanted to be more powerfully affected, but overall the experience was extremely positive. I enjoyed very much the psychoactive effects and want to try it again. It's an intriguing and agreeable experience that I want to feel again. Perhaps I'll try a liquid extract to see how the experience differs from smoking it."
 ],
 "erowid": {
  "id": "61609",
  "citation": " CautiousExperimenter. \"Pleasant & Subtle Altered Perceptions: experience with Wormwood (extract) & Alcohol (ID 61609)\". Erowid.org. Nov 4, 2009. erowid.org/exp/61609",
  "substance": "Wormwood (extract) & Alcohol",
  "views": "18530"
 }
}
