{
 "title": "Glowsticks",
 "author": "Anonymous",
 "citation": " Anonymous. \"Glowsticks: experience with MDMA (Ecstasy) (ID 10347)\". Erowid.org. Dec 13, 2006. erowid.org/exp/10347",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "2 tablets",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Before I rolled for the first time, raves, techno, and exstasy in general disgusted me. How could someone destroy their body like that? blowing up and dancing for 6-8 hours straight can't be good for you. And I thought techno sounded like crap. No words. What could this music possibly do for somebody? And glowsticks. I thought those were just for Halloween, but the way ravers dance with them like they're in a trance or something, definitely a sight to see. The whole rave scene really scared the crap out of me... that is until my roomate got me to roll for the first time. That was just over a year ago. I finally understood the reason for it all. Boy, did I really feel like a fucking hypocrite.</p><p>I'll never forget my first time, at a little club. Techno does something for you when you roll that I just can't describe. I just wanted to hug everybody, and the conversations I had that night seemed far more intelligent and in depth than ever before. I felt pure exstasy. I don't dance. Never had rythem, couldn't bust a move if my life depended on it, but I was dancing (or just moving around) on the dance floor most the night. It felt really fucking good. And then I saw what glowsticks do to you. I was facinated by the speed and movement of the different streams of light. From then on, I wanted to learn how to play with them, to put on shows, to amaze the crowd. My roomate (now my best friend) put two sticks in my hand and told me to have fun. I waved them in front of my face in no particular pattern and started blowing up. I loved these things. I thought I was the shit. One day, I'll get good with these things, I dreamed. The next day all that rythm dissapeared. I couldn't dance, or do anything good with glowsticks. Great, something I could only do rolling.</p><p>I quit rolling for a while, then got back into it. I still loved glowsticks, but was never good with them. Many a saturday night, the glowstick competetion was absolutely awesome. Those people got talent. Every weekend, somebody would do something new, and the crowd would blow up and cheer harder. I knew I would never be that good, and was about to give up glowsticks and mabye rolling all together. Then a couple weeks ago, I just blew up and was sitting on the stage, and it hit me.</p><p>Why am I trying to get good at this? Just waving glowsticks in front of my face blows me up. We are all here to have a good time. Nobody has to impress anybody here. Peace, Love, Unity, Respect. That was what raving was all about. Everybody here wants to feel good and be around other people feeling the same way. Just then, the DJ put on Sandstorm, a really fast beat techno song. Screw this trying to be good shit, I was ready to dance.</p><p>I joined the mass of bodies tearing up the dance floor and started dancing, and doing what felt good to me. The song 'peaked' and I blew up harder than ever, and went all out, becoming oblivious to the world. When I finally stopped, I was one of 3 people left on the floor, and everybody was staring at me. What the hell did I just do? This girl pulls me off the dance floor: 'You were having the time of your life!!! Everybody was watching you, you were absoutely awesome!! Blow me up!!' I did, she hugged me, and before I could step away, another person pulled me aside and did the same thing, and another, and another...</p><p>I learned a lot of shit that night. I've rolled 12 times, and I've been wasting my time trying to get good with glowsticks, just to impress people. I was blowing people up just by being myself. People like you for who you are and being yourself, not trying to be something you're not. Future experiences with ecstacy have been 100 times better because I'm being myself, and doing what makes me feel good. I also blow up harder when I see a person having the time of their life, not watching a person try to impress somebody. I am now more confident and a lot better with glowsticks simply because I stopped trying so hard.</p>",
 "year": "2001",
 "id": "10347",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-12-13T08:00:00.000Z",
 "views": "4696"
}
