{
 "id": 10345,
 "title": "Little Effect but a Nice Day",
 "date": {
  "submission": "2007-03-23T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Elegandia",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:35",
   "amount": "25 mg",
   "administration": "rectal",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:35",
   "amount": "40 mg",
   "administration": "rectal",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I am a middle aged male, deeply happy about my life, in a beautiful setting and quite experienced with various psychedelic medicines.",
  "I have been very excited about trying DPT having obtained some from a reliable supplier.  I have been experimenting with rectal administration of psychedelics lately.  Although the method is somewhat cumbersome to apply, the resulting effects seem to lack the body load I am used to suffering from most research chemicals when taken orally.  My research indicated rectal administration of DPT should probably be active so I set about putting together my first experiment.",
  "12:00  To begin, a 10 mg sample of DPT was insufflated in order to screen for allergic effects and as an added precaution to ensure the material provided the expected sort of reaction.  I have heard of research chemicals being mislabeled lately, and I have decided to test all products this way prior to administering a larger dose.  Little burn was noted and only a very slight light-headedness resulted. The lack of more noticeable effects and the DMT like odour of the DPT suggested that I was safe to proceed.",
  "12:35  I administered approximately 32 mg  of DPT using the rectal method, but unfortunately an undetermined amount was spilled during administration, perhaps 5-10 mg, but I cant be sure.  I decided to wait and see what might happen before re-dosing.",
  "1:30  I sat around my apartment for a while, reading a book and waiting for effects to come up.  After an hour, only very minor effects were noted, such as brightening of colours and a vague physical stimulation. I needed to go to the bathroom, and had been holding out to ensure the dose was fully administered, so I decide to take care of that and then administer a booster dose.",
  "1:35  Having little to no reaction from the previous dose I decide to administer another 40 mg DPT rectally  this time there was no spillage.",
  "2:10  Still not a lot happening, other than brighter colours.  My mind state is clear, and communication with my girlfriend is easy. We decide a walk in the park is on order.  It is a beautifully spring day outside and all of the blossom trees have come out in the past week or so, so my sober girlfriend takes the helm and drives us there.",
  "3:50 - Back home from a beautiful walk through the park. The weather was picture perfect, 70 degrees, with sun and clouds. Little to no wind, so it was very comfortable for taking in the beauty around us. What few effects were noted dissipated during the walk, and I felt entirely sober when we reached the car, so I offered to drive home, feeling comfortable that there were absolutely no effects present.",
  "So, that was it. Sorry to bore you with a day-in-the-life story of Me, but this report should serve to assist someone in some way or another, with dosing at least.  I think my next experiment will be insufflated, or perhaps rectal with an MAOI.  I leave you with this thought:",
  "I am told I live in a free country.  May a time come when my government will allow me the right and freedom to explore my own consciousness, free from the threat of imprisonment and/or destruction of my livelihood.  Do your part, take time to support an organization that fights for our freedom.",
  "Peace and Love."
 ],
 "erowid": {
  "id": "61659",
  "citation": " Elegandia. \"Little Effect but a Nice Day: experience with DPT (ID 61659)\". Erowid.org. Mar 23, 2007. erowid.org/exp/61659",
  "substance": "DPT",
  "views": "8920"
 }
}
