{
 "id": 10344,
 "title": "Music and Sex",
 "date": {
  "submission": "2007-06-23T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Henrik",
  "gender": "Male",
  "weight": 13
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "I'm 34 years old and 10 years ago I was a user of Ecstacy, LSD and cannabis. Not heavy, but enough to have some good times - and some bad. I still dabble very occasionally but recently I was prescribed Tramadol for severe sinus headaches which have always been a problem for me. The Tramadol eased the pain a little but the main feeling I got was 'hey!.. this reminds me of something..' and I then realized there was more potential for recreational use than actual pain relief!",
  "I initially took the suggested 100mg but soon increased it to 150mg for recreational use, beefed up by a couple of shots of whisky. Tramadol comes on so very very slowly and it's not until 2 or even 3 hours have passed that I am fully aware of being under it's spell. I like because it's a mild feeling - no teeth grinding or anything - it just simply promotes a feeling of warm, cozy well-being and makes me want to curl up in front of a fire on a sheepskin rug, close my eyes and listen to music. Which is exactly what I do! It does make me slightly dizzy but quite enjoyably I find. If I take 150mg early evening then, even if I go to bed at 2am, I'll still feel it's effects - and being in bed is a great place to be on this stuff. Sleep is good too. Not that it makes me horny though! And this leads me to my main point.",
  "Tramadol, like some other substances, makes it hard to get erect and stay and erect and very hard to reach orgasm. However - and here's the crunch - If I can manage to get to climax somehow (preferably from sex rather than just a quick hand shandy) then wow! The post-coital feeling is amazing! In this state I really do feel as if Ive had a proper does of opiates, if only for a short time. I lay for half an hour listening to music in the most blissful post-sex state I've ever experienced. It was truly wonderful.. and the best thing is there's no real hangover because all Ive taken is slightly over the recommended dose of a prescribed substance and spiced it up with a perfectly natural (and very hard to reach) orgasm!"
 ],
 "erowid": {
  "id": "61655",
  "citation": " Henrik. \"Music and Sex: experience with Tramadol (ID 61655)\". Erowid.org. Jun 23, 2007. erowid.org/exp/61655",
  "substance": "Tramadol",
  "views": "6632"
 }
}
