{
 "id": 10355,
 "title": "Not Strong Enough For Me",
 "date": {
  "submission": "2007-06-15T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Shaman.618",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "sublingual",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "Wednesday 2007-03-21:0530",
  "___Set_&_Setting___:",
  "Peaceful, content, still wide awake.  In my room - alone - start music @+0010.",
  "___Dose___:",
  "S. Divinorum\t1 pinch '40x' (enough for a single person to hit in a bowl)",
  "\t\tSublingually Administered - 'dipped'",
  "___Chronography___:",
  "0530 (+0000)\tAdminister dose.",
  "+0010\t\tStart Music.",
  "+0015\t\tSwallow.",
  "+0045\t\tFall Asleep.",
  "+1200\t\tWake up, holy crap I needed to sleep.",
  "___Notes___:",
  "0530 - Ah, what a beautiful taste - so familiar from the liquid extract I tried before.  I'm afraid to swallow my saliva, as the Salvinorin-A dissolves in the stomach before getting a chance in the blood stream. Sigh, I really hope this works.  If not, then I'll have to smoke it.  Let's get some nice music going - while reminiscing, I might as well bring out the Infected Mushroom & Shpongle.",
  "0540 - It reminds me of plant food - or fish food - or both.  Whatever, it's just slightly annoyingly bitter.",
  "0545 - Swallow - Fifteen minutes of sitting and swishing should be plenty.",
  "0548 - I swear!  I'm immune to Salvia!  It must have been one of the endless shots given in the military that did it.  Ha!  Just kidding.  Really though, wtf mate?",
  "I love my Infected Mushroom though.  I'm just in the mood for it.",
  "0552 - Just keep listening to music.  I don't expect anything at all to happen - not even the slight visual effects I had before.",
  "1732 - I fell asleep, and felt no effects whatsoever.  Oh well.  There went about ten bucks worth."
 ],
 "erowid": {
  "id": "61729",
  "citation": " Shaman.618. \"Not Strong Enough For Me: experience with Salvia divinorum (40x extract) (ID 61729)\". Erowid.org. Jun 15, 2007. erowid.org/exp/61729",
  "substance": "Salvia divinorum (40x extract)",
  "views": "4079"
 }
}
