{
 "id": 10351,
 "title": "Mediocre at Best",
 "date": {
  "submission": "2007-06-30T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Tryeverythingonce",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "8.0 mg",
   "administration": "insufflated",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:00",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": "3:00",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I decided to try it for myself.  The reasoning was simple:  It might have fun properties, and it's one of the few research chemicals that can still be found online.",
  "Anyway, I bought 100mg from an internet source.  It arrived in 3 days, and I was ready to try it immediately.  The experience went as follows.",
  "20:30 - Two friends and I dosed, 25mg each, by 'parachuting' it in a piece of toilet paper.  We had eaten a few hours before, but nothing recently.",
  "21:00 - I stated to feel a come-on, my friends hadn't felt anything yet.  We weren't worried, since they say it takes a while to kick in.  We were sitting on the couch watching Simpsons, waiting, waiting.",
  "22:00 - By this point, I was definitely feeling something.  We had just gone shopping for dinner food , and the experience was definitely altered by the drug, albeit only slightly.  It was sort of like MDMA, or 2C-I, but with a slight headache.",
  "22:30 - After making food, I suggested that we split the other 25mgs between the 3 of us.  We divided it up into lines, and insufflated them.  (Approximately 8mgs was insufflated by each of us.)  It burned for a minute, but it was a very localized burn, and it wasn't uncomfortable at all.",
  "22:40 - The recent bump seems to have significantly amplified the effects.  I can feel a warm head rush, and the urge to smile.  My friends felt something, although they weren't very vocal about it, which leads me to believe it was relatively minor.",
  "23:30 - The effects had almost completely worn off by now, both from the original dose and the bump later on.  We had just eaten dinner, and were felling pretty normal.  We drank some Sparks energy drink, took .5mg xanax per person, smoked a hit or two of weed, and watched Pirates of the Carribean.",
  "The after effects were non-existent.  There was no hangover, no body ache, no headache, nothing.  This could be attributed to the short duration and mild effect of the drug.",
  "Overall it was a very mild experience.  None of us was terribly impressed.  However, none of us regretted trying it, either."
 ],
 "erowid": {
  "id": "61689",
  "citation": " Tryeverythingonce. \"Mediocre at Best: experience with 2C-C (ID 61689)\". Erowid.org. Jun 30, 2007. erowid.org/exp/61689",
  "substance": "2C-C",
  "views": "7629"
 }
}
