{
 "id": 10357,
 "title": "A Mighty Rash",
 "date": {
  "submission": "2010-01-10T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Dr B",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 Tbsp",
   "administration": "oral",
   "substance": "Kava",
   "form": "(tea)"
  },
  {
   "time": "1:30",
   "amount": "4 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "3:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Id like to briefly recount an experience I had with combining kava kava and alcohol one night last weekend, because I had an unusual and kind of frightening reaction. ",
  "I have used kava kava many times in the past, and had used it every evening for the past two weeks prior to this experience.  My normal dosage is between one and two compacted tablespoons of dry kava root powder that I buy at a local grocery store.  My preparation is very simple: I put the powder in about  of a bottle of regular tap water, shake vigorously for a few seconds, and chug it while the sediment has not yet settled.  This is very effective for me at inducing relaxation, anxiolysis, and sometimes a bit of euphoria. ",
  "On the night in question I used between 3 and 4 tablespoons because I was going to a party and wanted to be very loose.  About 90 minutes after ingestion of the kava, I started drinking beers.  I had 4 beers over about another 90 minutes, and was hanging out, talking with some friends, when G told me that my face was red.  I didnt really take notice, because that happens sometimes when I have alcohol by itself.  When I looked in the mirror, it was indeed VERY red, but in small patches.  The rash was not itchy or raised, but splotchy and pretty disgusting looking.  I asked the host of the party for some benadryl and I took them and got a ride home. ",
  "When I got home about 45 minutes later, I took off my shirt and the red, irregularly shaped splotches were on my face, neck, shoulders, chest, and upper back.  I felt fine (though quite sleepy from the benadryl and alcohol) and when I woke in the morning, the rash was gone.  I repeated this combination once (a week later) but with less alcohol and less kava.  When the rash reoccurred (though less severely) I felt confident in attributing it to the combination of the two."
 ],
 "erowid": {
  "id": "61736",
  "citation": " Dr B. \"A Mighty Rash: experience with Kava & Alcohol (ID 61736)\". Erowid.org. Jan 10, 2010. erowid.org/exp/61736",
  "substance": "Kava & Alcohol",
  "views": "7601"
 }
}
