{
 "id": 1035,
 "title": "I = Insightful (2nd opinion)",
 "date": {
  "submission": "2002-04-07T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HeWhoLives",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "2C-I",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "My first encounter with 2C-I was so disappointing that I didnt feel motivated to take it again until a few weeks ago (see my trip report in Erowids archives). For my first experience, a friend and I took approximately 17 mg. My friend took ~20mg on a later date and told me that this was a better experience. So, with this same fellow explorer, in the same setting as my first trip, I took the ~20 mg dose.",
  "I felt the first alerts in a half hour. I started to feel tense and my throat became coated with mucous. My stomach gradually started to bother me and I felt slightly sick for a couple hours. During this period, my mind was clear and I noticed little to no visuals. The stomach cramps and tenseness subsided when we smoked a bowl of weed. In fact, weed was the turning point of this trip. The two drugs seem to have the same kind of synergy as pot and foxy.",
  "After smoking. I laid back as mild patterns and colors started to manifest. I suddenly felt as though I melded with the couch and the rest of the room. My eyes were openings in the liquid-like substance I was a part of and I stared out of these openings at the rest of the room. I had been chewing gum to relieve jaw clenching due to the tenseness. My gum now felt like it was rolling or floating around in my mouth. I experienced a slight panic because this melding experience felt as though I was drowning. I was being swallowed up both physically and psychologically.",
  "This experience lasted only about 5 minutes and was broken by my friend starting a conversation with me. It was fairly easy to snap out of the feeling and talk with him but the impact of the experience stayed with me the rest of the night. I consider that immersing experience the psychedelic high point of the trip as the rest of the evening was visual but not thought provoking as those 5 minutes.",
  "I realized later that that feeling of drowning was very similar to my frightening salvia experiences. That losing my sense of self and melding with my surroundings is present in both instances. While the 2C-I didnt give me the feeling of being caught up in a disturbing system like with salvia, I did feel some of the same panic from loss of self and loss of control. I dont know if the loss of self implies the loss of control or vice versa as I experience them simultaneously. However, this gives me new angles on my salvia question: What do my unpleasant high dose salvia experiences mean?",
  "Maybe the fear of loss of self is a large part of the unpleasantness. Maybe I shouldnt resist and should just flow with the experience, embracing the loss of self.. Even so, I dont think its as simple as the old fear of self-loss cliche. I cant help but think that it would be easier to embrace the dissolution if it entailed melding with something with ultimate meaning. Salvia and research chemicals dont offer a mystical vibe. Thus, when I start to get swept away, I attempt to throw the brakes on, thinking maybe I dont want to become a part of this!! Further experimentation may be the key. I plan to experiment more with salvia working my way up dose-wise, with the specific intent to getting used to the dissolving process. I also want to try the 2C-I/weed combo again but alone because I think my experience couldve developed further if it wasnt stopped short by the conversation with my friend",
  "Now that Ive done 2C-I twice, I like it better but still dont share the same opinion as some of the glowing reports Ive read. In comparison to 2C-T-7 and 2C-T-2, this drug is the speediest of the lot, with T-2 being the least speedy. 2C-I is the least visual and T-2 is the most visual. T-2 and 2C-I consistently give me stomach cramps but T-2 feels more organic like shrooms while the cramps of 2C-I are accented with a speedy and metallic feeling. Ive only endured cramps once from T-7 taken orally and that was because I took a bumpy car ride during the onset. 2C-I is the only one of the three on which Ive had a classic psychedelic experience beyond mild visuals (when taken orally).  This classic experience makes me more curious and willing to explore this substance further."
 ],
 "erowid": {
  "id": "12983",
  "citation": " HeWhoLives. \"I = Insightful (2nd opinion): experience with 2C-I (ID 12983)\". Erowid.org. Apr 7, 2002. erowid.org/exp/12983",
  "substance": "2C-I",
  "views": "6986"
 }
}
