{
 "id": 10350,
 "title": "An Incredibly Nauseous Experience",
 "date": {
  "submission": "2001-04-11T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Poser",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "40",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "capsule"
  }
 ],
 "report": [
  "Me and two friends of mine decided to take AMT the other night. i had seen my other friend on it and he had really liked it so we decided to give it a try. we took 40 milligrams at exactly 7:40p.m. we didnt expect it to kick in for about an hour or so, but no more then 10-15 minutes later my friend got really sick. she had to pull over and throw up and she started tripping her ass off and was really fucked up. me and my other friend had taken ours and we felt fine. a couple hours later i still felt fine, like it wasnt working at all and my friend was still totally messed up. then at about 11:30 we decided to go for a ride with some other friends. and about 15 minutes later i started seeing all kinds of beautiful visuals. visuals that were different from anytime i had ever taken acid. i felt really great and i was sooo happy that it was finally starting to kick in almost 4 and a half hours later. then i started to feel really nauscious. i thought it was pass, but it just didnt. so we pulled over and i threw up big time!!! i figured once i threw up that i would feel much better and enjoy myself more. but, the nausciousness just would not go away. i just kept throwing up about every 15 minutes and i couldnt stop. my one friend had stopped throwing up after the first hour and my other friend wasnt feeling bad at all, just enjoying the trip. and as time went on more and more i just kept going deeper into a trip like i was never coming down. at one point i told my friends i was definitely peaking, but then about 3 hours later i told them that i take that back and i was peaking now!!! lol. but i still could not stop throwing up. my stomach felt sooooooooooo incredibly bad. and i was getting this horrible intense headache and any light was really hurting my eyes. both of my friends had the bad headache too. i was starting to get scared b/c my body was reacting so horribly to the drug, but however i was still trying to not let it ruin my trip b/c everything i was seeing was so pretty. at one point i was sooo close to asking my friends to take me to the hospital to get my stomach pumped, but i didnt want to scare them or ruin their trip so i didnt. i just kept trying to have fun. i continued to throw up even at 12 p.m. the next day, like 15 hours later from when i first took it. at that point we still had not fallen asleep yet. it was really weird b/c i never throw up off of anything and i just could not stop. we finally fell asleep at about 1 p.m. and were back up at 4:30. once i woke up i felt incredibly better. i still felt slightly nauscious but it was sooo much better and i knew i wasnt going to throw up anymore. all in all it was a great experience with the visuals and the feeling. but the horrible body sickness was just too much and i dont think i would ever do it again unless i took a much smaller dosage. the weirdest part about it was that all 3 of our reactions were different. our male friend did not get sick at all, neither did 3 other male friends of ours that took it at a different time then we did. but me and my girl friend got very sick. and the time difference was sooo different. her's hit her in 15 minutes and mine hit me 4 and half hours later after i had taken it. i would advise all people (girls ESPECIALLY) to be very careful when taking this and read about it before u do so u can take it right. and girls should take smaller dosage. thats what i feel with my experience. the best thing about the drug was that u didnt have that shitty insecure cracked out come down like u do with regular acid. but the body sickness definitely made up for it..."
 ],
 "erowid": {
  "id": "6168",
  "citation": " Poser. \"An Incredibly Nauseous Experience: experience with AMT (ID 6168)\". Erowid.org. Apr 11, 2001. erowid.org/exp/6168",
  "substance": "AMT",
  "views": "10146"
 }
}
