{
 "title": "Addiction & Self-medication",
 "author": "Dr Smooth",
 "citation": " Dr Smooth. \"Addiction & Self-medication: experience with Adderall (ID 10365)\". Erowid.org. Sep 1, 2004. erowid.org/exp/10365",
 "substance": "Adderall",
 "bodyweight": "140 lb",
 "report": "<p>Don't get me wrong, I'm not an uppers guy.  I've generally held them in a light of skepticism, as they seem highly addictive (and lo, I am an addictive type of guy) and altogether not my style.</p><p>I think I've changed my opinion, perhaps.  Yesterday, Nov 2, I left school and came back home to do laundry and homework, luckily the folks were away at the beach.  I began trying to do all the homework I'd told myself I'd do, but to little avail.  Around 5:30pm I took a single pink/yellow-ish pill of Adderall that someone had given me several months prior.  Actually, to be specific, I simply tucked it betwixt my gum and cheek, and pretty much forgot about it. </p><p>Having only one previous experience with a serious stimulant, a single dose of ritalin a long time ago, I did not _know_ I was affected.  I didn't realize until I looked down at the computer screen and realized I was two pages over the length requirement for a paper I'd been dreading and had been rather quite uninterested in. </p><p>At that point I started getting agitated, but in a supremely pleasant way.  I began wandering around my house, turned on the  PBS newshour around 6:20 but found it intolerably slow, and began reading two different magazines, organizing the bookshelf and cleaning the cat box pretty much all at once.... yeah it sounds insane but my mind just kept jumping.  I was focused completely on any single thing, like a train on a straight track except for that my train kept suddenly jumping to other straight tracks.  At the same time I kept an awareness of all the other tracks.</p><p>  Realizing how excited I had become and how I was not accomplishing anything that actually _had_ to be accomplished (other than the catbox, I suppose.... yeah dependent species..) and buckled down and finished my paper, elaborating heavily on my first draft.  After that my mind quit racing so much, my body, specifically skin still felt sensitive, like on kind bud with damiana, and I felt fine.  I headed to the other part of the house, and went into my stepdad's storage room.  I immediately began ransacking things, just out of curiosity. At this point I had a couple glasses of coke, and a cigarette.  Though curiously I had _less_ of a physical desire to smoke than usual after a few hours.</p><p>I then discovered an old guitar in the closet and,  despite not being musically inclined, immediately picked it up and started 'playing' for a good half-hour.  For the first time I actually seemed to understand the guitar, at least rudimentally. </p><p>Around 9:30 or 10 I felt completely sober and drove downtown to see if I could find any of my friends from back in High School.  Driving was exceptionally fun, by the way.</p><p> Upon arrival I found many people I had never met before but I sincerely enjoyed talking to them, and had very interesting conversations.  I was not shy, but not drunkardly amiable.</p><p>  To cut to the chase, I felt NORMAL.  This is the way I am supposed to be, I was alert (not so common), very social, focused, intelligent (I beat someone in chess who has ALWAYS beaten me), and over all content with the world.  What could be better than sitting out on a nice night conversing with people.  It didn't matter to me whether I got 'fucked up.' I was already perfect.</p><p> Though I got little sleep last night I felt fine about it, and I'm not really tired today.  I had fascinating logic trains, around sunup I decided I should sleep and took a gram or so of Tryptophan, but it didn't phase me.</p><p> My addictions to caffeine and nicotine became only supplements, and unnecessary at that, because the amph was doing the job quite nicely.  I do admit that right now I would _really_ enjoy having another pill, which is sort of alarming.  While there is a temporary glut in Adderall in one of my circles right now, I am going to try and use tyrosine instead.  Still, amphetamines have a respectable place in my drug pantheon.</p>",
 "year": "2001",
 "id": "10365",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-09-01T07:00:00.000Z",
 "views": "38211",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
