{
 "id": 10378,
 "title": "A Hedonistic Dream",
 "date": {
  "submission": "2007-04-08T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dondante",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "130",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "AET",
   "form": "capsule"
  },
  {
   "time": "3:15",
   "amount": {
    "number": "1.0",
    "unit": "mg"
   },
   "administration": "IV",
   "substance": "Hydromorphone",
   "form": "liquid"
  },
  {
   "time": "3:45",
   "amount": {
    "number": "1.0",
    "unit": "mg"
   },
   "administration": "IV",
   "substance": "Hydromorphone",
   "form": "liquid"
  },
  {
   "time": "3:45",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  },
  {
   "time": "6:30",
   "amount": {
    "number": "600",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Carisoprodol",
   "form": "pill/tablet"
  },
  {
   "time": "6:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  },
  {
   "time": "7:00",
   "amount": {
    "number": "0.5",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "7:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "tar/resin",
   "specific": "Hash"
  }
 ],
 "report": [
  "8:00 p.m.\t130 mg AET oral capsule",
  "T+3:15\t\t1 mg hydromorphone IV",
  "T+3:45\t\t1 mg hydromorphone IV, smoked Moroccan hash",
  "T+6:30\t\t600 mg carisoprodol, smoked hash",
  "T+7:00 \t        0.5 mg alprazolam, smoked hash",
  "Personal: 23 yo male, 170 lbs, good health",
  "Past experience:",
  "Ive experimented with a wide range of psychedelics (tryptamines, phenethylamines, and LSD), as well as many other drugs, but I never get stuck on one substance.  Novelty is one of the greatest characteristics of experimenting with psychoactive substances.  I very rarely use opiates or any addictive drugs for that matter  I received 2 x 4mg dilaudid (hydromorphone) pills about 3 months ago and still hadnt used them.  I figure I have too many outside responsibilities and interests to let myself get in the habit of using drugs too often.  My philosophy of drug use is that as long as drugs arent detrimental to ones life or getting in the way of ones goals, they are perfectly acceptable and occasionally even beneficial.  This requires a good deal of self honesty, but responsible drug use is possible.  Thats enough of being preachy.  On with the report ",
  "Set and setting:\t",
  "It is my spring break  after months of grueling work for medical school I finally have the chance to completely relax.  The previous weekend I had an extraordinarily beautiful experience hiking under the influence of 420 mg mescaline hcl, which was augmented beautifully at the tail end with ketamine.  This is probably my only trip for the spring.  I plan on tripping 3-4 times a year as long as I can foresee (and using empathogens every once in a while as well).  Ive cut back significantly from the peak of my tripping, which was once or twice a month last spring. ",
  "Today, I slept in late, cleaned up the apartment a little, and got in a workout.  I felt healthy, rested, and stress-free going into the experience.  I had one friend joining me and our only concrete plan was to watch the Tar Heel basketball game.  We ate a light meal about 30 minutes beforehand, so I expected a slight delay and was worried about some nausea. (AET never showed even a hint of stomach issues) ",
  "T+0:00 \t",
  "We take 130 mg AET, its down the hatch at 8:00 p.m.  We drive over to a friends house to watch the Tar Heels play their second round game in the NCAA tournament.",
  "T+1:15  \t",
  "By halftime, I am aware of a faint something, but I cant define it.  I drink two IPAs over the course of the game (I never drink much).  We are both still only a +/- on the Shulgin scale. ",
  "T+2:30\t\t",
  "Im somewhat disappointed.  I look in the mirror and my pupils appear slightly constricted?!!  Im confused of course, because its as if the drug hasnt even entered my system or was somehow having some parasympathetic effects.  I figure that this is just going to be an extremely mild experience.  We plan to go out and celebrate the Tar Heels victory and St. Pattys Day, but neither of us is even close to the state of bliss that we were hoping for.  In fact, we arent even sure we could distinguish this feeling from placebo. ",
  "T+3:15\t\t",
  "We get back to my place to get a little something to give us the boost we were looking for.  Wed hoped to be writhing in pleasure at this point but are far from it.  I recalled the dilaudid that Id dissolved and put through a micron filter over a month ago.  It was ready to be injected (Ive only IVd opiates two other times).  This seems like a good option since the AET seems to be a dud.  Using sterile technique, we both draw up  cc (~1 mg).  Id heard the body rush was stronger than heroin, and I imagine it could be true.  Even at this low dose, I experience a wave of muscle contraction as the drug permeates my body.  Im not sure that I even enjoyed it.  It doesnt cross the blood-brain barrier as quickly as heroin, but damn, Im not sure I could stand a body rush any stronger.  A few minutes later the drug seems to be slowly seeping into my brain and I become peacefully opiated.  I lay down listening to some My Morning Jacket  what a beautiful sound. ",
  "T+3:30 \t",
  "I feel some slight nausea whenever I walk around.  I venture into the bathroom and observe my pupils  they are dilated!!!  Opiates dont make your eyes dilated!  Was the tryptamine finally making an appearance?  Euphoria is building.  I cant tell if it is more than just the dilaudid, but I feel absolutely wonderful. ",
  "T+3:45  \t",
  "We smoke some excellent Moroccan hash and then IV an additional 1 mg dilaudid.  The rush is just as strong  almost unnerving.  We lay around acclimating ourselves to the new state of mind.",
  "T+4:00  \t",
  "The waves!!!  Incredibly waves of euphoria wash over me, they approach slowly building in the distance to awesome heights.  Its as if the intensity recedes for a few minutes and Im not even sure if I can feel the tryptamine, then it builds, and BOOM, it crashes  its a level of euphoria possibly more intense than MDMA.  The waves are more distinct than any other drug Ive ever experienced.  Roughly 5 minutes of heavenly pleasure are followed by 2-3 minutes of Im not even sure if Im feeling the AET anymore.  The waves transition from crashing and receding to an ebb and flow. ",
  "T+4:15  \t",
  "We decide that if we are going to make it to a bar its now or never.  Im not usually a bar person, but I know a bartender that had promised me a drink as a congratulations for my recent engagement.  Plus, we had to celebrate St. Pattys and the Tar Heels!  I talk with the bartender, get my complimentary beer, and we sit down on some couches in the back.  If Id didnt maintain some effort in looking normal I would have appeared as described in another AET report, like I was blowing up and smacked out at the same time.  I wanted to just lean my head back, close my eyes, and just be self indulgent.  In the past I almost feel ashamed when I get to this state of mind, but with the hard work Id put in the past 10 weeks, I felt I deserved every bit of this hedonic thrill.  And despite my desire to writhe in pleasure, it was actually quite easy and comfortable to have conversation. ",
  "T+4:45 \t",
  "A group of grad students sat down by us and we strike up a conversation.  I feel relatively at ease even though in my head Im floating on heavenly clouds and experiencing a pureness of euphoria that Ive never known before.  Talking actually feels great.  The people we met were slightly drunk and nobody suspects that we are on anything (Im sure someone with a keen eye would have had no problem figuring it out though).  It turns out that the brother of one of the grad students is the roommate of my best friend from high school.  There are lots of random connections  if Id been tripping they would have definitely seemed cosmic.  We talk for a while.  The waves come in increasingly rapid succession, overlapping and gradually erasing the troughs.  Some tension is building in my jaw muscles, but I can keep it somewhat under control. ",
  "T+6:30\t\t",
  "The bar closes and we head home.  The cold air outside makes my teeth chatter uncontrollably.  I take 600 mg carisoprodol (Soma) when I get home to try and ease the jaw clenching.  The AET finally reaches a steady state, but were still soaring high on the plateau.  We smoke some more delicious hash and put on some music.  I branch off temporarily from the greatest band in music, MMJ, and listen to some Sigur Rs, Explosions in the Sky, and then Pink Floyd.  The music is very mellow and complements the state of mind flawlessly. ",
  "My senses are ever so slightly frayed, I dim the lights, light a few candles  this fixes the problem completely.  The music is like a warm blanket, delicately insulating my mind.  There is some nodding off  the opiate alone was not strong enough to cause nodding (although Ive never actually experienced an opiate nod).  AET seems to cause some nodding on its own, but the combination with dilaudid and THC made for a wonderful state of mind.  The air looked a little foggy, and the atmosphere in the room was much like a dream.  I experienced some mild hypnagogic hallucinations whenever I would let my mind shut off and drift.  The Soma is starting to alleviate some of the jaw clenching.   ",
  "T+7:00 \t",
  "I feel like the plateau is beginning to taper off and I take 0.5 mg alprazolam (xanax) hoping that Ill be able to get decent sleep at some point.  The hash was a perfect compliment.  My friend IVs another 0.5 - 1 mg dilaudid, but I dont even feel the need  Im already in a state of perfection.  We lay around talking about how wonderful this night of true hedonism was. ",
  "Summary:\t",
  "This experience was hedonism at its finest. This is certainly the tryptamines equivalent of MDMA. It didnt have the forced empathy of MDMA, but felt like an exquisitely clean high. Pure euphoria is the best way I can describe it. It did have a faint tryptamine signature buzz, but really no visual disturbances and only very minor changes in thinking patterns (less psychedelic than even MDMA). The hash was probably the main contributor to the altered thought processes.  Overall, however, AET was definitely the main player in this experience. The hydromorphone was in the background relative to the tryptamine ... same as it would be if hydromorphone was combined with MDMA or any psychedelic.  The AET went from unnoticeable at T+3:30 (not including the dilated pupils) to VERY STRONG at T+4:00!! There was nothing aside from some sweaty palms and a slight mood lift until T+3:30.",
  "I think the nods were the most noticeable mental characteristic of AET aside from the feeling of pure bliss. The hydromorphone blended perfectly and probably added to the dreamy effect. AET felt very sensual at points, but at least with the opiate combination, it would not lend itself to sexual activity  quite the opposite actually. I dont think this one has the therapeutic potential of MDMA, but it is just as pleasurable. AET is a pleasure drug, which is why I think it went so well with the hydromorphone ... self indulgence amplified. I'm not usually a fan of drugs like this, but I suppose the rare experience like this is acceptable (maybe not beneficial like some of the psychedelics can be).",
  "It was very odd that the drug seemed to be almost completely absent until 3 hours after taking it. Ive never had a drug take effect so late. The same delay happened with my friend. Maybe the hydromorphone really kicked it into gear or maybe it was the food, but it was literally like and on/off switch, an almost instantaneous transition from +/- to a +++.",
  "The next day, I slept in late and woke up feeling a pleasant afterglow. I lounged around for most of the afternoon, watching some basketball and jotting down this experience. I took some 5-HTP only because I planed to, not at all because I felt like I needed it. After a run in the late afternoon, I felt great. Tonight I feel tired and Im sure Ill sleep well.",
  "I must clarify that this does not qualify as one of those rare and extremely memorable experiences and was by no means life changing. I value existential ecstasy acheived in a profound trip many 1000x more than I value a selfish night of hedonism. Egocentric pleasure is much less satisfying than spiritual pleasure, the two arent even comparable. The ecstasy of a profound trip can leave your mood affected positively for months or years afterward, whereas this was great, but there was no lasting impact.  This experience was something that Id possibly repeat someday, but I will save it for a special date, and by no means anytime soon."
 ],
 "erowid": {
  "id": "61822",
  "citation": " Dondante. \"A Hedonistic Dream: experience with AET, Hydromorphone, Cannabis - Hash, Carisoprodol & Alprazolam (ID 61822)\". Erowid.org. Apr 8, 2007. erowid.org/exp/61822",
  "substance": "AET, Hydromorphone, Cannabis - Hash, Carisoprodol & Alprazolam",
  "views": "26944"
 }
}
