{
 "id": 10379,
 "title": "Personal Overview",
 "date": {
  "submission": "2009-09-12T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "24yr old",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria"
  }
 ],
 "report": [
  "<p>A summary of 8 Amanita muscaria experiences. To start off with try the grade A caps work much better than the extract for me.",
  "At low doses some traditional affects seem to be salvation, increase in mood, interest in previously uninteresting things. I was fascinated with water and gas lines coming into the house. Thoughts of religion, particularly Buddhism, and Christianity. Im more into Native American philosophy normally.  Laughter seeing he funny side of things, enjoyed television which I normally only tolerate.  Profound feelings of oneness.  Deep thinking.",
  "Ive had some difficulty with larger doses however getting stuck in time loops for what seemed like would last forever one loop going into another constantly repeating itself in different degrees. I thought it would run itself out but due to contact with the outside world I ended up in the hospital then mental hospital until things got straightened out. Some negative affects at large doses were time loops, paranoia. Pissing my pants (it seemed like a good idea at the time, I thought I was caught in a mouse wheel spinning upside down and around in a figure 8 pattern and didnt want to move). Also extreme honesty, felt nothing wrong with giving honest answers to everything due to felt oneness with outside objects.",
  "Many mystical experiences resulted. I can not remember most of these dealing with the laws of the universe, humanity and hope in general. Very open to suggestions. Strength wise Id say Amanita is far stronger than mary jane. Not a party fungus. More something to be taken and attend a local church or hang out in nature. Im not a party person lately. Environment is important taking it and attending school got me in a certain amount of trouble when I happily announced to a history class that owning slaves wasnt necessarily all bad and other bizarre conculsions coming out of  not believing what I was hearing plus intrinsic trust in the fabric of the universe.",
  "Overall helpful in the spiritual centers of the body, aiding in compassion and understanding. I viewed these plants as devine and a blessing. I also enjoy the green, regular mushrooms, top 2, in various varities, never tried lsd, very interested. H.b. woodrose better than morning glory, gave me some interesting insights. Im scared very much so of datura, ayahuasca, and salvia.",
  "Far more than a mild experience, amanitas can be downright intense and earth shattering. A 4 mushroom experience left me in a daze seeing opposities disappear, with the knowledge they were only real and maintained by me. I literally couldnt tell which way was up and almost walked up the side of a wall chris angel style, for real. Also couldnt tell difference between dry, wet, night, day, dreaming, awake, future, past all other imaginable differences didnt quite blur the edges enough to reach the white light or atman, but deep non the less, will continue to use these blessed plants.</p>"
 ],
 "erowid": {
  "id": "61824",
  "citation": " 24yr old. \"Personal Overview: experience with Amanitas - A. muscaria (ID 61824)\". Erowid.org. Sep 12, 2009. erowid.org/exp/61824",
  "substance": "Amanitas - A. muscaria",
  "views": "6455"
 }
}
