{
 "title": "Passionate Ephedra",
 "author": "Opaque",
 "citation": " Opaque. \"Passionate Ephedra: experience with Ephedra sinica & Passion Flower (ID 10387)\". Erowid.org. Mar 23, 2006. erowid.org/exp/10387",
 "substance": "Ephedra sinica & Passion Flower",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "75 mg",
   "oral",
   "Ephedra sinica",
   "(tea)",
   "",
   " ",
   "oral",
   "Passion Flower",
   "(tea)"
  ]
 ],
 "report": "<p>As an avid long-time user of ephedrine, both in pill form and as a strong ma-huang herbal tea, I've always been interested in the near-trippy sensations experienced by users of this substance.  A few years ago, I decided to try combining my traditional dose (on this occasion, enough of the herbal tea to equal about three typical ephedrine pills of the over the counter variety)  with passionflower tea.</p><p>The effect of combining these two substances was a considerably stronger effect of the ephedrine on my mind and body, though its varied effects were increased in various proportions.</p><p>The somatic effect was an increase in the pleasant tingling that usually accompanies an ephedrine high.  This tingling was great enough, that in combination with a euphoric mental state, it had me giggling for a good portion of the evening.  Colors seemed noticeably brighter, sounds more 'crystaline', and any physical contact immensely pleasurable.</p><p>Negative side effects were minimal, though the one notable one was an inability to maintain an erection: something which has never occurred for me on any other drug (excepting perhaps very large quantities of alcohol), including ephedrine alone, LSD, ecstasy, heroin, coke, pot and various pharmaceuticals.  I attribute this to an apparently great increase in blood pressure during this experiment.  Pulse rate, however, did not seem to increase any more than on ephedrine alone.</p><p>I've repeated the experiment many times since, with both ephedra teas and OTC ephedrine pills, in combination with herbal passionflower, and always to much the same set of results.  Similar results may be obtainable using syrian rue instead of passionflower, though I have not tried this combination.</p>",
 "year": "1998",
 "id": "10387",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-23T08:00:00.000Z",
 "views": "14739"
}
