{
 "title": "Friend and Foe",
 "author": "C.E.B.",
 "citation": " C.E.B.. \"Friend and Foe: experience with Amphetamines (Adderall) (ID 10396)\". Erowid.org. Sep 10, 2004. erowid.org/exp/10396",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "insufflated",
  "Amphetamines",
  "(daily)"
 ],
 "report": "<p>I received a adderral scrip about 4 days after my girlfriend of two years dumped me for one of what I thought was my better friends. I got the script at my parents insistence, I was a little wary of taking the pills, just because, a friend of mine has a problem with adderral. But I was diagnosed ADHD, so adderral is what they gave me.</p><p>This is was the single biggest mistake of my life. Adderral has ruined me. Immediately after receiving the script, I started abusing, snorting usually around 60-100 mgs over the course of the day. Just to numb the pain from the breakup that I am going through. I have recently realized that I am very physically and psychologically addicted to adderral and working a healthy coke habit. The adderral is like a friend who keeps helping me, then betraying me with the come down, I will do anything to avoid a come down, actually what I have been taking with the adderral is sleeping pills, like around 4 of them whenever I start to feel like im coming down. And within 30 minutes I am deep asleep and ready to start the next day, this is my life. I would like one day to be clean. I actually dream of that day, when I can say, hey im a normally functioning human being again but not right now, I know this adderral is killing me slowly, I can handle the depression from it anymore, for 2 months now, I wake up every morning and cry and sob, for about 20 minutes before I can even begin to think about starting my day, I just finished my crying session for today, so I will be stronger till tomorrow, or whenever I come down.</p><p>I would give anything to not have this have happened to me. For the longest time, I thought I was one of those people who could do as many addictive drugs as I wanted, and I could resist the temptation to become an addict, and I have realized in the past month or so, that I have become a hopeless addict. I never thought when I was younger that I would be drug addict by the age of 20. I dont think I can deal with this life style any longer. Its really taking a piece of my spirit with it. You never realize how bad things can get, till you have reached the end of your proverbial rope. I think I have reached that end, I know that I need to stop, and I want to stop, but its the withdrawl, im scared of it, I dont want to hurt myself, and im scared that in the depression following the withdrawl, I would in a moment of hopelessness I would kill myself. But I know that this drug is going to kill me if I keep it up like this, 100mg, a day up my nose is way to much, ive started getting nose bleeds all the time now, and I cant keep any food down, I throw it all up usually around 30 minutes after eating, so im losing weight and strength slowly. But if I go clean, I cant handle that depression right now.</p><p>So I guess I need the adderral. It sucks big time, that I need something to stop from hurting myself, but in the process of trying not to hurt myself, I am slowly killing myself.  I just want to be happy without these fucking drugs ruining my life.</p>",
 "year": "2001",
 "id": "10396",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-09-10T07:00:00.000Z",
 "views": "12785",
 "dose": {}
}
