{
 "title": "Ahhh Shit!",
 "author": "quest",
 "citation": " quest. \"Ahhh Shit!: experience with MDMA (Ecstasy), Inhalants (Amyl Nitrite) & Cannabis (ID 10414)\". Erowid.org. Nov 27, 2007. erowid.org/exp/10414",
 "substance": "MDMA (Ecstasy), Inhalants (Amyl Nitrite) & Cannabis",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 1:30",
   "1 hit",
   "inhaled",
   "Inhalants - Nitrites",
   "(gas)",
   " T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   " T+ 4:00",
   " ",
   "smoked",
   "Cannabis - Hash",
   ""
  ]
 ],
 "report": "<p>I would like to tell you about two times I've taken x.</p><p>One day last summer a friend and I went to visit another friend (more of his than mine at the time). 'F' we'll call him, said that he'd be making a trip to get a pound of pot and fifty beans. I had been thinking about doing x for a while and told F that I'd love to try it with them. So after he got back, a small party was arranged at his house with the three of us and another person 'K' whom I didn't know at all. They decided for me that one now and one later would be good. So I took my one purple motorola and my friend and I went to the local porno store to get some 'Maximum Impact'. On the way back to F's I began to see bright blue stars rushing by me and my head felt light, all I could say was 'woah'. Previously I had only smoked pot so I didn't know what to expect and nobody told me what to expect. I was feeling quite content upon arriving back at F's and felt much better when entering his apartment and hearing the booming bass of trance. After a couple more minutes the lights were turned off and the blacklight was turned on. At this point I had a huge smile on my face and everyone kept asking me if I was feeling it, and I told them yes. I had an overwhelming urge to take off my shoes and empty my pockets. So I did this and sat on the couch.</p><p>This is when it started to get good. I felt so happy. So happy. Just like everything was perfect. My friend cracked two green glow sticks and I was instantly captivated. He began to dance and I just couldn't believe what I was seeing. It was the most amazing thing I'd ever seen. At one point I was content to just sit there with the glow stick over my eyes. I was blowing up about an hour and a half after taking the pill. As I looked around, I felt so connected with everyone in the room. My body tingled and it was as if it was vibrating intensely with euphoria. I kept trying to talk to everyone, anyone that would listen. But old K insisted that I be quiet for a while. We then broke out the Maximum Impact. They showed me how to just inhale it off of my shirt after they sprayed it. My first hit of the Max was well orchestrated with the build of a perfect dj subliminal song. After taking a couple of breaths of the Max I sat back and watched my friend dance. The hit fucked me up soooo much. I felt as if my life was peaking with the peak of the song. It was truly one of the most amazing feelings. After another couple hours we took another bean and repeated. My experience that night was something I'll never forget. It had made me feel just so good and so connected with the people I was with that I could have told them anything.</p><p>The second experience I wish to tell you about is more about what happened after coming down.</p><p>One night my girlfriend and I took a pill each (at this point we'd both done it several times). The effects were the same as all the times before, but this time we decided to smoke some weed about four hours after taking the pill (my girl had complained that she felt very antsy and uncomfortable while coming down previous times). So I packed my pipe full of some wonderful chocolate and after I took the first hit (a pretty good one) I lost the ability to move. My girlfriend kept asking me for the pipe but I told her she'd have to come get it from me. I don't know if it would happen like this after everytime we rolled, but we just kept getting higher and higher. By far the highest either of us had ever been. In all we smoked two bowls from the pipe and about three bong hits each. I had my blacklight on and everything was so surreal in its purple glow it seemed to truly be psychadelic. Even though I was had smoked a lot before this time, I'd never experienced it like that before. I was just gone.</p><p>I almost want to do x again just to smoke afterwards and get so unbelievably high. Also, in retrospect, doing the Maximum Impact was a very very bad idea and has been replaced with whipits which provide me with the same feeling of the Max. The next day my friend complained of neck pain and actually had a bruise on the back of his neck that he assumed was a result of the Max. But whipits are great.. Peace.</p>",
 "year": "2000",
 "id": "10414",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-11-27T08:00:00.000Z",
 "views": "5353",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
