{
 "id": 10415,
 "title": "The Miracle Drug",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8.0 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:00",
   "amount": "2.0 mg",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "4.0 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1.0 mg",
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>So, this is my experience with Suboxone.",
  "Since I was a senior in high school, I have been badly addicted to Oxycodone, any and all forms of it (percs, roxicodone, OC 80s, etc). Anything that got me high like Oxy, I'd do it. Just recently, I've become so ill from withdrawal that I stole about 20 of them from a family member. They found out, and I almost went to jail. It was at that point that I finally snapped out of it and realized just what I was doing. I was a junkie. A horrible, fiending, thieving junkie that would do anything for my next buzz.",
  "So, I called and scheduled some time at our local rehab clinic, but I figured, 'Well, I've already been there once. Who's to say it'll work this time?' So I made a few calls, did a bunch of research, and finally came across a drug called Suboxone. Turns out my family doctor prescribed it and had his own program for detox. I was ecstatic, called him for an appointment, and he had me in the next day.",
  "I just got back about an hour ago, and I am actually going to document how I feel.",
  "T+0:00: I take a small swig of water, and place the suboxone under my tongue.",
  "T+0:05: The pill dissolves. It takes like shit, but not as bad as chewing up an Oxy.",
  "T+0:15: The doctor checks my vitals and sends me home.",
  "T+0:30: I start to feel my withdrawal symptoms dwindling. I am so happy that I begin smiling like an 8 year old who just got a new video game.",
  "T+0:45: Something I wasn't expecting at all. I feel high! This is great! I'm getting over my oxycontin addiction and get to get high off another pill! Probably not the best type of treatment, and I doubt they intended for me to get high. But quite honestly, it's like reinforcement kind of, because I can't imagine not getting high when not taking a pill. Pretty soon it'll probably just make me neutral, but in the meantime, I'll enjoy the quaint buzz.",
  "T+1:00: I decide, just to see how I'll be affected, to take another 4 mg half of a pill. I will document how I feel when it hits.",
  "T+1:40: Surprisingly, for such a small amount of this drug, I'm stoned off my ass. I honestly don't even want to type anymore.",
  "-------------------------------------------",
  "MAY 2008 ADDENDUM BY THE AUTHOR",
  "I'm at probably the lowest dose you can get to with this drug (1 mg daily buprenorphine), and I go through withdrawals not even 8 hours after taking the dose. The withdrawals are 10 times worse than that with Oxycodone, and I kind of wish I would have just played my experimentation with Oxy smarter, because I wouldn't be in this mess...",
  "So now I'm trying Kratom, and it's been about 3 days since I took any suboxone at all... It seems to be working really well.</p>"
 ],
 "erowid": {
  "id": "61975",
  "citation": " Anonymous. \"The Miracle Drug: experience with Buprenorphine (ID 61975)\". Erowid.org. Jun 16, 2007. erowid.org/exp/61975",
  "substance": "Buprenorphine",
  "views": "6896"
 }
}
