{
 "id": 1042,
 "title": "More Than Expected",
 "date": {
  "submission": "2004-03-08T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Jon",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>I'm growing my own salvia plants and have collected a few leaves, I smoked them alone before and got an effect but not as powerful as I hoped. I also have alot of Syrian rue. Hearing the syrian rue could make salvia better I had an idea: Take half a cup of water with lemon add a tsp of syrian rue, then strain out the seeds, add the salvia leaves pour into shallow dish to evaporate and scrape off everything and keep.",
  "So on friday I took my smoking blend to a freinds house. Six of us passed around a jay then I loaded a bong with my blend. It had a punch but not rocket ship power of extract, but it did not instantly go away like salvia tends too. So we pass around two bong loads of pot and a few of my blend, and we were fucked up hardcore and it lasted for several hours. It did not go away. I only had like 6 hits of pot but we all had strong closed eye and some open eye visions for 2 hours. It was a lot like a high dose of LSA but without the energy drain and bad parts of LSA. The closed eye were different too, not colors and patterns but weird objects that would change into new objects. It was a state that I had never had before way beyond stoned. It was like the brain scramble of salvia but hours long. Salvia, Syrian Rue, and Cannabis, is a great combination, a lot of synergy.</p>"
 ],
 "erowid": {
  "id": "13013",
  "citation": " Jon. \"More Than Expected: experience with Salvia divinorum, Syrian Rue & Cannabis (ID 13013)\". Erowid.org. Mar 8, 2004. erowid.org/exp/13013",
  "substance": "Salvia divinorum, Syrian Rue & Cannabis",
  "views": "9027"
 }
}
