{
 "id": 10426,
 "title": "Operating on a Different Level",
 "date": {
  "submission": "2010-07-23T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Corwin Black",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Pharms - Eszopiclone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>I have had difficulty sleeping for eight years or so, and for the same amount of time I have been prescribed a myraid of medications, Temazapam, Alprazolam, Lorazepam. My sleep problem is real, but I present it to my doctors as worse than it really is in order to aquire higher dosages and more prescriptions. Because I found right away that these pills, unlike the other pills I was taking at the time, could be used recreationally.",
  "Last year, a doctor of mine wanted me to switch to Lunesta, telling me that benzos lead to habituation and aren't recommended for long-term use, which I already knew. He insisted I try it before refusing it, so he gave me a sample of Lunesta 3mg. Let me say that I was more than satisfied. In terms of sleep assistance, Lunesta is the best thing I've ever taken. With Lunesta, I can sleep for LESS than I usually need to and wake up more easily and more refreshed than with any benzo I ever took. It also helps me to get to sleep when I *want* to get to sleep, not fourty-five minutes later like some benzos (or hours later some nights with nothing). Definitely an amazing sleep aid.",
  "In addition, it provides an amazing high by itself when taken in a wakeful state. One mere 3mg pill is all I need (taking too much seems to *decrease* the enjoyability). Friends of mine have compared it to marijuana, which I do not like but can see the resemblence in effects. It causes everything to be very... amusing. Thought patterns are very noticably altered. Anxiety drops to a near zero, except for certain circumstances. Tedious tasks are quite easy, and may even seem novel or quite fun. It causes an incredible decrease in some kinds of judgement - I've been shopping while on it and found myself the owner of some very strange things the next day (an electric skillet and three cans of sweetened condensed milk!). It does not, to the best of my knowledge, impair me in so much as it causes my brain to operate on a different level. It doesn't make me stupid, just a little ADD.",
  "I experience a mild physical or musical euphoria from it. I also get a mild, metallic taste at the back of my throat (once I got used to it, it is pretty pleasant). I also have minor loss of motor control, particularly after taking an overlarge dosage. I have sometimes experienced retrograde amnesia, particularly after imbibing alcohol or smoking cannabis. There are no hallucinatory effects, which I've read to be a possibility with the related drug Ambien.",
  "It's helped me sleep, and it has been great fun, too.</p>"
 ],
 "erowid": {
  "id": "62032",
  "citation": " Corwin Black. \"Operating on a Different Level: experience with Eszopiclone (Lunesta) (ID 62032)\". Erowid.org. Jul 23, 2010. erowid.org/exp/62032",
  "substance": "Eszopiclone (Lunesta)",
  "views": "12438"
 }
}
