{
 "id": 10425,
 "title": "The Cosmic Rhythm",
 "date": {
  "submission": "2010-03-17T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "DystopianDruid",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "2:00",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "My buddy M and I traveled to the Vibes fest in the Summer of 2005.  On Saturday night, Darkstar Orchestra were set to headline.  I ate the acid at the start of the show.  As I came up on the acid, I lay back in the grass and imagined I was back at a real Dead show.  The show ends, but another show is starting on the smaller stage.  It's The New Deal - and they're throwing a rave in the middle of the mountains.  Glow sticks, ravers in costumes, so much sound.  My friend V and I are dancing hard - the band makes the crowd bounce and the crowd feeds back more and more energy up to the band.  A guy named George walks by selling some Molly.  He's in a great mood and his pupils are dilated as hell, so we know it's gotta be good stuff.  V and I each buy a capsule and break it open in our teeth (bitter, bitter powder - but so worth it).  V had also eaten a hit of acid earlier that night. ",
  "As the show goes on, I start to feel that fuzzy shivering at the top of my skull that I always feel when I do E.  Also, the initial feeling of my brain chemicals shifting around is intense so I decide to go sit back on the grass for a bit.  The beats just keep pounding, pounding - the lights flashing like a mad tempest.  I sit down, and an older man to my right is in a lawn chair, laughing to himself at the scene in front of his eyes.  We get to talking, and he's good friends with the guy who runs the festival.  I'm mostly listening to him, smiling like a clown and nodding as I hear what he says.  After a few minutes of silence, he looks over at me and inquires, 'I take it you're just having a really good time tonight?'   'Yeah!' I respond.  Clearly, my eyes and my demeanor give away my state of mind.  After The New Deal is done playing I meet up with V and we wander around the grounds a bit.  We're both in such contentious and ecstatic moods that we decide to just sit down and chill for a bit. ",
  "We sit and V smokes a bowl of some hydro (I pass, feeling that my head is plenty well fed for the time being).  He and I talk for a while - about our ancestral heritage, our jobs back at home, etc. (I had only met him the day before).  The feeling of connection and harmony is difficult to translate into words.  V and I get up and find a drum circle gathered in the middle of the grounds.  There's about 20 drummers and plenty of smiling dancers.  We stand and watch the drums and the dancers as the dawn begins to break on the horizon.  My thoughts were racing around in my head, each one as joyful as the last.  I reflected on the evolution of the universe - and the gratitude I felt for getting the chance at consciousness.  The happiness I felt that life fought hard enough and long enough to spawn the Homo Sapien - the language gifted bipedal beast.  I began to feel I was transcending time - going back to the idigenous days of early humanity.  The drums - the drums, the dance.  The contrast of The New Deal which has been so electronic and modern to the drum circle which was so primal and acoustic - yet both of them clicked perfectly with the rhythm that is the cosmos, the rhythm that is life, the rhythm that is the beating heart. ",
  "Eventually, the morning rears its head in full and the drum circle dies out.  On the walk back to the tent, V and I walk by a cackling fool who informs us that he dosed Wavy Gravy earlier that evening (who knows?).  I'm still full of energy.  When I look around at the trees in the mountains, they all appear to have extra colors coating their leaves and branches.  The beats are still in my head.  For hours, they continue.  I try to sleep in my tent but it's no use.  The combination of the heat of the summer sun and the drugs in my head keep me awake.  The beats keep going - my brain synthesizes and improvises them over and over.  A good candyflippin' night it was."
 ],
 "erowid": {
  "id": "62026",
  "citation": " DystopianDruid. \"The Cosmic Rhythm: experience with LSD & MDMA (Ecstasy) (ID 62026)\". Erowid.org. Mar 17, 2010. erowid.org/exp/62026",
  "substance": "LSD & MDMA (Ecstasy)",
  "views": "2927"
 }
}
