{
 "title": "Eating Bugs While My Friends Convulsed",
 "author": "Mikey",
 "citation": " Mikey. \"Eating Bugs While My Friends Convulsed: experience with Datura (ID 10436)\". Erowid.org. Apr 7, 2002. erowid.org/exp/10436",
 "substance": "Datura",
 "bodyweight": "90 kg",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Datura"
  ]
 ],
 "report": "<p>\nMy first and last datura experience started with me and 2 friends sitting around at a house deciding to rip off a Datura plant.  After finding one and tearing a few flowers off it we sat at mates house and boiled it all up for half an hour and drunk about 3 cups each.</p><p>Now I'm a very experienced drug user but what happened next I was totally unprepared for...</p><p>At first the only feeling I felt was extreme muscle tiredness and I was almost un-able to stand.  Neither could my friends.  BANG!  I'm at my friend's flat chatting to his flatmate, I say 'I want to go home now'.  He says 'you are home'.  I say 'I want to go to home where my mum lives'.  SHE says 'I am your mum'.  BANG!  I suddenly realize I am at home, its almost midday.  As my memory comes back I remember smoking many invisible cigarettes, thinking my mum and brother were friends of mine, talking to invisible people.  Basicly not knowing where, what, how, or why.</p><p>I later found out I had been crawling on the floor, where we originally drunk the datura, eating 'bugs' while my friend convulsed and foamed at the mouth.  When his straight sister called the ambulance, I lept off the balconey in pursuit of a friend who was actully on the other side of the house.  Then my mum was called (by whom I still don't know) and she took me home where I spent hours rolling imaginary joints, snorting imaginary lines, talking to thin air about crap and basically scaring the shit out of my family.</p><p>One friend wound up in some bushes with no belt, pants around his knees 'listening' to music.  The other was in hospital in a morphine induced coma.  He was released the next day.  He had been on anti-depressants and that fucked him up.</p><p>I can tell you its a very disturbing experience to take a drag on your ciggerate and find out you dont have one.. Or to talk to your brother about himself thinking he's someone else... or having your friends come round to see how you are, having a long chat with them only to realize they are not there.  I cannot remember it all as it was only three days ago and I can't operate properly (its taken 2 hrs so far to write this because i cant see).</p><p>I do remeber trying to smoke my belt, throwing my cat in the bathtub, thinking my mum was Spike Milligan.  The list goes on.</p>",
 "year": "2001",
 "id": "10436",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2002-04-07T08:00:00.000Z",
 "views": "107242"
}
