{
 "id": 10430,
 "title": "Morphidex",
 "date": {
  "submission": "2008-02-06T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Krad",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  },
  {
   "time": "0:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Morphine",
   "form": "(ground / crushed)"
  },
  {
   "time": "0:45",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  }
 ],
 "report": [
  "I had heard for a long time that dextromethorphan will potentiate the effects of opiates. For the last few days I've been in a great amount of pain from a herpes simplex I outbreak, and wanted to put the 1/1 morphidex ratio to the test for analgesia. When I found this to be rather pleasant, I upped it to a 2:1 ratio, and here is the result:",
  "8pm - take approx 50mg dex(capsule) and 50mg morphine hcl (insufflated).",
  "8:30 - pain in groin subsides, euphoric morphine feeling prevalent but not significantly potentiated, I decide to take more dex.",
  "8:45 - ingest 1 more 50mg dex capsule.",
  "9:30 - this is where things get strange. I had eaten a rather large meal before taking the dex capsule, and because of this there was a distinct latency between the come up of the opiates (most of which I snorted) and the dxm, which I ate. At this point I smoked a little weed and I noticed something. At this dosage ratio, the morphine MIGHT have been stronger, but it was hard to notice because the dex was DEFINATELY potentiated. All of a sudden, I noticed the distinct patterning of dxm closed eye visuals, the opiates had a definate effect on the weirdness of the dxm mindstate, making it much clearer. Overall the effect was extremely pleasant, and I could see it being incredibly addicting for the right people. I don't know if I would up the dose any more as the feeling was already becoming sort of overwhelming at 50mg/100mg."
 ],
 "erowid": {
  "id": "62051",
  "citation": " Krad. \"Morphidex: experience with DXM & Morphine (ID 62051)\". Erowid.org. Feb 6, 2008. erowid.org/exp/62051",
  "substance": "DXM & Morphine",
  "views": "14436"
 }
}
