{
 "id": 10433,
 "title": "For Medical Use Only",
 "date": {
  "submission": "2010-08-29T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Impulsive Fool",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was perscribed to Seroquel for possible Bi-Polar, and was also perscribed Prozac for my depression, I was displeased with what I was given since I strongly believe I have ADD- Type 6 'Ring Of Fire'. So I took 100mg of seroquel at night and it made me extremely tired and I screamed if anyone got in my way of the bed, I was supposed to take 100mg every night for possible BiPolar.",
  "As far as recreational use of drugs come, I am fairly experienced I would say, I have tried Alcohol about 10 times, Cannabis about 30 times, Codeine twice, Poppy seed tea twice, Methylphenidate 12-24 times, DXM once, Benzos 10-15 times, and several other weaker pharmaceuticals.",
  "The day I decided to take such a large dose of Seroquel, it wasn't even a planned descision, I have a history of impulsively taking drugs to end my soberness when I'm feeling bad or, just plain want to end soberness. I had an argument with someone and was pissed and depressed and decided to down 10, 100mg pills at about 3:30 AM one morning.",
  "4:00 - I was still online talking to people, still no effect",
  "5:00 - No real effect, maybe a slight Marijuana buzz, when I looked around at a rapid pace, my vision smudged and dragged behind a little bit, but nothing serious",
  "5:20 - I leave a note near my bed saying what I took and how much of what I took, in case something bad happened (note was to parents if they found me having a seizure or something) and I try to sleep.",
  "5:21 - every couple of seconds I have a very alarming experience, I have my eyes closed and I'm trying to sleep, but I see myself awake somewhere else and I go to do something, then my arm moves, moving my actual arm, forcing me to wake up, this happened several times until the scariest one happened.",
  "5:25 - I see myself in my kitchen, standing on a bowl, balancing, then I lose my balance and fall on the table, and I jerk myself awake scared shitless almost",
  "5:30- I decide I can't take it anymore and I wake up my parents, they are asking me shit like why would you do that? and what's wrong with you? and all I would do is scream because I felt totally disconnected and on the edge of passing out, my mom called poison control for advice and we were told to go to the hospital",
  "6:00- We arrive at the hospital, while in the car I kept passing out and my mom kept shaking me awake, my heart was also pounding really really fast. I am put into a hospital bed, and hooked up to an IV and vital signs machine, I remember little for the next 12 hours. Apparently my blood pressure went to a disturbingly low 63 over 30 and stayed there for several hours, and a doctor asked me if it was a suicide attempt and I just casually answered that it was a recreational attempt, but I have no recolection of this, also, nurses kept trying to pry my eyes open for me to look at them, but it was so damn hard to keep them open, and overall the nurses irritated me, I didn't lose it tho, every1 is lucky I didn't lose it.",
  "1:00 PM: I am transferred to a different hospital where I am to stay the night, I remember the whole ride and all, but I went to sleep again as I got to my hospital room.",
  "The rest of the time at the hospital was long and shitty, the vital signs machine alarm would go off whenever my pulse went below 50, causing me to wake up and get no sleep since my natural resting pulse is between 45 and 65. I was in the hospital for 30 hours and now my relationship with my parents is lower than it already was which I didn't think was possible.",
  "In conclusion, I was dysphoric at 100mg, let alone 1000mg. and I don't think there is a recreational use for this drug."
 ],
 "erowid": {
  "id": "62057",
  "citation": " Impulsive Fool. \"For Medical Use Only: experience with Quetiapine (Seroquel) (ID 62057)\". Erowid.org. Aug 29, 2010. erowid.org/exp/62057",
  "substance": "Quetiapine (Seroquel)",
  "views": "7977"
 }
}
