{
 "title": "The Gathering",
 "author": "Jim",
 "citation": " Jim. \"The Gathering: experience with LSD (ID 10450)\". Erowid.org. Feb 26, 2007. erowid.org/exp/10450",
 "substance": "LSD",
 "bodyweight": "130 lb",
 "header": [
  "DOSE: T+ 0:00",
  "3 hits",
  "oral",
  "LSD",
  "(blotter / tab)",
  " T+ 1:00",
  "1 hit",
  "oral",
  "LSD",
  "(blotter / tab)"
 ],
 "report": "<p>It was summertime, and a few friends and myself were at a music festival in the appalachian mountains. I had used lsd and mushrooms several times in the past, and enjoyed the experiences. We found a campsite, set up our tents, and proceeded to make a few puchases. I found a ten-strip of what the girl described to be really good hits. I walked back to the campsite, and ingested three of them. I sat back and relaxed, as was my normal pre-trip ritual.</p><p>The effects came on much stonger than ever before, the effects were more potent than any other trip in about one hour. I became really anxious and started to fidget with the dried up pine needles on the ground. My one friend asked me if I was feeling alright, I told him I was thirsty. We walked up to the check-in/store, it was really crowded in there. My face began to tingle, and my hands became cold and sweaty. The number of people in there made me nervous, so I was relived to walk out of there with my soda.</p><p>We got back, and decided to walk the trails with three other friends. When we started to walk I became much happier, and the visuals were unbeliveable. After what seemed to be and hour or two of intense laughter and distortions we arrived back at the site. I then walked down to this swampy pond to listen to the echos of these bullfrogs calling with another person. I think it is there that I totally lost contact with reallity.</p><p>He later told me that I ate another hit down there started to shake a tree, and walked off. The next thing I remember was arriving at these peoples campsite saying hello, and sitting down at the perimeter. I then began to think about how limited I was by my three dimensions of physical movement. Proceeded by trying each and every combination back then forth at different speeds.</p><p>After that the strangers there became nothing more than symbols of my emotions. I became fixated on the fire, then stuck my face very close to the burning wood. My emotions then proceeded to pull me away, I then began to try to get past them using every movement I could think. I would get past one then another would stop me. I cant remember how long I tried for, but I eventually ended up in this circular parking lot with many people.</p><p>I began to look at the licence plates on the back of the cars, and every single car was from a different state. I wonder how I made the the licence plates appear all diferent, because I know that it was not likely that they were all from different states. I looked up and saw and heard three different scenes, one of a back tire of a dirtbike kicking dirt up, another of firecrackers poping, and the third of different groups of people walking around.</p><p>This excitment made me very paranoid, and then began to distrust every single peson in the area. They were there for me, and I had to keep them away. I kept them away with a geometrical game of equations, which makes no sense to me now but did at that moment. I made a mistake and they all began to close in very fast. I became very afraid more afraid than I can remember being since I was a child. I blacked out, and ended up on some trail flat on my stomach.</p><p>I was diging into the ground with my bare hands, the smell of the moist black dirt was beautiful. Someone picked me up, and put me on thier shoulder. I couldn't speak so I just kicked, I feel bad now cause I did hit someone. They dropped me and I belived for some reason that I was 'doomed', I reached in my pocket without thought. I pulled out my keys and slid them across my throat. Luckily they didn't even scratch.</p><p>I thought about what I just did, and was able to gather my thoughts. I then realized that it was pitch dark out, and I needed to get back to my campsite which I had no idea how to get to. I walked up to these guys camping, and asked one if he could show me back to the store he did, which wasn't too far. I found a couple friends standing near my car, whom I was very glad to see. They told me I had been gone for eight hours, and they had been looking for a bit.</p><p>I was still off for an hour or two, which I spent listening to music in my tent.</p>",
 "year": "1999",
 "id": "10450",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-02-26T08:00:00.000Z",
 "views": "3300",
 "dose": {}
}
