{
 "title": "The Best High I've Ever Had",
 "author": "Duster Face",
 "citation": " Duster Face. \"The Best High I've Ever Had: experience with Opium & Cannabis (ID 1045)\". Erowid.org. Sep 11, 2000. erowid.org/exp/1045",
 "substance": "Opium & Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>My first experience with opium (and only experience to date) was the best high I've ever experienced. We smoked about 2 bowls at first and I began to feel very different. Usually 2 bowls of weed wont mess me up that bad, even if it is midgrade, but this high was just weird. I was walking with my friends and it seemed like they were seperate from the rest of my vision, as if they were there and then there was the background. I felt a very slight disconnection, as with acid. I can only compare this to the feeling you get when you first inhale nitrous, before you get the 'wah-wah's'.</p><p>I also experienced some points where I 'zoned out'. We were listening to music in my friend's car. My other friend was playing the drum parts to the song, and it seemed like he was making the music. I was hypnotized by this, and I just sat there and stared at him. I realize I must have looked like such and idiot, but I felt good.</p><p>Another part of my high was the physical trip of everything feeling good. At one point I was just sitting in the backseat rubbing my knees and thighs. I've never taken MDMA but my friends who have taken it said they felt like they were on it during this high. And there was a general feeling on loving everything. At the time we were listening to hardcore music, which isnt my favorite genre of music at all, but when I was sitting there in the car, I loved that music and wouldnt want to hear anything but that music.</p><p>On the way back to my house, we smoked 2 more bowls. When I got home, I went straight to my room and zoned out listening to some techno and tripping off my ceiling. It seemed to be a big tube that went up and around to nowhere. I loved it. I wasnt very tired as I am with weed, even though I had been walking all day. When I woke up I was lethargic. I still felt really good about everything and have felt no side affects as of yet.</p>",
 "year": "2000",
 "id": "1045",
 "timestamp": "2000-09-11T07:00:00.000Z",
 "views": "79613",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Opium"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
