{
 "id": 10454,
 "title": "Midday Uplift",
 "date": {
  "submission": "2007-11-06T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "odonamon",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:15",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I had a day off in the middle of the week and had nothing to do, so I hit up the internet to see if I had anything to spice up my midday. I searched my medicine cabinet to find that my wife had grabbed 40 mg of her brothers Ritalin (this must have been 5 years ago because the bottle said to take by 2002). After reviewing the experiences I decided the pros outweigh the cons. All doses are insufflated.",
  "Took 2 10mg pills:",
  "Nothing happened in the timeframe some reports stated (5-10 minutes, should feel the rush) so I looked online to see what the shelf life was, 2 YEARS! I was bummed thinking I had just snorted an unpleasant tasting substance for not. But as I was in the middle of my internet search on the shelf life, it hit me. It was sudden, and heavy but not overbearing. I continued my search on the diminishing effects of aged Ritalin. The effects were good, similar to coke like a lot of experiences stated. Good rush, energy and euphoria. I decide to take the last 20 mg. I would have saved the rest for my wife but she is pregnant so I didnt feel bad binging.",
  "Took second 2 10mg dose, 15 minutes after initial dose.",
  "I am writing this as the second wave hits. It is good but not as strong as I hoped. It seems to come in waves though so I am not done yet.",
  "All in all a good high. Nothing too special but a nice bump in the middle of the day."
 ],
 "erowid": {
  "id": "62163",
  "citation": " odonamon. \"Midday Uplift: experience with Methylphenidate (ID 62163)\". Erowid.org. Nov 6, 2007. erowid.org/exp/62163",
  "substance": "Methylphenidate",
  "views": "22010"
 }
}
