{
 "title": "I Could See Fairies...",
 "author": "Liz",
 "citation": " Liz. \"I Could See Fairies...: experience with Dimenhydrinate & Caffeine (ID 10453)\". Erowid.org. Sep 15, 2004. erowid.org/exp/10453",
 "substance": "Dimenhydrinate & Caffeine",
 "bodyweight": "140 lb",
 "report": "<p>I was fourteen when I had my first drug encounter. I was at theatre camp for a few weeks and my roommate's friend, Sara,  and I were sitting around in her dorm talking. 'I've got these pills,' she said, 'They'll fuck you up.' She pulled out a few bottles of Dramamine and we decided to trip the following night. She had warned me that I would probably have the fight the urge to fall asleap, so I drank some plain coffee from the vending machines about two hours beforehand. Up in her dorm, we popped the pills in a handfull. Nine for each of us.  Sara got out a notebook to record all the information. It was sometime in the evening. She turned on some music and we sat around and chatted and waited for the first effects to come on.</p><p>About thirty or forty minutes after ingestion, I began to feel very excited and hyper, dispite what she had told me about feeling tired. I started bouncing up and down on the bed grinning and I felt quite amused by the squeak-squeak-squeak of the cheap matress springs. I started trying to explain that the squeaks were really the birds and squirells trying to sing along with us and I began to sing, 'squeak-squeak-squeak'...After I was tired of singing we turned up the volume to a song on one of her CDs. I don't remember what the lyrics were to whatever we were listening to, but I kept hearing, 'sexy fries, sexy fries, sexy fries...' Sara laid down and laughed and she felt like napping. Suddenly I felt the urge to pee. I ran to the bathroom, and upon returning, I looked down and I noticed that my legs were blue. Not like paint, but like the tissue and veins underneath were. I eclaimed, 'MY LEGS ARE BLUE!'. It was strange because when I saw myself in the mirror my legs were normal, but when I looked straight down upon them they were blue. But it all felt good.</p><p>Suddenly, in the corner of my eye I began to see colors floating on the cieling, like rockets had just whizzed by. I stared into space for quite a long time and whenever I saw a new color I'd shout, 'ROCKET!' and point to where it was. About ten minutes later, I said, 'Dramamine - it means that DRAMA is MEAN!' and I laughed about it for a long time. Sara just slept. I remember seeing someone walk by our third story window, a tall man with a black coat. After that Sara came with me to the bathroom where she confronted someone I could not see...she said that this was her twin, someone who looked exactly like her, and moved like her, a mirror image...and her only hallucination for the night. I felt happy and amused, but after about two hours of this I felt the effects wear off and we didn't seem to trip anymore that night. They seemed like just random visual halloucinations for me, but nothing more. But quite enjoyable. All during the trip my pupils were very dialated and my heart beat very fast.</p><p>A few days later, my friend Becky told me to meet up with her and we'd do something crazy. So I met her that morning, as promised, and we walked to the campus store to buy two packages of dramamine and a cup of coffee for each of us. We each popped nine, and after sitting in the green room in the theatre building, we began feeling it. So at about forty minutes after, we walked down to the commons for breakfast. We began feeling very light headed and stumbled and giggled all through the walk. We were very happy upon arriving and we fixed our trays and sat down with a number of theatre students. We didn't tell them what we were on. Becky sat down on someones lap, but then he looked into her eyes and helped move her to the seat while the others were in conversation. I stared into a bowl of cereal, completely unaware of everyone else around me for a long time, like in a trance. I didn't eat, just stared. I stared for quite some time when I heard a friend of mine call my name...'Liz...what are you on?' I looked up at him but said nothing and glanced over at Becky, who was again sitting on that guys lap and also relatively quiet, so I kept staring into the cereal.</p><p>Suddenly, blue and purplish-pink milk then started to whirl and spin in the cereal, moving up like a swirling wave, I could see sparkles and fairy dust of all colors all around and suddenly this encompassed my whole field of vision. In the back of my mind I could feel everyone looking at me, but somehow I took no notice, and my eyes grew wide in amazement. I could hear a sort of fantasia-like music and I gasped and was shocked when out of these spinning colors and sparkles burst a fairy, like a flower. She was spinning rapidly and then spun into the sky and flew away, leaving a trail of colorful dust behind her. 'FAIRYS!' I exclaimed, and everyone laughed. That was my only hallucination for this trip, although rather vivid, because for the next few hours I just felt tired yet happy and I slept on the couch for a long time, although my pupils remained dilated for hours afterwards. Becky recalled feeling simply very slowed down and light-headed.</p><p>I wouldn't reccommend doing Dramamine because of its slowing-down effects and the minimal high I got with a fairly risky dose. I will always remember my experience, although nothing profound or changing came of it. It also leaves terrible cotton-mouth and an icky hangover.</p>",
 "year": "1999",
 "id": "10453",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-09-15T07:00:00.000Z",
 "views": "8712",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 2:00",
   "amount": "9 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  }
 }
}
