{
 "title": "Six Hour Spiral",
 "author": "jhonny",
 "citation": " jhonny. \"Six Hour Spiral: experience with Mushrooms (ID 10465)\". Erowid.org. Sep 15, 2004. erowid.org/exp/10465",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Alcohol - Beer/Wine",
  "(liquid)",
  "",
  "1.0 g",
  "oral",
  "Mushrooms",
  "(dried)"
 ],
 "report": "<p>I was working a dry sunny day on the golf course, I had eaten very little that day and was dehydrated. My friends picked me up from work and rushed me straight to friends house for a big party. I found out upon entering that there was a dealer there, shrooms were his expertise. I bought a gram from him and had a few beers before I downed them. I ate them straight and didnt notice anything odd about the taste. (9ish  pm)  I went for a swim as they started to take effect, I didnt really notice because I just assumed that water was supposed to move as it was moving. A quick rinse and I was in the house again, I still noticed nothing odd. It wasnt until I sat at the poker table that I noticed something happening to me (Keep in mind I had no idea what shrooms were like or what to expect).</p><p>The table was a blanket of alcohol, ash-trays, cigarettes and cigars. My girlfriend was sitting on my lap and my friends were all around me. I looked at the window shutters that were at the back door, they were white and the black nights sky shone through them. They danced like liquid the white-framed border of the shutters, they never took shape and never stayed still, liquid trying to gain form. It was quite entertaining to me and as I laughed and tried to explain myself no one seemed to understand (most people were messed in one way or another). Things were going so well, my girlfriend was somewhere else so I didnt have to worry about her (I found out later that she was barfing out her shrooms somewhere else). I was having in depth conversation with the dealer about people but he was having trouble understanding what I was saying. I could hear what I was saying come out, then come back at me backwards. I kept tripping over my sentences, the more I tried to concentrate on saying them, the more jumbled up they would become. I kept saying, I figured it out which was referring to the shrooms and how they worked.</p><p>The more I looked at things, the more distorted they would become, the more I sat down the more amplified the feeling would feel. If I stood up after sitting down, I would still feel the weight of my body sitting down (Ill get to that later). I was talking to the dealer who was clad in black. He had piercings all over his face, he was rubbing his peircings back and forth and suggesting to me that they looked as if they were blending with his skin, as I thought that it happened. My straight edge friend walked in to the conversation on the other side of me, he was wearing all white and there was a lamp behind him. Suddenly Im talking to god and the devil (I was raised a Catholic so thats what I saw). The more I told them what I was thinking the darker the devils side of the room would get and the brighter gods side. The room was literally split in two, this trip was going great and I was having enlightening experience.</p><p>Then anxiety kicked in, I am very empathetic and tend to worry about things. Uninvited guests showed up, I tried to kicked them out (well, I actually shouted at them incoherently as someone else kicked them out as I would later find out). Two of my friends decided to go race the uninvited. This got me thinking, Oh no, there gonna crash oh no there gonna die, I was getting quite worried and my friends were laughing at me, everyone was staring at me, everyone was playing a trick on me. The more I thought emotionally about something the more amplified the feeling would get, I saved myself and shook my way from the paranoia knowing it was only the drugs that were doing it to me. I was still worried for my friends, and on top of this, my girlfriend was mad because I didnt want to be alone with her, I wanted to be in public savoring the amazing interaction I was having.</p><p>Its hard to explain, I had this feeling that I was living what already happened, like I would live a for 30 minutes, then jump back 15 minutes to live for another 30, it was an odd cycle that happened for most of the time. I would know what was gonna happen next. I wasnt sure if this was just me, or the people playing a trick on me. Meanwhile my girlfriend is breaking up with me or so I think (which honestly didn't worry me too much) I went go see her, we were alone in a room, she has a scared look on her face (which didnt add to my freaking). You took to much! she yells at me. I think right away, Oh no, I took to much? Im gonna die? she tells me to lie down and sleep it off, I was sweating, crying, worried to death that I was gonna die, I wasnt living, I was remembering, this was a dream. I was either dead, or I was gonna wake up at someone elses house. Was trying to sleep, and each time I woke up I would be in a different room, my girlfriends, my best friends, everywhere I didnt want to wake up, my parents were expecting me home.</p><p>I honestly thought that I wasnt living in present time, I was remembering the trip rather then living it, which is why I'd retake so many things, why I knew what would happen next. Then the walls around me shot up and I was in my grave my friends all around me looking at my corpse, what would my parents think, what would people think of them. I was honestly more worried about that then my own life, I wanted the trip to end, I didnt care how.  Then dreams crept in, I remember seeing the dealers face telling me that I actually ate a poison then laughing and turning to liquid ripping apart. I remember I kept calling for my girlfriend, she left me alone and i didnt need that I was crying, in a tomb, alone in a dark room. I somehow managed to call my mom and tell her (12ish am) that I wouldnt be coming home that night, I owe that to my girlfriend, who kept me stable enough for a time to do it.\t</p><p>I wasnt downing a bit but the trip was still in on route. I woke up alone but I had made peace with the situation, with myself. I had trouble with the kaleidoscope vision as I tried to find my shoes once I got off the bed, I got lost in my shirt trying to put it on, the sensations of the clothing seemed to stretch on forever, I maze of pathways for my arms to fit. I realized that I had to throw my shirt on quick, so I wouldnt have time to think and feel what I was doing, I managed to put my pants on the same way, as well as my shoes. I was so happy with my girlfriend, she had helped me as best she could, she brought me water, she comforted me when I thought Id lost control, there was a caring voice to keep me calm. I was very embarrassed with myself, I had always been the caregiver, I found out recently that everyone there had a bad trip, so many tears were shed.  As I lay in bed i could still feel my girlfrend's head resting on my arm when she left to go to the washroom, the walls moved softly, and stared at me with many faces, they were faint by this point, but still there.</p><p>The trip lasted me until four in the morning, so thats around 6 hours. I stared myself in the mirror for a while when it was all over and couldnt believe what I had been through, I think next time Ill be more prepared.</p><p>In conclusion, I realized that if I ever take shrooms again, I would have to be in a calm environment, with a few people, a place where I had nothing to worry about, not my way home, not my friends' safety, a place like where the Smurfs live. There was a lot more to my trip, I hope this small percentage helps someone out.</p><p>*things to make note of, for myself at least. </p><p>-Its all about circles, and spirals, dont over think anything, stay positive, the more you contemplate anything the more to that direction you will go.</p><p>-Be in a safe comfortable place.</p><p>-Enjoy it and dont abuse it.</p><p>-Its ok to cry :)</p>",
 "year": "1999",
 "id": "10465",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-09-15T07:00:00.000Z",
 "views": "5974",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
