{
 "id": 10472,
 "title": "Something Different",
 "date": {
  "submission": "2007-05-09T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "MarcusHL",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "2C-T-2"
  },
  {
   "time": "2:15",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Until yesterday I'd never met anyone who had tried it. I'd only read about it online and in Shulgin's books. Randomly I got some from a friend. I took it at about 4:15pm. Within 45 minutes I could feel something. Nothing too defined or interesting. A certain shine was noticable on surfaces, a general brightening of perception, and a bit of a mood lift. I was in that state for two and a half hours.",
  "I had almost given up hope of any kind of intense experience. At about +2:15 hours Dylan and I walked to some friends' house to pick up some weed. After waiting for the weed to get there and smoking a joint, we started walking home. It was at this point I noticed the full effects begin. Weed definitely intensifies the effects. I felt a bit jittery, but that was the only negative effect. In addition to that I felt a bit giddy and noticed some flowing of greys and yellows when I closed my eyes. A certain honesty in thought patterns was prevalent. Not only was I naturally guided to a sober and accurate assessment of my thoughts, I seemed to have no tolerance for hanging on to any illusions or delusions. This substance is very valuable for self-reflection.",
  "When we got home, we smoked some more weed and listened to music. It was at this point I noticed something that had been happening, with less intensity, almost since I took the pill. I had been noticing strange smells, not unpleasant but certainly something I had never smelled before. With the music turned up louder the smell got stronger, and I realized I had been smelling a sound, a note. This is called 'synesthesia'. It happens some times on psychedelic drugs. Personally I could count on one hand the times its happened to me before last night, but 2C-T-2 is known for causing it. Colour and form, both when I closed my eyes and when I had them open, shifted and changed depending on the sound I was listening to. It didn't happen constantly through the experience, but enough that I could examine what was happening. At several points I got the distinct impression that the Closed-Eye Visuals were liquidy or rubbery, stretching outward and then being pulled back into the center of my vision.",
  "I spent most of the night laying down and paying attention to my thoughts and the sensory effects. The CEV's were quite beautiful. I could change them and control them to a certain extent. Lots of fine, colourful lines flowing inward and outward. Some faces and recognizable objects, but all looking like they were lit from inside with a soft, diffuse, colourful light.",
  "Side effects included some nausea, and light-headedness, and I got a pretty nasty headache as I came down that lasted till the morning. However, I'm coming down with a cold, so that probably contributed to the headache.",
  "I will certainly try 2C-T-2 again, probably at a higher dose. It was rather intense at times, but I think the danger of confusing or scaring oneself at higher doses of 2C-T-2 is less so than with a large dose of, say, LSD or Psilocybin. I'm told there's quite a bit more of this stuff available.",
  "Three days after trip: I still feel quite good about the experience. There is something matter-of-fact about it. Its somehow less other-worldly than LSD or Psilocybin. Its there, its happening to me. I'd call my first experience a good +++ on the Shulgin scale. Though I wasn't blown away, I can imagine how an experience with 2C-T-2 would reach a ++++. I look forward to trying it again."
 ],
 "erowid": {
  "id": "62253",
  "citation": " MarcusHL. \"Something Different: experience with 2C-T-2 & Cannabis (ID 62253)\". Erowid.org. May 9, 2007. erowid.org/exp/62253",
  "substance": "2C-T-2 & Cannabis",
  "views": "6217"
 }
}
