{
 "id": 10479,
 "title": "Taking Off, Flying, Crashing",
 "date": {
  "submission": "2007-07-25T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HSixtyFour",
  "gender": "Male",
  "weight": 120
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Propylhexedrine"
  },
  {
   "time": "0",
   "amount": "T+ 0:45",
   "administration": "250 mg",
   "substance": "oral"
  },
  {
   "time": "Pharms - Propylhexedrine",
   "administration": "T+ 0:45",
   "substance": "2 shots"
  },
  {
   "time": "oral",
   "amount": "Alcohol - Hard",
   "administration": "(liquid)",
   "substance": "T+ 1:25"
  },
  {
   "time": "8 oz",
   "amount": "oral",
   "administration": "Caffeine",
   "substance": "(liquid)"
  }
 ],
 "report": [
  "I read about this stuff on the internet a year ago, when I used a mix of Adderall, alcohol, and marijuana every weekend. About a year later, I stopped using Adderall, and I've slowed down and cut back a bit on weed and booze, but decided to give this a try.",
  "10:00 PM",
  "Weed connects fell through, again. Not a whole of alcohol in the house. I decided to try some of this Benzedrex stuff. I took it apart, I ate the cotton, despite a couple stories I've read advising me not to. I chewed and sucked on the cotton and got a big gulp of milk while it was in my mouth before swallowing it. Kinda nasty stuff, but not as nasty as some stories have said.",
  "10:30 PM",
  "It's been almost 30 minutes since I ate it. No burps, minimal stomach burning (this is on a full stomach), somewhat increase in sound sensitivity, nose is a little runny.",
  "10:35 PM",
  "Mild stimulation, sweating, tingles, cold air feels refreshing, a slight thirst, everything feels slightly better with music. Waves of nausea are only minimally noticeable.",
  "10:45 PM",
  "I take another cotton rod with more milk. Afterward I have 2 shots of tequila.",
  "11:00 PM",
  "Stimulation, sound sensitivity, and good feelings increasing a bit. Breathing is feels easier and better, like I'm getting more oxygen in my lungs every breath. Mild euphoria is kicking in a bit. Body tingles, mild dry mouth, some increase in libido. Music sounds so good right now. Peaceful stimulation and mental clarity increasing by the minute.",
  "11:25 PM",
  "I feel incredibly good. Great euphoria, mental clarity, stress-free meditative feelings, pleasurable tingles throughout my entire body, some numbness, postive outlook, pleasurable increase in sound sensitivity, increased libido, easier breathing that feels like I'm breathing in pure oxygen, and notably increased creativity and imagination.",
  "Only bad effects are mild dry mouth (water helps, I also drank a can of Coke at one point), mild dry eyes, menthol burps, nausea is minimal but somewhat noticeable, increased urination, runny nose, increased sweating, increased heart rate, decreased typing accuracy (I'm on the computer IMing my friend and writing a story/script as well).",
  "12:25 AM",
  "I seem to have leveled out a bit.",
  "1:35 AM",
  "I almost can't tell if I'm still leveled out or if I'm slowly starting to come down already.",
  "2:15 AM",
  "The euphoria has faded away considerably. I still have some tingles and numbness. Focus and clarity have decreased, as well as the sound sensitivity and libido. The bad effects have decreased as well. My nose is still running. That 'easier breathing' thing has decreased and feels less enjoyable than it did around 11:25. I am drenched in sweat.",
  "2:20 AM",
  "Spacing out.",
  "2:30 AM",
  "I've come down a little hard. Writer's block, some dysphoria and loneliness.",
  "2:35 AM",
  "Dysphoria less intense, the tingles and numbness are gone. Relaxation and lethargy come. I fall asleep shortly afterward."
 ],
 "erowid": {
  "id": "62277",
  "citation": " HSixtyFour. \"Taking Off, Flying, Crashing: experience with Propylhexedrine, Alcohol & Caffeine (ID 62277)\". Erowid.org. Jul 25, 2007. erowid.org/exp/62277",
  "substance": "Propylhexedrine, Alcohol & Caffeine",
  "views": "20636"
 }
}
