{
 "id": 10473,
 "title": "The World Experienced via Freudian Pessimism",
 "date": {
  "submission": "2009-04-16T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "zackc",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.77",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "Consumed 1/16 oz of psilocybin mushrooms at approximately 10am (mixed with some m&s, which effectively covered the taste of the shrooms). This was my first experience with the drug. Initially there was only a slight giddiness, some giggles and strange ideas. Then, about 25 minutes after ingestion, colors became more vivid. Colors around my peripherals began to swirl. Slight visual distortion in other matters. After looking at the strong light reflection from a CD, I closed my eyes, and the colors stuck in my vision and moved around. About 45 minutes into it, we left my house. Crossing the street was strange, the wind tickled. Not long after getting into my friends house, my spatial reasoning declined. My perception of space was terribly skewed. I put music on, but I didnt feel the closeness to it the way I do after smoking weed. This slightly disappointed me. But then I started to look at the patterns on my friends wallpaper. It was basically just a bunch of vertical lines. As I looked at them, they began to breathe, expand and contract, and even move from side to side. At one point I saw a lamp in my peripherals, and it swiveled around and stared at my inquiringly. When I turned to look at it, though, it was back in its normal place.",
  "At about one hour after consumption I started to look in a mirror. I forgot the mirror was there and saw  the person in the mirror as if it was not me. At one point I felt hostile towards my image, it seemed to be taunting me. So I dove at it, but it did not work for obvious reasons. I continued to stare, and as I did so the image of my face became a puddle. My eyes started to drift to the sides, my mouth started to sag down. I crawled in closer and closer, feeling for some reason as if I could communicate with the creature in the mirror. When I got within just a few inches of it, the face became extremely menacing. I jumped back and ran down the steps in fright. I went down into the basement, where my friends were. I kept thinking that a pile of blankets on the couch opposite me was a person. Our sitter began to make jokes, but this slightly bothered me. I felt like I needed to take a prayerful, serious attitude. I became extremely introspective. Finally I got tired of his jests and I decided to take a walk. I called my friend while I walked, and told her about my experience. Apparently my voice sounded shaken, because she kept telling me to calm down. A dreamy sensation overcame me, and the sidewalk seemed like it became a treadmill, and I felt as if I was going nowhere.",
  "As I walked I remembered two bad dreams Id had the night before: In the first, some hostile nation had dropped an atomic bomb on our city, and in the other I had gotten into my math class to see that I had a math test which I had forgotten about, and in anger I had stabbed myself in the stomach with a pencil, but nobody noticed so I proceeded to take the test. After recalling the dreams, everything around me became slightly threatening. There were only a few clouds in the sky, and for some inexplicable reason this aroused in me a latent terror. I walked faster, regretting that I had left by myself. I finally got to my friends door, but waited a minute to keep talking before going inside. As I stood outside on the phone, though, my thoughts became increasingly negative. A few recurring ideas antagonized me: the first, that I was a bomb about to explode, and the second, that there was so much more negative emotion in the world, that it would eventually cave in on itself. After getting off the phone I went inside. My friend who had also taken the shrooms (Geoff) was playing with his eyeball, and I saw that it was extremely red. This frightened me, so I told him to knock it the fuck off. I went into his bathroom and looked at myself in that mirror. I became extremely angry towards the person therein.",
  "After a few moments I turned away, looking at the wall. As I did so, what looked like webs of reality crossed my vision. This gave me the terrifying idea that the fabric of reality was about to shatter. I tried to brush the webs away. It worked, momentarily, but as soon as I stopped waving them away they would reappear. The terror in me became intense. I curled into a ball, wanting it to end. The bathroom door assumed an intimidating pose. I opened the door and left, thinking maybe I would feel better if I was with my friends. Jeff was having fun, drawing. He showed me what he had drawn, and it was a ghostly face. This scared me even more, and I sat on the couch opposite them. As I did so, the panic in me became even more intense. I curled into a ball again, and started to get extremely negative ideas of lifes pointlessness. I started to whimper, and when my friends asked me if I was alright, I said I dont know what the fuck Im alive for. This slightly scared them, but they knew there was nothing they could really do. What scared me the most was that Geoff was nearly fine by this point, so I thought it wasnt just a bad trip, but that the thoughts I was having were legitimate.",
  "I went upstairs, thinking a warmer environment might make me feel better. Geoffs brother was there, making food. I tried to talk to him to get my mind off the thoughts, but it was unsuccessful. I realized I wouldnt find any comfort in my friends house, so I decided to go home. While crossing the street I saw my reflection in a cars tinted windows. I turned away, in fear and revulsion. When I got into my house, I tried to act normal. I laid on the couch and watched television for a few minutes. But my mood grew increasingly worse. By this point, I had a true desire to die. I felt as if I was seeing reality in all its truth, without any preconceptions or rationalizations. I perceived humanity as a creature that did everything solely for its own existence. Humans were slaves to genes, which created our bodies to hold them. And we, as slaves to our genes, want nothing more than the liberation of an unexpected death. If we expect death, then our genes make us flee from it. And since we are stuck in this reality, we are forced to keep ourselves alive. All our pastimes and hobbies are just distractions that we create for ourselves to forget our own existence. It was basically if Freuds ideas were combined with an unrelenting pessimism and hopelessness.",
  "I decided to get a shower, still convinced that acting normally would help me get over it. When I got naked, though, I saw my penis, and perceived it as a complete Freudian, an instrument of reproduction, a valve from which spews more viral, human poison. I even tried putting relaxing music on while I was in the shower. But again I perceived it as just a pastime to help me forget my own miserable existence. I got out of the shower and went to my room. I looked at the clock and saw that it was only noon, though it felt as if several hours had passed. Still dripping wet, I laid in my bed, curled in the fetal position, and tried to sleep. I felt nauseous at my own bodys complexion, not in an insecure way, but through the perception that it was the housing facility of a gene that only wished its own propagation, one six-billionth of the human germ. Unable to take it any longer, I forced myself to vomit, and laid down again, trying to sleep. I called another friend, who stayed on the phone with me for an hour, until the heavy clouds of hallucinogenic-induced negativity had passed.",
  "This was hands-down the worst experience of my life. I may try psilocybin shrooms again in the future, but if I do, it will definitely be less than I had, and will steadily build myself up to try a full 8th. Maybe Ill take it with a perc or weed too, to ensure that I dont experience the same agonizing depression. ",
  "I am a common weed-smoker. Since I started smoking weed, I continually experience a few minutes each day where I feel disconnected from reality. I still act normally at these times, but I feel as if there is a separate Self within me that is not really interacting with the environment. Before my experiment with the shrooms, these moments didnt bother me, sometimes even being slightly amused by them. But since that day, whenever I feel this depersonalization it is coupled with a latent sentiment of dread. It has now been about two weeks since the incident, and this trend is not recanting itself. If it continues I might even withdraw from pot, until (if) I stop experiencing these bouts of deathly negativity."
 ],
 "erowid": {
  "id": "62256",
  "citation": " zackc. \"The World Experienced via Freudian Pessimism: experience with Mushrooms (ID 62256)\". Erowid.org. Apr 16, 2009. erowid.org/exp/62256",
  "substance": "Mushrooms",
  "views": "10371"
 }
}
