{
 "id": 10476,
 "title": "Walking Towards the Sky",
 "date": {
  "submission": "2009-10-17T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sam44",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "I came down from my 4th, and strongest experience with salvia around 15 minutes ago. I used roughly 1/10th of a gram of 10x extract. Beforehand, I left from my house to the nearby woods and found a comfy spot near a patch of flowers beside a small brook. I sat down, and inhaled all of the smoke in one long hit and held it for around 25 seconds.",
  "The Experience:",
  "As I exhaled, I laid down, staring at the bright blue sky, framed on all sides by treetops. Suddenly, the world seemed to turn upside-down. The sky wasn't above me anymore, it was right in front of me, the trees made a tunnel that I walked through towards it.  It was as if the trees were knocked over, laid on thier sides. I felt like I could have walked up one of them if I wanted. I was floating. At this point I tried fruitlessly to maintain a grip on reality, as I turned my head from side to side, I realized that I was in a completely foreign world, I felt like I could never go back, like it would be that way forever. I continued trying to reach the sky with no avail.",
  "I closed my eyes, then opened them and noted that there was absolutley no difference. It was then that the world began to fold in on itself. The whole universe was two diagonal lines, crossing each others path, morphing and folding over where they intersected, and I was right in the middle of this grand spectacle. I was connected to one of the lines, bending and changing with it. This faded away and I began to percieve reality again.",
  "I clumsily sat up and looked at the ground. There were vauge faces on all the blades of grass, forming a sort of pathway towards a nearby flower bed. They beconed me to follow them, and I felt extremely compelled to do so. I started to crawl along the path, until I put my hand down on a dead branch from a rose bush. I picked it up, but I couldn't comprehend what it was, it was utterly foreign. It was like all objects weren't connected to language, like I was an infant looking at it for the very first time. I was sitting there, playing with it and poking the thorns, when I suddenly realized what it was. I threw it down and examined my hand, which appeared to be free of injury.",
  "After this minor setback I continued towards the yellow flowers. They were smiling at me. I touched one of the flowers, then suddenly I pulled up and picked the flower from the stem. As I was pulling it seemed like the flower was screaming in agony, I wanted to stop but it was too late. The remaining stem was in its last throws of death, moaning and twitching. I didn't actually hear it, but I knew it was happening. I looked down at the flower in my hand, on the verge of tears. I felt terrible, like a murderer. I whispered to the flower 'I'll take care of you... I promise I'll take care of you.'",
  "I looked up at the sky. The branches of the tree were blowing in the wind, but the sections of sky around them were somehow connected, and were moving too. By this point I was coming down. I stood up and was very, very off balance. I wandered back through the woods, twoards my house, flower still in hand. Nature was beautiful, the grass seemed greener, the sky brighter. I felt very connected to nature, and felt love for everything and everyone around me. I stopped near a small brook and watched the water flow for a few minutes before returning to my house, feeling refreshed and at peace. I set the flower in a small vase with some water, feeling relieved that I had carried out my promise. The flower is sitting beside me right now.",
  "Retrospective:",
  "All in all, it was a beautiful experience, one of my best salvia trips so far. I wouldn't say any part of the experience was scary, or tense. Being in the woods was a great enhancer for the trip, and I'll make sure to do it again."
 ],
 "erowid": {
  "id": "62267",
  "citation": " Sam44. \"Walking Towards the Sky: experience with Salvia divinorum (10x extract) (ID 62267)\". Erowid.org. Oct 17, 2009. erowid.org/exp/62267",
  "substance": "Salvia divinorum (10x extract)",
  "views": "2163"
 }
}
