{
 "id": 10485,
 "title": "A Pleasant Surprise",
 "date": {
  "submission": "2010-08-29T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Circlerunner",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "After reading the other accounts concerning Seroquel, I wondered what sort of experience I would have on it. I had already bought the pills from a friend of mine who had been prescribed them and 'didn't need them anymore' (he was diagnosed as bipolar). He had described the experience as feeling 'drunk and high.' I decided to take his word for it.",
  "First, I will account for what I ate before the experience, which occurred on a Saturday. I ate breakfast, didn't have lunch or dinner. Rather I snacked throughout the day. At around 4 pm, my friends and I took some hits of cannabis. We chilled out around my friend's house and ate some food (chips). At around 10-11 I consumed some chocolate and then had a Diet Pepsi. I'm not sure how much caffeine is involved in either foods, but I figured I should make note of them here. At around 11:30pm-12:30am we smoked again. I smoked more than I did last time and was so high at first that I had to sit down after standing for a while because I thought I was going to pass out/fall over.",
  "At 1am, I took half of a 100mg Seroquel pill because my friend had instructed me to not take the entire pill in case it had bad effects on me. I bit the pill in half because the razor I had was not working well, I took the smaller half of the pill so it may have been a tiny bit less than 50mg. I think I ate two chocolate chip cookies after taking the Seroquel. I suppose I should also note that I was in a good mood prior to taking the Seroquel.",
  "At around 1:20ish, I began to notice some changes. My vision was starting to blur. As time passed, it blurred a bit more. I have an astigmatism, but I know this was not my astigmatism 'acting up.' Some of the colors seemed to run together and bleed off the sides of the TV screen as the light blurred off of it. I felt like my eyes were wide open (but later my eyelids became heavier). I became quite focused on the TV to the point where my vision became completely unfocused and I would start becoming scared because it felt like I was going blind. I experienced some closed eyed visuals when I'd close my eyes to break my focus on the TV.",
  "Around 1:40ish, the effects continued to intensify. I could feel muscles twitching in my body and my hands were tingling. I was holding my cell phone in one hand, hardly aware that it was there, yet for some reason it felt so great in my hand. I was also dizzy, but in a good way, as if I were drunk. When I closed my eyes I felt like I was on a boat or something being rocked around. Once when I tried to speak I realized the my tongue felt 'heavy' and I was slurring my words a bit--but I only realized that until I heard my friend (who had also smoked and taken the seroquel) started slurring her words around the same time as me.",
  "Around 2am, we turned on music videos on TV. The music sounded truly amazing even if it was a type of music I hated. At this point, sleep was becoming harder to fight. I think I went to sleep around 2:20ish or so. I feel as if I slept lightly that night even though I did not wake up once during the night, until the morning came with my car alarm going off...each time I woke up though in the morning (around 9:30am) I easily fell back to sleep. I know I dreamt when I slept, but it was nothing particularly vivid.",
  "The next day I was kind of spaced out and was still having a little bit of difficulty forming sentences when talking with some people. Maybe it was from a lack of sleep or not enough food, or maybe it was because of the seroquel (or a combination of all of these), but I almost passed out while standing for a while when I was at church at my parent's request. Other than this, the 'hang over' hasn't been too bad. As for my friends who took it, they took it a half an hour after I took mine and then they fell asleep at around the same time I did so they did not get to experience the effects as much.",
  "In general, I felt as though I were on ecstasy..and yet at the same time drunk without alcohol clouding the mind effects of x since I felt dizzy/off balance and such (like being drunk) but also feeling pretty happy, relaxed, and enjoying sensory things (like being high on x). Overall, I was pleasantly surprised by my good experience with seroquel."
 ],
 "erowid": {
  "id": "62298",
  "citation": " Circlerunner. \"A Pleasant Surprise: experience with Quetiapine (Seroquel) (ID 62298)\". Erowid.org. Aug 29, 2010. erowid.org/exp/62298",
  "substance": "Quetiapine (Seroquel)",
  "views": "41930"
 }
}
