{
 "id": 10480,
 "title": "Just Do It!",
 "date": {
  "submission": "2002-02-18T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Nate",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "<p>This is what I learned from my seven year experience. I was the ring leader in my city when it came to robo.  My first time was back in 1991, I was a Jr in high school. I did it everyday and I talked hundreds of others into doing it.  I lived in conservative Utah and grew up in a strong LDS (not LSD) home.  I was taught not to drink, smoke, or do drugs.  So when a friend told me I could feel high from my dad's cold medicine, I was excited to give it a try.  (stupid me) I loved it.",
  "This started me on a seven year rampage of promoting robo, drixoral, coricidin, and pure DXM. I was the main promoter of this so called harmless drug.  For this I am sorry because I still have friends and a twin brother who's lives are at a stand still.  My twin also developed pancreatitis and it is hard to be around him because he is still in bad shape.  I love my brother and I know I was the one that talked him into it in the first place.  He thinks he can't quit DXM and drinking even though our Dr says he will die if he keeps using.  I don't care how 'bad ass' and tough you think you are, you can't help but be in hell when your brother is killing himself with the same crap you spent six months convincing him to do.  As a former DXM user I know I realy could have cared less while I was doing drugs, but now I'm sober it hurts bad. I am not trying to preach, just to share info.  I wish this site would have been up in 1993.  Maybe I cold have read the part about brain dammage and quit soon enough that I could still spell like a normal 26 year old.  (I have been sober for 3 years and still feel like a third grader when it comes to grammer.)",
  "My heart goes out to the mother who lost her son.  Also I feel for the mom and dads who's kids don't die but they still loose them to their new masters like DXM and other drugs.",
  "I belive information is good, I plan to teach my children both sides of the story.  I will even use this web site. They might still be tempted at first when I tell them the fire is hot, but after I show them pictures of people burning alive, they might have enough information to resist the temptation.</p>"
 ],
 "erowid": {
  "id": "6228",
  "citation": " Nate. \"Just Do It!: experience with DXM (ID 6228)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6228",
  "substance": "DXM",
  "views": "23486"
 }
}
