{
 "id": 10498,
 "title": "Curled Up in a Ball",
 "date": {
  "submission": "2009-10-04T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Doggie",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400",
    "grams": 0.4
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "80",
    "grams": 0.08
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "3200",
    "grams": 3.2
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "glasses",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  }
 ],
 "report": [
  "[Erowid Note: 3600 mgs + of Caffeine is considered an extremely high dose, see Caffeine Dose Chart]",
  "I don't know why but one Friday night me and a couple friends decided it would be cool to ingest mass amounts of caffeine. We took 2 NoDoz each and realized it did nothing and drank some Red Bull. When we again felt nuthing we took more and I ended up taking 18 pills and drink 3 different energy drinks.",
  "We went into a store and I felt as if I was cutting through the air and moving extremely fast when I was simply walking. We met up with other friends while there and decided to go to one of their houses. I had to make the person driving me stop and pull over so I could throw up because I felt terrible. Then I thought I was fine. But I definatley was not.",
  "We got to the house about 2 blocks away and I began to feel extremely sick. I went outside to puke and ended up curling up in a ball and sitting in the driveway. Everything seemed so unreal at the time. I got home and threw up all night. I had nuthing in my stomach but I was just throwing up what I thought was blood or the lining of my stomach. I couldn't say anything to my mom or anyone because I didn't want to get in trouble for being so stupid.",
  "So for the rest of the weekend I lied in bed and vomited. Finally on Sunday I stopped puking and was keeping liquid down. Mostly water because anything else burned going down because my throat was destroyed. The sick feeling last for about another 2 weeks and still to this day I can't drink energy drinks or even smell them without getting sick. I don't care what anyone says I would never touch NoDoz again."
 ],
 "erowid": {
  "id": "62367",
  "citation": " Doggie. \"Curled Up in a Ball: experience with Caffeine (ID 62367)\". Erowid.org. Oct 4, 2009. erowid.org/exp/62367",
  "substance": "Caffeine",
  "views": "5516"
 }
}
