{
 "id": 10491,
 "title": "The Beatles Experience",
 "date": {
  "submission": "2002-02-17T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Elly",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "gel tab"
  }
 ],
 "report": [
  "We were in class one day, me, my friend Idi, and her boyfriend Chris. We were all talking about what we were gonna do this weekend and we all pretty much had nothing to do so Chris asked us if we wanted to smoke pot. I had never done it and was pretty curious about it so me and idi agreed on it. Later on that day, Chris said that we should all trip on acid. Idi and I had never tried that and Ive always been really curious and interested in hallucinogens so we agreed on that too. I was really excited and couldn't wait till Friday night.",
  "The plan was...our friend lilia which has a car was gonna be our chaperone. She was gonna pick us up and take us to the mall, at the mall we were gonna drop the acid gellies and go to the Imax theatre which is a 3d theatre. Anyway, she ended up selling us out so we were all stranded at idi's house with 30 bucks worth or weed and 6 hits of acid. We really didn't wanna wait to do it so we decided to just do it at idi's house.",
  "Around 5:30 PM, we all walked to the field of an elementary school nearby and smoked the blunt we had. I got really high off the weed. I was really relaxed and felt like if I was floating and obviously it screwed with my judgement because before we left idi's house, I promised myself that I wasn't gonna drop the gellies until we got back to idi's house because I didn't wanna cross any streets while I was tripping, well, I ended up dropping them anyways, 2 blue hits of acid gellies.",
  "We all dropped them and started walking to a grocery store to buy some munchies. We got a shit load of food and while we were in line to pay for our food, I realized that it was hitting me. All of a sudden, my heart started racing and I looked down at my chest and it literally looked like if my heart was gonna pop out. I freaked out and started walking out of the grocery store with my friends. On the way out though, there was a mirror, and I looked at myself and I looked disgusting. I looked like a corpse, I was extremely pale and I could see my vains clearly, they were bulging and my eyes seemed to get bigger and smaller.",
  "So anyway, we left and started walking back to her house. On the way over there, we encountered a real busy street, there were lots of cars and I was afraid to cross. At first the cars would seem to be real far away, and in an instant they were right in front of me, but they would stay in front of me for a long time, and they would stretch real long too, and once again, in an instant, with the blink of an eye, they weren't there anymore, they were at the far end of the street. When I saw that there were no cars in sight, no lights what so ever, I crossed as fast as I could. When we finally got to idi's house, it was around 6:15. Idi and I went to her room and waited for Chris, he was preparing everything we wanted in the kitchen. The orange juice, because supposedly vitamin c enhances your trip on acid, and food, just in case we got hungry.",
  "Chris left us alone in the room probably for about 5 minutes, but for me, it felt like an hour. Idi and I were walking around in her room, we had totally forgotten about Chris, and we were laughing our asses off. For no reason at all, we would just look at each other and start laughing. Everything also seemed to be foggy. It was weird though because I felt like if I was on the outside looking at idi and I trip out. I guess what you call an 'out of body experience.'",
  "Finally, Chris got to the room and he just sat on the bed with us, for a long while, we just sat there laughing and looking around the room and I couldn't stop looking at the clock. I looked and it said 7:15, then it seemed like if half an hour passed by and I looked at the clock again and it was only 7:17. My time perception was totally screwed up. Then, I dont who and I dont know at what time, because I was completely out of it and it seems as if I lost consciousness for a while, not literally, but meaning the drug took total control over my mind and body, someone popped in the new Beatles CD in and we started listening to it.",
  "It totally mellowed us out and it was the coolest psychedelic experience ever. While we were listening to them, I seemed to be in an animated world, there were sparkly, glittery trails all over the place, amazingly colorful patterns splashed all over the walls and floor, even on my friends faces at times and the patterns seemed to be moving at the beat of the music. Also, the music sounded incredibly beautiful, it totally invaded my ears. At the beginning of each song, the sound was really low and I would try to concentrate to hear the music better but little by little it would get louder and louder until it felt like if I was at a concert, and when it would be getting louder, an imaginary stereo would appear in front of my face and I would see the volume button turning by itself.",
  "Also, at one point, my body started tingling kind of at the beat of the music and I started to stare at the radio and I saw musical notes and butterflies coming out of the speaker. We spent most of our peak listening to the Beatles CD. When a fast, happy song like 'penny lane' would play, nice memories of my past popped into my head and I thought positively. I felt pure ecstasy. It was like if I was in my idea of what my utopia would be like. And my surroundings were bright, colorful, and sparkly, and also, the walls and doors were 'breathing' but then, when a sad, depressing song like 'let it be' or 'yesterday' would play, everything changed. I would think of very depressing memories and I would feel really down. I would think of death and suicide. And also, my surroundings changed completely. Everything was dark and gloomy and objects like the TV or the mirror would melt. In times like that, I really wanted my trip to end, it scared the shit out of me. But I just thought to myself that it wasn't gonna stay like that for the rest of the trip and that it'll soon be over.",
  "After the Beatles CD ended, someone popped Disneys Aladdin in the VCR and we started watching it. I don't really recall watching the movie step by step, I guess my mind drifted off into another dimension. All I remember is the little monkey from the movie, Abu coming out of the TV and jumping on Chris' head. It was hilarious, I started laughing like crazy.....Before I knew it, it was 11:30 and idi's parents wanted to go to sleep so her mom took me home. I only live a few blocks from idi and it usually takes like 5 minutes to get to my house and to me, it seemed like 45 minutes. even though my peak was over, I was still kinda' tripping. When I walked in my house, I got extremely paranoid. I thought my parents were gonna notice that I was on drugs so I rushed to my room and thankfully they didn't notice.",
  "I tried to go to sleep because I was really sleepy but I couldn't. My back would bother when I would lay down so I just sat up and started watching cartoons. It was funny because even though my peak was over, my vision was still 'tripping.' the cartoons were kinda 3d and the TV was 'breathing.' also, the tiles on the floor seemed like if they were floating on black sea. After a while, all the effects from the acid completely stopped and I ended up going to sleep like at 5:00 am. The next day I woke up like around 4:00 PM and I was totally 'pookied-out.' I didn't want to get out of bed. I just wanted to lay down all day, just sleep forever....anywayz, I absolutely loved and enjoyed my experience while 'tripping nuts.' it was amazing. I think it's awesome, how everything changes, all of your senses are altered, you see and hallucinate beautiful things, your body tingles, the music you listen to sounds heaven sent, and what you eat is much more tastier than usual. Its just great, and I won't think twice about doing it again, and I totally recommend it to all those who are curious about it."
 ],
 "erowid": {
  "id": "6233",
  "citation": " Elly. \"The Beatles Experience: experience with LSD (ID 6233)\". Erowid.org. Feb 17, 2002. erowid.org/exp/6233",
  "substance": "LSD",
  "views": "9184"
 }
}
