{
 "id": 1050,
 "title": "BZP & TFMPP Not as bad as I expected",
 "date": {
  "submission": "2002-06-19T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Sweatyb",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP"
  },
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Piperazines - TFMPP"
  }
 ],
 "report": [
  "<p>Here's the deal I have 2 weeks off in between jobs with nothing better to do than experiment with some strange ass compounds.",
  "I have tried BZP by itself on numerous occassions from ranges of 50 to 400 mg. doses. I have grown to like this substance and have never (knock on wood) experienced any of the terrible hangover effects reported by so many others, rather, a handful of others. I have never, until today, tried TFMPP in combination with BZP. I had never went the TFMPP route because of the negative feedback I saw from others in there trip reports, etc... but, being the brave sole I am I decided to try it.",
  "-10:00AM Measured out 200mgs BZP and 100 mgs. TFMPP put into gelcap.",
  "-10:01AM Down the hatch, why hesitate and think of reasons not to do it?!",
  "-10:50AM Feeling that familiar tingly energy rush I associate with BZP, only this time it is a little different.",
  "-11:15AM The TFMPP seems to have overshadowed the BZP rush and set in with its own distinct effects. I am feeling slightly trippy and cold. Amazing skin and tactile sensations. Overall a pleasent state, but, to somone who never tripped before it could be overwhelming.",
  "-12:00PM I can see where people can compare this to MDMA. The physical sensations are all definately there but it 'does' lack the empathy effect of MDMA. In the right setting this could be lots of fun. By the way, my setting is alone in my condo playing on the computer and watching CNBC. Fun stuff, I know.",
  "-12:30PM Still full on effects. I had to wrap a blanket around my self because I am so damn cold! I also have some serious dry mouth. Nothing a huge amount of ice water in a 44oz Mountain Dew gas station cup can't handle!",
  "-1:00PM Still the same. No decrease in intensity or feeling of coming down yet. This is actually a very nice combo IMHO. The only negatives so far were a little anxiety and slight nasuea in the first hour or so. They have totally dissipated at this point.",
  "-1:40PM Feel like I could have reached the peak and started that descent downward to baseline. Well, If there are anymore interesting things to report I will do so at a later date/time.",
  "Overall, I must say that this was a positive experience. The TFMPP is definately a bit trippy. Nothing like LSD or shrooms, but, slightly psychedelic. I didn't see any bright colors or anything , but, I knew I was off baseline (possibly a +1 or + 1/2 on the Shulgin scale). I would reccommend trying this in a small social setting the first time. I think the dose was perfect, but, I am a six foot 195lb male so adjust accordingly. Have fun and be safe!",
  "The Sweaty One.....</p>"
 ],
 "erowid": {
  "id": "13062",
  "citation": " Sweatyb. \"BZP & TFMPP Not as bad as I expected: experience with BZP & TFMPP (ID 13062)\". Erowid.org. Jun 19, 2002. erowid.org/exp/13062",
  "substance": "BZP & TFMPP",
  "views": "17397"
 }
}
