{
 "id": 10501,
 "title": "Threw Away Life in Exchange for It",
 "date": {
  "submission": "2009-03-05T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "summer dream",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Heroin",
   "form": "(daily)"
  }
 ],
 "report": [
  "I live in Serbia, I have no job, I am 23, I have money and a so much time that I don't know how to spend it.",
  "After some period of abstinence, I am buying 50g of Heroin. I am taking it all three ways: smoking, snorting, I.V. I am taking it whenever it falls on my mind (very often)",
  "during the day, and I am waking up during the nite to take it.",
  "The time is passing by, I am loosing friends, destroying family and nice relationships, buying and buying, taking and taking, 50g by 50g, day by day, week by week, month by month. Loosing girlfriend, almost every friend, do nothing, lying on the bed with cigarette which falls down and make holes in every single blanket in the apartment, make holes in clothes, stop shaving myself, rarely going under the shower, stopped to wash my teeth. I am fast going down, loosing weight from 88kg to 65kg in that long period of 7 months, and so on...",
  "NEWS: I got no more money!",
  "After that moment the hell is heaven for what happened to me: diarrea, puking, coldness, paranoia, falling in bed for one week in worst physical and mental pain, shaking and shivering under the five warmest blankets (with holes), and when I finally get up then I have run to get some. Again in bed... Again up, again run. Again to bed... But finally i stop using it!",
  "I still love H more then anything in the all world, but by the time the love is fading away, time is cure for everything, and I said on the beginning that I have plenty of it.",
  "H brings misery in my life. Misery that I have never felt before!"
 ],
 "erowid": {
  "id": "62392",
  "citation": " summer dream. \"Threw Away Life in Exchange for It: experience with Heroin (ID 62392)\". Erowid.org. Mar 5, 2009. erowid.org/exp/62392",
  "substance": "Heroin",
  "views": "6409"
 }
}
