{
 "title": "Auditory Repetitions",
 "author": "Malawi",
 "citation": " Malawi. \"Auditory Repetitions: experience with Heimia salicifolia (ID 10501)\". Erowid.org. Nov 13, 2001. erowid.org/exp/10501",
 "substance": "Heimia salicifolia",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "6.0 g",
   "oral",
   "Heimia salicifolia",
   "(tea)"
  ]
 ],
 "report": "<p>\nThis was my first experience (and last) with Sinicuichi:</p><p>Mindset:</p><p>I expected this herb to change the proportion of the room in  appearance, to dim my vision, cause me to be cold, give auditory hallucinations, give me vivid memories of the past, and a calm euphoric feeling.  There is much concurrent validity among sources on these effects, so I expected this would be at least a mild 'trip.'</p><p>Setting:  A quiet apartment, alone</p><p>Preparation:  The herb was bought and already a bit wilted.  6 grams of sinicuichi were infused in 2 cups of water for 15 minutes. This was laid out in the sun to ferment for eight daylit hours with Saran wrap over the two cups.</p><p>6:50pm:  Drank the two cups over 23 minutes.  It had no taste, but the bitterness was barely bearable.  With every sip, my cheeks pushed in, my nose scrunched up, my mouth opened, my eyebrows came down, and my whole face contorted that of a rabid dog.  But the point is that I got it down regardless.  Many feelings of nausea afflicted me, but only during the drinking process.  I took two breaks to let those feelings calm down before continuing.  Lemon juice was added and helped a little.</p><p>No effects whatsoever.</p><p>3:30am</p><p>I was woken in the middle of the night by the sound of the train going by far off blowing its horn (as it normally does and occasionally I awaken to it).  But the train horn sound had digital delay on it, a musical effect where the sound echoes over and over.  I was in a pleasant slightly dazed state, but that I accredit mostly to being half awake and half asleep at 3:30am.  I stayed in this half-and-half state for a half an hour.  I did feel good emotionally though, very comfortable, but maybe I can attest this to simply warm covers on a cold night and laying down when sleepy.</p><p>I heard someone start their car fifty times (which I doubt actually occurred more than once), and drive it off five times, but it was very low in audibility. </p><p>Finally, I heard the train tracks behind/beside me, when the train is way down the street in front of me; over and over the train seemed to go by the tracks, even after the horn stopped (meaning the train was no longer there).  These are not auditory hallucinations to me, but are simply the repeated hearing of the same sound.  Or, rather, they are not psychogenic, the sounds were born of the environment. I was in such a state of tiredness, combined with the suggestiveness of maybe waking up and hearing something like another account stated, combined with WANTING the herb to work, that I cannot say any of the above is anything more than a placebo effect, in other words the same as if I hadnt taken the herb but thought I had taken it.</p><p>Two days later: </p><p>Looking back, I am VERY sure the herb caused the above effects of auditory repetitions and maybe part of the comforting pleasantness I felt in bed.  Furthermore, I have slept very well the last two nights (slightly better than usual it seems).</p><p>There werent many sounds at all at that time of the night.  I remember speaking to try to induce the effect, but that didnt work.  It seemed only far off sounds were duplicated.  Nonetheless, I can thank the herb for almost throwing up, a stuck-record train horn, seven dollars less in my wallet, and a comfortable wake in the middle of the night. </p><p>Conclusion:  The bitterness makes it not worth it.  I sat with crazed expression saying, 'Its good!  Its so good, I like it!' and I could convince myself for one second until I took another sip and my back taste buds blown with horror.  Then for some insane reason I took another sip, and another, and it happened again. If it tasted like orange juice, then it would be decent.  Adding honey and drinking it warmer may help, and the lemon juice helped a little.  Interesting, but only for a one-time thing.</p><p>Note:  If I was in an auditory stimulating environment and wide awake when the effects set in, I think I would have enjoyed it more.  I feel that since I was in a quiet room, nothing happened.</p><p>Note:  There seems to be little known about the chemical make-up of this plant, although it certainly seems safe to use.</p><p>My list of what has been easiest to drink to worst to drink:</p><p>Damiana (pleasant almost)</p><p>Yohimbe (not bad)</p><p>Hops (weak taste of unpleasantness)</p><p>Calea   (strong unpleasantness in taste, and hard to get down)</p><p>Sinicuichi (no real unpleasantness in taste, but very hard to get down, nausea). </p><p>Coffee (unpalatable, extremely bad, how do people drink this shtuff?)</p><p>--Malawi</p>",
 "year": "2001",
 "id": "10501",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-11-13T08:00:00.000Z",
 "views": "25599"
}
