{
 "id": 10519,
 "title": "Panic In 2-D",
 "date": {
  "submission": "2002-02-18T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Amelia",
  "gender": "Female",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "joints/cigs"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "number": "37.5",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Phentermine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I've smoked pot several times before, but none of my previous experiences are comparable to what happened yesterday.",
  "My boyfriend and I were lying around, bored off our asses, and he decided to roll a joint. Being the generous sort, he shared with me. I hadn't smoked a significant amount of dope since about november, and I was taking some huge hits. I hadn't eaten anything that day, and had taken an Adipex-P (phentermine... 37.5 mg) that morning. To top it all off, I'm a lightweight anyway... 100 lbs. At 5'8'. In retrospect, I suppose the odds were stacked against me.",
  "I started feeling very disoriented and dizzy. When I closed my eyes, it was as though I was on that terrible amusement park ride... The one that uses centrifugal force to push you up against the walls. I laid back on the bed, and tried to regain a sense of being stationary. I began feeling very lonely, and worried... I wanted Scott to come sit by me. I wanted to lay with him and touch him- he would be the tie that bound me to reality. He was busy with something on his computer, though, and wouldn't oblige me. Then I started feeling really lonely... And incredibly disconnected. I would stare at something for a while, and it would start to look 2-dimensional. I felt like I was falling away from an image on a flat screen; like I was sinking into a place that I wasn't supposed to venture into. My brain was boiling. I'd move a bit.. Fix my gaze on something else, and I'd see things in 3-d for a while. Then it would go back to 2-d and start all over.",
  "Finally, after much whining and squirming, I convinced Scott to come lay by me. I took his shirt off and pressed my skin against his; this was very comforting, and I thought I was beginning to relax. Soon after he joined me, however, I started feeling nauseous. I told Scott I was going to puke, and he helped get me into some clothes and tried to lead me into the bathroom. He wasn't helping me walk, and I was feeling extremely disoriented... Like the trek to the bathroom was impossible. I kept saying 'I can't do this! I can't!'",
  "Once in the bathroom, Scott left me so I could 'have some privacy.' I felt exceedingly nauseous, but tried to repress the urge to throw up. All the while, my crazy head was spinning, and my whole body was sweating profusely. I felt like I was dying. I honestly did. I could feel myself being tugged by my brain into some kind of ink-black hell. This is when the panic kicked in big-time. I started whimpering... Then crying 'help me! Please?! Pleeeease?' Scott came into the bathroom and sat on the counter, watching me writhe in agony and terror on the floor. I just wanted him in there with me until I was sure I wasn't going to die. All I could think about was my name on some Dateline NBC special: 'deadly marijuana?'",
  "He was laughing, which pissed me off, but somehow also served to make me feel more tied to reality. I tried to laugh at myself; relax. Then the ringing started. It was this terribly high-pitched buzzing sound. It felt like the ringing was washing my brain in liquid metal. My extremities grew cool and limp. I started to freak out again... And decided I'd feel better if I puked. So I yelled 'privacy!', Scott laughed and left, and I began to vomit. Terrible, since what came up was a sick amalgam of dr. Pepper and stomach acid.",
  "After about 10 minutes of wretching, I felt considerably better. I stood up and walked into Scott's mom's room, where Scott was sitting on the bed. I laid my head in his lap and listened to him tell stories about nearly every object in his mother's room. And I loved it. I just wanted him to keep talking. His dog lay down next to us, and it felt so good to stroke her fur. I had a pretty nice high for a few minutes, and then I drank a few swigs of dr. Pepper. Almost immediately thereafter, I was bent over the toilet again, puking, crying, and hearing Scott laugh from his bedroom.",
  "After the regurgitation-fest was finished, I laid down on the cool tile floor for a while, and felt better. Much better. The ringing had stopped, I could walk in a straight line, and all I wanted to do was be with Scott. I walked back into his room, and snuggled up against him. From there on out, my high was nice, gradually diminishing into a feeling of incomparable exhaustion.",
  "I'm still not entirely certain as to the cause of my terrible experience, but I'm wondering if the phentermine isn't at least partly responsible."
 ],
 "erowid": {
  "id": "6248",
  "citation": " Amelia. \"Panic In 2-D: experience with Cannabis (ID 6248)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6248",
  "substance": "Cannabis",
  "views": "20698"
 }
}
