{
 "title": "My Heart Constantly Skips Now",
 "author": "kelly",
 "citation": " kelly. \"My Heart Constantly Skips Now: experience with Amphetamines (Adderall) (ID 10519)\". Erowid.org. Sep 22, 2004. erowid.org/exp/10519",
 "substance": "Amphetamines (Adderall)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "oral",
  "Amphetamines",
  "(pill / tablet)"
 ],
 "report": "<p>I started taking Adderall my freshman year. I was over at my cousins house and she was perscribed them. I didn't know what they were for at first just that they were kind of like ritilan. So I popped 5 20mg of them. Later on that night I started feeling the effects. We were outside lighting fireworks and its hard to explain the feeling, just that I was relaxed, and I felt comfortable with everything I did, and it helped a lot with social contact I had with anyone. Earlier that night I had bitten my lip, and another side effect from the drug is it made me want to chew, so I started munching on my lip where I had bitten it. I didn't sleep any that night, all I did was just lay down and chew on my lip. That morning my lip had swelled to double the size and I STILL coudln't stop chewing, the effects had already worn off, but I still didn't feel tired or anything. I asked my cousin before I left if I could have some more so I took 9 more 20mg home with me. The next two nights I popped them, and the paranoia was unbelievable, I always thought I saw people outside my window. And I barely ate either, by the time I had taken all them I was weak and felt like shit.</p><p>I never touched the stuff for months, until I found out a friend at school was perscribed it. So to make a long story short, I would buy about 20 of them, and TRY to pop them slowly but it'd usually last me 2 days or so, it helped with my concentration, and I did great in school, first time I was actually making A's. Then I'd usually go home and read all day and then all night occasionaly popping more adderall. I have no idea why it makes me want to read, but I'm not complaining about it. This went on for 3 weeks, not straight, I'd usually go a couple days after I would run out. First I never really noticed any withdraws, other than thinking 'I really wish I had some adderall' and I'd usually eat almost constantly afterwards. I started to buy more Adderall and pop probaly 15 a day or less, the feeling I had was weird, it wasn't really affecting me like it used to, but I would sleep and still read and not eat. Then finally one night my heart started skipping and was beating really hard. I never really thought anything about it so I just kept on popping them. I finally stopped when I ran out of money and just was a mess.</p><p>I've tried popping Adderall a couple times but it just doesn't effect me like it used to, I miss those feelings. But I guess popping 15 20mg of them in one day was the reason. My heart constantly skips now, and its harder for me to concentrate like before. So all I have to say is PLEASE be careful when you take adderall. Its a nice drug just as long as you know how to use it.</p>",
 "year": "2000",
 "id": "10519",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-09-22T07:00:00.000Z",
 "views": "20559",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  }
 }
}
