{
 "id": 1052,
 "title": "Knocking at the Gates of Hell",
 "date": {
  "submission": "2005-02-11T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The BOOM BOOM Man",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0:15",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "Well, I may sound unbelievable to some, but I am a very high toleranced tripper that usually wont get a fantastic experience unless consuming equal to or greater than 1/4 oz/7 grams of the wonderful fungi.  It had been about a month since I had last tripped, so I figured by the wait and taking my 5-HTP supplement I would be good to go. ",
  "I had dimmed the lights, had Jimi Live @ Woodstock playin on the sound system, had plenty of vitamin C including oranges, orange juice, and VC 2000 mg. I don't know if it really helps- but why not. I live in the mountains, so at the time there remained about four feet of snow across the land, and had warm gear in case I wanted to go outside. ",
  "Anyway-",
  "11:00PM  Ingested 1/2 oz./14 grams of Cubensis",
  "Chewed for about 35 minutes-the taste is natural to me, so it's just like eating veggies on a camping trip-I would eat em just for fun-but for those weak people out there-orange juice cuts the cringy taste and makes it sloshable like a smoothie-yummie. You need to chew them for as long as possible, because your trip will hit harder on the 'coming up' phase, hit fast-within 20-30 minutes, yet might be upsetting to the stomach in large quantities, As I found out.",
  "Now  I was ready- I had 14 grams of dried fungus in my body, and fifteen minutes later, I chewed up the remaining 7 grams.  Forty five minutes later, I immediately began falling into another dimension.  Ever so excited and happy to start the trip, It was getting so intense it was nearly frightening.  My mind was 'falling' and not only my mind, but every jolt, illusion, and visual effect was all swirling in a downward spiral.  If I extend my arms and close my eyes, it seems to be what the path to heaven or hell would be like.  Falling forever into a revolving, flashing, pulsating, jumble of intricate 3 Dimensional fractals that only the human mind can produce, patterns and objects that no machine, person, thing could ever come close to duplicating.  I could see the fourth dimension-",
  "After having a grand ol' time playing with my closed eye visuals, I wandered out of the now very warm bathroom- (I was laying on the floor in there because there is radiant in floor heat in the house, so having a 95 degree floor is very nice and comforting when engaging in these experiences.)  I recieved thoughts that came and went every few seconds that were totally out of this world.  I could actually close my eyes, choose a time period in my life- specifically, like a boat my father had when I was 3, or the house we lived in when I was 7- I could zero in on a certain memory, turn it into a mirror image, zoom in to anywhere in the room/boat, etc, and see everything with exact detail to how it really was when I saw it last- which was 11-15 years previous to this trip.  I mean, it was so detailed to a 'T'- it wasn't even funny.  That's what's so awesome about the fungus, is the precision and creativity that they can give my brain.",
  "As I opened the door to depart the bathroom, a woosh of air seemed to almost knock me over- (200lbs-that doesn't happen easy)  It seems like the air from opening the door was the strength of a hurricane- it was one of the strangest feelings I have ever felt- but anyway- I got geared up to go trudge thru the snow, so when I got outside, I made a torch out of a stick with towels duck taped around it.  I went to the barn and poured a mixtured of ZIP STRIP and gasoline on it, and wallah- Let there be light!--",
  "After walking for nearly an hour or so, torch in hand,still burning- I decide to venture back to the house and warm up- and as it goes on, I seem to get a feeling of very strong anxiety in the depths of my stomach-  (it seemed as if the remaining seven grams was kicking in now-  I dropped to the floor, had to crawl to the toilet and hurl up my once beautiful mushrooms- now swirling around in the toilet, changing vibrant colors rapidly and oozing all over inside the blue water.  Then things began to 'melt' and I began to melt with everything else in the bathroom, untill I was being sucked thru the scorching tile floor.  I was being dragged into the center of the earth, spinning uncontrollably downward like falling thru space, but a lot more colorful to say the least.  Anyway, after having a scary yet wonderful trippy time, I finally got to sleep about 6 hours later, which was nearly morning by that time, woke up at 1 pm feeling great!",
  "By the way- Mushrooms were not meant for people that 'want to get fucked' or just want to trip.  Shrooms are a very powerful natural substance that can open door that I never dreamed possible.  When you trip, dont just do it to do it, do it to find a deeper meaning to life, to find out new theories, perspectives, and ideas nobody could ever come up with without the help of the fungus.  It is a sacred being that should be treated with respect, and although not mentioned in this report, the things your mind can produce can and will blow you away, so prepare before every trip, so you can make more room to soak up some of the infinite things your mind comes up with. and make sure it is the right time/place/and is going to be beneficial-hell, shrooms are always beneficial (to me)."
 ],
 "erowid": {
  "id": "13076",
  "citation": " The BOOM BOOM Man. \"Knocking at the Gates of Hell: experience with Mushrooms (ID 13076)\". Erowid.org. Feb 11, 2005. erowid.org/exp/13076",
  "substance": "Mushrooms",
  "views": "5135"
 }
}
