{
 "title": "A Short History of Nothing",
 "author": "Roostafari",
 "citation": " Roostafari. \"A Short History of Nothing: experience with Salvia divinorum (ID 10525)\". Erowid.org. Nov 15, 2001. erowid.org/exp/10525",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "report": "<p>So, it all (or nothing) began in fall 1999 when I received 1/2 oz Salvia.  It sat in the drawer for 2-3 weeks, until I got the nerve to give it a whirl.  Sitting on the floor, 1 lit candle in a dark room.  Very quiet trance music playing in the background.  I crush 5 leaves into small pieces and pack my pipe full. Strike up the butane lighter. Take a deep toke and hold it until my lungs start to convulse. Exhale.  Repeat. After 5 or so tokes, the leaves are ash, and I wait. The smoke curls and forms into a layer a foot or so above my head.  Hmmmm.  I feel a mild pot-like buzz but without the giddiness, nothing more.  An hour goes by. I load another bowl and smoke as before, trying to hold the smoke even longer.  More of the same lethargic, relaxed buzz. Nothing more. Another hour goes by and somewhere along the way, I fall asleep on the floor.  The candle burns through and the wax is irrevocably soaked into the home made cherrywood case of my guitar amplifier.</p><p>One week later, I have researched more on the web. I make a quid of about 20 leafs. Sitting in a darkened room, I masticate the mess for 45 minutes.  I spit and wait. An hour goes by. Nothing. I climb into bed and sleep, dreamless, until morning. Two days later, I am fading in and out of consciousness with nearly a liter of Jose Cuervo in my gut.  The conversation around me turns to herb and I offer the remainder of my Salvia to somebody who I don't know.</p><p>Two years later, my interest in Salvia has been re-kindled.  Remembering my previous difficulty, I purchase 500mg of 10x. It arrives quickly, and that evening I lay back on the sofa with my pipe. I carefully measure out 1/5 of the package, having read that 50-100mg should give me a moderate-high salvia trip. I draw deeply and hold the smoke as long as possible. I take another toke and hold.  The salvia is ash. The lethargic buzz hangs over me like a haze. Nothing more. After a half hour, I turn on the lights and go to Del Taco.  That night, I dream of being chased by bottles of olive oil.</p><p>Tonight, two weeks later, I load my pipe with the remaining 400 mg of 10x extract.  Go for broke I suppose.  I dim the lights and sit back on the sofa. After several good deep tokes I am buzzed as before.  This time though, I feel as if I am weighted down by a great pressure. I feel heavy and very irritable. A headache is coming on and looms over my brain like a zombie.  Two hours pass and I sit here at the keyboard.  Emotionless. Numb. I find myself typing words phonetically and having difficulty carrying a consistent pattern of thought. I blend words together (Song + Sound = sond) The CD changer has selected some song by Sting. I find it especially annoying that he feels the need to sing in French.</p><p>I am disappointed. Nothing more.</p>",
 "year": "2001",
 "id": "10525",
 "gender": "Male",
 "timestamp": "2001-11-15T08:00:00.000Z",
 "views": "6820",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Salvia divinorum"
  }
 }
}
