{
 "id": 10535,
 "title": "Scary Stuff",
 "date": {
  "submission": "2007-06-25T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Female",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tsp",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(tea)"
  }
 ],
 "report": [
  "My Kratom experience was purely horrible!  I am a heavy-set, fairly healthy twenty-six year old female who is not currently on any medications.  I have had limited experiences with psychoactives (I drink and smoke cannabis once a month or so, and have tried shrooms and salvia before and had enjoyable experiences).",
  "Kratom is just bad, though.  I had drank the tea at around 10:15 pm, while it was bitter, it tasted much like other herbal teas that I have drank.  I immediately felt a slight buzz, much like what I experience from alcohol.  However, that's when everything went downhill.",
  "I began to feel nauseous at about the same time that I began to catch a buzz, and the sensation only grew stronger until I was covered in sweat and dry-heaving.  (I hadn't had anything to eat since dinner at around 5:30 pm.)  Feeling weakened but relieved, I went to bed at around midnight and hoped that I'd feel better in the morning.",
  "Fast forward to 11 am the next morning.  I had slept soundly, but felt absolutely horrible.  I couldn't so much as stand up without feeling profoundly weak and nauseous.  Attempting to drink water and juice (in an attempt to stay hydrated) yielded violent stomach cramps and almost-projectile vomiting.  I was forced to cancel my day's plans and stay in bed.  At around 9:00 pm, the nausea subsided and I was able to drink some soup without it making a reappearance.",
  "I promptly threw away the rest of the kratom that I had in my stash.  Never again!!!"
 ],
 "erowid": {
  "id": "62530",
  "citation": " Anonymous. \"Scary Stuff: experience with Kratom (ID 62530)\". Erowid.org. Jun 25, 2007. erowid.org/exp/62530",
  "substance": "Kratom",
  "views": "24131"
 }
}
