{
 "id": 10533,
 "title": "No Abuse Potential",
 "date": {
  "submission": "2007-04-27T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "theboywithoutaname",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Piperazines - mCPP"
  },
  {
   "time": " T+ 2:36",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Piperazines - mCPP"
  },
  {
   "time": " T+ 2:36",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines"
  }
 ],
 "report": [
  "<p>T-0M 40 MG mCPP Taken",
  "T-38m",
  "Not feeling much yet, only a little 'wierdness' but I can't put my finger on what it is.",
  "T-58m",
  "Kind of dizzyness set in, also very tired since I did not sleep last night. That might be attributing to this. I also feel some very mild nausea with a mouthwatering effect at this point. I do not feel any significant euphoric effects yet.",
  "T-1h.32m",
  "Feeling mild euphoria, tiredness still here, mild jaw clenching going on. Nausea and 'Mouth Watering effect' is completely gone now. I can say i'm at a +1 right now. Nothing major or magical yet, wondering if I took too little.",
  "T-2h:36m",
  "I'm probably at a +2 now, ingested 60mg more of mCPP and 30mg Adderall XR. Euphoria is good, seems like more a mellow euphoric bliss.",
  "-Summary:",
  "This chemical seems not to go so good on its own. After I added the Adderall + 60MG mCPP the euphoria went up around x5 fold. Still alot of exploring to do left on this chem. I don't think this will become a restricted chemical, since its abuse potential is probably less than a tylenol PM =P. It definitely does not live up to the hype.</p>"
 ],
 "erowid": {
  "id": "62524",
  "citation": " theboywithoutaname. \"No Abuse Potential: experience with mCPP, Amphetamines (Adderall XR) & Sleep Deprivation (ID 62524)\". Erowid.org. Apr 27, 2007. erowid.org/exp/62524",
  "substance": "mCPP, Amphetamines (Adderall XR) & Sleep Deprivation",
  "views": "12718"
 }
}
