{
 "id": 10539,
 "title": "Taken Medicinally",
 "date": {
  "submission": "2009-09-30T07:00:00.000Z",
  "experience": null
 },
 "author": {
  "name": "Mike",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "60",
    "grams": 0.06
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "daily"
  }
 ],
 "report": [
  "I was diagnosed with severe ADHD when I was 8, since that time I have been regularly taking any one of several amphetamine medications for my 'condition' and I feel I should let you know that when you get these things prescribed to you for a reason, you don't really enjoy them.  It isn't that the side effects are really so bad, the one I have always disliked the most is the loss of appetite, which for some reason no one has ever explained to me occurs across the board with all ADD medications.",
  "I have a fast metabolism naturally, if I don't take my medicine and I eat as much as I want of whatever I want I don't gain a pound.  When I do take my medicine which is usually, I have to force myself to eat, and the adderall takes all the fun out of eating.  I am a cook, and I LOVE food, so this is especially hard on me.  Aside from that there is the insomnia, which I believe I suffer when not medicated as well as when on adderall so I am not sure about how much of the blame for that which I can proscribe to medication.",
  "Here is the part that will come as a surprise to you if you think you know what these drugs do, and I don't claim to understand why it works differently for people with ADD.  When I am NOT on these drugs my brain performs BETTER.  By this I mean that comprehension, problem solving, learning and retention are all reduced by this drug when I take it, however what is increased is focus.  When I am un-medicated my mind jumps from one thought to another with such rapidity that almost nothing gets accomplished without a supreme effort of will. ",
  "I also find that on adderall, my mood is less enthusiastic and that my personality is somewhat blunted.  I never feel any kind of euphoria or crash from this medicine, I currently take 60 mg a day at two intervals, usually finding that the effects wear off after about 4 hours."
 ],
 "erowid": {
  "id": "62541",
  "citation": " Mike. \"Taken Medicinally: experience with Amphetamines (ID 62541)\". Erowid.org. Sep 30, 2009. erowid.org/exp/62541",
  "substance": "Amphetamines",
  "views": "5246"
 }
}
