{
 "title": "DXM and an SSRI Antidepressant",
 "author": "jammy",
 "citation": " jammy. \"DXM and an SSRI Antidepressant: experience with DXM (with CPM) & Citalopram (celexa) (ID 10542)\". Erowid.org. Nov 24, 2001. erowid.org/exp/10542",
 "substance": "DXM (with CPM) & Citalopram (celexa)",
 "bodyweight": "140 lb",
 "report": [
  "<p>[Erowid note: Coricidin Cough and Cold contains Chlorpheniramine Maleate which is dangerous in high doses. See DXM Brand Warnings for more information.]",
  "My dad talked me into trying an antidepressant to help with some troubled feelings that were out of my control, apparently it is a very hereditary thing in my family. I was prescribed Celexa (citalopram) in a 20 mg tablet taken orally once a day. It helped great with the depression but I have read everywhere that use with DXM is cautioned.",
  "[note: my experience IS INDIVIDUAL. I have read that combining DXM with an SSRI can cause serotonin syndrome (an overdose of serotonin) which is very irritable or in extreme measures fatal. and you should be VERY CAREFUL when using dxm and antidepressants)",
  "-----------------------------------------------",
  "My first test to see how I would respond was 10 coricidin (300mg) taken orally. When it first kicked in I noticed strangely that where usually the strong physical effects came first, instead I began to feel very disconnected and loose mentally. The peak of the high was generally the same except for one VERY interesting effect.",
  "Normally on DXM there is still a muffled voice in my mind that is able to remind me that I am under the influence and that is why things are so strange. This time that little reminder was very quiet (if that makes sense) and at times non-existent. I found myself believing more than ever that there was no drug involved and that I was simply experiencing something natural. It was hard to explain but a good way to sum it up is that the effects were more convincing and felt more permanent.",
  "What interested me the most, however, is that when the high wore off I still had a very warm, fuzzy euphoria left over. It was kind of a dull feeling, but still it was very pleasant and relaxing. I personally believe it to be linked to this.",
  "-----------------------------------------------",
  "I will continue to increase my DXM dose slowly and steadily until I either become uncomfortable or pass out. ;) I hope this helps those of us on antidepressants better understand dxm use. Be safe and happy trippin'.   PEACE</p>"
 ],
 "year": "2001",
 "id": "10542",
 "gender": "Male",
 "views": "26864",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Citalopram",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2001-11-24T08:00:00.000Z"
}
