{
 "title": "Unexpected Results",
 "author": "Akyouser Oner",
 "citation": " Akyouser Oner. \"Unexpected Results: experience with Ketamine (ID 10550)\". Erowid.org. Aug 28, 2002. erowid.org/exp/10550",
 "substance": "Ketamine",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "100 mg",
  "insufflated",
  "Ketamine",
  "(powder / crystals)"
 ],
 "report": "<p>I know it's stupid to take a drug that you know little to nothing about, but I guess you're never too old to learn a lesson.  One evening a good friend and tripping partner came by and mentioned that he had gotten some 'special K'.  Neither of us had tried it then, and we were both pretty curious about it.  Id seen one person on it before, and they just seemed good and fucked up having fun and such.</p><p>I decided that Id do a dose (I was told 1/10 of a gram snorted would be a good start).  Well, with little thought of consequences, I divided it in to 2 lines and up the nose they went.  A few minutes later I had a pleasant buzz in my head.  I got up and walked around a little and it felt somewhat similar to about 4 grams of mushrooms as far as feeling like you're floating above the ground.  Another minute or two later I felt like I should sit down, so I did.  A few seconds later I felt a sensation of going from 0-100 mph in a tenth of a second.  It was just like in Star Wars going to light speed.</p><p>I had the immediate urge to sit in a more comfortable spot and found it increasingly difficult to communicate with my wife and a friend who had stopped by.  I somehow managed to get them to help me move to the couch because I was now unable to move myself.  Luckily, my wife knows how to properly baby-sit a tripper (calm, but attentive) and made sure I was still alive from time to time without bringing too much attention to her fear that I was going to have to be rushed to the hospital.  According to her, when she asked me a question, it took forever to answer and sounded like I was very far away.</p><p>Very far away indeed!  By that point, my body had been totally disabled.  The thought kept coming forth that my breathing and heartbeat would stop since I was unable to even detect signs that I had a body.  I remember rushing down a tunnel and trying so hard to hold on to my body that the entire trip seemed focused around it, making sure I was still breathing and fighting off the fear that I was about to die on my couch with my wife next to me and my son asleep in his room.</p><p>This seemed to go on for quite a long time (which turned out to be only about an hour or so), and eventually I started to come back to my body.  I was so glad that I wasn't dead and that I could move again!  I immediately walked (floated) in to my bedroom and got undressed.  As I lay in my bed I felt surprisingly exhausted for someone who just spent an hour and a half unconscious on the couch.  Even though I was still somewhat scared, I was happy and relaxed.  Upon looking back at the experience, I find myself wishing that Id let go and learned from the trip.  I felt like I had all the answers but was too distracted by fear to seize them.  Overall, I think I may try it again knowing more about it and the effects.  Also, I would suggest to would-be experimenters that this is in NO WAY a recreational drug.  It is for experienced psychonauts only.</p>",
 "year": "2001",
 "id": "10550",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-28T07:00:00.000Z",
 "views": "18652",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 }
}
