{
 "id": 10551,
 "title": "Window to the Subconscious",
 "date": {
  "submission": "2007-10-24T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cheese",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "My first life-changing experience with these truely magic and mystical mushrooms took place at a friend's house, where we each ate 2 grams of dried cubensis, spent most of the time watching a Harry Potter movie, and smoking cannabis in a shed behind his house.",
  "The trip came on mild for me, the usual waves building up to the peak. For the first hour or so, the effects were a light to moderate stoning. As time went on we began to be pulled into the world of the mushroom, one which will always seem to me more real than sobreity. While under the influence of psilocybin, it is as if the veils which cover truth are lifted, and for a limited time you are permitted by a greater force to view existence as it truely is.",
  "After about two hours, the psilocybin had most definitely already taken effect, and we had both noticed the 'mirror people' which would follow and imitate our every move, looking identicle to us in every way other than their eyes having the colours of the rainbow rather than my regular eye colour. Although this may sound ridiculous to most, looking at myself in the mirror while under many psychedelics can help look into myself. I saw myself in a way I have never thought of before, a teenager lost in life and searching for a purpose, and desperately using mushrooms as a tool to help. Thoughts like these I have found to be common with psilocybin mushrooms, as I feel completely balanced and at one with the world, I begin to realize that issues in my 'true' life can be resolved, and that alternative livings are possible. Things like these are easy to piece together, and make complete sense, and many times have led me to believe that my ways of life have been incorrect, and have thus modified myself for the better, with the help of these mushrooms.",
  "These thoughts were short-lived, as we began to watch Harry Potter. Right off the bat, I had closed my eyes and noticed that my senses were elevated so highly that I was able to see everything in the room around me, including the movie, with my eyes closed. As this was very remarkable, I was pulled deep into the background symphony of the movie, and began to fly through space and time itself. I witnessed beautifully coloured galaxies and light systems, allowing my mind to become at one with the universe, understanding that I will never be alone due to the vastness of these physically unescapable borders.",
  "As I ventured deeper and deeper into the universe, I was merely going deeper into my subconscious. Until it happened, an utmost understanding of life to the point that my entire subconscious was vulnerable. It is impossible to explain this experience with language, it is one which has to be experienced first-hand or not at all. With my mental defenses down, and my full mind available to be picked away at by my conscious mind, I reached what was felt as to be a God. The God within myself, which was my spiritual being, my entire mind combined, creating a sense of higher-being. This higher life form, although being myself, was entirely seperate from the mind state which I was in, and allowed me full permission to explore my mind. Instantly, as my visuals went to the dead center of my head, the library of my life was opened. Events from my childhood which had been long forgotten were unlocked, and held great significance to who I had become. Needless to say, the memories which I had opened up left me with great knowledge of where I stand, and to where I will walk in the future. All of my relationship issues were dropped, as I completely understood anything which mattered.",
  "These thoughts allured me deeper and deeper, while my friend had begun to have a 'bad' trip, screaming insanely at the 'holes' which he kept falling in. I attempted to relax him, but gave up as I was enjoying my trip too much, and had a sober sitter there who attended to him. I began to understand how many other life forms exist within our universe as well, fulfilling their biological purpose. Of all the other life forms existing in the universe, Man is surely the cancer which will eventually spread to destroy its entire existense. Man may have evolved beyond all other species, but it was not for a greater good. We have become powerless against our own creations of time and money, searching for ways in which we can gain more. Reasons such as that kept my eyes closed, while my friend was screaming out in fear. When they were open, the world around me was not what I wanted to see. The effects of the mushroom leave me both wanting to remain in that state of being for eternity, and wanting to return to the life I had before the trip.",
  "Inevitably, after roughly 5 hours, I was returning to reality with knowledge so deep I could not speak it. After I awoke from what seemed like the perfect slumber, with the climax dying consistently, we smoked more weed so the after effects of the psilocybin was nothing but pleasant body buzzes. This trip is what lead me to persist hallucinogens, giving me an overview of what my life will contain. A mere glimpse at the hidden doors waiting to be opened, just sitting in my mind."
 ],
 "erowid": {
  "id": "62597",
  "citation": " Cheese. \"Window to the Subconscious: experience with Mushrooms - P. cubensis (ID 62597)\". Erowid.org. Oct 24, 2007. erowid.org/exp/62597",
  "substance": "Mushrooms - P. cubensis",
  "views": "3362"
 }
}
