{
 "title": "Super Elastic Bubble Plastic",
 "author": "Murple",
 "citation": " Murple. \"Super Elastic Bubble Plastic: experience with GVL & GHV (ID 10556)\". Erowid.org. Nov 13, 2001. erowid.org/exp/10556",
 "substance": "GVL & GHV",
 "bodyweight": "170 lb",
 "report": "<p>I recently became aware that gamma-valerolactone (GVL) was being marketed as a GHB replacement. I had read Rhodium's report on gamma-hydroxyvalerate (GHV or 4-methyl-GHB) several years before, which had given me a passing interest in trying it. I used GHB for a period of about 2 years, but stopped about 2 years before because I came to look at it as sort of a waste of time. It gets me more fucked up in an out-of-it way than I like to feel. Descriptions of GVL indicated that it was a much milder drug than GHB. Curiosity overcame me and I decided to buy a bottle to try.</p><p>About a week later, I received my 4 ounce bottle. The bottle contained a mixture of 3 parts GVL to 2 parts water, with a little potassium sorbate added as a preservative. The label said that a dose was 2.5 to 5 milliliters of the solution. I measured out 4ml and put it into a small glass. The liquid smelled nasty... it reminded me very much of Super Elastic Bubble Plastic (some of you may remember this stuff from the 1970s, you'd squeeze a little ball of plasticky gel from a tube, put a wad on the end of a straw, blow into the straw, and it'd expand into big multicolored bubbles). I added some juice to try to cover the taste, and drank it. Unfortunately, it tasted like it smelled... all that the juice did was give me more volume to drink. I cringed as soon as it touched my tongue. Nasty!</p><p>Within 10 minutes I began to feel somewhat relaxed and maybe a little light-headed. This built in intensity for another 20 or 30 minutes. There was no euphoria, no GHB-like intoxication. My muscles were relaxed, I felt very mildly light-headed, and that was pretty much all.</p><p>About 2 hours later I decided to try taking some more. This time, I decided to try reacting it with NaOH to make GHV. I measured out 3ml of the solution and added a little extra water. I put in a little NaOH (I didn't weigh it) and it created a mild exothermic reaction. I got the pH right and then added some juice and drank it. The taste was improved somewhat, but not much. It had less bite but was still like drinking Super Elastic Bubble Plastic. Again, the effects came on within about 10 minutes. Again, it was very mild. I went to bed after about 2 or 3 hours still feeling some of the effects, so I can't say how long the effects lasted.</p><p>Four days later, I decided to try GVL again. This time I decided to take a larger dose. I measured out 7ml and put it in a glass. Instead of trying to mask it with juice I just added a little water and chugged it down in one shot... if you can't cover the taste, might as well just get it over as quick as possible. The effects were felt in about 10 minutes and built up for the next 20 minutes, as before. Again, it was very mild. In fact, I could detect no difference at all between 7ml and 4ml... this is in line with what I've read. Apparently doses above about 5ml do not give any stronger effects. It would be interesting to know what this stuff does in the brain. After about an hour I got in bed and fell asleep. It wasn't really any easier to sleep than it would've been without GVL.</p><p>In summary, GVL and GHV are not at all like GHB! It's more comparable to something like valerian root. It might make a good muscle relaxer, and it might help for mild anxiety. It might possibly even help someone who was slightly tired fall asleep, but if you took it when wide awake it would not put you to sleep. Not a chance of date rape here! It may be similar on a chemical basis, and it may bind to GHB receptors, but the subjective experience is nothing like GHB. It has no recreational potential at all.</p><p>Is it of any use? I don't know. First of all it must be kept in mind that this must be considered an experimental drug. I know of no formal human research on it, and I don't believe any animal studies have been conducted to find out what the risks of long-term use as a drug might be. GVL is considered a safe food additive by the FDA, but when used in this way it is in doses far far lower than its doses as a drug. There's no way to know if it is safe or what the risks may be. If I had to guess, I would say it probably is OK to use occasionally... but this is just a guess. If it is safe, then it may have some uses.</p><p>One possible use could be as part of a detox program for GHB addicts. I have seen reports on the internet from people who have used GVL successfully for this purpose. Perhaps gradually decreasing doses of GVL or GHV could be given to GHB addicts to lessen withdrawals, while keeping them essentially sober.</p><p>Another use may be as a mild, non-intoxicating remedy for acute anxiety attacks. It wouldn't be my first choice for an anxiolytic though. I doubt it would be of any use for severe or even moderate anxiety attacks.</p><p>Finally, if it shares GHB's growth hormone releasing properties, perhaps it could be used as a bodybuilding or anti-aging drug like GHB. If it shares this property of GHB, its lack of significant psychoactivity would likely be a real plus, as you could take it before a work-out and not have to worry about passing out in the gym.</p><p>It was interesting to try it, and not at all what I expected. I don't regret buying it, but I suspect the bottle will last me for a long long long time, and I doubt I'll buy more. Its not bad stuff, its just that I've got better things to do.</p>",
 "year": "2001",
 "id": "10556",
 "gender": "Male",
 "timestamp": "2001-11-13T08:00:00.000Z",
 "views": "23114",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "GVL",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "GHV",
   "form": "(liquid)"
  }
 }
}
