{
 "id": 10568,
 "title": "Life Is an Electric TV Show",
 "date": {
  "submission": "2007-12-06T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SourDiesel"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Before this experience, I thought I had tripped before. I had taken acid once, but only one hit. Just enough to make things breathe and pulse, and colors stand out for a while. I had also taken mushrooms, which caused me to feel like a crab on the beach and turned sand into fire, but the hallucinations were still mild. I was on just under an 8th, barely anything by my newfound standards.",
  "Just to give some background on my other drug experiences, at age 17 I've been smoking weed multiple times a day for two or three years, I have done quite a bit of nitrous oxide (I used to do a box to the face in one sitting on a regular basis), I greatly enjoy real wormwood Absinthe (which my friend imports directly from the Czech Republic) and I've been known to binge on cocaine occasionally, though never enough to cross into the frightening realm of addiction.",
  "Unlike many other young drug users, I do not take drugs to escape from a shitty reality, or to get as loaded as possible, or because everyone else does it. I just consider myself somewhat of a psychonaut. I am a very happy person by nature, and I am just as content to be sober as to be twisted. I am simply fascinated by the world of drugs, and the only possible way to explore this fascination is to take drugs myself. I am my own lab rat. I love it that you can temporarily change your brain chemistry to experience the world in new ways. I parallel my drug use with taking a trip to the amusement park or the movies. It's just another mentally engaging activity. Anyway...on to the trip.",
  "One night, I was with three friends and we had talked about procuring some acid. My friend A, the most experienced tripper of the group, warned us that this was very strong acid and that we should be mentally prepared for quite a trip. I knew to trust him, because I had seen a couple of dudes on this stuff a week earlier, and they were hilarious. One guy basically lost the ability to speak English and stood in the middle of the sidewalk in New York City chugging a 40 of Budweiser while people stared and laughed at him. My other two friends had never tripped on anything before.",
  "I decided that I wanted to lose my mind for the night, after all I was with good friends who I know and trust and we had plans to go to A's house, one of my favorite places in the whole world. His basement is incredibly tranquil, comfortable, decorated with all kinds of trippy shit, and most importantly safe from any unwanted interferences. So I agreed, and before we knew it it was 9 PM and the sheets were on our tongues, with the most powerful drug I have ever experienced seeping into our bodies. It took forever to kick in, so of course we had no option but to smoke a whole bunch of reefer during the waiting period.",
  "For about an hour, I was just stoned. Then, after about an hour and a half, things started getting a bit weird. We went into my friend's apartment building to take a piss, and I remember the distinct sensation of walking into a castle. I could feel the castle above us, surrounding us. Then we went outside to roll a blunt. The acid was just barely starting to kick in. It was coming in waves. The sky appeared to be rolling and buildings started to sway, but then it would stop for a few minutes. My friends were feeling it too. They were all giggling like first-time stoners and no one could roll the blunt. Finally someone managed to twist a decent blunt so we left the spot we were in and moved to one of our favorite smoking spots, a secluded garden in a nearby apartment complex. I had been to this place a million times, yet I couldn't find my way around. Everything looked like everything else. We stumbled around like drunkards for a few minutes, weaving into a spot and then realizing it was a dead end instead of the path we hallucinated. I saw the same dumpster in a few places. Every time I turned my head, there was the dumpster. This was starting to flip me out, but luckily we found a spot to sit and smoke.",
  "Up until this point, I wasn't experiencing anything new. Mild hallucinations and disorientation were familiar to me. I thought I was as twisted as I was gonna get that night. Boy, was I wrong as shit. After we burned the blunt, A went to go for a walk around the garden while B and C (and a few other friends) stayed on the bench. Now the weed was working hard, and amplifying the acid. My sense of the environment went from being a bit messed up to completely fucked in a million different directions, and I was finding it hard to speak comprehensibly. So I told A 'I'm just gonna run back, thatll feel good', and that's when I started truly tripping in the most intense fashion.",
  "As I was running, I had a shred of reality to grasp onto. I knew that I was going to where my friends were. But when I got there, It didnt feel like I had gone anywhere at all. I knew I ran, and I knew that as I was running the world whizzed by like a tunnel around me, yet there was no sensation whatsoever of having traveled. My sense of space and time was completely gone. I noticed a distinct shift in the world from being in my head to being in front of me, like a movie. Instead of living in the world, I was being shown the world. It was at this point that my mind told me I had left the planet. 'No more waves, motherfucker. You've departed for good.' The acid told me that I didn't run from one place to another, but I ran away from the world as I knew it.",
  "I was scared at first, but I immediately accepted my state and began to enjoy it. All of us somehow communicated to each other that we were tripping hard and that we should get out of the public streets of Manhattan and travel to the sanctuary of A's crib. Although I couldn't make out what was around me, I knew the general direction of the train that we had to take, so we headed that way. At this point intense visuals started on the journey. We walked in front of a large group of tourists, and as we crossed paths they seemed to merge into one another before blosoming outwards into a floral pattern. In other words, the group became like a print on a bandana. Blocks kept repeating themselves, so that even though I knew we were going the right way, I had no sense of how far we were.",
  "Bubbles started floating through the fabric of space-time and popping in front of my face. I almost walked right in front of a car. We made it onto the train platform and began to truly accept how twisted everything was, and that we would be in this state for quite a while. It is important to note that at this point, all four of us began feeling like one person. This ESP lasted for the rest of the night and afterwards we all told each other that it felt like we were on the same trip. We all recalled how on the come-up, we kept thinking, 'allright this is IT, we can't GET any more insane', but then we kept going and going and going. Anyway back to the train, the platform kept growing away from us, and people who were in fact very far away seemed as though they were right next to us. The train finally came, and we sat down.",
  "After the first stop, a cop walked onto the train and stood right next to us. At this point we were tripping so hard that any conversation would have given us away immediately, so I made it clear that we should be silent by putting on my headphones. The others agreed with me psychically (strong ESP between us at this point). No point in being paranoid when you can just be silent. I was surprised, however, to hear my friends making a commotion, but I couldn't make out what they were saying. I saw a million cops on the train coming to arrest us. But when I looked over, my friends were as silent as me, and there was only one cop who didn't notice us at all. Every time I looked away, this scene repeated itself. I decided to keep my eyes closed.",
  "Closed eye visuals were amazing. The train was a submarine, everything was submerged. I opened my eyes again and the floor of the train flowed like water. I was listening to a song that I know very well by Mastodon, but it sounded different. It was playing slowly, and I could physically see the waves of the watery train plod along like molasses to the music. The vocals were flanged and the bass rattled. The visuals were pretty damn crazy, but as a musician, the auditory hallucinations were fucking INTENSE. As soon as I began really enjoying this scenario, we had to change trains. Oddly enough we had no trouble finding the second train, even in our completely twisted state.",
  "In the station on the way, I heard by friend B say something like 'Everyone has to do this.' I don't know if he really said it or if it was in my head, but I completely agreed and I had my first true revelation of the evening. I used to think Tim Leary was full of shit. I used to think that anyone who says they have spiritual and life-changing revelations on acid is simply justifying their use of a recreational drug. As I was tripping intensely, however, I realised that acid is much more than a recreational drug. Sure, it was enjoyable as hell to me, but I had important realizations that night which have stuck with me since and will forever. B was right. Everyone should see how malleable our world is in order to appreciate the world as we know it. We have to experience our perception being completely torn apart and rearranging the world into a giant slideshow of our subconscious in order to truly see, know, and feel the way we perceive the world. I finally began to see where all those hippies were coming from.",
  "We got off the second train, in Queens, and walked to A's house. A church appeared on every corner on the way. When we got down into the sanctuary of his basement, all at once we exclaimed 'WE'RE SAFE'. There was a tremendous feeling of high spirit and gratitude. Not to mention we were still tripping BALLS. I guess it had only been two hours since we dosed but we had no time perception whatsoever. A informed us that we were still coming up. I believed him. The hallucinations were getting much more visual, and much more pronounced. But they were also getting much more pleasurable. At this point we transitioned from the 'what the fuck is going on, profound spiritual revelation' phase to the 'kaleidoscope eyes' phase. Instead of the all around mindfuck I had experienced on the journey, my mind was at ease, churning out beautiful image after beautiful image everywhere I looked. The trip had hit full stride. This is when my point of view shifted completely. So here goes, my best interpretation of it:",
  "'A says 'We have to come down off this acid!' before promptly taking the form of a giant chameleon. I disagree. We have to be like this for while. We sit down in silence, I keep my mouth closed but I can feel a cheshire grin spread across my face. Goddamn this is silly. No, wacky! That's the perfect term. I'm wacky on acid, and that's why I sprout this wacky fake grin that only I can feel. I look at a painting of mermaids on the wall. They're trying to do something, to get something accomplished. I see them move, and communicate in their fully animated underwater world. The king is angry with his daughters, who are swimming in circles under his feet, in and out of a giant shipwreck. They try to climb the giant anchor in the middle but they slide back down and never get there. The king rises up, but I can see that he is not actually angry. The mermaids are all just enjoying life in their land. Woah! Holy shit! That was awesome! That painting just came to life! I can look at the painting and animate it with my mind.",
  "I had to share this with my friends. However, acid makes communication difficult. I tell them 'Life is like a TV right now'. They agree with my sentiments exactly. I've hit the nail on the head. Everything we look at is it's own TV show, except nothing sucks! Everything is beautiful if we want it to be. The pink curtains are electric and jump out at me, telling me to party hard. I look at a blue light on the ceiling. It unravels into a line of small dancers, each one sprouting arms and legs out of a dot body with no face and linking up, dancing the can-can. And then one of the most beautiful experiences of my life occurs, an instant classic that I know I'll never forget even as it's happening: I lay down, and I see a layer of roots form out of the pipes on the ceiling. They are growing and growing. Then I feel roots underneath me. They link up with the roots on the ceiling. I am being caressed by a mass of roots in the middle of my friend's basement.",
  "A and B come back down with food and drinks. They left? I guess their energy was manifested in C who was with me the whole time. Woah. I look at a guitar and it starts to breathe, with cubist patterns dancing a boogie around the fretboard, popping out in different formations, changing with perfect rhythm. I look down at my hands. They wiggle and grow in perfect time, just like the roots, while a section of Bartok's 'Concerto for Orchestra' plays in my head. We decide to step outside to A's private garden.",
  "Imaginary strobe lights slow the walk down. We make it, and sit down on a bench in the garden. The white flowers are swirling in the moonlight. I look up at the one tall building I can see. A bolt of lighting comes from the building and strikes me in the head. But it feels good! It feels GREAT! Everything is illuminated and buzzing. This acid is electric. I start feeling electricity, seeing it, hearing the word. I feel emotions which don't exist, which are indescribable. Hearing words that don't exist, that I can't communicate.",
  "We decide to go for a walk. Each block is the same as the last one. We make it to a deli. As I turn down an aisle everything turns red and a comical voice in my head shouts NO. I laugh hysterically and leave the aisle, which must be the wrong one. Navigation is difficult, because everything is in motion. How do people drive on this shit? When I'm on drugs, especially psychedelics, I get this odd sensation where I think it's normal to do anything on drugs, then I find it really puzzling when I think of something that would be impossible to do under the influence of the drug I'm on.",
  "We leave and go to the river to stare at Manhattan, our home. So alive. Lights blink rhythmically in every building. Cars move. Manhattan is the heart of everything. We try to go back to A's house, but everything is confused. We end up on some block, all alone. This block is thick with energy. We stay in silence. We're still tripping, but we've managed to gain some kind of objective insight into what the hell has been happening to us. Holy shit it's 4 in the morning. We go back to A's and smoke some weed, which was absolutely necessary. The visuals which were slowly fading start to come back, but they're less intense.",
  "We watch TV, and I confirm that I am truly myself by making jokes about the show like I always do. I can do that, so I'm fine. I realize the whole experience, unlike other drugs, was 100 percent safe. Not at any point did I feel at risk for any kind of damage to my physical or mental health. The only physical side effects that I felt were random muscle twinges. The drug came, and now it's starting to go. At this point we try to sleep, basking in the afterglow of the trip.",
  "I slept for a couple of hours, and woke up alone at 7:30. I had to leave earlier than the others, who were sound asleep. The afterglow was amazing. I couldn't tell if the acid itself was still affecting me or if I just felt different because my mind was in awe at what it had experienced. Either way, I felt amazing. I was full of euphoric energy, despite the lack of sleep, and I saw new life in everything. I started thinking about myself, and realized that I could do anything I wanted with my life. I saw how much control I had over my circumstances in a way that I never managed to see before. I don't think any old person can just take a few hits of acid and completely change for the better, but personally, I felt I had been through a profound and beneficial life experience.",
  "I haven't done acid since then, as I don't want to tarnish the experience by turning acid into just another recreational drug like weed. I will probably take it a few more times in my life, but only at points where I feel it is reasonable and my mindset will make the experience helpful. Since my trip I have done mushrooms a few times to have a less intense, more recreational hallucinogenic experience. I have also taken Ecstasy sporadically, which I enjoy but only take on special occasions because I find the feeling of rolling to be completely different every time, and only truly pleasurable in the right situation. Nonetheless, no drug has ever had a profound, awe-inspiring influence on me like that night's acid trip, and I seriously doubt I will ever see such beautiful images again in my entire life. However, I'm content knowing I've seen them once. I think LSD should be made the eighth wonder of the world. A trip into my own mind is more satisfying and marvelous than a trip to any monument."
 ],
 "erowid": {
  "id": "62644",
  "citation": " SourDiesel. \"Life Is an Electric TV Show: experience with LSD & Cannabis (ID 62644)\". Erowid.org. Dec 6, 2007. erowid.org/exp/62644",
  "substance": "LSD & Cannabis",
  "views": "49435"
 }
}
