{
 "title": "A True Bonding Experience",
 "author": "Bry",
 "citation": " Bry. \"A True Bonding Experience: experience with LSD (ID 1057)\". Erowid.org. Jan 6, 2001. erowid.org/exp/1057",
 "substance": "LSD",
 "bodyweight": "185 lb",
 "report": "<p>I had gotten hold of some acid from an acquaintance of mine and decided to share it with some friends I knew had been looking for it for some time.  K. and I had both tripped twice before (both of mine were pleasant, and mild).  C. had never done acid, and he decided to try it.  We each took an initial dose of blotter paper, before deciding to get our hands on some more from the same supplier.  By that time, J. and B. joined in and we had a group of five.  The stage was set as I began to feel the effects first....</p><p>As I said before, both of my previous trips had been pleasant, mild and solitary.  This was truly about to be a great experience--the shared one.  I was also excited for C., as it was his first time.  As the drug took hold of all of us, I could feel the energy level of the whole group rising and flowing in an indescribably free and encompassing manner.  The physical sensations I had were somewhat more intense than before:  I would even compare them in a small way to the effects of Ecstasy, which I have done once.  Anyway, we all talked and laughed and I could honestly feel everyone else's thoughts and energy.  It was absolutely beautiful, as if we were all walking through some bizarre Narnia together.</p><p>Eventually, J. and B. both left, leaving K., C. and me to continue our journey together.  We alternated between the front yard (definitely a dark night, with the street lights adding an eerie glow to everything) and the living room with Pink Floyd and a lava lamp.  No matter what we were looking at, we all saw the same thing:  the street oozing, the ceiling sliding, the carpet flowing, trees melting--WOW!!!  I had never seen anything more beautiful in my life.  The shared experience was the closest I have ever come to feeling at one with my surroundings.  The life around us just flowed and pulsated and caressed me in a way that I can never hope to describe.  C. was just in heaven, and we were so happy for him.  The sunrise was a truly cosmic experience.  None of us felt any ill effects, save the drained feeling that comes at every trip's end.  Furthermore, the three of us connected on a level which can never be expressed in words.  We just look at each other, remember, and understand.  Damn, what a feeling.</p>",
 "year": "2000",
 "id": "1057",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-01-06T08:00:00.000Z",
 "views": "10533",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 }
}
