{
 "id": 10574,
 "title": "The World I Prefer",
 "date": {
  "submission": "2009-12-14T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "As",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "(rootbark)"
  },
  {
   "time": " T+ 10:00",
   "amount": "0.5 ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(cookie / food)"
  }
 ],
 "report": [
  "This report details one of the strangest trips I've ever had, on voacanga africana rootbark, with some mushroom candies eaten later. As I write this I realize that I'm still tripping slightly, so bear with me.",
  "This is about the trip, but also about where I was mentally. It started with a visit to visit a friend, who'd been out of the country on a crazy adventure. I took public transportation up to the apartment of a mutual friend, where the first friend, Adam, was staying. I was told that a party was in the works, and that if I wanted, I could volunteer. I had nothing better to do. I'm unemployed, and despite numerous attempts, cannot get a job. I also basically was denied enterence to several schools, and lost my last opportunity to finish my CS education before I got too old. The full impact of this had not quite hit me yet.",
  "So I ran off to go help throw a rave (despite the fact that the people throwing it would not consider it such, I do. Burner parties, undergrounds, they're all raves). The next several days were spent running back and forth between the venue, my apartment, stores, etc. finding everything that they needed. A stage was set up, tents and canopys put up and decorated. The promoter wrangled sound systems, generators, and dj equiptment, then came the party, starting friday.",
  "The music was amazing, the sound system, top notch. Clean beat after clean beat tweaked my slightly shroomed out mind. Bowls were passed, cigarettes bartered, and we all got to know each other. There were not that many people there. Then came sunrise, chillout music, and I finally collapsed in a chair, exhausted, and fell asleep for many hours.",
  "The next day far more people arrived, coming in clouds of dust down a road. More campfires were set up, tents pitched, and the party continued. I'd eaten or given away all my mushrooms the night before, and was left with the drug I had brought - Africana Voacanga rootbark. So I ate some, as it grew darker. I'm not quite sure how much, but my best guess would be approx 9-10 small cm sized pieces of rootbark. This turned out to be a terrible idea, at least for the time being.",
  "I sat manning the food table, as I began to trip. The lights became more interesting, and the food became harder to prepare. What do you put a garden burger on, a bun or a tortilla? I smoked two bowls with some strangely young girls who'd somehow made it to the party. Someone else took over the food preperation, and I went to join the party.",
  "A group called DMT Labs was playing on the main stage. Children danced with glowsticks under the supervision of their mother, and then a strange, inexplicable game was played involving running after a person carrying a small bucket. I couldn't quite figure out what was going on. A large piece of strange artwork became the face of an alien, washed with subtle hues and colors. And the party went on, ravers and all dancing to the music.",
  "I began to enter a very strange place, which I'm not sure I can describe. As things continued, I became more rigid, and tight, as if all my bottled frustrations and feelings slowed down my body, and brought a sort of socially induced paralysis. I really did not wish to move, and found myself able to stand and sit supernaturally still, on a bale of hay near the dance floor. Colors that were dark, translucent, and neon at the same time formed simple alien/mazatecish faces, teselating through my vision. I decided to get away from all the people and wandered back to my campsite.",
  "Emotionally, I wasn't ok. All the horrible feelings combined with a sense of personal worthlessness and universal unappreciation coluded to make the trip a very dark and strange one. I walked around with a slightly bitter feeling, trampled through leaves, and found myself on a hillside. The moon was surreally bright, not quite full yet, washing the scene with a pale white light. I would stand in one place, 20 minutes later move a leg and then the rest of my body a few feet away. I stood and stared at the trees on the top of a hill. In between these trees I could see more of the translucent dark neon, painted in rectangular blobs between the trees. The sky filled with small dark rainbows, and the occasional small ufo invasion.",
  "So I walked another few steps and found myself standing on a thick floor of what I think were roots, elevating me several feel above the ground. I stood in between bushes, trying to come to grips with the unpleasent emotions that beset me. I remained there for quite a while, then back to the campsite, where our inebrated neighbors had a nice campfire going. So there I remained motionless for quite some time, until, thankfully the drugs wore off.",
  "I eventually went back to the dance floor, sat by the fire there, a gave a very attractive girl with whom I'd been flirting a hug. It was shortly after that I was brutally rejected and ditched, which pretty much kicked what remaining bravado was holding my composure together. I'm not quite sure what I did until morning, beside sulked. It wasn't that it was a huge deal, it was more the trigger that brought the entire night together. So I thought about feelings of lonelyness, and whined to myself inside my head.",
  "The same girl, most likely as an apology, gave me half a shroom candy. Sunrise, a dj on acid, and the cleanest sounding sound system I've ever heard at a rave conspired to end my self pity. I danced behind a yurt that someone set up, out of view from all. The music, once again, was amazing. I danced and then as bright golden bolts of sunlight streamed through the trees, I sat and watched the light as the dj greeted the sun with music. There I sat for some time.",
  "Something very strange happened. I began to trip again, harder and harder. As I've never had a hallucingenic experience like this, I will attempt to describe. I sat looking a leaves, and they started to become bright white, and washed with color. They became things, a brilliant white rose on a black background, faces, pictures drawn into the ground. If I sat staring in one place I would trip harder and harder. I was in a world similar to that of salvia, but unlike salvia I wasn't blown out of this world, it was more like salvia world became mine.",
  "I loved it. I sat contemplating my new reality, and then noticed that the ground I was sitting on was extremely slanted. Obligingly, the ground changed it orientation for me, clicking around at 25 degrees a second. While somewhat disorienting, it was fun, a world wide rollercoaster.  Hiding in my tent, I laughed, cried, then laughed again, as I cycled through my emotions. Behind my eyelids lay squares of white and robin blue, pulsing to the dull thump of the beat from far away.",
  "Eventually, unfortunetly, this wore off. If I could, I'd live my life in that world, for it was much more beatiful than my own. Reality again (more or less). Loafed around, got over the night before, and spent the day in contemplation. Eventually night fell, and nothing really needed to be done. Hitched a ride back with a father and his young son, and was dropped off outside my apartment. I wish I could have given them something for the gas, but I had absolutely no money. Bed, and the end of this story."
 ],
 "erowid": {
  "id": "62657",
  "citation": " As. \"The World I Prefer: experience with Voacanga africana & Mushrooms (ID 62657)\". Erowid.org. Dec 14, 2009. erowid.org/exp/62657",
  "substance": "Voacanga africana & Mushrooms",
  "views": "13090"
 }
}
