{
 "id": 10589,
 "title": "Amp'd Without the 'Edge'",
 "date": {
  "submission": "2009-06-16T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Speed King",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Amphetamines"
  },
  {
   "time": "0",
   "amount": {
    "number": "1400",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "St. John's Wort"
  }
 ],
 "report": [
  "I was prescribed Adderall once I was diagnosed with ADHD, at the early age of 17.  My doctor literally asked me what dose I felt was fit, based on my illicit experimentation a few years prior! During the summer of 2006 I found that I hated the widely dispensed extended release formula (20mg XR). This schedule never granted me the ability to eat enough, made it easy for me to chain-smoke, and interrupted my sleeping cycle.",
  "I am now prescribed a daily 30 mg. dose of generic, non-extended release formula Adderall, or amphetamine salts as the bottle reads.  I much rather eat and sleep well as opposed to getting revved on Coast to Coast all of the time, so I take the meds sparingly.  Doing so keeps my tolerance low and thus makes the medication more effective when it comes time for me to hyper-focus or be the life of a party.  Partying/Drinking under the influence of Adderall and other drugs is a fools game just to remind you.",
  "When Im not rolling with Bennie and the Jets, I down a daily dose of St. Johns Wort (1,400mg), which I have come to love more than sweet Mary Jane!  St. Johns is like a guardian angel to me, the effects arent overpowering or dominating, but there in the back round to positively guide and sooth my emotions.  I find it hard to think negatively and really appreciate life when my buddy John is with me.  Ive also noticed that I have much more patience, politeness, and appreciation for music and art.  There may be even a slight aural distortion I experience, but it may be just a placebo effect.  At any rate, I cant complain!",
  "I was warned by a quack not to mix St. Johns with my prescription.  He couldnt give me a definitive reason why, and it turned out the good doctor wasnt familiar with (or perhaps secretly opposed) the OTC Godsend.  Another physician told me to try it out with caution.  So I did, and now I wont take Adderall without St. Johns Wort.  St. Johns Wort, in my experience, doesnt noticeably weaken the effects of amphetamine, but the side-effects are dramatically reduced in severity.  No longer do I become irritable while speeding along, snapping at anyone who dares say hello.  My clarity of thought is further heightened, but with an upbeat twist.  Simultaneously I will feel positively motivated with St. Johns help, and hyper-focused with amphetamines aid, the dynamic duo joining forces, allowing me to accomplish more and focus longer, all with a smile!   At times I even feel the urge to eat, which I never experienced with taking Adderall alone.  The dreaded crash seems to lose a modest level severity, but St. Johns doesnt help much in putting me to sleep.  For that, I have Valerian and Kava.",
  "Bottom line, this has become one of my favorite chemical combinations.  It takes the edge off of Adderall while not diminishing its potency, and boosts my morale enough to see a boring assignment through.  I hope to further experiment increasing the potency of Adderall by taking it conjunction with St. Johns Wort and Gotu Kola, but thats another story."
 ],
 "erowid": {
  "id": "62720",
  "citation": " Speed King. \"Amp'd Without the 'Edge': experience with Amphetamine & St. John's Wort (ID 62720)\". Erowid.org. Jun 16, 2009. erowid.org/exp/62720",
  "substance": "Amphetamine & St. John's Wort",
  "views": "17109"
 }
}
