{
 "title": "First Roll, at C. Creek",
 "author": "maruchanman",
 "citation": " maruchanman. \"First Roll, at C. Creek: experience with MDMA (ID 10590)\". Erowid.org. Nov 14, 2001. erowid.org/exp/10590",
 "substance": "MDMA",
 "bodyweight": "165 lb",
 "report": "<p>I arrived at C. Creek 2001 on Friday at about 4:00 pm in the afternoon.  I was 20 years old, but it was my first festival of any kind.  I went with two friends, they were brothers and had been to C. Creek, Phish concerts, and other festivals before.  I was offered ecstacy, LSD, nuggets, and hash about 5 times each before even getting in the place.  I immediately bought hash and an 1/8th of nuggets, as I was holding schwag.  We had not planned on taking E that weekend or any other, but me and my friend impulsively decided to buy two pills off this guy who looked pretty high.  The pills were euros, the big ones that look like a tylenol tablet.  I could tell they had been scraped, and I could not really see the logos.  Thinking we had stupidly bought tylenol, I took my pill at 4:30 and my friend at 5:00.  My friends set up their tent, and finished at about 5:30.  I had sat down, had a few beers, and smoked a couple of bowls.  Right about when the time my friends were done setting up the tent, I started feeling pretty good.  I figured it was the beer and weed, as I thought I got ripped off on the E.  I started to feel weird sensations in my body as I sat and drank, and felt myself becoming happier by the moment.  I started rambling about how great the weekend would be, and how happy I felt.  My friend, who was starting to feel pretty good himself, replied 'It's because you're rolling.' Upon hearing this, I felt my jaw clatter, and knew he was right.</p><p>I immediately dumped out my beer, and drank some water.  Within a few short minutes, I was unbelievably high and felt unbelievably great.  My two friends, one rolling and one not, went for a walk.  I went in the tent, took out the half ounce of shwag I had, and began rolling huge joints.  Then I walked up to the stage in my bare feet happy and smoking a fatty.  The next three or four hours were a blast that I can not remember all of.  I saw a few bands, the only one I really remember was Vermin Furley.  I was dancing up a storm, with a newfound energy and a great band playing under the tent.  I was not horny, which I had heard was common.  In fact, I felt extremely content, and it seemed that everyone I met or spoke to was my friend.  I could tell their was no way me or anyone else on E would ever do anything that could hurt someone.  The first couple of hours were very intense, and I was thinking that E was the best thing ever.  I remember how much teeth grinding I did, and how every time I sat down I started tearing grass out of the ground.  These 'ticks' were kind of freaky, as I have handled LSD, mushrooms, and insane amounts of alcohol without any weird side effects.  The pill I took was almost completely intact, unlike my friend's, so I was rolling even harder than he was.  The teeth grinding continued even after the roll was done, which led me to the obvious conclusion that E was not the best thing for one's body. </p><p>Coming down was not bad, though there were waves of depression.  Smoking weed seemed to slow me down, and didn't do anything while rolling or coming down except waste money.  I have taken E a couple of times since then, with nowhere near as powerful an experience as my first.  I don't know if I would take it again, my first time was completely impulsive.  The week after rolling the first time, I felt great.  I wasn't fiending for E, but I kept thinking about how awesome it was.  By third time I took it, I was moody and seemed lost in my classes for a few days.  At that point, I figured I should wait a while before doing it again, if ever.  I enjoy ecstasy and other psychedelics, but I don't think my mental makeup is that of someone who should do them a lot.  I pretty much stick to cannabis, which I smoke daily.  By the way, I am attend the University of Connecticut and have a 3.7 GPA, which goes to show that saying you can't accomplish anything or take care of your responsibilities because of drugs is merely an excuse for being lazy, irresponsible, and immature about what you put into your body.</p>",
 "year": "2001",
 "id": "10590",
 "gender": "Male",
 "timestamp": "2001-11-14T08:00:00.000Z",
 "views": "7936",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Alcohol - Beer/Wine"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Cannabis"
  },
  "2": {
   "time": "",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
