{
 "title": "I Wish I Could Replicate the Experience",
 "author": "Flipkase",
 "citation": " Flipkase. \"I Wish I Could Replicate the Experience: experience with Shwag (weed) (ID 10598)\". Erowid.org. Apr 1, 2008. erowid.org/exp/10598",
 "substance": "Shwag (weed)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "7 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I hadn't smoked weed in well over 2 years when I decided one night to take a friend up on an offer to get high and go to the school's homecoming football game.  We acquired a dugout and a one-hitter from a friend and proceeded to smoke approximately 7 hits each.</p><p>Initially I was dissapointed that I wasn't feeling the effects at all, and began to think that maybe what we had smoked hadn't been weed at all, and that I wasn't going to feel anything that night.  On the car ride to the school, I began to feel very relaxed, and out of body, almost.  As I looked out the window nothing seemed quite real.  I decided then that I didn't want to go to the game, and instead would prefer to sit at home and study the wonderful effects I was feeling.</p><p>I noticed as I walked that my limbs seemed to be working completely under their own control.  As I walked my legs felt as if they were controlling themselves, and there seemed to be a very powerful force pulling me around.  If I would lean heavily to one side, the force would pull me back, as if I literally could not fall over, the force would not allow it.  The night was wonderful.  As I typed on the keyboard, my hands seemed to float, and perfectly coherant sentences would turn into incessant ramblings, or just random letters being mashed.  Yet they all seemed to make sense.</p><p>Since that night I have not been able to replicate that high.  I have also not been able to get my hands on anything better than shwag.  I am wondering if the weed that I smoked that night was possibly KB, but I have no clue.  All I know is that every high I have had since that night has been a let-down, and I long for the wonderful feeling that was present that evening.  I will continute to attempt to locate some high quality weed, and attempt to replicate that nights high.  If all goes well, chances are I will become a 'pothead,' but would it really be so bad?  =)</p>",
 "year": "2001",
 "id": "10598",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-01T07:00:00.000Z",
 "views": "3879",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "7 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
