{
 "id": 1060,
 "title": "To Play the Breathe Divine",
 "date": {
  "submission": "2000-09-09T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mythago",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "setting:  my home, near my wall-painting of entwined blues, purples, and pastel yellows, early morning (2 am)",
  "intent:  to touch the familiar play of silverlove",
  "I drew in three deep breaths of N,N-DMT essence, pausing between each one to hold the magic in my lungs. I didn't really exhale on the third breath. The tingling skin blessing of this spirit molecule greeted me, and I breathed slow high breaths, my lungs spilling over. I quietly filled them deeper, until my breath was all the way inside. Colors swam around and interrupted the room I was in and my sense of the world. A new truthspace opened, wider and more colorful as I breathed. Active DMT shapes danced. The geometric boxes and diamonds contracted and expanded, and I saw they wanted to teach me a way to breathe. I released to the rhythm, and the breaths came like slow quiet laughs, without noise, just breathing.",
  "This way of breathing was so peaceful and clear I worried for a moment that I wasn't breathing at all. Could I die?",
  "I trusted my innocence, my intent, and I trusted the DMT ally. Mouthfuls of air went in and out, a parachute of life. I wasn't consciously controlling my breath. I was breathing so naturally I was absolutely astonished. To breathe the divine... and I remembered that in at least two of my previous DMT visions I had breathed like this, and in at least one mushroom journey.",
  "It's a kind of breathing that happens from absolute trust, from absolute play. I had forgotten. I knew that it would take some concentration to breathe like this when not in kaleidoscopic DMT land.",
  "For the color dancers were pulsing, spinning, making liquid cartoons. Not really animations, but clear shades of color, forming a toy playground. They made this delight of breathing easy. All the playground objects were alive, including the swings and the merry-go-round. A silvery-blue arch of plastic color formed and collapsed in the center. A toy little boy, or maybe she was a little girl, jumped along this object, sliding down it, hanging on with small fingers, leaping into the grass. I felt a sense of responsibility begin to resonate within me, both for the knowledge of my wife and my coming child, and the deep psychedelic responsibility of my shamanic-like path. I glanced away briefly and one of the DMT beings, tall, thin and golem-like, grasped my head and turned it back to see. The shapes kept moving, and the child was my innocence too, and it was asking me to promise to share that innocence completely with our shinebelly baby when she/he births and grows and becomes human.",
  "The toy child ran up the blue arch slide, and down the other side.",
  "A starsparkle of love burst in me just then, and my breath followed the divine pattern of the now familiar ecstatic sweetness... the child entity waved and the playground objects tinkled laughter. 'Come play again,' they invited.",
  "The alien DMT hues of the playground begin to dim, the space contracting. The room in my everyday universe began to gleam through on soft rays.",
  "Just before the DMT vision went completely ethereal, Silvergirl crouched down on my right, and smiled.",
  "'Beautiful sister,' I whispered, 'I love you. I was seeking you.'",
  "'I know.' She didn't actually speak, just smiled. Her eyes shined in mine and I think I kissed them.",
  "Then she slid sideways and melted into reality.",
  "I sat awed for a few minutes.",
  "Then my curiosity led me to try something. I heated the DMT pipe again, and took two more deep breaths.",
  "The skin tingles rearrived, and my breath moved in a divine rhythm again, though not quite as sure. And this time when the colors came they were dark and smoky around the edges. And the gargantuan guardians showed up, two of them. They hunkered in front of me, in front of the spinning DMT mandala, and wouldn't let me enter. They sent thoughts to me, and said I should not be so hasty, that I should take my time entering this space. Silvergirl had her arms around my neck, though her flesh was very ghostlike. She said I'd satisfied my question, that smoking the DMT magic in succession in an effort to surf back into the DMT reality didn't really work. Oral DMT is the answer to stay there longer, without the keys being taken away.",
  "The guardians nodded. 'Trust her,' they said. Then they bunched their muscles and the DMT faded into a dream-like sequence, very male and cocky with me and other beings working out and flexing muscles. Silvergirl laughed and that dream vanished.",
  "Suddenly I was back in reality again, just me, and my thinking was very free. The lines of my thoughts spiraled infinite in all directions. And I remembered how to play with that otherworldly divine breath. I swallowed a smile. I would have to practice."
 ],
 "erowid": {
  "id": "131",
  "citation": " Mythago. \"To Play the Breathe Divine: experience with DMT (ID 131)\". Erowid.org. Sep 9, 2000. erowid.org/exp/131",
  "substance": "DMT",
  "views": "35532"
 }
}
