{
 "id": 10601,
 "title": "A Good First Impression",
 "date": {
  "submission": "2002-02-18T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Circe",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>My first experience with mushrooms was a good one, fortunately. It all started with boredom... I was sitting around one weekend and conveniently, a friend had a shroom hook-up. I had wanted to try mushrooms for awhile so I was eagerly awaiting the experience. Not too much preparation went into this trip, considering that the mushrooms were talked about, bought and eaten within 5 hours.",
  "I was at a friend's house. My boyfriend was there (which was who I tripped with) and 2 or 3 other friends who were just going to stick to beer and weed for the night.  My boyfriend and I each ate about 2 fat caps and 2 stems around midnight and waited. He started playing a video game with the others and I paced around, a bit nervous at not knowing what to expect. I curled up in a chair, fetal postition, and looked around. That night I was dressed comfortably for the trip... a sweatshirt and pajama bottoms... The pajama bottoms were flannel and white, with a pattern of little black cartoon bats all over. 30 minutes had gone by since we dosed. Looking at my pants, I started to trip...",
  "Staring at the bats, I noticed them starting to flap their wings. I found this incredibly amusing and started to laugh. However, I felt a little silly just laughing randomly in a room full of somewhat sober people and planted a hand over my mouth, trying to stifle any laughter. I racked my brain trying to figure out what the hell was so funny! I was fairly certain that there was absolutely nothing humourous going on at the moment so I sat quietly, my hand remaining over my mouth. About 45 minutes had gone by when the others finished the game and got up to talk, drink and smoke. I realized my boyfriend was no longer in the room... Must've went to the bathroom or something. Yep, definitely tripping by now.. I started to notice how everyone's face was green. And I couldnt really understand what they're saying... Not that I was really interested anyway... The others can tell I was tripping by now too, and approached me, hoping to scare me by making faces. I found this hilarious rather than scary. I started laughing hard and ran to behind a chair to hide.",
  "Everyone was staring at me!!!! This part was a little scary. I was peering over the chair to see if my tormentors had left when I turned to my right. There, I saw 2 of the guys there sitting next to me in chairs. The dog was there too, sitting between them, all 3 of them staring at me! And I knew who those guys were... I was friends with all the people in the house, yet suddenly I couldn't remember who they were. I couldn't remember their names... I couldn't remember my name!",
  "I had to move... I got up from the couch and walked around the living room a bit where the walls were slowly and steadily breathing. The room was alive! The thought didn't scare me though... It intrigued me. I loved it! I felt ecstatic, happy that I could share life with this room... happy we could breathe the same air. I moved on to the kitchen, feeling spiritual. I stood at the kitchen's entrance and watched as the kitchen stretched and grew before my eyes. I wanted to walk through the kitchen but decided it would be pointless since the room was constantly growing. I wouldn't make any progress. Better go back to the living room.... There, I focused on a lightswitch, watching it changed colors and then moved my attention to the blinds in the window and studied them carefully as they too changed colors and swayed back and forth as if they were underwater.",
  "Finally my boyfriend returned, highly recommending the bathroom. He had been gone for hours it seemed, and I told him how I had missed him. He was the only one I was able to recognize. We decided to go to the couch. The couch was big and purple and velvet..very comforting. However when we got there, we discovered a large red and white checkered quilt laid out across it. Have you any idea what red and white checkered ANYTHING does to a person on shrooms?!? I stood and stared down at the forming patterns for awhile. The red was really vivid and seemed almost menacing... so different from the soft pinks, greens and yellows cascading over the walls. I finally looked away and sat down next to my boyfriend where we both started to sink into the couch. We didn't mind... It seemed safe there.",
  "People continued to talk to us, trying to scare us and we did start to grow nervous. So much so that we each took a lace on my sweatshirt (You know the things you pull to tighten the hood ;)) and stuck it in our mouths, convinced they were 'life-lines' and we needed them to survive. Those laces quickly became like security blankets.. If one happened to fall out of our mouths, we would desperately search through the intricate labrynth that the couch had become until we relocated it and stuck it back into our mouth and continued to chew nervously on the plastic tip. Suddenly, someone knocked. We both focused our stares at the door nervously, asking repeatedly what was there. In walked the girlfriend of one of the guys there and we both relaxed. At some point, someone gave us each an orange tic-tac, which we enjoyed immensely and savoured for as long as possible.",
  "It was probably around 2am or so when I started to peak hard on the couch, colors swirling all around me. The room was still alive and breathing and now started to grow like the kitchen. It continued to grow until I felt like me, my boyfriend and the couch were miniature, and we were trapped in this gigantic room! Most everyone had left by this point and my boyfriend and I were left in the living room alone. I stared at my hands which had somehow turned 2-dimensional and orange...bright orange, and they seemed to glow. They were also strangely small.. much smaller than a normal person's hands. I started to worry about my abnormal hands, but was quickly distracted by the big-screen tv.",
  "My friend had put on a dvd of Cirque Du Soleil for us before going to bed. Now, I don't know if you've ever seen Cirque Du Soleil but it's a surreal combination of some very trippy shit in a circus atmosphere. This one act consisted of jump-ropers, doing some really fancy, impossible-looking tricks and there were so many colors and lights and so many people moving... and the music!!! The music was very fast and was scaring us so that we were pressed against each other, embracing tightly.",
  "We decided to travel to the bedroom where I discovered how soft and wonderful and cold the sheets were. We laid in bed, coming down. I closed my eyes and watched the colors pixilate for awhile before I noticed I couldn't breathe. I have asthma and must use an inhaler every night... and it surprised me that I was actually able to find and utilize the inhaler... correctly... Not much more happened... It just took a long time to get to sleep which was a little frustrating. The entire trip lasted about 8 hours...a bit too long.. the sun was up and I vaguely remember seeing the clock say 8:30 before I went to sleep. But otherwise, the trip was very positive and encouraging for the first time and I've appreciated many others since then.</p>"
 ],
 "erowid": {
  "id": "6276",
  "citation": " Circe. \"A Good First Impression: experience with Mushrooms (ID 6276)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6276",
  "substance": "Mushrooms",
  "views": "4548"
 }
}
