{
 "title": "Good Things Come in Small Packages.",
 "author": "Paulgasm!",
 "citation": " Paulgasm!. \"Good Things Come in Small Packages.: experience with Mushrooms & Cannabis (ID 10603)\". Erowid.org. Jan 19, 2007. erowid.org/exp/10603",
 "substance": "Mushrooms & Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>This had been my second time cultivating mushrooms, the first was excellant but I made some mistakes in their growth this time and had some horrible turnouts, in the end I managed to only get a small cut cake to grow some baby mushrooms on the side.  I had just spent the whole evening with my girlfriend and was taking her home (It's about 11 o' clock) and so I stopped at my Mom's house to tear everything down so I could start again,  First, I scraped off a small, small amount, and in the hopes that something would happen, consumed the little bit of shrooms (none more than an inch long).  Now the first time I had mushrooms I had five cakes booming with them, but I didn't store them properly, I just put them in honey and left them in the refridgerator hoping it would be enough.  I'm guessing over time they lost alot of their potency and so my previous experience left me to believe I needed alot more to trip on.</p><p>So I took them and figured I had a good two hours before I felt anything, yet not five minutes had passed by till I began feeling a bit funny, so I said bye and headed off to my Dad's house (a 30 minute drive).  In the car I felt immediately different, I have a blacklight in there and I've painted stuff all on the inside of my car (band names, symbols, and shit). I put on some Bad Religion and turned it up and started to sing along and I began feeling very loose.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>After a good 15 minutes of driving I approached a red light before I could get on the freeway and gun back home.  I sat at the red light for what seemed like ten minutes or so and it had to stuck on red because like three songs had already played, I was convinced that this traffic light was fighting me from understanding the knowledge the mushroom was trying to convey onto me.  So I turned right and went into a driveway and turned around and just as I got there the light turned red, I was astonished, there is no way that could have been by chance, the light was mocking me so I turned right, yielded and went through.</p><p>The rest of the ride felt kinda float-like and I finally arrived back home feeling very nice.  Parents were upstairs sleeping when I came home so I took out my heavy pipe, loaded a bowl and smoked that and another one, trying to delve deeper into the experience.  I then took a shower and closed my eyes, some story unfolded before me but there is no way I can recall any of it, nor all the patterns I witnessed with my eyes closed.</p><p>I finished up and rubbed down with a towel and it felt like the most sensual thing in the world, I couldn't get enough. I laid it down and went upstairs to my room.  I shown down my blacklight on my bed and turned South Park on, but I kept noticing color on the screen where there should be no color, the whole tv screen looked like a soft puddle of water and little drips kept forming here and there, I turned around and looked at the wall and fell into a trance for a good 15 minutes as I watched the plaster sway back and forth.</p><p>After a good dose of tv I turned off the set and put on Enigma's new LSD album and I turned on G-Force for Winamp. I found myself with my nose mere centimeters away from the screen completely entranced (probably not to healthy but oh well) I noticed if I stared kinda lazily at the screen the patterns became more intense and vivid, I tried to look at each tiny pixel and I started to notice an image behind that image that looked like faces, I was sure of it I saw rows of formless faces and I identified them as an ancient race that lives within everything around us, they are what give us insight to the world around us and they can only be witnessed if you concentrate hard enough.</p><p>Well, I finally turned it off and began playing Grand Theft Auto 2, I was convinced to take out this gang of people in black coats so I collected alot of ammunition and drove over there in a stolen car and starting shooting everybody and the cops came and I fired rockets at thier cars splattering them everywhere, this went on for a good hour or so.  Everything was still feeling wierd and so I turned off the game and the lights and went to bed.  I'm now reciting this minutes after I just awoke (feeling very buzzy, gotta goto school now) I'd never written one of these reports, but last night was such a cool (and highly unexpected) experience I had to share it with someone, hope you enjoyed this. Bye.</p>",
 "year": "2001",
 "id": "10603",
 "gender": "Male",
 "timestamp": "2007-01-19T08:00:00.000Z",
 "views": "2781",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(plant material)"
  },
  {
   "time": "",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
