{
 "id": 10608,
 "title": "Three Experiences",
 "date": {
  "submission": "2009-12-15T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Massi",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Voacanga africana",
   "form": "(seeds)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Various",
   "form": ""
  }
 ],
 "report": [
  "<p>For the last year, as a senior in HS, I have been smoking at least twice a day. Being a marijuana smoker for 3 years now, I have begun to experiment with other drugs. In terms of ideals, I don't try to romanticize my 'habits' too much. I would opine that I smoke weed because I am addicted and need it everyday, not because its a magical herb placed on Earth by 'Jah' or some shit.",
  "I have done psilocybe (sp?) mushrooms six times, ecstacy (took 2 pills which had the word 'ferrari' in their names), and acid once. I feel that though I have limited experiences with psychadelics, I have a decent understanding of how long a sensation is supposed to take, its intensity that it can reach, etc.",
  "I have sought to 'trip' three times now through the eating of Voacanga Africana seeds. I purchased them online. Sadly, I see now why there's a shortage in experience reports. There's not much to be excited about in terms of taking it alone.",
  "On my first encounter, I ate about 60 seeds but had already taken 3 grams of Psilocibe mushrooms, 2 ecstacy pills, .3 cocaine (about 3 lines), smoked several bowls, etc. Basically it's very difficult for me to judge what was doing what. I took the seeds near the 'peek' of my trip, only to feel an even worse nausea.",
  "My second time, I fasted for 8 hours before taking them. I grinded 40 seeds in an attempt to get rid of the supposed poison the seeds contain. I also ate 40 normal ones just in case the grinded seeds might not work (I am supersticious like that). I smoked a couple of bong bowls of some headies (supposedly Sour Diesel), and then sat for a couple of hours with a friend. Nothing happened past a weed buzz. The next day, however, my friend reported lucid dreams the likes of which he had never had before. At this point it would be prudent to note that he doesn't smoke weed more than two-three times a year.",
  "Today I took 120 seeds. I had not smoked any pot in two days nor taken anything else. I fasted from 9am to 4pm when I took them. Trip went as follows:",
  "0 h (4:00 PM) : Ate 120 seeds in 2 mins and followed up by drinking a big cup of orange juice.",
  ".5 h: Weird physical sensation similar to waiting for a shroom trip to kick in.",
  "1 h : Feel a mild mind buzz similar to when I smoke a cigarette (I don't smoke cigarettes). No distortion in perception.",
  "2 h : Lots of tingling in the head. Fast thoughts, similar to a avg dose of ritalin (again I don't take ritalin on any kind of basis, I've merely tried it a few times). Better concentration.",
  "3 h : Horrible nausea envelops me. Mild physical and mental buzz continues (less potent than weed).",
  "4 h : Nausea continues.",
  "10 h : Hunger returns from a day of no food.",
  "All in all, pretty lame.</p>"
 ],
 "erowid": {
  "id": "62805",
  "citation": " Massi. \"Three Experiences: experience with Voacanga Africana & Various (ID 62805)\". Erowid.org. Dec 15, 2009. erowid.org/exp/62805",
  "substance": "Voacanga Africana & Various",
  "views": "4638"
 }
}
