{
 "id": 1062,
 "title": "Ernchik-Ooh Ernchik-Eeh Ernchik-Ah Ah Ah",
 "date": {
  "submission": "2002-05-22T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Rorydaherb",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "freebase"
  }
 ],
 "report": [
  "I have been doing this stuff for a week or two now, and about 22 people have done it with me so far.  Today I met up with some friends, and after they freebased some, I decided to up the ante and try out 30 mg.  Prior to this afternoon, my highest doses were 20 and 25 mg.  But my trip was just out of this universe this time around.",
  "I laid down on the bed, rolling my head back and forth for a good ten minutes; my hands were in Monty Burns position (simpsons) and throughout this period, I was in whir-whir land.    For those of us who don't know whir-whir land, I vouch that it is similar to nitrous oxide. ",
  "This was a kind of head rush/head roll feeling, like with past experiences on 5-meo-dmt.  It has a disturbing chemical intensity to it (think: 'I am the DMT- Im gonna knock you off your ass buster!') but on the plus side it is chock full of mental visualization of intricate fractals.  They are much more delicate than acid visuals, the trick to them, is they warp me as I look into them.  They get smaller and smaller, more and more detailed, taking you deeper and deeper in.  It can get frightening, since there is no end, they eventually get too small to handle and I get so zoomed into some other plane of existence at that point that I feel kind of betrayed. ",
  "In any case, at some point something caused me to sit up, and I was suddenly in a completely different space.  It was definitely a semblance of the room I was in, but instead of being with my two friends, I was hallucinating that they were there, along with maybe two other dream-like people who (if I was in a dream) seemed to be friends, but who weren't actual people I know. ",
  "In any case, we were all together in this room, existing outside human time, in a kind of psychonaut time.  In my hallucinogenic fantasy, we were all hardcore trippers who had seen untold amounts of conscious realities.  And in this hallucination, we were 'talking' to each other about the places we had seen, and in a friendly way we were trying to blow each others minds with things the others couldn't handle.  Kind of like at the carnival, those bells you smack with the hammer?",
  "Well we each had a hammer and we metaphorically slammed it over the tops of our heads deeper and deeper or further up and out and high and intense.  And the way we would notch up the level like this was by saying a phrase of nonsense- like the title of this report.  Another was unchi-gee unchi-ga-unchi-goo goo goo.  And they got 'funnier and funnier' the farther we drove.  But eventually, I started thinking too hard and started anticipating how far we could go, and this was a bad idea, because the only time is now.  But any way, inside my hallucination they saw me coming down, and from this height we were in, bad got real bad.  In fact its never been worse in all my life. ",
  "In real life, at this point, events correlate with my tripping over a plug to my camcorder and falling into the VCR.  I am told that I started spinning around in circles on the floor.  But in my mind, I was racing through the bowels of my most horrible fear.  There was nothing in my mind like literal thought, though there was 'verbalesque noise' and this noise was all I actually was.  My consciousness had no sensory input, and all it was doing was being.  It was supposed to be being whatever I wanted it to be, but I wasn't really there behind the reins at this point. I was strictly an observer. ",
  "At this point there was a most wretched, cold, and living-dead noise that panned from left to right in my stereo field.  It was a low noise, and it sounded like: 'unchk-wow-wow-wow' whereupon it would turn the other direction and repeat.  But then I started wishing that I could escape this horrible existence, that consciousness was the ugliest thing in this world of infinite spirals.  But the operative here is that I wished something.  Suddenly there was an I again.  And right then I heard my two friends in the real world, asking if I was alright. ",
  "Zoinks! Yes just me, back again, still tripping but its nothing like what I just went into... What really irks me here in retrospect is just who were those fellow trippers? How far did they go, and next time, how far will I be able to go with them? It is eerie that they seemed timeless, not people I know in this world but people the real part of my self knows, a part of my self that this part of my self which is writing ought to know better. ",
  "Rolling back around the brain, over and over in every direction, turning over onto oneself, aimed at some vague point of unity that consciousness forever circles, trying to find the destination but all there are is spirals.  The only sense in it all is to make sure they arent downward spirals."
 ],
 "erowid": {
  "id": "13101",
  "citation": " Rorydaherb. \"Ernchik-Ooh Ernchik-Eeh Ernchik-Ah Ah Ah: experience with 5-MeO-DMT (ID 13101)\". Erowid.org. May 22, 2002. erowid.org/exp/13101",
  "substance": "5-MeO-DMT",
  "views": "4702"
 }
}
