{
 "id": 10624,
 "title": "Helpful for Meditation, or Feelin' Stupid",
 "date": {
  "submission": "2007-05-22T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chuteboxe",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Pharms - Zaleplon",
   "form": "(capsule)"
  }
 ],
 "report": [
  "I have come to realize in this world that there are many ways to achieve a sense of self, and although this can tear one's heart in two a sense of self is neccesary for meditation. Getting in complete touch with one's self. Letting your body become a conduit to which your subconscience will flow. I have also realized in this world that morality is transcient and almost without definition. The simplest and most relevent (to this experience report) example I can give is the prescription drug Sonata.",
  "I was prescribed this drug after the failings of such other non-benzodiazepines I had been on previously such as Ambien and Lunesta. The first thing I realized was this wasnt a pill per-se... no, Sonata comes in a capsule. Considering my past experiences with legions of mood-altering chemicals both illicit and licit, I decided to pop one open and give it a try. After snorting 1, 10mg pill I felt immediate relaxation but not too pressing of a relaxation. What I mean by this is that I was relaxed but not sedated.",
  "I was not experiencing other efects I had read from 10mg insuflation so I opened another capsule and insufflated away! In about 5 minutes time I had snorted 20mg of Zaleplon and less than a minute after snorting the second pill it was like something hit me in the face. As a kick-boxer and amateur mixed-martial artist I know the feeling of waking up after being knocked out, not sure of where you are, with a tremendous headache. The feeling I experienced from snorting 20mg of Zaleplon was just that, minus the headache. I was truly 'feelin' stupid'. It was recreationally fun no-doubt, but from that point on I typically stuck to snorting only 1 of the 10mg capsules at a time, especially when I learned of its power as a precursor to meditation.",
  "For some yet-to-be-explained pharmacological reason, Zaleplon, unlike any other substance I have used, when used the right way and in the right dosage (snorting 10mg in my case), causes thoughts to come spilling into the immediate fold much like they do at the tail-end of an intense session of meditation. I noticed that when I dose immediately before meditation, which usually lasts from 20-40 minutes, my subconscious thoughts flow and heighten. Its like a pipeline to the subconscious is opened and only expands as the meditation continues."
 ],
 "erowid": {
  "id": "62895",
  "citation": " Chuteboxe. \"Helpful for Meditation, or Feelin' Stupid: experience with Zaleplon (Sonata) & Meditation (ID 62895)\". Erowid.org. May 22, 2007. erowid.org/exp/62895",
  "substance": "Zaleplon (Sonata) & Meditation",
  "views": "13441"
 }
}
