{
 "id": 10639,
 "title": "Death and Rebirth",
 "date": {
  "submission": "2007-05-23T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Opaleg",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "seeds"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "seeds"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "1",
    "unit": "cap"
   },
   "administration": "oral",
   "substance": "Amanitas",
   "form": "plant material",
   "specific": "A. muscaria"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "6",
    "unit": "seeds"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "seeds"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "1",
    "unit": "cap"
   },
   "administration": "oral",
   "substance": "Amanitas",
   "form": "plant material",
   "specific": "A. muscaria"
  }
 ],
 "report": [
  "I want to start with a short comment, one should never mix two substances that they have never experienced, regardless of research invested. I have only tried Ghana HBW and was not familiar with the Hawaiian type or with amanitas. Note that this is not being written as it happened, but I was sure to notice the milestones.",
  "+0:00h I cut 3 seeds in half and drink them with a soda. I cut a cap into three or four sections and do the same to consume them.",
  "+0:30h I know that for both substances, this seems to be the point of activity, however I did not notice a thing.",
  "+1:30h I start to feel lightly different, insofar as feeling ambitious, and I start feeling really creative and write poetry. At this point I take 6 seeds and another cap of amanita, using the same method.  The combined weight of the 2 caps was 8 grams. This was probably what meant the difference between a very pleasant experience and the very real nightmare I had. I was dumb enough to mix these two things, instead I tried boosting it.",
  "+?:??h Nothing beyond the above. I notice that time seems to go by incredibly quickly.",
  "+~7:00h I was slammed with effects. I feel twitchy, but it would be explained better as shifting in bed, only I was awake and not in bed. I could not stop moving and shaking and shifting around. I keep writing and my girlfriend comes home, and I explain the experience to her. This was just the beginning of the nightmare.",
  "We go to Taco Bell and I get about three things, when I pump gas I bound and leap around from the car, to the store and back. So far the experience is actually not unpleasant, but I notice a sick feeling.",
  "+~7:30h I try to eat, but only manage to get down a quesadilla, looking back, this may have saved my life, and certainly allowed me to vomit the poisons out later.",
  "I try to lie down and go to sleep, and I cannot. I notice split second lapses in time, probably drifting in and out of sleep. Every instance of the time lapses, I 'wake up' terrified of something unknown.",
  "+?:??h I must have fallen asleep as I wake up feeling like I slept, but I know something has gone terribly wrong. I cannot stop shaking and shifting around and I feel like I am being tortured to death as I get nothing from the very little sleep I manage. I beg my girlfriend to kill me, I beg myself to die and I keep wanting to go to the hospital but I don't want the police involved so I try waiting it out.",
  "I go to the bathroom and wretch, the vomit is slightly dehydrated, so each hurl only pushes it out further and further, then a torrent of vomit manages out. This continues for a while and I am very glad to get rid of the poison. Then I feel very weak, but a lot better. I intermittently return to vomit, and I drink water to rehydrate, a lot of water.",
  "From here the worst effects end, and I slowly just shake slightly, and find it hard to type or walk. My mind feels broken and I feel like I am slowly dying. My heart beats incredibly fast for hours.",
  "I try sleeping but can't for more then a few minutes or seconds.",
  "+9:00h I continue to rehydrate but my body absorbs it too fast, then I pee, and drink more water. The whole time my girlfriend helps me and consoles me. While she sleeps.  It was early morning, about 5 to 7 a.m. so I understand. I just go pee and drink water.",
  "+11:00h From here on I just shake slightly and feel sick. I enter a cycle of feeling my soul leave my body, then feeling fine. I keep trying to sleep, but can't. For another 9 hours I feel terrified of my girlfriend leaving for school, then work. I feel frail and weak, vulnerable and other things. When I finally manage to fall asleep at about",
  "+20:00h I sleep. I wake up the next morning feeling happy to survive. Throughout the day I feel nothing negative. I would randomly shake and feel sick. I would also recall the experience and feel terrified."
 ],
 "erowid": {
  "id": "62950",
  "citation": " Opaleg. \"Death and Rebirth: experience with H. B. Woodrose &  Amanitas - A. muscaria (ID 62950)\". Erowid.org. May 23, 2007. erowid.org/exp/62950",
  "substance": "H. B. Woodrose &  Amanitas - A. muscaria",
  "views": "17060"
 }
}
