{
 "id": 10640,
 "title": "Falling In Love With Me, or 10101 Repeating",
 "date": {
  "submission": "2007-12-01T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JeffreyJohn",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "plant material"
  }
 ],
 "report": [
  "I would definitely classify this a Glowing Experience. The best, and most fulfilling trip (or experience thereof) of my life.",
  "I spent the previous day with an old friend of mine whom I'd recently randomly come back into contact with, in a neighboring city to ours, at his friends' house. I went because I wanted Acid, they went because they wanted to visit their friends. They sat and drank and we all talked and smoked, and around 10:30pm we finally left, but we went to the store so they could go shopping for some food for their house. This took, literally, until 1:30am to complete. Me and my friend sat outside while his sister waddled around the store. Eventually we left and I got home at about 2:30, and had to bring my mom to work at 4. I FINALLY got home and took the Acid, 1.5 hits, at 4:51am. As I sat there I smoked a couple joints and didn't expect much at all.",
  "Little did I know it would turn out to be the most confounding time of my entire life. I sat at my computer, in my basement bedroom waiting for it to come on and it started to, and I was freaked out because it was only a hit and a half and I didn't expect anything. As soon it started getting intense and I decided to stop sitting at my computer and do something real, my electricity phased out and off, came back when I said 'THE FUCK!??!' and phased out and off again. This confused the hell out of me and I asked my dad what was going on, he was in the shower and said 'I dunno, but I just about didn't have enough water to get the shit out of my hair!' and I went downstairs and sat in my room in the dark, wigging out at the sound of my dad walking on the wooden floor above me until he finally left for work.",
  "I went outside and stared at the beautiful forest that is my yard. It was fucking perplexingly strange and new. The entire scene would (obviously, on acid) repeatedly meld together in a fractal pattern and begin to melt away in pieces leaving fluorescent purple behind it. I started getting scared and worried that I'd have a 'bad trip' and began calling my friend J, and even his ex-girlfriend, to come pick me up so I could ride this out at his house. He's sort of my trip mentor. We've had innumerable DXM trips together, he's done a thousand times more drugs than me, and my first LSD trip was with him. I soon regretted flipping out and calling for help after I relaxed some, and sent them text messages saying 'ok nm the flipping out thing, I'm fine, sorry..'",
  "My thought processes are indescribable at this point, but as I convinced myself to stop being scared of what was going on, I got really horny for no obvious reason.",
  "I went in my room and took care of myself and had a MIND SHATTERING orgasm and laid in my bed and shuttered for about fifteen minutes. So I did it again. Same results. Won't go into too much detail, other than to say that the post-orgasm shutter was a fantastic world of fluttering electric blues in beautiful open space.",
  "I went to the bathroom and was thinking about how I'm always so concerned with the fact that I'm alone and wish I 'had somebody', and how paradoxically happy I make myself and how no one has ever been as nice and caring to me as I have. I fell in love with myself. Not in an egotistical way, but I did. I got off the pot and the thought I had while rising that I finished saying to myself as soon as I was in front of the mirror was 'Of course it's you, who would it possibly be but you?'",
  "I looked in the mirror and at the exact moment that I thought that and saw myself, the power phased back on. I smiled a huge smile and realized how much I love myself. I saw myself as an adult for the first time (I'm twenty), rather than the childlike unsatisfying face I normally find in the mirror. I talked to myself for a while about the good times I've had, how I know everything I've ever done, embarrassing or otherwise, and didn't hold any of it against me.",
  "I took a shower because I just came on myself twice and it was beginning to become unpleasant and dry. Obviously the most amazing shower of my life, it was unbelievably intense. I spent about half an hour washing myself and wallowing in the absolute phantasm of water cleanliness overwhelming echoing pixelated angelic sound smell site etcetera.",
  "It was now daytime, early pre-noon. The sun was glowing beautifully and each clouds above me looked like the faces of thousands of gods melded together into one enormous Godhead. I brought my computer out with me, plus some speakers. I listened to a little Sonic Youth, then some Mars Volta, and then decided to put on my favorite Trance album, Paul Oakenfold's 'Voyage Into Trance'. Regardless of his mainstream success, some of his albums are absolutely perfectly mixed. I did some Likwid Dancing as the PsyTrance set the mood for it, and was successful for the first time.",
  "I found one of my dog's toys with a ball on one end of a fore-arm length rope, and decided to do some Poi. I watched myself in the window and was amazed at my ability to do this to my impression. I'm never satisfied with my own poi or dancing or anything really because I always feel like I'm pretending and just acting like I know what I'm doing, which I usually am. This was different. I knew what I was doing because I could feel what was right for me. I'm practicing Poi heavily now, and plan on learning to skate board, glow stick, likwid dance, and several other flow-related activities. I noticed how healthily skinny I am now, and grew to love my shape/figure, and want to improve it. Part of my new Poi love is for exercising.",
  "After my parents came home and I hung out and talked with them for a little bit and then went to J's to chill and smoked some weed. I described what'd happened to him, and as he tends to do, he would repeatedly sneak up on me and do Blow-Ups such as blowing Vicks Inhalers in my face, which went all in my eye and mouth, and was surprisingly fascinating on Acid, possibly as great as it is on MDMA. He would randomly hand me things like his old/dead/tied glowsticks to play with, and I did, a lot. I also did a lot more Poi, and we swung a little together, while listening to some stadium techno. I can't remember who, but the song we listened to more than others was 'Raving Shoes'. Normally this type of music (stadium, happy hardcore, candy) doesn't do much for me as hollow as it is, but after having found my Adult Self and finding my own Poi/Dance style, it was extremely liberating and fun. It had been about 11 or 12 hours since I dropped the Acid, but it was certainly still going, as Acid tends to do. As soon as I got stoned again it came on as strong as it had during the beginning of the peak.",
  "I went home at around 5pm, and finally went to sleep at about 7. I had been up since... I would say 9am the previous day.",
  "During this trip I realized that the universe really is nothing but duality, and everything that happens can be written in Binary. Every event in universal history can be broken down into 'If Yes, Then No [but eventually yes].' Everything that's ever happened has been 'Yes?' or '1?' coercing 'No.' or '0' to say 'Yes/1' and vice versa. Sex/procreation is 'yes? no. .....yes? ....nnnno. Yes? .....eeeehhhh.... yes. ....Yes!!!', rebellion/government is 'YES!!! NO!!!!!' Life concerning death is 'Yes yes yes yes yes yes [...] No.' water carving out the grand canyon is 'Yes? ....no. No. No. No. A little. More. More. Yes. Yes. Yes.'",
  "Some other stuff happened but that's about the skinny of it."
 ],
 "erowid": {
  "id": "62954",
  "citation": " JeffreyJohn. \"Falling In Love With Me, or 10101 Repeating: experience with LSD & Cannabis (ID 62954)\". Erowid.org. Dec 1, 2007. erowid.org/exp/62954",
  "substance": "LSD & Cannabis",
  "views": "4290"
 }
}
