{
 "id": 10642,
 "title": "My Forbidden Love Bites Back",
 "date": {
  "submission": "2010-01-06T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Smithie",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "IV",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "During my sophomore year of college was when I really became a heroin addict.  At first I started out snorting lines and eventually I went to shooting up.  Well, I did this for a while and being in college I eventually decided that it was in my best interest to stop my addiction.  I did the whole dope-sick, craving, shaking, puking thing... it wasn't fun.. AT ALL.",
  "Fast forward to my junior year.  I was walking downtown one day and unfortunately enough, the safe-needle clinic was right across from where I get my birth control pills.  Well, I ran into a guy who used to run with a few junkies I knew and (once a junkie, always a junkie) I asked him where I could score a few good bags.  He walked with me down the street and I picked up a couple of bags of pure, brown heroin.  I had some syringes left from when I used to shoot, so just feeling bored I went back to my dorm room to have some long lost fun.",
  "I did the usual.  Took an alcohol pad out, wiped off the syringe and the vein on my left arm.  Opened the bag and tapped about 3/4 of the bag of heroin into my little metal cup.  I used to do a lot, so I thought I was being safe with only 3/4 of a bag.  I squeezed a bit of water into the cup and mashed it up with the end of the syringe.  I dropped my little cotton into the solution and watched with anticipation as it puffed up with the heroin mixture.  I slipped the tip of my syringe into the cotton and pulled the brown, sweet concoction into my syringe.  I pulled my elastic around my left arm, feeling for that vein that would soon be the recipient of my forbidden love that I had long ago professed never to do again.  I slid the needle into my vein, pulled back to get the blood in there to know that I had registered.  And then... pushed.",
  "All of a sudden I knew I had done too much.  OH SHIT!!! I said.  And then...",
  "I woke up on the floor.  I couldn't breathe and my pants were wet.  I had pissed myself.  The reason I couldn't breathe was the blood in my nose and throat, presumable from falling out of my chair and onto the wooden floor when the heroin knocked me out.",
  "I knew I had ODed and I crawled into bed crying because I knew that I couldn't call anyone without getting into trouble.  I was high too, so I didn't even want to get out of bed but the whole time I thought I was going to die.  My heart was beating slow and while I knew that eventually, it was going to be ok, it was then that I knew that I actually did have to stop and if I ever did heroin again I needed to be more careful."
 ],
 "erowid": {
  "id": "62959",
  "citation": " Smithie. \"My Forbidden Love Bites Back: experience with Heroin (ID 62959)\". Erowid.org. Jan 6, 2010. erowid.org/exp/62959",
  "substance": "Heroin",
  "views": "15637"
 }
}
