{
 "id": 10649,
 "title": "Cosmic Orgasm",
 "date": {
  "submission": "2009-10-05T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "M.G.",
  "gender": "Male",
  "weight": 55
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50",
    "grams": 0.05
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50",
    "grams": 0.05
   },
   "administration": "IM",
   "substance": "Ketamine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "IV",
   "substance": "Ketamine",
   "form": "liquid"
  }
 ],
 "report": [
  "I've had some years of experience with Ketamine and I've seen it evolve gradually regarding the levels of awareness and conciousness that I have been shifting into. Since I became more spiritual and self-aware my trips turned out to be more mind-expanding and deep self knowledge experiences, where I could see myself more clearly and beyond any illusory veils of distortion that my mind/ego may place in the usual basis.",
  "I had never tried any drug injected and in fact was very reluctant to since I don't like needles too much but it wasn't until this time that my friend and I decided to try it on since someone told me that snorted K was pretty much a waste. First we took 50mg each in one arm and after 30 minutes we did the other 50mg on a different arm. I had experienced the dissociation of identity before with insufflated dose but this time it was different, this time it took minutes to get to that peak but in a different level and intensity, it was as if I merged with the everything and I was part of all around me, there were no divisions, unable to move but experiencing oneness with everything.",
  "After a while we came back and I knew this was the moment, I wanted to experience it I.V. so we waited a little longer until my friend's motor skills were back to normal and then we shot it. As I had read that you may not be able to finish shooting yourself before it hits, I thought I'd be knocked out immediately but actually I wasn't, it took like 3-4 minutes and also for my friend was good time so he could do it for himself.",
  "We lied down, the light was dim by candles and the music was perfectly in sync for a cosmical trip. After a few minutes I wasn't there anymore, I felt a sudden rush, but not a physical rush the kind I have with xtc or Lsd but more of a conciousness rush, it was as if I suddenly entered the quantum field of the wholeness interconnected and downloaded a hell lot of information that was being channeled straight to my being. It was like a cosmic orgasm, it was like bliss. All of my spiritual knowledge just reinforced this feeling and took me higher than I would have never expected. I didn't actually leave my body, more like I travelled with my being, my conciousness to a place where matter was just an illusion and identities just a mere suit used to interact on this illusory world of matter. I could see my ego identity from outside and identify it for what it is, and I could see every aspect of myself that I knew was holding me back, but from an external, objective point of view. The most acknowledging feeling of every aspect of myself and how it affected me in each level of my life.",
  "I saw colors, actually I felt colors, I knew what red felt like and blue and then when I got into white it was like I was drown into a wave of blissfully white light, coming from the source itself, the source of all things, and this light took me straight to the source, where I merged into it and felt we are in the end attached on essence and that as separated I think I may be, I am always connected and nurtured at any moment by this source, I literally can describe everything as a cosmic orgasm."
 ],
 "erowid": {
  "id": "62998",
  "citation": " M.G.. \"Cosmic Orgasm: experience with Ketamine (ID 62998)\". Erowid.org. Oct 5, 2009. erowid.org/exp/62998",
  "substance": "Ketamine",
  "views": "15017"
 }
}
