{
 "id": 10658,
 "title": "What Movie Did I Even See?",
 "date": {
  "submission": "2008-09-20T07:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Picante27",
  "gender": "Female",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>I will start by saying that this report is largely about my experience with having to deal with my boyfriend's trainwreck of a trip (we'll call him 'Ace' for the sake of this report) while both of us were on mushrooms. I am known for having a great ability to keep my cool on any sort of substance I've done and definately had to pull out all the stops on this one. Both Ace and I are fairly experienced users of MDMA, cocaine, LSD, and marijuana. He had never tried mushrooms before and I had done them only twice with pretty fun results both times.",
  "Ace had gotten a hold of an ounce of mushrooms through a friend, but wasn't even sure what they were supposed to look like or if they were even good. He brought them to me, since I had done them before, and I informed him that he definately got a great deal since the bag consisted of a large amount of VERY LARGE caps. I had never seen caps this big before, probably almost 2 inches in diameter. We decided that we wanted to eat these before going to see the new 'Charlie and the Chocolate Factory' on IMAX. We recruited my younger sister and her friend to be babysitters and drive us there that night.",
  "While we waited for Ace to get home from work, I ate a small sandwich and a soda just to give some padding to my stomach before embarking on our journey. Ace ended up running a little late and, unfortunately, did not have time to eat anything before we left for the movie theater. Once we got to the theater parking lot, we pulled out the baggie of mushrooms that we had already divided into 1/8th of an ounce for each person. This is how much I'd eaten in the past and had good results with, so I figured it would be a good amount. I took into account that Ace weighs much more than me so I figured that he'd be alright eating the same amount, even though it was his first time and he had an empty stomach. BIG MISTAKE!",
  "We each chewed up our respective portions with water only and made our way across the parking lot (T+0:00). The line to buy tickets was HUGE and we stood there a good 15-20 minutes. I was feeling slightly light headed, but nothing to write home about. Ace, however, had started to sway back and forth and proceeded to start performing a very loud impression of Captain Jack Sparrow from Pirates of the Carribbean. We finally got our tickets and headed up the escalator (T+0:25), where it took all three of us girls (my sister, her friend, and myself) to coax Ace up the moving stairs and make sure he didn't fall backwards. It was obviously hitting him HARD already.",
  "We got into the theater and found our seats about 15 rows up. As we sat there, I began feeling as if every single person in the entire theater knew that we were on mushrooms and was whispering about us, paranoid much? Unfortunately, given the movie we chose, there was a larger than average number of children in the audience, which was seriously weirding me out considering I am a nanny by trade. I felt like all the parents were talking about me and thinking 'How can she possibly care for children for a living when she has the audacity to show up to a children's movie on mushrooms?!'",
  "Ace was being pretty quiet at this point and really just looking around a lot. I found out later, when he was able to hold a conversation again, that he was feeling similar paranoid thoughts as though everyone in the theater knew what we were up to. Once the movie started, I made it about 10 minutes before the hard core visuals started in (T+0:45). All the people in the movie looked like claymation figures and the music was very repetitive and rung in my ears for the rest of the night. I remember asking my sister's friend numerous times if the movie was animated. I was very restless and couldn't find a comfortable position to sit in the chairs and kept shifting around.",
  "About 30 minutes into the movie (T+1:05), I was pretty leveled out on my high, feeling the same visuals and restlessness as before and didn't seem to be increasing in intensity. Ace, however, began poking me repeatedly and telling me he had to go to the bathroom. I told him just to go on his own, but he persisted that he couldn't. My sister's friend finally agreed to go with him and he stumbled the entire way out of the theater. They were gone about 25 minutes and I was told that Ace refused to go into the men's restroom because he wasn't sure that was the one he was supposed to go into. He ended up wandering around the lobby of the theater for 20 minutes while my sister's friend followed behind making sure he didn't do anything that would get him kicked out.",
  "When they finally returned to the theater, my sister's friend returned to our seats and Ace just stood at the bottom of the stairs looking up with a terrified look on his face. The theater was pretty much at capacity and PACKED with people. He proceeded to go to the front row and sit down in the only remaining seat next to some strangers (2 adults thank goodness). We could all see him from where we were sitting and the people he sat next to were looking at him strangely. He kept turning around and looking for us, and I could see there were tears streaming down his face. Needless to say, the strangers were probably pretty freaked out to have some weird guy come sit next to them and cry through most of the movie.",
  "We finished the rest of the movie (T+2:00? I pretty much lost track of time at this point), and Ace met up with us at the front of the theater with tears still streaming down his face. He informed us that he wasn't actually crying, but that his eyes were just so overwhelmed with the pictures on the screen that they were watering heavily. We walked back out to the parking lot and got in the car where we all decided that it was still pretty early in the night and that we should find someplace else to go. I was still maintaining pretty well and was mostly just concerned about Ace's reaction to his first trip. We decided on going to grab some food for my sister and her friend and then going to a hookah bar nearby.",
  "At the Chipotle we stopped at, Ace and I used the bathroom (after being convinced that he was, in fact, a man and should go in the door marked MEN) and I just stood in there staring at myself in the mirror and the strange shapes my face was taking. I'm not sure how long we were in there, but both Ace and I had to be coaxed out by our 'babysitters'. We proceeded to the hookah bar and Ace kept trying to convince everyone in the car that it's okay to feel the way he was feeling because 'IT'S THE WEEKEND!!' I remember looking out the car window and all I could think was 'I am so glad I am not driving because I don't even know where we are in my own town'. I knew I had driven on these roads before myself, but could not comprehend anything around me.",
  "My sister's friend parked her car and as we were walking down a LARGE street towards the hookah bar, Ace just kept yelling out 'IT'S THE WEEKEND!!' over and over and over again. We found a seat in the front of the hookah bar and ordered a hookah and a round of waters. The place was EXTREMELY busy and loud hip-hop music was playing, which is not really my choice of music. My sister and her friend knew a few people there and were chatting with them. I was mostly just sitting quietly and enjoying the colors, lights, and people watching. I felt pretty paranoid still like everyone was watching us, but I just tried to keep my cool and make sure that Ace was doing okay. Our hookah was brought out and we each took turns smoking out of the hose. Both Ace and I were fascinated by the metallic swirly patterns on the hookah and chatted about this for quite some time. This seemed to calm my paranoia and I began feeling more comfortable and chatty with everyone at our table.",
  "At one point, one of the red hot coals fell out of the top of the hookah and Ace grabbed it with his bare hand to put it back in. We all gasped and told him to drop it because I don't think he felt the hotness on his fingers. He had a mild burn on his fingers but wasn't really too worried about it. He went to the bathroom (this time by himself) to run some cold water over the burn, and opened the women's bathroom door. There was a girl in there and he yelled at her to get out of his bathroom. As she walked out, he grabbed her on the butt and she began freaking out yelling and calling the owner of the place over. (Side note: we saw the girl at a club months later and apologized and explained the situation and we are now good friends with her.) I was very confused at this point and didn't really know what had just happened. My sister and her friend talked to the owner (whom they knew I guess) and smoothed things over so we wouldn't get kicked out. Ace came back to our table and I asked him what he just did. He told me that I was talking to him in his head in the bathroom (telepathy?) and told him to kick that girl out and grab her butt. This seemed plausible to me at the time and we sat calmly sharing the hookah and chatting about all the people around us for the next 20 minutes (T+4:00).",
  "We all decided that it was pretty late and my sister's friend dropped us all off at home. Ace and I went straight to bed where he passed out snoring almost immediately. I, however, lay there with my eyes closed and could feel my heartbeat in my brain. I began to freak out and think that I was dying and could see my soul floating above me and watching my body die. I am not a religious person and consider myself an agnostic, but I was sure that I was having a spiritual experience with myself. I probably laid there like this, with swirling colors and shapes surrounding my body, for a good hour before I finally fell asleep.",
  "We woke up the next morning and Ace was able to tell me now, with more clarity, what he had experienced the previous night. He said that he had lost all identity and didn't know what his name was, where he was, if he was a man or woman, who he was with, etc. He told me I would have a very hard time getting him to try mushrooms again and he got rid of the rest of his stash pretty quickly after that. I quite enjoyed myself that evening, on the contrary, and have tripped 3 more times since then with great results. I've tried convincing him that he would have a better experience if he changed a few things from his first time such as, eating before taking the mushrooms, eating something WITH the mushrooms, being in a calm/ non-public setting, and not eating so much of the mushrooms. Lesson learned I guess.</p>"
 ],
 "erowid": {
  "id": "63039",
  "citation": " Picante27. \"What Movie Did I Even See?: experience with Mushrooms (ID 63039)\". Erowid.org. Sep 20, 2008. erowid.org/exp/63039",
  "substance": "Mushrooms",
  "views": "2623"
 }
}
