{
 "title": "The Bottom of the Rabbit Hole",
 "author": "Saca-Mental",
 "citation": " Saca-Mental. \"The Bottom of the Rabbit Hole: experience with DXM (ID 1065)\". Erowid.org. Jan 7, 2001. erowid.org/exp/1065",
 "substance": "DXM",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   "800 mg",
   "oral",
   "DXM"
  ]
 ],
 "report": "<p>\n4/10/00</p><p>Im fairly experienced with psychedelics and DXM, but last night I had an experience like never before (well almost never before). I found out just how far the rabbit hole goes down and whats at the bottom of it. Now, personally I believe this will vary quite a bit from person to person. Well, to let u know the dosage we're talking about here, I took approximately 800mg of DXM (not an action which I recommend, unless you really know your shit). Anyway, lets just say I knew what I was doing. Ive been preparing for two years for last night's trip. (I didnt say, hey, tonights the night; it just happened, so be careful - your next trip could be it for you.)</p><p>Well, once I got past the fourth plateau I realized I still had about 400mg left. I know my abilities and my weaknesses, so I said, hey, why not. Well, the next thing I knew I was falling down the rabbit hole like never before. I was turning in a counter-clockwise fashion while falling through inner space. All I had was myself and the music of Dr. Timothy Leary; the rest was all new. Many times I had to fight off demons and just about every other form of negativity out there. (White light, Sealing, Grounding, Incantations, etc... I used it all.)</p><p>Well, I finally reached the bottom and just like I had expected (and read about) there was a guide waiting for me. Once I had adjusted and realized I had really reached the spirit world, my next task seemed to be assigning a name to my guide. The first thing that popped into my head was Daemon, then I was like oh shit, some negativity must have slipped by. Well, I took steps to correct that problem and the next name was Macademian. I was like OK wait a minute; theres something seriously wrong here. Thats when I realized that my guide was nothing but an angel of light (the angel of light is nothing but a demon in white).</p><p>Thats when a long-time spirit friend came to my aid. It was Arroron the wise and mighty dragon spirit, who was truly my guide. He quickly saved me from the perils which I had gotten myself into. Arroron showed me around and helped me take my long overdue initiation. All in all, it was the most profound and fun thing that ever happened to me. Just imagine what could have happened if I didnt know what I was doing and if I wasnt quite so lucky. Oh wait, why dont I tell you what did happen two years ago, when I first discovered DXM, and I didnt know what I was messing with or have any background knowledge of the occult.</p><p>I dont remember all that well, but I got myself into the same type of situation. I figured, hey, Ive dropped acid a few times, I can handle a DXM binge. Well, all that I really remember was being attacked and defeated by a demon by the name of Rez. Just thinking of his name gives me the chills. I ended up possessed and I didnt know a thing about it. I had suicidal and homicidal urges. I would have these fits where Id tremble and shake and just totally psychologically wig out.</p><p>Well, I ended up strapped to a stretcher, in an ambulance, on my way to a mental hospital. I spent a week at the hospital and a year rebuilding my life from scratch. The shrinks told me that I had had a chemically induced psychotic break. Well, that experience totally fucked up my life. I went from being a responsible, honor role student to being a freak with problems on the emotional, social, mental, psychic and spiritual levels. Well, for some stupid reason I got back into DXM, only this time I knew what I knew and what I didnt know. The stuff I didnt know, I researched and found out. Im not claiming to be some DXM expert, but I know enough to trust my abilities, and my knowledge.</p><p>Now I bet youre wondering what the purpose of this page is. Well, Im not going to tell you whether you should or shouldnt use DXM, thats a very personal question which deserves much thought. I just want to say to you that, although DXM can be used recreationally, to have fun, its also a portal to another world which you didnt or dont even know exists. This world like all things is made up of both yin and yang (love-hate, peace-war, etc.). The consequences of misjudgment, negligence, or pure ignorance in this world could cost you everything (your life, your sanity, your dignity, your pride, etc.). Let me also note that at one point in my life I was extremely psychologically addicted to DXM. Recently, I have been using a lot more rarely and after last night's experience I believe I have accomplished what I've been trying to do for two years now. I see this point as a catalyst in my substance use.  I plan on retiring from DXM use and moving on to bigger and better things.  Reality being number one, but I also plan on exploring the options which shrooms and peyote have to offer.</p><p>I forget who wrote it but: </p><p>It was the best of times, it was the worst of times.</p>",
 "year": "2000",
 "id": "1065",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-01-07T08:00:00.000Z",
 "views": "10843"
}
