{
 "id": 10664,
 "title": "Frightening Overdose",
 "date": {
  "submission": "2007-06-21T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Inderalplease",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>For the first half hour after ingestion I felt nothing but an over looming sense of danger.  'This is weird,' I though.  I shouldn't be feeling it this soon.  It figured out later that I must have misguessed the weight of the capsule, as I had been bumping lines of a double dose months before and thought I had done more that half of it.  Ooops.",
  "At the half-hour point, the trip had started.  Effects were racy, very similar to an amphetamine psychosis, but with stronger visual distortion and perturbation.  Shades of Easter pink and yellow overtook the walls.  Shortly thereafter I lost my depth perception.  I could make things appear big or small at will.  As an exercise I sat on my bed, looked in front of me and made the door grow and my dresser shrink.  It was too much of a mind trip to handle that anymore, so I tried shifting my attention.  Black holes began rapidly appearing and disappearing in my field of vision, lasting 5-10 minutes.  It was extremely difficult to maintain balance, and from that point on I felt queasy for the entire experience.",
  "I was forced to sequester myself alone in my room, due to an overwhelming number of visitors in my house.  However, I noticed from hearing their conversations that I had lost my subjective viewpoint.  Listening to their viewpoints, I held no opinion, but only listened to theirs.  This allowed to perceive what they were really saying, what was going on in their minds, and frankly it was quite frightening in some cases.  People are not supposed to know about these things so easily.  The scary part is that states of psychosis tend to bring this out in people.  Many people, especially us stubborn minded Westerners, need psychosis-inducing drugs to understand just how subjective life really is.",
  "Anyways I digress and move on.  From this point I began to self-analyze.  It was a bit depressing, but not enough to really bother me.  Although life had been shitty for a while I was content and satisfied with myself.  A bit later, I had a desire to use my new mind frame to interact with people.  Unfortunately my speech center was still shot to hell, and I was so dissociated from my body and ego that communication was out of the question.  I realized I was so out of it I did not remember exactly when I dosed because I could concentrate on one thing long enough to add or subtract numbers.  This scared me for quite a while. ",
  "Luckily I knew to stay in my room, things would be much worse off I chose to socialize sans ego.  My mind continued to wander in circles thank GOD for experience.  If I hadnt experienced repeat-a-thoughts with acid so many times before it too would have caused me to freak out.  The experience eventually ended (perhaps at the 12 hour point?), and for a few after-hours, and maybe a half day after this I had slight loss of motor coordination and reflex, even after sleep (which was mildly difficult).",
  "Although the experience was quite hellish I really feel as if I gained from it.</p>"
 ],
 "erowid": {
  "id": "63086",
  "citation": " Inderalplease. \"Frightening Overdose: experience with 2C-E (ID 63086)\". Erowid.org. Jun 21, 2007. erowid.org/exp/63086",
  "substance": "2C-E",
  "views": "4631"
 }
}
