{
 "title": "A Cosmic Revelation Viewing a Meteor Shower",
 "author": "S. Hawking",
 "citation": " S. Hawking. \"A Cosmic Revelation Viewing a Meteor Shower: experience with MDA & Cannabis (ID 10676)\". Erowid.org. Jul 22, 2002. erowid.org/exp/10676",
 "substance": "MDA & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "0.25 tablets",
   "oral",
   "MDA",
   " T+ 3:00",
   "2 hits",
   "smoked",
   "Cannabis"
  ]
 ],
 "report": "<p>Dose:  1/4 Tablet MDA (Dove logo). </p><p>At T+ 3 hours  smoked Cannabis</p><p>Body Weight:  145 pounds</p><p>Setting:</p><p>I managed to get some 'super strength' E tablets from a reputable source.  After hearing about experiences with it (like one tablet being equal to 4 normal ones), I decided to do some research on my new dove logo tablets.  I found out that they were pure MDA.  At first I was disappointed, but I decided to try it anyway.  I arranged with a friend to try it on the evening of the Leonid Meteor shower, which was anticipated to be the best in our lifetime.  I got psyched up for it all day (my mind has to be in the right mindset for E) and I was totally ready that night.  Unfortunately my friend canceled  leaving me with a big decision.  I was so looking forward to the experience; I decided to do it anyway.</p><p>T+0 First dose:</p><p>I normally am a lightweight when it comes to any substance  and half the normal amount seems to do more for me than the normal dose for most people.  Bearing that in mind, I normally take a half tab of E.  Hearing how strong MDA is, I decided to take 1/4 of a tablet and my normal regiment of Vitamin A, C and E.</p><p>First impressions:</p><p>This was the first time Ive ever taken something like this alone.  Normally E kicks in the first half hour for me  but this didnt take effect for a full hour.  The delightful warm tingle that always seems to start at my toes and creep up my body when I take E was absent.  But as I sat alone at home listening to some jamming tunes, I found myself grooving to the beat.  The arrival flood didn't happen, but the familiar E feeling was there.  Lacking from that feeling was the typical tight jaw and the wired energy that I normally felt.  That 'slap in the face', 'Here I am!', E type rush that I normally encounter was replaced by what seemed to be a more natural progression of my feelings.</p><p>As usual, I wanted to dance to the music and I found myself really wanting to reach out and communicate.  I called another friend of mine.  We only talked about 15 minutes  leaving me wanting more.  I then decided to write a past girlfriend that I've done E with.  Interestingly, my thoughts werent filled entirely with love and a lot of old feelings came out  as if I were looking at things from a more distant perspective.  I seemed to possess a clarity that I had never had before.  After writing what I thought was an incredible email, I sent it off (reviewing the letter the next day I thought it was very well balanced  not super upset, but not overly warm).</p><p>At T+3 hours:</p><p>Three hours after ingestion, and two hours into the great MDA feeling, my wonderful warm, want-to-dance feeling disappeared.  I dont know if it was from the feelings brought up in the letter or not, but normally I roll for at least 5 to 6 hours and I was highly disappointed.  It was time to go watch the meteor shower and I felt pretty normal  not the way I wanted to experience it. </p><p>I decided to break out my bong and have a hit.  I took a hit and didn't feel much (normally it hits me right away), so I took another hit.  That was when I really noticed it.  My high was back  but different from anything I had every experienced.  I felt wonderful, but very inebriated.  It took me almost an hour to find a hat, some gloves, a warm jacket, my CD player, and a folding chair  you know how you get when youve smoked so much that you forget what you are saying  I was at that level and everything took serious effort to accomplish.  I almost decided it wasnt worth the effort to go outside, but the once-in-a-lifetime experience compelled me to go.</p><p>At T+4 hours:</p><p>After walking one block to the beach (something pleasureful and frustrating at the same time), I set my chair up.  As my eyes adjusted to the darkness, I was surrounded by shooting stars.  The techno music going through my headphones accentuated the beauty I was seeing.  I normally never talk out-loud, but I was babbling to myself all night about all sorts of concepts and ideas.  My mind was in the most perfect state to witness this event.  As the meteors struck our atmosphere, I could physically see where our earths atmosphere begins.  I also noticed that the brighter meteorites (these were the brightest I had ever observed) had a rainbow like trail as they disintegrated in their fiery display. </p><p>In between the shooting stars, my perceptions changed.  I started to notice the movement of the stars.  Ive seen time-lapse photos showing stars movement, but for the first time, I actually observed how the stars moved overhead.  They didnt seem to move in a straight line  instead they appeared to slowly move in an elliptical orbit around me.  That brought my thoughts to how early man ever figured out that the earth rotated around the sun, and how the sun was part of a galaxy.</p><p>It was then that I realized that all of the early founding fathers of science were astronomers.  They invented math in order to explain the heavens and their movements.  As the amazing meteor display continued, I sat there thinking that only an organic analog mind could ever comprehend something so vast, or be so creative as to actually invent math to explain it.  And then the revelation came to me.  The missing link between digital math-based computers, and mankinds analog mind is astronomy.  The key to artificial intelligence lies in bridging the same type of gap that mankind did when they invented math.</p><p>At T+6 hours:</p><p>So you read it here first  the key to artificial intelligence was discovered on an amazing substance based state.  As I returned home at T+6 hours, I took some more Vitamin A, C, and E.  I finished drinking the last of my gallon of water, took an SSRI (Zoloft, 50mg) to help with neurotoxicity, and went to bed.  Normally its hard for me to sleep within 8 hours of E, but I fell asleep fast at T+6.  I never did experience the 'amped' up feeling on MDA that I normally have on E.</p><p>The phone rang the next day after I had been sleeping for 9 hours.  After I answered it, my head was only slightly groggy, and I went back to bed and slept for 6 more hours.  When I woke up, I felt good  no typical down time like I normally have after E  - (this was also the first time I got that much sleep afterwards, or took an SSRI).  This experience is one that I will treasure for a lifetime.  I could never ask for a better state of mind or the time frame provided by the MDA + Cannabis trip.</p><p>Tips/Advice:</p><p>I firmly believe that taking an SSRI after E or MDA greatly helps reduce the hang over feeling experienced the next day(s).  Advice I would give for dosage is:  a half tab of MDA is equal to a full tab of MDMA.  Dont get impatient for it to kick in  it took over a full hour for me.  It is very gradual, unlike E.  If you really want to take the whole tab, try taking half in the beginning and the other half at T+2 (this should take care of coming down early).  Smoking pot definitely bumps up the feeling on MDA, much more so than on MDMA, and creates a totally unique feeling.  Dont smoke too much pot  definitely not your full normal dose like I did, otherwise you risk being totally incapable of interacting with others.</p><p>Conclusion:</p><p>Did I like MDA better than MDMA?  Yes and no...  I liked the fact that MDA seemed to amplify my feelings without coloring them (this could also allow bad experiences though).  I enjoyed the fact that I didn't experience the amphetamine type 'wired' energy.  I loved the mindset created when Cannabis was added (although not the physical effects).  Would I do it again??  Definitely.  Is it better than E??  For independent thought provoking experiences, I believe so.  For times when you just want to feel that incredible bond of love with other people, I would stick to MDMA.  As usual, all bodies are different, and YMMV (your mileage may vary).  Enjoy and be safe.</p>",
 "year": "2001",
 "id": "10676",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-22T07:00:00.000Z",
 "views": "24504",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "0.25 tablets",
   "administration": "oral",
   "substance": "MDA",
   "form": " T+ 3:00"
  }
 ]
}
