{
 "id": 10674,
 "title": "It's a Blessing",
 "date": {
  "submission": "2007-06-14T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jethro",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "mg"
   },
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "number": "8.0",
    "unit": "mg"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine",
   "form": "daily"
  }
 ],
 "report": [
  "The effects of long-term Buprenorphine/naloxone usage on my body. As well as other observations.",
  "Ok, My name is Jeff and Im an addict. I was introduced to Suboxone by my friend Terry who generously gave me some when I desperately needed it. I was in heavy Opiate withdrawal and calling everyone I knew for money or drugs to get well. I was sweating profusely and vomiting and wishing I was dead basically. I took the piece I was given and had my girlfriend administer it to me in increments, because I wasnt able to trust myself with my illicit supply of this wonder-drug. All I knew was that I needed to feel better. I soon did. I got the number to the prescribing Dr. from that same guy and as soon as worldly possible made myself an appointment.",
  "I relapsed and was sent to a treatment center that started me on a Methadone maintenance program while I was there. This was critical to my success. By this time I had totally given up on trying my way and agreed that I needed help. I found myself staring down a very long road. That roads name was recovery. So, my insurance decided not to pay for my full treatment at that particular facility so I had to go home after only spending (a very long) two weeks. This is when it all came together for me. I was taken home and had to go through a battery of testing and monitoring and finally the day arrived. I had to be sick when I showed up to the Dr.s office and was weighed and had my blood pressure taken.",
  "After all that hassle I finally was given a tablet of Buprenorphine(subutex) in the office. I had to let that horrible tasting (Orange Tang) octagonal pill dissolve under my tongue and then we all waited. For the first time since my rehab stint I actually felt human again. A human that felt like I was dragged through a knot-hole backwards, but normal just the same. Voila! Now started the hard part. Counseling! I was given an initial urinalysis and had to take one every week to score my RX of Buprenorphine/Naloxone, that I shall refer to as Suboxone from here on out. I had to go to countless meetings and groups and every once in awhile I had the dreaded one-on-one counseling sessions. I done this for well over three years and eventually was promoted or actually trusted, as it were, to only go once a month for my urinalysis/RX. I have since graduated from Crossroads counseling center and am now clean and weaning down from the initial 36mg/day to the now 4-8mg/day. This is where I start my personal observations on what ramifications Suboxone has had on my physical and mental state.",
  "These are my personal observations on this drug and the long-term effects on my body. I noticed that after Im leveled out and find my dose and actually maintain it for a while (meaning months/years) and I go to a higher dose for a day, I will find myself in a very happy mood but this state may also be followed by stints of nausea and dizzy-ness. By administering less than my comfortable dose, Ill quickly find that the saying Less is more applies here. It is an enigma to me that by taking a smaller dose, it can actually give me a rush of energy and give me a floaty feeling all day. Its almost what Id expect from taking a higher dose! I believe they call this a paradoxical effect in the medical profession. I have also noticed that dental hygiene is a crucial part of this because it absolutely does have an effect on my teeth and gums. I personally believe this is due to the Naloxone in the product. I have no proof of this.",
  "Upon reading and participating in different online forums dedicated to the subject such as the Suboxone/Methadone forum on a social networking site, I have found many, many times specifically stated that Suboxone isnt all its cracked up to be. I guess its not the wonder-drug that the medical world is proclaiming it to be. I personally believe it is, but thats another story altogether. It is also my belief that most, if not everyone, that is on it has experimented with it and has had their own opinions on what works for them and what doesnt. I also believe that the blocker part of this drug called Naloxone is a good thing but does a minimal job of actually blocking certain drugs.",
  "As for Benzodiazepineswell, just dont do it! It is a bad and killer combo. While it does a good job of enhancing the desired effects of the Benzodiazepine family, it also turns my regular dose into an overdose situation really fast. This is generally a very bad idea and from experience a very real, concerning and dangerous decision all together.",
  "As for marijuana, well it takes away from its desired effects as well, but allows me to ingest more without the tired effects that is particular to this drug. I only know this because I had Hepatitis-C and was graciously prescribed Marinol to help with weight gain and nausea. I actually never abused this and thought of it more like a privilege. It is also a wonderful analgesic as well.",
  "Ok, now on to cocaine. When I first started on the Suboxone program I was substituting my drug-of-choice (Heroin) with other street drugs and found that it blocks a significant amount of its desired effects also. This in itself is very dangerous because a person that wants a Cocaine buzz will probably ingest a fatal amount before realizing that the Suboxone is blocking its euphoric effects. I was actually surprised by this because Cocaine is so chemically different than the Opioids. Shows what I know, huh?",
  "I am now clean and sober and have been on Suboxone for a little over 4 years. It is my belief that this chemical has helped me to save my own life! A miracle its not, but rather an ingenious pharmaceutical and technological breakthrough for opiate dependence and an invaluable tool for recovery.",
  "I will tell you what actually happened to me side-effect wise that is. My taste was off. That is to say that things started to taste different to me. I have been told that I am a super-taster because of the number of taste buds on my tongue compared to others that were in my classroom. We did the dye on the tongue and microscope experiment. I just thought Id explain that quickly. Ok ,back to the topics at hand.",
  "I also noticed a marked decrease in sexual stimulation. At first I could go for hours on end but as my dose started to decrease, I found that I was ejaculating after only 10 minutes or so. Very frustrating as you can imagine! The Dr.s said that this was normal and would dissipate in a few months. It didnt. Im hoping that this will work itself out, but Im not holding my breath! I will just have to work through this.",
  "Next Id like to tell you about the changes that occurred to my sense of smell. It too, like everything else, changed. I can now smell a lot better than I could when I was using street drugs, but found that I have developed allergies that I never had before treatment. This could be from the natural aging process also, I guess, but I believe that the Buprenorphine has had a hand in it as well. I was very tender for a few months after starting treatment, but having being numbed to all my senses for so long Im bound to notice a change. Everything just felt more intense and exaggerated for a few weeks.",
  "On to sleep. This is a conundrum in itself, to me anyway. Suboxone can, (and the most likely of all the side effects) will make me restless during the regular sleeping hours and I found myself often sitting straight up in bed for a few months after my initial dose. But this too went away with a little time, however and curiously, it returned about two years into it? Once in awhile I still find myself sitting straight up in bed from time-to-time. I got used to it! The bad dreams though not so much! I seem to have put together a theory that Suboxone causes very vivid dreaming and often being awakened by them. This is most undesirable and still happens once in awhile. It is my belief that it happens more often than the norm but is hard to convince my Dr. that that is whats causing it.",
  "It would seem that Suboxones most undesired effect is the sleep disturbances. It will keep me awake for days on end sometimes. I am Bi-Polar and find that it will cause more frequent manic episodes. If my Suboxone is taken exactly at the same time every day and is not broken up into increments that this is rarely the case. Taking smaller doses throughout the day is redundant and hardly necessary.",
  "I feel I must re-inerate the observation that Suboxone has very little, if any pain relieving effects. I find myself taking much more than the recommended daily dose of O.T.C. painkillers such as Motrin and Tylenol of which I take a cocktail of both (3&2). This has to be bad for my liver, however the Dr. is under the illusion that the Suboxone is a sufficient pain reliever. Its not. In fact I am trying to find a decent analgesic that has the pain relieving qualities that of an opiate or reasonable facsimile.",
  "What if Im in an accident and require an Opiate? Then what? The Naloxone as well as the mechanism of Buprenorphine itself will inhibit the action of any medically administered opiate. What am I to do in these instances? Is their a system in place for this set of circumstances? Even if there is/was a system in place it would be completely useless if all the E.R. doctors dont either know about it or choose not to institute it. While I believe that Suboxone is long overdue in the world of recovery, I also believe that a little more thought has to be given to emergency situations that are unfortunately inevitable.  Having said that, however, I must pay my respects to my prescribing Dr. for just simply recognizing the need for this program as well as for instituting it.",
  "On its own it will, to a degree curb cravings, however I feel that a positive support group is a vital tool in staying clean as well. That in itself is still not enough. Suboxone saved my life, however I was at that aforementioned preverbal crossroads and needed a vehicle in which to succeed. I found it in the Suboxone program."
 ],
 "erowid": {
  "id": "63128",
  "citation": " Jethro. \"It's a Blessing: experience with Buprenorphine (ID 63128)\". Erowid.org. Jun 14, 2007. erowid.org/exp/63128",
  "substance": "Buprenorphine",
  "views": "27078"
 }
}
