{
 "id": 10678,
 "title": "Fool Me Once, Shame On You",
 "date": {
  "submission": "2010-10-10T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bagels",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "mg"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "mg"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "So lately, my friend has been meeting this man we'll call Beaver, and buying buprenorphines off of him. He sells them at 20 bucks for 8 mg and 5 for 2.",
  "Now, I've had my fair share of pill popping, from oxycodone to hydrocodone to ambien to amphetamines, and I swear to you, that buprenorphine is by far the strongest and longest lasting painkiller I have found to date.",
  "I took 4 mg of buprenorphine, under the tongue, on a school night, once before, and felt just fine. Well, for a bit. Within the hour I was feeling very floaty, a feeling akin to vertigo, and telling my friend I was sleepy, he left and I did just that. I woke up the next morning still feeling the drug. I attempted to stand, and found out that swimming was much easier. I was not together at all. I told my dad I was sick and decided I could sleep the drug off and go to school in a few hours. No dice. This was a cycle repeated for the rest of the day, with interludes of vomiting and sleep. Great stuff, really. I figured it was a matter of simple overdose.",
  "So, when my friend presented me with a 2 mg tablet in first period, I said what the hell, and went with it. 50 minutes later I began to feel the drug. It was the run of the mill pain killer effect, but I began to get the same kind of dizziness. An hour and a half from the start, and I was having trouble simply sitting up. Talking required too much effort, and I felt too awful to attempt it. I went to the bathroom once or twice to try and throw up, but to no avail. My teacher said I didn't look too good, and didn't argue with her. I requested leave to go the health room, where I laid down for a good forty minutes.",
  "The strange thing is, laying down, I felt no problems, just the painkilling. When I tried to stand up, it went completely down hill and I felt incredibly nauseous. I went back to class approximately 2 hours after ingestion, where I sat on the couch and tried to do math. I was obviously sick, and an experienced person could have easily seen I was on something. The lunch bell rang, and I ambled outside to sit in the sun. I realised that the best thing I could do at that point was to call my mom and go home, which I did promptly.",
  "3 and half hours after ingestion, I finally get home after a great bout of carsickness which ended anticlimatically, ie, without vomiting. I went upstairs, laid down, and went to sleep. For the next twenty one hours, I began a cycle of laying down, making phone calls, watching tv, and falling asleep. Any vertical movement caused my head to spin and the nausea to come on. I recall trying to go get my back pack, and going to the bathroom to throw up. The strange thing is, when I bent down, it went away. So I would stand up and the urge would overcome me, and bingo bango, vomit. Nothing but water, generally unpleasant, and not a sign of improvement. I could stand up the next morning, around 24-27 hours after ingestion. I did not feel right until the 36 hour mark, which concurred with the previous time.",
  "I suppose that, when all has been said and done, I have a very low tolerance for pills. I've overdosed on percocet before and threw up 8 times before lunch. But buprenorphine is strange in the fact that lying down seems to be a solution to the sickness. I was literally incapacitated and bedridden. I believe that there is something with me that does not agree with the stuff, and I don't plan on taking it again. My friend has built himself a tolerance up to 8, and he's never been floored like I was, although he threw up out of my car window on a ride home."
 ],
 "erowid": {
  "id": "63154",
  "citation": " Bagels. \"Fool Me Once, Shame On You: experience with Buprenorphine (ID 63154)\". Erowid.org. Oct 10, 2010. erowid.org/exp/63154",
  "substance": "Buprenorphine",
  "views": "19117"
 }
}
