{
 "id": 10686,
 "title": "I'm Still Waiting",
 "date": {
  "submission": "2008-01-17T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alex",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "387",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Barbiturates",
   "form": "pill/tablet",
   "specific": "Phenobarbital"
  }
 ],
 "report": [
  "I had recently acquired six 64.5 mg tablets of Phenobarbital. The pills were for veterinary purposes according to the pill bottle. After doing some research, I decided to take all six. This was the first time I had taken a barbiturate, and I hadn't had alcohol in a couple of months.",
  "After about half an hour, I had noticed moderate reduction in anxiety, however it was nothing spectacular. By the time I had reached the hour mark of my 'trip' I noticed some incoordination and mild drunk like feelings. I had some trouble focusing as my vision seemed somewhat, 'unusual'. No hallucinations mind you.",
  "My mindset was pretty much the same except I was acting a little energetic and somewhat silly or immature. I was surprised that I felt no sleepiness whatsoever as this particular drug was prescribed for insomnia. I was surprised how blurred and unusual my vision was despite my fairly normal mindset. Normally if this was alcohol, my vision would not be any where nearly as affected as this with such slight drunkenness. I continued to feel mildly drunk (3-4 beers drunk) for another 45 minutes to an hour then the effects started to fade. After the drunkenness left me, I was back to normal except I had no anxiety the rest of the day.",
  "Overall, I would have to say that this was a disappointment. I was expecting much more severe mind altering affects. However, not having any anxiety was certainly a plus."
 ],
 "erowid": {
  "id": "63175",
  "citation": " Alex. \"I'm Still Waiting: experience with Barbiturates - Phenobarbital (ID 63175)\". Erowid.org. Jan 17, 2008. erowid.org/exp/63175",
  "substance": "Barbiturates - Phenobarbital",
  "views": "14934"
 }
}
