{
 "id": 10680,
 "title": "Always Use A Spoon",
 "date": {
  "submission": "2010-04-17T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "CoffeeDude",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "",
   "substance": "oral"
  }
 ],
 "report": [
  "Coffee is by far the most popular and recognized drug in the world. Millions of people drink it daily as a stimulant/mood enhancer. The primary psychoactive component of coffee is caffeine. For my experience I was drinking coffee, which is just one of the many sources of caffeine. I couldn't tell you if coffee as opposed to another source of caffeine such as an energy drink or pills was the cause of the negative reaction. This was undoubtedly the worst time I have ever had while drinking coffee.",
  "I usually start my day by freshening up, and making some coffee. I usually use about 3 average sized scoops of instant which is suppose to equal about 500 mg of caffeine. The effects I feel are usually immediate, perhaps a tinge of anticipation mixed with the onset of the drugs effects. My mood is elevated and my performance enhanced. Overall I like the feeling I get from coffee, and I can only complain that I feel drained after a long day and wiped out if I drink too much over the span of a day.",
  "The night before my near caffeine overdose, I had been drinking alcohol and felt spaced out, woozy and a little sick. I walked into my kitchen, grabbed a cup and proceeded to the shelf with the instant coffee. Planning to have a cup and awaken my senses, I neglected to grab a spoon from the nearby silverware drawer, and instead poured the mix into my cup directly from the container. I shook the instant coffee and poured at least an inch of the foul matter into the bottom of my cup. At this point I should have poured at least 3/4 of it back into the bottle. I thought about it for a second, pondering what it would feel like to drink such a potent brew, 'It'll be great', I thought. To continue I poured in some sugar, cream and finally hot water from the water cooler. I started swirling the coffee with my spoon which I now recognized as a useful tool, albeit a little to late to save me. It was interesting to watch the water and particulate matter mix together. It was odd how my spoon was slowed to a crawl by the liquid. The coffee was so thick, I should have thrown it down the disposal, it even had oily specks floating near the surface because there wasn't enough water to soak up all the mix. Just thinking about it makes me want to puke.",
  "As I started to drink the coffee, the taste was disgusting and foul. I could only sip the drink slowly and several times I added more water to dilute the sludge. While nearing the end of the glass, a strong feeling of panic started to set in and I immediately stopped drinking and tossed the drink in he sink. I tried to take my mind of my desperate situation by playing online poker, but I simply couldn't concentrate on the game, plus I had zero patience at this time. I got scared and my heart started to hurt, my mind was trying to concentrate on anything and everything, I was very confused. I stood up and started pacing around in circles, this helped my find some relief but then I thought, 'I can't do this for 6 hours or however long it takes me to feel better', so I sat down and pondered what I should do about my situation. Then my body decided for me, it said, get up quick cause your ass is about to explode, and explode it did, several times. Near the end it was simply streams of brown, noxious, partially digested coffee flavored...",
  "Ok, enough of that, at this point I was freaking out I couldn't think straight. My extremities were cold and I still had chest pain. I decided to call poison control and see if there were any home remedies for caffeine intoxication. At first the operator asked me, 'Are you sure you just drank coffee', most likely thinking it must be some other illegal drug which was making me so uncomfortable. I explained what I did, and he recommended that I try to eat something. I asked him if I should take an aspirin and he said no. I wasn't sure eating food would help but I tried anyway, trusting a poison control operator would have more knowledge of the subject than me. I ate some cinnamon bread and waited for relief.",
  "It took another 1-2 hours to feel somewhat normal again. My body finally reached an equilibrium with the caffeine and I began to like the feeling of alertness and focus. It was weird how I could go from confusion and restlessness to a state of calm and attentiveness so quickly. I will not soon forget this episode, and I plan to limit my coffee consumption to appropriate levels and never again underestimate the power of caffeine. I appreciated the way the poison control attendant helped me and I hope this recollection will help someone else avoid making the same mistake."
 ],
 "erowid": {
  "id": "63162",
  "citation": " CoffeeDude. \"Always Use A Spoon: experience with Caffeine (Coffee) (ID 63162)\". Erowid.org. Apr 17, 2010. erowid.org/exp/63162",
  "substance": "Caffeine (Coffee)",
  "views": "22040"
 }
}
