{
 "id": 10685,
 "title": "Definitely Different",
 "date": {
  "submission": "2007-05-28T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Justin H",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Yerba Mate",
   "form": "(tea)"
  }
 ],
 "report": [
  "Having used a variety of drugs, I find myself anxious and hesitant to try new ones.",
  "Thinking that Yerba Mate would be mild, familiar and similar to coffee or black tea, I drank a large cup after eating a medium sized meal last weekend.",
  "The drink was mixed with Chai, and at first it felt like a 'simple' caffeine experience.  I found myself focused, happy, satisfied, and warm.  I found myself grinding my jaw mildly and occasionally, as usually happens if I drink coffee or tea.",
  "60-90 minutes after consumption, the experience began to drastically change.  It became much more sensory and less comfortable / familiar.  One of the first changes was the feeling that the veins in temples were 'swollen,' or more drawn to the surface of my skin.  (Later I asked a friend to feel them and he confirmed that they did feel more pronounced.)",
  "After 90 minutes, a distinct audio effect began to emerge.  Sounds felt as though they were 'in my ear' and the silence of my room was deafening.  My girlfriend was talking to me, but I was far too anxious to engage in conversation.",
  "I became extremely uncomfortable and had to leave.  Upon walking outside, my discomfort eased somewhat, but the audio effects became even more pronounced.",
  "10 or 20 minutes later, I began to notice a mild tunneling of my vision, short tracers around lights, and most distinctly, brightening of certain colors - particularly a green neon sign hanging in a bar window that I walked by.",
  "My coordination was slightly impaired, although this feeling came and went and subsided upon drinking water.  The jaw grinding had stopped and the character of the experience had little in common with coffee or tea. ",
  "After 2 - 2.5 hours, the experience quickly calmed, and by 3 hours, I was no longer uncomfortable.  The feeling of my veins being swollen washed away into a feeling that they had been cleansed. ",
  "The whole thing was relatively mild as compared to other drugs, but it was certainly very different from a caffeine experience."
 ],
 "erowid": {
  "id": "63173",
  "citation": " Justin H. \"Definitely Different: experience with Yerba Mate  (ID 63173)\". Erowid.org. May 28, 2007. erowid.org/exp/63173",
  "substance": "Yerba Mate ",
  "views": "9571"
 }
}
