{
 "id": 10690,
 "title": "Hell Ride Ends in Extreme Serenity",
 "date": {
  "submission": "2007-07-10T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "LyterPhotos",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "insufflated",
   "substance": "Anadenanthera spp.",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>The following account describes my 4th experience with Anadenanthera (Unsure if A. Peregrina or Coloubrina). The first 3 were spiritual experiments/sacraments with smoking the dried seed material while the following experience was my first insufflation of the substance. I am writing this both on the day of and 5 days after the experience.",
  "My history with psychoactives includes 100+ times with LSD and 5 times with psilocybin mushrooms 19+ years ago and several experiences with Salvia Divinorum within the last 10 years.",
  "The original preparation of the material from 25 seeds was mixed with an eyeballed 1/7th part edible lime from an Asian food store. The entire mixture was thoroughly dried, crushed with mortar and pestle, and ran through a coffee grinder. The final result was a fine beige/gray powder initially created to be used as incense and offering to the divine.",
  "Avoided meds (Omemprazole & Bromfenex) and food in AM and decided that the plant spirit called to me. Started preparation shortly after waking.",
  "At 11:00 on a sunny Thursday I performed a Hermetic Banishing and Centering. I stated intent of making a Higher Self Contact and Healing for my chronic cough. I didnt know what to expect and was a bit frightened. I was alone with only the white noise of a fan in the background, there was some sunlight coming through a Northern sliding door/window.",
  "Insnufflated exactly .5 grams (digital weight +/- .1g) of material placed in a fennel tube with an inflated baggie at the end to 'blow' the material in my nose. I actually ended up having to sniff rather hard also. Material went in right nostril and caused immediate painful burn. Sniffed fingertips with water after about 15 seconds - this reduced the pain.",
  "T + 1 min. - Strong sensation of head/face swelling, minor difficulty breathing. Limbs starting to tingle.",
  "T + 1.5 min. - Nausea begins, face very uncomfortable.",
  "T + 2 min. - Dry heaves, blowing nose, CEV's & OEV's like fireworks moving quite rapidly. Trying to stay still, I feel VERY ILL. Cognition unimpaired. Light coming from outside is quite annoying.",
  "T + 5 min. - This really sucks, still dry heaving. Simultaneously very hot and freezing. Too ill to go to curtain and close. I feel like the fan is blowing on me but its not. For next 10 minutes Im just trying to stay still and ride it out. Keeping eyes closed most of the time but when I go to turn off the fan I open them and the buttons are HUGE. Tell myself Im never doing this again!",
  "T + 15 min.  Not feeling as ill and firework type visuals have slowed. I settle into a closed eye trance state. Very quickly my seemingly unimpaired consciousness is floating in a void. Grayscale when visuals actually present. There is a communicating unheard but sensed which tells me to lose the Pronouns. I try to communicate back without pronouns and the communicating tells me that I (we/it/existence?) should lose nouns also. I try to think without nouns and pronouns and find this very difficult to do, but the communicating is patient and seems to be telling to me that everything is a verb of sorts. At some point in the dialogue communicating shows me myself as an entity which holds on so tight to self that problems both physical and psychological have occurred. Its really impossible to relay the truly profound nature of this communication and all I can really say is that it told me to let go if I wanted to get better. INCREDIBLE!",
  "T + 60 min.  Eyes open suddenly, trance gone. I walk to kitchen and am a bit light headed and giddy. Very happy and feel like Ive been taught an incredible lesson about myself.",
  "T + 120 min.  Noticeable effects completely gone but still Happy!",
  "Over the next few days my sleep was alive with dreams. The normal humdrum depression was gone. At the 3 day mark I performed an Enochian ritual which verified the need to let go and specifically to relax in order to get past my chronic cough (2 years). So far the advice given by the plant teacher has made me feel better than all the Western and Eastern Medicine combined.",
  "In retrospect I think it was exactly what I needed at the time (no regrets). If I were to do this in the future I would either use 50% more (.75g.) or 50% less (.25g.) to either Breakthrough or to test the subtle effects. I believe that had I not smoked the material at a prior time I would have been much more frightened of the initial experience even though I had read extensively about it.</p>"
 ],
 "erowid": {
  "id": "63187",
  "citation": " LyterPhotos. \"Hell Ride Ends in Extreme Serenity: experience with Anadenanthera spp. (ID 63187)\". Erowid.org. Jul 10, 2007. erowid.org/exp/63187",
  "substance": "Anadenanthera spp.",
  "views": "10667"
 }
}
