{
 "title": "Running from the worms",
 "author": "Hookah and Bong",
 "citation": " Hookah and Bong. \"Running from the worms: experience with Morning Glory Seeds (Heavenly Blue) (ID 1069)\". Erowid.org. Apr 6, 2001. erowid.org/exp/1069",
 "substance": "Morning Glory Seeds (Heavenly Blue)",
 "bodyweight": "",
 "report": "<p>I have had alot of experience with psychoactive and non-psychoactive drugs such as weed (of course), PCP, dust, special k, X, DXM, acid, mushrooms, nutmeg, and I have done morning glories a couple times. This was to be the first real experience for Bong with the psychedelics. We went down to the K-Mart and stole around 25 packs of morning glory seeds. Each packet containing 1.5 grams. We divided them up, grinded them up in a coffee grinder and soaked them in water in mason jars for about a week and a half.</p><p>Friday came and we went to his house to get some supplies for the night ahead and then headed over to my house. We both took one dramamine when we got there, that was about 5:30. At 6:30 we whipped out the mason jars and poured the liquid through a filtering contraption I made. These yielded a little more than half a cup of thin brown liquid. We downed the liquid as fast as we could and immediatly went in my room to lay down and wait for the intense stomach pains to go away.</p><p>Immediatly  we felt odd feeling in our heads and our stomachs began to hurt more and more. About 20 minutes later Bong got up and said he needed to go the bathroom. I got up too and said I was going outside. I put on a sweatshirt and stood on the front deck of my house for a while and stared at the clouds. The more I looked at the clouds the more I began to notice that there was this weird type of jell flow in front of my eyes. It made the clouds look even cooler. The only downside was that my stomach continued to hurt.</p><p>Some time passed all the while staring at the clouds, it was about 7:00 now with no sign of Bong. I went back into the house and knocked on the bathroom door and asked him what he was doing. He said he was going to the bathroom, but i didn't believe him. I asked him if his stomach hurt and he said 'yeah' and let me in. I told him the cold air was making my stomach feel a little better, so he came outside with me.</p><p>We stood there staring at the clouds for a while when all of a sudden a heard this nasty sound coming from Bong. He was throwing up off the side of the porch. He said after he was done he felt much better, but I was determined to keep it down.</p><p>A while passed all the while my stomach still hurting. I began to get weird visuals around 8:00, but I still didn't feel well enough to go back inside. We deceided to walk down to this little cove near my house at around 8:30 or 9:00, we weren't really keeping track of time. This when it began to get cool.</p><p>On the whole walk down, everything we talked about seemed to be important. We would get in involved conversations giving no regard to what was going on around us. When we got to the main road we needed to cross to get to the cove. I found watching cars pass amazing interesting and made Bong stand there for a little bit while I watched. I also began to get cool shifts in reality, were things would move around and whatnot.</p><p>We got down to the cove and everything with shadows seemed to disappear. All of nature seemed to look really cool, I saw some really cool colors and it began to become like a mild acid trip. All of a sudden I snapped out of the trance nature had put me in and I remember saying something like 'what the hell are we doing here?'. So we headed up back to my house, where we put the blacklight on and listened to some tunes.</p><p>I headed right for the bathroom because I had something no good brewing in my stomach. All that stuff that had tried to escape my body through my mouth was now coming out the other way. I sat on the toilet and closed my eyes and covered my ears to see how much of an effect this was really having on me. Began getting crazy auditory hallucinations, I heard weird noise distorting and all of a sudden a was flying in hovercraft through a futuristic city at night, kind of like the city in the 5th Element. It was really cool. All of a sudden it just stopped and a left the bathroom.</p><p>I went back into my room and BOng said I had been gone for a long time. I laid back on my bed and closed my eyes and started having wild CEV's (Closed Eye Visuals). Wild colors and weird patterns filled my vision. When I would open my eyes everything would look really strange. Sometime walls would melt together, pictures on my wall looked alive.</p><p>About 20 minutes later I had to go the bathrooom again. I got up and walked to the door, but when I tried to open it I missed the doorknob several times. The trip began to get more intense, as I walked to the bathroom. This is when it started to get scary. Now in all my years of tripping I have never had a bad trip on any psychedelics, but I'm pretty sure this is one. I sat on the toilet again and when I looked at my arms I could see the hair on my arms growing and then retracting in my arms. This didn't alarm me that much, but then the shadows in the bathroom began turning in worms that would crawl around and then disappear into other shadows. This didn't scare me that much since I have had some pretty intense hallucinations before, but when the ammount worms in the bathroom began to increase it started to scare me. By the time I was done in the bathroom the worms were on everything I looked at. I left the bathroom and into the hall and the worms were everywhere. I ran into my room and told Bong about the worms and he was intrigued and asked me if I was alright. I told him i would be fine.</p><p>I tried to relaxing in my room, but the more I tried to make them go away the more that would appear and about every 20 minutes I would have to go the bathroom. The morning glories were raising hell in my stomach. At about midnight I returned from my fourth trip from the bathroom. Still seeing worms everywhere. Bong said he had to go to the bathroom so I was left alone in my room with the worms. My stomach began to hurt worse then it had ever had all night and in about five minutes I realized I was going to hurl. I heard the toilet flush so I ran to bathroom and banged in the door. He opened it and I flew in puke just making it into the can. He yelled 'Holy Shit, are you ok?' I told him a would be and closed the door. For the next five minutes or so I was on my hands and knees hugging the toilet. Everytime I would spit it looked neon pink. I was totally freaking out. I thought maybe throwing up would make the worms go away, but they were even more real. I ran back into my room and Bong asked me if I was ok and I said I'd be fine and we sat down and watched the Dana Carvey special on comedy central. This slowly got mw into a better mood and my eyes began to normalize. I was getting tierd so we both layed down and put in Fear and Loathing In Las Vegas. I fell asleep about a half and hour later. That night I had an insanly real dream. In which I went through several days, which in my mind I really though were the next couple days in the real world. When I was woken up by a phone call.</p><p>The next day I felt a little woozing, but all in all fine. I have some important information to anyone considering doing this.</p><p>1) Make sure you in a good mood. I was in a bad mood most of the day and I have a feeling this might have contributed to the appearence of the worms.</p><p>2) Aviod drinking the powdered morning glories if you are intending to due a high ammount. Try some of the procedures posted on the internet, don't be lazy stoners like us.   Because you'll either end up throwing up in the begining or the end.  The end being much more worse because the seeds will be going crazy in your digestive system for the following days. Note- Bong threw up in the begining and told me he only felt a little effect.</p><p>3) In all my experiences I can say this wasn't terribly bad. Eventhough while I was throwing up I was chanting I would never do morning glories again. I might attempt another try sometime in the future. Although if you are looking for a good legal high, try DXM or Dramamine they are much cleaner and don't go down with so much difficulty. And remember be careful with everything you do.</p>",
 "year": "2000",
 "id": "1069",
 "timestamp": "2001-04-06T07:00:00.000Z",
 "views": "11315",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "500 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 }
}
