{
 "id": 10699,
 "title": "An Excellent Study Aid",
 "date": {
  "submission": "2007-05-31T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "orlando_to_miami",
  "gender": "Male",
  "weight": 111
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "300",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Adrafinil",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I've always had trouble with sleepiness and poor concentration. It often seemed to take me an ungodly amount of effort to get myself into the mental state necessary to get schoolwork done, and if I got anything less than 8 full hours of sleep I was completely useless the following day. My parents never would believe my complaints about those problems and simply thought that I was lazy and undisciplined. My performance in school was always pretty good (A's and B's), but I often failed to come through during stressful and busy times because I would get tired and distracted and end up turning in subpar work. I did do well enough in high school to get into an esteemed college, however, and so I headed off believing that simply getting away from my parents would solve a lot of my problems (we had never quite gotten along as far as some other things were concerned, but that's a whole other story).",
  "My first year in college I did reasonably well, but I realized that I really needed some sort of strong effective stimulant to keep me focused and awake. The workload in college was a hell of a lot harder than it was in high school, and I often found myself having to stay up very late to finish all the work I had to do. To keep myself going I had been using an awful lot of caffeine, first I had guzzled the ever-popular energy drinks and coffee but I ultimately switched to the cheaper, more effective pills. Caffeine, however, wasn't really cutting it when it came to long-term sleep-deprivation situations. At that point, I heard about Olmifon (adrafanil) and decided to try it.",
  "Adrafinil is not a controlled substance, so it can be legally imported into the US (it's available over the counter in much of Europe). I found a site that was able to ship me some Olmifon-branded adrafinil from a French pharmacy. Two boxes of forty tablets apiece cost $70. I had been eagerly awaiting their arrival since finals week was approaching, and I tried them right before I had a paper due.",
  "I took an Olmifon at about 8:00 PM. About half an hour later I started to feel the first effects, it was a gentle, tingly rush not unlike what I might feel with an amphetamine but less intense and more 'mentally-focused', if you will. The rush remained for nearly an hour or so and then gave way to an entirely different feeling of wide-open awakeness. As far as I'm concerned this feeling is drastically different than anything I usually feel with caffeine or an amphetamine and is unique among any stimulant that I have tried. I did not feel 'stimulated' so much as I felt 100% all there, awake, focused and ready to go, much like the feeling one gets after a good night's sleep. It's not a great wave of propulsive full-body stimulation like I generally get from the amphetamines, rather, it's more subtle, as if the adrafinil had quietly resolved my tiredness behind-the-scenes rather than painting a layer of stimulation over it. This very smooth feeling of awakeness stayed in place for a good three hours and then faded somewhat, although it never disappeared altogether as it usually would with an amphetamine. It helped me work pretty well for about six hours, after which the effects had faded to the point that I felt like I needed take another to finish the paper. The effects didn't seem to diminish with the second dose as they usually do with caffeine for me. I finished the paper a few hours later and was able to fall asleep without trouble.",
  "All in all, adrafanil is really unique as far as stimulants go. It doesn't give me that 'bionic' sort of hyperfocus that the amphetamines do, but it does give me a boost in focus and awakeness that is more effective than caffeine, which is often all I need. Furthermore, that feeling of mental crispness that Olmifon gives is very helpful in some situations where I need to be focused but not jittery or nervous (i.e., when I need to give a presentation). I've noticed that adrafinil is not nearly as effective as are the amphetamines when it comes to doing science or math work, however. For me, it works much better when I'm just trying to study liberal-arts stuff or write a paper or do busywork. That said, it has its place in helping any serious student get the job done and it is even superior to the 'gold-standard' amphetamines in terms of it giving mental clarity without nervousness."
 ],
 "erowid": {
  "id": "63204",
  "citation": " orlando_to_miami. \"An Excellent Study Aid: experience with Adrafinil (ID 63204)\". Erowid.org. May 31, 2007. erowid.org/exp/63204",
  "substance": "Adrafinil",
  "views": "28597"
 }
}
