{
 "id": 10698,
 "title": "Tripping with Cats",
 "date": {
  "submission": "2007-06-19T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Wr",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "oral",
   "substance": "4-HO-DET",
   "form": "capsule"
  }
 ],
 "report": [
  "Ethocin for some reason always interested me, and a year ago when I passed up the chance to acquire some, I was very saddened.  Recently, though, I was able to get my hands on a gram for experimentation. ",
  "This particular venture was between my significant other of several years, and myself in our home.  I measured out somewhere in the mid 20mg range with my scale, I just don't remember the exact dosage, M took about a small amount less than I (It should probably be noted that the form of the compound we were using was the fumarate salt which increases the weight needed by 33%).  The doses were capped then swallowed in the evening around eight, at least two hours after our last meal.",
  "It takes about an hour and a half for the effects to really begin to manifest themselves, and it starts out with a light buzz in the body, then a lightness of the body and mind.  Right before the come up, we packed a bowl of some Herb to smooth out the transition into the new territory and sat around talking to each other.  Tripping together really brings the two of us much closer and allows for so much more understanding than is usually afforded.  This experience was great for that, we sat in our living room with our cats joking and laughing for nearly the entirety of the experience.  It felt like all of our concerns and worries that get between us and move us apart spiritually, mentally, and physically were all dissolved by the ethocin with such simple ease as an ocean wave will wash away sand.",
  "At one point, we noticed that each of our cats were sitting on either of our sides like a pair of dutiful sentinels watching over our safety.  The cats had looks on their faces like, 'These dumb kids!  Now we gotta babysit their asses!'  It was very strange and almost unnerving because it seemed like they were trying to protect of us from something we couldn't see, but were obviously vulnerable to. ",
  "At one other point in the night, I had begun to space out and closed my eyes.  The detail and vibrance of the CEV's was amazing!  Three dimensional gridworks and landscapes began to form and I began to descend down into them.  As I got further down, I felt a similar sensation to entering the Void on 5-MeO-DMT and I could feel my body slowing down.  I felt my skin conductance decrease, my heart rate was slowing, my mind felt still, and my breathing had all but stopped.  In my mind I was descending through the gridded, digital landscape and floating in free air were two enormous biological hearts beating.  At this point I could see myself far far far down drifting ever further down between these two hearts.  I felt like I was moving closer and closer to the death state as my body became less and less animate.  It was about then that my cat apparently left his spot across the room and made his way with urgency over to me and started persistently tapping me with his paw to arouse me. ",
  "As soon as I emerged from my state, M was looking at me with astonishment of what just happened, because as soon as I snapped out my cat lost all interest in gaining my attention.  We hypothesized that as I felt my energy transcending my physical state, there must have been an energy fluctuation that was perceived by my diligent feline who then became concerned with me.",
  "Overall, ethocin is a very friendly feeling molecule with little in the way of body load, save a few tremors at the higher doses.  It took about 90 minutes to two hours come up, and there is no real definable peak, rather a four hour period of peaking, then not peaking, then peaking, etc.  Sleep typically comes moderately easy with a renewed, refreshed feeling the next day."
 ],
 "erowid": {
  "id": "63201",
  "citation": " Wr. \"Tripping with Cats: experience with 4-HO-DET (ID 63201)\". Erowid.org. Jun 19, 2007. erowid.org/exp/63201",
  "substance": "4-HO-DET",
  "views": "5753"
 }
}
