{
 "title": "The Rock Parade",
 "author": "Ti",
 "citation": " Ti. \"The Rock Parade: experience with Crack (ID 10690)\". Erowid.org. Mar 23, 2006. erowid.org/exp/10690",
 "substance": "Crack",
 "bodyweight": "125 lb",
 "report": "<p>I had my first experience with crack the other night. I had never really heard much about it. Everyone that I know that does drugs stick to coke, speed, acid and ecstasy.</p><p>First off some background information. I have done normal ones. Speed, acid, ecstasy, weed, things like that. And I have found that I have a VERY high tolerance. More than most people. It takes a lot to get me fucked up.</p><p>Well the night started off when I went out with some friends. Well call them J, M, V, and T. T and I wanted speed that night, seeing as how its been a long time since I have done any drugs besides weed. We became pissed when finding out that the person getting our speed was not home and we could not find him.</p><p>Desperate for something, anything, M informed us he could get us crack. So after discussing it, T and I decided that we would take what we could get. So M went and got us some.</p><p>We waited until we got back to my apartment and then started smoking it. We were already pretty high, having smoked 5 bowls just the two of us. My first two hits of the crack I was disappointed when I didnt feel anything. Then on my third hit, my mouth and throat started getting numb and in an instance my body started feeling numb too. I felt disconnected from myself.</p><p>We smoked half of what we had and went back in to my room. It was then that I realized just how disconnected I felt. My thoughts were a blur and my whole body felt numb. It was a euphoric feeling though. Like suddenly everything in the world was now okay. T and I sat in my room talking about my nonsense. I didnt even feel like I was talking. I knew I was but in another sense I felt like I wasnt.</p><p>After smoking more weed and then a few more hits of crack, we went down to the hot tubs at my apartments. As soon as I got in the hot tub I felt something I had never felt before. My whole body just felt fantastic. Almost like a roll but different in some way I cant quite explain. Sitting in the hot tub I didnt even want to move. I was content sitting there just letting the feeling take over my body.</p><p>It was weird. I could just look at T and now what she was thinking. And I didnt even have to say anything to her, she knew what I was thinking too. We just sat in the hot tub, closing our eyes and feeling like we were in paradise.</p><p>When I got out of the hot tub the feeling increased. Maybe it was the change in temperatures, I dont know. We walked (or should I say stumbled) back to my apartments and then proceeded to finish off the crack and smoke a little more weed. When we went back in my room I laid down and felt so completely euphoric that I didnt even want to move. I just lay on my floor, letting my mind drift. I could feel myself going in and out of a conscious state.</p><p>Somehow I climbed up to my bed and all I remember is laying there, my body and mind numb and feeling the best I ever have before drifting off to sleep.</p><p>The experience was strange. It was somewhere between a roll and speed. My body felt great yet I still felt like I did when I smoked speed except more calmed down.</p><p>I can understand how people could get addicted so easily and will not do it again for awhile. But all in all it was a good experience and I liked it. The next morning I felt a little tired but that passed as I got up and started doing things. I am lucky enough to be able to do something once in awhile and not get addicted.</p>",
 "year": "2001",
 "id": "10690",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-03-23T08:00:00.000Z",
 "views": "19668",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Crack",
   "form": "(freebase)"
  }
 }
}
