{
 "id": 10703,
 "title": "Good For Sleeping...Last High I Want To Try",
 "date": {
  "submission": "2002-02-18T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Experimentor",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.0 g",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "Ok, as a molecular biologist and one who's curiosity has gotten me into more trouble than good, I just had to try this poppy tea I have read so much about.",
  "Part I",
  "First, I am really confused about the legality of the whole thing, some say it is legal to have dried pods, others say it is illegal. I figure if they are being sold at craft stores (where I bought them) I am sure the DEA knows all about it. SO I went with the assumption that it is legal and gave it a whirl.",
  "I sent away for some dried pods, I got 20 dried ornamental pods for $10 (I was only supposed to get 10, go figure?). When they came, I was so excited I couldn't wait to try it...so I immediately ground up 1 pod to make the tea. I am very sensative to chemicals, so figured I better just see what one does.",
  "I recieved 20 randomly sized pods, so I just selected a medium sized pod. Cut the stem away, collected all the seeds (just because I had memorized the protocol..I have no idea what I will do with the seeds...I KNOW growing live plants is illegal). After the seeds were collected I got the good ol coffee grinder out and puverized the pod into dust. I mean it was so powdered it looked like I used a morter and pestle.",
  "I then boiled some water and when it reached boiling I poured it into a cup with the powder already waiting. I let it sit for 15 minutes, then made a aluminum foil filter (didn't have anything else). and drank the yellow, brown liquid down...",
  "It didn't taste as bad as I had read, yet it was only 1 pod..anyway, I didn't think I felt anything really because I had taken and anti-histamine for my sinus infection and cold. However, I slept like a rock! I slept for 10 hours and I NEVER sleep that long.. I woke up feeling a little groggy and I don't know if it was from the opium or the anti-histamine... But it gets better....",
  "I felt so crummy that I called in sick..then I had the bright idea to try a little more and see if I could really get some sleep or that feeling I read about...",
  "Let me say this before even starting with the good part of this story...I have taken percocet and vicodin for post surgical pain and they make me really happy and loving.",
  "Ok, part II",
  "I ground up all the remaining 19 pods and decided to evaluate differing dosages. I seperated the ground pod powder into a bag with 7 grams (3 poppy pods), one with 10 grams (5 poppy pods), and one with 15 grams (10 poppy pods).",
  "I got a really good idea on how to filter the pod muck...I used a coffee filter! ah ahah ah coffee grinder--coffee filter..it all made sense... Well, I used the 7 gram (3 pod) batch... that was at 11:30 am. It is now 6:15 pm and I am still feeling it strongly.",
  "At first I felt very nauseous and got a headache, I had what felt like a rubberband feeling around my skull. It didn't feel good at all. As a matter of fact, it never even came close to the feeling of a percocet or vicodin. All it did was make me tired and made my limbs feel really heavy. I told a freind it felt like I took sea sickness pill (dramamine). It was good for my cold/flu/sinus infection thing though, because I have been resting really well, even sleeping a little. But nowhere around was that euphoric feeling I was after. Oh well. As it is, that was the last high I had any desire to try. I have come to the conclusion that having a clear head, great relationships, lots of friends and working hard is the best high there is....and I have tried almost all of them."
 ],
 "erowid": {
  "id": "6321",
  "citation": " Experimentor. \"Good For Sleeping...Last High I Want To Try: experience with Poppies (Tea) (ID 6321)\". Erowid.org. Feb 18, 2002. erowid.org/exp/6321",
  "substance": "Poppies (Tea)",
  "views": "54460"
 }
}
