{
 "title": "Clowning Around",
 "author": "Kodos",
 "citation": " Kodos. \"Clowning Around: experience with 2C-I (ID 10708)\". Erowid.org. Nov 20, 2001. erowid.org/exp/10708",
 "substance": "2C-I",
 "bodyweight": "85 kg",
 "report": [
  "<p>Ah, Burning Man. What unrivalled opportunity to seek out new compounds and new states of mind. To go boldly where we haven't taken ourselves before.",
  "And so it was that our regular group of more or less seasoned travellers in the mind gathered once more, this time with the intent of trying the newest sacrament, 2C-I. Our state of mind, naturally enough, was calm; happy; peaceful. We all felt relaxed. We were all at home.",
  "I had previously measured and gelcapped 20mg doses and, when the time came, passed one to each of the participants in this trial. We vary in body mass, gender and tolerance levels, but all took the same amount.",
  "About 20 minutes later, we started to notice the first signs of an effect. I had expected it to take a little longer than that to come on, but perhaps the purity of the compound, empty stomachs, and our naturally enhanced receptivity made it easier to notice.",
  "We decided it was time to go a-walking, to see the sights and play with the denizens of Black Rock City -- and play we did. Within 30 minutes, we were all giggling, laughing, running around and pointing at the bright sparkly nature of everything we saw. Things weren't hilarious -- just very easy to laugh at (and with). There was no malice, no tension, and no nervousness. After an hour or so, it became time for me to dance; energy was high, though without the 'I must dance NOW' feeling of MDMA. Another plus: I retained coordination! There are many compounds that rob me of the ability to move with any rhythm or balance, though I really love to dance. Thankfully, this is not one of them.",
  "The rest of the night continued in the same manner -- dance a little, laugh a lot, and dance a little more. The high resolved itself to normality after about 6 hours, a little before dawn, leaving me feeling tired but happy and serene. Most of the other participants had hit the sack long before, so the remainder of us walked back to camp to make some coffee and have a quiet chat.",
  "I experienced no hangover whatsoever -- wonderful!",
  "I really, really liked 2C-I -- and so did many of the other participants in the experiment.</p>"
 ],
 "year": "2001",
 "id": "10708",
 "gender": "Male",
 "views": "7131",
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(gel tab)"
  }
 ],
 "submissionDate": "2001-11-20T08:00:00.000Z"
}
