{
 "id": 10719,
 "title": "Amazed that My Mind Made it Back",
 "date": {
  "submission": "2000-09-15T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Abyssal - H.O.D.",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>So months later I try it again.  Would it be consistent?",
  "I go through the two pills of e.  Okay time for the k.  I take a fairly big line.  And I will have done a few more throught the night every few hours...but the times are sketchy, so let me just draw the experience.  I am back in the real world.  I am warmly welcomed, but this time they expected me back..maybe they were concerned the first time I had abandoned them....dissociatives(dxm) and I had some differences...and k alone never returned me.  The people told me what they wanted, and as I flew above them I created towers and buildings out of energy.  I saw wonderful octopi flying about. ",
  "A brief interlude, then a change of scenery.  I am in my friend's apartment.  Their is some nervousness.  Why?  Ah, they are about to try a new friend, DMT.  I feel very shaman like at this point.  In fact I see myself as a shaman...sometimes even in real life.  There are two new faces here.  I decide it will be best to reside on the astral place to protect them all from evil spirits and energy...fear perhaps.  Again all is motion. Dancing and pulling energy from the air, pushing goodness into the minds and room as they try their new substance.  I see visions of giant centipede and jungles...am I seeing their trip I wonder?  We all return to the living room and discuss things.",
  "I decide its time for a bit more k.  This is where I go over the top.  Everything shreds.  I truly believe I have gone too far this time.  I still cannot believe a mind can come back from some of the things that it does.  I wonder if there is a breaking point.  The rooms spins, but not as it would for a drunk.  The motions seem familiar, as if the room was spinning in some fashion that I had always known, deep in my DNA, but was ignorant for not reocgnizing.  I approach a god state.  People are not people, there is nothing but a spining room texture mapped onto a spinning cube.  Everything becomes waves.  No people here, these images are simply light waves interacting.  No seperation between things, all is one.  The couch was my friend was this stranges arm, etc. ",
  "Then I realized it.  Oh my god!  What a delusion.  I am god..why am I so nuts as to think that this is separate and that is a person.  And I've lost it so much that I talk to myself..haha.  I think Im people?  I talk to myself as if I was someone else! haha.  I start to come down a bit..but time sequence is way off.  I think 'he will stand up and go to the kitchen' he does..wow..I am in control, I guess we are all the same.  'he will say this'  he does....this combo must do some real weird things with time sequencing in the brain.  Soon I begin to recognize things, carpet, tables...and I know Ive been here before...how sad...I was returning to ignorance.  But still amazed my mind could make it.  And as I spoke of these things I grew ever sadder, realizing that the people I was with, although I believed it at the time, did not share my experience.  How sad, k alwyas makes us think that everyone is there with us...how I wish they were.. they had enjoyed their dmt...I doubt Ill try it though.. what fun is being popped into a world for 15 minutes when you can be the god of your world for a few hours?",
  "sorry for the poor description of the visuals and mentals of the trip, but they do not correspond to normal thought and can only be understood I think with the added chemicals.  Im sure you can relate though.  enjoy..and be careful..this combo just sounds extra deadly :)  And I would advise moderation...keep it special, keep it spiritual, and dont lose it by doing it too often.  Let us look out for each other.</p>"
 ],
 "erowid": {
  "id": "633",
  "citation": " Abyssal - H.O.D.. \"Amazed that My Mind Made it Back: experience with MDMA & Ketamine (ID 633)\". Erowid.org. Sep 15, 2000. erowid.org/exp/633",
  "substance": "MDMA & Ketamine",
  "views": "9818"
 }
}
