{
 "title": "Amazonian Torture Drug",
 "author": "Persistent",
 "citation": " Persistent. \"Amazonian Torture Drug: experience with Syrian Rue & Anadenanthera colubrina (ID 1071)\". Erowid.org. Oct 13, 2000. erowid.org/exp/1071",
 "substance": "Syrian Rue & Anadenanthera colubrina",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "4.5 g",
   "oral",
   "Syrian Rue",
   "(tea)",
   "",
   " ",
   "oral",
   "Anadenanthera colubrina",
   "",
   "",
   " ",
   "smoked",
   "Anadenanthera colubrina",
   "",
   "",
   " ",
   "insufflated",
   "Anadenanthera colubrina",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>I recently decided to try experimenting with the shamanic snuffs derived from the South American and Carribean leguminous tree Anadenananthera colubrina. The snuff was prepared by moistening and smashing the seeds to a paste and mixing with a small amount of 'calcined lime' made by burning a small piece of snail shell. This paste was slowly dried in the oven at 200 degrees F and laboriously ground to as fine a powder as possible. This preparation method closely mimics that used by native shamans, though references to 'fermentation' have been made and it is possible that some fermentation or enzymatic process may account for the dramatic psychopharmacological effects of native snuffs that appear to be lacking in this Yopo analogue. Experimentation with my snuff intranasally at 100-250mg equivalent to 1-3 seeds led only to an uncomfortable though barely percievable pressure in the head, mild dysthesia of extremeties, feeling of racing or pounding heart and a strange alien dread which is hard to describe but is highly aversive in a insectoid way even when the feeling is barely percieved. As no significant psychedelic effects were obtained I decided to try smoking.</p><p>Started with 1 seed dried and crumbled smoked in a typical M.J. pipe. Yuck!! Blarrrgh!!! The smoke is smooth, but the taste immediately makes me think of burning cockroaches. Somehow I take the 2 more tokes it takes to finish the seed and try to ignore the smell/taste and observe. No visuals no auditory, only a more intense head pressure, more intense cardiovascular effect, and considerable nausea. Perhaps an extract would make this easier.</p><p>20 seeds are ground in the blender with 100ml water and allowed to soak for two days, are boiled until volume considerably reduced, strained, liquid saved, seeds reextracted by same procedure, liquid extracts combined, poured onto 100mg 'calcined lime' and dried under a lightbulb. Yeild 800mg brown material. At first my approach was to follow the usual method of smoking DMT-smoke your dose quickly. This approach yielded effects similar to those experienced in my previous experiments but more unpleasant. Still no detectable mental or sensory effects. The maximum amount i was able to smoke, 200mg, finally produced some minor visual effects, a barely perceptable waviness without any color enhancement. Mental effects were more appreciable and consisted of unfamiliar fearlike feelings that were not fear. By now I am getting used to the masochistic ritual of smoking this foul substance but am quite frustrated by the lack of dramatic effcts. I decide to go out on a limb and try something I have never heard of anyone doing, making a 'Yopohuasca' with P.harmala.</p><p>In native tryptamine using cultures plants containing 5Meo are almost always used for making snuffs while DMT-containing plants are taken orally with B.caapi. There is probably a very good reason for this.</p><p>10 seeds were moistened, smashed to a paste, rolled into pellets and air dried. A tea of 6g P.harmala was consumed slowly over 1 hr to prevent nausea, Yopo pellets consumed about 20 minutes after last harmala, 2 hrs later no effect, food is tried resulting in a powerfull purge session accompanied by translucent geometric visuals resembling shards of grey frosted glass moving in revolving circles. Visuals end within seconds of finishing purge, no mental effects were noted that could not be attributed to the harmala.</p><p>Conclusions: A. colubrina seeds contain less than .5% 5-Meo. Snuffs containing higher alkaloid contents (up to 6.4% has been reported) may be subjected to some enzymatic process unknown to us now.</p>",
 "year": "2000",
 "id": "1071",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-10-13T07:00:00.000Z",
 "views": "65119"
}
