{
 "id": 10724,
 "title": "Lost in the Armageddon",
 "date": {
  "submission": "2008-01-24T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MondayTripper",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2.0",
    "quantity": "2.0"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I had been very curious about altering the way my body normally functions for some time now. For the past year I had watched many of my friends partaking in the use of several substances, mostly marijuana. I had only started to smoke a month or two before this experience.",
  "It all started one day in the coffee shop that my friends parents owned and he was expected to work at. We were alone there, myself and three other friends. The one who owned the coffee shop will be called friend 1, the most experienced user will be known as friend 2, who had done mushrooms many times before, and the last will be known as friend 3. I happened to come upon some mushrooms around 3:00PM completely by surprise and decided it would be a good day to try them. I opened up the bag and poured the dried mushrooms into my mouth along with some dust that was with it.",
  "For a while I felt nothing but was told it was normal by friend 2 (I was the only one of the 4 that had any). After about a half hour everything seemed to be getting darker, which was odd because it was only about 4:00PM. The four of us then moved to the front yard to sit while I waited to trip. Things began to obviously look off, the grass was a magnificent color of green and as I moved in for a closer look it began to grab onto my shoes. I then looked up and noticed a sign with the name of the coffee shop on it and as I gazed upon it I began to feel a powerful force pulling me towards it. I said, Dude That sign is pulling me in. Friend 2 said, Dude! Hes being pulled into that sign! Then he laughed heartily. As I clung to the table I was sitting on to avoid being sucked into the sign I remember thinking it was good the grass was holding on to my shoes, to help me from being sucked to oblivion. I looked all around, the street we were on was a pretty busy one, with many people passing in cars and on foot, I started to feel like nothing existed beyond that street at all, that we were all that was left of the universe.",
  "Eventually we ended up upstairs where there was a Nintendo 64 and we all played Mario kart. I started the race off all right, held first place for a while but then began to slouch down and stare at the floor, completely lost in my thoughts. Still holding the gas button my character was pounding into a wall and noticing this my friend sitting next to me jostled me and asked, Hey, you alright? I replied with something like Uuuuugggghh, yeah, why? he said Youre crashing into a wall I looked up and remembered I was playing Mario kart so I started to race again but this lasted only a few moments as I lost myself in thought once again.",
  "I looked over at Friend 1 and he appeared to be a zombie, Pale skin with a blue-ish cast to it and teeth looked like they were meant for ripping human flesh. I was very glad he was a good friend of mine and would never eat my brain. At this time its about 5:30. This trip was a very mental one for myself, I had many visual hallucinations but the state of my mind was the most amazing thing to me.",
  "I dont recall how long it had been. I was sitting in a chair completely oblivious to the people sitting right next to me playing Mario kart but we ended up heading to a nearby park. This was where the trip became the most intense, we walked outside and I connected myself with reality once more. We stood near 3s car, which was sitting about twenty feet from us and five feet beyond that was a large tree. Everyone was standing around for some reason I could not understand and I was feeling very uneasy. I looked up at 3 and he was obviously taking a new shape. 3s shape became very dinosaur-like. This may be due to my recent viewing of the movie Fear and Loathing in Las Vegas where people became dinosaurs under the influence of LSD.",
  "3 noticed that I was looking at him in an odd way so I then looked at 2. 2 looked back at me and smiled, as he smiled horns began to form from his hair and he took on a very demonic look. I then interrupted 1 saying something to say, Dude, lets get out of here, that trees getting all over 3s car and it was. The tree was drooping horribly and began to melt onto the car. As this happened the car was not damaged but the tree seemed to become a moving image painted onto the car. All three laughed at this statement and we began to load into the car. We left at I dont recall any driving but suddenly we were standing beneath on a large stage at the park and 1 was climbing a steel cable holding the ceiling, which was a large white tarp. The time was around 7:30, everything was very wavy and the trees were swaying unreasonably for the small amount of wind there was.",
  "At this time I had a feeling that I needed to get home very soon because I had to wake up very early the next morning. I argued to my friends that it was really late but they didnt seem to think it was late at all which annoyed me very much. Eventually I convinced them to take me home but they wanted me to have time to start to cool off so 3 drove 1 and 2 home first and then me. The drive was the most mental segment of the trip. I began to feel as if the universe had ended. I may have had my eyes closed but I had no vision beyond what I saw in my mind. I had convinced myself that the universe had ended and I was living in a single white dot, like the one depicted in the center of a freshly broken TV on a cartoon. I spent quite a bit of time contemplating what Id do for eternity as a conscience living in the small circle left of existence, and the time that elapsed seemed like years.",
  "I was a few decades into eternity when I remembered I had eyes, which I then opened. I was leaning against the car door with my face melted into the bottom of the window. I pulled my face away from the door and realized that I had turned into a puddle that was then sitting in the seat of 3s car. I tried to remember what I was as I stared at the passing trees out the window which looked like they were moving with us. Any shape I had once held had been lost in the years I spent in the end of the universe. Along with the memory of who or what I was I also lost all memory of anyone I knew or places I had been. I thought as hard as I could and remember a few things. I was a human, which meant I had to have parents, but could not remember who they were. I was in a car with 3 on my way to my home, which I could not at the time picture. I asked 3 many questions in this time without realizing it none of which I remember. The drive lasted only about 45 minuets but due to the mushrooms felt like many, many years",
  "The time was now about 8:30, we rolled up to my house and I thanked 3 for watching out for me and we said out goodbyes. Looking at my house I remembered everything and was very worried that I may flip out upon entering the house and get myself in some trouble with my parents. By this time the hallucinations had ended along with the twisting of my mind. I went in the front door and up the stairs to my room. I sat down at the computer and was greeted by 2 on AIM. It was now about 9:30, all open eye visuals were long gone and the twisting of the mind had ended but I still had closed eye visuals and pupils the size of quarters.",
  "Sitting in my room reflecting on the trip I was listening to white rabbit and had the volume pretty loud. There was a sudden knock on the door. I leapt from my chair to turn off the lights so my mom wouldnt see my enlarged pupils and I wouldnt get busted. She noticed I had bolted from my chair and switched the lights off and asked in a very accusing tone What are you doing? As the song White Rabbit (which I had on repeat) passed over the lyrics One pill will make you larger, and one pill makes you small I answered nothing I was sure I was screwed but she just said Turn off that music and go to bed."
 ],
 "erowid": {
  "id": "63313",
  "citation": " MondayTripper. \"Lost in the Armageddon: experience with Mushrooms (ID 63313)\". Erowid.org. Jan 24, 2008. erowid.org/exp/63313",
  "substance": "Mushrooms",
  "views": "2489"
 }
}
