{
 "title": "Swimming Into the Sea",
 "author": "Quiet girl",
 "citation": " Quiet girl. \"Swimming Into the Sea: experience with Methamphetamine (ID 10733)\". Erowid.org. Nov 21, 2001. erowid.org/exp/10733",
 "substance": "Methamphetamine",
 "bodyweight": "120 lb",
 "report": "<p>Drug use was something I did when I was in high school . . . but not as an adult, or so I thought.  My meth addiction started after a break up with a boyfriend.  What a sorry excuse to get involved with 'girl' but . . . that's when it happened.  I ran into some old friends and they had much to bring to the table.  It was partying on the weekends which was a release for me.  The first line was WONDERFUL . . . it hurt like hell but that pain was something that soon became the best part.  I would think about meth and my mouth would water.  My nose would run before I got my hands on some and then . . . . heaven!  A small group of us would get together and we would spend the entire weekend doing meth while talking about everything, starting projects, and it was great.  It was therapy for me, and made me feel like I had a connection to those people and that we were all on the same level.  One line every hour until Sunday afternoon.  I couldn't do any after noon or I wouldn't sleep Sunday night and be ready for work on Monday.</p><p>Eventually the weekends were not as good as they used to be and the money I was spending on drugs became too much.  Now, I am struggling to stop.  I have done one line every day for the past three months and that is just to keep me going.  The weekends are not partying but are spent in silence. I do my stuff while other people do what they want.  The projects aren't getting done, along with the laundry, dishes and shopping for food.  My boyfriend said enough is enough and I am standing by that.  We both love one another and don't feel like we are in control any longer.  This is as of TODAY!  We split what was left this morning and that is all.  I am going to be strong!  (I hope)</p><p>I always felt like it would be okay as long as I was in control of what I was doing!  I can party and work and pay bills . . . as long as I do all those things . . . . but it got to the point where only with meth did my daily activities get done!! </p><p>",
 "year": "2001",
 "id": "10733",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-11-21T08:00:00.000Z",
 "views": "10593",
 "dose": {}
}
