{
 "id": 10731,
 "title": "Complete Bliss",
 "date": {
  "submission": "2007-07-10T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Ali Al",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 3:00",
   "amount": "55 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Let me start by giving a little background on myself.  I am a male weighing 210 and I am an experienced tripper with what I found to be a very low sensitivity to hallucinogens.  By that I mean that I have always had to take more than the recommended strong dosages to get an effect.  With that in mind I have still managed to trip on LSD, 4-ho-mipt, 5-meo-mipt, 5-meo-dipt, DIPT, DOI, 2C-I, 2C-E, methylone, MDMA, and I usually take benzodiazepines if I feel anxious or if I am too restless to go to sleep.   Out of all the stuff Ive done I have found the wonderful combination of MDMA and 2C-I the most rewarding of all.",
  "On the night of the trip my girlfriend and I had in our possession 4 ecstasy pills and some 2C-I.  We decided to drop two rolls each and enjoyed the common euphoria from MDMA.   After three hours of the MDMA ingestion, while on the comedown, and not wanting the effects of the ecstasy to wear off we decided to take some 2C-I which I have read to be similar to the effects of ecstasy and LSD but not a direct mix of them.  ",
  "Because of my low sensitivity I swallowed 55 mg of 2C-I and my girlfriend who is a normal dosager took 30 mg. [Erowid Note: 30 mg is not a 'common' dose of 2C-I; it is typically considered a strong dose.]  With the peak sensations of the rolls wearing off I was expecting a usual 2C-I trip.   What followed was the most gratifying experience of my life.",
  "The 2C-I crept up on me without me realizing it.  The tingly sensations of the MDMA suddenly appeared to be accompanied by subtle changes in my perception.  Then the senses of touch and hearing that were declining were brought back even higher to how they were when we were rolling earlier in the night.  By the time I really noticed what was happening I was soaring in full tactile, visual, and emotional happiness.",
  "I began seeing bright and colorful energy plasma waves emanating from a TV we had on hooked up to a laptop playing some online radio trance with killer Winamp visuals.  Then I noticed it was not just the TV but that all the objects in the room were radiating the most delightful and most positive energy waves.  It was as if each object and light source was a beacon releasing happiness and I was lucky enough to be there in that room absorbing the magnificent energy while being intimate with my girlfriend.",
  "I was in a state of bliss from what I remember thinking was a piece of heaven.  I could not fathom to dream a dream where I could be more happy then where I was at that very moment being one with my girlfriend absorbing amazing plasma rays of color and sound as they gushed at me while in a state of complete body-gasm.  Body-gasm? Imagine feeling a regular orgasm but feeling it without end in a perpetual synergy of sound, body, euphoric blazing energy waves, and colors.  It was a combination of the best acid trip visuals multiplied by the most refined pure ecstasy the human body can endure.  I believe if everybody in the world could experience nirvana like that the world would be a better place. ",
  "The experienced has far surpassed any trip or roll I have ever done in terms of visuals, sensations, and overall sense of perfection.  So far it has been the happiest night of my life and if I died tomorrow then I will die gratefully knowing I was able to cherish this magical combination of MDMA and 2C-I."
 ],
 "erowid": {
  "id": "63349",
  "citation": " Ali Al. \"Complete Bliss: experience with MDMA & 2C-I (ID 63349)\". Erowid.org. Jul 10, 2007. erowid.org/exp/63349",
  "substance": "MDMA & 2C-I",
  "views": "4597"
 }
}
