{
 "id": 10745,
 "title": "I Don't Want To Kill Myself, Do I?",
 "date": {
  "submission": "2002-02-21T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "s0maDreem",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  },
  {
   "time": "2:30",
   "amount": "0.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  },
  {
   "time": "4:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": ""
  }
 ],
 "report": [
  "I had only done a very small amount of acid before trying shrooms, so I was hardly prepared for my first trip. I would describe my acid trip as having a broken record for a brain and seeing false colors and lights. Shrooms were completely different.",
  "I went on a ski trip with some friends. After a good day of boarding, I retired to our room and ate 1.5 grams of cubes around 1:30. My friends went out shopping while I stayed in.",
  "2:00 I put on some house/dj music because I started to feel very energetic and different, so  some appropriate music was neccessary. I first noticed time slowing down. I can only describe it as passing out of the confines of time; I could check the clock after what felt like a day and it would still be the same minute.",
  "3:00 I lose my appetite. Started to feel very dizzy. I sat down. This would be what I could only describe as a body trip, because I felt like I had melted into the couch. I watched as objects started to take on new animation, such as indoor plants moving as if in a breeze. I also noticed some visuals that I can describe as if some things were being stroked with an invisible waterpaint-brush. If you've ever seen What dreams may come, you can kinda picture the paintbrush description.",
  "4:00 I ate another stem, because I though the trip was ending, and I was really enjoying the visuals. Bigggg mistake. From here...things went horribly wrong. I started to see much more intense distortions, such as my hand growing in length; the faces of my friends looking alien and bug-eyed and very big; and as it started getting darker out, so did my trip. Things got worse as it got darker out.",
  "4:30 It seemed like an eternity had passed in the last half hour. I was tired and I wanted the trip to end. That singular thought was like shooting myself in the foot. The thought was  the seed of anxiety, which blossomed. If I could equate that thought as 'x', the thought was soon X squared or cubed. I was infinitely scared by the thought of tripping for the rest of my life. This thought preoccupied my mind instead of the visuals. The way I understand this now is that the shrooms are active in the region of the brain you are using; If you are looking around at objects, you will see distortions. If you think an anxiously, the anxiety becomes distorted instead of the visuals; which is exactly what happened to me. I was no longer enjoying any visual trips. Instead, the shrooms had occupied the fear region of my brain. I didnt understand this at the time of my trip. Anyway, I had soon left the room with my friends and had stripped myself of my clothes and layed in bed, freaking out and wondering when the hell it would end.",
  "5:00 Lying in bed wondering when it would end caused me to become even more terrified. I had one thought that if I had I gun I would shoot myself to end the trip. I regretted this thought immediately, and the regret of the thought turned into more anxiety about the whole deal. I was now sweating and unable to communicate.",
  "5:30 Somehow even though I felt unable to communicate with my friends, I was able to get my friend to scrounge up some Xanax, which is a muscle relaxant and anti-anxiety prescription drug. I took two of them, because I was desperate for an 'abort' button. The pills did calm my anxiety, which was better, but not good enough. Without the anxiety, I ended up seeing the visuals again, which, unfortunately, continued for about another hour. Under my covers, 6:30. The last of the shrooms were slowly wearing off, and I was very relieved and exhausted. I ended up going to bed early, which I neeeded. I didn't sleep well all because I was upset about my suicidal thoughts I had had while tripping.",
  "In retrospect, I wouldn't give the trip a positive or negative grade. The visuals were not worth the freak out. Future trips I plan on doing with a friend who is tripping during the day, well rested and in the woods. Never will I be alone tripping, in a bedroom, at night.",
  "The experience has made me fearful of myself and my own thoughts, and has basically ruined my ego. I would like to believe I don't have any ego any more. This may be a good thing in terms of my relationships with other people, because now I feel much more in touch with the true me, instead of loving some persona that I imagined myself to be. I am more withdrawn now, because I find that I don't need other people around me or to talk to in order to understand who I am.",
  "Anyway, I warn anyone trying shrooms for the first time to do the following things:",
  "1. I wouldn't trip at night. You might be to tired and might not be able to focus and enjoy yourself.",
  "2. My opinion is, trip with someone else who is experienced or is also a first timer. You might need each other. Don't trip with others who arent tripping because they will bother you immensely.",
  "3. If you have access to any anti-anxiety drugs, such as Xanax or others like valium or any other drug listed in erowid's psychedelic crisis faq, have them on hand in case you freak out. Just having them in your pocket while tripping may be enough of a reassurance to prevent a freak out. And if you do freak out, you will have them to take if you want.",
  "4. Be well rested and in a good mental state. Don't be tired out from school or work or from a party (or at a party, for that matter). If you did ecstacy recently, don't trip. The comedown on E will leave you in a mental state that would be disasterous on shrooms. I have yet to try E and shrooms at the same time, but I assume it would be very good, because the E would eliminate any sort of anxiety from the shrooms and I'm sure there must be some interesting experiences with them together.",
  "That said, happy tripping."
 ],
 "erowid": {
  "id": "6342",
  "citation": " s0maDreem. \"I Don't Want To Kill Myself, Do I?: experience with Mushrooms (P. cubensis) (ID 6342)\". Erowid.org. Feb 21, 2002. erowid.org/exp/6342",
  "substance": "Mushrooms (P. cubensis)",
  "views": "11987"
 }
}
