{
 "id": 10746,
 "title": "Nice Euphoric Feeling",
 "date": {
  "submission": "2002-02-21T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pablo",
  "gender": "Male",
  "weight": 127
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Recently I have been experiementing with snorting Ritalin.  Using Ritalin this way really intensifies the effects - faster onset and a greater buzz.  Doing this is easy - Ritalin tabs are easily crushable and from a fine powder - real use to use intranasaly.  I have used amounts ranging from 10mg -20mg, crushed & snorted.",
  "The buzz hits in about 4-5 minutes after snorting it up.  I would describe the buzz as cocaine-like.  Nice euphoric feeling with a slight tingling in the nose sensastion.  Heart rate & blood pressure are slightly increased as well.  To me, this is the closest pharmaceutical *high* to street Cocaine that I have experienced.",
  "More technical info:  There was a study done a few years ago comparing intravenous methylphenidate (Ritalin) to intravenous cocaine.  The purpose of the study was to find out how similar these two drugs were.  The report found that the receptor sites in the brain where methylphenidate attached to (dopamine receptors) were identical to the dopamine receptors that cocaine attached to.  The 'subjective' experience of the 'high' reported by test subjects was similar for both drugs.  So, if you have a University with a medical /health sciences library nearby, you can go & look up the article for more detailed info.:",
  "[Reference Links Added by Erowid]\rPay Attention: Ritalin Acts Much Like Cocaine,\r\rVastag B",
  "JAMA, 2001; 286(8):905-6\rAssessing the abuse potential of methylphenidate in nonhuman and human subjects: a review,\r\rKollins SH, MacDonald EK, Rush CR",
  "Pharmacol Biochem Behav, 2001; 68(3):611-27\r\rIs methylphenidate like cocaine? Studies on their pharmacokinetics and distribution in the human brain.,\r\rVolkow ND, Ding YS, Fowler JS, Wang GJ, Logan J, Gatley JS, Dewey S, Ashby C, Liebermann J, Hitzemann R, et al",
  "Arch Gen Psychiatry, 1995; 52(6):456-63"
 ],
 "erowid": {
  "id": "6344",
  "citation": " Pablo. \"Nice Euphoric Feeling: experience with Ritalin (Methylphenidate) (ID 6344)\". Erowid.org. Feb 21, 2002. erowid.org/exp/6344",
  "substance": "Ritalin (Methylphenidate)",
  "views": "63420"
 }
}
