{
 "id": 10749,
 "title": "Massive Panic Attack",
 "date": {
  "submission": "2009-07-10T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fixxxer",
  "gender": "Male",
  "weight": 125
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "2:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "4:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0:00",
   "administration": "",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "the last time I used x was about two years ago.  I had done it about 9 times before, and had become well acquainted with the effects.  I was used to the fact that the next couple of days I would feel down, and had expected it. ",
  "However, what I did not expect was the onset of a massive panic attack.  About 4 hours into the trip (I had taken 3 pills, 2 hours apart) I felt my heart beating very fast.  I know that is normal, but I was very aware that my pulse was high.  I could hear my heart pounding in my head, and felt dizzy.  Suddenly I felt as though I was dying.  No matter what I did, I could not shake that feeling.  I was terrified, and what was worse was that it was for no reason at all.  I couldn't rationalize what I was feeling.  Finally I crashed, and I woke up a couple hours later feeling much better. ",
  "A few days later, I was driving into work.  I felt a strange tickle in my chest, and noticed my heart was pounding.  I pulled over and my head started to spin.  I broke out in a cold sweat, and I felt dread take over my mind.  I was sure I was going to die.  I felt pains in my chest, and my arms went numb.  5mins later I started to feel better.  I called my doctor, who wanted to do an EKG.  He did the EKG,  as well as several other blood tests.  They all came back normal.  I was perfectly healthy, physically anyway.",
  "Within a week of the appointment I had another panic attack.  This one was far worse than the fist two, and persisted for over an hour.  I went back to the doctors.  They did more tests, and they came back negative again.  My heart was healthy.  My mind was not.  I was diagnosed with panic disorder.  I came clean about my habits with my doctor, and asked if they could have influenced this.  He was certain that they had.  He told me that I was dealing with the consequences of a bad choice.  I have been clean since then.  The panic attacks have become less frequent, and much less intense.  I still experience flashbacks though.  I am not sure if this is soley the result of x, or just that it agrivated a pre-existing disposition to panic disorder.  I can say that the x played a major role in what happened to me though.  I am getting better, but the first year was hell.  If I knew there was only a one in a billion chance of feeling that way again if I did more x, I still wouldn't.  It was that bad.",
  "[Reported dose: 3 double stacked pills (yellow lightbulbs)]"
 ],
 "erowid": {
  "id": "63458",
  "citation": " Fixxxer. \"Massive Panic Attack: experience with MDMA (Ecstasy) & Cannabis (ID 63458)\". Erowid.org. Jul 10, 2009. erowid.org/exp/63458",
  "substance": "MDMA (Ecstasy) & Cannabis",
  "views": "5741"
 }
}
