{
 "title": "Horse",
 "author": "tiredetc",
 "citation": " tiredetc. \"Horse: experience with Heroin (ID 10753)\". Erowid.org. Oct 14, 2004. erowid.org/exp/10753",
 "substance": "Heroin",
 "bodyweight": "",
 "report": "<p>Because it hurts. Because my skin is red-hot with freezing sweat that pipes from my pores like ice-cream, curling up and settling until it spreads across the duvet that begins to tighten like a velum over my body. Because I sneeze and sneeze and cough and shiver and my eyes have to squint to take in anything. Everything I dont want to, everything that has eluded its necessity, its reason. Because of this I have things.</p><p>The kitchen is full of mess though I havent eaten. It is mugs and cereal dishes, about thirty thousand of them. The plants are dead, but they were lovely, old, they had travelled with me, and now theyre dying. The sink smells of the fish I ate three months ago, it could be four, it couldve been years. It couldve been days. Maybe I never ate a fish, it seems unlikely now.</p><p>Theres a fully-functional, disused bath in the sickroom. The toilet overflows with vomit from many unknown mouths, their voices are still here too, mainly silent, but muttering here and there. Theres a scrubbing brush in my hand and porcelain under the goo. The window opens but itll have to wait because a breeze of cold nails will fly in, and land bulls-eye on every pore, twisting in and dissolving. The bleach smells good, smells better at least. The bowl sparkles and shines. The toilet is beautiful now. I run water into the bath to wash away the dust and hair. Soon, when my skin relaxes I will sit in it. This could be days, but its ready, waiting for that day. Maybe my body will be as good as the toilet then. But itll wait, because it hurts, because my skin is red-hot with freezing........</p><p>Theres no fish remains in the kitchen sink which makes it worse cos I dont know what else could smell like that. The waters brown, soupy, suspending, the sediment is death powder, of no use but to remind. I puke in the sink before I start.</p><p>I pour five half bottles of wine into the sink. I jam my fingers into the plug-jam and it all starts draining. I wash everything there is, I rinse it all twice, there are no suds left, no death powder, no stench of an absent yet nonetheless effecting decay.</p><p>I change into some origin unknown clothes, they are clean but ill-fitting, they are possibly womans jeans, but enough to take me to the launderette, where the lady will wash my clothes of the past they shared with me, the one they retain a memory of. A heavy one I imagine. What is this dust? Where is it from? What is this fluff. Shit the fluffs worse than the dust. The vacuum will lift the dust, this I know, the fluff however, I think the vacuum makes it worse. I need a fluff-vacuum, something like that. First Ill sleep.</p><p>Im sweating so much I wake in a hopeful dream Im swimming. This lasts a good ten minutes before I notice the bath has run over, and I awake-proper watching it all drain wastefully away, the floor scrulching underfoot.</p><p>I heat some soup and throw it away. The front room. Oh god the fluff. I take a broom to it, the work makes me hot, which makes me cold, which makes me shiver, which heats me up, which makes me cold.</p><p>I sent my girlfriend packing recently. I remember her skin feeling like razor-wire on my thighs, her nails penetrating my skin and finding nothing but bones with the consistency of freshly quarried chalk. I sent her packing, but what would she have packed? Shes gone though. I look around, what has she taken, what might she have taken, what would she want to take from this museum of mine, of me, of what I was? Certainly not the fluff. She probably put it there. Thats female fluff for sure!</p><p>Because it hurts. Because my skin is red-hot with freezing sweat that pipes from my pores like cream, curling up and settling until spread across the duvet that begins to tighten like a velum over my body. Because I sneeze and sneeze and cough and shiver and my eyes have to squint to take in everything. Everything I dont want to, everything that has eluded its necessity, its reason.</p><p>Because of this, Im leaving the horse alone.</p>",
 "year": "1999",
 "id": "10753",
 "gender": "Male",
 "timestamp": "2004-10-14T07:00:00.000Z",
 "views": "18512",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Heroin"
  }
 ]
}
