{
 "id": 10756,
 "title": "A Joyful Night",
 "date": {
  "submission": "2008-03-11T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "EasyRider",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "2.0 mg",
   "administration": "insufflated",
   "substance": "Pharms - Alprazolam",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:30",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 3:00",
   "amount": "1 repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "<p>Last night was my first night ever using 2C-E. I was lucky enough to get it from an acquaintance who had ordered it off the internet. I am happy to report that it was completely worth it, but also completely different from what I expected. Before last night, I had had no past experience with hallucinogens. I smoke cigarettes, pot, and salvia; I drink; and I snort cocaine, prescription pills, and amphetamines. I do this all fairly often (on a weekly basis). I expected hallucinogens to be a completely different experience from all these things--I thought I would see visuals and hear things, but this didn't turn out to be the case. I was in for a much different experience, but one that was definitely not disappointing.",
  "I was planning to attend a house party last night at 10:30pm with a group of good friends. I figured that this comfortable atmosphere would be a good place to try something new. So around 7:30, I took the 2C-E, dissolved in a capful of water. The doseage was 20 mg, which turned out to be reasonable, as I experienced no negative effects that night.",
  "After taking the 2C-E, I had some time to burn before the party, so I went to my best friend's house, hoping to start feeling the effects there. I didn't really feel any effects for an hour after taking the drug, so I snorted 2mg of Xanax (half a bar) around 8:30 or 9. I was a little worried about what the 2C-E would be like when it hit. So far it was throwing me for a loop, because I wasn't feeling anything yet. My friend was drinking and suggested that we go smoke. It only took about 3 hits of the marijuana for me to feel very, very high. This was about 1.5 hours after the 2C-E and I was finally feeling it.",
  "Everything felt nice, enjoyable, perfect. I took pleasure in everything--our conversation, the sense of friendship, the beauty of our spot outside, the stars above us. I wasn't seeing anything or 'tripping out,' but I felt incredibly happy. My friend had other plans after toking, so I got a ride to the house party, about 3 hours after taking the 2C-E. By this time the marijuana was wearing off and the combination of Xanax and 2C-E was taking effect. I felt happy, warm, and loving. I was content just to be.",
  "As the night progressed and the 2C-E took over, I had an urge to just lie on the couch and let everything around me wash over me--music, people, voices. At the same time, I was completely in control over myself and my thoughts--it just felt good to let go and feel the pleasure of every experience. It felt extraordinarily good to be touched. I decided that 2C-E would be an amazing drug to go dancing or clubbing on. It was a very physical drug, not mental, in that I could think straight and act sober, but felt very bodily high and pleasant, very physically responsive to everything in my environment. I was definitely much more in control of myself than the drunk people around me, but I was definitely high.",
  "I felt bad for those around me, because I knew that feeling drunk was crap compared to this perfect feeling. Throughout the entire night I felt absolutely no discomfort. I was chainsmoking constantly, and even sipping straight vodka. The only downside was that I was completely reticent. Whereas alcohol and marijuana tend to make me talkative, the 2C-E made me more contemplative, quiet, and content. I wanted to be able to join in on the loud, talkative party atmosphere, but I just didn't feel outgoing enough to verbalize.",
  "Physically, though, I was very responsive to touch and very warm and happy at the peak, which was between 12am and 2am. The effects finally tapered off around 4 or 5am. All in all, a very good experience that I am looking forward to repeating again ASAP. Hopefully next time I will experience the colors and visions that my other friends had while on the drug.</p>"
 ],
 "erowid": {
  "id": "67447",
  "citation": " EasyRider. \"A Joyful Night: experience with 2C-E (ID 67447)\". Erowid.org. Mar 11, 2008. erowid.org/exp/67447",
  "substance": "2C-E",
  "views": "3654"
 }
}
