{
 "id": 10757,
 "title": "Silent Serenity",
 "date": {
  "submission": "2001-05-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Tera",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(extract)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(leaves)"
  },
  {
   "time": " T+ 1:40",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(extract)"
  }
 ],
 "report": [
  "It was a beautiful misty night. It had been raining all day and I was on the verge of some strange feelings that I had been staving off all day. I had been reading about damiana for a while and I liked what I had heard. So I thought I would give it a try. I had no expectations of what I was supposed to feel from it but I did know what I was looking for spiritually, so I knew if anything, the effect would be subtle. I began with extract at 3,000 mg placed under my tounge. After about an hour I felt a slight shift in perception. Almost as if the doors had been opened to a new path i hadn't previously noticed. I felt a strong urge to connect spiritually and I craved understanding. I began talking more openly than I had in weeks to a girlfriend of my mine. Around an hour after my first dose, I smoked damiana leaf that was about one bowl's worth. I noticed that the feelings of angst had completely gone and I was reaching a level of stillness I don't think I ever have before. I then took more extract about 40 minutes after that. My total dose was 7,000 mg plus one bowl of leaf. Some might mistake it for fatigue. But I felt coneected in a way that was almost emotionless. Yet it was all emotion and I was totally aware. I was part of the oneness and no longer seperate. I began to think that all of my struggle manifested when I had removed or somehow distanced myself from the nature force or the godforce or the oneness..whatever one may call it. I cared deeply for everything, but had no opinion in a sense. A feeling of total acceptance of all that is. Around 1 am I think I fell asleep(this all began around 10 pm.) I had the most peaceful nights sleep in a long time. It was a nice break from the turmoil of being human. I could let it all go and just BE.I wish I could feel like that more than I do."
 ],
 "erowid": {
  "id": "6745",
  "citation": " Tera. \"Silent Serenity: experience with Damiana (ID 6745)\". Erowid.org. May 14, 2001. erowid.org/exp/6745",
  "substance": "Damiana",
  "views": "47652"
 }
}
