{
 "title": "I'll Be Doing Those Round Things Again",
 "author": "Brendan",
 "citation": " Brendan. \"I'll Be Doing Those Round Things Again: experience with Morning Glory Seeds (ID 10752)\". Erowid.org. Feb 14, 2002. erowid.org/exp/10752",
 "substance": "Morning Glory Seeds",
 "bodyweight": "165 lb",
 "header": [
  "DOSE:",
  "2 tablets",
  "oral",
  "Dimenhydrinate",
  "(pill / tablet)",
  "",
  "300 seeds",
  "oral",
  "Morning Glory",
  "(ground / crushed)"
 ],
 "report": "<p>Just last week, I recieved my packet of Morning Glory seeds I had ordered via the Internet.  As soon  as I got them, I ground them up in my automatic coffee grinder as best I could.  I then let the seeds sit in a bowl of water for about an hour, then poured the entire mixture into a giant mug.  (I had tried to crush the seeds to as fine a powder as I could, but they were still really chunky.  But I had read here on this site that if you drank the seed mixture it would fuck you up a lot more than just the water).  I then heated up the water/seeds in the microwave until it was steaming hot.  While it was in the microwave, I took two Dramamine.  Then I took the mug out, put spoonful after spoonful of sugar into it, added honey, and a tea bag.  The mixture smelled really funny and I knew at that moment I was going to feel sick after I drank this.  I proceeded to drink it anyway, of course.  I didn't get this far just to back down now.</p><p>So I drank some.  At the second or third sip, I already noticed that Aphex Twin playing on my stereo was starting to sound farther away.  And the lights in my apartment were dimming and brightening in a strange ebb and flow.  So I kept drinking, thinking 'Hey, maybe this IS gonna be good...'</p><p>By the time I had gotten down to the bottom of the mug, I was starting to swallow huge chunks of slimey seed pieces and I was feeling queasy.  I had to stop drinking and lay down.  Everything started spinning really bad and I swore I was going to lose all that i had just drank.  I tried to relax and I think I passed out for a few minutes.  When I came to again, I felt even worse and I crawled to the toilet and tried to heave all the shit out of my system.  Nothing came.  Now I was hating Morning Glory seeds.</p><p>I tried to eat something, but felt even worse.  Then, soon after my girlfriend came home, I started to trip and the feeling of sickness completely drifted away.  I say that the trip itself makes up for the sickness of the first hour.  The trip I experienced was very visual (with lots of breathing walls and great mirror distortions) and I must have sat at my keyboard for hours, playing the same beautiful notes over and over again.  I tripped for a good 4 hours with almost no decrease in visuals and body sensations.  Then it wore off at a quick slope, and led to feeling very fatigued.  I couldn't sleep, but I was really used to that from numerous LSD trips my first year of college, so it was no big thing.  I eventually drifted off into a seried of odd dreams. </p><p>I woke up the next morning in a thick haze that lasted basically all day.  Everything was really bright and I found it difficult to keep my eyes open.  But I have to say I had a pretty good trip on Morning Glories.  I'll be doing those round things again...</p>",
 "year": "2001",
 "id": "10752",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-14T08:00:00.000Z",
 "views": "17208",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": "300 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(ground / crushed)"
  }
 }
}
