{
 "title": "A Great Mix",
 "author": "LittleTeaPot",
 "citation": " LittleTeaPot. \"A Great Mix: experience with Mushrooms, Methylphenidate & Cannabis (ID 10759)\". Erowid.org. Apr 12, 2007. erowid.org/exp/10759",
 "substance": "Mushrooms, Methylphenidate & Cannabis",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "1.5 g",
   "smoked",
   "Mushrooms",
   "(dried)",
   "",
   "3.0 g",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   "20 mg",
   "smoked",
   "Pharms - Methylphenidate",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>So basically, I had heard mixed stories of people who smoked mushrooms. One side of people said it's better to just eat them, and another side said it was really fun to do. So, I got a hold off 1.5g of Mushrooms, and 3g of Marijuana, two crushed up 10mg pills of Ritalin. I had the ritalin because I have a prescription of it. Myself and 2 other friends decided to go smoke all this stuff mixed in together. We rolled like 5 or 6 joints, I can't even remember really.</p><p>So we smoked the first one. Blam, we were stoned, but energetic. We all felt the pot buzz. Kind of laughing, slow moving, that sort of thing. After the 2nd Joint, we were completely screwed. We were seeing things, laughing at whatever each other said, and it was hilarious. It was a great time, and we all had a good trip. We walked around town smoking the 3rd, and 4th joints. I can't remember what happened after them. It was really fun though.</p><p>Ritalin is great to crush up and put on pot. I've done this before and it gives you a cool buzz. Very different, more absorbed, and Focused. So anyhow, the mix of the 3 drugs was a blast. We also added one full cigarette into the mix. I forgot to mention that. Tobacco adds a smooth fix to the joints. And you can role alot more joints, evenly. All of the mixed substances were broken up as usual.</p><p>But back to the story. I'm a really good roller, so the joints burned fantastic, and we got alot of good hauls. We even played games where, each of us would take a huge haul, and would hold the pot in for the longest amount of time. The high lasted about 4 or 5 hours. They were long ours, but fun ones. Near the end of the night, everyone went their seprate ways. And it's still messed to be on it alone. I was sitting at home, able to think and just stare at my floor in my bedroom.</p><p>I could think so clearly about the way I think. How we analyze everything. The usage of language as an object to form our opinions and beliefs. The way everything works. The nothing that always seems to exist in anything. It's depressing, and tough. But I got over all of that at the end of the trip. I just understood things. I knew my surroundings. I realized the physics and meaning behind everything. And just took part in the pointlessness that exists in everything. I don't thrive on it, I just go with it.</p><p>I can still be happy and caring while knowing this information. It's just something I see now. Another thing, it's not as chaotic, and brutally honest as the buzz I get from eating mushrooms. Smoking them is much more comfortable, and personalized. I didn't feel as alienated, and overbeared by smoking this mix. It was a great mix, and it allowed me to see things differently.</p><p>I have a small sketch book I write or draw art in. I wrote in it for about 3 hours straight, rants, points, objectives, judgements, facts, nothing, whatever, and I did a few pictures too. Just abstract. Anyhow, it was great, and I had a nice sleep.</p><p>It was very fun to do. I never laughed so much, everyone was happy. The scenery was joyous, and triumphant. It feels like drinking and being stoned off pot. I had poor motor skills, and laughed hysterically. But it's really fun. And I could still walk efficiently, but just not straight. I felt very akward. It was great, and we're going to do it more often. I encourage people to try this mix.</p>",
 "year": "2001",
 "id": "10759",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-12T07:00:00.000Z",
 "views": "12159"
}
