{
 "title": "I Might Never Smoke Again...",
 "author": "M C",
 "citation": " M C. \"I Might Never Smoke Again...: experience with Cannabis (ID 10768)\". Erowid.org. Oct 13, 2004. erowid.org/exp/10768",
 "substance": "Cannabis",
 "bodyweight": "120 lb",
 "report": "<p>Over and over again I said I would stop smoking pot, it never worked. I love it too much.. but lately I got another love: wrestling. I joined the high school wrestling team and said I would never smoke pot again because I didnt want to put my body through any abuse. Just to let you know its because we run a lot and I honestly want to keep healthy. I did a very good job of stopping, I cleaned Holly (my pipe) out and put her away for storage. I sold all of my bud that I had. I stopped.</p><p>Its been more than a month and I've been having urges to get high, these came about from my reading on how good hemp was... on all the things you could use it for. Its really the plant of the future and my destiny is to use it. I acquired some bud and some papers, soon I had a nice joint that would be saved until night. I knew I shouldnt do it, it flashed in my head... About 20 minutes after making it I looked online for recipes on how to cook bud to save my lungs from the devastation of the smoke. I found the easiest one... it went like this:</p><p>Get 2 crackers, smear alot of peanut butter on both of them, add about a joint's worth of finely shook MJ and close the crackers together.. peanut butter inside. Wrap in foil and cook at 300 for 20 minutes. I did this, it was one of the few times my house would be completely empty and I could use the oven without trouble. I took the cracker sandwich to my room and ate it with a glass of milk, the first bite was awful but it got better. Somewhat burnt, kind of oily.. good. I waited for it to set in, had some more food.. my dad came home from work and the phone rings. I'm a little buzzed and I answer it, my friends. They sound blown away also, I head over.. I had a quick talk with my dad during the time it was peaking, messed up with a few words and I seemed stoned but there was no evidence and he didnt think for a second that I was :)</p><p>I get there and two of my guy friends are stoned, they dont think I am even though I act like it (I mean no smell or anything). I screwed with them, we watched tv, I saw a couple of movies and the whole time I was relaxed. It was a great mellow, long lasting high. I was relaxed, could think, knew what was happening, and I was stoned out of my mind... no one knew though. I felt like I was part of the sofa only floating above it slightly, I felt great, all my problems went away... it was like a high that I never felt before. I wasnt so fucked up I couldnt walk, I could. Everything was better than before. It was the best night ever, so calm, peaceful, relaxing, and kind of scary because we watched a scary movie.. along with some funny ones.</p><p>To sum it all up I would say eating it is so much better. I finished cooking it at 5:00, it came on at 6:00.. just crept up on me (weird feeling) and I was fully blown at 6:30. I started to come down at 9:30... very slowly. I could still feel it by 11:00, I was tired as hell and just went to bed (great sleep). I was high for the longest time ever, it NEVER lasted that long before or was that great. Its also good because it leaves no smell on clothes, I threw away the foil, no evidence. The best part is it doesnt affect my lungs, its perfect! I cant believe I never tried that before. I wasn't paranoid at all that people would think I was high because there was no evidence. My own friends didnt know, and I dont plan on telling them... they thought it for a second but I said I didnt smoke any (I didnt).</p><p>PS. don't give MJ users bad names, I'm a good student, almost getting a 4.0 Its when people find out I use MJ that they think badly of me which they shouldnt.</p>",
 "year": "2001",
 "id": "10768",
 "gender": "Male",
 "timestamp": "2004-10-13T07:00:00.000Z",
 "views": "17627",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
