{
 "id": 10765,
 "title": "Too Real",
 "date": {
  "submission": "2008-01-13T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Death",
  "gender": "Male",
  "weight": "205 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "I have done ether a lot over the past year or so. But these last 3 days I have done ether from 11:00pm to 3:00am every night. I know that was stupid, but there are other people who would do this too. My ether trip tonight was soooo unbelievably terrible.",
  "Tonight while I was doing ether it started off even a little weird. Instead of having minor visualizations there were streams. I kept on doing more ether. Eventually I noticed a whole bunch of shapes. These shapes quickly turned into a full sized human in a suit. (Blue semi see through man) He was real enough that I was able to feel some type of matter when I touched him.",
  "This scared the hell out of me. To make matters worse he was holding some type of gun, He aimed the gun at my head and started firing. I heard the noise of the gun firing and I even felt a tapping on my head/shoulders where he shot me. Every where I moved to try to evade his bullets he aimed at me and shot me some more. It was the most intense and scary 20 minutes of my life. Let me remind you that the definition of reality is being able to hear, feel, and see something. It was real to me, TOO REAL.</p>"
 ],
 "erowid": {
  "id": "67496",
  "citation": " Death. \"Too Real: experience with Ether (ID 67496)\". Erowid.org. Jan 13, 2008. erowid.org/exp/67496",
  "substance": "Ether",
  "views": "11824"
 }
}
