{
 "id": 10775,
 "title": "Sleep Trips",
 "date": {
  "submission": "2001-05-22T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Davion",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "capsls"
   },
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "I started experimenting with preparations of Calea a few weeks ago.  At first I tried Calea tea which is very effective, but also very disgusting.  It is among the worst tasting substances known to man.  I just can't stand it enough to take it as herbal tea.",
  "Next I tried just eating the leaves and flowers.  This worked just about as well, but I choked and gagged on the leaves. ",
  "I was about to try smoking some calea (I am not a smoker of anything) and my wife discouraged me from doing so.  'Be creative,'  she said, 'you'll come up with something.  Wrap it up in some food or something like that.'  It then occurred to grind it up and put it in capsules.  I found some capsules from a terrible herbal supplement I once bought, opened the capsules, discarded the 'herbs' inside and packed the capsule with Calea leaves, stems, buds.",
  "First I tried one capsule.  It caused absolutely no side-effects and was a mild dream stimulant.  Even when I combined it with other substances like Kava Kava and 5-htp, it was only mildly effective.",
  "I achieved success when I took two 500mg sized capsules full of Calea plant matter.  Actually, success is an understatement.  I had dreams within dreams that were so realistic that I thought I was awake several times. ",
  "One time I even dreamed that I had awoken.  I saw my wife sleeping next to me and I started to get out of bed when I noticed my dog in the room.  That was improbable since my dog sleeps in a kennel at night, but it was possible that my wife had awoken and brought the dog into the room.  However, when the dog promptly started doing flips and floating in mid-air, I realized I was dreaming.  I had never before experienced a dream with such realism.  I was startled, and a voice yelled out 'LUCID DREAM!' and the room began to fade.  I closed my dream eyes and imagined myself spinning. ",
  "When I opened my eyes I was with my wife again at an apartment complex where we supposedly lived (I have never seen the place before and we own a house in real life.)  I temporarily lost lucidity.  I realised I was dreaming once again since I didn't recognize the apartment.  What happened next is between me and my wife. ",
  "This sort of thing happened over and over again.  I must have had twenty different dreams.  My wife was a part of all of them, and we had blissfully happy times.  When I woke up I shared the dreams with my actual wife and we had a good time talking about them.",
  "The long and short of it is that two capsules of Calea matte being taken before bedtime is a more than sufficient dose.  I may try a higher dose in the future, but for now I'm more than happy dream tripping with my ~1 gram dosage.",
  "The thing I can't express is the level of lucidity I experienced.  It wasn't as if I had a 'cool dream.'  It was as if I was really there.  I could feel the grass, smell car exhaust, and see tiny details.  I didn't even have time-loss.  Everything seemed to happen in real time and it seemed to take days."
 ],
 "erowid": {
  "id": "6752",
  "citation": " Davion. \"Sleep Trips: experience with Calea zacatechichi (ID 6752)\". Erowid.org. May 22, 2001. erowid.org/exp/6752",
  "substance": "Calea zacatechichi",
  "views": "19554"
 }
}
