{
 "id": 1078,
 "title": "Chaotic Dissociation",
 "date": {
  "submission": "2007-05-07T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Guru",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  },
  {
   "time": "3:00",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-10x"
  }
 ],
 "report": [
  "First off I am 19 and well researched and experienced regarding psychoactives of all kinds.  My report is concerning my last experience with a gram of 10x extracted leaf I have purchased off the net.  I had an exactly .15 gram dose of 10x Salvia extract remaining and planned to undergo one more experience.  I had my last experience earlier in the day and due to its intensity I decided to wait awhile before I would smoke my last dose.  For these were my initial intentions.  What ended up happening was in fact quite different.",
  "I ended up drinking around ten shots of vodka and became quite intoxicated.  Around three hours later I was feeling better, but still heavily buzzed.  I wandered into my friend Brians room and he somehow found out that I had received my Salvia extract and that I had some left.  Being a lover of drugs, my friend pressured me into letting him try the extract since I had already experienced it.  I felt his desire and soon agreed to his request.  I packed the .15 gram into the bowl and told him to rip it as hard as he could.  My friend took three huge hits and held all of them  in very long.  By the time he exhaled the 3rd hit, he proceeded to get up off the bed, drool profusely, and fall flat on his ass to the floor.",
  "I saw that he had not even finished off the bowl, so I decided I would take the last hit.  Bad idea!  I took a big hit to finish off the bowl and within seconds I ceased to perceive reality in any conventional manor.  I felt an intense psychedelic rush and reacted in terror rather than euphoria.  I felt like I was catapulted into another dimension and proceeded to stumble down the hall towards my room immersed in a completely dissociated state.  I recall standing in the entrance to my dorm and feeling totally alien to my surroundings.  Familiarity was an extinct player in an extraterrestrial game in which I felt no escape.  Everything seemed to be a lose-lose situation.  I was lost in the truest sense of the word.  I felt misplaced in a dimension where I didnt belong.  I was truly in a state of panic.  I had no recollection of basic reality and felt that I didnt have a proper place anywhere in the universe.  I failed to be aware of things as basic as where my room was located. ",
  "This entire period of chaos lasted a mere 5 minutes.  The terror I felt however, seemed to last far longer.  When I made my way back to the room I had so clumsily exited five minutes previous, Brian had returned back to normal and spoke of his experience being the most intense of his life.  Mind you, this is an individual whom has consumed a quarter ounce of mushrooms and holds extensive experience with drugs of all kinds.  Brian explained that he felt reduced in size as if he was a small player in a video game.  He said he felt like he was being watched and that the people around him were condemning him.  He was so shocked by the intensity of the experience that he couldnt stop talking about it and vowed to one day purchase a gram of the extract and have any disbelievers try it for themselves.",
  "My prior alcohol consumption indefinitely played a role in the craziness of my experience.  I feel this way because, though I was no longer heavily intoxicated, the alcohol was still very much in my system.  I assume that the alcohol altered the course of the experience because I had never achieved such dramatic results from only one inhalation of the extract.  Upon taking the one hit I was thrown into a dissociated state that resembled effects from three separate levels of Salvia experience.  The effects from the alcohol were most likely felt regarding the trips amnesic effects. ",
  "The alcohol consumption also could have aided the ushering in of an immaterial existence aspect of the trip, which would have never been experienced by myself with less than a full smoking dose.  Because my one-hit trip was so intense, I clearly realize that alcohol alters the overall intensity of the Salvia experience.  My mixture of the two resulted in terror and what anyone would call a bad trip.  For this reason I would strongly advise against this crazy combination.  Salvia alone is far more powerful than most could handle.  Overall, my 5th and final major experience once again left me speechless in light of Salvias unique power.  The experience best resembled a terrible nightmare, yet still proved worthwhile and provided me with a psychedelic ordeal I will not soon forget."
 ],
 "erowid": {
  "id": "13137",
  "citation": " The Guru. \"Chaotic Dissociation: experience with Salvia divinorum (10x extract) & Alcohol (ID 13137)\". Erowid.org. May 7, 2007. erowid.org/exp/13137",
  "substance": "Salvia divinorum (10x extract) & Alcohol",
  "views": "6096"
 }
}
