{
 "title": "Uncomfortable Evening",
 "author": "Fred",
 "citation": " Fred. \"Uncomfortable Evening: experience with Vasopressin & Alcohol (ID 10787)\". Erowid.org. Nov 24, 2001. erowid.org/exp/10787",
 "substance": "Vasopressin & Alcohol",
 "bodyweight": "180 lb",
 "report": "<p>I have used Vasopressin on occasion to see if it will enhance 'clarity of thought'.  It definitely has some effects, but I have found thought clarity staying the same or decreasing.  However, memories seem to be easier to retain, which is great if I need to learn a bunch of facts, fast.</p><p>Anyway, I took 4 puffs of Vasopressin last night - to see if it would motivate me or increase my organization while packing for a move.  I got a lot done, and was feeling generally good, and so I thought - what the heck, I haven't had a drink of alcohol for over 2 months, might as well relax.</p><p>So at T+2h after taking the Vasopressin, I ingested (slowly) some port with some vodka - probably about 2-3 shots-worth in all.  I was feeling very tipsy, which is unusual after 2 drinks, but surprisingly clear-minded.  The stomach feeling was a bit uncomfortable, and I was in an unfamiliar mindspace.  A certain discomfort and inner tension, much like 'coming up' on a tryptamine or phenethylamine was present.  My blood pressure was slightly elevated. </p><p>It was then that I realized I was drinking lots of water - I had about 4 full glasses, which I always do when I drink alcohol, to ensure no hangover and fewer negative effects.  So, I had consumed about 2 glasses of port/vodka and 4 glasses of water, yet I had no urge to pee -- I couldn't pee, my bladder was empty.  Suddenly it struck me that it was NOT wise to drink so many liquids while taking Vasopressin - an anti-dieuretic.  I couldn't sleep for a good 3 hours due to discomfort and a strange headache, and when I finally fell asleep and woke up this morning, I still didn't have to pee.  It wasn't until about 12 hours later from taking the Vasopressin that I was finally able to pee and get some liquid (and processed alcohol, perhaps?) out of my system.  I still feel slightly inebriated (which is crazy!) but I'm feeling much better now.  I can't imagine having all those liquids in me all night, not going anywhere.</p><p>I have a slight headache this morning, and I will take the warnings about Vasopressin being an anti-dieuretic (and not drinking too much) more seriously next time.</p>",
 "year": "2001",
 "id": "10787",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-11-24T08:00:00.000Z",
 "views": "20775",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 shots",
   "administration": "insufflated",
   "substance": "Vasopressin"
  },
  "1": {
   "time": "",
   "amount": "2.5 shots",
   "administration": "oral",
   "substance": "Alcohol"
  }
 }
}
