{
 "title": "Chillin With Some Catnip",
 "author": "The Grinch",
 "citation": " The Grinch. \"Chillin With Some Catnip: experience with Catnip (ID 10799)\". Erowid.org. May 14, 2002. erowid.org/exp/10799",
 "substance": "Catnip",
 "bodyweight": "140 lb",
 "report": "<p>I had just smoked a teeny tiny hit of old weed, and since I was fresh out of ganja, I decided that this would be a good opportunity to put some catnip to use.  I measured out a generous serving of the catnip (about a shot glass and a half for measurement) and boiled some water.  I placed the catnip in a coffee filter, and folded it over and stapled it so that none of the catnip would spill out while my tea was brewing.  I poured the boiling water on the makeshift teabag, and left it my coffee mug for about twenty minutes until the water to cooled off.  When I removed the teabag, I noticed a dark color, like watered down coffee or very dark tea.  The smell wasn't too bad, but it smelled a bit strange.</p><p>T + 00:02 The tea was finished. I noticed some slight warmth spreading through my body, and muscles were simultaneously relaxing as well.</p><p>T + 00:05 There was a subtle calmness throughout my body.  Vision seemed to be sharper, and colors seemed to be a bit brighter and more vivid than before.  I also was experiencing a general sense of well-being.  My tongue was also feeling a bit numb as well.  The effects of the catnip came on very quickly, like tobacco or caffeine.</p><p>T + 00:10 Mundane things look more interesting.  I spent a considerably amount of time looking at the metal cage on my electric fan and thinking about how nice it looked.  I got up from my bed where I was sitting, and I noticed a sense of numbness in my lower body, and a sensation of tingling came and went.  I put on some music, but not much change in sound quality.  I got a headache if I quickly moved my head, but this ended promptly, much to my relief.</p><p>T + 00:18 Effects started to lessen</p><p>T + 00:30 A second cup was consumed.  I reused the same teabag from the first cup.  The color was like peppermint tea or green tea.  The catnip buzz quickly returned.</p><p>T + 00:36 Some small visual distortions occurred.  Nothing specific, but it was easy to make myself see tiles oscillating, and walls shifting about.  I need to reiterate that this was a SMALL effect.</p><p>T + 00:50  Another cup was drunk, brewed from the same teabag again.  The liquid was the same color, but not much else happened afterwards.</p><p>T + 00:68 Music was easy to get into, and I felt a bit sedated.</p><p>I kept trying to put my finger on what exactly a catnip buzz felt like.  It seemed like combination of a nicotine headrush and coming down from being stoned.  It puts you in a very chill mood, and is great for relaxin. I think the small amount of weed I smoked definitely magnified the effects of the catnip, or vice versa.  In any event, catnip has great potential for being combined with other substances, or used in greater quantities to have a greater effect.  It reduces boredom, but it's not mentally or physically impairing at all.  You could take catnip tea to classes or work, and not stress about getting into any kind of trouble.  Considering how cheap it is (less than $2 for a half ounce at grocery stores) I am looking forward to experimenting with catnip, especially when used with other substances.</p>",
 "year": "2001",
 "id": "10799",
 "gender": "Male",
 "timestamp": "2002-05-14T07:00:00.000Z",
 "views": "79735",
 "dose": [
  {
   "time": "0",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  },
  {
   "time": " T+ 0:50",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Catnip",
   "form": "(tea)"
  }
 ]
}
