{
 "id": 1080,
 "title": "Open a Door in Your Skull",
 "date": {
  "submission": "2005-03-14T08:00:00.000Z",
  "experience": "1999"
 },
 "author": {
  "name": "deadcoil",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "This is a two part report of my most dramatic experiences on LSD.",
  "===========================================================",
  "PART 1",
  "Living in Ft. Worth in spring of 1999, my brother one day brought home a strip of purple paper, and gave me 'about 4 hits worth'.  I still to this day have not been able to find out where he got it, what the name of that particular street paper was, or if that really was 4 hits.  However about two days later I decided to give half the strip a go, since I had a day off.  At the time, I had no alcohol in my system, nor any other drugs besides a couple of bottles of Coca Cola.",
  "I took the paper at about 6 in the evening, keeping it in my mouth for 15 minutes before swallowing what was left.  This was far from the first time I had used Acid, so I expected the trip to hit after an hour or so.",
  "The first moment that I noticed I was tripping (my own personal test- if I look at a cigarette right out of the pack and it somehow looks kind of bent, I'm probably starting the trip) about 25 minutes after eating the paper.  Soon my skin began to tingle in a familiar way, and my mind began to branch out in its thought processes.  It was to be a very strange trip indeed.",
  "After an hour, I was hallucinating lightly and my brain was beginning to process thoughts that I now cannot remember or fathom.  At 7:30ish (thanks to my watch) I put on my combat boots, and started walking through my neighborhood.  This in and of itself was a strange reaction to the acid- usually LSD makes me very introspective and reclusive.  I began to hear a 4 bar melody playing in my head, one I had never heard before.  The music stayed in my head, looping infinitely throughout the rest of the trip. ",
  "As I rounded the corner from my house, I noticed that the sun appeared to be setting in a most remarkable and amazing display of colors.  Glancing at my watch proved that this could not be- the sun had set almost an hour beforehand.  As I walked, I found it amazing that my own brain could hallucinate in such vivid color and realism.  The colors did not bleed over into the nearby objects, such as houses and trees, but instead stayed perfectly  within my view of the sky.",
  "As I walked, part of my brain latched onto the fact that my brother was partying at a friend's house that night.  I decided to see if I could find out where the party was.  I had no idea what his friend's name was, where his house was, or what area of the city the house was in.  However, as I walked I began to have images popping into my head (in a sequence that appeared to be random) - A big American Flag.  A silver wristwatch (mine was black).  A Super Nintendo gaming console.  A four foot green glass bong.",
  "At about this time is where my trip became very heavy.  I often find that when tripping on good acid, my memories at the peak of the trip become a mixed jumble of hallucinogenic and fantastic concepts, most of which are also (in this universe, anyhoo) impossible.  When I sober up it becomes hard to put them into chronological order.  This is what I remember from that particular trip.  Keep in mind that I am not insisting that any of this really happened- this is only what I remember in Dolby Surround Sound and Technicolor imagination:",
  "- Running along the top of a wrought iron fence, not unlike a ninja in a kung fu movie.",
  "- Walking through an alleyway where the brick walls were covered in odd graffiti.  At first, the number 1 was scrawled across a dumpster.  Then, in two separate places, the number 2.  About fifteen seconds farther down the alley, three instances of the number 3 spray painted on the walls.  Four 4's, five 5's etc. on up to 10.  I have since visited the alley in question, and found nary a number painted there.",
  "- Drinking a cappuccino at a coffee bar two miles from my house, and feeling the fluid actually get absorbed into my body on a cellular level.  I also met up with my friend Brian at this time, and he has since put my arrival at the coffee shop at about 1:30 am.",
  "- Being able to actually control the direction of the breeze for about half an hour.",
  "There are more, but those are the biggest.",
  "Sometime around daybreak, I began to come down.  I could still, however, hear the music of the melody I had been hearing all night.  Upon my arrival home, I drank roughly half a gallon of orange juice, sat down, took off my boots, and began to write down the notes to the melody.  By the time I was done, I was no longer tripping at all- just very, very tired.  My legs felt as if I had been walking all night. (I have since ascertained that this was exactly the case- I walked for about 10 hours, through back roads, main streets, around the empty parking lot of a mall, etc.)",
  "Two very strange after-effects of this trip:",
  "A) The song I heard in my head that night was actually very good.  Four bar melody, almost Trip-Hop in style with an industrial beat.  Any musicians reading this will understand my wonder at this:  The song is COMPLETELY unlike anything else I have written.  I am a heavy metal musician, and most my stuff is 8 bar riffs with aggressive feels to it.  The song I wrote that night is WORLDS apart from anything else I have ever written.",
  "B) When my brother came home, I told him about my mental flashes and visions from earlier.  He told me that his friend had a big American flag on the wall of his living room, a silver Timex wristwatch that he always wore, and they had spent the evening smoking weed from a large green bong and playing Super Nintendo.",
  "I am a hardcore skeptic.  I do not believe in clairvoyance, per se, and think people who claim to be psychic are usually fulla shit.  However, I am also convinced that for that evening, I somehow was able to remotely view my brother's habitat by merely concentrating on it.",
  "As a footnote, I have done acid about 15 times in my life, in varying doses (once was tricked into eating a cube with 8 hits of strong liquid on it).  I have experienced a mild recurrence of HPPD-like hallucinations at times (they are usually VERY faint), and also have had some rather strong flashbacks.  It has been 2 years since I took my last LSD, and about 9 weeks ago I had a flashback so strong it almost felt as if I had done another hit.  I actually look forward to the flashbacks at times- they are much more smooth than actually doing acid, and last only a couple of hours.  The only bad side effect I have experienced is that during one trip, my skin broke out in a visible rash."
 ],
 "erowid": {
  "id": "13144",
  "citation": " deadcoil. \"Open a Door in Your Skull: experience with LSD (ID 13144)\". Erowid.org. Mar 14, 2005. erowid.org/exp/13144",
  "substance": "LSD",
  "views": "4981"
 }
}
