{
 "id": 10816,
 "title": "The TV was Narrating my Thoughts!!!",
 "date": {
  "submission": "2008-10-30T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Stevie ==",
  "gender": "Male",
  "weight": 72
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "Me and my friend 'IJ' went to an infamous shop in Hartford in reference to my recent salvia experience with 10x... I had been wanting to try 21x for a while. So we got some there.",
  "We got back to IJ's house and his brother CJ ended up presenting us with the option of using one of his many brilliantly made bongs. So we packed it, and well... I took a gigantic rip and ended up just putting down the bong. I was through. I couldn't move, I could only laugh. And laugh hysterically I did. Non-stop. Then I remember seeing IJ and CJ putting their fingers over their lips 'shhh shhh!!!!*",
  "This was of course because their parents were in the room next door.",
  "I started being tugged toward the corner of the room, unstoppably I was on a trajectory to the corner. My hands felt as if they were zip-line extended outward to the floor, my mind was screening non-stop images of trippy cartoon-like faces and then... I heard the TV.",
  "It was actually a stand-up act by Ron White from the Blue collar comedy tour. I don't quite remember what he said or when the audience laughed... I just remember Ron White narrating my thoughts and I could feel the overwhelming presence of a large audience staring into the tube on the other side, watching me trip my brain out. I could feel their scrutiny and their backtalk and laughing.",
  "I specifically remember the phrases 'oh oh oh... Steve is moving his upper lip now.' and 'He-he-he's taking his socks off!' Both of which were in perfect synchronization with what I was thinking at the time.",
  "It was quite a schizophrenic moment. I wanted nothing more than to simply explain to my friends that the TV was talking about me in the sincerest way. But the words couldn't come out. All I did was perform quite a hysterical stutter.",
  "When the trip settled, I persuaded CJ to take a rip. So he did... and that's when things got a little hectic.",
  "He was determined to beat me out by reacting more serene to the head trip he was about to experience. That wasn't the case. I have to add that at one point during my trip, my friends' parents had knocked on the door inquiring if I was 'alright'. IJ promptly told them I was just laughing a lot.",
  "Anyways, CJ was writhing on the floor looking around in wonder and worry. He stood up and said repeatedly 'What the fuck!' What the fuck! What the fuck! The door was quickly opened and standing there were his parents.",
  "'What kind of drugs are you guys on?!' the father asked. CJ ran up to his mom and mentioned a long chain. At this point, it was quite obvious that we were under the influence of a powerful psychoactive.",
  "Well things are cool now with the whole drug situation and my friends... however, what we experienced was quite potent and having had done mushrooms many times and acid few times I can conclude that in salvia can send me into one hell of a trip.",
  "And wouldn't ya know it? I'm gettin some more in a couple days. Gots to get paid first. Wooha!",
  "peace out"
 ],
 "erowid": {
  "id": "67729",
  "citation": " Stevie ==. \"The TV was Narrating my Thoughts!!!: experience with Salvia Divinorum (21x extract) (ID 67729)\". Erowid.org. Oct 30, 2008. erowid.org/exp/67729",
  "substance": "Salvia Divinorum (21x extract)",
  "views": "2585"
 }
}
