{
 "id": 1081,
 "title": "Testing the Waters",
 "date": {
  "submission": "2004-07-06T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "supernaught",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(liquid)"
  },
  {
   "time": "0:33",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "1:05",
   "amount": "2.5 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(liquid)"
  },
  {
   "time": "1:15",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "4:15",
   "administration": "oral",
   "substance": "Pharmaceuticals",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "100mg 5meo-DiPT powder was dissolved in 20ml water",
  "07:45 1ml/5mg down the hatch",
  "08:00 J does the same dose, oh shit, no smokes, drive to store & buy smokes",
  "08:15 half way home *Sound an alert!*",
  "08:18 make it home, smoke some cannabis to ease tension",
  "08:26 definitely something, mild euphoria",
  "08:50 .5ml/2.5mg down the hatch",
  "09:00 another bowl of pot, easy does it, J also does additional dose",
  "09:10 yawning, positive tension, so far so good",
  "09:23 *hello foxy* nice to meet you, very very groovy to make your acquaintance",
  "09:30 its only been 7 min?! time is slowed way down, visual enhancement",
  "09:35 J reports feeling mild euphoria but is not getting the rush I feel",
  "09:48 nice visuals, mild peaking, euphoric but not noticing any sensual aspect",
  "10:00 tripping pretty good , mild but good, grin and giggle, light visuals",
  "10:35 hungry, J makes snacks!",
  "11:00 eating was bad, stomach hurts, pot helps, take a Kaopectate",
  "12:00 coming down, almost baseline, euphoria & rush are over, watch tv, sleeping pills",
  "01:20 sleep",
  "I would repeat this experience but I would do a few things differently, first off I would take at least 7.5mg, or perhaps 10mg to begin with, then maybe an additional 5, for 12.5 or 15mg. The 7.5mg total I took just wasn't enough.  Second, I would not eat during the experience even if I was very hungry. This drug is more recreational then introspective. No problems of the world going to be solved on Foxy. I don't think it has much therapeutic potential but certainly is an interesting drug. The trip itself was psychedelic like a mild LSD or mushroom experience with MDMA like bursts of euphoria, but instead of gaining clarity I get a little stupid - although this may have been due to the use of cannabis. Senses are enhanced, especially vision.  Body load was noticeable, nervous energy, J reported pressure on her solar plexus much like LSD, which she dislikes. After eating I had severe gut pain, and it felt like gas bloating. Walking around outside was bliss.  We watched a Depeche Mode concert on cable but it didn't sound right.  Talk was easy, but real conversation was difficult.",
  "There was a slight empathetic undertone but not intense like MDMA. I would like to try a higher dose, maybe the much referred to tactile enhancement will show itself over 10mg."
 ],
 "erowid": {
  "id": "13145",
  "citation": " supernaught. \"Testing the Waters: experience with 5-MeO-DiPT (ID 13145)\". Erowid.org. Jul 6, 2004. erowid.org/exp/13145",
  "substance": "5-MeO-DiPT",
  "views": "5810"
 }
}
