{
 "title": "The Wonders and Evils of Kayaking",
 "author": "Mx Dg Ld",
 "citation": " Mx Dg Ld. \"The Wonders and Evils of Kayaking: experience with Ketamine (ID 10812)\". Erowid.org. Apr 23, 2007. erowid.org/exp/10812",
 "substance": "Ketamine",
 "bodyweight": "150 lb",
 "report": "<p>Ketamine...</p><p>During my first experience with K, I felt very strange, feeling blocked out from my mind and body, as if I was disconnected. After that, I spent the next month or so taking K during the weekends, enjoying the experience, but not being dependent on it.</p><p>After that month and a half, a friend and I decided to go on a binge night at my house, buying ten bags from a friend. Each bag where we live contains about 0.1-0.2 grams, depending on the dealer. The prices of the bags I will not mention, for my paranoid state of mind fears that it might lead to discovery of who I am and/or where I currently am.</p><p>This binge night, I experienced my very first 'K-hole'. That night we had large bags, but being stupid, and not knowing my limits, I decided to snort an entire bag, which was about 0.2 grams.</p><p>I remember thinking right after, 'shit, this was too much, I have to run to the bathroom and back before this hits'. So I went to the bathroom, did my business, and the last thing I remember was making it back to my room and closing my door. After that, memory in the physical world stops, and my memory of the experience begins.</p><p>I felt that I was being pulled away in different directions, and become one with a white light, and saw many strange things along the way. During this 'dream' state, I felt as if I was one with everything, and that I had entered a safe, warm place.</p><p>It has now been about 6 months since that day, and I've been trying to recreate that experience, but I never have. My tolerance has slowly been building up, where it is now to the point that doing three bags (0.6g) will not induce a K-hole. It induces the physical anaesthetic, and the mental state of being useless and sitting in one place and enjoying it. Any larger single-line dose and it is wasted, for my recollection of the experience becomes faded.</p><p>I have had a few different experiences though during this time, and when listening to soft music, such as a song like Pachelbel's Cannon, positive thoughts enter my mind, as well as a feeling of spiritual and emotional peace.</p><p>But now, I have developed a deep dependency on K, and these days take it because without a dosage the world feels very tiring, boring and lonely, and I only seem to feel normal again when I have snorted a line or two.</p><p>Strangely enough I am doing fairly well at school, being a straight B student, but socially I am starting to have problems, because more and more of my friends are becoming worried about me, since I am almost always in a catatonic state.</p><p>Personally I take 4-5 doses a day, usually in the 0.2 mg per dose stage, so that I may produce the catatonic state, which these days is the only state I feel comfortable to be in.</p><p>While other people may differ, I never re-created that first K-hole again, and that feeling of being in a safe place is gone, replaced by a simple feeling of normality, something which has scared many of my friends, and causes great worry to those close to me.</p><p>I rarely use any other drug, including alcohol, since I've started using K, and whenever the supplies are cut I have great problems and turn to other drugs just to 'bide the time' until a new supply comes in.</p><p>In a new concentrated effort, I have been clean for the past 10 days now, except for smoking one joint, and looking back, I'm not really sure losing 6 months of my life sitting down and always being fucked up was worth it, but what I can be sure of is, I will never escape the memory of using the drug.</p><p>With its positive and negative effects, I will still say this is the best drug I have ever used, but the thought lingers in the back of my head that I could have done something more useful with 6 months instead of being a binge user.</p><p>I'm 16 years old, and what I fear most is that when I'm 26 I'll still be doing the same thing.</p><p>It's a fear that's not worth it.</p>",
 "year": "2001",
 "id": "10812",
 "gender": "Male",
 "timestamp": "2007-04-23T07:00:00.000Z",
 "views": "9976",
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(daily)"
  }
 ]
}
