{
 "title": "Weed from Holland",
 "author": "Jon",
 "citation": " Jon. \"Weed from Holland: experience with Cannabis (ID 1082)\". Erowid.org. Jul 18, 2000. erowid.org/exp/1082",
 "substance": "Cannabis",
 "bodyweight": "5 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>Me and my buddies decided to go camping one weekend at a place called elora gorge. It was a killer campground with a huge gorge in it that was kinda of like a mini grand canyon with trees and stuff.</p><p>Anyhow my friend whose name also is john told me he had a Dutch strand of weed, not grown in Holland but seedlings that had been taken from there and grown hydroponically. Needless to say I was very excited to partake into exotic bud and in such a cool place. So we went off on a hike looking for a cool place to toke. We find a cave that led into another opening in the middle of the cliff face. It was here we decided it was the place we would smoke. we had rolled three joints as was our custom and smoked them in a row one after the other. In combination with the elements and the extremely high quality slaba, I achieved a, or rather fell into a completely barbaric stage of mind, our setting no longer seemed modern but i felt as if I was an ancient being partaking in an ancient tradition during ancient times. I looked at my friend and he just nodded at me I nodded at him and he nodded again and we just took off running through the forest on the path for about a half hour frantically making crazy noises. i had such an adreninaline rush and there was no other way to say it then I was fucked, finally we reached our campsite and realized just how messed we really were, we sat down and lit a fire and smoked bowls until the night faded away into nothing but a memory and a dream. That seemed to have been many years ago but really was a reality.</p>",
 "year": "2000",
 "id": "1082",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-07-18T07:00:00.000Z",
 "views": "6680",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
