{
 "id": 10825,
 "title": "Unexplained Strong CEVs",
 "date": {
  "submission": "2011-07-18T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "dlph",
  "gender": "Male",
  "weight": "75 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "225 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "oral",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "ocular",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I consider myself an educated and responsible drug user, so I've been very careful combining my somewhat heavy medication with any other psychoactive substances. However, this recent experience was unique and surprising.",
  "I've never had any problems with smoking weed while on venlafaxine and mirtazapine. I always take my venlafaxine in the morning, whether I'm planning to smoke or not. And I always take my mirtazapine in the evening, whether I've been smoking or not. And so far there has been nothing spectacular going on. In the following case, I wasn't even stoned anymore, but feeling a pleasant afterglow. I planned on going to bed in an hour or so and took my mirtazapine, since it sometimes takes up to an hour for it to kick in. At the same time I also took 5mg of zolpidem. Knowing how zolpidem can mess with me, it should be noted that my usual dose is 10-15mg and I have some tolerance, so the following events weren't entirely caused by it.",
  "I think 15-20 minutes had passed. I was getting ready for bed, taking off my clothes, when I suddenly felt very nauseous. Just like when I'm drunk and are about to throw up any second. I ran to the bathroom, almost diving on to the floor getting ready to puke my guts out. But I didn't even gag and the nausea disappeared just as quickly as it had begun. All this made me very nervous but I was also dead tired, so I got up despite feeling somewhat dizzy. I stumbled to my bed and closed my eyes. Then, at that exact moment, I felt very strange, like falling through the bed. And with my eyes closed I experienced really intense visual hallucinations. I was floating through strange landscapes of hills and houses and I could steer my movements by twitching my eyes. The images were very detailed and coherent. I felt entirely awake all the time and I'm not sure how long I kept on doing that. Then, when I felt like it, I could snap out of the entire state just by opening my eyes - and even after that I felt entirely awake. A bit scared too, but that was mostly because of the nausea before.",
  "I have no idea what caused this. Zolpidem can cause heavy visual distortion, but with my tolerance 5mg is just sedating. Mirtazapine, in some occasions, causes short CEVs but for me they have always lasted for mere seconds. With cannabis I've had no CEVs at all. And it certainly wasn't a lucid dream. A bit like being lucid, yes, but not at all like dreaming. Was it zolpidem, cannabis and mirtazapine enhancing each other's CEV-inducing effects? Or did I just fall asleep in one second? As for the nausea, there are a thousand possible reasons for that, and I'm not sure if it had anything to do with the rest.",
  "But whatever this whole thing was, it was somewhat fun, beautiful and inspiring (despite the nausea). Still, such a strong reaction encouraged me to be even more careful in the future."
 ],
 "erowid": {
  "id": "67772",
  "citation": " dlph. \"Unexplained Strong CEVs: experience with Venlafaxine, Mirtazapine, Cannabis & Zolpidem (ID 67772)\". Erowid.org. Jul 18, 2011. erowid.org/exp/67772",
  "substance": "Venlafaxine, Mirtazapine, Cannabis & Zolpidem",
  "views": "6992"
 }
}
