{
 "id": 1082,
 "title": "Electric Mode",
 "date": {
  "submission": "2006-07-24T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Supernaught",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "7.5"
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "liquid"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "mg",
    "quantity": "5.0"
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "liquid"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "mg",
    "quantity": "5.0"
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "liquid"
  },
  {
   "time": "4:00",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "5:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Having tested the waters with a dose of 5-MeO-DiPT the night before I was ready to push this substance a little further the following evening.  Using liquid volume measurement, I measured out my dose by putting it in a small amount of OJ and shooting it down.  I chased it with more juice, no problem.",
  "08:00 7.5mg down the hatch",
  "08:40 nice come up, good visuals",
  "09:00 5mg more, aware of possible tolerance i set aside 5mg more",
  "09:40 fantastic high, euphoric and visual",
  "10:00 5mg more, yummy juice",
  "10:25 *drool*, peaking again, wow.",
  "10:45 eat a few jellybeans, yum! Music sounds off, Fluke sounds cool. Plasma ball, music, candles, etc. all very nice.",
  "11:00 this is great, excellent, feeling almost electrically charged, like I can direct beams of energy, touching a plasma ball is intense, I can feel the energy flying off my finger tips.",
  "11:36 Foxy shows another side to itself at this dose. Much more visual, I can appreciate the sensual nature.  very *warm* high. tase, smell and vision all enhanced, tactile enhancement shows itself, oh I *feel* good.",
  "12:00 Wow that was a great couple of hours. Hints of comedown, take Xanax to take edge off.",
  "01:00 Chat on line with M, chill, still have OEVs and CEVs, smoke cannabis while visuals taper off. smooth landing,",
  "02:00 Get in bed and surf TV.",
  "02:30 Sleep",
  "I took a total of 17.5mg over two hours, but there have been reports of tolerance, so take my story for what its worth because I dosed the night before.  This was much more intense and enjoyable then the first time.  I did have some stomach discomfort, but it was minor, my stomach was a little upset the next day, but I've had worse from a bad lunch. There was no nausea.  I found cannabis to be helpful in reducing any tension that would build.  I was restless and found it difficult to sit still but walking around seems to remedy this. The visual effects and euphoric rush lasted almost two hours, but at no time did I find it overwhelming or scary. ",
  "I was all smiles and found it euphoric, but not the overwhelming joy I get from MDMA.  I had an intense electric buzz, as if I was charged, and when I put my hand on my plasma ball it was if I could feel the energy shooting from my fingers.  Music was great, but what I enjoyed about it was feeling the bass, the beat, and the physical pulse of the rhythm, actually the music itself sounded a little off. Again, I found this experience to be very recreational in nature. I took a xanax which seemed to take the edge of what can be a jittery come down.  There was almost no hangover or residual effects after sleeping 8 hours.  I awoke in a good mood and felt fine."
 ],
 "erowid": {
  "id": "13147",
  "citation": " Supernaught. \"Electric Mode: experience with 5-MeO-DiPT (ID 13147)\". Erowid.org. Jul 24, 2006. erowid.org/exp/13147",
  "substance": "5-MeO-DiPT",
  "views": "3211"
 }
}
