{
 "id": 10822,
 "title": "Strange Planet",
 "date": {
  "submission": "2007-12-17T08:00:00.000Z",
  "experience": "2004-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fore2gnosis",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "130",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "130",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "3:00",
   "amount": {
    "number": "300",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "During the second week of 2004 I decided to ingest some MDMA. I had not used any for over a year. During the previous 7 years I had taken way too much of it. I stopped using it because it didn't really do much to me any more. After about 1.5 hours nothing had happened so I took another 130mg. After 3 hours I realized that nothing was going to happen. I had given some people some of this X at a NYE party recently and knew it was very very good. I was simply burnt out.",
  "All I got was a coffee-like buzz and it was late, so I decided to take some DXM to relax a little and get high. I watched a movie and felt pretty good after it. Then I went to do some things on the computer. Well, I looked at the screen and it was filled with strange alien symbols. I tried to check my fonts but I couldn't read them. Then I looked at a magazine and it had the same symbols instead of the good ol' alphabet like you see here.",
  "I never really felt the MDMA or the DXM, but wow, this was some freaky effect! I looked at a few more books and newspapers but could never make out anything. I also had trouble looking at the pictures. It took a long time to piece them together and figure out what they were. Somehow, I think my brain was short-circuited in a specific way, like the symbol recognition capacity had gone away for a while. I watched another movie and fell asleep. The next day I felt fine. Oh... and the symbols were back to their normal shapes and positions."
 ],
 "erowid": {
  "id": "67755",
  "citation": " Fore2gnosis. \"Strange Planet: experience with MDMA (Ecstasy) & DXM (ID 67755)\". Erowid.org. Dec 17, 2007. erowid.org/exp/67755",
  "substance": "MDMA (Ecstasy) & DXM",
  "views": "3349"
 }
}
