{
 "id": 10839,
 "title": "Affect Positive But Not Hyper",
 "date": {
  "submission": "2007-12-19T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nootropic Noob",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "daily"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "cups",
    "quantity": "3"
   },
   "administration": "oral",
   "substance": "Caffeine",
   "form": "liquid"
  },
  {
   "time": "4:00",
   "amount": {
    "unit": "mg",
    "quantity": "750",
    "grams": 0.75
   },
   "administration": "oral",
   "substance": "Aniracetam",
   "form": "daily"
  },
  {
   "time": "12:00",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Beer/Wine"
  }
 ],
 "report": [
  "Took 750mg of Aniracetam after reading a number of forums and experience reports.  Specific intent was to mitigate feelings of mental fog and low affect that caused inability to concentrate on cognitive tasks (I have a decision-making, information-rich desk job that also requires a lot of meetings and responses to interrupts; hence, writing software or concentrating on quantitative models is difficult and I've been looking for help on this).",
  "Dosed around 2:30 PM following several hours of meetings and a light early lunch; last caffeine (to which I have significant tolerance) was an effective ~3 cups around 10:30 AM.  I was able to keep attentive over 2.5 hrs more of meetings that might otherwise have had me nodding off (but who knows?).  Still feeling strong, though not quite hypomanic, as of 5:30, I proceeded to knock down a few cognitive tasks that otherwise I might have bagged for the evening.",
  "It is now 11:00 PM and I've had a few beers after dinner.  I still feel quite awake and wired, with a looseness but not sloppiness due to the ETOH; I should probably be feeling it more than I am now.  I also get the feeling that I *could* hit the sack with no problems right now if I wanted.",
  "Affect during this time has been positive but not hyper.  All in all, I think this has been a positive first time.",
  "(Preloading in the AMs for several weeks with fish oil and B complex preceded first administration.)"
 ],
 "erowid": {
  "id": "67815",
  "citation": " Nootropic Noob. \"Affect Positive But Not Hyper: experience with Aniracetam (Ampament) (ID 67815)\". Erowid.org. Dec 19, 2007. erowid.org/exp/67815",
  "substance": "Aniracetam (Ampament)",
  "views": "18778"
 }
}
