{
 "title": "22 hours 'clean'",
 "author": "s2000",
 "citation": " s2000. \"22 hours 'clean': experience with Cocaine (ID 10833)\". Erowid.org. Nov 27, 2001. erowid.org/exp/10833",
 "substance": "Cocaine",
 "bodyweight": "200 lb",
 "report": "<p>I cant believe Im feeling like this. After only using coke for 5 days (about 1.5 grams), i find myself constantly thinking about doing some more.</p><p>Its Monday night, Im not working tomorrow and I have over 6 grams sitting in my bedroom, begging me to come join them. Every minute or so, I catch myself thinking about it. I cant help but think that this is the start of an addiction and all the money Ive saved up is about to be blown on coke. Im actually not working for the next couple of months so how the **** am I going to keep my mind off coke during the days & months ahead?</p><p>I dont know what it actually is about coke. Ive tried E and speed, but coke is so different to them. Dont get the rush or the come down that I get on E and I love the fact that its a short hit  doesnt last hours on end. But my mind cant stop thinking about it now. And I keep beating myself up about it. I want to be able to use it, but not this anxiety of wanting more and more and more. It surprises me that such a strong feeling could take hold in such a short amount of time. My only hope is that I can hold out till I fall asleep. Maybe tomorrow I wont feel this way.</p><p>Right now, Ive taken to the wine to dull my senses a bit, but if that doesnt work  Ill be hitting the joint. Funny that, trying to over come the effects of one drug with another. This sux!</p><p>I remember having it 5 days ago for the first time. My dealer shouted me two lines after I bought a gram from him. He left and I just kept going. I got sooo horny. About 2 am I jumped into the chat room and picked up a guy. Drove round to his house to pick him up and brought him home. I did a line of coke and then we jumped into the shower. It was the best sex I have ever had. We kept going for a while. I couldnt cum and after that I drove him home. I finally got to bed after having half a j.</p><p>The next day, my neighbour joined me in a mini binge. We got together in the early afternoon. Polished off a couple of bottles of wine. Started on the coke and then headed into the city. We went from bar to bar doing lines of coke everywhere we went. I went out that night, with enough left for one line. When I went to the toilet to have it, I found myself really angry that it dissipated into my wallet. I can still remember the feeling now  it was one of shock and disappointment. I kept wetting and sticking my finger and rubbing it on my gums to get some sort of sensation. And I remember thinking if it was too late to call my dealer cause I dont buy off the street.</p><p>I didnt get more that night, but the next day I went to the bank and pulled out enough cash to buy .5 an ounce. Called my dealer and he brought it round. I thought I had it under control cause when he offered me a shout of a couple of lines, I declined, saying I was saving it for tonight. I knew that if I started, I wouldnt stop. I had a good night that night and did about .5 gram. Got home and did another couple of line before going to bed. I felt wonderful.</p><p>The day after I did a couple of more lines while out with friends and then when I got home, I did a few really big lines while watching a movie. That was about 22 hours ago.</p><p>Whats so weird about it all, that 22 hours is the longest time frame since having coke and I cant believe what Im going through. Without a doubt this is my drug of choice. But personally, I cant see coke being used as a recreational drug  not like E or speed.</p><p>Cocaine has a much stronger mental additive power than E  something that wasnt stressed in all the literature about both drugs Ive read.</p>",
 "year": "2001",
 "id": "10833",
 "gender": "Male",
 "timestamp": "2001-11-27T08:00:00.000Z",
 "views": "28050",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "(powder / crystals)"
  }
 }
}
