{
 "title": "Games of an exhausted mind",
 "author": "DoctorStrange",
 "citation": " DoctorStrange. \"Games of an exhausted mind: experience with sensory deprivation, illness-induced exhaustion (ID 10832)\". Erowid.org. Nov 27, 2001. erowid.org/exp/10832",
 "substance": "sensory deprivation, illness-induced exhaustion",
 "bodyweight": "260 lb",
 "report": "<p>This isn't really a trip report, but something interesting happened to me a few hours ago as I was (unsuccessfully) trying to get to sleep.</p><p>I'm on day 3 of what's looking like a severe head/chest cold.  As of yet I haven't taken anything to treat it, other than echinacea and 1000mg vitamin C tablets twice a day (this usually works for me, but not this time), so I'm not sure what induced what happened.</p><p>I haven't been sleeping well the past few nights, so naturally I'm exhausted.  But sleep won't come - the nasal/bronchial irritiation sees to that.  Tonight I turned the heat up a bit, pulled the covers over my head, got as relaxed as possible, and tried to clear my mind by counting my heartbeats (this often works for me).</p><p>I'm not sure how long I was lying there (seemed like hours), but I started to notice a 'strobing' white light, maybe 10Hz or so.  Keep in mind that I can't see anything else, there's no light whatsoever under the covers.  This passed quickly, then I noticed the swirling multi-coloured 'plasma' floating in front of me.  It got brighter and more colourful by the minute, until I thought to myself how strange this was, then it disappeared.  This was the first thought I'd had in a while - I'd lost track of my count long ago.  Now my mind started to fill with all kinds of thoughts, memories, all very eery.  I started 'day-dreaming', in total darkness, in a sort of disembodied-like state, I was unaware that I had a body - I was *not* dreaming, I was definitely conscious.  The images I saw, with a little mental focus, seemed quite real.</p><p>Then a coughing-fit set in, and brought me out of it.  I became acutely aware that I had a body, unfortunately.  A look at the clock showed me I'd been attempting sleep for about two hours.  Two hours later and I'm still very awake, writing this report.</p>",
 "year": "2001",
 "id": "10832",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-11-27T08:00:00.000Z",
 "views": "8328",
 "dose": {}
}
