{
 "id": 10838,
 "title": "How It Ruined My Life",
 "date": {
  "submission": "2011-07-19T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "athousandleaves",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  }
 ],
 "report": [
  "I originally went on Effexor XR after dealing with moderate anxiety, lack of energy, and inability to concentrate. My doctor even wrote the prescription with an Effexor pen. I had heard some negative things about the withdrawal but my doctor said it was rare and not serious, and I was excited about the possibility of being able to perform better in school and not having panic attacks.",
  "For the first couple of weeks, I felt pretty good. This was probably due to some placebo effect, and the semester had just begun. After that, everything went downhill.",
  "I was completely unable to wake up on my own, and would sleep until perhaps 2 or 3 in the afternoon if allowed. I begun asking my roommates to wake me up. They were unsuccessful, because they would talk to me while I was asleep and I would talk back but just fall back asleep and have NO recollection of the conversations later.",
  "Because I couldn't wake up, I began doing extremely poorly in school and my anxiety began to get worse and worse, until it was the worst it had ever been. I had not been depressed before I had gone on Effexor, but I began to have suicidal thoughts for the first time since I was 14 years old (I am 22 now). Paranoia began to take control of my life completely, and I wasn't able to do anything at all other than go to work for a few hours and then fall asleep when I got home for like 14 hours.",
  "So I stopped taking the Effexor. Unfortunately, going to school and working full time, I didn't have the time to go back to my doctor. While I knew there were withdrawal effects, I knew I could never put another Effexor pill in my mouth. After a day or so, I began to feel kind of high. It was sort of a hazy feeling, not really bad. Then the electrical sensations began. It didn't hurt like being shocked, but I could feel something like charges running through my skin all over my body.",
  "After a week or two, the electrical charges had diminished somewhat and the rest of the withdrawal was gone. However, what had felt like electrical charges running through my body became shorter, and feeling like bugs crawling on my skin in different places. This drove me crazy, and has still not gone away completely. I have been off of the medicine for 2 months. My depression worsened.",
  "I then went to another doctor, who prescribed me Wellbutrin SR and Xanax, which, together, have 1. restored my energy, 2. eliminated my depression, and 3. controlled my panic attacks. Like I said, I still feel the bugs crawling on me but otherwise the Wellbutrin has really helped counteract the damage that Effexor has done to my body.",
  "Maybe Effexor is right for someone. But it made my anxiety (which it was supposed to treat) WAY WORSE, and pretty much ruined my semester, which I really needed to do well in. It made me extremely depressed, especially after I stopped taking it, and the side-effects of the withdrawal are still with me now.",
  "Don't take this medicine unless you are okay with the possibility that it could really put a roadblock in your path to success.",
  "[Reported Dose :\t 75 mg per day for 1 week, then 150 mg per day]"
 ],
 "erowid": {
  "id": "67812",
  "citation": " athousandleaves. \"How It Ruined My Life: experience with Venlafaxine (Effexor XR) (ID 67812)\". Erowid.org. Jul 19, 2011. erowid.org/exp/67812",
  "substance": "Venlafaxine (Effexor XR)",
  "views": "4892"
 }
}
