{
 "id": 10845,
 "title": "Likely Allergic Reaction",
 "date": {
  "submission": "2007-12-20T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Voyager",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Calea zacatechichi",
   "form": "(tea)"
  },
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Calea zacatechichi",
   "form": "(dried)"
  }
 ],
 "report": [
  "I'm writing this with a sense of responsibility to contribute to this excellent database, since it was only the article I found here that helped me figure out what was going on: my experience closely matches the description of an allergic reaction to calea z.",
  "I purchased 1 oz. of the dried plant from a reputable online source.  I made tea out of it, and vaporized a small amount - all before going to bed.  I was trying to induce lucid dreaming, and I also did some meditations and visualizations toward this end.",
  "I enjoyed the effects very much - subtle visual changes, relaxation, increase in the sensitivity to light, and the next-day feeling of well being described by many.",
  "I drank the tea three nights consecutively.  I didn't have a lucid dream, but many colorful and pleasant dreams, and a general good feeling.",
  "TWO DAYS LATER (this is the one difference from the allergy description I found on this site), I developed intense rashes that would migrate around my body, and a very bloated, painful feeling in the stomach (though no diarrhea or loss of appetite).  These symptoms lasted for about three days, at which point the entire outbreak seemed to move to my HANDS, which swelled up like baseball mitts.  At this point, the stomach pain faded away, and the rashes elsewhere on my body disappeared.",
  "As of this writing, the reaction is nearly gone.  Oral antihistamines and plenty of water may have helped, but it was probably just a matter of time.  It's been almost a week since I last took the tea.",
  "This matches the description of allergic reaction to Calea Z I found on this site - and nowhere else! - except it happened over a longer period of time.  Still, this makes sense in light of the fact that many report Calea's effects to occur over a fairly long period of time.",
  "I also should note I took Kratom for the first time both before and after the experiment with Calea.  ...But I'm fairly sure (again, because of the match with the report I found here) that the allergic reaction was to Calea Z.",
  "I took the Kratom - approximately 10g, but it may have been as much as 15g - two or three days before taking the Calea.  I remember feeling a little discombobulated the next day.  If it weren't for the Calea Z report I read that referred to itching and painful swelling in the hands (my  hands were like comical balloons!), I might have attributed the allergic reaction to the kratom (many have reported itchiness).",
  "Was it some combination?  I don't know for sure. Another possibility is that the Kratom somehow made my system more vulnerable to the reaction.  Even the report that specifically addressed Calea Z allergic reaction didn't get the full stomach dimension of my reaction.  It wasn't nausea, but an unpleasant, three-day-long bloating.",
  "I also note that I am prone to food allergies, and stomach troubles, so it's not surprising a substance that many can tolerate was too much for my system."
 ],
 "erowid": {
  "id": "67835",
  "citation": " Voyager. \"Likely Allergic Reaction: experience with Calea zacatechichi (ID 67835)\". Erowid.org. Dec 20, 2007. erowid.org/exp/67835",
  "substance": "Calea zacatechichi",
  "views": "20848"
 }
}
