{
 "id": 10847,
 "title": "DPT Shudders",
 "date": {
  "submission": "2001-05-23T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Jim",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "166 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "It was a warm summer day.  I had recently walked home from my research job to find my roomate in the living room.  'A package came today,' he said with a certain gleam in his eye.  The package was of dipropyltryptamine, the HCl salt to be exact, and we were both quite anxious to let the stuff enter our bodies.",
  "My roomate called in sick for work, and I proceeded to cut the powder into finer grains for insufflation.  After we finished our ingestion we just sat upstairs in a living-room type area.  Almost immediately, my roomate, who had just recently eaten, was quite struck by nausea.  I hadn't eaten yet that day and felt no nausea whatsoever.  I began to feel the effects approximately 30 minutes later.  It consisted of an amphetamine like rush, something I had not anticipated.  I imagined that this substance would be similar in experience to DMT, but I would have to say that little similarity exists for those who have experienced DMT.",
  "By this time I could no longer stay contained within the house, so I wandered outside.  I was not tripping in any sense, just incredibly uplifted and wired.  I circled my house several times, finally convincing myself to stop after around the seventh lap to keep from receiving unneeded attention from the neighborhood.  So I sat down on the porch.  Within a minute I began circling again.  I felt like I was spiinning deeper and deeper into the experience, although I never lost coherency.  Things began to sparkle with a psylocybian quality and became 'wavey'.  My teeth began to chatter, though I wasn't cold.  I decided it was time to enter the house again. ",
  "It was after I entered the house that some disturbing physiological side effects manifested themselves.  The teeth chattering gave way to full body shudders.  I couldn't quite say that they were as violent as convulsions but they were definitely unwelcome and uncontrollable.  I began to moan, and due to my violent shaking it came out as 'Ah-yah-yah-yah-yah!'  My roomate, who was experiencing none of these tremors, then turned to look at me and dub me 'a human vibrator'.  It was soon after these tremors began that I began to trip balls. ",
  "The trip seemed to have no subjective baggage associated with it.  It didn't have the 'Wow!' of LSD or the religiousness of shrooms.  I remained entirely coherent, but lost total control of my  body, speech was difficult.  I remained shaking on the bed, my hands contracted into useless claws while I watched some of the most extreme visuals of my life.  This probably lasted for a half hour, after which I could then get up.  I was still mildly tripping, like a low dose of LSD, and had severely hindered motor control.  We decided to go for a walk.",
  "The effects seemed to have tapered off to this low-level trip and then continue on this plateau.  Visuals were faint and would unexpectedly come and go.  One of the most disturbing aspects of this experience, besides the tremors, was that my hands became numbed, particularly my dominant hand, and remained so for a few hours.  This happened to my roomate as well, although he did not have the tremors I experienced.  The effects seemed to trail on for hours, the after-effects about the same magnitude of the trip itself.  A dull throbbing headache appeared before I went to bed, which was around six hours after injestion.  I slept soundly and awoke with much energy, but I believed that my nerves, especially in my hands, were still agitated by the experience.",
  "The experience was very fun and intense, but due to the intensity and nature of the physiological side effects, I will most likely never do this drug again."
 ],
 "erowid": {
  "id": "6785",
  "citation": " Jim. \"DPT Shudders: experience with DPT (ID 6785)\". Erowid.org. May 23, 2001. erowid.org/exp/6785",
  "substance": "DPT",
  "views": "7472"
 }
}
