{
 "title": "Love, Truth, and Ecstacy",
 "author": "Lux",
 "citation": " Lux. \"Love, Truth, and Ecstacy: experience with MDMA (Ecstacy) (ID 10848)\". Erowid.org. Dec 9, 2007. erowid.org/exp/10848",
 "substance": "MDMA (Ecstacy)",
 "bodyweight": "135 lb",
 "report": "<p>On the day before thanksgiving, I tried Ecstacy for the first time. I was with my best friend, tanja who I literally spend every moment of every day with. Along with some other people I had felt pretty close to. I was kind of nervous at first. When I popped that pill, by our car in the parking lot, everyone grinned at me like they were happy I had just joined the club. I first remember waiting about 40 minutes in line to get into the rave. As the line slowly moved, I could feel my body getting numb with every step.</p><p>When I got inside, the lights and music excited me. It was like stepping into a totally different dimension. All I wanted to do was dance. I started to dance with Tanja, I felt free. I moved in a way I could never imagine. I was totally aware of what i was doing but at the same time, I didn't care, so filled with joy and happiness, My body moved how it wanted to. I looked at people's faces. I loved everyone. Tanja's face lit up like an angel's and pretty soon, some guys started to film us. We were filled with so much emotion, and it came through when we danced. I felt so confident. A circle started to form around me and tanja and all I could think about was how much fun I was having even without all the attention.</p><p>The night ended in a hotel room where I slept soundly and woke up with a brighter view of the world. Everything was more beautiful than before. My only fear throughout this whole experience is that I may want to abuse the drug. Tanja and I have made a pact that we will never do it without each other and space out our doses every two months so that we wont have to take more than one. I recommend it to people by far as the greatest mind altering substance on this planet. Everything in mediation.</p>",
 "year": "2001",
 "id": "10848",
 "gender": "Female",
 "timestamp": "2007-12-09T08:00:00.000Z",
 "views": "3838",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
