{
 "id": 10841,
 "title": "Bad Night but I Wrote a Good Paper",
 "date": {
  "submission": "2008-09-04T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Raul",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  },
  {
   "time": "0:30",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Well, it was finals week and I had a paper to write and two finals to study for so, I was really stressed out. My girlfriend had told me that alot of people in her school take adderall to focus and she's tried it a few times to study and it works. She gave me 3 pills for the week and told me to take one a day, maybe one and half if its not strong enough. This was my first experience with Adderall so I didn't know what to expect.",
  "I took one 30mg pill, after about 30mins I really didn't feel much so I decided to take another 30mgs. About 30mins later I started feeling it. I felt very focused and I felt a cozy feeling. I felt nestled into my book and my work. I was actually excited and enthusiastic about doing my work. After about 2 hours or so of reading and typing I caught my self taking very slow deep breaths. I felt my pulse and my heart was beating very very slowly, unusually slow, then there was no beating for like 4 seconds and I began to panic knowing I was about to passout.",
  "Then all of a sudden my heart began to race beating very quickly. I stood up from my chair and tried to regulate my breathing in the hopes to regulate my heart rate. It work for the time, so I continued to due my work but, all I could focus on is breathing and my heart rate. I tried to forget about it and just focus on my work. As I was typing I felt numbness and tingling in my fingers as if my finger fell asleep. I knew that my heart wasnt pumping enough blood to my finger so I got up and tried moving around alil to get my blood flowing. I also made a sandwich and drank alot of water hoping to flush out some of it.",
  "That did work slightly so I just continued work hoping itll go away on its own. My fingers got really cold and it became difficult for me to type because my fingers were so numb. They felt like if I had put them in ice water for an hour. The rest of the night I was just focused on checking my heart and breathing and trying not to pass out or anything. It was a very scary experience. I did not sleep at all. In the morning those negative affects wore off but, I felt hyper and exhausted at the same time. My mind was hyper but my body was tired.",
  "This experience I had was actually two days ago. Last night I finally got a full night of sleep but, I still dont feel totally normal. It was a lot more powerful than I thought. I have experimented with drugs in the past. Id compare my feelings as similar to E without the emotional part. All in all I had a bad experience but I wrote a pretty good paper."
 ],
 "erowid": {
  "id": "67819",
  "citation": " Raul. \"Bad Night but I Wrote a Good Paper: experience with Amphetamines (Adderall) (ID 67819)\". Erowid.org. Sep 4, 2008. erowid.org/exp/67819",
  "substance": "Amphetamines (Adderall)",
  "views": "12560"
 }
}
