{
 "title": "Good Sex, But With A Price",
 "author": "Gatz",
 "citation": " Gatz. \"Good Sex, But With A Price: experience with Sildenafil citrate (Viagra) (ID 10847)\". Erowid.org. Nov 27, 2001. erowid.org/exp/10847",
 "substance": "Sildenafil citrate (Viagra)",
 "bodyweight": "140 lb",
 "report": "<p>Eager to test the theory that the use of Viagra will permit erections while under the influence of MDMA, I obtained several of the 100mg pills. It's my personal rule that I never mix substances without first trying them on their own, so I decided to test out the Viagra by itself and see what its effects on me were.</p><p>My girlfriend was curious as to the effect of the drug on her as well, so we split a 100mg pill in half (roughly 50mg each).</p><p>The drug took hold approximately 40 minutes after we swallowed the broken pills (on an empy stomach).</p><p>I could describe the sexual enhancement provided by Viagra, but that is covered extensively elsewhere, so I'll simply sum it up as saying that orgasms are initially the same intensity as normal, but the drug allows for new, strong erections minutes after orgasm, and later orgasms are delayed and more intense. There were no noticeable sexual effects in my girlfriend.</p><p>Viagra did not have any psychological effect on our libido.</p><p>I did experience an extremely bad intermittent headache for several hours after taking the pill. The 50mg dose caused sinus congestion in both of us, and my girlfriend compared the visual effects of the drug to 'coming up on acid.' (The visuals weren't that intense for me, but color and light were noticably altered -- particularly blue and yellow tints.)</p><p>I suspect that 50mg may have been too much for me, or that I should have eaten a meal before taking the pill. However, I am generally a light-weight with most drugs/medications.</p><p>All in all, the experience was amusing, but not worth repeating unless I could eliminate the side effects (possibly by taking a lower dose).</p><p>I have yet to test this with MDMA, which hopefully will be more interesting. I'll report my findings when I have done so.</p>",
 "year": "2001",
 "id": "10847",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2001-11-27T08:00:00.000Z",
 "views": "92327",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Sildenafil",
   "form": "(pill / tablet)"
  }
 }
}
