{
 "id": 10867,
 "title": "What a Long Strange Trip it's Been",
 "date": {
  "submission": "2008-03-05T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Chris",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "DOB",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "<p>[Erowid Note: This report is marked as a DOB report, but readers should be aware there are aspects of it that suggest the identification is speculative.]",
  "Every year, LSD becomes harder and harder to find in SW Florida.  When its around, my friends and I try to buy a lot to stash away for when the time is right.  Of course, you dont always get actual LSD, because not many people do their research on the subjectthey just believe what theyre told.  This was the case with one particular batch of acid. ",
  "Background:  Through the years, Ive experimented with many substances, and Ive come to realize that my favorites are psychedelics.  I have tried the following:  LSD, LSA, psilocybin mushrooms, Amanita muscaria mushrooms, DMT, 5-MeO-DMT, AMT, 5-MeO-AMT, DiPT, 5-MeO-DiPT, 2C-E, 2C-I, Mescaline (low dose, sadly), MDMA, MDA, MDE, DOB (possibly some other DO-chemicals as well), Salvia, some anti-cholinergic deleriants, a long list of random pharmaceuticals, and others such as opium, heroin, and cocaine.  My favorites, in no particular order, are LSD, DMT, and 4-HO-DMT.  And of course, everyone likes marijuana.",
  "Anyway, three of my friends and I decided to go camping a few days ago, since its great to trip outdoors.  We were all in a good mood, with a positive outlook on the trip.  'T' and I set up the tent and prepared our camping area, while 'J' and 'K' went to the store to get some last minute supplies.  When we got around to taking the acid, I could tell right away that this was going to be a very long trip.  Of all the acid Ive taken over the years, Ive only come across two batches of LSD that actually tasted like something.  Really potent LSD hits have a mildly bitter lemon-like taste for about 3 seconds.  Basically, if you can taste anything, youre in for a hard trip. ",
  "With these LSD hits, there was that familiar phenethylamine taste with a slight numbing effect that lasted a few minutes.  It reminded me, in a way, of the taste of really pure cocaine.  Since this acid was supposedly weak, I took four, just to test the waters.  I decided that since blotter paper usually only holds about 400 micrograms per hit, I wont have to worry about taking too much if it turned out to be anything but LSD.  My guess was correctthis was NOT LSD.  It was some kind of DO-chemical. ",
  "We took it around 7:20 PM.  Within about one hour, I started to notice slight tremors in my legs and arms.  It wasnt anything major.it was more like those random spasms that feel like a particular muscle is twitching to the beat of your heart.  We started to run low on firewood, so we began walking on a path to wood piles that we had discovered earlier.  On the walk, it became increasingly difficult to focus on the task at hand.  Everything started to look unfamiliar and very defined.  Sharp lines and geometric patterns were forming on the path, and the clear, star filled sky got brighter by the minute.  The moon seemed to be giving off an aura of every color imaginable.  The most prominent colors of dark objects seemed to be red and blue, for some reason.  As we continued to walk, we all started to feel confusion setting in.  Everything looked very much the same, and we couldnt remember where we had seen the piles of wood.  One member of the group, 'J', started to panic.",
  "It felt like we were walking forever.  I was worried that we might not find our way back.  This never happens to me, because I have a pretty good sense of direction, but DOB can be very confusing.  After about 30-40 minutes of walking, my friend who had started to panic was in a state of full-on delirium.  The open eye visuals were spectacular.  The sky was now filled with multicolored spinning kaleidoscopes that seemed to expand from the intensely bright stars.  It was very similar to the open eye visuals of a high dose of LSD, but these visuals had a very synthetic feeling, compared to the warm organic feeling of the visuals brought on by LSD, DMT, or psilocybin. ",
  "We couldnt find the heap of wood, but we managed to find a few small branches that we dragged back.  On the walk back, I was getting really confused.  Every path looked familiar, and I started to wonder if we would have to wait until the sun came up to find our way back.  Luckily, we did find our way back to the campsite.  By the three to four hour point, I believe I was peaking, but the peak seemed to last until the six to seven hour point.  During the peak, the closed eye visuals were intense.  Randomly shifting multicolored spade-shaped objects would spin and build on each other in a way that I had never seen during any other psychedelic experience. ",
  "The four of us laid in the tent listening to a random play list comprised of mostly Beatles, Jimi Hendrix, Pink Floyd, and Grateful Dead.  The music didnt seem to play as much of a role in the trip as it does with LSD or mushrooms, but it was still very enjoyable.  Throughout the night, we went on walks around the campsite.  Everything looked almost too beautiful to be real.  It was the perfect night to trip in the woods.  The almost-full moon illuminated the paths and park benches in a way that Ill never forget.  The trip was probably over for me right around the 12-14 hour point, but I was still having slight visuals all the way through to the 18 hour point.  The normal post-trip mood lift stayed with me until the 30-something hour point, when I finally fell asleep. ",
  "Ive taken LSD that wasnt actual LSD several times, but this was by far the best experience with a DO-chemical.  After doing some more reading on the DO-chemicals, Ive come to the conclusion that the drug was, without a doubt, DOB (going by duration, dose, trip quality, visuals, and side effects).  Im assuming that the dose was at least 1.6mg.  It was probably a little more, because the paper was different from the normal blotter paper that can hold 400 micrograms of chemical per hit.  The paper seemed to absorb saliva very rapidly, and it dissolved within about 10 minutes at the most.  Usually blotter takes me about 30 minutes to dissolve.  After reading the DOB entry in TIHKAL, I can guess that it was closer to two milligrams on four normal hits. ",
  "When I'm not sure of my LSD, I just remember that if it tastes like something for more than about 3-5 seconds, its probably not real acid.so I dont try to up the dose just because I'm not tripping by the one hour point.  Happy tripping, everyone!</p>"
 ],
 "erowid": {
  "id": "67899",
  "citation": " Chris. \"What a Long Strange Trip it's Been: experience with DOB (ID 67899)\". Erowid.org. Mar 5, 2008. erowid.org/exp/67899",
  "substance": "DOB",
  "views": "7902"
 }
}
