{
 "title": "My Poor Cat Has Been Tripping All Day",
 "author": "Tephta",
 "citation": " Tephta. \"My Poor Cat Has Been Tripping All Day: experience with Datura Eaten by Cat (ID 10874)\". Erowid.org. Apr 7, 2002. erowid.org/exp/10874",
 "substance": "Datura Eaten by Cat",
 "bodyweight": "10 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Datura"
  ]
 ],
 "report": "<p>\nI recently found a large abount of wild Datura stramonium  growing near my home. So of course I did what any normal human being would do, I brought a couple of the plants home and transplanted them. I had set my pretty little plants in the window of the spare bedroom of my apartment for sunlight.</p><p>I was talking on the phone to my husband when the cat jumped up and the bed and started acting dumber than usual, and I made a comment to my husband that she was acting like she was stoned out of her stupid little head. He told me to check my plants and I noticed a large quantity of leaves missing (more than 10 less than 30). I had forgotten my husband had told me cats LOVE Datura.</p><p>My cat has been tripping really hard all day. She will run across the room at full tilt, stop, then fall over. She keeps studying our dog every time the dog goes to sleep. The legs of every chair in the house have become the single most interesting thing in the world. A few times, she was standing there looking at me and just fell over and looked confused at how she got to the floor. She has walked into every wall, door, and cabinet near the floor in the house. There is something absolutely amazing on the walls that I can't see.</p><p>She will let me hold and pet her, but only for so long. Earlier she decided she was done with attention and hopped to the arm of the chair and just sat there looking confused as hell. I can't decide if she was confused at why she was on the arm of the chair/how she got there when she was just sitting on my lap or if the floor suddenly seemed very far away. When I tried to pet her the poor thing nearly jumped out of her fur and fell off the chair. She then proceeded to get lost in the (empty) corner next to the computer desk. She has also mutilated the box our toaster oven came in.</p><p>Please remember that cats seem to LOVE this plant. As funny as this is, I am worried my poor cat will die or severly hurt herself (I think she ate the leaves about 20 hours ago and that has not happened yet). Please try to keep your critters (I am not sure if the dog got any) and your drugs seperate, it won't be very funny if your favorite pet dies.</p>",
 "year": "2001",
 "id": "10874",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-04-07T08:00:00.000Z",
 "views": "32853"
}
