{
 "id": 10875,
 "title": "Unremarkable",
 "date": {
  "submission": "2009-09-27T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TheSnowYeti",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "32 oz",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "Pharms - Clonazepam",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I was at a party last night, and my friend told me he had some Klonopin to snort, so I agreed. I was already slightly drunk (2 tall cans) and moderately high on weed. We went to the host's room and snorted 5 little green pills between 3 people, and I got the biggest line first (about 3 pills worth).",
  "I was surprised at how pleasant it felt. It was rather minty and cold-feeling, and almost painless compared to most of the other pharmaceuticals I had snorted. We returned downstairs, and at first I couldn't tell what the effects were because everyone was drunk, and the usual party atmosphere was too chaotic for me to focus on my state of mind. When I went outside for a cigarette, I noticed a mild feeling of comfort and euphoria, as well as a slight movement impairment in addition to the effects of the alcohol. Also, my head felt stuffy. I'm not sure how else to describe it; it was similar to the head pressure I get after the first hit of high grade marijuana.",
  "Other than that, the effects weren't too noticeable until the next day, when I realized that I was having a really hard time remembering what I did after I snorted the medicine. I could remember bits and pieces, but the medicine seems to have impaired me much more than that amount of alcohol usually does. Also, I've been drowsy all day and I've been moving like I'm slightly drunk. Nothing severe, I'm just clumsy and I stumble now and again. Ah well, I've never expected much from pharms anyways."
 ],
 "erowid": {
  "id": "67947",
  "citation": " TheSnowYeti. \"Unremarkable: experience with Clonazepam (Klonopin), Alcohol & Cannabis (ID 67947)\". Erowid.org. Sep 27, 2009. erowid.org/exp/67947",
  "substance": "Clonazepam (Klonopin), Alcohol & Cannabis",
  "views": "30445"
 }
}
