{
 "id": 10887,
 "title": "Harmless Fun",
 "date": {
  "submission": "2011-07-17T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Nozomu",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "I am not someone who uses drugs frequently.  I smoke pot maybe twice a year and I enjoy opium but I've only done it a few times.  Salvia was an experiment a few of my friends suggested, though I had never tried a hallucinogen before.",
  "Now, I've heard tell of people who freak out and have terrible experiences with salvia, but this is not one of those.  I would characterize salvia as a completely fun and interesting trip with no negative side effects whatsoever, the best part being that I feel completely normal in less than an hour.",
  "My favorite method/environment is this - sit in a circle with 3 or 4 people, taking turns watching the people who smoke so they don't get up and hurt themselves.  Take a hit of the 30x through an iced bong (nice!) and wait until the initial trip starts.  Enjoy it.  As the peak ends on what to me seemed not so intense, take another hit.  This is where things get really fun.  I've seen the real world melt away several different ways at once, precluding intense but not unpleasant feelings of being transported to another place.  The trick, I think, is letting myself dive completely in and not trying to rationalize what I'm seeing.  It also helps that I usually have my life pretty together and don't go through the crises that a lot of people seem to have once in a while.  Whatever the case, my imagination lets go and I see objects, people, and places all mixed and jumbled together.  Lots of colors, tricks with light, etc.  Then, after a few minutes, the floor, ceiling, and walls slide back into place and I feel as if I have landed back the in the original room, my friends still chuckling at my fevered descriptions of what I was seeing (apparently I babble like a moron when I hallucinate).  I feel strange for a few more minutes and eventually return to normal.  This experience is much more relaxing if I've had a few beers to loosen up my 'imaginitive' inhibitions (if there are such things).",
  "Then it's the next person's turn.",
  "I know salvia's not for everybody.  But for me, it's a great rainy-day activity and a completely safe pastime.  As with any hallucinogen, don't use it during a personal crisis and make sure you have someone around to keep an eye on you.  I must just be lucky, having never had a bad trip, because I've seen a few people freak out and it didn't look pleasant to say the least.  Treat the drug with respect and caution and you'll be all right."
 ],
 "erowid": {
  "id": "67991",
  "citation": " Nozomu. \"Harmless Fun: experience with Salvia divinorum (ID 67991)\". Erowid.org. Jul 17, 2011. erowid.org/exp/67991",
  "substance": "Salvia divinorum",
  "views": "2444"
 }
}
