{
 "id": 10893,
 "title": "Just A Morning Toke",
 "date": {
  "submission": "2011-07-16T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "'RoundMidnight",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "I had been interested in Salvia Divinorum for some time, as I frequently saw it sitting on the shelves of local smoke shops. The legality of the drug seemed to be something of an anomaly, as I had heard many people attest to its intensely psychoactive properties.  So one night, I went over to a smoke shop and bought a standardized 10x extract.  I was a bit tired that night, and decided that I would get some rest and use it in the morning.",
  "Though I had heard to use caution with the plant, and to have a sitter present, I decided that, for me, using it alone would be best. That way, I could achieve the most solitude and peace of mind, and I could really let the plant run its course without any distractions or social constraints. I feel like salvia is not a good drug to use in a social context; I dont want people watching me intensely when I do it. The experience is highly introspective.",
  "I had read that using a water pipe and torch lighter was the ideal way to smoke salvia.  I didnt have a water-piece on me, so I decided that, being a somewhat experienced smoker, I would be able take legitimate hits off a dry pipe. I also was using a normal lighter.  This session was a way to test salvia, and to get an idea for what the plant was; I didnt want to have an overwhelming or potentially nightmarish experience.",
  "I filled my pipe with the extract and went into the living room.  I sat on a very comfortable chair that faced an open window, took a deep breath, and decided to take a hit.  The salvia ignited quickly and stayed lit, and I took the entire bowl in one hit, as is recommended with salvia. I held the hit in for about ten seconds before I exhaled.",
  "Upon exhalation, I felt a sensation overcome my body that started in my limbs and then made its way up to my head. I felt as if my skin became prickly and my limbs started to feel heavy and even gelatinous. My eyelids became heavy and soon my entire body was overcome with a tingling, but almost scratchy sensation. My center of gravity had also been obscured.  I carefully had to set the pipe down before falling back into my chair. I started to perspire, and sank back into the chair.  For inexplicable reasons, I said aloud I should have know.not you guys.",
  "I then went on to see two figuresone that was tall and skinny, green and white, and slightly demonic looking, and had a weird hat of some sort. The other was pink, but less definedI cannot remember much more about this figure other than the color pink.  I then felt like I had an obligation to fulfill under the scrutiny of these figureswhat it was I cant explain, but I felt like there was some sequence that I had to continue. I was about to get out of my chair and start crawling on the ground when my conscious mind kicked in and said: Youve just taken a hit of salvia.  Thats when my trip was broken. I was still highly uncomfortable and hot and felt greatly relieved by removing my clothing.",
  "The whole experience lasted not more than 5 minutes, and afterwards, I felt relaxed and generally at peace with the world for another hour or two. This was highly enjoyable when compared to the immediate effects I had experienced.",
  "With the method I used (only smoking 10x, dry pipe, normal lighter), I achieved an unexpectedly intense experience. Salvia is something that I could only imagine doing once in a blue moon, as it really is an experience that requires energy. For those who plan on taking higher extractions and smoking it more efficiently than a dry pipe; take caution and enjoy the ride. Theres no way of predicting how you may react."
 ],
 "erowid": {
  "id": "68014",
  "citation": " 'RoundMidnight. \"Just A Morning Toke: experience with Salvia divinorum (ID 68014)\". Erowid.org. Jul 16, 2011. erowid.org/exp/68014",
  "substance": "Salvia divinorum",
  "views": "2737"
 }
}
