{
 "id": 10895,
 "title": "My Experience With 2-N,N-TMT",
 "date": {
  "submission": "2008-01-28T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Aeon Psyche",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "2-Me-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "2-Me-DMT",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>Substance: 2-ME-DMT",
  "Experience: 1st Time",
  "Setting: At home, Alone",
  "Administration: Nasal, Oral",
  "Gender: Male",
  "Age: 19",
  "22:34",
  "Snorted a small line to see if this stuff works nasally and perhaps works better this way. Doesn't burn badly but it is felt. I'm talking on msn and I'm basically in a good mood. Drip just started. Ewww Burns! This stuff has a horrible burning drip much like DPT. I drink some water and have a ciggarette.",
  "22:47",
  "Effects are noticed. Distinguishing between sobriety and the drug it's effects now.",
  "The effects are coming on gradually now and I am waiting to see how much stronger it's going to get before I take more. Come up is felt but very light and so not bothering me at all. Psychedelic feeling. Possibly feeling warmer. Pupils are dilated.",
  "23:02",
  "Decided to ingest the rest of the 100mg in a gelcapsule. Snorting this stuff isn't exactly pleasant. The sensation is pretty much like every other tryptamine at a low dose. Undistiguishable from other tryptamines. Stronger effects need to be reached to be able to explain better what is unique about this substance.",
  "Watched some movie on tv for a while to see if I liked it. Nope. I don't like scary movies.  A light psychedelic feeling with no character of it's own yet is felt. Listening to some music. Thinking about the future and humanity on earth. I am worried.",
  "The substance is making me care more about the situation of natural disasters than my drug use. The beautiful music goes along with it perfectly. I want to help. I don't know how. That's where my thought patterns lay now. A more serious mood developed. Talking on msn again now.",
  "23:55",
  "Are we getting stronger effects yet? I feel a tactile sensation through my head. Chills. As I am thinking about concepts I perceive more insight in my thought patterns. Possibly more abstract. Chills continue through my head. A positive thing is that I haven't felt any come up feelings yet. And the experience of course is positive. Enjoyable but not strong. Not a trip because I'm still here.",
  "00:13",
  "Starting to feel the tactile sensations through the rest of my body. Mainly through my head. Colour difference is observed. First visual activity. Coming on stronger now.",
  "Mood improving. As lucidity comes.",
  "0:36",
  "I keep smiling the whole time. I feel chills and cold. I turn up the heat. One person that was sober that I was talking to on msn noticed effects I believe. Through telepathy. All the other people who I talked to were high on other things so no way to be absolutely sure. Tactile sensations is what I experience for the most part. I feel chills through my whole body. I am happier now than I was before I took this substance.",
  "1:18",
  "The trip itself isn't strong enough to keep me busy. I'm still capable of doing all the other things I usually do. I laugh and have fun. But perhaps need something to do. This drug might require a higher dosage to achieve full effects. I don't know what brain receptors this drug effect but something in my brain that regulates my temperature may be affected.",
  "2:00",
  "No increase of effects. Either a higher dosage is needed or this compound is boring.",
  "2:47",
  "Nothing is changing so I don't write anything anymore. That's about it for this substance. It's not worn off or anything yet but I just don't have anything to add. I'm just talking on msn and listening to music. It's a good mood enhancer though. Like almost every other psychedelic. NO visuals. But almost. I perceive everything that is of matter as spirit. The substance that everything is really made of. But yeah. Every psychedelic does that.",
  "3:41",
  "Still going. I notice the chills are gone now. Don't know for how long they've been gone. I don't miss it.",
  "5:26",
  "Yawn. I ate some fruit. The drug helped me by making my mind more lucid. It was a positive experience but not a real trip. I'm getting more tired.",
  "6:00",
  "Effects are still present but I'm going to try and get some sleep. I think this drug might be useful for those who want to explore telepathy further but if you're looking for a real trip I recommend a different substance.",
  "Good night</p>"
 ],
 "erowid": {
  "id": "68019",
  "citation": " Aeon Psyche. \"My Experience With 2-N,N-TMT: experience with 2-ME-DMT (ID 68019)\". Erowid.org. Jan 28, 2008. erowid.org/exp/68019",
  "substance": "2-ME-DMT",
  "views": "6793"
 }
}
