{
 "title": "Very Different Than Mushrooms",
 "author": "Monkey Boy",
 "citation": " Monkey Boy. \"Very Different Than Mushrooms: experience with LSD (ID 10906)\". Erowid.org. Dec 5, 2007. erowid.org/exp/10906",
 "substance": "LSD",
 "bodyweight": "235 lb",
 "report": [
  "<p>Ok here goes...",
  "It was another one of those nights where me and a few friends were gonig to smoke weed because we had nothing better to do in our junky little town. I had recently acquired two tabs of acid from a friend who was gonig to try his hand at selling some. The paper the acid was on was rather small and wraped in tin foil.",
  "I suppose that before I go on, I should detail my experiences with mushrooms. I have always had a very high tolerance for mush. It got to the point where I would average 5 grams per dosage. One time me and my friends bought alot of mush and after I was done dividing it up I was left with a huge amount for just myself. I think it looked like about 9 grams. I ate it all and was pretty messed but wanted more (as always). When high on mush, everything agrees with me (EXCEPT people asking me if I am high, how high I am, etc.). Everything is more intense. Music is enjoyable, cigarettes are like candy and video games are like disneyland.",
  "Anyways, I thought that since I didnt have to work till the next day in the late afternoon I would try my acid. I did it alone. I took the acid after me and a few friends had quite a big session of weed smoking. One of my friends there gave me two pieces of advice since he had already tried acid. For one, he said to not look in the mirror because you will think you just look fucked and all cracked out. The second thing he told me was to experience nature. I took his advice to heart, took one of the blotters of acid I had, and proceeded to wait for it to hit me.",
  "About 1 and a half hours had past when I decided to take the other blotter because nothing was happeneing. We then went to this guys house and watched skate videos and played tony hawks skateboarding, both of which proved less than entertaining, especially since I was supposed to be getting messed. We went to smoke a join which I had rolled (it was very difficult although I was not very high yet) The joint got me baked but nothing else. All I felt was a feeling like I was lighter when I walked, I kind of bobbed when I walked as well. Also I felt kind of shitty too, a kind of uncomfortable feeling. We got back to the guys house after smoking the joint and watched more skate videos and still I had nothing but the junky feeling. All I noticed before I left was that the lights were really twinkly. I had to pee before I left so I went to the bathroom. I looked in the mirror. 'oh shit!' I said. I looked very very fucked. I almost looked like a girl. I had a twinkle in my eye and my hair looked like it had a female flair. I thought this was strange because when I am on mush I fall in love with myself in the mirror for long periods of time. I put this aside as me and my friends left the guys house. As we were driving home the clouds looked as though they were dancing, which was kind of cool but still nothing too spectacular.",
  "As I arrived home I had some trouble unlocking my door and the grain of my wood door was, once again, dancing. I got inside and proceeded to my games room to play video games. The games were no more intense or difficult than had I been playing them normally. I beat one of the games and, dissapointingly, I decided to go to sleep.",
  "I left the games room and had my first big hallucination. Everything around me took on a red color. I thought, 'hmm thats kind of neat.' as I walked down the hall to my red room. I walked in and closed the door and my King Kong doll yelled at me. But not the yell that it makes when you squeeze its hand. It made a realistic monkey noise. This scared me a little. Soon after this I decided that I wanted to listen to a cd that was downstairs. I also heard a tapping at my door. It was my cat. My cat is orange, very playful and very stupid and cute. It is the most harmless cat you have ever seen and honestly it looks so stupid and cute it makes me laugh. Well on acid, my cat turns into a demonical beast. It looked as though it had grown a mane and was a proud lion. This scared me alot so I decided to spare myself the mind fuck and went back to my room to listen to a different cd. Music wasn't really anymore intense than normal. The only difference was that every time it played a certain sound I was get kind of freaked out and every time it played another certain sound a white flash would come from nowhere.",
  "Overall, acid and mushrooms simply do not compare. They are two very different drugs. With mush, everything agrees. With acid, it seems everything is up in the air. With mushrooms you can just chill and it can be fun. With acid, you need to be moving, seeing new things, thinking new thoughts, for it to really work out well.",
  "If I were ever to do acid again, it would be with at least 2 friends and it would be out on the town with lots of weed. Every time I told someone I was on acid, they asked me who else was on it, to which I replied nobody and everyone thought this was a little fucked. Just a little warning to mushroomers everywhre that if you are looking for something like mush but more intense, acid is not what you are looking for. They are very different drugs.</p>"
 ],
 "year": "2001",
 "id": "10906",
 "gender": "Male",
 "views": "3977",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "submissionDate": "2007-12-05T08:00:00.000Z"
}
