{
 "id": 10905,
 "title": "Deconstructed, Reassembled, Healed",
 "date": {
  "submission": "2008-02-09T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Satyr",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  },
  {
   "time": " T+ 1:00",
   "amount": "12 g",
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "(extract)"
  }
 ],
 "report": [
  "Preperation: the syrian rue was pulverized in coffee grinder, put into 1/4 cup of water prepared with about 3 tablespoons of lemon juice, and put into the refridgerator overnight. Mimosa was pulverized and boiled in lemon prepared water. After about three hours, the liquid was strained, put aside, and the mimosa mush was put into fresh acidized water, and reboiled once again. This process was done 3 times, and the liquid was all combined after three washes, and the final product was boiled down to a drinkable amount, about 1/2 cup. ",
  "After a shower, meditation, and mental preparation, I consumed the rue extract at 7 pm. Went down fairly well, although extremely bitter and acidic from the lemon. No nausea at all, halfway through the hour I started to feel altered somewhat, a pleasant sort of high. At 8 pm, I consumed about half of the mimosa. I never finished the other half. Horrible stuff, very similiar to bile thanks to the lemon. Within about 20 minutes or so, the room started taking on an odd sort of appearance. Tracers darted all about, flickers of light combusted from unseen sources.",
  "That's when the purge came. I went to the bathroom and without hesitation, projectile vomit erupted from my esophagus. Accompanying the mimosa was these strange little strands of pink, mucousy somethings. Entangled in them were small white lumps of unknown origin. As the vomiting ended, I felt completely cleansed and rejuvenated. ",
  "As I went back to assume my position on the sofa, things started escalating rather quickly. Time seemed to stop completely. As I started peaking, I felt my reality quickly unraveling before me. Everything in the room started shimmering and breaking up and reassembling itself as I struggled to keep it intact. Not even my body could hold itself together. Soon, I started experiencing a total existenential crisis and complete ego death. I became very afraid and uncomfortable and called my wife to come sit with me. Everything I knew, believed, touched, heard, broke into pieces, shattered, melted, and reason and logic evaded me no matter how hard I tried to grasp hold of my sanity.",
  "I asked my wife to tell me stories so that I may find comfort in the familiar, as I witnessed my world dissolve before me. Crackling energy formed the space around me, electric and pulsating. My consciousness no longer existed inside my small bodily perspective. Instead it moved in and out of my head, causing intense motion sickness. I attempted to lay my head down and close my eyes in hope of comfort, but when I did the sofa dissappeared from under me and I could feel and see another realm underneath, gnashing and clawing, a sort of burlesque, gothic hell. I then decided it be best to keep my eyes open.     ",
  "At this point I feared that death would come, and in a sense it did. I was scared shitless of dying, but learned that there was absolutely nothing to fear. An unseen entity spoke to me many things that explained the nature of what we call reality, that everything we know and believe is complete and utter bullshit. Everything. A huge realization of oneness settled over my fractured awareness, and everything became crystal clear. I immediatly felt completely healed, as if my entire life was destroyed and reassembled in a better way than before. I learned that nothing should be taken seriously, that the world we know is just a grand illusion that keeps our awareness focused on the illusion. There is nothing to transcend, there is nothing to fear, nothing to look foward to, nothing to strive for. We are one, we are everything, Love is the only truth, and it is here, right now. We simply have to unplug, disconnect from the program and realize our infinite state."
 ],
 "erowid": {
  "id": "68056",
  "citation": " Satyr. \"Deconstructed, Reassembled, Healed: experience with Syrian rue & Mimosa tenuiflora (ID 68056)\". Erowid.org. Feb 9, 2008. erowid.org/exp/68056",
  "substance": "Syrian rue & Mimosa tenuiflora",
  "views": "6231"
 }
}
