{
 "title": "Dancing, Colorful Patterns",
 "author": "Justme",
 "citation": " Justme. \"Dancing, Colorful Patterns: experience with Cannabis (Hash) (ID 10918)\". Erowid.org. Dec 5, 2007. erowid.org/exp/10918",
 "substance": "Cannabis (Hash)",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis - Hash",
  "(tar / resin)"
 ],
 "report": "<p>It was friday, and I called up a friend to check what we were going to do tonight. We were gonna smoke hash with friends. I did not eat anything from about 15:00, and did some sporting around 18:30, and took a shower. This way my body would be 'clean'. I did this because I heard it could increase your experiences when using mushrooms, so I decided to try it on hash. It turned out to be Good.</p><p>At about 21:00, me and 5 other very good friends sat down at a picknicktable somewhere along a road. We rolled the joint and started smoking it. I am usually very sensitive to the effects of cannabis and it extracts, but we shared the smoke, so I did not really have much. I just had my usual stoned-experiences, until after somewhat half an hour, I saw pretty pretty pretty visuals! It was like all the patterns I ever knew and could recognize came to me, before my eyes, in one dancing and all-knowing stream of purple, deep green, deep blue and beautiful yellow.</p><p>This lasted for about 45 minutes of very intense, and an hour of less intense visuals. I felt the stoning effects for a very long time. When I looked in a mirror about 4 hours later, I still was stoned as hell, and could see myself from outside myself, I saw myself as others saw me. This was slightly spiritual. I also felt very close to my friends during the whole thing, seeing some situations as 'photo-moments', perfect describings of good-friends-life.</p><p>I also ate a whole lot of chocolate, because of the supposed MAO-inhibitors in it, to see if my experience would change. I could not sense any change because of it. My mindset was very good, because I was with very good friends. I did hot have any alcohol at all for 2 months, and no cannabis for 1 month.</p><p>In a whole a good result!</p>",
 "year": "2001",
 "id": "10918",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-12-05T08:00:00.000Z",
 "views": "2961",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "(tar / resin)"
  }
 }
}
