{
 "id": 10916,
 "title": "Plant of Good and Evil",
 "date": {
  "submission": "2008-04-18T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "datura_psychonaut",
  "gender": "Male",
  "weight": "95 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 flowers",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(fresh)"
  },
  {
   "time": "0:40",
   "amount": "3 flowers",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(fresh)"
  },
  {
   "time": "0:40",
   "amount": "4 leaves",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "This is my time with datura...",
  "I have tried many years to find this plant and eventually stumbled across tree datura finding the strange droopy evil looking leaves in a garden a few streets from my house. I have always said I would never try datura but for some reason this plant drew me too it. I snuck back that night chopping down many branches and loading a large shopping bag full of mostly flowers. 2 flowers where consumed on the walk home followed by 2 more on arrival at my house, I had 2 other friends there to hold me down if needed I'm a big guy so I then ate 3 more flowers about 40 minutes after eating the first 4 while I was preparing the boiled leaves, this is when first effects where being felt. 8 leaves where boiled and the juice was separated into 2 cups I drank 1 cup and put the other one in the fridge (never needed it!!!)",
  "I had an gradual feeling of getting more and more out of my body sometimes imagining myself tripping over and falling but never hitting the ground. As 2 hours went by or so this falling feeling was getting the better of me I would suddenly be in a vision of me falling and could not see, hear, smell, feel anything around me and time didnt exist while I was falling I was waiting to hit the ground but I never got there. I dont smoke cigarettes but I smoke alot of bongs and slowly the bongs twisted me further out. Not that I was actually getting stoned just the act of having a bong was spinning me out creating abstract inner body feelings. Around 4 or 5 hours into the trip I was seeing strange bugs that were obviously not real bugs marching in lines off to the distance my depth perception was nonexistent, and I couldnt get around the absolute confusion. I was confused about being confused.",
  "Eventually I think I went to sleep I say think because it could just be another part of my trip, I have very paranoid feelings pulsing through my body in this trance state and had intense hallucinations of hell and demons tearing at my flesh and pulling my limbs from each other. Piles of dead bodies were stacked everywhere I looked, new bodies somehow piling on top with a thud everytime one was added. I soon realized this thud was some kind of African drum and this drum was controlling my facial expressions some beats making me smile others sending me into manic fits of evil. Also there was an impression of some kind of eye in everything.",
  "I can remember in between these visions I would just be in my room as many of my friends walked in kind of auditioning for something in front of me, dancing around and telling really dirty jokes. I'm not sure but I think somewhere around the 8 hour mark I had a very lucid dream and in it I had dropped alot of acid, and when I say alot I mean like I ate half a sheet but in the dream and the reality I was experiencing was actually like an overly insane acid trip, very psychedelic but not the same as acid psychedelic it was an horrific view of psychedelia as I know it although I consider myself quite a psychedelic person and I love lsd.",
  "I remember shouting 'I live with my mind 4 feet to the left of my head' or something along these lines implying my mind was disconnected from my brain. My friends told me I made no sense at all at this point and I would never have been able to put those words together the time I thought I was asleep I was up crashing around into things unaware of where I was, I'm told I could look straight at my friends and be seeing something else entirely with nothing but a blank zombie stare on my face I really think at this time it was me looking through my 'third eye'.",
  "I saw many time periods and experienced myself as other people and  animals for a while I was a black man, I remember for a split second seeing a view that looked like I was at the top of an egyptian pyramid. I really cant believe how far out of my mind this stuff can take me, beware of this plant its not to be taken lightly at all! My pupils are still very dilated 2 weeks later and I am still not at 'baseline'.",
  "A scary but insightful experience."
 ],
 "erowid": {
  "id": "68101",
  "citation": " datura_psychonaut. \"Plant of Good and Evil: experience with Brugmansia (ID 68101)\". Erowid.org. Apr 18, 2008. erowid.org/exp/68101",
  "substance": "Brugmansia",
  "views": "9597"
 }
}
