{
 "id": 10929,
 "title": "Two Drop Reality Deconstruction",
 "date": {
  "submission": "2008-09-04T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TripHazard",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 drops",
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "4:30",
   "amount": "1 drop",
   "administration": "oral",
   "substance": "LSD",
   "form": "cookie/food"
  }
 ],
 "report": [
  "I have done acid on many occasions before. I am quite susceptible to psychoactive substances and usually trip a lot harder than most of my friends but this was one to remember for all of us.",
  "We decided to do acid on this particular day, put in the order and sat around waiting for our contact to drop off the substance in question. Our guy turned up a couple of hours later with what we later found out was apparently first dilution LSD which would explain the next 16 hours. We took a couple of drops each, actual quantity is unknown given the inaccurate form of ingestion, at about 3pm. I had decided to candy flip and do a very small amount of pure MDMA as well to soften the cold edge. Our sitter, call him G, arrived just as we had taken the acid and we hung around for about 15 minutes before venturing out to the parkland near where we lived.",
  "The parkland is a 10 minute bus ride away so we walked down to the local bus stop. 25 minutes after the ingestion of the LSD and standing at the bus stop my friends, S and J, said they were feeling the precursor effects of coming up. I, however, was seeing the road wave up and down, obviously coming up faster and harder than my friends. The bus arrived and I managed to sort out the money for a single ticket, went to the top floor and sat down. We chatted for a while and experienced some weird co-incidences that always seem to happen on hallucinogens. At this point the first proper wave, about 35 minutes in, hits me hard. The bus journey is a blur. Next thing I know Im off the bus going to our sitters house near the parkland and my friends are discussing what they are feeling. Im barely able to speak at this point but still quite aware of what is going on.",
  "After G gets some supplies from his house we set out for the parkland. At this point time means very little to me and I can just about remember going up a huge hill and reaching a bridge crossing a fast dual carriageway. We stop to watch the cars and their respective ghostly trails rush below us and then head off into the actual park land. We stop for a while on a path to catch our breath. G asks me how the LSD is and I say it's pretty intense. Ill attempt to explain the visuals at this point - looking up the path I could see trees and plants, however everything was leaving massive trails every time I moved my eyes so it all seemed to be vibrating, expanding and contracting. This was increasing in waves of intensity but at least I was still able to talk to my mates.  Given that, it was becoming a level of intensity that was uncomfortable, difficult to train your vision on one thing. Basically everything was moving around me. G offered S and J some ketemin which was answered with No thanks, Im tripping enough as it is. We stand up and set out for the main park land.",
  "This section of the journey is a blur for me as the next wave hits me and I can only assume is far more intense. The next thing I remember, we have just made it to the main section of park, breaking through the woodland and out into a huge open space made up of a couple of rolling hills. By this point I am seeing things through what can only be described as a camera from the Blair Witch Project or some other film with similar first person camera; these are not my eyes, theyre some detached lens. I look around and I see a family walking their dog, I look to the left and I see the same family walking their dog and this is also duplicated to the right of me. I rapidly lose any cohesion in my mind and start becoming completely delirious.",
  "As we walk up the hill All I see is my vision duplicated all around me. I am convinced at this point that G has taken us to this hall of mirrors and guiding us through to the end of this maze. We reach the top of the hill and sit down for a while. However the intensity kicks up another notch and the next wave hits me; I literally cannot see at this point. The visuals have reached an intensity that everything is moving, coupled with the fact I have no depth perception, the world around me is just a mass of distorted colour and shapes; my vision is just blobs, I am literally blind unable to see an inch in front of me. From what I remember (since this point is quite hazy) my friends have some K and they experience the same problems. My memory of this point is either reconstructed or I have an out of body experience but all I can remember is third person and seeing a dog run up to me a couple of times. I remember trying to say hello to it and then a blur of time.",
  "The next thing I remember is total deconstruction of my reality. I cannot remember who I am, or what anything around me is. All I remember at this point is walking through a vast blue universe, walking past these small stars and planets and following these entities in front of me. The entities in question are my mates, however I cannot remember who or even what they are. I follow them through the universe, feeling scared that I am alone. Then these entities started talking to one another which gives me hope - they are still able to communicate with one another and so must know that they exist. I remember seeing our sitter, although I had no idea what he was, and I remember thinking that I had to keep to this entity because he hadnt done something that the rest of us had done.",
  "I would normally have been scared by what I was experiencing but this was my reality, I could not compare it to anything else since I could not understand let alone extrapolate beyond what I was experiencing. This was everything to me and as far I was concerned this was what it had always been. Also I was incapable of actually understanding anything anyone said, it was a totally alien language. These entities did seem familiar but beyond that, there was no memory of what they were.",
  "There is a huge blur and then the next thing is its gone dark. I am still unable to remember who or what I am but we are at a house, it's Gs house. We go into the house, another blur and then Im sitting on the kitchen floor still incapable of grasping anything around me. I then remember a huge section of weird out of body experience where I float between my friends faces as they discuss a drug. I think my brain filled in a huge amount of the conversation as all I remember thinking is that we had taken a drug that expanded a few minutes into a load of hours and that by the end we will just come out and learn a lot from the experience.",
  "I suddenly hear one of my friends talking about university and I remember I am a student but I cant remember my name or what Im studying. G puts on some dubstep and this seems familiar, its music and thats something I could kind of grasp and then a blur. Next thing I remember Im starting to grasp some reality, that point where things around me start to seem familiar - it's best described as the trip being plunged into a deep pool of water and this point being the first time I finally reach the surface and gasp for oxygen. I finally know who I am but Im not too sure where I am other than a taxi and my friends are discussing Fantasia with the taxi driver.",
  "We get dropped off at my friends house. For some reason I, with my mates, decided to chomp down another sugar cube each with a single drop of acid on. Obviously we were not really in a great state of mind to be making these decisions by ourselves but we did none the less. I was still kind of incapable of talking to people but I could understand what is going on around me. The visuals were ridiculous but enjoyable at this point. It must be a good 4 or 5 hours since I had taken the two drops of acid.",
  "We leave just as we are coming up on the 3rd drop. The world around me seems totally unreal, like everything is rendered in computer graphics. The best I can describe it is the same as before I became totally delusional - there was about a 2 second afterburn of everything I saw on my vision so everything that was still had all its details exaggerated by the fact that they were totally still. Say I looked at my hand - all the creases on my palm were exaggerated because what I was looking at was 2 seconds worth of vision super-imposed over my current frame of vision - this includes every minor movement of my eyes offsetting that frame of vision - i.e. every minor detail had trails all around it. But I also had what can be best described as faint fractals spinning on my vision as well as everything seeming to be in very high contrast. I was pretty much back to normal mentally by this point though.",
  "We made it back to Ss house where the acid intensified to the point that my focal point was quite often duplicated over my peripheral vision. I had great fun just looking at things and watching them warp far more than they had ever done before. Every detail was accentuated by my vision being out of sync. I picked up a twig in the garden and looked at it, except when I stared at it everything in the background went out of focus and became a moving blob of colour but the thing within focus was in perfect detail. Closed eye visuals were ridiculous and were a constantly spinning multiple infinite fractals of reds, blues, and yellows. When I stared at trees, all they did was form into kaleidoscope fractals that just seemed to go on forever. My vision was quite often just a kaleidoscope of fractals made up of the things around me.",
  "I finally made it to bed later on in the late morning and fell into what could only be described as a trance. The visuals, open and closed eye, never really decreased in intensity until the next day.",
  "-Aftermath-",
  "For a couple of months after, the HPPD (Hallucinogen Persisting Perception Disorder) I suffered before was massively increased. Trails appeared quite clearly even during day time and visual snow in the dark was absurd, it appeared to flash like a strobe light quite regularly in my vision. Since then the visual distortions when sober have gone back to their previous level of intensity - trails all the time but most noticeable in high contrast situations, like a light moving around in a dark room, slight variation in perception of scale of objects, in darkened rooms things appearing to continuously fall off ceilings slightly, objects appearing to slide around slightly and objects appearing to vibrate slightly.",
  "My visual snow has since stopped flashing so regularly. However since the acid I have experienced other strange effects. When in bed sometimes when just closing my eyes to go to sleep I think I am looking at a scene, it can be still or parts of it can be in motion, and suddenly I am literally looking at that scene like a closed eye visual. When I realise I am looking at that scene, it begins to rapidly fade from my vision but is still there when I open my eyes before it fades away completely. I am left with patterns flying over every surface I look at for about 10 seconds after the event. The other thing I have noticed is only a few times I have woken up to see a spinning abstract shape in my vision, super imposed over everything else and quickly fades. I am not sure if these are the result of general drug use or HPPD.",
  "Since the event described I have taken acid as well as other hallucinogens many times. However, hallucinogens have never seemed to reach the same level of intensity as they once did. On the whole, I found the experience quite interesting to analyse and come to terms with. I am pleased I have experienced it even though I would not have wanted to consciously inflict that level of intensity on myself. I am pleased that throughout most of it I was unable to understand beyond what I perceived and that it was my reality and clearly had no idea what was really going on."
 ],
 "erowid": {
  "id": "68159",
  "citation": " TripHazard. \"Two Drop Reality Deconstruction: experience with LSD & MDMA (ID 68159)\". Erowid.org. Sep 4, 2008. erowid.org/exp/68159",
  "substance": "LSD & MDMA",
  "views": "3503"
 }
}
