{
 "title": "Very Subtle; Mood and Confidence Effects",
 "author": "Owen",
 "citation": " Owen. \"Very Subtle; Mood and Confidence Effects: experience with Piracetam (ID 10926)\". Erowid.org. Nov 6, 2003. erowid.org/exp/10926",
 "substance": "Piracetam",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "1600 mg",
   "oral",
   "Piracetam",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>After 3 days of taking 2 Piracetam per day, I found the following:</p><p>1) I did not feel any mental clarity effects / smart-drug effects.</p><p>2) I felt much more emotionally stable, to the point where I didn't even want to do any other mood-altering substances - STRANGE.  My mood swings were 'blanded out'.  Sunsets no longer gave me chills of pleasure, but bad things happening did not get me as down, either.</p><p>3) I found my memory slightly increased, or at least motivation to remember.  I no longer was as worried about remembering all the things I had to do and all the people I had to call.  This could be placebo, but the effect was quite dramatic in letting me feel 'really on-top of things' even during a move/house remodel/programming work/taking classes.</p><p>In an attempt to test for some sort of placebo effect, I stopped taking Piracetam for a month.  The effects (#2 + #3) stopped within 2-3 days.  I began to worry about forgetting things - phone calls, things to do, work assignments, etc.  I found myself writing a lot more down and feeling more like I was 'forgetting' something.  My mood swings slightly increased back to normal levels.</p><p>I personally find that Piracetam is very subtle, but definitely has mood and confidence effects.  I feel more 'on top' of it when taking 2 of those orange pills a day.</p><p>I think a lot of Piracetam's effects have to do with personality and brain chemical level differences in various people.  I feel like my base personality has more to gain from Piracetam's effects, whereas some more motivated, 'on-top-of-it' friends of mine probably wouldn't even notice a difference.</p><p>Just thought I would share, as Piracetam definitely deserves some sort of notice...</p>",
 "year": "2001",
 "id": "10926",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-06T08:00:00.000Z",
 "views": "35175"
}
