{
 "id": 1092,
 "title": "Red Rock over the Years",
 "date": {
  "submission": "2005-06-30T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ShaggyBeard",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Red Rock"
  }
 ],
 "report": [
  "I've tried red rocks over the years 3 times now. ",
  "The first time was at a weekend-long festival at a university to celebrate spring.  The setting was very comfortable and interesting, and red rocks were sprinkled over diggidy dankiddy, crystal-laden, light green budz.  The redrocks came from a long chain of friend-of-a-friends.  They were kind of crystally red... light in color, and cracked easily with a fingernail.",
  "Smoked, the red rocks were very sweet and tasty, and I noted how soft the smoke felt.  Even with a bubbler, it can be tough on my throat, but this was sweet and soft.  The rocks started melting right away when the flame hit them, and kind of sunk into the bud, making a glazed layer that stayed lit a little after a hit.  They were sweet with a distinct wildflowery flavor.",
  "As for the effects...  The setting, as I said, was festive, and I was in for a good high no-matter what.  I had a normal marijuana high right away, then I felt intense relaxation, and sunk back comfortably into the couch.  Everyone seemed to enjoy how comfortable they felt.  I definitely felt a bit of a body buzz that wasn't normal from weed, and was more happy than usual.  Overall, I had a warm and cozy time.",
  "The next time I had red rocks, was a couple years later.  My friend told me he had them, and was psyched after smoking some the night before.  I was really pumped myself.  This time I had bong hits of mj and rr.  The red rocks were a little darker, but pretty much the same.  I recognized the flavor right away, and they burned the same way I remembered.  It was really weird, though.  I got stoned, but nothing else.  I felt that nothing was happening any different than usual, and I was really bummed.  He felt the same way, and I guess realized that the night before was pretty much the same for him... just a pot high.",
  "So, let down, we thought maybe quantity would make a difference.  We put huge chunks of the stuff on bonghits and in my bowl, and easily finished 6 g of it.  Still, no effects.  The whole thing was a bust.  For weeks after that, I started to hate the damn taste that just wouldn't go away from my bowl.",
  "Now, still a couple years later, I happened upon some red rocks.  This time I figured why not try again.  The first experience was so much better than the second one, that I felt it was worth a shot.  This time, the flavor is a little different.  Less sweet, and perhaps a tinge of mustiness to it.  The psychoactive effects are subtler than the first time, but present as opposed to the second time.  I would say that the pleasant state of mind is present again, and that I feel a little more focused than I normally would be just stoned.  Normally I seem to get wrapped up in complex thoughts in my head when I'm stoned, but with these red rocks added, I feel somehow more material... more in the room.  It is also a little more calming... normally I burn through tons of cigarettes, but am now not as antsy for them.  Another effect that has presented itself each night that I've tested the rocks is that I am colder than usual.  I tend to get a bit chilled from them, but that wears off.",
  "I've read all the experience posts at erowid to date on red rocks, and I see common threads with my own in many.  I think that the source of red rocks is probably in no way opium, but that its name can merely be accepted to mean that it smokes like opium.  I could believe it if I found out that red rocks was actually incense.  It does have an incense-like fragrance, and it does stay lit, as you would desire from incense.  In my mind, it at least has a few pleasant qualities (2/3 of the time) and makes for an interesting variation once in a while from a plain old bowl of weed.  On the other hand, I don't know what it is, and won't pursue it much further.  That may seem sensical to some and stupid to others that I'd try it in the first place without knowing what it is, but I ask those... how much do you really know for sure anyway? ;)"
 ],
 "erowid": {
  "id": "13183",
  "citation": " ShaggyBeard. \"Red Rock over the Years: experience with Red Rocks (ID 13183)\". Erowid.org. Jun 30, 2005. erowid.org/exp/13183",
  "substance": "Red Rocks",
  "views": "5527"
 }
}
