{
 "id": 10923,
 "title": "Visual Oddities",
 "date": {
  "submission": "2008-05-19T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "J Dawg",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Pharms - Lorazepam",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "1000 mg",
   "administration": "IV",
   "substance": "Pharms - Phenytoin",
   "form": "liquid"
  }
 ],
 "report": [
  "After going to the ER for a series of really bad Petit Mal seizures, and receiving a shot of Ativan (I don't know the mg) to neturalize the symptoms, the ER doc decided to give me a loading dose of IV Dilantin before I left. I had taken Dilantin in pill form before and hadn't noticed any noteworthy effect. I was expecting a small injection, but was surprised when the nurse brought in a IV bag containing 1000mg of the stuff.",
  "By the time 200mg was in me, I noticed certain colors were standing out more, almost cartoon like in quality. At 500mg, edges of doors and walls appeared to be bulging out instead of going in a straight line. Lights also began to seem a lot brighter, and the text on the IV machine's readout appeared to be dancing. With 800mg in me, I began to feel quite tipsy and euphoric. I also felt a strange sensation in the back of my head, like that part of the brain was lined with metal.",
  "When all of the stuff was in me, I was promptly discharged and sent home with a script for the pill form of Dilantin. The high at this point resembled the high generated by other anti-seizure medicines like Neurontin or Lyrica, but the visual aspect (bright lights, colors) closely resembled that of Extacy. I went to bed an hour or so later still feeling pretty loaded, and awoke the next day feeling like utter crap.",
  "All in all, it was a unique experience, like a cross between Neurontin and Extacy (visually, anyway). The hangover the next day was terrible, but did not last too long.",
  "I never knew Dilantin could do this!"
 ],
 "erowid": {
  "id": "68139",
  "citation": " J Dawg. \"Visual Oddities: experience with Phentoin (Dilantin) & Lorazepam (Ativan) (ID 68139)\". Erowid.org. May 19, 2008. erowid.org/exp/68139",
  "substance": "Phentoin (Dilantin) & Lorazepam (Ativan)",
  "views": "7294"
 }
}
