{
 "id": 10925,
 "title": "Alternative to Coffee or Tea?",
 "date": {
  "submission": "2010-07-28T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "bob",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 capsls",
   "administration": "oral",
   "substance": "Mucuna pruriens"
  }
 ],
 "report": [
  "I have read a lot of stuff about Mucuna pruriens and their effect on increasing dopamine.  I am simply increasing the dose taken by about 5 times the recommended dose, this equates to about 10 caps of the herb.",
  "10:30am -  I took the caps and started doing chores.",
  "11:00am -  I am fealing the effects.  It is similar to a cup of coffee in that I'm stimulated but only in the head (like a caffeine high without being jittery).  I'm catching myself staring a lot or just daydreaming in general as I'm doing the dishes.",
  "11:30am -  I am taking a break from dishes to smoke a bowl.",
  "11:35am -  I'm high just as usual from smoking pot but I can still feel the effects from earlier.  The high doesn't seem that much more or less intense but I do feel like I've had a cup of coffee.  My skin is stimulated and my mind is pretty clear.  Nothing too remarkable other than the interesting level of energy I have.  Back to chorse...",
  "12:00pm -  still stoned but my vision is usually not this good when I'm stoned.  Everything is very clear and colorful but not like I'm tripping or anything like that.  I feel very at ease with everything, not a whole lot could get on my nerves right now.  I can't stop moving.  Its not as if I'm jittery but kind of anxious like I need to be walking around doing something.",
  "12:15pm -  I notice that I have to use the bathroom a lot.  I feel like I have to pee every 20min.  My liquid intake is not very high so it must be a side effect of sorts. ",
  "12:30pm -  I just had a very short-lived panic attack.  I thought that I had to be at work today, which is stupid because I know it's my day off.  It was really quite disturbing though.  It is hilarious to me how meticulous I'm being with my cleaning around the house.  I feel very torn between feeling perfectly contempt or intensely uneasy.  I'm going outside to smoke a cigarette.",
  "1:15pm  -  my energy level is still high and I'm still high.  I've heard this to be an effect of mucuna pruriens, I've been walking around with a boner but I'm not very 'in need' to do anything about it if you know what I mean. ",
  "2:00pm  -  After finishing my chores my energy level has dropped off.  I feel much more relaxed and kind of lazy.  My eyes are much more sensitive to light than normal.  While smoking a cigarette earlier I noticed my eyes felt like they had pressure on them. Not too uncomfortable but I have to go run errands here in a few minutes so I'll see once I'm out and about.",
  "4:00pm  -  After returning home I still feel like there is something in my system, again much like a cup of coffee.  I am very calm and my body feels warm and comfortable.",
  "5:00pm  -  I have come to the conclusion that it is time to go to the bar and have a couple pints.  I still feel different but in a good way.  I'm just in a better mood it seems but my vision is still very sensitive.",
  "conclusion:",
  "I did notice a head change with mucuna pruriens.  The effects are mild, much like drinking a cup of coffee or smoking a cigarette.  I did notice having random erections quite frequently.  My thoughts were all over the place.  Most of the time I would be extremely active but my mind would be in its own little day dream.  I would have to say that this would probably not get me messed up unless I took an ungodly amount of it and then I'm not sure how comfortable on the stomach that would be.  The only thing that concerns me is the anxiety that I experienced.  The whole anxiety lasted only 30min so I would use caution as I'm sure this might have had something to do with changing my dopamine levels.  I'm thinking about supplementing my diet with this as an alternative to coffee or tea.",
  "[Reported Dose: 'mucuna pruriens - aprox 1g l-dopa']"
 ],
 "erowid": {
  "id": "68140",
  "citation": " bob. \"Alternative to Coffee or Tea?: experience with Mucuna pruriens & Cannabis (ID 68140)\". Erowid.org. Jul 28, 2010. erowid.org/exp/68140",
  "substance": "Mucuna pruriens & Cannabis",
  "views": "10808"
 }
}
