{
 "id": 10930,
 "title": "Non-existent People",
 "date": {
  "submission": "2002-04-28T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Dr. Gonzo",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:30",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Ambien in itself is an extremely interesting drug and it usually takes 15-30 minutes to feel the effects. I had used Ambien on several previous occasions before deciding to combine it with cannabis.",
  "9:00 pm: I take 10 mg Ambien",
  "9:15 : Feeling slightly confused and euphoric",
  "9:30 : The effects of the ambien have fully manifested and it is hard to concentrate. I feel moderately drunk, my motor skills are inhibited and I lose my balance several times on my way to the bong. I proceed to smoke two bowls of marijuana.",
  "9:45 : I am completely zonked and I snap in and out of vivid dream- like states. I feel that I am not alone and that there are people talking to me. Ambien usually trips me out like that but the cannabis makes the hallucinations all the more real.",
  "10:15 : The Ambien effects are not as strong now but still definitely have a prescence.",
  "10:00 : At this time I am quite drowsy and lethargic. I think of going to bed but I forget to do so.",
  "10:45 : I can no longer stay awake and doze off.",
  "11:15 : I wake up dazed and confused feeling very drowsy but high.",
  "I decide to return to bed.",
  "In retrospect I found the trip very odd and interesting. The feeling of the presence of people was so real that i actually beleived that there were people around me, talking to me. Ambien, an extremely weird drug anyways, was intensified by the ganja.",
  "I enjoyed the experience and would do it again. For those who want to experience this combination i would recommend experimenting with ambien by itself first. Ambien, although odd as hell, is definitely worth a try."
 ],
 "erowid": {
  "id": "6816",
  "citation": " Dr. Gonzo. \"Non-existent People: experience with Zolpidem (Ambien) & Cannabis (ID 6816)\". Erowid.org. Apr 28, 2002. erowid.org/exp/6816",
  "substance": "Zolpidem (Ambien) & Cannabis",
  "views": "35875"
 }
}
