{
 "title": "Slightly Dreamy Head",
 "author": "Zara",
 "citation": " Zara. \"Slightly Dreamy Head: experience with Mushrooms (P. cyanescens) smoked (ID 10933)\". Erowid.org. Nov 30, 2001. erowid.org/exp/10933",
 "substance": "Mushrooms (P. cyanescens) smoked",
 "bodyweight": "155 lb",
 "report": "<p>Having read a variety of smoked psilocybian mushroom reports, some reporting mild, but noticeable effects while other report no effects at all...it seemed worth a try of my own. </p><p>Though I considered smoking from a water-filled bong (as I was somewhat concerned that the smoke would be harsh), I ended up going with a dry bong in order to avoid losing potency because of the water soluability of psilocybin and psilocin.  The bong was cleaned and a completely clean bowl and new screen were used to remove the possibility of contamination from previously smoked substances.</p><p>I would be smoking dried P. cyanescens, picked in the wild and well-identified.  The bulk of the weight was in caps, but both caps and stems were smoked.  P. cyanescens from the same location had been tested orally for several years in a row and had proven to be consistently medium strength...approximately equivalent (per mg weight) to average strength P. cubensis.</p><p>T+0  - 80 mg dried cyanescens crumbled into the bowl of the water-bong and</p><p>  smoked.  No effects noticed beyond what would be expected from</p><p>  inhaling the smoke from just about any plant material.  I'm not</p><p>  holding the smoke in for particularly long...perhaps 10 seconds for</p><p>   each hit.  The material produces quite a bit of smoke so that a</p><p>  single 80 mg cap takes several hits to smoke.</p><p>T+5  - 93 mg dried cyanescens smoked.  No effects noticed.</p><p>T+10 - 99 mg dried cyanescens smoked.  Very mild effects begin.</p><p>T+15 - Mild mental distraction, perhaps the equivalent of a single small</p><p>  hit of medium potency cannabis.  Very slight 'dizziness'.</p><p>T+20 - 104 mg dried cyanescens smoked.</p><p>T+30 - Effects quite mild, but pleasant.  No visuals. I find myself closing</p><p>   my eyes occasionally and moving my head around as I do when sensing</p><p>  the mild effects from many substances such as the onset of alcohol</p><p>  effects or the early effects from LSD or 2C-B.</p><p>  At this point I decided to move away from the water-bong, in case</p><p>   the water was acting as a filter for the psilocybin/psilocin which</p><p>   are both water soluable.</p><p>T+40 - 136 mg dried cyanescens smoked in a dry bong (water removed)</p><p>T+60 - (20 minutes after last smoke) Still feeling effects as though mildly</p><p>  high from a small amount of cannabis.  Mild but pleasant.  No</p><p>  visuals.</p><p>T+1:10 - Still experiencing a slight pleasant buzz.</p><p>T+1:25 - (40 minutes after last smoke) Effects are wearing down to minimal</p><p>  noticeable. </p><p>- - - - - - - -</p><p>In retrospect, it seemed that the dry-bong smoking was the best option.  It allowed the smoke to cool before hitting my lungs and seemed to produce the most prominent effects.  I tried a few hits from a pipe, but it was too harsh for me to want to continue with that method. </p><p>Smoking from a bong filled with water reduced the harshness significantly, but also seemed to decrease the effects.  As psilocybin and psylocin are both water soluable, this might account for the difference.</p><p>The smoke itself was about as harsh as average cannabis smoke.  One interesting difference was that while a harsh hit of cannabis smoke (one that nearly makes me cough) seems to get worse as I hold it in...the mushrooms smoke was harshest at the beginning and then quickly eased, making it quite easy to hold in for a while. </p><p>After 13 years of smoking cannabis, it has recently begun to produce more</p><p>stimulating, and slightly anxious effects for me much of the time.  For what it's worth, the mushrooms didn't produce this effect.  Otherwise, the effects were very similar to those of low dose cannabis.</p><p>It seemed that smoking a little every 5-10 minutes did work.  Effects from one smoke would begin to wear off and would pick back up (to the same relatively mild 'peak' level) with the next hit.  It appeared that effects from each smoke would last about 20 minutes then begin to wear down to mostly gone at 40 minutes.</p><p>As other have commented before me, this is certainly not an 'efficient' use of mushrooms.  But if you aren't worried about wasting material, I found this a quite pleasant, mild effect and will definitely consider doing it again when looking for a mild mood alterant (perhaps as a replacement for a beer or two or a hit of cannabis).</p>",
 "year": "2001",
 "id": "10933",
 "gender": "Female",
 "timestamp": "2001-11-30T08:00:00.000Z",
 "views": "87996",
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "smoked",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:05",
   "amount": "93 mg",
   "administration": "smoked",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:10",
   "amount": "99 mg",
   "administration": "smoked",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:20",
   "amount": "104 mg",
   "administration": "smoked",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:40",
   "amount": "136 mg",
   "administration": "smoked",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  }
 ]
}
