{
 "id": 10939,
 "title": "Flipping Out",
 "date": {
  "submission": "2011-08-17T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "warrior",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 hits",
   "administration": "inhaled",
   "substance": "Pharms - Albuterol"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "My experience was a crazy one especially because I didn't see it coming. I never knew before that albuterol can heighten the effects of THC in cannabis.",
  "The night started of awesome smoking some extremely good mids. They were dro seeds grown in some liguidy manure. They were the best mids I have ever had and I smoke only dro. Anyway while I was smoking I took maybe 1 all the way to 3 puffs during the rotation of a hooka. I was fine for a long time about 2 hours had gone by before I smoked 2 js and 1 blunt (not a cigarello a full blunt). This made me super stoned and about that time I think the albuterol started to react with the cannabis and made me start to trip. not like a mushroom trip but made me literally freak.",
  "My friend and I left our friends dorm to walk to ours which was just down the hall. when I got outside the door to walk, I felt a wierd rush go through me and it made me freak even more. Then I fainted and woke up a second later. Then I did it again and stayed down longer then got up and fell again. Then I finally got it together and was able to run to the dorm and get to the counter and prop myself up. I was breathing heavily and was sweating. I felt like I was having a seizure and was just flippin out.",
  "I finally settled down but was still messed up. I kept thinking that I was going to forget to breathe but never did. When I remember what I felt when I was fainting was that I felt like my soul was leaving my body and then when I woke up my soul was falling back in. It was crazy then after I settled down I felt like I was forgetting who I am and kept telling myself who I was in my head. Eventually I was able to completely settle and I went to sleep.",
  "It was single-handedly the craziest and scariest event in my life. I was so relieved when it subsided and I could control myself again. I suggest to never use albuterol with cannabis. This is nothing that anyone should want to go through."
 ],
 "erowid": {
  "id": "68206",
  "citation": " warrior. \"Flipping Out: experience with Albuterol and Cannabis (ID 68206)\". Erowid.org. Aug 17, 2011. erowid.org/exp/68206",
  "substance": "Albuterol and Cannabis",
  "views": "4673"
 }
}
