{
 "id": 10932,
 "title": "Not-so-Relaxin",
 "date": {
  "submission": "2009-07-09T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "oversoul",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "1600 mg",
   "administration": "oral",
   "substance": "Pharms - Metaxalone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am an experienced drug user having tried LSD, XTC, cocaine. speed, opiates, and various pharmaceuticals and herbal drugs.  I try not to take any one substance for a long period of time and I am interested in trying new chemicals to see what experiences are possible.",
  "I had tried one 800 mg tablet of metaxalone about a week earlier along with some Darvocet and tramadol and had a decent experience, but I wanted to see what kind of effect metaxalone would have on its own.  Metaxalone is a drug prescribed for musculoskeletal conditions and also has a sedative effect.  I have taken some other muscle relaxants before and I thought this drug might have similar effects. ",
  "I took two 800 mg tablets around 2:00 PM with a meal because I read that taking metaxalone with a meal high in fat would increase the concentrations in the blood.",
  "T+30 I could feel slightly off baseline, but not by much.  My palms were a little clammy and I was sweating slightly.",
  "T+1:00 I was feeling a little ill.  My stomach was upset and I was slightly dizzy.  I decided to lay down on the couch and try to relax a little.",
  "T+2:00 Feeling extremely nauseous and I was still sweating.  My pulse seemed a little high.  Right around this time I went to the bathroom and vomited for the first time.",
  "I felt really ill and continued to vomit and have diarrhea on and off about every 30 minutes for about the next 8 HOURS!  Then this slowed down to about every hour and  later to once every few hours. ",
  "I can't remember ever being this sick in my life.  I am 31 years old and the last time I remember throwing up was on my 21st birthday.  I felt like I was going to die and I could not even drink water or Gatorade without throwing up.  After calling in sick to work and only sleeping for a few minutes on and off through the night, I finally was able to hold down a diluted glass of Gatorade and a slice of apple at about 9:30 AM the next day.    ",
  "I would not recommend that anyone experiment with this drug above the recommend dosage and only when prescribed by your doctor.  It is nothing like other muscle relaxants.  This drug can be dangerous and there are really no good effects that I experienced.  Not worth the risk."
 ],
 "erowid": {
  "id": "68168",
  "citation": " oversoul. \"Not-so-Relaxin: experience with Metaxalone (Skelaxin) (ID 68168)\". Erowid.org. Jul 9, 2009. erowid.org/exp/68168",
  "substance": "Metaxalone (Skelaxin)",
  "views": "12110"
 }
}
