{
 "id": 10945,
 "title": "Long Term Changes from LSD",
 "date": {
  "submission": "2001-05-15T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Zbt.",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I know that many of you have read a lot of crap and propaganda about LSD, and I want you to know right off that I am NO EXPERT. I am just trying to tell you what I have experienced.",
  "Late last year, I think in september, I used LSD for the first, and as of now, the last time. I dropped one tab with a friend of mine (who had dropped before), around 3 PM, (my first mistake, it was to late in the day). We had smoked up first, so for a while I wasn't really sure if I was high or tripping... (I didn't know if it had kicked in yet). After a while though, like 45 minutes, it became apparent that I was. I started to get really anxious, and I started to feel very strange. I asked my friend how he was feeling, and he told me that it was kicking in for him to. I glanced over at a clock, it was around 4. For what seemed like three hours, we just sat there, laughing at things... the most normal things seemed to me like the strangest, and everything made me laugh. I looked over at the clock again... it had been like 2 minutes.",
  "My friend and I just kinda sat around in my basement laughing at stuff for like 4 hours... and then he went home, around 8.",
  "I assumed that once I was alone, it would be more fun, and that I would be able to really let loose. BIG MISTAKE. It was my first time tripping, as I noted above, and I didn't know what I was getting myself into. To make a long story short, my trip became the trip from hell, I was scared out of my mind. However, the trip itself is NOT the important part. The important part of what I have to say comes after the trip.",
  "Now before I continue I should mention that I am OCD, because that I think is relivent to what I am about to tell you.",
  "About two months after my trip... Yes, it took me that long to figure this out... I began to notice that things were different then before... only I had the hardest time remembering if they happened before the trip, (which I doubt now). I was still having visuals! (and I still to this day am having visuals) Lots of the effects NEVER wentaway.  Now I am not talking flashbacks, I am talking 24/7 from after my trip to present day. These effects are not as strong as on my trip, but they are apparent.",
  "I went to a doctor recently... a psychiatrist... (I cant spell for my life). She looked up in once of her books, and found some disorder... a VERY RARE occurance, of LSD users who apparently suffered similar side effects. She noted that people who already have disorders such as OCD or schizophrenia or other also, have a greatly increased risk... anyways thats what she told me.",
  "I dont know what this means, because I havn't learned all this crap that she has and maybe some of you have. All I know is that I tripped, and my trip never stopped. Maybe OCD contributed... I dont know for sure. However I havn't been able to find much about what I just told you about anywhere on the web, so I thought I would try and post it on Erowid and see if anything positive comes of it.",
  "I sincerely hope this helps somebody... in some way.",
  " - Zbt.",
  "[erowid note: It sounds like he's referring to Hallucinogen Persisting Perceptual Disorder an uncommon, but not unique, side effect in some people.  For more about HPPD, check out HPPD Online.]"
 ],
 "erowid": {
  "id": "6823",
  "citation": " Zbt.. \"Long Term Changes from LSD: experience with LSD (ID 6823)\". Erowid.org. May 15, 2001. erowid.org/exp/6823",
  "substance": "LSD",
  "views": "31064"
 }
}
