{
 "id": 10947,
 "title": "God Trip One",
 "date": {
  "submission": "2008-01-26T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "CannabisAbliss",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(capsule)"
  }
 ],
 "report": [
  "[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "OK This was the most intense trip I had ever had at the time.",
  "I took 8 ccc waited about an hour for it to kick in once I started feeling the effects I poped the 2ci, listened to NIN, its a great band. Well the song slipping away came on, this was the first time I had ever listened to it but it was great, it descibed my mood perfectly. During that song I was put into a trance and came out with a feeling that I was struck by lightning or struck by god. When I came to I thought I had been worshiping the devil. I had brought on the appocolypse. Life would never be the same.  I almost started crying but resisted the urge. I looked at my computer and saw the welcome screen so I thought I was in the new world. I saw my name on the screen so I was the creator, I was also the destroyer. I was shiva, the god of destruction and creation. Thoughts if being in hell crossed my mind, also thoughts of being in heven crossed my mind too. No I was in purgatory. At one point I thought I was enlightened. Maybe I really was. People were telling me that in enlightenment it made perfect sense, at the time and I beleived it.",
  "Well the night dragged on but after the trip I beleived that everybody had the potential to be a god."
 ],
 "erowid": {
  "id": "68236",
  "citation": " CannabisAbliss. \"God Trip One: experience with 2C-I and DXM (ID 68236)\". Erowid.org. Jan 26, 2008. erowid.org/exp/68236",
  "substance": "2C-I and DXM",
  "views": "6393"
 }
}
