{
 "id": 10953,
 "title": "Binge Nearly Kills Me",
 "date": {
  "submission": "2008-01-15T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Joe",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "3 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "liquid"
  }
 ],
 "report": [
  "[Erowid Note: No contact information was provided with this report, so we are unable to confirm it or follow up with the author. It is our policy to try to verify any life-endangering adverse reactions which people report, where possible. If the author reads this, please contact admin@erowid.org.]",
  "One large bottle of barefoot Merlot, three bass ales, three shots of Jameson, one shot of Jagermeister, one shot of goldschlager, put me in the ER for gastritis.  I was unconscious and vomiting for about 16 hours.  When I woke, I just could not stop vomiting and hiccuping.  I went to the ER eventually.  The doc told me I'd burned away the inner layer of my stomach.  I couldn't eat solid food for a week.  The hiccups left a sharp pain in my solar plexus every time I swallowed.",
  "After this experience my sleeping schedule reversed so that I was up all night and asleep during the day.  I ended up on Zoloft and mood stabilizers after this experience.  I took them for about a year while abstaining from alcohol.  They worked.",
  "I just got off the Zoloft recently and had my first drink in about a year.  I never drink more than one drink in one day now.  That is my new rule.  If I break it, I'm done.  I never want to go through that experience again.  I nearly died from that experience."
 ],
 "erowid": {
  "id": "68263",
  "citation": " Joe. \"Binge Nearly Kills Me: experience with Alcohol (ID 68263)\". Erowid.org. Jan 15, 2008. erowid.org/exp/68263",
  "substance": "Alcohol",
  "views": "5789"
 }
}
