{
 "title": "Very Strong Headache",
 "author": "pedro",
 "citation": " pedro. \"Very Strong Headache: experience with Cacti - T. peruvianus (ID 10967)\". Erowid.org. Nov 4, 2004. erowid.org/exp/10967",
 "substance": "Cacti - T. peruvianus",
 "bodyweight": "120 lb",
 "report": "<p>I ordered my cactus on the net and recieved it very rapidly. A friend came visit me few days after, and we decided to experience the san pedro cactus on a little island near Martinique in the caraib... The day before a fool moon we rent tow canoes and joined our desert island. We chose a beautiful beach and explored around there. When we felt ok and 'at home' we ingested the dried green tissue powdered before in a mixer. It was the beginning of the night...1 hour after we felt the first effects : internal dialogue, peripheral distortions, strange feellings...salivation for me,</p><p>1/4 later : yes the trip is right there, no doubt...</p><p>1/4 later : beginning to laugh and hallucinating really, visuals was strong like acid, but the feeling was like extasie...we was forced to get serious because laughing was too strong, we could not stop laughing and strongly halucinating during the 4 hours later.</p><p>5-6 hour after the ingestion,we felt a little headache ...</p><p>1 hour later the headache was very strong...</p><p>1 hour later I was very ill and the headache made me vomit..</p><p>We finally slept quite good and waked up not too bad.</p><p>back home we take a good shower and felt definitively ok.</p><p>I have to say that my friend and I, we smoke weed every day, and smoked during the trip. We really enjoyed the first part of the trip but do not understand what caused this severe headache. We are both experienced with acid, shrooms or x, but our best experience was with the san pedro except the price to pay... perhaps we took too much...so I will do it again but half the dose...</p>",
 "year": "2001",
 "id": "10967",
 "gender": "Male",
 "timestamp": "2004-11-04T08:00:00.000Z",
 "views": "7421",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "17.5 g",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "(ground / crushed)"
  }
 ]
}
