{
 "id": 1096,
 "title": "Start Early",
 "date": {
  "submission": "2002-03-13T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Efaq",
  "gender": "Male",
  "weight": 110
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  " We had only tried it at low doses (",
  "Around 7.30 PM we weighed up 200mgs of the white powder and split in five doses. We then chilled for 30 minutes and smoked a joint before we poured our doses into orange juice and drank at 8 PM quite exactly. We then started watching 'Timothy Learys Last Trip' on the TV and waited for the effects to come on.",
  "It all started after just 15-20 minutes with the feelings I was familiar with from our earlier low-dose experiments. Shivers, feeling cold and uncomfortable and some slightly 'speeded' feeling to it. 30-40 minutes after intake the AMT's empathogenic qualities were manifesting, we had a great time talking about memories, our lives and sharing thoughts.",
  "We didn't really think about that AMT takes it's good 5 hours to 'peak experience' so around 9 PM we started making plans for a field trip into the woods. So we prepared a joint and just enjoyed the effects...",
  "At 10.30 PM we realized that we wouldn't be going into any woods. The mild empathogenic buzz I knew from before had now transformed into a roaring inferno of euphoria with a mild psychedelic spark touching the soul, extensive sweating (the body temperature felt extremely high) and between the occasional words someone managed to get out just sighs of joy and big smiles. Though we were in no state of going outside now.",
  "Visuals where quite pronounced, the empathy was beyond any I had felt from MDMA before, but the sweating and light headache kept me from truly enjoying it as much as I wanted to. Time around here just disappeared and we all were in this state until around 3-4 AM (8-9 hours after intake!) when we finally could communicate with words again. So we decided to take the trip into the woods again. And managed to get out.",
  "So we got out, built a fire, smoked some cannabis and just talked about life and what we all had felt. When we got back to the apartment around 6 AM the effects from the AMT could still be felt without any doubts, but the headache and sweating was more apparent now, and me and a friend decided to go home to my place and try to get some sleep, this drug had really worn us out.",
  "So, once at home we got into bed, turned on some music, closed our eyes and watched the now quite weak visuals. And there we lay, unable to sleep until 10-11 AM when we finally fell asleep, the AMT was still doing it's stuff, but the body just was too exhausted to stay awake anymore.",
  "Waking up was terrible, I was still sweating, my pupils was huge and the headache was still there (more on an annoying level than crippling though), I couldn't sit still and I just felt generally bad. My body definitely disliked AMT. And the entire day was just composed of us watching K-Pax and whining about how bad we felt.",
  "One odd detail, smoking cannabis made the side effects worse, which was rather disappointing because we had prepared for some sort of hangover with loads of cannabis. But the day was just annoying and no fun at all, so we smoked anyway so we could get some sleep as soon as possible and just forget about the day, and it worked.",
  "So, all in all, you may want to start early if you're going to take AMT, preferably around 1-2 PM, cause it's a looong ride. For me, the best 5-6 hours of the effect seems to disappear in minutes, yet the last hours won't if I'm tired and want to sleep. And prepare for a long day after."
 ],
 "erowid": {
  "id": "13189",
  "citation": " Efaq. \"Start Early: experience with AMT & Cannabis (ID 13189)\". Erowid.org. Mar 13, 2002. erowid.org/exp/13189",
  "substance": "AMT & Cannabis",
  "views": "11852"
 }
}
