{
 "id": 10988,
 "title": "Treating Anxiety and Stress",
 "date": {
  "submission": "2012-01-27T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Midnight",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "900",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "St. John's Wort",
   "form": "daily"
  }
 ],
 "report": [
  "Having suffered from light to moderate (occasionally severe) anxiety and stress for nearly two years I ordered St. John's Wort 90 tablets online which I used daily (1-3 tablets) for about 5 weeks. Starting with 2 tablets the first week I didnt notice any effects so I upped the dose to 3 tablets (900mg, recommended maxdose) spread out under the day. This is when I started noticing a significant positive change in mood.",
  "First of all my anxiety was totally gone and I felt free for the first time in a long while. Second I felt extremely relaxed and I was able to take my time when doing things, something my chronic stress made impossible before. Because of my stress and anxiety I had been bothered by heart palpitations (feeling my heart beating strongly), these also disappeared and my pulse became calmer, so calm in fact that I sometimes worried my heart had stopped. I no longer felt my heart pounding like a hammer in my chest. (Blood pressure remained unchanged and normal as well as heartrate.) Another positive effect which I suspect was due to absence of stress and anxiety - a very noticeable increase in my ability to concentrate on one thing at a time.",
  "After about 2-3 weeks taking 3 tablets (300mg each) daily of St. John's Wort it was time to decrease dosage and stop taking it. Today it has been about 2 weeks since taking any and my anxiety/stress has returned, but not as strong as before. For me, this herb really had a positive effect reducing stress and anxiety as well as inducing a calm state of mind and general serenity. I think it worked for me because my anxiety/stress-problems were not severe to begin with. I highly recommend St. John's Wort."
 ],
 "erowid": {
  "id": "68431",
  "citation": " Midnight. \"Treating Anxiety and Stress: experience with St. John's Wort (extract) (ID 68431)\". Erowid.org. Jan 27, 2012. erowid.org/exp/68431",
  "substance": "St. John's Wort (extract)",
  "views": "6627"
 }
}
