{
 "id": 10983,
 "title": "More Interesting Than Anticipated",
 "date": {
  "submission": "2002-02-14T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Geek v1.2",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had read everything that I could find about 5-MEO-DiPT, which unfortunately wasn't much. However, all sources generally agreed that it was a mild trip with some visual distortions and strong aphrodisiac properties. I found the trip to be substantially, but not entirely, different.",
  "My friend and I dissolved 250 mg 5-MEO-DiPT in 250 ml filtered water. Then, we each measured out 12 mg and drank it. It tasted vile! My friend was on Paxil, as she has a prescription for it, and had eaten recently. I hadn't eaten for a few hours, and we had both been smoking pot all day. I had also taken aleve and advil earlier that day.",
  "As soon as I felt onset, I experienced a throbbing headache and painful nausea. I curled up on a couch as I felt a little floaty and saw mild visual distortions. I took two tylenols for the headache, and then went outside to smoke some pot, in hopes of making the nausea subside.",
  "The pot caused the trip to soar to the peak. My friend and I took a short walk over to a bench that lies under a tree near her house. I layed down and experienced some of the most intense visuals I've ever seen. It looked like I was in a painting; everything was abstract, yet we both agreed that everything was symmetrical. The places where light shone through the leaves of the trees started swirling around in a spiral. In fact, everything was swirling. I also experienced a constant rush that I can only liken to being on coke. However, I was totally clear-headed, and the only mindfuck I experienced was from the marijuana. This was interesting, but unenlightening. I wondered why everyone describes the drug as a potent aphrodisiac, because sex would have been an impossibility.",
  "We walked back to my friend's house to lay on her couches. The fluffiness felt really nice. After about an hour or two since I first peaked, the effects started to wear off. The intense hallucinations became distortions, and my back started to hurt, the way that LSD makes it. I felt incredibly horny and wanted to go home and masturbate, so I called a cab (no WAY was I driving!)",
  "We smoked some pot in her driveway as we waited for the cab to come. This kicked the trip up considerably and I started hallucinating again.",
  "By the time I got home, I was exhausted, but I experienced too much insomnia to sleep. Masturbation was fun, especially orgasm. After many hours, I finally fell asleep.",
  "The next day, I felt groggy, not radiant afterglow-y like after an LSD trip.",
  "It was an interesting and fun drug that I plan on doing again. However, LSD still reigns as my drug of choice."
 ],
 "erowid": {
  "id": "6840",
  "citation": " Geek v1.2. \"More Interesting Than Anticipated: experience with 5-MeO-DiPT & Cannabis (ID 6840)\". Erowid.org. Feb 14, 2002. erowid.org/exp/6840",
  "substance": "5-MeO-DiPT & Cannabis",
  "views": "8248"
 }
}
