{
 "id": 10985,
 "title": "A Hit From Holland",
 "date": {
  "submission": "2010-02-16T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Colors",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  },
  {
   "time": "3:45",
   "amount": "6 mg",
   "administration": "insufflated",
   "substance": "2C-E",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "[Erowid Note: This report is marked as an LSD report, but readers should be aware there are aspects of it that suggest the identification is speculative.] ",
  "I have had experiences with both substances seperately before attempting this combo. ",
  "setting: new year's eve around 5pm waiting for friends to come around.  my friend C had bought some tabs from an online source based in holland.  people said they were AMAZING and we were very excited as i had not tripped on lsd in a year. ",
  "start point: drop hits.  taste sort of bitter and if there could be a color association to the taste it would be purple.  the blotter art was Hoffman anniversary blotter.",
  "+30min - getting those jitters and putting back together my record player seems to be much more interesting than proposed",
  "+1:00h - starting to feel really high.  that really clear lsd high right before the visuals start to grab me.  I get in the car with C and we quickly drive to pick up a friend before things get out of hand. ",
  "+1:30h - everything has such a brilliant glow.  it is like a new lens of perception.  there is a new depth in the trees and the sky seems to be clearer than ever.  it is now snowing VERY HARD and the blizzard is illuminating as i am able to pick out every individual snowflake as it falls down to the ground. ",
  "+2:00h - calmly wait in the parking lot and i noticed that nothing has really gotten more intense than the lsd high an hour ago.  was that it?",
  "+3:00h - extremely frusterated as i tried to force the experience to come to light but it failed.  though everything seemed to have a very flowing liquidy feeling with the most minute visuals, i was still here and felt more sober than before taking the lsd",
  "+3:45h - out of frusteration, grab the 2c-e bag and weigh out about 6mg each to insuffilate to get quick effects.  nothing happens.",
  "+4:00h - i feel dull.  like my mind has been hit with a hammer or turned onto half capacity.  nothing feels alive.  it is almost my reality is dying or something is causing this neutrality of emotion and reaction.  the visuals are pathetic and no more than the ones produced by lsd alone. ",
  "+5:00h - we get to the party where everyone is drinking.  the carpet has very prominent fractal patterns but i still feel sober.  i guess this is what tripping forever would feel like with visuals and no mindfuck.  i communicate as if i am sober and no one has a clue that we are tripping.",
  "+5:30h - all visuals gone and i just feel a mild headspace that is rivaled by maybe a hit of marijuana. ",
  "throughout the night, everything died down",
  "+9:00h - laying in bed but as i stare out the window i am having intense visuals reminiscent of something out of the video game metroid prime.  all the branches on the trees are brilliant red and look metallic and futuristic looking.  even in the complete dark, the red color is very prominent and obvious in my field of vision.  really confused as i have seen no visuals for many hours and had no mental effects except the dullness after the 2c-e.",
  "+10:00h - finally fall asleep without any chemical aids",
  "The addition to the weak acid experience, the 2c-e seemed to provide nothing note worthy.  maybe the dosage was too small on both ends.  the experience was nearly dysphoric.  the 2c-e provided no additional psychedelic effects as 6mg alone normally does.  combination seems to not work well.  some have said that they force a mental leveling out which seemed to appear throughout my trip as I was nearly neutralized by the effects of the 2c-e after dosing on lsd."
 ],
 "erowid": {
  "id": "68412",
  "citation": " Colors. \"A Hit From Holland: experience with LSD & 2C-E (ID 68412)\". Erowid.org. Feb 16, 2010. erowid.org/exp/68412",
  "substance": "LSD & 2C-E",
  "views": "4778"
 }
}
