{
 "title": "Beware the Hangover",
 "author": "PacoLoco",
 "citation": " PacoLoco. \"Beware the Hangover: experience with Alcohol - Hard (ID 10992)\". Erowid.org. Mar 24, 2006. erowid.org/exp/10992",
 "substance": "Alcohol - Hard",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "6 shots",
   "oral",
   "Alcohol - Hard",
   "(liquid)"
  ]
 ],
 "report": "<p>Me and my friends went camping.  We figured to make it a little more comical we'd bring along a handle of Jack Daniel's.  So we get the fire roasting, and enjoy some hotdogs over the camp fire.  Then we break out the Jack.  I had never drank before.  So my friend said its pretty easy to mix with Cherry Coke.  So we proceded to do about a shot of Jack for ever 10 oz of Cherry Coke.  I drank 3 of those.  Each one had a little more alcohol in than the rest.  Then I took 2 straight shots, just for the experience.  So I figured about 6 drinks total.  This was over about a 2 hour time period, and with food in the stomach. </p><p>Now I felt weird.  I felt fuzzy, and just plain dumb.  It basically mimicked sleep deprivation I thought.  Just a plain careless, dumb, inhibiting feeling.  So we went to bed, and upon waking up I felt like crap.  I had about 20oz of water before I went to bed to make sure I wasn't so dehydrated.  I woke up with a weird headache.  Then I puked about 10 minutes later.  I figured whatever... just remnants left over I'll be fine.  So I take some water to get some fluid in my system.  I puked again.  I tried different things to make me stop puking but nothing would stop it.  I ended up puking about 6 times.  It was horrible.  I mean I barely had anything to drink based on the amount of time I took it in. </p><p>I don't plan on drinking anytime soon ever again.  I don't know what I did wrong, cause I've seen guys smaller than me do 6 shots within 15 minutes and wake up just fine.  I just figure maybe my hangovers will be really bad.  It was a horrible experience though, not something I would try again in the near future thats for sure.</p>",
 "year": "2001",
 "id": "10992",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-03-24T08:00:00.000Z",
 "views": "6835"
}
