{
 "title": "Hellish Nightmare",
 "author": "Scorpio",
 "citation": " Scorpio. \"Hellish Nightmare: experience with Caffeine (ID 11019)\". Erowid.org. Jun 19, 2007. erowid.org/exp/11019",
 "substance": "Caffeine",
 "bodyweight": "115 lb",
 "report": "<p>I've been smoking crystal meth since I was fifteen (I'm eighteen now)and whenever my friends and I couldn't get any of it we'd do whatever the hell else we could to lessen the cravings down. first choice was anything speedy... for instance, we'd crush up ecstasy and snort it just for the amphetamine effect... and last choice would be xanax or some other downer that would just knock us out so we wouldn't have to deal with ourselves being fiends.</p><p>Usually - - that is.</p><p>One night my friend(lets call him Shawn) and I were desperately trying to find tweak, and we couldn't, so we went down the list of drugs and couldn't hook up with anything to satisfy us. so we said fuck it, bit the bullet, and went and bought a bottle of No-Doz, which contain a bunch of 100mg. caffeine pills.</p><p>The instructions said to only take one pill, but us being crazy and not knowing a thing or two about caffeine content, we each took three.</p><p>We wait for an hour or so and feel nothing. We're impatient, so we each take three more.</p><p>11:45pm rolls around and we still haven't started feeling uppity and we took them about three hours earlier, and to make it worse it's time for me to go home. We're disappointed and I drop him off at his house, then I go home and pretty much instantly go to sleep. I wake up an hour or so later feeling like I was going to die. my eyeballs were shaking back and forth so much that I couldn't see straight and waves of nausea were hitting me so hard every moment. I started whimpering and thoughts were rushing so quickly through my head, but the only one that I could focus on long enough was to get to the bathroom and throw up.</p><p>I tried to stand up but I couldn't because my legs were shaking so hard, so I literally crawled across my room, through the door, across the hall and into the bathroom. I looked at myself in the mirror and saw that my eyes were HUGE and every time I tried to focus they would just shake more and more. I sat in front of the toilet and tried to make myself throw up but I couldn't; all I wanted to do was get the shit out of my system because I had never felt so awful before. I put my hand up to my face and splayed my fingers.. they were all shaking so much that I couldn't even keep a hold of anything, and getting to stop them from shaking was a joke. I was even hallucinating, and although I'm not one to turn down acid or shrooms, this was not enjoyable. I seriously thought that I was going to die and that it would never end.</p><p>Finally it settled down some and I was able to walk, so I got back into bed and fell asleep after a long time of staring up at the ceiling, for every time I tried to close my eyes they would instantly spring back open.</p><p>The next morning I was more burnt out than I've ever been. I called Shawn and as soon as I said 'hi', the next thing he said was 'Dude, I got two words for you... fuck No-Doz.'</p><p>Apparantly the same thing had happened to him overnight, but had been worse because he told me he took two more after I dropped him off.</p>",
 "year": "2000",
 "id": "11019",
 "gender": "Female",
 "timestamp": "2007-06-19T07:00:00.000Z",
 "views": "3347",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 }
}
