{
 "id": 1101,
 "title": "God, Put Your Pants Back On",
 "date": {
  "submission": "2004-12-15T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "waner",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "",
   "substance": ""
  }
 ],
 "report": [
  "It was a beautiful summer day.  I was camping with my best friend, J,  and we each dropped three hits of some pretty strong acid.  She was a much more experienced tripper;  I had only done it once before and only one hit.  However, it was such an enjoyable experience, I thought triple the acid, triple the fun. .  Wrong.  That way madness lies.",
  "The visuals were intense to say the least.  We spent the day hiking and tripping and having a hell of a good time.  We hiked down a long trail toward a waterfall.  The waterfall and the lake at the bottom were full of people, and it was the most beautiful sight I had ever seen.  There were people of all races and nationalities just being together in nature.  J and I made our way to the edge of the falls and met a couple there.  I remember J telling them that we had just gotten engaged (!?) and they congratulated us.  That was weird, but I just figured J was off in her own lala-land, and decided to file that information away for future digestion.",
  "Things started to get weird.  The visuals stopped.  Dead.  All the swirlies and tracers and fractals.  Gone.  Everything was silent except for a very low humming or buzzing sound that seemed to spring from the very fabric of the Universe.  The people were still there, but I barely noticed them.  They werent real anyway.  They were just a part of the fabric of reality that I had constructed to hide from myself the awful truth that I was, and always had been, God.   My entire past life, I now realized, was only a shadow, just a story that I had been playing out for eternity.  The job of God is lonely.  The sole being of the Universe has no one to talk to.",
  "I had no concept of the fact that I had done drugs.  I knew that I had been awakened to perform some task.  I then realized that I wasnt alone in the Universe.  I was only half, the other half was feminine.  I remember seeing her (not really seeing with my eyes, but with LSD goggles, I guess) standing above the waterfall.  She was old, terribly old, and brown.  I then knew what my job was, and how I played into the cosmic order.  My job was to die.",
  "I realized that it was the summer solstice (it was, actually) and it was time for the Earth to end the birth process and begin preparing for death to occur in the fall.  Energy flowed from Me that kept the plants and animals alive and the Sun warm.  On this day, I must shut down the flow of energy to keep the natural cycle of the world flowing.  To do this, I had to die.  I would be reborn again on the Winter solstice to bring life back, and then die again next summer.  This was the way it had always been.  I looked at Her (the old brown woman) and asked (not verbally, but I asked somehow) if it had to be this way.  Yes, it had to be. ",
  "Ok, so Im the dying God.  Birth and death.  She remains constant, the passive force, but I was the active force.  She never experiences great suffering, but never great joy either.  I am free to feel both.  I realized that my past life that I had constructed had been foolish.  There had been so much suffering.  Why do that when I could construct any reality I want.  I asked Her if I could enjoy this (my constructed reality) and she said (again, not in words) I dont care as long as the cycle continues. ",
  "Well, ok then.  I can do whatever I want.  I then realized how silly it was that I was wearing clothes.  Off with them, then (anyway, those other people around the pond arent real).  I can dance and sing and shout.  Naked.  In a public park.  Why not?",
  "A ranger, notified by some of the other pond people (maybe they were real after all), took offense at my joymaking and suggested that it would perhaps be a good idea to consider replacing my clothing.  I have no idea what time it was, but it was starting to get dark, so it had probably been six or seven hours since dropping the hits, and I guess I was coming down a little.  Anyway, I remembered that I had done drugs and had taken all my clothes off and scared the hell out of a bunch of people.  I didnt realize that the man was a park ranger.  I thought he was a cop coming to arrest me for killing J (!?).  Somehow, I had gotten it into my head that I had pushed her off a cliff during my stupor (I hadntshe had just wandered away somewhere).  Suddenly, my life was over.  I was going to jail for the rest of my life.  All my big dreams and plans.gone.  And my parents, god, I didnt want to think about them.  This was going to kill them. ",
  "The ranger escorted me up to the office (I was now properly clothed) and asked me if I was on drugs.  Yes, I said.  No point in lying, I cant make it any worse.  He asked if I was ok and if I needed to go to the hospital.  Shock.  So, I thought, maybe Im not being arrested!  Maybe I didnt kill her..I just didnt know. ",
  "Well, I eventually met back up with J (fully alive) and we made our way back to the campsite.  The ranger was a very cool person, and could have easily called the cops.  Lucky me.  Even though I didnt hurt J or myself or anyone else, I could have and I am very fortunate that I did not.",
  "Im not convinced that my experience was entirely a drug crazed hallucination.  I sometimes wonder if I didnt tap into something very deep on that summer solstice at the base of the waterfall.  Ill never know, because Ill never do acid again.  I tripped a few more times, and always came back to the God story.  Fortunately, I was able to keep enough of my sanity to not act out anymore.  Im just not the type that can handle it.  I see things that I dont want to see.",
  "As an end note, I was also on prozac at the time.  I wonder if this is what caused my incredibly unusual tripping behavior.  Considering how prozac affects the brain, I think it is very likely."
 ],
 "erowid": {
  "id": "13206",
  "citation": " waner. \"God, Put Your Pants Back On: experience with LSD & Fluoxetine (ID 13206)\". Erowid.org. Dec 15, 2004. erowid.org/exp/13206",
  "substance": "LSD & Fluoxetine",
  "views": "52282"
 }
}
