{
 "id": 11018,
 "title": "Appreciating the Benefits",
 "date": {
  "submission": "2008-11-06T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Mike",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(daily)"
  }
 ],
 "report": [
  "100 mg a night.",
  "You don't have to have an I.Q. of 140 to understand and appreciate the awareness of ones body.  In fact, an I.Q. of 140+ means nothing when it comes to adaptibility and survival skills of a human being.  It just looks good on paper and gives one an inflated sense of confidence; i.e. arrogance. ",
  "Some people may actually need this drug as I feel I am one of them.  If sharpened thought is given then one can deduce that all drugs in all forms are poisons.  Any drug taken WILL result in negative and positive affect.  One simply has to determine the worth of the positives.",
  "As far as I can remember, my life has been emersed in termoil.  I never felt mentally balanced and was prone to unwarented outbursts and psychotic episodes and became dependant on numerous illegal substances as a form of self-medication.  Recently I was diagnosed with post traumatic stress disorder, chronic depression, insomnia, and bipolar disorder and was prescribed Seroquel, among other drugs.  When first taking this drug I experienced extreme tiredness and dysphoria.  Overtime, however, I began to notice an increase in mental balance as I became used to it.  I was less proned to psychotic episodes and I began sleeping better along with less intense depression.  It seems that this drug detangled my speedy thoughts and allowed me think more clearly and efficiently.",
  "Recently, I ran out of my seroquell.  During one of the nights of the three day period without Seroquel, I calmly walked into the kitchen, grabbed a sharp knife and began to thoroughly carve my name into my arm; cutting was also something I was prone to do before diagnosed.  I refilled my prescription of course and since then have returned to normal.",
  "Now, I realize that there are many incompitant doctors out there who will give this drug like candy and I understand that the general public is being medicated to make us more docile.  I also realize that to some I am a violent insomniac psychopath.  But I WILL propose this:  be aware of yourself and if are constantly whining about your problems and boasting your intelligence, chances are you do not need this drug.  But if you are aware of yourself enough to realize that you have mentally debilitating problems, be scientific about it and give this drug a chance.  It may save your life."
 ],
 "erowid": {
  "id": "68622",
  "citation": " Mike. \"Appreciating the Benefits: experience with Quietiapine (seroquell) (ID 68622)\". Erowid.org. Nov 6, 2008. erowid.org/exp/68622",
  "substance": "Quietiapine (seroquell)",
  "views": "22445"
 }
}
