{
 "id": 11012,
 "title": "Look to 'La Luna'",
 "date": {
  "submission": "2001-05-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kevin S",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "9 buttons",
   "administration": "oral",
   "substance": "Peyote",
   "form": "(plant material)"
  }
 ],
 "report": [
  "For those of you out there who know of Jim Morrison and the Doors, and the magic they wove into their electrifying rock-poetry, perhaps some of you know of Jim's Peyote trip in the Deserts outside California...",
  "Seeing as how I have always been interested in Jim's life, and wondering how he lived and why he did the things he did...I decided what better way than to try to see what can be seen on the powers of Mescaline in its purest form: PEYOTE cactus.  So to make the long story short, i made some phone calls and obtained some peyote a few weeks later.",
  "So one night in my room, I decided to ingest the peyote, and yes it tastes foul.  After about two hours, i could clearly start seeing objects starting to change vividly in shape and color.  Now with LSD, usually the things you see are formed out of objects in your line of vision...with Peyote you see things, spirits, animals... everything the universe has to show us.  I wandered outside, and began to walk the dark streets of my neighborhood.  I could see in black and white, the forms of spirits who once lived on the land where I call home now.  They were so clear and real, and they knew I was there.  Somwe of these people looked as if they were startled that a living being was in their world, yet others seemed to understand that I just wanted to heal my mind, and learn whatever I could.",
  "At some point in my trip, I heard what sounded like the wind calling me... I turned around--directly into the face of an indian brave, feathers in hair and everything.  His lips moved, and so faintly I could hear the words...'look to la Luna..'  'look to la Luna'",
  "'LOOK TO THE MOON'  I realized that is what he was trying to tell me.  I looked around for the moon, only to see three moons in the sky, 1 blue 1 yellow, and 1 red as blood.  As i glanced at each moon, i felt a different sensation wash over me.  Blue:  calm, sereneity, and the sound of water washing up on sandbeds....Yellow: fear of the unknown, and what is to come in my future....  RED:  was the most disturbing.  As I looked to the Red moon, my vision suddenly just flew me into the moon, wghere I could see only red flame and hear unsettling sound from beyond my line of vision...  I suddenly felt the need to close my eyes, and when I did so, I saw a scenerio of myself struggling in water, seemingly like I was drowning?  As soon as I saw this, i was transorted back to the 'world' where there was now only one moon, and the feeling of many things around me at all times, even though I could no longer see them.  For hours I contemplated life, until the trip began to make me nauseous.  I vomited after about 12 hours into the trip. ",
  "By now, back in my house, i was still seeing wonderful colors, and feeling like something was watching me...  I felt the need to sleep.  And sleep i did after about two more intense hours.",
  "I have to say that after I woke up the next night, I felt so refreshed, like all my baggage had been lifted, and i also felt somehow like something serious was about to happen. ",
  "I am still waiting for a big event, that I know will happen, but Peyote did not reveal the time or place...so I will patiently wait, or perhaps, the secret will be revealed on my next journey to 'la Luna.'"
 ],
 "erowid": {
  "id": "6860",
  "citation": " Kevin S. \"Look to 'La Luna': experience with Peyote (ID 6860)\". Erowid.org. May 15, 2001. erowid.org/exp/6860",
  "substance": "Peyote",
  "views": "48210"
 }
}
