{
 "id": 11010,
 "title": "Euphoria, but No Pain Relief",
 "date": {
  "submission": "2008-05-01T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mr. D",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Tramadol",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Basically before my dealings with tramadol, I had done just about every other type of pill to get me high, and weed, including xanax, valium, tylenol 3 w/ codeine, codeine/promethazine liquid syrup, percocet, hydrocodone/promethazine liquid syrup, hydrocodone, a variety of muscle relaxers, neurontin, and twice oxy contin (within the last year or so I have done oxy contin at least 100 times, but not at the time that I began experimenting with tramadol), once morphine (just like with the oxy contin, I have done it at least 50 times now, but not back then), ecstasy, and even plenty of OTC products, and I am probably forgetting a lot of other drugs that I have done. I have chronic back pain and finally was given a prescription for Tramadol. Now, tramadol didn't do ANYTHING AT ALL to help my pain, but I did notice some other things that it did do, such as get me high.",
  "When I first began using, I would be able to get a very decent buzz at popping (orally) doses of only 100 mg (2 pills). Snorting tramadol isn't really worth it. Too much powder with undesirable effects. The only 'preparations' I would do with the tramadol is breaking each pill in half before swallowing them and then drinking plenty of water or gatorade with them. I would feel something very similar to a typical lower-dose opiate buzz but without the sedation. The buzzes are similar, but are far from identical. Rating the amount of euphoria on a scale of 1-10, so as to compare opiate buzzes, I will do several popular opiates, to give the reader a better understanding of the euphoria received from tramadol: Oxycontin- 10; Percocet-8; Hydrocodone-7.5; Tramadol-5.5.",
  "I was arrested for possession of controlled substances, and went through a diversion program where I had to complete 80 hours of community service. Every hour was spent under the influence of tramadol. The facility where I worked actually offered me a full time job because they said I was such a good worker. I definitely was not enthusiastic about that terrible job, but the tramadol made simple, boring tasks much more enjoyable.",
  "Some of the effects that I felt/feel while on tramadol include: euphoria, overall sense of well-being, relaxation, enjoying simple boring tasks, enjoying EVERYTHING much more than when sober, much more social. Like I said, very similar to its opiate cousins. It does not at all affect my ability to concentrate or focus on anything, so it is a good buzz to get me through a boring lecture (I am in college), or help me do my boring homework. I don't feel stupified (I don't think that's a word, but you get what I mean, basically confused, feeling dumb, with a cloudy mind/brain), or sedated at all. Just relaxed and happy. It also produces a nice, mild body high, as well as slight loss of inhibitions, and it slightly increases confidence.",
  "Now that I am basically an opiate addict (as I do oxy contin, morphine, or oxymorphone every single day) it takes me a MUCH larger dose of tramadol to feel any effects. In other words, my opiate tolerance has sky rocketed. I used to be able to take 100 mg of tramadol to get the desired effects, I now have to take at least 300 mg to feel even the slightest buzz. I used to be able to take 25 mg of hydrocodone to get quite high, I now have to take at least 100 mg to feel the slightest buzz, so now that is why I mostly do the 'harder' opiates, and just snort them. I will never shoot up."
 ],
 "erowid": {
  "id": "68594",
  "citation": " Mr. D. \"Euphoria, but No Pain Relief: experience with Tramadol (ID 68594)\". Erowid.org. May 1, 2008. erowid.org/exp/68594",
  "substance": "Tramadol",
  "views": "17021"
 }
}
