{
 "title": "I Love Everyone on Earth",
 "author": "Dr.Cough.Cough",
 "citation": " Dr.Cough.Cough. \"I Love Everyone on Earth: experience with MDMA (ID 11025)\". Erowid.org. Apr 27, 2007. erowid.org/exp/11025",
 "substance": "MDMA",
 "bodyweight": "200 lb",
 "report": "<p>Last Saturday, I was with three really good friends (two guys and a girl).  The girl (who had experience with MDMA) took two rolls (pure MDMA).  One of the guys and I each took one roll and the other guy was going to baby-sit for us because we decided doing something new would be bad without somebody around who was sober.  That guy and I walked downstairs to find a movie, and while he searched the drawers for The Yellow Submarine, I began to feel extremely happy, especially when I rubbed my arms together.  I couldn't help but rub every part of my body because it felt so awesome.</p><p>He turned around and saw that I was having a fun time, and he asked if I'd be okay to walk past his dad.  I totally knew I would be.  We didn't find the movie, but when we were on our way upstairs, his dad (a huge Tennessee fan) started talking to us about Tennessee's victory against Florida.  I usually don't care at all about football, but I was so happy that my friend's and his dad's favorite team beat a really tough team that I actually talked about it for a few minutes.</p><p>When we got upstairs, the other two were on the bed making out.  I felt so happy for them because I knew that they love each other and the guy has been my best friend since we were 3.  They saw me and spread they're arms out, inviting me to join them on the bed.  The three of us made a huge pretzel of people rubbing, biting, squeezing, kissing, etc.  Everything related to touch was extatic.</p><p>A few minutes later, I looked up and realized that the other guy had turned on a strobe light and was lighting some incense.  It smelled EXTREMELY good.  I jumped up and gave him a big hug and told him how glad I was that he could be with us.  By this time, the two love-birds had gotten up and were looking gleefully at us.  He thanked us for being able to do MDMA with him around because he wanted to know what it was like before he tried it.</p><p>At this point, I could feel love eminating from all of us.  I knew that it would be the best night of my life.  The guy who was sitting for us asked us what it was like and whether or not he'd be able to drive on it.  After explaining it to him, and assuring him that we would be perfectly alright to drive, we gave him a roll.  Then we left his house and went to a drive-through Christmas lights show at the Botanical Garden.\r[Erowid Note: Driving while intoxicated or rolling is dangerous and irresponsible because it endangers other people. Don't do it!]</p><p>We went to a store first to get candy and Vicks Vapo-Rub.  I went to the bathroom, and when I came out, he looked like a sad child.  I gave him a hug and he purred like a happy kitten.  We played around in the store for a while, enjoying the scented candles, fluffy teddy bears, etc.  Then we went to see the lights.</p><p>The Botanical Garden has such a beautiful lights show this year that we were all in awe of the amazing display around us.  The lights were so bright and pretty and warming.  We stopped to look at the several-hundred-year-old dogwood tree, and it reminded me so much of my grandfather that I almost cried.  That was when the guy driving and I started to reflect on things from the past.  I never knew that his mother died when he was young until then.  We exchanged all sorts of stories about happy things and sad things, family things and friend things.  It was as though we were sharing our lives with each other, bit by bit.</p><p>After we left the lights show, we went to a campsite at the top of a mountain and looked at the lights of the city below.  The two love-birds walked down the trail a little bit and had fun of some sort (I'm not sure what they did because I didn't want to sound nosey).  I felt really good for that guy because I knew that he was happy with the girl.  I was also glad that I had a chance to be alone with the other guy.</p><p>I became a Christian that night, talking to the guy who I had reflected with.  Standing at the top of the mountain, I heard God's voice through him, and I understood.  I had always known that my purpose in life is to make people happy, but I had never known why until then.  He told me how he used to feel that God shouldn't have put us here if he knew we would mess up his perfect world.  But then he told me that he now knows that God didn't put us here to mess up the world.  God put the world here because he loves us.  And God put Christ here so that we could love him back.</p><p>Immediately after this conversation, I knew exactly who it was that made me and why He made me the way He did.  I gave the guy another hug, but I couldn't really bring myself to say anything.  I wanted to tell him how much it meant to me that he shared Christ with me, but I didn't know how.</p><p>The other two came back up the trail, and we walked back to the van.  The girl took me to the side and told me how much I mean to my best friend, and how much he loves me.  I told her that she means a lot to him as well, and that he loves her too.  When we got to the car, I gave my friend a big hug and a kiss on the lips, tongue and all.  I'm not homosexual, but I didn't know of any other way to tell him that I love him and that he's the best friend ever.  He understood completely.</p><p>When we all departed, I felt so happy for all of us.  I went home and thought about all the people I love, and realized that the list included every person on the earth.  I tried to go to sleep, but I couldn't, even though I was tired.  I could only think of one thing to do: masturbate.  That usually helps me get to sleep.</p><p>Instead of turning on the computer and looking at porn, however, I sent out my emotions and ran through that list of people again.  I knew that the person I feel the most strongly for would come to my mind.  I was only a little surprized to see the sister of the guy I was reflecting with.  That was the best I've ever beat off in my life.</p><p>Then I went to sleep with some music on, and woke up several times in the night, each time feeling a surge in my sense of touch as I rearranged myself under the quilt that my mom made for me years ago.  Every time I touched that quilt, I knew exactly how much my mom loves me and how much I love her.  The next day, I felt like I was still rolling.  All day long, I was mellow, and every once in a while my senses would increase dramatically.  There wasn't as much of the sense of love, but I knew the love was still there between all of us.</p><p>Right now, it's been 46 hours since I went to sleep that night, and I still feel this way.  I am happy and even more mellow than I usually am.  I've always been a happy, mellow, loving person, but now all of that is enhanced tenfold.  I absolutely LOVE this drug.  I was so surprized that MDMA doesn't fuck me up like pot does.  Instead it enhances everything about me</p>",
 "year": "2001",
 "id": "11025",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-27T07:00:00.000Z",
 "views": "5806",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 }
}
