{
 "id": 11029,
 "title": "Really Good Haul this Year",
 "date": {
  "submission": "2011-11-27T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "ShroomaDoom",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cyanescens",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Before I tell the story of my trip, I guess ill have to give some background information.",
  "Picking",
  "Always being a great mushroom connoisseur (hallucinogenic and non) I have gathered a great deal of knowledge on the identification and picking of wild mushrooms, particularly the strain of Psilocybic mushroom know as Psilocybe Cyanescens, living in the Pacific Northwest. Now usually only picking enough mushrooms for my own recreational use, I generally only picked around 1 or 2 ounces at a time, which was usually all I could get because the patches that I frequented were well known and rather small. Generally, cyanescens that I picked were usually fairly small, averaging about 0.2 to 1 gram in weight dried (versus Psilocybe cubensis, which tend to grow much larger) with mature caps about  inch to 1 inch in diameter with long stems about 1  to 3 inches in length. Every once in a while there would be the occasional monster (basically anything weighing more than a gram). I also noticed that different batches would have different potencies. Sometimes an 8th would barely give me a body high, while other times I would trip balls from a very small amount. I have eaten many strains of mushrooms, in many different quantities, and also have taken a lot of acid (I have decided that I like mushrooms better because of the fact that they are completely natural, and because of the geographical convenience of my location for picking. I mean come on.",
  "They pop out of the ground in my back yard every year for Christs sake! How could I not love them!)? And yet none of my years of picking and experience frying could prepare me for the haul I made this fall.",
  "My main picking buddy, well call him Calvin were thoroughly excited for mushroom season this year. We frequented our patches to at the end of September hoping to see little caramel colored caps popping up, but it wasnt until well into October that we began to see anything growing. Calvin and another friend had had a little success in picking a few 8ths out of one of our patches, but I had yet to go picking. One day, after hearing news about a stupid friend of ours picking a bunch of babies out of a patch near Calvin's house by the roots, me and Calvin decided to go searching in an area we had heard about from a veteran mushroom picker.  He said that there was a pretty good patch in there and yet we had never been able to find anything at all. They area was completely covered in Scotch broom and was partially on my property. After ditching class, we smoked a j and made the trek back to my house. After about 2 hour of crawling through the bushes we had found a small pile of sticks with a small patch of juvenile cyanescens sprouting about it. Confident that we had found the patch our friend had told us about, we picked the mature caps (only about an 8th) and mad our way out of the Scotch broom forest. Calvin having to use the bathroom, ran ahead towards the house were as I, being thoroughly stoned, lagged behind and walked with my eyes to the ground. I was pretty pissed that I had skipped school and all a had to show for it were a couple of caps, barely enough to get one of us high. As I rounded the compost heap on the edge of my property something odd caught my eye. At first I thought that the backside of the heap was covered in large, dark caramel colored leaves, I almost dismissed it as just that and kept on walking but I stopped. The more I looked the more it looked like the compost heap was covered in large mushrooms. I walked over and stooped down for a better look. They were mushrooms! I examined one and it had all the characteristics of cyanescens, white stem, slimy cap, and bruising blue when pinched. Except one detail through me off. They were huge! Each cap was about the size of my palm and they covered an area of roughly 150 square feet! It was the largest patch that I had seen besides pictures on the internet. And I had never, not even on Google images, seen cyanescens that size. They were bigger than most cubensis grow. I didnt even know it was possible for Cyanescens to get that size. I called Calvin back and we hugged and danced and proceeded to pick all of the mushrooms. A quick survey of the area and we saw a whole load of baby mushrooms near by for us to pick in about a week.",
  "We immediately brought the mushrooms inside and called our friends Jack, Tavin and my girlfriend. Jack, brought his food dehydrator and we started to dry out about 2 ounces of the mushrooms. Then, I picked out the largest mushroom we picked, a monstrous mushroom with a cap as big as my hand with my fingers stretched out with a stem as thick as my thumb and handed it to Tavin.",
  "Eat it I said. We needed to test them on someone. I was confident that they were legitimate but I wanted to see him trip balls off of one mushroom.",
  "\tHe ate it after some debate. Since the mushroom was freshly picked it must have been really nasty.",
  "\tAfter we arranged the mushrooms in my room to dry in the usual fashion (laid out on paper towels with a fan blowing on it) Calvin, Tavin and James left. Later I would find out that Tavin, after eating that mushroom had freaked out, went home and had delusions that his mom was just a hallucination and ran around the house naked for the rest of the night.",
  "\t3 days later the mushrooms were completely dry. All 2 and a half pounds of them. I grabbed 3 large caps and a few small ones, I didnt weight them out, but Im guessing that they weighed about 5 or 6 grams. I wanted to trip hard. It was the first trip of the season. After school me and my friends all went down to another friends house to fry out. Little did I know that I was about to embark on the most intense trip id ever experienced with any drug. Including LSD.",
  "The Trip",
  "\tI ate the mushrooms at about 4 oclock. I had always enjoyed the taste of mushrooms. Most people dont like it but I love how they taste. Since I had eaten them on an empty stomach, I noticed an almost immediate change in perception, or maybe I was just tripping myself out. Anyways after about 30 minutes I was definitely starting to trip. At first I experienced tightness in my throat and a feeling of great anticipation and excitement. I noticed slight changes in my visual field. Lights were more bright and patterns on the carpet were flowing like rivers. After about 45 minutes I was starting to get kind of nervous. I remembered what had happened to Tavin and I had eaten more than twice a many mushrooms as he did. I tried to ignore the fear and enjoy the trip. And man was I tripping out. I spent a lot of time staring at a dresser in the living room. The handles on it were warping and changing. The Dali Salvador poster on the wall was getting really trippy. It was the one where his face is a clock and it looked like his whole face was sagging to the left and running down the wall. Some body shut the blinds and turned up the music. I had to sit down for a minute. I sat in a rolling chair and tried to calm my self down. I was having the most intense body high. And the music! I cant even remember what it was. Someone had put on some really psychedelic music and it was swirling all around my head. I closed my eyes for a moment and let it all soak in to me. I lost my train of thought and leaned back. I looked at the ceiling and I saw an amazing 3D fractal patter, it was multicolored and seamed to go on forever. I felt the music flood into me again and I felt a soaring feeling of delight. My soul was one with the music and I experienced a total loss of ego. I felt bare, human. I soared through the endless spiral that was the ceiling and let myself go. I became completely unaware of my surroundings and time. It seemed like days passed when really only minutes had passed. Suddenly my phone rang. It was about 6 pm and I was still coming up. I walked out side to answer the phone. It was my dad. He wanted me on the 7 oclock but home. Shit. What was I going to do? I started to panic! I contemplated explaining to him that I was frying balls and couldnt go home but that wouldnt fly. I resolved to just go home and hide in my room for the rest of the night. I could handle it. I went back inside and sat down on my chair. Calvins girlfriend was worried that I would have a bad trip and offered me words of comfort. She thought that I was worried but I had a strange feeling that everything would work out. At about 6:30 I peaked. I had never fried that hard before. It was like I was in another dimension. Colors were swirling. I felt like my mind was separated from my body. Like I was watching everything from a 3rd person point of view. It was dark then and someone turned the black light on. Except it wasnt a black light. It was more like a rainbow light. Everything was in a purple haze but the black light bright and colorful. It mesmerized me. I was lost again. I felt my mind leave my body as I floated into the light. The music became soft and I felt a feeling of strange wonder that I had never felt before. I felt this great connection between me and every other living thing on the planet. I saw myself not as a person, but as a being, a living being, identical to every other living being in the universe. And in that way I felt connected to all things.",
  "Back to reality. I forgot that I was going to have to take the bus. I had surely spent hours staring at the light. I looked at the clock. 6:35. weird. Only 5 minutes had gone by. I resolved to leave at 6:45, giving me plenty of time to catch the bus. I went to the bathroom; mushrooms always give me the shits. I spent some time looking at a sheet of toilet paper and decided to go have a smoke. My body was full of all theses weird sensations and I felt small and insignificant compared to the world. I felt as if I was in my own little bubble. At 6:40 I decided to leave. I didnt want to miss the buss and I wasnt sure I wouldnt get distracted on the way. I always hated going out on public while frying. Especially after dark. I always felt like people were looking at me. Like they know some how that I was really fucked up. About half way to the buss terminal I saw a whole bunch of cops waiting for me on the side walk! They were just standing there talking, but I was scared shitless. I contemplated going around the block to avoid them but then I might miss the buss. I decided to just keep walking, they couldnt prove anything. It seemed like forever but finally I was past them. In retrospect I guess that there was a police call to the apartment complex they were standing in front of but how was I supposed to know that at the time. I was tripping so hard by then I had absolutely no rational thought at all.",
  "I made it to the buss depot with about 7 minutes to spare. I was so thirsty! I went inside to have a drink from the fountain, and then went into the bathroom to check my pupils. Huge. There was absolutely no color in them. Just pupil. My dad was sure to know that I was incredibly fucked up on something.  I looked at the rest of me. My face started to kind of melt and I started to get lost in my reflection. Then thinking how odd I must have looked staring into the mirror in a public restroom. I quickly left. The bus still wasnt there. I sat down and had a cigarette. I was almost completely dark by then and they street lights were on casting everything into an orange glow. The buss arrived and I got onto it and sat in the very back, avoiding the buss drivers gaze as I got onto the buss. I looked out side and the trees started to swirl and the colors from the light started to blend with the leaves.",
  "The buss left and I looked around. Felt like I was in a space ship. The buss seemed shorter than it normally was and I felt rather conspicuous sitting there in the very back.",
  "I looked out the window into the blackness and wondered how I was going to know when to get off of the buss. The buss ride felt like it lasted 100 years and I freaked out a couple of times thinking I missed me stop when really I was only half the way there. Finally I made it to the stop. I got off of the bus. I was completely surrounded by darkness. I started to have some really trippy visuals in the darkness. I saw bright colors and swirling patterns. The trees loomed large on either side. It was about a mile walk to my house about half way there I kept seeing these lights in front of me. They were dazzling and multicolored. I followed them as the bobbed up and down and soon I was off of the road. Before I knew it I was in a wooded area, in complete darkness (the lights had disappeared) and I was frying so hard I didnt know what to do. I heard coyotes howling in the distance and I had no idea what to do. I felt a wave of terror wash over me and I fell to me knees. All the trees were moving and swaying. They kept bulging and sagging all around and they looked like they were shrinking around me and I felt as small as a bug. I had this feeling of impending doom and I knew that I was going to die. That coyotes were going to tear me apart, or the trees were going to suffocate me. I started to run in random directions. I would run one way and turn to see if coyotes were behind me and then I would run in the opposite direction. Then, when I was sure that I was done for I broke out of the bushes into my neighbors back yard. A wave of relief washed over me. I knew exactly where I was now. I lit up a smoke and walked the rest of the way home, though not without looking behind me ever so often.",
  "I finally made it home. It was 7:35 (it seemed a lot later than that) and I was frying harder then ever. I was sure that my dad would know. So when I walked into then house I went straight for the bathroom. My dad was watching TV and didnt even notice me come in. I lit a candle and turned the lights out (I felt safer in the dark) and ran a bath. I was sweaty from running in the woods and chilled form the cold. I sat in the bath tub and watched the flicker of the light. The water felt nice and warm around me. I stared around me. My bathroom looked a lot different while I was frying. I kept getting lost in the folds in the towels and I was particularly interested in the soap. It was so slippery! I laughed and started to have a good time again. The woods seemed far off and I was safe in my bathroom with the door locked. After a good soak I got out of the bath and dried off. I started to leave the bathroom but then I had this sudden realization that I couldnt go out. I felt like the bathroom was the only place that existed and if I opened the door there would be nothing outside. I was still having the colorful full blown hallucinations that I had never experienced before except on acid. Eventually after who knows how long I got up the courage to open the door. I ran from the bathroom to my bedroom and turned on the TV. I turned out the lights and crawled into bed and tried to watch.",
  "I never had realized how funny these shows on fox were. Hilarious. I couldnt help but burst out laughing!! The news came on (10:00 pm, I must have been in the bathroom for a long time) so I turned off the TV. 6 hours after eating the shrooms and I was still frying incredibly hard. I lit a candle because the darkness was to much to handle. I just laid there staring at the ceiling watching the patterns swirl in the semi darkness. I dont know if I fell asleep and was having a weird dream but I felt my self slowly leave my body. I was flying in the sky over the woods. The moon was out and I was beating feathered wings. I think that I was an owl but Im not sure. All I know is I was flying and I felt that same feeling as before that I was connected to all the living things on the planet. Beautiful music was playing in my head. All these different melodies were playing and I felt bliss wash over me. It was amazing. I felt my perspective shift and I became what I'm guessing was a tree. I felt immensely slow, and I could feel the nutrients and the water soaking into my rooms. I felt my leaves creating oxygen through photosynthesis and I felt the sun on my braches. It felt like nothing Ive ever felt before. It felt like I was breathing in and out at the same time through my whole body. Like I was shrinking and growing at the same time.",
  "After that things are kind of jumbled. I dont really remember what I did after that. The only thing I remember after returning to my body is for a while I swear I had the ability to think 2 thoughts at once.",
  "All of a sudden Im sober again. I must have fallen asleep at some point. I look at the clock and it says 2 in the morning. I was hella thirsty and I felt like someone had hit my brain was cramped (I have this suspicion I was partially from thinking 2 thoughts at once). I ate some crackers and passed out. I had a head ache for about a day and a half.",
  "That was definitely one of the most intense experiences I have ever had. I have never had visuals like that from mushrooms. I think that bigger mushrooms have a purer form of Psilocybin on them or something. Regardless those mushrooms were some of the most potent I have ever had in my life. Over all I think it was a good experience. Plus I made a fuck load of money. Over all I think I made a pretty good haul."
 ],
 "erowid": {
  "id": "68695",
  "citation": " ShroomaDoom. \"Really Good Haul this Year: experience with Mushrooms -  P. Cyanescens & Cannabis (ID 68695)\". Erowid.org. Nov 27, 2011. erowid.org/exp/68695",
  "substance": "Mushrooms -  P. Cyanescens & Cannabis",
  "views": "2096"
 }
}
