{
 "id": 11039,
 "title": "Post-Cannabis Dullness That Lasts All Day",
 "date": {
  "submission": "2002-05-23T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "eXisTenCe",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "One Saturday, my friend and I decided to try nutmeg, since I had a possible urine test to deal with soon, and we wanted to try something new and cheap. At 4pm, we ingested roughly 14g fresh ground nutmeg washed down with orange juice. We had no firm plans except to hang out and walk around town, basically just follow our noses. What follows is the effects I felt and experiences I had:",
  "6:00 pm -- threshhold effects, relaxing buzz, slight chill, mild headache",
  "6:30 -- dry eyes, mild drowsiness",
  "7:15 -- moderate headache, feeling somewhat stoned a la cannabis",
  "8:00 -- experienced music euphoria while listening to rave music, feeling moderately stoned, somewhat jittery/shivery",
  "8:15 -- We went outside to walk around. It was a chilly spring evening, but I felt extremely shivery, my jaws clenched to the point whee speech was dificult. I borrowed some long pants to keep from freezing to death. I was feeling quite stoned as well, like a hash buzz.",
  "9:15 -- I feel calmer now, tired/yawny, have the munchies",
  "9:45 -- Speech is noticeably difficult.",
  "10:00 -- A childhood school memory resurfaces quite vividly.",
  "10:30 -- I feel a strong bout of paranoia. In addition, a friend's dog was getting friendly with me and it was wigging me out!",
  "11:00 -- I feel a DXM-like disorientation, or maybe like a high dose of hash.",
  "11:30 -- By this time I'd had several 'micro-dreams' which were just really vivid daydreams with my eyes closed. They were pleasant yet mundane.",
  "12:00 -- First visual effects start now. An oriental rug 'breathed' like a threshhold LSD/shroom effect. I also feel what I would call a drowsy acid buzz. My nutmegging friend says everything looks like a model of the real thing.",
  "1:15 -- Visuals become more noticeable, although still not very strong. Interesting patterns and color changes occur in a brightly colored shag carpet. Closed-eye visuals are complex, but low-contrast.",
  "2:00 -- We play with BWGen, a brainwave generation program, which seemed to increase psychedelic activity.",
  "2:30 -- I doze off to sleep, wake up at 7 am briefly, wake up for good at 10. I still feel a residual stoning effect, which lasted all day. Imagine a post-cannabis dullness that lasts all day. I developed a craving for high-fat/high-sugar foods, which I ate even if I wasn't hungry. After 36 hours, I was pretty much back to normal, if a little lethargic.",
  "I'd say it was a successful experience. Would I repeat it again? Possibly. For a psychedelic experience, it was shallow and weak without insight. As recreation, it was kinda fun, but the side effects last well into next day.",
  "If a legal high at $1/dose intrigues you, go for it. Just be sure to budget two full days."
 ],
 "erowid": {
  "id": "6876",
  "citation": " eXisTenCe. \"Post-Cannabis Dullness That Lasts All Day: experience with Nutmeg (ID 6876)\". Erowid.org. May 23, 2002. erowid.org/exp/6876",
  "substance": "Nutmeg",
  "views": "16293"
 }
}
