{
 "id": 11033,
 "title": "Finding Some Peace in the Middle East",
 "date": {
  "submission": "2010-01-08T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Dr. J",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 leaves",
   "administration": "oral",
   "substance": "Catha edulis",
   "form": "(tea)"
  }
 ],
 "report": [
  "<p>Khat is grown locally mostly among hippies and horticulturalists in the rural parts of Israel. It is not considered a mainstream drug by any measure, though it plays a significant role in the culture of the local Yemenite Jewish population. In fact the government here condones its use for religious purposes and therefore it can be used by just about anyone toting their religious freedom. Khat grows by itself basically given the lack of rainfall and the sandy soil.",
  "My friend grows around 50 plants in his garden and brings me a few bushels every time he comes to visit. I used to chew it as others here testify to have tried, but lately I have found it much more pleasurable to make a tea from it. Khat tea has a wonderful smoky, delicate flavor as well as an aroma that literally fills the room like incense. Although I haven't tried boiling khat for extended periods of time, as others have done, I find myself enjoying its effects after boiling it for only several minutes. I only use the baby leaves, the softest ones at the end of the stem. They may have a slight reddish color to them as well. The rest of the leaves were discarded.",
  "As far as my experience goes, after drinking my tea made from twenty or so leaves, I began to feel light and giddy after only 10 minutes. I was alone at the time, but there was certainly a feeling of tunnel vision, and an attention to what was straight in front of me, and a blurring of the surroundings. It lasted only about an hour but thats probably because I didn't boil the tea for a long enough time. I will try it for longer and see what happens. My only concern with boiling is that I destroy the active ingredients in the process. I don't know how heat stabile these compounds are.",
  "I really enjoy this psychoactive plant either chewed or brewed. Its a win-win situation. Its not really a going out type of drug if you ask me. I see it more as a ritual between friends that is used to stimulate conversation and heighten awareness.</p>"
 ],
 "erowid": {
  "id": "68703",
  "citation": " Dr. J. \"Finding Some Peace in the Middle East: experience with Catha edulis (Khat) (ID 68703)\". Erowid.org. Jan 8, 2010. erowid.org/exp/68703",
  "substance": "Catha edulis (Khat)",
  "views": "6759"
 }
}
