{
 "id": 11041,
 "title": "Water Extraction Version 1.0.0",
 "date": {
  "submission": "2008-02-19T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Khorbis",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "substance": "H.B. Woodrose",
   "form": "extract"
  }
 ],
 "report": [
  "Woodrose Extraction Version 1.0.0",
  "1. Grind HBW seeds (for more potency, try the Madagascar variety) to a fine powder based on preferred dosage (~5-12 seeds common, varies per individual) Adding a few addition seeds than your usual dose is recommended since some potency WILL be lost in the process.",
  "*Some have mentioned that scraping the seeds will reduce nausea, but there is absolutely NO scientific evidence to support that conjecture. Do it if you wish, but it is time consuming and, most likely, pointless*",
  "2. Open a tea bag (store bought is fine) CAREFULLY and add ground HBW powder along with 1 gram of fresh grated ginger and/or mint leaves (optional, but medically proven to reduce nausea), re-staple bag, shake to mix, set aside.",
  "3. Obtain a sizable mason jar (or any jar with a tight lid)",
  "4. Fill jar with a quantity of COLD de-ionized (aka distilled or doubled distilled) water (~ 1 oz./5 HWB)",
  "5. Dissolve a small amount of tartaric acid powder (available online, though cream of tartar will work in a pinch, albeit weakly) in the water (~1 mg. of acid / seed)",
  "*Alternatively, in lieu of using distilled water and tartaric acid powder, white wine can be used because it already contains the necessary tartaric acid. In addition, the LSAs in HBW are more soluble in alcohol* ",
  "6. Place tea bag(s) in jar, secure lid, and place in a brown paper bag (to reduce exposure to LSA-destroying sunlight and heat). Shake well.",
  "7. Place jar in refrigerator and leave for 12-24 hours (no longer than 24 to avoid mold/bacteria). Shake as often as you can/want, the more the better.",
  "*For those of you who cant be bothered with shaking, I find that placing a cheap, CLEAN waterproof ladys vibrator in the jar works as an extremely effective gyrator* ",
  "8. After time has elapsed, remove the teabag (and vibrator if usedduh) and squeeze excess juice into jar, discarding teabag afterwards.",
  "9. At this point, your concoction is ready for consumption. If you are still worried about nausea, chew on an additional piece of fresh ginger, some mint leaves, or you could take some OTC Dramamine, Bismuth, Meclizine,  Posphorylated carbohydrate solution, or Promethazine if you can get it (prescription Rx). Taking on an empty (or near empty) stomach is usually helpful also. If you are worried about taste, adding sugar, honey, or other sweeteners will not affect potency.",
  "I suggest 5-12 seeds per person, based on weight, age, tolerance, mindset, etc."
 ],
 "erowid": {
  "id": "68767",
  "citation": " Khorbis. \"Water Extraction Version 1.0.0: experience with H.B. Woodrose (ID 68767)\". Erowid.org. Feb 19, 2008. erowid.org/exp/68767",
  "substance": "H.B. Woodrose",
  "views": "19358"
 }
}
