{
 "title": "Releasing a Soul Into the Rainbow Dome",
 "author": "Zen",
 "citation": " Zen. \"Releasing a Soul Into the Rainbow Dome: experience with LSD (ID 1104)\". Erowid.org. Jun 22, 2000. erowid.org/exp/1104",
 "substance": "LSD",
 "bodyweight": "125 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>1995 was the year of acid for me, a doorway into places i am certain i dreamt about in my childhood, crystal dimensions, where i could taste colors and touch sounds and smells  with my hands from the very first trip on, i felt great amounts inhibitions and unresolved issues from my shitty  past leaving me,literally'enlightening' me. i was like a snake shedding skin and slithering into a newer safer place. i stopped being afraid of who i had become. in August i had my most important trip yet. a few weeks after my 18th birthday, my then-boyfriend, D, another friend, G, and Buddha Ben (D's brother) decided we would 'visit other galaxies'. it was Buddha Ben's first trip, so we were excited about the initiation, as we always had an amazing time on acid, even all by ourselves.</p><p>it was a breathtakingly perfect Wednesday night, and already the night was charged with a full moon under the cool jewelled Southern skies.we were set!! we popped a tab each in the evening,and proceeded to have dinner', perched in front of the tube, of course, a hilariously complex fiasco. i had forgotten how to handle cutlery. i stared to tingle a little,then the chicken on my plate was acting up!i had vivid impressions it would start tweaking on the plate and bleeding a la Lynch's 'Eraserhead'. I regarded this vision with much morbid curiousity. next to me, G was staring at D's mom who was eating away with extreme Fascination! i looked to see if anyone else's trip had kicked in and the look on their faces gave it away! I could've sworn G mouthed 'i'm on fire!' (later he claimed it was 'Good UK shit'.no connection whatsoever!!) Eyescheck?? they were glazed and ready to roll! we grinned at each other, a secret code. D's mom looked at us strangely,and sort of yelled that none of us had touched dinner. she became fuzzy,mouth open and shutting, volume fading --i had muted my boyfriend's mom at last, i thought triumphantly! suddenly,i pointed out that we were watching the ballet on TV; the male ballerinas started flying across the screen , lilac tights over monstrous bulges.we collapsed into uncontrollable laughter, which set me flying!! D's mom caught on finally. Sensing a vile nagging , we took off into the night, taking with us the usually  extremely-calm Buddha Ben(hence the name), who was starting to take on a maniacal look in his face, as he hummed the 'wizard of Oz' song. walking into the hills ,we suddenly stumbled upon a poster for a lost gala in the dirt road, which appealed to G and became G's 'quest' for the night. I started to have 'trails' now, and as D skipped around, he morphed into a human slinky before me.</p><p>we walked aimlessly, searching for the Wizard of Oz and a lost gala (reward:200 dollars,we agreed would be spent on more acid, naturally). i settled into the moment with a sigh...the world became butter smooth.i began to sense the onset of my peak and within minute, i began detaching myself from my body. during the odd reality  i was amazed that we were even walking, it seemed surreal!!</p><p>The temperature dropped sharply and the night turned frosty, the fog trailing all around us in pastels. i stopped breathing for a while so i wouldn't shatter this moment of intense beauty. suddenly, my boyfriend and i mysteriously found ourselves alone! G and BB had stumbled off somewhere in my brief moment of reverence.</p><p>D and I walked to a huge oval field, surrounded by a dense forest of eucalyptus on one side i noticed was breathing softly..there was an electric stillness in the area. I could not register the cold in my body though mentally i KNEW it was freezing!! D and I looked at each other in frozen silence, reading each other's minds. BANG!from this point on, we felt our experience becoming one and the same!</p><p>It hit us at once. Naturally,we both had a quest too.I had lost my pregnancy two weeks ago, and today's purpose was to let go. we approached this seemingly dreary mission  with intense peace and love. Looking up, I saw an overpoweringly large dome of rainbow criss-crossing and enveloping us.. From  the middle of the field, a silver chord leading into the eternal nightsky. i fell in and out of sounds and sights,at some point i had a conversation with the child i had lost, voices whispered from beyond the sphere; it was so sad and elating at the same time. throughout this 'ceremony', D watched me, sitting on the wet grass, nodding occasionally each time a peaceful thought crossed my mind and spoke to me. at this point, time had distorted severely for us, seconds stretching into hours and hours of conversations with the Universe.</p><p>to date, this is the most intense encounter i have EVER had on acid!!!a real rush, not unlike large doses of speed..after i felt totally cleansed, we walked the streets and into a 24-hour gas station, where we met some old friends. I felt like 5 years old and noted i could see AURAS around everyone!!!I paid for a fizzy dizzy Coke and told the gas attendent, with a huge hug, things will be ok!! (i saw so much RED around him.) he looked at me all puzzled for a few seconds(??!) then  broke into a smile and said thanks.</p><p>we glided on  home, agreeing we were both coming down now. when we got there, BB and G were sitting on the caravan roof with beers,in hysterics and howling at the moon. As we sat down and smoked a fat joint, they told us they had gatecrashed some teenybopper party in the next suburb and had a brilliant time dancing and 'laughing their bloody arses off!!!', (even though they didn't get laid!, BB added). we sat there for an hour or so, coming down to Pink Floyd playing from the elderly neighbor's house(which was highly odd since that was a strictly Elvis zone!).</p><p>the cold finally hitting, D and I went into his room,and switched on the radio. some Balinese music was playing. The joint must've set us off because the woodchimes sent colours across the room back and forth. we launched into a lets-pretend-it's-the-doorbell game, sending us into hysterics through an hour long tune. under the covers, to celebrate our 'letting go', we had very emotional, yet detached 'can't feel my dick' sex. I never felt closer, yet never felt further apart from D. throughout sex, I smelt sandalwood all over the place, on our bodies, in the music.. Later,i lay awake for an hour with another joint,trying to join D in sleep. Instead, the sun started to set behind a black cat in a poster on the wall! i closed my eyes briefly, a pleasant shock as i thought the acid had worn off. Obviously not. I spiralled into a rapidly morphing, technicolor world, flowers exploding into colours exploding into spirals and cuboids..infinite images evolving and taking over.I allowed myself to fall into the endless impressions-SUUUUuuuuccCCK!-- eventually 'yen' sleep took over my exhausted mind, a delicious smile fixed on my face.</p><p>",
 "year": "1995",
 "id": "1104",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-06-22T07:00:00.000Z",
 "views": "23524"
}
