{
 "id": 11059,
 "title": "Tingly Vibrations",
 "date": {
  "submission": "2010-01-06T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Qualityplant",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400",
    "grams": 0.4
   },
   "administration": "smoked",
   "substance": "Heroin",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "So I was in the pub on a Sunday evening and talk turned to Brown or street Heroin. I'd never tried it but my friend had. I wasn't sure. I'd done a lot of drugs including hard ones like crack before but I had never done heroin. In fact I had been looking for something to ease my cocaine-induced weekend comedowns. I'd tried to find something less strong but opium is impossible to locate in London if you're not Arabic and I wasn't about to hold-up a chemist. So we drove over to the next town to meet the guys who knew how to get some. We picked up 3g between 4 of us from a skinny guy with sunken eyes and hard-man haircut. We waited in a short time before returning elated to my friend's flat.",
  "I sat down and placed about 0.4 of a gram on foil, lit a lighter and held it underneath until the powder had liquefied into a thin, treacle-like substance on the foil. I folded a groove into the foil so when the material melted it would run down the bend, cool and solidify ready to be heated up for a second hit. So I heated the treacle-like substance by holding the lighter under the foil. It liquefied instantly and started to smoke. I sucked it in with a foil tube that I held between my lips.",
  "I felt the first effects immediately, a little stoned, rather like smoking a lot of hash all at once. I fired up the lighter again and sucked in twice as much. Then I relaxed... I started to become giggly and chatty, laughing my inhibitions away. The feeling in my head was wonderful like my mind had been wrapped in a warm fluffy towel that vibrated; every tingly vibration reverberated down into the roots of my brain. I wondered if I had fallen in love. The main euphoria lasted about half an hour after inhaling. So every now and then I would have another hit to top up and kept on doing so until I had consumed the 0.4g.",
  "Once the euphoria had drifted away I felt very tired, I was falling asleep with my eyes open. I was less chatty now and felt irritable like I always do when I'm tired. After an hour after my last hit I felt very itchy and nauseous, I had trouble urinating and felt generally unwell. This feeling continued unabated until I went to bed 2 hours later. I didn't sleep so much as become very immobile for a number of hours; I kept waking in the night and felt very groggy and unwell for most of the next morning.",
  "My over-all impression of Brown? The bad effects were awful, it made me feel very ill. Surely that must be my body telling me to stay well away from this stuff. I will heed its warning certainly, but I keep wondering what I will do with the 0.6g I still have left..."
 ],
 "erowid": {
  "id": "68860",
  "citation": " Qualityplant. \"Tingly Vibrations: experience with Heroin (ID 68860)\". Erowid.org. Jan 6, 2010. erowid.org/exp/68860",
  "substance": "Heroin",
  "views": "20273"
 }
}
