{
 "title": "Best Medicine for Opiate Withdrawals",
 "author": "Jani",
 "citation": " Jani. \"Best Medicine for Opiate Withdrawals: experience with DXM (ID 11056)\". Erowid.org. Aug 28, 2007. erowid.org/exp/11056",
 "substance": "DXM",
 "bodyweight": "70 kg",
 "header": [
  [
   "DOSE:",
   "300 mg",
   "oral",
   "DXM",
   "(daily)"
  ]
 ],
 "report": "<p>I had physical opiate addiction for six years. Now I have been without opiates and other addictive substances for four months (not counting caffeine and nicotine), thanks for dextromethorphan. There are few medicines that helps in opiate withdrawal. Bentsodiazepines and barbiturates are good for muscle pain, cold sweat and other physical symptoms but they don't help much for craving for opiates and they are too addictive to be taken for two weeks on large doses. Fortunately I find dxm. There is no drug that helps so greatly on withdrawal. On doses 300 mg twice a day for first week and 300 mg daily for second week I managed to stop abusing PO opium without severe symptoms and with same dosing IV use of buprenorphine 4 mg/day is almost too easy to stop. For years of suffering, trying to withdraw, relapsing, cold sweat, pain and desperation. And there has been whole time a relatively easy solution. Dxm causes some withdrawal symptoms but they are nothing compared to opiate withdrawal and those are easy to combat with good hashish and valium twice a day for less than week.</p><p>Typical withdrawal day begans with awakening to nightmare. Pain in muscles and joints, cold, shaking, sweat and extreme yawning not to mention craving for anything that helps. Then I gulp down 100 ml 3 mg/ml cough syrup. It tastes absolutely awful but is worth suffering. I lay back trying not to throw up and start moving my legs to find less painfull position for them. After half an hour it is possible to keep them still and on one hour mark it is possible to lit cigarette, smoke some hashish and eat. No much pain left, only some yawning. And most amazingly I can feel almost warm. Effect lasts from few hours to over 12 hours depending on opiate and dxm tolerance.</p><p>It is interesting that when I am physically dependent of opiates there is not much 'psychedelic' properties in dxm but after couple of weeks same dose that before only cured withdrawal symptoms making it possible to go buy some food (not to mention more cough syrup) makes it impossible to leave house.</p><p>When planning to withdraw from opiates with dxm one must be extremely careful. It's not for everyone. I can handle it, I have survived it and now I am clean but it is only my subjective point of view. There may be risk of convulsion, insanity and even death. I don't know enough. Maybe no one knows. Before starting to even consider possibility of home made detox with dxm, study some neuropharmacology, read about Olney's lesions and reconsider. I remember to stop using dxm after two to three weeks, it easy to get hooked to that stuff (psychologically, maybe physically).</p><p>Now I know it. There is life after opiates. At first life is hard and empty but it gets easier each day. Now I can visit my friends, watch them inject opiates not wanting a little bit that shit feeling only sad for them not realising that it is possible to break free from chemical slavery and get your life back.</p><p>Thats it. Be careful, consider, get information, reconsider and seek better ways to exist. And don't forget to feel empathy.</p>",
 "year": "2001",
 "id": "11056",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-08-28T07:00:00.000Z",
 "views": "57509",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(daily)"
  }
 ]
}
