{
 "id": 11060,
 "title": "Something Present",
 "date": {
  "submission": "2001-05-16T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "EuFiHel",
  "gender": "Male",
  "weight": 74
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "After various projects of mine, I decided to try 5-MeO-DMT. My friend had it, and being a scientific guy, he didn't want any money for it. Which is the way I prefer to do research with all these chemicals.",
  "Anyways. I read some reports from the Net and TiHKAL before the experience, and was expecting more or less intense experience filled with colors and feeling of being lost inside my own mind. That's was exactly what I got. Starting with a dose of about 10 mg, I didn't feel anything. Just a bit light-headed and nothing special. When gradually going up to doses up of 25 mg (and 50 mg total) I noticed the very intense feeling of being lost. My mind produced lots of visuals filled with white textures and the music that I was listening at the moment (Koneveljet/Exogenic Records), also went thru some minor changes.",
  "All and all, I must say that the substance certainly doesn't provide me anything 'psychedelic' in the true meaning of the word. The intensity is great, but when it is compared to, for example, a 12 hour technicolor dream with LSD, it isn't much (although, the intensity is MUCH greater). The thing that astounded me in this substance, was the rate that it produced",
  "the effects. For me, the onset was something like 5 seconds. In that time, my mind didn't really know what else to do than just jump to the back of my head and see what was to come. But if you sometime need to pinpoint yourself from the part of the Universe you're at, this is the substance that gives you a glance of that source code, that we are made of."
 ],
 "erowid": {
  "id": "6887",
  "citation": " EuFiHel. \"Something Present: experience with 5-MeO-DMT (ID 6887)\". Erowid.org. May 16, 2001. erowid.org/exp/6887",
  "substance": "5-MeO-DMT",
  "views": "7578"
 }
}
