{
 "id": 11070,
 "title": "Moderation and Manual Labor",
 "date": {
  "submission": "2008-06-02T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Maturin",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.66",
    "quantity": "1.66"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "ground/crushed"
  },
  {
   "time": "2:30",
   "amount": {
    "unit": "g",
    "grams": "1.66",
    "quantity": "1.66"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "ground/crushed"
  },
  {
   "time": "5:30",
   "amount": {
    "unit": "g",
    "grams": "1.66",
    "quantity": "1.66"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "In the summer of 2007, I took on a pick-and-pack job at a local warehouse. The pay was exceptional, but I found I was averaging sixty hours of work per week, pulling ten and twelve-hour days full of heavy lifting and constant motion. I would return home from these outings completely exhausted and washed-out, unable to muster the energy to do much of anything except eat and go to bed. I can remember reading an article in some magazine or another at the time, which suggested that modern history was mistaken about the Egyptians using slaves to build the pyramids. The article concluded that the ancient Egyptians had most likely hired huge numbers of unskilled laborers who, since they were voluntarily working and being paid, worked far harder and longer than any slaves would have done. This should give an idea of where my head was at.",
  "About a month into the job, I decided to experiment with Kratom as a work aid. I had tried Kratom on and off in the past, primarily as a substance to relax with, and had had mixed results. I knew that Thai workers often made use of it to help them through long days, and I resolved to have a go at the same sort of thing. I ordered four ounces of powdered Kratom from a reputable vendor, and began experimenting with small doses around work times. After some trial-and-error, I found a method which I have been using for the past six months with no withdrawal symptoms or negative effects to speak of:",
  "At the start of my work-day, I bring a spoonful (about 5 grams) of Kratom with me to work in a small resealable plastic bag. Instead of making it into tea, I take it orally, as one would with a powdered dietary supplement, washing it down with soda or sweet tea. I usually break the five grams into three doses which I take during a ten-hour day: The first about half an hour after arriving, the second about three hours into my day, and the third about an hour after lunch (six hours into my day). I am careful to avoid taking doses just before or just after eating, as Kratom deadens my hunger and tends to cause mild nausea if taken in conjunction with food.",
  "The effects set in gradually over ten or fifteen minutes: Increased energy, a sense of reverie or calm even during the most strenuous labor, and - most notably - a peculiar effect on time-sense. This is possibly the most odd of all the effects, since I've experienced no loss of lucidity, and can account for everything I've done, but time seems to sneak by much faster than normal. The only thing I can compare it to is the effect of a benzodiazepine (Xanax or Ativan), without the amnesia.",
  "Once I am at home, I stop using the Kratom, and I do not regularly use it during weekends or holidays. I've experienced no notable withdrawal effects, though I've also been careful not to up the regular dose.",
  "I have only experimented a few times with high doses of Kratom, both because of the effects and the cost. At about fifteen grams, the desirable effects are similar to some opiates I have used in the past. I would compare them most closely to the effects of poppy tea, though without the sense of good will and lightness. I've found high-dose Kratom DOES cause the same sort of twilight sleep / trance state that poppy tea can cause, but I would advise anyone using it for those purposes to make sure they have about fifteen hours or more free. I can't speak for anyone else, but for me, high-dose Kratom causes *extreme* nausea if I move around even a little bit. On one memorable occasion, I had taken about twenty grams of Kratom the night prior to a day of work, and had spent the entire night awake and in meditative reverie. When I got up for work (T+ 9 hours from ingestion), I immediately felt a crippling nausea that mounted as I spent more and more time moving around. I just managed to drive the ten miles to work, and upon pulling into the parking lot, opened my door and vomited onto the pavement. I staggered through two hours of work before giving in and going home, claiming illness. I drove home, staggered back to bed, and remained there until around 5pm that evening (T+ 20 hours from ingestion), when the nausea finally abated.",
  "In conclusion, I find Kratom to be very useful for manual labor when taken in low doses. I've also taken it once or twice in similar amounts when I was suffering from extreme fatigue, or when I needed to stay awake and alert during a long drive. I find it clears my head, keeps me awake, and gives a sense of buoyant relaxation, so that even the most boring task is endurable. However, it also deadens hunger, allows me to push my body much harder, and certainly has the potential for addiction. It is worth noting that in the six months I've been working this high-intensity job and using Kratom, I've dropped from 190 to 170 pounds. Twenty pounds over six months is not extreme, and the intensity of the work itself could certainly account for it, but the fact remains.",
  "I intend to continue using Kratom for the duration of this job, unless new effects manifest themselves."
 ],
 "erowid": {
  "id": "68954",
  "citation": " Maturin. \"Moderation and Manual Labor: experience with Kratom (ID 68954)\". Erowid.org. Jun 2, 2008. erowid.org/exp/68954",
  "substance": "Kratom",
  "views": "20605"
 }
}
