{
 "id": 11086,
 "title": "Smooth Sailing ...",
 "date": {
  "submission": "2008-09-13T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chacer",
  "gender": "Male",
  "weight": 62
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "4-Acetoxy-MiPT",
   "form": "capsule"
  },
  {
   "time": "1:00",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "4:00",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I received a sample of 4-aco-mipt hcl and decided one night to try it. I have tried 4-ho-mipt before. The powder was completely white and dust-like. 20mg was measured and put in a capsule which was eaten. I was alone for the beginning of the experience.",
  "T+10min",
  "Slight nausea and im alert. Something is about to happen.",
  "T+30min",
  "Still some nausea but it can be ignored. Nothing that bothers me too much. OEVs started forming. Beautiful patterns, but not many colors thou. Im very happy and laughing hysterically at everything.",
  "T+1h",
  "A friend picked me up and we smoked some mj outside. It was very nice. The stars and the sky looked amazing. No more nausea. We had some very intellectual conversations about life and the universe in general.",
  "T+2h",
  "For some reason I felt like the peak was over. So I decided to split a capsule in 2 and took half. We were driving around town and messing around. Smoking mj at different spots in nature (the driver was sober).",
  "T+2h30min",
  "Nausea again. I guess it was from the second capsule. Not too bad but it was there. The second one started working and it intensified thing a bit. But the material was so friendly that I had no problem dealing with it.",
  "T+3h30min",
  "We had a situation with a very drunk friend who started yelling and got more and more aggressive. I managed to talk him down with no problem. Talking was very easy, even in stressed situations. I managed to stay calm throughout the experience.",
  "T+4h",
  "My friend drove me home where I watched a movie while I was waiting for my girlfriend. I smoked some more mj. This goes very nice with mj.",
  "T+6h",
  "Almost baseline. Sleeping was easy.",
  "Conclusion:",
  "I really like this stuff. Its up there with LSD for me. The nausea was gone 1h after i ingested the capsules, and I think that mj helped too. The main difference between 4-ho-mipt and 4-aco-mipt is the body sensation. It was more intense with 4-aco-mipt, but i liked it. I think this would be very good combined with mushrooms. I will have to try that some day."
 ],
 "erowid": {
  "id": "69020",
  "citation": " Chacer. \"Smooth Sailing ...: experience with 4-Acetoxy-MiPT (ID 69020)\". Erowid.org. Sep 13, 2008. erowid.org/exp/69020",
  "substance": "4-Acetoxy-MiPT",
  "views": "4723"
 }
}
