{
 "id": 11092,
 "title": "Polystyrene Spiders and Mushroom Cultivation",
 "date": {
  "submission": "2008-06-25T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dr. Toxxxic",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Let me start off by saying that Im a physically healthy adult who has an undying love for chemistry and psychoactives. Ive experimented with all the mainstream hallucinogens. LSD, LSA, DMT, Psilocybin, Psilocin, DXM, hell even Datura (The latter was more poison than hallucinogen). Ive enjoyed my experiences with them. No matter how strange the trip may have seemed. Ive approached these experiences in a fully analytical way. Trying to better understand the neurochemistry that takes place during such experiences. The possible benefits and side effects of such.",
  "Four years ago, bored with the familiar. I sought out new doors of perception. What I found, was the gate to Hell. Having read multiple posts about people having intense hallucinations from overdosing on Diphenhydramine, I started research on this. Diphenhydramine is an anti-histamine that, in large doses causes anti-cholinergic hallucinations. This results in a delirious state, where the mind of the user is no longer theirs to control. Talking to people who arent there, seeing spiders or other insects, sometimes gory/gruesome hallucinations are all common among reports.",
  "I, out of ignorance, decided to give it a shot. It was Dec. 17th. 6:30pm E.S.T. I had a few days off from work and decided I would try my first experiment with DPH. I was in a good mood, traveling home with some friends. I had procured 500mg of DPH, in the form of generic allergy tabs. As we headed down the road toking a joint of good Maine homegrown I began popping tablets. I started with 12. My friends were unaware of my actions. Mainly due to not wanting to hear the lecture on how stupid I was. The ride from their house to mine took about a half an hour. I lived about 25 miles away from them.",
  "When I arrived home at about 7:00pm I noticed I was slightly higher than I should have been. I chalked it up to the fine cannabis and didnt pay too much attention to it until I stepped out of the car. My legs felt heavy and my equilibrium was slightly off as well. I said goodbye to my friends and headed inside. I went to my room, and turned on the television. I took out my notebook and began to record the events. Ive since lost that notebook but will relay as much as I can (surprisingly quite a bit considering) from memory.",
  "At T+00:45 I wrote: Body feeling similar to mild dose of MDMA or Psilocybin. Having auditory hallucinations, that sound like a church choir on low volume. Peaceful singing, I just cant make out the words. At some point between T+00:45-01:15 I begin peaking. I decide to down the other 8 pills. At T+01:10 I write: Vision blurred, everything has that tripping aura to it. Hard to walk, concentrate. Awful dry mouth(most severe Ive ever had).",
  "As I finish writing that, I looked up at the TV. Only to notice a spider crawling on the wall by the TV set. I have a ungodly fear of spiders. Always have, always will. Nasty little arachnids. At the time, I was living in the Maine woods at a friends house. I had become used to seeing spiders in the house as a result of the location. This spider, at first glance did not seem out of the ordinary. A common wolf spider. Black, hairy, ugly, and fast as hell (shivers). I, not willing to occupy the same room as the spider decided he had to go. I picked up a shoe and moved in for the kill. As I got closer I noticed this was no regular, garden variety spider. It appeared to have more than 8 legs protruding from a dime sized body. The legs were not what I would call legs either. They appeared to be made of polystyrene filament (a.k.a. Fishing line). At this point I was so far out of reality that this sight did not seem abnormal to me. I struck the spider with the shoeWham! I lift the shoe to further examine this spider. To my surprise, the was nothing there.",
  "I turn around to get back on my bed when I see my friend C. He starts talking to me about cultivating mushrooms. He says he brought over a terrarium for me to use when I attempt to grow some shrooms. This was a totally plausible scenario due to the fact that we had been talking for weeks about ordering spores from Canada. I look down on the floor next to my bed. Sure enough, theres a slightly dirty terrarium sitting there. I get down on my hands and knees, with imaginary rag and all. I start cleaning. I can hear C talking to me but I cant make out what hes saying. Hes speaking English, that much I know. It seems as though my brain cant assemble the words in the order said. I find this very frustrating. At this point I no longer remember Im tripping. I feel like reality is a dream that Im not in control of. I yell at C. What!!! As I do, he disappears.",
  "At this moment, I felt the worst (to this day) sensation I have ever felt. Ive felt pain and sorrow before. I lost my mother to a drunk driving suicide. So I know sadness and loneliness. This surpassed even that. I felt so lonely, humiliated, embarrassed for talking to a hallucination and not realizing it. I thought about suicide for a second (what seemed like minutes). Lucky for me it was impossible to concentrate and my mind soon wandered again. Again I found my self on the floor cleaning the terrarium with C spouting indecipherable sentences. I had a strange feeling of dj vu come over me. Had I done this once? I couldnt remember but something told me not to respond to C. I looked up at him and suddenly I could hear him. Got any 409? he asked. I dont know I replied. This time he didnt disappear. Off I went downstairs, to check.",
  "My friend wasnt home, but his wife was. Do we have any 409? I asked in a voice she said was barely higher than a whisper. To me it sounded normal. No, but we have some greased lightning. I opened the cupboard to look. I stared blankly at the various cleaning agents. Barely able to read or comprehend what I was reading. What do you need 409 for? she asked. C brought over a terrarium for me to clean so we can grow some mushies. I replied. My memory after that response is quite sketchy to say the least. I recall her saying something to the effect of C isnt here. He dropped you off an hour ago.. To which I replied Yes he is. Proceeding to open the front door to show her. C was standing in the driveway, next to his girlfriend's truck. From what she says I stood at the door for ten minutes asking if he was gonna come in. Which of course he couldn't. Being a hallucination and all.  Finally I gave up trying and went back upstairs.",
  "At this point, T+01:45 I wrote (illegibly, mind you): I cant, fucking, 100 grand, squiggles, squiggles.. I dont even remember writing this. By now, my friend's wife has locked herself in her bedroom. Out of fear that Im so out of touch with reality I might become violent (cant say I blame her. Although I did not become violent or have become violent since while on DPH). Its now just me, C, and the polystyrene spiders that keep popping up in random places. At one point I remember looking at the 100 gallon fish tank my friends had in their living room. It appeared as though there was no water in it. That the fish were simply floating through air. I reached my hand into the tank. As soon as my finger got to the usual water level, it got wet. I blinked and the tank was full of water.",
  "Approximately 5:15am, I start coming back to reality. Im physically and mentally exhausted. I have almost no recollection of the nights events and feel mentally slow. The thought process was there, but at diminished capacity. I head to my room to go to sleep. I remember the spiders, and do a thorough inspection to make sure there arent any more in hiding. I manage to fall asleep 9hrs after peaking. I still feel Odd. I slept for 14hrs and upon awakening find that my balance and eyesight are nowhere near what they should be. I go downstairs to get a drink.",
  "My friend is sitting at the kitchen table. WTF did you do last night? He asked. I told him some BS story about mushrooms that he totally didnt buy. He proceeded to tell me about what his wife witnessed me doing. I still had no memory of any of it after T+01:45. It scared me a little, well actually a lot. I had never had such realistic hallucinations. The hallucinations seemed more real to me at the time than did some real objects. I documented the next two days and how I felt as I recovered(somewhat). It took my head a week or so to return to optimum capacity. As did my eyesight, which sucked badly. Not being able to focus on close objects for the life of me.",
  "Ive since abused DPH far more often than I would recommend. For a safe, non-habit forming, OTC chemical its rather habit forming. I cant say as though I enjoy it, although some part of me craves its dream like delirium. I havent exceeded 300mg in quite some time. My usual dose is 200-300mg. I have been trying to stop abusing it. I find it utterly impossible to sleep without it. A little pink pill is the key to sleep for me and nothing short alprazolam (Xanax) which my Dr. wont give me helps. I notice that Ill hallucinate at odd times and for no apparent reason. Ill see something in the corner of my eye and when I turn to look its gone. Ive accepted that as a side effect of the drug use. I wouldnt recommend DPH to anyone as I attribute some quirks of mine to its use. People will do what they want, but not if theyre smart."
 ],
 "erowid": {
  "id": "69061",
  "citation": " Dr. Toxxxic. \"Polystyrene Spiders and Mushroom Cultivation: experience with Diphenhyramine & Cannabis (ID 69061)\". Erowid.org. Jun 25, 2008. erowid.org/exp/69061",
  "substance": "Diphenhyramine & Cannabis",
  "views": "36252"
 }
}
