{
 "id": 11093,
 "title": "Outcome Study",
 "date": {
  "submission": "2008-06-25T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Substancial",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "tea"
  }
 ],
 "report": [
  "Stats: 63, 185 Lbs., Cauc Male, early thirties.  Experimented with a large variety of substances, from the regular stuff, to the weird stuff!  Experienced the mild end of addiction with some substances.  Decided to back off each time before consequences outweighed benefits.  Considered highly successful in most areas of my life.  Never has use come close to becoming a problem in academic, occupational, or social spheres.  That being said, I had decided to attempt a longitudinal outcome study (anecdotal at best) of the positive or negative results of a year long consistent dose of poppy tea used as treatment of long term pain issues.",
  "The preparatory reading ahead of time consisted of a mountain of medical articles concerning the gamut of opiates, natural, semi, and fully synthetic.  Half scared to death about the potential for serious addiction, I decided that an every other day dose would be sufficient to build up metabolites in my system, but not be so bad to taper down at the end.  This way, I would have to deal with withdrawals of a significant nature and a routine revolving around scheduling doses.  This was done for a simple reason, to reproduce dependence to the point of addiction, without the addictive personality associated with it.  Simply put: how would a regular guy react to the opium tea, with easily obtained information and supplies?",
  "The recipe is well known.  For my purposes, I would grind up an entire box to homogenize the product.  Use calculated in a rough way was 4.5 Tablespoons of pulverized dried material (about 4 golf ball sized poppies) every other day.  Chemically speaking, I know the pH lemon thing to be of little consequence to extraction of material, but did it anyway because it seems that everyone else did.  It didnt help much with the taste.",
  "Initial response for me was typical of an opiate naive user at recreational dose:  Slight stimulation, talkativeness, pain perception changed to positive physical feelings, as well as mental elatedness and the tell tale pin point pupils: in short I was high.  This was accompanied by nausea, itching, dehydration, constipation, difficulty urinating, trouble sleeping, respiration slowed (at some points waking me up).  As time went on, most positive elements gradually lowered, but were always still noticeable, even towards the end.  Constipation never changed. ",
  "My wife and I had discussions about personality and other changes.  Changes were slight:  decreased anxiety, memory retrieval slower, weight loss of about 15 Lbs over one year, need for sleep increased, motivation lowered slightly.  Surprisingly no need to get high feelings Id felt with other drugs before, but I was looking forward to the every other night dose. ",
  "OK, the end!  I decided to do a taper schedule like this:  From the original does of the 3 cups of material (1st and 2nd press together), down to 2 cups (after mixing the 2 presses), holding that dose for a week.  Then going down each week by  a cup.   This lasted a bit, and I used Kratom at the end to alleviate the end of things blues and small doses of loperamide.  As a side note, Kratom works, and works well for withdrawal symptoms.  My symptoms were mild with the taper, and consisted of mild diarrhea, and some increased sleep and lack of motivation.  These didnt feel bad, and they were expected.  I didnt need any time off of work and felt back to baseline within a week of the Kratom use."
 ],
 "erowid": {
  "id": "69065",
  "citation": " Substancial. \"Outcome Study: experience with Poppies (ID 69065)\". Erowid.org. Jun 25, 2008. erowid.org/exp/69065",
  "substance": "Poppies",
  "views": "10589"
 }
}
