{
 "id": 11103,
 "title": "Liver Problems",
 "date": {
  "submission": "2008-09-17T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Matt K",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "6300 mg",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(tea)"
  }
 ],
 "report": [
  "I noticed that there was not too much on this herb in the reports so I decided to share my experience.",
  "One Friday night, bored trying to figure out something to do to beat the boredom, I decided to read up on effects from drinking a large quantity of damiana. I thought I would give it a try and so I went to my local GNC to see if I could get a bottle. I got a bottle of 100 350mg capsules. When I went home, I boiled about two cups of water, brewed some tea in it (for flavor), then opened up 14 of these capsules in the intent to match the dosage of a positive report. I mixed up the damiana dust and started to sip it down. It was hot so I waited a little bit longer and then started chugging it down because of the odd taste and the terribly gritty powder feeling in my teeth.",
  "About 15 minutes after consuming all of the liquid. I began to feel a little relaxed and felt happy. I began to stare at the television and at different things in the sort of manner and duration of a perhaps a long day dream. This feeling left me after maybe 20 minutes. And the night proceeded as normal.",
  "The next morning however, I felt really ill. I looked in the mirror and the whites of my eyes were yellow. This scared me because this means that I had taken enough damiana to poison my liver. My eyes stayed an extreme yellow for about 3-4 days and then they slowly faded back to normal in about a week after the date of the experience. This recovery was helped with plenty of water and not eating many things that would be bad for my liver, like caffeine or alcohol or meat (which wasnt normally in my diet anyways because Im a vegetarian).",
  "In conclusion, I wouldnt recommend consuming damiana in large quantities because it probably isnt the best thing to do for your liver. If anything, smoke it. I tried this after a week of my recovery and it worked quite nicely."
 ],
 "erowid": {
  "id": "69119",
  "citation": " Matt K. \"Liver Problems: experience with Damiana (ID 69119)\". Erowid.org. Sep 17, 2008. erowid.org/exp/69119",
  "substance": "Damiana",
  "views": "27074"
 }
}
