{
 "id": 11104,
 "title": "The Zone",
 "date": {
  "submission": "2008-04-14T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SmoothGroove",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:00",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I'm a 21 year old male, 145 pounds",
  "Previous Drug Use:",
  "8 years as an avid cannabis consumer, extensive experience with benzodiazepenes, two uses of methamphetamine, multiple use of MDMA, extensive use of psilocybin mushrooms, use of cocaine, opiates, and 2C-I. I had never previously used Ambien.",
  "The setting for this 1st experience was in my comfortable room, which was softly illuminated by lamps and candles.",
  "I began the experience not expecting an immense effect from the ambien, as I had never taken this drug before. I consumed two 12.5 mg. pills from a sample blister pack.",
  "T+0:00  I took one blue 12.5 mg tablet",
  "T+1:00  I became disappointed with the extremely weak effect, which was hardly noticeable, so I took the other 12.5 mg tablet.",
  "T+1:30  A slight tingly, dissociative, warm and fuzzy sort of feeling came on me. I could feel the effects of each tablet coupling into a nice bodily sensation. The feelings arising from the drug was most certainly centered in my body, not in my head or mind. I found it easy to control myself and felt quite centered mentally. The effects became a bit stronger as time went by.",
  "T+2:00  Around this point, I began to take notice of the slight hallucinations. I found myself looking through saved photographs of sunsets, watching the clouds wander. I noticed that most of the visuals tended to be peripheral, and my central focus remained pretty stationary. Much like mushrooms, it seemed to be that the longer I stared at something without blinking, the more intense the peripheral visuals became. I was delighted! I spent at least an hour looking at beautiful photos.",
  "T+3:00  I had read that it was difficult to remain awake, but I found it quite easy. I'm used to being high and tired most of the time. Eventually I really had to go to bed as I had school the next morning. I lied down as waves of relaxation rolled over me. I had very slight feelings of physically moving, similar to the feeling I get when drinking 4 or more beers, that head-spin sort of feeling. Only this was not a disorienting, sickening sensation. I was incredibly comfortable.",
  "I read about many people comparing the feeling of Ambien to Xanax, and that may be remotely true when it comes to physical sensations, but does not compare. Ambien did not seem to have a great mental effect on me. It could perhaps be that my experience with drugs allowed me greater control over myself and the effects of the drug, as I have found this to be the case with most drugs I have taken. If I had to speak with a stranger, I am pretty certain that they would not notice that I acted any differently than 'normal'",
  "I slept fantastic, and woke up feeling very regular, not drowsy at all, really. Overall, it was a really positive experience, and I would like to try it again. I recommend trying it, but I would not abuse it regularly even if I had constant access to it."
 ],
 "erowid": {
  "id": "69123",
  "citation": " SmoothGroove. \"The Zone: experience with Zolpidem (Ambien) (ID 69123)\". Erowid.org. Apr 14, 2008. erowid.org/exp/69123",
  "substance": "Zolpidem (Ambien)",
  "views": "8825"
 }
}
