{
 "title": "Quite Surprised",
 "author": "Psychonaut11",
 "citation": " Psychonaut11. \"Quite Surprised: experience with Breathwork (ID 11111)\". Erowid.org. Sep 27, 2007. erowid.org/exp/11111",
 "substance": "Breathwork",
 "bodyweight": "",
 "report": "<p>It has been years since the event, so I will try to remember to the best of my recollection. It was on a weekend, earlier in the day, that my step-father asked me if I would like to go to a breathing/ meditation session that his friend was conducting at his house out in the country. At the time I was very heavily involved in addictive inhalant abuse, gasoline and touline in the form of rubber cement. To make a long story short I was not a very happy person and my mind was quite deteriorated. I quite resented my parents and all their guru bullshit, but it seemed important to him, so I acquiesced.</p><p>We arrived at his friend's house at about noon, there were about five people there already that were there to participate. Since there were so many we decided to use the large room that his wife used for teaching yoga classes.</p><p>At first he had us relax to some new-age drum music designed to open up the lower chakras. If I had known how painful this would be I might not have gone through with it. He then had us start breathing deep to the beat of the steady drum. He came by to each individual and lastly to me and presses his hand on my lower abdomen and directed me to breathe deeply and quickly from my guts. This is almost impossible to do by oneself as it creates severe cramping and pain.</p><p>I'm not sure at what point I lost coherent thought and this breathing pattern became natural, but it did. I was in quite a trancelike state for well over an hour and a half, unaware of myself or anyone else in the room. Time had no meaning. That is not to say that I could even have thought any of this at the time, thoughts had no meaning seemingly either. I remember some very powerful closed eye visuals, all electric blue and mandala-like. It came to a climax when I saw the star of Jerusalem come hurtling at me in my minds eye. It entered the top of my head and moved through my body like a beautiful wave entil it came out of the tips of my tingling toes. I believe my legs actually lifted off the ground.</p><p>I have done many psychedelics, but I have to say this was the most real and powerful out of body experience I have ever had. I would call it a true out of body experience. Immediately afterwards I sat up completelty sober and puked my guts out. This turned into an evil racking cough that brought up nearly a cupful of phlegm. I believe it must have been due to a cleansing affect of an oxygen overdose. I have never felt better in my life than after this experience.</p>",
 "year": "1997",
 "id": "11111",
 "gender": "Not Specified",
 "timestamp": "2007-09-27T07:00:00.000Z",
 "views": "5458",
 "dose": {}
}
