{
 "id": 11113,
 "title": "Psychotic Episode - Doctors Orders",
 "date": {
  "submission": "2009-10-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Insamity",
  "gender": "Male",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "daily"
  }
 ],
 "report": [
  "So I was just one of the many children in the late 20th-21st century who was clinically diagnosed with severe depression.  My psychiatrist recommended Zoloft.  I was a small kid, maybe 100lbs sopping wet, and they started me with a modest 25mg dose.  This was fine for the first two weeks, after the second week I started to feel strangely, starting first thing in the mornings.  I told my doctor and she said it was due to the drug finally taking effect and the unpleasantries would disappear once it's fully built up in my bloodstream.  To acclerate that process, she doubled my dose.  Then I REALLY didn't feel right.  I would lay awake at night, despite 100 mg of Trazadone, with racing thoughts.  I could not control them, horrible thoughts that I don't even want to make mention of. ",
  "The days seemed endless and I constantly had this indescribable discomfort, always.  It was almost like an itch under my skin that I couldn't quite place.  It felt difficult to communicate with people.  I felt like no one understood me.  And I felt sad.  All things one should not expect from an antidepressant.  Again I told my doctor about it and she again dismissed my distress.  She put me up to 100 mg per day.  So now each and every single pound in my body had its very own whole miligram worth of poison every day.  It took less than a week before it became unbearable.",
  "Each day I felt panicked.  I was uncontrolably irritable, and lashed out at teachers and my fellow peers.  I didn't talk to hardly anyone.  Going home was like being sent to die.  I would explode with tears and fury when I got home, arguing with my parents, and sobbing myself to sleep.  As I said, it was less than a week until in school I broke down.  I lashed out at a teacher and began screaming and sobbing about god-knows what.  I don't remember it much, but I remember my school councilors, principals, and security all taking me down to the office.  I was crying uncontrollably and I wanted to die.  I told them so.  I told them exactly how and why I wanted to die.  I wanted to die because I deserved it.  They kept asking me what happened, why I blew up and I went into a rage.  I started screaming about what a particular teacher had done, and some kids that I depised, and that one of the councilors was calling me names and antagonizing me while I was in the hallway.",
  "The only trouble was, that none of that ever happened.  All of the things I was angry about and telling them happened, never did.  I was lost.  They explained to me that the teacher I was talking about, I hadn't even had their class yet, so I hadn't even SEEN them!  I couldn't wrap my mind around it.  I became confused.  I was frantic and wild.  I got on top of the table and started crying and screaming.  It felt like only a moment there, on that table, crying, trying to bear this torture somehow.  It was much more than a moment though, it was almost an hour, and before I knew it my parents were walking in the door, confused and frightened.  Within another hour I was committed to the psychitric hospital.  Locked away without so much a lace in my shoes for fear of what I would do to myself with it."
 ],
 "erowid": {
  "id": "69192",
  "citation": " Insamity. \"Psychotic Episode - Doctors Orders: experience with Sertraline (Zoloft) (ID 69192)\". Erowid.org. Oct 10, 2009. erowid.org/exp/69192",
  "substance": "Sertraline (Zoloft)",
  "views": "12901"
 }
}
