{
 "id": 11129,
 "title": "Being Alone",
 "date": {
  "submission": "2001-09-23T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "Sarah",
  "gender": "Female",
  "weight": "115 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ],
 "report": [
  "<p>It started out my friends coming over around 10 PM and saying they had these seeds that made you trip.  I've done acid many many times so I thought nothing of it.  They said ten would do me good so I was like okay and chewed them up.  We left and drove around for a while and nothing happened for about twenty minutes.  Then we went to this park near my hometown.  I started to feel really sick but no visuals or anything.  Everyone else seemed to be fine but usually my stomach is kinda sensitive to things so I figured that's what it was.",
  "Around 11:30 we stopped at a gas station to get cigarettes and they saw these strange guys that I had no idea who they were.  They were like let's hang out and all this shit.  I didn't wanna go.  I felt so weird and distant to everyone.  All I could really feel was the sickness but with little visuals.  So I told them I wanted to go home.",
  "At about 12:30 they took me home and dropped me off.  I had trouble walking up to my door.  A lot of trouble but I felt safe.  I was happy to be home.  So I got into my house and went into my dads room cause he worked nights all the time.  I was just relieved to be there.  I sat there and watched TV and realized I was tripping but I still felt sick. I tried to keep the sickness furthest from my mind but couldn't.  My mind raced through so many thoughts about life and death and if this was the worst it would get.   So I started to panic.  I lay on my couch and got really sick.  I couldn't even walk right to the bathroom so I crawled gagging and throwing up many times. ",
  "Finally made it to the bed again and it felt like I was going to swallow my tongue.  In order for me to swallow I had to drink something.  My mind raced through so many thoughts.  I had to think about everything in order to feel like i wasn't going crazy.  For the longest time all I wanted was for my brother to get there.  But when he did he went to turn on the light and I freaked out.  I said to get the fuck out and I didn't want him in there.  He was like are you tripping and I said yes but he didn't understand why I was just laying there.  I couldn't explain or look at him.  So he left and I lay there alone again.  I just wanted it to end.  I felt like I was gonna stay like this forever.  This lasted a total of 16 hours for me.",
  "I don't ever ever want to do them again.  That is just a light way of putting what I went through.  Maybe it was because I was alone but if someone wants me to again there is no way in hell I will.  I don't want to feel like I'm going to go crazy or die ever again.</p>"
 ],
 "erowid": {
  "id": "6928",
  "citation": " Sarah. \"Being Alone: experience with H.B. Woodrose Seeds (ID 6928)\". Erowid.org. Sep 23, 2001. erowid.org/exp/6928",
  "substance": "H.B. Woodrose Seeds",
  "views": "12215"
 }
}
