{
 "id": 11126,
 "title": "Perfect Combination",
 "date": {
  "submission": "2009-10-10T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Greenman",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Pharms - Promethazine",
   "form": "ground / crushed"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "This is my first post on here so I'll keep it pretty short. I have been diagnosed with ADD/ADHD and am currently on Adderall, but this event happened before I began taking it on a daily basis, and as for Promethazine, I had never taken it before this event. Cannabis is nothing new to me.",
  "One night I was relaxing with my friends before I had to spend an all-nighter on a project, when the idea to smoke a bowl or two came up. Now being an experienced smoker, I knew that this would not affect my work on my project, but then the idea to top the bowl with a crushed up Promethazine (P) came up. I knew what P was and how it was going to affect me, so I was fairly sure that I shouldn't smoke it when I had a whole night of work ahead of me. But after much encouragement and peer pressure, we concluded that one or two hits wouldn't hurt.",
  "I end up taking three or four hits and feel the P hit me immediately. Within five minutes, everybody was leaned over in their chair and giggling. Now I'm worried that I'm never going to get this project finished. Luckily my friend came to my aid with a 30mg Adderall (A). So I quickly gulp it down and started driving back to my house. By the time I get home, the A started to kick in. The tired feeling from the P was immediately extinguished, but the wired focused feeling of the A never came.",
  "After that, I felt nothing but good sensations. I had found a perfect level of high that I've never had with just Cannabis and Adderall. Everything I did just felt good, but instead of focusing, I had a very light head and found myself thinking about all kinds of philosophical ideas. Even physical sensations felt amazing, I really want to try to use this during sex and see if it has any effect on me. All in all, I ended up starting the project at 8 in the morning after all of the effects had worn off.",
  "So far it's been my favorite feeling from Cannabis and Pharms. Hope this was helpful."
 ],
 "erowid": {
  "id": "69258",
  "citation": " Greenman. \"Perfect Combination: experience with Amphetamine (Adderall), Promethazine (Phenergan) & Cannabis (ID 69258)\". Erowid.org. Oct 10, 2009. erowid.org/exp/69258",
  "substance": "Amphetamine (Adderall), Promethazine (Phenergan) & Cannabis",
  "views": "14099"
 }
}
