{
 "id": 11124,
 "title": "A 9.8",
 "date": {
  "submission": "2008-02-22T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "dshel",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Oxymorphone"
  }
 ],
 "report": [
  "I noticed a lack of reports for Oxymorphone (In particular, Opana) and because this is one of the greatest gifts that God (Or Buddha, Allah, or whoever else you believe exists) could have given us, I felt I had to give something to go on! Now, I consider myself a very experienced user of all opiates, and especially oxymorphone. I have been using all forms of opiates for the past 8 years (and other drugs, like marijuana, ecstasy, psilocybin mushrooms, cocaine twice, barbs, benzos, neurontin, muscle relaxers, etc.) and have been using strictly opiates every single day for the last year (very addictive). Over the past year I have used codeine or hydrocodone w/ promethazine syrup, hydrocodone (vicodin, lortab) oxydodone (percocet), morphine sulfate (ms contin), propoxyphene (darvocet, darvon), tramadol, snort/crush and swallow oxycodone (oxycontin), oxymorphone (opana), and I am probably forgetting some, so basically every opiate/opioid besides heroin and methadone. SO because I am so experienced, I decided that I would give a general overview of this AMAZING narcotic.",
  "There are three ways I have experimented with Opana: cut them into slices using a pill cutter and swallowing the slices, crushing the slices and allowing them to dissolve under the tongue, and of course snorting them. I found absolutely NO recreational value from anything besides snorting them. There is little-to-no burn or pain/discomfort from snorting them, but there is an awkward taste that comes from snorting them that is like no other substance. It took me several times of snorting Opana to put my finger on the taste, and I think I can best describe the taste as a very old and stale fruity cereal.",
  "It takes anywhere from a couple minutes, to fifteen minutes to feel the effects. But once it kicks in, I think this, and oxycontin are the best highs one can experience. But they cannot compare to each other, because they are two completely different highs. Although Opana is similiar to the typical opiate high, it is very different. It does not cause the drowsiness, or cloud the mind as much. It is just a pure sense of euphoria. But when doing too much, it caused me to get moody, sometimes somewhat angry, but not extremely aggressive to where I wanted to fight. When doing Opana at a typical dose, the initial onset comes with a relaxing, warmth coming over the body and mind that makes me just want to lay back and go 'ahhh'. Then the lasting high is just a pure sense of happiness, euphoria, a sense of floating, a huge boost of self confidence, loss of inhibitions, and just an overall sense that everything in the world is good.",
  "When I say the typical dose, it depends on your tolerance to opiates. When I first began, (just like my friends who use opiates, but not regularly), I could crush up around 3 mg and have a very noticeable, enjoyable high and 5 mg for a good high. 5 mg for me, because I have a high tolerance, just gives me that noticeable, enjoyable high. 10 mg gives a very good high, and anywhere up from there gives a strong, amazing high. I have done up to 50 mg at a time, and it was such a strong, amazing, high, but if you do not have an extrememely HIGH tolerance, DO NOT ATTEMPT THIS!!! 40 mg of this would compare to an inexperienced user attempting to do between 80mg-100mg of oxycontin. It could easily KILL YOU! I would most often drink alcohol when snorting Opana (Unless you have a high tolerance, do not do this either)...  When I would do my usual doses of Opana, and drink 3-5 beers, I would be fine; much more than that would cause me to black out and act incredibly ignorant, doing things I would NEVER regularly do, and remember very little of it the next morning. After drinking too much and doing between 40-50 mg and drinking roughly 12 beers, I woke up the next morning in extreme pain and in a puddle of my own vomit with no recollection of how the ending of the previous night went. So even in an experienced user with a very high tolerance, overdose is possible, so be careful.",
  "Now for the negative aspects of the drug: Hangover and cravings.",
  "The next morning, after a night of doing some Opana, there is a hangover, which is mostly just a bad headache that will go away after time, getting up and being active enough to forget about it, or after ingesting a tiny dose of Opana. Then, while using the Opana, it causes me to crave more, similar to how cocaine users will do line after line because the body/mind wants more after a short period of time. It seems that after doing a line, there will be about an hour to hour and a half before I am wanting to do another line. The cravings are not unbearable, and it is easily possible to say no to, but I am not going to want to say no.",
  "Overall, great drug, just be careful and start out slow... slight drawbacks come with the drug, but they are well worth it! Despite the drawbacks, on a scale of 1-10, I would still rate this drug in at about a 9.8! I would love to have some right now, but I don't feel like getting out of bed, so I think I will just take some of my percocet! Have a good one, be careful, and happy highs!"
 ],
 "erowid": {
  "id": "69250",
  "citation": " dshel. \"A 9.8: experience with Oxymorphone (ID 69250)\". Erowid.org. Feb 22, 2008. erowid.org/exp/69250",
  "substance": "Oxymorphone",
  "views": "44762"
 }
}
