{
 "id": 11136,
 "title": "More Tea Please",
 "date": {
  "submission": "2008-02-23T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MisterSmoke",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "9.0 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  }
 ],
 "report": [
  "I weigh around 230 plus or minus a few and stand about 5' 8'. This is my second time using Kratom the first time I consumed 5 grams of what was said to be 15X extract, with no results. This experience was much better.",
  "Roughly 9 grams of Thai Kratom powder was placed into an espresso / cappuccino machine. Because the water is heated to such a degree I thought this would be perfect, and it was. I ran three of the small coffee pots of water through. The first run came out looking like apple cider. The second looked like tea. And the third like a pale beer. I then mixed and drank all three within 5-10 minutes after they cooled. The 'tea' tasted like very strong regular old tea. I then sat down at my drawing table to finish a picture. No immediate effects were noticed.",
  "One hour in, I have been feeling quite good for some time now, and have grown bored of drawing. I take a minute to look over the two drawings and feel totally amazed at what I have done, better than I should feel. Now what to do... My brain feels numb like I'm wasted drunk with absolutely no negative side effects. Also ordinary things seem extraordinary. I decide to get online and play a little Texas holdem. Wow the computer is an amazing thing! I lose at holdem. Losing didn't aggravate me but it would have felt great to win , really great. I then return to drawing.",
  "Four hours later I still feel a little something. I feel very good. I feel as though Kratom is going to help me quit getting drunk so often and be more productive.",
  "Next time I will use more than 9 gramsm"
 ],
 "erowid": {
  "id": "69311",
  "citation": " MisterSmoke. \"More Tea Please: experience with Kratom (ID 69311)\". Erowid.org. Feb 23, 2008. erowid.org/exp/69311",
  "substance": "Kratom",
  "views": "9398"
 }
}
