{
 "id": 11142,
 "title": "Inner Numbness",
 "date": {
  "submission": "2010-05-01T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Billy D",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 ml",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(liquid)"
  },
  {
   "time": "1:00",
   "amount": "15 ml",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(liquid)"
  },
  {
   "time": "1:30",
   "amount": "15 ml",
   "administration": "oral",
   "substance": "Pharms - Promethazine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "00:00 - Two large serving spoons, roughly 20ml.",
  "00:30 - After about a half hour or so I felt my innards go numb. I was hoping for a euphoric state, but did not feel one.",
  "01:00 - I took a swig, drinking roughly about 15ml because I was not satisfied with the effects. I noticed a strange sensation in my nerves, however. It seemed that I was easily startled. My nerves would jolt at unexpected noises or movements.",
  "01:30 - Still not satisfied with the effects, I took another 15ml swig.",
  "02:00 - Still I felt nothing short of sleepiness and inner numbness. There was also mild head high, and I was still easily startled.",
  "02:30 - I was really sleepy, so I decided to lay in my bed. I dozed off almost instantly.",
  "08:30 - My mom wakes me up for dinner. I eat then go back to bed.",
  "11:30 - I wake up because my girlfriend calls. I feel very irritable. I get in an argument with her over something meaningless. After talking with her I decide to do my homework. I do it and go back to bed.",
  "The next day was awful. I had terrible anxiety all day. I freaked out about meaningless things, and continued the pointless argument with my girlfriend. I was also still being easily startled by everything. I jumped in the morning when I took a drink and the water touched my lips. I jumped when my neighbor touched my shoulder in English class. Any physical contact with anything seemed to cause my nerves to jolt. I was starting to worry if I had permanently damaged myself. I hoped it would wear off with sleep. The day after the anxiety ended, but I still felt the effects on my nerves, however they were much milder. I didn't jump at every instance of physical contact. But still, I jumped at unexpected contact. The third day it finally went away.",
  "In all the experience wasn't enjoyable. It wasn't terrifying tough either. I'd probably never do it again, simply because it didn't really produce any favorable effects. Hydrocodone cough syrup is a million times better."
 ],
 "erowid": {
  "id": "69355",
  "citation": " Billy D. \"Inner Numbness: experience with Promethazine with Codeine (ID 69355)\". Erowid.org. May 1, 2010. erowid.org/exp/69355",
  "substance": "Promethazine with Codeine",
  "views": "25980"
 }
}
