{
 "title": "5-MeO-DMT: The Gateway to Heaven",
 "author": "Anonymous",
 "citation": " Anonymous. \"5-MeO-DMT: The Gateway to Heaven: experience with 5-Meo-DMT (ID 11166)\". Erowid.org. Apr 11, 2002. erowid.org/exp/11166",
 "substance": "5-Meo-DMT",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>\nIt was a Saturday night at around 12:30 and I had smoked a bit of weed before I had gotten to my friends apt. When I got there I walked into my friends room and they were all sitting around passing around a small metal bowl with some 5-MeO-DMT in it. When they offered the bowl to me I hit it and exhaled the smoke very slowly.</p><p>There must have been at least 10mg left. This was the fourth time that I have smoked 5-MeO-DMT, but this was for sure my most profound experience I have ever had with any drug.  After a couple seconds of smoking it, all of a sudden I felt as if I was not in the room anymore.  My heart was beating.  I could hear it inside of me.  I kept saying 'its ok, Im all right,' to myself.  I felt fear, terror, and panic. I was sitting on the bed and one of my friends was sitting next to me.  I didnt know what was going on.  I was squirming backwards into him not knowing what I was doing. Then all of a sudden the fear and terror went away, and I thought I was dead and was somewhere else.</p><p>I then sat up and with a big smile on my face, I was happy to be dead and I thought I was in heaven. It was like waking up to life and I compared it to the matrix. I felt as if i was an individual who encounteredd the oneness of life, and that we were all the one, like neo was. I thought my friends showed me the way, the way to heaven and that I entered the gateway. They all had a part in my journey there, and they were there to teach me, I felt as if I was woken up like neo from the computer-controlled world and was in a pure state of love and happiness.</p><p>They too, I thought were in heaven and it felt like a dream within a dream. I went around the room and hugged each one of my friends, thanking them for teaching me and being led to them in my journey of life. Then I remember the phone ringing and I thought it was my parents or someone confirming to them that I was dead. (After the experience I found out it was just my friends girlfriend.) Then I sat back down on the bed and starting talking, I do not remember what I said then, but I can remember every action and every move I made, very clear. Then all of a sudden I start walking towards the living room, thinking I need to go lie down and rest for my long journey ahead.</p><p>But then all of a sudden it just all went away, I felt as if I woke up and came back to my body or reality, from where ever I was. It had happened so fast, but it seemed liked forever. The perfect word to describe it is Timelessness. I had such a hard time trying to figure out why I thought I was dead, I couldnt believe a drug would change my perception of things so much, that it would make me think I was dead.</p><p>After sitting down a bit I was still coming to my senses with this whole experience. What I did learn from this experience cannot be described, only felt. It is a feeling of love and happiness, having no fear in life, being open-minded to all things, and not letting anything or anyone control you. Life can be so short sometimes so it is good to show your love for all things now before you die because you never know what can happen.</p>",
 "year": "2001",
 "id": "11166",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-04-11T07:00:00.000Z",
 "views": "8707"
}
