{
 "id": 1116,
 "title": "Deigenesis and Cubensis",
 "date": {
  "submission": "2005-03-09T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "K. Stormhammer",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": "4.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "dried"
  },
  {
   "time": "0:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "While, admittedly, my experiences with psychotropics and like substances is quite limited, I will attempt to relay the importance and impact of the macro-cosmic discoveries unveiled to me on a night of gross self-indulgence. To begin correctly, I must first say I had a wonderful day.  One of those stress-free days only existent in fleeting eutopia could compare to the day I was having...it was, you see, my day off!  My children and wife made me relaxed and content that day, and the time came for the four of them to enjoy a visit with family from out-of-town.",
  "I dimmed more than a few lights within the house, and proceeded to chow down on about 4 grams of some of the prettiest fungi I had acquired to date.  Knowing well the nausea associated with this particular psychoactive substance, I rolled betwixt 3 and 4 grams of my personal stash of killer shrubbery.",
  "I actually read internet pages as I consumed the mushrooms one at a time.  A bit about my consumption; I am a 27 year old male, 6 feet and approximately 195 pounds.  I am healthy as an ox, and described as some as being 'harder than a coffin nail' in constitution and tolerance of physical stresses.  I am also well educated, having earned two bachelor's degrees in a well-known state university.  One was for communications, and was a necessary evil.  The other was my passion, Microbiology.",
  "Absorbing the wealth of useful information, I came to the conclusion that I had ingested all of my 'fungus-crunchies.'  At that point, I relaxed and set the timer on my watch for 15 minutes, and began the countdown.  When I reached the quarter-hour point, I ignited my shrubby chaser, and relaxed in the haze of green smoke it produced. I would like to point out that I only smoke herb while shrooming to counter the nausea that is so inevitable. Very soon, the body rush crashed over me.  My hands and feet became so distant from my core that I was having great difficulty controlling them.  Instead, they seemed to be quite content focusing on other things, at times even independently.  My Chi, the essential energies that animate and bind us, became condensed.  Indeed, it felt as though my very conciousness were reducing itself exponentially until it was roughly the size of a BB. While in this reduced state of awareness, my 'self' (as I will refer to my conciousness henceforth) was free to roam about and explore the enormity of inner-space and the confines of my physical shell.",
  "This adventure carried on for time indeterminate, and exposed nothing, aside from the intense sense of inertia and acceleration.  I was beginning to think I might be disappointed by this particular 'trip.'  I also thought I might be misinterpreting the information I was being force fed through my self.  The nice old gentleman seated next to me simply chuckled and disagreed. Now, to this point in time, I was operating under the assurance that there was nobody else around me, and that I was safe from outside influence.  As it turns out, I was not. He appeared to be in his early sixties, the light of a golden time only now beginning to fade in his steel grey eyes.  Clean shaven with elegantly long and silvered auburn hair, he seemed the very image of graceful aging.  He was trim, if not thin, and his complection and posture suggested he was strong and vital far beyond what my mind might assume.",
  "He had, in those amazingly clear eyes, a sorrow unfathomably deep, and the keen glimmer of some wish he could not fulfill.  He spoke to me without words, as though he were simply imparting instincts and emotions into my 'self' with a complete disregard for the spoken word.  At this moment, I knew that we (humans) can, in fact, communicate mentally across space and time, instantly and without pontification and careful phrasing. When I 'inquired' as to who he was and how he got into my locked and empty house, he seemed to grin knowingly, and assured me that he had always been there with me, part of me that slept as I was awake, and the matter of doors and locks are a trifle he was well above.  Taking the intelligent cue, my mind began to recoil in refusal of such a concept, but the Cubensis, or some other powerful impulse, gave me the answer I dreaded.  This man, lonely and exiting the prime of his virility, was what we so affectionately refer to as God.",
  "He told me tales of isolation, and the woeful inabilty to interact with His children.  He could not allow His project to become tainted, as He had grown to love us above and beyond His other highly-successful and dynamic projects.  He was lonely, most of all.  He has no one to talk to, to confide in, to witness His triumphs and disasters.  He conveyed to me but a fraction of the emptiness within Him, and I was awed that one being, God or other, might hope to withstand the terrible black currents of despair only He can feel.",
  "As I was becoming comfortable with the idea that I was seated in my house, having a pleasant conversation with God Himself, He rose with nothing more than a cheerful and wistful sigh, and spoke but one sentence from His lips.  The words he spoke:",
  "'Please do not ever doubt that I love you, and that you can rely on me.'  With that, he simply faded away.",
  "From that point on, I was dropping in and out of a torrential storm of emotions, and I have yet to dissect and analyze that jumble.  Rest assured that I will most certainly update those who might wish to learn what they were.  That is all, my story is complete. It should be noted, that until that day, I was decidedly agnostic.  The thought and idea of God on high, directing the comings and goings of my life, to me, was preposterous.",
  "I am now, to this very day, quite faithful in the knowledge that perhaps within myself, perhaps without, or even on a cosmic scale, God knows us, and feels for us, and needs us as much as we need him."
 ],
 "erowid": {
  "id": "13265",
  "citation": " K. Stormhammer. \"Deigenesis and Cubensis: experience with Mushrooms - P. cubensis & Cannabis (ID 13265)\". Erowid.org. Mar 9, 2005. erowid.org/exp/13265",
  "substance": "Mushrooms - P. cubensis & Cannabis",
  "views": "4033"
 }
}
