{
 "id": 11174,
 "title": "Smooth to Edgy",
 "date": {
  "submission": "2001-05-21T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cookiepuss",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20"
   },
   "administration": "oral",
   "substance": "2C-T-7",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "  Well what a day to discover you are probably one of the 15% that this effects a little stronger.  I took 2 10mg pills after work on a friday at 6 pm.  Thanks to erowid for helping me choose that dose. The pills were blue with ying yang symbols.",
  "6:45pm (t+45min) Well i decided to keep a journal, and now is when i experienced the 'body load'. Basically felt like a small burst of energy with heat radiating around my body, similar to mild sunburn.",
  "7:30pm (t+1hr30min) Now my muscles are getting tence. Mostly my neck and legs. I get up and walk around and my legs feel better. I did start to feel sick to stomach but i found this to be due to the gas it was producing, so i would just burp alot and that feeling would go away. No puking for me.",
  "7:45pm (t+1hr45min) Ok now we are talking. I have numb lips, pupils are fully dilated and have that MDMA glow in my body but my head is extremely clear. I put on some music and start dancing.",
  "8:00pm (t+2hrs) Visuals start. they seem to come in waves that retreat a little longer than their onset. I like this because I was feeling a bit overwhelmed by the visuals and i was able to handle them better in slow waves. I still feel very hot and sunburned i have the airconditioner on 73 degrees. It did not help.",
  "9:00pm (t+3hrs) Ok begining the upward peak. I would say my visuals are stroby and organic. Sat down and watched TV, everything was very funny. Light sources change colors from pastel green, pink, and peach. These light changes are not dramatic and very pleaseant. I would have to say the visuals are much like LSD. During the ride up the MDMA feeling has gone away except for wanting to talk to my friends.",
  "1230am (t+6hrs 30min) Visuals are coming down. Music is a big influence on my overall trip. I suggest nothing too 'evil'.",
  "1:30am (T+ 7hrs 30min) ok the body load is back with visuals minimum. So I call a friend to bring over some cannabis.  I feel slightly agitated and restless. I find it hard to sit still and just quite annoyed.",
  "2:30pm (t+ 8hrs 30min) Smoked one joint of cannabis. Visuals stopped 30 minutes prior.",
  "5:00am (T+ 10 hrs) Finally feel normal enough to go to sleep.",
  "Overall this was a fun time. I recommend to do your research and  thank erowid again on providing me information to make an educated guess on my dosage. I really believe 20mg will be the max dose for me in the future. Time dialation was very minimal and the visuals were lots of fun. I just did not like the agitated state at the end but the cannabis did cure that problem."
 ],
 "erowid": {
  "id": "6956",
  "citation": " Cookiepuss. \"Smooth to Edgy: experience with 2C-T-7 (ID 6956)\". Erowid.org. May 21, 2001. erowid.org/exp/6956",
  "substance": "2C-T-7",
  "views": "15034"
 }
}
