{
 "id": 11187,
 "title": "Deep Catatonic Depression",
 "date": {
  "submission": "2011-01-01T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Daniel",
  "gender": "Male",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "",
   "substance": "LSD"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I had smoked some marijuana in the past, and had heard how LSD was a great trip.  I had really wanted to get my hands on some good acid, but with no luck at that age.  As a friend had told me once good acid comes to you, but not when your out Looking for it.  His theory 3 years later proved true.",
  "One of my buddys, lets call him Hippy Stan, were good friends in High School.  I was living in Salt Lake City at the time, and was introduced to marijuana.  He had told me of acid, and we both wanted to try it.  I eventually moved and lost contact with him, until I was 19.  Ill keep this as short as possible, but I wound up homeless.  I hitchiked to Salt Lake City for some reason...",
  "Before the acid, I had tryed Marijuana, Meth, Weed, Shrooms, DXM, All around the ages of 16-18. One day, I ran into my old friend from High School Hippy Stan!  We hung out, I held down a good job and so forth.  Life was grand.  And I had reached around 6 months of sobriety. Give or take a month or so.",
  "One Night after work, I came home and Hippy Stan had welcomed himself into my apartment.  Him and his buddy were sitting on my couch, tripping on acid.  I was very reluctant and decided I was done with drugs.  I was already experiencing some HPPD (permanent trails, static at night) nothing too severe and unbearable though.  Was able to hold down a good job and things were great.",
  "Later in the night, a couple other friends came over and were really excited that Stan had gotten some acid.  I will Call them J and L.  Stan was starting to trip fairly heavily and so was his friend.  J and L instantly bought some hits from him.  I was out on the back porch, trying to avoid the whole thing, when L comes out and offers me acid.  At first I felt hell no, Im done with drugs.  She was very persistent and wanted everyone to have a good time.  Eventually I gave in and took the hit.",
  "I didnt feel much at for about 1 and a half hours, then it hit hard cause Hippy Stan offered me some chronic.  After a few hits, the acid totally overcame me.  I was seeing psychedelic colors everywhere.  All everyone wanted to do was smoke cigarettes the whole night.  We kept going back and forth to the store for Camels.  I remember feeling like I had a never ending cigarette, and could puff on the thing for hours without it going down. Not to mention also looking at Hippy Stan and seeing him turn into satan himself.",
  "That was the most intense part.  I was tripping too hard.  I went to my room to try and find some peace.  I looked at the ceiling dazzled as neon colored women danced round the room.  I never felt too panicky thougout the whole trip, but everything anyone said felt so significant, even if it was just small talk.  I came down, felt a little hung over and fryed out the next day, and called in sick from work, headed over to jamba juice and got something good to drink.",
  "Over the next few days-weeks though, I started noticing I was having severe mental problems manifest.  Something that I had never had a problem with in the past.  I hit a deep catatonic depression, dyed my hair out black when usually Im hippy like, and started having problems with what I can only explain as psychosis.  I started boarding myself up in my room and thought constantly of suicide.  I eventually was fired from my job, started having severe social anxiety problems which I still deal with, and wound up back home, living with my parents.  Eventually I was hospitalized.  I felt somewhat angry and bitter but have since let these feelings fade.  When I was hospitalized, they transfered me to outpatient mental health at Region 3.  I also realised that my HPPD had gotten more severe, permanent trails which I see to this day and this is 3 years after the acid.  While talking to a doctor, he says that acid or past drug use may have triggered something latent in my brain.",
  "What Im trying to say is, my brain is permanently fractured.  Looking into family history of mental illness, there is bipolar, and depression.  I am not anti-drug, but be careful out there.  This IS something I will live with for the rest of my life.  Would I have become mentally ill if I had not used the acid?  I dont know but I do believe that it could have permanently aggravated what I am living with now.  I can say I have dealt with alot of pain due to HPPD and mental illness that may have been triggered by drugs.  It may have come out later in life, but drugs I do believe permanetly aggravated it."
 ],
 "erowid": {
  "id": "69614",
  "citation": " Daniel. \"Deep Catatonic Depression: experience with LSD & Cannabis (ID 69614)\". Erowid.org. Jan 1, 2011. erowid.org/exp/69614",
  "substance": "LSD & Cannabis",
  "views": "3446"
 }
}
