{
 "id": 11185,
 "title": "Do Not Swallow",
 "date": {
  "submission": "2012-04-18T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cantstop",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 mg",
   "administration": "sublingual",
   "substance": "Pharms - Buprenorphine",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I am writing from 20 years of usage and 2 years of physical opiate addiction. I never expected to be addicted. I had walked away from cocaine, methamphetamine, clonazepam, diazepam, xanax,and nicotine. Withdrawal consist of intense pains, sleeplessness, cramping diareah, runny nose, chills, sweats...",
  "I went on methadone for a month and had to quit because I was afraid of having an auto accident and hated having to be at the clinic daily. Quitting the methadone was hard but I did it with the help of xanax and oxycontin. You cannot get off but it keeps you from being sick. A Doctor precribed Suboxone for me. He said it was like closing the door to my receptors but keeping it a little bit open with the opiates. I was on well on my way into withdrawal but It had only been about 26 hrs. since my last OC. The first thing I did was chomp the pill and swallow it whole.",
  "I did not feel better. The Naxalone was 'shutting the door' and giving me headaches. I went online looking for a way to chemically separate the medicine. I found that the Naxelone could not be absorbed sublingually but the Bup could. When I quit swallowing, life became much nicer. I keep the spit in my mouth as long as posssible then I put it in a bottle. The satisfaction does last longer than the other pills. I do plan on phasing off in a month or so. I do have daily chronic back pain that Suboxone supresses.I seem to be getting a lot more accomplished without wasting time looking for pills. It is better than methadone because it does not make me drowsy and it is easier to control.",
  "Abstaining builds reward."
 ],
 "erowid": {
  "id": "69603",
  "citation": " Cantstop. \"Do Not Swallow: experience with Buprenorphine & Naloxone (Suboxone) (ID 69603)\". Erowid.org. Apr 18, 2012. erowid.org/exp/69603",
  "substance": "Buprenorphine & Naloxone (Suboxone)",
  "views": "8574"
 }
}
