{
 "title": "2 Days and 3 Stages",
 "author": "Joce",
 "citation": " Joce. \"2 Days and 3 Stages: experience with Topamax (ID 11186)\". Erowid.org. Mar 3, 2007. erowid.org/exp/11186",
 "substance": "Topamax",
 "bodyweight": "165 lb",
 "report": "<p>I went through a stage a while back where for breakfast, lunch, and dinner I either ingested pills or put them up my nose.  One of my personal favorites is a little orange pill called Topamax.  A friend of mine takes these for her bi-polar disorder, but feeds her extras to me.  The high lasts a very long time for 2 pills, for up to 3 days in some people.  It lasts for me for 2 days, and the high comes in 3 stages;</p><p>*The first stage I feel stupid as hell.  I tried writing a check for my mother my first time, and it took me 10 minutes to get the pen moving to write out the word 'three'.  I find that my eyes cross sometimes when I start feeling really stupid.  This stage is a pretty speedy stage.</p><p>*This is the dopey stage, I lay around and get VERY confused VERY easily.  Sometimes I panic about things, like waking up and finding that my pillow is too thin, or if someone says the word 'spider' I can't stop screaming.  Also, if I try to tell a story, I probably won't be able to get the words out of my mouth.</p><p>*I never really remember this stage, I basically feel stoned towards the end of the topamax high.  But I feel good through the whole high.</p><p>A little tip for all the pill-snorters out there, DO NOT SNORT TOPAMAX!!!! It feels like shit, you'll regret it.  However, it fucks you up pretty good.</p><p>Drinking on Topamax is fun, just as long as I'm careful and don't drink too much.  Smoking on it is fine, smoking with anything is good for me.  But I try not to mix too many other drugs (expecially hallucinagens) w/Topamax, it's really easy to bug out because I are so easily confused.</p>",
 "year": "2001",
 "id": "11186",
 "gender": "Female",
 "timestamp": "2007-03-03T08:00:00.000Z",
 "views": "23146",
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Topiramate",
   "form": "(pill / tablet)"
  }
 ]
}
