{
 "id": 11184,
 "title": "A + A + A + A = 0",
 "date": {
  "submission": "2010-02-13T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Psychedelic Magnate",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 0:10",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(blotter / tab)"
  },
  {
   "time": " T+ 5:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": ""
  },
  {
   "time": " T+ 7:30",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  },
  {
   "time": " T+ 8:00",
   "amount": "3 shots",
   "administration": "oral",
   "substance": "Absinthe",
   "form": ""
  }
 ],
 "report": [
  "<p>The combination that I tried on this day was a poor choice, but not for reasons you may think. The problem was that I had difficulty telling which effects were coming from which drug.",
  "T-0: My friends and I each take two hits of high quality, 90microgram LSD hits.",
  "T-10m: We smoke several bowls of marijuana to pass the time until come-up.",
  "T-2h: At last, the acid has kicked in. This is the smallest dose of LSD Ive ever taken, so there are no hallucinations to speak of.",
  "T-3h: I decide to go to rugby practice, knowing that because Im not tripping too hard, there will likely be no issues. Right as I get to the pitch, mild hallucinations begin, mainly due to cloud formations.",
  "T-3.5h: This LSD, incidentally, is quite potent. Ive begun to grow very confused, but not to an uncomfortable degree.",
  "T-5h: Knowing that there is a huge party tonight, my trip mates and I take 20mg of amphetamine salts each.",
  "T-7.5h: In the past hour, my friends and I have begun to drink a very large amount of alcohol. LSD has always kept me from getting truly drunk, and I take advantage of this by drinking ~15 shots of tequila and ~5 beers. (Note: I DO NOT RECOMMEND drinking this much EVER, as it can have serious consequences.)",
  "T-8h: Not outwardly drunk, my friends and I each take three large shots of Absinthe. After this point, I have a very detailed account of the evening, mostly because of the amphetamine salts but possibly also due to the Absinthe. I have no hallucinations whatsoever, but feel very good and free. Although it seems preposterous, from this point on is the LEAST weird Ive felt all day.",
  "T-8h  T-14h: This period of time went on like a typical party. Plenty of drinking and merrymaking, but very little psychedelic activity. Im not sure what caused this to happen, but it most certainly did. Thanks to the large quantity of alcohol, Im able to fall asleep right away, something I usually cant do on LSD.",
  "Epilogue: I felt incredible the next day, with no hangover but an appreciation for enjoyment. Although I wont do this combination ever again due to its non-psychoactive nature, I enjoyed it as a 'hard head' for a more infantile, basic high.</p>"
 ],
 "erowid": {
  "id": "69602",
  "citation": " Psychedelic Magnate. \"A + A + A + A = 0: experience with LSD, Amphetamines, Alcohol & Absinthe (ID 69602)\". Erowid.org. Feb 13, 2010. erowid.org/exp/69602",
  "substance": "LSD, Amphetamines, Alcohol & Absinthe",
  "views": "4079"
 }
}
