{
 "id": 11186,
 "title": "Enjoyable Tea",
 "date": {
  "submission": "2012-04-03T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "etchask3tch",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Pennyroyal",
   "form": "(tea)"
  }
 ],
 "report": [
  "My experence with mind altering substances is above the average psychonaught having used all the street options(some more than others some waaaay to much) and since I am training to become a Herbalist I have tried many plants and extracts, I have little experence with pharms. Having stopped smoking my favorite green herb for school for about three months now I was feeling the need to experement.  I had purchased an oz of pennyroyal dried herb some time ago and had not needed nor desired to use it.  Most herbal books will tell you that this herb is used as an digestive aid for those who have sluggish digestion. Others will know it from the song Pennyroyal Tea by Nirvana, Kurt Cobain used it for is stomach dissorder.  It also has a few interesting actions such as the abortifacient (to abort pregnancy) minor anti-septic actions and an insect repellant. This plant should only be used in small amounts and if you come by its oil it should not be taken internally.",
  "My mind/body setting is as follows: Normal day low stress, no drugs used in months including alcohol, took my daily multi vitamin with breakfast. Consumed the tea in my room on the computer.",
  "Preperation",
  "Small tea pot about 350ml in volume poured boiled water into teapot with 1g of herb and let steep for 10 min.",
  "t-00 Having the teapot beside me on my desk I could smell a very pleasent aroma simmilar to spearmint crossed with some floral undertones.  First sip is agreeable to the taste without any adulterants",
  "t-20 min I have consumed about 100ml of the tea with much enjoyment the taste is great",
  ".",
  "t-40 min Subjective effects are what i would call balancing rather than seditive, stomach feels good maybe a little hunger.",
  "t-70 min I made an other pot of team same as before stared drinking it",
  "t-80 min Now i have almost consumed two 350ml pots of the tea and I have a slight stomach irritation. Funny as it is used to treat poor digestion.",
  "t-120 min The minor stomach irritation is now gone after having a glass of water I go to sleep",
  "Next day I feel great and normal had a good sleep"
 ],
 "erowid": {
  "id": "69610",
  "citation": " etchask3tch. \"Enjoyable Tea: experience with Pennyroyal (ID 69610)\". Erowid.org. Apr 3, 2012. erowid.org/exp/69610",
  "substance": "Pennyroyal",
  "views": "2591"
 }
}
