{
 "id": 11195,
 "title": "Has Its Ups and Downs",
 "date": {
  "submission": "2009-06-19T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "AsTrO",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 mg",
   "administration": "insufflated",
   "substance": "Oxymorphone",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "This is not my first time insufflating oxymorphone (opana ER) and will very likely not be my last. This is the only painkiller Ive ever abused so I really dont have anything to compare it to. Im an avid marijuana smoker and have experimented with a few other drugs including cocaine and Adderall. Im writing this because the lack of other reports on this fascinating substance disappointed me. Oxymorphone is extremely potent and is said to be about 2-3 times stronger than oxycontin and about 4 times stronger than morphine. Im not sure if this is true or not because Ive never tried either of these.",
  "Every time I have snorted oxymorphone I have experienced extreme nausea and once vomited about 15 times until my stomach was completely empty. I realize that the dosage I usually take is NOTHING compared to that of other users but I find that about 5mg suits me just fine. Although the negative effects (nausea, dizziness, the occasional vomiting, and itchiness) really suck, I find the positive effects (extreme euphoria, strong body high, sense of wellbeing, loss of inhibitions, and the ability to feel a strong connection with others) make it worthwhile.",
  "So, tonight I crushed up a 20mg tablet, after getting off as much of the time release shit on it as possible, and snorted a 7 mg line. I make sure to eat a nice big meal first as I find that doing that doubles the effects. Another thing to note is that its only half as effective if taken orally, crushed and taken as soon as its mixed with water because it WILL GEL UP when it comes into contact with a liquid.",
  "5 minutes- already slightly feeling the effects",
  "10 minutes- feeling the familiar light body sensations as well as a bit of euphoria.",
  "15 minutes- same as before only amplified, hands are noticeably shaking.",
  "30 minutes- vision seems different for some reason as it always does, Im extremely comfortable even though Im just sitting on my crappy desk chair. I cant seem to stop smiling. I think its a good time to put on the song Comfortably Numb by Pink Floyd, as it always enhances the experience for me. Im also starting to get itchy, but that doesnt bother me.",
  "45 minutes- I am a cloud, my shoulders feel as though they are sinking, and I now remember why I love this drug so much. The itchiness is bad now, mostly on my face, but I still could care less. Im experiencing slight nausea, but I find that drinking milk, as I am, helps a lot. Having tried cocaine on numerous occasions I can say that the euphoria is much stronger and almost feels as if it inhabits every inch of my body.",
  "60 minutes- I feel incredible, better than ever, and the music only amplifies the experience. I have a very strong urge to tell someone I love them. I wish this feeling would last forever and I can certainly understand how someone can easily become an addict. I love this drug.",
  "75 minutes- I decided to venture into the kitchen to get more milk and Im now burping and hiccupping which is what usually happens before I puke. Closing my eyes feels very nice. I think the effects are starting to lessen, unfortunately. The itching is getting annoying now. I think Im going to lay down for a few minutes and enjoy my music.",
  "105 minutes- Im starting to step back into reality after a very pleasant and relaxing high. Another great thing about this drug is that the come up is fairly quick, while the comedown is nice and slow, almost rounded. It feels as though Im coming back down to earth after floating around in atmosphere.",
  "120 minutes- nearly all of the effects are gone, but I still feel nice and relaxed. Some people say that they have a hard time sleeping after using oxymorphone, for me it just makes me tired and lets me drift into a nice deep sleep, so Ill be going to bed in a few minutes. Overall, I think this is a great drug."
 ],
 "erowid": {
  "id": "69673",
  "citation": " AsTrO. \"Has Its Ups and Downs: experience with Oxymorphone (Opana ER) (ID 69673)\". Erowid.org. Jun 19, 2009. erowid.org/exp/69673",
  "substance": "Oxymorphone (Opana ER)",
  "views": "37784"
 }
}
