{
 "id": 11197,
 "title": "New Favorite",
 "date": {
  "submission": "2008-09-17T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Blue",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "tsp"
   },
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  }
 ],
 "report": [
  "Ok so like I've been reading online about all of the legal substances I could try so I don't something foolish with them. I originally was looking up info on the H.B. Woodrose seeds which I am not a fan of at all but that's a whole other story.",
  "Anyways on to the Kratom. Now like most people who write their experiences on here I have tried many substances, anywhere from pot to acid. And personally my 2 favorite substances have been of course pot and also ANY type of opiate. I can't get enough of the stuff, especially weed. So when I started reading on different legal ways to get basically the same effects I was more than interested to try. And Kratom seemed to be exactly what I was looking for.",
  "So I decided go through with my purchase for the Kratom 20x extract. It had a review from another person that said a 1/2 teaspoon was all he needed for his back pain, also another reason I decided to buy it. Now even though I had some trouble with the order I still got my order about 2 weeks after I placed it, and it couldn't have come at a better time.",
  "I waited to use for a couple hrs after receiving since I also wanted to use it to help me get to sleep. Then at around 9:20 I decided to make some plain green tea and mix it with it. It didn't mix very well with the tea since it's a pretty thick powder and I heard it works better with hot cocoa which wasn't really true either. But none the less I got it all in my stomach and didn't actually mind the bitter taste of it. I kind of liked it actually.",
  "Then about 20 minutes or so later I could start feeling the relaxation and opiate like effect that most users report. It felt just like when I use to take vicadin or hydrocodone, which I can't take anymore since it does nothing for me anymore from all the constant abuse of the pills. But unlike the pain pills I personally did not feel the itchy annoying side effect.",
  "Kratom for me was all good. I felt relaxed, sedated, and free of my normal back and thumb pain in my right hand which I thought would never be possible. I also felt a nice fuzzy feeling all over which I get from smoking pot sometimes. And that was my favorite part. It lasted all the way till I went to bed and just as I thought it helped me sleep. Normally I dont go to bed till 3 or 4 and sometimes 5 or 6 in the morning and sleep only about a couple hrs since I work pretty early. This time I went to bed at MIDNIGHT!!! And usually I listen to a couple songs before I TRY and fall asleep. This time I listen to like my whole cd of songs cause for some reason even though I was already half asleep while listening to the music I couldnt stop. It was almost intoxicating to listen to. And on top of that I experienced what I would describe as lucid dreaming but not sure. I just kept seeing faces of random people Ive never met just morphing one after another, and it was so real looking, I enjoyed that as well.",
  "All else I can really say is next time Im getting 24 grams instead of 4 and Im gonna try some Wild Dagga with it. I absolutely love Kratom and I dont even think I want to smoke pot again. Which I thought Id never say since I can honestly say that I have smoked weed almost every day except for maybe a total of a month for well over a year. I just couldnt quite I depended on it. But not anymore. Im not saying that Kratom is like weed, cause its not really. I just like it better, also another thing I NEVER thought I would say."
 ],
 "erowid": {
  "id": "69677",
  "citation": " Blue. \"New Favorite: experience with Kratom (20x extract) (ID 69677)\". Erowid.org. Sep 17, 2008. erowid.org/exp/69677",
  "substance": "Kratom (20x extract)",
  "views": "23421"
 }
}
