{
 "id": 11199,
 "title": "Just Like That",
 "date": {
  "submission": "2009-08-27T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Anu",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "sublingual",
   "substance": "Sceletium tortuosum",
   "form": "(daily)"
  }
 ],
 "report": [
  "After trying a variety of medications prescribed and non-prescribed; most being quite unpleasant and usually not very effective, I went back to sceletium which previously I had noticed barely any effects from at all.",
  "For the first few days I swallowed two 50mg pills and was distressed because of the lack of effects but for some reason was sure there was potential in this plant. The change happened when I decided to hold the contents of the pills inside my mouth for 30 minutes or so instead of just swallowing. Within 30-60 minutes I began feeling a lot of commotion in my brain, strange, not extremely unpleasant though. I felt as if my brain was being restructured and rewired. About 4 hours later I felt calm and slightly euphoric but was unsure if this was the exercise I had done or if it was the pills.",
  "Next day I took 100mg sublingually again to see what happens. I noticed the effects coming on just before I swallowed; my brain being reinforced furthermore, I felt peaceful, happy and connected with my peers; able to just sit outside for hours thinking about the world. This stuff works very well.",
  "Sceletium changed my life in that it has enabled me to actually feel at ease and content with things instead of the near constant dysphoria before. Now each morning I take 100mg of Sceletium Tortuosm. The effects have become permanent which always amazes me. What conventional SSRIs take 2 weeks to do and with less effectiveness and a variety of unwanted side effects, sceletium did in a few days."
 ],
 "erowid": {
  "id": "69689",
  "citation": " Anu. \"Just Like That: experience with Sceletium tortuosum (ID 69689)\". Erowid.org. Aug 27, 2009. erowid.org/exp/69689",
  "substance": "Sceletium tortuosum",
  "views": "11151"
 }
}
