{
 "id": 11200,
 "title": "Slurred Speech, Distorted Vision, Extreme Nausea",
 "date": {
  "submission": "2009-07-09T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "buzzyman",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Pramipexole"
  },
  {
   "time": "0",
   "amount": {
    "number": "800",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Metaxalone"
  }
 ],
 "report": [
  "I have taken both of these prescription medications on separate occasions and experienced no adverse affects. The mirapex was prescribed for my brother for RLS and the Skelaxin to me for back tightness in my muscles accompanied by muscle spasms. I recently pulled a muscle in my leg and as I had no pain relievers decided to take a skelaxin to loosen up the muscles. Alone this would have been a good idea.",
  "I also decided to take a mirapex as this causes a fair amount of drowsiness and I was having trouble going to sleep. About 20 minutes after I took the pills I fell asleep... sounds great. Well about an hour and a half asleep I woke up with seemingly slurred speech, distorted vision, and extreme nausea. i managed to walk to the restroom (quite a feat) and vomited profusely for about 30 minutes. After vomiting I sat in the bathroom for another good 30 minutes because I could barely stand. Eventually I made it back to my room and went back to bed. When I woke up again a couple hours later (this time an alarm as I had class) I still felt very nauseous although this time I refrained from vomiting. All together it seems there was a negative reaction with these two medications and I would not recommend mixing. I have a very high tolerance for almost everything, but I still must assume the issue came from both of the drugs being CNS depressants. This could have potentially caused the effects I experienced. Pretty much... don't mix them."
 ],
 "erowid": {
  "id": "69694",
  "citation": " buzzyman. \"Slurred Speech, Distorted Vision, Extreme Nausea: experience with Metaxalone (Skelaxin) & Pramipexole (Mirapex) (ID 69694)\". Erowid.org. Jul 9, 2009. erowid.org/exp/69694",
  "substance": "Metaxalone (Skelaxin) & Pramipexole (Mirapex)",
  "views": "11691"
 }
}
