{
 "id": 11215,
 "title": "Faces Were Completely Deformed",
 "date": {
  "submission": "2010-01-02T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Smash",
  "gender": "Male",
  "weight": 9
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 drops",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "liquid"
  },
  {
   "time": "4:00",
   "amount": "3 drops",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "liquid"
  },
  {
   "time": "6:00",
   "amount": "3 drops",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "liquid"
  },
  {
   "time": "8:00",
   "amount": "3 drops",
   "administration": "oral",
   "substance": "Bromo-Dragonfly",
   "form": "liquid"
  }
 ],
 "report": [
  "[Erowid Note: The individual doses reported here do not add to the total dosage reported (12 drops).  Because we cannot determine which dose is accurate, we are leaving the inconsistency in the report.] ",
  "This was my third time taking bromo-dragonfly. I first took 6 drops of bromo-dragonfly and after about an hour and a half I was feeling very happy and excited. After about 2 hours I was a bit confused and everything around me started to change colour and I realised that I had no depth perception and everything had a green and purple blurry outline around the edges. After about 4 hours me and my friend decided to take 3 more drops each that were on a sugar cube.",
  "After about 4 and a half hours I started seeing patterns all over the walls and floor and everyone's faces looked completely deformed. This continued for about 6 more hours and every 2 or so hours I took 3 more drops until all 12 were gone. The whole experience lasted for about 2 days even tho I hadn't taken any more after the 12 drops were gone and I consumed them with the first 8 hours. I couldn't sleep for days and couldn't relax or get comfortable. I occasionally get flashbacks from the trip when I smoke cannabis. But the whole experience was pretty cool."
 ],
 "erowid": {
  "id": "69775",
  "citation": " Smash. \"Faces Were Completely Deformed: experience with Bromo-Dragonfly (ID 69775)\". Erowid.org. Jan 2, 2010. erowid.org/exp/69775",
  "substance": "Bromo-Dragonfly",
  "views": "6180"
 }
}
