{
 "title": "Beyond This World...",
 "author": "WildFire",
 "citation": " WildFire. \"Beyond This World...: experience with Peyote & Cannabis (ID 11214)\". Erowid.org. Dec 12, 2001. erowid.org/exp/11214",
 "substance": "Peyote & Cannabis",
 "bodyweight": "150 lb",
 "report": "<p>I lived in Mexico for 6 years, and had many experiences. However, one of the most prominent was my peyote trip. My two friends drove over to my house on a friday night (I was staying in to save money for a expensive clubbing outing on saturday) and they said I needed to see what they had in the car. I looked, and inside of a guitar was roughly 6 kilograms of peyote (uncleaned) that they had just picked on the road out to Saltillo (I lived in Monterrey, Mexico). I told my mom I was sleeping over at their house (hey, im 17) and was off. We went to their house and picked up some weed, I rolled a joint on the way to another friends house, then upon picking him up we smoked it and headed out to another friend's house quite far away. During the drive I took 2 bites out of a cactus and found it to be nasty, but not to such a degree as others had told me. It simply tasted like a cactus. Well we arrived at this friends house and began cleaning the cacti. We cut out the middles and tore out the hairs, then blended the doughnut leftovers with fruit juice and honey. There was 7 of us in all and from what I can remember, we all had an equel share of the 6 kilos.</p><p>I started the night by watching a movie with several of my friends, and during the course of the movie my friend had stripped to his speedo underwear and began to wave his arms like mad. I decided to leave the living room and joined everyone else outside, where I smoked some more pot and enjoyed the trance music that the house's owner had spun himself. I recall a black shadow swooping from the trees, consuming the vomit that came from everyone (except for me, for some reason, which may explain the last effects of my trip). However it turned out to be the dog, who wanted to trip with us.</p><p>I cant remember much after that, save that I was lieing on a bed for several hours, tripping HARDCORE. The world had lost its substance, and everything was just a blur, but I wasn't afraid. Ive been struggling to remember what happened and am beginning to remember more and more of the night. I felt as though I had someone there guiding me, helping me through the trip. Everything was out of whack, nothing was how it normally would be, reality didn't exist.</p><p>The next morning I was the first to wake. Everything was a blur, I didnt know what was real and what wasn't. I wandered about, looking at this strange environment not fully understanding what was going on nor what was happening. I began to fret about getting my homework done and woke up one of my friends. Upon waking he woke everyone else up and we sat outside and smoked several joints. I ended up going home late in that day, still heavily under the 'peyo hangover', which lasted well into tuesday. I remember sitting in school and having the teachers face melt and contort as they taught the class, and having the swirls in my wooden desk form faces that mouthed words at me (not sure what they were).</p><p>All in all, I would have to say that the peyote trip was well worth taking, although it requires a good amount of time set aside for it. It's far from a recreational drug, but definatly worth it if willing to put the time into it. Oh, and I didnt 'see God' or any such thing, although I did have a feeling that someone was helping me.....</p>",
 "year": "2001",
 "id": "11214",
 "gender": "Male",
 "timestamp": "2001-12-12T08:00:00.000Z",
 "views": "67064",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "-999.0 g",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "",
   "amount": "",
   "administration": "750 g",
   "substance": "oral"
  }
 ]
}
