{
 "id": 11226,
 "title": "Out Of It",
 "date": {
  "submission": "2001-06-04T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nick",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "80",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Paroxetine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have been on Prozac, Remeron, a small amount of Risperdal (for anxiety), and most recently Paxil.  With each of these anti-depressant drugs, they change you for the time you are on them.  Prozac created a strange constant high feeling and a careless state.  None make you happy, they just make ur emotions dead.  Anyways, I started on 40 mg Paxil and it wasn't working well, so I went up to 80 mg.  Eventually I started to doubt it a lot and looked online for reports on the drug.  I found that many found it hard to withdrawal from paroxetine.  And they were on low doses such as 20 mg and so on.  This freaked me out in a way and I decided that I'd get off this horrid substance.  I never have had trouble getting off of any drug in the past so I assumed it would be no problem.  I decreased the dose from 80 mg to 60 and then a few days later to 40, then to 20 and then to none at all.  I was off it completely on Tuesday.  I had been feeling very out of it during the decrease and it became even more apparent once I got off it completely.  It is WEIRD!!!  I cannot describe the feeling exactly.  The best I can say is...",
  "1.  I feel out of it and out of touch with reality yet intouch all at the same time",
  "2.  I feel very sick. Nauseous and as though I will pass out at any moment.  Yet to my disappointement I never pass out.  I hope that I will pass out and wake up feeling normal yet again",
  "3.  I shake sometimes uncontrollably in a way I can best describe as taking tons of Ritalin while you are suffering from a bad stomach bug",
  "4.  Very odd strange dreams, that are simple to recall",
  "5.  Worry!  Nonstop feeling that I will never be the same again.  That Paxil has messed up my brain and that I am ruined",
  "6.  Sadness and extreme tiredness.  Just wanting to escape",
  "I probably missed stuff, but I am still out of it as I write this.  Tomorrow it will be one week since I have been off Paxil completely.  I am very worried and don't feel my symptoms have tampered off at all.  I took Paxil for severe deppression.  I have never been more scared than recently.  I don't care if I am depressed or whatever, I just want to feel 'OK' and normal again.  This is not how I used to feel and I hope that it will wear off soon.  Paxil stays in your blood for around 10-14 days.  I've been off 6. Very scary and not cool.  I hate this medication and will never take it again.  I have been asked if I would take it again to relieve this feeling, but I refuse to.  I don't want this stuff in me.  I keep telling myself I'll feel normal again eventually, yet I can't stop worrying.  I have thought that if I don't feel normal again in a month that I will kill myself. ",
  "This stuff is seriously horrible.  Don't go on it.  I never thought I'd go through withdrawal on a medication so similar to Prozac and all the other antidepressants.  They all work the same way (SSRI's).  But this one is different in some whacked up way and there is no reason to take a chance on it.  Please don't risk it."
 ],
 "erowid": {
  "id": "6983",
  "citation": " Nick. \"Out Of It: experience with Paroxetine (Paxil) (ID 6983)\". Erowid.org. Jun 4, 2001. erowid.org/exp/6983",
  "substance": "Paroxetine (Paxil)",
  "views": "43932"
 }
}
