{
 "id": 11224,
 "title": "Pleasure not Intensity; Meaning not Import",
 "date": {
  "submission": "2001-06-22T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mahan Atma",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "32",
    "grams": 0.032
   },
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "capsule"
  }
 ],
 "report": [
  "May 20, 2001 - 32 mg of 4-Acetoxy-DIPT in a gelcap at 6 PM.",
  "This was my first time with this substance, and I found it to be quite a remarkable experience.  M took 36 mg at the same time, second time for her. Effects were noticeable in about 45 minutes. No body load or nausea whatsoever, despite the fact that I did not fast in advance. I got the usual warm, energetic/vibratory feeling in my stomach and chest area, as I do with most entheogens.",
  "We hauled the mattress out into the living room and hung out there all night listening to music.  Had great sex twice.  The experience was very sensual, very touchy-feely. M's skin so soft and smooth, everything very slippery and sensitive.  The cats' soft fur coats were a real indulgence. There was some slight visual distortion, but nothing remarkable. Things were a little 'wobbly'.",
  "Music sounded tactile almost, I enjoyed it immensely.  Everything took on an air of cosmic significance, but not 'importance'. Meaningful, but not dramatic. I felt almost as if I knew what was about to happen next, but did not want to spoil the surprise of the next moment. Very empathogenic feel. I felt happy and satisfied, everything is A-OK. I found it quite easy to slip off into (and out of) another state of mind, almost like an LSD trance, but without the visuals and intensity. Rather controllable, or malleable. ",
  "M and I sat staring into each other's eyes for some time, and things got very strange. After three hours, we watched the season finale of the Sopranos, and it was very intense.  The scenes about the son getting expelled and the exploding father really hit home, as did the references to drug use at young ages.",
  "I wouldn't know how to classify this experience on Shulgin's ++++ scale; if I had to, I'd say it was somewhere between ++ and +++.  While it was fairly intense, it was also quite subtle.  Things were very different, but much of the time I was at a loss to say exactly how. (The Beth state?)  I would not have driven;  although I probably could have done OK had I been forced to, I certainly wouldn't have attempted it unless forced.",
  "The experience lasted a lot longer than I had expected.  I was still going quite strong 4-5 hours into it.  It was not until midnight that I was able to fall asleep, and even then I could still feel the effects. Overall I enjoyed it a great deal, although I'm not sure how. It was rather spiritual and highly pleasurable, but not overwhelming or earth-shaking.  I  look forward to using it again."
 ],
 "erowid": {
  "id": "6981",
  "citation": " Mahan Atma. \"Pleasure not Intensity; Meaning not Import: experience with 4-Acetoxy-DiPT (ID 6981)\". Erowid.org. Jun 22, 2001. erowid.org/exp/6981",
  "substance": "4-Acetoxy-DiPT",
  "views": "12821"
 }
}
