{
 "id": 11225,
 "title": "Cubes on the Sky",
 "date": {
  "submission": "2013-07-20T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mushroomike",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "fresh",
   "specific": "P. semilanceata"
  }
 ],
 "report": [
  "Hello, my name is Michael. I am 22 years old, I'm a born American, raised Mexican. My dad is a retied hippie now a Mexican art craft dealer and producer, my mom a Mexican Indian. I live in the USA until 5 years old and move to Mexico and live most of my life there, but I travel to both countries regularly. That's why I dominate some English. My record with psychedelics is brief.",
  "I'm not so sure why exactly I start using them but I surely approach with a lot of respect. I was always aware of the stories of people going insane, losing contact with reality forever, lost souls. But for other part it was clear that this type of substance was a thing that you had to take to really know for your self, because in Mexico it's a great subculture around the theme. A lot of the people that introduce to the mushroom was talking about shamans and now I remember that I read some books of Castaneda years before. Here was where I really like the idea of the use of plants as medium for knowledge.",
  "To this day a have used 3 different types of mushrooms, but none of the other 2 experiences was so bizarre and amazing as the first time, so this account is really of my first time I use mushrooms.",
  "This was the year of 2005 in the month of July, in the town of Taxco Gro, Mexico. I was at that time working in a body art studio. My teacher by the name Oscar started organizing a trip to Cuernavaca, his own home town, and from there to Tepoztlan Morelos...that's a 40 min drive from Cuernavaca. In Cuernavaca the brother of Oscar, Alejandro and another friend nickname Pecas joined the search, by the morning we moved to a part of Cuernavaca named Ocotitlan, we jump fences and get in little grass clears where the cows are moving around.",
  "So we start searching for the mushroom. For that time I really could not identify a mushroom, I mean the only way the expert group was able to identify the mushroom was smelling it. Now I understand how that's was working, I definitely can smell a psylocibyn mushroom. Oscar was in charge of verifying my mushroom as good or bad, so you can imagine that I was a little nervous about how this was going to happen, part of my brain was aware of its scientific speech that eating a mushroom finally is a kind of intoxication, and that sort of word is tied of others like death.",
  "So the day continued with us finding mushrooms to be able to fill a bag, I'm still not clear about the real type of mushroom. We at that time where calling theme by the name of pajaritos (little birds) but now I know that definitely there where not of this kind, I have found the ones call by this name in woods in other trip for that time a verified with a book and definitely was pajaritos. I'm suspicious that the kind could be Psilocybe semilanceata called mongui, but the truth is that is difficult at this time to identified with precision the real kind.",
  "We drive all the way to Tepoztlan. It was a beautiful Sunday, no clouds in the sky just a perfect day, Tepoztlan was green and totally alive. I don't know if you are familiar to this place at all, but I can definitely say that Tepoztlan is one enigmatic place, you can find a lot of UFO information in the place. That's no the impressive thing, there is a incredible structure made in the mountains and a strange force...definitely you have to be there to understand, for that time I really didn't give much credit to the place, it was just another place for me.",
  "We start walking up a mountain in a dry river course, now that I think about it is pretty strange that there was no flow and it was the middle of the rain session. We finally decide to stop and eat and start tripping. I was very meticulous about how many mushrooms I was going to eat. I was going to do it gradually for some reason, probably to try to stop the madness if I feel something not right. Silly idea but I start eating some, probably more that I was aware cuz I lost the count. The trip started for me very normal and it keep the same way all the time. I was enjoying a day in the woods, was really could inside the shadows of the trees. There was really a little shine coming through the trees. I was sitting in a rock, waiting for something to happen, watching my friends going around, looking at me strange or avoiding communication every one was on there on situation.",
  "I think that the decision of using a small quantity of mushroom was a really smooth entrance to the psychedelic state of mind. I remember that I wasn't bored. I always feel good in the woods, so I just start listening the birds, in some moment I realize that it was really beautiful sound and was a full sound I mean every bird was fundamental to make this sound so perfect, and during the experience there are lapses where I lose yourself in the things, I just don't now where am I, so in one of these lapses I start hearing some strange sounds. I remember a thunder sound but very far and smooth, then was a sound of what a identified with a cargo truck, hydraulic metal sounds, then something more was on the sound range this time was more close, it was like really just above my head on the other side of the trees, and it was making a indescribable sound something between water and air, a real sci fi sound.",
  "In that second I realized that this sounds where no normal in the woods, I mean like a thunder in a sunny day? A cargo truck? We are far away of everywhere. I start thinking what was going on. I was more in my normal everyday me that elsewhere, but strange for me I didn't feel scared of anything, just confused, but I thought I was just my own tripping, then I remember listening to foot steps. First I deduce it was some of my friend but with a closer look every one of theme was sitting quiet. I hear the foot steps and thought it was probably some other people exploring or whatever, cuz my friends do not make any expression of surprise or anything.",
  "So I move away from my friends and start moving up the river course and I sit in a bigger rock and I start hearing more foot steps, but this time was definitely something that disturb me, some one was moving around me in the woods, I don't know how but I was aware that it was something in two feet like a humanoid. And it was looking! I could follow only his sound of moving inside all those plants, I try to look very hard, buy I start seeing thousands of eyes, everywhere, so once again a said it was just my tripping paranoia.",
  "I decide to go back with my friends, for my surprise I find Alejandro walking towards the woods and saying Come on! Show yourself! Definitely I was not the only one aware that somebody was out there. So this was not just my own trip, my friend Oscar decide to walk back to a little clear just down the river curse, so all we get out of that place.",
  "Once in this little clearing everything start to fall in place and at the same time reveal, we start talking about this sounds, everybody was hearing the same thing! Someone just said is a freaking alien. They are here for good, no doubt. Of course I was unable to come with nothing. It was just to strange everyone of us was aware of the footsteps or these presences, something intelligent looking at us for sure.",
  "In that same spot in middle of our words, the sound start again, there it was clear and loud, a very rare sound I can't described, Alejandro was just trying to see it, wherever it was it was invisible. Oscar shouted out It's just the wind! Come on! Forget about it. Later he told me he wast tired of the intensity of the facts.",
  "Alejandro shout back  you are stupid dude, that's no wind. This time we where in the open we cud look right to the blue sky, the strange sound just continue just like our conversation, went on other issues.",
  "Another strange situation happened here. Just as we were sitting there in the grass talking, a group of people walk by. These people do not even see us, they pass right by us talking normally joking and all, but every one of us was waiting for some response of theme but the look like we where not there, invisible.",
  "We continued our conversation. Oscar was talking about the last time he came here with another friend and that friend put a offering to the gods of the mountain, putting some stones together in a pile. When Oscar was explaining these actions he points to the top of the mountain and says 'What the hell is that?' And there it was, a black hole in the sky, just like that, it was moving slowly it had an exact course with the sun in its back, I still have this clear image in my mind of everybody looking up to this thing, and I though, is this is a joke? Or what? How they are doing it? It was something different about it. I mean I do not feel it, like something real, but at the same time it was there in the sky everyone of us was surely seeing the same black hole. The hole followed an exact course with the sun making a eclipse effect. I use one of the descriptions that Alex later give about that moment, 'it was like being a bug inside a glass.'",
  "In that exact moment of the eclipse the time seemed to stop, the birds disappear all sound everything was on mute, the wind stop, and I hear the voice of Alex that it was just in front of me, the effect is was like in slow motion, he said nothing moves! And it was true!",
  "The black hole continued it traveling across the sky and disappear behind another mountain. We decided to go to the town and from there to home. On the way back, inside the car just before starting to get inside the principal town, I saw it bright and clearly in my right window, it was just one second and I lost sight of it, but that second has lasted since. It was a gigantic Cube but at the same time was a circle, one face has a metallic red and the other metallic blue, the size about a small car. I shout it to everybody that the thing wherever it was it was back! Now in colors.",
  "We drive up to the center to take a look at it from a mirador (seeing place), once we enter the top where it was the town, we encounter a police check point, they were looking for somebody because they were asking for IDs. I remember that we had drugs, but for our surprise the police just pass by us, they did not see us at all. Once again we did not exist.",
  "We park close by and jump out of the car, we where standing in a corner Oscar, Alex, Pecas and me all of us pointing to the sky and looking this cube shifter changing colors in the sky, the rare thing is that nobody was interested in our visions, the people not even look up, we where like ghosts, it's for sure the reaction of somebody that points to the sky that the other reaction is to look up.",
  "Eventually the cube disappear in front of our eyes inside the mountains, we tried to followed but it was worthless, we never saw it again.",
  "I wonder sometimes if there are more people out there that have any similar experiences, if there's any place to put me in contact with to share the story. I would really like that.",
  "Peace,",
  "Michael."
 ],
 "erowid": {
  "id": "69813",
  "citation": " Mushroomike. \"Cubes on the Sky: experience with Mushrooms (ID 69813)\". Erowid.org. Jul 20, 2013. erowid.org/exp/69813",
  "substance": "Mushrooms",
  "views": "547"
 }
}
