{
 "title": "Did Balloons Cure My Migraines?",
 "author": "Samanthe",
 "citation": " Samanthe. \"Did Balloons Cure My Migraines?: experience with Nitrous Oxide (ID 11245)\". Erowid.org. Dec 25, 2001. erowid.org/exp/11245",
 "substance": "Nitrous Oxide",
 "bodyweight": "125 lb",
 "report": "<p>When I was 20, I suffered from migraines. I attribute their onset to a battle with an anxiety disorder I was suffering [see Terror Blossom]. I have heard a number of theories about migraines; the one that seems to fit for now is that repressed rage can be a root cause. I think I am exorcising repressed rage, so this is the theory Im currently working with. After all, these are all stories we tell ourselves; maybe 200 years ago I would have thought that the migraines were evidence that I was possessed by demons. Maybe 20 years from now there will be a black and white biochemical explanation involving yet-undiscovered receptor sites. I dont care. My theories on my migraines are part of my own personal mythology and not substantiated with hard data, but for the purposes of this story and my life, they work.  </p><p>I was at university, and consulted a neurologist at Student Health for my complaints. My neurologist, a clearly physically unhealthy woman who barely talked to me, prescribed several meds to help keep the migraines at bay: propranolol (a beta blocker) as a prophylactic, ergotamine once I felt a migraine coming on, and Fiorinal as an analgesic once one hit. She also made me quit my oral contraceptives, because a woman can be at higher risk of stroke if she suffers from migraines and is on birth control pills.</p><p>I dropped down to 9 hours of classes. I felt utterly out of control and depressed by my dependency on my meds. I was constantly scanning my mental and physical landscape for signs of a possible migraine. When one hit, I would sometimes throw up from the pain. I developed a tolerance to Fiorinal, and generally felt like a slave to the meds. It was demoralizing. One day I followed my intuition and stopped taking all the meds. (I know now this is not recommended for beta blockers but I didnt know that then.) I started to feel better. I still occasionally felt that grip of fear, the oh no! is one coming on? feeling of loss of control, but these were becoming infrequent, and I could generally control them. I didnt feel I had truly gotten a grip on my migraines until I discovered nitrous oxide.</p><p>I had been afraid of nitrous, because the one experience I had had with it was during a painful dental procedure at the age of 16. I got nausea and the spins so bad that I violently wretched. I had a bad association with nitrous. Then I tried it recreationally, and it felt like an orgasm that began in the middle of my back and rolled over my shoulders and head like a wave. My attitude about it changed after that. The next day I had access to unlimited balloons. This is where I feel I cured myself of migraines.</p><p>I was sitting out on a blanket in the sun. I had breathed in about three large breaths of nitrous, making sure to get enough oxygen in between. And then I felt it, the familiar feeling in my head that spelled out, MIGRAINE COMING ON. Only this time, rather than being accompanied by the oh shit! and the fear response, I objectively felt the sensation as just that, a physical sensation in my head. I dissociated it from the pain and fear. I unhooked the response from the trigger. It felt like a revelation, a delightful liberating feeling. For so long I had anticipated migraines that I was conditioned to fear them. This conditioning was erased with one session of nitrous oxide.</p><p>I still get the funny sensation in my head, and I really wish I knew what it was. Sometimes it feels like its pulsing, like a vein. I dont know what it is. But I dont think Ill get migraines again.</p>",
 "year": "1994",
 "id": "11245",
 "gender": "Female",
 "timestamp": "2001-12-25T08:00:00.000Z",
 "views": "18313",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "3 hits",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 ]
}
