{
 "id": 11242,
 "title": "Near Death",
 "date": {
  "submission": "2008-04-18T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "King Tut",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Oxymorphone",
   "form": "ground/crushed"
  },
  {
   "time": "1:00",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Oxymorphone",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Last December I had my closest brush with death in my whole life. The substance I used that day is one that I never want to try ever again.",
  "You see, for about 2 1/2 years now I have been addicted to prescription painkillers (opioids) and have experienced the entire family many many times over. I have ingested every substance from tramadol, codeine, and propoxyphene, to heroin, fentanyl, and morphine and none have compared to the potency of this painkiller. The painkiller in question is named Opana, and is an extended release formulation of the semi synthetic opiod oxymorphone. After procuring the drug off a friend who had a relative prescribed to it, I decided to go over to a friend's house and snort half a pill. About 3 minutes after snorting the half, I started to notice the ever so familiar warm opioid feeling coming over my body and head. This opioid buzz however, was different from any other buzz I have ever experienced. The buzz was so euphoric and enjoyable, I felt as if nothing mattered in the world and everything was fine. After around an hour of this feeling a friend of mine wanted to try this pill out so I broke up the other half between us and insufflated my share. After that we went outside for a walk or a cigarette and that was the last thing I remembered.",
  "I woke up in a hospital bad shaking violently with tubes sticking down my nose and mouth and barely being able to breath. I thought maybe I had had a seizure because I am prone to them, but this felt different. The doctor explained to me that I had overdosed and that I had stopped breathing for a few minutes and had CPR administered to me. I was in a state of utter shock! How could I OD off of less than one pill of any kind I asked myself? My tolerance to opioids is somewhat astronomical so this was an astonishing thing to happen. Obviously I have learned a great deal off of this and have limited my drug use to Ultram (tramadol) and other weak opioids."
 ],
 "erowid": {
  "id": "69911",
  "citation": " King Tut. \"Near Death: experience with Oxymorphone (Opana ER) (ID 69911)\". Erowid.org. Apr 18, 2008. erowid.org/exp/69911",
  "substance": "Oxymorphone (Opana ER)",
  "views": "43191"
 }
}
