{
 "id": 11248,
 "title": "Powerful Visions, but not for Fun.",
 "date": {
  "submission": "2008-09-14T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Tapariyas",
  "gender": "Male",
  "weight": "10 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Brugmansia",
   "form": "(tea)"
  }
 ],
 "report": [
  "Before going into the details I should like to stress that this plant is most definitely NOT for recreational purposes. Not only is it within the realms of possibility that death may be caused, but the effects do not feel particularly pleasant. This is a plant to be approached with respect.",
  "I have decided to describe one session in detail, and to mention others in passing.",
  "At the time of this experience I was 20, and very much interested in the shamanistic aspects of awareness. I had not ingested any other possible interfering / exacerbating substance. My mindset was one of mild excitement. I did not have any fear or apprehension. It was more a case of 'I can't wait!' I had not had any experience of any psychotropic substance previously.",
  "The plant I used was Brugmansia suaveolens, and I grew it from seeds bought from a gardening company. When the plant was approximately 5 feet tall I cultivated the root, since books I was reading around the time advocated the use of these.",
  "I cut the root into smaller pieces and placed these into a saucepan of boiled water which was then allowed to simmer. The idea was to simmer until most of the water had evaporated, and then add more, repeating the process. I ended up with a fairly thick, yellowish liquid that smelled vile and tasted worse.",
  "Once it had cooled sufficiently I drank about a teacup of the liquid and waited. And waited. And waited. It was fairly late at night, and when I felt tired, I went to bed, thinking it was a bit of an anti-climax. Approximately 90 minutes had elapsed.",
  "When I woke the next morning I felt really strange. My head felt as if it were as big as a room, and that I was inside it. My body felt like I was going down with a mild dose of flu. I also remembered a dream:",
  "(At this time I was doing A Level college - precursor to going to university)",
  "In the dream I was in the canteen at college, sitting at a table. In walked the history lecturer and the sociology lecturer. One said to the other 'Here's that book you wanted, 'Churches Of England And Wales'.' The book was then handed over.",
  "The dream was fairly innocuous, especially as my further assessment of the after effects of the brew I had imbibed revealed more unpleasantness. When I went to the bathroom I noticed my face looked blotchy and grey. I felt like I was hungover, though in this year I neither smoked anything nor drank alcohol.",
  "When I tried reading a book I noticed I had severe double vision. I could not read. I felt panicky  - maybe I had caused some kind of brain damage.",
  "I went downstairs and told my brother, who was sitting in an armchair, what had happened. He then vanished. I had hallucinated the whole conversation.",
  "Not surprisingly, I didn't go to college that day. By the late afternoon my vision returned to normal. The only symptom that persisted (for weeks afterwards) was that everyone I knew was false in some difficult to describe manner - in hindsight I suspect this was more of a psychological reaction to the ingestion rather than purely chemical / biological. The next day was a day off anyway, but on the day after that I went to college as normal. I sat in the canteen, and in walked the history and sociology lecturers, one saying to the other 'Here's that book you wanted, 'Churches Of England And Wales'.' I was stunned.",
  "Other bits and pieces.",
  "I found that predicting the dose required was erratic. It seemed that the same amount of the root from different plants would be unpredictably stronger / weaker. Obviously, with each root I'd start very small and work my way up if needed.",
  "The SUAVEOLENS HANGOVER is what I call the morning after effects. Typically I felt slightly ill at ease and unable to concentrate very hard. I noticed that if I played some music and lay down, eyes closed, after a while the music would mutate into what I thought was a weird conversation. After a further while I would begin to wonder why the other person was talking such rubbish, and then the conversation would mutate back into the music.",
  "When I tried combining smaller doses with shamanic drumming, the visions I had were not black and white, nor were they fully colour. The visions were in hues of yellows, greens and browns."
 ],
 "erowid": {
  "id": "69936",
  "citation": " Tapariyas. \"Powerful Visions, but not for Fun.: experience with Brugmansia suaveolens (ID 69936)\". Erowid.org. Sep 14, 2008. erowid.org/exp/69936",
  "substance": "Brugmansia suaveolens",
  "views": "12450"
 }
}
