{
 "id": 11257,
 "title": "Wow",
 "date": {
  "submission": "2011-08-24T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "slongo",
  "gender": "Female",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Pregabalin"
  }
 ],
 "report": [
  "<p>After a week on Lyrica in 2007 I followed Dr instructions to double the dose. Not long after (days) I experienced a week of euphoric, labile mood, with intrusive but not unpleasant memories from past. Music from the 70's constantly popped to consciousness with an urge to belt them out with passion. I felt happy and socially engaged, which was odd for a usually melancholic, hypoactive introvert.",
  "This all came to a sudden end when I experienced a profound memory recovery of a accidental head injury in 1976 from which I walked away unrecognized and untreated. The memory shocked my conscience and I experienced a reconnection of previously insignificant events. Much changed that night in December 1976.",
  "As it happened so long ago, I've had a unique challenge. I have processed the reality of what happened and reimagined my life story over the last two years but I have not been able to move on as yet. I think about it every day, trying to fit in some new piece from the puzzle. I am in therapy and no longer on Lyrica though willing to have a trial period again to see what I can explore further. I'm an old hippie and a psychonaut so a little altered state doesn't scare me. My experience has been mostly chalked up to drug reaction/hallucination, although there is a police report from the accident 30 years ago. I didn't hallucinate that. And I don't know how the 30 year old memory of explosive head impact would figure into a drug induced hallucination.",
  "Anyway, Lyrica,...thumbs up.</p>"
 ],
 "erowid": {
  "id": "69991",
  "citation": " slongo. \"Wow: experience with Pregabalin (ID 69991)\". Erowid.org. Aug 24, 2011. erowid.org/exp/69991",
  "substance": "Pregabalin",
  "views": "6241"
 }
}
