{
 "id": 11272,
 "title": "2C-Please-B-Mine-4-Eva",
 "date": {
  "submission": "2008-07-09T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Xen",
  "gender": "Female",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "35 mg",
   "administration": "oral",
   "substance": "2C-B",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The Intro:",
  "2c-b has always been a chemical I have seriously wanted to try, my fiance was always said it was his favorite hallucinogen back in the day the one, and only time he tried it many years ago, but when we got it we were greatly surprised to get several pills that are orange and pressed like ecstasy with the playboy symbol on them. the only thing that set them apart from ecstasy was that they were about the same size as a smarty.",
  "The Come up:",
  "Each of us took 2 at about 3:00pm, we were hoping to have a day-fry and hopefully catch sunset during our peak. The 4 of us were sitting on my large bed watching the last mimzy as the chemical started to take effect. The first effect I noticed was that everything looked posterised. There is a photoshop filter called posterise and it brightens all the colors and gives lines and details a black accentuation almost like a shadow or cell shading, think of a scanner darkly but not as intense. Like it does on acid sometimes, and my physical perspective and depth perception we off. The walls and my bed were warped as if they were being wrapped around a very large sphere, now dont get me wrong this was a very subtle effect. I experienced the chills, we call it an acid moment. When on LSD the chill goes from the bottom of my spine up and out through my neck and arms. On 2c-b the chill more falls on the back of my neck and down my shoulders, kind of like static snow. As we all started coming up we started noticing an antsy 'We have to get up and go' sorta feeling so we all decided to go for a walk.",
  "The Visuals:",
  "Outside was very interesting altho I would not suggest taking this drug outside in the sun, it was very uncomfortable. My depth perception was so off that I could not solidly distinguish between which trees were close and which one were far away, and they shifted in between each other and changed distances as we were watching them. The small branches greatly resembled fractals at the top where they bled in with the sky and the spaces between the twigs and branches in the body of the trees resembled octagonal prisms. In fact all the general hallucinations were geometric, leaning more towards circular, hexagonal or octagonal. The things that really caught my eye are the circular things, like for example medium long grass, less than a foot high, there were many blades sticking straight up but the ones that kept catching my eyes were the ones that were bent over and were making semi-circles at their base. Rocks appeared more round rather than sharp and rough. Then there were the colors. They reminded me greatly of mushrooms, they were vivid and defined, they didnt change or shift but were generally very clean and some-what plastic like. In fact the shines off cars and pretty much any bright pinpoint, it kind of reminds me of when the light from the heat light in the bath room bounces off the surface of the water in the bath tub and reflects all around the room.",
  "The biggest problem with being outside was that we felt out of place, almost watched. while everything was very cool to look at, we just didnt feel right, after being outside for 45 min we decided to return to the house. The walk back was interesting as we were reaching the height of the come-up, and the sun was sinking very low in the clear, bright blue sky. It was the end of winter, everything is brown and yellow and dead looking and the sun hanging so low and casting such an intense light in our direction made everything look and feel to me and one of my friends, very post-apocalyptic.",
  "The Feeling:",
  "When we returned to the house we all fumbled around trying to find something to do, we didnt really all stay together like we do on LSD, we didnt even really want to, in fact one of us spent the entire trip talking to my mother, why I could not tell you. I suppose if wed had a little more information we wouldnt have wasted so much of our high, none of the 'normal' fry activities we like were entertaining us. Finally I got bored and put on some Infected mushroom. The Bass ran through me like it was meant to be there. My body almost started moving without my consent. The liquid (dancing) started flowing out of me like it did in the old days of ecstasy. I havent felt that emotionally inspired in years. The music just seemed to call to me. This felt right, this was what was missing.",
  "This chemical really should not be done outside simply because its not an organically natured chemical. Imagine going out and taking ecstasy at 3 pm and watching the sunset. Not very likely, right? We now know that our main mistake was trying to treat this chemical like a fry-chemical when really the high is more like ecstasy than anything else. However, The high is only sort of like ecstasy, I didnt feel like it was forced upon me, I didnt grind, I didnt overheat, I didnt sweat a lot. I also didnt look like I was on ecstasy, things feel really nice but I wasnt compelled to rub on them for hours at a time. Watching my fiance on 2c-b I would have to say that he looked content. For the first time EVER he appreciated my infected mushroom.",
  "The Body High:",
  "This stuff it nuts, I felt like I was vibrating pretty much the whole time, almost audibly. I felt very light and agile. I hadnt even noticed how much I was dancing until I started coming down and my muscles started hurting. When on Psilocybin mushrooms I experience a sort of mucus membrane that builds up all over my body, I tend to get what we call mushroom film or slime, my hands get clammy, my eyes leak, my nose runs, my mouth waters, but its all sort of thick feeling and uncomfortable. On 2c-b the 'mushroom film' is more like a light mist of water, I was dancing up a storm and no matter how much I danced I didnt sweat normally, it just evaporated off of me leaving nothing but a clean dry surface. The whole experience had somewhat of a clean feeling to it.",
  "We were connecting on a level we hadnt in a long time. We were freely talking and sharing our opinions but we were all very friendly and agreeable. Rather than making us look and act like alien sex monsters it more seemed to just make us content and artistic. At one point my fiance tried to change the music to drum and bass, at first it seemed good but after a few minuets it started to wear on my patience, so I told him and he agreed, we changed it back to infected mushroom. It really seems like this drug REQUIRED techno for it to be sufficiently fun, and not just techno, LOUD psytrance.",
  "Another important thing is that sweet food and trippy flavored gum is amazing on 2c-b, I suggest trident splash: blackberry citrus. Biting into that gum for the first time had got to be the best reaction anyone has ever gotten out of me over a piece of gum, as I bit into it the light blackberry syrup squished out and coated my tongue, and man was it surprising, and as I continued to chew it continued to gush delicious blackberry juice. And man, NOTHING entertains more than gummies, gummy bears, gummy worms, 'juju' fish, mixed fruit gummies, peach rings, we had the works, not to mention fanta, strawberry kiwi juice, bottle pops, and many many more things of that sort. I really didnt think they would be that much of a hit when I bought them. All and all this stuff feels more like ecstasy for jaded ravers that have gone the way of psytrance rather than the way of drum and bass.",
  "Negative Effects:",
  "When I was in the kitchen trying to make some ramen I rubbed my nose and my nose ring scrapped my septum, now this happens a lot and I get a little minor nose bleed but when I did it on 2c-b it started GUSHING, it could have just been that time but I found it too coincidental, it is likely that it may have thinned my blood or raised my blood pressure causing me to bleed more, or it may inhibit clotting, use caution. In the morning we all noticed that we had a splitting head ache but most of us also accounted for one the night before while we were still high, so it may have been the copious amounts of sugar we ate the night before. Other than that it seemed to have no hangover effects other than slight fatigue. Later we tried about 20 mg of 2c-b and about 250 mics of LSD, and did not have a head ache the next day so the odds are it was just the sugar.",
  "In conclusion:",
  "I adore this chemical! it made me feel great while making me feel intelligent at the same time. If someone were to design a drug that in theory is a harmonized combination of acid and ecstasy I feel this is it, I didn't get that icky body high acid gives me, at a moderate-ish dose in the right environment I really feel that there is a very low chance of panicking. There is no grinding, virtually no after effects, I always felt that LSD and MDMA/MDA felt as tho they were inflicted upon me but this more just alters things to make them more interesting and enjoyable. I am not forced into a state of happiness, or a vessel for living expressive art, it really is much more mellow in every way."
 ],
 "erowid": {
  "id": "70060",
  "citation": " Xen. \"2C-Please-B-Mine-4-Eva: experience with 2C-B (ID 70060)\". Erowid.org. Jul 9, 2008. erowid.org/exp/70060",
  "substance": "2C-B",
  "views": "28772"
 }
}
