{
 "id": 11296,
 "title": "Damiana Smoking",
 "date": {
  "submission": "2013-02-05T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Damiana Devourer",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Damiana",
   "form": "(dried)"
  }
 ],
 "report": [
  "Due to my job I am often (more often than not) unable to partake in the use of cannabis.  After doing much internet research on 'herbal alternatives' I decided Damiana would be worth a shot.  Most 'herbal smoke' websites sell Damiana in bulk for several dollars plus shipping, but I procured half an ounce of dried Damiana from a local herbalist store for less than one U.S. dollar (plus I didn't have to wait a week for it to ship).",
  "After several tests of smoking the dried herb (usually in the form of a joint) I have concluded that despite much debate, I definitely experience some psychoactive properties associated with Damiana.",
  "While the Damiana experience is nothing like a cannabis smoking experience, I find that it can offer an enjoyable sense of well being and relaxation and in my situation it provides a satisfying substitute for cannabis.",
  "After just four or five hits on a medium size joint I can feel a mild buzz and euphoria set in.  Usually the mild buzz is VERY mild and other times it is quite noticeable and I am not sure what causes the inconsistency.  However, despite the amount of 'buzz' that comes there is always a general mood lift and relaxing euphoria that presents an 'all is well' feeling.  I did notice a slightly greater appreciation for art and music but I think that is mostly related to the feeling of euphoria.  I have only rarely experienced any of the aphrodisiac like qualities commonly associated with Damiana.  There does seem to be a feeling of increased blood circulation but I never feel any effect on my heart rate.  Smoking anything is not good for you so I do not use it daily, but in my sporatic use I have not yet noticed any adverse health effects.",
  "As always, do your own homework before imbibing any substance.  Damiana is known to cause problems for diabetics and to interfere with absorption of iron."
 ],
 "erowid": {
  "id": "70305",
  "citation": " Damiana Devourer. \"Damiana Smoking: experience with Damiana (ID 70305)\". Erowid.org. Feb 5, 2013. erowid.org/exp/70305",
  "substance": "Damiana",
  "views": "9039"
 }
}
