{
 "title": "Synergy",
 "author": "The Stoned Guy",
 "citation": " The Stoned Guy. \"Synergy: experience with Kava & Cannabis (ID 11294)\". Erowid.org. Apr 5, 2007. erowid.org/exp/11294",
 "substance": "Kava & Cannabis",
 "bodyweight": "165 lb",
 "report": "<p>Well to start off I'm about 6'1' and weigh about 165 lb's.  The day started by being boring since my friends were gone.  I decided to go to my local Grocery store and try and find some over-the-counter herbs.  I started by looking at ephedrine.  But I have heard many people die from this drug.  I came across this bottle labeled Kava-Kava Root.  I have heard that it relaxes people and so I went to buy it.</p><p>So I went to my home and up to my room.  It was around 11:00 PM and my mom was asleep so I decided this is the best time for it.  But I had to set some things up first.  Before I do any kind of drug by myself I have to set up my room properly.  I turned on my lava lamp.  Then put on my Hypnogenic screensaver.  Turned off all the lights and put on my water fountain(calms me down a lot :)).</p><p>11:20 PM: I took two capsules.</p><p>11:50 PM: A slightly calm feeling fell over my body.</p><p>12:10 PM: I decided to take 3 more pills.</p><p>12:30 PM: Nothing new happened just same old stuff.</p><p>12:35 PM: I decided I was going to smoke some bud with this.  On the assumption that something kool will happen.</p><p>12:50 PM: A really nice high off of 1 bowl.  I start to have an idea that this stuff mixes well with bud.</p><p>1:00 PM:  I decide to break up the capsules to get the powder out of it.  I load up another bowl and sprinkle some kava kava on it.  I inhale a big puff from the bud.</p><p>1:05 PM: Almost in a instant I was high.  Not just a regular coming high.  I got high and it came up like I just sniffed some stuff.</p><p>1:25 PM: The feeling of extreme euphoria is present, as with most weed but this was very powerful.</p><p>1:50 PM: I decide to smoke 3 more bowls with kava kava on the next bowl and just bud on the next 2.  The high was so strong I couln't even seem to put kava kava on the other 2 bowls.  Or did I just forget.</p><p>2:20 PM: I am watching my Hyponogenic screensaver right now.  It is very facinating to watch.  I am put in a trance on and off.</p><p>3:00 PM: High is still rolling on.  Coming down a little bit but this stuff keeps on rolling.</p><p>4:00 PM: I'm just about all the way down right now.  The after effects are still present from the bud & kava kava.</p><p>Overall: Overall this is much better than just smoking weed alone.  I would try to not overdue it on the kava kava though, its sometimes a little too strong.  On the way down I noticed some minor visual effects, but I usually do on the comedown.  I would definitely suggest mixing kava kava w/ bud for a cool high.</p>",
 "year": "2001",
 "id": "11294",
 "gender": "Male",
 "timestamp": "2007-04-05T07:00:00.000Z",
 "views": "12243",
 "dose": [
  {
   "time": "0",
   "amount": "2 capsls",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:50",
   "amount": "3 capsls",
   "administration": "oral",
   "substance": "Kava",
   "form": "(capsule)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 1:40",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 2:30",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
