{
 "id": 11299,
 "title": "Woman Seduced by Woman",
 "date": {
  "submission": "2010-02-23T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "fiz",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "cig.",
    "quantity": "1/2"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "The following story is completely true, not a bit stretching the truth.",
  "Last night I went to a club in SOMA San Francisco. I watched a few sets from the band, and after finishing my Hefeweizen I to outside to bum a cigarette. A woman with curly black hair offers me a joint. I smoke one fair toke, cough a bit, but not too much. After that I was pretty much gone.",
  "The bouncers from the club tell us, You cant have that on the premises, then one of them says, Cant you read the sign, says no-meth zone.' Or something like that. We stumble down the street. I could not comprehend what she had meant. I ask the woman I am with, Nivette, and she says, I think she is being sarcastic. I still dont understand. Its just pot I say. Nivette responds, yeah my family accepts this as a normal thing. I was too nave to ask if there was anything else in the joint. Or actually, I was just stupid to accept a joint from a strange woman. From what I read afterwards about experiences on meth, I think the joint was laced with PCP or something.",
  "I started to talk to Nivette about this guy Ezra I had been dating for about a month. He had just broken up with me that day because he is Jewish and I am not. It was something that bothered me and I did not understand it. I hoped that by telling people I could get some insight. Nivette says she is attracted to Jewish men, she says she is Babylonian which she says goes way back before the Jews. Then I think it would be a good idea for Nivette to talk to Ezra. I call him, its about 11pm at this point, and Nivette immediately reprimands him, Why are you breaking up with this woman, just because she is not Jewish? She is a princess!",
  "Next thing I know Nivette and I are kissing against a chain link fence. My phone still open as Ezra listens to me kissing and breathing, Ohh this is soo nice. Nivette brings me up against a small tree or parking meter, I slide down it as she feels me up. People are walking down the sidewalk, couples hand in hand, amazed to find two women making out on the ground. Her hands moving over my smooth dress, my breasts, between my legs. Then I look up at peoples stares of amazement, and realize what is happening, Whoah, what is going on. I get up and walk down the street with the lighter,  of a joint and my phone still open.",
  "I hear some good rap music coming from a taqueria across the street. I jaywalk across the 5-lane road. I start moving to the beats as I walk up to the window. I determine the man making burritos is amazingly cute and I tell him he is gorgeous, he smiles. I walk up to a guy eating at a table outside, and have a strange conversation. Then I realize I am freezing and I go up to a group of people stepping into a van. I feel the warmth from inside the car and I ask where they are going. I end up telling them to all ride bikes and I slide the van door shut.",
  "I walk back across the street and this guy with a blue mowhawk steps out of a cab. I go up to him and smooth his hair up between my two hands and exclaim, That is awesome, I love it! He laughs as he walks away. I continue to go up to strangers talking gibberish. I felt like I was dreaming! Really I was like, wow, when am I going to wake up.",
  "At this point I was cold and wanted back in the club. I go up to the bouncers and they say, You are too intoxicated to enter. I say in disbelief, Wow, what is going on here? This has never happened to me, I have my ticket right here, see my stamp? I hold out my hand. We dont care. Then he takes a black marker and draws two large Xs on the tops of my hands. I try to enter anyway and two men PUSH me back out.",
  "I leave, amazed this is happening. Now I feel like I am in a nightmare. I walk up to a homeless man and buy his newspaper, then start to cry, telling people, This man is homeless! I was so cold, the wind ripping between the buildings and this homeless man just standing out there. He responds sadly, I am just trying to make enough money to get a place to stay.",
  "I felt so far away from my home, like I would never get back. I go back to the club and walk in thinking I can pretend they wont notice me, but they push me out again. Some people come out of the club and I go up to a couple, drawn by the beauty of the guy. I tell him he is beautiful and reach to feel his hair, then I turn to his girlfriend and say, You are not good enough for him.(!) And she replies, Well, I am glad you feel that way. Wow!",
  "I call my friend who is inside and he comes out. I say they wont let me in and they explain I am too intoxicated. I dont know what my friend is thinking at this point. Finally the show ends and my friends get a cab and we all get in. We go to their hotel, I think I even kissed my friends friend in the elevator, a woman I hardly know. I lay on their hotel bed and I wanted to make out with the two women, but they get me up and take me home in a cab. I get home and I am like, Oh my god what just happened!?",
  "So let this be a lesson, dont accept drugs from strangers!"
 ],
 "erowid": {
  "id": "70327",
  "citation": " fiz. \"Woman Seduced by Woman: experience with Cannabis (ID 70327)\". Erowid.org. Feb 23, 2010. erowid.org/exp/70327",
  "substance": "Cannabis",
  "views": "3202"
 }
}
