{
 "title": "Almost Over the Edge",
 "author": "shadow",
 "citation": " shadow. \"Almost Over the Edge: experience with Salvia divinorum (ID 11313)\". Erowid.org. Jul 1, 2002. erowid.org/exp/11313",
 "substance": "Salvia divinorum",
 "bodyweight": "190 lb",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Salvia divinorum",
  "(leaves)"
 ],
 "report": "<p>After becoming acquainted with Salvia divinorum, I browsed the vaults of erowid extensively. I had several very interesting discussions with a few friends of mine that were knowledgeable on the subject, and resolved that I would like to try the substance.</p><p>My friend Z gave me three dried leaves one day. I took them over to C's house where I was spending the night. After sitting around and waiting for everyone else to get off to bed, we spent a few moments clearing our minds to be as careful as possible. It's dangerous to be reckless with hallucinogens.</p><p>Anyway, Z had suggested a method for cheap vaporization that involved wrapping the leaves in tin foil and holding it over a lightbulb. We spent several minutes trying to get this to work with minimal results (perhaps we should pulverize the leaves in the future?)</p><p>Determined to experience the plant, we sought a grill lighter and used it to burn the leaves. After a few tokes (which were very hot and hard to hold in), I felt as if I was on the edge.</p><p>I quickly stood up and noticed that the whole world seemed to be moving a bit faster. I felt as if a little more Salvia was all I needed to break through and have an enlightening experience. Thus, I began to rush my friend C to keep burning the substance. He obviously hadn't felt any of the effects as he seemed frustrated and muttered a typical 'hold on!'</p><p>Frustrated, we opened the foil to notice that all of the salvia had been burned too slowly. Shortly afterwards, our friend J arrived. J and C went to smoke some weed, during which time I felt unusually paranoid. The Salvia did have a pleasant buzz, but it subsided soon after.</p><p>I can only hope that I will get another opportunity in the future with Salvia. I felt its amazing power almost flowing through me, and I can't wait to get it all the way in.</p>",
 "year": "2001",
 "id": "11313",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-07-01T07:00:00.000Z",
 "views": "7112",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(leaves)"
  }
 }
}
