{
 "id": 11312,
 "title": "As Luck Would Have It",
 "date": {
  "submission": "2012-11-28T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "EvDigital",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Memantine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>Surfing thru my medicine cabinet, I came across a bottle of Namenda, which was used by my grandmother who has Alzheimers.",
  "I decided to find out what this stuff was, so after looking it up on Wikipedia, I learned much.",
  "Apparently, it is not only an NMDA antagonist, but an uncompetitive antagonist at different nicotinic neuronal receptors, as well as a 5ht3 receptor antagonist.  Having had much experience with DXM, I was curious to see how similar it was to my favorite drug of choice, and since the doctors took my Gram Gram of these meds, what else could I do?",
  "I started by taking one of the 10mg tablets, which did not seem to do much, nor did I expect it to.",
  "The next time I tried it I took 30mg, and definitely noticed something there, a sort of speedy, euphoric feeling.",
  "Then the pills sat in the cupboard for a few weeks, and I mostly forgot about them.",
  "Today, however, after being bored for several hours, I remembered that I had them, so",
  "I reread all of the old wiki information, and decided to try it again.",
  "This time I took 40mg, which did not seem to do anything for about an hour, after which I started to gradually feel its effects coming on.",
  "It has been several hours now, and I definitely would say that there is something here, in fact, it is great!",
  "I would compare it to a cross between DXM and MDMA, without any jaw clenching, yuckiness.",
  "I would also note, that after taking DXM for about a year straight, five days a week, in doses of about 150 to 200 milligrams, I became somewhat hypersensitive to it, whereas most sources say it is active around 150mg I was now getting my euphoric feelings off of just 75mg. This may mean I am also hypersensitive to this NMDA antagonist.",
  "I was actually very addicted to DXM and continued taking it- every other day for weeks at a time, and quitting for several weeks, then back to it, and so on- for about two more years.",
  "As of these experiments with memantine, I have not been using DXM for about six months, but I would still assume that my sensitivity is an issue, because after stopping DXM use for over a month, I would still be able to get high off of five robogels=75mg.",
  "Anyhow, I am definitely very interested in this medication, and as there are 56 pills left, I will continue experimenting with larger doses.</p>"
 ],
 "erowid": {
  "id": "70393",
  "citation": " EvDigital. \"As Luck Would Have It: experience with Memantine (Namenda) (ID 70393)\". Erowid.org. Nov 28, 2012. erowid.org/exp/70393",
  "substance": "Memantine (Namenda)",
  "views": "2474"
 }
}
