{
 "id": 11319,
 "title": "Taken for Anxiety/Bi-polar Disorder",
 "date": {
  "submission": "2008-04-17T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "WorryWart",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "2100 mg",
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "daily"
  },
  {
   "time": "0",
   "substance": "Buprenorphine",
   "form": "daily"
  },
  {
   "time": "0",
   "substance": "Naloxone",
   "form": "daily"
  }
 ],
 "report": [
  "I was prescribed Neurontin for anxiety, mood stabilizer, and mild-severe Bi-Polar disorder. I started seeing a doctor after having an opiate (Oxycontin, Heroin) addiction, and was Started on Suboxone. I've had anxiety and mood problems well before the opiate problem but never saw a doctor about it.",
  "I told the doctor of my problems with having panic attacks and generally having very low points and very high points (as in my mood which is associated with Manic Depression or Bi-Polar Disorder). So he recommended Neurontin because of my troubles with addiction it wouldnt of been wise to prescribe me a Benzodiazopane. When I first started taking it, it gave me an alcohol kind of feeling and made me real tired and spacey. I found it rather uncomfortable in the beginning and as time went on and my dose was able to be increased I found that it helped keep me balanced throughout the day. When otherwise I would be either very depressed and anxious/nervous or very manic, speedy. And I've been taking it (7 x 300 mg =2100mg Daily) along with Suboxone (and smoking pot recreationally) for over a year now and find it to be a good mood stabilizer and seemed to handle about 75% of my anxiety. It's no miracle pill but it's helpful."
 ],
 "erowid": {
  "id": "70466",
  "citation": " WorryWart. \"Taken for Anxiety/Bi-polar Disorder: experience with Gabapentin (Neurontin), Buprenorphine & Naloxone (Suboxone) (ID 70466)\". Erowid.org. Apr 17, 2008. erowid.org/exp/70466",
  "substance": "Gabapentin (Neurontin), Buprenorphine & Naloxone (Suboxone)",
  "views": "24536"
 }
}
