{
 "id": 1131,
 "title": "Time-Travelling Cannabis Fun",
 "date": {
  "submission": "2001-03-06T08:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Slinga Jablobski",
  "weight": "70 kg"
 },
 "dose": [],
 "report": [
  "<p>I had been smoking cannabis for about 5 years at the time of these trips so I regarded myself as experienced, but what happened totally blew me away and has totally changed the way I think of this plant of the gods.",
  "The first of the 3 times this happened, I had just sat down after a hard night of cruising around town.  I had walked approximately 6 miles since about 6:30 p.m., and the time was now 11:30.  As I inhaled the magical cloud of smoke from my trusty double-chambered bong, I had to stop after pulling only 3/4 of the cone, as I felt a strange tingle in the back of my throat that I wasn't used to.  As I expelled the smoke from my lungs, I had difficulty blowing out the last bit of smoke.  This was strange for me as I have an unusually large lung capacity.",
  "I rested for a second, taking a few deep breaths, still resting the bong on my knee.  As I rested, my eyes focused on a brick wall that, through the eyes of a stoner, looked fantastic with all the little grey streets of concrete running between the red bricks.  As I stared, my body became more relaxed and my breathing became shallow.  The last thing I could remember was the music (trance, I think it was) intensifying greatly.  The next thing I remember was my buddy Captain K, who was sitting opposite me yelling out my name and asking me what the hell I was doing.  I looked down at him, as my eyes had been focused on the brick wall above his head.  He pointed to my lap and I looked down to see the bong had fallen over and I was totally drenched in 3-day old bong water.",
  "The thing was that I thought the water would have been substantial enough to wake me up, but I didn't even feel it.  Also, every inch of my skin was tingling as if a small charge of electricity was passing over it.  As I came fully back into reality, I gasped, desperate for air, as my shallow breathing had starved my brain of oxygen.  My body was totally drained of all energy, as I stumbled to my feet, and walked about 3 feet and collapsed on the sofa, still drenched in bong water.  Captain K later told me what had happened physically, as I had no recollection. He said the whole thing lasted about 40-60 seconds. While I stared at the wall, in an almost trance-like state, without my knowledge, my eyelids had begun fluttering profusely.  He said he thought I was joking and kicked me playfully, but still hard enough leave a red mark.",
  "I came out of this first experience hungry for knowledge of what had happened in my head that night, as I somehow knew something phenomenal had happened.",
  "The next trip I had into the unknown happened the following week.  I was in the same setting but with a different friend, Mr. G.",
  "I jokingly said to him to grab the bong off me if it looks like Im gonna drop it.  As I toked on that water-pipe of wisdom, I felt the same tickle in the back of my throat that I had the previous time, so I had to stop and expel the smoke out of my lungs before I choked.  After blowing the smoke out, my body automatically relaxed and my eyes became tired as I focused on the coffee table in front of me, the bong still resting on my leg.",
  "What I can remember was that my vision quickly turned white and then to nothing.  After about 1 minute (which strangely felt like hours to me) of Mr. G laughing at me, as he thought I was faking, I slowly began to come back to earth, but still looking back at my body from this different plane of existence.  For the first time in my life I thought I knew what insanity felt like.  It was the ultimate feeling of helplessness, as I couldnt escape this feeling. In fact I couldnt move despite my fruitful efforts.",
  "My vision was down to tunnel vision with the only thoughts going through my head being the insanity query and wondering where this place is.  My mind had no knowledge of me, my history, the world, nothing.  I was living the moment there and then with no knowledge of the past and no thoughts for the future.",
  "After about a minute of this, my buddy Mr. G kicked me in the shin and roused me.  Luckily, he had removed the bong from my grasp as soon as I began to loosen my grip early in the trip.",
  "Like the first trip, I gasped for air due to my shallow breathing, and I was physically absolutely stuffed and needed to lie down again to regain some energy.",
  "Mr. G explained to me that after he grabbed the bong off me, I started rolling my head around on my shoulders and my eyes went right back in my head. Also, I kicked outwards abruptly and kicked the coffee table, almost like a reflex.",
  "I was a bit wary about smoking now, since I had tripped out the last 2 times.",
  "The next weekend I was back smoking in the same room with Captain K.  I toked up and quickly put the bong out of kicking distance and began to relax, as expelling the smoke from my lungs was quite difficult as the tickle at the back of my throat was present.",
  "As I oozed back into my seat, my mind became clear of all thoughts and my vision started to whiten from the middle of my point of view outwards.  My hands were beside me as I was sitting down, and without my knowledge, I turned them over and extended my fingers towards the heavens as if I was trying to bring forth something upon myself. As this was happening, my head tilted back to about a 45-degree angle, so I was gazing upwards as well as my fingers pointing skywards.  My eyes were fluttering profusely once again.  Captain K just sat there in awe as I astral-travelled before his very eyes.  He said I actually took on a different appearance as I was in this trance like state.  I didnt look like myself; in fact he barely recognised me.",
  "While these were all the physical symptoms of my trip, a hell of a lot more was happening mentally.  The first part of the experience was shrouded in mist, so all I could remember was the last 20 or so seconds of it.",
  "Though my body was fixed firmly to the seat, my mind wasnt there.  I was out travelling around through different time-dimensions with extreme clarity.  One part of the experience that is permanently implanted in my brain was one incident that Im not entirely sure isn't some sort of pseudo-memory or repressed memory, as it felt so real.  My mind went back to when I was 6 and I was lying in front of my television staring at the roof.  It was like all the memories that Ive built since I was 6 had been deleted but all the intelligence Ive gained was still there.",
  "Well, as I stared at the roof I realised that I couldnt move and I was transfixed on the spot  like the previous two incidents, but years before and under the influence of no drugs.",
  "I could see the television in the bottom of my view and I felt the presence of someone behind me sitting on the couch.",
  "As I started to hear Captain K talking to me to my right, I began to come out of the trance.  The roof I was looking at and the television morphed into a wall and disco ball in Captain Ks house.",
  "As my brain docked back inside my scalp, I felt extremely exhausted again and had to lie down.",
  "These three experiences have to be some of the strangest experiences Ive had in my short life. I still dont know what the hell happened, and this writing doesnt do the trips justice. ",
  "Most of what happened just cant be explained.  It was just that alien to my human mind.  The brew of emotions and feelings cannot be explained because the human language has yet to conjure up words to describe such extraterrestrial feelings.",
  "Well, that just about sums it up.  I hope this provided an enjoyable read for people, as the experience totally blew me out of the water and changed the way I view the world, cannabis and the workings of the mind.</p>"
 ],
 "erowid": {
  "id": "1330",
  "citation": " Slinga Jablobski. \"Time-Travelling Cannabis Fun: experience with Cannabis (ID 1330)\". Erowid.org. Mar 6, 2001. erowid.org/exp/1330",
  "substance": "Cannabis",
  "views": "15587"
 }
}
