{
 "id": 11327,
 "title": "Salvia Test",
 "date": {
  "submission": "2001-05-27T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Frank Marshall",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "0.5",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "I have been interested in trying salvia after reading much about it and recently someone gave me a couple of grams of salvia leaves so I could try it for myself.  I told two friends about it and they decided they were interested in trying it, so the three of us packed about a gram into a bubbler and started cheefing.  We took big hits and held them for around 25 seconds.  On my first hit it worked immediately.  For about thirty seconds I had visuals comparable of that of a mushroom trip, the trees were dissolving and such.  I also found myself very disoriented and I had difficulty passing the pipe.",
  "But this state only lasted a minute or two, and following hits from the pipe did not really increase the effects at all.  My friend's experiences were basically identical. ",
  "About five minutes after smoking almost all the effects were gone, but for the next hour or so I had a general uneasy feeling.",
  "I think I would have enjoyed the experience more if I could have done it alone in a comfortable place instead of standing on the porch with two people that were not really interested in enjoying the experience.",
  "I do not think I will try salvia again.  It seemed like a waste of time because the effects were so short and the actual process of smoking salvia is very inconvenient.  Perhaps an extract would have been more desirable, but I'd prefer eating a hallucinogen that lasts several hours than smoking one that lasts a couple of minutes."
 ],
 "erowid": {
  "id": "7050",
  "citation": " Frank Marshall. \"Salvia Test: experience with Salvia divinorum (ID 7050)\". Erowid.org. May 27, 2001. erowid.org/exp/7050",
  "substance": "Salvia divinorum",
  "views": "9351"
 }
}
