{
 "id": 11328,
 "title": "Induced Panic Attack",
 "date": {
  "submission": "2008-04-15T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Beglin",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Sertraline",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": ""
  }
 ],
 "report": [
  "As a 16 year old female, I'm not the drug expert some of the authors here are. I've smoked weed and hash way more than a few times, tried shrooms, drink, and smoke cigarettes way more than my mother would like if she knew. A few months ago I was diagnosed with bipolar disorder, with possible ADHD and possible depression. I was diagnosed a few pills, but the only one I've stuck with is Zoloft. I'm on about 200 mg a day.",
  "One Saturday night, some friends and I went down to the park to get stoned before going to a concert. I had weed with me, but it was just reg, so my friend loaded the pipe with some Hash he had with him.",
  "I took quite a few hits, then drove myself to the show. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] It was just kicking in, and at first I felt a nice high. I was fine to drive, until the hash started kicking in more. I had no depth perception, and was scared out of my mind. The headlights of the other cars were blinking closer and farther away from me, and I couldn't tell how far away they were. I had no idea where I was, and found the concert venue by a stroke of luck.",
  "When I got there, I noticed that my heart was beating incredibly fast. I had trouble breathing and could hardly walk. When I got inside, I had to sit down. Then the twitching started. My legs were convulsing madly, and I had no control over them. The muscles in my throat started contracting also, and my fingers were shaking madly. I had no idea what was going on, and decided to go outside.",
  "My friend walked me out and then I started FREAKING out, crying and screaming nonsense. Crying harder than I ever had before, along with all of the continuations of the symptoms mentioned above. I thought I was going to die. A friend drove me home, and I screamed and freaked out the whole way. He told me later that my legs didn't stop moving the whole time. When I got home, I threw up and then blacked out, only to wake up 12 hours later feeling like shit. I was sore, and had a mad headache.",
  "This experience was absolutely terrible. I truly thought I was going to die, and am still sore a few days later. I really think that Zoloft and Hash are a terrible combination."
 ],
 "erowid": {
  "id": "70509",
  "citation": " Beglin. \"Induced Panic Attack: experience with Sertaline (Zoloft) & Cannabis (ID 70509)\". Erowid.org. Apr 15, 2008. erowid.org/exp/70509",
  "substance": "Sertaline (Zoloft) & Cannabis",
  "views": "16254"
 }
}
