{
 "id": 11330,
 "title": "A Fantastic First Encounter",
 "date": {
  "submission": "2008-08-15T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Ornament",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 repeated",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": " T+ 1:30",
   "administration": "23 mg",
   "substance": "oral"
  }
 ],
 "report": [
  "<p>I would like to start this experience off with a little background information on my experiences, the experiences of my friends who took this journey with me, and most importantly, a little background information on the grounds that we would be taking this journey on.",
  "I have tripped numerous times on LSD, Mushrooms, and other assorted hallucinogens. Unfortunately, Ive even Robo Tripped. By the time I had taken the 2C-I, Id say that I had around 30 trips under my belt. Not an astonishing number, but I like to think that I have control over my altered mind. My friends who joined me for this were much less experienced. C had two trips on LSD under his belt, both with me. A had also tripped once on LSD with me. K had more experience than the others, having taken LSD and Mushrooms several times. T however had never tripped before this night. Finally, S had tripped once with me on LSD, but he wouldnt be taking the 2C-I. He regretted this later, but he chose to just take a hit of LSD.",
  "Upon moving to Chicago, Ive been able to acquire many drugs that I couldnt in the suburbs. Im able to get acid pretty much anytime I want, and of course, the marijuana has really skyrocketed.",
  "Now, the setting. The weather has been finally picking up. Our friend T has a 300 acre property of just forest. The interesting thing about this forest is that at one time, in the late 1800s/early 1900s a serial killer lived on the property. I understand that this came out of nowhere, but it is in fact true. There were a few murders, and no one was ever arrested or charged. There was evidence he had a child even that was never accounted for. I will drop hints of this eerie presence when it comes up, but honestly, throughout most of the trip, it was in the back of our minds.",
  "Anyway, we arrived at our destination close to the farthest edge of the property around 4:30PM. It was a little nook tucked in the corner, that was close to a fairly small, bordering river.  We setup everything. Prepared a fire to be lit as the sun went down, and set all of our hammocks up in the trees. The mood was great, we smoked a few bowls, and were feeling great. The music of the Doors, one of our favorites to trip to, was echoing off of the forest. 6:00PM rolled around and we decided it was time to dose. We passed a jug of Kool-Aid around to wash it down. The 2C-I came in a clear pill. The amazing, tiny bit of white powder inside...",
  "We sat around chatting, smoking cigarettes, listening to music. Waiting for the drug to kick in. We decide to take a tour of the property, led by T. We usually go on walks to kill time, and this one seemed especially appropriate. He led us to where the shack of the murderer  used to be. There was still wood left there, an old rusty water pump, and even an old bench he had built. S comically, and accidentally knocked over a piece of wood, and one of us jokingly said, Oh man, youre going to get it now. He knows were here! We continued through the forest. The family planted this forest, seed by seed, and you could tell. The trees were all in rows.",
  "We finally got back to the camp site. I walked away from the group to call my girlfriend, who wanted me to see how things were going. I walked to the edge of the small river and made my call. Within several minutes, however, the call was ended, because at the moment, I began tripping. And surprisingly, tripping hard. Id compare it to about one hit of LSD. Right away. There was a huge field across the river. The hills began rolling towards me, and over each other. I was astonished. The ground around me began to do the same, morphing, and certain spots would spin, and dance.",
  "I called everyone over, and it seemed as if everyone was beginning their adventure as well. C was feeling nauseous and had to sit down, and just take it all in for a moment. That cleared up soon, however.  The fiery orange of the sunset was providing an insane clarity to my surroundings. Allowing everything to freely move and exist around me.",
  "I looked down into the water, noticing every ripple, that seemed to spawned into something much greater. A signal almost. I was a receiver, channeling the energy and presence of my surroundings.",
  "We at this point started the fire. The music was really driving the situation, as we all sat around, smoking cigarettes and enjoying everything about the drug. Night was falling, and things were really beginning to get interesting. The fire wood was bending in front of my eyes. The embers floating into the air were etching remarkable tracers that would stay in the sky long after the embers had died.",
  "The intense thing was that I kept coming up. And up. And up. I didnt think I was going to peak. I thought Id keep tripping and tripping and tripping, and Id just wake up the next day. The trees around the camp site were reaching out over us, growing into each other, and without leaves, were looking rather haunting. None of this bothered us. The gathering of such a good group of people, I believe, prevented most of the negative thoughts that night.",
  "We had a mini jam session, guitars, chanting vocals, pounding on random objects. I have played guitar for twelve years now, and honestly, 2C-I changed my perspective on the instrument. The fact that I can make music alone baffled me. The guitar became a powerful tool. I felt so grateful that I almost cried. Music has always been my outlet, and at that moment, I seemed to begin to understand why. I began to understand exactly how to tap into this. It was incredibly overwhelming, in a very good way.",
  "Id say around 9:30/10:00PM we decided to take a walk through the woods. With no light but the tips of our cigarettes. They were causing extreme tracers, much like the embers from the fire, but much more emphasized, since they were the only light source. T knew the forest so well, there was no worries of getting lost. Id say around this time was when the peak was finally hitting me. It was absolutely fantastic! The most creative Ive ever been in my life! Not because I was playing an instrument, or because I was making art, but because my mind was in complete control. Because it was pitch black, my mind was forced to create the world around me.",
  "We walked through eerie hallways of trees. There were little dead trees that didnt even make it past my knees. They were strewn everywhere among the forest. They were the only things that stood out, because they were the only light colored object. But to me, they appeared to be this amazing, melting, hot neon substance. It was incredible. We wandered through fictional murky swamps, and an extremely abstract land. Unnatural colors. An almost alien world. We came up to a huge, flowing river. What was peculiar is that none of us heard flowing water. But yet we all saw this river. T had no idea why it was there; He didnt remember it. Upon closer inspection, it was merely a downed tree! It was incredible. We stumbled upon a circle in the forest. What was interesting is that this circle was just surrounded by trees. T told us that something with the serial killer had happened here, but I dont exactly remember what. I do remember that we sat down in the circle for a good half hour. Taking the presence in. It was a very ominous moment, laying in that circle.",
  "We made our way back to the camp site. A was beginning to feel very nauseous, and laid down in a sleeping bag by the fire. He then threw up several times. He began having a negative trip. Later telling everyone he was seeing maggots, things of the like. He said it didnt really bother him, getting sick and all, and he was glad that he went through it.",
  "I was beginning to have an awful headache. I could almost feel the pain moving around in my head. But I kept trying to enjoy the trip, which I did. We put on some Mars Volta, and it only intensified the trip. As soon as I thought I was coming down, Id go right back up. 2C-I was a like a rollercoaster, that I didnt really care if I didnt get off, at that point. I was enjoying it so much.",
  "I finally could take the headache no longer, and after listening to some Ariel Pink, and Panda Bear, me, C, T, and K decided to make a trip to the cars, and fetch some Aspirin. When we got there, we realized just how hungry we were. Especially me. I fasted that day, so the 2C-I would come on quicker, and I think thats actually what caused the headache, not the 2C-I. So we got in a car, and we drove to a nearby Wal-Mart. Now trust me when I say at this point that we were BARELY tripping. I do not advocate driving while under the influence of hallucinogens. It is a horrible idea. [Erowid Note: Agreed; driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "We got to Wal-Mart, and my headache was going away. With the $16 we had on us, bought a small, cheap pot, a couple of gallons of water, and some Macaroni and Cheese. It was really weird being back in such a structured reality. I began to hate it. The people we interacted with were very strange, and funny. I figured because I was still a little loopy. We drove back to where the cars were parked originally. Walking through a neighborhood, we found some abandoned furniture; A table, and four chairs. For some reason, we had the bright idea to carry these back to the campsite for permanent installations. We planned this night, that we are going to be spending a lot of time there this summer, tripping extensively. This was such a hilarious moment, and a great thing to do while coming down. I dont think I wouldve carried a table and a chair by myself had I been completely sober.",
  "Once back, we made a little stove out of aluminum cans to cook the Mac and Cheese on, and smoked several more bowls to cap off a successful, fantastic evening. We all crawled into our hammocks as the sun rose, and enjoyed our sleep amongst the trees.",
  "My first experience with 2C-I was an incredible one, and I will be taking it again, and I am looking forward it. It was so great that I am currently writing the experience into a surreal story!",
  "Thank you for reading! And remember to always be careful! These drugs are very powerful, and should be respected in every sense!</p>"
 ],
 "erowid": {
  "id": "70524",
  "citation": " Ornament. \"A Fantastic First Encounter: experience with 2C-I (ID 70524)\". Erowid.org. Aug 15, 2008. erowid.org/exp/70524",
  "substance": "2C-I",
  "views": "18838"
 }
}
