{
 "id": 11332,
 "title": "Unexpected and Exhausting",
 "date": {
  "submission": "2009-11-26T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Beelissa",
  "gender": "Female",
  "weight": 55
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  },
  {
   "time": "1:30",
   "amount": "250 mg",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "The most frightening thing about taking LSD and Ketamine at the same time is the unexpectedness of the effect. I had taken both of these drugs in the past, either alone or in combination with other substances, but I had never taken LSD and Ketamine together until the occasion I describe here. It was an utterly exhausting and slightly frightening experience.",
  "My two friends and I had taken LSD in numerous forms on numerous occasions and it was quickly becoming our drug of choice. Over Christmas I had purchased myself a gram of powder Ketamine and decided to share it with my tripping buddies over a couple of tabs of Acid. At a friends birthday party, after an evening of drinking, we took the acid  half tabs all round. It was about 12:30 am and we racked up the Ketamine at about 3am when we were starting to trip - we put Book of Knots on the CD player and divided up the gram.",
  "Having used K in the past, we agreed that we should force ourselves to go for a walk and stagger around. What could be more fun? We went for an adventure walk. About fifteen to twenty minutes after taking the K, we all started to feel a little unusual. We were sitting on top of some pallet racking when suddenly we were in a submarine. Unconsciously, we sensed that being on the pallet racking was weird and dangerous. Without speaking, we all climbed down and lay on the ground. At this point, the three of us slipped into something like a K-Hole. Melanie, a friend who had only been drinking and had accompanied us, said that we all fell silent and our faces went slack. We were staring into the sky.",
  "I saw the stars melt and morph into worm holes, one of which I was sucked into. I felt that I was being propelled through time. Heather saw the night sky turn completely white and felt that she was floating in mid-air, one with all matter. Mark felt his consciousness drift into each of our minds  he could see through our eyes and feel our thoughts. We didnt discuss any of these feelings until the next day  no one could speak. Clearly, this was not a normal trip. No one was laughing. Melanie realised that something was off and picked us up from the ground  myself on one shoulder, Heather on the other. Mark would just have to follow. After a long, staggering, bumbling journey around the block we made it back to the party. Heather and I collapsed on the bed, Mark on the floor.",
  "During the morning I felt a range of experiences - I was incredibly tall, I could crush trees and houses under my feet. My hands and arms were extremely far away. I was constantly being sucked in and out of time. Time travel was exhausting, at times I wanted to cry because I wanted time to be still, to stop rushing quickly back and forth through consciousness. I was no longer in a house, I was in a forest, in a video game and the people around me were characters. They talked video-game talk and I couldnt make it stop, no matter how much I tried.",
  "Speech was nearly impossible. Mark kept gibbering nonsense while trying to work the CD player, not a single intelligible word came out of his mouth for over an hour. Heather lay on her back in the bed mumbling Why, why? Ketamine bad. Not good. This wasnt meant to happen. We were both feeling nautious. My greatest fear was that I would never come back, that my mind would be irreparably damaged. I simply couldnt understand how the effects could be so strong, how the trip could so completely control my mind.",
  "The next day, I found sleep impossible. Heather was extremely ill and throwing up white bile all day. Mark was the only one who bounced back quite quickly, I can only put this down to the fact that his body size is twice that of myself.",
  "This combination did not do what I expected. It made me trip harder than Ive ever tripped before and it was uncontrollable and exhausting. Perhaps for the right person this could perfect? I achieved something that I had always wanted to that night  I ticked something off my list of life experiences. I had always wanted to explore the ultimate trip, the complete lack of mental control, the borderline experience. Now I dont ever need to do that to myself again."
 ],
 "erowid": {
  "id": "70530",
  "citation": " Beelissa. \"Unexpected and Exhausting: experience with LSD & Ketamine (ID 70530)\". Erowid.org. Nov 26, 2009. erowid.org/exp/70530",
  "substance": "LSD & Ketamine",
  "views": "6624"
 }
}
