{
 "id": 11343,
 "title": "Repeated Insufflation of 1 mg Doses",
 "date": {
  "submission": "2008-07-24T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tryptamind",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "0:10",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "0:20",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "mg",
    "quantity": "1.0",
    "grams": 0.001
   },
   "administration": "insufflated",
   "substance": "5-MeO-DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "[Authors note: My experiences with entheogens and other drugs let me know some substances like 5-MeO-DiPT, 5-MeO-MiPT, 5-MeO-DALT, 5-MeO-AMT, 4-AcO-DiPT, 2C-B, 2C-D, 2C-I, 2C-B-Fly, MDMA, Methylone, MDPV, MDBP, mCPP, LSD-25, Psilocybes, GHB/GBL, Amphetamine, Methamphetamine, Cocaine, Khat, Cannabis, Nutmeg, Salvia Divinorum, and maaaany other chemicals like dozens of nootropics, benzos, and many more, and plants, like Passion Flower and other IMAOS, and maaany more, including lots of combos.]",
  "I was on my home, it was the 10 a.m. Instead taking my usual vitamin/mineral/ginseng combo, I decided dont do it. It was a very rainy day and I'm too constipated to go to the pharmacys faculty of the Universitat de Barcelona as every day. I have some tryptamines that I bought some months ago, some of them even a year or two, on various reputated research chemicals sellers. One of them is the apreciated 5-MeO-DiPT. It passed more than a year since last time I took this sexy tryptamine. In the past it was my most appreciated aphrodisiac, and I took it more than 50 times on a 6 month period. I decided to do a short-time experiment taking various little 1mg insufflated doses, waiting the first milligram coming on, before taking the next.",
  "[10:30] 1 mg of  the purest superwhite transparent crystals is insufflated.As you can supose, I felt nothing.",
  "[T+0:10] It passed 10 minutes since the first milligram, and I redose insufflating another milligram. I feel some enhancing on colors, some effects reminiscent of tryptamines, but almost unnoticeable.",
  "[T+0:20] Another milligram of Foxy Methoxy is insufflated. I start to feel like a mix of a tryptaminic state and a nootropic state. Its not the first time I feel it. I think some tryptamines at low dosages can act as nootropics. Now Im feeling a (+).",
  "[T+0:30] Another milligram insufflated. Because I dont feel the usual anxiety associated with the onset of this substance, I continued my experiment redosing a milligram, reaching 4 milligrams, that, beeing insufflated, equal to 6 or 7 oral milligrams. I start to feel a little contemplative, and surprisingly I have less anxiety than 30 minutes before. I played chill out music, that sounds sublime, and find myself seeing the rain and thinking Wow, I feel so good just seeing the water drops falling of the sky and hearing chill out music.",
  "[T+0:40]",
  "Now, Im in an antidepresive state, peaking the experience, in which I dont need to see what time is it, because I havent any anxiety. I have reached the (++) in the Shulgins scale. If I analyze my state from an ayurvedic point of view, I feel that 5-MeO-DiPT at this dosage have balanced my Sadhaka pitta and Prana vata. Less impulsivity and less anxiety. More balanced feelings and emotions, and a sexy state of mind. A fresh and smooth tryptaminic state of mind, although it wasnt a really psychedelic state at this dosage.",
  "[T+1:30] I returned to baseline in just 1 hour since the last milligram insufflated. I smoke a little marijuana (that clouded  my mind a little, normal effect with some tryptamines) and eat some food that tasted marvelous. It was a short-time, although refresher experience."
 ],
 "erowid": {
  "id": "70586",
  "citation": " Tryptamind. \"Repeated Insufflation of 1 mg Doses: experience with 5-MeO-DiPT (ID 70586)\". Erowid.org. Jul 24, 2008. erowid.org/exp/70586",
  "substance": "5-MeO-DiPT",
  "views": "5431"
 }
}
