{
 "id": 1134,
 "title": "A Subtle Rush",
 "date": {
  "submission": "2003-05-10T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "apathie",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Modafinil",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Last night me and a few friends decided to head into NYC and go to a club.  On our way there, I purchased some beer for a friend and I, and in return he gave me 2 (two) 200mg pills of Provigil in response to my complaint because we has no amphetamines left.  He said to take the pills and that they'll keep me going through the night.",
  "I had a lot of money to burn, so after we got into the club, I immediately started drinking beer after beer and a few mixed drinks.  After a while I was feel rather good.  The Provigil kept the sleepiness of alcohol away and helped me move and produced clearer more concise thoughts.  This was definetely a lot of fun, and I continued to dance and talk and the likes.",
  "For the next few hours, I drank steadily and got to the point where I could no longer fully stay awake, so I found 2 more Provigil and a half hour later, I was right back up to where I was, but with an increased sense of euphoria.  I was extremely upbeat, happy and the music sounded good, so it all created an extremely nice atmosphere.",
  "Around came 4 or 5am and I decided to head home.  I tried rather hard to sleep and when I got back up and went to work, I still felt it with me.  It was really sort of reassuring because otherwise I have a hard time staying active."
 ],
 "erowid": {
  "id": "13311",
  "citation": " apathie. \"A Subtle Rush: experience with Modafinil & Alcohol (ID 13311)\". Erowid.org. May 10, 2003. erowid.org/exp/13311",
  "substance": "Modafinil & Alcohol",
  "views": "21586"
 }
}
