{
 "title": "Floating with Music",
 "author": "ooxoxx",
 "citation": " ooxoxx. \"Floating with Music: experience with Piracetam (Nootropil), DMAE (Lucidril) & 5-HTP (ID 11340)\". Erowid.org. Dec 29, 2004. erowid.org/exp/11340",
 "substance": "Piracetam (Nootropil), DMAE (Lucidril) & 5-HTP",
 "bodyweight": "175 lb",
 "report": "<p>[Erowid Note: Lucidril is actually Centrophenoxine, the parachlorophenoxyacetate (pCPA) ester of DMAE. Th pCPA ester possibly allows for better blood penetrability.]</p><p>10:50pm: 1600mg nootropil (piracetam) 500mg lucidril 100mg 5-htp ingested.</p><p>11:00pm: 800mg nootropil ingested.</p><p>11:05pm: Coca-Cola 20oz purchased.</p><p>11:25pm: Slight elevation in mood and energy level. Listening to some squarepusher.</p><p>11:50pm: Awake. Clear-headed, slightly bored. No overpowering effects.</p><p>12:05pm: Full effects present. Exceptionally focused, some visual confusion (colors shifting, objects having nonsensical space-distortions, blurring and focus irregularities) which are interesting and enjoyable. Most effects brought on when attention is focused to something specific and allowed to wander. Listening to music is very enjoyable. 'Floating with music' sensation is present, not unlike the effects of marijuana, yet without giddyness and lack of coordination. The intelligent man's recreational drug? Attentiveness and focus on the order of adderall.</p><p>12:35pm: Slightly tired, still focused, but not in the mood for any self-searching.</p><p>01:15am: Effects subsided, still awake, focused. Definite potential for combinations with other drugs. Not a worthwhile experience alone.</p><p>02:30am: All effects no longer noticeable.</p>",
 "year": "2001",
 "id": "11340",
 "gender": "Male",
 "timestamp": "2004-12-29T08:00:00.000Z",
 "views": "21205",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "1600 mg",
   "administration": "oral",
   "substance": "Piracetam"
  },
  "1": {
   "time": "",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "DMAE"
  },
  "2": {
   "time": "",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  "3": {
   "time": " T+ 0:10",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam"
  }
 }
}
