{
 "id": 11340,
 "title": "The Abhorrent Side of a Legal Hi",
 "date": {
  "submission": "2010-04-07T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shayne H.",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Herbal Ecstasy",
   "form": "(liquid)"
  },
  {
   "time": "2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "6:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "8:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "23:15",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Vitamins - Niacin",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Foreword: I am a 19 year old, 511, 155lb college student. I consider myself to be in perfect mental and physical health. This overview discusses the effects of a legal high called 'Vector Shot'.",
  "As winter continued to dwindle away, some friends and I were enjoying the first 70+ F day of the year. We decided our time would best be spent within the beautiful, liberal city of Boulder, Colorado, as the Flat Iron Mountains and closest go-kart track would offer some excellent outdoor recreation. While standing in a rather long line waiting to get food, I decided to wander across the street to the K & K (a local head shop) to check out what they had. Immediately upon entering the store, my attention was drawn to a cabinet full of what looked to be herbs, mushrooms, legal highs, etc. Noticing a jar of amanita muscaria shrooms, I became pretty excited and asked how much for a few grams. Unfortunately, it was an ounce jar that was being sold as a whole for $50, and I didnt have the cash to spend. Acting on my newly developed urge to indulge into some sort of obscure drug, however, I ended up settling for a $15 bottle of Vector Shot, which the shop attendant described to me as an ecstasy rolling feeling. I thought to myself, go-karting, here I come",
  "I quickly returned to meet my friends, who I figured were almost to the front of the line by that point. We ordered our food and got to the table. After showing them my new purchase, I announced cheers and proceeded to drink the shot. However, as soon as the first drop came into contact with my tongue, my face cringed and my throat closed, sustaining the entire contents of the bottle in my mouth. I know bad idea. Now, I had the full flavor of the vile substance swimming around in my taste buds. Up until this point, I had considered my self a fearless trooper, having chomped down shrooms, chewed ecstacy tabs, and drank large quantities of straight alcohol of every variety without so much as a whimper. The taste I can only describe as rotten vegemite (as if the stuff could taste any worse than being fresh [no offense to anyone who likes the stuff, especially you Australians]). Nonetheless, aided by my Arnold Palmer, I managed to get it down. The time was 7:00pm.",
  "Just to make note, I am very comfortable while inebriated by drugs (hence my spur of the moment decision). My previous experiences include alcohol, marijuana, hash, salvia, LSD, psilocybin mushrooms, ecstasy, and a large array of prescription pain killers  all of which I loved.",
  "T +1:00  I begin to feel the onset of a very subtle sense of euphoria. To make note, I am currently on a full stomach. Between walking about a mile and riding in a vehicle up to this point, I would not consider myself to have done any aggressive physical activity that would possibly accelerate my metabolic rate or expedite the delivery of nutrients throughout my body.",
  "T +1:30  I begin to feel somewhat restless. Surges of energy throughout my body, coalesced with my heightened sense of euphoria, parallel the early stages of an acid come-up. However, I am yet to experience anything profound.",
  "T +2:00  Returning home, my friends and I decide to load up a bowl [of marijuana]. After smoking it, I stand up, and much in a similar fashion as standing up to meet a blood/head rush, it hits me. Entwined with the familiar body high of indica marijuana, I feel a visual sense of lag when I turn my head to look.",
  "T +2:10  My friend receives a phone call informing her that she is late for a work meeting that apparently slipped her mind. At this point, both my friends leave and I am now alone. Being a Monday night, I decide to take advantage of the mild, slightly altered state of consciousness I am in and do a bit of homework.",
  "T +4:00  It is now 11:00pm, and the rolling feeling has gradually progressed to the point where I am unable (or perhaps simply unwilling) to concentrate on academic work. Without the slightest sense of fatigue on a Monday night, I decide to indulge in some good ol fashioned counter-intellectual video games.",
  "T +5:30  I am still widely awake with an even more intense feeling of rolling. It is hard to precisely articulate the feeling, though I am going to make an attempt: say I turn my head to focus my attention from object A to object B, which is on the opposite end of the room. Though my eyes are focused directly on object B now, my perception has not quite caught up. As if frame by frame, my perception gradually catches up to meet with my ocular focus on object B.",
  "T +6:00  Now 1:00am, I smoke another bowl. Consequently, my rolling feeling is greatly amplified. In addition, I feel strong sexual desires. However, this can only be expected from a product marketed as both a party enhancer and a sexual stimulant.",
  "T +8:30  It is 3:30am and I have a three hour long biology class bright and early in the morning. The effects of the drug are still in full swing and I have no sense of tiredness.  Unfortunately, I know that I must retire for the night in order to have a glimmer of hope for functioning in class. So I smoke one more bowl in hopes I will be able to sleep easier. I lie down and close my eyes, only to be met by the rolling feeling, which now more closely parallels the feeling one gets after a long night of drinking.",
  "T +13:00  I am woken by the irritating sound of my alarm. Its 8:00am and class starts in one hour. My alarm is on the other side of my room, insuring that I must get up in order to turn it off (Ive had troubles in the past getting ready for class so early in the morning after a long night of indulgences). As I stand up and take a few paces towards it, I am attacked by a barrage of feelings.  I momentarily pause in my footsteps as my world begins to spin; as stated above, it is a similar spinning to what one experiences after intense drinking.",
  "This time, however, it was accompanied by extreme dizziness and nauseousness. So much so that I ran to the bathroom and sat down on the toilet (the need to #1 & #2 was there as well). I quickly grabbed the garbage can and proceeded to expel waste from damn near every orifice. Since I had no food in my stomach, the vomiting turned to dry heaves. It was an ugly sight. After words, however, the dizziness and nauseousness were still quite persistent. The feelings were so intense that I deemed myself unable to drive, nor function as a productive member of society. With that being said, I went back to bed and decided to try and sleep it off.",
  "T +17:20  I wake up in response to my phone going off. I stand up to answer it, but am met with dj vu, so I run to the bathroom again. After vomiting, I decide that a bit of sun exposure might help, so I lie down outside for about 20 minutes. Returning inside, I feel a shower is in order to clean up a bit. Slowly making my way upstairs as to not trigger the vomiting feeling, I head to the bathroom and take a long, hot shower. Within 15 minutes, hair still wet, I was lying back in bed, texting a friend. Shortly after, I fell asleep again.",
  "T +22:00  I awake again to my phone, despite sleeping through 4 other missed calls. To my surprise, I am still plagued by the spinning feeling. I am, however, able to subdue the vomiting this time around. After sleeping away the majority of the day, I decide I need to stay awake for a bit. So I sit down and begin writing this.",
  "T +23:00  Despite having no desire to eat, I decide that I need something; I havent consumed a single morsel all day. I figure that a breadish type food will be best on my stomach, so I made some waffles. Unfortunately, my efforts proved futile, and I managed to eat approximately  the waffle and a hand full of fresh strawberries.",
  "T +23:15  The feelings begin to subside. In an effort to accelerate the expulsion of the feeling, I take a capsule of niacin.",
  "T +23:45  I decided that inducing a session of sweating in conjunction with the niacin would further help alleviate the already subsiding feeling of spins. So, within 15 minutes I arrive at the local YMCA and settle down in the sauna with a book. After 30 minutes, drenched in sweat, a page of my book pulls out with ease  probably due to the heat weakening the bonds of the glue used to bind the book together  and I decide to leave.",
  "T +24:45  The effects of the drug are now very acute, allowing me freedom of movement without the fear of vomiting."
 ],
 "erowid": {
  "id": "70559",
  "citation": " Shayne H.. \"The Abhorrent Side of a Legal Hi: experience with Herbal Ecstasy - Vector Shot (5-HTP, Theanine, Phenibut, Yohimbe, Synephrine & Caffeine) & Cannabis (ID 70559)\". Erowid.org. Apr 7, 2010. erowid.org/exp/70559",
  "substance": "Herbal Ecstasy - Vector Shot (5-HTP, Theanine, Phenibut, Yohimbe, Synephrine & Caffeine) & Cannabis",
  "views": "46472"
 }
}
