{
 "id": 11357,
 "title": "Ocean of Green",
 "date": {
  "submission": "2002-07-14T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Graham Meyer",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "18 g",
   "administration": "oral",
   "substance": "Nutmeg"
  }
 ],
 "report": [
  "Nutmeg is hallucinogenic due to the safrole and myristicin it contains. Elemicin could contribute to the hallucinations, but this is doubtful. Anyways, if you wanted to replicate the effects of nutmeg you could mix carrot seeds (myristicin) with sassafras (safrole) and cinnamon (elemicin). I have experienced hallucinations with nutmeg a few times and would like to let you know that most of what you hear about the experience on the net is bullshit. It generally lasts at least 24 hours, if not more. Be prepared. Don't take too much and ,remember, the effects don't come on until at least 4 hours after ingestion. What follows is my experience, do not assume that you will have the same if you ingest nutmeg, it varies with everyone:",
  "It took about six hours for the effects of nutmeg to come on. You feel vibrations of euphoria similar to those felt while on LSA. The effects seem to come and go (i.e. every other hour). The hallucinations consisted of ripples in walls, the feeling that I was floating forwards about an inch off the ground, and, (interestingly) when I looked at my lawn it seemed to blur toghether into an ocean of green. These hallucinations were almost the polar opposite of those that are induced by solanaceous alkaloids in that, with nutmeg, you know you are hallucinating. As a matter of fact, if you use it enough and really focus on the experience, you can begin to control the hallucinations you have. When I get around to it I'll try to post my notes on the extraction of safrole and myristicin from nutmeg. Safrole and myristicin have both been found to be carcinogenic in rats, by the way. You aren't a rat, but this sort of imformation might keep an ignorant few from enjoying nutmeg's benefits. Lastly, sometimes waking up while on nutmeg causes horrible hangovers. Use caution, but enjoy."
 ],
 "erowid": {
  "id": "7067",
  "citation": " Graham Meyer. \"Ocean of Green: experience with Nutmeg (ID 7067)\". Erowid.org. Jul 14, 2002. erowid.org/exp/7067",
  "substance": "Nutmeg",
  "views": "20247"
 }
}
