{
 "id": 1136,
 "title": "A Beautiful Experience",
 "date": {
  "submission": "2005-02-21T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Scooter",
  "gender": "Male",
  "weight": "202 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": " T+ 0:20",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I was intensely interested in trying LSD for a while, but after realizing it was just too harsh and long (not to mention so many wise people telling me to stay far from it at least until I finished school), I decided to look to the Mushroom for a better time.  I've smoked pot for over a year now, it took most of that time for my body to accept the THC and allow me to feel the Euphoria it produces.  I've only tried two other substances, Alcohol and DXM; and I smoke cigarettes only often enough that I can still get a head trip from them.",
  "I chose a Thursday night to take the Shrooms, I had no school the next day and thus everyone else would be in bed early.  For my first time I broke a lot of rules; the main one being don't trip alone, which is exactly what I did.  I trust the power of my mind, and am sure I can handle most drugs in my room alone at night with no one else in the house that even knows what I'm doing.  I kind of have to deal with it, even though I'm open about my drug use I still get only closed minded unacceptance from parents; and I don't like to even talk to them any more about it because of this. ",
  "The person that sold me the Mushrooms had used them in school (idiot) and wound up with a fever, thus I assumed this particular batch would be pretty potent.  Because of this and it being my first time with a new and more powerful drug, I resolved to only try half of the bag.  I munched up the caps straight (I don't usually like the taste of any mushrooms, I could handle these because I new I was going to love the trip they'd give me. I spent the next 20 minutes setting up my room for the trip, getting proper lighting on my posters and anything psychedelic looking; which is basically everything in my room.  I then rolled a joint, by the end of this I was still feeling nothing; only a bit of belching and some stomach cramps.  I figured this wasn't going to do anything for me, so I pulled out the bag and ate the rest of the 8th. ",
  "Almost immediatly afterwards I felt different, my head started to swim a little and I felt sort of stoned.  Now I knew the trip wasn't far off, I put on some Floyd (Never tripped without that) and lay back on my bed to await the onset.  Time passed and the feelings increased in intensity; I belched a bit more and my stomach felt disturbed, the stoned feeling got gradually stronger.  I got up and walked around my room a bit, I felt very dissociated from my body; it was a funny feeling to walk.  Almost immediately the nausea hit me, strong and overwhelming, I had to lay back down.  I was prepared for all of this, it was no big deal.  As Floyd played on the onset ended, and I started climbing towards my peak; visual changes began to appear.  The first thing I noticed was that things began to get fuzzy, my visual perception was somewhat clouded.  I felt more at this time than I saw, though that soon changed.  The Mushrooms produced a potent body high.  I couldn't really feel my body any more, it was sort of floating and tingling.  The feeling is hard to describe, the dissociation was strong; all I know is it felt very, very good.",
  "I looked at the wall where all my posters hang, that's when things started to move.  The closet door was breathing; as if it had just come to life, it gulped in air, and slowly let it out.  I was impressed, I then let my head back and stared at the ceiling.  In the corner where the walls meet the roof things were coming apart; the ceiling seemed to float away and the lines on the walls became distorted, they seemed to move back and forth.  I looked into the texturized part of the ceiling, and all the little bumps and patterns (which really are there) started swimming around as if the room was filled with water. ",
  "Up until now things had just been moving and undulating, When I looked back at my posters though, this changed.  I saw the trippy posters, but those weren't the most interesting things; it was AROUND the posters that things were happening.  Colors, like colored pencil animation were exploding in every white space on the wall; They were amazing.  Now I knew I was freaking out, and things weren't close to being done.  The walls (which are painted with a green forest pattern) were bulging out, they ceased to stand straight and became convex; the ones by my head closed in around me and I could see patterns emerging from them like one of those 'Magic Eye' pictures that were so popular in the 90's.  By just sitting back and looking at something I could watch any one of these hallucinations, and the room even moved as a whole in any direction I wanted it too.  I got up and walked around, the nausea was gone and replaced by a very drunk feeling; I stumbled around and still couldn't feel my body, however everything felt so wonderful and good.  I tried to paint and write, but found it very hard to focus as I kept wanting to trip out.",
  "I tried to eat, but I felt so drunk I could barely chew, all I really could do was taste.  As I looked around the room vibrant arrays of colors and moving objects were everywhere; even something with just a plain solid color now was a pulsing stream of different shades of that one color, amazing.  I was wearing a tie-dye ganja leaf patterned shirt, imagine what THAT looked like.  I stared at the far wall and it moved towards me and back; I kept repeating the phrase 'The Wall' out loud, and it suddenly all made sense.  The Wall, my favorite Pink Floyd album!  I fell over laughing, then left my room and went to watch some really trippy cartoons.  After I came back I was seeing even more colors.  At this point I smoked half a joint, and this only really intensified the stoned feeling.  I still could make things move and swim around, not really like before.  I did have tracers too, moving my hand in front of my face I could see lines come off my fingertips and linger in the air for a second.  For about 20 minutes I lay back on the bed waving my arms around in fluid motions and lighting lighters. ",
  "This is about the extent of the experience, there is only one word for it; beautiful.  The feeling was so amazing, the trip so gentle and loving.  All the hallucinations were beautiful and just great; at no point did anything scary happen.  I tried to scare myself too, I had read never look at yourself in the mirror; so of course I did just that.  It was quite a shock, I recognized myself; but looking at my face gave this haunting feeling, and my eyes grew very wide.",
  "In conclusion the Mushroom trip was so gentle and lovely I can't imagine wanting another drug.  The dreamy trance of the Mushroom was purely euphoric and...beautiful.  There were no downsides, even the nausea and cramps were gone shortly after they came, and it was a good cue to know when the trip is about to kick in."
 ],
 "erowid": {
  "id": "13315",
  "citation": " Scooter. \"A Beautiful Experience: experience with Mushrooms & Cannabis (ID 13315)\". Erowid.org. Feb 21, 2005. erowid.org/exp/13315",
  "substance": "Mushrooms & Cannabis",
  "views": "4958"
 }
}
