{
 "id": 11375,
 "title": "Never Doing That Again",
 "date": {
  "submission": "2000-09-09T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SpaceOddity",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "4"
   },
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Experience 1: My friend C and i were at the local grocery store one night. we were roaming around the drug aisle and i remembered hearing something about dramamine before, so i picked some up. we got back to my house and we each took 4 of the pills. within an hour i could feel the effects. i was really tired and dizzy and both of us fell asleep pretty quickly. all and all it was pretty boring.",
  "Experience 2: I was with C again and that night we took 3 caffeine pills and 4 dramamine pills. This was much more fun than the first time. I felt pretty fucked up and was getting some visuals. I was outside, it was dark and everything had a reddish tint to it that flashed slightly. i was getting some good tracers off C's cigarette, too. we came back in the house and he sat on the computer, while i just kind of zoned out on the couch. i was having a kind of waking dream, like i was half asleep. i would see scenes in my head and talk outloud as they went along. it was pretty nifty that time.",
  "Experience 3: I was at school and i was pretty bored. i downed four more pills and felt the effects withing twenty minutes. i felt kind of sick, and it felt like i had to struggle to stay conscious. i was so afraid i was going to pass out and it felt like my heartbeat was weak. i asked the teacher if i could go get a drink and she said no, so i walked out. i got a drink and discovered, like i read in another report, i couldnt burp right. air would go down, but nothing would come back up. i was like my esophagus was a one way street. i really didnt like that feeling. the next class was just as bad, and when i would close my eyes, i would see things. i put my head down on the desk, closed my eyes and saw my friend's face flying at me. i kept getting that feeling that you are falling, you know, like when you are falling asleep. i had always been a pill popper, but after that scary experience, i stopped popping pills altogther...."
 ],
 "erowid": {
  "id": "708",
  "citation": " SpaceOddity. \"Never Doing That Again: experience with Dimenhydrinate (Dramamine) (ID 708)\". Erowid.org. Sep 9, 2000. erowid.org/exp/708",
  "substance": "Dimenhydrinate (Dramamine)",
  "views": "13617"
 }
}
