{
 "id": 11378,
 "title": "Nondescript Report",
 "date": {
  "submission": "2008-04-28T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nobody",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "bowl"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I tried writing a 4 page trip report detailing my exact trip down to every detail, but then I realized that the only way attept to capture an event so profoundly bizarre is to write a poem while 1/15th at the edge of reality.",
  "I realize that is this website is designed to display catagorical data about drug use, but what I experienced can't be explained with normal language, in the same way that emotions cannot be expressed in normal language.",
  "The details of my set and setting are unimportant as I had no connection my earth bound exist for the 10 or so minutes that I was in the hard trip. But just for refrence, I was in a room with friends.",
  "Your mist tasted of strangeness",
  "the people said goodbye",
  "I was gripped into your depths",
  " at an alarming rate.",
  "My limbs were ripped off and I ceased to exist along with my friend, time.",
  "we saw god who was revealed as everybody in the room being ripped apart.",
  "tearing. everywhere.",
  "the true state of reality was chaos.",
  "I was being pulled and cracked -- god  was  breaking.",
  "I could not exist for much longer in this universe. The dark energy was too strong for me.",
  "Sudden I saw the puzzle pieces reforming.",
  "I wasn't ready to see into infinity so I was sent back.",
  "\tMaybe reality can be handled one frame at a time. but perhaps not all at once."
 ],
 "erowid": {
  "id": "70827",
  "citation": " Nobody. \"Nondescript Report: experience with Salvia divinorum (20x extract) & Cannabis (ID 70827)\". Erowid.org. Apr 28, 2008. erowid.org/exp/70827",
  "substance": "Salvia divinorum (20x extract) & Cannabis",
  "views": "2461"
 }
}
