{
 "title": "Time Warp",
 "author": "Void Shroomer",
 "citation": " Void Shroomer. \"Time Warp: experience with Dimenhydrinate (Dramamine) (ID 1137)\". Erowid.org. Sep 9, 2000. erowid.org/exp/1137",
 "substance": "Dimenhydrinate (Dramamine)",
 "bodyweight": "145 lb",
 "header": [
  [
   "DOSE:",
   "11 tablets",
   "oral",
   "Dimenhydrinate",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>\nAfter a night of unsuccesfully aquiring shrooms, me and my two friends decided to just crash in my room, watching t.v.  I told them i wanted to try Dramamine, they said go for it.  So i popped 11 pills, tucked myself in my bed, and watched t.v., my friends lying on the floor.  About 30 minutes later i walked outside to the bathroom, and took a piss, feeling an almost placebo-like body buzz.  I shrugged it off, then went back into my room, and tucked myself in.  After about 15 minutes of watching t.v., i started to lose my concentration, and my eyes kinda shut. </p><p>Instantly my room was light again, and my friend nicky, who was at my house earlier, was in my room, and it was just me and her.  We talked for awhile, then i blinked, and she was gone, and it was night again and i was in my bed, with my two friends on the floor.  I told them what just happened, and they hardly listened.  (I think they were asleep)</p><p>It happened again, and Nicky was back, because she had left her purse.  She talked to me, then grabbed her purse and left.  I blinked my eyes and she was gone but her purse was still here, and it was night again.  I think i dozed off, then i woke up about a half hour later.  My friends had turned the t.v. off.  And i had to piss again.  So i got up, and felt an incredibly energetic body buzz, but it was almost like i was drunk.  I walked to the bathroom, then i started walkign back to my room, and i blinked, and i was in my bed again, somehow transporting from the hall to my bed.  For about 2 hours i tossed and turned with an almost uncomfortable body buzz, then i fell asleep.</p><p>The next day i had no visuals or body buzz, but i felt kind of sick to my stomach, but it eventually passed.</p>",
 "year": "2000",
 "id": "1137",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-09-09T07:00:00.000Z",
 "views": "17296"
}
