{
 "id": 1139,
 "title": "She Took A Mirror From Her Purse",
 "date": {
  "submission": "2002-05-09T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Morninggloryseed",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "166 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(capsule)"
  }
 ],
 "report": [
  "My first experience with methylone did not leave me very impressed.  It wasnt exactly entheogenic, certainly less so than MDMA, but there was a slightly introspective quality to it.  I also had some minor CEVs, but that was about it.  I found methylone more relaxing in many ways than stimulating. It basically put me into a mild trance-like state with eyes shut.  When I opened my eyes I didnt really notice much but a subtle body buzz.  Unlike other reports I have read, I never experienced any particular 'rushes' this substance.",
  "This is the second time I am taking methylone without mixing it with other substances.  My other experiences involved mixing it with other psychedelicsonce at the tail end of an LSD trip and once with 2C-I.  The experience with LSD was very pleasant and the one with 2C-I was not.",
  "10:52 PM",
  "I ingest exactly 166 mg of methylone hcl in a capsule on a mostly empty stomach.",
  "11:12 PM",
  "I defiantly have an alert.",
  "11:18 PM",
  "Very clear euphoria.  It is not like the opiate euphoria, and it is not like MDMA euphoria.",
  "11:22 PM",
  "Taking a phone call.",
  "11:43 PM",
  "Wow, a lot more MDMA-like now, but not anywhere near as profound.",
  "11:45 PM",
  "For some reason, now it feels like a cross between an opiate and MDMA.",
  "12:22 AM",
  "For about 20 minutes it was very MDMA-like, now it seems like an energetic opiate.  I have pseudo-empathetic effects (it feels good to talk to people on IRC and I can really get into the conversations) but nothing that I would particularly would call entheogenic.",
  "12:23 AM",
  "I sure did like this better when I took it after an acid peak.  There are no bad effects at all to speak of, but not to many real interesting effects either.",
  "12:27 AM",
  "Heh, I like the nystygmus this methylone is producing.",
  "12:38 AM",
  "It keeps going back and forth between feeling opiate-like and MDMA-like, but without the psychedelic part of MDMA.",
  "12:52 AM",
  "I think more than anything it feels like MDMA but without the real MDMA mental effects.  Mentally, I still feel like I am just high on a warm fuzzy (opiate), well sort of.",
  "1:16 AM",
  "My mind is racing now.  It is amazing, but this time the methylone is much more stimulating than the last time.  I anticipate that I will have problems sleeping.",
  "1:44 AM",
  "Im not peaking anymore but havent started to go down.  Actually as I typed that it the methylone seemed to release itself a bit.",
  "2:27 AM",
  "Largely down, but I still feel some stimulation and 'softness' in the body.  I believe some chamomile tea and marijuana is called for.",
  "Summary",
  "It's hard for me to consider methylone to be much more of anything than a novelty.  I sure cant see it as an entheogen with any real value in psychotherapy or for self-exploration.  It seems more suited as a social lubricant, or for entertainment, but thats about it.  I was most surprised at the lack (for me) of any real empathetic effects.  At one point I took a phone call from someone close to me experiencing a personal crisis.  To my surprise I found the phone call more of an annoyance than anything, and I was not very motivated to help them or give them any advice.  This is most unusual for me because helping people to feel better is not only my career (I am a social science major) but I love and care for this individual and want nothing more than for them to feel good.  I dont know, it seems methylone can recreate some MDMA-like effects but in general falls way short of being anything that is real interesting.",
  "Perhaps I will try it again while camping in the mountians.  Maybe in a more pristine setting, methylone can be a more magical substance (I took it alone at home).  On the plus side, other than some residual stimulation and minor nausea there were absolutely no negative side effects."
 ],
 "erowid": {
  "id": "13320",
  "citation": " Morninggloryseed. \"She Took A Mirror From Her Purse: experience with Methylone (ID 13320)\". Erowid.org. May 9, 2002. erowid.org/exp/13320",
  "substance": "Methylone",
  "views": "17186"
 }
}
