{
 "id": 11390,
 "title": "Fijians Know Best",
 "date": {
  "submission": "2011-02-28T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "ferdinand",
  "gender": "Male",
  "weight": 69
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "Tbsp"
   },
   "administration": "oral",
   "substance": "Kava",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "Recently I had the opportunity to meet a group of Fijians who attend the same institution as me. They taught me how to make kava the way they do. I thought it'd be nice to share shed some light on a subject that I do not feel has been properly represented, in it's entirety, in any literature.",
  "The Fijians prefer to use dried root powder that is about the consistency of the coarse sand used in home gardening. Vanuatuan's apparently likes to use stone ground dried Kava or fresh undried Kava. Hawaiians and Tongans prefer to use fresh, undried Kava. The Fijians noted that while fresh Kava root tastes the best and is somewhat more potent, it is the hardest to make and least convenient to store for long periods of time. This is an accout of preparing Kava from Fijian style coarse powder.",
  "Necessary Gatherings:",
  "Coarse Kava kava powder, cut up thin t-shirt (any sheer material will substitute), Luke Warm Water, Large Bowl, Cup(s).",
  "Optional Gatherings:",
  "Half Coconut Shells (called bilos), Chasers (Orange or Lemon slices, personally I like the V8 Tropical Splash line of drinks), Real Fijian strainer bag.",
  "Note on Lecithin/Milk/other lipids: Some people prefer them for taste, but it doesn't affect the taste in a huge way. It does slightly speed up the Kava making process, but not by a huge margin. It's still possible to get an equipotent drink without using them.",
  "How many shells do you want to make?",
  "2-3 shells per person is a good starter amount. 1 shell = 1/2 cup of lukewarm water, made from 1 rounded tablespoon of Kava. so 3 shells = 1 1/2 cup of water + 3 tablespoons of kava",
  "Step 1:",
  "Cover the bottom of the bowl with the tshirt laid flat. Spoon the desired amount of Kava into the tshirt. Lift the edges of the shirt so that when you pour in the water, the kava is contained. Add a small amount of the previously measured water. You want just enough to make the root wet. Lift the tshirt, so that the kava forms a ball.",
  "//note if using stone ground Kava it is a good idea to let it soak in the lukewarm water 30 minutes or more before hand. Kava root has some antimicrobial/antibacterial properties, so you don't need to fear sickness or spread of bacteria when preparing it or letting it sit out.",
  "Step 2:",
  "Start massaging the ball of wet root between your thumb and first two fingers. You want to really push at it. The idea is to dislodge the oils in the Kava, strain them off, and repeat. Most of the Kavalctones are not very soluble in water. After a minute or so, add some water to the t-shirt, consolidating some of the Kava root on the sides of the makeshift strainer. Repeat this until you've got all of the measured water in the bowl.",
  "Notice how the ball of Kava feels oily. If you nead the ball for long enough it will feel gritty. Once it feels really gritty you are done pressing the kava.",
  "Step 3:",
  "You'll want to mix this solution. Some people use a spoon, but this doesn't really get all of the oils suspended. I prefer to pour the Kava back and forth between containers until there is no sediments on the bottom of the original bowl.",
  "Step 4:",
  "Immediately after mixing pour a half cup of kava into your desired cup, and try to chug it in 2 or 3 gulps. If it settles the last gulp is kind of nasty. If I make the drink right it numbs my mouth in a most unique way.",
  "The first 3-4 sittings of drinking Kava I get a little sleepy and relaxed. After this a decent euphoria type feeling is felt. I'm assuming the reasoning for this is the same that it is for marijuana. The actives are lipid soluble, and the biologically available sites that Kava acts upon have to 'saturated' before whatever effects are felt.",
  "The Fijians say 'Bula', which I think means cheers or thank you, before drinking their Kava... so Bula!"
 ],
 "erowid": {
  "id": "70880",
  "citation": " ferdinand. \"Fijians Know Best: experience with Kava (ID 70880)\". Erowid.org. Feb 28, 2011. erowid.org/exp/70880",
  "substance": "Kava",
  "views": "10306"
 }
}
