{
 "id": 1141,
 "title": "Telepathic Jaguars Changed My Life",
 "date": {
  "submission": "2002-05-02T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Melchior",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "tea"
  },
  {
   "time": "0",
   "amount": {
    "number": "12",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "tea"
  }
 ],
 "report": [
  "I had had fun with 'huasca (not counting the harmaline induced vomitting session) two times before this.  both previous trips had been with less than 10g of M. Hostilis.  I had felt kinda sick, and then seen the pretty colors.  It was a fun, very much recreational experience, nothing like the other reports of 'huasca use that I have read, which made it sound like a psychedelic H-bomb.",
  "So, one saturday evening, feeling adventurous, I mixed up some brew, and totally miscalculated the dose.  right after i drank it i thought i was going to throw up so i went to bathroom, and while sitting on the toilet, my legs and arms dissolved into a mosaic of pink and red triangles.  it was all down hill from there.  I felt awful, and i can't tell whether the negative physiological effects made the trip go bad, or whether the sheer intensity caused me to freak out and start hallucinating the negative physical effects.  at any rate, the next thirty minutes or so were pretty bad.  I thought i was surrounded by small creatures who were minions of an entity i refered to as 'jaguar' and that they were responsible for the pain i was feeling.  I fled the bathroom.  Wearing nothing more than a bathrobe, which was apparently not fully closed, i ran upstairs to find people who might help me in my situation.  I ran into a six eyed amorphous blob that i could barely recognize as my friend j. I think i got out the words 'bad trip' , 'too much' and 'yage'.  she brought me to the room she was going to, which was not so cool, because the people who lived there had decorated it with lots of hangings and weird lamps which gave off an extremely hostile vibration.  I tried to use their computer to go to erowid.org and find advice for bad trips, but when i looked down at the keyboard, none of the keys had recognizable characters on them.  at this point j had gotten my girlfriend who told me i should put some clothes on and go back to my room.  I probably owe that woman my sanity.  She managed to talk me down somewhat, and i was over the peak, so things got much better.  I had lost all contact with my body and felt as if i were made of pure energy.  I began to wonder if words like 'mouth' and 'germany' were names i had given to things i had hallucinated, or if they had any connection to the real world.  the visuals on ayahuaska are incredible, patterns of eyes and triangles and lightning bolts flowing into each other.  I've never done acid, just 'huasca and shrooms, so i don't know if that kind of patterning is common to acid or if it's unique to yage.  I spent an hour lying on the top bunk of my bed, looking at the ceiling and going 'wheeeeeeeeeeeeeee'  tears were streaming down my face from the sheer wonder of the whole experience. when i calmed down a bit more, i went and cuddled with my girlfriend and opened up to her completely which was nice.  I also figured out that her friend who had been coming to visit had been in a car accident while I had been off in my own little world, which made me feel kinda bad for not being there mentally.",
  "End analysis: good stuff, as in it is mostly pleasurable in moderate doses, but unless the idea of looking down at your feet and not having the faintest clue what they are because you've forgotten that you have a body sounds good to you, keep the DMT levels below 50mg a dose.  I myself dont mind getting blown away every now and then and am getting a jaguar tattoo :)."
 ],
 "erowid": {
  "id": "13325",
  "citation": " Melchior. \"Telepathic Jaguars Changed My Life: experience with Ayahuasca (ID 13325)\". Erowid.org. May 2, 2002. erowid.org/exp/13325",
  "substance": "Ayahuasca",
  "views": "21238"
 }
}
