{
 "id": 11428,
 "title": "And the Winner Is",
 "date": {
  "submission": "2002-08-09T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Seven Up",
  "gender": "Male",
  "weight": "53 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT"
  }
 ],
 "report": [
  "A friend of mine and I have recently acquired a fair amount (1g) of iprocetyl (4AcO-DIPT).",
  "We decided to give it a try together with what we thought should have been a medium dosage: 15 mg. The experiment was to happen outdoor (basically wandering around in our city) in the late afternoon on a sunny day. We both took it on an empty stomach at 3:55pm (the whole gram had been dissolved in pharmaceutical ethanol).",
  "We started walking around. The immediate first effect I felt was that of a queasiness showing up. It was probably due to the fact that I had ingested 90 degrees proof ethanol with a very bitter alkaloid (it was pretty disgusting !!!) rather than to the pharmacology of the stuff itself. Anyway, after about 20 minutes I started feeling a curious sensation as iwas walking : a sort of floaty dizziness; I also noticed that I tended to smile and laugh more than usual. Humour was there. Smiling was too much : my cheeks would hurt. At a higher dosage i suspect this cd lead to jaw clenching. The floaty sensation kept building up for another 15 min to the point that I felt that it wasnt I who was  walking in the street, but my body was just doing it by itself, whereas I was just a happy cloud !!!",
  "At some point I felt a nauseaous feeling in my oesophagus, but it quickly faded. My friend on the other hand had a stomach ache that wouldnt go away fo the whole experience.",
  "After that, things were rather uneventful for me; the overall feeling was that I had drunk 3 beers with, say, 40mg of MDMA : drunk, relaxed, floaty, happy, and a very sensual (sexual) feeling on my skin and inside the body particularly in the pelvic region (for sure, this is another orgasmic tryptamine). The floaty feeling, I have to say, was quite the same one I had already felt on mushrooms: basically I felt as light as a cloud !!! My friend however was much more visually sensitive than I with this iprocetyl : for instance when we were in this public park, we just sat on a bench and he stared at the ground which was made of gravel.",
  "After some thirty seconds, he reported to see a rippling movement on the gravel (to be more precise he told me it was as if water was flowing on it), and then a rippling tree  rising out (a tree made of water as he said). I didnt experience any visual effect. Sounds on the other hand were much more pronounced : little birds chirping and little children playing were just a rapture  grownups talking about their every-day life was a real downer ! Anyway the high lasted about an hour and it started waning circa 5:30pm and by 6:30 I was totally clear. All in all a mild (++) pleasant and very short experience with no physical disturbances (except the two I have already mention). This looked all like a compacted light low-dose mushroom experienced. I felt none of the negative sides that other users experienced (tremors, jelly legs).",
  "I should say however  that when the effect were totally gone, I found myself more introspective than is natural for me, and a couple of hours later I felt very different: for some time now I had been rather demotivated in many aspects of my life (and particularly in my studies), always thinking about distracting and unimportant issues. After this experience I felt totally cleansed from this triviality and more able to focus on what was important and relevant. I was shown the overall vanity and unimportance of ego games.  It enabled me to settle a whole bunch of things I had to cope with but that I had constanly postponed. The next day, I was feeling determined and focused.",
  "Next month Ill go for 20 mg.",
  "My opinion : this is a winner (fun and productive), highly recommended !!!"
 ],
 "erowid": {
  "id": "7108",
  "citation": " Seven Up. \"And the Winner Is: experience with 4-Acetoxy-DiPT (ID 7108)\". Erowid.org. Aug 9, 2002. erowid.org/exp/7108",
  "substance": "4-Acetoxy-DiPT",
  "views": "15444"
 }
}
