{
 "id": 11427,
 "title": "To Solve a Bad Trip",
 "date": {
  "submission": "2008-11-06T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Max_AvA",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "substance": "LSD"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Quetiapine"
  }
 ],
 "report": [
  "It started out a simple Friday night, with me and some friends hanging out at a girls house. We decided that we wanted to fry that day (one of the friends had a nice connection, apparently, at $12 a hit) so we call up some people, pitch the money, and get a nice 6-7 hits of acid.",
  "One of the guys and myself took two hits, as we've done it before, whereas the others were about to embark on their first trip. We all dosed at the same time, with one girl (who was just smoking pot) deciding to be the chaperone of the event (it was her house). It started out nicely, with some music and a minor jam session. And then suddenly, someone freaks.",
  "It turns out that the other guy that got two hits was starting to have a bad trip. He was yelling in spurts and pacing and pulling his hair, and it just got progressively worse.",
  "The girl that was watching us made sure the other kids weren't near him, as he could have easily turned their nice trip into a bad one. Then she goes into her medicine cabinet, and pulls out a bottle of what I later learned was Seroquel. She gives him a 200mg pill, and he takes it after she coaxes him and explains patiently that it's the entire universe. He swallows, calms down a little because of her little talk, and eventually he just passes out on the couch.",
  "I've tried Seroquel recreationally and to be blunt, it does absolutely nothing.  If I stay awake while I'm on it I can get some minor hallucinations, lose track of time, and feel really really heavy.",
  "In my opinion, the only time Seroquel should be used is if you're either prescribed to it, you're taking it to fall asleep, or you're trying to get out of a bad trip. I've done it multiple times and it always works. Just some nightmares."
 ],
 "erowid": {
  "id": "71071",
  "citation": " Max_AvA. \"To Solve a Bad Trip: experience with Quetiapine & LSD (ID 71071)\". Erowid.org. Nov 6, 2008. erowid.org/exp/71071",
  "substance": "Quetiapine & LSD",
  "views": "9397"
 }
}
