{
 "title": "Ho Ho Ho & Half a Hit of E",
 "author": "Kirya",
 "citation": " Kirya. \"Ho Ho Ho & Half a Hit of E: experience with MDMA (Ecstasy) (ID 11450)\". Erowid.org. Jun 29, 2003. erowid.org/exp/11450",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   "70 mg",
   "insufflated",
   "MDMA",
   "(powder / crystals)"
  ]
 ],
 "report": "<p>Since I've found relatively few mdma-only insufflation reports in my research, thought I'd send this in. </p><p>drug: mdma only -- no other drugs/herbs/concurrent meds</p><p>set: peaceful, relaxed</p><p>setting: home</p><p>Thanks to my all-too-typical e-monster behavior at a party last month, my sweetie and I were left with only one cap of MDMA between us.  We'd planned to go to the beach to share it on New Year's, but the exigencies of separating and ingesting powders in the car and/or on a windy beach began to seem too daunting, so we decided to use it on xmas instead.  Since we only had the one cap (appx 140 mg), and we'd never done it this way before, we chose to snort it, hoping to squeeze a little more intensity from the experience in exchange for a shorter trip.</p><p>A few hours after a light dinner, we lit some candles and put some Digweed on the boombox, and split up the cap  on a mirror.  Even though we'd never insufflated mdma before, we're both quite familliar with the substance, so we chose to snort the whole 70mg dose in one go.</p><p>00:00:30  Ow, ow, ow!  We'd diced up those little crystals as finely as possible, but it still felt like glass shards going up our noses-- and coming down the backs of our throats.</p><p>00:15  The pain has subsided, but the icky taste persists.  And we both note with some disappointment that we're barely off baseline.</p><p>00:20  Definitely coming up, but very gently, none of the waves of e-intensity that usually wash over me.  We talk quietly & stretch yoga-style.</p><p>00:40  Finally feeling as 'up' as I'd expect to feel after a relatively low dose of mdma.  No psychic fireworks, but I feel very pleasant and content.  We're into the third or fourth remix of Beautiful, Strange, and we're Cute, Odd.</p><p>01:00  No higher, just floating along.</p><p>02:00 I open one eye long enough to find & blow out the candle, then we float off to sleep in each other's arms.  Awwwww.  :-)</p><p>To conclude -- I was surprised that we didn't come up more quickly, since insufflation is usually such an efficient method of administration.  Perhaps a higher dose would have come on faster.  I'll probably never know, however, because given the lack of payoff for the relatively painful experience of snorting it, I'll stick to swallowing mdma in the future.</p><p>P.S., A note to my fellow e-monsters, those of us who KNOW BETTER but still find ourselves taking 2+ hits in an evening in an attempt to get/stay higher -- less can be more!  After a low-key but still very sweet evening, we awoke refreshed & with no signs of the usual over ex-ertion.</p>",
 "year": "2001",
 "id": "11450",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2003-06-29T07:00:00.000Z",
 "views": "12250",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "70 mg",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ]
}
