{
 "id": 11466,
 "title": "Potential",
 "date": {
  "submission": "2009-05-18T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CrakkBakk",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "2:40",
    "quantity": "T+"
   },
   "substance": "smoked"
  },
  {
   "time": "4-Fluoroamphetamine",
   "administration": "T+ 0:00"
  },
  {
   "time": "smoked",
   "amount": "4-Fluoroamphetamine",
   "substance": "T+ 0:00"
  },
  {
   "time": "0",
   "amount": "smoked",
   "administration": "4-Fluoroamphetamine"
  },
  {
   "time": "0:00",
   "substance": "Lamotrigine "
  }
 ],
 "report": [
  "50mg experience report of 4FlouroAmphetamine (4FMP/4FMA/4flo etc)",
  "Me: male, 160lb, extensive drug history regarding meth, MDMA and ecstasy pills. Prescribed Lamictol for Bipolar Disorder.",
  "Girlfriend: female, 100lbs, moderate drug history regarding meth, MDMA and ecstasy pills. No prescriptions",
  "My mindset: relaxed yet excited to try a new drug",
  "Inentions: Have a good time w/ gf via empathetic effects/euphoria",
  "Stomache: empty",
  "GF appeared happy yet a bit worried about trying a new drug and ate about 1 hour before hand.",
  "T0:00: GF and I take 50mg of 4FlouroAmpehtamine orally.",
  "T0:40: I'm feeling something for sure but it could be placebo at this point. It feels like a slight come up on MDMA but no stimulation at all.  GF is feeling stimulation.  I'm feely happy, not euphoric.",
  "T1:10: I'm feeling stimulated, but not in a twacked sort of way.  Hard to explain the feeling, best left as 'passive energy.'  GF feels twacked out to a degree.  I feel very, very euphoric, in a MDMA like way.  I feel MDMA like effects more then amphetamine effects, which I sort of feel at this point.  I'm perspiring a little bit and the window is open.  Studying seems plausible, but I would much rather flirt w/ my girl.  GF says this would help her study.",
  "T1:30 I feel like any of the stimulation I had is aleviating, not sure exactly.  I know that when I am rolling and I think I'm going to drop off soon I will, so I'm trying not to think about it and just record effects.  I still feel really good, not as much MDMA-like as before but still significant.  When I concentrate, I can actually make waves of MDMA-like euphoria come back.",
  "T2:00: I'm definitley not feeling as good as before but I'm not crashing.  I still feel good.  I feel like at the end of an MDMA roll.",
  "2:40 I'm still feeling the same, not crashed at all.  I decide to vaporize ~50mg between my girl and I.  I feel very high again, not as much as the 1:10 point. Good booster dose.",
  "How I felt at peak: Very MDMA-like except not as strong empathy wise.  Stimulation was great, it was like taking a ecstasy pill w/ an amphetamine in it as that you can dance and do stuff easily (Pure MDMA relaxes me) but it had no come down, as well as not any kick to it.",
  "I vaporized it two more times later that night, w/ effects lowering each time.  The last time I smoked I did not get high at all.",
  "I could sleep great on this, even after vaporizing it.",
  "I think the magic dose is going to be around 80-120mg.",
  "Problems: none, literally.",
  "After effects: sleep was fine, didn't feel crashed at all the next morning, neither did I feel 'e tarded.'"
 ],
 "erowid": {
  "id": "71356",
  "citation": " CrakkBakk. \"Potential: experience with 4-Fluoroamphetamine (ID 71356)\". Erowid.org. May 18, 2009. erowid.org/exp/71356",
  "substance": "4-Fluoroamphetamine",
  "views": "30757"
 }
}
