{
 "id": 11469,
 "title": "My Sleepy Sedated Day",
 "date": {
  "submission": "2011-10-07T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "C. Alm",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "pill / tablet"
  },
  {
   "time": "0:30",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Pharms - Gabapentin",
   "form": "powder / crystals"
  },
  {
   "time": "0:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "1:30",
   "amount": "300 mg",
   "administration": "insufflated",
   "substance": "Pharms - Gabapentin",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I have been taking psychoactives for a little over 2 1/2 years now.  When i saw how little info there was on gabapentin, i decided to share my story just for some extra information.",
  "The first time that i tried it i snorted two of the little capsules with 300 mg each.  All i remember is going out into the living room to watch tv, and then waking up the next day on the couch. This intrigued me because i dont even remember feeling tired.",
  "Knowing that insufflation is a quicker method of administration, thus not giving me time to observe 'coming up', i then took two tabs orally the next day.  30 minutes later i snorted a half of one and my friend took the other half in a couple of lines.",
  "We then smoked a bowl of chronic.",
  "About an hour after we smoked i started noticing some threshold effects.  I felt kind of lathargic and it took me a little extra time to react to external stimuli.  Not euphoric, but not unpleasant. ",
  "Feeling the initial effects and wanting to explore into this chemical a little bit more i then decided to snort one more pill. An oh boy am i glad i did!",
  "The sedation intensified and i entered a world similar to valium but with more coke-like thought processes.  Kind of hard to explain.  The body high was similar to alcohol and barbs but not exactly.",
  "The real interesting thing about this drug is the classification for recreational use. The crazy thing was that i got some mild visual hallucinations at a fairly low dosage.",
  "There was a girl sitting in front of me in class.  It looked like smoke was rising out of her hair, very strange.  If you have ever tripped diphenhydramine/ dimenhydrinate the visuals are pretty spot on like that.  But without the shitty cottonmouth.",
  "All in all Gabapentin takes a long time to come up and when I'm high, I just want to go to sleep.  But some good feelings and mild visuals were attained."
 ],
 "erowid": {
  "id": "71360",
  "citation": " C. Alm. \"My Sleepy Sedated Day: experience with Gabapentin (ID 71360)\". Erowid.org. Oct 7, 2011. erowid.org/exp/71360",
  "substance": "Gabapentin",
  "views": "12218"
 }
}
