{
 "id": 11475,
 "title": "First Trip, Mixed Reaction",
 "date": {
  "submission": "2000-09-10T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "wisteria",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "Well, my first mistake was that this, my first trip, was also my first time doing anything.  I was 17, and I've been a relatively 'straight kid' for most of my life, I mean I had only been drunk once.  Anyways, I had never quite been against drugs, and thought it would be neat to try one that would give me a definite, memorable experience.  So, a couple newer friends of mine asked if I wanted to trip, so I accepted.  I took one hit, and my friends each took two.",
  "All was well when it just started to kick in, extreme happiness, a body buzz.. I couldn't stop smiling and laughing.  Then, just as things started getting a bit overwhelming, my friends' parents came home.  So, we had to go out walking around a very busy part of town.  During our walk, we were especially out of it because 1) the acid we took was unusually strong and we were peaking 2) we were in a very uncomfortable, transient environment and 3) because we had no one to calm us down.  To make matters worse, a  guy came up to me, and asked me for my number, and then if I had any cocaine.  This, was particularly unpleasant, as I didn't want to be asked any questions, and I was somehow convinced that I might simply have been imagining the walk, and that I was still back at the house.  My friends proceeded to haul me into various stores at which we bought nothing, and I became even more irritated, afraid and paranoid.",
  "Finally we returned to my friend's house.  That's when we heard Rod Stewart music spewing from outside.  My friends, much more enthusiastic than I at this point, bolted outside to see where it was coming from.  Right then, alone in the room, I felt very overwhelmed, and wanted only to have the trip over with, so much so that I was almost willing to just call my parents and explain everything so that I could get help if possible.  My friends rushed back in, somewhat oblivious to my bad trip, as I was trying very hard not to show it.  Thankfully, my friend sat me down, put on some nice music, and put a magic eye book on my lap, which seemed to calm me down.  After I had come off of my peak, we watched tv, and then played with the snow on the screen.  The rest of the night was wonderful and calm.  So I guess I can say I'm not scared off lsd, but I'd definitely reconsider the environment in which to take it."
 ],
 "erowid": {
  "id": "714",
  "citation": " wisteria. \"First Trip, Mixed Reaction: experience with LSD (ID 714)\". Erowid.org. Sep 10, 2000. erowid.org/exp/714",
  "substance": "LSD",
  "views": "9103"
 }
}
