{
 "title": "The Nature of Syrian Rue Seeds",
 "author": "Orwell Huxley",
 "citation": " Orwell Huxley. \"The Nature of Syrian Rue Seeds: experience with P. harmala (Syrian Rue) (ID 1147)\". Erowid.org. Sep 11, 2000. erowid.org/exp/1147",
 "substance": "P. harmala (Syrian Rue)",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   "25 g",
   "oral",
   "Syrian Rue",
   "(seeds)"
  ]
 ],
 "report": "<p>\nAfter reading several accounts of the effects of Syrian Rue seeds I had found that there is some confusion as to the nature of this entheogen.  Many of the reports I had read, both online and off, contained a number of inconsistent results.  One 'scientific' study said that the seeds produced minimal, if any, reaction in humans.  Another report claimed that Syrian Rue seeds are not even an active constituant in Ayahuasca brews. </p><p>Several first-person accounts claimed reactions that ranged anywhere from 'mildly psychedelic' to 'no effect'; one account even accused the seeds of causing an extreme psychotic reation.</p><p>All of these reports stimulated my curiosity. I had to see for myself if Syrian Rue seeds were indeed the psychedelic that some entheobotanists purport them to be.</p><p>I had obtained 50 grams of Syrian Rue seeds.  I admit that my enthusiasm was restrained by the big 'Not for human consumption' label on the package, but I decided to go ahead anyway. </p><p>As for dosage, I had read somewhere that an entire ounce should be completely chewed and swallowed.  I decided to try a 25 gram dosage. I compeletely chewed and swallowed the seeds, which had a coffee-like taste to them.  The time was one o'clock AM.  (It should be noted that I had eaten lightly prior to ingesting the seeds).</p><p>I waited an hour and a half for the effects, which were somewhat slow to come on, but sure nonetheless.  'Success!' I thought to myself.  The seeds are truly psycho-reactive, contrary to a number of reports I had read.</p><p>The effects of the seeds are quite different from most psychedelics in that they alter optical perception much more than the cognitive processes of the brain.  This is to say that, while my vision was altered with patterns of light, tracers, and distortions of the spectrum, my brain was able to comprehend what was happening in terms of time, proportion, reasoning, etc.  I could think more or less clearly.</p><p>The poison advisory crept upon me when I vomited violently and suddenly.  This ocurred about one hour into the trip (about 2 1/2 hours after first ingesting the seeds).</p><p>Like many of my other experiences with psychedelics I was unable to sleep at night, so I decided to meditate through the experience.  The meditation was focused and refreshing. It also took my mind off of the stomach pains, which occured every so often. </p><p>The effects of the seeds lasted from 2:30 AM to 11:30 AM. The effects continued at peak for sevel hours (about 3 AM to 10:30 AM), and then rapidly subsided in an hour.</p><p>In conclusion syrian rue seeds are most definitely a powerful psychedelic.  Anybody taking the seeds should be careful with the dosage, since the seeds are most definitely poisonous and potentially dangerous.</p>",
 "year": "2000",
 "id": "1147",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2000-09-11T07:00:00.000Z",
 "views": "9636"
}
