{
 "id": 11473,
 "title": "Never Mix Pills",
 "date": {
  "submission": "2010-02-18T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "fortune",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Pharms - Temazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Trazodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Pharms - Amitriptyline",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": ".9 mg",
   "administration": "oral",
   "substance": "Pharms - Clonidine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I am 20 years old and have had a lot of experience with drugs. in fact im still struggling with a now 16 month heroin addiction. but this story is about some pharmaceuticals I decided to fuck with to get high and sedated because I couldn't sleep from withdraws.  well i was with my brother, who is 15, and I was real depressed. we were hang in his room, in the basement, playing video games. I got most of my pills from previous rehab attempts except for the temazepam. im prescribed 15mg of temazepam a night for sleep. I would normally never think of doing this but I was so desperate from withdraws I just wasn't thinking right. I cant sleep while withdrawing and thats all I wanted to do. it was 11:30 pm when I took all ten pills at once. five temazepam 15mg, one trazodone 50mg, one amtriptyline HCL 50mg, and three clonidine 0.3mg. just for the record I would much rather just get some suboxone (miracle drug.) for withdraws.",
  "11:30pm -Took all ten pills at once with a gulp of water.",
  "12pm -Went outside to smoke a cigarette with my bother and was feeling a bit wobbly but nothing too bad.",
  "12:30pm - EVERYTHING AFTER THIS POINT I HAVE NO MEMORY OF..... based on what my brother said, I got a phone call from my ex girlfriend and was slurring my words but sounded very happy. my brother left and came back six mins later to find me slumped over on the chair I was sitting on. he said he slapped me a few times and I woke up. he then helped me inside and I couldn't hold on to anything without dropping it. he said I fell over a few times and was slurring my speech so bad he could barely understand me. through out the night I kept passing out and my brother kept waking me up. then I passed out and he couldn't wake me up at all. he opened my eyes and saw them extremely pin point. my brother stayed up the whole night to make sure I didn't die. he even said I stopped breathing at one point. I woke up at about 3:40pm but still dont remember it and then passed out again till noon the next day. I woke up dazed and asked him what happened because I notice things in the room were out of place from what I remembered. thats when he told me everything.",
  "Im just glad to be alive and should never mix pills without doing there research. this was just a reminder to me, a slight reality check of where im heading if I keep up my heavy drug use. this isn't the worst thing that could of happened. people die everyday from mixing pills to get high. its a dumb way to die.",
  "                               yours truly, FORTUNE"
 ],
 "erowid": {
  "id": "71386",
  "citation": " fortune. \"Never Mix Pills: experience with Temazepam, Trazodone, Amtriptyline & Clonidine (ID 71386)\". Erowid.org. Feb 18, 2010. erowid.org/exp/71386",
  "substance": "Temazepam, Trazodone, Amtriptyline & Clonidine",
  "views": "21948"
 }
}
