{
 "id": 1148,
 "title": "Pink Floyd Led Me to God",
 "date": {
  "submission": "2007-06-20T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Happyinbaja",
  "gender": "Male",
  "weight": "270 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "<p>I decided to try some mushrooms with a friend who has done them before.  It was my first time, so he insisted that we 'set up' the room, so that we would have the best 'experience'.  He proceeded to put cyalume lights on the ceiling fan, set up a black light and turn on some music.  I ate (with copious amounts of Dr. Pepper) about 4 stems and tops, don't know the exact amount, but I think it was less than I should have for my body weight.",
  "We lay on the bed and stared up at the ceiling fan.  He had taken more than me, so in about 30 minutes he was enjoying himself thoroughly.  I was not feeling anything.  He suggested that I take more, but I didn't want to overdue it the first time.  About 45 minutes into it, I started to feel a numbness coming up from my feet.  The ceiling fan was doing nothing for me so I closed my eyes.  Pink Floyd was ripping a mean guitar solo and it began:",
  "I was outside, looking at the speaker that the music was coming from.  The speaker was aimed towards the sky, I looked at where the speaker was aimed and saw the heavens beginning to open up.  It was as if the music was beckoning God to open the sky and take a peak at the beautiful sounds.  God was beautiful, he was the old man that we always imagine.  Long white beard, all knowing, all powerful, all love.  He smiled on me, and motioned for me to come towards him.  It was here that I got scared and wondered..'If I go, will I return, or will that be it' So I asked my buddy:",
  "Hey, Should I go with him?",
  "Who?",
  "God, he wants to show me heaven...",
  "Sure, go.",
  "Yeah but can I come back, or is this it?",
  "If youre going to heaven what do you care?",
  "So I went. It was the most beautiful thing I have ever seen.  As if he knew my question, God showed me the afterlife.  It wasn't heaven, but another plane of existence.  Like a door, nothing to fear, just a growing experience.  Eventually, I would make it to heaven, but even when I die, I will not go there directly.  He showed me that there are multiple levels on the way.  Heaven was indescribable, so I won't try, but it was desirable for sure.  I never actually spoke to God, I got the feeling it was not allowed, but he showed me what I needed to see. ",
  "I have always been a Christian, now I am questioning the very foundation of my belief system.  I asked my friend, 'Could Pink Floyd be the Messiah, the guide to God'  I know it sounds crazy, but I really wonder if mushrooms were put on the earth to help us find God? ",
  "I want to visit this place again..I didn't get enough.  Whatever the truth is, it is far beyond my conscience thoughts.</p>"
 ],
 "erowid": {
  "id": "13341",
  "citation": " Happyinbaja. \"Pink Floyd Led Me to God: experience with Mushrooms (ID 13341)\". Erowid.org. Jun 20, 2007. erowid.org/exp/13341",
  "substance": "Mushrooms",
  "views": "2913"
 }
}
