{
 "title": "Pseudo-Inebriation",
 "author": "]uFo[",
 "citation": " ]uFo[. \"Pseudo-Inebriation: experience with Abinsthe (Homemade) (ID 11482)\". Erowid.org. Feb 24, 2007. erowid.org/exp/11482",
 "substance": "Abinsthe (Homemade)",
 "bodyweight": "185 lb",
 "report": [
  "<p>Upon looking through as many Absinthe recipes as possible on the web, I extracted a common thread and found a recipe that seemed to fit the mould. I used all the ingredients listed (calamus, melissa, wormwood, fennel, anise, coriander) and unfortunately did not locate Hyssop or Anise Seed.",
  "The first experiment was with 750ml of 40% Vodka, as us Canadians cannot buy moonshine/everclear as americans can. The mixture sat for a week or two and began to smell of a very pungeant licorice, following suit to what I had read. When it came time to strain, I did so and to my disappointment came out not with an emerald green liquid, but a golden brown. Which was fine, I knew the 'green' comes mostly from the chlorophyll, so I wasn't too upset. I did not use a distillation process.",
  "I poured 2 shots of this bitter liquid into my glass and added water, which upon touching the liquid, did pleasantly cloud up.  The taste was what I had expected (I have been drinking a cup or two of wormwood tea a week for months now); licorice and invasive at first filling all of my taste buds with something so unforgettable, and then as it passed along my tongue down my throat the bitterness followed: and LINGERED (for a long time, heh).",
  "The feelings derived from the intake of this absinthe was an increased lucid mindstate, not like a normal drunk off 'x' amount of ounces of vodka. The pseudo-innebriation is not for those who are looking to get 'all messed up' or to 'trip'. It's a process it seems of bringing more subtle states of being to a forefront; they are almost too easy to overlook sometimes. Maybe absinthe is best enjoyed in a relaxed atmosphere, with not an overload of external stimulus (noise, bars, parties, mardis grases), or so I found through the 4 or 5 nights the liquid lasted me.</p>"
 ],
 "year": "2001",
 "id": "11482",
 "gender": "Male",
 "views": "7512",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Absinthe",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2007-02-24T08:00:00.000Z"
}
