{
 "id": 11538,
 "title": "Defined and Memorable",
 "date": {
  "submission": "2001-06-02T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Saint K",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "pill/tablet"
  },
  {
   "time": "6:15",
   "amount": "125 mg",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The day started off seemingly normal as I awoke to take my daily dose of Wellbutrin that was prescribed to me about a year ago to help my diagnosed ADD (Attention Deficit Disorder.)  I took this dose of 125MG at around 6AM then proceeded to high school (to give you a rough idea of my age.) ",
  "The day was going normal and my medicine was working fine until about noon.  I arrived in study hall to a feeling of severe anxiety and stress.  I felt like that at any moment I was going to snap and requested a pass to the nurse's office.  Once there, I thought another dose of my Wellbutrin may help do the trick.  The nurse allowed me to do so, though I'm not sure if she was suppose to or not, and I went back to my classroom.  About 15 minutes after taking the extra dose of Wellbutrin (125MG more, totaling 250MG including the previous dose), I entered a somewhat hallucinogenic state. These feelings were very defined and memorable.  Sounds became louder, colors became more brilliant, and the actions of those around me seemed somehow 'closer' to me.  In one instance, a girl across the room ripped a piece of paper in half and then put her hair into a ponytail.  The whole time I felt as though I was right in front of her, or even next to her.  The lights became brighter as I stared at the ceiling panels, I noticed bold tracers in the patterns of the ceiling, but only faint tracers in other places. ",
  "About 10 minutes later, the bell rang and I began my trek toward the cafeteria.  On my way there, people's conversations became very clear to me, even as they walked passed.  Facial expressions of those around me also seemed more dramatic and somehow 'meaningful' even if had nothing to do with them.  After about 3 hours, the effects of this wore off and I felt completely normal.  Personally, I haven't experienced any side effects of Wellbutrin, but I'm sure some people have.  I am not a 'professional' but I do have quite a bit of knowledge in dealing with mushrooms, LSD and Morning Glory.  I must say the 'trip' from Wellbutrin I had was very unique.  It seemed to emphasize the feelings around me rather than completely altering them. ",
  "I am in no way encouraging the experimentation or double dosing of prescribed medicine, but I am sharing my personal account.  I have heard about 10 other accounts of this from people who have double dosed on Wellbutrin.  I have seen no other published accounts of Wellbutrin experiences and I hope this helps in learning about Wellbutrin."
 ],
 "erowid": {
  "id": "7185",
  "citation": " Saint K. \"Defined and Memorable: experience with Bupropion (Wellbutrin) (ID 7185)\". Erowid.org. Jun 2, 2001. erowid.org/exp/7185",
  "substance": "Bupropion (Wellbutrin)",
  "views": "67466"
 }
}
