{
 "title": "The Other Side",
 "author": "MTBtripper",
 "citation": " MTBtripper. \"The Other Side: experience with H. B. Woodrose & Nitrous Oxide (ID 11553)\". Erowid.org. Jul 27, 2007. erowid.org/exp/11553",
 "substance": "H. B. Woodrose & Nitrous Oxide",
 "bodyweight": "155 lb",
 "report": "<p>[Erowid Note: 48 inhalations of nitrous oxide is considered an extremely high dose]</p><p>I got home from lifting weights and decided today would be a good day to take some HBWS.  It was a rainy Sunday afternoon and it and I had nothing to do.  On the way home I stopped by the local headshop to pick up some more nitrous, those guys must think I'm a nitrous freak by now.  I've often used nitrous/marijuana as a combo of choice to explore my mind/existence, I've had some good results as long as I didn't try to do it too much!  On the previous Wednesday I for the first time smoked some Salvia with the nitrous, and it was the most intense thing I've ever felt!  I was listening to some Medeski Martin and Wood, and I've never felt music like that before!</p><p>So about 5 hours after taking the seeds, I was feeling them but it wasn't very intense.  I just downloaded some live Bob Marley so I lit up some candles, turned on my heat dish (highly recommended for nitrous trippers!)and cracked a few charges into my balloon.  After I inhaled the nitrous I completely lost myself in time/space.  The last thing I remember was my exgirlfriend's mom from 10 years ago say 'now you're going to meet your makers.'  This made me laugh, and I had thoughts of strange chemist/gods who create us for their own amusement.</p><p>As a mountain bike addict, I had visions of my makers as stoner mountain bikers, and this was the funniest thing in the world at the time.  Along with this nitrous flash came a wave of INTENSE pleasure.  When I became aware of who/where I was I starting cracking more nitrous and continued until they were gone.  Well, the term 'chasing the dragon' comes to mind, I wanted to return to the place I was just at, not only for the mind expansion but for the INTENSE pleasure.</p><p>Soon the experience went from good to bad.  I felt like a complete junkie, sucking away at this balloon all alone in my room.  I then went on one of those introspective life trips:  What am I doing with my life?  Are these drugs I take for spiritual purposes and not just an excuse to get high?  Suddenly, my feelings of oneness with the universe reversed, and I felt complete isolation.  I still had like 30 nitrous hits left, and for some reason I could not stop doing them, even though the trip was getting very negative.  I examined things like my inability to commit to a woman, my rebellious nature, everything.  Suddenly my whole existence was a sham, society wasn't wrong like I have always thought but it's my inability to follow the leader that's the problem.  And yet I continued to crack these goddamn nitrous hits into the balloon of death, or so it suddenly seemed.</p><p>Finally I finished the nitrous, I think I may have been crying as my makers pounded me with the reality I have been hiding from all these years.  The concept of having a family, which has always seemed to be an unneccesary burden to me, suddenly seemed to be what I was so lacking to make my life complete.  I felt as though I may die soon, and I better reproduce before it happens.  All of this was swimming through my head when I made my way to the toilet to puke.  As I was puking, I felt as though I may have been dying, and that death would be the only way end this bad trip.</p><p>Then I heard my 3 year old niece say 'Don't go Uncle Jim, I need you!'  This made me think of all my loved ones, and how much I mean to them.  How much people look to me for strength, which I have a lot of.  The only problem now was that I felt brain damaged.  Usually, when I stop breathing the nitrous it goes away, but with the seeds in me it seemed to just continue.  I felt like I knew what it was like to be other people, and I understood things from other people's perspectives (another of my serious flaws), and I understood how the world doesn't operate by my rules of logic that I so rely on and preach about to everyone. </p><p>The only way to end this was to go to sleep.  I got into bed and closed my eyes, but things were still twisted.  Everything looked small and far off.  I was hearing strange voices and I thought 'This is what it must be like to be schizophrenic.'  Unfortunately, I couldn't sleep.  I could just lay there and examine my shortcomings:  my constant joking around was suddenly not my goodnatured personality but my lack of maturity, my rebellious nature and admiration of people like Che Guevara was suddenly not due to my ability to see the world as it truly is but my inability to mesh with other people.  I have never felt more alone or isolated in my entire life.</p><p>The first 5 hits of nitrous were like seeing heaven, but I think I had to pay the price and see Hell as well.  I think it'll be awhile before I journey off into the void again.  EVERYTHING has it's dark side, and if you are intent on seeing the world as it truly is, beware that the dark side is in us all.  Now I understand the judeo-christian tradition of seperating good from evil, it's alot easier to believe that the evil is in other things, but not oneself.  I think I did learn something though, and it's that I'm not getting any younger (27) and that part of life is making new life, which scares the shit outta me but I think it's time for me to move on to a new phase and stop tripping so much: it's time for action.</p>",
 "year": "2001",
 "id": "11553",
 "gender": "Male",
 "timestamp": "2007-07-27T07:00:00.000Z",
 "views": "5518",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "12 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  "1": {
   "time": " T+ 5:00",
   "amount": "48 hits",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
