{
 "id": 11567,
 "title": "I Brought This Horror on Myself",
 "date": {
  "submission": "2010-07-21T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bulkspin",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "substance": "Clonazepam"
  },
  {
   "time": "0",
   "amount": {
    "number": "T+",
    "unit": "0:30"
   },
   "administration": "0.5 tablets",
   "substance": "oral"
  },
  {
   "time": "Naltrexone",
   "amount": "(pill / tablet)",
   "administration": "T+ 10:00",
   "substance": "150 mg"
  }
 ],
 "report": [
  "I think that these stories about Naltrexone are very important. Mine is a little different.",
  "I had been taking oxycontin and dilaudid for years, but I had been struggling to get off them almost from the start. I had been taking either 150 mg Dilaudid (or the equivalent amount of oxy) daily for about 6 months solid. I had booked a trip to Africa to detox and I could not get a legitimate prescription for that amount to carry over the border. My supplier was running low, so I had no choice but to try to rapid detox myself. The doctor suggested that I could squeeze by taking the Naltrexone after being off opiates for 5 days, the pharmacist told me 10 days clean first.",
  "After ZERO days clean, I woke at 8 am Saturday morning (flight scheduled for Tuesday morning). I immediately took a tranquilizer (clonazapam) and after waiting 1/2 hour, I took 1/2 of a Naltrexone tablet. After 10 minutes the floor fell out of my existance. I could not move from the couch. I puked and puked actual projectile vomiting, right on the floor beside my couch in my living room. I barely was capable of turning my head to make sure the vomit did not land on me or choke me. Never-the-less, I almost did choke. I had never puked like that before. It just kept coming and coming and I could not get a breath in edgewise. I was pretty sure that I would die from choking on my own puke.",
  "A friend came over and an found me on the couch puking again about 10 minutes to 1 hour later. Somehow they managed to help me upstairs to the bedroom and washroom area. I sat on the toilet as best as I could and PEED out my arse-hole for about 15 minutes then sat for another hour itermitently doing the same thing. All the while I was experiencing all the other typical withdrawl symptoms TIMES 10!",
  "I somehow got cleaned up, I think my friend helped, and into the next room, which was the bedroom. He put a big puke bucket by the side of the bed, asked if I needed to get to the hospitol - I declined. He left. I remained in bed, in a delerium, missing the puke bucket a few times more. At about 6 pm, I begged someone to come over who had some dilaudid and they did. They gave me my regular dose for an evening. I managed to keep it down! It was enough to keep the worst of the withdrawl pain at bay.",
  "The 1/2 pill's effects lasted a couple of days; slowly tapering off and allowing the opiates to have more and more effect. I missed my flight to Africa. I got clean a month later by heading to the bush on the other side of the continent (a cabin with a jacuzzi and a swimming pool).",
  "Watch yourself around Naltrexone!"
 ],
 "erowid": {
  "id": "72039",
  "citation": " Bulkspin. \"I Brought This Horror on Myself: experience with Naltrexone, Clonazepam & Hydromorphone (ID 72039)\". Erowid.org. Jul 21, 2010. erowid.org/exp/72039",
  "substance": "Naltrexone, Clonazepam & Hydromorphone",
  "views": "6311"
 }
}
