{
 "title": "For Stress; with Other Meds",
 "author": "anno k",
 "citation": " anno k. \"For Stress; with Other Meds: experience with Kava, Divalproex, Quetiapine & Sertraline (ID 11562)\". Erowid.org. Oct 28, 2004. erowid.org/exp/11562",
 "substance": "Kava, Divalproex, Quetiapine & Sertraline",
 "bodyweight": "175 lb",
 "report": "<p>OVERVIEW:</p><p>I have recently had the opportunity to try Kava. I initially bought it for stress, but found its positive effects nice and worthwile.</p><p>It is a mild high, that is notable, relaxing, short living and does not completely dehabilitate me. It is narcotic-like in nature, and is a mild disassosiative (sp). Kava allows introspective thought, but will not completely take me out from my surroundings in the doses I have been taking. But I have noted an increase in its effects, both physiological as well as psychological over the period of my use. Higher doses may produce more trance-like effects, but given the type of high I seek, I did not attempt. That and my medical conditions caused me some caution.</p><p>EXPERIENCE:</p><p>At first use, I noticed a slight warmness and controlled breathing. Sometimes feeling a climb in libido. A dark room, and a soft bed maximized its effect.</p><p>Later, the warmness climbed over my entire body, especially over my neck and upper spine. My breathing was highly controlled and the effects more immediate (less than one minute). The drug would last longer (peek between 30m and 1h, with lingering lasting up to 4h) My eyes would become 'droopy' and effects more pronounced, also a difficulty in keeping in touch with my surroundings was present on heavier use (1/3+ drop 4-6/day after two weeks of variable use)</p><p>CONDITIONS:</p><p>The kavatone concentration of the product I was using was very high (about 50%) and I was already on a heavy dose of psychotropics [Divalproex (Depakote), Quetiapine (Seroquel) & Sertraline (Zoloft)], as well as a bipolar history, with a high risk of state induction. I did not dilute the solution. And found that it worked best if allowed to pass under the tongue, before swallowing.</p><p>ADVERSE REACTIONS:</p><p>I did find Kava to be mildly habit forming, with withdrawal symptoms similar to any psychological dependence. For me, this included elevated blood pressure (+20 points) elevated pulse (+10 points) lack of appetite, hot flashes, irritation, apathy, depression and irrational thinking. I was in detox when i last used.</p><p>Use caution if you have a dependent personality, and with all substances, chooses a low starting dose, esp on perscription psychotropics. I was using a lower dose (1/4 1x day-1/4 3x day) for two weeks before ramping to my max (3/4x1+1/2x6/day)</p><p>*All measurements are noted in standard eye dropper fractions.</p>",
 "year": "2001",
 "id": "11562",
 "gender": "Male",
 "timestamp": "2004-10-28T07:00:00.000Z",
 "views": "11513",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Kava",
   "form": "(liquid)"
  }
 ]
}
