{
 "title": "Science Fiction",
 "author": "Cheshire",
 "citation": " Cheshire. \"Science Fiction: experience with MDMA (Ecstacy), Amphetamines & Cannabis (ID 11588)\". Erowid.org. Apr 10, 2008. erowid.org/exp/11588",
 "substance": "MDMA (Ecstacy), Amphetamines & Cannabis",
 "bodyweight": "80 kg",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "MDMA",
   "(pill / tablet)",
   "",
   "1 tablet",
   "oral",
   "Amphetamines",
   "(pill / tablet)",
   "",
   "4 hits",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>New Years Eve 2001</p><p>Just before leaving the house to go to the giant New Years rave I had gotten into a massive fight with my sister over her unannounced 'New Years party' that was happening at our house. Leaving the house I left a particularly harsh message to her since I couldn't be bothered dealing with her and stressing out on such a night. The location was a well hyped New Years rave that had been said to always be good, since it has been a Rave that happens every New Years for a while. Preparation for the night was done by not eating too much during the day. Light meals consisting of fresh fruit and juices were taken to avoid the discomfort of hunger. I also had some Vitamin C tablets and a Vitamin B drink before taking the pill.</p><p>I dropped half of a pill 'White Omega' that I had saved from a rave 2 months previously and I knew to be one of the best MDMA pills of the year. This was at 11.30pm. For ages there was not a feeling at all. I couldn't really get into the music and I still felt angry about the fight with my sister. Exploring around the venue I realised that I had a really pissed off look on my face and that maybe I should at least smile remembering how unfriendly scowling people look.</p><p>At 12.30 there was still nothing at all and I was getting the old feeling of 'Maybe, just maybe I have been ripped off here.' Chatting to some friends who were already buzzing off combinations of speed and MDMA I thought to myself that I should call my sister and try to make amends. After finally getting through, apologising and wishing her a happy new year I suddenly felt utterly fantastic. It was as if the negative feelings that I was harbouring from the fight had been smothering the E, and now that the bad feelings were gone I could say that I went from nearly dead sober to approaching peak in about 5 minutes.</p><p>Wondering around I decided to enjoy the come-up in the very top floor, I'm not sure who was spinning but the music was very funky and not hardcore in any way. There were only about 10 people up there which surprised me but I did not care in the slightest as I started dancing around and really feeling the music.</p><p>It all hit me at some point after I stopped dancing. I apologise for not giving accurate times from here on in the report as I deliberately did not look at my mobile phone clock for fear of my knowledge kicking in about X ('Oh no its been 2 hours, I'm gonna stop peaking soon') and mentally squashing the roll with facts. Making my way to an area that was playing some hard Drum n Bass I realised that it was awesome music. I have never liked Drum n Bass before in my life but in that instant I knew that I had to be dancing. And man did I dance. Shutting my eyes and grinning while I felt the waves of bass and energy wash over me I let my body do whatever it wanted as long as I could keep feeling this great. The MC who was sort of rapping over the music suddenly yelled into the microphone:</p><p>'We are having an awesome night playing and spinning for you guys in this rocking place. If you are having one of the best New Years you can remember. People. MAKE SOME NOISE!'</p><p>An allmighty cheer went up from the crowd which affected me so profoundly that while typing this report I get chills. I lifted my arms high and with eyes shut just yelled. The feeling was so intense that I imagined/felt my body blurring upwards, it's very hard to describe if you have no experience with Photoshop or other graphics programs but its like my entire being had the 'wind distortion' applied to it and for about 5 seconds. I was in total and utter bliss while the music came on and everyone started dancing some more.</p><p>While in this room I looked over to my right to see an incredibly attractive girl of about 19. We chat/yelled to each other for a bit and I learnt that her name was Hannah. She was not as beautiful as say - Britney Spears, but that night while I was talking to her she was infinitely more stunning. The strange thing was that unlike the usual drunken state when I come across a beautiful girl I did not have any sexual/primal urges towards her whatsoever. We talked briefly and the entire time I felt as if I was in love with her, then we parted. Not once did I think of her in a sexual way, but more I appreciated her in the same way one appreciates a fantastic view of an ocean at sunset. Breathtaking.</p><p>Other extraordinary things that happened were the conversations with strangers I had, many of them approaching me offering Vicks or Medic Spray since I must have looked utterly blown with a giant grin on my face. A sweaty singletted bloke came up to me and said 'Having a good night mate? Happy New Year' then gave me a hug. Normally my homophobic self might have been a little bit reluctant of this - even though there was nothing sexual - but at the time it felt so brotherly and friendly I felt humbled by the kind guy and wished him a good night.</p><p>A couple of times I had some trouble communicating to strangers though. Just being friendly I was saying hello to people and offering Fisherman's Friends Super Strong mints, great little rave candy that was like vicks for you mouth and lungs. First girl I offered jumped as if she was stung saying 'What the hell are you trying to say? What question do you really mean?' I could not understand why she was being so defensive and negative so meekly replied 'Sorry. Just trying to be friendly' and walked off. Even now I don't know if she thought I was trying to slip her a date rape pill, or trying to say she had bad breath, or even trying to make a pass at her. Ah well.</p><p>I met up with one of my very good friends Emma whom I had traveled with briefly over in Europe about 1 year ago. Being a long time good friend of mine we chatted and I opened up about something that I had never admitted to myself before. That I was depressed. Not at the rave mind you, but in ordinary, everyday life. She was utterly flabbergasted (sorry, had to use that word). And proceeded to do the coolest thing in the world to me and basically told me why I should not be depressed at all. I asked her what it was like to know me as a person and she also told me many things that really made me feel good. I was worried that I might have been very egotistical and over-talking about me and I brought this issue up with her but she brushed it off with a laugh.</p><p>Sitting in the same room after Emma left I tried to think about myself in 3rd person and wonder what it was like for people to know me. Am I a likeable person? How do people see me? Thankfully I came to the conclusion that I was generally a pretty good person although not without faults. I made the mental note to try to improve those faults as a sort of New Year Resolution.</p><p>Outside in the tent I was chilling out and met up with a bunch of my friends who were all speeding. The peak had subsided somewhat although I had found that I could make the E rise up again simply by shutting my eyes and thinking. 'My family loves me.' It sounds very corny but that one phrase always had me smiling and mildly peaking all again. A friend's girlfriend gave me a utterly earth shattering backrub and I had to catch myself from letting out soft moans. I bought a single dexamphetamine tablet off her that I took asap only to keep myself awake and to delay the comedown of the pill at least till sunrise. The dancing part of the rave was winding up for me and I spent the rest of the time talking to people and making new friends.</p><p>Eventually as dawn broke I shared a pre-rolled joint with a friend and discussed the nights activities. I was a little bit scattered and a little sleepy but not overly exhausted.</p><p>One of the best nights of my life.</p><p>Jan 1 was here.</p>",
 "year": "1000",
 "id": "11588",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-04-10T07:00:00.000Z",
 "views": "2895",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
