{
 "id": 11584,
 "title": "First Departure From This Universe",
 "date": {
  "submission": "2003-01-15T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Toby",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "80 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ],
 "report": [
  "<p>I had been reading about salvia for quite a while. First came upon it when my mom got some spam touting salvia divinorum as a 'legal pot substitute'. I didn't believe it, but decided to find out what it really was, since my interest was piqued. As you know, what I discovered was that it is much more than any pot substitute...",
  "After finding out what it really was, I decided I definitely wanted to try it. I hadn't done any real psychedelics before. Only other drug I've used has been marijuana.",
  "Even though I decided I wanted to try salvia pretty quickly, it took me a while to actually get some. I didn't want to buy from any of the online places because they were either too expensive or gave me the feeling that they weren't trustworthy.",
  "Then about a month ago when I was perusing the alt.drugs.salvia and alt.drugs.psychedelics newsgroups, I came across some posts from someone who worked in the health services department of my university. I emailed him and asked if he knew of any local places I could get some salvia, and he knew of some. So then I bought an ounce of regular Mexican leaves ($40), and a gram of standardized 5X 'incense' (crushed leaves) ($20).",
  "I told myself I had to wait until I had a sitter before trying any of it, but I decided to try the regular leaf right away. I didn't want to smoke enough to really trip, just enough to get a feeling for it.. A taste.. Crushed a couple leaves up and smoked a bowl. Definitely got a bit high, but no visuals or altered perceptions or anything like that. Got really hot and sweaty too.",
  "Few days later I smoked about 2 bowl fulls of regular leaf. I had Aphex Twin's Selected Ambient Works II on real low in the background, and all the lights off in my room. Also had some incense burning to add to the atmosphere. I had some slight dissociative feelings when I sat and tried to meditate, but my mind never left my body. Again, very hot and sweaty.",
  "Then I didn't smoke any more until a week or so later when I went home for Memorial Day weekend. My best friend came and I had previously decided that would be a good time for him to come over and be my sitter. We also decided to videotape me with my family's camcorder.",
  "The other reason I wanted to wait until I was home was because my dad is a high school chemistry teacher, so he has some accurate scales at home. I didn't want to guesstimate how much 5X I was smoking. I used his electronic scale that measured to the 1/100th of a gram.",
  "From what I'd read, 1 gram of 5X was good for about 12-15 uses. I'd also read that around 1mg of Salvinorin A was a good dose when smoking. The 5X I had was standardized to have 12.5mg of Salvinorin A per 1g of leaf, so I figured I'd smoke around 1/12 of a gram. I used my dad's electronic scale to measure out around 80mg.",
  "I proceeded to set up the camcorder, and make a comfortable spot for myself on the floor. I started burning some incense, then locked all the dogs and cats out of the room and told my dad to turn off the TV and not make any noise. I didn't want any distractions during my trip. My friend and my dad sat on the couch nearby watching me.",
  "Toke #1: In.... hold for about 30 seconds... out.... Still here. No biggy.",
  "Toke #2: In.... hold for abou.... HOLY F*CK!$!%##^*(@#",
  "I don't remember exhaling.",
  "I was far away, out of this plane of existence, or universe, or whatever THIS is.",
  "I saw this universe mixing/melding with all the neighboring universes. They were forming into some sort of wheel type shape. Then the wheel started to rotate. I watched this for a while, watching all the universes rotate around and do their thing.",
  "Then I felt myself moving back down towards the wheel. I was a little worried at this point, because I was pretty sure I wasn't going to land on the same part of the wheel that I came from. I didn't think I was going to return to the same universe.",
  "I became aware of my surroundings again. I saw my friend and my dad sitting on the couch, looking at me. First thing that came to my mind was, 'Why are they looking at me? Is it because they're curious as to what the salvia's doing? Or is it because this is a different universe, one where I didn't just smoke some salvia, and they're wondering why I'm sitting here going crazy?'",
  "Then I remember yelling 'OH MY GOD!!! OH MY GOD!!!' over and over for a while. Apparently this was just in my head, and I never really yelled anything... Anyway, the thought that I was screaming 'OH MY GOD' didn't exactly put my mind at ease with regards to wondering if my dad and friend thought I was going crazy.",
  "As I came down some more, I actually did start to say 'Oh my God!' a few times (but it wasn't screaming at all). I think my dad said some comment like 'There's my atheist son!'",
  "Now that I was more firmly entrenched in my body I was reallllly thirsty. I was very glad I made myself some iced tea before starting my journey. I downed one mug full (used a mug so I'd be less likely to break or spill) right away, then asked my friend to get me another mug full. I tried to get up and do it myself, but that was pretty futile. Like my previous experiences, I was sweating like a pig. Even more so this time. My face was sweating buckets. It was pretty gross actually.",
  "Now I was pretty much normal, and decided to watch myself on tape. DAMN IT. The microphone didn't work. Video was fine, but no sound. Apparently I made some rather amusing noises. At one point I was explaining my experience to my friend and dad, or at least I thought I was. According to my friend I was just making mumbling, incomprehensible noises. And when I was asking for my iced tea, apparently it just came out sounding like 'bottle.' I wish that damn mic worked... Oh well, there's always next time.",
  "The amount of time I spent 'not here' was only like 3 minutes or so. After I was back 'here' it was probably another 20 or 30 minutes before I really felt normal.",
  "Next time I think I'll try a little smaller dose of 5X, so it's not quite so mind-blowing. Or I'll try the quid method, so it's not so sudden. Slowly entering Salvia Space would be a more pleasurable experience I think. On the other hand, if something bad happens, it would be longer before I came back... We'll see.</p>"
 ],
 "erowid": {
  "id": "7213",
  "citation": " Toby. \"First Departure From This Universe: experience with Salvia divinorum (5x extract) (ID 7213)\". Erowid.org. Jan 15, 2003. erowid.org/exp/7213",
  "substance": "Salvia divinorum (5x extract)",
  "views": "16042"
 }
}
