{
 "title": "Happy Fuckin New Year",
 "author": "bomb",
 "citation": " bomb. \"Happy Fuckin New Year: experience with 2C-T-7, Cocaine & MDMA (ID 11599)\". Erowid.org. Jan 4, 2002. erowid.org/exp/11599",
 "substance": "2C-T-7, Cocaine & MDMA",
 "bodyweight": "220 lb",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "insufflated",
   "Cocaine",
   "(powder / crystals)",
   "",
   "5 tablets",
   "oral",
   "MDMA",
   "",
   "",
   "16 mg",
   "insufflated",
   "2C-T-7",
   "(powder / crystals)",
   "",
   "2.0 mg",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>Im going to try to make this as short and concise as possible. But it is going to be hard.</p><p>On NYE my friend ODed on a drug cocktail that included 2-CT7, but did not die.  He was totally fine (but high) until he decided to snort the CT7.  Over the previous four days, he had partied pretty hard, doing both rolls and coke.  He got little sleep, and little food.</p><p>On NYE he did a small amount of coke (guessing about a quarter of an 8 ball) and 5 quality rolls before 1 AM (MDXX - EZ Tested)   He had the 2-CT7 in a bullet/bumper that he filled once with CT7 and emptied onto a mg scale.  Every dose was 4-6mg when he did this to make sure that a bump was reasonable.  He had previously bumped ~15mg in the past and was pretty fucked up but coherent, and able to go to a club.  20 minutes after the first bump, he did another bump for a total of 8-12mg.  It was just after 1AM.  Around 1:30 he started to realize he was too fucked up but was flying high, enough so that I knew to stay by him.  I offered him a xanax to try and bring him down a bit.  He took 1 mg then another mg about 20 minutes later when he was even more fucked up.  Around 2 Oclock I was able to talk the manager of the club into letting me back in if I could take him outside.  Little did I know I wouldnt have to worry about it.</p><p>After carrying him down the stairs because he couldnt see the floor I got him to the street and was able to get another (thankfully large) friend to help.  We spent the next hour and a half watching him get worse and worse.  At no time was he violent, but didnt know he was outside and was unable to walk.  He then became totally delusional, and we had to restrain him to protect him and others due to his thrashing.  I took his pulse and it was about 165,  very high, but not dangerous or unreasonable due to all the thrashing.</p><p>I am a strong 210lbs, and know how to immobilize someone, and it took everything I had to hold him down even with friends help.  Eventually his eyes started rolling to the back of his head and I knew it was 911 time, but a bystander beat us to it and at almost the same time I made the decision, the paramedics showed up.  Restraints came out and off to the ER we went.</p><p>I rode in the ambulance and told them the drugs I thought he took.  I told them he took XTC, Coke, Alcohol, 2mg xanax and a phenethylamine.  Of course they said, What?  do you mean GHB?  no PCP? no, its like LSD.  (yeah I know LSD isnt a phen but I was trying to make them understand why he was so delusional) On the way there, they nar-canned him with obviously no results.  He also had a small seizure on the ride there.</p><p>At the hospital I went through the same routine of telling them what drugs he took after about 20 minutes of them treating them.  I was told he had extremely low blood sugar and very high BP.  They gave him lowpressor (sp?) a drug to lower his blood pressure, IV ativan and valium to try and calm him down and a bunch of other shit that I didnt catch.  After around 6AM I left to take my wife home.  Right around then he had several more seizures and they decided to induce him into a coma.  Because of this they had to intibate him (put him on a respirator for his breathing, i.e big ass tube down your throat) around 8AM they moved him to the ICU and Im pretty sure they pumped his stomach since the tube from his nose contained some black shit that was probably charcoal they use for that sort of thing. </p><p>I returned at 2PM (six hours later) for the ICU visiting hours and he had stabilized.  His heart rate, BP and other vitals were close to normal but they still had him sedated and on the ventilator.  Today when I returned for the 10 AM visiting hours and he was coherent but tired had the ventilator, IV and stomach tube removed and was 1000% better.  They were very concerned about his heart, lungs and brain but so far all tests look good.  He is supposed to be moved into a regular room sometime today.  They expect him to recover fully but said he may have to stay for up to a week while they monitor his heart and the drugs leave his system (both the drugs they gave them and he gave himself)</p><p>Im not going to preach, if you cant figure out what everyone did wrong here, the Darwin principle may take care of you, like it almost did my friend.</p>",
 "year": "2001",
 "id": "11599",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-01-04T08:00:00.000Z",
 "views": "65168"
}
