{
 "title": "I Swallowed Them All",
 "author": "Andro",
 "citation": " Andro. \"I Swallowed Them All: experience with Caffeine (ID 11601)\". Erowid.org. May 4, 2011. erowid.org/exp/11601",
 "substance": "Caffeine",
 "bodyweight": "75 kg",
 "report": "<p>[Erowid Note: 1.8 gram+ of caffeine is considered an extremely high dose, see Caffeine Dose Chart]</p><p>A summer a few years ago - during one of my summer breaks from school - I spent the night up in front of my computer, while consuming caffeine pills I acquired at my local pharmacy. I at a few pills, two or three, once every 4 hours. I didn't quite get no kick or anything, but I acquired the sense of well-being and increased creativity that a few cups of coffee gives you once in a while.</p><p>However; when the sun finally rose I thought 'what-the-hell' and threw about 18 caffeine pills (100mg each) into my mouth. I tell you; these pills taste like shit! and eventually I managed to swallow them all. The taste, however, stayed in my mouth until I washed it down with a fresh glass of cola.</p><p>I sat in front of my computer for about 30 more minutes, and then I decided to go for a walk. When I went outside in the fresh air, I felt kind of tired, but as I kept walking the sleepy feeling turned into a nauseous feeling. And I kept feeling very nauseous for the following 3 hours. Every single step I took made me want to throw up, and every single breath I took felt uncomfortable. I went indoors again and decided to watch TV for a while. But as I slacked in my sofa, the nauseous feeling turned in to deep anxiety.</p><p>When these three hours had passed, the anxiety disappeared and was replaced by light euphoria and I felt a mood lift. My impressions of music was enhanced, everything sounded louder, clearer - more intense. I was really alert as well, my mind was running in the top gear. The effect didn't go away until late next afternoon.</p>",
 "year": "2000",
 "id": "11601",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2011-05-04T07:00:00.000Z",
 "views": "10273",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": " T+ 4:00",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  },
  "2": {
   "time": " T+ 8:00",
   "amount": "1.8 g",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 }
}
