{
 "title": "A Force of Nature",
 "author": "Stuttering_Poet",
 "citation": " Stuttering_Poet. \"A Force of Nature: experience with Salvia divinorum (ID 11602)\". Erowid.org. Oct 22, 2004. erowid.org/exp/11602",
 "substance": "Salvia divinorum",
 "bodyweight": "165 lb",
 "report": "<p>Before you are the events of my second encounter with Salvia. To hear of my awakening with Salvia read my experience report First Encounters of the Strangest Kynd.</p><p>After having inhaled the essence of Salvia I knew I had found something that would allow me to be witness to a spiritual plane of existence. My spirit had faintly touched upon something that would, in time, open my mind to see things as they are. I had been talking with J all week about yet again partaking of Salvia. J agreed, this time however, we knew that we must make our time together a sacred time. We knew from our previous experience that the Green Lady was not a thing to be toyed with, it is a spiritual tool.</p><p>We had taken a large candle from J's house and went into a small tree fort that is behind his house. We set the candle in between us and we both offered up prayers for safety and wisdom.</p><p>With the sanctifying of our immediate area out of the way I proceeded to take the first hit. I instantly felt a prickeling through my skin that felt like a million needles touching my skin, but not penetrating, it felt bizarre to say the least. I took one more hit after that was all it took to send me to another vibration.</p><p>I closed my eyes after the second hit and focused on the candle light. I then had a complex vision of red bulls running in a woven pattern too complex to tell correctly. After this vision I saw an enormous brick wall in front of me. It stretched as far as I could see in every direction. I opened my eyes for a second and the wall was still there, but I was no longer looking at it from inside my body. I was floating above my body looking down at myself and the wall from and angle. All of sudden the vision of the wall disappeared and I looked at my friend J, who now appeared to have changed into a Native American shaman. It was still him, but I saw a he had appeared to have joined with or have been taken over by the spirit of an indian tribal elder with full feathered headdress and all. His eyes which were previously closed opened up and stared into my own eyes. As I sat there indian style looking into my friends transformed eyes a force pushed me from the right hand side and layed me out on the floor, so I was now laying on my left side.</p><p>Before I could try and say anything to Jesse about what had just happened to me, he yelled out... 'DID YOU SEE THAT!' I told him I didn't see anything, but I felt something push me over. He said he 'saw' a force actually push me over onto my side and then quickly exit the door of the fort. When the spirit left me and J were instantly back to our normal selves again. Except for the fact that our Ego's were reduced to nothing. It is something that can not be explained, it can only be experienced.</p><p>We knew we were onto something important in our spiritual journey. We knew in time we had to again quest for the Green Lady.</p>",
 "year": "2000",
 "id": "11602",
 "gender": "Male",
 "timestamp": "2004-10-22T07:00:00.000Z",
 "views": "4632",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 ]
}
