{
 "title": "Vomit Marathon",
 "author": "Kommanda",
 "citation": " Kommanda. \"Vomit Marathon: experience with Heroin (ID 11600)\". Erowid.org. Apr 26, 2006. erowid.org/exp/11600",
 "substance": "Heroin",
 "bodyweight": "63 kg",
 "report": "<p>I decided to try some heroin, to feel its peek and then never to use it again. I gave it a lot of thought and, as I know a lot of people who experimented with it and never got into problems, came to the conclusion that I'm safe. Besides, I consider myself too old (26) to get addicted.</p><p>I was with two friends, D who was also a first-timer and S who is, as he admits it, psychically addicted. We went into a large park because someone proposed that it would be nice to take it in nature. We entered some bushes and divided the quantity which was less than a teaspoon into three parts. S said that what each of us was about to take is the least amount buyable, but that it would be all right for D and me to snort, cause we were new. He injected his stuff.</p><p>It made him instantly relaxed and talkative and D and me waited for our reaction. After 15 minutes I started to feel anxious as we were near an excursion. I didn't know what to expect and I insisted to move away from people. After 15 minutes more, we were sitting on a bench. I felt warmth and had a vague pleasant feeling, S couldn't stop talking and D claimed he doesn't feel anything.</p><p>I was disappointed that this is all I'm going to get. After half an hour the pleasantness faded and I started feeling sick. S told me that this is normal. Soon I felt worse and puked. From then on, I puked every 20 minutes. Since I vomited all the food I ate that day, I lost energy, felt sick, tired and cold. The evening was getting near, it was getting colder but I couldn't move to warm up. I was feeling as lousy as it gets. My friends decided to take me home I was carrying a plastic bag with me cause there was no telling when I'm gonna puke again. I put on sunglasses and a hat and hoped we won't run into anyone familiar in public transport.</p><p>Back home, I told mother I have a food poisoning, took a shower and went to sleep. I woke up warm, rested and refreshed and she made me some great soup. Eleven hours passed since I took the heroin. And then I puked again all that nice soup. And again.</p><p>I panicked, it was full 12 hours since I snorted that minuscule amount and I was still sick. I called on the phone everybody I knew who had experience with heroin and asked them is it possible that I'm addicted or my liver is damaged or something, but they assured me that this was known to happen, that it's just bad luck. Tomorrow I was finally all right.</p><p>From what I've learned since, most users feel sick at the beginning. It takes time to get familiar with heroin and fully appreciate its effects, but I don't intend to try it any more.</p>",
 "year": "2001",
 "id": "11600",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-26T07:00:00.000Z",
 "views": "27625",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Heroin",
   "form": "(powder / crystals)"
  }
 }
}
