{
 "title": "Blessing",
 "author": "Bricoleur",
 "citation": " Bricoleur. \"Blessing: experience with TMA-2 (ID 11616)\". Erowid.org. Aug 12, 2002. erowid.org/exp/11616",
 "substance": "TMA-2",
 "bodyweight": "55 kg",
 "header": [
  "DOSE:",
  "23.3 mg",
  "oral",
  "TMA-2"
 ],
 "report": "<p>The purpose of the session was purely to experiment with the substance TMA-2, merely observe. Time of experiment  noon.</p><p>T+ :00 The 22.3 mgs of TMA-2 HCL was stirred into a banana/peach smoothie and drunk. I had eaten some bran cornflakes and had a cup of coffee 3 hours prior to ingesting the TMA-2. I also took some Papaya Enzyme with the TMA-2 to combat the possible nausea and/or diarrhea (neither of which manifested).</p><p>T+ :22 Notice the first very slight body tremor. Get that familiar sensation of my consciousness beginning to creep outwards.</p><p>Body temperature drops.</p><p>T+ :30 Urinate.</p><p>T+ :50 I am now very relaxed and yawning. The effects (described at T+ :22) are more pronounced  but still weak. This is now similar in nature to a low oral dose (5-10mg) of 2C-B or 10mg 2C-T-7. Colours slightly more vibrant.</p><p>T+ :55 Body vibrations on the increase  the release and containment of energy.</p><p>T+ 1:12 Limbs become stretchy with very slight boundary distortion. Some slight distortions in peripheral vision.</p><p>T+ 1:30 Warm rushes  not too pronounced. Beginning to be somewhat restless.</p><p>T+ 2:00 Time for a walk. My tripping partner and I leave our flat and walk to the river Thames. It is bitterly cold but very stimulating, as the walking appears to be brining the TMA-2 out a bit.</p><p>We both feel that walking is satisfying even though our bodies were confusingly fatigued.</p><p>T+ 3:00 Return to flat and decide to watch Baraka. I notice how effortlessly I am able to slip into flow states  more effortlessly than usual. This reminds me of LSD and so does the remainder of the trip.</p><p>T+ 5:00 I am feeling very relaxed and most of the effects have diminished at this stage. Although I still find it easy to reach flow states as before.</p><p>T+ 5:30 I decide to leave my friends flat and begin the 1.5-hour train ride to the other side of London.</p><p>For another 2 hours I ponder my illusory self - I can only ever reflect on what it was, never on what it is. At that point of reflection I am not the perceiver  I am just the difference. Am I the fleeting opportunity for perception to exist in the experience of matter?</p><p>I obsess over the idea that evolution is paradoxically driven by entropy. Duped by consciousness. Ha Ha.</p><p>Bricoleur.</p><p>'How is it possible to understand life when the entire world is ordered by a law such as the second principle of thermodynamics, which points to death and annihilation?'</p><p>Leon Brillouin</p>",
 "year": "2002",
 "id": "11616",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-12T07:00:00.000Z",
 "views": "12783",
 "dose": {}
}
