{
 "title": "Spiritual New Years",
 "author": "Wonderland",
 "citation": " Wonderland. \"Spiritual New Years: experience with H. B. Woodrose (ID 11621)\". Erowid.org. Aug 28, 2002. erowid.org/exp/11621",
 "substance": "H. B. Woodrose",
 "bodyweight": "175 lb",
 "header": [
  "DOSE:",
  "7 seeds",
  "oral",
  "H.B. Woodrose",
  "(ground / crushed)"
 ],
 "report": "<p>What a new years this started of to be?  I had tickets to this huge rave with some awesome DJ's.  I was looking forward to this event for a long time.  I had ordered some Hawaiin Baby Woodrose seeds from this website about a week before this event.  The night before the event I soaked 7 seeds in water overnight.  I then scraped off the outer coating on all 7 seeds with a knife.  At about 5pm I grounded the 7 seeds in a pepper grinder I bought for about $8 at a local market.  I then chewed the seeds right after grinding them.  The taste wasn't as bad as I heard it was going to be.  It kinda tasted like eating dirt.  I had eaten 3 hours before this and new that I might get some nausea for this, so I took a 50mg dramamine tablet right before I chewed up the seeds.</p><p>Within in an hour I was feeling great.  I felt no nausea so far.  I desided to call a cab to take me to the event.  The cab ride was a real trip.  I was starting to get some visuals at this point.  It was great.  I was also feeling some of the effects that you would get from ecstasy.  20 minutes later I got dropped off right near the event.  This was the worst vibe I have ever seen at an event in my entire life.  I arrived around 7pm, and I couldn't believe all the cops around.  Another bummer was they actually had police dogs at the front sniffing for drugs on people.  I saw a lot of people getting arrested.  I started to walk towards the enterance, and the first set of security informed everyone that there was no lights, no cameras, to lighters, no glowsticks, and pretty much no anything.  This really sucked.  I had my $500 digital camera, glowsticks, and my $70 rainbow lights with me.  I had no car to stash these items in.  So I just decided to get another cab and go back home.  I was a little disappointed because I had emailed the event and asked if these items would be ok to bring in.  They said it wouldn't be a problem.  I don't really blame it on the event promoters though, this was a police issue in a bad area.</p><p>When I got home I was fully tripping.  I turned off all my lights and turned on my portable laser light show that displays off of my wall.  As soon as I layed down I went into another dimention.  It's like I was seeing different levels in the air that is all around us.  At around 11pm I started to feel the nausea.  I new this would happen though.  In doing these seeds fasting the whole day is a MUST.  I know if I didn't eat at 3pm I would have not felt the sickness.  I felt as though I was going to throw up, but nothing came out of my stomach.  I was happy with this.  I really didn't want to throw up.  I probably felt this sickness feeling for about 20 minutes.  Then I started have a lot of gas from my stomach.  I got back in bed and then kept burping for quite a long time.  I then continued my jouney into the unknown until about 2am.  At this point I started to feel a little sleepy, so I started to go to bed.  Closing my eyes, I saw a lot of the color red.  I fell asleep pretty quickly.</p><p>This was one of the best experiences of my life.  This was complet happiness and very every spiritual.  So,next time I know not to eat anything that day and not to go to another rave in this area again.</p>",
 "year": "2002",
 "id": "11621",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-08-28T07:00:00.000Z",
 "views": "9869",
 "dose": {}
}
