{
 "id": 11630,
 "title": "Words Can't Explain",
 "date": {
  "submission": "2003-02-19T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Chris",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "oz",
    "quantity": "0.125"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "Explaining my first trip on mushrooms is something that is very hard to do, words really can't explain the full experience, but i'll try my best.",
  "It was friday night and me and a friend who i'll just call A had been trying to get ahold of some shrooms for about a week (shrooms are pretty hard to get until summer in this area).",
  "After reading every experience we had been very curious and knew somewhat how to prevent the notorious 'bad trip'. Researching this drug before trying it has been the smartest thing i've ever done, I believe this saved my ass from ALOT of trouble and helped me throughout my trip.",
  "Well....me and A went to a friend's house in search of alcohol since we didn't find any shrooms in school.",
  "My friend's older sister, who is a senior in my high school had a few of her friends over that I had used to play football with.  I soon found out that 2 of them were trippin on shrooms. I went up to one of them asked how much he had and if he'd sell them, it turned out that he had 1/8 left, and his friend also had 1/8 that he would sell for $32. I thought about it for a minute, talked to A and we put down $64 altogether for the shrooms.",
  "We had planned to eat them early the next day, at my house because my mother and sister wouldn't be around until late that day (so i thought).",
  "So saturday comes around...we make sure the setting is calm and there is nothing that might bring on a bad trip (something I learned from the experiance vault). We ordered pizza around 12:00pm and broke the mushrooms up and put them on the pizza for an extra topping. The pizza killed the horrible taste of the mushrooms (being curious we both ate a piece of mushroom before putting it on pizza...pretty nasty). We ate the shroom topped pizza and waited patiently for our journey.",
  "It was about 30 minutes later and nothing noticable had happened which was dissapointing, so we decided to take a walk down the road to the store. We got outside and both of us looked at each other and smiled because EVERYTHING was so much more peaceful, and wonderful.",
  "I remember walking down the road and my friend A had found a pen in the road...he threw it and we were totally amazed by this pen. The pen seemed to go for miles, and be in the air for hours until it hit the ground. After about 30 minutes being HIGHLY entertained by the pen we continued down the road to the store. In the store A just seemed to dissapear and nothing really out of the ordinary happened besides that until I went to pay. It seemed as if my eye was no more than an inch in front of the cashier, and I couldn't tell when she was speaking to me.",
  "This is when slight paranoia kicked in and I decided that me and A (who had reappeared next to me and I didn't think anything of it) should go back to my house.",
  "We decided to go back by walking along a lake I have nearby. The walk seemed to take hours, but I didn't mind because the water and the sky was so beautiful, I remember turning my head upside-down to make the water become the sky.",
  "We arrived back at my house, at this point I felt as if I didn't know A, I later found out he was feeling the same, we didn't say a word to each other for most of the trip home.",
  "We arrived at my house and tried talking to each other, but his words seemed all mixed up, and very hard to hear... but it was like our minds were connected, and everything he said I understood completly and felt like I knew what he said before he said it.",
  "Out of nowhere I heard police sirens and started freaking out telling him we needed to get into the house and that someone had called the cops on us, this is when I really started getting paranoid, the sirens were VERY close and I swear I saw a police cruiser drive by.",
  "We came into my room and I had checked the time on my computer, 3:30pm, it seemed like we had been gone for days as I tried to explain this to A my words didn't seem to quite come out right (I kept reassuring myself that there were no cops, and it was just the shrooms).",
  "A had laid down on my bed and turned on some music, which was a whole new experiance. The music was like the band was playing right in my room (the song was The Cure - Fascination Strek), and seemed to make many colorful visualizations appear.",
  "I attempted playing a computer game which was very funny because the game seemed to put me inside the car (it was some racing game) and I could see the surrounding things right near me.",
  "I went over to A, who was still on my bed fascinated by my mirrors and what he could do with his face in it. We looked at each others eyes and they were COMPLETELY dilated (if thats even possible). It was really weird looking and sorta scared me. I also remember just randomly laughing out of nowhere.",
  "By this point, everything had been fun, except for the mild paranoia about the cops.  I laid down on my chair and fell into a deep start of well-being and relaxation while music was playing.  Time seemed to fly by all of a sudden, as i remember looking at my computer clock and it saying 5 somthing. I couldn't believe that much time had went by just listening to music, the things I saw, the feeling I had, I can't find the words to explain.",
  "About 30 minutes later is when I could feel the trip coming down, I was still very very happy and seeing many interesting things. This is when my mom had come home (very early). I heard her come in but I wasn't scared, I kept saying to myself, stay in the room and don't look at her.",
  "I started to get scared when I thought I heard her talking to me, and I really didn't know if she was or not. A had decided to go home, saying his trip was over (he had puked earlier, we think that's why his trip wasn't as extreme as mine, and didn't last as long).",
  "So I was sitting on my computer alone waiting for my mom to come to my room and talk to me, I decided to lay down, so I could say I felt sick if she had said anything about me acting strange. I remember my mom coming in, and me saying something like 'shit feel I like want sleep to I have become sick' and her just walking out. I still don't know what I said, but she had never mentioned anything about it.",
  "As long as this is, it still comes nothing near explaining the full experiance. I think researching the drug helped me control myself when I started feeling paranoid.",
  "Most of what I mentioned was what I remember, there were periods of time that I remember closing my eyes and being carried through space feeling completly out of my body.",
  "To anyone thinking about trying shrooms, I would recommend it, I really think it opened my mind and was a very memorable experiance. I made sure that I trusted the seller and that I had a whole day (and place) to safely trip.",
  "Going out in public wasn't smart on my part, I really didn't think before."
 ],
 "erowid": {
  "id": "7247",
  "citation": " Chris. \"Words Can't Explain: experience with Mushrooms - P. cubensis (ID 7247)\". Erowid.org. Feb 19, 2003. erowid.org/exp/7247",
  "substance": "Mushrooms - P. cubensis",
  "views": "6984"
 }
}
