{
 "id": 11645,
 "title": "Large Pink Pill",
 "date": {
  "submission": "2009-06-19T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Marcus",
  "gender": "Male",
  "weight": 111
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Oxymorphone",
   "form": "ground/crushed"
  },
  {
   "time": "2:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I have taken many opiates in my day, and believe I have some what of a high tolerance. It takes about 20mg of oxycodone snorted for me to catch a decent buzz. Most of my opiate experience has been with oxycodone i.e. oxycontin or roxycontin.",
  "My normal supplier of opiates had just gotten a somewhat large pink pill that she told me was Opana and that I had to try it. I purchased two 10mg pills at twenty dollars a piece. Very expensive, I thought. I crushed one up and snorted the whole thing at once. I immediately experienced the opiate rush you usually only get from I.V. use. Which lasted about 15 minutes. Then the actual high came on. It was very, very, euphoric. I would say right up there with heroin. Maybe even more euphoric. It was definitely a morphine style buzz rather than a codeine style buzz. As in there was less stomach discomfort, less dizziness, basically less of all the undesirable affects that one normally experiences with opiates. The only disadvantage with morphine over codeine is that morphine doesn't last as long. That is not the case with oxymorphone, I was high for close to 4 1/2 hours. Then went to sleep and slept great, as normally with opiates. I did get some nausea about 2 hours into the high. I smoked some pot and felt a lot better.",
  "With all the praise I give oxymorphone there comes a warning. It is not for beginners. I gave some to friends that were not regular users, and they all told me it was way to strong for them. It is by far the most powerful pharmaceutical opiate I've ever done. If you are new to opiates I believe that the overdose potential is quite high. Also it is the most addictive opiate I've ever done. I have been addicted to oxycodone before, but the mental addiction is much stronger with oxymorphone. I would say that the physical addiction is probably about the same. Kids, there is nothing worse than being physically addicted to a drug. I've been there and have no desire to go back. That being said if I had the chance to do oxymorphone again I would. It's great for the rare occasion."
 ],
 "erowid": {
  "id": "72569",
  "citation": " Marcus. \"Large Pink Pill: experience with Oxymorphone (Opana) & Cannabis (ID 72569)\". Erowid.org. Jun 19, 2009. erowid.org/exp/72569",
  "substance": "Oxymorphone (Opana) & Cannabis",
  "views": "25557"
 }
}
