{
 "id": 11648,
 "title": "Blended with Spiritual Practice",
 "date": {
  "submission": "2008-09-18T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Julian",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-DiPT"
  }
 ],
 "report": [
  "A slower entry than anticipated (first effects after some 40 minutes on a fairly empty stomach). Did 20 minutes Ashtanga yoga followed by mantra, very gradual ascent until Im actually in the space. Minor body load, some abdominal full/emptyness but no nausea. Did lots of dancing using Roths The Wave  very nice can see how this material would work in clubland. Sense of the body enhanced, yes certainly an erotogenic!",
  "Outside some 2 hours in, perhaps a peak? Sitting in the hidden 'group ups' terrace of my garden, there is a light rain and the last light of the sun is still around. I can see all the little Deva spirits in the trees, and greet them. They smile back, elfish but in no way scary. Enjoying the rain, though Im sheltered beneath a small umbrella. After a while I decide that I should be at one with the rain, take down my brolly and it stops. There is a revelation (?!) here;",
  "The rain is a blessing, though on our damp little islands it's easy to forget. But the rain is a blessing.",
  "Sure its nice to have an umbrella, but if you take it down, you some times find the shower has already passed.",
  "Deep!",
  "Did some Horns of Baphomet yoga, very nice. This material feels like the sister to the Toad venom (5-Meo-DMT), slower but the same deep, earthy content. Very minor visual changes with either open or closed eyes. It's my body that is tripping more than my mind.",
  "Back in the house, send a few emails to friends, did some VIII magick (autoerotic tantra), very strong climax. Not much of the speedyness of acid, which is nice, and after a few more waves at t+4  hours after drop time Im coming down, but this is a very gentle descend. Nice.",
  "Overall highly recommended. Would blend well with bodywork, sex, massage etc. I can see this being a material to explore in a range of sensual conditions. The nice side of Pan."
 ],
 "erowid": {
  "id": "72589",
  "citation": " Julian. \"Blended with Spiritual Practice: experience with 5-Meo-DiPT (ID 72589)\". Erowid.org. Sep 18, 2008. erowid.org/exp/72589",
  "substance": "5-Meo-DiPT",
  "views": "2989"
 }
}
