{
 "id": 11652,
 "title": "Stimedelic Smoking Mixture",
 "date": {
  "submission": "2011-04-14T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "TryptamineALD52",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "8 seeds",
   "administration": "smoked",
   "substance": "Anadenanthera colubrina",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "1 g",
   "administration": "smoked",
   "substance": "Syrian Rue",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>I was up late at night having not slept for no explainable reason, mostly I was caught up searching the web for enthnobotanical sources, and decided to try something that just sort of popped into my head.",
  "I had been carrying around a bag of Syrian Rue seeds (Peganum harmala) along with a bag of Cebil seeds (Anadenanthera colubrina) for quite some time and had tried a number of uses for them on different occasions including:",
  "1) Smoking Syrian Rue alone (produces 'peaceful' feeling along with stimulating effects) --- ****I have done this repeatedly with no adverse effects when mixing this MAOI ingestion method with tyramines or stimulants, the original logic for this came from hearing of a new pharmaceutical MAOI patch, which would allow for the removal of diet restrictions as the MAOI never enters the digestive tract, and thus, cannot inhibit dietary MAO activity****",
  "2) Smoking Cebil alone (produces stimulating effects, dizziness, sensation of pressure in the chest and sinuses and 'tingling' in the face) --- Note: with this method I have constantly felt as though I was approaching a threshold for psychedelic effects, but, unfortunately have never crossed this perceived line, as the unpleasant pressure and 'tingling' deter me smoking more.",
  "3) 'Cebilhuasca' tea (was a HORRIBLE failure, the concoction tasted vile and produced a gag reaction along with very quick onset nausea when any was actually kept down).",
  "4) Cebil snuff (this was created by grinding shelled seeds with TUMS, the active ingredient of which is Calcium Carbonate, and resulted in nothing more then a burning sensation in the nose and a horrible tasting post-nasal drip, although, I am aware, that the traditional use involves an extremely large amount of the substance)",
  "-----------------------------------------------------------------",
  "So, I finally decided tonight after these repeated failures to achieve any true psychedelic effect that I would go ahead and try this idea that popped into my head, mixing the Syrian Rue and the Cebil into a smoking blend. As per my previous experience smoking both alone, these are fairly unpleasant tasting smokes, so I decided that I would go ahead and mix in the tobacco contents of a single cigarette for flavor.",
  "I put about a gram of Syrian rue, 8 or so Cebil seeds and the gutted contents of a cigarette in my magic bullet with the grinding blade and ground them all together, the result looked and smelt mostly like Syrian Rue but with an overwhelming light brown color, rather then the black and dark brown colors of Syrian rue seeds and their interior.",
  "I placed this smoking blend into a metal pipe and went outside and smoked about ten 'hits' or 'puffs'. The smoke was harsh and hard to inhale so I french-inhaled most of it. The results began with the typical stimulating effects of Cebil and Rue that I had experienced before and the tobacco did little for the taste, as I continued smoking the mixture I could notice effects from smoking both Rue and Cebil alone but as I continue had more profound effects then ever before... I did not break the threshold that I spoke of entirely, but did however attain a slight psychedelic mental effect and static visuals (what would be best described as random dead pixels in my vision, bluish-white spots that did not move on their own and for the most part simply accomplished blurring my sight). This experience was a success, I wish, however that these substances tasted better when smoking, I will likely experiment more with combining the two in a smoke blend and post any significant progress here.</p>"
 ],
 "erowid": {
  "id": "72605",
  "citation": " TryptamineALD52. \"Stimedelic Smoking Mixture: experience with Anadenanthera colubrina, Syrian Rue (P. harmala) & Tobacco (ID 72605)\". Erowid.org. Apr 14, 2011. erowid.org/exp/72605",
  "substance": "Anadenanthera colubrina, Syrian Rue (P. harmala) & Tobacco",
  "views": "6739"
 }
}
