{
 "title": "A Wonderful Ally",
 "author": "Leprechaun",
 "citation": " Leprechaun. \"A Wonderful Ally: experience with 4-Acetoxy-DET (ID 11661)\". Erowid.org. Feb 11, 2002. erowid.org/exp/11661",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "68 kg",
 "report": "<p>I have taken 4-AcO-DET twice now. Both times were quite a contrasting experience. The first time I decided to ingest a 7.5 mg dose to get a feeling for the substance, the second time I decided to jump up to 15 mg.</p><p>The feeling experience is one a exuberance and grandeur. I find to be almost sexual in nature.</p><p>The day was beautiful, it was spring and my emotions were high. It had been a week since the world trade center collapse. I was torn between my saddness to those who lost their lives and the anger towards the American idealogy that I felt deserved to be bruised. Even now, after the new year this feeling permeates me, I have found it hard to make sense of the conflicting emotions.</p><p>I meditated early in the morning and felt quite centered and comfortable. At this low dose I decided I would be comfortable riding my bike down a nearby trail. The trail has many emotional attachments associated with it. I have ridden down the trail many times and have ridden down it a few times in altered state of conciousness.</p><p>I ingested my 7.5 mg capsule at approximately 10:30 and rode my bike on a semi full stomach. The scenery was gorgeous, as yet untainted through altered perception.</p><p>I reached a lovely secluded spot. The sky was blue and I sat beside my bike beneath the shade of a willow tree. Before me there was a creek. I walked towards it and admired the simplicity of the scene. Calm and peace seered into my soul, and I just lay there for approximately an hour. After that I felt very little effect and decied it was time to ride home, it was a dud, but the day was still wonderful.</p><p>However upon returning home I found the effects only to appear as I entered my room. I jumped on to my studio and began fiddling with my sound equipment. A pure raw sexual energy was pulsating within my heart and my groin. I felt so empowered, so sexually healthy and alive. I played my music and felt pleasure melt over me. I stopped with the equipment and put on an old CD I always liked listening to in this mood. I sat down and closed my eyes. I had never seen such wonderful visuals in my life before. I looked out into the vast expanse of my visual conciousness. Before me appeared perfect geometric object reminding me of aztec architecture. I sat there for some time simple enjoying the experience. There was little insightful content, it was more of a time to relax and be free. I felt comfortable being alone, as I usually do. I had no urge to call others, I felt at peace.</p><p>The effects decreased and I found myself in a warm fuzzy place. I rode my bike to a good friends home and we talked and watched TV. I felt comfortable for a while aftewards.</p><p>The second dose was 15 mg. I felt the experience was self satisfying and inappropriate, needless to say this set and setting turned the experience into nothing special, leaving me with a headache and a jaded look at other who where consuming other substances in large quantities. I did however have an extremely clear capability to converse and had an interesting experience as my sense of self melted into the soup of a capsule ready to enter hyperspace, however the capsule never took off, and the soup turned into a spoon. I opened my eyes and world returned. Like last time I felt extremely at ease for a while, however this experience tapered off with a subtle sense of fear and anxiety. I also wonder deeply if this substance has an neuro-toxic properties.</p><p>4-AcO-DET is a wonderful ally. Unfortunatly it needs to be stored in a freezer with little contact with air, otherwise it oxidises into a black powder, which I am afraid would most probably be quite inactive.</p>",
 "year": "2001",
 "id": "11661",
 "gender": "Male",
 "timestamp": "2002-02-11T08:00:00.000Z",
 "views": "13420",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DET",
   "form": "(powder / crystals)"
  }
 }
}
