{
 "id": 11666,
 "title": "A Fantasic Poolside Trip",
 "date": {
  "submission": "2003-02-19T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Blue Psychonaut",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "After doing extensive research on Salvia online, I decided it was time to try it.  My friends were interested in trying it too, so I ordered 10 grams from [a reputable and popular online vendor].",
  "I woke up at around 11 with my friend, who was with me when I got trippy high on Cannabis the night before.  He called up some of his other friends and they picked us up, asking me to get the Salvia.  I had about 4 grams left, because I sampled it the previous days with others.  Little did I know that this day, we would have the best experience with it.",
  "So we got to this kids house, and I suggested that we light up a bowl with this stuff first, to show them it actually works.  We went under his deck on comfortable lounge chairs in the shade.  We were surrounded by a pool, a house under contruction behind the pool, out of which was playing Mexican music, and tropical plants.",
  "I packed the first bowl, taking the honors of being the first one to hit it.  I took a large hit, holding it in for around twenty seconds, which was until I felt my upper chest pumping.  About 45 seconds after I exhaled, I began to feel its effects.",
  "I started to feel like my life was being pinned down, pinned down at each of its four corners by a large truck.  I couldn't move, and would giggle watching the other guys try to hold smoke in.  They kept asking me if I was feeling it, and I told them over and over 'a little bit'.  They seemed to only feel it a little, while I was having this strange sharp feeling bouncing through the back of my mouth.  I couldn't move my head.",
  "The bowl was passed to me again, and I took a second hit, which was almost as heavy as the first one.  This is where I started to feel like the burnt leaves in my bowl, who were motionless and probably tasted the same way my mouth did.",
  "I had this strange disassociating feeling, sort of like a phase out, and I became impulsiveless.  I felt like I had no control over myself, and I wasn't 'considering my earth'.  I did know what was going on with the other guys, though.  They said it sucked, and it was a waste of time, and this one guy said that all he could feel was his codeine, no salvia.  I think it was because they didn't hold it in, and I explained it was because we weren't using a bong.  I wanted to make it clear to them that they were missing out on a trippy experience, but I couldn't for some reason.  So they just went ahead and told my friend to get out his nugs of his fire hair dank, the name dubbed to the best Cannabis in the Atlanta area.  He packed the glass bowl with it, and fired it up.  It went through two people before it came to me.",
  "When I hit it, I felt as though Salvia was the salt, and Cannabis was its sugar, put here to sweeten up the bitter Salvia experience.  I took two huge hits of that, and let the effects kick in within minutes.",
  "I was hearing any sound that I would distort with my own brain.  The Mexican music was enunciated, and was put into a techno beat with the clanging sound of the workers' hammers.  I was hearing cars pulling into the driveway, while I knew that really weren't, and that mixed with the Mexican construction techno beat I created.  Everything became beautiful, like I was a Native American, and I loved my environment, the Tropical plants, the deck's wooden steps, and especially, the sky.",
  "While K and D were getting a bong from upstairs, I hung out with B.  I went into his kitchen with him, and I was tripping incredibly.  I was feeling amazing; it was a bouncy feeling over a flipping one.  Even though I felt really tired, I was seeing the weirdest patterns, like blue and green integrated beans.  I kept making fun of words ending in '-ard' and '-art.'",
  "Now it started to get weird.",
  "I was hungry, so I got some vanilla filled cookies from B's pantry.  Eating those was so amazing.  I ate them slowly, and could feel their texture and taste.  Washing them down with milk, I felt as though I was splashing white-capped water on a rocky island.",
  "I put some cookie crisp cereal in an eating bowl, filled it with milk started to eat it with a spoon.  I thought that the little cookies were huge rocks in a lake, and I was a large robot scooping them out and crushing them in a machine: my mouth.  I then felt like I had a fishing pole, and I was reeling in B.  I was in a dream world.",
  "When K and D got the bong, they filled it with grape juice (weird concept).  We went under the deck again with it. My Salvia tripping was sort of coming down.",
  "Over the course of ten minutes, we each smoked some Cannabis, then some Salvia, then Cannabis again.  I took three heavy hits of Salvia, and probably four weed hits, each hit was at least ten seconds long.  It was all out of one of those bongs that you build smoke up into its neck, then you pull out the bowl so the all the smoke gets into your lungs.",
  "They said they started to like the salvia, and that they just might keep it.  K said that I needed to jump in the pool to get back to normal since his mom was picking us up.  So I did; he pushed me in the pool.",
  "The pool felt so funny.  I felt like the water pushing me around was masses of jelly-like beans, going over and under one another constanly, and drew complete scenarios of this in my head.  When I went under water with my eyes closed, I felt like I was the silhouette of a small girl in rags swimming under the sun, with an outline of orange and yellow. My world was crazy when I was in the pool.",
  "I enjoy mixing marijuana and salvia.  Next time I might want to mix these with something a little more harder, like a little bit of LSA, AMT and/or DXM."
 ],
 "erowid": {
  "id": "7268",
  "citation": " The Blue Psychonaut. \"A Fantasic Poolside Trip: experience with Salvia divinorum & Cannabis (ID 7268)\". Erowid.org. Feb 19, 2003. erowid.org/exp/7268",
  "substance": "Salvia divinorum & Cannabis",
  "views": "19472"
 }
}
