{
 "id": 11678,
 "title": "A Haunting Experience",
 "date": {
  "submission": "2010-05-04T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ventilage",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "capsule"
  },
  {
   "time": "0:05",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "Syrian Rue",
   "form": "capsule"
  },
  {
   "time": "0:15",
   "amount": {
    "unit": "g",
    "grams": "40",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "Psychotria viridis",
   "form": "tea"
  },
  {
   "time": "0:15",
   "amount": {
    "unit": "g",
    "grams": "50",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "tea"
  },
  {
   "time": "0:15",
   "amount": {
    "unit": "g",
    "grams": "10",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Mimosa tenuiflora",
   "form": "tea"
  }
 ],
 "report": [
  "My recent experience with ayahuasca was very complex and turbulent. It was my first time taking the plant brew, and I had done a lot of research on the effects of the plants and how to prepare them. My main reason for ordering the plants was to help my father overcome his addiction to alcohol and free himself from the negative cycles he has been living in. But I cannot say it was all for my father, I too wanted to experience a visionary state of consciousness.",
  "I ordered Psychotria viridis foliage, Banisteriopsis Caapi whole vine, Mimosa hostilis root bark, and Syrian Rue seeds from an online source. I prepared myself for the sacrament by abstaining from foods that could negatively react with the MAOIs two days before hand. I followed a recipe that I thought would give me good results. I used 50 grams of Cappi vine, 40 grams of P. viridis, 10 grams of Mimosa, and 3 grams of Syrian Rue. I mixed those in about 3 liters of water and a tablespoon and a half of white vinegar, and let the water evaporate over a span of 2 hours, then filtered that mix into a new pot, and let that pot sit for another 2 hours or so so the water amount reached about 2/3 cups. This process would be repeated 2 more times with the same filtered material so that I had a total of 2 cups of Ayahuasca (basically the analogy is that I was making 3 cups of tea with one teabag and boiling down each one of those cups to 2/3 and mixing them together to end up with 2 cups of Aya). I planned on only drinking one cup of the mix, and I made the 2nd cup just in case I threw up the first too quickly.",
  "It was finally time to drink the brew. I went outside to my backyard, which was filled with beautiful herbs, flowers and trees and laid out a blanket to sit on. I had crushed the Syrian Rue seeds and put them into capsules, and to start it off I took 3 pills (there were 6 Rue capsules in all), and about 5 minutes later I took the last 3 pills. I drank the brew slowly, over about a period of 30 minutes.",
  "After about an hour after taking the brew the experience was kicked into high gear. The brown fence that surrounded my backyard came alive with tribal faces and designs. Visually, things were entrancing. I had numerous closed eye visuals that seemed to be triggered by what I thought was aligning my chakras. Kaleidoscopic Buddhas entered my inner world and floated all around. I got up to dance and while I was dancing, a voice came inside my head and told me that life was just a endless dance. I was reenacting the birth and death of the universe. I became Kali, and my voice roared with anger, but then the inner voice came back and reminded me of the dance. My body also seemed to be changing, my skin seemed to be getting lighter and more old and feminine, but then quickly flashed back to its original form.",
  "My mother came outside to see how I was doing, and now I could see how much the Ayahuasca was affecting my vision. My mothers face seemed to be made up of many pastel colors that glided to and fro. We talked about how I was feeling and how I could help humanity. But at the time, I just felt that humanity was stuck in its endless dramas, and I was in a place beyond drama, where I understood that everything was just a dance no more no less. She left me a short time after, and I felt guilty about not taking the right action or really integrating what my mother had said. So I came inside and talked to her about her country, Colombia and then decided to dance with my mom. We put on some Carlos Vives and had a fun time laughing and dancing. But then I started getting woozy and it was hard for me to understand her and the music seemed to become metallic and foreboding. At this point I cant remember anything else, I blacked out.",
  "But the next morning when I woke up, my mother and father told me of the nightmare that I had wrought on myself and on them.",
  "Supposedly I started screaming Rape! and Homosexuality! at the top of my voice. I tried to hurt myself by jumping over the fence of my backyard. They told me I had taken off my pants and underwear and started clutching my testicles. I got very aggressive and as my dad tried to hold me down, I bit his nipple and hurt him very badly. They said I had a deranged look in my eyes, and that I did not stop screaming Rape! and Homosexuality! for about 3 hours straight. I do not remember any of this. I hurt myself by scratching my face, arms, and falling numerous times.",
  "The next morning when they told me of this, I looked at my body, and all over are bruises and cuts from where I hurt myself. Without my dad, I dont know if my mom couldve controlled me.",
  "In conclusion, I feel I made my brew too powerful, and that I will stay away from Ayahuasca for a long time. I dont think Ill ever make the brew on my own again. I felt horrible for what I did to my parents and what made matters worse was that the next day I had a horrible headache. I will have to find some other way to free my dad from his addictions. Be careful with Ayahuasca, its not a toy."
 ],
 "erowid": {
  "id": "72758",
  "citation": " Ventilage. \"A Haunting Experience: experience with Ayahuasca (ID 72758)\". Erowid.org. May 4, 2010. erowid.org/exp/72758",
  "substance": "Ayahuasca",
  "views": "26307"
 }
}
