{
 "id": 11672,
 "title": "LSD and Raving",
 "date": {
  "submission": "2001-06-06T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "aphid",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "oral",
   "substance": "LSD"
  }
 ],
 "report": [
  "I decided to go to a rave this last weekend in New Haven, CT, in probably the largest venue I had seen a techno party anywhere, at the New Haven Colliseum.  I had been in the techno scene a few years back but kinda got jaded from the commercialism and the lack of PLUR and bad vibes that had begun to develop in the US techno scene these last few years.  however, I had never done acid at a techno party and had decided that I would give it a try, as I had grown into different interest, particularly tribal and goa trance. ",
  "So I went to the rave rather late and dropped 4 hits of very clean acid, found a good spot on the huge dance floor, and began dancing along to the various trances and breakbeats. ",
  "I started seeing the typical illumination effects on clarity that I had long been accustomed to, as the colors became clearer and the sounds played with my aural senses, tickling them in delightful but familiar ways.  In many ways, it felt like rolling on ecstasy, with the heightened awareness and the beauty of the scene.",
  "but, about an ahour and a half into the event, I noticed a very harsh, very beautiful change in gears.  In many ways, it was overwhelming, and at times, quite frightful, particularly during the darker trance tunes.  I was intoxicated by the beauty of the acid moment, without the sugar-coated overtones of ecstasy's more appealing but less powerful vibe.  At times, the room became a huge serpent, with tribal dancers riding this huge snake in cathartic rhythms of primal angst and beauty; at other times, the room soared to heights of beauty that I cannot begin to describe, reaching spiritual if not religious heights of ecstasy and harmony, as dancers probed their deepest machinery to forge a cacophony of symbiotic magic, each feeding off each other's pure energy and giving of themselves to this higher consciousness that the whole room had achieved. ",
  "I cannot begin to describe the overshelming nature of the rhythms on my sense of perception and self, as I had become but a small part of a larger organism, locking into the various waves of harmonic existence with the various other dancers who drew higher strength from a communal language.  I am reminded of Jung's descriptions of archetypal communion inherent in every human's collective unconscious, as shapes and forms shifted from goblins to angels to the epitome of devils themselves....and yet, throughout this planescape of imagery and feelings, there was always the inherent feeling that it was all a great and beautiful part of the whole, and within this, all I can say was that it was a strange and beautiful trip, something I would love to do again, and yet, only because it reveals the beauty and horrors of this primal nature, of unimaginable strength and candor, without the candy-coating that other ravers may seek."
 ],
 "erowid": {
  "id": "7273",
  "citation": " aphid. \"LSD and Raving: experience with LSD (ID 7273)\". Erowid.org. Jun 6, 2001. erowid.org/exp/7273",
  "substance": "LSD",
  "views": "11014"
 }
}
