{
 "id": 11684,
 "title": "Effects of SSRI on Psychedelics",
 "date": {
  "submission": "2009-10-07T07:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bran Man",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Venlafaxine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": ""
  }
 ],
 "report": [
  "My reason for writing this is to give an account of how SSRI medications have largely reduced the effects of various psychadelic drugs, sush as psilocybin-containing muchrooms, LSD, MDMA, 2c-e, and 2c-b.",
  "Many people who take psychedelics (especially MDMA) while having SSRI medications in their system report that the effects of the psychedelics are less intense than they are when taken without an SSRI medication.",
  "The first time I experienced this was about 2 years ago (2006), when I was taking Effexor XR (Venlafaxine) daily for several months.  I took some very strong psilocybe mushrooms with my friends one night, and ended up taking about twice as much as my friends, although it seemed that my experience was markedly less intense than theirs were.(I took about 3.5 grams total that night)",
  "About a year later, I took 2 grams of some VERY potent psilocybin-containing mushrooms that were grown at home by a friend.  He said they belonged to the 'Copelandia' subgenus of Panaeolus.  I was still on effexor at the time, and once again I seemed to experience markedly less intense effects than my trip mates.",
  "I have an average tolerance to psilocybin, and when I am not under the influence of SSRI medications I take the same doses as my friends and generally feel the same level of effects.  Although Effexor XR (Venlafaxine) did have an overall reduction on the intensity of my psilocybin trips, it also made for extremely positive trips with more euphoria than usual, almost to the point of being similar to a candyflip (combining MDMA with LSD or psilocybin).",
  "When it comes to taking SSRI medicatons with MDMA, the only effect that it has is an EXTREME reduction in the effects of the MDMA.  When taking them together, I feel very little euphoria from the MDMA, though I also feel less intense 'comedown' effects (dysphoria that can ocur a day or 2 after MDMA use).",
  "After taking Effexor XR for over a year, I first tried 2c-b.  I took 20mg, and had a very good time, although I once again seemed to have much less intense effects than my friends did at the same doses.  I would speculate that this could either be from the Effexor having a direct effect on the 2c-b, thereby reducing its effects, or the fact that effexor may have contributed to my overall tolerance to phenethylamines.  I have never taken 2c-b while not on Effexor.",
  "peace"
 ],
 "erowid": {
  "id": "72821",
  "citation": " Bran Man. \"Effects of SSRI on Psychedelics: experience with Venlafaxine & Various (ID 72821)\". Erowid.org. Oct 7, 2009. erowid.org/exp/72821",
  "substance": "Venlafaxine & Various",
  "views": "10309"
 }
}
