{
 "title": "I Realized It Ruled My Life (in Recovery)",
 "author": "The Wall",
 "citation": " The Wall. \"I Realized It Ruled My Life (in Recovery): experience with GBL (ID 11685)\". Erowid.org. Dec 15, 2004. erowid.org/exp/11685",
 "substance": "GBL",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "GBL",
   "(daily)"
  ]
 ],
 "report": "<p>GHB, GBL GBL 1'4 BD are physically and mentally addictive substances.  My experience stems from excessive GBL abuse.  I have used 2-2.5 ml of GBL about 10 times a day.  I would sleep for 1 and 1/2 hours if I was lucky or drink 4 ml to sleep for 3-4 hours.  I had been using GBL for about 2 years with increasing frequency. It is easy to find on the Internet, I just have to know what I are looking for.  I have quit 3 times.  The first time I ran out and moved 2 months prior so I didnt expect to find anymore.  The 2nd and 3rd time were work related (Army Stuff) where I knew I wouldn't be able to use GBL so I either dumped my stash or timed it just right.  In each case I had some nasty experiences.</p><p>First of all, I won't go into the scientific aspects of the dopamine rebound and withdrawal symptoms.  You can read other articles to get that information.  I am going to tell you what you may expect and how to combat those ill effects.  I am going to tell you what over the counter drugs may help recovery.  Second, I am going to suggest to you that you read as much as you can about recovering from GBL abuse and addiction.  Information is power and it can't possibly hurt to have several opinions.  Finally, I am going to share the experiences of 2 people I know whom had used GBL excessively. </p><p>I have used GBL excessively.  Plain and simple, I violated the moderation rule.  I failed to control the drug.  However, I learned to combat the withdrawal.  Initially, I felt anxious, nervous and had some muscle tension.  It drove me almost crazy.  I was confused, my heart would race and my hands would shake.  These symptoms would go away with more GHB/GBL use.  My hands/fingers would sometimes feel numb and in some cases I would not sleep.  In fact, if I quit cold turkey I could expect not to sleep decently for at least 6-10 nights.  My experience was that I would desperately crave the drug.  I have tried quitting numerous times, but the only way to quit (in my humble opinion) is to go cold turkey. </p><p>If you are serious about quitting you must dump your supply.  Tapering off may work for some, but I personally craved it too much and made excuses for myself why to keep using it.  Dump your supply.  Next you need to get some alcohol, trust me.  Alcohol can help the shakes and nervousness, but be sure to use only small doses (i.e. 1-2 shots or beers every 3-5 hours).  Next, I suggest Valerian Root, Melatonin and Benadryl.  You need the alcohol to give you that calm relaxing feeling.  You need the Valerian Root, Melatonin and Benadryl to relax your nervous system and hopefully help you sleep.  A lack of sleep causes psychotic behavior.</p><p>I would try a larger combination of alcohol and Valerian Root to start getting the monkey off my back and slowly tapering their use as I got more calm and my body shifted back into normal mode.  The Melatonin and Benadryll are mild depressants and easy to get.  I would use them as needed.  After about 2 days I slept 2 hours and after about 1 week I slept somewhat normal.  I still craved the drug and started over when I had my first chance.  Oh by the way, don't take too much Benadryl (more than 4-5 pills over 12 hours) I would have hallucinations that suck.</p><p>Next, read everything you can about recovery.  I tried Benzos awhile ago and they work wonders.  If you need to, consult a physician.  There is a wealth of information on the net about recovery, try numerous approaches in small doses and go with what works. </p><p>Finally, I know 2 people who had somewhat similar addictions to GHB/GBL.  The first one has had numerous psychotic episodes, spent time in and out of an asylum and the second one has done well and only uses GBL 1-2 a week.  The key is determination.  When you decide that the drug controls you, that it interferes severely with work or school, you need to tone it down.  You dont need to quit per se, but just slow it up a bit.  GBL is a great drug, I love it.  But doing too much can hurt, if not kill.  I got into a 1-car car accident on GBL and I was given a breathalyzer and passed with flying colors.  I got off with nothing except an insurance premium.  I am lucky I didnt die.  I drove from 45 minutes in a state of stupor.  I only remember vague bits and pieces of swerving through traffic.  I then realized that the drug ruled my life.  I regret it, but I know that the drug is no longer in control.  Take my advice and suck up a little pain.  Take Care</p>",
 "year": "2001",
 "id": "11685",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-15T08:00:00.000Z",
 "views": "12162",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "GBL",
   "form": "(daily)"
  }
 ]
}
