{
 "id": 11691,
 "title": "Mary Jane and Bipolar",
 "date": {
  "submission": "2009-01-25T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TazarTheYoot",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "Citalopram",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "specific": "Hash"
  }
 ],
 "report": [
  "Throughout highschool I was one of those 'moody teenagers' who oscillated between depression and normality. I went nowhere near even the most conventional drug use. When I got to college, I experienced anxiety and depression and was prescribed Lexapro (escitalopram), the SSRI antidepressant, at 10mg.",
  "Fast-forward: two months later I suddenly experienced an increase in energy, mind-expansion, and general self-confidence to the point of obnoxiousness (to others). About two weeks into it, I happened to be in India, and a friend who had recently begun using hashish offered to share a joint. Being in an already altered state of mind, I accepted.",
  "I almost immediately blacked out; the hash was that strong. Most people talk about not really getting stoned their first time, but I most definitely was, to the point of having visual distortion and some dissociation. Well, I purchased several tolas (a tola is 10g in India), smoked for four days straight, and boarded a plane from India to Britain to the States with about 10g of hash in my luggage and a gram of opium on me.",
  "The next six weeks or so, my mood continued to escalate; marijuana didn't help me calm down, either. Instead of making me foggy, forgetful and sleepy it acted like a stimulant, keeping me up till 6am every time I smoked. Eventually I snapped after staying up for several days, crashed into depression.",
  "I was diagnosed with bipolar disorder, and am now on six prescription medications to keep me stable. I guess it had always been there, latent, but the antidepressant kicked me off into mania and the hashish definitely exacerbated it. I don't know what would happen to me if I smoked while depressed. I have stayed away from weed in all forms since my breakdown (although I have tried several other things).",
  "I am not opposed to drug use, and I wholeheartedly think most drugs should be made legal. But I think if there's a moral to my story, it's this: Know your family history (my grandma is also bipolar), beware of any instability, because drugs can definitely bring out or exacerbate mental problems. Lastly, never underestimate the power of a single experience to change the course of your life."
 ],
 "erowid": {
  "id": "72873",
  "citation": " TazarTheYoot. \"Mary Jane and Bipolar: experience with Escitalopram (Lexapro) & Hash (ID 72873)\". Erowid.org. Jan 25, 2009. erowid.org/exp/72873",
  "substance": "Escitalopram (Lexapro) & Hash",
  "views": "10317"
 }
}
