{
 "id": 11692,
 "title": "Dumb Night",
 "date": {
  "submission": "2008-11-05T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mental Patient",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "gas"
  }
 ],
 "report": [
  "[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "First off, I have tried or have abused every drug except heroin.  I started smoking pot and age 11, then drank a lot and then did meth for a couple years as well as lsd and mushrooms.  I had used duster before and it really fucked me up.  The thing that I liked most about it was when my voice would get really deep.",
  "So to start my story.",
  "I had just moved to a new city and did not know anyone.  I was in school and working but had nothing else to do while I was at home.  One day I decided to huff some duster because I was bored and felt a little depressed and lonely.  I took a couple rips off the can and fell back onto my bed.  The TV was on and my mind began to spin.  The effects wore off and I repeatedly huffed until I got to the point of blacking out and puking all over the floor.",
  "This still did not stop me from continuing to get fucked up.  I continued to huff and huff.  Then I took some sleep aids to get to sleep because I have trouble falling asleep at night.  As I huffed, I began to dream of crazy shit while I was blacked out.  I came up with the entire meaning of life while in a mini coma.  When I returned to earth I still kept on huffing.  For some stupid reason I was addicted to the feeling of being completely gone from reality.  All of this huffing had continued until the entire can was empty.  This is when I started to feel tired from the sleeping aids. So I went to bed.",
  "The next morning I awoke and went to catch the bus to school.  I felt fine I did not think that anything was wrong with me at the time until I got to school.  when I arrived, I lit up a cigarette and headed to class.  My nerves felt wrecked as though I had done a bunch of speed the night before.  However, this was not the case.  I was starting to have a reaction with the diflourethane (actual gas that is in the can) that I had huffed the night before.  When I sat down in the classroom, my body  began to get really hot and the blood vessels in my eyelids and face had broken so all you could see was bright red dots all across my eyes and face.  I was very worried at this point  so my heart began to beat extremely fast.",
  "I left the classroom and went into the bathroom to splash cold water on my face.  It gave me some relief but I still felt like I was going to die.  I managed to stay throughout the entire class but the minute it was over, I ran out.  I didn't know what to do, go to my next class or go to the health center and get rushed to the emergency room.  I decided to do the smart thing and go to doctor.  I rushed in and told the nurse that I needed to see the doctor immediately. ",
  "They had me lye down on a bed in the back and I waited for about an hour.  Eventually, the doctor came in and did some tests.  She said that everything was working fine but she called poison control to find out about the duster.  Poison control informed her that diflourethane can cause your heart to beat irregularly and you can die without warning.  So they tested my heart using and ECG and everything looked fine.  It turned out that my body was having a very bad reaction from the mixture of benadryl and duster.  The doctor released me and I went to my next class and still felt like shit but right when I got home I ate and tried to fall asleep.",
  "For about the next two days my body was a wreck but I managed to pull through and vow to never do inhalants again."
 ],
 "erowid": {
  "id": "72874",
  "citation": " Mental Patient. \"Dumb Night: experience with Inhalants (Computer Duster) & Diphenhydramine (ID 72874)\". Erowid.org. Nov 5, 2008. erowid.org/exp/72874",
  "substance": "Inhalants (Computer Duster) & Diphenhydramine",
  "views": "11508"
 }
}
