{
 "title": "Running on Autopilot",
 "author": "Anonymous",
 "citation": " Anonymous. \"Running on Autopilot: experience with LSD (ID 117)\". Erowid.org. Jul 30, 2001. erowid.org/exp/117",
 "substance": "LSD",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE:",
   "2 hits",
   "oral",
   "LSD"
  ]
 ],
 "report": "</p>\n One hell of a first experience</p><p>I'm not sure how sensitive I am to LSD-25, but I must say that this is the most potent experience I've ever had in my life.  On New Year's Eve of 1999, some friends suggested we all go camping and drop.</p><p>I'll cut to the chase.  My perceptual processes were simply not ready for the rush of everything that happened, and I spent a long period of time adjusting to it all.  Part of it was the acid.  Another major part of it was being out in unfamiliar territory and not feeling so sure of myself to begin with.  Then, there were all the people yelling, the rangers, and the fireworks.  I'm talking massive overload here.  My mind's reaction was to shut down some of the sensory input by turning off different senses.  I spent a brief period of time being blind and another one being deaf.  These both shortly came back to me, however, once I was in a lower-stimulation environment.</p><p>That's when the really bizarre thing happened.  My mind was having a hard time serializing everything into one constant flow.  Effects were sometimes happening before causes.  I soon found myself pretty much trapped in my own mind, and found that my analytical thoughts were being used to process the high levels of sensory input.  My body was running on a sort of natural autopilot (I later found out that nobody thought anything was wrong with me), but I was well lost in my own head, having conversations with archetypes of my friends and watching possible futures unfold before me...different thought patterns would naturally fizzle out and such...eventually, I'd have a window where I could act again.</p><p>The process of action was very difficult for me.  If I wanted to go sit out by the fire, I had to emote it...I had to allow my 'me-ness' to drift toward the 'fire-ness.'  Reality seemed to exist in a state of freeze-frame, too, unless I kept my body moving.  Thus, in order to stay cognizant of things around me, I was constantly tapping my fingers against a surface to keep my mind in motion.</p><p>Eventually, this settled down.  My senses of taste and touch became exceedingly dull, and were for some reason instead rerouted into the tapping of my fingers against a surface.  When given an extremely sour candy that left others writing on the ground in pain, I sucked on it, noticed no flavor, and then found my right hand drumming erratically at the table for minutes later.</p><p>Sunrise came, and it was an incredible experience.  I put on one of my more serene CDs (This Mortal Coil's album titled 'Blood.'  I recommend it.) and stretched out to watch the forest dance lightly to the music and the sunrise.  I then went down by the river's edge and sculpted it in my mind.  I have never in my life seen such incredible beauty.  Sadly, since my emotions had been tied up elsewhere in my mind, and so I found myself indifferent to it.  Never before have I experienced such beauty, and been so unmoved by it.</p><p>My body held onto the LSD pretty tightly, and so I was still feeling the effects hours after everyone else had gone to bed.  Sitting there, alone, in a dark apartment, with nobody to talk to, and hearing the neighbors argue, seemed to dredge up some old childhood fears.  I curled up in a chair, squeezed my old lovvee closely, and wept for a while.  It was hours before someone got up, but when they did, it was nice to have interaction again.</p><p>Finally, it had been about 22 hours since I dosed, and I still hadn't come down.  I was developing a headache, and was getting tired of having no sense of taste or a hand compulsively interpreting different sensations.  One of my friends made a run to the store, and I had her bring me back some Dramamine.  I've used a prescription version of it (though they're pretty much identical) to treat sleep terrors in myself in the past, and have also used it to help a lover fall asleep when she had a severe migraine.  One Dramamine tablet, and fell asleep a half hour later, and never slept better.</p><p>In all, I couldn't sum the experience up as positive or negative.  It was interesting, and I'll definitely be trying it again, although it might be a long time.</p>",
 "year": "2000",
 "id": "117",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2001-07-30T07:00:00.000Z",
 "views": "8846"
}
