{
 "title": "My Best Friend is My Dad's Dealer",
 "author": "Capns",
 "citation": " Capns. \"My Best Friend is My Dad's Dealer: experience with Cannabis (ID 11707)\". Erowid.org. Jan 9, 2002. erowid.org/exp/11707",
 "substance": "Cannabis",
 "bodyweight": "",
 "header": [
  "DOSE:",
  " ",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>I guess I should start with a quick psychoactive background.  I never did any drugs whatsoever until after my 21st when I got drunk the first time.  Later I decided to try weed with my best friend who had been smoking for quite a while.  Apparently with most people it's not this way, but that first time (it was decent bud at best but far from dank) I was totally ripped after about 3 puffs.  Obviously, I fell in love with it and after a 2 month dry spell began smoking twice or once a week.  We've got a regular little circle with my roommates and my best friend.</p><p>So a month or two after the circle was established my friend starts growing his own, and come final harvest time he has about half a pound of weed so he started selling the excess to friends at his job (a restaurant, so obviously he had plenty of contacts).</p><p>My dad has always been a better friend than father figure.  He's quite the character, and always a blast to hang out with.  We had his version of the drug talk when I was a younger guy and he told he that he had tried just about everything: meth, coke, heroin (once), shrooms, acid, and of course weed.  He then told me that all that was in the past and there's not all that much to it.  Later, when I got older and long after he and my mom had split up, he admitted that he still smoked weed occasionally, although that didn't really make me want to try it (I was very down on all drugs until that magical day I first got drunk).</p><p>So a few months ago I told him that I smoke weed.  At first he was a little flabbergasted, but then he just tried to fill his parental shoes as best he could by reminding me that it is illegal and telling me to be careful.  I of course told him I would and we left it at that.</p><p>The next time he came up for a visit, he asked me if I wanted to get high with him.  This time it was my turn to be speechless, but after a minute I just shook my head with a small laugh and said, 'I'll see if I can score.'</p><p>', ummm.. I know this is fucked up, but... umm... how would you feel about smoking with my dad?'</p><p>My friend was not at all opposed to the idea, as he also gets along well with my dad but unfortunately that time he was between harvests and we were currently out of smoke.  We didn't get to smoke that time, but the next time he was up was after the final harvest so when I told my dad how much bud my friend had he expressed some interest in buying from him.  He bought a 1/4oz and the three of us got high that entire day until the rest of the circle got off work and they all joined us for the rest of the evening.</p><p>I've got to say that that night was one of my best smoking experiences of all time.  My dad bought us all beverages, pizza, took us out for dinner for munchies (he's kinda loaded now).  He regaled us with stories from back in the day when you could score a lid (I had to ask him what a lid was, it's a full ounce) for $5 and if you spent $20 you got some super dank ass weed.  He made some awesome prank calls with me.  He started trying to fuck with our heads when we were really feeling it by talking in this gibberish and acting like it was a real conversation.  And every once in a while, I would look at him and think, 'My God.  He's been living for so much longer than I have, and yet here we are connecting in this complete and wonderful manner in a way we never have before.  This is so fucked up!  I'm blazing with my fucking dad!'</p><p>I haven't smoked with him since, but I'm looking forward to doing it again some other time.  I don't wanna get all mushy, but even though we sometimes fight and sometimes I really hate the guy, we really connected on that night and I think it's something that both of us will take with us for the rest of our lives.</p>",
 "year": "2001",
 "id": "11707",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2002-01-09T08:00:00.000Z",
 "views": "31174",
 "dose": {}
}
