{
 "id": 11705,
 "title": "Designs Morphing With The Music",
 "date": {
  "submission": "2003-03-02T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pfitz",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "9.0",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "seeds"
  }
 ],
 "report": [
  "While meandering around my local department store, I spotted a seed rack with some Heavenly Blue Morning Glory seeds.  Hearing and reading about the LSA chemical in the seeds I decided it would definitely be a wise investment.  So I bought five 1.8 gram packages and took them home.",
  "Upon arrival, I took the seeds out of their packages and let them sit in a mixture of a very small amount of dish soap and about a cup of water.  I was not too sure about pesticides or other factors and thought this to be a wise idea.  After a day I let the seeds dry for a day.  Once they were dry I put them back in their packages and rolled up them up tightly.  The same could be done by wrapping them in a thick magazine cover or other such material.  While wrapped, I took a hammer and pounded on each pack about a dozen times on each side.",
  "When the seeds were crushed to my satisfaction I fed the debris through a window screen.  I did this because I had read that the black coats made one very sick and the active ingredient was inside the seeds anyway.  So, with the yellowish white powder sifting through and the black coats staying on top I created a pile of just the good stuff.  I mixed this powder with some water and drank it down.  It didn't taste too bad but made me sort of gag for one reason or another.  Therefore, a separate glass of water to chase it down would not be a bad idea.",
  "About a half an hour later I experienced very mild nausea, almost unnoticeable; nothing like the extreme diarrhea that I have heard about that comes after morning glory seed ingestion.  So, I made use of the substance that has been used for nausea for thousands of years:  Cannabis Sativa.  After maybe four or five hits, I barely caught a vibe, but sure enough my stomach felt very settled and I felt very nice.",
  "After I was done smoking I settled down to listen to some Medeski, Martin and Wood tunes and closed my eyes for 45 minutes or so without sleeping and got up to change the CD.  After standing, I was very well aware that 'something' was going on.  Just a slight change in perception, nothing too noticeable. So, I kind of chilled out for a while with this strange sort of buzz that soon climaxed into the peak of a trip approximately two hours after ingestion.  This trip felt very natural and almost kind of chilled out.  I was grooving to some Allman Brothers and watching the walls wave and flow to an extreme like I'd never seen before while this calm and collected.",
  "With my eyes closed I witnessed astounding tiled designs morphing with the music.  Motion was frame-by-frame, but flowing in my head at the same time.  I couldn't help but to get up and dance to the music playing.  I could hear several melodies emerging that I had never heard before and every note of it sounded amazing.  I got totally lost in the music and my dancing and I must have been grooving for at least an hour (the Allman Brothers have some fairly lengthy jams). Exhausted as I was now, I laid down on my bed and drank some water.  Without thinking about it I took the cap off the bottle and started chewing on it.  After this point there isn't too much to recap (no pun intended), because I pretty much just laid on my bed and chewed on the cap for about 4 hours and stared at the ceiling letting random thoughts run through my mind.  The bottle cap felt more than good to chew on, it felt great.  I savored this white piece of plastic for hours, for a reason I cannot explain.",
  "I don't remember too much after the bottle cap, except that I felt chilled out enough to go to sleep; which I've never done before while tripping.  I woke up the next day feeling fine and almost refreshed. I was quite impressed with the turnout of the trip and the fact that I had a full-blown experience with almost no amount of nausea.  I attribute this to my screening method and the cannabis.  I would, however, recommend a smaller dose for those experimenting with this the first time.  Three packs or 5.4 grams would probably be a good stepping stone to larger trips and deeper exploration.  Have fun, and be careful."
 ],
 "erowid": {
  "id": "7297",
  "citation": " Pfitz. \"Designs Morphing With The Music: experience with Morning Glory (ID 7297)\". Erowid.org. Mar 2, 2003. erowid.org/exp/7297",
  "substance": "Morning Glory",
  "views": "15164"
 }
}
