{
 "title": "Experience of the Void",
 "author": "Yardie Lobo",
 "citation": " Yardie Lobo. \"Experience of the Void: experience with 5-MeO DMT (ID 11701)\". Erowid.org. May 22, 2002. erowid.org/exp/11701",
 "substance": "5-MeO DMT",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "smoked",
   "5-MeO-DMT",
   "(freebase)"
  ]
 ],
 "report": "<p>I am a 'rookie' in the drug world. Sure, I had smoked plenty of pot, but I had only rolled twice and that is it. Well, on Jan. 5 2002, I expirenced the most amazin thing of my life.</p><p>I was out and about at friends houses when I some how got sucked into smoking 5-MeO DMT. I was incredibly nervous before taking it even thought 2 of my good friends did it and loved it right in front of me. I said to myself, 'let's just do this' so at about 10:00 pm, I smoked it. As I finished my inhalation, I immediately felt life being sucked out of me and i could not move. I was laid down on the couch. I felt that there was nothing to me and there was nothing around me. This must have been 'the void'. Before I knew it I was flying through a tunnel of interchanging color at a million miles an hour hearing 'Lucy in the Sky with Diamonds'. Then a new found meaning of the song was discovered as I was able to see and feel the music.</p><p>As well as I could remember, this was the end of my unconcious state. As I gained conciousness I seemed to be on the ground in the forest be looked upon by elves or some sort of fantasy creature. I soon realized that these were my friends. This was my only major halluncination of my concious state, but there were random mnor ones such as colors changing and a slightly adjusting preception.</p><p>I was told that I was unconcious for about 4-5 min. Yet to me it seemed as though it were a second. The expirence of the drug was then greatest expirence of my life yet, I don't intend on doing it much more if ever again.</p>",
 "year": "2002",
 "id": "11701",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-22T07:00:00.000Z",
 "views": "9181",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "10 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(freebase)"
  }
 ]
}
