{
 "id": 11719,
 "title": "Ghana Strain Review",
 "date": {
  "submission": "2008-08-24T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Ineedbout3fity",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": "1:00",
   "amount": "25 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  },
  {
   "time": "2:00",
   "amount": "50 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I noticed that there arent many (if any) HBWR Ghana strain reports so I thought I should add this as it is happening. I bought the seeds from one of the best vendors online for about $5.00/100.  I knew that they were less potent, but very inexpensive, compared to the Hawaiian strain; so I thought I would just up the dose.  Alone, I chewed all of the seeds over a two hour period on a light meal beforehand (30 mins before).  I am in good health, no meds, and in a good frame of mind to trip so fingers crossed (dicks too).",
  "9:00pm-25 seeds eaten total/almost at once",
  "1hr-after 50 seeds not much more than a slight buzz is noticed",
  "2 hr-just finished the last 50, still only a slight buzz and now gas (hoo-raaaa!)",
  "3hr-I believe I have reached peak buzz with slight euphoria, but still no trip",
  "1:00am- no trip, no visuals (open or closed eye), only a mild narcotic like euphoria and slight body high ",
  "Conclusion- For $5 I guess Im not too pissed, I mean I did achieve some effects with no discomfort.  Clearly I just need to buy the Hawaiian strain and eat the low seed doses; I believe they are $18/50.  The HBWR India strain is the next potent, supposedly, but still not near the Hawaiian by comparison ($9/50). Dont waste money on inferior strains.  I have read that some people actually puke their hearts out on 6-7 Hawaiian seeds; I ate 100 of the Ghana with little effect."
 ],
 "erowid": {
  "id": "73055",
  "citation": " Ineedbout3fity. \"Ghana Strain Review: experience with H.B. Woodrose (Ghana Strain) (ID 73055)\". Erowid.org. Aug 24, 2008. erowid.org/exp/73055",
  "substance": "H.B. Woodrose (Ghana Strain)",
  "views": "6020"
 }
}
