{
 "id": 1171,
 "title": "Lullaby of Birdland",
 "date": {
  "submission": "2005-03-04T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Professor Klickbang",
  "gender": "Male",
  "weight": "265 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  },
  {
   "time": "0:30",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract)"
  }
 ],
 "report": [
  "My very first and second Salvia experience are less than 90 minutes prior to this writing. I had spent many hours reading accounts of Salvia and DMT experiences. I was enthralled. I was curious and even a little nervous about trying it knowing I inevitably would....and soon. I purchased one gram of Salvia Divinorum 4X over the internet. I thought I'd start small after all I've read. A small part of this small bag of nondescript dark green dried and crumbled leaf can allow me to see God? I'm intrigued!",
  "It's Friday night and I decide now is the time. I was alone. Aware of how much is written about setting, I pay attention to this. I install a green light in the table lamp, smooth out the bedsheet because I'll be using the bed as a table, break out a large shallow pan to drop the pipe and lighter into just before losing consciousness and leaving this dimension, so I've read, and pull up a comfortable chair next to the bed to sit myself in. I'm ready.",
  "Earlier, I divided my gram into ten parts. I put one those parts into my trusty old pot pipe. (I no longer smoke pot because getting stoned only forces me to realize how shitty ((my)) life is.) That amount is about two and a half large tokes. I take my first hit. I inhale as deeply as I can and hold it in as long as possible. Exhale. Nothing. I take a second hit. Exhale. Nothing yet. I take a third hit. Here it is. Yeah! The edges of all the objects in the room become fuzzy, and so do I! The blurred outline of the objects hold a row of small lights moving in a linear fashion (like a sign). These lights are about half the size and intensity of the smallest lights (that are about .5' long) you'd drape around a Christmas tree. At this time, one passes into semi-consciousness in the course of a few seconds. My first thought was, 'evil drug' (social conditioning, you see). I then slide sideways down a short slide (There were two slides actually. One under my butt, the other under my thighs. The distorted sensation of sitting in the chair I presume.), and just as I started to do so I heard myself, somewhere between speaking and yelling, remark, 'You're pulling me in!' as though I were addressing and with a smile blaming someone for what was happening.",
  "I felt concerned and slightly alarmed, but it was fun. There were two family members there in the scene watching me. One I could see in front of me and off to the side, and the other I sensed in back of me and off to my left. This appears typical with this drug in that one 'senses' someone nearby. This happens each time I use this drug. This dream seemed to be mostly brown in color with brown vegetation. I heard myself twice making something between a laugh and a giggle. It was euphoric. That's what drug are, right? This vision, for lack of a better word, seemed to last only a few seconds.",
  "My second experience, thirty minutes later, was a little more intense. Again three hits and I'm off with a whooshshsh....  My body is pleasantly buzzing. A tube of energy, black and about three feet in diameter passes diagonally in front of and partly through me. I looked and saw it passing downward to my right coming to a near point many yards away. This tube of energy passing through the front parts of my body (my knees, forearms and hands) while in a sitting position seemed both gory and pleasurable. I saw and felt this energy in the form of small, defined, moderately bright lights, the same as in my previous trip, one behind the other, like an animation one might see in a technical film illustrating air or water flow. There was four or five rows of these lights running lengthwise and evenly spaced around the perimeter of this dark tube. I felt these strings of light composed of energy flowing through me as though in the veins of my circulatory system. This was the gory aspect I mentioned, like being hooked-up to a dialysis machine, if I can imagine what that is like. This was apparently my brain interpreting a body rush under the influence of this drug. But, it was more enjoyable than not.",
  "In addition to this, there was a toy rocking horse moving towards me but off to a slight angle in sync to the song 'Lullaby of Birdland' which I heard at a low volume. If that wasn't trippy enough, I believe the rocking horse was being riden by Olive Oil (or a close facsimile thereof). Thinking about it, the music I heard fit the image I saw or felt or imagined, hand-in-glove. They went together perfectly. This makes sense considering how the brain works. It's odd. I couldn't say I saw it and I couldn't say I felt it. It seemed to be somewhere between the two. This may be dose dependent. With a stronger dose I might be able to definitely say I saw the image. Here was my first experience with the cartoon-like aspect of the effects of this drug that so many people describe. There didn't seem to be any connection between the tube of flowing energy and rocking horse other than then being in the same 'dream'. An analogy I thought of just afterwards was that of a carpenter and plumber working in a new home. They're both there but not directly connected. I kept my eyes closed through this brief experience which seems to last only seconds (unfortunately). I learned that opening ones eyes brings you out of it sooner. Realizing this, I closed my eyes again for a trail-off of this vision. Again, I laughed. It was fun.",
  "This was my first experience and I found it interesting. The fearful aspect of this drug is the sense of losing control. I did fall into semi-consciousness after my third deep hit of Salvia 4X extract. It was not as deep or mystical as I have read, but I point out that it was not DMT crystal or wax that I smoked, just salvia leaf. Both times I thought there were two individuals nearby and the second time I wanted to relate to them what happened but soon realized there was no one there. This is apparently another common aspect of this drug where you believe you are in the presence of others when you are not. This may possibly spring out of the fear of taking this drug alone. You are aware that what you are experiencing is drug-induced, but it still seems somewhat real. As soon as I fell under the influence of this drug I had the feeling, 'Oh yeah, that's right'. Not 'right' as in good (although it was), but 'right' as in a familiarity with the sensation. But also, this is just a familiarity of the general rush some drugs give.",
  "I can best describe the experience as being hit in the back of the head with a 2 X 4 without the impact, pain or injury. When I was about ten years old I sat in my wagon. Grabbing the handle, my friend Kenny jerked it forward so hard and fast I fell back and out of the wagon hitting my head on the concrete. I was knocked into semi-consciousness. Not injured, but knocked-out for many seconds. During that incident I recall all the voices around me being sped-up sounding incoherent and alien-like. I make this comparison to DMT. It is very brief and somewhat intense experience.",
  "I did not experience any OEV's (these first two times) other than that of a general fuzziness and the rows of lights just before going under (and that's what I do; I go under). The only after effect was a little grogginess like one would experience after a brief unscheduled afternoon nap. This drug was to me simply experiencing a buzz, losing consciousness for a few brief minutes along with some fancy dreaming. I've never been conked with a 2 X 4, but this is one way to describe it. Incidently, the folks I bought the Salvia from over the internet know what they are doing. It might be easy to go quickly through a $20 bag. Any more expensive and it would be too pricey. Brother, they ain't givin it away. Overall it was interesting, fun, a rush, queer, and intriuging.",
  "I would give a definite yes to the opportunity to secure some laboratory grade DMT crystal. The first time I used it was a feeling I was familiar with. It takes a few seconds to come over me. At first I am not sure Im getting off, but very quickly I realize I am. My eyes water. A warm fuzz rolls over my body like a thick oil. Everything melts and flows. The experience is similar to hyperventilating. After using this drug once I understand how some people think they are dying. I am stunned. There is a numbness and incapacitation that comes over me. That can be scary. I may compare it to the feeling of being physically traumatized, but with no pain. A state that will also affect the psyche, as though I've fallen off a building, landed on my back, and are waiting to maybe die. That feeling can certainly be scary. I learned quickly not to worry. Let go and submit to the experience. Keep my eyes closed (at least for the first couple of times). All external stimulation, such as sound from a radio, should be avoided. My sense of sound is  enhanced, but I believe this only because my other senses have been temporarily diminished. My only complaint is that it is too damned short! It is a fun experience if I can simply not worry and let myself go. That wasn't hard for me to do. My curiosity has been answered and I will be going back. If asked to describe this drug in short terms I would say it is brief, somewhat intense, and weird."
 ],
 "erowid": {
  "id": "13416",
  "citation": " Professor Klickbang. \"Lullaby of Birdland: experience with Salvia divinorum (4x extract) (ID 13416)\". Erowid.org. Mar 4, 2005. erowid.org/exp/13416",
  "substance": "Salvia divinorum (4x extract)",
  "views": "4452"
 }
}
