{
 "id": 11722,
 "title": "Dramamine is AWFUL!!",
 "date": {
  "submission": "2001-07-22T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Greg",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Dimenhydrinate",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Psychonauts,  I tried dramamine and found it to be absolutely awful.  It is dark and delirious...here is my story.",
  "Feeling somewhat depressed and self-destructive, my impulse control was low.  I wanted to be obliterated, but the town was dry...not a hit of acid nor a dose of ecstacy to be found.  I recalled that dramamine, taken in high doeses, gives a dissociative, quasi-hallucinogenic high.  I bought two tubes and consumed 1 and 1/2 tubes.  Over a one-hour period, I began to feel heavy and very out of it...my body was not my own and was very heavy. This was by no means pleasant.  I was overcome with fatigue, and gave in to sleep that was not really sleep but a sort of passing out.  I came to the next day...VERY messed up.  My body was heavy and I had trouble mustering the energy to get out of bed.  My mouth tasted horrible...like the tablets.  I finally forced myself up, and I felt awful.  Tired and dilerious.  Hallucinations would overcome me, the walls would seem to move.  I heard conversations going on in my head...like voices in there were carrying on without my control.  I would close my eyes and see very intense visuals.  My thinking was disordered...I felt like I was mad.  Dramamine is very similar, in my opinion, to Datura...another 'drug' you are better off avoiding.  The dramamine 'trip' lasted that entire next day...I had to avoid friends I saw on the street, because my mind was paralyzed.  I was trapped in a wicked dream that I could not awake from...a waking nightmare.  I regret doing this stupid thing.",
  "I want to advise any who read this to think hard about their decisions.  I was a cocky fool who thought I could handle any hallucinogenic experience.  I was wrong.  There are substances out there that are too powerful to fool with...that are retrograde and contrary to the purposes of enlightenment.  They can hurt you.",
  "Take my advice, stick to pot.  You are not missing a thing, except for discomfort and regret.  Believe me!!!"
 ],
 "erowid": {
  "id": "7308",
  "citation": " Greg. \"Dramamine is AWFUL!!: experience with Dimenhydrinate (Dramamine) (ID 7308)\". Erowid.org. Jul 22, 2001. erowid.org/exp/7308",
  "substance": "Dimenhydrinate (Dramamine)",
  "views": "25822"
 }
}
