{
 "id": 11739,
 "title": "Talking Fire Trucks",
 "date": {
  "submission": "2010-04-07T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Diphencrazed",
  "gender": "Male",
  "weight": 93
 },
 "dose": [
  {
   "time": "0",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "Diphenhydramine 700 mg = Biggest trip of my life! It was stupid but I did this before went to work. When I went in nothing big had happened yet besides hearing lots of things that were not there like loud bangs people saying my name over and over, and staring into space drifting off alot. But as the nite pressed on things that I didn't see before started to appear such as looking into a ham watching a tv show.",
  "Yea it started getting worse! When I went to cut the stems off the spinache I started seeing random things in the leafs such as people I knew, cars, fire trucks ect.... I started having a conversation with my father who had died more than a year ago I could even see him standing beside me. That went on till a fellow co-worker asked if I was ok and I stated yea I was just really really hung over from drinking a bottle of 180 proof.",
  "It now started to feel like I was in a different world and would randomly switch back and forth from the real to the fake one I was really confused I started talkin to the spinach people shortly after that, the cars, and the fire truck tried to talk to me but I told them they were goofy that they were cars and a truck and couldnt really talk to me. I was gone. I got lucky though apparently I got through all my work. I don't have a clue how.",
  "After that I went home and passed out. I was woke up by my sister later on no clue how long after I had fallen asleep I was really sick to my stomach for the rest of the nite and the next day. In conclusion great visuals! Might do it in the future not shure but if I do it will never be at work again!!"
 ],
 "erowid": {
  "id": "73183",
  "citation": " Diphencrazed. \"Talking Fire Trucks: experience with Diphenhydramine (ID 73183)\". Erowid.org. Apr 7, 2010. erowid.org/exp/73183",
  "substance": "Diphenhydramine",
  "views": "5668"
 }
}
