{
 "id": 11735,
 "title": "Bliss with Busy Bee",
 "date": {
  "submission": "2009-02-16T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Eurocat78",
  "gender": "Male",
  "weight": "260 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Tryptophan",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Tryptophan",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Piperazines - BZP",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>I have been enjoying this self-discovered formula for almost two years, and without any noticable side effects.",
  "For me, BZP seems to work in higher dozes of 250-300 mg to produce effects of feeling really good and energetic. Taking 100 mg of 5-HTP makes my experience much less pleasant eliminating or reducing my hangover dramatically. Everytime I took i preferred to take on empty or semi-empty stomach right after eating a banana or an apple: fruits seem to allow gradual, yet fast absorption without stomach discomfort. I am a pretty rugged man however, and may have higher tolerance. But before that, about an hour prior I take 50 mg of 5-HTP, then another 50 mg with the 300 mg of BZP and a banana. Smoking some weed may have a nice transition from one high to another, but the past part of course comes when I snort a bit of 2C-I (I also tried 2C-B and 2-CT-7, which are also very good, but too psychodelic for my taste).",
  "I snort about 10-20 mg of 2C-I usually cut with paracetamol. Paracetomol is also a good addition for me, especially if headache develops. I have such an amazing time, and drinking makes me more relaxed without getting drunk. I usually do not exceed 3-4 beers, as then it is too relaxing perhaps. But one or two bears will ensure I have lesser hangover next day - don't know why but it works the opposite of what I would expect. Overall I think it is a pretty good recepie...",
  "Side effects are: a bit of hangover next day which is easily eliminated with more 5-HTP, some proper eating and drinking juice or eating fruits. Sexually, it is very similar to ecstasy - feels amazing but keeping it hard can be an issue, but if I manage to have an orgasm, it is great. As a male, I can tell you it is pretty darn amazing orgazm, but it is not synchronized with ejaculation (speaking scientifically)... first I come and then I experience orgasm... sometimes 5-10 sec later and I have to continue stimulation or it never happens. Sexually, it is more about stimulation and mutual play which becomes an interesting and highly pleasant.  ",
  "Socially, it is one of the best combination, however there is a problem with extreme honesty and desire to share. Sometimes I may tell more than I want. Overall, it is great for time spent with friends, and my loved ones... even strangers. One of my friends is a couple counselor. She tried my recepie and told me it would be great for couple therapy as it opens people up. One might share more in one evening than in an entire 10-15 years of marriage (according to her).",
  "Nonetheless, I think New Zealand is definately progressive about this. No desire to sleep or eat for at least 8 hours. I didn't know this, but Viagra is in the same group of substances - although viagra I stay away from.",
  "I hope this is helpfull.</p>"
 ],
 "erowid": {
  "id": "73149",
  "citation": " Eurocat78. \"Bliss with Busy Bee: experience with BZP & 2C-I (ID 73149)\". Erowid.org. Feb 16, 2009. erowid.org/exp/73149",
  "substance": "BZP & 2C-I",
  "views": "4535"
 }
}
