{
 "id": 11749,
 "title": "Castenada Visions",
 "date": {
  "submission": "2002-11-23T08:00:00.000Z",
  "experience": "1981-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Coyote",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "in",
    "quantity": "8"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "liquid",
   "specific": "T. pachanoi"
  }
 ],
 "report": [
  "Set:  I had been reading the Carlos Castenada series for several weeks prior to dosing.  Tired with rapidly swelling sprained ankle from basketball game.",
  "Immediate setting:  With brother and his girlfriend as guides.  At home in Cleveland.",
  "Experience:",
  "I had prepared my cactus the day before by boiling for 6 hours and then straining and reducing the volume to approximately 1/2 cup.  After spraining my ankle I decided to dose since I was out of commission for awhile.  Vile tasting stuff took two tries to get down.  First try it immediately came back up into the glass.  Not regurgitation as much as rejection.",
  "Immediately after dosing I was sitting on the front porch when a coyote-looking dog walked up, looked at me and wandered away.  Mescalito?  I took this as a good omen.",
  "Within an hour I became stimulated and my brother, his girlfriend, and I went walking through the city.  At one point a police car went by and I realized I was grinning maniacally so we went home.  Soon thereafter my guides fell asleep and I closed my eyes and began to have visions.  They began with Wile E Coyote strangling the roadrunner and evolved to humanoid monsters which would come into my vision and stay until I came up with the correct learning.  Learnings such as 'I am not evil only human' had to be grasped before they would leave.",
  "After several of these I began a journey across giant naked women.  Then I began flying above villages and mountains and seas.  I became a bird and flew faster and faster until all I could see was a golden glow.  Then I became the glow and pure bliss and I knew that this is what awaited me after death.  The return to the one-ness.",
  "After the peak I regained thoughts and put on some head phones and listened to a classical music station.  A slight breeze blew in the window and I was treated to the image of fairies fanning me with their wings.",
  "When I came down I felt wonderful and went for a walk and was in love with the world.  This experience permanently changed me and ranks as the most important moment in my life. ",
  "As a side note, my sprained ankle was completely healed the next day.  It was definitely sprained prior to the trip as this was not my first sprain.  Also during the trip I kept my eyes closed as I was afraid that if my reality were distorted I might panic."
 ],
 "erowid": {
  "id": "7325",
  "citation": " Coyote. \"Castenada Visions: experience with Cacti (T. pachanoi) (ID 7325)\". Erowid.org. Nov 23, 2002. erowid.org/exp/7325",
  "substance": "Cacti (T. pachanoi)",
  "views": "13301"
 }
}
