{
 "id": 11740,
 "title": "Slime in My Veins",
 "date": {
  "submission": "2009-07-21T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "YS",
  "gender": "Female",
  "weight": "129 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "GHB",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Pharms - Alprazolam",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Clonidine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Hydromorphone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>An experienced drug user, I had been taking the drug recreationally for over 7 years when I became addicted.  I had used it alone, along prescription psychiatric drugs (antidepressants, anxiolytics) and/or other recreational drugs, on occasion (MDA, MDMA, Alcohol, Cannabis, Mushrooms, LSD, Ketamine).  At first use was of 'weekend' type, quite pleasant with no withdrawal symptoms to report.  I had experiences that I still bookmark as positive, productive shifts in thinking that would not have happened otherwise, and am thus 'grateful' to the product, I admit.  But for the most part, it became my worst enemy.",
  "Sometime a little over 3 years ago I noticed that I felt quite 'wrong' in the morning and that the only antidote was a dose.  Oops, indication of physical dependence.  And, trust me, this was light compared to what was to come.  I thought nothing of it, at the time, as I always had quite robust insomnia, depression and anxiety since my teens, so feeling wrong was somewhat normal.  Knowing GHB to be metabolically cleaner than some drugs, the new 'feeling' was quickly blamed on the last of frequent drinking binges. 'I'm getting older, I ought to mellow out', I thought.  So oblivious I was.",
  "A few months later I knew I was strongly addicted, needing up to 12 times 5ml doses daily, with strong benzodiazepines (Xanax) to smooth out my (short) nights between (or else no sleep at ALL).  Then I started to need anti-tachycardia (rapid heartbeat) medication. At first, these medications helped me taper off, and I thought I had curbed the addiction; but in reality, benzodiazepines are to GBH what methadone is to heroin: a replacement, not a cure.  And so, even with knowledge of addiction, pharmacology, chemistry and neurobiology (my field of studies), I was fooled into thinking I was 'safe now'. In fact, I had fooled myself to feel better and have a bit of hope how human.  I had to; by that time my activities were starting to be seriously impaired, I had lost all my friends and was completely broke.  But this false sense of security only lasted a week or so, and the scientist in me kicked back in.",
  "My original anxiety, has it turns out, seemed to have quintupled and was showing no signs of wearing off.  I was also experimenting memory, concentration and motor problems (tremors and imprecise movements, i.e. dropping things or unable to put on makeup).  The worse was probably feeling completely helpless when having to make the most trivial decision.  It required much larger amounts of Xanax than any doctor would ever prescribe to calm these symptoms, and since that much would have had me too drowsy to perform anything anyways.  Upon analysis, I concluded that the only logical way I could get through my upcoming midterm exams was to turn to my 'ex-friend' (now enemy), GHB, to finish my semester.  I felt the end justified the means, no matter how sick a move this was.",
  "And so I started having non-stop OD's (even DURING exams) from tolerance to the good effects.  I will have permanent scars from times I fell and cracked my head.  I even fell in the metro tracks!  To my surprise, my tolerance, although lowered after abstinence, quickly rose to the highest levels: and it did so every time I would clean up, only taking 2-3 days to reach the same peak it took 3 months to reach first time around. At over a dozen doses a day, alongside a few pharmaceutical to try and pull the brakes on excess Life became and still is a nightmare.  I have to carefully pack enough doses to carry on wherever I go.  Sometimes I would run out and it is like being a vampire having to run to my coffin before dawn.  Noteworthy is the fact that hallucinations can start only a few hours after the last dose, and these are of wicked and terrifying variety, not pretty visual patterns but vile organisms creeping under one's skin, for example.",
  "In my case they tended to be very tactile; I could touch slime wherever I landed my hands and would frenetically wash surfaces for HOURS until someone would physically take me away.  It might sound funny, but to me, the slime had to be removed or everything would melt away.  And as for my skin I thought that if the bright orange plates of necrotic materiel I saw under it were to touch my (now bright purple) blood vessels, 'something' would circulate around my whole body and EVERY cell would die.  Ever heard the term 'psychotic agitation'?  Well, here it was it all its glory.  I had to be under 24 hour supervision not to take a knife and tear my skin off!!!  I very quickly developed ticks (rubbing and pulling at my skin) that would have had me labeled as paranoid schizophrenic if I went outside.  In the same vein, my speech became incoherent, and tremors got violent: object would fly out of my hand, much like with Parkinson's.  Full on psychosis with non-stop panic attacks.  Since in complete psychosis, the only reason I know about my behavior in detail is because of a third party account.  I asked this person to watch over me as I attempted to detox.",
  "3 days deep into psychosis, my caretaker got really worried and true to his word did not call 911.  Instead, he lent me money and helped me get to my dealer's.  For he did not know what to do, and the only one that did was me.  So I had to get my senses back, if only to give up and go to the hospital.  After 2-3 days back on GHB I was almost calm again, but seemed to take forever for agitation to calm down.  Anyhow, I remembered an event from few moths back: a virgin to heroin (so no tolerance, maybe a key element), I snorted a gram (it was fairly potent by a regular user's account) over a few days.  Magically, during those days it did not even occur to me once to do any GHB, despite the fact that I had been addicted for a year at that point.  Anyhow, after the 3-4 day on heroin, I did not feel physically addicted anymore (I wanted GHB, but I was not at all shaky nor psychotic).  Later, life took its course and I wanted to get high and fell in the old trap soon enough.",
  "So here's what I decided to do: score hydromorphone. Even if I did become addicted to opioids and wanted out, the medical community knows what to do about THAT, and outpatient treatments are available.  Anything but psychosis; nothing can be as traumatic (for me, anyways).  Now, what follows had never been tried. I am not a medical doctor but a user.  However, since I find hospitals and detox clinics treatment deplorable, I will tell you what I found as alternate solution.  I am not yet clean, and I still have to see a psychiatrist about what to resort to for depression and anxiety once clean.  But this time around, I'm managing to bypass the psychotic features, and without huge dosages of drugs.  I started with 10mg of hydromorphone a day and am decreasing pretty much daily.  For tachycardia I take clonidine: I used (within days it went down) 0.3mg/day.  Xanax is a must; by itself, it simply replaces GHB, when hallucinating, I was using 6 mg a day and it still was not enough.",
  "But besides the drugs, I think that keeping busy is the most important part, which is why I systematically refuse being admitted to hospital (nothing to think about but your problem?).  In my case, and even if I end up skipping classes, I stubbornly, throughout my whole drug history, kept going to school.</p>"
 ],
 "erowid": {
  "id": "73186",
  "citation": " YS. \"Slime in My Veins: experience with GHB, Alprazolam (Xanax), Clonidine & Hydromorphone (Dilaudid) (ID 73186)\". Erowid.org. Jul 21, 2009. erowid.org/exp/73186",
  "substance": "GHB, Alprazolam (Xanax), Clonidine & Hydromorphone (Dilaudid)",
  "views": "9454"
 }
}
