{
 "id": 11759,
 "title": "Thru The Floor",
 "date": {
  "submission": "2000-10-18T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "domminnoe",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "The world seemed numb, fruitless. The roll had hit and I had boosted my euphoria with a half cap of ghb. The slow qualities of my roll could be attributed to the joint smoked in the club bathroom, or maybe the state of dislocated depression I was in before taking this cocktail.",
  "Time seemed fast, the night was almost gone. I walked around in half-dazed wonderment, every brush with a passing stranger was an intimate contact with pleasure.",
  "I was having a good time, but my emotions of depression, being away from home for so long and the prospect of further confinement in this land far away. Idly walking around, I enquired in the women's toilets for some menthol rub. I was coming down and needed a boost. Obtaining some, I rubbed it on my lips and under my eyes; the headrush was minor, but pleasing flashes of color wavered before my eyes briefly. Disappointed, I told of my need for something more. I was told there was an expert on putting people 'thru the floor.' Interested, I was led to the person, Alex; he was candyflipping, that is, he was bugging on acid and E at the same time.",
  "He agreed to put me through the floor.",
  "Stretching out on the floor, right there in the club, on my stomach, I put my trust in him and relaxed. People gathered around in a circle. Alex asked me to put my menthol mask on, and my sinuses were filled with its sweet, pungent vapor. I relaxed further and my eyes unfocused on the grainy floor. I felt my arms being lifetd by Alex, his grip strong around my mid-forearm. I was then lifted, just my head, shoulders, and chest off the ground. I tensed but was soothed by the urgings of Alex. I closed my eyes. My head was now hanging limp between my upstretched arms.",
  "Slowly, ever so slowly, Alex let my arms slide through his grip. I opened my eyes and BANG! I saw the floor rushing up to me and over my head, as each segment of my uplifted body contacted the floor the ground seemed to accelerate toward me. I felt my forehead contact the ground but still my arms were held high by Alex as they were stretched outward from my body, away from me.",
  "Finally, my arms were lain gently on the ground and they felt like they were stretching through the club and out the door, I felt big, I felt like I was a skydiver and the contact with the ground was merely wind resistance. Then my vision split into two orbs and spun away to each side of my head. The tiled floor warped around these two bubbles like refractions through a glass sphere. Once they had rolled out of my vision, normality seeped in.",
  "I rolled over, to see the faces of the people around me: 'Is he alright?' one person enquired of Alex, 'Yeah,' he says casually, 'I just put him throught the floor.'",
  "Getting up carefully, I went over to Alex and thanked him for the experience, which was amazing. His act of generosity and the fact that he used his skill for my pleasure for no reward gave me a real rush of gratitude and insight into the community and togetherness that E can give a person.",
  "It really changed my life, and I am thankful for it."
 ],
 "erowid": {
  "id": "733",
  "citation": " domminnoe. \"Thru The Floor: experience with Ecstasy, Cannabis & GHB (ID 733)\". Erowid.org. Oct 18, 2000. erowid.org/exp/733",
  "substance": "Ecstasy, Cannabis & GHB",
  "views": "7673"
 }
}
