{
 "id": 11761,
 "title": "Three Days Straight",
 "date": {
  "submission": "2008-11-07T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Holy Joe",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis - Hash"
  },
  {
   "time": "0:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "0:20",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam"
  },
  {
   "time": "6:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "11:35",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam"
  },
  {
   "time": "22:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "22:00",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam"
  },
  {
   "time": "32:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "32:00",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam"
  },
  {
   "time": "35:30",
   "amount": "3.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam"
  },
  {
   "time": "45:30",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "2C-I"
  },
  {
   "time": "45:30",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "2C-I"
  },
  {
   "time": "45:30",
   "amount": "1.0 mg",
   "administration": "oral",
   "substance": "Pharms - Alprazolam"
  }
 ],
 "report": [
  "Let me just say I am not terribly acquainted with psychedelics. I tried LSD twice when I was 20, and shrooms once also early 20-ies. Both accounts were not fun at all, crippling paranoia, allowed myself to get out of control. I have smoke/vaped cannabis for 10 years plus on a daily basis. So a few weeks back I get 2g of 2c-i, I have a precision scale and weigh out a 10mg dose at 5pm (Monday), Im already stoned off of some nice bubble hash, master kush.",
  "I feel the giggles like crazy in about 20mins as well as a nice rush, almost a sensation like being real talkative, but the shitty jitters like I get on shitty coke. I take 1mg of alprazolam, which sets in rather quickly. I feel comfortable but laugh with a friend who has also dosed with about 30mg at 5pm as well. The laughter carries on for several hours 8:30-9:00pm. He claims he sees pictures wavering and walls breathing, I see nothing save the room looks real yellow, even though the walls are white. I dont give much thought to this we carrying on until 11pm or so. I decide to take 20 more mg, via gel cap. My friend goes home. Within a hour I feel the rush I am wide awake and at ease. I Iay there until 4:35am (Tuesday) and then send an email that I will not be in work.",
  "I take 3mg of alprazolam and drift off until the phone rings at 10:45am (Tuesday) its my friend he wants to give it another go. Im surprisingly refreshed, I quickly drink an Ensure-plus 8oz, some V-fusion V8 juice 8oz fruit/veggie drink, take daily vitamin, selenium, B-complex, and a shit load of antioxidants & crystallized ginger. Wait 45 mins, at 11:30am take 30mg of 2c-I, eat 1mg of alprazolam, and smoke a bowl of my roor of some tasty master kush bubble hash. 1:45pm-ish (Tuesday) throw in some music listen and float for awhile.",
  "Around 2:30pm (Tuesday) I walk across the street to a golf course. It an over cast so there arent any golfers on the green. I wander slowly through the green noticing how amazing the different textures of grass were and how they changed in a swirling fashion, everywhere I look trees appear to have greater texture and sway and the bark look as though it is reaching out almost being drawn to me. 3:00PM-ish (Tuesday) I notice the small lake, and the ripples cause all kinds of shape shifting and bizarreness, even though the pond was complete still, save a 4-5 foot alligator swimming in my direction. I felt a sudden urge to charge him, and so I did. He seemed unimpressed with my aggressive gesture and continued to swim towards me, I had a hard time keeping focus on his head as it melted and morphed continuously before my eyes. He/she was only about 5 feet away from me and wasnt slowing his/her pace. I backed away slowly begining to laugh, at that point late 3:00pm-ish (Tuesday) I headed back to my place.",
  "I laid on my bed from 4pm-ish( Tuesday) eating Icy pop after icy-pop you know the flavored ice in those plastic vertical container, for literally 2hrs, 55 of them or so, no shit. It was like a compulsion I couldnt stop. Things continued to swirl. So 6pm-ish (Tuesday) I smoke another bowl of hash, lay and stare for another several hours enjoying the movement of the popcorn ceiling, seeing a smiling Mexican woman holding a platter of nachos. This amuses me as she seems to change her expressions at will, she seems to like me.",
  "Around 9:30pm-ish I take another 20mg of 2c-I and 2 mg of alprazolam. I lay there watching a trippy flick but cant concentrate. I get this overwhelming passionate desire to have some serious sex, late 10PM-ish (Tuesday). Im generally fairly sexually active with my gf, but these sensations were amazingly poignant. I threw on some porn and masturbated for well over two hrs and it felt amazing the pleasure just resonated through my body, once I had an orgasm, which really seems to happen like 15 times, but only one true orgasm that manifested itself by all the semen that seemed to be the most incredible and pleasurable sensation. Not trying to be crude or make anyone uncomfortable, this is the account that occurred.",
  "I lay there almost unable to move amazingly relaxed and giggle off and on for another hour. Mid 1am-ish (Wednesday) I take another 3mg of alprazolam, and stare at these pictures my kids colored for me, they move about and change colors this amuses me as I look around the room I find I can control the morphing and I see pastel colors all over my popcorn ceiling, I look closer and see gems, loads of them all over the ceiling. Late 3AM-ish (Wednesday) morning I drift off to sleep. I awake around 10AM-ish Wednesday morning. Drink an Ensure-plus 8oz, some V-fusion V8 juice 8oz fruit/veggie drink, take daily vitamin, selenium, B-complex, and a shit load other antioxidants & crystallized ginger.",
  "Okay, so round 11AM-ish (Wednesday) dose on 30mg 2c-I in orange juice, pound that, take 1mg of alprazolam. I sprinkle 20 mg 2c-i on top of some bubble hash and and blast the hell out of it in my roor (water bong) Jesus, that amped me up in no time flat and things are shaking, I cant focus on the TV abd all I can see are fuzzy rainbow colors covering the TV screen. Looks like some exceptionally shitty 80s VHS rip, I cant do this I wander outside to my screened patio around 12pm-ish (Wednesday) I have a nice environment setup for a free roaming green iguana and several free roaming hermit crabs and other indigenous critters that move about I sit down and watch the iguana, Ive never seen that shade of green, hes so beautiful! I wander over and slowly pick him up, hes not terribly keen on the notion of being held for to long, so I allow him to crawl on my lap. Hes several feet long and he is changing in size and form. He looks at me with his gold eyes and seems to be smiling. I talk with he, he seems to answer, or Im convinced hes speaking with me. I grow weary of this an go into the A/C ahh.. so refreshing, its about 2:30PM-ish and I lay on my bed and eat more and more icy-pops, until around 5pm (Wednesday) when my friend came over.",
  "We dosed 50mg each, took 2mg of alprazolam, and drank about 32 oz of water, and smoke a nice bowl of hash and some trainwreck. Around 6PM-ish (Wednesday) my friend and I drove to a local park/nature preserve. \r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "We began to walk the wooden walk ways that meandered through the Florida swampy tree and plant jungle. The Cypress trees in the water have bizarre roots coming up they morph and change as we look across the landscape the trees have so many different textures and the fungi and bizarre moss create an amazing show of color shifting, namely pink, so wild! Certain trees with certain fungi growing on them, seemed to be mainly Live Oak, had splotches of pink and reds, as we got closer to examine the pinks would change and morph, almost like a kaleidoscope, it to shades of red, but mostly pink, everything was alive on the river all the plants that were green almost reached out to me, and they were so beautiful and lush.",
  "We would wonder upon patches of bleach white mushrooms growing at the base of these cypress trees in the water, simply amazing. We wandered out of the park 8PM-ish (Wednesday), stopping so often to marvel at the colors on the trees and the plants growing on them and watching them grow before my eyes. The pine trees upon close inspection looked like they were layered with shinny scales, at the bottom it looked like what Id imagine dragon scales to look like, so cool. We continued on until we left the park. My friend drops me off at my place around 9pm (Wednesday) as we spent 45 mins driving around enjoying the tracers as the cars drove by, also noticing that the cars had a plastic look that morphed and changed before my eyes.",
  "I got home and took a shower, drink an Ensure-plus 8oz, some V-fusion V8 juice 8oz fruit/veggie drink, take daily vitamin, selenium, B-complex, and a shit load other antioxidants & crystallized ginger. 10:30PM-ish I take 2mg of alprazolam and smoke a bowl of hash. I lie on my bed and notice flashing little LED lights all over my ceiling; they are forming many patterns very quickly. I notice my eyes hurt, I close them and see a rush of thoughts translate into bursts of colors, I look at the clock 12:50AM (Thursday) I go into the bathroom and brush my teeth I notice how wispy the toothbrushes are they move as if the have wind rushing across them. I laugh; I wash my hands, as the water gets warmer the bathroom gets brighter and brighter. I look down and the drops of water in the metal sink, and they change before my eyes almost like chipped paint, the sink shifts and bends, the front of the sink cupboards are melting the marble floor is swirling and lifting into my face.",
  "I look at the clock it almost 2:15AM (Thursday). I lie down and pass out. I awake to my alarm at 6am, drink an Ensure-plus 8oz, some V-fusion V8 juice 8oz fruit/veggie drink, take daily vitamin, and selenium, B-complex, and a shit load other antioxidants. I feel a little weary, not too bad. I dress and go to work. Im exhausted, but not like a hang-over. I cant wait to get home to sleep. I get home (6PM-ish Thursday) and shower drink some water, then go to sleep. I awake in the morning and carrying on; felt a little off for a few days afterwards, with coordination kind stumbled sometimes, but have strived to eat healthy I really think the foods I was eating helped to minimize the potential damage. This may have been very wreckless, but I plan to try this weekly, once a week. Ill keep it at a 40mg dose as go from there"
 ],
 "erowid": {
  "id": "73302",
  "citation": " Holy Joe. \"Three Days Straight: experience with 2C-I (ID 73302)\". Erowid.org. Nov 7, 2008. erowid.org/exp/73302",
  "substance": "2C-I",
  "views": "4603"
 }
}
