{
 "id": 11786,
 "title": "Not Overwhelming",
 "date": {
  "submission": "2003-06-03T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Deviate",
  "gender": "Male",
  "weight": 109
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "leaves"
  }
 ],
 "report": [
  "This was my first Salvia experience and I thought that sharing it was in order. As with most things out there I was doing some research on the Internet about psychedelics and found a word that I have never seen before Salvia. This peaked my interest and I started to read countless things that are on the Internet about the substance. After feeling that this would be something for me to try out I ordered some dried Salvia leaves from a source on the Internet. I still remember the day that they came. I was all excited about the trip that would ensue that night. Calling a few of my friends that would like to try this out happened next, plus wanting someone to sit with me was a plus. When they came over that night we all talked about some of the effects of the plant, the trip one could take, and how important it was to have the right environment.",
  "After all the initial conversations, one of my friends kind of stepped up and asked to try it first. Loading the bowl of a water bong that we had, I covered how you should take a huge hit and hold it for 20-30 seconds. With this being said we sat down on the floor with many blankets/pillows, candle lit on a far away table, and nothing else on. My friend took as big a lungful that he could and held it. He then took another hit. At that time I asked for the pipe from him. He then started to say something and fell backwards onto the floor. I thought that he was just playing with us and making fun of some accounts we read on the Internet. No, in fact he wasnt.",
  "He was completely out of touch for around five minutes. He was mumbling about something during that time. Then after around five minutes he came back and started telling us how the ceiling was changing shapes and mild color/light distortions. He tried several times to get up with no luck. I tried to just get him to stay down and ride it out. He was sitting up in around fifteen minutes. After which he just reported to have a really good body buzz. I asked him what he had seen or done during that first five minutes and he couldnt remember. To him that time just didnt exist. He remembered handing the pipe to me and then talking about the ceiling.",
  "I was next person to try it. I did the same two hits that my friend did and laid back. I remember kind of falling into my couch that I was laying against. It seemed to just envelope me. Sitting there remembering what I had just smoked, it seemed like the world was just as it should be. Every thought was pleasant and had warmth to it. Similar to just having sex, then just laying in bed recounting how it all felt. The first few minutes ticked by and next came a nice comfortable feeling. Kind of like just completing something very special and the after glow was intense. This subsided in around 35-40 minutes.",
  "Overall the time I spent with Salvia was very well worth it. I have since tried it twice more and had different results every time. For me, the  experience has not been as overwhelming as some reports have told. There was never a sense of fear or worry about coming out of this. The dose that we had was small and maybe with a larger dose things would change. For now, just two hits were a good time and something I will experiment with more in the future."
 ],
 "erowid": {
  "id": "7348",
  "citation": " Deviate. \"Not Overwhelming: experience with Salvia (ID 7348)\". Erowid.org. Jun 3, 2003. erowid.org/exp/7348",
  "substance": "Salvia",
  "views": "4923"
 }
}
