{
 "title": "Too Much Too Early",
 "author": "weedsmoker",
 "citation": " weedsmoker. \"Too Much Too Early: experience with Cannabis (ID 11804)\". Erowid.org. Dec 15, 2004. erowid.org/exp/11804",
 "substance": "Cannabis",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "1 cig.",
  "smoked",
  "Cannabis"
 ],
 "report": "<p>Im writing this to show that set and setting are just as important as the actual dosage of any substance, in this case weed. If you are new to weed, then dont take it alone or in a setting in which you are not comfortable, and dont do too much.</p><p>Before this experience I had been high maybe 5 times. I hadnt been fully blazed, but pretty high, so I thought I could handle a little more than I was used to having. I had just started smoking but loved it already, so I bought 1/4 from a friends brother, who rolled it into joints. I was alone in my house after school and my parents wouldnt get home for many hours, so I figured I should go outside and toke up. I opened up the bag of joints and looked in, trying to pick the right one. One of them stuck out as it was huge, much larger than any of the others (I think there were 7 all together). So I grabbed that one and went outside to my deck.</p><p>It was getting dark, but still light enough for neighbors to see me, so I was a bit paranoid. It took awhile but I smoked the whole thing, even the roach. And I held in each hit for a good amount of time, trying to maximise my high. I was suddenly aware at how much I had smoked, and how little experience/tolerance I had to the drug, and worst of all, that I was all alone and beginning to become frightened. But I tried to fight fear, knowing where it would lead. I do not remember where I was at this time, but just a few minutes after I had finished I began to hear an odd noise...sounded like...water dripping. But faster. Much faster. It was so fast it stopped sounded like water dripping and began to sound like violin music. The violin got faster and faster and louder and louder, I couldnt believe what I was hearing. Then, suddenly, as if reality came back, briefly, I heard it was just a leaky faucet. The faucet wasnt even leaking fast, just dripping every few seconds. I had always heard about things like this happening to people and wondered what they must have been like, but it was not as fun as I had imagined it.</p><p>I was in such awe that my brain could exaggerate a simple sound to that extent, and make it so real. But it was scary more than anything, like I was losing my grip on reality. Then my mind started to race. Thoughts went through my head at such a speed, and it became very uncomfortable. Especially because these were paranoid thoughts mostly, ranging from a cop coming to my door to an intruder hiding in my closet. I then sat on my bed listening to the beatles, thinking that would calm me down. It didnt really calm me down, and it was then that I realized my heart was beating faster than I could remember it ever beating. This is where the experience took a turn for the worst and I became completely freaked out thinking I was going to have a heart attack. Then, my chest started to hurt. Then I became certain that yes, I was having a heart attack. It hadnt even been too long since I smoked the joint and this was already happening. It could only get worse, I knew, and I didnt think my heart could take much more of a beating (pardon the pun).</p><p>So I thought the only way to keep my heart from beating any faster was to keep absolutely still (the more you move the faster your heart beats). I lied down on my bed for hours waiting this out, the whole time thinking 'what have I done to myself?'. Time had slowed to a crawl and this amount of time took for what seemed like an eternity to end.</p><p>But I did not quit smoking. This was about 4 months ago and since then I have been smoking about twice a week, loving it every time. I have never had a bad experience like this before and I dont think I ever will. I was inexperienced and took a little too much, and even worse, did this with no one around. Paranoia can be intolerable with no one there to tell you your ok. I am certain my heart wasnt beating as fast as I thought it was, and those chest pains couldnt have been real. I really wasnt in any real danger, I just thought I was because I was not with people I know.</p>",
 "year": "2001",
 "id": "11804",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-15T08:00:00.000Z",
 "views": "5048",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
