{
 "id": 1181,
 "title": "Good and Bad",
 "date": {
  "submission": "2005-03-04T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Ali",
  "gender": "Male",
  "weight": "88 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "Mostly good",
  "I am now coming off the prescribed drug Paroxetine that I have been on for the past 6 months. I am now down to 10 mg a day, down from 20mg and am looking forward to getting off the train.",
  "Does it help?",
  "Yes, but it does have a twist. Confidence levels, happiness and contentment all rise and I have suffered no major problems.",
  "Although one concern with this drug is the effect it has when I am drinking. I am an urban professional with a good job, house etc. and an experienced drug user now living in Singapore. So you know that means capital punishment for drugs. I call this the biggest Betty Ford clinic in the world! Good for me anyhow.",
  "Do I recommend Paroxetine, yeah, I would as it has helped but it does put me in a Disneyland state and my friends and family have noticed a change in me so I have decided to stop. I changed from a shy bolshy individual to somewhat arrogant and careless. The pro's being I dont give a stuff what other people think which is not good when it is important that people think good of you! A paradox.",
  "So the end of it is, if you drink heavily like I do, Be Careful as not only do I make a fool of myself I can hurt myself by having an accident. E.g. waking up with a cut and bruise on my head as I think I had a minor fit, lying in a pool of piss on my hard tile bedroom floor. Not good.",
  "I dont know about any other antidepressants, this did help as it has made me somewhat less shy and I will now live a fuller life without this constraint. But I now have to get off it and plan to by the next two week. So now I get to deal with all the withdrawals I am apparently going to get. As for drugs in general. I do em on Friday to rest up before Monday for work, every other weekend to let my brain regroup, and dont do to many!"
 ],
 "erowid": {
  "id": "13443",
  "citation": " Ali. \"Good and Bad: experience with Paroxetine & Alcohol (ID 13443)\". Erowid.org. Mar 4, 2005. erowid.org/exp/13443",
  "substance": "Paroxetine & Alcohol",
  "views": "7210"
 }
}
