{
 "id": 11829,
 "title": "Words Are Not Enough",
 "date": {
  "submission": "2003-06-03T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tete",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "amount": "7 ",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(fresh)"
  }
 ],
 "report": [
  "there are just not enough words to describe the trip that i had with mushrooms, trying to put it in words would be to tell only a small part of the trip. These mushrooms are found in the state of veracruz, mexico, the city is xico a place near xalapa (capital of veracruz) they are commonly called 'pajaros' and ' san isidros' . the pajaros have a cone shaped form and are of a kind gold color when they are mature, the spores are dark purple. the san isidros are bigger and flatter, they are yellow with white at the ends, the spores are more or less the same color of pajaros. Both are found in cow manure and need first rain and then sun.",
  "i had this experience away from the city in open fields, with a great desire to walk and the places called me to recieve wisdom. i think that you dont need anything else(marihuana, xtc, lsd, etc.) the experience is totally personal. I went with a friend and after eating  5 pajaros we started talking (after about half an hour, we hadnt eaten in all day) and feeling a bit repelled with the artificial things we had (i.e. bottle of water, clothes, shoes,etc.) for a while we took out our shirts  and felt totally free!!! when we were on pajaros we ate about 7 san isidros, the effect of the first mushrooms went away (i dont know the exact time, and it wont really matter to you if you try them) after about another half hour the san isidros came to us... we didnt talk for about six hours i guess and just tried to listen and recieve what the mushroom told us (not with words but with pure feelings) its trully amazing how in peace you feel, you dont need food, words, tv, cds, anything!!!! when we were thirsty we found a river when we felt the sun bothering us we found a tree, she gave us everything. we felt nature, the earth was breathing, the sounds were clearer (and understandable!!!).",
  "if you try it, do it in peace with yourself and the mushroom (specially with her!!!), and eat just the ones you find just walkin, dont search too much, theyll find you... once you are in them eat carefully because theyll have effect till later and theres no turning back. she will punish you if you dont have her respect, its like a mother, in fact here in mexico we call them mother mushroom and grandfather peyote. i think thats all i have to say... when you do it (if you do it) try to leave words behind, dont talk to your friends (if you are with any, it would be better by yourself but not the first time) and let nature pass her wisdom to you. i think this are things that change your life for ever, do not try it too much, i think that with one (at most two) times a year it is enough. ive tried several chemicals and none will do the same (lsd, xtc, ketamine) and dont use marihuana ( i didnt do it but believe you are just perfect with mushrooms alone).",
  "just try to learn, it is not a recreational thing... let all things that were not natural aside (language, radios, etc.) and feel a complete divine experience.",
  "bye",
  "ps a funny thing is that cows know when you are on mushrroms, i cant explain it but they stare at you, even when the effect has 'gone' (because it never goes completely away) :) i think they know you have eaten mushrooms they 'make'"
 ],
 "erowid": {
  "id": "7377",
  "citation": " tete. \"Words Are Not Enough: experience with Mushrooms (ID 7377)\". Erowid.org. Jun 3, 2003. erowid.org/exp/7377",
  "substance": "Mushrooms",
  "views": "7252"
 }
}
