{
 "title": "Up, Down, Good Vibes, Bad Vibes",
 "author": "Y.U.",
 "citation": " Y.U.. \"Up, Down, Good Vibes, Bad Vibes: experience with MDMA (Ecstasy) (ID 11825)\". Erowid.org. Dec 3, 2004. erowid.org/exp/11825",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "130 lb",
 "report": "<p>My friend and I decided to buy ecstasy one night. We bought two yellow UFO pills. Since it was her first time, she only did half, and I did mine and her other half. At first, we thought they were kife(fakes) because they took so long to kick in. About an hour later, I started to rise, it was like my life was just vivid, and bright. My friend and I were giving each other hand massages, talking about life, philosophy. I felt like she was my best friend, my only friend. But someone else came into the room, someone who was not on E, and I felt the worst vibes from him. It almost scared me. I felt dread in my stomach, and I just asked him to leave. But the bad vibe clung to me.</p><p>Around the 3 hour mark of being high, I started getting really hot and sweaty, and I went outside for a little bit. It had just started snowing, and the sun was rising. The snow was glistening, untouched, and it was the most beautiful thing I have ever seen. My trip lasted for about six hours, and then I started sketching out really bad. As my trip neared the end, I got a feeling of bitterness wash over me. I didn't want it to end. I had the worst crash, I didn't cry, but my friend did. She was holding her head, asking why she felt so bad, why did it have to end. We went to the coffee shop around the corner, but all I felt was bad vibes, and I just wanted to go home and sleep. I couldn't sleep all day, and I still felt horrible the next day. I was very depressed for a few days, but then I was fine again. I guess those are the up's and down's of doing ecstasy.</p>",
 "year": "2001",
 "id": "11825",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2004-12-03T08:00:00.000Z",
 "views": "5752",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 }
}
