{
 "title": "Drenched in Visuals",
 "author": "Geesh",
 "citation": " Geesh. \"Drenched in Visuals: experience with 5-MeO-DiPT (ID 11830)\". Erowid.org. Feb 15, 2002. erowid.org/exp/11830",
 "substance": "5-MeO-DiPT",
 "bodyweight": "130 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "15 mg",
   "oral",
   "5-MeO-DiPT",
   "(powder / crystals)",
   " T+ 5:00",
   "1 bowl",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I am not what I would call an experienced tripper. I have tripped on mushrooms 3 times, DXM 4 times, salvia twice, E once, and AMT twice, but I would not call my AMT experiences, they just consisted of a very minor mood change, and a significant headache. My largest AMT dose was 42 mg, which for most people is enough for a significant experience. Due to this tolerance I guess you would say, I decided to take a slightly larger dose than most people for the foxy. The scale used is not accurate to .001, but I do know that my dose was somewhere around 15 mg.</p><p>I decided to trip by myself in my room after my parents went to sleep. I had a capsule with the foxy and some loperamide in it due to the many reports of diarrhea. I think this helped a lot. I took the pill at 10:30 PM.</p><p>T + 7 min: Already feeling first alerts. I was somewhat concerned by this as I do not like overwhelming experiences. Nothing big yet, but definite pre-trip feeling.</p><p>T + 11 minutes: Already seeing edges undulate and wave. I was started to get scared that I might have taken a bit too much.</p><p>T + 15 minutes: Full blown OEV's at this point. Very much like I hear acid described. Many colors, and the 'breathing' effect. I begin to feel a sense of panic inside me. I am shooting up rapidly</p><p>T + 30 minutes: The come up is very uncomfortable and it comes in large spurts. Right when i think I am beginning to level off, I shoot up a knotch. The auditory effects are very interesting. Not only do I notice a chage in pitch, but full on auditory hallucinations. I would be lying in bed and start to hear typical jungle noises as well as sounds of the city (ie. crickets, tigers, cars, conversations, bells ringing). Everytime I would shoot up higher, the auditory hallucinations would go with it. I would feel OK, then I would start to hear more and louder things very rapidly and it became more and more intense till finally it leveled off, but would then start again.</p><p>T + 45 minutes: The body load is very uncomfortable, I can feel a very distinct energy in me. I made a call on the telephone, and the dial tone sounder very strange, a LOT lower than normal. The open and closed eye visuals are amazing, patterning, tracers, typical psychedelic, but with a unique feel. I am still coming up.</p><p>T + 75 minutes: I feel I am finally peaking, thank god. This is too much for me to handle. There is some disassociation and a lot of panic. The visuals are amazing. To me, foxy feels a lot more like what I have heard 2ct7 described as. I can definitely see where the name foxy comes from, there is definitely and erotic component to it. I also feel muscle spasms everywhere in the body, though they are not unpleasant, they actual feel kind of good. The spasms actually go along with the nature of the trip, very sporadic.</p><p>T + 3 hours: I finally feel like I am beginning to come down. This makes me feel a little relieved. Music is extremely weird to listen to, I wonder 'How can this be the normal music I listen to every day?' The visuals are still going strong, but the buzzing energy in my body is beginning to subside.</p><p>T + 5 hours: I am pretty much down. There is an afterglow and some visuals still. I decide to smoke a bowl which brings all the good components of the trip back, but not the body sensations. Sleep is very difficult and I don't imagine it would have been possible with out the weed. I finally get to sleep at 6:30 AM.</p><p>Overall I think is can be a great substance. I just took to large of a dose. One thing I noticed was that I had to pee about every 15 minutes, which got very annoying after a while. I was surprised with the visuals because most reports dont mention much about them, although there are a few which describe immense acid-like hallucinations. This chemical has extreme potential for me. I like it more than mushrooms. I imagine a dose around 7-8 mg would be much more enjoyable. Can't wait to try it again.</p>",
 "year": "2002",
 "id": "11830",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-15T08:00:00.000Z",
 "views": "7203"
}
