{
 "id": 11837,
 "title": "A Family's Journey",
 "date": {
  "submission": "2011-03-07T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "TheMysticSeeker",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "report": [
  "My first experience with Salvia was strange, scary and amazing at the same time. I took one hit at three one hour intervals. Each time, I had the same trip. It was very puzzling.",
  "My first hit, I suddenly lost normal consciousness. I did not expect such a sudden blast out of mind. My fiance said I just kind of slumped over. I sense a rolling up of all my perceptions, as if my person was wound up and unrolled into another person's consciousness. First things became dark.",
  "When the lights came on, I was a giant child, and my giant father, giant mother and giant sister were saying, 'Hey, come on! Are you coming with us?' I was this giant little boy, who looked something like me, who was being awakened in his giant bed. Then I had this feeling that I was on this father's giant shoulder. At times I was a person riding as he took giant steps, where I can't even see the ground or the horizon, and at times, I was his flowing hair.",
  "After I came to, my fiance was very scared and terrified about my reaction. I took my dogs out for a walk, and my dogs were very happy, unusually happy and playful around me. That was odd.",
  "Then, my fiance and I took a hit together, but it was measured, careful. She experienced playing in a cosmic playground, while God was babysitting. I again heard the voices 'Are you coming with us? Come on. Let's go.' I also felt the sense of sitting on a giant's shoulder while he slowly plodded along some path. I came to and felt moved somehow.",
  "An hour or so went by and I took another very big hit. I immediately heard the voices asking me if I was coming with them. This time, I saw the face of the giant father, and my fiance later told me I was screaming out loud in slow motion, 'Ahhh...rrrrrrrrr.e YYYYYY....ooooooooou Taaaahhhhhllllkin toooooooo Me? Yaaaaaahhhh IIIIIII'mmmm taaahhhhhkin tooooo Yoooouuuu. Whooooooooo doooooo youuuuuuuuuuu thhhhhhhhiiiiiiiinnnnnnnnkkkkkk IIIIIIIIIII'mmmmmmmmmm taaaaaaallllkkkin toooooooo?' ",
  "Apparently I started talking nonsense, but I remember asking where are we going. I didn't get much of an answer. It was like that was a really stupid question, of course I have to know where we're going.",
  "I have no idea where we were supposed to be going. I can only speculate, because after each of these hits, these giant beings were going somewhere, and were held up by me. Each time they were trying to get me to wake up from my prior sleepy state (wake up from what I am now), but since it was difficult, and I couldn't fully wake up there, I was just carried on his shoulder.",
  "My fiance is a very insightful natural shaman priestess and really hates drugs. But she plays along with me. She believes all these states are readily available to us in our current body mind existence. She believes we can take these drugs, but only enough if it helps us sense the spiritual realm, but not so much that we lose our bodies. She believes the superior experience of the cosmos includes both our minds and our bodies. She hates it when people use substances to abuse themselves. It shouldn't feel like dying or traveling to the home for spirits. It should feel like playing in the cosmos, according to her.",
  "No doubt, salvia is the strongest hallucinogen in the world. Good thing it's short lived, and non-toxic. I've tried them all, but none had much of an effect. This one is really really powerful. It put me in direct contact with the spiritual world. So the state of my spirit determined the quality of my experience. If one is not living well, it could put one in a hell experience.",
  "Salvia is not for the faint of heart; nor for the recreational user. It is a serious spiritual substance and should only be consumed in a setting of reverence, and careful prostration to the almighty Creator, the Cosmos, the Father, the Mother."
 ],
 "erowid": {
  "id": "73809",
  "citation": " TheMysticSeeker. \"A Family's Journey: experience with Salvia divinorum (ID 73809)\". Erowid.org. Mar 7, 2011. erowid.org/exp/73809",
  "substance": "Salvia divinorum",
  "views": "1922"
 }
}
