{
 "title": "Like Entering Another Dimension",
 "author": "Seraph604",
 "citation": " Seraph604. \"Like Entering Another Dimension: experience with 4-Acetoxy-DET (ID 11849)\". Erowid.org. Jan 14, 2002. erowid.org/exp/11849",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "",
 "report": [
  "<p>[b]12:37am[/b] Ingested approximately 15mg in a capsule. Sitting down in front of the computer to do some surfing while I wait for the first effects. It might also be worthwhile to know I had some snacks about an hour and a half ago. So, stomach is not empty.",
  "[b]T+0:06[/b] Think I'm starting to feel the first effects now. Visual field has started to get some minor distortions. Headspace has changed a little bit as well. It's too early to tell in exactly what way.",
  "[b]T+0:19[/b] some slight nasuea noticed.",
  "[b]T+0:23[/b] Very much in a different headspace now. Concentrating on the monitor is difficult. Think I will have to leave the computer alone for a while.",
  "[b]T+2:00[/b] Back at the computer for a while. Very complicated state of mind. Very intricate thought patterns. Quite introspective but I have no difficulty talking and expressing myself, quite the opposite. Very beautiful. Can almost taste colors. Music is wonderful. I'm wondering how to accurately describe the experience. I'm coming up short. It has to be experienced first hand.",
  "[b]T+2:50[/b] Came back from a walk outside and sitting by the pool. There are some water fountains by the pool that created a beautiful soundscape that I could see when I closed my eyes.",
  "[b]T+3:50[/b] Pretty much back at baseline.",
  "[b]T+4:15[/b] Going to bed.",
  "All of the above was written during the experience and now I'm writing the day after. It was truly an amazing experience. In the time between 1:00am and 2:28am I spent most of the time sitting on the couch and admiring the visuals and enjoying the experience. Shadows were flickering and oscillating. Objects were morphing and vision was fish eye like.",
  "Closing my eyes was like entering another dimension in which all that defines ordinary reality didn't exist. Felt very much at one with the universe. When I closed my eyes I could feel myself dissolving, twisting, morphing and turning. All in a very wonderful way.",
  "Somewhere in the middle of the experience I caught myself thinking that there is no possible way anything could feel better than this. I haven't felt that way since the very first time I tried MDMA (which was my first substance of any kind).",
  "I didn't notice any of the side effects mentioned so far. There were some minor muscle spasms but they were barely noticable. Before I went to bed I felt almost completely back at baseline. I was able to go to sleep within an hour and woke up well rested.",
  "This will definitely require some further investigation. I'd have to agree with a previous poster, seems almost too good to be true.</p>"
 ],
 "year": "",
 "id": "11849",
 "views": "16313",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DET",
   "form": "(capsule)"
  }
 ],
 "submissionDate": "2002-01-14T08:00:00.000Z"
}
