{
 "id": 11844,
 "title": "Not Worth the Risk",
 "date": {
  "submission": "2011-02-15T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SpeedyMcGee",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "210"
   },
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate"
  },
  {
   "time": "1:15",
   "amount": {
    "unit": "mg",
    "quantity": "30"
   },
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "1:50",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.] ",
  "I did about a box of ccc every two months or so. Never really experienced a bad time with them either. I had a day off from work and 8 30mg pills left and decided that today would be a good day to trip. I have a very fast metabolism, I'm 125 with very little body fat, so 8 or 9 pills was usually enough for me.",
  "00:00 - I take 7 of them. I take a short drive to a buddy's place.",
  "01:15  I'm feeling the pills kicking in, I take the 8th one.",
  "01:50 - I end up with a bowl of weed to myself somehow so I start rippin in. Smoked almost the whole thing and just sat back for a few mins. It didnt take long to start feeling like something is wrong but I brushed it off. I'm walking around and talking trying to get my mind of it but I start to feel light headed so I pop-a-squat and just close my eyes.",
  "02:10 - This is when I really started to trip out. I was having some very intense but pleasurable closed eye visuals when something catches my attention and I stood up. My heart is fucking POUNDING. I'm getting really nervous and cold. I cant hear my voice as well. I never in my life thought my heart could beat so fast. I'm trying to drink as much water as possible. I tried lying down but it didnt calm may heart beat down. When I get up I realize my vision is getting dark, pixalated and then tunnel vision. I started having hallucinations of me dying. I'm screaming for my friend telling him how scared I am. I try to hold a conversation with him to calm down but I'm fading in and out.",
  "03:15 - Somehow I survived an hour of hell. I'm starting to get a grip on reality but I am still very uncomfortable. My friend and I begun playing some games to help my mind get back.",
  "04:45  I'm now stable and convinced I will never do ccc again.",
  "Its been 18 months now and I still get very intense flashbacks of that horrible day. I feel like my friend was the only reason I was able to make it through that whole nightmare."
 ],
 "erowid": {
  "id": "73861",
  "citation": " SpeedyMcGee. \"Not Worth the Risk: experience with DXM (with CPM) & Cannabis (ID 73861)\". Erowid.org. Feb 15, 2011. erowid.org/exp/73861",
  "substance": "DXM (with CPM) & Cannabis",
  "views": "3932"
 }
}
