{
 "id": 11840,
 "title": "At Peace with Myself",
 "date": {
  "submission": "2009-11-27T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "LotusFlower",
  "gender": "Male",
  "weight": 58
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(capsule)"
  },
  {
   "time": "1:00",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "5-MeO-MIPT",
   "form": "(capsule)"
  }
 ],
 "report": [
  "I decided to try this tryptamine during the Boom festival 2008. I bought the material from an on-line vendor and I measured the weight with a 0.001 balance. My past experiences with drugs include mdma, lsd, psilocibin mushrooms, dmt, 2cb, methylone and bzp.",
  "I took 5 mg of 5-meo-mipt in a gelcap at about 11 a.m. I was very curious to try this material: the reports I found online made me very interested about it. A very good friend of mine was sitting for me. After about 1 hour I could feel just a mild +1, so I decided to take 5mg more. After about 30 minutes I started to feel a soft mdma-like effect. Then we moved toward the lake and I washed myself in the water. After the bath, I did lay down and when I started to see the sky I noticed beautiful fractals in the clouds. I also felt full of joy: I was smiling in front of such a beauty. I kept watching at the sky for about 20 minutes. Then we decided to go to the dance floor. When we arrived, the impact of the psy-trance music was fantastic. I started to dance, feeling very good. The empathy toward the people around me was very clear, but not strong and deep as with mdma.",
  "After one hour we went back near the lake. There I met some friends of mine. When I started to talk with them I notices a little bit of difficulty in keeping concentration, in the same way I would under the effect of a small amount of lsd. After a while I decided to lay down on a mat to enjoy the last part of the experience. After a couple of minutes another friend of mine came to me and we had a very nice connection. She took my hands and we exchanged some very gentle caresses. Then she gave me a kiss at my forehead and she went away.",
  "I spent the last part of the experience feeling very well, at peace with myself. The experience did last about 4 hours.",
  "Conclusion: my opinion is that 5-meo-mipt is a very interesting material and it could be used in psychotherapy. I definitely will take it again."
 ],
 "erowid": {
  "id": "73830",
  "citation": " LotusFlower. \"At Peace with Myself: experience with 5-MeO-MiPT (ID 73830)\". Erowid.org. Nov 27, 2009. erowid.org/exp/73830",
  "substance": "5-MeO-MiPT",
  "views": "7349"
 }
}
