{
 "id": 11856,
 "title": "Aces Adventure",
 "date": {
  "submission": "2010-05-04T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Daytripper",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder / crystals"
  },
  {
   "time": "1:00",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DiPT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "[Erowid Note: 80 mgs of 4-Acetoxy-DiPT is considered a very high dose, see 4-Acetoxy-DiPT Dose Chart]",
  "Intro:",
  "I had first heard about 4-acetoxy-DiPT by reading just about every trip report on the net and was intrigued by the effect users had reported at higher doses between 30 and 40 mg. Many individuals reported shroom like effects without the mind fuck typically associated with psilocybin. At the time I didnt have a connection for this chemical but had tried other RCs such as 2C-I, and Methylone and didnt really enjoy them because I found the effect to be far too stimulating for my taste. I also used to be a big fan of MDMA and other stimulants but these substances now give me extreme anxiety and panic attacks. Mescaline is really the only psychedelic Ive found worth wile but the duration is a bit too long for most occations, so I only use it about once a year.",
  "A very reputable vender I use begin distributing 4-acetoxy-DiPT and I jumped at the opportunity to acquire some.  I used 4-acetoxy-DiPT at doses of 10, and 20 mg but these doses produced little visual effect and for the most part just a relaxing body high. I consider myself a light weight when it comes to most drugs so it was a bit surprised that it took me 30 mg of 4-acetoxy-DiPT to produce any kind of profound experience.",
  "Trip day:",
  "I hadnt planned on tripping but had woken up late for work and decide to call in sick. It was a Friday and I knew I wouldnt have missed much if I staying home. I remember my 4-acetoxy-DiPT and thought it would be a perfect day to go hiking at a local mountain. I sometime like to go on sole adventures, which I find good for my mental wellbeing. I packed some supplies and brought two gel caps filled with 40 mg of each. I took one and headed on my way to go hiking. It took me about an hour to get there which is typically how long it takes for me to start feeling the first effects of this chemical. I begin thinking maybe my chemicals had degraded over time and I decided that I should take the other 40 mg capsule to make sure I had a strong trip.  I was defiantly wrong and the chemicals hadnt degraded very, much if at all.",
  "I set out hiking down a trail I knew the trail quite well which lead up to a small mountain that overlooked the entire town.  The trails werent well defined because they had previously been used for logging and in places they lead off in all directions. It took me about an hour to reach the top of the mountain at which point I started feeling tingling in my legs. I think this may have been partly from the drugs and partly from the hiking. I sat up on top of the mountain for awhile and admired the view drinking water. I also smoked a cigar I had brought with me. Even though it had been two hour since I had first ingesting the first dose of 4-acetoxy-DiPT I was only feeling minimal effects.",
  "After sitting for 20 minute I began tripping very hard. I couldnt see more than 20 feet in front of me and all the trees and foliage were waving much more significantly that they would have been if the wind was blowing them (trees begin waving in all kinds of crazy ways). I immediately decide I needed to head back down before things became much more intense that I planned. I was heading back at a fast past almost getting lost several times on the way down but never too far off from the direction I had intended to reach. At one point I begin peaking and didnt have a clue where I was. I begin freaking out for about 5 minute thinking I was surely going to die and nobody would ever find my body. I collected my self and begin heading in the direction that looked most promising. After ten minutes I came out of the woods exactly where I had started. ",
  "A rush of relief came over me. I was still peaking harder than ever before, (including a massive mushroom trip I had take years earlier). Visually I was overwhelmed with the beauty of the hallucinations, now that I was able to enjoy them. The most amazing colors I have ever seen were everywhere and looking up at the sky produced an effect that looked like a crystal kaleidoscope arch suspended miles above (it was an overwhelmingly euphoric experience). I walked around up a few other trails, but not far enough to get lost again. Roots and leaves on the ground begin growing and changing to amazing colors right before my eyes. The scenery looked like something from a Vincent Van Gogh painting. If only I could have taken a picture because the images were priceless.",
  "After about 6 hours most visuals were completely gone and I went home, my head filled with the images I was bless to have experienced. I was completely back to baseline with absolutely no hangover effect. I actually went out later that night feeling as if none of this had ever happened. I defiantly wouldnt recommend taking such a large dose of 4-acetoxy-DiPT because this substance tends to affect everyone in vastly different ways but for me this is an experience I will never forget. I also wouldnt recommend going on an adventure into the wilderness alone because of the obvious dangers that could result. I consider myself a survivalist I dont feel I was ever in danger despite the fear I experience during my adventure.",
  "Sep 2008"
 ],
 "erowid": {
  "id": "74018",
  "citation": " Daytripper. \"Aces Adventure: experience with 4-Acetoxy-DiPT  (ID 74018)\". Erowid.org. May 4, 2010. erowid.org/exp/74018",
  "substance": "4-Acetoxy-DiPT ",
  "views": "4418"
 }
}
