{
 "title": "Something good",
 "author": "77K",
 "citation": " 77K. \"Something good: experience with 4-Acetoxy-DET (ID 11851)\". Erowid.org. Jan 14, 2002. erowid.org/exp/11851",
 "substance": "4-Acetoxy-DET",
 "bodyweight": "",
 "report": "<p>t+0:00 - 18 mg in a gelcap, mostly empty stomach.</p><p>t+0:13 - notice gastrointestinal sensations, very slight.  slight skin sensations.  seems to be evolving quickly. (Indeed, it did evolve quickly.  Psilocybin, even mushroom tea, is fast, but this is faster and it was in a gelcap (~5 minutes to dissolve)).</p><p>t+0:18 - slight tremors, or maybe I'm just chilly</p><p>t+0:25 - longer afterimages when I shut my eyes.  muscle twitching is not due to cold (I was under a blanket) - not bad at all.  smoothly devleoping.</p><p>t+0:30 - visual effecst starting - contours of color, contours of shadows, nature of shadows.  music: the Orb, U.F. Orb</p><p>t+0:31 - muscle tremors slightly irritating</p><p>t+0:40 - chills</p><p>t+0:45 - yawning, like psilocybin (but the yawning didn't last more than a few minutes, unlike psilocybin)</p><p>t+0:50 - definite body blurring when I shut my eyes.  becoming harder to write.  vibrating colored fringes at the edges of vision.</p><p>t+1:06 - eyes closed, dark but large space.  seems to be hanging on the edge of something very good or interesting.</p><p>t+1:20 - is anything else going to happen?</p><p>t+1:27 - maybe a wave of something more interesting</p><p>And at that point I stopped taking notes, because I felt like I would be able to remember what happened from that point on.  The experience evolved, but did not intensify or change to anything notably different.  It was like psilocybin with fat training wheels.</p><p>At about t+2:00 I put on Beethoven's Ninth Symphony.  I had not listened to this for many years and I had never heard it while altered.  I also started smoking cannabis.  I had a great time listening to the music, and I recognized the standard psychedelic music effects I know and love, but I just could not let the music take over my mind; the 4-AcO-DET would have none of that.</p><p>Ah!  I just thought of another phrase to describe this experience: 'insight-free'.  There wasn't really introspection; in fact, there wasn't any extrospection either!  (I hope this changes at a slightly higher dosage.)</p><p>Despite its seeming lack of real substance, I was in an excellent mood for the whole experience.  Not a euphoric mood; simply a mood where nothing negative entered my mind and I interacted with other people on good terms and enjoyed the thrill of exploring something new.</p><p>4-AcO-DET is very quick and unusually smooth.  It was noticeable after 15-20 minutes and seems to peak by t+1:10.  And it is clearly on the way down by t+3:00 to t+3:30.  The transitions between stages, and the trend of the whole experience, are quite comfortable.  This fast and friendly chronology could be a definite plus for both personal and therapeutic use.</p><p>There is something very good about 4-AcO-DET, I'm just not quite sure what.</p>",
 "year": "",
 "id": "11851",
 "gender": "Male",
 "timestamp": "2002-01-14T08:00:00.000Z",
 "views": "12085",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "4-Acetoxy-DET",
   "form": "(capsule)"
  }
 ]
}
