{
 "id": 11862,
 "title": "Amazing, But It Didn't Feel New",
 "date": {
  "submission": "2001-06-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "That Dancer Girl",
  "gender": "Female",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "A few monts ago I decided that I wanted to try extasy, should the opportunity present itself.  I wouldn't go searching, but I would be open to it.  My boyfriend had a week off this week, and suggested that he get some pills and we have an art day.  I made arrangements so that I could disappear for the day and turn off the phone.  (I've discovered with pot that I internalize alot, and didn't want to be thinking about ANYTHING else other than the experience.) ",
  "He insisted that I research experiences on the erowid vaults, and I was really glad I did.  My nerves were calmed by having some sort of an idea of what to expect.",
  "I took the pill at 10:00AM and we decided to go get coffee and sit and chill for a while.  I was STARVING and ordered a bagel (despite the warnings that I wouldn't want it in another 15 minutes).  We were sitting on couches, chatting, watching people and I kept waiting.  But it wasn't anxious, it was just a soft feeling of 'I wonder when it'll happen'.",
  "I kept looking at the people, and all of a sudden I knew it was coming.  (This was about 10:30) A few seconds later I felt a washing feeling of warmth over my body.  I felt a slight vertigo as if I was falling gently backward in a semi circle.  But it wasn't a surprising feeling at all, I felt that the feeling was extremely familiar. He asked to see my eyes and asked how I felt, and I was aware that I felt GOOD and very giggly.  Just happy and giddy and REALLY excited to be sitting on a big comfy couch.  He put his arm around me and just rubbed my hands and my hair.  It felt so content and mellow.  And I sure didn't want that bagel.  I got really cold at one point, but a sweater cured that. ",
  "After a little bit he suggested that we go somewhere else.  Which was good because I was VERY stuck on that couch.  As soon as we were outside I was excited to be moving on the street, as the movement felt more like floating and really fulfilling.  But once again I felt that this was a place I had been before...I have felt that excited at life before, but this time it seeemed like it was more pure.  ",
  "Then he pointed out a siren and I stopped in the middle of the street and listened and looked at him, and I felt as if we were the only two people on earth and it was spinning around us.  But it was if the way I feel about him on a regular basis was suddenly free of the bullshit of daily life and I was suddenly allowed to just love him freely.  I just wanted to stop and be there together...I wanted him to be where I was at but I felt that he wasn't so we kept walking.",
  "We walked but it was really hot, and so we decided that we should go somewhere.  I really felt a strong desire to lay in the grass and people watch but he wasn't there with me.  (We would've had to drive and find parking and it was way too hot anyway).  I was bummed for about 3 seconds.  I just didn't want to be in transit.  I wanted to be somewhere.  So we got in the car and I layed in the seat all the way back and he put on electronic music for me.  (It all of a sudden made sense). ",
  "We went back to his house and just got naked, mostly for comfort.  The skin to skin touch was amazing, We started playing with our bodies, and eventually started having sex.  OH MY GOD.  People supposedly say that sex and extasy don't mix.  I totally disagree.  Perhaps it's because I'm an extremely sexual person by nature, so to go to that place is very comfortable for me.  We had sex continually for over 2 hours.  It was amazing.  I kept feeling like I would have an orgasm, but never did, but didnt' feel bummed about it....I just wanted to feel the way I was feeling.  It was unihibited and animal but at the same time tender...Uhhhhhh.  We had music on and at one time I realized that I was moving my body with the music, but not to the music.  I wasn't even aware of it.  It was as if the music came into my body and moved it around. ",
  "But every once in a while (and I think it was when I was rolling in) I would feel like I needed more than just physical affection, and really longed for him to be tender and loving.  I would feel myself becoming a little preoccupied with being in a different place than he was, or feeling more intense feelings that he was.  It was a softer version of the paranoia I get from pot, and instead of feeling nervous about it, I just felt aware of it.  I just wanted to look in his eyes because the love I felt inside needed to be reciprocated to be realized.  I would start to internalize but it didn't upset me.  And I knew that emotions were running high because of the drug, so I didn't get too preoccupied with it.  Then it would pass.",
  "We smoked some pot and layed around.  That really mellowed me out even more.  It dulled my extreme feelings and made me totally content with touch and sleep.  I kept drifting in and out of consciousness, and I just felt soooo relaxed.  We eventually got up and showered although I was very hard to motivate.  I felt like I wanted to be in the couch forever.  (And I felt aware that on a regular basis I would get up if he said so just because, but i was too relaxed to care and definitely made him MAKE me get up.)",
  "We went and picked up a friend and drove to our respective activities for the night.  Was I mellow.  It was rediculous.  I was so zoned out, and really felt completely wiped out.  But I drank a large coffee and went to my rehearsal.  Now at this point it was definitely way over, but I still was very aware of those feelings.  Not the physical affects, but the feelings.  My rehearsal was very content and I loved talking to the people there that I didnt' really know very well.  And it was a very touchy rehearsal, and I was still digging that.  (Although I very much enjoy touch on a regular basis, but suddenly I felt very aware and unapologetic for it).  Afterward, a friend and I sat outside and smoked some more pot, and it just felt good.  But tired.",
  "I woke up today and didn't feel bad.  A few times yesterday toward the end I felt down, but it passed quickly.  But I'm realizing that what seems to be most affecting me is my interactions with him.  When I realized that I wouldn't see him all day, I got VERY down.  But being very self aware and knowing that depression can follow, I'm not going to let that disappoint me. But what I've kept with me is the amazing way that I felt walking down the street, and talking to people, and that seems to keep picking me back up.  And since its something I've felt before, I feel like I can definitely recall it without extasy.  (That's not to say that I'm done with it.....)"
 ],
 "erowid": {
  "id": "7409",
  "citation": " That Dancer Girl. \"Amazing, But It Didn't Feel New: experience with MDMA (ID 7409)\". Erowid.org. Jun 14, 2001. erowid.org/exp/7409",
  "substance": "MDMA",
  "views": "8419"
 }
}
