{
 "title": "Can You 'Trip' on Weed?  I Think So!",
 "author": "Mizuke",
 "citation": " Mizuke. \"Can You 'Trip' on Weed?  I Think So!: experience with Cannabis (India Kush) (ID 1186)\". Erowid.org. Apr 18, 2001. erowid.org/exp/1186",
 "substance": "Cannabis (India Kush)",
 "bodyweight": "155 lb",
 "report": "<p>As all smokers tend to be, I am very close friends with the people I would describe as my 'connection' for obtaining marijuana.  This relationship has several benefits, not the least of which is getting in on some killer strong dope whenever it falls into my friends' hands.  This experience pertains to just such an occasion.</p><p>Whenever I would stop by my friends' house, one of the first thing they would do is set me up with a big ol' binger and insist that I suck down the whole bowl-full by myself.  Early on in our relationship when I had first started smoking, this would sometimes become quite annoying as I would not want to finish the whole bowl and would have to come up with new and innovative ways to try and get away without finishing the entire thing.  Time progressed however, as time tends to do, and after a few short months of constant smoking my tolerance was soon high enough that that tightly packed bowl was a much welcomed sight when I walked through my friends' door.</p><p>Then, one day, came the India Kush.</p><p>On this particular day, my friends' and I had retired to their bedroom to partake in our bong-hitting ritual.  My binger was set up first and I noticed right off the bat that it was a significantly smaller bowl then I was usually offered.  In fact, it seemed to be one, maybe just two hits of weed at the most.  But, I reminded myself, it wasn't my weed and my friends are by no means ungracious hosts, so I took the proffered bong and promptly lit it up without complaints.  I filled the chamber of the bong with about the amount of smoke I usually like to take in on one hit and sucked it down.</p><p>Immediately I wished that I hadn't.  The smoke felt much 'denser' then it usually was and the urge to cough became nearly unbearable.  I waited for a nice long count of 10 though before I finally gave in and blew the smoke out of my lungs.  The effects of the hit seemed to set in immediately.  As I slowly tilted my head back with the last tendrils smoke floating towards the ceiling, I felt like the back of my skull was inexplicably being drawn towards the ground.  I could feel my vision expanding, my peripheral vision becoming sharper and wider.  Only one or two minutes after taking the hit, I realized that my cheeks were hurting because I had been smiling ever since the bong hit the floor.  It was definitely a GOOD feeling and I probably should have stopped right there.</p><p>But, as I said, my friends can be very insistent.</p><p>I wound up finishing the rest of the binger in about 1  hits.  By the time I passed the bong on to be re-packed, I was completely out of my mind.  My friends, who were all still sober, were chatting and watching TV.  It was all I could do to sit there and keep my eyes open.  I felt like my brain was racing with thoughts and images faster then I could consciously process them.  The closest thing I could describe the feeling too is tripping on mushrooms.  It was very similar in that I felt that the individual compartments of my psyche had been suddenly thrown open and scattered to the wind.  I could either try desperately to gather them all back together, which was proving impossible, or else let myself go and have fun in the playground of my mind.  I chose to do the latter.</p><p>I have no idea how long I actually sat in the room.  I barely spoke unless spoken too, and that was usually only in non-committal grunts or brief nods of my head.  When some time had passed, everybody in the room was smoked up and a decision was made that we should all go hiking.  I wasn't sure I was ready for it, but I thought what the hell.</p><p>Now, I should preface this next part by saying that right or wrong, I used to drive stoned.  A lot.  As in every day.  I still do it occasionally nowadays, but usually prefer to hold out on smoking until later at night when I know I won't be going out.  On this particular day however, I happened to be one of the only people with a car and was, subsequently, volunteered to drive everybody to the park where we would be hiking.  As I said before, I would usually jump behind the wheel stoned without a second thought.  But even as fucked up as I was on this weed, I still had the presence of mind to hand the keys over to the one person who hadn't smoked up and say, 'You drive.'</p><p>Everyone was rather startled at that and this was the first time I told them just how high I really was.  Which then prompted my smirking friends to inform me that the shit I had just smoked was not regular schwag or even their regular KB connection.  It was a little bit of homegrown goodness which they called India Kush.  They told me that they usually only get their hands on it every couple of months or so and that they hadn't told me so that I would be surprised.  Hell, surprised is an understatement.  I was completely messed up!</p><p>We piled into my car and I volunteered to sit in the back seat.  As we started driving, I was finding it more and more difficult to concentrate on anything and was starting to feel a little bit dizzy and nauseous.  To try and calm myself, I closed my eyes and tried to focus on consuming the racing thought in my head rather then the racing scenery shooting by the car.  That's when one of my friends turned on the radio.  Peter Gabriel was playing.  It was 'In Your Eyes,' what some may consider a cheesy love ballad to be sure.  But with my eyes closed shut and the radio blaring in my ears, it was the most beautiful thing I had ever heard.</p><p>At this point, I was actually experiencing auditory hallucinations.  Peter Gabriel's voice seemed very commanding, very powerful.   The actual music would fade and warble in and out of focus, but his voice and the lyrics were locked in the forefront of my brain.  I felt like I was experiencing the music, feeling each note in my soul.  I wanted to laugh, wanted to cry, to scream and shout.  All I could do was sit with my eyes closed and listen.  About halfway through the song, I felt like I suddenly had a revelation.  It was as if God or some higher being had chosen to impart upon me a truth, and that truth was that 'In Your Eyes' is not a cheesy love song as it is often portrayed.  It is a song about god.  It is a song about religion.  Peter Gabriel wasn't singing to a woman, he was singing to GOD!</p><p>This notion came to me in a very profound way.  It was not a hunch, or a theory.  I somehow knew that it was a truth.  And no matter how trivial that truth seems now, at the time it was earth shattering.  I felt as if I had somehow cracked open the fabric of the universe to steal this vision.  It filled me with an overwhelming joy that lasted long after the song was over.  I don't even remember what else played on the radio the rest of the way to the park.  Hell, I don't even really remember much about the rest of the car trip or the hike itself, but I clearly remember that Peter Gabriel song and the way it made me feel.  Absolutely incredible.</p><p>I smoked the India Kush a few more times after that.  Each time it gave me a killer buzz that beats any other KB I've ever tried, though never again quite like that first time.  I haven't had an opportunity to try it again in many months now though, and am eagerly awaiting the next time my friends get their hands on a little of the Kush.</p><p>Maybe next time I'll try spinning a Phil Collins record and see what God has to say!</p>",
 "year": "2000",
 "id": "1186",
 "timestamp": "2001-04-18T07:00:00.000Z",
 "views": "31937",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
