{
 "title": "What? It's Illegal?",
 "author": "K Mann",
 "citation": " K Mann. \"What? It's Illegal?: experience with Mushrooms - P. azurescens (ID 11866)\". Erowid.org. Dec 7, 2004. erowid.org/exp/11866",
 "substance": "Mushrooms - P. azurescens",
 "bodyweight": "185 lb",
 "header": [
  [
   "DOSE:",
   "17.5 g",
   "oral",
   "Mushrooms"
  ]
 ],
 "report": "<p>As a man in my early 20's, I had had many LSD experiences, but almost none with any form of mushroom. In the space of 12 months, I had two separate, yet similar, experiences. One landed me in a State Mental Hospital for 2 weeks, and the other ended with a month-long stay in a County Jail. If one believes the 12-steppers, the next 'trip' should've killed me. It didn't, but that's a debate for another day.</p><p>Somwhere near the end of the Summer of '93, my head had been turned inside-out by a combination of factors, including, but not limited to, alcohol, tobacco, marijuana, LSD, and the mighty, mightily awesome music scene that was pulsing with the diversity so sorely lacking these days. Consider Lollapalooza 1993: Alice In Chains, Primus, Arrested Development, Fishbone, Rage Against The Machine, Tool, and many others. A person would find it nigh impossible to duplicate that scene in this Millennial climate. Strange, but true. Also, it should be stated for the record that, aside from a cliff-side, Guamanian Episcopal school, my exposure to religion, Christian or otherwise, was negligible. The only 'spirit' I was concerned with was that which needed a mixer and a straw.</p><p>So, along came a couple of friends who wanted to ''shroom-a-zoom-zoom,' and who was I to argue? Michael, Brian, and I split a quarter-ounce between the three of us, and settled in to wait. I had only tried a weak Fungal Tea before this, so imagine my surprise when, very subtly, but with the speed of total realization, the Journey began, not with any normal threshold-type feelings, but with an immediate euphoria that I knew was different from all I had experienced theretofore. The giggles were the first to come and go. Soon after came the feeling that, indeed, all is as it should be. I was looking around my friend's house, and, being there for the first time, began noticing similarities between his present decor, and that of my mother in years past. In other words, his house was making me welcome in it. Everywhere I turned, there was some knick-knack that reminded me of something VITALLY IMPORTANT, you know?</p><p>On the heels of this feeling came the thought that, 'yes, of course...seeing familiar colors and sights and objects..we've all been here before...we've all lived every moment in creation, past, present, future, upside down and sideways. In fact, we all MADE this world for OUR OWN ENJOYMENT!  It's illusory, this life, and the feeling I have now is the only TRUE feeling there is! Why are we all so caught up in this? Why can't everyone know this the way I KNOW IT?!?!' And so on. Most of us have been there, I guess.</p><p>Then, it became, 'I can break that thing hanging on the wall, since I made it for myself in my infinite wisdom.' But, before any damage could be done, I'd be struck - floored, awed - by the inherent BEAUTY of the object. This brought me to the conclusion that, while ultimately it may not have been any big deal to break a friggin' Elvis plate, to willfully destroy that which someone else may find beautiful or worthy is the greatest crime of all. I needed no other Truth that night, but more came.</p><p>I am heterosexual. This is unchanging. I was raised to believe really only one thing: everyone has worth, and race, creed, religion, or sexual orientation are not factors in said worth. But man, that night I would've gone a couple of rounds with my buddies, if they were of a mind. Everything and everyone I saw that night just oozed perfection, and I wanted to taste it in all forms. This led to my friends pretty much leaving me alone to come into godhood on my own, and I didn't blame them.</p><p>After much exultation, and feeling pretty much that the United Gods of the Sacred Elvis Plate would come and snatch me off the mortal coil -- any minute now! -- I collapsed onto the floor. I lay there, as much a part of the parquet as on it, realizing that I had, in my celebration of mySELF, alienated my good friends, and was now alone. Utterly. With eyes closed, all images simply spiralled into a vanishing point, like a new star in the middle of my skull, and I vowed to remember that feeling of total alone-ness, so as not to let it happen 'for real.' In retrospect, I seem to remember it more as a necessary evil, that feeling, so as not to become too attached to form, or objects, in a corporeal sense.</p><p>We're just getting started, people!</p><p>The next morning, Brian, looking none too comfortable, dropped me off at my house, barely making eye contact the entire time. We sort of looked at each other, and I was saying, 'Dude, that was wwaaaayyy out there, huh?' Trying to laugh it all off, y'know. He answered with a mumbled, '...not goin' THERE again...,' and that's where we left it. In the ensuing months, another friend was pushing me to read some book, called 'The Illuminatus Trilogy.' (This is the place where some of you say, 'Oooooohhhhh, I think I see where this cat's going.')</p><p>The day I finished the book, this friend, Amy, and I dropped some LSD, along with her boyfriend and another lady, whose name I've forgotten. Man, you wanna talk about some mind-bending, mind-reading-type stuff going on. I won't go into it too much, but Amy's boyfriend was definitely tapping into my psyche. See, she and I had kind of messed around, shall we say, and he wasn't aware of any impropriety. However, as he and I sat on the couch watching a movie with Eric Roberts as a time-displaced hippie, my mind would just sort of dance on the thought of his lovely woman, and he wouldn't SAY anything, but his breathing sped up, and his lips would purse together, and he'd start drumming his legs and generally just getting worked up, UNTIL I jettisoned the offending thought and replaced it with something a little less adulterous. Then he'd simply calm down and smile at me. I can't do justice to the feeling, but believe me, it was real. I even experimented with it for a while, but was afraid I'd get him worked into a frenzy and have some Manson-esque carnage to explain to the landlord.</p><p>So, I go home after an evening of this, thinking that, certainly, LSD and those wacky mushrooms had something in common, but the difference was organic, therefore like night unto day. I took a nap, and woke up to see Michael, he of the First Trip, grinning the grin of cats in Alice's trees.</p><p>'Whatcha' doin', Sleepy?'</p><p>'Sleepin'.' I'm quick like that.</p><p>'Got any weed?'</p><p>'Nope.'</p><p>'I do...but it's at home. Come with me. Now.'</p><p>I grumbled a little, but not much. I was really still in the night-before mindset of energetic whatever-ness. At his place, we smoked. We listened to music. We talked. Then he produced a baggie which held about an eighth of an ounce of P. Azurescens. 'I'm going to Vegas for a few weeks, and I can't take these. I know you've sworn them off, but could you sell 'em for me? Or eat them, if you can handle it. Just take 'em off my hands.' With no hesitation, I took them from him, knowing I'd be eating them before the day was through. And that was the moment everything came un-stuck.</p><p>In the 'Illuminatus' books, there's a guru-type to initiate the newbies. Michael should have been my guru, but he was unaware of his responsibility; besides, he was Vegas-bound. Perhaps he could've shed some light on the next three days, during which, the following things happened, in no particular order:</p><p>1. I saw a documentary, mistakenly, about Medjugoria. The Virgin Mary has appeared in that Balkan region, revealing Herself to young children, who are then charged with telling a 'secret' to the general populace;</p><p>2. I ate dog food, the dry kind, and loved it. I realized that a handful, with a glass of water, was all anyone needed to survive. This was major, in my thinking;</p><p>3. I almost had sex with a man. A bisexual friend, to whom there had been no latent attraction theretofore. Somehow, it never got that far, but nor for lack of his trying;</p><p>4. I became Kronos, master of time. Really. You couldn't have convinced me otherwise;</p><p>5. I danced around a fire, making up my own language, and generally became a pagan for a little while;</p><p>6. Made a cocktail of banana rum, milk, and my very own, 25-year-old, single malt Urine, and drank it. Something about God's Water, I thought;</p><p>7. Tried to masturbate to conclusion, with no success after at LEAST one hour;</p><p>8. Disrobed in full view of my Mother, Stepfather, and Sister;</p><p>9. I didn't eat anything, other than dog food, the entire time.</p><p>A lot more happened, of course, but for now, that's enough. All these things, inexplicable things to the outsider, were done in a frame of mind bordering on reverential, if not downright holy. Unbeknownst to myself, I was fasting and purifying myself at every turn, but I had no prior experience or knowledge of what I was actually doing. It was only after this, the Second Trip, that my mind was set forth on a course of self-discovery, and I began reading some books on spirituality and sacred substances. At the end of this Trip, the person that was 'me' was involuntarily committed to the State Mental Health facility, where 'me' was told repeatedly of 'my' resemblance to the Christ (!). Where 'I' learned what it is to be truly insane. Nothing like hanging out with certifiably troubled minds to let you know how sane you really are, no?</p><p>There is still the Third Trip to tell of. I will rest for now.</p>",
 "year": "1994",
 "id": "11866",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-07T08:00:00.000Z",
 "views": "5727"
}
