{
 "id": 11875,
 "title": "The Holy Miracle Bong &. Salvia Splendens",
 "date": {
  "submission": "2001-06-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Catfish Rivers",
  "gender": "Male",
  "weight": 116
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia splendens",
   "form": "(plant material)"
  }
 ],
 "report": [
  "It's bonger day boys and girls! Thus was I thinking as I rolled out of bed into a crisp Sunday morning, fully intending to spend the day zonking my wits from my senses with healthy doses of cannabis loaded into my brandy spankin' new glass water system. The clear glass tube, resting atop a transparent buddha's belly and rimmed with a golden ring (like a halo) was dubbed, 'The Holly Miracle Bong,' the night before by a friend. It does sorta look like the kind of bong the Catholic Church would provide for mass service if the Pope one day declared weed to be the new body of Christ.  Sadly, the Pope did not bless my sacred intentions and the ganja gods were not smile down upon their humble servant. Not wanting to abandon the preordained 'Bonger Day,' I dug through my entheogens closet until I came out with a ziploc baggue stuffed with dried Salvia Splendes. I loaded the bowl (medium sized) with the crisp, oregeno colored leaves. I could not discern the plants odor, as I had stored the salvia in the same shoebox as my finely ground, oderiferous kava kava powder. So, after loading the bong up, I wandered off into the woods behind my house. The day was warm, yet the tree cover, thick with fresh foliage, and the gentle breeze provided a wonderful respite form the heat. To the sounds of birds humming Abba songs, I inhaled the Splendens. The smoke was a tad harsh on the lungs despite the water pipe. I involentary grunted a gutteral 'Uhhhmpphh' as I tried to hold the smoke and save the Ruskies from Chernobyl of the lungs. I finished the bowl in three huge tokes and could immediately feel a discernable effect. I could feel a cannabis like high, yet with  a more subtle backdrop. My cheeks had a bit of tensing near the jawbone and I grew tired over the coarse of an hour. Certainly both effects could be the work of the evil Placebo demon, but I doubt it. I felt a feeling akin to the Salvia Divornium regular stregth leaves, but sans the sense of a divided self being sat upon by a 6 billion ton invisable gravity whore. It was a pleasant buzz, lasting near an hour and then morphing into a relaxed tiredness. I sat outside, back cradled to a barky Oak tree listening to the wind tickle the leaves and the squirrels chattering squirrel obscenities at me the whole while. Next time I will attenpt to smoke 2-3 bowls in rapid succession to explore the possible depth of Salvia Splendens. I look forward to a 5x or 10x extract of this newfound step brother to Sally D."
 ],
 "erowid": {
  "id": "7420",
  "citation": " Catfish Rivers. \"The Holy Miracle Bong &. Salvia Splendens: experience with Salvia splendens (ID 7420)\". Erowid.org. Jun 15, 2001. erowid.org/exp/7420",
  "substance": "Salvia splendens",
  "views": "16845"
 }
}
