{
 "id": 11870,
 "title": "'Trip' to the Hospital",
 "date": {
  "submission": "2010-10-14T07:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KrazyKitty",
  "gender": "Female",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Hard"
  },
  {
   "time": "0",
   "administration": "1 tsp",
   "substance": "oral"
  }
 ],
 "report": [
  "[Erowid Note: '1 teaspoon' of MDMA is considered an extremely  high dose; risk of adverse reactions increases with dose and combinations.]",
  "Lets just say I rarely use drugs, I could probably count on one hand the amount of times I have used chemical drugs and on the other the amount of times I smoked weed. This experience changed my life forever and made me realize that I will never use drugs again!",
  "It was around april and I had just quit a job at a strip club where I had worked as a bartender for 3 years. I was happy to be out of there and the staff threw a party for me when I came back one night after about 2 months after having quit. I took it easy all night hanging out with my friends and some cousins. We finally got to another bar where the shots were coming really fast. I got pretty messed but nothing I hadnt felt before. Me and my boyfriend, we will call him J decided to go home but had to drop off a few friends first. That was a Bad decision.",
  "We all got into Js car and decided to go to a friends house for an afterparty instead of just dropping him off. About 7 of us stayed at our buddys house and just kept drinking. Well we all started talking about getting some more girls over (since I was one of the only chicks) and getting the party really started. Someone suggested that we dip into a bag of MDMA that they had brought with them. I had never done the drug and J told me not to do it and just have fun since I wasnt the drug taking type. Of course feeling drunk and thinking it was my last hoorah I decided I should try just a little bit of it.",
  "Our buddy scooped out about a teaspoon for me and a bit more for everyone else and we put it in our drinks and pounded them back. I couldnt feel anything but I remember tasting a very bitter taste for about ten minutes. I got scared because I thought there might be cocaine etc. in the mix (which I found out there could be) and I started to get a bit upset. Everyone told me to chill and lay back and I did. I started to feel the effects in about 15 minutes and kind of liked it. I thought it felt like being fuzzy and warm but then I started to feel tired and wanted to lie down.",
  "My head hit the chair pillow and I heard this song is for (my name) and ACDC came on and it was really loud. I couldnt take it!! It was way too much stimulation, my mind was racing, my heart was racing, the feelings got too intense like the sensation of being really warm and fuzzy was now becoming hot and prickly and I felt nauseous and like I was in the song. Green strobe lights seem to seep into everything and J asked if I wanted to go to bed and lay down in our buddy's roommates room and thats the last thing I remembered until I saw my fathers face in the hospital room.",
  "Apparently J walked back into the bedroom after having  a smoke and saw me on the bed. My body was rigid and stiff, I had my jaw clenched and my breathing was very shallow, spit was foaming around my mouth, and my eyes were bugging out of my head but my eyes were half shut. J called to me twice and I couldnt answer him I just stared blankly he tried to move me but my muscles were too stiff. He tried to get me out of this apparent paralytic state but absolutely nothing would work. After about 45 seconds he went and called an ambulance. The ambulance arrived and had to intubate me because I was barely breathing on my own. I went into the ambulance and some of the others were so fucked up they started screaming where are you taking her.",
  "At the hospital they gave me steroids and adrenalin for my lungs and stuck around five needles for various reasons into my body. Because my muscles were so stiff they couldnt take my clothes off of me and had to cut them off my body including my bra and underwear.  I had to have a breathing apparatus attached to me and a catheter put in too because I couldnt control what my muscles were doing. When J finally got to come and see me I shook the gurney so hard they couldnt keep me in place, they said it was like I was having a seizure and they made J leave the room.  Finally as I was coming down I saw my dad and I tried to speak but nothing coming out of my mouth made sense, even though I knew it made no sense I kept talking anyway.",
  "I was in the hospital for around 8 hours in total.",
  "Even though I know people have beautiful and wonderful experiences on the drug and I know that my case probably is very different from many I would still not do it again.",
  "I think of how it felt in the beginning, like very light and fun, but it became extremely overwhelming and until the point where I dont remember what happened to me and some of the other people could not remember what happened to them either. I wish I knew why I had such a bad reaction!",
  "My advice is try at your own risk and always be with people who you can trust because I dont know what would have happened to me if I didnt have J and my buddies."
 ],
 "erowid": {
  "id": "74161",
  "citation": " KrazyKitty. \"'Trip' to the Hospital: experience with MDMA & Alcohol (ID 74161)\". Erowid.org. Oct 14, 2010. erowid.org/exp/74161",
  "substance": "MDMA & Alcohol",
  "views": "3555"
 }
}
