{
 "id": 11881,
 "title": "Pleasant Times",
 "date": {
  "submission": "2009-10-11T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anon",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "60",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  },
  {
   "time": "3:00",
   "amount": {
    "number": ".7",
    "unit": "ml"
   },
   "administration": "oral",
   "substance": "GBL",
   "form": "liquid"
  },
  {
   "time": "3:30",
   "amount": {
    "number": ".3",
    "unit": "ml"
   },
   "administration": "oral",
   "substance": "GBL",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Background:",
  "My experience in mind altering substances falls under the novice category. I have been an occasional to frequent user of MDMA for the past few years. Prior to this report I have only tried GHB once and this was my first time combining the two substances. I mention marijuana in this report because I did smoke a small quantity, although the effect was in no way profound, I felt it was sufficient enough to be included in this report.",
  "Setting:",
  "It was an autumn night in a small town. Usually I would only consume party drugs in clubs, free parties or festivals but where I am living right now these things are few and far between. The setting was very chill, just a bunch of friends talking, listening to music, smoking and hanging out at each others apartments.",
  "Experience:",
  "T 0 (100mg MDMA crystals ingested orally) Two of my friends and I ingest an equal amount simultaneously.",
  "T+30mins - Warm body rushes, tingly feelings, heart racing but yet feeling very calm as we walk down the street to our friends' apartment. It should be noted that during the four month summer period I had only dropped three times so my tolerance had lowered.",
  "T+1hr 30 (60mg MDMA crystals ingested)By this time we were at our friends' apartment in a room with about 8 others, most of whom were rolling. Not feeling as chatty as normal when on MDMA but still sociable. Very good body highs, sweaty palms etc. were experienced as expected. I felt that it was time to redose to prolong the high as I could feel the effects start to diminish. At this time we were all passing joints around, this I would say helped diminish the effects of the MDMA somewhat.",
  "T+3hrs (0.7ml GBL(GHB)liquid) My friend and I decide to try out the new combination, having been told the mixture is very pleasant although GHB is a depressant and MDMA is somewhat a stimulant. Almost immediately upon onset my friend begins describing this wonderful feeling he's having. The effects take about 5 to 10 minutes to kick in for me. By this time the MDMA effects were clearly diminished but once the GHB kicked in the MDMA in my body was so much more pronounced. It was as if I had just dropped my first hit of the night and was coming up for the first time. It was a very good way to prolong the MDMA buzz.",
  "T+3hrs 30 (0.3ml GBL liquid) A final hit of the evening to get that very calm, euphoric relaxed feeling back. The mood was very chilled out and overall the experience was very positive. Marijuana was smoked throughout the night. I felt it made the experience very calm and fitted in nicely with the environment. Had it been inside a club I would have stayed clear of the marijuana until the end of the night. ",
  "The following night I had the same MDMA + GBL combination again, this time ingesting more of each substance. Once again the experience was very positive. The final hit of GBL in the night made me feel very numb and I had mild hallucinations uncommon for me on MDMA solely. I also had a floating sensation, my head felt very light as if made of air and gently felt like it was hovering above my body. All in all, I would recommend this combination however it is not one to be reckless with. My dosages were well researched prior to taking the two drugs together. If done correctly the GBL is a very good enhancer to the MDMA experience."
 ],
 "erowid": {
  "id": "74238",
  "citation": " Anon. \"Pleasant Times: experience with MDMA (Ecstasy), GBL & Cannabis (ID 74238)\". Erowid.org. Oct 11, 2009. erowid.org/exp/74238",
  "substance": "MDMA (Ecstasy), GBL & Cannabis",
  "views": "6278"
 }
}
