{
 "id": 11880,
 "title": "Depression and Headaches",
 "date": {
  "submission": "2009-02-04T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Daytripper",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "(seeds)"
  }
 ],
 "report": [
  "I noticed a pleasant after-effect from these seeds. I am a 22 year old female, and I have suffered from depression and severe headaches most of my life. I have taken SSRIs on and off for about five years, and sometimes codeine or dihydrocodeine for the pain.",
  "I have tried LSA before in the form of morning glory seeds, but I did not notice much of an effect. I became interested in HBW when I heard it was more potent. Anyway, I only took five seeds, since this was my first time. I'm not really experienced with psychedelics at all. This small dose did not make me sick in my stomach, but then I have quite a strong stomach. After having some terrible alcohol hangovers, and after having taken nutmeg, the slight queasiness from HBW seemed like nothing to me. I realise that other people react differently, and some people feel very sick when taking this stuff.",
  "My 'trip' was mild, but interesting - enhanced colours and sounds, a slightly 'stoned' feeling, patterns on buildings and textiles jumped around a bit, I noticed I was talking about some very silly things with my friend and laughing a lot more than usual. It was nothing mind blowing, but it was pleasant.",
  "I did not notice the real benefits of this drug until the next day, and the days following. I felt much more cheerful and open than usual, and much less stressed, even though work was the same with its pressures. I remember my food tasting particularly good. I also was not bothered with the same aches and pains as usual. I will consider using low doses this substance instead of SSRIs and opiates in the future. I realise it might not be worth it for everyone, because of the fact that this substances makes some people vomit. However, I think more research needs to be done into using low doses of psychedelics for common ailments like this."
 ],
 "erowid": {
  "id": "74230",
  "citation": " Daytripper. \"Depression and Headaches: experience with H.B. Woodrose (ID 74230)\". Erowid.org. Feb 4, 2009. erowid.org/exp/74230",
  "substance": "H.B. Woodrose",
  "views": "6881"
 }
}
