{
 "id": 11894,
 "title": "A Day with Mescalito",
 "date": {
  "submission": "2009-04-14T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Sam",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Cacti - T. peruvianus",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>One of my best friends had recently returned from travels from Southeast Asia, it had been the better part of a year since we had met up, and he was over for the weekend.",
  "For a while I had around a gram of crude mescaline extract extracted from Peruvian torch cactus powder. I was keen to try, and having my friend over, I felt it was time. It is important to note that this extract was in no way pure, and would have contained any other alkaloids present in the San Pedro as well. At most, it will have contained 50% mescaline hydrochloride.",
  "We took it around 1 in the afternoon, on an empty stomach, however food was offered to us around 15 minutes later, which we were unable to refuse.",
  "We both felt the first effects within half and hour, even with food in our stomachs, which I found impressive. Two of my friends had previously tried a similar dose of the extract a week previously and had had an enjoyable day, and a nice buzz, but little in the way of psychedelic effects, so I wasnt expecting much.",
  "There was a big party planned that night, and we spent the coming up time chopping wood, which was actually a lot of fun, and helping put up a marquee. These activities during the come up, combined with the stomach full of food, definitely did not help with the nausea, and we both came close to purging on numerous occasions during this time. We were however in very good spirits, with much joking and laughing at the time.",
  "Being outside and engaged in physical tasks was particularly satisfying. It wasnt even a nice day really, grey and windy, but the colours were vibrant and there was fractals on the grass and plants. Around an hour and a half after dosing, the nausea vanished, and the trip shifted gears.",
  "When we were chilling in my room, this is where the psychedelic effects seemed to manifest more strongly. I have large photo of a sunset, and we were both watching this photo come to life, with moving clouds and shimmering sunrays, and the carpet, as ever when tripping, was encrusted with fractals.",
  "It was in the toilet that much morphing was observed, in the wood grain patterns. Bathrooms always seem to bring out tripping for my friends and myself, everything is boxed in, and usually I'm on my own, both of which seem to help bring out psychedelic effects. My friend and I both thought after going to the toilet that the level of tripping had reached a critical stage. Any more, and interacting at a party would be an endurance contest for the very hip to quote Ken Kesey.",
  "Two other good friends arrived, and these guys, along with my sister, both noticed something a little different about us, subtle but definitely off, before we told them we had taken some mescaline. A bit of cannabis definitely increased the level of psychedelic effects, producing some OEVs, but some quite impressive CEVs, very colourful and detailed.",
  "I really liked the feeling of mescaline, after the nauseous coming up stage it is heaven. The level of euphoria and empathy reminded me a lot of MDMA, only this feeling was much more gentle and less forced than that. It is powerful like a gorilla, yet soft in yielding like a nerf dart to quote Homer Simpson. It was very dreamy, reminding me of mushrooms, although it was more stable, and less weird than a mushroom trip, and much more of a stimulant  proper marching powder. It had the wholesome, earthy dreaminess of mushrooms, and yet also the lucid, long lasting, energising effects of LSD. Mescaline seems to be a very malleable psychedelic, good for exploring nature, or chilling and I strongly suspect raving as well. It seems to be very friendly, easygoing material; the potential for freaking out is extremely low. Seems like it would be quite a good psychedelic to introduce interested persons to.",
  "The plateau was gentle and long lasting. Social interaction with other sober people during the day was easy, something that would have been a lot more difficult when peaking on acid or mushrooms. However, at the party, social interaction was definitely impaired. It was hard to maintain a conversation or a train of thought in a crowded, noisy room, sensory overload was definitely featuring, so we retreated to our ganja den upstairs for a while.",
  "We chilled out and smoked a fair few joints of homegrown blueberry, and just talked and laughed for the rest of the day and night.",
  "For anyone wishing to sample the delights of mescaline, or finds it hard ingesting sufficient amounts of cactus, mescaline extract seems like the way to go. Ive experienced San Pedro many times, but this extract seemed to retain that same sense of magic as the plant.",
  "This experience was impressive and the dose wasnt that high. The ideal situation would be to plan well in advance of the experience and take 3 or more likely 4 capsules of mescaline extract in the summer, while camping out in the countryside. Based on this experience, this would yield a profound and beautiful psychedelic experience.</p>"
 ],
 "erowid": {
  "id": "74353",
  "citation": " Sam. \"A Day with Mescalito: experience with Cacti - T. peruvianus (extract) & Cannabis (ID 74353)\". Erowid.org. Apr 14, 2009. erowid.org/exp/74353",
  "substance": "Cacti - T. peruvianus (extract) & Cannabis",
  "views": "7587"
 }
}
