{
 "title": "Unusually Long Experience",
 "author": "egg plant",
 "citation": " egg plant. \"Unusually Long Experience: experience with Salvia divinorum, Bupropion, Fluoxetine & Amphetamines (Adderall) (ID 11893)\". Erowid.org. Jan 3, 2005. erowid.org/exp/11893",
 "substance": "Salvia divinorum, Bupropion, Fluoxetine & Amphetamines (Adderall)",
 "bodyweight": "",
 "report": "<p>The other day, I was in search of an old friend (let's call him 'Jimbo') to score some weed for an upcoming party.  He had been MIA for a few weeks, and it was rumored that he had moved from his house a block away from mine.  His roommate was reportedly going to rehab, and I was worried that my friendly neighborhood dealer was never to be seen again.  Fortunately, I was able to catch up with him at his mother's house, and my worries were eased. We conversing and preparing to make the exchange when he asked if I wanted to try something new to the area, Salvia.  I was relatively unfamiliar with the substance, so I inquired on its active compounds, effects, legal status, et cetera.  He informed my about its misfit chemistry and legality, which intrigued me further.</p><p>When I left my place of employment, I had told my boss that I would be back soon, and he asked me to bring him something from the drive through, so I had a mild time constraint on my hands, and I had school the next morning, so I didn't want to be out of it for long.  Jimbo assured me, however, that the salvia would last only about half an hour, so soon I would be capable of operating my motor vehicle and performing the task I set out on.  Despite the logic stacked against it, I decided, 'What the hell.  It's free.'</p><p>We took a short trip to a nearby graveyard after I had acquired the aforementioned weed (didn't smoke any, though) and sat down to pack a bong load of salvia.  He had an ice cream bucket full of the stuff, which impressed me.  He instructed me to take huge hits and hold them for as long as I could, which I have always been good at with weed.  I complied through two full bowls of the stuff, and it had kicked in at hit number one.  It was somewhat intense, with a certain degree of ego separation, but overall, it was weedlike in nature.  Jimbo described the effects as somewhat hallucinogenic, and I have since read many trip reports describing mystical experiences, but I just felt very very stoned, with a more dissociated quality.  The most stunning difference in our experiences of the substance, however, was that I was feeling this way for approximately two hours.  Since I had promised my boss a meal and I had midterms in less than twelve hours, I was somewhat frightened.</p><p>I have attributed the lengthened 'trip' to the fact that I am currently taking Prozac, Wellbutrin, and Adderall; I suspect the Prozac in particular because the salvia high did not have any noticeable dopaminergic quality to it.  Could Fluoxetine inhibit its metabolism by some other means?  Or am I simply very slow to eliminate it from my system?  The world may never know, but I'd like to see reports from others taking SSRIs and smoking Salvia, just to clear this up.</p>",
 "year": "2002",
 "id": "11893",
 "gender": "Male",
 "timestamp": "2005-01-03T08:00:00.000Z",
 "views": "6357",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Bupropion",
   "form": "(daily)"
  },
  "2": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Fluoxetine",
   "form": "(daily)"
  },
  "3": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "(daily)"
  }
 }
}
