{
 "id": 11899,
 "title": "Unexpected Morning After",
 "date": {
  "submission": "2010-08-22T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Allie",
  "gender": "Female",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "7",
    "grams": 0.007
   },
   "administration": "oral",
   "substance": "Zolpidem",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "160",
    "grams": 0.16
   },
   "administration": "oral",
   "substance": "Pharmaceuticals",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I've been taking Ambien a few nights a week for insomnia for several months now.  It's always been helpful, and sometimes I say and do funny things before I fall asleep.",
  "However, last night I took a dose of Dilflucan as prescribed by my doctor for a yeast infection following antibiotics, and in reading the enormous sheet of patient information, discovered that it interferes with the metabolism of benzos and Ambien.  Having already taken an Ambien, I figured there was nothing I could do about it.  I fell asleep as usual.",
  "This morning, I woke up to find that I was still feeling the effects of the Ambien!  My balance was off, I was sleepy, and things were moving if I stared at them too long, all things that I usually notice when I'm about to go to sleep.  More than twelve hours after taking the two drugs, I'm still loopy, tired, and hallucinating minorly.  It's not all that unpleasant, but I'm very glad it's a weekend and I don't have anywhere to be, or else my plans for the day would likely be shot.",
  "I wish the Diflucan had had a more obvious warning about this side effect, as I would rather have been expecting this..."
 ],
 "erowid": {
  "id": "74376",
  "citation": " Allie. \"Unexpected Morning After: experience with Zolpidem (Ambien) & Fluconazole (Diflucan) (ID 74376)\". Erowid.org. Aug 22, 2010. erowid.org/exp/74376",
  "substance": "Zolpidem (Ambien) & Fluconazole (Diflucan)",
  "views": "7852"
 }
}
