{
 "id": 11892,
 "title": "The Most Fun I've Had in Sculpture Class",
 "date": {
  "submission": "2009-06-19T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sarajane",
  "gender": "Female",
  "weight": 43
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "900",
    "grams": 0.9
   },
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I am prescribed to 900 mg of Neurontin daily for a chronic pain disorder. I had been taking it regularly over the summer, and had gotten so used to it I didnt feel anything when I took it anymore. However, when school started up again, I became busy and stopped taking it for several weeks. The other day, though, my pain levels were really bad, so I decided to take a couple pills, 300 mg each. A few minutes later, I took another one about an hour before my Sculpture class.",
  "I didnt feel anything until I got to the class, and then the effects slowly started creeping in. I felt extremely relaxed and at ease at first, but soon things became more intense. Although my body was relaxed and slowed down, my mind was very alert and active. My class was sitting in a circle in the studio, just talking about everyday things. It was a very pleasant atmosphere to be in. Strong euphoric feelings repeatedly swept over me, and I felt as though everything was right and good. I am not a naturally optimistic person, but I was as optimistic as ever then. I looked at the hardwood floor, and it began to sway slightly and looked like thick mud.",
  "After a while, we all got up to go and see what our next assignment would be. By now the effects were so strong I felt a slight fear that I may have taken too much at once, but the thought was swept away almost immediately by my impenetrable optimism. As soon as I stood, I felt pleasantly dizzy and awkwardalmost tipsy, but better. The floor felt very spongy to me, and I bounced on it a bit. I probably looked pretty weird to my classmates, bouncing on a hardwood floor, but it was just so much fun!",
  "I also tended to play with my hair a lot the whole time, because it felt really good on my scalp. In fact, any contact with my body felt very good, on top of the wonderful relaxed feeling I already had. My professor was explaining that we would be doing iron casting as our next projectan extremely difficult and tedious process. As the rest of the class groaned, I became very excited about it! He handed us each a ball of plasticine (a clay-like material used for the first mold of the iron figure) to play with and get the feel of it. I had a wonderful time working with it, and molding a face. One very nice effect that I was not expecting was that my urge to create increased tenfold while on Neurontin. I felt like I was wasting time if I was not sketching or molding the plasticine. I also became much more talkative and interactive in my class that day.",
  "I recalled the lyrics to Lucy in the Sky with Diamonds: Plasticine porters with looking-glass ties. It made me laugh out loud, and I was even more excited about making something out of the odd, clay-like material. The class that I normally dont feel adequate in (I am far better at 2D art) was suddenly a blast, I had so much fun. I can definitely see why people might become attached to this drug. Its great for me, because I have a prescription and can take it whenever I want, but I keep it to a minimum. In fact, taking it in class has been the only time Ive taken all three pills at once. The best part of the experience was riding my bike home after class. It felt like I was flying, almost. I normally avoid riding on the grass, as its bumpy, but it was so much fun! The effects lasted quite a while. I took the pills around 5 pm and the last effects wore off sometime around 1 or 2 am. Its hard to tell, because the come down is so smooth.",
  "Ive given some pills to a few of my friends, and some of them have the same experience I do, while others dont feel anything at all, which I find very interesting. All in all, Neurontin delivers an amazing experience not quite like any other drug Ive done. Definitely a favorite."
 ],
 "erowid": {
  "id": "74327",
  "citation": " Sarajane. \"The Most Fun I've Had in Sculpture Class: experience with Gabapentin (Neurotin) (ID 74327)\". Erowid.org. Jun 19, 2009. erowid.org/exp/74327",
  "substance": "Gabapentin (Neurotin)",
  "views": "28595"
 }
}
