{
 "id": 11891,
 "title": "Less is More!",
 "date": {
  "submission": "2001-06-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Oldman and wife",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "June 2001",
  "We are a married couple in the late 40s, and we've had our 40th pill experience now and tried all sorts of settings and combinations.",
  "One of our favorite in the past:  1/2 pil, after half an hour another 1/2. After 2 hours from start, boosting with another 1/2 pil to extend the experience (and sometimes even another boost 2 hours later). We know the contents of our pills, it's 110 mg each (lab-tested!). When we came down, usually we did some hash, which brought us up again for a short while and let us come down gently afterwards.",
  "At our first time, 1 pill was really enough to get high high up into the sky. But getting used to the substance by frequent use and having a lower serotonine level beforehand to due regular use, at later times we had to take more to get up high enough. (It will never be as good as it has been the first time!)",
  "The last 20-30 times or so, we've had a complete 'hangday' next day ater taking E with just hanging around on our couch, too weak and too lazy to do anything. So every time we were up to take E, we had to consider the next day to be a lost day!",
  "And there was something else:  When taking too much, I wasn't able to perform sexualy anymore. The first times, we took E, the sex was incredible. But later, sexual activities went down to almost zero. (A shame!) The E-experience remained longer, but the last hours we were hanging around, having somewhat heavy times with heavy body-loads, being not so talkative anymore...  So in fact, the later hours of an E-experience were not as good and as nice as the start!",
  "The last times, we did it differently: We didn't boost!!!  We now take 1 and 1/2 pills each right at start and nothing else later. No boosting! No hash!  The high is o.k. and... sex is back!! We enjoy the E as long as it lasts and when it ends it ends! We just finish and go to bed!  Because the E-effect is not as heavy as with boosting, we enjoy every minute now. No hanging around, no heavy body-loads, no 'hangday' the next day.",
  "This way, it's just fine all together!",
  "Our tip:  Take a 'normal' dose and enjoy it! But don't boost or overdose!  It's not really enjoyable anymore!",
  "Another tip for faster getting fit afterwards: Some 5-HTP (100mg) before you go to bed, to support building up you Serotonin level.",
  "Kind regards from the oldman and his wife",
  "P.S.:  We think it is not sufficient telling how many pills are the basis for such and such an E-experience, because the contents of E-pills can be very different.  So if someone tell's here, he's taken 2 pills, could mean the same if someone else has taken just 1 pil that 2 times stronger.",
  "It would be much better, if the real contents of the substance taken would be mentioned!  (MDMA, MDE, MDA, Speed  and in mg)"
 ],
 "erowid": {
  "id": "7432",
  "citation": " Oldman and wife. \"Less is More!: experience with MDMA (ID 7432)\". Erowid.org. Jun 15, 2001. erowid.org/exp/7432",
  "substance": "MDMA",
  "views": "9008"
 }
}
