{
 "title": "Fade to Black",
 "author": "Anonymous",
 "citation": " Anonymous. \"Fade to Black: experience with 5-MeO-DiPT & Cannabis (ID 11900)\". Erowid.org. Feb 15, 2002. erowid.org/exp/11900",
 "substance": "5-MeO-DiPT & Cannabis",
 "bodyweight": "135 lb",
 "report": "<p>Approx. 12.5mg of 5-MeO-DiPT was measured by dividing 100mg into 8 parts.  Not the best way to measure, but even taking double the target dose would still be within a reasonable safety range.  The gelcap was taken with a glass of water on an empty stomache.</p><p>First effects were noted within about a half hour.  This was my second experience with this substance.  The trip was not really anything special, and not worth going into detail.</p><p>After the 5 hour mark, I was definatly 'down,' and made the decision to go to a local keg party.  I hate drinking, so I decided to smoke some pot.  At the party, I started feeling very strange.  I was well hydrated, and had eaten just 1 hour before.  Suddenly, while standing and listening to music, my world began to fall apart.  The room began spinning, and my consciousness began to slip away.  Everything went black.</p><p>I awoke amidst a crowd of people, and a woman asked me if I was ok.  I said 'I don't know', and managed to get outside for some fresh air.  The remainder of the comedown was marked by a strange, almost sick feeling in the back of my head, almost like a headache, but steady and not throbbing.  This was similar to the after effects of a previous Fox trip, but stronger.</p><p>Eventually, I got to sleep that night.  I awoke, feeling extremely 'burned out'.  Water tasted like old pennies, and food tasted like clay.  When I smoked a cigarette, I coulden't feel the nicotine at all, and it brought me no satisfaction whatsoever.  Sex was boring and more of a routine than an indulgence.  There was also severe depression.  The only thing that could have made me happy that day was for someone to put a bullet in my head.  Luckily, I am a relativly strong minded person, and just took it easy, attributing my mental state to the strange drugs I had consumed the night before.  I felt as if my personality, ego, and willpower had been flatlined.</p><p>This conditiond gradually relaxed over the next few days.  I felt my emotions flowing back into me like much needed oxygen.  The depression faded, and I regained the positive outlook on life that I usually have all the time.  It is now day 3 after the trip, and I still don't feel 'right'.  I'm fairly certain these effects will wear off, because the more time that passes the better I feel.</p><p>Overall, the trip itself was fine, similar to my first experience.  The negative effects I experienced scared me a lot.  I'm seriously considering never doing this drug again.  No other people who took equivilant dosages of this drug experienced any negative symptoms other than the expected next-day burn out.  I strongly question the safety of this substance.</p>",
 "year": "2001",
 "id": "11900",
 "gender": "Male",
 "timestamp": "2002-02-15T08:00:00.000Z",
 "views": "11576",
 "dose": [
  {
   "time": "0",
   "amount": "12.5 mg",
   "administration": "oral",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 5:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
