{
 "id": 11909,
 "title": "Beautiful Experience",
 "date": {
  "submission": "2008-12-18T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "jonny",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "150",
    "unit": "mg"
   },
   "substance": "4-Methylmethcathinone"
  },
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "substance": "4-Methylmethcathinone"
  }
 ],
 "report": [
  "I bought a small amount of mephedrone from an online vendor. My past psychoactive experiences include lsd, mdma, psilocybin, ketamine, dmt, 2cb, methylone. I decided to try mephedrone at a goa trance party near the beach.",
  "I arrived at the beach  at 5pm, with my brother D. and 2 friends of him, A. and C., and with one friend of  mine, Alex. The party was going on since a couple of hours, and they were playing some good psy-trance music. We went near the sea and we took our magical potion. D., C. and A. took methylone while I took mephedrone. It was the first time for me with it. From the info I found on internet I knew the effect to be the same as methylone, so for me was like taking all together the same thing.  Just Alex didnt take anything.",
  "A few minutes after the sunset, we started to feel the first effects. D., C. and A. started to dance with a lot of energy while me and Alex started talking about many different topics. I  told him about the very clear and pure and empathic state of consciousness I was experiencing. It was a very open and deep conversation, we were looking at each other eyes and we were having a very profound communication. After a while he took off his shoes and socks and went dancing in the water, while I started to dance with D., A. and C.. They were so euphoric! After few minutes A. and C. went also dancing in the water. D. was full of energy, saying things like: wow! It's beautiful! It the drug of the future! and so on. We hug each other very strongly; he actually lifted me up turning on himself very quickly so I was like flying with my legs in the air! I very lucky to have you as brother I told him. I very lucky to have you as brother, my lovely pusher! he replied to me smiling.  Everything was perfect. The sky near the horizon was violet... really beautiful. A. and C. were still dancing in the water. For them it was the first time with an empathogen and they were so beautiful, dancing full power, that I took a short video of them with my mobile with the intention to send it to them afterwards. Then I sat down in the lotus position, breathing deeply and enjoying to be alive.",
  "When the effect started to slowly go away, we moved to the dance floor. It was great to have the sound system right there: the music gave us a lot of energy.  Meanwhile, most of my friends were arrived and I was very happy to see them. I spent the rest of the night talking with them, dancing a lot and sleeping a bit in the car.",
  "Conclusion: the effect is very similar to methylone: it reminds a small amount of mdma. I had a very pleasant experience."
 ],
 "erowid": {
  "id": "74435",
  "citation": " jonny. \"Beautiful Experience: experience with 4-Methylmethcathinone  (ID 74435)\". Erowid.org. Dec 18, 2008. erowid.org/exp/74435",
  "substance": "4-Methylmethcathinone ",
  "views": "15417"
 }
}
