{
 "id": 11906,
 "title": "First and Second Time Around",
 "date": {
  "submission": "2010-02-23T08:00:00.000Z",
  "experience": "2007-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Phantom",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "dried"
  }
 ],
 "report": [
  "To read the quick version of this story, scroll down to paragraph 5, but I'd like to give you the background story:",
  "I tried marijuana for the first time when I was 14. I was introduced to it by some friends I knew from high school. My first experience with marijuana was quite groovy. While high I understood why people did it. My whole world was amazing and beautiful. It made me feel like the happiest person alive.",
  "It was a while after that where I wasn't smoking, but if anyone offered I wouldn't have turned them down either. That period lasted about two years, until I moved to a new school and met new people that smoked weed. I wanted to be accepted as a 'Cool Kid' so I decided to hang with them.  Unfortunately, they didn't live too far from me and I had easy access to their house.  I decided I wanted to get high before school one day, so I lied to my mom and told her that I was going over a friends house to help tutor them with some math homework (which I am completely horrible at)and that they were going to take me to school.",
  "The biggest sign that it was a bad idea was that it was dark and rainy at 6 in the morning. It took a good 20 minutes to walk to their house, all the while I was nervous thinking about what I had lied about, and what I was about to do.  Once there I knocked on the door and a man I did not know answered the door. I knew my so-called friends nickname so I asked for him, once they heard the nickname they let me in. 'Leave your shoes at the door.' the unfamiliar man said. I did accordingly and began to sit and wait to see my friend. 'You know anybody lookin' for a computer?' the man asked. I replied 'No, but if I find someone I'll definitely let them know'.",
  "Our small talk continued until my friend woke up (I was there quite early) and we began to talk and catch up. I found out the unfamiliar guy was his brother, and I met his other brothers, one the youngest and the other the oldest. Keep in mind the setting was already horrible, I didn't know a lot about my friend or his brothers, visiting his house for the first time, on a dark rainy morning.  Eventually his oldest brother got us a blunt wrap and proceeded to roll us a blunt. 'Your mama know you smoke?' the oldest asked. I don't quite remember what I said but my friend replied to my comment by saying, 'I told mines I wasn't stoppin'.'",
  "Eventually the smoke began to fill the room as the blunts were being passed. Someone turned on a cd and I was already experiencing the onset, I felt comfortable and euphoric. After what felt like 20 minutes I began to feel like something was wrong. I took another hit and I realized I couldn't feel anything. The younger brother said something to the effect of, 'Man, you smoke like a chimney!' I nervously laughed.",
  "Before I knew it I felt like hours had passed and I was just sitting in a chair, watching the world continue around me. It felt like my legs had sunk into the floor and I couldn't feel them. The younger brother started talking to my friend and I literally couldn't understand what he was saying. His phrases began to loop and repeat and I started to get scared out of my wits. My friend decided out of nowhere to do a freestyle rap.",
  "To this day the melody of that rap is the most demonic I have ever heard. I don't remember his words, just the melody. All the while I was thinking to myself about all I had ever heard about street drugs. I heard my parent's voices mocking me for being so dumb. I eventually asked out of curiosity 'How do you guys think?', because I was literally that desensitized. The response just made things worse, the oldest smiled and said, 'We don't.' I began to think 'What is the world coming to?! Is this what other teenagers are doing behind closed doors?'.",
  "I eventually came to the conclusion (that wasn't really founded, anyway) that they were trying to get me addicted to some type of drug by using marijuana as a cover-up. They were trying to take advantage of me. No, they were trying to kill me! I asked to be shown to the bathroom, my friend just lazily pointed his finger toward the kitchen door without even looking up. Somehow I found my way to the kitchen and eventually to the bathroom where I turned on the light and looked at myself in the mirror. My eyes were completely bloodshot-red (which is logical seeing as I had just smoked marijuana) and I looked just straight out of it. I looked at my cell phone to keep track of time because it felt like I had been their for hours.",
  "I had only been there for basically an hour-and-a-half. I prayed and asked God to forgive me, seeing as I was and still am a Christian, and walked back out to the living room. Not too long after that our ride arrived. I had decided seeing as they were 'trying to kill me,' I wasn't going anywhere with them, even if it was to school. I eventually broke it to them that I was just going to take the bus (another lie) they agreed and drove off. When I say I darted and ran like I was going to be chased, I'm not lying. I began to think that they were following me and we were playing a game of cat-and-mouse. I was scared that they were going to pop up any minute, snatch me up into the car and drive me off to nowhere and kill me.",
  "I ran about 5 blocks down to a park that had a hill. Once at the top I began to have an extremely psychotic episode. I began to yell, scream, and pray for God to deliver me. I screamed so much I began to throw up. It wasn't a whole lot because I had had nothing to eat. I began to again think about what my parents would say if they found out and what people would say about my 'friends' once I reported them to the police. After fighting with myself for what felt like 20 minutes, I called 911.",
  "I told the 911 operator the entire story and she assured me that the authorites were on their way.  I don't know if she dispatched them or not but they never came. I decided that staying there wasn't going to do me any good so I walked, and walked, and walked, and walked for a period of about 7 hours (no lie, I looked at my cell periodically) so much to the point where I had blisters, until it was 3:30 and I could come home like I had been at school all day. I was determined to not put my parents through a mistake I had made.",
  "Once home, I still caught myself tripping. I was scared to close my eyes because all I would see were spiders crawling on my wall. I realized it was easier to sleep with a nightlight than in the complete dark.  The next morning my dad woke me up for class. I looked at him, smiled, and privately thanked God I was still alive to see him."
 ],
 "erowid": {
  "id": "74413",
  "citation": " Phantom. \"First and Second Time Around: experience with Cannabis (ID 74413)\". Erowid.org. Feb 23, 2010. erowid.org/exp/74413",
  "substance": "Cannabis",
  "views": "1813"
 }
}
