{
 "id": 11919,
 "title": "An Experience to Remember",
 "date": {
  "submission": "2000-10-17T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JKZ",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "joints/cigs",
    "quantity": "0.5"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I'm not sure where to start so I'll just go in chronological order. That day I had just finished a math exam that I wasn't too pleased with when a friend of mine met me at my locker. 'Hey man, I got some chronic weed! You wanna buy?' he asked. I guess it was a combination of fustration over my poor math performance and looking for a way to cut loose after exams, but I purchased some of this fine ganja.",
  "Previously I had smoked some mild weed without much effect and said to my friend, 'I hope this is worth it'. 'Believe me man! Don't smoke this alone!' he warned. So, I headed home and rolled a fat joint (about a gram), which took some time because I don't toke very often. So then I headed out to the garage. On the way (I don't know what compelled me) I asked my sister if she wanted to join me. To my surprise, she did. Little did we know what the next two hours had in store for us!",
  "I sparked it up and got it burning. We took turns until about half the joint was done. Then I noticed that I no longer felt cold (it was January). I asked my sister how she felt, she said she didn't feel anything yet. The joint fizzled out and I went to relight it, which was a bit difficult. I passed it to my sister and adjusted my coat, which felt weird. Then it happened! As I shifted the coat, I got a weird tingling sensation like when your leg falls asleep. I became aware that I had entered a different reality. I knew that everything was the same, but my perception had changed.",
  "I decided we should go inside. The trip to the door was both funny and frightening. We stumbeled inside, my thoughts were all over the place. Then I got paranoid and ran to the washroom and flushed the roach down the toilet. Was this laced? I asked myself, this was too strong.",
  "Everything moved in flash frames, no longer continuous. I was a bit disoriented and so was my sister. We bumped into each other several times. We made our way to the kitchen and drank some water, our mouths were bone dry. I could feel paranoia setting in, but I was determined not to have a bad trip so I put my demented thoughts in the back of my mind. We decided to watch TV. I couldn't keep still, the numbing of my body drove me nuts. My thoughts went everywhere except the movie we were trying to watch. One moment seemed unconnected to the next. What was going on?",
  "I wandered around the house a bit while my sister sat stupified in front of the TV. I tried to rest but my heart was pounding and the shirt I was wearing made my skin tingle whenever I shifted position. My sister started to talk on the phone. Apparently our communtication skills were fine because no one noticed we were different in any way. We both got a bit depressed and nauseated but it passed eventually. I continued to wander around the house in a dream-like state lost in my thoughts.",
  "By dinner we were fairly normal. Two hours, what a trip it was! Time started moving at a normal pace, instead of slo-mo like before. I think it must have been a strong Indica because it didn't make us giddy but almost comatose!",
  "Despite the fact that the numbness persisted for almost two days and the experience of slight paranoia, we were both fine. We both agreed it was a worthwhile experience and it has been the topic of much discussion between us. The shared experience brought us closer together. We might do it again sometime, but we both agreed frequent use isn't a good idea.",
  "It was a mind opening experience that I recommend, but as with any choice it should be an educated one. (I had researched a bit before the first time I smoked marijuana just to be sure.) I hope my experience might educate others on the potential effects of marijuana. Open your mind to new things and thoughts and as long as you think it through, you'll most likely come out better for it. We did.",
  "Peace love and unity to all!"
 ],
 "erowid": {
  "id": "745",
  "citation": " JKZ. \"An Experience to Remember: experience with Cannabis (ID 745)\". Erowid.org. Oct 17, 2000. erowid.org/exp/745",
  "substance": "Cannabis",
  "views": "6686"
 }
}
