{
 "id": 11913,
 "title": "For Gallbladder Removal",
 "date": {
  "submission": "2009-07-27T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "frglee",
  "gender": "Male",
  "weight": "120 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Pharms - Propofol"
  }
 ],
 "report": [
  "I was to have an operation using Propofol but curious about it so I googled for info.",
  "I was in the local hospital for gallbladder removal. The surgeon had explained the procedure well to me and talked about the anaesthesia agent. the Anaesthesiologist came to see me before the op to explain a bit more and answer my questions. I would be given an oxygen mask, then knocked out and then they would intubate me with a respirator as my lungs would be paralysed during the procedure. I was wheeled into the theatre patient prep area, told to breathe thru the oxygen mask which was tingly and nice then a small canulla was placed into my wrist. I noticed a pile of tubes leading to it and one attached to a large syringe inside which was a pink liquid. My bp armband was added and the anaesthesiologist just said,'OK I am going to put the agent in now, you may feel it going in' there was no pain, just a cool feel as the stuff worked its way up my arm.",
  "Very suddenly I had a visual disturbance, a bit like lines on a TV, then everything went into black and white and suddenly I could feel myself going and everything went black...like being switched off. I was not frightened,I was actually very curious. My last memory was 'Oh so this is what it feels like...'",
  "When I woke it seemed I was dreaming in black and white with people's arms over me and talking to me and I was in the prep area. I was finding it hard to work out what was reality and when the nurse told me to stop moving my arm as I would dislodge the cannula I realized it was not a dream. The colours faded back in fast and I seemed immediately very aware and very back to normal. I needed to have a drip into the canulla for 6 hours as the whole procedure is very dehydrating. [Is that the propofol?]",
  "Laying in my bed back in the ward I felt pretty glowy and pleasant. A really nice feeling of relaxation and well-being without being overly stoned, wobbly or unable to think straight. I was able to walk about OK, even with the drip. It was a really nice and gentle high. If I had any pain from the keyhole surgery I did not notice it until later. Just this feeling of well-being and intense happiness. I relaxed back in the bed all afternoon staring out at the windows and the setting sun seemed to dance in the reflections of the windows... almost like acid in a way, some colour disturbances but very mild and very pretty just added to the feeling of well-being and happiness, and my fascination with this feeling.",
  "The drug also stopped me pissing for a bit but I avoided the catheterisation by forcing myself to piss and by drinking litres of water along with the drip...  but within 8 hours all was back to normal. I slept well that night and was discharged the following morning still feeling a tiny bit under the influence of the Propofol and certainly not really able to drive safely I think. 48 hours after the op the stuff had worn off completely.",
  "Interesting stuff...I can see why medical staff like it. I am to have 4 teeth out soon in hospital with Propofol again but a much milder dose not requiring ventilation or a hospital stay but I am told I will need to have someone at home to watch over me for 24 hours after."
 ],
 "erowid": {
  "id": "74477",
  "citation": " frglee. \"For Gallbladder Removal: experience with Propofol (ID 74477)\". Erowid.org. Jul 27, 2009. erowid.org/exp/74477",
  "substance": "Propofol",
  "views": "5859"
 }
}
