{
 "title": "An Almost Teary Farewell to a True Psychonaut",
 "author": "C.Snap",
 "citation": " C.Snap. \"An Almost Teary Farewell to a True Psychonaut: experience with  LSD , Cannabis & MDMA (ID 11920)\". Erowid.org. Dec 21, 2004. erowid.org/exp/11920",
 "substance": " LSD , Cannabis & MDMA",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "1 capsl",
  "oral",
  "MDMA",
  "(capsule)",
  "",
  " ",
  "",
  "LSD",
  "(capsule)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  ""
 ],
 "report": "<p>It was a few days after New Year's eve, and me and my cousin K were doing everything in our power to find some acid.  We had done acid together 3 times before, mushrooms about 4 times, ecstasy quite a few times, and of course I smoked herb with him hundreds of times.  Unfortunately for my cousin he was starting a new job in which he would receive random drug-testing, and would have to quit engaging in anything but alcohol consumption for the next few years, this was our fuel to find some good psychedelics to do.  One of my friends was able to help me out, and I got two homemade looking capsules of what was supposedly an LSD/MDMA mix.  It was already tested and approved by my friends, so there was no worry about the quality of it.  K was happy to hear about my acquisition, and we settled on a saturday night trip at my friend S' house.  Me and K got to S's house, with empty stomachs (excluding the 5 vitamin C's I ate) and 'The Fast and the Furious' on tape. </p><p>It was around 6:00 pm when we dropped the capsules, and we settled in with the sound of exhausts blazing, and intakes roaring, while we passed around a bong.  At about 7:00 sharp, I noticed that everything was looking more alive than normal, and I felt a glowing warmth inside that could only be the X.  K looked slightly less impressed by what was going on in his world, but I just figured we had different absorption rates.  Fifteen minutes later, the whole carpet in S's room is swirling and pulsing as if it were liquid.  The dark soda and cigarette ash stains on the carpet were doing very interesting things, expanding and contracting, turning into pictures of things, pictures the acid wanted me to see.  I look across the room to K, who despite his distance of about 4 feet, appears to be 14 feet away, and am rewarded with a smile, and an 'I'm definitely feeling it' look on his face.  The movie begins to make less and less sense, and the most disappointing thing was that it never looked different.  Everything else in my field of vision was moving, and alive, swaying in an acid breeze, but the pictures on the TV remained unwarped and boring. </p><p>We resorted to verbally bashing the terrible writing in the movie, and the false portrayal of street racing, and soon even that got old and we could no longer stand the crappiness of the movie.  I really liked the movie before, but on acid its worse qualities were amplified, and it became quite an unenjoyable experience.  We turned it off, and watched Comedy central instead.  I decided to test my reading ability on acid, and started to read the ingredients list on my bottle of Gatorade.  I knew the words, and I knew what they meant, but every attempt I made to interpret them correctly only resulted in the revealing of a hidden message under the words, which was much more important than ingredients.  One of my other friends showed up and it was time to smoke again.  We passed around S' new glass pipe, packed with a full bowl of some dank Humboldt herb, which definitely kicked mine and K's trip into a higher level.  We sat around conversing, and telling stories, me and K producing the least coherent comments, but still we had a lot of fun and did a fair amount of laughing. </p><p>Me and k were both pleased with the strength of our trips, only expecting to find about half a hit of acid in the capsules, we felt like there was about one full one.  Blackholes absorbed every bit of movement as it slowly died away, and numb faces regained their feeling, as the acid began to leave us.  Departing with such wonderful chemicals is always so sad.  I know I will find it again, but when I feel its power start to die, I can't help but wish it would stay longer.  Longer.......  K stood up looking at his watch, and announced that it was time for him to head home. I stood to meet his handshake, and mentioned something about smoking one more time before he had to quit.  He said that that night was his last.  'So this is the last time we'll smoke together?' The question was more of a statement.  Neither of us had realized it until that very moment.  For 2 maybe 4 years we would never share a spliff, drop the gravity bong, or smoke a blunt together. </p><p>I love K like a brother, and we have been through a lot together - probably in past lives too - good and bad we have seen it all.  The first time I ever got stoned he was there, the first time I did X, mushrooms, and LSD he was there.  How could I spend the next few years doing these things with out him?  The thought of not smoking with him for a long time almost made me want to cry.  He would still be around, and we would still hang out a lot, but smoking herb is an important part of life for me, and for him too so it was just sad to see him lose the privelege, and to know we won't be able to partake of the herb together for a time.  We both remained standing, he looked like he really did not want to leave knowing well what it meant the end of.  He lingered for a few more seconds, then realized it really was over, and he had to get home, so he continued on his way out.  I said 'Peace' mentally and wished him luck on his journey into sobriety.  A very sad farewell indeed (despite it's temporary nature,) to my favorite and dearest trip-partner.</p>",
 "year": "2001",
 "id": "11920",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-12-21T08:00:00.000Z",
 "views": "5212",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "LSD",
   "form": "(capsule)"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 }
}
