{
 "id": 11938,
 "title": "The Superman Effect",
 "date": {
  "submission": "2008-11-03T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "c07",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": " T+ 0:30",
   "administration": " ",
   "substance": "insufflated"
  }
 ],
 "report": [
  "[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Cocaine was not on the schedule for that Friday night. Another average night out with my friends, but I was driving. So I wanted something other than alcohol to get high off, namely cannabis. All times are approximate.  At the time of this experience I was 17.",
  "At the first bar we got to I met T, an acquaintance I wasnt very familiar with. After smoking a joint in the bar garden he informed me he had some coke on him and asked whether I wanted a few bumps; I accepted. I had never done coke before but had wanted to try for some time. We went outside into some alleyway, I couldnt feel any of the effects of the cannabis; I was overcome with nerves. I guess the constant indoctrination in youth against hard drugs came into an effect as I couldnt stop shaking. I blamed it on the cold to save face.",
  "We used a phone light to see and he offered me to go first. I used my house key to scrape up a small bump and held it up to my nose and sniffed. It didnt burn or anything. I rubbed some all over my gums and it instantly became numb, but it felt wonderful. The rush started to hit me as I was walking away after approx 2 minutes, and whenever I inhaled it felt like I was breathing ice. It felt absolutely brilliant though. My head felt like it was floating.",
  "T+5: Me and T started chatting about random stuff and I felt a really strong bond. This never would have happened normally so I think the cocaine was taking effect. He offered me his jumper seeing I was cold, insisting I have it. I never would have normally considered him this friendly. We went back inside the bar and I felt really confident and chatty. I was meeting new people and chatting with them as if I had known them for years. My nose started to clog up which was unpleasant. Some people needed money so I offered them a lift.",
  "T+10 Two in the back and T in front, we took a drive to the bank machine. For some reason I insisted he have my phone holder in the shape of a driving seat, because I saw him looking at it. I dont know why I did that, because I really liked it. But at the time I felt I wanted to give someone else happiness.",
  "T+15 I drive increasingly aggressively after we find out the first bank machine is broken. I was getting rushes and tingles down my spine. The coke made me reckless. I was driving too fast for the roads. Why could I not stop laughing? I didnt have any perception of danger, or feel any fear in my gut. Cocaine made me feel invincible. Everyone in the car was coked up and encouraging me to speed. I get in a race with a mini cooper but it was wayyy to fast for me. Although my perception was skewed, my driving skills felt at 110%. Fast speeds felt slow to me and my reactions were quick. I am never normally an aggressive driver, but I felt the urge to go faster and faster. Im not proud of it, but doing 120 mph down the motorway felt brilliant. I was getting such a buzz out of it. T was laughing uncontrollably. I kept burning through cigarettes, about 1 every 10 minutes.",
  "T+30 We got cash and got back and I was still feeling it a lot. T wanted to do more, and we looked around to buy more as we had nearly run out.",
  "T+45 We get a gram of coke and split it, I go home. Lots of people wanted a lift, but they were too drunk and I didnt know them before that night, so I ditch them. I dont take any more coke and go straight to bed.",
  "Morning after:",
  "Finished off the rest of the coke in the morning, it was clearly way under half a gram. Felt fine all day, and tired for sleep. I sleep fine. Day after that didnt experience any crash or comedown.",
  "Overall a good first experience, I liked the feeling of invincibility. But its not a drug Ill do too often."
 ],
 "erowid": {
  "id": "74623",
  "citation": " c07. \"The Superman Effect: experience with Cannabis & Cocaine (ID 74623)\". Erowid.org. Nov 3, 2008. erowid.org/exp/74623",
  "substance": "Cannabis & Cocaine",
  "views": "33678"
 }
}
