{
 "id": 11939,
 "title": "Pretty Good, No Complaints",
 "date": {
  "submission": "2003-06-09T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "merlin",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "capsl"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "capsule"
  },
  {
   "time": "0:30",
   "amount": {
    "number": "2.5",
    "unit": "g"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "The names used are fake.",
  "Out of the clear blue, one thursday a good Friend of mine (who we will refer to as Jake) informed me that we were making a trip up to our friend Felix's cabin for a hippy flipping adventure. Since I had never tried hippy flipping, but was familiar with the effects of mushrooms and MDMA separately, I agreed to accompany without a second thought.",
  "Felix's cabin is located in the gulf islands, a chain of absolutely gorgeous, sparsely inhabited islands nestled in between vancouver island and the mainland. These islands have been the location of some of my more memorable psychedelic experiences.",
  "I met up with Jake & Felix after work on Friday, in addition to Candice and Zack and we made our way towards the ferry.",
  "On board the ferry, we met up with Jake's good friend Leslie and we, as a group, establish that there must be one basic ground rule for this experience: that nobody would attempt to go swimming in the ocean.",
  "We made it to the island and Felix's cabin, where we met up with Lorena and Stephanie who live on the island.",
  "We hung out on the porch for the afternoon watching the ocean view as the sun came down. We smoked a few bowls, ate dinner, then decided it was time to get down to business. Jake issued me about an 1/8 of mushrooms and Candice gave me a cap of MDMA.",
  "Both Jake and myself put our mushrooms in a coffee grinder, and then put the powder inside a sandwich. It was actually a pleasure to eat. Felix, Zack, Leslie, Candice, and Lorena also ate mushrooms.",
  "Upon Lorena's recommendation, we went down to a small clearing in the middle of the woods to smoke a joint. Jake & myself couldn't help but laugh the whole way there as everyone was tripping over the foliage and couldn't see anything as it was pitch black. We finally made it to the clearing and found to our chagrin that the joint was poorly rolled and wouldn't stay lit. The shrooms were starting to kick in so naturally this all seemed incredibly hilarious.",
  "Jake recommended that we take the MDMA about 20-30 minutes after the mushrooms, so that the peak effects of both substances would occur at more or less the same time. Having been sitting in that clearing for about ten minutes, we decided to head back. When we made it back to the road I noticed the open-eye 'patterned' visuals which I normally associate with mushrooms were starting to develop. And the stars began to give off very distinct halos.",
  "We made it back to the cabin and myself, Jake, Felix & Candice took one cap each of MDMA. We all decided to make our way down to the beach.",
  "The walk down included much shroom-induced behaviour such as walking in front of another person and stopping frequently so as to make them stumble. This of course caused great laughter and was generally well received.",
  "We made it to the beach, which is a wonderful place. Where the water meets the land there are wonderful rounded rock formations caused by erosion. And various plants and grasses poking up through sporadic cracks in the rock. I guess there really isn't any way to acurately describe it.",
  "As soon as we made it down to the rocks we sat down and admired the night. I looked up, and my vision was suddenly flooded with visuals, the sky was covered in gorgeous waves of purple. It took me a moment to realize that this was the tail end of a meteor shower, and that the purple was not mushroom-induced. I had to confer with everybody on this. And they all agreed it looked very real. Nonetheless, it was quite incredible.",
  "Jake at this point seemed to be preoccupied with lying on his back and pulling on some weeds.",
  "At one point Leslie tried to go swimming, but when reminded of our rule, informed us that she was not swimming but 'wading'. Seemed fair enough to us.",
  "At this point I was having trouble determining through the mushroom induced fog whether or not I was feeling the MDMA. Looking back, I can pinpoint the exact time that it hit me, but at the time, I couldn't tell.",
  "We began walking back from the beach, and as we passed through a pitch black stretch of pine trees, the world disappeared, everything was visuals, Jake and Felix were experiencing the same thing, and as we made our way back into moonlight we were trying to sweep the visuals away using our arms. You'll have to imagine for a moment three young men walking through the night laughing hysterically and waving their arms in front of their face. After that, I noticed how much I had appreciated that moment with the visuals, and how good it felt to laugh. It was the MDMA. I suddenly felt compelled to kneel down and touch the ground, in extreme appreciation for the Earth. I wanted to simultaneously hug every tree in sight, since they had all contributed so much to the good vibe of the evening.",
  "Jake & I had a good talk about movies and coined the eternal expression 'pretty good, no complaints'. Which stemmed from us walking down the road which huge grins on our faces and making emphatic hand gestures while intentionally understating how good we felt. 'Pretty Good, Jake!' 'No Complaints my friend!'.",
  "As time progressed, the visuals became larger, more intense, and more beautiful. The visuals always seemed to reflect the mood, they were always in context. The most memorable one for me was a giant sun, the kind you see in cartoons. A giant golden ball with wavey lines shooting outward and a big grinning face.",
  "We talked about how a large part of the good feeling was the environment, and the group of people, many of whom had never met but got along extremely well.",
  "We made it back to the cabin and put on a Derrick Carter CD Felix had made, which became the staple of that evening. We alternated dancing in the large clearing of long grass in front of the porch and smoking joints in folding chairs in the clearing. We couldn't get enough of the long grass.",
  "We went back down to the ocean later but decided to sit out on the dock instead of the beach. We heard a bizarre lapping noise coming from the land, and thought originally it was a deer drinking. This didn't make any sense however, because it was salt water. We shone the flash light on where the noise was coming from. We all saw the same thing: a giant beast, a monster. I added that it appeared to be covered in eyes. We ran back down the dock laughing ourselves to the threshold of insanity.",
  "I had many incredibly interesting conversations with pretty much everybody that evening. And everybody contributed to a small book which we had been writing in for all of our mushroom experiences. When we read that book today, everything in it is still as potent as the night it was written.",
  "All of a sudden, a great light filled the clearing. It was the sun. That was without a doubt the fastest night of my life.",
  "I felt wonderful for the next three days and the ferry ride back home was a wonderful time of reflection. That evening created something inside me which I still carry to this day. Being able to see the world and other people in that way validated my existence."
 ],
 "erowid": {
  "id": "7465",
  "citation": " merlin. \"Pretty Good, No Complaints: experience with MDMA & Mushrooms (ID 7465)\". Erowid.org. Jun 9, 2003. erowid.org/exp/7465",
  "substance": "MDMA & Mushrooms",
  "views": "10308"
 }
}
