{
 "id": 11933,
 "title": "Many Voices",
 "date": {
  "submission": "2010-06-25T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stevenson",
  "gender": "Male",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "DMT",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Morning Glory",
   "form": "extract"
  }
 ],
 "report": [
  "I've been screwing around with snuffs, in an attempt to make the perfect cheap snuff to replace marijuana. I think I've finally found it. For a while I've been using the DMT snuff during daily activities. Most people say it sends them into a trance, but for me it makes me much more active, and much more a part of the real world. I've used it at work when there isn't a private bathroom provided to smoke weed, even while taking long bus rides. But, it's not something I like to relax to, so I knew I needed to add something.",
  "A few weeks ago I got my hands on 2lb of morning glory seeds.  I made an extract, removing the bad stuff with a non-polar solvent first, threw most of the liquid form in a vial and used salt to help evap the rest. For some reason, without the salt, the extract REFUSED to evap. It was still not dry completely when I decided to scrape up some of the salt. I wasn't sure what was running through my mind, but I mixed a few mg of it with a few mg of dmt and insufflated the mix.",
  "It was incredible. Auditory hallus came on quick. I needed to turn off my tv IMMEDIATELY. The lights were next, as they were repressing visuals. My mind was swarming with all the knowledge I've ever gained, all the memories I've ever had, I fell into a trance, ocassionally launching my entire body from one place to another, which is actually quite normal to me, as I am a contortionist. I could see creationism, I could see evolutionism, I watched both happen as if I was there. I got answers to questions about life, about love, about happiness. I watched figures form in the darkness with quiet admiration, I heard voices, some loving, some hateful, some memories from times long past and dearly missed. I wondered if this was what people meant by the old cliche 'Life was passing before my eyes.' But, it wasn't just my life.",
  "I drifted off into sleep, enjoying incredibly vivid dreams until I was ripped out of sleep by a knock at the door. I dealt with it, and went back to laying down. The voices, the images seems to carress my body, my mind, my very soul. I drifted off again, more incredibly vivid dreams. This isn't a good thing for everyone, but I strive for vivid dreams, without differentiating between nightmare and dream. Another knock at the door. My heart was running at at least 80 beats per minute. Mine usually runs at a cool 50, with my temp usually being a cool 96.5.",
  "I couldn't remember which way the door was, and the dream shifted seemlessly into visuals. I called out 'What do you need?' They needed a ride, or for me to cook dinner, or for me to to go back to dreaming.. I wasn't sure which voice to listen to so I told them I just awoke from a nightmare and didn't have the ability to. It had to be at least 6 in the morning, and I had taken the tiny combo at around 1. Back to sleep, to more vivid dreams, until about 8 AM when my dog woke me up. I was sober, and felt incredible. My mind buzzing with the events of the past few hours. I let him in, and drifted back to sleep holding him gently.",
  "In conclusion, I think I've found my replacement for the overpriced marijuana, and I knew I had to share this mixture with the world. I'll be continuing to make a decent amount of this snuff, and probably will end up carrying it around with me wherever I go. For me it was a great experience. I've been experimenting with, basically, random things since I was 12, marijuana being a constant the whole time. I yearn to expand my mind at every possible oppurtunity."
 ],
 "erowid": {
  "id": "74581",
  "citation": " Stevenson. \"Many Voices: experience with DMT & Morning Glory (Extract) (ID 74581)\". Erowid.org. Jun 25, 2010. erowid.org/exp/74581",
  "substance": "DMT & Morning Glory (Extract)",
  "views": "3725"
 }
}
