{
 "id": 11949,
 "title": "The Chronic Wonderland",
 "date": {
  "submission": "2013-11-21T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Icky Mcsticky",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>I've been smoking cannabis for the past nine years. I'm 29 years old. I've done salvia; opiates; alcohol; nitrous oxide gas; dextromethorphan; 'antidepressants' such as desyrel, buspar, etc; diphenhydramine...",
  "My first experiences with cannabis were immensely mind-blowing, showing me an entirely different way of looking at reality. But over the years I became so accustomed to the psychedelic effects of the mild-to-weak potency stuff I was getting that being high eventually became my normal state of mind, and I'd feel anxious and slowed down when I couldn't get any.",
  "One experience with the chronic (high-grade hydroponic stuff) made me realize the overwhelming potential was still there, but I never had enough at one time to fully trip out. Whenever I'd run out, and go without (against my will) for a few days, maybe a week or two at most, I'd feel a taste of that origianal, glowing force again, but soon I'd be back in my rut of 'staying high'Barely appreciating the plant's effects as anything but a means to shutting out the boredom and tedious frustrations of waking reality.",
  "Then, this year (2008), my connection suddenly dried up, and I was left without cannabis for over a month. I went through a brief, irritaing 'withdrawal', and I knew that when I finally got some it was going to be intense again, but I had no idea it was going to be an entire quarter-ounce of the most potent, crystaline chronic imaginable!",
  "The stuff was expensive, but well worth it. I took one look at the bright green, purple-and-orange-haired, THC-crystalized buds and knew this was going to be intense. After one hit I was flying. The second hit brought on orgasmic waves of electric pleasure, lighting up all neural connectionsSure enough, I was rambling like a first timer. Successive hits blasted me with rushing waves of paranoiac death-fear (pleasurable at the same time). I put a Tricky (Adrian Thaws, not that new rip-off who stole his name) mix CD and sat on my bed Indian-style, spouting every thought that came into my head a hundred words per-minute. The buzz was intense.",
  "My cat jumped on my bed and suddenly it occured to me to start writing a new Alice story. I grabbed a red sharpie marker and my steno-notebook and the first dozen pages flowed out of me like dictation. A recent dream in which I kept 'waking up' over and over, only to realize I'd still been dreaming recurred to me, and I knew this would make the perfect plot-device; every morning Alice awakens to realize the previous day had been 'only a dream'But the further back her memories go, the less certain she is of whether something was really a dream or notI haven't been excited enough to write longhand in yearsBut it's like a puzzle, I keep automatically returning to our 'Real Rord vs. Multiple Dream Worlds' dichotomy, contradicting myself, and having to scribble things out... (I actually enjoy WRITING longhand, it's reading and transcribing it onto the computer which I find torturous)...",
  "Anyway, I now intend to use cannabis respectfully, like I use salvia; maybe once a week or so, getting the full effects, and learning from each experience, instead of puffing away constantly every day, and burning myself out on it. This is a wonderful and powerful plant, and it deserves much respect.</p>"
 ],
 "erowid": {
  "id": "74736",
  "citation": " Icky Mcsticky. \"The Chronic Wonderland: experience with Cannabis (ID 74736)\". Erowid.org. Nov 21, 2013. erowid.org/exp/74736",
  "substance": "Cannabis",
  "views": "631"
 }
}
