{
 "id": 1194,
 "title": "Relaxing, Lightheaded, Synergistic with Booze",
 "date": {
  "submission": "2003-11-26T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RBO",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 Tbsp",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "(extract)"
  }
 ],
 "report": [
  "I ordered 10 grams of dried Blue Lotus (Blue Lily of the Nile).  I soaked 2 tablespoons of the dried plant material in perhaps a cup of Bacardi 151 proof rum, and left it sitting for a couple days.",
  "I strained the liquid, squeezed well, then soaked and squeezed again.",
  "I drank 2 tablespoons of the resulting extract in a glass of diet coke (with a small amount of granadine to sweeten the taste).  It was quite easy to drink.",
  "The full effects were felt perhaps an hour or so after ingestion.  Quite a relaxing feeling, like a good intoxication.  I do not believe there was anywhere near enough alcohol content in those 2 tablespoons to account for it.",
  "It was an extremely lightheaded feeling, dizzyness, generally pleasurable.",
  "The next day I still felt some lightheadedness, though surely not as pronounced, leading me to wonder if the residual effects have to do with the drug not being cleared from my system, or if they are the result in some other chemical balance changes resulting from the experience.",
  "Slept well, no ill effects.",
  "Also, on another evening, tried to make a tea from about 1 tablespoon of dried plant material.  Lighter overall effects, though similar to the other experience.  Drank a few glasses of port following that, hugely synergistic, much more of a buzz than should have been possible with 2 small glasses of port."
 ],
 "erowid": {
  "id": "13500",
  "citation": " RBO. \"Relaxing, Lightheaded, Synergistic with Booze: experience with Blue Lotus (ID 13500)\". Erowid.org. Nov 26, 2003. erowid.org/exp/13500",
  "substance": "Blue Lotus",
  "views": "27089"
 }
}
