{
 "id": 11951,
 "title": "Positive and Mild",
 "date": {
  "submission": "2010-07-10T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kierkegaard",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "substance": "Vitamins / Supplements",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "repeated",
   "substance": "Aniracetam",
   "form": "capsule"
  }
 ],
 "report": [
  "The main intention of this experience report is to describe the effects the nootropic drug Aniracetam has had upon my cognitive performance in school and in life, as well as the physical symptoms experienced with the mentioned drug.",
  "Before starting my almost daily regimen of the drug, I had been using 3000 mg of Omega-3 Fatty Acids and Ginkgo Biloba for about 5 to 6 months. For a month prior to starting Aniracetam, I added a B-12 Complex vitamin to my regimen. These supplements were being taken on almost a daily basis.",
  "The first time I ingested the 750mg capsule of Aniracetam, I noticed a significant boost in mental energy. I received the energy and the motivation to complete much of the work planned for the next few days. However, this intense motivation did not last after I re-dosed the next day.",
  "I usually doses at a 750mg-1500mg, depending on the task at hand and the supply of the nootropic available to me. The effects of Aniracetam may be felt for about 3 hours.  During that time, there is an increase in mental energy and thoughts remain intelligent, not just hyper. Although it is difficult to tell if there is a significant long-term improvement, my papers have become stronger (according to professors and collegues, although this may be a normal improvement and not entirely attributed to the nootropic) and I feel more intelligent. Furthermore, I feel much more social, confident and happy with the drug. I no longer suffer from a mild depression and feel open towards professors, collegues, strangers and friends.  Dreams also become extremely vivid, and completely non-lucid.",
  "The drug has not acted as a miracle worker, but it has aided and assisted me in achieving certain goals. The drugs effects are much more than subtle (in contrast to piracetam) but it tends to be more expensive than piracetam as well. The symptoms of the drug have been relatively positive and mild. My only concern is a more deep or heavy pulse and heartbeat. I will likely discuss this with a doctor during an upcoming visit. Furthermore, when the drug wears off there tends to be some slight brainfog, exhaustion and blurry vision (perhaps due to lots of reading). Ive read that Choline supplementation may reduce this effect, and I have found drinking coffee afterwards helpful."
 ],
 "erowid": {
  "id": "74743",
  "citation": " Kierkegaard. \"Positive and Mild: experience with Aniracetam (ID 74743)\". Erowid.org. Jul 10, 2010. erowid.org/exp/74743",
  "substance": "Aniracetam",
  "views": "13628"
 }
}
