{
 "id": 11954,
 "title": "Conciously Dying",
 "date": {
  "submission": "2011-08-24T07:00:00.000Z",
  "experience": "1997-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kris",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25"
   },
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "[Erowid Note: While the author reported the substance used as 5-MeO-DMT, he refers to 'DMT' within the report. 5-MeO-DMT and DMT are different substances entirely and their names are NOT interchangeable. This report is categorized as a 5-MeO-DMT report, and it is assumed that the author means 5-MeO-DMT and not DMT.] ",
  "I had been studying the effects of DMT for some time before I tried it, and lucky I did, for I could not imagine being thrown into something like this. Luckily I had an experienced journeyman by my side to guide me or else I would have had a tough time.",
  "I sat back on the couch and took a hit of what was nothing smaller than a sugar in the raw grain, and instantly upon exhale the effects were on me. I was staring at the wall in front of me and still can't discern weather the wall slammed me or vice-versa. But the force at which the effects were thrust into me was intense. I stood up holding my head as my thoughts began to echo louder until my own repeated thoughts became a deafening roar. I felt my ego slip away and this began to frighten me. I remember thinking this was odd because I was still in control of myself and my thoughts (with great difficulty) while my vision was blinded by the brightest white light I have ever seen. I turned to my guide and proclaimed (quite matter of fact, I was told) 'I'm Dying'.",
  "I then began to feel nauseous, and experienced extra sensory perception. I could not see anything but managed to avoid all obstacles and make it to the bathroom to vomit. What came next frightened me the most. I began feeling waves in my body that started in my back and worked their way to my chest which I immediately associated with my soul leaving my body. I grabbed my chest and began to try and physically 'force' my soul back into my body.",
  "Although I was scared at the same time I felt pure joy, and have never felt as happy and when my vision came back and reality returned I felt completely euphoric. I believe the trip was 5 minutes and 36 seconds long."
 ],
 "erowid": {
  "id": "74755",
  "citation": " Kris. \"Conciously Dying: experience with 5-MeO-DMT (ID 74755)\". Erowid.org. Aug 24, 2011. erowid.org/exp/74755",
  "substance": "5-MeO-DMT",
  "views": "2583"
 }
}
