{
 "title": "Flashbacks",
 "author": "Doors_of_Perception",
 "citation": " Doors_of_Perception. \"Flashbacks: experience with LSD, Mushrooms & Cannabis (ID 11969)\". Erowid.org. Apr 10, 2007. erowid.org/exp/11969",
 "substance": "LSD, Mushrooms & Cannabis",
 "bodyweight": "160 lb",
 "report": "<p>I recently began to experiment with hallucinogens. I have done LSD 7 times and mushrooms 3 times now. All of the experiences have been positive, although I wish I would have tried mushrooms before LSD. LSD is a much more hard drug than mushrooms and my shroom experiments seemed insignificant compared to my LSD trips. My doses for shrooms were from 2.5-7 grams and lsd from .5 of a hit to 1.5 hits. I have decided not to take large doses of LSD as my friends who do LSD, quickly increased their dose and now complain of tolerance. The next time I trip with a friend I will definitely increase my dose to 2 hits, but for now 1 has been fine. Tonight I'm planning on taking 1 hit, this being my first trip alone.</p><p>In the past month I have had 4 flashbacks. I had none prior to this, although the first time I did LSD was 4 months ago. My first flashback happened while sleeping. I remember thinking I had just awoke in my bed. Getting up, I noticed a huge design on my wall, a red viny square. The vines seemed to be moving around the square perimeter. At this time I felt as if I was on LSD and knew I was having a flashback. Not only was I hallucinating but the high was evident as well. This is all I can recall of my first flashback although I remember feeling as if I had awoken from the flashback, only to realize I was still sleeping and being swept into another flashback. This happened several times before I finally woke up. During the flashback I felt a little frightened, but upon waking up and thinking about what had just happened I felt fine.</p><p>My second flashback also happened while sleeping. I can't recall much of what happened during this experience, much like the first flashback. The same thing happened, I felt as if I was awake as the LSD high swept over me. All I remember was my lamp, which is actually in the opposite side of the room  from where I was, was on my dresser and biting me. I then unplugged it to stop it from biting me but it continued. This flashback was a little more frightening but again, upon waking up I felt fine.</p><p>A few days ago me and a friend decided to pick up some bud. My school had recently been under investigation by a nark posing as a student and busted 9 drug dealers and scared most of the other dealers out of their jobs. Bud has been quite dry so I haven't smoked as much as usual lately. That was most definitely the reason I had gotten a lot higher than normal off of quite a normal dose of 1.5 gs to be shared between me and my friend. I also have learned it's much better to hold in your hits until the pipe comes back to you, definitley increasing my high as well. Once the weed was done we went to his a room, a room I have tripped on LSD before.</p><p>I started to notice his very colorful wall paper started to glow and I even noticed some colors that I had never even seen on his wall paper before were standing out. Everything seemed quite normal and I didn't think I would be having another flashback, until the colors on the wall seemed to be moving and blending together, as they had while tripping in his room. At this time I told my friend I was seeing shit on his wall and he told me my pupils were dilated. I did not know that pupils became dilated during a flashback? During this flashback I did not feel frightened. Probably because I was awake and in more control. After a minute or two of moving colors, things gpt even more weird. When I looked at my friend, he looked exactly as he did when I looked at him on acid earlier. I can't explain the way he looked except that he looked small and he's 6'5'. His room looked very large, even though it's small and I felt tiny.</p><p>Two days later me and the same friend picked up 2 grams of some wonderful smelling blueberry bud. Again, we went into his room feeling quite high. I felt tired so layed down looking at his ceiling. Theres a water stain on his ceiling from rain and the stain started to take the shape of many worms crawling out the ceiling. My eyes dilated again and colors seemed brighter. I was half asleep during most of this flashback and noticed many closed eye patterns, much more intricate than the usual visuals anyone sober will see with closed eyes. As well during this flashback I remember seeing green and purple patterning over everything reminding me of shrooms. I have never heard of anyone having flachbacks due to shrooms, but these patterns were not acid-like and I had seen these exact patterns while on shrooms before.</p><p>All of my flashbacks have been positive experiences. While sleeping the flashbacks were much more intense, but more frightening. While awake the LSD high was not evident but it was evident of patterns and movement of colors. These experiences have not changed my thoughts on LSD, and I will continue to experiment with this wonderful drug.</p>",
 "year": "2001",
 "id": "11969",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-04-10T07:00:00.000Z",
 "views": "6407",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "",
   "substance": "LSD"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "",
   "substance": "Mushrooms"
  }
 }
}
