{
 "id": 11967,
 "title": "A Drunken Mistake Turned Amazing",
 "date": {
  "submission": "2010-07-21T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Khanz",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Methylphenidate",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "750 ml",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "215 mg",
   "administration": "oral",
   "substance": "Mirtazapine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "In late 2007 my doc gave me a bottle of 15 mg remeron tablets for depression and insomnia. I tried taking half a tablet the first night, as instructed. They worked extremely well but I awoke the next morning feeling extremely hung over. So I decided to stop taking them. I had the bottle sitting in my bedside table until one night in the early summer when I was out drinking and partying. I had drinking quite a bit, about 3/4 a liter throughout the night. Finally at about 1:30 am I decided to go home and go to bed. I got home brushed my teeth and changed into my pajamas and went to bed. Unfortunately I had forgotten that I took one of my brothers Ritalin (60 mg's) for work earlier that day. I lay awake for about 30 minutes trying to fall asleep until I had a 'great idea'. I remembered that I had a few remeron in my bedside table. Since I was decently intoxicated I didn't have very good judgment so I decided to take the whole bottle. That's where my story begins:",
  "(2:30) Decently intoxicated, just took 215 mg's of remeron tablets.",
  "(2:45) Feel a bit drowsy, don't know if its from the booze or remeron.",
  "(3:00) I tried to go upstairs to get something to eat. I only made it to the couch before falling over and getting extremely confused.",
  "(3:15) Stumble back in bed not really caring about anything. Suddenly I get this extreme euphoric feeling. Similar to xanax except more physically exhausted.",
  "(3:20) I can't move. I'm frozen solid in a dream like state similar to ambien except way more intense. My lamp is appearing to melt and the walls of the room sway with each blink of my eyes. I feel on the enclosed in this frozen world forever. I close my eyes, and suddenly feel connected to my mattress. There is a kaleidoscope of colors. This is where my memory fades.",
  "(5:00 p.m. the next day) I finally awake dead state and feel physically and mentally exhausted. I suddenly realize that I work at 5:30 and 'scramble' out of bed. I stumble upstairs and into the shower. I feel like I am straining every muscle in my body just to stay standing. Suddenly I fall over. I finish my shower with much difficulty and realize that there is no way I could go make pizzas at my work. I decided to call in sick. Good thing I did because I was in no state to do anything. I ended up watching TV on the couch until about 10:00 then fell asleep. I awoke the next day at about 10:00 a.m. feeling fine.",
  "In conclusion I realize how stupid taking a bottle of sleeping meds and drinking was. I researched their drug interactions with one another and found out I was lucky that I didn't die."
 ],
 "erowid": {
  "id": "74861",
  "citation": " Khanz. \"A Drunken Mistake Turned Amazing: experience with Mirtazapine (Remeron), Alcohol & Methylphenidate (Ritalin) (ID 74861)\". Erowid.org. Jul 21, 2010. erowid.org/exp/74861",
  "substance": "Mirtazapine (Remeron), Alcohol & Methylphenidate (Ritalin)",
  "views": "8311"
 }
}
