{
 "id": 11970,
 "title": "SmartPharm Gumbo",
 "date": {
  "submission": "2012-02-24T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "jphilosoph",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Modafinil"
  },
  {
   "time": "0",
   "amount": "T+ 2:00",
   "administration": "100 mg",
   "substance": "oral"
  },
  {
   "time": "Modafinil",
   "amount": "",
   "administration": "T+ 2:00",
   "substance": "800 mg"
  },
  {
   "time": "oral",
   "amount": "Smarts - Oxiracetam",
   "administration": "",
   "substance": "T+ 5:30"
  },
  {
   "time": "4 mg",
   "amount": "oral",
   "administration": "Pharms - Lorazepam",
   "substance": ""
  },
  {
   "time": "8:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Smarts - Phenibut"
  },
  {
   "time": "0",
   "amount": "T+ 8:00",
   "administration": "100 mg",
   "substance": "oral"
  },
  {
   "time": "Modafinil",
   "amount": "",
   "administration": "T+ 0:00",
   "substance": "20 mg"
  }
 ],
 "report": [
  "General Facts:",
  "I'll note that the only thing I am prescribe of this concoction is Lexapro which I got on a little over a year ago after spending several years on St. John's Wort & other remedies for a diagnosis of PTSD & moderate depression.",
  "I'm familiar with many substances from E to Acid to AMT to Shrooms & Herb.  Years since I've been into that or any hard stuff. I'm more interested now in nootropics (smart drugs) for day to day life enhancement. ",
  "So my pops was away for a day to attend a seminar on Huntington's Disease (if any of you are familiar, it explains my interest in nootropics) so I decided to take a day concocting a mix of supplies I had on hand.",
  "Experience:",
  "8:00 am - 200mg Modafinil",
  "Modafinil is a fantastic substance almost a dream drug but one of the few downsides is that its effects taper with long term usage.  If used daily for a month its only about half as effective.  But this was a recent acquisition for me and I hadn't taken any in about 6 wks or so.  20 mins after I popped the pills, I began to feel the usual warm awareness & slight euphoria bubble up.  I listened to some music which can sound a lot better on modafinil & messed around a bit on the comp.",
  "10:00 am - 100mg Modafinil, 800mg Oxiracetam",
  "This is way better than folgers in your cup.  Just a little booster to keep the morning cruisin. Oxiracetem works gives me a little kick in the pants (motivation/energy) not on the level of modafinil but it adds lucidity too.  After a little while of flying through some chores, and a lot of errands my responsibilities are done so....",
  "1:30 pm- 4 mg Lorazepan",
  "This turns out to be not what I expect.  I know I had done it once upon a time long long ago & it seemed pretty fantastical.  Unfortunately about all I really noticed was a return to nomal energy level & total lack of anxiety (might've killed any possible post-modafinil shakiness) but no real body high or any high of any kind that I'd remembered. Minor downer...",
  "4:00 pm - 1g Phenibut & 100mg Modafinil",
  "In an attempt to finish my gumbotrip on a brigher note I add 1g of Phenibut & 1 more pill of moda.  Managed to give the trip an oxymoronic feel.  Chilled out with the lorazepam & phenibut but still amp'd from the modafinil booster.",
  "It was pretty good all in all. I was totally coherent & functional & slight more than happy for the whole day.  Though I'd expected the lorazepam to have a larger effect,  So not mind blowing though If someone boxed this combo as a workweek survival kit I'd be first in line.",
  "Carry on!"
 ],
 "erowid": {
  "id": "74899",
  "citation": " jphilosoph. \"SmartPharm Gumbo: experience with Lorazepam, Modafinil, Oxiracetam, Phenibut & Escitalopram (ID 74899)\". Erowid.org. Feb 24, 2012. erowid.org/exp/74899",
  "substance": "Lorazepam, Modafinil, Oxiracetam, Phenibut & Escitalopram",
  "views": "3315"
 }
}
