{
 "id": 11971,
 "title": "A Temporary Loss of Self",
 "date": {
  "submission": "2002-02-15T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lo",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4.5",
    "unit": "seeds"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "ground/crushed"
  }
 ],
 "report": [
  "This is the only kind of 'psychoactive substance' I've ever taken, outside of alcohol and marijuana eaten or smoked occasionally.  I hadn't eaten for around 6 hours, so I thought it would be a good time to take some HBW seeds.  I'd tried the night before taking two, which brought about a general 'large-dose of caffeine' feeling, although this probably isn't a good description.  After carving off the outer brown portion of each seed, I chewed up and swallowed with water the white substance of approx. 4.5 seeds.  I wasn't taking any medications at the time, except some occasional 5-HTP.",
  "About an hour and a half afterwards, I started feeling a strange 'overfilled air balloon' feeling in the brainstem region, not very pleasant, and a slight nausea. I was at first unmovable and lethargic, and at once had this feeling like the regular 'me' wasn't there, that now, occupying my body was a non-entity, or a tree or something. I didn't want to address questions addressed to the 'me' that wasn't there. Emotions were flat, and everything and everyone seemed exactly 'as is' (almost as if normal hallicinatory experiences of everyday life are taken away). I also felt a compassion for 'humanity', since I didn't feel like a human. I also noticed, going for a walk outside, that after a couple hours, anything unfamilliar became frightening, and I needed a familliar setting in order to feel ok.",
  "A couple hours after this, sensations were extremely heightened, and simply lying in bed was wonderful; sheets and beddings were exquisitely comfortable, like I'd never before felt comfortable, *this* was comfort, as I resumed a strange legs-over head position (as my limbs felt virtually weightless). Touch from outer sources were felt throughout the whole body, and were almost as if coming from pleasure centers in the mind directly instead of through the skin.",
  "Overall, the intensity of the experience was almost too much to handle, but I'm glad I went through with it. I can definitely say it was good to have my boyfriend there with me, or the experience may have been *a lot* more negative. It can either be horrible or wonderful. It also made me think about things in a way I haven't thought of for that long of period - it is disturbing to loose a sense of oneself, but potentially enlightening as well."
 ],
 "erowid": {
  "id": "7493",
  "citation": " Lo. \"A Temporary Loss of Self: experience with H.B. Woodrose Seeds (ID 7493)\". Erowid.org. Feb 15, 2002. erowid.org/exp/7493",
  "substance": "H.B. Woodrose Seeds",
  "views": "12938"
 }
}
