{
 "id": 11979,
 "title": "Going on a Fox Trot",
 "date": {
  "submission": "2000-08-02T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "GoddessXTC",
  "gender": "Female",
  "weight": 50
 },
 "dose": [
  {
   "time": "0",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I took it orally, and after 45 min., I started to feel spacey, like I was high. 20 min. later, it fully kicked in. It intensified my senses incredibly, my mind felt like I had smoked myself beyond stupid (you know that feeling you get when you KNOW that you had smoked way too much weed and when you say anything, it's never comes out like it sounded in your head?), I had visuals, but not the type you would expect. I saw lots of movement in a dark room, thinking every person at the party was in there but when I'd switch on the light, there wouldn't be but 2 people. It had a very speedy effect, I was very hyper. All the foxy kids were bouncing off the walls. I had great tracers (along with everyone else) when we liquid danced with glowsticks to some solid techno. The sensuality was amazing. Definitely something to explore with your current love interest. I've heard several comments that sex was up to 4 times more intense on 5-MeO-DiPT than on Ecstasy.",
  "Overall, we all found it a very rejuvenating experience. The peak lasted about 2 hours and I slowly came down for another 4-6. In the comedown duration, I found myself speaking very openly to my friend Mindalynn. It was easy to speak to her and she responded in the same manner. The crackout wasn't tiring as found with Ecstasy or LSD, it was very calming, and we all decided that, soon, we were to be off on another fox hunt.",
  "The bad news about it? I felt sick to my stomach for a while, but eating really helps. Fasting for 12 hours before taking Foxy is a good idea. If you've never done speed, LSD, or Ecstasy before, this wouldn't be a good drug to jump into because in my opinion, the effects of 5-MeO-DiPT were similar to these drugs, and experiencing those similar effects all at the same time wouldn't really be good thing. You get the shakes. If you can get used to that, you'll be fine. Fair warning: Expect the unexpected."
 ],
 "erowid": {
  "id": "750",
  "citation": " GoddessXTC. \"Going on a Fox Trot: experience with 5-MeO-DiPT (ID 750)\". Erowid.org. Aug 2, 2000. erowid.org/exp/750",
  "substance": "5-MeO-DiPT",
  "views": "7738"
 }
}
