{
 "id": 11981,
 "title": "Passed Out But Not an Overdose",
 "date": {
  "submission": "2008-11-12T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "B.D.",
  "gender": "Female",
  "weight": 48
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.0 g",
   "administration": "oral",
   "substance": "GHB"
  },
  {
   "time": "4:00",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "GHB"
  }
 ],
 "report": [
  "Recently I signed up for a medical study involving GHB. I am a tiny female (5'1, 105lbs) and I have been given doses up to 9 grams from certified doctors. Mind you, I have been through several medical tests before given these doses but have been told that a generally healthy person with no respiratory problems, heart problems, or blood problems should have no problem taking this much GHB. I also had developed no tolerance to the drug before taking this amount.",
  "I was initially prescribed GHB during clinical research trials to see its effect on reducing pain and sleep problems with patients. After undergoing several tests (blood test, urine tests, and EKG), I was given the prescription for Xyrem and was told to take 6 grams directly before bed and set an alarm clock for four hours later, which I would take 3 more grams. Doses varied depending on what week of the study I was on. I initially started out with a dosage of 6 grams total a night for one week, and upped it to 7 and eventually mixed between 8 and 9 grams. Effects of such large doses hit me incredibly hard and I was definitely passed out, sometimes not even waking up for my alarm clock to take more. I have been told that GHB leaves the body within a few",
  "hours so the fact that I never had an overdose experience may be attributed to this. I can also imagine that people with faster metabolisms would be able to handle larger doses more frequently as well. In case of an emergency in the house, I would have definitely slept right through it so on nights I was supposed to take GHB, I warned my brother and asked him to check on me.",
  "Even under doctor's care, I was still timid to take the medicine without first informing those around me. It was impossible for me to stay awake on the 4 gram + doses of GHB except for one time when I experimented with a small dose with the intention of NOT going to bed. I believe I took 1 gram or 1.5 grams. I felt an overall feeling of being drunk with a sort of 'I don't give a damn' attitude but experienced none of the 'ecstasy' like feelings GHB has been known to induce. I'd also like to note that during this research study, I was not allowed to take any type of medication other than a small dose of Tylenol if ABSOLUTELY necessary and obviously was not allowed alcohol or other drugs. Therefore, I had no chance of having a reaction with any other drug or chemical in my body besides the food I ingested. I found that even if I ate right before taking my dose, because they were so heavy, the eating had little effect on the time of onset of the drug. Once I got to a certain point of taking between a total of 6 and 9 grams a night, it is hard to differentiate the effects as 6 grams made me pass out incredibly hard and 9 grams had the same effect.",
  "I would NOT recommend people taking large doses like this for recreational use and without doctor's care. It obviously helps for patients with insomnia and narcolepsy but I believe anything over than 6 grams is quite unnecessary unless a person is of large stature. Again, everyone's body is different and I am sure there are little to no recreational drug users who take blood tests, EKG's and urine tests before trying a new drug."
 ],
 "erowid": {
  "id": "75004",
  "citation": " B.D.. \"Passed Out But Not an Overdose: experience with GHB (Xyrem) (ID 75004)\". Erowid.org. Nov 12, 2008. erowid.org/exp/75004",
  "substance": "GHB (Xyrem)",
  "views": "8591"
 }
}
