{
 "id": 11987,
 "title": "An Interesting Test",
 "date": {
  "submission": "2013-11-16T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "anonamous",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate"
  },
  {
   "time": " T+ 0:30",
   "amount": "5 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate"
  },
  {
   "time": " T+ 1:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Pharms - Methylphenidate"
  }
 ],
 "report": [
  "<p>This is an account of taking methylphenidate hydrochloride USP (Ritalin) at low doses  with quite interesting effects.",
  "Over the past few years I have been experimenting with drugs beyond cannabis/skunk and by now have a fair amount of experience with alcohol, weed, ketamine, MDMA, speed, mushrooms and others. Just to say, I'm very much looking forward to taking hallucinogens, but after having a very bad experience with a large dose of what I stupidly assumed was MDMA crystals, I'm waiting until I am in a position to give proper time and respect something like LSD or 2CB, which are easily available to me.  Over the past year especially though I have been taking MDMA a little too regularly and subsequently the comedowns have become so harsh that it isn't worth the 'up'. Therefore I have been looking for alternatives that will still provide energy/euphoria and be suitable for raves with less unpleasant after effects. Hopefully if I find one good enough I can abstain from MD for several months, lower my tolerance, and get closer to those 'first time' highs, though I'm aware it's in question whether this is possible.",
  "About 3 weeks ago I was talking to a friend at a party who was clearly having a great time on some sort of chemical. I was amazed when she told me that she was on Ritalin, comparing it to coke or speed. I found this hard to believe since I always thought of Ritalin as a prescription drug that just made you concentrate a bit more.",
  "Spurred on by this, I went to a friend who I knew didn't take the Ritalin prescribed to him. He said that they made him feel anxious and a little stressed, so I thought it would be appropriate to test out the drug at a low dose before taking a large amount the following weekend at a Rave. He gave me 4 10mg pills of methylphenidate hydrochloride USP for free and promised as much as I'd like in the future.",
  "After reading up on the subject on this site, I thought 5mg snorted would be a good place to start from, considering that people seemed to be taking at least 50-100 mg to get really fucked up. So on a quiet Sunday with little to do I went ahead and snorted half a 10mg pill at approx 13:00, and 30 mins later felt pretty much normal. Then I did the same again, unsurprised that 5mg would have very little effect. 10 mins after this however I was absolutely amazed by the result. I was taking a lot of pleasure in everything e.g. smoking, drinking tea, listening to music and so on. This was not unlike mild MDMA effects but much cleaner and less overpowering. Unfortunately this enjoyment didn't last longer than 15 mins and I settled into watching a film thinking that was that.",
  "What I soon realised was that I was intensely concentrating on the film, to the extent that taking a 5 minute break for a cigarette felt like disconnecting from my own mind. It became apparent that without something to focus on, my mind was wandering very quickly and in a very disjointed fashion, and this was not really enjoyable. I decided that I should do another 10mg and see whether that would take me to a more enjoyable place.",
  "20 mins after this I was feeling very proactive, and set about getting music together to listen to, making food, pre-rolling cigarettes and so on; all to enjoy that initial 15 mins of euphoria I had with the first 10mg. However the second 10mg had no pleasant effects but quite a few bad ones which I'll list.Gurning/jaw clenching similar to amphetamines(which surprised me), lasting for many hours after this pointWaves of feeling hot then cold, going from sweats to shivering (this was more a mild annoyance than a serious problem, obviously MD gives much worse)Mild shaking and 'fluttery' feelingA very very bad mood (that felt like a physical cloud hanging over me)Mild paranoiaMuscle TensionAnxietyTwo things strike me about this. The first and most obvious is that this is almost identical to a comedown off MD, which is admittedly disappointing as I was hoping for no comedown at all. The second is how such effects could possibly happen over 20mg, such a small dose compared to the other reports. I am a fairly hefty person, and have not experienced any hypersensitive tendencies to anything before.",
  "This got gradually better as the day went on, and now at 22.05 I'm sure that getting to sleep will be a serious problem, not least because my tongue and jaws ache quite considerably from gurning as well as my brain feeling over active.",
  "Ultimately, the after effects of this drug have outweighed the benefits on this occasion. I blame this on two things. Firstly I have been pretty much alone today, just chilling at home; I'm quite sure that being with friends would provide the mind with the 'focus' that was lacking and made things slightly unpleasant. Secondly I did a fair amount of ketamine and drank quite alot of alcohol last night, and this could well have had a contributing effect.",
  "From this test I have decided that after all I will take Ritalin and in much larger doses this coming weekend but with a few additions. I'd have Valium (diazepam) for the anxiety and muscle tension, and a clean slate for the previous week with regards to alcohol/substances. I believe this will provide a cleaner and less comedown inducing 'up' than MD, even if it is not quite as wholesome a high as ecstasy can be. I think that while struggling to abstain from MDMA and wanting to lower my tolerance, Ritalin may be a serious consideration as a 'stop gap' drug.</p>"
 ],
 "erowid": {
  "id": "75070",
  "citation": " anonamous. \"An Interesting Test: experience with Methylphenidate (ID 75070)\". Erowid.org. Nov 16, 2013. erowid.org/exp/75070",
  "substance": "Methylphenidate",
  "views": "1371"
 }
}
