{
 "id": 12009,
 "title": "Seven Hours in the ER",
 "date": {
  "submission": "2008-12-16T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Propylhexedrine"
  }
 ],
 "report": [
  "I've tried benzedrex inhalers a few times. They keep me awake and alert and on occasion I've felt desperate enough to resort to them. I am an occasional recreational user of hard drugs. I do not use stimulants regularly.",
  "One day I decided to take 200mg of pure MDMA on a school night and stay up pretty late. The following morning I consumed one Benzedrex inhaler's worth of contents dissolved in soda.",
  "About 30-45 minutes after consumption, I began experiencing muscle spasms of the lungs and extreme dizziness.  A couple of hours later I was taken to the ER suffering severe respiratory distress, tachycardia, hypertension, muscle tremors, constipation, dimmed vision, intermittent hearing loss, mild hallucination, and loss of coordination. My resting heart rate upon admission was 150. After 2 doses of ativan, 4 bags of saline, and 7 hours on an oxygen tube, an EKG, X-ray, and CT showed no underlying cause, nor damage to my heart or lungs.",
  "The following day I went for a followup exam and my resting heart rate was still 100bpm. I didn't fully recover for 5 days.",
  "Benzedrex inhalers are extremely dangerous and I strongly discourage anyone from misusing them.  The process by which the cotton rods are dosed is questionable and I have read several anecdotal reports suggesting that the actual amount of propylhexedrine in a single inhaler varies significantly.  There are reports of intravenous abuse resulting in death, even in some cases more than 24 hours after injection. [https://erowid.org/references/refs.php?A=SearchAll&S=propylhexedrine] Oral consumption probably won't kill you, but you may end up in the hospital.  Don't take the risk, it's not even close to worth it."
 ],
 "erowid": {
  "id": "75237",
  "citation": " Anonymous. \"Seven Hours in the ER: experience with Propylhexedrine (ID 75237)\". Erowid.org. Dec 16, 2008. erowid.org/exp/75237",
  "substance": "Propylhexedrine",
  "views": "26552"
 }
}
