{
 "title": "Weak but Satisyfing Trip",
 "author": "spazm",
 "citation": " spazm. \"Weak but Satisyfing Trip: experience with Mushrooms - P. cubensis (ID 12001)\". Erowid.org. Jan 4, 2005. erowid.org/exp/12001",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "70 kg",
 "report": "<p>It was a friday night, and me and my friend N had decided to consume some mushrooms if we only could find a good place to be. At about 6pm it looked like we wouldn't find a good place, but then I called a friend (J) and he said that we could come over to his place to use some narcotics. After talking to yet another friend (P) that was also supposed to join us we decided to meet at around 8pm. I went home to N, we start to prepare 4 doses of P. Cubensis. We prepare a 2 grams dose for everyone. After that we hurry to the train station. Once at our destination, at 8.25pm, we start to chew the shrooms for about 10 minutes. And after that they are on their way down!</p><p>We sit down to relax, talk some shit and wait for the effect to come. After about 40 minutes the uncontrollable laughter takes over. Me and N, who hadn't eaten since lunch, get a stronger feeling than J and P. Numerous times we just look at eachother and break into laughter. The setting gets weirder and weirder, but it feels nice!</p><p>About an hour after consumption I sat down at the computer to write down what has happened so far. Reflections of 2 CD-rom discs on the wall catch my eye and I start looking at them. The shadows were beautiful and interesting in some way. I sit down in the couch again to play some Dreamcast but it isn't going very well as I start laughing and staring at the 2 reflections on the wall. Me and N laugh most of the time. Short after that I went out to smoke. I started looking around and noticed that the shadows were much clearer than usual or maybe it was just that I noticed them now. About 50 meters away on someone elses land a spotted a big tree. The tree was very beautiful standing there in the night. I felt an urge to go to the tree to see what it wanted from me, but I went inside instead.</p><p>By this time N thought everything was kinda greenish. I look into our coca cola bottle that was standing on the floor and saw something very interesting. It looked like little stars/patterns that were pulsating inside the bottle. I find this very cool and I ask the others to look too. It all ends with me and N looking into the bottle laughing. We think we see a transparent metal (is there even any transparent metals?) in the bottle. Anyways, it was a hilarious sight - 2 people looking into a coca cola bottle and laughing like mad!</p><p>When N started looking at a candy bag that's lying on the floor he starts telling us to look at it to see that it lives. It changes forms and moves around, but I can't see it so I decide to lay down on the bed to relax a little. Suddenly I get the idea that I have to drop a pillow on my face, I can't remember why. After dropping the pillow on my face for a few minutes I started thinking: 'Why am I doing this?', and I stop. A while thereafter I remember that I HAVE TO find out why I did what I did with the pillow. I start dropping it on my face once again. After a minute or two I decide that I will never remember why I felt like I had to do it.</p><p>Almost 2 hours after consumption, after the pillow incident, I don't see the patterns in the bottle anymore. N thinks that the coca cola is tired, that it is just resting, but I don't agree. I think it is mad at me for drinking out of the bottle and that's why I doesn't want to show its patterns to me anymore. By this time I found out that the tree that called for me before belonged to someone else. I came to the conclusion: 'It is not my tree, I can't go to it'.</p><p>2 hours after swallowing the last piece of mushroom we decided to go out for a walk. We find ourselves in a very calm and silent neighbourhood, no one was outside. We begin to walk down to road which J lives on. It feels like almost everything expresses some kind of feelings. Some trees are evil, some trees are happy, some trees are old. Some cars look very aggressive kinda like watchdogs. None of the mentioned things are frightening though. They all just seem to express their feelings so that we know where to walk and where not to walk. We never thought something would attack us or anything, the things only protected what was theirs and we had no plans on trying to take that away from them.</p><p>When walking past one house everyone sees a plant that looks like a face, except me. We stop and stare, at the window where the plant is located, for a couple of minutes. I try to see the plant but fail. As I mentioned before all things around us expressed feelings, houses, cars, trees, everything. The ground looked like it floated half a meter over itself. P and N got 'transparent vision' after looking down on the ground and the looking back up. I never understood what they really meant.</p><p>One of the houses look very 'inviting', with nice lights and a great porch. Everyone feels that the house is drawing our attention to itself and also that it wants us to come closer. But in front of the enlighted porch there's a house that feels 'wrong' together with an 'evil and dark' tree, so we walk past it. After a while we turn around and start walking back. We run into J's friend, who also lives in the neighbourhood, as he comes driving in his car with his girlfriend. They stop and come out to say hi. Me and N start staring at his car, N thinks the car is swinging, I just think it's vibrating. We are still pretty weird standing there laughing at the car. J's friend must have thought we were insane.</p><p>While J was talking to his friend me, P and N walked away on a road leading up. We stopped at fence made out of spruces. We started touching its needles who were wet with rain. It feel strange but at the same time very nice. The needles looked like they were made out of plastic. After continuing up the road we ended up at the magical house again. We felt very smart, we had found another way to the house without the 'evil' tree. We went up to the house, standing outside looking at it for a couple of minutes. N thought it looked like a plastic house but at the same time very nice. I thought it was a trap, something was trying to draw us to it. We stared at the house for a while and then we went back to J's place.</p><p>Once inside we started to come down. We started talking a little shit about nothing special. P started to get very restless. Then someone brought up the subject of sharing an acid blotter. We discussed this for about 15 minutes but came to the conclusion that it wouldn't be a great idea. J and N didn't feel their legs from time to time.</p><p>A few minutes after 00.30am N, P and myself decided to start our journey home. Finally, we arrived home safely. The night had been very satisfying and we were all happy when talking on IRC when we got home. Everyone had had a great time. The trip wasn't very hard, but it was a great and fun trip. Just made our night totally satisfying!</p>",
 "year": "2002",
 "id": "12001",
 "gender": "Male",
 "timestamp": "2005-01-04T08:00:00.000Z",
 "views": "4955",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  }
 }
}
