{
 "id": 12028,
 "title": "Triple Edged",
 "date": {
  "submission": "2010-01-17T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Excido",
  "gender": "Male",
  "weight": "75 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "IM",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had come home from a party and I decided I would end the night with some 2c-e. One of my best friends A, and a fellow psychonaut decided to watch me do it out of curiosity and boredom. So I prepared the 20mg shot by dissolving the 2c-e in some water and proceeded to inject it into my left shoulder. I put down the needle, capped it, and was talking to A for a couple minutes when I noticed the visual distortion start. Needless to say the come up time was amazingly fast, which I certainly wasn't complaining about. The visuals began with the signature warping growing in intensity rapidly. After a few more minutes I was getting full blown visual bombardment. My arm was heavy and sore from the injection and was an annoyance but easily tolerable, won't make the same mistake next time.",
  "Throughout the night as it increased in intensity I experienced a few new sensations that I had no previously gotten on 2c-e. I talked with A about many a thing throughout the night but I noticed that as we were talking I would interpret A's questions and responses in different levels of depth. And the depth of my interpretation would be erratically jumping at anytime. Like he might have been talking about something menial and I would go into huge trains of deep thought into the nature of the subject. Its a bit more complex but probably cant explain it any better.",
  "I had a bowl of weed just before the peak, to mitigate the uncomfortable body load; I wasnt sure at times if I was actually feeling nauseous or just some weird uncomfortable feeling in the stomach. But the weed worked to lessen whatever it was. I also felt as though everything had a strong and very fast vibration.",
  "At the peak I felt as though I was merging into the 'Stream' of the universe, No ++++ mind you but I imagine it was a tiny taste of it. My whole field of visual became like a wave of visuals, all in synch like a river, and my body felt like it was suspended in water, flowing involuntarily with the waves of visuals. I would look on my monitor and as I attempted to move my mouse around flicking through songs the trails of the mouse created jewels that would jump out into my field of vision, almost like looking at a night sky and having very large stars just pop up. Music was quite intense, I would play a very psychedelic song and the visuals would step up a notch and I get lost in the song and waves of patterns and colours.",
  "As I attempted to explain to A what the visuals were kind of like, I said that each movement or object left a border for each frame in which it moved, if that makes any sense, but it was not like trails that are merely delayed, where each small border has the previous imagine side by side, but in each border the action would constantly repeat so it was like a huge overlay of actions and movement. Also everything had small multiple outlines, a triple edge as a friend has called it, and it extends outwards and repeats. It makes everything seem very vibrant.",
  "At the peak my memory also began to dwindle slightly, in both the Huh...What was I saying? weed way and the traditional psychedelic *having thousands of thoughts a second on something and then completely losing the original thought or point*. At times it felt like I would get sidetracked so much during a conversation that when A reminded me of the original point it felt as though I was going back in time in a sense. Almost as though in the whole sidetracked conversation no time had passed and it was as though I was playing a conversation scenario out in my head or something.",
  "I took the shot at 1:30am, by about 6:30am I started to come down. Tried to sleep at 7ish am. Fell asleep somewhere around 8am I think. Woke up at 11am feeling tired but back to baseline and fine mostly.",
  "I think I may have experienced some instances of synaesthesia but I cant really remember/pinpoint them."
 ],
 "erowid": {
  "id": "75373",
  "citation": " Excido. \"Triple Edged: experience with 2C-E & Cannabis (ID 75373)\". Erowid.org. Jan 17, 2010. erowid.org/exp/75373",
  "substance": "2C-E & Cannabis",
  "views": "2776"
 }
}
