{
 "id": 12038,
 "title": "Interesting Properties",
 "date": {
  "submission": "2008-12-13T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Tforce image",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0:00",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "0:15",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "0:30",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "2:00",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  },
  {
   "time": "3:00",
   "amount": "250 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "Previous drug experience and amount estimated;",
  "Cannabis - 500grams",
  "Alcohol - Regularly",
  "GHB - many many times",
  "Amphetamine - 10grams",
  "Methamphetamine - 3grams",
  "Codeine - Various times (cold water extr.)",
  "DXM - few times robo style",
  "Ecstacy pills - 1000+",
  "Cocaine/crack - 200g",
  "Heroin - once/twice tried",
  "Ketamine - 1kg",
  "LSD - 30 tabs or so",
  "Magic Mushrooms - 50grams (dried equivalent)",
  "HWBW - 20 seeds (LSA)",
  "2-CI - 2 doses",
  "Salvia divinorum - various times",
  "Datura - 1 time",
  "Amanita Muscaria - once",
  "Anadenthra Columbrina - (DMT containing seed) a few times",
  "Kratom - 1 time",
  "Nutmeg - few times",
  "Passiflora - few times",
  "Various pharms and other misc. substances.",
  "The relevant substances to compare Mephderone to are MDMA, amphetamine/meth. It is reportedly similar to methylone but I have not tried that yet.",
  "So let's move on to the experience.",
  "Setting -",
  "Evening, with my girlfriend, I have received 1 gram in powder and before she arrives I snort a small amount around 50mg. To note I am drinking beer throughout the evening, but not enough to get intoxicated or to notably affect the response in my opinion.",
  "T+0 - 50mg snorted",
  "T+5 - Feeling unsettled, similar to before coming up on MDMA, but very mild as I expected due to the low dose.",
  "T+15 - I am certain this is not enough to get high on and boldly chop out around 200mg into various smaller lines. Snort around 100mg.",
  "T+30 - I am feeling it now, it is definitely similar to MDMA, I feel increased heart rate, and a warm comfort, mild euphoria. My Girl friend arrives and we do some more lines. I would say she does 100mg and I do another 100mg. Taking me up to 250mg.",
  "T+45 - The effects are strong, very similar to MDMA, but unusually calmer, and because I have taken so much MDMA, and the intial majic had worn off, I had stopped feeling so euphoric and also I did not feel the urge to talk. With mephedrone, I do talk, and it is not the fake rubbish that comes out of my mouth with MDMA, that I forget I have just said etc. In terms of comparison to speed, this is kind of like it, but not so 'fast' I would say.",
  "T+2hrs - It is strange, the substance just sort of drops off. In a matter of minutes it feels like, from being high, to being almost normal (ish) and it seems to be around 1-2 hours after the peak. Upon insufflating more, I can go right back to where I was. I think at about this time me and my gf decided to snort the rest or intend to. I did another 100mg.",
  "T+2.15hrs - Oh my, the eyes jitter and with focused breathing the euphoria is pleasant. My eyes are almost uncontrollably moving fast. Its not unpleasant. By the way, me and my girlfriend engage in some mild sexual activity. Unlike MDMA it does not give me erectile dsyfunction, a plus. Tactile sensation greatly increased, when my gf performs oral, I groan in pleasure. Most unusual for me!",
  "T+3hrs - After the eye jittering wore off, I finish the rest, which I estimate to be a total of 500-600mg. The euphoria is good and the conversation is real. Its relaxed and also your empathy is greatly increased. Imagine MDMA but without the PUSH. Of course there has been jaw grinding going on throughout this, but its not out of control. Standard pupil dilation and increased heart rate. Some sweating.",
  "T+4hrs - Pretty much on the way down to baseline.",
  "T+5hrs - Although there is no crash and in terms of MDMA, much less comedown feelings, I do feel drained and have the urge to drink alcohol to numb the feelings. I go out and cycle to get some beer.",
  "T+5.5hrs - Alcohol helps a great deal and I actually feel pretty good. Proceed to drink and eat a bit and my gf is in bed.",
  "T+7hrs - I try to sleep and manage ok.",
  "Summary -",
  "I'm glad I tried it! I actually prefer it to MDMA in many ways. I didn't get the visuals I can get on mdma, but I don't know this may change at higher doses. It is reported to be half the potency of mdma, so I only took around 250mg equivalent, which is very low as I have done 1 gram of pure (or very nearly pure) mdma in one night before.",
  "This substance is very manageable. Insufflated the high lasts around 1-2hours, and so I can control how high I get very easily. I am a fan of this and I would do this over ecstasy now. I would assume this would go very well with ketamine, perhaps some cannabis too, but I don't smoke weed much at all any longer."
 ],
 "erowid": {
  "id": "75457",
  "citation": " The Tforce image. \"Interesting Properties: experience with 4-Methylmethcathinone (Mephedrone) & Alcohol - Beer (ID 75457)\". Erowid.org. Dec 13, 2008. erowid.org/exp/75457",
  "substance": "4-Methylmethcathinone (Mephedrone) & Alcohol - Beer",
  "views": "23598"
 }
}
