{
 "title": "This Beautiful Diviners Herb",
 "author": "Psychedelic Sunshine",
 "citation": " Psychedelic Sunshine. \"This Beautiful Diviners Herb: experience with Salvia divinorum (10x extract) (ID 12033)\". Erowid.org. Feb 19, 2004. erowid.org/exp/12033",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "14 kg",
 "report": [
  "<p>PRELUDE:",
  "This evening i decided to try this beautiful herb, Salvia divinorum. I had purchased a 10X extract online, and it arrived this morning. I was eager and excited to try it, but I decided I would wait till the time was right.",
  "So, this evening when I was sure to be alone with no disruptions I decided after a short time of meditation, relaxation and preperation, now was the time.",
  "My bedroom is somewhere I always feel calm and contemplative so I thought what better place to break through into the Salvia experience for the first time than here. I closed the door, turned my lamp on at the side of my bed, carefully positioning it so as to emit a dull light. I lay upon my bed, bong in hand and eye-balled out about 1/15th of a gram (a common dose on Erowid's Salvia divinorum Dosage chart). I filled the bowl, leaving the smallest bit of Salvia (a moment of apprehension and anxiety) to the side....maybe I'd need it later.",
  "After inhaling and holding in the tasteless, smooth smoke for roughly 30 seconds, I exhaled. Within a minute or so (I couldnt say exactly) I could feel myself gently 'floating' into what I was about to experience.",
  "THE EXPERIENCE:",
  "I saw, or rather felt, or rather percieved to have seen in my minds eye (let me add I had turned my lamp off by this time, with much difficulty finding the switch. My eyes closed.) a small speedboat travelling across the sea, bumping up and down and spraying a jet of foam behind it. Several people were on it, their faces I couldnt make out but I think I, or rather a part of me, was on it. Before I knew it, my 'viewpoint' had switched (like a camera zooming in) to behind the wheel of the craft, only there was no wheel.",
  "Blankness....but still travelling. Then again seeing what seemed to be a stronger 'essence' of me atop a creature with the head of a white bear and the white wings of a bird, flying/travelling ....gone....blankness again.",
  "Next my whole perception of this 'new world' around me had changed somehow. I cant place my finger on it, it just had.",
  "The darkness around me (my eyes were now open) had taken a form, a substance. Snakes or rather sentient tubes of darkness/form were interweaving into, out of, through the darkness, into each other, consuming each other then reforming. I looked for a source from which these 'snakes' came from only to find they came from the darkness itself. This is hard to explain in words (like many things in this strange salvia journey), but let me say it was a rather strange thing to percieve.",
  "Next the darkness took a different form. Suddenly I was transported to inside a tube (perhaps one of the 'snakes'????). Just sitting there cross legged. There was perhaps a wind blowing through the tube, or an energy. Then the tube closed in and I found myself inside an orb of darkness.",
  "Then the orb (this made me think of cell division) split/divided into two. With my body, or rather 'self' 'split' straight through the middle with  one side of my 'self' inside each smaller orb. Again this is VERY hard to explain. My consiousness seemed to be thinking inside each different orb about the same things only percieving them in completely different ways.",
  "I was finished with the journey, or rather the journey was finished with me. So to cut a very long story short I will say the Journey gently eased back to reality with MUCH contemplation, insight and philosophising about the nature of this beautiful reality.",
  "CONCLUSION:",
  "I have half a gram of this beautiful smelling, innocent looking herb to last me. I will DEFINATELY take another Journey into the 'Salvia Reality'. Soon, but when the time is right. Or when I am right for the time. I have decided I will grow some of this amazing herb. And I have also decided to go even deeper into my already spiritual journey in life. Salvia has helped me see a whole lot more, and clarified a lot I had already thought about.",
  "Thankyou Salvia divinorum.</p>"
 ],
 "year": "2002",
 "id": "12033",
 "gender": "Male",
 "views": "6304",
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ],
 "submissionDate": "2004-02-19T08:00:00.000Z"
}
