{
 "id": 12044,
 "title": "Better than Weed!",
 "date": {
  "submission": "2009-03-04T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "spasticfleisch",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I got a free ~12mg sample of this new chemical which the supplier was giving out to encourage the submission of reports, as there is next to nothing known about it. So the day I got it I shared it with two friends. One of them and I smoked cannabis the day before, he is a frequent smoker whereas I smoke extremely infrequently as I don't enjoy it all that much. It's good before eating a big meal, at a sit-down concert, before sex, and to get to sleep but that's about it for me. I tend to smoke more than I should and get palpitations, anxiety, annoying hallucinations, way too tired, and unbearably aroused. So I figured I'd try this cause hey it's free and maybe I'll enjoy it more.",
  "The substance was a dense, flat mass of crystals, a pretty rich red-brown in color. It stuck to the razor as I scraped it out of the bag and was hard to get in the pipe. It smelled just like DMT but its texture was totally different. I put it in my baby pipe with a screen in it and held a flame close to it but not touching, letting it vaporize. It tasted fine, a bit chemically, better than weed to me. I breathed out a very small amount of smoke and passed it to my friend, telling him how to hold the flame. We smoked it until we breathed clear as the JWH-018 melted and was invisible so we weren't sure when it was gone until we did not exhale smoke or taste it.",
  "I felt energized, it didn't feel like cannabis at all to me. I didn't want to run a mile or anything but I wasn't tired instantly. I was aware but not too aware, definitely not 'stoned' feeling which is great to me. My friend also said he felt really energetic. We went to the store and got junk food, which was delicious. I didn't feel the need to binge but taste was really nice. I didn't feel anxious at all and had no psychedelic effects, like I get with weed.",
  "The effects were subtle and if I did it again, I would smoke more. My friend inquired about buying some so I take that as a good sign. I am also thinking about purchasing some when I get some spare cash because it was similar to my first cannabis high ever, which was energetic though pretty psychedelic. I'm not sure when it wore off as I went to bed about two hours after I smoked, just cause it had been a long day. Sleep was fine.",
  "If you really like weed stay with weed, but if it gives you some bad effects maybe try this out as an alternative. I'm glad I did!"
 ],
 "erowid": {
  "id": "75488",
  "citation": " spasticfleisch. \"Better than Weed!: experience with JWH-018 (ID 75488)\". Erowid.org. Mar 4, 2009. erowid.org/exp/75488",
  "substance": "JWH-018",
  "views": "30763"
 }
}
