{
 "id": 12040,
 "title": "The Bird of Life and Death",
 "date": {
  "submission": "2003-04-17T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Batman",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "610",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  }
 ],
 "report": [
  "I had read alot about DXM, but had yet to try it.  I have never done any other hallucinagens ie. acid or shrooms because I heard they make you go nuts and loud.  Im only 16 so I sit in my basement with my parents sleeping 2 floors over me, so I need to try to be calm.",
  "The day before I went to the store and bought 2 8oz bottles of Robitussin extra strength (for me and my friend who would be joining me).  He came over around 9 PM.  I downloaded the Psychedelic Screen Saver to look at.  I got some food, and drinks.  At around 12:05 AM we each drank our bottle.  I was very excited and looking forward to what would happen.",
  "The only thing I could think was GROSS!  It tasted so bad.  He finished his no problem, but I had to slowly take it down.  Afterwards we went out, and watched TV.",
  "At around 12:45 he asked if I was feeling anything.  I had nothing except feeling light-headed , the 'robo-itch' I read about (it wasnt that bad), and the worst stomach ache of my life. He apperently was seeing things as he said.  I couldn't take the pain in my gut anymore.  Although I feared it would get out of my system, I went upstairs and puked my guts out.",
  "Thats when it kicked in...",
  "I came downstairs to find my friend swinging a paper towel roll calling it his sword.  Everytime he swung it, it left huge trails.",
  "I then turned on a spinning ball of light (a black ball that turns, and it has different lights that project).  I laid on my back and looked at the ceiling.  In the center of a red ball it looked like a shrouded figure was trying to get out.  It looked like a face behind mist, trying very hard to swim to us.  I watched in confusion, until I started to spin up to it.",
  "I felt myself rising up high off the ground.  I closed my eyes for a minute, and I saw a huge pointy disc of color swirling behind my eyes.  When I opened them I saw the red light turn into a big glowing bird.  I fell back to ground.  My friend then asked if I saw the bird, which I did (I thought this was odd for 2 people to see the same thing...).  He started explaining that the bird was in the circle of life and death.  The red light would kill the living and awaken the dead.  He began to ask it questions about himself.  He seemed so lost in thought, I decided not to disturb him.",
  "I looked at the light, and felt it was calling me.  I reached up to it, and my friend screamed to me 'STOP!  It'll kill you!'  I obeyed very quickly.  He said to look over at the couch, where I could see the dead guy.  I looked over, and I saw a pile of blankets and stuff that did resemble a guy.  We laid on our backs until 2:30.  We got up and we wanted ice cream.  We managed to walk up a wobbling stair case and quietly get ice cream.  Then coming back down was harder than going up.",
  "At around 3 we were coming down fast.  I began to feel very drunk, which I didnt like at all!  I felt tipsy (which I had before, but enjoyed it then), naseaus, and really weird in general.  I laid down, hoping to fall asleep, but I couldnt.  After 2 hours of laying there feeling like absolute shit, I feel asleep.  I woke up like 30 mins ago.  My friend is still asleep.  Its 10:55 AM, I still feel a little queasy, but Im good. ",
  "In retrospect, DXM was so much fun.  I felt like I knew everything, and could be taught anything.  Of course, I will NEVER EVER drink syrup again.  Throwing up was so bad.  I will just find pills from now on.  I also wonder why I got drunk.  It may have been the 1.4% in it (even thought thats not much), or something else, but Im sticking to pills.  Syrup is tooooo gross."
 ],
 "erowid": {
  "id": "7546",
  "citation": " Batman. \"The Bird of Life and Death: experience with DXM (ID 7546)\". Erowid.org. Apr 17, 2003. erowid.org/exp/7546",
  "substance": "DXM",
  "views": "16749"
 }
}
