{
 "id": 12055,
 "title": "After Tonight I'm a Stoner Forever",
 "date": {
  "submission": "2003-03-31T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lyssa D.",
  "gender": "Female",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I actually had smoked pot once or twice before. But it had been a joint which are hard for me. So I never actually got high. I was determined to do it one way or another.",
  "One March afternoon, my friend and I went to this really cute guys house to hang out. We knew he was a stoner, and he was cute so we knew we'd have a good time. When we got there. His girlfriend, and 3 other guys were there, one of them I was pretty good friends with. After a bit, everyone except my friend went into the back room to get high. I couldnt believe I was getting another chance.",
  "They filled the bowl on the steamroller pipe, passed it around, and I watched carefully so I wouldnt seem dorky. It was my turn and I took a hit. It went around again. And again. I was getting the hang of it. And everyone was so cool about showing me and helping me with it.",
  "We smoked 2 more bowls. But then I began to think that I still wasnt working. I wasn't high. And I figured It didnt work. I was so mad. But I moved on, and just hung out a little watching them play darts.",
  "Then it happend. I swear. Ill never forget it in my life. This slow creeping feeling took over my body. I felt a great joy. I knew It happend. I thought to myself, 'Its happening! Im getting high! I cant believe it im high!' And then, all of a sudden I cracked up! I couldn't take it that I was actually experiencing  this great feeling.",
  "When I started to laugh hysterically, I had the urge to pee. REALLY BAD! I started to scream 'I have to pee!' But I just couldnt move. My my friend had to drag me to the bathroom.. and I just sat there laughing! I couldnt help myself.",
  "When I went back to the room the people thought it was so funny I dealt with it the way I did. Me too. But I didnt care. Screw them. I enjoyed sitting there feeling my body leave into a different dimension. Its like im floating, and Im by myself in my own world for me. And I can see everyone else just like they would be on tv. It was great. Only time went by slowly for me, seconds were minutes. And I got a little paranoid about when I was supposed to leave.",
  "Not only was I high, I was stoned. I was so happy and content with this feeling. Later, my friend and I walked home. She was mad I did what I did. (Only a week later she tried it and shes a stoner now too.) From that moment on, I loved nothing else. And that was what I wanted.",
  "It was cool, my life that is. We'd go get high every twice a week there. Until I bought a quarter every week for myself. I did it twice a day. I still would but I had to get clean for a drug test. I think pot isnt a bad drug. Its not addictive. Just the lifestyle. And It doesnt do that much damage. Its got my vote for legalization."
 ],
 "erowid": {
  "id": "7557",
  "citation": " Lyssa D.. \"After Tonight I'm a Stoner Forever: experience with Cannabis (ID 7557)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7557",
  "substance": "Cannabis",
  "views": "16720"
 }
}
