{
 "id": 12072,
 "title": "Deja-Vus and 'Locked Up'",
 "date": {
  "submission": "2003-03-31T08:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Don S.",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": "tar / resin"
  }
 ],
 "report": [
  "I'd like to tell 2 experiences I've had with cannabis, that weren't very usual (in my opinion). The first one is a mental experience, the second is physical.",
  "First experience : march or april 1999.",
  "On a warm friday night, I and a couple of buddies decided to go out. We knew there was a good party, organized by a friend of ours, who would give us free beer. So the 3 of us went there by bike, since none of us had a car. The place of the party was about 15 kilometers away, so we were pretty tired when we got there. At the party, we first went to meet a friend of ours, who treated us to a beer or 2. A little later, we went outside, and one of my friends, L, told me he had brought a joint loaded with hashish. We were both experienced with cannabis, but he had never had a decent high (my diagnosis was that he mentally, subconsciously refused to get high, or something to that extent). About 15 minutes after we smoked the joint, we both started laughing like madmen. We sat outside for a while, simply laughing.",
  "Then we went inside, and decided to go sit in some couches. In the mean time, L was extremely stoned. Unfortunately it was the kind where you simply sit, look blankly into space and dont say anything. Every once in a while, he would say 'wooow man, I'm so stoned', but nothing more. I on the other hand was babbling away with a couple of other friends that came to sit with us. At this time, about an hour after we smoked the joint, I began to experience strange things. I was having deja-vus, and I was having them every 10 seconds for about half an hour. I would be talking, going 'blabla...wow! again !...blablabla...wow ! again !' for half an hour.",
  "I suppose you may know the feeling of a deja-vu, and I personally find it a somewhat creepy feeling. At the time tho, I was pleasantly high, and you could say that I was enjoying it, since it had never happened to me before. I dont know how I got those deja-vus, I guess the cannabis affected some area in my brain where the deja-vus are 'made'. But it was a nice experience nonetheless.",
  "On a second occasion, I again went to a party with a couple of friends. This time, there were couches in the dancehall itself, which was nice. I was extremely stoned, and sat in one of the couches, watching the people dance. At a certain point however, I noticed that I couldnt move my neck anymore. No matter how hard I tried, it wouldnt move. I could only loosen it up by tilting my head, but otherwise, it wouldnt move. This lasted until I got up and danced. I suspect the feeling of not being able to move my neck was because I was wearing a turtleneck sweater (I believe that's what's it called). So my neck was kind of 'locked up' in there. Anyway, this was a pretty strange experience, although at the time I didnt mind it, I even thought it was pretty funny.",
  "So, these were a couple of experiences. Nothing special if you ask me, but still not usual either."
 ],
 "erowid": {
  "id": "7568",
  "citation": " Don S.. \"Deja-Vus and 'Locked Up': experience with Hash (ID 7568)\". Erowid.org. Mar 31, 2003. erowid.org/exp/7568",
  "substance": "Hash",
  "views": "6882"
 }
}
