{
 "id": 12074,
 "title": "The Depths of Delerium Sucked",
 "date": {
  "submission": "2000-08-02T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Franklin",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Datura",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I had heard from one source or another that datura, a plant that grows abundantly in my neighborhood, was frequently used by native americans to 'trip'.  At that point the only other hallucinogen I had ever experienced was ecstasy.  Nothing, however, could have prepared me for the experience that i was about to have.  I, knowing nothing about datura or its dosages or really even just what kind of effect it would have, began to ingest it, in fairly large quantities on sunday night with a few of my friends (I take responsibility for bringing it to them). ",
  "at first it produced a pleasent narcotic effect every time that i took it.  the first real hallucination that anybody had was reported later that night.  it seems that one of my friends thought that he went to the bathroom, felt the ' splashback from the toilet water, and was going on his merry way when he realized that in fact, he had produced nothing at all.  I continued to take datura all of that week, growing more and more delerious with every dose.  it must have been fairly addictive for me, because even in my wildest stages of delerium i managed to consume more and more.  just some of the highlights from my week of terror and confusion are:  talking to people in the shower who weren't there, being in a state of utter confusion as to who i was or where i was, running out of on of my college courses in a daze after the professor's hair started growing before my eyes (at that point, the walls were also closing in, and taking a nap, only to wake up several times thinking that i had dropped a cigarette in my bed. ",
  "i took datura several weeks later for some reason.  this time i consumed a very large dosage in one sitting.  i was out with some friends who were sober.  i made them take me home where i spent the entire night running around in my basement, naked, trying to find clothing to put on but being unable to do so.  i also carried on conversations with people who weren't there, mistook dog food for cereal and ate a large quantity, tried to rip the pipes out of the ceiling (i kept hitting my head on them), and (i think) peed on a good deal of the objects in my basement.  i urge anybody who thinks that this sounds like a good time to reconsider.  i've been to the depths of delerium and it really sucks."
 ],
 "erowid": {
  "id": "757",
  "citation": " Franklin. \"The Depths of Delerium Sucked: experience with Datura (ID 757)\". Erowid.org. Aug 2, 2000. erowid.org/exp/757",
  "substance": "Datura",
  "views": "12243"
 }
}
