{
 "id": 12075,
 "title": "Unique and Easy to Identify",
 "date": {
  "submission": "2010-01-24T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JKK",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "53"
   },
   "administration": "oral",
   "substance": "DiPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Theres some 53 milligrams (+-3mg) of DiPT powder, dissolved in water just a minute ago. The small glass of water is cloudy even after a thorough stirring, but the taste is not bad. At the time of taking the chemical, I couldnt be truly certain that it was pure DiPT, but it is, at least to me, one of the easiest compounds to verify via its effects. Ive used slightly less than a gram of DiPT before this, so its quite familiar to me with varying dosages.",
  "A 53 milligram dose of a potentially unknown chemical is always a potential hazard. I do recognize that this still might lead to a disaster in the worst case scenario, and you may rightfully label me as self-destructive for that if you want. Had I not been able to verify the effects, I would have probably forced myself to vomit at some point. Of course it might have been too late by then, if the powder had somehow been, for example, some of the highly potent DOx compounds instead of DiPT. You never know in this shady business.",
  "No matter how risky it was, disasters didnt happen this time. I could verify the effects after half an hour. I listened to the familiar sounds that are most easily distorted, which in my case are some of the Windows beeping sounds. I also vaporized some cannabis before I could really feel any effects, since it seems to remove any signs of nausea or anxiety. My cannabis tolerance is very high.",
  "One of the reasons I took DiPT this time was my newfound fondness of classical music. Listening to that, however, became increasingly frustrating as the distorting effects began to manifest. An hour after taking the DiPT, I decided that there was no reason to continue listening anymore, since it was so awful sounding, and the dose was so small that I already was about to reach the peak of the distortion effects.",
  "Soon afterwards, a friend of mine stated that he would like to come to a visit. I saw no reason to decline, even though I usually like to be alone when using a psychedelic drug. The effects at a dose this low were indeed mostly centered on the distortion of sound. I however wouldnt have liked to go grocery shopping, for instance, even though my friend didnt seem to comment anything about my behavior.",
  "After my friend came, I stopped concentrating on the effects, in other words tried to be at least somewhat social. We vaporized about a gram of cannabis and watched some television shows during the evening, and after that played some computer games. Maybe in a more social setting a close friend could have noticed that somethings different with me. In any case, I could almost forget the effects when I tried to be more social.",
  "As the evening progressed, the distortion effects began to fade, and when I went to sleep any other effects of DiPT werent distinguishable from the effects of cannabis. When I woke up, I felt as normal as any other morning, and no distortions could be heard anymore. At a higher dose, some distortions might have persisted.",
  "The only problems with social interaction were hearing multiple sounds at the same time, as well as a generally more stoned feeling, compared to what one gets from just vaporizing cannabis. The problem with multiple sounds is that I dont think I could make any sense of, for example, a phone call at a 100mg dose if there was any kind of background music. It was pretty hard even this time, and I soon had to change to silent room when speaking on the phone.",
  "I do not refer to the time in this report very often, because its not important for me. I know it is important for many, but I think psychedelic drugs are not for the busiest people. I hadnt taken any in half a year, because I couldnt find the time to not care about time before this. To me, the effects of DiPT last at some level as long as I stay awake, and are either completely faded by morning, or the distortion is still slightly noticeable after a good nights sleep.",
  "Increasing the dose increases the time of the effects, and everyone should get a feel of it at a low dose if theyre about to try DiPT. At higher doses, its more like other psychedelics with a fancy sound distorting catch. When taking such a dose, it might help to be familiar with either the general psychedelic experience, or DiPTs unique effects. Ill take a higher dose during New Year, and maybe even write another report about the outcome of that."
 ],
 "erowid": {
  "id": "75704",
  "citation": " JKK. \"Unique and Easy to Identify: experience with DiPT (ID 75704)\". Erowid.org. Jan 24, 2010. erowid.org/exp/75704",
  "substance": "DiPT",
  "views": "3873"
 }
}
