{
 "id": 12089,
 "title": "It Really Is Like Cannabis",
 "date": {
  "submission": "2008-12-22T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sopris",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "I found myself in a very difficult situation.  Forced drug tests, and failing one could mean criminal penalties.  I have been a pothead for years, smoking every day for close to a decade. I gave up weed for a week, but then heard about a product called 'Spice Gold' - I was sure it was another ripoff herbal blend, but after researching and finding almost 100% positive ratings on boards, I decided to take a risk.",
  "When the 3g bag came, I rolled a single joint, which was probably about 20-30% smaller than a cigarette.",
  "I smoked it, not really knowing what to expect.  I should point out that I was extraordinarily skeptical that any product would feel like weed.  The joint burned quickly.  I probably smoked the whole joint in 3 minutes.",
  "After being done with the joint, I felt ripped off. Barely felt anything.  But then....",
  "After about 10 minutes, I felt similar to how I would have felt after about 5 minutes of smoking weed. Music sounded better.  I started having trouble following the movie.  My perception became clouded.  But the body and mind, it was amazing - it felt like weed.  I actually started to worry that maybe the stuff actually contains THC, in which case I would be screwed on a DT.",
  "I won't fail a drug test on it, and the proposed chemical in it is known to have similar effects to THC.  The problem is, with this information known, the window to get Spice Gold legally is probably closing quick. I would highly recommend this product for those mj enthusiasts who need a legal alternative.  Its expensive, but it works."
 ],
 "erowid": {
  "id": "75825",
  "citation": " Sopris. \"It Really Is Like Cannabis: experience with Spice Product ('Gold') (ID 75825)\". Erowid.org. Dec 22, 2008. erowid.org/exp/75825",
  "substance": "Spice Product ('Gold')",
  "views": "9431"
 }
}
