{
 "id": 12087,
 "title": "Significant Verbal Memory Problems, Light Use",
 "date": {
  "submission": "2009-07-12T07:00:00.000Z",
  "experience": "2004"
 },
 "author": {
  "name": "Noviseer",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "<p>I'm a second year graduate student with a light history of drug use.  Reading about a study [http://www.erowid.org/references/refs_view.php?ID=7056] on the effects of low dose MDMA on verbal memory skills prompted me to write up a report on my own experiences in that department. Over the past six months I had been noticing a strange mental sluggishness in my ability to come up with people's names, bands, sports teams, etc--strange in light of the fact that my critical thinking skills seem fine.  I commented to my girlfriend that it felt as if the 'Noun-generator' in my brain was broken.  The article I read reiterated exactly what I've been reflecting on.  I think there's a good chance that some very occasional MDMA use has had a long term impact on my ability to come up with names. ",
  "I've taken MDMA about 6-8 times spread out over a period of four years (age 21-25). Lowest dose was probably 40mgs, highest dose around 185 mgs (125 + 60mg booster).  My last dose was ~125 mgs, six months ago.  I smoked pot regularly throughout college, quitting completely around 6 months ago.  I take adderall around exam time, usually a low dose regimen of 10-15 mgs a day for two to three weeks.  I've also experimented with LSD, Mushrooms, and had one terrible experience with DOC.  As the months of complete sobriety pass by, I've noticed the sort of slight sharpening up of my faculties that one would expert.  But this word recall problem has stuck with me, and at month six, is not getting any better, even with the rigorous mental exercise that graduate school puts you through. ",
  "My logic skills and my ability to recall rules / facts seems fine. I do very well on multiple choice tests. But since I started using MDMA I've had a very tough time coming up with words, particularly nouns, on the spot. People's names, even people I know well, escape me. Can't remember the names of bands, albums, or songs. If I'm given a few seconds, sometimes the name will come, and sometimes it won't.  Over thanksgiving, my grandma was telling a story, and she said, 'Oh, I can't believe I'm not going to be able to come up with her name.'  I know exactly what she means by that.  It's like a gap in the tracks. It sucks. It's very hard for me to socialize with people I don't know, because most social interaction is really an intelligence test, in a way. I can't tell you how many times I've had a funny interjection on the tip of my tongue, but I couldn't remember the name of some detail. So I end up just sitting there and smiling.  Like a feeble-minded elderly person.  No offense.  But as a healthy, sober, 25 year old with above average intelligence, when I can't come up with the names of some of my closest acquaintances, or the names of the 12 students in a seminar class after months of bi-weekly meetings, I think it's right to sound the alarm that something might have gone wrong with my relatively light drug experimentation.",
  "If I could go back, I'd avoid MDMA. It has probably made me a more empathetic person, but in a sort of docile way. I'm convinced it has also severely decreased my ability to spontaneously recall nouns. In the end, the hassle of this cognitive impairment has FAR outweighed the few hours of bliss I had on the substance.",
  "One could ask, how can I be sure verbal memory difficulties stem from my MDMA use? Obviously I can't. I DO know that I never had this fog / dead zone in my head prior to using MDMA. I also can see that those around me who haven't taken MDMA don't seem to have the same impairment.  In light of the building evidence of MDMA's effects (see the link above) and the uncanny description of the exact phenomenon I've been experiencing, I think chances are good I've done myself some harm.",
  "*Steps onto soapbox*",
  "So that's it.  I'm done with MDMA for good, and if you're doing research and deciding whether to take it, I'd recommend thinking long and hard about the potential for life-long mental impairment.",
  "If you want a blissful, transcendent experience, I would just take 1.5-2 grams of mushrooms instead of MDMA. I've done this at raves, small house parties, concerts, etc, and it's always a blast.  I used mushrooms from age 18-21 and, from my own point of view, didn't suffer any mental problems until I started taking MDMA.",
  "*Steps off soapbox*",
  "Be safe and have a good trip :)</p>"
 ],
 "erowid": {
  "id": "75809",
  "citation": " Noviseer. \"Significant Verbal Memory Problems, Light Use: experience with MDMA (Ecstasy) (ID 75809)\". Erowid.org. Jul 12, 2009. erowid.org/exp/75809",
  "substance": "MDMA (Ecstasy)",
  "views": "23278"
 }
}
