{
 "id": 12097,
 "title": "Improvement of the Honey Oil method",
 "date": {
  "submission": "2003-06-20T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Ming the merciful",
  "gender": "Male"
 },
 "dose": [],
 "report": [
  "After trying the Boffo Honey Oil method, and finding the end result extremely potent, portable and publicly smokeable, I received a flash of inspiration regarding how the method could be modified.",
  "Instead of using a length of PVC pipe as the recepticle for the plant material, a clear plastic bottle is used. A mineral water bottle is ideal. I'll go through the process step by step, pointing out the divergences from the standard method as I go.",
  "You will need:",
  "1 Plastic bottle, large enough to hold the plant material you wish to extract from.",
  "2 Pyrex beakers.",
  "1 Saucepan.",
  "1 coffee filter.",
  "1 Strip of thick card or thin wood, approx. 3' long and 1/2' wide with a hole bored through the centre the right size to take the nozzle of a butane can. When this strip of wood is place over the mouth of the bottle it should not cover it completely. There MUST be a small gap to let air out.",
  "2-4 250ml cans of Butane gas (lighter re-fill). The exact amount depends on how much plant material is used.",
  "1 Thick cloth or oven glove.",
  "Step 1) First the lid of the bottle needs modifying. I found the best method is to perforate the lid with an awl, making five or six holes from the inside of the lid. This is because this pushes out the hole, and when the bottle is up-ended liquid will gravitate towards the holes.",
  "Step 2) Grind or cut up the plant material roughly and, using a funnel, fill the plastic bottle 2/3 full.",
  "Step 3) Set up all your equipment outside in the back yard. Do not attempt this ANYWHERE indoors or near any naked flame or source of ignition. There must be plenty of moving air to carry off the fumes from the evaporating butane.",
  "Step 4) Fit your piece of wood on the nozzle of the butane can and upend it over your bottle. Holding the bottle in one hand covered with the thick cloth or oven glove, making sure that the cloth or glove lightly covers the gap in the bottle mouth left by the piece of wood.  This stops the plant material flying out when the butane is added, but allows air to escape, stopping a build-up of pressure. Squirt the butane into the bottle. Do one can at a time. ",
  "Step 5) When all the butane is in the bottle, gently swish it around for a few minutes with your protected hand. When the butane has taken on a green tint (the stronger the better) place the coffee filter over the mouth of the bottle and then replace the perforated lid over it.",
  "Step 6) Up-end the bottle over your Pyrex beaker and wait until all the butane has dripped out.",
  "Step 7) The butane will begin boiling immediately, but this process can be sped up by placing the beaker in a pan half full of very warm water.",
  "Step 8) While the first extraction is evaporating, repeat steps 4 & 5. The green tinge of the butane will be much less intense. This extraction should be poured into the other beaker to evaporate. The more plant material, the more times this will have to be repeated to get all the THC out.",
  "Once the butane is evaporated, the oil can be transferred to small herbal tincture bottles (the ones with a glass pippette built into the lid) by adding enough Isopropyl alcohol to make the oil runny, then sucking it up with the pippette and squirting it into the bottle. This can be stored like this for months and is indistinguishable from other herbal tinctures/extracts. A few drops on a roll-up cigarette (prior to rolling and left for a few minutes to evaporate) results in a joint that, when smoked, smells nothing like a joint, but a slightly perfumed normal cigarette. I'm sure you can work out the advantages of this."
 ],
 "erowid": {
  "id": "7588",
  "citation": " Ming the merciful. \"Improvement of the Honey Oil method: experience with Cannabis (ID 7588)\". Erowid.org. Jun 20, 2003. erowid.org/exp/7588",
  "substance": "Cannabis",
  "views": "15430"
 }
}
