{
 "id": 12105,
 "title": "Recreational, Respectful Use",
 "date": {
  "submission": "2013-10-04T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "goat",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Trazodone",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Cannabis",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "3 mg",
   "administration": "",
   "substance": "Pharms - Buprenorphine",
   "form": ""
  }
 ],
 "report": [
  "A family member of mine is currently in treatment for opiate addiction/pain and was prescribed Suboxone and now Subutex. She has been on opiates in all forms for about 22 years. I am a grown man, 37 years old, and am not usually interested in trying new drugs, but I too have always enjoyed opiates on very, very rare occasions, having never tried anything stronger than liquid Codeine and Percocets. I have probably taken Bupe about 10 times now. It has been fantastic every time.",
  "I am a depressive - have had 3 full blown nervous breakdowns - and have tried every drug I know to combat this problem. I am currently taking Zoloft, Trazodone, and medical marijuana and it's working great. I became more interested in opiods after I drank a half a bottle of liquid Codeine during a horrible episode. I was depression free for over four hours, and I realized that I can always stop this madness with opiods at any time. I also realized, and so few truly do, that the euphoria is a side effect of the drug and disappears pretty much the second time you do it. It's a one time thing, and then I have to wait a week or so until I can get that high again. Well, my family member is generous, and even though I've been doing better with my depression (thanks MMJ!), I still am interested in opiates, though I'm very frightened of the potential for addiction. I would never, ever do any opiates other than scripts.",
  "I have taken it on several occasions. I took anywhere from 2-4 mg of Suboxone and it always put me on my ass, and made me very happy. It's more of an event for me, an occasional indulgence. Last night, I took Subutex, bupe without the Naloxone. I did about 2 and 1/2 mg. I found the Subutex to be much stronger than the Suboxone mg for mg. Bupe makes me itchy, out of it, happy, and I do get a small feeling of euphoria. It's not a rush, but I still get the lovey-dovey feeling of opiates. Unlike other opiates, I can hold on to bupe without bingeing. I'd never take it more than once a week, and I only get small quantities (16 mg at a time). I've puked once on it - the first time I took 4 mg. ",
  "When it comes on, it can be jarring at first - it packs quite a punch. It does seem to have a stimulant effect at first. The high just gets stronger for about 3 hours or so, then tapers off with a nice afterglow that follows me into the next day.  This drug would be ideal for me during a depression, so long as I only take it once a week or less. ",
  "I've read reports that others have claimed Bupe kills any marijuana high. Not for me - in fact MJ just bumps the high way back up every time I smoke some. Cigarettes do the same thing, but not nearly as much. There is some euphoria for somebody like me - I'm not an addict - but it's different. The euphoria is weaker than say - Vicodin - but much longer lasting and in the end, more satisfying in every way. This stuff lasts for hours and hours. ",
  "I block off a day every two months or so, find a friend willing to do it with me, and off I go. Bupe makes me totally unable to drive, as I do nod in and out. I often like to take long walks on bupe, but I've never had any problems being on it in public. The puking can become a major problem if you take too high a dose.",
  "To me, Bupe is therapeutic. I can actually solve life problems when I'm on it. I can think clearly about deep issues, without much distortion. Bottom line, this is a really, really helpful drug for depression, however it is addictive and dangerous, so please be careful if you decide to try it out. It is an opiate, so all who take it should definitely educate themselves about it as much as possible, and most of all, respect it. Good luck."
 ],
 "erowid": {
  "id": "75952",
  "citation": " goat. \"Recreational, Respectful Use: experience with Buprenorphine  (ID 75952)\". Erowid.org. Oct 4, 2013. erowid.org/exp/75952",
  "substance": "Buprenorphine ",
  "views": "1194"
 }
}
