{
 "id": 12103,
 "title": "In the Rabbit Hole, Through the Looking Glass",
 "date": {
  "submission": "2009-09-30T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jamin",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "smoked",
   "substance": "DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Myself, Jamin (Benjamin-Ben) and my buddy, who shall remain unnamed had ordered some mimosa hostilis root bark and decided to synthesize DMT through a fairly easy extraction involving basifying the root bark with lye. I won't get into the exact process for you can look that up yourself if your interested. We called ourselves the 'Wolf Brothers,' and long story short, our experiment was a complete success with high yields.",
  "Finally, the day had come and we had produced completely white crystals, which were rinsed with ammonia. It was time to test our product. We packed a little bit of bud on the bottom of our pipe and topped it off with 1/10 of a gram of our beautiful crystals.",
  "We went outside onto our porch and laid back in some lawn chairs and began to vaporize the DMT. It is a bad idea to let the flame of the lighter touch the DMT for it will instantly be torched into one rip and is a complete waste; we held the lighter over the DMT without touching it to the substance and let it slowly sizzle. My buddy took the first rip and then passed it on to me. I took one heavy rip and got a lot of vapor in lungs and nearly coughed it all up. The taste is very strange and exotic; almost like burning rubber in my opinion.",
  "Anyways, I held my rip in for as long as I could until I got a heavy rush and my heart began pounding. Very shortly after my ears began to ring/buzz real loudly and I looked up at my friends house and it began to literally shake very intensely and change all sorts of colors. I started to get the fear for a minute and then came the surprise: A bunch of bright yellow lines spun out and made me feel as if I was spinning in circles and then the lines shot forward and my complete field of vision became wiped out and I was in a completely different state of conscienceness.",
  "Nothing around me was real anymore, and I got very uncomfortable and starting yelling out really loudly, 'HOLY SHIT! HOLY SHIT! WHAT THE FUCK IS GOING ON! THIS DOESN'T FEEL RIGHT!'",
  "I turned and walked towards what used to be grass but now was a tiled black and white checker-boarded surface and there was walking chess pieces holding staffs walking across the board; pawns, rooks, bishops, knights (literally horse looking creatures).",
  "After that my initial fear went away and I eased into the trip and was so fascinated that I wanted to go walk through the woods in the back. As I walked through the path everything around me was totally alive; I felt like I was in Wonderland. I could feel every single particle in my body tingling with energy as the intense geometric, no, not geometric, more like 'clean' looking visuals sent waves and reverberations through my body. Everything was so colorful and alive that I can barely put it into words. I was in disbelief. I could see little woodland creatures making hissing noises walking behind the cartoon looking trees and majestic 'lady woodland' figures and all sorts of things walking around and rustling through the leaves. The ground was still completely checkered.",
  "And here is the part that makes this story/trip very spiritual and life-changing in a way. I had a court date the next day for some heavy charges where I was to be put on probation for two years with conditional jail time; my lawyer said that the judge will probably give me 2 months. You must understand this in order to understand how bizarre this was.",
  "Anyways, I looked to the sky and there was just wavy patterns forming faces, and eyes, and they were just moving around so intensely like a big-ass campfire on a windy-ass day. These patterns eventually formed a womans face that kind of looked like a majestic (I like that word a lot) bird lady with a gown on and she spoke to me. She said, 'When you wake up tomorrow morning you will have a 50/50 chance of whether you will go to jail or not. If the sun is shining when you awake then you will get off with no jail time, however, if when you wake up tomorrow and the skies are overcast and the sun is no where to be seen then you will sit in jail for 2 months.'",
  "After that I came out of the woods to my buddy and we both were screaming about how awesome it is that we made something that can do that to you. We were both just in awe and disbelief and couldn't stop screaming about how fucking awesome that was and we slowly came down.",
  "We smoked more DMT right afterwards, that's our 'hippie-crack.' All it did was continue the sweet visuals, but nothing out of this world like the first experience; we weren't down for that again that night. Of coarse we smoke the shit all the time now because we love it, but that was enough for one night. The duration of the 'out-of-this-worldness' was about a half hour for me before the chessboard ground began to turn back to grass",
  "Anyways, I went to sleep eventually, and by the way, had the most introspective and realistic dreams, but that's besides the point. The point, I woke up the next morning and the sun was shining! I went to court for my sentencing and, VOILA, no jail time!"
 ],
 "erowid": {
  "id": "75937",
  "citation": " Jamin. \"In the Rabbit Hole, Through the Looking Glass: experience with DMT (ID 75937)\". Erowid.org. Sep 30, 2009. erowid.org/exp/75937",
  "substance": "DMT",
  "views": "5624"
 }
}
