{
 "id": 12104,
 "title": "Fly Agaric and Magic",
 "date": {
  "submission": "2009-04-22T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "pete_p",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "Tryptophan",
   "specific": "5-HTP"
  },
  {
   "time": "0",
   "administration": "repeated",
   "substance": "smoked"
  },
  {
   "time": "Cannabis",
   "substance": "repeated"
  },
  {
   "time": "smoked",
   "amount": "Tobacco"
  },
  {
   "time": "0",
   "amount": "smoked",
   "administration": "Amanitas - A. muscaria",
   "substance": "(dried)"
  },
  {
   "time": "0",
   "amount": "0.35 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "specific": "P. cubensis"
  },
  {
   "time": "(dried)",
   "substance": "oral"
  }
 ],
 "report": [
  "Summary:",
  "Smoking Amanita Muscaria negates the pleasurable psychoactive effects of eating Psilocybe Cubensis.",
  "Context:",
  "Three friends on a nice night in involving food, drink, music, dvds and various psychoactives.",
  "Description:",
  "At the start of the evening, I took approx. 25 mg of 5-HTP, because I find it helps ameliorate the fuzzy-headed hangover I can get from smoking weed.",
  "After eating a full meal with a few drinks we put some mild weed into a water pipe (shisha, hookah). we used about 3 joint's worth and added 1 joint's worth of stronger 'white widow' skunk. we used a mild strawberry shisha tobacco, which has a minimal narcotic effect itself. smoking this over about an hour gave the expected nice, clear-headed buzz with slight giggles and not much of a stoned out feeling afterwards.",
  "Next, we put 0.75 g of dried Amanita Muscaria into the shisha and packed it with strawberry tobacco, as before. The amanita was purchased from an online head shop and was apparently 'cured at source... at 170 - 200 F'. Smoking amanita joints in the past had given the relaxed feeling and mild skin sensitisation described in other submissions. Smoking this shisha, again over about an hour, had the same effect, although it was barely discernible over the effects of the cannabis.",
  "My friends then ate some of the Amanita Muscaria. They each took 4.1 g with some food. I ate 0.35 g of dried Psilocybe cubensis mushrooms. I had taken some of this sample previously and expected some definite, but not overwhelming, trippy effects at this dose. We all also took one capsule of milk thistle (standardised to contain 140 mg Silymarin). After 2 1/2 hours (watching a film), none of us had felt anything significant. My friends were very drowsy and one of them had a headache. I also had a headache, felt quite restless but stoned at the same time, and had experienced none of the trippy effects I expected.",
  "My friends went to sleep shortly afterwards. I had something to eat, smoked a small, mild joint, took another 25 mg of 5-HTP and went to sleep after about an hour, once the effects of the cannabis had worn off.",
  "None of us slept very well, and only for about 6 hours. The next day, my friends felt a little fuzzy-headed. I felt a strange combination of states: intellectually alert enough to write this report in spite of not having had enough sleep, introspective and quiet, my senses were heightened but my emotions were dulled (so although music, lights, pictures all seemed more intense, they didn't evoke any particular feelings in me). The after-effects lessened during the course of the day.",
  "Conclusions:",
  "It is possible that my friends did not eat enough of the Amanita Muscaria, or wait long enough, to experience any significant effects.",
  "Excluding the amanita, I have taken all the other substances listed (Psilocybin, Cannabis, Alcohol, 5-HTP, Milk Thistle) together in similar amounts and had a very nice time, gently tripping out. Therefore, I think smoking the Amanita Muscaria must have dulled some of the other effects, particularly those of the Psilocybe cubensis."
 ],
 "erowid": {
  "id": "75947",
  "citation": " pete_p. \"Fly Agaric and Magic: experience with A. muscaria, P. cubensis, Cannabis, Alcohol, 5-HTP & Milk Thistle (ID 75947)\". Erowid.org. Apr 22, 2009. erowid.org/exp/75947",
  "substance": "A. muscaria, P. cubensis, Cannabis, Alcohol, 5-HTP & Milk Thistle",
  "views": "8077"
 }
}
