{
 "id": 12110,
 "title": "Persisting Confusion and Other Effects",
 "date": {
  "submission": "2002-09-27T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "John",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Sertraline",
   "form": "daily"
  }
 ],
 "report": [
  "I have had the same experience as Jon when he wrote 'Bad Trip'.  I used to be a heavy user until got caught.  I am 15 and recently had started using zoloft for anxiety and it seemed to work but at the same time I also started using bud heavily.  Alomost everyday after school for about two weeks.  Everyday I would smoke about 5 bowls with a freind.  But now it feels like im still in a mild high.  Like a phsycosis.  its really hard to explain how I feel.  I see things diffeently and I think differently but I know whats going on.  It feels like I'm out of reality yet I know where I am and I know whats going on.  I dont know if its a combination of puberty, cannabis, and zoloft but it is really starting to scare me because I know that other people have the same problem.  But I like it because im not as anxious as I used to be.  I still act normal and I asked my family if they have noticed a change in me in the past 2 months or so and they said they havent. ",
  "I havent smoked for about a month now and im still feeling it.  Sometimes I feel I am in a state on confusion but it quickly goes away and it sometimes feels im coming down from a high but comes back later.  I want my normal life back.  Also I have noticed that I do tasks without complaining.  For example, if my parents ask me to do something I used to complain and linger about the fact that I have to do this or I could be doing something else and would even look for ways to get out of it.  Now I just do it with no complaints.  But I think that is the zoloft working.  Its really hard to tell."
 ],
 "erowid": {
  "id": "7597",
  "citation": " John. \"Persisting Confusion and Other Effects: experience with Cannabis (ID 7597)\". Erowid.org. Sep 27, 2002. erowid.org/exp/7597",
  "substance": "Cannabis",
  "views": "9209"
 }
}
