{
 "id": 12122,
 "title": "I Saved My Soul That Night, and Yours Too!",
 "date": {
  "submission": "2009-06-08T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fearless King",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  },
  {
   "time": "1:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "liquid"
  }
 ],
 "report": [
  "About me:",
  "I'm a 21 year old musician, chess player, and psychonaut.  I'd say I have an intermediate experience with hallucinogens having done mushrooms more times than I can count and acid a dozen times.  I have no family or personal history of mental illness, I smoke marijuana daily, and I generally have my life together.",
  "This particular event took place when my main band decided to ingest acid together for the first time with some new liquid we had aquired.  I had broken up with my girlfriend the night before but I felt that I was in a peaceful enough mindset to be okay with the planned trip.",
  "The Trip:",
  "T+0:00: The guitarist and I have taken acid together since the beginning, the drummer a few times, and it was the first time for our singer.  'Guitar', 'Drums', and I took 2 hits each, and 'Singer' took 1 to test the waters.  We decided to listen to some music while we waited to feel the effects.",
  "T+1:00: An hour later Drums and Singer were starting to feel the effects while we were listening to The Doors.  Guitar and I were not impressed with the new acid and passed it off as weak.  We each took another hit.",
  "T+1:05: The first two hits started to take hold for me and I looked at Guitar.  He was looking back at me with the same, 'Oh my god, what have we done?' look on his face.  We laughed and decided to get ready for an awesome trip.",
  "T+1:30:  We were listening to Portugal The Man's new album and I was watching the ceiling warp and change while the lyrics took me to a faraway place in my mind.  (This CD would set the tone for my battle to come.  If you have heard the album then you already understand.) I was having the time of my life and I believe I can safely say the same for Guitar and Singer.  Drums was slowly spiraling downward into his own introspection and wasn't liking what he was seeing.  We could feel the bad trip across the room.",
  "T+2:00:  Everyone was full blown tripping at this point.  We had planned out most of the trip and it was time to listen to our new release to get inspiration for new music.",
  "As we listened to our CD I closed my eyes and let my mind wander.  I imagined a woman dressed in a cloak from the future placing an object on a pillar.  I couldn't see what it was because the item was bright like the sun.  She placed it on the pillar and the light grew until it was brighter than the sun and in an instant it was gone.  Teleported back in time where it would be safe.",
  "To me, that object was our music and we had somehow found it.  I knew it as a powerful weapon that could be used to destroy the world or bring it to glory.  It was all ours.  I suddenly knew myself as a guardian of an ancient relic, my band mates were my fellow warriors.",
  "The CD ended and I opened my eyes.  I was feeling the third hit and the world was entirely new.  Our house had become an ancient land.  The music room was a treasure room where we kept our precious weapon.  The rest of the house was an itracate series of tunnels in a cave designed to confuse those who would come to steal it.",
  "I looked at Guitar, the silent assassin.  He was smart, calculating, and precise.  Singer was a noble knight, a bit loud and arrogant, his intentions to change the world were righteous.  He was our leader.  I am the biggest and strongest of the group and I felt like the muscle.  My bass was a weapon of power, I had to be careful where I put the notes because I could change the edge of our weapon altogether if I wasn't careful.  Then I looked at Drums.",
  "Drums was having a terrible trip.  I looked into his eyes and saw for a brief moment something I've never seen before.  A demon...I knew then that a demon had possessed Drums in order to get close to the weapon.  He wanted to get close to us so he could use the weapon to destroy the world.",
  "To make matters worse he kept saying Demon-like things. 'We're going to become great and take over the world!'  I 'knew' that my fellow warriors would not be fooled by such trickery but I couldn't call him out on being possessed or we could be killed.  Now was the time for calm moves.",
  "T+3:00: After listening to our release and taking a quick break, we piled into our music room and hooked up our equipment.  My bass felt new.  For the first time I appreciated the smooth edges, the way the strings felt in my hands, the weight of the bass on my shoulders.  I was one with this weapon and I wondered briefly if somebody would find this ancient relic and use it's power someday for good.",
  "Drums asked in a demonic fashion, 'If you could play one last song before you died, what would it be?'  So this was how it was going to end.  The demon was going to kill us after he learned the secret of the weapon.",
  "We started playing one of our old songs.  I felt that the three of us were battling with the demon through music.  It was like a video game, every well played note seemed to hit the demon and every misplayed note made the demon stronger.",
  "Drums was terrible.  The drum parts were inconsistant, the tempos kept changing, and I figured it was because demons didn't understand how to use the weapon correctly.  I couldn't let this get to me, we had to destroy this demon.",
  "After the intro was over and the song really picked up I closed my eyes as if being forced by an unknown entity.  No matter how I tried I could not bring myself to open them.  I played my parts on instinct and feeling.",
  "Suddenly, I felt our souls being transported into Hell.  The music was distorted and alien.  All of the evil in the entire universe had surrounded us.",
  "At the moment it was clear, we weren't fighting for just our souls.  We were fighting for the souls of the entire world.  This was the time to fight back.  The fate of the world and its inhabitants depended on us.",
  "T+3:04:  I have never played the song so well and with so much passion.  Could the souls of 3 men defeat the entire army of evil?  Does love really conquer all?  I wasn't sure, but I would be damned if I didn't try.",
  "The song was nearing the finish.  I felt like we were losing, it was just too hard to play against the drums that were consistantly wrong.  I started to lose faith.  This could be it, the world would be destroyed because we toyed with a weapon far too powerful for mere mortals.",
  "It was only a matter of time, the song was almost over.  Evil was winning.  I perceived the temperature in the room rising by potentially thousands of degrees.  My skin felt like it was melting off of my bones.  I had to try, I had to fight, what else could I do?  I loved the world!  I couldn't let it be destroyed.",
  "The outro began, the part where I do back up vocals.  As I shouted my back up lyrics I felt a strange sensation.  Love was coming out of my chest and filling the room.  It wasn't just from me, I could feel the love coming out of Guitar and Singer's chests as well.  I could even feel it from Drums.  The weapon wasn't sent from the future, it wasn't kept in the music room, and it couldn't be stolen by evil.",
  "The weapon was love and we each had a piece of it in our hearts.  I heard the demons start to scream. I could feel them clawing at the walls and trying to escape.  We were killing them off!  We could actually beat this!",
  "The song ended and my eyes opened.  The room felt cool, calm, and peaceful.  Drums looked up and said, 'I feel like I just woke up.'",
  "'Welcome back.' I said with a smile.  We turned off our instruments and separated into our own rooms.",
  "T+3:05 onward:  I spent the next several hours in my room playing online chess while still tripping.  I felt sober compared to the events that happened in our music room and in truth I won most of my games before falling asleep for several hours.",
  "I stopped feeling the effects of the acid completely around T+10:00",
  "While the trip was intense and intricate, the lesson I learned that day was very simple and I believe it to this day:  Fight for what you love.  If you go down in the name of love at least you tried.",
  "Cheers."
 ],
 "erowid": {
  "id": "76044",
  "citation": " Fearless King. \"I Saved My Soul That Night, and Yours Too!: experience with LSD (ID 76044)\". Erowid.org. Jun 8, 2009. erowid.org/exp/76044",
  "substance": "LSD",
  "views": "5448"
 }
}
