{
 "id": 12134,
 "title": "A Slow Tumble Forward into Nothingness",
 "date": {
  "submission": "2003-06-21T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "littlejosie",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "180"
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Foreword:  This was my second true experience with DXM.  The previous week, Id tried 80 mgs of DXM via Benylin Adult Formula cough syrup.  [It gave me constant diarrhea for the remainder of the day; I dont recommend this to anyone.]  Later the same day, Id taken an additional 180 mgs of DXM with Coricidin, as my friend F wanted to see what the DXM high was like.  I didnt get a good feel for it, because it made me very drowsy, and I was able to sleep through my peak time.  Now, after a week, I was ready to try an honest to goodness dose, and fully experience the high.",
  "9:50-10:10:  Its about T+1:30 by now.  I've ingested 180 mgs of DXM and consumed three small bowls of decent marijuana.  At T+1:00, I could definitely feel a mood lift, some muscles twitching, a general remote feeling (removed from my surroundings).  My skin is kind of tingly, and I certainly feel lightheaded.  I am not nauseous at this point; all I had to eat today was a small fast food burger 8 hours before.  Right now, the munchie factor is ahead of the appetite suppressant in the DXM; Im snacking on cheese popcorn.  Everything seems very hilarious.  Im in a very pleasant headstate.",
  "1:45:  Im starting to come down, I think.  I no longer have that absolute speedy feeling (even though I havent tried any, it had to be an amphetamine rush of some kind).  The peak was at about T+3:30.  I had a kind of shamanistic high, a clear fresh thought moment.  My train of thought was complete free association; images and words joined together symbolically in my mind, and somehow I was making sense of things.  Imagery was dreamlike, closed-eye free association visuals, taking shape as instantly as I thought them up, rapidly flowing into the next concept.  The jittery amphetamine high was intense, and hard for me to incorporate.  I had several moments where I honestly wondered if Id taken a toxic dose and would die.  (This lead to a string of free floating consciousness thinking where I came to a deeper understanding and acceptance of death, life, and other mystical experiences.)",
  "2:35:  Still tumbling down, but the descent is feather-light.  I have a bit of jaw clenching from time to time.  During my peak, I felt very flushed, and very speedy.  Now, after about 8-9 bowls of cannabis, I feel as though Im psychically in zero gravity.  Its a slow tumble forward into nothingness.  Im suspecting the pot is cushioning the come down just a little bit.  My vision has been blurry for much of the night.  Focusing on any set train of thought was incredibly difficult, particularly during my peak time.  Right now, my skin feels internally stimulated.  And, finally, my exhaustion is beginning to kick in.  Ive gotten ridiculously low amounts of sleep this week, and Im amazed I made it until almost 3:00 a.m. on this substance.",
  "Afterword:  Its 2:20 p.m. the next day.  Immediately after hitting the sheets, I was out like a light.  Right now I feel still tired, but not sleepy kind of run down (but I dont know if that has to do with last night or more with my lack of sleep earlier this week).  I feel a bit unsettled, more hyper than I usually am right after I wake up.  Im hungry, too!  Even though I did manage to eat last night, if I had only been on cannabis, I would have eaten much more.",
  "I have to say the pros definitely outweigh the cons here.  I wouldnt want to do more than 6 Coricidin tablets, as that would be more than a daily toxic dose.  But it certainly mixed well with the marijuana, and likewise the marijuana definitely enhanced the DXM.  I can see myself writing up rituals and other ways of incorporating these substances in events where meditation and spirit-walking are primary goals.  F suggested that maybe next time Id want to take only 4 or 5 tablets, if I wanted a more mellow time, and Im considering that as well.",
  "There was a lot of time dilation.  Since I neglected to mention that, I thought Id throw that in here now, because it was significant.  As my peak was starting to take hold, F had left me alone to smoke more pot, while I lay on the sofa in the living room with the television on in the background.  It was too much for me to watch the television; I just wanted the background noise.  I was curled up against the back of the sofa, trembling quite a bit.  Id taken off my shirt, because my temperature seemed through the roof; but I was still under a light blanket, because the air conditioning seemed too cold to handle.  Occasionally Id mumble or groan under my breath; there was a lot of twisting and turning from side to side.  I felt antsy inside my skin.  I couldnt concentrate on any one thing.  My mind was leaping from concept to concept.  When F came out to fetch me for more smoking, it seemed as though Id been out there for hours and hours, but it had only been one hour.  I was amazed.",
  "I couldnt recommend this to everyone.  I had a very intense time.  F described it as getting the body load and buzz similar to acid, without the actual visuals.  I dont know if I would quite describe it like that.  What Im interested in now is finding pure DXM instead of using the Coricidin; Id like to do more than a 2nd level dose, without the fear of taking a fatal dose of OTC medicine.  Im looking forward to doing this again."
 ],
 "erowid": {
  "id": "7612",
  "citation": " littlejosie. \"A Slow Tumble Forward into Nothingness: experience with DXM (with CPM) & Cannabis (ID 7612)\". Erowid.org. Jun 21, 2003. erowid.org/exp/7612",
  "substance": "DXM (with CPM) & Cannabis",
  "views": "18909"
 }
}
