{
 "id": 12133,
 "title": "Quetzalcoatl, God & Satan",
 "date": {
  "submission": "2012-02-08T08:00:00.000Z",
  "experience": null
 },
 "author": {
  "name": "Quakeroats",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "4",
    "quantity": "4"
   },
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "I had just recently bought a bag of Psilocybe Cubensis shrooms (4 grams or a little over 1/8ths total proved by two different scales) from a friend not 4 weeks ago.   The shrooms are definitely Cubensis, and a very light blue adorns certain parts of the mushrooms.  This to me indicates oxidation of the psilocybin/psilocybe, I first got them fresh (day old and dried) and did not see this. ",
  "I had waited for a pristine time to do them, and what better time in my opinion than the night of New Years Eve.  I am writing this as I wait for the shrooms to start kicking in.  I had just the night before taken 50mg of Seroquel for my insomnia, but had refrained today because I've heard Seroquel can affectively stop a psychedelic trip from occurring.  Quetiapine (Seroquel) and Psilocin/Psilocybin are medicines/drugs that both target the receptors of Serotonin and Dopamine. Specifically for Seroquel, the D1 and D2 dopamine receptors are antagonized, the alpha-1 and alpha-2 adrenergic receptor, and 5-HT1A and 5-HT2 serotonin receptors.  Psilocin targets the Serotonin receptors and acts as a potential agonist instead.  By some peoples notes, the effects seem to cross each other out. ",
  "11:15PM - Started off by taking approximately 4 grams of shrooms.  Taste is exactly how I remembered taking them many months ago, I can stand it just find, just ate them one by one.",
  "11:30-11:35PM Starting to feel an initial body high.  My vision appears to be a little bit more glossy than anything, kind of like a marijuana high but slightly less intense.  No visuals yet.  I can feel the crawling sensation throughout my arms as I type this passage.  I feel a lot more tranquil now; I was really rushed with anticipation waiting for this trip to happen in the last few minutes, but that anticipation has subsided.  Definitely a slower reaction than previous trips, because I had eaten pumpkin pie and pizza before eating the shrooms.",
  "12:02AM (New Years Day)- Starting to feel the effects, although typing has been very hard this last half hour. Hearing fireworks outside",
  "12:30 - Went downstairs and ate a Yogurt.  Stomach ache is felt slightly, and this is the first time it has ever happened, but diminishes not 10 minutes later.  I watched my newspapers on the table as I ate start to defy gravity and the newspapers started flapping gently, like a breeze was allowed through a close window.  I decided that the trip was becoming more intense and that I should reside to my room.",
  "12:45AM - Major effects are felt right now.  The PC screen is a kaleidoscope of colorsits so beautiful.  It is like an unusual anomaly, Im actually seeing a beehive of intricate networks in my screen.  The keyboard also feels very different, its harder to type and my muscle memory is more difficult to perform.  I feel that I should only act as a spectator to this event that is unfolding.",
  "1:05AM - Lost consciousness",
  "The rest of the trip I lost track of time.  The final effects of the trip ended at",
  "3:51 AM - The start of the hallucination during the times of 1AM and 3:51AM are as follows.",
  "Quetzalcoatl Encounter - I started off by meditating on my bed for about a ten minute period at most.  I then saw a distinct figure in my meditation, the snake god of the Aztecs and several indigenous tribes of Mexico, Quetzalcoatl.   He started off way in the distance, and slowly came closer, and he was different than I had imagined.  His body was a complex multitude of polygons, all in a swarming block formation, like a Rubiks Cube, but instead it was in all directions.  He had filled my closed eye vision, and there were colors everywhere.  He then lifted me up and showed me his face.  He looked like a huge dragon, and peered into my face.  He had a face that I would estimate to be like the size of a small single story house.  He then gripped me and lifted me up, but ever so gently. ",
  "I remember embracing him and finally feeling that I had a place of belonging in my life.  Tears streamed down my face as I hugged his back to hang on. I was having so much fun and euphoria when he lifted me into the sky, away from my house and into the universe for discussion of an extraterrestrial nature.",
  "Except that he didnt somehow like my presence.  Because I think at that moment I angered him greatly by me laughing at this great spectacle.  He constricted my body and I felt my vitals give out.  My breathing slowly stopped and I felt my heart slow to a stop.  It was then that I fell back on to my bed, and died.  I died and disintegrated into pieces, and had realized that I had somewhere along the line grown 6 extra arms, because I could use them to feel my broken body.  My hearing became really high pitched, like the hearing after a rock concert, it was constantly ringing.  I could hear my parents say what is wrong with you son, and I heard them say that they were going to be there for me when I died.  I was hoping that in real life they hadnt appeared in my room because I was incapacitated and couldnt respond.  The entire time I knew the shrooms were lying to me.",
  "Satan Encounter - My fan in my room instantly spawned a flaming Pentagram when I lie there dead.  Satan appeared then from the pentagram, but was merely a face, and went right up to me and laughed and then went away.  I was not afraid, and the entire encounter lasted a very short time.",
  "Quetzalcoatl then appeared, he morphed my room and I was left to explore what was left of my heavily voided room.  The walls had split, the windows had turned to mirrors, and the door was missing a door knob. I came to the conclusion that I was a spirit, and was left to haunt my very own room.  My vision changed from color prisms, into a dark 'noir' type of view.  Everything was black and white.  This thought of a permanent haunting was very dramatic for me to take, but I did not fret too much.  I basically acknowledged that I was dead and this is where a spirit goes.",
  "God Encounter - God then told me in this state that I was truly dead in real life.  He had told me that I had jumped through a window while on shrooms and my parents and the ambulance declared me dead on the spot.  He told me that I did this when I thought that Quetzalcoatl picked me up and dropped me.  He told me that I was a God in my own right, that I would be free to gather the cosmos, but instead I hated this bit because this would mean that I would see no one in my family or my friends the rest of my existence as a spirit.",
  "I woke up from this in a section of my house.  Evidently I was sleep walking, and I had to use the restroom badly.  I went over to the restroom and I saw that it was closed, and the light was on.  I opened the door to find that there was nothing but a white contrast on the inside, completely white and no floor.  I then appeared back to reality in my room and went to use the restroom.  By this time the effects were almost completely worn off and I lay in bed to organize what just happened in my trip.  I wrote this trip report during the trip until around 12:45 AM before stopping and only resuming the next day. ",
  "The trip was very traumatizing for me because it represented an extreme consequence of taking shrooms without a sitter, a vision telling me in the trip that I had died in reality had truly hit home with legitimacy; I could no longer see reality.",
  "I did not, I repeat, did NOT have a bad trip.  It was only the intensity of the trip that made me seriously believe that I was dead.  I have since this day completely changed my outlook on living life when you know it can be taken away in an instant, at any time.  Thanks for reading my trip report and happy and safe shrooming everyone."
 ],
 "erowid": {
  "id": "76112",
  "citation": " Quakeroats. \"Quetzalcoatl, God & Satan: experience with Mushrooms - P. Cubensis  (ID 76112)\". Erowid.org. Feb 8, 2012. erowid.org/exp/76112",
  "substance": "Mushrooms - P. Cubensis ",
  "views": "2101"
 }
}
