{
 "title": "I Can't Control the Volume of My Voice",
 "author": "Whichonespink?",
 "citation": " Whichonespink?. \"I Can't Control the Volume of My Voice: experience with DXM with Pseudophedrine & Drug Testing (ID 12143)\". Erowid.org. Sep 8, 2008. erowid.org/exp/12143",
 "substance": "DXM with Pseudophedrine & Drug Testing",
 "bodyweight": "155 lb",
 "header": [
  [
   "DOSE:",
   "10 oz",
   "oral",
   "DXM",
   "(liquid)"
  ]
 ],
 "report": "<p>I had just eaten some fried chicken.  I went to the store and bought a 4 ounce bottle of VICKS with just DMX in it.  I drank the whole thing.  Got home about 30 minutes later, drank another bottle of VICKS, but this one had pseudophedrine in it as well.  After about 3 hours, I was feeling stoned and drunk, but I could still be coherent, and walk normally.  I was getting pissed, because usually it doesn't take 3 hours.  I decided to drink another half bottle of VICKS with pseudophedrine.  Bad move.  Turns out, the food had delayed the reaction.  Somewhere from 30-45 minutes later, I realized I was fucked out of my skull, and was tripping balls.</p><p>At this time, I began to watch the movie snatch.  My parents were gone at this time, and as I watched the movie, I began to consider the actors characters in a video game.  It was fucked up shit.  I lost track of time, and thought my parents had been gone for about 6 hours.  It had been about two.  I called them, told them I was lonely, and that they should come home.  I was beginning to slur my words.  They didn't notice though.</p><p>My dad is an ER doctor.  He sees quite a few people tripping, so I had decided to stay in my room that night and watch my colored lights and listen to Floyd.  Good idea.  I staggered upstairs to my room as soon as I heard the car pull in.  I stayed in there for about 30 minutes, but I started overheating and got really thirsty, so I went downstairs to get a drink of water.</p><p>My parents were standing there in the kitchen talking about something.  I can only imagine how stupid I looked - staggering into the room, no wait.  I couldn't really tell where my legs were, so sometimes I would stomp my feet down, sometimes putting them down very lightly - I fell once, which I think tipped them off.  I got up, and opened the cupboard and got a glass.  My parents are watching me still.  I filled it up with water, and tried to drink some.  It took two hands to hold the glass, so I looked pretty fucking retarded.  I turned to stomp/stagger up to my room, when my mom says, STOP.  At this point I was tripping so bad it didn't register I was going to be possibly caught.  She says, why are your eyes so dilated?  Jesus Christ!  Look at his eyes!  My dad looks, and says, yep.  They are dilated.  Are you high? </p><p>I said no quite vehemently.  I actually yelled it, so I pretty much said 'Yes, I can't control the volume of my voice!'  That's what it amounted to.  Anyway, they started a ruthless interrogation, which dragged on for hours, actually about 5 minutes.  During this time, my answers were complete gibberish, if I managed to get the whole sentence out before my mind trailed off into the trippy, trippy, DMX high.  One question was, why are you so thirsty?  My answer:</p><p>Hime notch hirsty I gust..... then I looked around until they told me to go to my room.</p><p>The next morning, I received a drug test.  I was positive for Amphetamines and PCP.  My dad informed me that he had found 3 bottles of cough syrup in the trash, and that DMX and pseudoephedrine can cause false positives.  I have to get another drug test in about a week.</p>",
 "year": "2002",
 "id": "12143",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2008-09-08T07:00:00.000Z",
 "views": "12583"
}
