{
 "id": 1214,
 "title": "Turn Into A Cartoon And Disappear Through The Walls",
 "date": {
  "submission": "2005-09-21T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cookieguy",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "3:50",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I am a 16yo male who has smoked a lot of pot, done plenty of DXM, Codine, speed, and ether.",
  "Well I had been really excited to try this substance and I finaly had the chance. I tried it last Tuesday(today is Thursday) and I had a wonderful time even though I expected somewhat more.",
  "T+0:00 (5:00PM) - I took 50mg of AMT wraped in a rolling paper. I chose to parachute it because i wanted it to kick in faster than if i took it in a gelcap. It should be noted that I ate about a half hour before i took the AMT.",
  "T+2:00 - Eat dinner",
  "T+2:45 - So far i have just had a couple hints of something psycoactive. The main one was while I was smoking a cig. It was dark out so it was very easy to see the cherry. The only thing is the cherry was sticking out to the sides past the rest of the cig after a second i realized that this was impossible. I also saw a plane fly over head and its lights leave a slight trail and some nice paterns flowing from the trees(bare branches) into the sky.",
  "T+3:30 - After talking to several online friends who are experianced with AMT and decided to ake another 50mg (100mg total) in a rolling paper.",
  "The rest of this i'm not really sure about the times so it will be in no particular order. While i was talking in IRC i started looking at my wall that has a poster of several brightly colored mushrooms. The wall and poster started to melt, then started to tilt back and forth. Intrestingly it was only that one wall but not the wall joining it. At this point i decided to go laydown on my bed and just watch the poseter. The big mushroom in the center of the poster turned into a slug and a frog a couple times during the night.",
  "On another wall in my room I have it almost covered with pictures of girls from Maxim, and as i was looking at it they became one mozaic of several colors. Later several of the girls combined to form a dragon's head about to eat one of the girls. One of the most entertaining parts of watching the pictures was when a couple of the girls would start moving.",
  "And lastly one of my favorite things to do thoughout the night was to go into my bathroom, turn off the lights, wait a minute, look towards the mirror, flip the switch and watch myself turn into a cartoon and disapear into the walls.",
  "I stayed up through the night and was mostly down by the time i had to goto school, although my pupils were still fairly large when i looked in the mirror (although my friends all told me they looked normal except one was off center).",
  "Definatly a substance that i want to try again, but i'll take the whole 100mg at once. My advice to anyone taking it to go out and do something."
 ],
 "erowid": {
  "id": "13580",
  "citation": " Cookieguy. \"Turn Into A Cartoon And Disappear Through The Walls: experience with AMT & Cigarettes (ID 13580)\". Erowid.org. Sep 21, 2005. erowid.org/exp/13580",
  "substance": "AMT & Cigarettes",
  "views": "6138"
 }
}
