{
 "id": 12175,
 "title": "The Journey of Life",
 "date": {
  "submission": "2009-03-23T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Scott",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "2C-P"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine"
  }
 ],
 "report": [
  "First of all. This was an AMAZING trip. I took the 10 mg at about 14:00. My mates and got on a bus and we went down to Little Venice.",
  "We wondered around for a couple of minutes and after about 30 minutes I started feeling it kicking in. At this time we were in a park and I really didn't know where I was, a little bit of confusion. Everything started getting very liquidy. The grass and trees were flowing, like the leaves were dropping down and looking like amazing water drops and I could even hear them as the fell on the ground. The grass was moving like the ocean. The visuals were really intense. Then we rolled a joint and that boosted the everything. After the joint we moved out of the wind and went to stand underneath a tree where the wind couldn't get us... This was about 1 hour after I took it. We smoked another joint and that is where I got lost. My mate said we should go take a stroll up to Camden. As we were walking it felt like everyone around me was tripping. My eyes were moving from object to object but it felt like I was staring at them for a life time.",
  "In Camden we went through the market and it felt like I was in a fairy land. Every single person I made eye contact with, I could see into their lives. only for that instance of looking into their eyes. Then me and my mates just started making noises and we could understand each other completely. We went to a pub to get some drinks. We sat outside as we drank 3 pints each but i couldn't stop shivering. But I wasn't cold. Then the visuals started again. Really intense. The floor looked like it was 3D and moving. Then I suddenly knew everything about life itself. Previous and future Experiences were coming real fast. I was floating outside my body and looking at myself living.",
  "I checked the time and it felt to me as if it was already 23:00 but when i checked the time it was only 19:00. I couldn't believe time was going to slow. I was traveling not in time and space at the same time but in space and time at different stages. I was in two dimensions at once. I was only feeling one emotion the whole time.",
  "At the peak of this 'journey' I was on it was really confusing. As if my body was fighting this emotion of happiness. But my mind took over I was just going with the flow. This went on until we decided to leave. then reality came back stage for stage. We walked back home and we sat in the kitchen. Not felling tired we kept on chatting away until 03:10. That's when we decided to go sleep. We all had a hard time falling asleep but it was a good time.",
  "It was the first time I took 2c-p and definitely not the last time..."
 ],
 "erowid": {
  "id": "76359",
  "citation": " Scott. \"The Journey of Life: experience with 2C-P (ID 76359)\". Erowid.org. Mar 23, 2009. erowid.org/exp/76359",
  "substance": "2C-P",
  "views": "7112"
 }
}
