{
 "title": "Significant Effect",
 "author": "Fred",
 "citation": " Fred. \"Significant Effect: experience with Piracetam, Hydergine, Lecithin, Choline & Clonazepam (ID 12187)\". Erowid.org. Nov 10, 2003. erowid.org/exp/12187",
 "substance": "Piracetam, Hydergine, Lecithin, Choline & Clonazepam",
 "bodyweight": "60 kg",
 "report": [
  "<p>I am 21 years old and use several drugs enhancing my memory capabilities. I started with Piracetam about 2 years ago and use it till now with several breaks. My opinion about this drug is quite positive, but effects on my memory arent so considerable.",
  "My last course of Piracetam began about 1 month ago and continues till now. I began with starting dosage of 4,8 g for 5 days, then decreased it to 4,0 g and now use 2,8 g daily. Improvement is insignificant. I mentioned, that high dosages (even 6,0 g daily) do not create greater effect on me, comparing with normal recommended dosages (2,4-3,2 g daily). So I decided to continue therapy with these normal dosages.",
  "Several weeks ago I read about Hydergine and its synergistic effects with Piracetam. So I decided to try. Now I am using 4,5 mg daily for about 2 weeks and mentioned quite significant memory enhancing effect. Also, with these two drugs I use lecithin and choline in dosage of 4 g per day.",
  "One fact, which can mask the real effects of nootropics in my case history, is a depressant drug - Clonazepam. I am forced to use it, because I have vegetodystonia syndrome, which ceased only with Clonazepam (or Alprazolam). So I use 2,0 mg daily with no breaks for about 1 year. Very interesting, but I feel no side effects of Clonazepam (and any other BZD)- only several times it seemed to be effecting on me in its sedative or hypnotic properties. But anti-vegetodystonic effect of Clonazepam (or Alprazolam) is nearly 100%. All other BZDs I used (Diazepam, Medazepam, Chlordiazepoxide, Oxazepam, Triazolam, Midazolam, Flunitrazepam, Lorazepam, Nitrazepam ) are helpless- quite a strange situation.",
  "Several words about getting Piracetam and Hydergine in my country. Piracetam is over-the-counter. Hydergine is a prescription drug, but it also used to treat vegetodystonia, so I can easily get it. My therapy with these drugs (Piracetam 2,8 g + Hydergine 4,5 mg) costs me about 0,5$ daily.</p>"
 ],
 "year": "2002",
 "id": "12187",
 "gender": "Male",
 "views": "32194",
 "dose": [
  {
   "time": "0",
   "amount": "2.8 g",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "4.5 mg",
   "administration": "oral",
   "substance": "Hydergine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "2.0 mg",
   "administration": "oral",
   "substance": "Pharms - Clonazepam",
   "form": "(daily)"
  }
 ],
 "submissionDate": "2003-11-10T08:00:00.000Z"
}
