{
 "id": 12195,
 "title": "What Goes Around Comes Around",
 "date": {
  "submission": "2003-06-23T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "WhitePony",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I wasn't originally going to do LSD, we were at Rottenest (a small island off the coast of Perth, Western Australia) for leavers week, after school had finished for the year. I was with a big group of my friends, was having a great time.",
  "It was the last night we were there and we wanted to get some E's. Unfortunately everyone had run out and we couldn't find anything. One guy had some meth but we took our chances and kept looking elsewhere. Nothing could be found. This whole time we knew that one of our friends had some tabs of LSD but we had decided not to trip cause of what we'd heard. Anyway after searching for ever I decided to take a tab, my best friend said he didn't want to which was cool, I was with a couple of my other friends who were experienced trippers.",
  "It seemed to take for ever to work. We went on walks all around the place, and then it finally started working. Everything suddenly became so funny, laughed at anything. My friend and I decided to go for a walk, down the jetty, on the way we passed a house that had a strobe light going, and it was also raining at the time. Anyone who's seen rain with a strobe light will know what I'm talking about but it just looked so awesome. After watching that for a bit, we kept on to the jetty. As I said it was raining, and there was puddles everywhere, all these puddles on the asphalt looked very purple and just amazing, one of the most beautiful things I had ever seen. It looked like the surface of some distant planet in the solar system, like purple dunes.",
  "We  walked to the end of the jetty and watched lights out on the water and also the lights of Perth. So far my trip was amazing, I was having such a good time.",
  "It was the walk back to our place when things started to go a little bad. I suddenly got blotches in my eyesight, and I realized it was because I was getting really hot, I took my jacket off and that helped a bit. Though I did start freaking out a bit, started to panic. Now ive thought about this a lot, and I think if what happened next didn't happen I would have had a great trip. We walked back to our house and noticed a couple of people standing around the front door. The lights inside were off and everyone was asleep. As we got closer we could see they were trying to see inside, looking to see if they could get in without waking anyone (presumably to steal what ever they could). I yelled out to them as we got closer and they turned around. They were obviously on speed or glue or petrol or something cause they were amped up big time. One guy was pretty big, and he was 'play' fighting with us, trying to intimidate us, they said they were looking for a cigarette. We said we didn't have any. Then one of the guys said if we 'start' on them, he'll pull his knife. This freaked me out big time and I started to get really scared. I'm not one for fighting, I hate knives and guns and the things that come along with them. We said we weren't going to start and luckily they left pretty quickly.",
  "From there things got bad. I got REALLY paranoid and started panicking even more. What was worse was that all my really good friends had deserted me for their girlfriends, which was disappointing to me because they had all said when I told them I was going to trip that they were going to look after me. I felt really alone, I felt I had no one, I kept trying to find someone to look after me but no one would, everyone seemed so fake.",
  "The guys I was with told me to smoke some pot to settle myself down but I didn't want to, I'd given up pot and didn't want to mix drugs. So I just had to calm myself down. We locked up the front door pretty good and all sat around the back, however I could not get rid of the feeling that those guys were going to come back.",
  "Finally I found some sort of relaxation, we went on a walk around the place in a big group which made me feel better. Then went back to our place and crashed. Trying to sleep was almost impossible, once I got into one position something about it would annoy me so I would change positions and the same thing would happen. So I just thought fuck it, I'm gonna ride this, so I watched some awesome 'dot' patterns on the roof and around me, it was great.",
  "Next thing I know I wake up, somewhat dumbfounded but that was to be expected. After that night though it took me a while to forgive my friends for not looking after me when they said they would.",
  "Will I LSD again? No. I wanted to try it, and I have. I know what its like. From what I've read on Erowid my trip was definitely not as intense as some others. I will always wonder what my trip would have been like had those 2 guys not threatened us and scared the shit outta me.",
  "Oh one thing I forgot, later that night when we were on the walk, we ran into the big guy who threatened us, his friend no where to be seen, after realising it was him, I told the rest of the guys and we started to walk back to him, there was security guards all around him though, they had been following him. We told them what him and his friend has done and they told us that they had been terrorizing the place all night. The big guy had assaulted a young girl. I'm not one to take pleasure in someone else's pain but this guy was beat up really bad. Someone else (probably a number of people) had gotten to him first and he was for lack of a better word, fucked. He was limping really bad, holding an arm and bleeding. We left him like that, with the security guards watching him closely.",
  "What goes around comes around."
 ],
 "erowid": {
  "id": "7649",
  "citation": " WhitePony. \"What Goes Around Comes Around: experience with LSD (ID 7649)\". Erowid.org. Jun 23, 2003. erowid.org/exp/7649",
  "substance": "LSD",
  "views": "5968"
 }
}
