{
 "id": 12207,
 "title": "Traded One Addiction for Another",
 "date": {
  "submission": "2009-02-03T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Jake",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "(daily)"
  }
 ],
 "report": [
  "Let me start off by saying I am a recovering opiate addict. Ironically I was introduced to this medicine in rehab as a replacement for narcotic painkillers. I knew it was a schedule 5 substance, but I thought to myself so is lomotil (and it was being perscribed by a doctor who treats addicts) so I figured what the hell?! At the time I was experiencing a fair amount of back pain and I was a week and a half off of suboxone (still experiencing mild withdrawls) so it sounded like something that could help with both. BOY WAS I RIGHT!!",
  "The doctor started me at a dose of 2 75mg pills in the afternoon. I was taking no other medications at the time. About an hour and a half after dosing I noticed that I was feeling very talkative and happy. It felt similar to neurontin, but better and stronger. I took at 3 pm and felt lingering effects the next morning! I couldn't believe how good it made me feel. It really isn't like anything else I've tried, and I've used a lot of substances. 'This is the ticket' I thought. I continued to take the medicine as perscribed throughout the remaining month until I completed the rehab program (as if I had a choice) noticing that the aforementioned effects diminished the longer I took it. But that was soon to change. As soon as I got out of rehab I began experimenting with higher doses (in between 150-900mg) feeling those wonderful effects as I did before. Of course taking more of my script than I was supposed to caused me to run out early. I really didn't think that much about it at the time until the next day when I started noticing I was feeling extremely sick. Oh shit! I thought to myself. I just traded one drug for another! The withdrawls are very uncomfortable! Almost as bad as opiate or benzo withdrawl. Upon withdrawing from lyrica my skin and eyes dry out, I can't sleep, I ache all over and I get very depressed.",
  "After feeling that way for a little over a week, I decided to go to another doc and have him perscribe me more lyrica. This time I got the 300mg capsules. 6 months worth. I went through that amount in 2 months! After I ran out of those I used neurontin to detox. It seemed to help quite a bit. I just thought I'd let everyone out there know this drug at least for me was very habit forming, and the withdrawls are extremely uncomfortable. I foresee this drug becoming more tightly controlled in the future due to how good it feels when I'm on it, and how shitty I feel when I'm not. All of this caused me to start back on the path of the opiate again and landed me back in rehab exactly a year later. Be careful with this one. I found it to be crazy fun, but the withdrawls are just crazy. Good luck on your adventures! ",
  "reported dose: 75-2200 mg"
 ],
 "erowid": {
  "id": "76576",
  "citation": " Jake. \"Traded One Addiction for Another: experience with Pregabalin (Lyrica) (ID 76576)\". Erowid.org. Feb 3, 2009. erowid.org/exp/76576",
  "substance": "Pregabalin (Lyrica)",
  "views": "21842"
 }
}
