{
 "id": 12204,
 "title": "Awaken My Mental Clarity",
 "date": {
  "submission": "2003-06-24T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "triplecrow",
  "gender": "Male",
  "weight": "125 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Ginkgo biloba",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "Ginseng",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>I have been taking ginkgo biloba on and off for the past five years and see a significant difference in my mental clarity, recollection of memories, long term and short term when I consistently take a dose of 150mg per day for at least a week.  These effects continue for the duration of repeated daily administration in this dose.  However because of the costly price of having a constant supply I often don't have a chance to take it for weeks or months at a time.  I have currently been taking it every day for the past three weeks and after the first week there was a marked heightened ability to recall distant childhood memories and past events that I had seemingly forgotten all about.",
  "There has also been an increase in my creative mental functions and lucidity of my dreams.  I do not experience these effects when taking a dose smaller than 150mg per day or when taking it less than a week (or three).  I think that anyone who would like to have a better memory, more consistent creative flow, or more lucid dreams with ability to recall their dreams upon awakening would see tangible results after daily doses for 1 - 3 weeks.   I find a dose of 150mg - 300mg is needed.  This is contrary to most of the dosage instructions on the containers of ginkgo obtained from health stores that suggest 50mg - 75mg per day.  Capsules are the way to go in my opinion for I get no results from tea, but perhaps better results would be obtained from fresh samples of a live plant, which can be obtained and cultivated at little cost.  I also take 500mg of siberian ginseng every day and believe that the combination of both these herbs in repeated daily doses is excellent, and I don't get the marked mental clarity benefits from taking just the ginseng alone.</p>"
 ],
 "erowid": {
  "id": "7654",
  "citation": " triplecrow. \"Awaken My Mental Clarity: experience with Ginkgo biloba & Ginseng (ID 7654)\". Erowid.org. Jun 24, 2003. erowid.org/exp/7654",
  "substance": "Ginkgo biloba & Ginseng",
  "views": "58236"
 }
}
