{
 "id": 12212,
 "title": "Sudden Journey",
 "date": {
  "submission": "2002-08-11T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vulpine",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "My girlfriend went out to do the laundry, and I decided that since I had some time to myself I would meditate a bit, possibly do a tarot reading, and then try out the second dose of Salvia which I purchased from a friend who had made a concentrated form.",
  "I packed my bowl, lit a candle and some incense and gazed into the flame until I felt centered.",
  "After a little more meditating, I picked up the pipe. As I'd read, you have to smoke a hit, hold it for at least 30 seconds, then immediately smoke again, repeating for about two minutes.",
  "I lit the pipe, and inhaled as deeply as I could; the smoke was very very harsh. I counted 30 seconds to myself (who knows how accurate this is :), then exhaled. I didn't feel much yet.",
  "Again, I lit the pipe, and inhaled. Immediately as I began inhaling, the effects started to hit me. I felt very disoriented, and the motion of my hands and the candle flame began to blur and swirl. My inner voices became very loud -- my normal inner monologue seemed more intense, and I almost felt as if I were speaking to someone else. The third hit came and went, and I set the pipe down -- the bowl was basically cashed.",
  "The effects were intense. I immediately lost all sense of identity -- I literally did not remember my own name. I let myself go, feeling a sense of a feminine presence near me -- I thought of my mother, and felt the nearness of the primal Mother Goddess. I saw three shapes, indistinct -- perhaps my own hands and the candle flame again. I closed my eyes, and the shapes became an endless line of people walking -- like a caravan moving through the desert.",
  "I felt a pull from a Goddess presence again, briefly, but my inner monologue interrupted again, and the trip began to fade. My mind felt much too noisy for true journeying. The effects gradually diminished, until I felt centered and back to my normal self again. Little more than half an hour later, I feel almost completely normal -- I still feel mellow and lethargic, but even that has almost dissipated.",
  "I want to try the drug again and see if I can go a little further in my journeying this time. I was quite startled by the intensity and sudden onset of the effects as I am mostly used to the gradual onset of mushrooms. I was so startled that I think I was too busy being astonished and saying to myself 'Wow, I'm really tripping' to be able enjoy the effects or let go. Next time, I will be prepared, and I think I will probably meditate longer first and not have distractions like the tarot nearby."
 ],
 "erowid": {
  "id": "7659",
  "citation": " Vulpine. \"Sudden Journey: experience with Salvia divinorum (ID 7659)\". Erowid.org. Aug 11, 2002. erowid.org/exp/7659",
  "substance": "Salvia divinorum",
  "views": "6268"
 }
}
