{
 "title": "My Negative Flow",
 "author": "Methadone Hater",
 "citation": " Methadone Hater. \"My Negative Flow: experience with Methadone (ID 12213)\". Erowid.org. Mar 22, 2006. erowid.org/exp/12213",
 "substance": "Methadone",
 "bodyweight": "100 lb",
 "report": "<p>Well one night I was chilling with my closest friends when we decieded to do methadone, they had all done it before, but it was a first for me so I decieded to swallow it opposed to snorting it like they did...</p><p>40 minutes passed and I got kinda weak and sank into the couch...</p><p>60 minutes passes and I noticed that if I even moved the slightest inch I felt naseous...at this point I was disappointed, ALL I felt was sick and weak, no euphoric feeling, no lightheadedness, nothing, just sick...</p><p>later we went for a drive to get something, I felt so sick I don't remember what the hell it even was, except that I sat in the back seat cuddled up to my friend thinking that maybe if I just stayed as still as possible I might not puke all over his car...</p><p>I don't know how, but we somehow made it back to his house where we curled up on the couch and assumed the same position (the less I move the better chance I have of barfing everywhere)...</p><p>hours passed and I still wasn't feeling any better, but I had to go home....the second I stood up to leave EVERYTHING in my stomach came up....I've never puked so much or so hard in my life (not to mention that whatever it was was bright green)...but I had to admit that after throwing up I felt a little better, at least enough to drive home...made it home and into bed thinking I would wake up in the morning and at least feel a little better....god was I wrong</p><p>I woke up and felt 100 times worse! to make a long story short I felt like a fucking crack addict! I would sweat to the point where my bed was soaked and feel like I was on fire then 10 minutes later be so cold that I was uncontrollably shivering.....this went on for the next 24 hours where I managed to throw up till there wasn't anything left in my stomach then drive heave for HOURS!!!!</p><p>at one point it was so bad that I really considered calling 911, never in my life (and I've done a lot of drugs) had I felt like this before..</p>",
 "year": "2002",
 "id": "12213",
 "gender": "Female",
 "timestamp": "2006-03-22T08:00:00.000Z",
 "views": "12299",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Methadone"
  }
 ]
}
