{
 "id": 12228,
 "title": "the Nightmare Circus",
 "date": {
  "submission": "2012-02-20T08:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Nathan C.",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "In late november my friend and I decided to buy 5 grams of mushrooms. They are called gold caps I believe. We split them in half and ate them at once. It was both of our first time and we didnt know how exactly it would be. We were excited to do them because it took forever for us to find them.",
  "We walked to the movie store and I returned a movie and I started feeling like I didnt belong in there and so did she. We left and started walking back to my apartments and to my suprise the ground was more vivid. I could see the smaller things more vividly more then the larger and it started waving up and down and side to side, what seemed to be a start of a good time it slowly went downhill. We got into my apartment gates and there was a long stretch of maybe 500 feet or so but it was like walking down a long hallway it looked a mile away. And for some reason I started feeling uncomfortable like everything I did wasnt right and I became slow and partially confused. I knew what was going on but I just felt like I wasnt all there. So we were talking and decided to go to the jacuzzi and sit in there. As were getting dressed we both noticed it took us like 15 minutes to put shorts on. (well in my case).",
  "Were finally ready and I start feeling sick and I start throwing up in the bushes out front.  Right there was where things started getting more confusing. Everything started bending and getting colorful. Truly it was amazing but the way I was feeling killed the whole 7 hours of hell. Were at the jacuzzi and I'm trying to feel better and make myself think better but thinking became a hard task and I couldnt get out of the grasp of fear and disorder. 20 minutes pass and both of us started feeling the same way. But we didnt know how long and far the effects were gunna go. I was thinking the best ways possible but nothing seemed to help. We both felt helpless and I tried analyzing everything because she had no clue what anything was. I felt the same but I tried making a reality out of something so unrealistic.",
  "We started making our ways to her house and I was trying to talk reality but like I said, reality was gone. Colors, waves, sound waves, anything that moved I could sense and anything I heard scared me. I had to get used to different settings. I didnt know if I wanted the lights on or off or the tv on or offboth were too overwhelming. So my friend tells her mom what happened and she flips out but shes a cool mom she didnt care that much, just to her suprise was the worst. She was sick so we tried to stay out of her hair. Everything was colorful and everything was like a circus with clowns everything looked like it was coming to get me and everything looked like it was coming towards me. The only thing that helped me overcome the living nightmare was the fact that everything passes and everything goes away. Seconds seemed like minutes and minutes seemed like hours and hours seemed like days.",
  "About 2 hours into it we went outside and it was raining and it looked like colorful crystals falling from the sky and they would reflect off the christmas lights. I was hungry but food tasted old and drinks tasted flat so my appetite was completly teased. The whole high lasted 7 hours and all I did was lay down for the most part of it. Colors spiralled around the room and faces bent and walls were wavy opening locks on a door was a challenge. I was hopeless, I felt like nothing, I felt weak but I felt determined to keep a positive state of mind. So we turned on americas funniest home videos and I remember watching one that the guy said this is what it sounds like when you rewind your cat and it just tripped me out cuz it sounded like rewinding a tape recorder but it was a cat. I guess overall it helped me get out of thinking I was in hell.",
  "After about 6 hours I started coming down and I felt better and started exploring everything. Everything was almost the same way it was but my cloudy thinking seemed to just dissapear time sped up and later became a memory. It took me about 7 months to try mushrooms again but I havent eaten as much at one time as I did then. On a personal level I prefer LSD over mushrooms because I didnt seem to have a cloudy mind on LSD. But the experience taught me to research things a little better before I try them.",
  "Mushrooms was the most intense high I've ever had and I never will have a high this intense again."
 ],
 "erowid": {
  "id": "76691",
  "citation": " Nathan C.. \"the Nightmare Circus: experience with Mushrooms ('Gold Caps') (ID 76691)\". Erowid.org. Feb 20, 2012. erowid.org/exp/76691",
  "substance": "Mushrooms ('Gold Caps')",
  "views": "3468"
 }
}
