{
 "id": 1222,
 "title": "Repeating, Detailed Dreams",
 "date": {
  "submission": "2001-07-30T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shaft",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 ml",
   "administration": "oral",
   "substance": "Valerian",
   "form": "extract"
  },
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "Ginkgo biloba",
   "form": "extract"
  }
 ],
 "report": [
  "I was at the mall last night in one of the herbal stores when I saw a bottle of valerian root extract.  I remembered reading some articles on Erowid about it being a mild sedative and how it might have some effect on dreams.  I am a very restless sleeper and have not had a good night's sleep in about two months and have not dreamt (that I remember) once in that time period.  I bought the extract and some ginko biloba (what I had originally come to buy) and went home. ",
  "I prepared a Celestial Seasonings blackberry tea and put 2 ml (1 gram dried valarian root) extract into the tea.  To my dismay, when I reached the bottom of the cup i realized I had not stirred the mix and all the extract was sitting at the bottom of the glass.  Bottoms up, it was nasty stuff!  Anyway, I studied for my ACT for about an hour then laid down to go to bed, and what was to be a weird night of dreams.  At around 11:30 PM my computer woke me up, someone was msging me in icq and my speakers were turned way up.  I got up and the 'journey' over to the computer was, strange.  The only light in the room was the glow from the monitor, and it seemed to blur out all objects around me and draw me towards it.  It was a little hard to focus on the words on the monitor, but that may have been due to the fact that I was really tired at this time. ",
  "I went back to bed and dreamt the same dream about ten times with different variations each time.  I was robbing people's houses that were on vacation.  We would steal all this stuff, including weird looking four-wheelers and other motor vehicles, go out and use the stuff, then try to bring it back when the people had returned from vacation without being noticed.  We would then get caught and everyone I was with would get beat up by the owner of the house.  As soon as I got away, or the man caught me, I would wake up, laugh, and fall back to sleep to have a very similar dream again!  The really strange thing was the detail of the dreams.  Every dream happened in the same house, all the same objects were in the same place, from picture frames on the wall to lamps and coasters on the end tables.  I suspect I had this dream about 10 times throughout the night and was finally awakened by my alarm, more refreshed and ready to take on the day than I have been in a long time, way longer than I can remember. ",
  "I plan on taking this again and maybe taking some melatonin (3-5 mg) and some B-6 with it as I have read these also affect your dreams.  I recommend anyone who has a hard time sleeping try this herb/extract... it really works (especially if you take twice the recommended dosage!)"
 ],
 "erowid": {
  "id": "136",
  "citation": " Shaft. \"Repeating, Detailed Dreams: experience with Valerian & Ginkgo biloba (ID 136)\". Erowid.org. Jul 30, 2001. erowid.org/exp/136",
  "substance": "Valerian & Ginkgo biloba",
  "views": "19066"
 }
}
