{
 "title": "The Beginner's Guide",
 "author": "Davion",
 "citation": " Davion. \"The Beginner's Guide: experience with Calea zacatechichi (ID 12224)\". Erowid.org. May 31, 2002. erowid.org/exp/12224",
 "substance": "Calea zacatechichi",
 "bodyweight": "160 lb",
 "report": "<p>The members of a different forum asked me to put together a beginner's guide to Calea Zacatechichi.  I thought I'd share it here too.  If you guys wanna post it, feel free. If not, that's fine too. :) </p><p>Disclaimer: I'm not a medical doctor. Consult your doctor, lawyer, mother, personal psychic, healer, and your local congressman/woman before ingesting this stuff. In fact, just don't ingest it at all.</p><p>But since you aren't going to take my advice....</p><p>WORDS OF CAUTION</p><p>Safety is always my first consideration when preparing herbs. It should be yours, too. So I'll break down the safety considerations for our friend, Mr. (or Mrs.) Calea Zacatechichi.</p><p>1.) Allergic Reactions</p><p>It's possible to have an allergic reaction to Calea. It's usually minor, but can be painful, and I wouldn't be suprised if it could be serious for some people. Symptoms include (but might not be limited to) lack of physical stamina, swelling in the extremeties with rash on the feet, between toes. Swelling in the hands, with redness on the fingers, mild nausea, drowsiness, very mild vertigo.</p><p>ALLERGY TEST: Test it first, and avoid the allergenics altogether. To test it, just keep 2 small leaves of Calea Z. under your tongue or in your cheek for about 15 minutes, ingesting the resulting juices. Expectorate the leaves, and wait for about 15 more minutes. If you feel ANY swelling or itching in your extremeties, discontinue use. FURTHERMORE, if you feel swelling, treat with topical diphenhydramine (benadryl.) DO NOT expose yourself to the sun while using topical dyphenhydramine. That in and of itself can make the allergic reaction 10 times WORSE, and can result in a doctor's visit. So just whole up indoors, wear a hat, whatever, but don't get a lot of sunshine if you are using topical diphenhydramine due to Calea allergy. MOST people aren't allergic to the stuff. If you are allergic to it, you can 'chew' the leaves for about a week, 'deal' with the mild reaction, and you will probably then have a resistence to the allergy. If you don't have a reaction with just a couple of leaves, you will PROBABLY be fine, so continue to the next section.</p><p>2.) NAUSEA</p><p>Cale Z. is simply the worst tasting edible substance known to man. If you make a tea of the stuff, be very near a place where you can vomit freely. I'm serious.</p><p>3.) LUNG CANCER</p><p>Your chances of getting lung cancer by smoking Calea Z are probably so small that they aren't worth mentioning, but what the heck. I don't recommend smoking ANYTHING, so I thought I'd put this little notice here that smoking ANYTHING can damage your lungs, since they aren't prepared to handle burning gases, tar, and the large (comparitively) and dense particles found in smoke.</p><p>EXPECTED RESULTS</p><p>Every person's body has a unique physiology, and a unique chemistry. Therefore, your results may vary. These results are typical, however.</p><p>MILD EUPHORIA</p><p>Especially when smoked in a large-enough quantity, Calea Z can produce a REALLY mild cannabis-like euphoria, but without the apathy. It's not the same thing, so don't just buy a ton of Calea Z. to smoke because 'budz' is illegal. You will probably not get the same effect just by drinking the tea, since the stuff tastes so terrible that the psychological effect of the bad taste offsets the euphoric feeling one might otherwise encounter.</p><p>MENTAL CLARITY</p><p>Strangely enough, I've found that using Calea in ANY form tends to clear the mind. It alters the perception of time so that it appears that time is passing more slowly, and it makes one feel more 'in control' of things.</p><p>VIVID DREAMS</p><p>This should be obvious, since this is a Lucid Dreaming Forum. Now you won't AUTOMATICALLY become lucid in your dreams, but your chances of lucidity are greatly increased. Furthermore, your dreams can seem so realistic (in some cases) that they are actually MORE enjoyable than a normal lucid dream where the level of clarity is not as high. The level of clarity, or continuity produced by Calea Z. is due to the fact that the 'Memory Continuity Facilitator' function is turned ON by Calea Z. and therefore MCV jumps (jumping from one time/place to another time/place suddenly in a dream) are not as likely.</p><p>SIDE EFFECTS</p><p>None noted, unless you have an allergy to the stuff. There are no reports (or suspicions by scientists) of ill effects resulting from the use, long term, or short term, of this herb.</p><p>PREPARATION & DOSAGE</p><p>I will list the three most common methods, then my new method.</p><p>1.) SMOKING</p><p>Smoke one or two cigarretes of the leaves/flowers. It's a little bitter, but not too bad. Do so right before you are going to sleep, but do NOT smoke it in bed.</p><p>2.) TEA</p><p>If you are brave, and want to try the tea, take about 3 grams of calea leaves and steep them in simmering (not heavily boiling) water for about 15 minutes. Add honey, sugar, or whatever else you can find to make the stuff taste better, but for the love of God, don't add citrus. TRUST ME. There are various herbs and berries you can add to this to make it taste better. One such berry is called 'magic berry' but unfortunately, I don't have it's latin name. I'll post more about that issue later.</p><p>3.) ALGAE CAPSULES</p><p>You can get algae capsules at your local herbalist, or maybe even wal-mart. Alternatively, you can empty some capsules of other herbs or supplements that you have found useless, and repack them with Calea Z. insted. Get about 1 gram, and fill two capsules. Ingest about 30 minutes before bedtime.</p><p>4.) RESIN RECIPE</p><p>Procure a bottle of 190 proof (95%) alcohol such as Everclear. Brand is completely unimportant, so get the cheapest crap you can find. Be REALLY careful, though. This stuff is as flammable as gasoline (petrol, for those of you in the UK.) Place 1 part Calea Z. Leaves in 2 Parts Alcohol in a sealed jar. Leave it for 3 days. Filter out the leaves with cheesecloth, and pour the resulting liquid into baking pan(s.) Allow the stuff to evaporate, and you will be left with a nice disgusting goo. Scrape that stuff into capsules and voila. Uh.. but be careful, and keep in mind that this will be about 5x as potent (maybe more, perhaps a lot more) than just the tea. So remember, the resin resulting from 1.5 grams MAX should be your starting dose. If you MUST, you can fill the algae cap the rest of the way with sugar or whatever else is lying around.</p><p>5.) EXTRACT RECIPE</p><p>Get the cheapest bottle of Vodka you can find. That suff is about 100 proof, which means it's 50/50 water/alcohol. Use 1 part leaves of calea Z. and 2 parts Vodka. Place in a jar, shake once daily, after one week, strain, pour into a baking pan, allow the alcohol to evaporate, bottle for use. It's less potent than resin, but more potent than tea. I haven't tried this because I don't see the point. It will still taste only slightly better than donkey feces.</p><p>Well, that's it. I hope you've found some useful information here. If I missed anything, or if there are any unanswered questions, let me know. I didn't mention anything about combining methods or dosage to results ratios, so if you're interested just ask. Furthermore,I've tried this in conjunction with several other herbs/minerals/vitamins including.. L-hydroxytryptophan (5-htp), vitamin b, kava kava, valerian, neem, echinacia (lol, yes, echinacia.) Let me know if you wanna know the results. I would have posted them all, but I don't want carpal tunnel syndrome.</p>",
 "year": "2001",
 "id": "12224",
 "gender": "Male",
 "timestamp": "2002-05-31T07:00:00.000Z",
 "views": "130238",
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "",
   "substance": "Calea zacatechichi",
   "form": "(plant material)"
  }
 ]
}
