{
 "id": 12226,
 "title": "Getting High Like Towlie",
 "date": {
  "submission": "2009-03-09T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "The Mayor",
  "gender": "Male",
  "weight": "280 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "age:24",
  "wt:280",
  "dosage:see story",
  "Well the long wait was over.  It had arrived, my jwh-018, and a long wait it was. I received a gram of off-white yellowish powder.  As I understand this is the appearance that you want, as opposed to a rust colored lump that others have been buying on the internet.",
  "A friend and I decided to try it out.  I could not find a proper vaporization (meth)",
  "pipe so first I improvised with a light bulb based vapor pipe.  I took a tiny amount",
  "of the powder and put it in the bulb.  I just stuck the tip of a knife in and got as",
  "little as I could.  i took 1-2 hits and blew out very little smoke as did my friend.",
  "It took aboubt 5 minutes to start affecting us noticably.  The effects were identical",
  "to smoking very good marijuana.  I was not extremely 'high' per se but the effects",
  "were unmistakable. ",
  "We followed up by smoking roughly the same amount on foil.  this worked much better",
  "but it was difficult to get it to that point where all the smoke releases at the",
  "same time in a big cloud.  We got pleasantly baked.  After we were already high and",
  "hit the foil again we could notice a rush right when it hit us. the buzz lasted for",
  "about 1.5 hrs.",
  "4 hours later I went to another friends house and were gonna get good and blasted this",
  "time we did a few foil boats and got extremely high.  It lasted about an hour for me",
  "but was extremely pleasant.  I'm sure i went over the 5mg dose recommendation and",
  "I did not have any sort of paranoia or 'bad place' type feelings.  All and all it",
  "went very well and the only thing I am going to do differently in the future is get",
  "a vaporization pipe rather than that nasty foil.",
  "Its not for everyone as the method to smoke it is a difficult learning process that",
  "is more for the harder drug user.",
  "In closing I think that milder forms like Spice are probably better if one",
  "plans on smoking it for a long time (probation).  But for the price per use jwh-018",
  "is unbeatable.  In the future I plan to use the proper pipe and I am going to try",
  "oral dosing dilluted in grain alcohol.",
  "Side effects: munchies, red eye, short term memory loss, telling stories no one",
  "wants to hear, cottonmouth, and telling stories with no point. Hope this helps.",
  "The Mayor"
 ],
 "erowid": {
  "id": "76681",
  "citation": " The Mayor. \"Getting High Like Towlie: experience with JWH-018 (ID 76681)\". Erowid.org. Mar 9, 2009. erowid.org/exp/76681",
  "substance": "JWH-018",
  "views": "24480"
 }
}
