{
 "title": "The Impossibilities of Fun",
 "author": "Adream",
 "citation": " Adream. \"The Impossibilities of Fun: experience with Calea zacatechichi & Promethazine (ID 12227)\". Erowid.org. Nov 24, 2003. erowid.org/exp/12227",
 "substance": "Calea zacatechichi & Promethazine",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   "10 mg",
   "oral",
   "Pharmaceuticals",
   "(pill / tablet)",
   "",
   "2 tsp",
   "oral",
   "Calea zacatechichi",
   "(tea)",
   "",
   "2 joints/cigs",
   "smoked",
   "Calea zacatechichi",
   "(ground / crushed)"
  ]
 ],
 "report": "<p>I feel I should mention that I have some experience with meditation techniques that will lead to (if patient) astral projection and other forms of controlled mind states. To be slightly more honest I've attempted these techniques with little discipline and insufficient patience. I have however been successful in lucid dreaming to a point, and that point is having the dream and making it lucid from within. i.e lucidity would usually follow a chase scenario i.e a helpless run from an attacker turns into a flight for freedom.</p><p>I bought a five-gram pack of dried Calea from a botanical company about 18 months ago. I tried consuming a mild cup of tea and a couple of Calea cigs on two occasions with no results.</p><p>One night ensuing a long hard and restless day, I decided to take action regarding an impinging insomnia problem that had resurfaced in my life. Insomnia had disturbed me from two of three working days already this week and I wasn't prepared to counsel myself during my waking hours in hope that it may regulate my sleeping pattern.</p><p>Nope, drugs tonight, counselling and diet tomorrow, after a good night's rest. I had chosen to spend this year working in this still unfamiliar town and decided to walk to the nearest hospital in hopes that I may be able to spend the rest of the year employed.</p><p>After about 2hrs of 'red tape', lectures and not so friendly advice I was on my way back to the residence with a tiny little Fenergan pill in an envelope.</p><p>At around 1:00am I arrived back at the campus residence very tired and eager to sleep. Immediately consumed the tiny little pill and proceeded to discuss the 'red tape' with my girlfriend in bed. 15-20min later I was convinced that I should have been 'knocked out' by now, that is according to my friend's reports of Fenergan.  At this stage I was very eager to get to sleep and remembered a report or FAQ on Calea mentioning that it was apparently relaxing and might work as a sleep aid.</p><p>********************************************************************</p><p>I went to the kitchen and prepared about 2tsp of Calea in  1 cup of hot water while I let it brew I borrowed a pack of rolley papers and rolled up a couple of Calea cigs (rolled may give the wrong impression, I made tube and then sucked that bitter shit up into them, getting very fine particles hitting the back of my throat, yuk)</p><p>At 1:30am, I went outside and began sipping tea between drags of the cigs.</p><p>The tea tasted like an unripe grapefruit and the cigs tasted similar to 'Urb' so I was chasing each sip with a drag, afterwards I could taste the epitome of bitter on my lips. I washed my mouth thoroughly and returned to bed.</p><p>My last memory is of lying next to my girlfriend on a single bed, eyes shut loosely, relaxing with each deep breath 1.2..345.I'm now awake looking at my girlfriend in a single bed by my side..thrashing around in the single bed trying to wake myself up, realising that if this is happening in the single bed I'M IN then I'm thrashing my girlfriend in our single bed by my side.</p><p>I struggled against what seemed to literally and physically hold me in sleep until I realised that using force with no-body is pointless (meaning?)</p><p>[this may seem confusing]</p><p>I had a bird's eye perspective of the bed, a first eye perspective (body, eyes closed) and both of them could feel but not touch the third eye perspective, which was like a spirit layer of myself (thrashing about) on top of my (real) body that was visible to the birds eye perspective. Anyway I could see that the only way out of this mind trap was to communicate telepathically to my girlfriend, who was in reality next to me. So I imagined telling her vocally to wake me up. At that point I woke up.</p><p>I was shocked even a little disturbed, but I decided it was all-okay and went back to sleep.</p><p>Until Morning my dreams were lucid and I was deeply consumed by allsorts of fascinating images feelings and experiences that could have easily been mistaken for reality, my only way of knowing was to do the impossible.</p><p>I awoke feeling refreshed and happy with my breakthrough, I discussed this with my girlfriend after being assured that she had not been attacked be me at all during her sleep or mine.</p>",
 "year": "2000",
 "id": "12227",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-11-24T08:00:00.000Z",
 "views": "15725"
}
