{
 "id": 12221,
 "title": "Fun and Relaxing",
 "date": {
  "submission": "2002-06-17T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "R007 Ph07oN",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 1:00",
   "amount": "5.0 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I just recently came across some hydrocodone from a friend, and having heard it was similar to codeine and heroin, figured i would try it. Tonight seemed like a good night to do it with no one else awake in the house, and i was already feeling good. i hadn't taken anything except for ibuprofen in the morning for a headache and a fat joint last night. i did not extract the hydrocodone, I just broke the pills in half and swallowed the acetamenaphen too (2g).",
  "1:00a.m. - took 3 vicodin 5/500 tablets, broken in half, and put on 'mailorder is fun' for some music.",
  "1:20 - feel a funny tingling feeling starting in my arms then spreading to the rest of my body.",
  "1:27 - feel a little numbness and dizziness, muscles twitching to deep bass in music.",
  "1:30 - more dizzy, getting floaty like codeine, eyes sensitive to light.",
  "1:34 - too clumsy to read a far side calender without knocking it over; tripping over shoes; and strongly hearing little sounds.",
  "1:40 - i'm getting very high for sure now. i love it.",
  "1:50 - sitting and closing my eyes i go into a trance-like state; time is getting very distorted with music flying and clocks really slow. wow.",
  "2:01 - some visual effects and waves; i want it all longer and stronger so I pop another 5 mg vicodin.",
  "2:06 - shit its making me real slow and kind of tired. i think i'm about to peak. hopefully the fourth pill keeps me high longer. shit that took 3 min. to write.",
  "2:15 - music over, i just peaked and am putting on the Beatles for the comedown. i think the fourth pill will prolong the high.",
  "2:26 - the last pill is keeping me high, but not as high.",
  "2:48 - i'm typing this and am pretty much sober.",
  "well i think the hydrocodone was definitely a good drug to have an experience with, as it was fun, relaxing, and nothing bad came of it. I recommend the experience to anyone who's interested, but i don't think a first dose should be over 30mg. and remember, it is addictive, so don't use it too often."
 ],
 "erowid": {
  "id": "7665",
  "citation": " R007 Ph07oN. \"Fun and Relaxing: experience with Hydrocodone (ID 7665)\". Erowid.org. Jun 17, 2002. erowid.org/exp/7665",
  "substance": "Hydrocodone",
  "views": "37897"
 }
}
