{
 "title": "How to Have A Nice Time with Bhang Lassi",
 "author": "VEC",
 "citation": " VEC. \"How to Have A Nice Time with Bhang Lassi: experience with Cannabis (ID 12239)\". Erowid.org. Nov 24, 2004. erowid.org/exp/12239",
 "substance": "Cannabis",
 "bodyweight": "170 lb",
 "report": "<p>A few months ago I read about an Indian drink containing Marijuana called Bhang Lassi.  I was talking to a friend from Bombay about it, and he got very excited and told me a recipe for it.</p><p>It was rather time consuming, but one night at around 8.00 I made it.  I used half an ounce of Marijuana and was on an empty stomach.  Before I drank it, I prepared my room for it.  I consider Marijuana to be a spiritual thing for me, so I made it very comfortable on the floor and I put the radio on so it was white noise at a low sound. </p><p>It didn't taste too good, but I downed the large drink in no time.  I had read and heard about very intense trips on Bhang Lassi, some horrible.  I have been smoking and baking with Marijuana for about 3 years, but I have found that when it comes to eating it, the results are almost always intense and I can't expect the same thing.</p><p>Usually when I eat Marijuana, I know that after 20-40 minutes I will feel an increasing drymouth then after 15 minutes I will feel an intense high coming on.  With the Bhang Lassi, it may have been 20 minutes, and it just hit me like a wave.</p><p>I was sitting up on my floor and just fell down.  The white noise seemed much louder, and I could hear different sounds.  It soon became a melody that I could slowly change when I concentrated on it.  I tried to say something, and my mouth opened up and felt like it kept opening until it was about to swallow my head.  I was a little nervous at first.</p><p>Things got even more intense after this.  I was stuck to my floor and couldn't open my eyes.  I felt totally paralyzed.  Suddenly, it hit me.  I hadn't been doing what I normally do when I trip out: I lost my discipline.  I usually try to focus on my mind and ride it out, this time I was too freaked out to.</p><p>All of a sudden, I saw what was going on - literally.  My body was like a rock, and I saw something floating like a balloon.  My instincts told me that this balloon was my mind attached to my body.  I discarded my body and cut the string.</p><p>Keep in mind this is all going on inside my mind, but I FELT as if I saw it.  In fact until the trip was over I knew I was seeing it.</p><p>WOOSH.  I felt my body sink down and my mind shoot forward.  I was flying around everywhere - and I mean everywhere.  I was thinking about how my mind is faster than the speed of light because I can think of being somewhere else and I am instantly there.  I was flying around the cosmos and it was awesome!</p><p>Whenever I thought of my body, I was instantly shot back and felt very uncomfortable, like I was being smothered.</p><p>Soon these feelings drifted off and I passed out.  The next morning I saw some writings in my notebook that were almost totally illegible.</p><p>I learned a lot from that trip and I hope everyone experiments with what I am about to say: RIDE THE WAVE WHEN YOU ARE HIGH.  If you are scared it is because you are resisting.  Forget about worries.  A huge oak will fall from winds, but a reed won't because it bends with it.  Do this, and every high will be an interesting and pleasurable trip!</p>",
 "year": "2001",
 "id": "12239",
 "gender": "Male",
 "timestamp": "2004-11-24T08:00:00.000Z",
 "views": "10136",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 oz",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "(liquid)"
  }
 ]
}
