{
 "id": 12231,
 "title": "Black-Out Disaster",
 "date": {
  "submission": "2009-02-10T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fauzzie Fozzington",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid"
  },
  {
   "time": "1:30",
   "amount": "1.0 mg",
   "administration": "sublingual",
   "substance": "Pharms - Lorazepam",
   "form": "pill / tablet"
  },
  {
   "time": "0:00",
   "amount": "5.75 mg",
   "administration": "sublingual",
   "substance": "Pharms - Lorazepam",
   "form": "pill / tablet"
  },
  {
   "time": "0:00",
   "amount": "bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "I had recently quit using all substances, excluding alcohol and smokeless tobacco. I was sober for about a month and feeling great. Long story short I decided to drink one night with a couple of close friends and my girlfriend at the time. We started off slow, but slowly picked up. We were taking shots left and right, toasting to everything. Soon I was mixing half cups of vodka with half cups of beer and before long I was extremely intoxicated. My tolerance to drugs and alcohol were extremely low as I hadn't been drinking much at all, even before I stopped using illegal substances.",
  "Basically what happened is I got drunk and remember being really upset and fearing a panic attack. I left the room we were drinking in for my room where I consumed 1 mg of lorazepam, about 1-2 hours after we started drinking, for which I had a prescription for anxiety. After letting the pills dissolve in my mouth I remember an instant loss of inhibition and a general feeling of 'not giving a shit.' Sometime after consuming the first milligram I took the rest of the bottle for reasons I can't really rationalize.",
  "Immediately after taking the rest of the pills, 13.5 total, .5 mg, I completely blacked out. I remember a few other things after this point where I was snapped back into consciousness. The first is when a couple of police officers showed up at my room with paramedics. I don't remember what was said between myself and them, but I remember leaving my building and getting in an ambulance. My roommate who was there when the cops and paramedics were there told me that when I was talking to the police officers and paramedics that I poured out 'the biggest line of snuff tobacco [he] had ever seen.' I apparently made a loud outburst at one officer when he inquired about what I was doing, yelling 'WHAT, this is legal!' I tried doing a line of snuff as big as he claimed the day after and couldn't breathe for a couple of seconds after I insufflated the tobacco. I think if I wasn't that royally fucked up it wouldn't have been possible. I like to think maybe the added stimulation from the snuff could have kept me going enough so that I wouldn't die, but this is just skepticism.",
  "I think I may have thrown up in the ambulance, but I am not sure. After that everything faded away into darkness. I woke up once more in the hospital where they were attaching all kinds of wires to me and made me a whole bottle of liquidated charcoal. After this, I slept a long time. I woke up the next day and exited the hospital with no real recollection of what actually happened, but I was told some pretty awful things that I had done when I was under the influence. The first thing was that I assaulted my girlfriend. This is hard for me to deal with because I have no remembrance of the event and I am not a violent person at all. I think the combination of the alcohol and lorazepam did this to me. I strongly urge anyone who is using this prescription drug to not drink while using it. I also learned from friends who were around me while I was intoxicated that I wasn't making any sense with anything I was saying, but that I was really angry and I did not seem to be acting like myself. I didn't know what had happened that night, but was informed the next day upon returning to my building and confronting my girlfriend, who was incredibly scared of me. I regret this experience more than any other drug combination, or drug experience - period.",
  "That next day with the mounting stress of criminal charges, which were pressed, I smoked a bowl of some dank marijuana with a good friend of mine and I remember tripping out hard. I assumed the lorazepam was still in my system. My bed was rolling like waves in the ocean and my walls were collapsing around me. I felt like I was going crazy because I remember hearing whole songs in my head. Intricate pieces that I know I have never heard before. It went from classical, to rock; to folk...It was very strange. Shortly after that I passed out and woke up to more police officers at my door, this time with a summons.",
  "The moral of my story is simple: don't take lorazepam with alcohol, not even a small dose...It is very dangerous and your personal relationships could and probably will suffer."
 ],
 "erowid": {
  "id": "76730",
  "citation": " Fauzzie Fozzington. \"Black-Out Disaster: experience with Alcohol & Lorazepam (ID 76730)\". Erowid.org. Feb 10, 2009. erowid.org/exp/76730",
  "substance": "Alcohol & Lorazepam",
  "views": "25924"
 }
}
