{
 "id": 12248,
 "title": "Mind Over Matter",
 "date": {
  "submission": "2009-02-12T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "That Guy",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I had used MDMA 10-20 times before, and had realized that the effects of the drug were beginning to be milder each time.  After this i stopped taking the drug for the rest of my time in high school.  I also read an entry online that stated that MDMA use is no different if your second time doing it was a week or 10 years after your first use.  After reading this I took a break from taking it until a couple of friends were going to Atlanta Ga for New Years Eve.  I was looking forward to taking 'molly' or MDMA powder at the concert for NYE.  It had been more than six months since my last adventure with MDMA, and I was looking forward to seeing if the effects would be the same if not better than my first time use.",
  "I took .2 grams of 'molly' that day and not as much as 5 minutes later was feeling the euphoric feeleings.  After this I did not look back.  I had no thoughts of the journal entry I had read online months before, but instead just thought about what a good time I was having at this concert.  My 'come down,' as many would call it, was not harsh by any means. I also realized that I had peaked for the entire concert.",
  "This to me was ensuring evidence that my mind is the main factor of my 'trip.'  My conclusion to this story is that MDMA has no 'loosing the magic' to it, but instead I myself lose the magic.  This is my opinion."
 ],
 "erowid": {
  "id": "76809",
  "citation": " That Guy. \"Mind Over Matter: experience with MDMA (Ecstasy) (ID 76809)\". Erowid.org. Feb 12, 2009. erowid.org/exp/76809",
  "substance": "MDMA (Ecstasy)",
  "views": "5818"
 }
}
