{
 "id": 12256,
 "title": "Two Weeks in Valley Rehab",
 "date": {
  "submission": "2003-07-21T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Keith",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "24",
    "unit": "tablets"
   },
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "It was going to be a fun night. A Roll or two and be on our way to Club Groove. Well the rolls didn't work out. We were stuck. SO I decided to take my friends to the local wal-mart hook us up with a bottle of 100 Dramamine tablets. Well we had no idea how many to take so we I ate 21 Brad ate 21 Chris ate 23. Chris always thought he was a bad ass. Well he won this time. It was all crazy for the first hour. Fun not too bad than Brad got sick and started throwing up and falling every where in the bathroom making a lot of noise. His mom got up and saw him throwing up and falling and came down stairs to ask us what he took. We said nothing I think that's what we said. She said she was taking him to the ER and We need to get a ride home it was 3:00 A.M. And we had to get home. So I get in my car and proceed to drive.",
  "It wasn't too hard more like being drunk as hell. My house was like 1 minute away. It took 2 hours to get home when I get home I try to open the locked door with my key but couldn't get the key in the keyhole. SO I knock o the door at like 6:00AM beating on the door. Mom comes and ask why didn't you use your key. I told her I don't have a key to the deadbolt she than tells me we don't have a deadbolt and to sit on the couch while she gets my dad. My dad comes in there and ask 'son what have you taken' I say nothing. At that time Chris come busting in the doorway. Talking about 5 kids swimming in the pool in the backyard. They tell him to sit down while they call his parents. My dad than get the idea to give me a drug test. So we go to the doctor. The doctor tells me to urinate in the cup I told him I couldn't cause of all the people standing around he says their are no people I call him a 'f*ckin liar' and was getting real agitated. Than I find out my friend Brad Was going to get his stomach pumped but he told them he took L.S.D. and they decided not too. All in all the only thing I got from that whole situation was 2 weeks in Valley rehab center.",
  "Its pretty embarrassing when they ask what are you in here for I ate a bunch or Dramamine."
 ],
 "erowid": {
  "id": "7684",
  "citation": " Keith. \"Two Weeks in Valley Rehab: experience with Dramamine (ID 7684)\". Erowid.org. Jul 21, 2003. erowid.org/exp/7684",
  "substance": "Dramamine",
  "views": "14693"
 }
}
