{
 "id": 12257,
 "title": "Bad Bad Trip",
 "date": {
  "submission": "2012-01-27T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "cherrie_g",
  "gender": "Female",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Sertraline",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Clozapine ",
   "form": "(daily)"
  },
  {
   "time": "0",
   "amount": "300 ml",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis - Hash",
   "form": ""
  }
 ],
 "report": [
  "So I was in Amsterdam and decided to make the most of it. I had smoked twice the night before and I hadnt slept at all, I drank several shots of vodka with red bull. I also have OCD so I  was on zoloft and clozapine. In my country I have been drinking vodka while on these medicines for the past 4 years and I felt fucking great. It was like I was living in 1 minute what others were living in 2 years.",
  "But back to my experience. I arrived in Amsterdam pretty fucked up already, when my friends met me and and gave me one joint of hash. They told me it was a present for me. Then they went into the hotel before me. I smoked it by myself and didnt dream of what would happen. Then I climbed the stairs to get to room 418. Then the horrible feelings started. My heart was racing and I felt a terrible weakness in my body. I think I even lost consciousness for a few seconds, but I pushed myself to find the room. The hallway seemed endless and I ran up and down on it trying to find the room, but the numbers were going down in my head instead of going up. When I finally found fucking 418 I crashed into the room, yelling at my friends to call the ambulance. They started laughing and told me the ambulance was 300 euros to get in Amsterdam and told me to go to sleep :O then I really panicked. I knew that I shouldnt have smoked so much  3 times in the last 24 hours and the last joint of hash I had smoked by myself. Plus, the antipsychotics alone are quite dangerous, they can cause cardiac and respiratory arrest, not to mention mixing them with vodka, red bull and a lot of weed.",
  "I realized my friends were not going to get the ambulance, as they thought I was just having a bad trip so I tried to keep myself ok. Although my eyes were rolling and I could hardly stand up, I went to the bathroom to put my head under cold water. Then I started to lose feeling of my face. I started to slap myself, to feel it again and I screamed at my friends to slap me too. They laughed and didnt want to at the beginning, but then they realized it was serious and one of them slapped me several times. It was quite a tragedy-comedy as I was yelling: slap me, M, harder, I cant feel it! The neighbours were already banging on the walls as we were making quite a hub-bub. Then for like 15 minutes I didnt understand anything they were talking about, I kept falling on the bed but I soon got up, as I was afraid I would lose consciousness. M tried to get me outside, but I fell in the hallway, not having the power to move. I knew something was very wrong and I was afraid I was going to die. I couldnt feel my feet either so I started slapping them. Finally, after 2 hours I started to feel better. What was the scariest for me is that they kept telling me it was just a bad trip and that I should go to sleep. But that wasnt sleep that was pulling me in bed, so I tried to keep myself awake as much as I could.",
  "After 2 days I left Amsterdam I was still pretty shaken but I was ok. I continued with the Zoloft and Clozapine and Red Bull or espresso that I had been drinking for the past 4 months daily because of my job. Then after 2 weeks, although I had swore I wasnt gonna smoke again I bumped into some people and I smoked. I had another horrible panic attack, but this time it was apparently mostly psychological. Now Im back in my country and am not feeling well at all. I have these weird feelings that I can't breathe, everyone says its in my head but I think because of the big amount of weed that I took my body doesnt synthesize oxygen properly. I wake up at night and have trouble breathing. I am in a constant state of panic and have pressure on my head and eyes. And I even had flashbacks of what happened, with paranoia, trouble breathing and calling another friend of mine, like I did in Amsterdam. I really want to get a CT of the head, because from what I read on the internet I might have had a transient ischemic attack, which is a minor stroke and might announce a stroke in the future.",
  "Everyone thinks its all in my head. I even changed my pills I am taking fluvoxamine now instead of Zoloft because I was too agitated and I'm not taking clozapine anymore because I'm afraid I might die in my sleep. Now I'm not drinking alcohol anymore, no more coffee and even Coca-Cola and chocolate make my heart speed. I even have to stay away from tea. All doctors say I'm fine now but I still wanna check if my brain is ok.  Keep it safe guys I know I'm gonna try to stick to my treatment only, which was making me happy enough, but I just had to get as high as I could and now it really fucked me up."
 ],
 "erowid": {
  "id": "76852",
  "citation": " cherrie_g. \"Bad Bad Trip: experience with Sertraline, Clozapine, Vodka, Caffeine & Hash (ID 76852)\". Erowid.org. Jan 27, 2012. erowid.org/exp/76852",
  "substance": "Sertraline, Clozapine, Vodka, Caffeine & Hash",
  "views": "5640"
 }
}
