{
 "id": 12253,
 "title": "A Conscientious Companion",
 "date": {
  "submission": "2010-07-10T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RestlessNomad",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "450 mg",
   "administration": "oral",
   "substance": "Aniracetam",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Writing this at least a month after the fact, so consider the times just loose approximates.",
  "00:00 (07:00am) Took approx 450mg of aniracetam in water. It tasted pretty foul, but had an awesome aftertaste that didn't develop for about five minutes and lasted five times that long. It was sweet, but not overly so, and had a kind of indefinable lingering wetness to it. I was in good spirits, and well rested. The enormous work day ahead of me was my motivation for taking the racetam. I didn't expect too much from the drug as I've previously dabbled with Piracetam, which had negligible effects for me.",
  "01:00 - 02:00 Pretty engrossed in work and failed to recognise a definable moment of initial activity, but by this stage I was definitely feeling a narrowing of the focus. My normally chaotic field of mental activity was remarkably cleared until my concerns were with but one activity at a time. I felt less fatigued by mental stresses than I ordinarily would, and my overall energy level was slightly better. I noticed a definite dip in my creative ability and verbal communication was somewhat impaired. It was almost like an ironing out of my brainwaves allowing for continuous energy at a given level but at the expense of the occasional creative peak. It also gave me a slight mood lift that was similarly modulated. Definite anxiolytic effects noted.",
  "02:00-04:00 I've always had an admiration for people who can happily focus on one boring job with a seemingly endless sense of contented patience. Aniracetam gave me what I always imagined they felt: a sense of satisfied pride in their own conscientiousness. I wasn't working fast, and I uncovered no clever shortcuts, but I worked unfalteringly, and when I encountered a problem that I'd normally skirt around and leave to be fixed another day, I'd fix it properly, no patch jobs, no 'That'll do until I get my priority stuff done', I just got it done. I did find I made more small mistakes, but they were more than balanced out by the vast pile of work I got through.",
  "The peak effects lasted around 3.5-4h and began declining. Still having work to do, I dosed again, expecting that a repeat dose would have a deadened effect, but it worked just as well as the first dose. It did give me a bit of insomnia and, to my surprise, I worked late into the night.",
  "Summary: Good substance for non spontaneous work with good anti-anxiety effects. Not So good for anything requiring higher states of creativity or public speaking. At least ten times as strong as any effects I've gotten from piracetam. ",
  "NB: I did have a lot of work to get through that day, so perhaps my mindset pushed the effects of the drug in that direction."
 ],
 "erowid": {
  "id": "76824",
  "citation": " RestlessNomad. \"A Conscientious Companion: experience with Aniracetam (ID 76824)\". Erowid.org. Jul 10, 2010. erowid.org/exp/76824",
  "substance": "Aniracetam",
  "views": "11955"
 }
}
