{
 "id": 1226,
 "title": "Panic Attacks/Heart Racing",
 "date": {
  "submission": "2003-12-02T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "westcoastin",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I would like to tell some of you who have had experiences where your heart feels like it is going explode, etc. Nervous, anxiety... that you are NOT alone. I am just about 16 years old and live in Alberta, Canada. We get some high POTENT buds here, a lot of it comes from British Columbia Canada, some of the best weed in the world. I have been smoking buds for about 2 years, last year like everyday and I have had AWESOME experiences until recently this September 2001. Ever since the start of this new school year, whenever I smoke some buds, like 1-3 hits, my heart races so fast and I have to walk around, I can't stand still, I'll shake, twitch, etc...",
  "Recently in November, I had taken 1 blade hoot. ie: Heat knives up on the burner on the stove and pick up a little chunk of MJ and take a hooter (like a pen hooter) and pick the bud up with 1 knife, put the other knife over top of that knife and hoot away. This gets you intensely ripped. Nothing that I couldn't handle, I have taken like 8 or 9 blades before in 1 session and been fine, and it is the same buds I always pick, Perhaps a different strain. Anyway, I have never tripped so hard, I thought I was going to die!! My heart was racing so fast, and I never had experiences like this months ago, or anything. I always have had Good Highs. This has not just happen when hitting blades, but even smoking pressure hoots, or even out of a pop can (which the most hurt way of smoking) but anyway you get the point. When I smoke weed now, The euphoria has gone away and now it is mainly all negative effects!! I had Monoclueosis in October and I still don't feel fully over it, still tired etc. I had a mild case though. It is now end of March 2002. Recently this past week I have smoked buds and been ok, except for one day when I had a little panic attack.",
  "I would like to know why this is happening to certain people. I used to smoke buds a lot and be fine, never have had bad trips off smoking weed until this recent September 2001 and so on. I do not think the weed I am smoking is laced, I have picked off the same dealers I have had for like 2 years. I smoke it with my friends and they are fine. I try and tell my friends this, but they just laugh in my face and tell me to stop tripping out. This isn't funny anymore, if I have to quit smoking buds I will. I don't want to, because I used to get awesome highs and feel great. No Negative effects whatsoever. I also am a runner, and smoking weed for a year and a half off and on quite a bit, well a lot last year has not affected my running at all too much. I got 1st place for some things. Sometimes when I smoke weed, I get a tightness in the chest too, but that usually goes away after about 20 minutes. I don't really have any chest pain though."
 ],
 "erowid": {
  "id": "13604",
  "citation": " westcoastin. \"Panic Attacks/Heart Racing: experience with Cannabis (ID 13604)\". Erowid.org. Dec 2, 2003. erowid.org/exp/13604",
  "substance": "Cannabis",
  "views": "14993"
 }
}
