{
 "title": "Yellow Submarine in the Sea of Death",
 "author": "AgentAcid",
 "citation": " AgentAcid. \"Yellow Submarine in the Sea of Death: experience with Mushrooms - P. Cubensis & Cannabis (ID 12264)\". Erowid.org. Apr 23, 2003. erowid.org/exp/12264",
 "substance": "Mushrooms - P. Cubensis & Cannabis",
 "bodyweight": "135 lb",
 "header": [
  "DOSE:",
  "2.5 g",
  "oral",
  "Mushrooms - P. cubensis",
  "(dried)",
  "",
  " repeated",
  "smoked",
  "Cannabis",
  "(plant material)"
 ],
 "report": "<p>Upon getting off of work one day, I went to the gas station to visit my girlfriend as I usually do when she is working.  It was approx 10 P.M. when I arrived.  She was getting off at Midnight. As I was about to leave her store, a woman approx 21 came over to me. 'I have a kind of weird question for ya,' she began, 'Do you know  anyone who would like some killer mushrooms?'  I immediately became excited, as my girlfriend and I had been craving a psychedic trip  for months after the availability of LSD became absolutely zero in my town.  We had eaten mushrooms a few times prior to the date of  this trip, but even at the amount of 5 grams each, each event had  little effect on us, with only weak and short lasting effects.  So, of course I told her I would personally like some, as well as my friend 'J' and my girlfriend 'B'. She gave me her number, I went and got cash, then met her at a local bar.  We purchased a quarter ounce due to the price she was charging. ($30/Per Eighth)  We were  dissapointed that this was all we could afford, but she assured us that a quarter 3 ways would be more than enough.   </p><p>'J' and I then went and picked up my strobe light, Party ball and  the crazy Beatles movie, 'The Yellow Submarine.'  This video had been one that I had always wanted to view while on psychedelics. We arrived back at the gas station to pick up 'B', and some guy in the parking lot needing beer asked me if I would like some Kind Bud. I  was near broke due to the mushrooms, but he sold me a giant bud very skunky for 5 dollars.  We then went home to split up the bag of shrooms, and then it was time to consume.    After we each ate our dose, we put on 'TOOL-LATERALUS', and bullshitted that pass the time.  In about 15 minutes, I could already feel the effects coming on, I knew at that point that these were going to be very good.  We then loaded a bowl, took about 3 hits each, and almost instantly, we were all completely tripping. I had eaten tons of mushrooms before, and never experienced intensity such as this.  LSD had produced effects of this magnitude, but I was unaware that mushrooms could do so much. </p><p>I turned on the party ball, strobe, and popped in the Yellow Submarine.  Then the trip truly began.    All of us completely lost the ability to communicate.  Sentences  became jumbled fragments of nonsense.  My apartment was a box in the sky and the party ball with the strobe light was blasting colors  throughout my whole being, I could see all the layers in the air,  rainbow sheets in perfect sync cycling all around me.  Combined with the Yellow Submarine movie, I could feel the effect of everything around me reacting with my body.  This was a complete euphoria. I remember taking a glow stick and cutting it in half with a knife and pouring it all over myself, this gave me a complete feeling of  light inside of me, and every pore of my skin seemed enveloped by  clouds.  Overall, the visual and mental aspect of this trip is  completely beyond description in words.    I was too utterly fucked up to even attempt communication with my friend or girlfriend, as were they. </p><p>We had tried talking, but no one could make even the slightest comprehensible statement, and we had basically given up trying to speak to one another. During this whole trip, we periodically smoked marijuana, and this highly intensified everything.  By about the middle of the Yellow Submarine, my girlfriend got up and turned it off.  The strobe, party ball, and that movie, were so intense, that her brain just could not handle it any longer.  Little did I know,  that at this point, while I was in a completely euphoric state, J & B were going through a nightmare in each of their own minds. At some point we had turned on NIN The Fragile, and I think this is what completely agitated their bad trips.  Suddenly my girlfriend was putting on her shoes.  I tried to ask where she was going, however I could hardly make anything sensible come out of my mouth. She looked right through me and opened our apartment door to the main hallway leading outside, and left.  It was about 3 in the morning at this point, I was shoeless and it was snowing, but I ran out after her. </p><p>The people in the very basement, were as usual, awake, as they are constantly strung out on meth.  Luckily I saw her going down the stairs, and caught up with her.  She went in and went right to the phone.  I still couldn't talk and the neighbors were laughing at us because we were so wasted. She picked up the phone and I saw her pushing 9, then 1, and I slammed down the receiver,  asking her what is wrong.  She asked me if I was sick too, and I said no.  I tried telling her she would be okay, as I had been with people who went on bad trips, as well as myself, and knew that the hospital couldn't help you stop tripping, and that if she called,  something very horrible was going to happen. I somehow managed to  convince her that I would not let anything bad happen to her, and that she wasn't poisoned, as I took the same thing and I am fine. I told her just to wait it out.  And somehow, I managed to get through the block that was preventing her from thinking about the consequences of calling the police. </p><p>I managed to get her upstairs and into bed, when I realized that J was gone.  He was outside, in the snow.  I managed to get him back inside.  At this point I figured one of the neighbors would for sure call the police, as we were running through the hallway, and I am yelling that 'ITS JUST THE FUCKING MUSHROOMS FUCKING WITH YOUR HEADS!!! IT WILL GO AWAY!' So for the next two hours, I went back and forth between my bedroom and living room comforting J & B.  All of a sudden, the loudest fucking siren I have ever heard starts coming close.  This is when I got freaked out.  I was completely wasted still, and the siren kept going on and on, as if it was parked right in front of my apartment. I looked out the window, and saw cop cars and an ambulance driving the wrong way down a one way road, and complete chaos outside. (This is the only time that I had a visual hallucination that I actually believed was happening), as I could clearly see the cops getting out, rushing to the front door of the building, and paramedics with a stretcher coming right behind them. </p><p>I then had about 1000 thoughts blast through my brain at once-'lock the door, no don't, they think its a heroin overdose, they are gonna break down the door, my girlfriend is dying, i am going to jail, etc.'  J is rambling curled up in a ball about how he just killed someone and left them on the front lawn.  I then looked out the window and there was nothing, the siren suddenly stopped, and all was OK.  After they both came down a lot more, we sat up and talked about everything. Apparently J thought that me and B were gone, he was the only person alive on the planet, as when he went outside, he could not find us, and the only other person he saw was the one he had just killed and left on the front lawn.  Over and over he had asked me if B was Ok, and if we had killed someone.  It took a good 2 hours to convince him that we just sat upstairs in my apartment and watched the Yellow Submarine. </p><p>B had thought I was dead, and that she was trapped in a time loop, stuck in the apartment forever, and the person talking to her while she tried to call 911 was not me, but some evil being trying to let all 3 of us die, and that's why I didn't want her to use the phone.   I am just glad that I was able to maintain, cause if all of us would have went to the place the two of them went, who knows what kind of problems could have risen. I still don't know what caused the bad trips for them, as I was having a great time, but we are all definitely very close to one another now, and I'm glad I could take care of those guys.</p>",
 "year": "2002",
 "id": "12264",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2003-04-23T07:00:00.000Z",
 "views": "9310",
 "dose": {}
}
