{
 "id": 12265,
 "title": "Free From This Prison",
 "date": {
  "submission": "2012-02-24T08:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Myocardial",
  "gender": "Female",
  "weight": 18
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(daily)"
  }
 ],
 "report": [
  "To cut a long story short, last year I lost my job.  For me, this was quite a harrowing event as I had worked since leaving school, had a flat, bills to pay etc.  Within the first month, I had become agoraphobic, extremely anxious, had a specific phobia and became depressed.  I had always been quite a quiet, anxious person already, but I felt now as if I had lost my whole 'self'.  I really did hate my life, and although I said it, I don't think people believed me and that I was just being my old silly self.  Little did they know that I meant every word and that every day I hoped I would not wake up again.",
  "I have never been skeptical about medications and so was very open minded about trying anything along with cognitive behavioral therapy.  I was prescribed Paroxetine 10mg and referred to a psychologist. ",
  "At first, the only side-effects I had were occasional headaches and an overwhelming desire to sleep more.  In some ways, this was a bad thing, as it meant I spent a lot of time procrastinating.  After a few weeks, I began to feel better.  I remember the biggest thing for me was getting up one day and walking into town (something which I was so scared to do beforehand, and I only lived 15 minutes from town).  Gradually, I started to make this a more frequent occurrence and also would manage really scary things like getting on a bus or train (laughable, I know, but for me these things had to be avoided).  As time went on, I felt a bit more confident in myself and wanted to focus on what I could achieve in life. ",
  "On the other hand, one thing that is slightly disappointing is that I no longer have the sexual desire I once had.  My partner has brought this issue up and I certainly notice a huge difference in that I am not that bothered anymore if I have sex or not!  Another small disappointment is that I have some slight 'zap' moments in my brain, whereby if I move my head slightly I get a wee zappy feeling....it is really hard to describe unless you understand!!",
  "Obviously, having CBT has helped immensely, and I do take that into account.  But I know that Paroxetine has been of great benefit, even on such a low dose.",
  "Never before have I felt so positive about the future.  Yes, I do have bad days, which I knew to expect, but all in all, I can say that using Paroxetine has been nothing but a positive experience. I do worry that I may become reliant upon it, but anything is better than feeling as though I was better off dead."
 ],
 "erowid": {
  "id": "76889",
  "citation": " Myocardial. \"Free From This Prison: experience with Paroxetine (Seroxat) (ID 76889)\". Erowid.org. Feb 24, 2012. erowid.org/exp/76889",
  "substance": "Paroxetine (Seroxat)",
  "views": "2717"
 }
}
