{
 "id": 12272,
 "title": "A Strange Combination",
 "date": {
  "submission": "2012-06-21T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "KingBB",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Olanzapine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "325 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Saturday night and everyone seems to be doing something other than you. Friday night had been a fun filled night of drinking, followed by more drinking the next day. Planning to retire home to bed after feeling substantially ill and had very little sleep, my girlfriend (I will refer to as C) and I were invited to spend the night a friends house(I will call A). At first I was quite wary about the idea, due to feeling ill, but decided to go anyway.",
  "On arriving at As house, there was a sufficient amount of alcohol but nothing else. Gradually a few more people arrived, two of which had smoked the last of their weed. When A wanted to go and purchase some more alcohol, I mentioned that if she had some money I could get hold of some acid, but as I was about to call him my phone died. A had recently done Diphenhydramine in the form of Nytol pills (50mg per pill). She raided her bedroom and medicine cabinets and managed to find a total of 19 pills (950mg). A and I were both going to have 9 and a half each but then C said she wanted to try it so the doses worked out as follows;",
  "Me  6 and a half pills, 325mg",
  "C  6 pills, 300mg",
  "A  6 and a half pills, 325mg",
  "Ingestion took place at around 20 to 10 in the evening. The atmosphere was extremely calm. We were around good company. Despite my feeling extremely run down and ill, I was quite optimistic about consuming the Diphenhydramine, despite reading many a bad experience online. One thing that did worry me slightly was the fact of combining it with my Olanzapine prescription pills for bi-polar disorder. I proceeded to look it up online but, surprisingly, found fuck all. Hence my main reason for writing this.",
  "I was determined to experience the most I could out of this, as I had not done it before. I persisted to keep my eyes open and keep moving for around 50 minutes.  It was then that I felt an extremely warm and tingling sensation over my entire body. I also felt like I was floating. This was some cause for concern because I started to feel sick, and I know people can be allergic to it. At exactly the same moment, both me and C got up and went to the toilet, but were only there for a moment because the nausea went as quickly as it had come.",
  "This is where things started to get weird, the warm and tingling feeling was still there, and it felt like I was floating still. I had come to terms with this and proceeded to watch Young Ones on the T.V. I was watching the T.V quite calmly and all of a sudden Id be watching it in town, sitting on a concrete monument. I had actually changed where I was and it didnt strike me as weird at all. It felt perfectly normal. Then Im back in the real world and I tell everyone what happened and no one seems that interested. C and A had not felt anything, apart from C feeling sick.",
  "I continued to slip in and out of reality, thinking I was in all sorts of places, on a plane, down by a river, in town, but the T.V never went away. Every time I came back into reality, I told everyone where I had been in quite incoherent speech.",
  "One thing I noticed was that my hands felt really awkward. I kept thinking I had something in my hands, so I was constantly disappointed when I lifted my hand to take a toke on a cigarette that wasnt there, or take a bite from a chocolate bar. This continued all night and I was constantly asking my friends where my fag had gone.",
  "About half an hour after effect, it became extremely difficult to follow the T.V so I gave up on watching it and decided to look around. As soon as I stopped focusing on the T.V, slipping into totally different settings became less and less frequent. Instead, I would be sitting next to people that were just not there. One person that kept appearing was my friend E, shed be talking to me (I found it very difficult to actually remember what was being said) and Id be listening intently then say something in reply like  I totally understand where your coming from and everyone in the room would look at me. Id look back at E, and shed be gone. This was thoroughly confusing and happened pretty much constantly. Sometimes it was my friends from school, often people I hadnt spoken to in years.",
  "I remember distinctly me and my imaginary friend were discussing the fact we hadnt spoken properly in years and I proceeded to hug him and tell him we should spend more time together. This is where I was asked what are you doing? by the real people in the room. I looked back at my friend who I was hugging and it was a pillow.",
  "I found it extremely difficult to follow who was in the room and who wasnt. C had gone to bed upstairs but I kept seeing her walk across the room and I even put my arms around her at one point. She turned out to be another pillow. It was little things, like cats walking across my friend. Bugs in the air, balloons.  I constantly saw yellow balloons. One was behind my head and I tried so hard to get it but I couldnt find it. I even asked my mate if he could pass it to me, who told me there was nothing there.",
  "At around 2 in the morning, I fell asleep. I woke up again and thought I had sobered up. We put another film on and I thought that my lack of co-ordination was just the after effects. It turns out I was tripping just as hard. I realised this when I saw a little man about 2 feet high, walk up to the T.V, head butt it, and vanish. This made me laugh hysterically and I was in total disbelief that no one else had seen it.",
  "We sat there till about 4 in the morning, watching films. I was tripping constantly. I continued to see people who werent there, and interacted with them as if they were. It got to the point where I just refused to acknowledge them anymore. They were talking to me and I just said youre not real, go away and they would vanish and reappear.",
  "In the morning, I felt similar to how I felt the night before. In fact, I still feel similar to how I felt, at 10 past 2 in the afternoon the next day. It was like being asleep, whilst being awake. It is so much like a waking dream it is unreal. I wish I had taken more, to make the experience even more crazy.",
  "This is something I thoroughly enjoyed. Quite possibly because I love dreaming so much. I definitely plan to do this again in the near future. A few factors that might be explanation why only I felt something, whilst A and C felt nothing, could be the fact I had had very little sleep the night before and had been up for a long time,  my light weight compared to both of them and my prescription of Olanzapine, 5mg a day."
 ],
 "erowid": {
  "id": "76921",
  "citation": " KingBB. \"A Strange Combination: experience with Diphenhydramine & Olanzapine (ID 76921)\". Erowid.org. Jun 21, 2012. erowid.org/exp/76921",
  "substance": "Diphenhydramine & Olanzapine",
  "views": "8504"
 }
}
