{
 "id": 12286,
 "title": "Salvia Divinorum Entities",
 "date": {
  "submission": "2009-03-20T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "N.E.",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 cups",
   "administration": "oral",
   "substance": "Kava",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "1.75 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "<p>Citation: N.E. 'Salvia Divinorum Entities'. The Entheogen Review. Vernal Equinox 1998;7(1):3.",
  "I just recently had the opportunity to try Salvia divinorum, and have found it to be the only entheogen that consistently propels me into entity-contact experiences after smoking.\rFirst Attempt: Drank two quarts of kava drink (about a 1/2 cup powdered waka-grade root). I decided that the relaxed state would be a good launchpad for the Salvia divinorum. I tried to smoke 1.75 grams of dried leaf in a gravity-type bong (bucket bong). The bong was too much trouble to operate smoothly enough to smoke the S. divinorum effectively, but I caught a glimpse of the experience.",
  "Three entities, maybe more. One was a woman, and the others don't stand out as well. They said my name and then something like, 'What are you doing here? You're not supposed to be here (now?).' Then they were like, 'Oh well, let's just do it!' and they began pulling and stretching me into three sheets of color, side-by-side; red, orange, and yellow. There was a unique vibration as it came on, and during the experience.\rSecond Attempt: Used a water pipe, trying to consume and hold as much smoke as possible. There was no pins-and-needles feeling like the first time. I felt two helping hands, two separate human-like (African American?) entities laid me down and helped lay the pipe and lighter down. They knew me and my name. There were also these entities (not human?) made of color doing something together and pushing me away from the area--like I wasn't supposed to be there or see what I was seeing. They kept trying to convince me to not pay attention (I felt as if something important was going on and I was being made to sit back in the corner so I wouldn't see too much).",
  "Second bowl: Immediately after coming out of the trance. I'm in a different world and body, not clear. There is a woman in the room with me who is talking, but I can't remember her words. The whole place just starts spinning (gyroscopically?); spinning and turning inside-out, always at 90 degree angles to each other.",
  "Doors open into rooms into more doors into more rooms; insanity--pure madness!!!! Will I ever get back to where I was? The room is alive; things that are inanimate and flat take on life. Two dimensional life--Disney-like where a whole house is a living being made up of lots of separate living parts.",
  "I came out of the trance still unsure where I was or who I was and flung my bedroom door open screaming out loud, 'Is this it? Is this the real room?' I thought the whole place was going to turn inside-out again, but soon realized I was back in my usual mind-set and coming down very fast as one does from a good hit of smoked Salvia divinorum. -- N.E.</p>"
 ],
 "erowid": {
  "id": "76997",
  "citation": " N.E.. \"Salvia Divinorum Entities: experience with Kava & Salvia divinorum (ID 76997)\". Erowid.org. Mar 20, 2009. erowid.org/exp/76997",
  "substance": "Kava & Salvia divinorum",
  "views": "14681"
 }
}
