{
 "id": 12292,
 "title": "Even More S. Divinorum Visions",
 "date": {
  "submission": "2009-03-26T07:00:00.000Z",
  "experience": "1998"
 },
 "author": {
  "name": "R.G., WA",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "administration": "buccal",
   "substance": "Salvia divinorum",
   "form": "(fresh)"
  },
  {
   "time": "0",
   "administration": "buccal",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "Citation: R.G., WA. 'Even More S. Divinorum Visions'. The Entheogen Review. Autumnal Equinox 1998;7(3):58.",
  "Experiments with smoked Salvia divinorum have not yet produced any perceivable effects--but chewed leaves (two experiments with fresh leaves, and one with dried leaves soaked in a small amount of water) produced very strong effects that were easy to handle. All experiments were done in darkness with very little sound. S. divinorum seems to me to be revealing a sub/super/transcendent reality--a realm of experience that we all share, and which is concurrent with our moment-to-moment daily lives, but we normally remain completely unaware of it while in our waking state of ego-consciousness. Our normal waking state seems to completely dominate our awareness--tuning our inner and outer senses to one level or 'bandwidth' of reality and preventing us from consciously experiencing these other levels of sub/super awareness that we are also continually unconsciously operating on (receiving, organizing, and transmitting information as we co-create and experience the collective dream). S. divinorum seems to give direct access to the larger 'holographic reality.' We are our world and we are a resonant manifestation in the possible experiences of other consciousness's worlds.",
  "From the reports I've read of other people's smoked S. divinorum experiences (also see Autumnal Equinox 1997 ER, 'More Diminished Appetite for DMT,' p. 12) it sounds like the route of ingestion--smoking vs. chewing--may greatly alter the experiences and relationship that one has with S. divinorum. And orally-activated DMT exploration sounds boundless. Going fast may produce a powerful rush, lots of weirdness, and take us far, but like our physical modes of quick travel, the automobile and the planes it also effectively prevents us from truly experiencing and exploring the territory in any more than a very superficial and shallow way. Since the entheogenic trip is almost always a round-trip, it is important to fully explore and learn from it, so that when we return to the world of the mundane we can bring back some of the treasures/insights we have gained, and use them to facilitate the process of self-transformation and creative conscious growth. -- R.G., WA"
 ],
 "erowid": {
  "id": "77007",
  "citation": " R.G., WA. \"Even More S. Divinorum Visions: experience with Salvia divinorum (ID 77007)\". Erowid.org. Mar 26, 2009. erowid.org/exp/77007",
  "substance": "Salvia divinorum",
  "views": "3879"
 }
}
