{
 "id": 1229,
 "title": "Faces on the Ceiling",
 "date": {
  "submission": "2005-03-03T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Trip",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.62 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 ],
 "report": [
  "I have been looking for mushrooms for the past 6 months and have had no luck what so ever then one day on of my friends N came to me and asked me if I needed so obviously I accepted the offer and a couple of days later he handed me 1/8 of swiss mushrooms. ",
  "At the time I was grounded for various reasons so I decided to trip in my house by myself which isnt really a good idea but I did it anyway.  So at about 9:45 I ate 3/4 of the 1/8 I got because I didnt want to get too messed up cause my parents were right upstairs.  Then at about 10:00 I noticed slight changes in my thinking patterns and the way I was acting. It was starting so I laid down in my bed and put on jay and silent bob strike back.  Then about 15 minutes later I noticed that an absolute bottle I had in my room started to bend and move in many different ways.  So I was starting to get excited and my mind started to drift away.  In my room there is this black light with a transparent yellow case around it and it started to make my whole room look like I was in a jungle then I looked up at my cieling and I saw a million different faces all over it moving and morphing into other ones it was like all people from history comming together in my room for my trip it was the most amazing experience of my life. Then I was getting really into the movie and all the characters had tracers and beautiful auras around them. Then all of a sudden their eyes started to move in the most odd ways just in circles and the whole movie turned into one cartoon. ",
  "After that point it was like 4 hours into my trip I didnt really get many intense visuals just the amazing body feeling that made me feel like I was one with the earth its just unexplainable.  Then I stayed up till about 6 in the morning tearing apart every aspect of my ego and just letting my mind drift in the most interesting ways.  Eventually I fell asleep at about 7 and I know that nothing I will ever do will be like anything even close to that night."
 ],
 "erowid": {
  "id": "13616",
  "citation": " Trip. \"Faces on the Ceiling: experience with Mushrooms (ID 13616)\". Erowid.org. Mar 3, 2005. erowid.org/exp/13616",
  "substance": "Mushrooms",
  "views": "4398"
 }
}
