{
 "title": "Beautiful Nothingness",
 "author": "BigDaddy",
 "citation": " BigDaddy. \"Beautiful Nothingness: experience with DXM & Nitrous Oxide (ID 123)\". Erowid.org. Jun 10, 2000. erowid.org/exp/123",
 "substance": "DXM & Nitrous Oxide",
 "bodyweight": "280 lb",
 "report": "<p>I ain't got no weed, or even enough to buy a 12 pack of beer, and I'm supposed to be able to party for 8 hours tonight. I guess it's time to break out the old cough syrup. This would have been my 2nd trip with the first one not being very eventful and rather unpleasant. So I figured i'd be up all night on this shit and should have an intresting night. So i drank the bottle slowly in the car on the way to a party. I actually love the taste so i rather enjoyed it except for the nasty bite of aftertaste in the back of my mouth.</p><p>About ten minutes after i finished, i arived at a friends apartment and felt no effect for some time. The first effects i seemed to notice after about 30 minutes was simply a peculiar stoned feeling, just like the slow movement and thought process from drinking but with none of the positive effects. The slowness slowly grows stronger into a type of confusion. Like you still know whats going on, can walk and talk normal, but you are only concerened with the subject at hand, whatever is right in front of you, whoever you're talking with at the moment, and the rest of the world is nonexistant.</p><p>Getting a little dizzy now too. Party's getting really loud too, a bit overwelhming, so i step out side and sit at the table on the patio a buddy comes out and joins me, offers me a cigar, I totaly inhale the shit hard, and suddenly i feel all the blood of every living thing in the world blast through the viens in my head like a presureized hose. And I fly up 100 feet in a blast of adrenaline. I am lost in these feelings and visualizations when i 'come too' and realize im still sitting there. Now i'm realizing I'm really starting to trip. I'm thinking 'my god what did i get myself into' as what i was experiencing then was definitely altered consiousness but was by no means fun or comfortable, and it was just begining.</p><p>my budy then left and i sat alone in the night, for a while, just trying to get a grip. I began to grow very sad, and depressed as I started thinking about how fucked my life was and how much shit im going to have to deal with come monday morning, and really i have no way to deal with what was going on so im really screwed. I just sat there and got more depressed to the point of tears and then realized that there was no tears. No sadness at all , just numb. My god what is going on, never felt this way before. I'm so stupid why did i do this. I get up and try to walk inside, balance is starting to get fucked up. Inside lots of people, lots of noise, besides that, confusion. No real foucus on what it is -a party at a friends house with person a and person b ect. just a blind mass of noisy people. It's overwelming, i have to sit. God I hate this shit, why did i ever do this?!!</p><p>so i sit and try to hold my self together in this malestrom of noise and confusion and depression. Suddenely a friend who's fairly plastered just grabs me up and we start dancing around the room. Then i hear the music.. Their was no music before, it just came to me like a frieght train, i have no idea what it was, but then to me it was pure joy. My friend then says she's having such a great time. suddenly I feel as i was released from a prison i fly up and around the room in an energy of happiness. I said to her 'why did i take this shit to feel bad, your so right this is what its all about im going to have a blast tonight,fuck the rest of the week this is what it all about!! Your such a good friend' she was probably extremly confused but too drunk to care so we continued to float around the room for a while.</p><p>The next thing i remember was sitting at a table and watching people fill up baloons with you know what. So i begged for one like a child (it was just natural at the time) and telling them how much ive smoked them out before etc. and they said relax, you can have all you want. When i got a fairly big one i sat down on the floor and inhaled the whole thing and held it. Typically that won't do much for me, but this time it was much different.</p><p>Instantly I was away from this world. On my Very own plane. It was black in color, a void a nothingness, also silence. It was a beautiful silence. Never experienced it before. Even a deaf man has some kind of constant audio input or stimulus from his own biological inner workings. this was totally gone. To continue to describe the trip i must say 'I was' or 'I saw' but really there was no 'I' i simply did not exist nor did the rest of the world, in that black void simply a flower, changing color from yellow to orange, beautiful and on fire. Just the flower and the beautiful nothingness. So much peace, beautiful peace. I dont know how long that 'experience' replaced me and the univerrse, but to me it could have been light years.</p><p>i started hearing voices around me and realized everyone was looking at me in this room. How dare they invade my world!! I was incensed and furious at these fuckers for destroying it. then i realised that i was simply on drugs and that the whole world would be coming back soon. Now it felt just like my usual come down from nitrous, except it was taking an unusually long time. What was wrong? Its still dark, My eyes must be closed, oh shit they are open!! Oh my god I cant see! O fuck the DXM!!! I AM TRIPPING!! when I finally get some vision back everything is in fours and spinning wildly, it's not like i was actually hallucinating, just that im so fucked up i'm not getting the message corectly and my brain is putting everything together in this fucked up jummbled mess. This prety much sucks. And I am hating life for awhile until they put on some music which really sucked ass, but i couldn't stop my self from raving wildly to.</p><p>They turned the lights off and put up a glowing green neon sign. I started to rock and move to these shity songs in the dark and the green light started forming little super snakes of light that flew around the room, faster and faster untill i lost my self in this cosmic light show. This was the only confort. I did this until i came down 3 hours later and i just felt exhausted and a little disoriented. So it was definitly intresting which is all i hoped for. I would only consider it again if I could be in a position to dance to music and a light show for hours and just lose my self. Otherwise I find it a prety shitty drug and definitly not a substitute for any thing else used to have a good time.</p><p>",
 "year": "2000",
 "id": "123",
 "gender": "Not Specified",
 "timestamp": "2000-06-10T07:00:00.000Z",
 "views": "11434",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "8 oz",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "(gas)"
  }
 }
}
