{
 "id": 12303,
 "title": "Aural Depths",
 "date": {
  "submission": "2010-08-09T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andrew",
  "gender": "Male",
  "weight": 98
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "DiPT",
   "form": "freebase"
  }
 ],
 "report": [
  "I had recently placed an order online thinking I was ordering DPT. Well I at times happen to be a careless person and I neglected to note the additional 'iso' in the name here. Instead of purchasing DPT I ended up buying DiPT. And yet, I got a most excellent experience.",
  "I (again, thinking it was DPT) put what I eyeball to be 25mg of it in a lightbulb vaporizer. My crystals melt to oil, which vaporizes into my lungs.",
  "I find everything has a beautifully deep tonal quality. Every song sounds new. Its like my entire music library is anew. When I listen to a song and I hear multiple people singing at once, its almost as if all those are separated. Yet I hear them all at once. Vision seems clear, there is a certain clarity to everything. I feel shaky. But its not a bad thing. If there is a rhythm to be found my body will locate it. I joined with the music. I let the music take me. I lay back, listen. I can create my own powerful symphony. It was the bell in a cathedral that eventually spread outward and blanketed the whole earth with its melodious sound. All from inside.",
  "Vaporization is a fine way to enjoy this harmonious compound, I do declare. I've never felt this connected to a drug. It's so perfect. It just dives me right into the music. Imagine having a layer of your life removed so you can see underneath it. A whole new world is under here. While the audio effects are very cool, the psychological and body effects need to be mentioned.",
  "Firstly, I did notice nausea via this administration. It seems to subside after a while. But honestly early on I wanted to just lay there. I took some TUMS. Those help. I got kinda gassy for some reason. Second, The stuff stanks. It really does. It doesn't make me throw up, but it ain't far off.",
  "As far as mental effects. Its actually got some potential here. I haven't seen much smoked so far, but I have had some CEV's and if I just zone out some line based visuals. Also, vision tends to get wavy and distorted."
 ],
 "erowid": {
  "id": "77085",
  "citation": " Andrew. \"Aural Depths: experience with DiPT (ID 77085)\". Erowid.org. Aug 9, 2010. erowid.org/exp/77085",
  "substance": "DiPT",
  "views": "3166"
 }
}
