{
 "id": 12306,
 "title": "Antibiotics Contraindicated?",
 "date": {
  "submission": "2009-02-23T08:00:00.000Z",
  "experience": "2006-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sam",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Ayahuasca",
   "form": "tea"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Doxycycline ",
   "form": ""
  }
 ],
 "report": [
  "While out in the Peruvian Amazon on a university field trip a few years ago, I had the great fortune of drinking ayahuasca on three different occasions. On the first time, I had taken my daily dose of the antibiotic doxycycline earlier during the day. I drank the ayahuasca around 9:00 pm, and the experience began with nausea (expected) and deep tremors in my body.",
  "Never having taken ayahuasca before, I thought this was normal. I purged around 30/40 minutes later, and then repeatedly purged, over and over again, for six or seven hours. Even when my stomach was empty I puked up bile. The shaman tried to help but was unable to do so. The experience left me exhausted and drained, and that level of dehydration is dangerous in the Amazonian climate. The shaman and my guide had to carry me to bed. I awoke a few times in mid-vomit, was incredibly dizzy, and fell off the twelve-foot-high platform on the edge of the village while trying to puke away from the fellow voyagers. I also had the experience of voiding out of both ends at the same time.",
  "The next day I couldn't stomach solid foods. I swore off antibiotics for good, and haven't touched them since. While antibiotics vary a lot, I would STRONGLY suggest people using antibiotics tread vary carefully with ayahuasca, and if possible refrain for two or three days before drinking. It might be best to err on the side of caution.",
  "As doxycycline is a common anti-malarial antibiotic, it is one in particular that will likely be used by people visiting South America."
 ],
 "erowid": {
  "id": "77118",
  "citation": " Sam. \"Antibiotics Contraindicated?: experience with Doxycycline & Ayahuasca (ID 77118)\". Erowid.org. Feb 23, 2009. erowid.org/exp/77118",
  "substance": "Doxycycline & Ayahuasca",
  "views": "13334"
 }
}
