{
 "id": 12312,
 "title": "Detatched from my Inner Child",
 "date": {
  "submission": "2010-01-17T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Namnosam",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "2C-I",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "It was winter break from school senior year, and I was feeling adventurous, having nothing else to do in the gray, Wisconsin cold. it was a sunday morning, the night after partying with my buddy 'W' and some cocaine he purchased. I woke up still feeling pretty crazy, so I called up my other buddy, 'G', and we purchased two capsules of 2cI for a fun sunday morning I didnt want to forget. we picked up 'T', and 'W' and went to 'G''s house. I was the hungriest I have ever been, but I didn't feel like eating.",
  "we split up the two capsules of 2cI into thirds, presumably for 'G', 'T', and myself, as 'W' didn't put in for it. there sat my line, on a mirror looking at me with the soft look of powdered acid. no one else wanted to snort it first, because we were told it would hurt, so I was nominated to go first. I bent over and snorted the line in my left nostril, only finding that it burned like a thousand suns. At first, I felt nothing, then a stinging sensation as my extreme hunger faded. I downplayed the pain as I watched 'T' take the line, which he complained about. 'G', someone who always tries to be tough, thought twice about doming his third of the 2cI and suggested he split it with 'W'. that is when I first started questioning what I had done. They both snorted it, half of what 'T' or I had done. 'W' started blowing his nose afterwards because of the pain.",
  "I was coming up really fast and I had the sensation that I was constantly going up in an elevator. everything started turning grey/purple and I was overwhelmed by a rush similar to panic, but more controlled and constant. after all was said and done with the 2ci, we smoked a blunt, ran out of bud, and decided to score some bud, so we called up a friend of ours, who we picked up, scored buds from, and freaked the fuck out of. he was uneasy with the way we were acting and the fact that 'G' was driving on insufflated 2ci. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  When I paid our dealer, the money in my wallet from Christmas had no meaning to me. it no longer brought me the joy that it did the night before. after scoring the buds, we rolled two blunts and went out into the Wisconsin countryside outside our little town, where we went to smoke blunts almost everyday.",
  "It was about this time that I started to panic. I just kept going up and up and up, until the sky turned into a snowglobe cap and the horizon line was a magnificent, yet ominous rainbow. we sparked the blunts and the whole time, I just started to panic more and more. this was not like me, as I am very chill and have experience with psychedelics. this only expanded the panic, until it was just there and I felt I couldn't do anything about it.",
  "I started thinking about when I was a little kid watching cops with my parents, thinking to myself 'Holy shit, I'm never going to turn out like that guy.'. the whole time, I felt like I was 'that guy', every guy to ever be on cops during the nineties. I started imagining how I would react as a child if I saw the last 24 hours of my life; snorting cocaine, smoking cocaine, drinking, smoking weed, doming 2ci. all of these things, no matter how unscary they were when I did them, became incredibly scary.",
  "fear penitrated my soul, as I re-realized how hungry I was. the pain I once felt from hunger moved upwards towards my chest, which only complicated my sense of fear and panic. I had heart surgery before, and that never really scared me with drugs, but today, I wasn't in control. Today I was at the mercy of this chemical which I thought would be like lsd, but unfortunately was far from it. I imagined every toxic atom surging through my veins to every region of my body, poisoning me from the inside out. (specifically in my left arm, which felt numb)",
  "Rainbows bounced off of every surface, as the sky turned from rainbow-y Mr. bubble pink to a horrid dark purple that spelled out disaster. My heart started pounding, and I truly feared for my life, something I wouldn't have minded losing on any other drug during the course of my winter break. the blunts were smoked and we went to the quick trip. 'G' and 'W' were mostly fine, having only done half as much as myself or 'T'.",
  "Confused, I walked inside quick trip, with no money, to get a free cup of water. never in my life did I feel like such a penniless cheapskate. out I walked, all around the building until I found 'G''s car. we went into town, because 'W' and 'G' wanted to eat. I did too, despite the fact that my parents were home and I was tripping harder than ever at noon on a sunday. 'G' dropped 'W' off at his house and 'T' and I at the gas station by my house. 'T' and I went inside to warm up before our cold journey to my house. I purchased two doughnuts, muttering nonsense to the cashier, who looked confused and concerned. I ate one doughnut thats when I started to feel better and we were on our way. the snow was fresh and sparkling so much that it was hard to walk. everything was a color, even if it should have been white. the snow was bursting with orange and purple as if out of an abstract painting.",
  "on the way home, I tried to get 'T' and myself thinking and forming sentences in case we had to talk to my parents. I asked him questions, which he rarely listened to, and when he asked me questions, I could do little more than mutter, although I had the desire for truth and knowledge that came with lsd or mushrooms. this was annoying, and I eventually gave up on learning. we go to my house and went right downstairs into my room and quickly turned on something to look at in case my parents came home. I didnt want them to see our dilated eyes. we played mario kart on the n64, which was very reminiscent of my childhood. I got a call from my friends, dennis, parker and zack, who were back in town.",
  "'T' and i, still tripping incredibly hard, invited the trio over to my house. neither 'T' nor I talked much, and I was sure they knew we were fucked up on a drug they wouldn't approve of. Zack read childrens poems, which made me feel like a little kid... but in a bad, braindead way. I could do nothing but listen to the poems in awe, not concentration on the poems themselves or the meanings they contain, but rather just the sound of the words leaving zack's mouth. somehow, it was eight o'clock already and it was time for dennis to go to his foster home. I was tripping this whole time. despite being scared shitless, I considered this to be a positive experience. I no longer feel immortal, nor do I feel the need to try every drug on the planet.",
  "The day after, we talked about it, and all of my friends told me I looked like what can only be described as 'death'. I would have to agree with them, in that I felt like 'death' for much of that day. I dont think I would ever do this drug again (especially by means of insufflation). even though I tripped for 14 hours for twelve dollars, and I wouldnt do this again. it just isnt insightful or profound- it is, for me anyway, just a cheap psychedelic ass kicking."
 ],
 "erowid": {
  "id": "77169",
  "citation": " Namnosam. \"Detatched from my Inner Child: experience with 2C-I (ID 77169)\". Erowid.org. Jan 17, 2010. erowid.org/exp/77169",
  "substance": "2C-I",
  "views": "5864"
 }
}
