{
 "id": 12320,
 "title": "A Tiny Yet Satisfying Taste/Day Out",
 "date": {
  "submission": "2009-11-22T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "2c-buoyant",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "substance": "2C-B",
   "form": "powder/crystals"
  },
  {
   "time": "1:08",
   "amount": "15 mg",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "1:28",
   "amount": "25 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "3:23",
   "amount": "60 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "4:29",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Mephedrone Trial Run.  (Mephedrone [first time, inexperienced], 100mg Broken Up, 2C-B 10-15mg)",
  "Set: Refreshed, great mood.",
  "Setting: Home, walking around town, casual day off full of errands.",
  "Compound(s): 100mg Mephedrone dosed primarily in 3 increments, the last being maybe 60mg I think, 10mg 2cb initially to make sure it wasn't the meph.",
  "Start:",
  "Woke to a pleasant surprise from a friend, two small quantities of compounds, one my tried and true love, 2cb. The second, a compound buzzing around the forums I frequent with but with only a small time period synthesized existence/experimentation, the compound of the hour, mephedrone.",
  "11:30: Neither compound was labeled at time of recieval, nonetheless I know the taste of b quite well so I licked the tip of a knife to play guinea pig, no more than 5 mg.",
  "12:38: Still not feeling B, perhaps slight 'off' feeling, but pretty normal.",
  "Either way, awake one hour, showered, shaved, cleaned house, no food in stomach as of yet, by the time I take 10mg - 20 on a precision scale. Now the waiting game ensues.",
  "12:58: Nothing yet, start getting impatient, take around another 25mg up the tooter. Will report back, having to run a few errands, getting saltwater tested at my favorite local aquarium and chatting it up with the hippie proprieter, hopefully in time enough to feel good and watch some live rock, but after I have to deal with this unpleasant business at the [deleted]",
  "2:53 Back from a delightful (after aggravating) 2 mile walk on a beautiful almost summeresques day (global warming in NE PA? not sure, but not complaining). Venture off to [deletive's] to have my water supply checked, and it so happens the proprieter  checks my water and says its best to breakdown and not use tap, before I invest further (kesey anyone? hehe) money invested, upon which I invested none so far. Needless to say, seems I'll be a fair regular, since I love the private atmosphere and his beauitful reef setups, live rock etc, and the company. Whatever gets me out of the house in this rough time in my relationship, is Win Win in my book.",
  "On the methylone front, 2cb must have been 10mg because most certainly enjoyed the feeling of a slight psychedelia, visuals and mindset, and a nice little push from the mephedrone. Just snorted another 60mg. Will report back in one hour, have some laundry to do and while I wait, some BS with my tattoo artists, Laundry friends, Comic book shop owners, and I even stopped by the record store (coolest one in 100 miles, I know the owner).",
  "3:59: MOST CERTAINLY FEEL NICE, ANOTHER 50mg dosed, then to the laundry. Snooted, off to Lmat/comic shop/tat shop.",
  "8:00: Down now, had a fun day of laundry comics and tattoo shop record store fun. Nice compound, although most likely only had 100mg throughout the day, will try more in the future. Had more fun with the initial B headspace and slight visual change. Lost the B though, cleaning house tomorrow, needless to say.\r[Erowid Note: [Discrepencies between reported doses and sum of doses mentioned in report; also, '5 mg diazepam' reported at submission but not mentioned in body of report.]"
 ],
 "erowid": {
  "id": "77209",
  "citation": " 2c-buoyant. \"A Tiny Yet Satisfying Taste/Day Out: experience with 4-Methylmethcathinone & 2C-B (ID 77209)\". Erowid.org. Nov 22, 2009. erowid.org/exp/77209",
  "substance": "4-Methylmethcathinone & 2C-B",
  "views": "4950"
 }
}
