{
 "title": "Playing the Field",
 "author": "lsd_tripper",
 "citation": " lsd_tripper. \"Playing the Field: experience with LSD, Mushrooms, MDMA (Ecstasy), DXM & Cannabis (ID 12328)\". Erowid.org. Oct 31, 2009. erowid.org/exp/12328",
 "substance": "LSD, Mushrooms, MDMA (Ecstasy), DXM & Cannabis",
 "bodyweight": "160 lb",
 "report": [
  "<p>I'm in high school now, a freshmen, and was quickly exposed to more variety of drugs besides weed. Wanting to try these new varieties I quickly got them. Sine grade 7 I have smoked weed and drank, grade 8 I first tried hash and oil, grade 9 I now have moved up to mushrooms, lsd, ecstacy and dxm. I have done shrooms 3 times, dxm 2 times, ecstacy 2 times and lsd 7 times. LSD is my favorite drug right now.",
  "All of my experiences with drugs have been good, with the exception of some bunk ecstacy one time. I have never had a bad trip and I am quite a lightweight. 1 hit of acid gets me fucked. Shrooms are a bit of a disapointment with me though. I did acid before shrooms, so shrooms seem too soft when I take them. I've done 8 grams of shrooms within 6 hours and I would rather take 1 hit of acid.",
  "The first time I did ecstacy was amazing. I was just at a mall hanging out when it started to hit. It felt like warm love was rushing through my body. The second time I did ecstacy the e only lasted for about a half an hour but was great for that half an hour.",
  "DXM I have found to be great as well. The first time I tripped I had the craziest hallucinations I have ever seen, more fucked up than acid. I felt amazingly drunk, without the stomach ache. Both times I've done dxm the climax didn't come until I smoked weed roughly 6 hours into the trip. The first 6 hours usually feel like I'm very drunk with things looking different but no real hallucinations, but at 6 hours my world changes and I'm sent to a bright dimension full of lights and oozing brightness.",
  "I now have constant flashbacks from acid and as I do more psychadelics, elements from those drugs appear in my flashbacks. While smoking weed at a friends house whom I've tripped on lsd with before, his room changes back to the way it was on acid, with moving rainblows flowing on his walls. While getting high on weed in my room, I seem to get patterns everywhere and brightness everywhere reminding me of my shrooms and dxm trips in my room. But I'm not complaining! This has made typical, boring marijuana smoking very enjoyable and new. Today, while smoking residue out of my pipe, of all things, I started to notice holes of light leaking into my eyesight with head rushes remaining constant. Residue is my last resort and I'm always disapointed when I have to resort to rez but today it was great!",
  "Most people report bad side effects from hard drug usage and I'm glad to say that it has made me feel happier and given interest to my life. One thing I do not want to happen is addiction to anything. Addiction scares me and would change my view on drugs if I ever were addicted to anything. I TRY to trip every weekend, but it's more like every 2 weeks. The only bad side effect I have become aware of is my bad memory. Things are hard to remember and I usually leave things to the last second. Some bad side effects are to be expected though, and other than that I feel great.</p>"
 ],
 "year": "2001",
 "id": "12328",
 "gender": "Male",
 "age": "14",
 "views": "5148",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "LSD"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Mushrooms"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "DXM"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "",
   "substance": "Cannabis"
  }
 ],
 "submissionDate": "2009-10-31T07:00:00.000Z"
}
