{
 "title": "Clean High",
 "author": "Duke",
 "citation": " Duke. \"Clean High: experience with Mushrooms (ID 12333)\". Erowid.org. Jun 14, 2007. erowid.org/exp/12333",
 "substance": "Mushrooms",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE:",
   "0.75 g",
   "oral",
   "Mushrooms",
   "(plant material)"
  ]
 ],
 "report": "<p>After some experimentation, namely ecstacy and marijuana, I decided I needed to find out what shrooms were like. Weeks before I tried them, I decided to abstain from weed and other drugs because I wasn't feeling comfortable with those drugs anymore. I felt like I needed to stop doing drugs completely. My friend, Warren, bought an 1/8 of an ounce of magic mushrooms and convinced me to try them with him. The person who supplied it to him stressed not to do more than a gram, because they were surprisingly strong. Being the somewhat experienced buyers, we knew that dealers always talk up their production, so my friend didn't take his suggestion seriously. So he ingested 2 grams of mushrooms, and since it was my first time I ingested close to a gram, just to be safe.</p><p>It might seem funny to you, but my friend and I took the mushrooms in school, in his boardinghouse after classes had ended. I ate them with an ease that made me somewhat uncomfortable, because it supported the notion that drugs like me and go down easy with me. I went to play some pool, and guess what?! The assistant housemaster of the boardinghouse comes and talks to me and my friend. Usually when I'm under the influence of drugs it is very hard for people to notice what state I'm in. So it didn't seem like much of a challenge to remain under good behaviour around the housemaster when the shrooms kicked in.</p><p>I didn't realize it, because of the smoothness of it all, but the mushrooms began to hit me as I was talking about politics and religion casually with the housemaster. It was all like a game in my head, trying to remain in control and sound intelligent until we could figure out a way to get out of the boardinghouse, and I felt very confident. My arm began to shake nervously as I held it stuffed in my pocket. As I was talking, my confidence and self appreciation grew and I felt a little bit taller. I thought that the lettering on my shirt was really the drawstring of a hood on my shirt, that wasn't there. My friend and I masterfully left the housemaster with ease and decided to head out soon.</p><p>Before we left I checked my eyes in the mirror and my pupils were completely dilated. Warren and I walked outside and headed towards the nearest subway station. With weed, I would sometimes feel confused and paranoid. Ecstacy was very different, because it didn't really confuse me. My mushroom-induced high wasn't very different either, it was very clean. When we came to the first intersection, I realized that colours were changing. I couldn't believe that I was getting open-eye visuals off of not even a gram of shrooms.</p><p>I looked at streetlamps in the distance, and like ecstacy, the light was distorted, and the lamps all looked like stars. I looked at the streetlamp above me and told my friend to look at my eyes. I saw a rainbow circle surrounding the streetlamp and my friend told me that my pupils kept on fluctuating in diameter. I looked at the traffic light and stared at the red light. The red colour of the light was soon replaced by an orange colour and then back again by the red colour. This constant change in the way I interpreted the colour of the traffic light was so compelling. I felt satisfied with the shrooms, even though my friend had not felt the effects yet after taking more than twice the amount I took! but he soon would.</p><p>My state of mind was still as clear as normal. I could think well about things, and I just felt so relaxed. I didn't feel intoxicated or drugged up at all. It was all so natural to me. The smoothness draped over me outside, in the subway, and on the way to my friend's house. On the subway my friend was so observant, he kept on dazing off completely and staring at things. He told me to look at my hand. As I did so I experienced something that I had when I smoked some good weed, as I started, the points around my focus began to expand outward, so that my palm looked like it was stretching, growing outward, but at the same time staying the same size. The lines on my hand looked like they were shifting. The red colour of my backpack seemed so bright. I figured that red was a fun colour to look at after seeing the traffic light and looking at my bag.</p><p>The game was on again when my friend and I arrived at his house. His mom and his sister were home, and we seemed to make a good impression. I felt much more assured than I did when I was high and had to keep it under control, so there were no problems inside his house. I still felt pretty tall, and I think I was peaking. Everything seemed bigger, or becoming bigger as I stared. The great thing about the whole mushroom induced experience was that it really wasn't a trip, it was a high. When I picked up the phone, My hand looked like a big glob to my side. I began to feel a little bit apprehensive about my friend because I knew that he was definately feeling different, and he kept on looking at random objects. So, naturally, I felt a need to get out of his house, for him at least, because I didn't want his mom to figure out that her son is acting kind of funny.</p><p>I told Warren how I felt and that we should go see a movie. We agreed and he told me he'd take a five-minute shower. I picked up Maxim and read through it, while waiting for my friend who took more like 20 minutes in the shower. I knew what he was doing, he was staring at random stuff again. He came out of the shower, and spent five minutes staring at his bed, his clothing, and his closet. The magazine in my lap looked big, and I felt I was handling the high pretty well. Nothing bad was happening, and even though I never really listened to reggae, it sounded so good on the radio that night. I felt really comfortable with my mental, and thought my friend's random concentration on ordinary objects was kind of funny. We went out and went to the movie theater.</p><p>On the way to the movie theater, we notice that everything seemed so desolate, but it didn't matter, I was so calm with the high that I felt like doing anything, even if I didn't like it. The roads had been covered with snow from a storm earlier on in the day. So much so that schools were cancelled. It was pretty late, and I had no worries when I saw cars were slipping and sliding on the roads. Warren described the whole scene as a 'big bubble bath'. I felt soo happy when I heard him say something that was actually funny, after having seen him go into an introspective, observant state from the shrooms.</p><p>I ate a pizza at the movies, and it was purple! It took me longer than usual to eat the pizza. My friend and I both agree that we felt pretty tall. Its actually pretty wierd that people feel the same things when they trip together. All in all, it was the cleanest high I have ever had in my life. The only aspects of my world that changed as a result of the mushrooms was my interpretation of colours, and my mood. Everything else remained intact, my thought process did not stray from the norm, nor did I say anything that seemed strange. My comfort in the high was almost addictive, I wanted to feel that comfort forever. The greatest thing was that when I went to bed, I realized that the mushroom experience, is just an experience, and should not be forced into everyday life. I'm glad for this realization, because it helped me come down from the whole experience much better. The magic mushrooms I ate produced the cleanest high I ever felt in my life.</p>",
 "year": "2002",
 "id": "12333",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-14T07:00:00.000Z",
 "views": "3534"
}
