{
 "id": 1233,
 "title": "Zappy Goodness",
 "date": {
  "submission": "2005-03-15T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Felix B.",
  "gender": "Male",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Ginseng",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Guarana",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Ginkgo biloba",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Vitamins / Supplements",
   "form": "(liquid)"
  },
  {
   "time": "1:00",
   "amount": "1 cup",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  },
  {
   "time": "3:00",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "My dad and I decided we wanted to go do something with a beautiful, sunny, warm, i-cant-resist-smiling spring day, so we decided to take a trip to a couple of recreation/nature areas we are familiar with. We jumped into the car, stopped a gas station, filled up the tank and bought two energy drinks [with Vitamin C, Caffeine,  Taurine 1000 mg, Ginseng 100 mg, Ginkgo Biloba 10 mg, Guarana 10 mg, Vitamin Bs] and a liter of water. We proceded to the desired location, pocketed our various drinks and just started walking. We ended up on a hill with a beautiful view of two lakes so we desided to relax for a tick. We drank our energy drinks and some of the water (both of us had empty stomachs). We walked around more and found various items of cosmic importance, like old pepsi cans with pop tops, beer cans, fishing bobbers ect...",
  "(~T+0:30) By this time the energy drinks were washing over us with their zappy goodness and we decided to get a boost. We wandered back to the car got in and went to a little coffeehouse in the middle of nowhere we knew of. We ordered some organic columbian coffee and proceded to gulp it down, black, yummy (~T+1:00).",
  "We found a nature trail and bleamed about on it for a good hour, interrupting two people about my age (~18) playing 'hide the sausage' and smiled and said hi and they didnt seem to mind, so we proceded bleaming about till we found a nice spot where the white pines were waving and roaring. we layed down on our backs and just spaced out. (this was like no caffeine buzz I had ever had before, it was really, really mellow for a stimulant). We proceded to stand up and continue walking and chat about drugs we've taken in our lives (keep in mind that my companion is MY DAD!!) and just had some pleasant conversation.",
  "(~T+1:45) I felt extremely open and free willed. I learned about his experiences on various chemicals and herbs, and he pointed out that he'd like to do Kava Kava with me some time, naturally I agreed. Envigorated by the walk and the columbian brew, we decided to move on to another area. We went to a state wildlife area and walked around, still chatting about drugs and experiences we've had. We saw some people doing more 'natural things...'",
  "(~T+2:05)things started getting kind of weird for a simple caffeine buzz, colors were sharpened and I gained insight to things I hadnt before, like I finally got some of the multi- and pan-dimentional things my dad sometimes talked about (he's an oddball).",
  "(~T+3:00)We were decidedly hungry so we started back home and stopped and got some food and a booster of a few(~3) cans of Coca-Cola each. We proceded to stop at home and take a restroom break, have some ice cream and go get my older brother from work. The three of us decided it'd be a good idea to go to a hockey game so we did... we all had a real horrorshow time and went home pronto afterwords.",
  "(~7:00) My dad wanted to check out a nightclub in a city about 45 minutes away, so he asked my brother and I if we wanted to go.... my brother didnt want to (he's not 'with' us on all levels) but I agreed so we went after a change of clothing. We got there, payed for admission US$3 each and promtly left... I am an athsmatic and I can not tolerate cigarette smoke, and to say the least, the 'nightclub' turned out to be an over-glorified hole in the wall bar (not my bag) that literally had a fog of smoke in it, not fun... we left and drove home and i decided to write this little experience.",
  "(T+15:00) Still have a slight buzz, but nothing special, music sounds really good."
 ],
 "erowid": {
  "id": "13639",
  "citation": " Felix B.. \"Zappy Goodness: experience with Energy Drink, Coffee & Soda (ID 13639)\". Erowid.org. Mar 15, 2005. erowid.org/exp/13639",
  "substance": "Energy Drink, Coffee & Soda",
  "views": "65018"
 }
}
