{
 "id": 12332,
 "title": "Cosmic Dragonflies and Oily Pixels",
 "date": {
  "submission": "2009-09-05T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fluffun",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "2C-B",
   "form": "pill/tablet"
  },
  {
   "time": "0:05",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:53",
   "amount": {
    "unit": "tablet",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "2C-B",
   "form": "pill/tablet"
  },
  {
   "time": "2:10",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Of all the drugs I have tried, 2c-b is by far the one I have the least experience with. I have only ever experienced threshold doses and have often been under the influence of other substances. I obtained two tablets each containing roughly 10mg a couple of weekends ago and know them to be active after trying one from the same batch with minimal/threshold effects. The reason I am journeying tonight is to try to draw out some of my inner emotions and true feelings surrounding the recent discovery that my dad has a second family in south America and has fathered three more children than any of my close family knew about. Also I thought it would be interesting to write this report whilst under the influence of the drug to truly define it's full effect which I believe I am yet to experience.",
  "A little about me I am 24 Male from the UK (wales to be specific) about 5'10 and about 185lbs. I started using drugs when I was about 16 beginning with cannabis and later discovering the illegal rave scene and uppers. Soon after I also discovered the hills around me were littered with mushrooms, acid was fairly easy to obtain and speed was a phone call away. I used to use psychoactives a lot, but recently discovered my love for film-making and began a degree. I now keep myself down to a few big parties in the summer and the occasional trip like this one, plus a couple of joints in the week.",
  "Anyway on with the show.",
  "I ate fairly recently so have decided to stagger the dose not to overwhelm myself and avoid vomiting.",
  "T 18:20- Ingest one of the tablets orally, they are off white and slightly smaller than a regular mdma tablet.",
  "T+ 18:25- Roll and smoke a joint of medium grade cannabis and settle down to watch some tv",
  "T+ 18:54- Feeling pretty mellow and lazy from the joint.",
  "T+ 19:13- Feeling more than stoned, there is an increased sensation of touch and I feel very relaxed. I have decided to ingest the second tablet.",
  "T+ 19:38- Feeling the effects of the first tablet, the effects are noticeable yet subtle. A mild distortion of objects like breathing and increased static in my peripheral vision, my mood is elevated but I feel relatively un-changed psychologically. Breathing is slow and calm no shivers no flushes. Also seem absent minded it's taken me nearly 7 minutes to write this short paragraph.",
  "T+ 19:55- Spoke to my girlfriend on the phone, she has no idea about this experiment and doesn't do any psychoactives apart from very occasional mild alcohol use. But doesn't have any problem with my choices to use. I was completely calm on the phone conversation was easy I feel some floaty sensations in my limbs and am still having very mild hallucinations.",
  "T+ 20:09- Took a trip to my kitchen to have some food, my balance is slightly off, like with most psychedelics. Visuals are steadily becoming more and more prominent. Nothing remarkable yet though. Just tasted some of my housemates lasagne it tasted amazing and I feel extremely hungry. Unlike any other chemical I have taken psychedelic or otherwise I feel my appetite enhanced. Have decided to watch my favorite tripping film - Princess Mononoke.",
  "T+ 20:30- Am waiting for my food to be ready before settling down to watch the film I have also made myself a joint in preparation, I am feeling highly sensitive but yet dulled in equal amounts, movements are jerky and feel unusual, colours are visible, slight tinges of orange and red, tracers and patterns are visible, CEVs are noticeable but not recognizable. My distance and depth perception are fairly useless. Distortion of objects is more noticeable the further away they are. My food tastes incredible and fills me with warmth.",
  "T+ 21:02- Colours are very bright and my vision is starkly detailed yet confused, I feel that the room is breathing or more accurately rippling like waves from a stone being dropped into a lake. I am having a great deal of introspective thought and feel a sense of tension yet of relief. CEVs are of many shifting colours and patterns like oil and water on a road but I am unable to picture anything clearly. My movements are becoming difficult as I experience a feeling like being chest deep in warm water when at rest (which is very niiice)",
  "T+ 21:26 visuals are fairly intense I just saw the most incredible insect it was repulsive and beautiful and had many legs it was unlike anything I have ever seen. I must try and remember it so I can sketch it. I also had one very prominent audible hallucination which shook me to the bone. I feel disconnected yet strangely lucid. Shifting oily pixels decorate every line within my sight but unlike other psychedelic tryptamines they do not dominate my vision.",
  "T+ 22:03 I feel like I have peaked I am going to experiment with binaural frequencies to see what effect it may have on this experience.",
  "T+ 22:20 The use of binaural frequencies gave my CEV a path and a direction but they remain unintelligible symbols like a language I am yet to understand. Suddenly I crave something sweet.",
  "T+ 23:42 I fell into a meditative state whilst listening to more binaural beats for around half an hour. The comedown on 2C-B is astonishingly quick I feel almost baseline after quite an intense trip. The use of binaural beats definitely enhanced this experience towards the end. There are some residual effects but nothing unmanageable all body effects are completely gone.",
  "The next day: I finally went to bed at around four in the morning and was completely baseline at least an hour before. My 2C-B experience was quite unusual the peak is short but fairly intense at what I believe to be 20mg. The trip itself is unlike any other psychedelic there is nothing to fear on it except fear itself, nothing scared me in my visuals but I felt anxious at times for no apparent reason, maybe due to the solo setting which I rarely experience. I can definitely see how a heavy experience could overwhelm a person's senses and have decided a threshold dose is far more pleasurable than the one I took last night. I may repeat this experience with other drugs for it has taught me a lot."
 ],
 "erowid": {
  "id": "77308",
  "citation": " Fluffun. \"Cosmic Dragonflies and Oily Pixels: experience with 2C-B, Music (Binaural Beats) & Cannabis (ID 77308)\". Erowid.org. Sep 5, 2009. erowid.org/exp/77308",
  "substance": "2C-B, Music (Binaural Beats) & Cannabis",
  "views": "7009"
 }
}
