{
 "id": 12340,
 "title": "Knocked Out!!!",
 "date": {
  "submission": "2010-03-21T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "webguy16",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Amitriptyline",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Acetaminophen",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "1945-- I just took 300mg lyrica, 200mg elavil, 10mg percocet, and 1 fioricet. I also have one of those power energy shots that im thinking of taking when i get really tired. Looking back at all of that typed out makes me think that it may not have been my best idea ever, but i guess im just going to have to see where this takes me...",
  "1950-- Already bored of waiting for the effects to kick in, i guess that i will just go smoke a bowl (marijuana) while i wait.",
  "2000-- Starting to feel a little warm in the face and lightheaded... a little bit of tingling. Its pretty faint and not easy to describe, but it is noticeable. I have been reading some of the other experiences and I just want to mention this incase something crazy happens and i die or something, I love you mom and am so proud of my two brothers that i cant even describe it.",
  "2011-- I find myself feeling really tingly and also really warm and fuzzy. Im spacing out alot and forgetting to keep typing, im normally a really quick typist but im finding it really really hard to focus on it at all, its now 2018 and i am still typing...",
  "2033-- My thinking and even my movement seams really slow and sluggish, like things are delayed or something, it also feels really hard to move, like i weigh about another 100 pounds. Even my eyes seam very slow when i move them from one place to another or when i try to read. 2040 is the time right now, so it took about 7 minutes in order to type this...",
  "Well, after that last entry i just kind of passed out, i remember seeing something out of the corner of my eyes and trying to grab for it but never actually catching it. Once i passed out i was GONE, people tried to wake me and i was completely unresponsive, they almost called 911 but decided against when they could see i was still breathing. So... yea.. i am going to do it again pretty soon probably..."
 ],
 "erowid": {
  "id": "77361",
  "citation": " webguy16. \"Knocked Out!!!: experience with Percocet, Fioricet, Elavil & Lyrica (ID 77361)\". Erowid.org. Mar 21, 2010. erowid.org/exp/77361",
  "substance": "Percocet, Fioricet, Elavil & Lyrica",
  "views": "17393"
 }
}
