{
 "id": 12354,
 "title": "Persistent Jaw Clenching",
 "date": {
  "submission": "2009-11-22T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TeuchterLoon",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0",
   "amount": "T+ 0:00",
   "administration": "200 mg",
   "substance": "oral"
  },
  {
   "time": "4-Methylmethcathinone",
   "amount": "(powder / crystals)",
   "administration": "T+ 0:00",
   "substance": "2 "
  },
  {
   "time": "oral",
   "amount": "Unknown",
   "administration": "(pill / tablet)",
   "substance": "T+ 0:00"
  },
  {
   "time": "repeated",
   "amount": "insufflated",
   "administration": "4-Methylmethcathinone",
   "substance": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": "1 ",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "(pill / tablet)",
   "amount": "T+ 0:00",
   "administration": "1/3 ",
   "substance": "oral"
  },
  {
   "time": "MDMA",
   "amount": "(pill / tablet)",
   "administration": "T+ 24:00",
   "substance": "repeated"
  },
  {
   "time": "insufflated",
   "amount": "4-Methylmethcathinone",
   "administration": "(powder / crystals)",
   "substance": "T+ 0:00"
  },
  {
   "time": "0",
   "amount": "smoked",
   "administration": "Cannabis"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0",
   "amount": "T+ 0:00"
  },
  {
   "time": "MDMA",
   "administration": "T+ 0:00"
  }
 ],
 "report": [
  "Jaw Clenching:",
  "I didn't take the 4-mmc with the intention of writing a good or accurate report. What I'm writing is an overview of how the drugs were taken, and more importantly the after effects and for how long the after effects persisted. With research chemicals I feel it's important to get information to others of what side effects are present, as little is known about these drugs.",
  "On Thursday evening I picked up 2 grams of 4-mmc (4-methylmethcathinone) which a friend had a supply of. I began drinking alcohol just before taking a bomber of 200mg of 4-mmc. Before that evening I had taken 4-mmc in small lines on 3 prior occasions. Bombing the drug had far more effect. Definitely has tones of both a stimulant and euphoriant. Although I've not tried crystal meth, this is the crystal meth of the cathinone based stimulant class. I love the stuff anyway, it's great. Lots of other people turned up and we had a spontaneous party, drank alcohol snorted vast quantities of 4-mmc and took pills. I took 3 and a third pills over the night. Two of them were supposedly a weak mixture of speed and tmfpp, and I honestly felt nothing compared to the 4-mmc which overpowered the other stimulants effects. By the end of the night I had probably snorted 300mg of 4-mmc.",
  "The other pill was strong mdma, which I definitely felt. It was an amazing night and it was the first time I had taken mdma in roughly 6 months so it hit me hard. I felt all the expected connections with everyone and shared much of my 4-mmc. In return on the comedown I was given another third of a pill. The mdma made the comedown initially not too bad, but I felt terrible when the mdma wore off. I felt ill for hours and continued to jaw clench and need to chew.",
  "I then went to another friends birthday party the next day and smoked pot and drank beer and I felt better. I had hardly any appetite but ate as much as I could, because I knew I needed food. After the party another friend and his flatmate returned to their flat with me, and we took more 4-mmc, I then consumed probably three to four hundred milligrams of the drug. My friends took a little more and thought it was amazing. We also all took a little mdma. I tried ketamine in powdered form for the first time. I only took enough to make me feel floaty though, because my friend had a little, although I had been drinking a lot and it made me feel a little sick. I then started to come down from the 4-mmc and it was worse than the last one. I then managed to get a lot of sleep. I forced food down myself as well, I had no appetite at all. Upon waking I felt a little rough, but not too bad. By the end of the night I felt fine. There was only one thing however, I kept wanting to move my tongue and chew. I kept clenching my jaw and running my teeth around my mouth. This persisted for 3 days. A friend also reported that they had jaw clenching for days after.",
  "Today (6 days after the first day on 4-mmc) a friend phoned me and thanked me for sending mail to him that had incorrectly arrived at my house. I have almost no recollection of this event, but I think I done it on the first comedown on the first night. I think I remember the whole nights, but that comedown for some reason is a little bit of a blank. Although now have a vague suspicion I even phoned him and asked him for his address, because I phoned a lot of people on the comedown. I have the feeling maybe the small amount of speed was still making me do things.",
  "Persistent jaw clenching did not occur the other times I took 4-mmc in small doses and without mdma. I am not sure whether persistent jaw clenching would occur at high doses of 4-mmc without mdma or not, but I have never had such persistent jaw clenching with mdma. Any persistent jaw clenching from mdma I have had, have only been in sporadic events, such as when I got excited. The need to chew and clench was almost constant for two days.",
  "In case anyone wants to know, my background is having smoked a lot of pot all the time, and experimenting with most things except crack and heroin. I've done psychedelics perhaps 5 to 10 times, and have taken pills maybe 20 or more occasions, but each time had several repeated doses. I have experimented a little with speed and coke. I've also taken painkillers and diazepam, but not to excess.",
  "The Point of this Report:",
  "If you are susceptible to jaw clenching 4-mmc may well cause a little persistent jaw clenching and might affect the memory of when you were coming off the drug. I would be interested to hear if other psychonauts have the same after effects on only 4-mmc and without the myriad of others I took.",
  "[Reported Dose of 4-Methylmethcathinone: 800mg to 1000mg]"
 ],
 "erowid": {
  "id": "77470",
  "citation": " TeuchterLoon. \"Persistent Jaw Clenching: experience with 4-Methylmethcathinone, MDMA & Various (ID 77470)\". Erowid.org. Nov 22, 2009. erowid.org/exp/77470",
  "substance": "4-Methylmethcathinone, MDMA & Various",
  "views": "10603"
 }
}
