{
 "id": 12350,
 "title": "Losing My Ability to Calm Down",
 "date": {
  "submission": "2010-02-21T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pretentions",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "5"
   },
   "administration": "oral",
   "substance": "Aripiprazole",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "tablets",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Lorazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I had been on Lithium for two years for treatment of bipolar disorder/drug addiction.  About one year ago, I got off all of my pharms and was drug free for a year with the exception of a few drinks here and there. ",
  "I spent a long time lifting alot of weights, doing alot of college classes, and working part time.  My life was in balance.  I had a regular diet, could run fast, far, lift alot, was getting stratight A's in college, and I was drug free.  At one point, while lifting weights, I came to realize that when I was in high school, all of my 'friends' were druggie losers and how would it be fair to them if I became such a success. ",
  "I started hearing voices in my head.  People that I went to high school with talking to each other 'Did he really get sober?', 'Why does he deserve to be so tough', 'I thought we all knew that he snorts amphetamines', 'Oh, that guy snorts amphetamines, that's why he is so tough.' It was driving me crazy, I know I am sober, I don't know what the hell these people in my head are thinking.  They must be insane.  I'll keep lifting and doing my work, soon, someday I'll be a success.",
  "The voices never stopped, they just got to a point where they were affecting me and indirectly affecting everyone else.  All I wanted to do was crush the people in my head.  See their teeth get broken and their faces look like a bloody asshole.  I decided that in my shape, I would absolutely kill somebody.  I decided that this was not safe and went to see my doctor.",
  "My doctor said try Abilify.  He said he knew I didn't like to be on medicine so he wrote me a script for 5 mg.  I filled it last night and took one pill at 8 p.m.  At about 9 p.m. I start to feel the affects.  My thinking is alot more linear, but somehow dampened.  I don't like it.  I take a shower and jack off.  Wow, that felt good. ",
  "I decide to go to sleep.  As soon as I lay down and try to get some sleep, I start getting heart palpaltations.  I can see my thoughts.  The shadows in my room look like satan as well as the shadows outside of my window.  I look over at the picture my mother has of my hanging on my wall.  It looks like the face of a demon in the dark.  I immediately go up and tell my parents that the medication is having a really bad effect.  My mother gave me 2 ativans (Lorazepam) and I went back to sleep.",
  "I kind of like the voices in my head better than this psycho medication.  I don't like drugs and more importantly, I don't like pharmeceuticals.  I am going to, once again, live drug free."
 ],
 "erowid": {
  "id": "77422",
  "citation": " Pretentions. \"Losing My Ability to Calm Down: experience with Endogenous (Bipolar/Psychosis), Aripiprazole (Abilify) & Lorazepam (Ativan) (ID 77422)\". Erowid.org. Feb 21, 2010. erowid.org/exp/77422",
  "substance": "Endogenous (Bipolar/Psychosis), Aripiprazole (Abilify) & Lorazepam (Ativan)",
  "views": "9099"
 }
}
