{
 "title": "First Foxy Fun",
 "author": "Miraj",
 "citation": " Miraj. \"First Foxy Fun: experience with 5-MeO-DiPT (ID 12360)\". Erowid.org. Feb 11, 2002. erowid.org/exp/12360",
 "substance": "5-MeO-DiPT",
 "bodyweight": "155 lb",
 "report": "<p>After extensive research on the matter, I acquired a gram of Foxy and took it to my friend's house to use his miligram scale and cap it out. Another friend of mine went with me as he was interested in the substance after learning about it from me. After we finished capping it, we each decided to try a 12mg capsule. Knowing the possibility that we would give into temptation, I hadn't eaten all day as a precaution just in case we did decide to try it. My expererience was incredible!</p><p>Immediately after swallowing the capsule, friend A and I decided to go to the store nearby and purchase some glowsticks. Almost as soon as I went out the door I felt energized and a little anxious as I was anticipating the drug's first effects. As it turned out the store was closed, so we headed back the the apartment. It was real cold outside so maybe the transition from cold to warm had something to do with it but when I walked in the door I felt the drug hit me. 20 minutes after taking the capsule I felt myself coming up...fast.</p><p>At first I felt extremely stoned. Everything seemed extremely foggy and I felt very numb, but I was perfectly coherent. I got an incredible...and I mean INCREDIBLE body high...everything felt awesome! By the one hour mark I was getting serious psychadelic visuals. Patterns everywhere, extremely long tracers, even some mild hallucinations. Everything was breathing and moving, it was intense!</p><p>These effects lasted a good 5 hours, at which I gradually started coming down. This process lasted an additional 4 hours as the drug slowly abated. After the visuals subsided somewhat I basically felt like I was rolling on ecstacy with lots of energy, dilated pupils, a lovely body high, and a very nice mental state. Overall the experience can best be described as a strong strong mushroom trip with MDMA-like components, especially after the visuals subsided.</p><p>I will definately be trying this stuff again, and will keep you all appraised of future experiences. It is very important not to eat before taking this drug, my friends had much much less pleasant experiences and I think it mostly had to do with this fact. I was amazed at how small a dose it took to have me tripping hard. As my friend put it, I was 'flying all night'.</p>",
 "year": "2002",
 "id": "12360",
 "gender": "Male",
 "timestamp": "2002-02-11T08:00:00.000Z",
 "views": "8105",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "12 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(powder / crystals)"
  }
 ]
}
