{
 "id": 12361,
 "title": "Everything Contained Everything",
 "date": {
  "submission": "2009-04-16T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Psyclic",
  "gender": "Male",
  "weight": 74
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Products - Smoking Blends - Cannabis-Like"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "1 bowl",
   "substance": "smoked"
  }
 ],
 "report": [
  "I smoked 10x salvia for the first time and wow, that stuff is mind-blowingly insane! I did not have any previous exposure to psychedelic compounds, but I did have two sitters present. I had smoked a couple bowls of Sence (some legal blend with synthetic compounds, and prolly maoi's judging by what it did to the salvia) prior to smoking the salvia.",
  "30 seconds in, I felt the most insane vision twisting motion I have ever felt. 'Screenshots' of my entire field of vision were all turning left. A couple minutes later I fell off the chair, and that's when the trip really began.",
  "From then on I was supposedly laughing my ass off. I was rolling around on the floor, knocking things over, and I had a strong feeling that everything was a dream. For a while I was thinking, 'I must be lucid dreaming'.",
  "It then begun to occur to me that everything was in fact happening in real life, and I really was acting like a complete idiot. I started to think that 'everything is everything in everything'. I kept repeating this phrase throughout my trip to my sitters and tried to show practical examples to explain it better (a bunch of raspberries with raspberries surrounding it, blablabla). I felt like I had lived everything; I had lived everything that can possibly be lived.",
  "Basically, the trip was insane. I do NOT want to smoke anything higher than 10x, because 10x alone was quite frightening. I can't imagine what a higher extract would be like."
 ],
 "erowid": {
  "id": "77513",
  "citation": " Psyclic. \"Everything Contained Everything: experience with Salvia divinorum and Smoking Blend (Sence) (ID 77513)\". Erowid.org. Apr 16, 2009. erowid.org/exp/77513",
  "substance": "Salvia divinorum and Smoking Blend (Sence)",
  "views": "5400"
 }
}
