{
 "id": 12374,
 "title": "Used to be Fun, Now I'm a Paranoid Freak",
 "date": {
  "submission": "2000-08-04T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "K",
  "weight": 52
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "First time I took it I liked it, but it wasn't too intense. The more I used, the more enjoyable it became. I could talk and talk and talk... And, God, play yahtzee and rummy til the wee hours. Crosswords became particularly addicitve. I would play solitare on the computer until I was cross-eyed. Everything was so damn interesting. Everybody you did it with was your best friend, reminded me of old sleep-over parties when I was nine years old, shared secrets, and life was still amazing.",
  "I don't know when it changed. I became a more regular user, and then I would start to get shaky and really wired. I would start thinking that my mom was going to come over unexpectedly to say hi and catch me doing it. I would start looking out the peephole and listening for strange noises. I would see things, like when you were a kid and were convinced that strange, distorted shadows were monsters, only I thought it was someone just dropping by. Then I started worrying about people breaking in, especially if I had watched the evening news and heard horrible crime stories. At one point I sat on the floor and turned off all the lights. It was really sick. But I still found the courage to turn on the lights and quickly cut up another line. I bought freaking pepper spray and kept in nearby. It was NOT fun anymore. But I am still using. My boyfriend tells me to chill out while he sits there and plays on the computer. The only way I ever do it anymore is if I drink or take valium while I do it. Then it's fun again.",
  "I don't know what happened to my body chemistry that created this paranoia. I remember reading about a guy who thought people where after him from inside the T.V... Can you imagine? But I wasn't much better. I won't party with anyone anyone anymore cause I know they will think I'm wacko when I start to get quiet while everyone else is 'going' and having fun. I have to force myself to drink when I do coke because I forget, and that's when I have problems. Steady flow of alcohol, though, and it's like old times. I don't get that locked-up feeling.",
  "Can you imagine being so wired you think you're developing blood clots in your legs or you're about to have a stroke? And still wanting more when it runs out?",
  "Maybe I'm just doing some really good coke! It's also occured to me that it might be cut with crank (speed), which I react badly to. I think I also need some really good vodka to go with the really good coke. So there's my story. I hope none of you can get my name and address from this post and come and GET me. Ha ha. I think."
 ],
 "erowid": {
  "id": "776",
  "citation": " K. \"Used to be Fun, Now I'm a Paranoid Freak: experience with Cocaine (ID 776)\". Erowid.org. Aug 4, 2000. erowid.org/exp/776",
  "substance": "Cocaine",
  "views": "64139"
 }
}
