{
 "title": "My Fate",
 "author": "Mark",
 "citation": " Mark. \"My Fate: experience with Cannabis (ID 12374)\". Erowid.org. Nov 19, 2004. erowid.org/exp/12374",
 "substance": "Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>I first tried pot in November 2000 when I was 15. I had taken a trip with two of my friends to New York City and came across the opportunity to buy a 50-piece. We smoked it upon our arrival back at my house. Although one of my friends, Jaime, was a somewhat experienced smoker, myself and my other friend Bob had never smoked before, and of course, we didn't get very high for this reason. I remember accepting this with the hope of getting high in the ensuing smoking sessions.</p><p>We split up the pot amongst ourselves and went our separate ways. Myself and my inexperienced friend Bob became smoking buddies and after finally getting high our third time off of the last of our New York weed, we pooled our money to buy an eighth from our dealer friend John. Being the naive and grateful amateurs that we were, Bob and I paid sixty dollars for this rather large eighth of low potency weed. This batch lasted us quite some time, and when we finished it, we bought more.</p><p>I was ripped off for an 'eighth' (which was really more like a gram) of apparently extremely potent weed. Bob and I made a trip to the woods later on that week and got high. About this time, parents got involved. One evening, Bob called me and told me that he had been confronted by his parents. He told me that they told him that they knew he had been smoking with another person. Bob irresponsibly panicked and ratted me out, telling his parents everything. His parents grounded him for the rest of the year and told him that they had obligations to other parents, which implied that they would tell my parents.</p><p>About a week later, Bob's parents called my parents. What followed was a heated discussion with my parents that precipitated my mental condition to today. There was the obvious yelling and such, but what made the confrontation especially significant was my father's revealing to me the fact that there was a history of mental illness in his side of the family, and that my uncle was a schizophrenic who had dabbled in marijuana and alcohol at an early age, much like myself. I had previously been unaware of this fact.</p><p>Initially, I was somewhat apathetic of my new revelation, but in ensuing days, I began to think anxiously about my future. I wrangled with myself over ideas such as the notion that damage had already been done, and that I was destined to acquire schizophrenia. My parents temporarily put my fears to rest by reassuring me that If the damage had already been done, I would have acquired schizophrenia already, and that I would probably not become schizophrenic if I simply stayed cautious. For the next several months, I debated my own notions with those of my parents and other external resources, and all the while, I was under constant pressure to smoke with my friends who continued to do so. This was the beginning of my mental instability.</p><p>My mental instability worsened when my idea that I was in danger of mental illness was paired with the idea that perhaps I had lost my intelligence or caused brain damage, which is an idea that I now know is scientifically irrational, but which continues to plague me for some reason. My most vivid memories of this are from when I took a trip to France with my parents and visited the Louvre -- I remember being dumfounded at my apparent inability to process the significance of a work of art that I had once had. Of course, this is largely due to my paranoid ideas. In any case, my fears of mental illness and loss of intelligence continued and occassionally worsened after the trip. I began to realize that my condition had to do with what my mom calls a 'self-ordained prophecy' -- that my fears will come true if I keep thinking they will; that I will become insane by thinking that I am insane. This idea sums up my mental condition to today.</p><p>Throughout the next couple of months and the summer of 2001, I abstained from marijuana for the most part, and visited a psychologist who helped identify my problems, but did not help me solve them. I spent the entire summer in mental confusion, self-doubt, anxiety, and depression. Finally, after several months of sobriety, I smoked for the first time, mostly with stoner friends I had previously not been associated with. I used a water bong for the first time as well. This took place right before the beginning of the 2001-2002 school year.</p><p>I spent my life in school and at home fluctuating on a daily basis between optimistic and pessimistic thoughts, happy and sad thoughts, disturbing and comforting thoughts, and caring and indifferent thoughts. I was, and continue to be a double-sided person who wallowed in his own self-doubt and mental angst. Although once or twice I flirted with suicide, it was never a truly driving force in my processes.</p><p>For the next series of months in the school year (in which I am currently in), I inermittently smoked pot with a variety of friends ranging from my friend Jaime (who had first introduced me to the drug) and his friends to my closest friends, Tim and Matt. Bob, having partially ruined my life alienated himself from me despite the fact that I forgave him. My smoking escapades were largely influenced by my cumulative realization of the evidence against marijuana's connection to mental illness and intellectual dissipation. This evidence was provided by several sources including select documents from textbooks, the words of my scientifically knowledgeable friend Matt and the med-school seasoned parents of my friend Tim, and my general acceptance of fate and the idea that 'you only live once.'</p><p>I got heavy into pot, and as early as two weeks before writing this, I was smoking three times a day, even in school. I have not been caught yet. I was getting along fine until one weekend, when I smoked with a new crowd on Friday, Saturday, and Sunday. While the experience was fun and similar to all the previous times I had gotten high (cotton mouth, laughing, silliness, body wartmth, timelessness, etc.), I felt strangely uneasy, self-conscious, anxious, and bored. This can probably be partially attributed to the fact that it was a new crowd, but it was alarming, and was an incentive for me to either start thinking about my mind in the flawed and paranoid way that I used to, or to start smoking more to prove to myself that I enjoy the drug as much as I used to and that it is the same friend that I have always come back to. Meanwhile, I sit here torturing myself over my fate and my mental competency the way I always have. Will I self-ordain my own grim prophecy? Will I go mad? Will I be permanently flawed? Will my family's legacy live through me?</p><p>These are my issues, and I continue to painfully wonder about them.</p>",
 "year": "2002",
 "id": "12374",
 "gender": "Male",
 "timestamp": "2004-11-19T08:00:00.000Z",
 "views": "5418",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ]
}
