{
 "id": 12378,
 "title": "High Like Towlie Part 2",
 "date": {
  "submission": "2010-03-22T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "The Mayor",
  "gender": "Male",
  "weight": "280 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "4mg repeated",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "(daily)"
  }
 ],
 "report": [
  "High Like Towlie Pt.2",
  "\tI had wrote a trip report on the research chemical JWH-018 and I would like to follow up after over a month of switching from a heavy and habitual marijuana smoker to a researcher of this most interesting chemical.",
  "    First off the chemical at 98% pure is an off-white and slightly creamy yellow colored powder and at 99% it is a white powder.  There is no level of purity that makes it rust colored lump and those injesting that are not doing the pure unadulterated chemical, I cannot stress this enough.",
  "    There was no taste to this chemical, it is only slightly what you could call a chemical taste.  Nothing unpleasant and nothing pleasant. ",
  "Directly after smoking I get a rush, during it my eyes dont adjust to light the way they normally do its kinda crazy and enjoyable.  Within 1-1.5 minutes I should be stoned and I will continue to get higher for about 30-45 minutes after the cresendo I come down for about as long as I went up. So expected high should last for 1.5 to 2.5 hours depending on what you consider high.",
  "\tI have been smoking this substance daily for over a month.  I can switch from marijuana with no hesitancy.  It has always delivered a consistant and impressive high that has no discernable difference from high-grade marijauna. With this said I have been able to observe only a couple side effects and they were very mild.  One is what some people call the 'psycadelic effects'  This affect of the effect (ya like that?) is due to dialation of the pupils that does not allow my eyes to adjust to light and may lead to tracers.  It is all in pupil dialation and does not mean I am tripping.  I have also noted a mild sore throat that comes and goes never getting to the point of being painful.  I have had no headaches or diarreah.",
  "\tLets get to a story.  I smoked appx. 5mg and so did a friend.  The friend was not a marijuana smoker and he was drunk at the time.  Using a vaporization pipe (bubble, or meth pipe as they are known)  He took it all in one hit.  He acted very stoned for 15-20 minutes.  Then he started pacing around his house saying 'I just need to walk around'  I observed him walk up and down the hallway several times and then he made a break for the door.  There was snow standing about 8-10 inches on the ground and he proceeded to get on all fours in the middle of the snow and rubbed snow in his face half the time and the other half he just was on all fours. The temperature was aout 20 degrees outside with a wind.  I told him repeatedly and very sternly to get his 'MF'n A' inside.  It took him 15 minutes to come inside while I couldnt stand it in the doorway yelling at him, I cant stress how cold it was.  He got inside and everything was cool.  From knowing what I do about psychological and medical conditions what had occured was a panic attack.  I tried to stay calm while watching him freak out by referencing what I had seen people do under the effects of marijuana. Ya know when someone gets too stoned and has to go",
  "lay down either due to low tolereance or inexperience.  He sings this song ever since 'Ill never smoke chems with the Mayor again, my night was all over before it began.'",
  "\tThat was the only panic attack I have noted with people that I have smoked it with.  I have smoked it with about 20 people all of them to rave reviews.  I have noticed that alcohol overcomes the high and drunk people dont really get high.",
  "\tI keep my doses between 3-5mg and for 1st timers between 1-2.  My dose consistantly get me too high to surf the internet rather I just stare at the screen for a half hour.  Tolerance isnt much of an issue although there is a slight tolerance that builds up, but as another psychonaut reported it hits a plateu.",
  "\tMy pipe that I use typically burns everything away, you can typically only see an outline where the powder was.  Once a flame is held to it it instantly turns into a liquid and begins to smoke. After a pipe has been used frequently the inside",
  "of the stem becomes frosted, it even appears in little circles like frost, until the entire inside is frosted.  If you take that frost and scrape it out it is the same powder you started with (not the recommended way to recycle) even the same color.",
  "The best way to recylce it when you are out is to hold a hot flame to (starting with)the part where you put your lips and melt the frost into a liquid that goes back down into the pipe as you move down the stem. ",
  "\tAnother thing that I thought was odd/cool was that I had broke a pipe and what I thought were vaporized droplets of the liquid and I touch it and its not a liquid it is more like a polymer, so I would assume that the liquid you think you see when it is at a room temperature is not liquid at all.  It is so visually decieving I thought that was worth mentioning.",
  "\tIn closing i knew at some point i would quit marijuana but i had no idea I would still get high. this stuff is something else.  Other cannibinoid antagonists like 073, dont hold a candle to sustainable usage and low dosage.  While we dont know the longer term effects, that is true for many of the designer drugs that have popped up in the last few years and I would like to submit what I know about this strange and new drug JWH-018.",
  "The Mayor"
 ],
 "erowid": {
  "id": "77630",
  "citation": " The Mayor. \"High Like Towlie Part 2: experience with JWH-018 (ID 77630)\". Erowid.org. Mar 22, 2010. erowid.org/exp/77630",
  "substance": "JWH-018",
  "views": "9333"
 }
}
