{
 "id": 12386,
 "title": "A Night of Bliss",
 "date": {
  "submission": "2009-08-22T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Queenslander",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30",
    "grams": 0.03
   },
   "administration": "IV",
   "substance": "2C-C"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50",
    "grams": 0.05
   },
   "administration": "IV",
   "substance": "MDMA"
  }
 ],
 "report": [
  "My brother sent me crystalic material which was purportely MDMA, although we later started to suspect that it was actually MDE because of its milder, less empathogenic effect. I was interested to try this in a combination with 2C-C using intravenous injection, my preferred method of application. My brother reported an unbearably heavy body load with 2C-C; however, my own experience was rather different. I have injected 30mg of 2C-C and 50mg of the crystallic MDMA (or MDE), intravenously, to the following effect:",
  "+20 seconds:",
  "Strong 2C-C rush, with somewhat sexual undertones. However within seconds I was hallucinating too much to hold it together; my attention wondered towards the colours swirling around (I was in semi-darkness) and the forms & shapes that swam in and out of existence. The auditory hals were pretty strong too; I had to convince myself there was no-one talking in the next room, as this 'person' sounded very realistic - even though I could not work out what she (for it was a she) was saying. I had to lie down to relax and pull myself together.",
  "+40 seconds (or thereabouts):",
  "The MDMA/MDE has hit. My toes and fingers started to feel cold, but overall I was feeling warm and comfortable. In contrast to normal MDMA-only experience, there was no urge to talk or to be with anyone. The world was all in my room, there was nobody else there, and, best of all, I did not need anyone. I felt *very* relaxed and contented. In fact, I almost felt sleepy.",
  "The closest I have got to this particular feeling was on opiates. Warm, happy, not giving a fuck about anything at all. However this experience differed somewhat, as I was still hallucinating rather strongly - but in  a very relaxed way; like I was just an unconcerned observer.",
  "+10 minutes:",
  "The initial intensity has worn off and now I was just resting. I was still hallucinating very strongly, but I was so relaxed I felt I'd go to sleep soon! Everything was a little blurred and there were shapes dancing around the room, but I was nicely warm, comfortable and could not give a damn about anything at all.",
  "+25 minutes:",
  "I went to bed. I sort of felt like it'd be nice to have sex, but it was along the lines of 'take it or leave it'. My wife was already asleep, so I just lied there until I fell asleep some unspecified time later.",
  "I felt as good as new in the morning - in fact, we got up at 7 and did a 10km run!"
 ],
 "erowid": {
  "id": "77687",
  "citation": " Queenslander. \"A Night of Bliss: experience with 2C-C & MDMA (ID 77687)\". Erowid.org. Aug 22, 2009. erowid.org/exp/77687",
  "substance": "2C-C & MDMA",
  "views": "5684"
 }
}
