{
 "title": "An Icy Hand Reaching Into My Chest",
 "author": "NaTaS",
 "citation": " NaTaS. \"An Icy Hand Reaching Into My Chest: experience with DXM (with CPM) (ID 12397)\". Erowid.org. Feb 12, 2002. erowid.org/exp/12397",
 "substance": "DXM (with CPM)",
 "bodyweight": "140 lb",
 "report": [
  "<p>[Erowid Warning: Most Coricidin contains CPM (Chlorpheniramine Maleate) which can be dangerous in high doses. See DXM Brand Warnings for more info.]",
  "My friend blaine once told me about coricidin, and how you could really trip on it. I though, 'cool, I'll try it', and he came over one day and we walked to Rite Aid and bought two boxes, one for each of us.",
  "After returning home, we each had a box, 15 pills, and left for Adam's. There, we sat around with a few friends who were all clean and me and Blaine started our trip.",
  "It started with a light bodybuzz, like after you stand up after sitting down for a while. That was ok, but I wanted something heavier. I don't know when it hit full on, because it hit me faster than Dale Earnhardt at the Daytona 500. I passed out for a second, and then woke up, I asked Blainer if he was feeloing this too, and he said yes.My vision kept tunneling out, like in cartoons. my stomach was upset, and my pupils were extremely dilated. I kept losing my vision, and my hearing. Not much later my legs got light and jellowey, and i couldn't walk without the assistance of my friend Mike. My life flashed before my eyes, and I babbled on about dying and thought I was gonna die right then and there.",
  "I was loosing my mind, and I called my mom for a ride home. She told me to start walking, so I said ok. I called her 15 minutews later, forgetting I called her 15 minutes ago, and once again, asked her for a ride home. She knew I was on something and picked up me and Blaine and took us home. All the while, I was expierencing hell, passing out every 2-3 minutes, and an icy hand reaching into my chest, ripping out my soul. I fell asleep at home for maybe an hour, and then Blaine and I were taken to the hospital. I had to get my somach pumped. Let me say that's the worst thing that could have happened to me. Coricidin was hell, pure hell.</p>"
 ],
 "year": "2000",
 "id": "12397",
 "gender": "Male",
 "views": "19953",
 "dose": [
  {
   "time": "0",
   "amount": "15 tablets",
   "administration": "oral",
   "substance": "DXM",
   "form": "(pill / tablet)"
  }
 ],
 "submissionDate": "2002-02-12T08:00:00.000Z"
}
