{
 "id": 12403,
 "title": "False Positive Urine Screen",
 "date": {
  "submission": "2009-03-25T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "NHB",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(daily)"
  }
 ],
 "report": [
  "I have been on a methadone clinic for the past nine years. It took me a few years to stop using heroin. My only remaining problem was chronic insomnia. My primary MD and I tried various types of sedatives and found the side effects to be worse than the insomnia itself. The only thing that consistently works with the least amount of side effects is Benadryl (diphenhydramine). However for some reason it always gives me a false positive benzodiazepine result on my bi-monthly urine drug screens. This is leading to a forced detox of methadone due to state and federal regulations.",
  "---------------------------------------------",
  "Sep 30, 2010 ADDENDUM",
  "On March 25, 2009 I first reported that I was getting false positive benzodiazepine urine results at the methadone clinic where I have been a client for the past 10 years. Here it is more than a year and a half later and I still am not any closer to getting an answer as to why I am continuing to have these results. I know that drug addicts are notoriously less than forthcoming with the truth but I can assure everyone that other than benadryl and duragesic [fentanyl] patches for chronic pain due to the 36 kidney stones I have had over the past 16 years I don't use anything else. My usual dose of Benadryl is somewhere around 600 to 700mg a night. I hope someone out there can help me as it is driving me absolutely crazy."
 ],
 "erowid": {
  "id": "77774",
  "citation": " NHB. \"False Positive Urine Screen: experience with Diphenhydramine & Urine Screening (ID 77774)\". Erowid.org. Mar 25, 2009. erowid.org/exp/77774",
  "substance": "Diphenhydramine & Urine Screening",
  "views": "11757"
 }
}
