{
 "id": 12417,
 "title": "Not Pot",
 "date": {
  "submission": "2009-05-30T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Door King",
  "gender": "Male",
  "weight": "195 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  },
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "<p>I ordered some Spice Gold from the U.K. I knew from the first puff that I was on to something, but what Im not sure. Im 65, and dont smoke much pot simply because its not that available here, and when I do have it, I dont get much done.",
  "Anyway, Spice had some amazing pot-like affects on me. Most noticeable was an uncontrollable urge to play the guitar. In the first hour, I wrote a new song, which is holding up pretty well. Pot always made playing more enjoyable, but this stuff seemed to have a much stronger affect. It made me musically whacko. I couldnt stop rhyming. It made me into a bloody genius, if you want to know the truth, and the one hit I took kept right on going for three or four hours. My mouth got very dry and nasty, and I got the mega munchies. Exhausted, I lay in the bathtub, and fell into what I can only describe as an opium dream. Pot almost always suppresses my dreams. Im not sure Spice is worth it; I was strung out the next day.",
  "Ive smoked it two or three times since, and it always produces reliable musical results, which I have trouble shutting down: Sample rhyme: The great explorer, so excited that hed found, the fountain of youth, fell in and drowned. I mean my brain was spewing out billions of these. I tried three puffs the last time, and it was at least eight hours before I calmed down enough to sleep. When I shut my eyes, I could see a pattern typical of psychedelics I have tried before. And I was strung out all the next day; not painfully, but I felt spacey and tired.",
  "Age has brought less recuperative powers and a greater sensitivity, so maybe thats it.  Ill probably do it again. The music it helps me make is just too damned good to resist, even if I do feel like my brain has been hooked up to a light outlet. I mean, it just hums, and wont shut up. Im going to try to limit use to just a puff, and only once or twice a month though. I mean, you really have to want to play to take a puff of this stuff.",
  "P.S. The stuff makes this old dog randy, too.</p>"
 ],
 "erowid": {
  "id": "77867",
  "citation": " Door King. \"Not Pot: experience with Spice Product ('Gold') (ID 77867)\". Erowid.org. May 30, 2009. erowid.org/exp/77867",
  "substance": "Spice Product ('Gold')",
  "views": "23163"
 }
}
