{
 "id": 12415,
 "title": "Goodbye reality, hello Sigma",
 "date": {
  "submission": "2001-07-01T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Peter",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": " T+ 0:30",
   "amount": "350 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(capsule)"
  },
  {
   "time": " T+ 3:00",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  },
  {
   "time": " T+ 3:00",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I'd like to share a _very_ intense experience i had yesterday whilst experimenting (quite heavily, i might add) with DXM. Around 3 months ago, i'd pursued research into usage of DXM, especially into one state of consciousness known on the DXM faq as 'Plateau Sigma'. This seemed to be a very delusional and unpleasant state, but I was adiment that I would pursue it, just to see if I (a self named, and externally named subgenius) could control my mind, psyche and consciousness whilst in this state.",
  "Here's how I dosed (note: i didn't follow the faq):",
  "T+00h: ingested 500mg white (foul tasting) powder in vodka (1 shot)",
  "waited awhile. after around 30min i felt first effects, at which time I took a gelcap containing 350mg more dxm. i took another dose later, but i'll get to that in a minute",
  "I sat on my sofa in my room, having the odd cigartette and playing with my guitar (btw,  this is very satisfying in conjunction with cannabis). at roughly the 3hr point, i snapped out of my guitar / cigarette trance, realising that i was struming away absolute bullcrap instead of trying to perfect 'riders on the storm'. fair enough. the world around me after this trance was so utterly alien it's really impossible to describe.",
  "Imagine this: i'm around 10 inches tall, with really long legs and the room around me is the size of what literally seems like the Sydney opera house. in front of me is a coffee table, which although was right in ront of me seemed quite far away. I had the sensation that there was now no wall or sofa behind me and that at any given moment i could fall into nothingness, so i had to constantly check. there was nothing outside this little world i was in at the moment, reality beyond the room seemed incomprehensible and all that was there was what i thought was infinity. space and time, and even life itself would disappear in a nanosecond were i to leave this room. thanatos at my door, and a black hole behind me, how comforting. then i realised that my thoughts were completely delusional, so i snapped out of it and looked around again. still the same, but this time i realised it was my room and i was safe there. ok.",
  "i'd prepared one final dose for myself on my bedside table, as another vodka shot (650mg DXM), and a paracetamol lying next to it (thoughts become more delusional as body temp rises) so down that went and i lay on my bed for a while. i sort of dozed off, & went to a world of mine which i keep in my mind for psychedelic trips. i was there, the place was vast & white, full of buildings, the floor a conveyor belt of geometric patterns and the sky a green entrance to the infinity. my quest this time was simply to explore as far as i could before awakening. i had the advantage over the world this time. my body needed no control and i had neither the inhibitions of emotion or pain.",
  "Turning the corner i encountered what i thought was the god-entity. this, i thought was the entity ruling absolutely over the different realities and as such had unquestionnable power over me, my life and everything, everywhere. darkness came and went, different realities passed - planets were brought to me and disappeared just as quickly, full of different ecosystems, different florae and faunae, culture and religion. just as i got a glimpse into a new and wonderful world, another would appear, equally as intriguing. i now had no body, no soul and no attributes to my name. i was powerless to go forward from this point and my only choice was to observe what was happening around me.",
  "My vision skipped and i was back to my bedroom. i looked at myself, then struggled to see the time on the clock. 1pm, four and a half hours since first ingestion. that meant, to my relief that I'd come back to what was my world, the world I was comfortable and familiar with. no, that was wrong. I looked out of my window. everything was different, the trees outside, the neighbourhood and people i saw were all monstrous. these realities i had seen were now combined, and no matter how i tried to bring myself back to reality, it stayed the same. oh crap. i broke down in tears, thinking the world would stay like that, and i'd be trapped with monsters, my emotions and my personality consumed by this god-entity. whereas i was a god of my own inner reality, this one was of far vaster knowlege, and in his eyes i was pathetic, so he took away what was me and replaced it with a dead, roaming soul.",
  "I went back to my bed, and just lay down, drifting in and out of consciousness, thinking ' will i drift like this forever? at least i'm peaceful this way, so i'll stay like this'.",
  "At some point i fell fully into sleep, having very weird dreams, and awoke around 12 hours later, feeling very dry, and very hungry, i just sat on my bed, lit a cigarette and thought about what happened. i felt so glad to be where i was, to be smoking this cig, to be myself once again and that my friends, family and girlfriend were all out there, not knowing this state. I'd been given a new lease of life and wasn't going to abuse it, and to this day i've felt better about the world around me, about myself, and about the people around me. i think it's about as close as i ever got to a near-death experience, and no other drug i've tried has had nearly as profound an effect on me as DXM. but there was a very good and justified reason that dr. Shulgin described this and similar drugs as 'delusional anaesthetics'. beware.",
  "peace to you all, and remember, do not visit plateau sigma. i was stupid to think i could keep myself in a place like that.</p>"
 ],
 "erowid": {
  "id": "7785",
  "citation": " Peter. \"Goodbye reality, hello Sigma: experience with DXM (ID 7785)\". Erowid.org. Jul 1, 2001. erowid.org/exp/7785",
  "substance": "DXM",
  "views": "33939"
 }
}
