{
 "id": 12411,
 "title": "Not in Kansas Anymore",
 "date": {
  "submission": "2001-07-01T07:00:00.000Z",
  "experience": "1978"
 },
 "author": {
  "name": "BadBoo",
  "gender": "Male",
  "weight": "165 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 Tbsp",
   "administration": "oral",
   "substance": "Datura",
   "form": "(seeds)"
  }
 ],
 "report": [
  "My first mistake was using a tablespoon instead of a teaspoon per the directions I had read in some booklet. I lived in Kansas at the time, and found the 'Jimson Weed' which has a stem resembling balsa wood, and green pods that have a few spikes on the outside. Maybe thirty per the golf ball sized pod. I split the pod open and it had a quantity of flat, round seeds reminiscent of apple seeds in the color, and small cucumber seeds per the size and shape perhaps. I washed down the table spoon of seeds with a glass of water, and waited. An hour went by, with no effect, so I smoked a bit, and drank a couple of beers chalking the experience up to",
  "'urban legend'.",
  "I remember glancing towards the bathroom, and seeing 20 or so vividly colored 'coral' snakes pouring out of the drain on the floor. I began to freak. I looked at my stereo speakers on the floor, and through the black mesh fabric cover, I could see what looked like a scene from the movie 'williard' (rats) scurrying from the bottom to the top, to some impossible place beyond. One stopped, looked at me, and urged me to 'c'mon, lets GO!' via hand and body language gesticulations, to escape the snakes in the bathroom, headed my way. I was paralyzed with fear, and stunned beyond belief. I had done a lot of LSD, Mescaline, Microdot, you name it, but no synthetic hallucinogenic had ever been even anything like this.",
  "I remember having an incredible thirst. A friend came over (who tried some also,) and the visions disappeared, and I felt normal again. We drove to town in my car (me driving, like an idiot) and somewhere along the way, got seriously lost. Suddenly, it was nightfall. (I have no idea where the missing 5 or 6 hours were spent) I suddenly discovered I was crawling on the guardrail portion of bridge 70 foot over a river. I remember running through a woods after ripping my shirt off and forcing my way through an electrical fence. (It left marks on my hands and chest) and talking with a horse for about 20 minutes. (It was using ESP to talk to me.)",
  "I saw what I called 'flat rabbits' all over the ground. Imagine a rabbit, run over by a steam roller like in Mad Magazine, but the heads not smashed. The rabbits were staring at me like their tortured condition was my fault. They couldn't move, they just whistled real loud.",
  "I went to my car, and got in the passenger side, and as I tried to shut the door, a snapping turtle attacked me. I fought with it, threw it out the door, and as I slammed the door shut it jumped in, and I smashed it with the door. Turtle guts and blood were everywhere. Then, they weren't, and lucidity returned. I had lost my keys to my car. As I was walking back towards 'civilization' (I was in the middle of nowhere) Reality went on vacation again. The next thing I remember was pulling myself out of a river and walking up to a house. (I was a competition swimmer my whole childhood, so this would not have been a big feat when not under the influence)",
  "Somewhere along the lines, my friend showed up again, and we went to the first house we saw. We started throwing stuff from his front yard into the back of his pick up truck. (Like a metal tractor wheel, huge rocks) I don't know why, but at the time it seemed pretty important. I woke the owner of the house up three times, thinking I was at my bosses house. (Hey, is so-and-so here?) oh, sorry... (I just walked right in...)",
  "Finally the police came, they figured I was drunk, and now, a full 17 hours into the trip, I was getting longer and longer bouts of lucidity which helped me say things that made some type of sense) He called a tow truck for me to get my car, which amazingly I was able to describe where it was) and the cop drove me home, with me, all the while mashing my imaginary gas and brake pedals as he drove home with me in the passenger seat.",
  "The next day, I could barely see. My vision was completely blurred, and I was unable to focus at all. It took a couple days before my vision returned to normal.",
  "My recommendation on Jimson Weed if you want to get high, and want to do a real trip full of hallucinations, is to definitely stay away from anything based on belladonna. (In other words, this is a definite DON'T TRY THIS PERIOD) I have never done it since (I am 42 now) and never will again. It wasn't cool, it wasn't fun. I was 100% out of control, and ANYTHING could have happened that I would have had to live with the rest of my life. Anything, could have happened. In my misspent youth, I did every drug known to mankind in those days, and that is one, I would not ever touch again.  (Same with PCP, real dangerous, out of control stuff, when the dosage and purity is high enough.",
  "If your considering trying Jimson Weed, please read this very short informative page:\r http://www.doitnow.org/pages/525.html",
  "It pretty much summarizes why it isn't a popular way of having fun."
 ],
 "erowid": {
  "id": "7783",
  "citation": " BadBoo. \"Not in Kansas Anymore: experience with Datura Seeds (ID 7783)\". Erowid.org. Jul 1, 2001. erowid.org/exp/7783",
  "substance": "Datura Seeds",
  "views": "24592"
 }
}
