{
 "id": 12427,
 "title": "All in One",
 "date": {
  "submission": "2012-11-29T08:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Phishhead",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Pregabalin",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "<p>To start off I have done a plethora of drugs. Acid, nitrous (recommended with this pill for sure), DXM, amphetamines (ex-addict), MDMA, pain pills (ex-addict), various sleeping aids, other various downers, muscle relaxants, anti-depressants, and anti-anxiety pills.",
  "This pill was totally new to me when I got 20 for 5 bucks when I was getting some weed from my dealer. He explained to me that it will make me feel drunk but at the same time pretty euphoric. So me being up to anything decided ahh what the hell one time wont hurt. I looked it up online didnt find much except that it was new and is a treatment for epilepsy and nerve pain (or something like that). So I figured oh so its probably just like other pain killers. But I did find a forum that said you can get pretty done with 300mg first time.",
  "Reminder- these times are approximate because I am writing this after the experience",
  "+0:00 So it was a Saturday night, I was with my bros in my dorm and we all took 2 150mg capsules at around 9PM. We didnt have any other drugs so we just decided to try it. ",
  "+2:00 The onset took an unusually long time, almost 2 hours for us. I later found this was due to the capsule itself was thicker than I have seen before (I opened one up at another occasion). So 2 hours pass and finally I feel a warming sensation... Kind of like opiates. It felt very nice, I got up to do an 'effect check' (get up move around see if it has done anything) but nothing, just feeling warm.  We just sit there watching a movie just chillin waiting for this stuff to really take off. ",
  "+2:30  2:45 So I do an effect check again and this time getting up felt kind of weird, couldnt tell what it was like yet but just weird.  I moved around some more again and this time I was a little unbalanced.  I had also noticed that my mood had been lifted a bit.",
  "+3:15 It has become very noticeable while sitting I feel kind of heavy and now Im way happier.  Another EC and this time going from sitting to prone was almost difficult, I felt extremely unbalanced almost like I was drunk.  It had a wicked nice body high and I almost felt like Im floating.",
  "+4:00  Now it has gotten really strong.  The euphoria is so nice and I am moving around to some music that we are playing, just messing around in the room.  I keep stumbling all over the place.  The music sounds amazing and anything comfy feels 20 times better.",
  "+4:10  We put on another movie and turn off the lights.  When I look at things there is a slight pattern almost like an acid trip but not as prominent. These patterns were almost like dim lights dancing around the room.  I felt extremely relaxed and I just sat there not paying attention to the movie just dosed off to another place. I felt very apathetic and all my worries were gone. ",
  "+4:15 We decided it was a great idea to go smoke some weed so we smoked like 4 .5g bowls between the 3 of us.  And after that we watched the movie some more. The weed almost clouded that feeling of clear-headedness, I tried to dose off again into that space but it didnt work. ",
  "+4:45 (from what I hear) I fell asleep.",
  "+9:30 My buddy woke me up.  I got up to get dressed and go to breakfast but I noticed that I was still feeling the same as last night, not as strong though.  I felt happy still and I was wobbly.  I also felt like I got the best night of sleep I ever have.",
  "+12:00 I am about at baseline, little clear-headed but nothing more.",
  "All in all I think this was one of the best pills I have done. It felt like mild MDMA, very mild LSD, muscle relaxants, anti-depressants and anti-anxiety all in one.  But the next time I took it I took 2 (couple days later) and the peak was almost half as good.  So this means that tolerance grows very quickly.</p>"
 ],
 "erowid": {
  "id": "77941",
  "citation": " Phishhead. \"All in One: experience with Pregabalin & Cannabis (ID 77941)\". Erowid.org. Nov 29, 2012. erowid.org/exp/77941",
  "substance": "Pregabalin & Cannabis",
  "views": "3844"
 }
}
