{
 "id": 12424,
 "title": "Anxiety Relief and a Pleasant Surprise",
 "date": {
  "submission": "2009-07-09T07:00:00.000Z",
  "experience": "2008"
 },
 "author": {
  "name": "Ivy Traveller",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "400 mg",
   "administration": "insufflated",
   "substance": "Pharms - Metaxalone",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "<p>For the past 2 years, I have been consistently prescribed oxycodone  in various forms  for a broken back, the subsequent surgery, and post-surgical pain.  I have developed quite a tolerance as you might imagine, requiring over 200mg a day to alleviate the pain.  I also misused the prescription, insufflating them to get high.  It was great until my tolerance built up and the amount required to be high became huge.",
  "As a result, I would burn through my prescriptions (amount prescribed: 2  20mg Oxycontin/day; 4  15mg Roxicodone/day) in about a week.  Id go through withdrawal over and over again when my script ran out.  I actually got pretty used to it!  Good at it, more like it.  At least, after a while, it didnt seem so bad, especially with tapering off a bit beforehand.",
  "To the point of this report:  I had been off the opiates for about a week and was doing pretty well.  I was finally sleeping fairly well at night but still was anxious, especially in the morning, along with some of the annoying but treatable gastrointestinal problems.  Looking for a way to ease the anxiety without resorting to another addictive substance like benzodiazepines, I decided to try Skelaxin, a muscle relaxant that I had also been prescribed for muscle spasms.",
  "Skelaxin always worked terrifically for me for the spasms.  It took care of the problems and didnt make me sleepy.  As a result of having swallowed several of these over the past year, I didnt have much hope that it would relieve any of the anxiety symptoms.  The worst of these for me was an annoying tightening of muscles and shaking.  I had tried taking the Skelaxin  swallowing them  to alleviate these symptoms to no avail.  Thus, I thought that perhaps a different method of ingestion might work better.  Immediately, I went to my old standby for recreational pill use  insufflation.",
  "I sat down and carved up half of an 800mg Skelaxin pill, expecting to have to take many more to get any relief for the anxiety.  I was surprised to find that after snorting the 400mg within the span of about 10 minutes that I was beginning to feel much more relaxed.  Finally, Skelaxin resembled other muscle relaxants like Soma and Flexeril.  The body high  which for me was more or less a relief of the anxiety plus a bit more relaxation  was very similar to these other two drugs.  It lasted for about 3 hours!  Another big surprise.",
  "Overall, Id say that my experience with snorting Skelaxin was very positive.  It alleviated my anxiety symptoms effectively and provided an additional, pleasant, more recreational body high.  The only drawback that I could foresee is that taking more might make one nauseous.  I experienced a bit of this shortly after snorting the 400mg but it disappeared rather quickly.  I would also plan on not having anything physical (or perhaps mental) for the duration of the high, since it is a muscle relaxant and effectively turned me into a couch lump, having difficulty moving, feeling heavy, etc.  Aside from these few things, Skelaxin was effective for me both for the treatment of some opiate-withdrawal related anxiety and for the generation of a pretty decent body high.</p>"
 ],
 "erowid": {
  "id": "77921",
  "citation": " Ivy Traveller. \"Anxiety Relief and a Pleasant Surprise: experience with Metaxalone (Skelaxin) (ID 77921)\". Erowid.org. Jul 9, 2009. erowid.org/exp/77921",
  "substance": "Metaxalone (Skelaxin)",
  "views": "69349"
 }
}
