{
 "id": 12426,
 "title": "The Legal Mindfuck of All Time",
 "date": {
  "submission": "2003-07-28T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Batman",
  "gender": "Male",
  "weight": "155 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "711 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>OK, I recently tried DXM for the first time. I even wrote a report praising the substance, and said I would do it again and again. But the other night, I did DXM, and had the worst experience of my life.",
  "At around 10 PM me and my friend each drank a full bottle of CVS Tussin Extra Strength. Last time I drank this much, I had a lot of fun. Music was great, I was seeing bright lights, and cool CEV's. This time however...",
  "At around 11 PM (after feeling absolutely sick) I started to feel light-headed and heavy at the same time (last time was the same way). I then started feeling really happy and woozly (word I made up for when my body feels like its splitting in a good way). Me and my friend turned off all the normal lights and turned on a blacklight. We then put on Pink Floyd's WISH YOU WERE HERE album. I must say, it did feel good having the music flow through me.",
  "After that we put on Alice In Wonderland. My friend was loving it, but I (even having seen the movie over 100 times) couldn't understand it. That's when everything went to hell...",
  "At around 3 I stood up, only to find that I couldn't stand up right. My friend asked if I was OK, but the black light and my screwed vision made his face look really scary. I asked him not to look at me for the rest of the night and he said OK. He then went to sleep (he can sleep on DXM although most people, including me, can't)",
  "I laid in my bed, all lights out. I felt very itchy and my heart sped up. I then looked over at a clock only to find that my vision had split. Not doubled and blurred... but like a was looking through two copies not aligned right. I got upset cuz I couldn't see.. but then I lost vision...",
  "I had no sight for almost 2 minutes (seemed like hours), where I started crying thinking, 'I really fucked up...'. When it came back, my body seemed to die. I could move it, but couldn't feel it moving, which wasn't too bad, except it still itched so I couldn't scratch, and my vision was going crazy and...",
  "It was absolutely horrible...",
  "It wore off a little before 6 AM. It lasted really long. At 12 the next day (after 3 hours of sleep), I got called into work. My stomach hurt so bad and I felt so hung over, that I had to leave 5 hours early. I went home, and laid in my bed in agony with the worst stomach ache I've ever had.",
  "My advice...",
  "If your going to do DXM do little doses. Although 750 isn't a lot, it scared the shit outta me. I will never ever do DXM again. It is not the legal good trip, it's the legal MINDFUCK OF ALL TIME!</p>"
 ],
 "erowid": {
  "id": "7794",
  "citation": " Batman. \"The Legal Mindfuck of All Time: experience with DXM (ID 7794)\". Erowid.org. Jul 28, 2003. erowid.org/exp/7794",
  "substance": "DXM",
  "views": "9267"
 }
}
