{
 "id": 12431,
 "title": "When They Say Be Careful with the Dosage",
 "date": {
  "submission": "2010-05-04T07:00:00.000Z",
  "experience": "2006"
 },
 "author": {
  "name": "Meister Eckhart",
  "gender": "Male",
  "weight": "160 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>I, like many other people my age, grew up on LSD.  I'm not positive about this, but I think there was an undocumented acid boom in the mid nineties, at least there seemed to be one in the town where I grew up. LSD could be easily obtained and was extremely cheap. Those were wonderful days.",
  "That being said, I have vast experience with that particular psychedellic. I have enjoyed varying doses from the very small, to the very large, and have had many different experiences from the very good to the very very bad.",
  "SO- when a friend of mine who had never tried LSD told me that he had found a 'legal' drug that 'takes you to the center of the universe' I was extremely skeptical, so skeptical in fact that I decided to order some from an online research chemical company.  The stuff came in a little silver envelope. It was a white scentless powder.",
  "I had done some research, read the many many warnings about taking small doses, and so I started small, attempting to smoke tiny amounts, and having little or no effect at all.",
  "I put the envelope away and forgot about it for a few weeks, and then on a whim I poured a LARGE amount of the stuff on some dried oregano sat on my bed and took a gigantic hit.",
  "There was maybe 2 seconds in which the thinking part of my mind could fire off a warning shot.  I thought 'Oh this is what he was talking about.' But the thought sounded like a record player that was rapidly slowing down.  I then fell backwards on my bed and vanished from the world.",
  "There was no fear, I suppose there was awareness as I am able to remember the experience, but the memory is a blur.  The most I can recall is hearing some sort of amazing sound, and seeing something that defied description. Not the geometric stuff DMT users report either, something non specific it was rapidly shifting, even trying to recall it makes me feel a little on the woozy side.  This all encompassing experience wore off for a moment and in that moment, my awareness came gasping to the surface of the hallucination and I was able to consider momentarily that I had killed myself by taking an outrageous dose of an online drug and this was the most pathetic death experience of all time.  And then I was sucked back into it, and then finally it dissipated enough that I was able to push myself off the bed in an attempt to prove to myself that I wasn't dead.",
  "My legs felt like taffy,my heart was POUNDING, the entire room was melting in a more traditional LSD hallucination sort of way, I looked at myself in the mirror and my eyes were completely dilated.  This wore off and outside of feeling like a complete moron for being irresponsible with an obscure drug I felt normal again.",
  "I would not categorize this as an enjoyable, or even particularly enlightening trip. I'm pretty sure it took me into the underlying gears of things, but it wrapped a blindfold of amnesia tightly around my self awareness so that I didn't really come back with anything that useful. ",
  "I don't want to sound old fashioned, but next time I'll be a clever traveler and stick with mushrooms or LSD.</p>"
 ],
 "erowid": {
  "id": "77978",
  "citation": " Meister Eckhart. \"When They Say Be Careful with the Dosage: experience with 5-MeO-DMT (ID 77978)\". Erowid.org. May 4, 2010. erowid.org/exp/77978",
  "substance": "5-MeO-DMT",
  "views": "2287"
 }
}
