{
 "id": 12432,
 "title": "Like Nothing Else in the World",
 "date": {
  "submission": "2003-08-11T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Keil",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "354",
    "grams": 0.354
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  },
  {
   "time": "0:30",
   "amount": {
    "unit": "mg",
    "quantity": "354",
    "grams": 0.354
   },
   "administration": "oral",
   "substance": "DXM",
   "form": "liquid"
  }
 ],
 "report": [
  "I had heard about tripping robo from D, and it sounded a lot cooler than acid or shrooms, and cheaper too, so I decided to do it.  I bought two 4oz bottles of Robitussin Max Cough the night before, and I was high with anticipation by the time I finally took the first bottle at 6:15.  I had been taking hits out of a gravity bong made with a laundry bucket and two-liter bottle with an old friend, and was pretty stoned.  I took the second at 6:45 (that tasted like shit!), and then my friend had to go.",
  "I spent the next few hours in bed, pretty much fucked out of my mind.  It must have hit me like a freight train.  I remember trying to get up and walk over to my stereo to pop in some new CDs, and discovering that I couldn't feel my feet and did not recognize myself in the mirror by my bed.  My face seemed empty, elongated, with my mouth open and slack-jawed.  DXM's classification as a dissociative is definitely a perfect description of its effects - my mind just completely separates from your physical body, and I feel like a different person.  While I was lying down, the room kept tilting to the right, and I thought the bed was elevated almost to the ceiling.  I couldn't focus my vision - double everything. ",
  "N and C picked me up around 9:30, to go cruise around with some sophomore chicks.  This is where I screwed up - definitely should not have left my room.  I had to talk to my mom on the way out the door, and she could tell that something was extremely wrong - cold sweat, slurred speech, delerium.  I managed to get out the door, and we drove off, with me in shotgun, talking incoherently and laughing like a fuckup.  I felt like wow, what a messed up family life this person has, as if I was observing myself from another point of view.",
  "Being on DXM is not a mentally stimulating experience - no huge revelations - but it does make me question my own existence.   For the most part, it's just about being more messed up than I can be on anything else.",
  "I spent most of the night in the car, because I obviously couldn't walk around in public, but I definitely had a good time because I was tripping so hard.  They smoked several bowls of bud, but I passed on all but one of them because I didn't think I could handle it. They took me home around 2, and I had to talk with my parents, who had apparently called poison control after finding the bottles (I was too fucked up to remember to get rid of them).  It was just the typical, yeah, I won't do it again, whatever, I'm tired and going to bed.  It's awfully hard to talk to your parents when there are four of them instead of two and you can't stand up or even care about what's going on. ",
  "I had to eat breakfast with my parents the next morning, and that was difficult because I was still tripping very hard.  The meal was very confusing, to say the least.  I decided I needed to get out of there, so I called my friend S to go play some disc golf.  We went and played a couple rounds, but it was so windy that I thought we were in a hurricane, and neither of us could even get under par.  I felt really drunk - as in 10-12 beers drunk (a lot for me).  So we went out to Macbride (a large park, on 2 lakes) and smoked a bunch of KB, under a blanket because it was so windy.  We were so high, and I was still tripping so hard, that we just went hysterical there on the concrete spillway.  God knows what the people fishing out on the lake must have thought. ",
  "We drove back to town for dinner and dropped in on D, whose brother R is somewhat of a psychonaut - he has robotripped several times, mostly off coricidin or whatever (he also introduced me to salvia, and GHB as well).  We exchanged stories, and I began to come down.  He told me about how a couple of nights before, his mom had caught him robotripping and she had freaked out. ",
  "I ended up passing out that night watching pay-per-view boxing with a bunch of people at D and R's house. Total time of trip: about 24 hours.",
  "I think the most important thing to take into account when tripping on DXM is that normal interaction with people is just about impossible - stay away from people that are not 'down' with the robo - or you can get yourself in a bad situation.  Make sure that everyone you're with knows what you are on, so they know that you're not on the verge of dying, just tripping really hard."
 ],
 "erowid": {
  "id": "7799",
  "citation": " Keil. \"Like Nothing Else in the World: experience with DXM (ID 7799)\". Erowid.org. Aug 11, 2003. erowid.org/exp/7799",
  "substance": "DXM",
  "views": "32919"
 }
}
