{
 "id": 12434,
 "title": "Fantastic Opiate Alter-Ego",
 "date": {
  "submission": "2013-07-24T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Oxy Love",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "12.5 mg",
   "administration": "insufflated",
   "substance": "Oxymorphone"
  },
  {
   "time": "0:03",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  },
  {
   "time": "0:05",
   "amount": "2.5 mg",
   "administration": "insufflated",
   "substance": "Oxymorphone"
  },
  {
   "time": "0:15",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Oxymorphone"
  }
 ],
 "report": [
  "Well, to begin, I am very experienced with opiates and opioids. I started my love affair with opiates after a series of accidents and surgeries where Percocet was prescribed after every occasion. From there I was enthralled by that opiate high and pursued any opiate/opiod I could find. Here is a list of opiates/opioids I have tried (my subjective view going from weakest to strongest): codeine, hydrocodone, morphine, oxycodone, hydromorphone, heroin, and of course, oxymorphone. And yes, the list is correct; in my opinion, oxymorphone was stronger/more enjoyable than heroin.",
  "Now late last weekend I was going to Denver like I always do, calling my friends to see who had the hook on Oxycontin. I was distressed to find that there was no Oxycontin or Roxi to be found (oxycodone has always been my preference). My friend called me back about five minutes later and my anxiety melted away instantly when he told me he had something called Opana. I hadnt tried it or heard much about it at the time, but I knew it was an opiate, and that was all I was concerned with. After a very frustrating hour of waiting I finally acquired one 10 mg Opana ER and two 5 mg Opana instant release tablets.",
  "I jumped back into my truck and set off to my friends house. As I was making the 10 mile drive I could feel the excitement building slowing. Ahhh the relief, I finally arrived at my destination. I immediately slipped the Opana ER into my mouth, took it out, and rubbed the ER coating off. I anxiously chopped the 10 mg up and insufflated it as fast as I could. Like always, I lit a cigarette and waited for the rush to start overcoming me. Unfortunately, as time passed I wasnt feeling anything special, so I cut up 2.5 mg more and insufflated that. All the sudden, BOOM, there it is. Here is what I have been waiting for so anxiously. And just for fun I do 2.5mg more.",
  "I sit back and light another cigarette as I feel the anxiety melt off of me. It feels like a layer is melting off of my body; it starts at my head and slowly drains down to my feet until all of the sudden, everything is right in the world. I wish I could describe the high, but every time I try, I feel like I dont come close to doing it justice. My best representation is the idea that I slip into an opiate induced alter-ego. For the sake of simplicity lets call my alter-ego 'AE'.",
  "When I am AE, I feel wrapped in a warm blanket that never gets cold. I have a sense of euphoria that is very reassuring in every way imaginable. AE is very confident and all inhibitions fade into the background.Sometimes I find that AE is so self-assured, he will do things that I would never have the guts to do sober, whether it be seducing beautiful women, doing outrageous things that make AE the life of the party, etc. See, I struggle with social anxiety which keeps me from being outgoing, thus, why I enjoy being AE so much. Oh and by the way, I just did periodic bumps of the last 5 mg I had throughout the night, if you were wondering where that went.",
  "Overall, the experience was mind-blowing, much better than I had expected. In my opinion, oxymorphone is the drug when it comes to opiates; it will be the drug I pursue from here on out. I feel as though I need to do a type of safety disclaimer here. I have a high tolerance to opiates and here is my initial dosages for each drug: oxycodone 50mg, morphine 90-100mg, hydromorphone 12mg, oxymorphone 15mg. This dosage is what I insufflate initially to get high and then I titrate up from there. Remember oxymorphone is very potent, much more so than oxycodone, but it is something worth trying if you already have an opiate habit."
 ],
 "erowid": {
  "id": "78002",
  "citation": " Oxy Love. \"Fantastic Opiate Alter-Ego: experience with Oxymorphone (ID 78002)\". Erowid.org. Jul 24, 2013. erowid.org/exp/78002",
  "substance": "Oxymorphone",
  "views": "1322"
 }
}
