{
 "id": 12442,
 "title": "Mushroom Ayahuasca",
 "date": {
  "submission": "2009-04-09T07:00:00.000Z",
  "experience": "1998-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Orion, CO"
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  },
  {
   "time": "0",
   "amount": "5.0 g",
   "administration": "oral",
   "substance": "Banisteriopsis caapi",
   "form": "leaves"
  }
 ],
 "report": [
  "Citation: Orion, CO. 'Mushroom Ayahuasca'. The Entheogen Review. Vernal Equinox 1998;7(1):7-8.",
  "Into one liter of pineapple juice (used to hasten the conversion of psilocybin to psilocin), I combined five grams (dried and powdered) Psilocybe cubensis and five grams (dried and powdered) Banisteriopsis caapi leaves. (With all of the literature that I had encountered citing the stems as the primary component containing harmala alkaloids, I felt that using the leaves would offer a mild MAOI effect; assumptions can get you nowhere and everywhere). I refrigerated this overnight. Seven travelers gathered, divided the brew equally, and cruised. The effects were rapid, beginning in about fifteen minutes, rising to a dramatic height and gradually tapering after two hours. None of us were prepared for the intensity, and our focus was not maintained as we had planned. There was a greater internal visionary display than with mushrooms alone, which was more in the green and brown range (more organic) than the blues and red that I usually experience. I also encountered some plant communion with the B. caapi growing in an adjacent room (vining, twining, searching, green), although this was an experience only felt by me and none of the other participants. There was some mild GI upset, and pronounced [sweating], but overall the experience was wonderful. -- Orion, CO.\rFive grams of dried, powdered B. caapi leaves would at most provide 95 milligrams of total combined >-carbolines if the leaves used were comparable to the strongest reported so far (Rivier and Lindgren 1972; McKenna et al. 1984). In ayahuasca, this wouldn't provide enough MAO inhibition to orally activate DMT for one person (Ott 1994). It is certainly possible that a greater quantity of B. caapi leaves could be used (rather than stem) as the MAOI in ayahuasca, and--while liana production is outside the reach of all but a few individuals with greenhouses, who might produce enough material for themselves and a couple of friends--growing ayahuasca for leaf and new growth production is well within the capabilities of most people. Nevertheless, we vaguely recall hearing that the natives don't use the leaves as they cause much more nausea than the stem bark (perhaps the leaves contain flavonoids, tannins, or other toxic materials). Regardless, it seems unlikely that the small amount of B. caapi leaves added to this brew had much to do with the apparently increased potency, though we are at a loss to explain why less than 3/4 of a gram of mushrooms per person would have such pronounced effects.\rNot familiar with the idea that adding pineapple juice to ground psilocybian mushrooms will 'hasten the conversion of psilocybin to psilocin,' we asked Dr. Alexander Shulgin if he thought that this would occur. He responded:",
  "Lordy, I have no idea. I kinda doubt it. Fresh pineapple (especially unripe pineapple) contains a rather potent protein hydrolysis enzyme called [bromelain] which is pretty effective at tenderizing raw meat (and is why there is no such thing as fresh pineapple Jell-O, since gelatin is also a protein). But there is no protein-like bond in psilocybin. And why would one want to do such a conversion anyway? Recent Swiss trials have demonstrated that psilocybin metabolizes to psilocin (and to 4-hydroxy-indoleacetic acid) in the human body. And for storage purposes psilocybin is the more stable compound.\rIndeed, it may be that the antioxidant quality of any vitamin C contained in pineapple juice actually reduces the conversion of psilocybin to psilocin. See 'Internet Mushroom Info' on page 8 for more on this idea. On the unrelated topic of possible mechanisms for 'potentiation,' we've seen speculation on the Internet that the use of white grapefruit juice may 'potentiate' specific visionary drugs (DXM was mentioned as one possibility), due to this juice containing 'naringenin, which inhibits the P450-1A2 and 3A4 liver enzymes.' As well, we've heard Internet rumblings that 5-hydroxytryptophan has been used successfully with MDMA '100 mg just before the peak, or on the way down, seems to greatly enhance the entactogenic/empathogenic qualities without causing an increase in muscle tension, gitters, etc.' Finally, one last Internet-reported experiment: 'Mildly positive' results have been touted from taking three grams of Ca/Mg supplement over one hour prior to ingesting MDMA. (This practice is based on the idea that amphetamines are more easily absorbed in an alkaline gut.) Apparently the Ca/Mg reduces 'jaw clench.'"
 ],
 "erowid": {
  "id": "78045",
  "citation": " Orion, CO. \"Mushroom Ayahuasca: experience with Mushrooms - P. cubensis & Banisteriopsis caapi (ID 78045)\". Erowid.org. Apr 9, 2009. erowid.org/exp/78045",
  "substance": "Mushrooms - P. cubensis & Banisteriopsis caapi",
  "views": "5890"
 }
}
