{
 "id": 12440,
 "title": "First Time and Was Unable to Let Myself Come Up",
 "date": {
  "submission": "2002-02-15T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Misty",
  "gender": "Female",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "amount": "45 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "My boyfriend and I decided to try DPT.  Id wanted to try it for a while, and we finally got around to getting some.  We only hand 250 mg, and we didnt have a scale.  I cut the 250 mg in half, then one of the piles in half again.  I had two piles that where approximately 60 mg each.  I took an eyeballed 10 mg out of mine, and cut it in two lines. I didn't want to do very much because I usually react very strongly to drugs, and only need very small amounts. I cut the approx. 60 mg in two lines for my boyfriend, I rolled up a $20 bill, and he snorted his first. Then I snorted mine, but it burned so badly that I didn't get the whole first line. The second line wasn't quite as bad in my other nostril, and I managed to snort all of it. I probably ended up taking about 45 mg. This was about 6.40.",
  "Immediately after snorting the powder my eyes started to water and I my sinuses burned.  After about 10 minutes it subsided, and turned into a mild sore throat, which lasted for the duration of my experience. The post-nasal drip was pretty nasty too.",
  "At about 6:55 I got up to go to the bathroom. I came out and my boyfriend was breathing heavily and seemed to be pretty uncomfortable. Things around me began to look enhanced, and textures started to 'wiggle'.  I noticed that my own breathing seemed heavier, like the air in the room had become thicker.  My boyfriend got up and went in the bedroom, and I got up to get a glass of water. I went in the bedroom and he was on the bed breathing very heavily and rapidly. I sat down with him and told him to breathe slowly and deeply. I didn't get any higher after this.",
  "By 7:20 he was starting to calm down, and I still felt just a little bit high, like I was still about to come up.  I closed my eyes and took a deep breath, to see if I could get myself to come up more if I'd relax, but my boyfriends breathing became heavy and fast again, and he started to shiver. I put his hands on my chest to try and warm them up and told him to pay attention to his breathing.  He started to relax, and then began to shiver again, so I told him to visualize his breathing, and breathe deeply and slowly.",
  "By about 7:40 I'd given up on trying to let myself come up, and I was feeling the mild effects of the DPT fade. My boyfriend was starting to come down too.  I'd been asking him any questions I could think of to get him to talk to me, making him tell me about his mother and the pets that he had as a child, and his work. When I stopped asking him questions he said he wanted me to ask him more.  Answering my questions seemed to help him to relax and handle the trip. ",
  "By 8:20 I was feeling pretty much normal, and by 8:40 my boyfriend was down too.  I think that I prevented myself from coming up all the way by feeling that I needed to take care of my boyfriend.  By preventing myself from coming up initially, after an hour I was unable to let myself finish coming into the trip.  I think that I would have been able to had I not felt like I needed to keep it together incase my boyfriend hadnt been able to handle it.  Once I had started to worry, I stopped getting any higher.",
  "Its also possible that I didnt get very high because I needed more, but generally it doesnt take much for me to get high.  It was probably a combination of what may be a low dose for me, and me mentally preventing myself from letting the DPT take full effect.",
  "As far as the actual effects that I experienced went, I was unimpressed.  It was kind of like acid, without the annoying thinking, and kind of like 5-MeO-DiPT, but without the visuals.  The effects were probably just too mild for me to make any judgment, but I was unimpressed with the effects that I did get.  I think I will try this again, with a higher dose."
 ],
 "erowid": {
  "id": "7803",
  "citation": " Misty. \"First Time and Was Unable to Let Myself Come Up: experience with DPT (ID 7803)\". Erowid.org. Feb 15, 2002. erowid.org/exp/7803",
  "substance": "DPT",
  "views": "10867"
 }
}
