{
 "id": 12455,
 "title": "An Enjoyable First Experiment",
 "date": {
  "submission": "2010-01-20T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shaggy ",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "With a prior knowledge of hallucinogens such as LSD, MDMA, Psilocybin and other mild psycho-actives, I went on a search with a female companion for any amount of 2c-B amongst trusted friends and ended up with 2 capsules with a small amount of fine white powder inside. ",
  "After researching the effects and details of the high we decided on inhaling the small amount of powder through our nose and eating the capsules left over with the hope of getting whatever powder was still on the caps.  although we where told this would be painful to snort, which it was.  However the effects where felt within the first 10 minutes. ",
  "At first standing up dizziness was the first thing i noticed along with a feeling of nausea.  I beleived it to be partly because I had not eaten much that day.  Since this was my first expirience with 2c-B i was a bit anxious and not sure what to expect but my mood was extremely positive and giggly once i got over the feelings of nausea.",
  "First we expiremented with different music and dancing and the effects it had on our mood.  Once we lied down together it started to feel more like an aphrodisiac and left us feeling like we had ingested mdma.  Unorthodox cuddling positions and strange conversations about the enhancing of all senses. ",
  "After about 45 minutes we where outside and being under the light of the sun felt incredible.  all plants and living things are very interesting to play with almost as if the plants are playing with you as well. ",
  "Considering the dosage was small we started coming off our peak after about an hour and 15 minutes and decided to smoke some cannabis to see how it helped.",
  "We both agreed on feelings of wobbliness and sensetivity to light.  Blurred movement and trails on moving objects crept in and out the entire time. ",
  "Im writing this on the day after this expirience and currently feel physically normal for the most part.  Very positive about life with a forward train of thought.  Great trip for a couple to have alone as long as you pay attention to each others thoughts.  My companion had previously ingested several milligrams of prescription xanax bars which counteract the giggly energetic effects of the 2c-B which was unfortunate but next will be much better.",
  "BE SAFE AND EXPLORE YOUR MIND"
 ],
 "erowid": {
  "id": "78103",
  "citation": " Shaggy . \"An Enjoyable First Experiment: experience with 2C-B (ID 78103)\". Erowid.org. Jan 20, 2010. erowid.org/exp/78103",
  "substance": "2C-B",
  "views": "3947"
 }
}
