{
 "id": 12466,
 "title": "Nice Easy Going Combination",
 "date": {
  "submission": "2010-06-23T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jordan",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-D",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:40",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "Last week I was offered by a reliable source what they called 2C-CD (equal parts 2c-c and 2c-d). It was given to me in a purple capsule containing 25mg of each chemical for $25.",
  "Two days later my friend C and I parachuted the white icing-sugar like substance with a piece of toilette paper to ensure the quick onset of the effects. It was about 12 noon when we ingested the substance.",
  "We sat at my computer desk listening to dubstep waiting for the effects to kick in. 40 minutes had now passed since ingestion, C and I were starting to see colors more vividly and hear sound more clear and enhanced. We went outside to smoke a bowl, the effects of the marijuana were calming and added to the overall high. Another hour had passed and the high was still getting stronger.",
  "We went outside for a walk in the woods, the clouds appeared more fluffy than usual, the snow on the ground was whiter. Everything we looked at seemed to have a little bit more to it than usual. While walking through the forest we were laughing more than usual becoming euphoric and increasingly more stoned. The effects of the drug were very calming and had a relaxing mindset.",
  "Once back inside after our little adventure outside the effects were climbing towards their peak (3 hour mark). Looking up at the celling in my room was quite interesting, we would see light flashes of pink and purple. Whatever we were not focusing on would have a slight crawl or vibration to it but nothing crazy distorted or anything. These peak effects went on for around an hour, pictures on the internet seemed to be hilarious. You could compare it to the coming up effects of magic mushrooms. The mindset that both me and C had the entire time was positive. After another hour had passed we were not quite as giggly, but our vision was still enhanced and our thought processes still were not normal. It was a slow comedown with little to no negative effects. I felt slightly sleepy and content once back at baseline.",
  "Overall both me and C can say we had positive experiences with the drug, in the future I would like to try the substances alone and at higher and smaller doses. There has been some study on 2C-D about how the drug can be stimulating for a brain while trying to learn something. I would definitely recommend this to anyone looking to have an enjoyable light-hearted trip, there was no feeling of fear or paranoia at all."
 ],
 "erowid": {
  "id": "83365",
  "citation": " Jordan. \"Nice Easy Going Combination: experience with 2C-C &  2C-D (ID 83365)\". Erowid.org. Jun 23, 2010. erowid.org/exp/83365",
  "substance": "2C-C &  2C-D",
  "views": "5506"
 }
}
