{
 "id": 12474,
 "title": "Shortcut to Self-Harm",
 "date": {
  "submission": "2003-02-04T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "cjam",
  "gender": "Male",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "105 mg",
   "administration": "oral",
   "substance": "Pharms - Zopiclone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "amount": "4500 mg",
   "administration": "oral",
   "substance": "Pharms - Quetiapine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>Strung out from alcohol and cocaine use over several months, to alleviate side effects of medications listed.  Usual doses are zopiclone 3. 75mg daily quetiapine 300mg daily, paroxetine 20mg daily for sleep, anti depressant and anti psychotic use. Side effects are tiredness, loss of libido, parkinsonism, tremors etc.  Cocaine, MDMA and alcohol in large doses delete side effects but not ability to function in everyday situations. ",
  "When i took the dose stated or overdose [28of3.75mg, 30of150mg, 10of20mg] I had been awake for 5 days and needed to sleep, become unconcious anything.  I awoke 2 hours later and proceeded to have a bath.  I struggled indefinately to get out of bath.  Some time later I drank something a soft drink or water from the fridge and received electric shocks of blue flashing light and searing pain through the floor into my feet and exiting from my mouth as visible blue lightning.  A period of complete unconciousness anything could have happened, my flatmate confirmed i was in my bed at 8pm.  At 11pm my girlfriend arrived i have no memory of this i was lying on my back completly rigid.  I woke early 7am tried to stand and fell through all my computer and belongings, then about five times crashed into bathroom, don't recollect why i went there.  My girlfriend reports i was making phonecalls and smoking cigarettes that didn't exist.  I spoke to people who were not there.",
  "Worringly I had significant injuries to my head hands and back.",
  "Burn injuries and blistering to my left palm and fingers, bruise to me head indicating blows from a blunt object, and strange pressure marks to my hands back and arm.  In the hospital no accurate diagnosis was made.   My left arm became useless and still have no feeling in left forearm and hand, due to nerve compression and death. This is 5 months after incident.  Prognosis 6-12 months for 90% use of left arm.",
  "Many of the experiences were not frightening just the aftermath.  What is interesting is how close to reports of atropine poising by belladonna or datura.",
  "I have experienced nearly all drug types, this was the worst combination imaginable, motto dont fuck with your pharmacology.</p>"
 ],
 "erowid": {
  "id": "8344",
  "citation": " cjam. \"Shortcut to Self-Harm: experience with Pharms - Zopiclone, Quetiapine & Paroxetine (ID 8344)\". Erowid.org. Feb 4, 2003. erowid.org/exp/8344",
  "substance": "Pharms - Zopiclone, Quetiapine & Paroxetine",
  "views": "54571"
 }
}
