{
 "title": "Freebasing Tryptamines...",
 "author": "Dingo",
 "citation": " Dingo. \"Freebasing Tryptamines...: experience with DIPT / 5MEO-DIPT (ID 12473)\". Erowid.org. Feb 10, 2002. erowid.org/exp/12473",
 "substance": "DIPT / 5MEO-DIPT",
 "bodyweight": "135 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "DiPT",
   "(freebase)",
   "",
   " ",
   "smoked",
   "5-MeO-DiPT",
   "(freebase)"
  ]
 ],
 "report": "<p>DIPT (n-n-DiIsoPropylTryptamine) Freebase:</p><p>Preparation: Amounts of DIPT HCl were dropped into ~250 ml of 10%(?)NH4OH (Household Ammonia) solution went cloudy then went clear as large pieces of freebase crystal form immediately and dropped to the bottom of the flask.  After allowing mixture to sit for 10 minutes with some stirring, the liquid was filtered off the crystals washed with H2O and allowed to dry.  Results show a ~2% loss in weight due to removal of the HCl molecule.  The resulting crystals had a pink-orange color.</p><p>Dosage: 5 - 20 mg smoked</p><p>5 mg: Treshold effect...nothing more</p><p>10 mg: Was very suprised to find effect almost identical similar amount of n-n-DMT.  Definately not an 'Audio Only Psychedelic' and shows great potential.  Effect felt within 30 seconds...peaked in about 2-3 minutes.  Effects ended at 2 hours.</p><p>20 mg: Got an A. Shulgin +4 this time.  Actually, much stronger and longer lasting than similar amount of n-n-DMT. Same duration as above amount.</p><p>Conclusion: This substance is in my opinion, overlooked esp. in this form.  All the desirable effects are there....  audio/tactile/visual.  Seems to have 1x-2x strength of n-n-DMT by weight.</p><p>____________________________________________________________________</p><p>5MEO-DIPT (5Methoxy-n-n-DiIsoPropylTryptamine) Freebase:</p><p>Preparation: Amounts of 5MEO-DIPT HCl were dropped into ~250 ml of 10%(?)NH4OH (Household Ammonia) solution went cloudy then went clear as large pieces of freebase crystal form immediately and dropped to the bottom of the flask.  After allowing mixture to sit for 10 minutes with some stirring, the liquid was filtered off, the crystals washed with H2O and allowed to dry.  Results show a ~2% loss in weight due to removal of the HCl molecule. The resulting crystals were completely white.</p><p>Dosage: 5 - 20 mg smoked</p><p>5 mg: Treshold effect...nothing more...some feel nothing</p><p>10 mg: Not much visual or audio but, tactile sensations felt within 30 seconds.  Is very similar to 1/2 this amount of 5meo-dmt but, much more euphoric, peaks takes 1-2 minutes, and total duration ~ 2 hours. Effect not felt by all.</p><p>20 mg: Produced an OBE (Out of Body Experience) within 2 minutes.</p><p>Results were far superior to 5MEO-DMT without the 'fear element'.</p><p>Another A. Shulgin +4.  Effect felt strongly by all.  Duration still at ~2 hours but, slight effects remain for next 4 hours.</p><p>Conclusion: This substance very common as the HCl salt. Again, in my opinion, the freebase form is tragically overlooked.  Dosage is 2x-3x greater than for 5meo-dmt but, is already the preferred type.</p><p>____________________________________________________________________</p><p>Preparation methods used have been recently 'discovered' and are unbelievably fast and easy.NaOH was used since it does not exceed ph 9.0 in any concentration, the solution remains basic as long as the ammonia odor is present, and the resulting Na4Cl salt washes out easily being, very soluble in water.  Testing was done using each substance/amount only and a > 6 hours elapse before continuation.</p>",
 "year": "2002",
 "id": "12473",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-10T08:00:00.000Z",
 "views": "24162",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "DiPT",
   "form": "(freebase)"
  }
 ]
}
