{
 "title": "I Missed Christmas Because of Drugs",
 "author": "chigz",
 "citation": " chigz. \"I Missed Christmas Because of Drugs: experience with DiPT & DXM (ID 12482)\". Erowid.org. Feb 14, 2002. erowid.org/exp/12482",
 "substance": "DiPT & DXM",
 "bodyweight": "180 lb",
 "report": "<p>It was right befor Christmas and I was house sitting for a friend of the family's. During the first week of being at  the house I was approached by a friend who had the oppurtunity  to get her hands on some DIPT. With no hesitance I accepted the offer and we were off to the house.  It was just myself and my friend, squirel,  when we first took the 15mg of Dipt.</p><p>After 45 min we felt nothing. I decided that It was time to take some action and I took the 250mg of DXM. My freind watched as I downed the pill and decided that she should do the same. Because we were in an unfamiliar surrounding and because neither of us had any experience with either of these drugs we decided we would need supervision. So we called our friend hickface.</p><p>Hickface showed up and I remember just feeling drunk and I actually felt very at peace with every thing. Then I began to turn to sand and everything was being seen as if it were an old time movie complete with reel and bad editing. When ever anyone would move there would be a general disturbance in the settling of the sand and it was begining to cause me to get distressed-+.</p><p> I started to fell very uneasy and felt that I was about to be sick, which I was. I didn't really know what to do because I had never been sick on drugs before. It was at this moment that squirel began complaining of  pains and a fear that she was dieing. My trip began to take a turn for the worse and I decided that I needed to be alone. Somehow I managed to make it to the master bed room where I would spend the next 14 hours.</p><p>I tried to lay down but had trouble stayin in one position. I then decided that I needed to take half of my clothes off. Which was followed by another trip to the bathroom because I felt that I was going to be sick again. I started to feel very over heated and asked hickface for a wet cold towel. Squirel was asking for the same thing from what I was told.</p><p>During the night I went  on many trips, many of which ended with me thinking the weeks had gone by and I had missed christmas, but in realatity only 5 min. had gone by. The movie reel vision continued all night and feelings of death and then rebirth continued as well.</p><p>Coming out of the experience, it still took me awhile to be comfortable around people and to be able to consentrate on anything seriously.</p>",
 "year": "2001",
 "id": "12482",
 "gender": "Female",
 "timestamp": "2002-02-14T08:00:00.000Z",
 "views": "15121",
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "DiPT"
  },
  {
   "time": " T+ 0:45",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "DXM"
  }
 ]
}
