{
 "id": 12495,
 "title": "Pretty Damn Cool!",
 "date": {
  "submission": "2004-07-27T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "C-Dog",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "372 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  }
 ],
 "report": [
  "Well, Let me start off by saying that I have done several drugs in the past including X, Shrooms once and Acid once, Coke, Weed-Hash, Meth and Nutmeg (by the way Nutmeg really *f*n sucks).",
  "So it all started last night when I took MG seeds for the first time. I  started reading all the internet had to offer when I came upon MG's and so I said what the hell. Went to about twenty stores or at least it seemed like it when I finally found some. They are really hard to get when summer and fall comes around unless you can find a seed dealer in another state due to the fact that they are annual and are only provided in stores for a few weeks. After that the manufacturer comes back to the store and takes them off the counters--At least that is the way it goes here. N-e way, I called my bud and he was estatic that I had found them and couldn't wait to get home. He got there about 8:45pm. Now I had bought 12 packs of Morning Glory seeds of the Heavenly Blue variety (1.5gr pcks) which ended up being about 700 seeds. BTW, These seeds had absolutley no pestiside or fungicide on them at all and the seed packs had no warnings what so ever. I divided them up a little uneven between him and I but I am quite a bit bigger then he is so I thought it would be cool.",
  "We didn't have a pepper mill or a bean grinder and didn't feel like going to the store so we just pulled out the trusty ol hammer and went to smashing them on the garage floor. We wrapped them up pretty good so not to lose any of the precious substance and after about ten min for each of us we had some pretty decent powder. Now Mine was less crushed than my buddy's and that may come into later on this story.",
  "I went into the kitchen and poured all of the mix in a 16oz glass and added about 10oz of water. Poured it all into another glass and did that back and forth a couple times. Immediately the mix was of a yellowish to brownish color with a milky tint to it. I took a deep breath and started to down the liquid. As I got down to the bottom, the seed pulp was just too thick to swallow so I spread it on a piece of bread and ate it real quick. The seeds reminded me a bit of sunflower seeds but went down just fine. This was at 10:30pm. About 10 mins later I started to feel really mellow almost stoned. I was sitting on the couch watching some TV just chillin and I knew it would be a while before I would start to feel the effects. About thirty mins into it I could feel the sickness coming on but it felt more like I needed to burp or indigestion and not nausea. Now between this time 10:40 and 12 midnight I could feel and notice the change ever so slowly but it was obvious. I remember we were watching boxing on HBO and thing just seemed really cool. I started smiling for no reason, I could see weird thing out of the corner of my eyes, It was just cool.",
  "We went outside to smoke a cig around 12:30 or so and I really started trippin. My eyes were playing tricks on me and looking off the deck into the trees looked like it looking into a 3d picture with things just moving and brething on their own, very cool. I know that this trip was much stronger than the shrooms and the acid I had taken in Amsterdamn when I lived in Germany and my mind set was really awesome so things all seemed to be going my way. I went back inside and layed on the couch, watched some more boxing and just looked around as the trip came on even stronger but a little at a time. Then I couldn't watch the tv anymore and so I turned over and watched the walls and the ceiling. I started seeing ripples in the corners of the walls and the whole house seemed to be breathing. All of this just made me smile almost as if I was a little kid on the 'It's a small world' ride at disneyland. I got so caught up in watching things change around me and kept catching myself so I had to go do something else.",
  "I went back outside for a while and tripped a bunch more. Went back inside again and things around me were just weird. I felt the Parinoia that everyone talks about but it was almost funny to me and not really that bad at all. I had a alot of fun the whole night and this is already pretty long so I won't get into anymore of what I saw etc...",
  "Around 3:30 I peaked like crazy and started to break into a cold sweat, Ended up in the Bathroom and hurled a good 4 times but it wasn't that bad and then felt a whole lot better. Went into my bedroom and layed down and then it happened. I don't know what the f*&$ you call this but I swear to god it was the most amazing feeling. I had what I can only explain as fully body orgasams (almost coming from inside the center of my body cavity). You know that shaking in the body a guy gets right as he busts a nut? Well I had that for about two more hours and then drifted into an awesome sleep. Woke up the next day around 1:30 pm and the rest is history. I enjoyed the hell out of it but I still like X alot more. I will probably do it again but I am gonna wait a while. Happy Tripping------Be Careful and do your research before you do anything!"
 ],
 "erowid": {
  "id": "8356",
  "citation": " C-Dog. \"Pretty Damn Cool!: experience with Morning Glory (Heavenly Blue) (ID 8356)\". Erowid.org. Jul 27, 2004. erowid.org/exp/8356",
  "substance": "Morning Glory (Heavenly Blue)",
  "views": "5184"
 }
}
