{
 "id": 12493,
 "title": "Low Dose Experiment",
 "date": {
  "submission": "2010-08-06T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "johnny k",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "Ibogaine",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "Ibogaine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "So, the other night my friend and I decided to do a little experiment. Several months ago, I did a full blown ibogaine session that ended up fully curing me of a raging opiate habit I'd been nursing for over a year. As an afterthought, the guy who did my treatment left me with a gram of ibogaine, in order to redose if I wanted and was having trouble staying off of opiates. This wasn't the case, but I decided it was time to go back and speak with the root again.",
  "Another friend of mine was very interested in trying a little dab. Let me note here - ibo is DANGEROUS in large doses to people with heart conditions, and not knowing his q rhythm status I flat refused giving him a large dose, but, we had both read on the internet that ibogaine was distributed as 'pep pills' under the brand name lambarene in france in the 1930's. [Erowid Note: An extract of Tabernanthe manii was sold in tablet form under the name Lambarne.]  These were distributed in 8mg doses, and since there was no reported trouble of any kind, I figured, why not give lambarene a spin? We had also read that in Gabon, people take up to 100mg for dancing, hunting and other physical activities.",
  "We took 16mg each at approximately 2:30pm. We both felt alerts at 15 minutes out, and noted a strong feeling of comfort, colors and details in vision brightening and becoming more sharp. It was a very pleasant sensation. I know that ibo hits a TON of receptors and I sensed there was a strange brew going on. A little stimulated and dopaminey, a little empathic like serotonin, and a little drunk and tipsy like GABA. Kind of like ecstasy mixed with a little GHB. Very strange. After two hours or so, we decided to redose another 16mg. The effects continued and were extremely pleasant. This was totally the opposite of my first ibo experience (although that was probably colored by the withdrawals I was going thru at the time as well), which I found to be singularly wrenching on both a physical and mental level, so much so that I was even reluctant to try another dose of any amount. But I'm glad I did, this stuff is freaking great. I may try an even higher dose, say 60 - 100mg, especially after one of those drunken nights when I wake up hung over and take an Oxycontin, which I do from time to time (tho im no longer obsessive about or driven to do opiates for any reason other than EXTREME physical pain). So that's it. Lambarene is AWESOME."
 ],
 "erowid": {
  "id": "83551",
  "citation": " johnny k. \"Low Dose Experiment: experience with Ibogaine (ID 83551)\". Erowid.org. Aug 6, 2010. erowid.org/exp/83551",
  "substance": "Ibogaine",
  "views": "6929"
 }
}
