{
 "id": 125,
 "title": "The Bomb",
 "date": {
  "submission": "2013-08-27T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "likuidpaper",
  "gender": "Male",
  "weight": "240 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:40",
   "amount": "10 mg",
   "administration": "IV",
   "substance": "Ethylphenidate",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Mindset: just got off work feeling a bit excited and anxious due to 8 hours of manual labor and recent delivery of RC's.",
  "Previous drug experience: Alsmost everything, a lot.",
  "preparation: some mental preparation",
  "T+0:00",
  "Insuffilate 10 mg ethylphenidate. Slight burn, not as painful as most reports report.",
  "T+0:10min",
  "Slight mood boost, most likely placebo. Drain not too repulsive.",
  "T+0:20min",
  "Definate stimulant properties, not unlike methamphetamine.",
  "T+0:30min",
  "Stimulation building. Mild euphoria present, building.",
  "T+0:35min",
  "Niiiice, excellent body feeling, mental clarity, rush, moderate euphoria.",
  "T+0:40min",
  "Inject 10mg. This is when I lose track of time.  I feel wonderful. Very clean stimulant, with quite a bit of euphoria. Mind is calm yet stimulated.  Body rush still going strong.  Slight dehydration present at this time but nothing more than you would expect from a stimulant. Ingest several alcoholic beverages.  Mixing well.",
  "T+2:00hr",
  "Still feeling great with a bit of a moreish quality but altogether feeling very good.",
  "T+3:00hr",
  "Coming down.  Not bad at all.  Feel slightly dehydrated and wanting more alcohol. Still stimulated.  Altogether a small dose with a very positive reaction.  Lots of euphoria, nice speedy vibe, easy comedown.  Way better than any ritalin experience I've had.  Definatley a novel RC with potential.  risk of abuse yet to be determined :-)</p>"
 ],
 "erowid": {
  "id": "100914",
  "citation": " likuidpaper. \"The Bomb: experience with Ethylphenidate (ID 100914)\". Erowid.org. Aug 27, 2013. erowid.org/exp/100914",
  "substance": "Ethylphenidate",
  "views": "1694"
 }
}
