{
 "id": 12502,
 "title": "Basic Morphine Prep and the Experience",
 "date": {
  "submission": "2011-08-07T07:00:00.000Z",
  "experience": "2007"
 },
 "author": {
  "name": "Drug Geek",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "Morphine",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Morphine is relatively stable and simple opioid to extract from either plant material or latex. The process requires inexpensive and easily procured chemicals. This being said, there is the possibility of severe injury or death involved with solvents and strong acids.",
  "*If you are not using plant material, skip this step*",
  "Both stems and pods can be used for their alkaloids, but being plants the quality is variable. It is best to harvest shortly after the petals fall from the plant and before the plant is flushed of its goodies become lost from the rain. Once harvested it is best to dry them in a well ventilated area with good circulation. When dry, crack the pods to remove the seeds and break up the stem. Blend in a coffee grinder or a blender as fine as you can get it; this is to limit the solvent used and time to extract.",
  "Pour enough alcohol (methanol, ethanol, propanol, butanol) to cover the shredded poppy straw or the latex in preferably a reflux boiler, but a pot can extract nearly everything. Do not use diluted alcohols as they will reduce purity substantially.  Basify the alcohol to a PH of 11 using a strong solid hydroxide or carbonate. Place the pot in a double boiler. Heat alcohol under a fume hood, if possible, to 40-50C. If using methanol fumes are hard to detect and can become a fire hazard. Add the material. Maintain a low heat to prevent any evaporation for one to two hours. Filter waxes or straw once the solution has cooled and evaporate the resulting solvent. As long as a fine filter was used the product should be a powdery solid of a green or yellow shade. This is vaporizable and contains dozens of other opioids, but is very impure and hard to dose.",
  "An aqueous solution having a PH of 11 using the method above is added to the crude extract to draw out water soluble morphinate anions. Heat to 35C for a half hour with occasional stirring and filter the precipitate out.  Discard precipitate.",
  "The solution is now technically usable if acidified for oral doses; however it can contain unwanted alkaloids at concentrated levels. These contaminants can be removed via a water immiscible solvent, preferably benzene, xylene, or toluene, but dichloromethane and naphtha are also suitable. Heat to the same temperature as the previous step for another half hour with frequent stirring.  Allow solution to cool and separate the non-aqueous layer using a pipette or large syringe. Dispose of the water immiscible solvent and the unwanted alkaloids. The aqueous solution should contain nearly pure morphine which is precipitated by your choice of moderate to strong acid. Muriatic, sulphuric, and solid acetic acid are preferred.  Lower PH to approximately 9 and filter the precipitate. This morphine is very pure and will usually appear as a cloudy or clear crystal which may or may not have a yellow or brownish haze. The product can be used IM or IV as long as sterile precautions were taken after the alcohol stage. It is best to use minute doses orally to determine potency. Further basic water and immiscible solvent extractions can remove the cloudiness however product might be lost.",
  "The tan crystals we consumed via 10mg gel caps. After purification were completely transparent and reeked of burning plastics and dry herb. At a dose of 70mg near incapacitating analgesic effects were a direct result. I would advise beginning with a lower base amount as I experienced severe symptoms of respiratory depression.",
  "Approximately 10 minutes post consumption euphoria began to engulf the upper half of my lungs and abdomen. There was a dry and itchy feeling which disappeared when I focused on the warm sensations induced by the caps. Anyone who has experienced the pleasuring grip of strong opioids. I realized the resulting disassociation from ordinary experiences which can cloud pain and suffering; both mental and physical.",
  "The glow and relaxation derived from this dribble of opiate bliss is dwarfed by the physical impact. Six hours of nirvana later it seems finally over.",
  "Emotions and sensation are intensified for several hours before evaporating into compassion and pseudo-satisfaction. Opiates are deceiving and dangerous but worth the time if consumed in an intelligent manner. Morphine is a very potent drug and if you follow the mentioned process I expect you to use the most legitimate means possible."
 ],
 "erowid": {
  "id": "83605",
  "citation": " Drug Geek. \"Basic Morphine Prep and the Experience: experience with Morphine  (ID 83605)\". Erowid.org. Aug 7, 2011. erowid.org/exp/83605",
  "substance": "Morphine ",
  "views": "19218"
 }
}
