{
 "title": "My Lovely Drug",
 "author": "Alex",
 "citation": " Alex. \"My Lovely Drug: experience with MDMA (Ecstasy) (ID 12505)\". Erowid.org. Jan 26, 2005. erowid.org/exp/12505",
 "substance": "MDMA (Ecstasy)",
 "bodyweight": "95 lb",
 "report": "<p>It was New Years eve and my friends and I were contemplating which new drug to try. It would be four us all together, sleeping at my house, planning to take a new substance while my parents were sleeping in the room next-door. Only three of us had the opportunity to try ecstasy  that night,  and the fourth didn't mind. She would take 2g of mushrooms and be completely satisfied. So three of us bought one blue honda ecstasy pill.  Our preparations included researching the drug very well.  Even though one of us had done ecstasy before, we still wanted to be very sure of our decision.  We also brought up two bottles of water, a glass of juice, two Pepsis and one bag of very salty Tostitos up to my bedroom. We were prepared to make several trips to the kitchen for more water though.  We wanted to avoid dehydration, as well as we did not want to drink too much water. So we included salty chips for the night to balance the water and salt levels.</p><p>Seeing as how it would be a risky night, being in the very same house as my sleeping parents, our first thought was to only take half a pill. So around 1:30am we took half a pill each. We waited about 50min with no effects. So around 2:20am we popped the other half. Within 30min, the only experienced user began feeling the drug's effects. She looked like she was having orgasms on my bedroom floor. She claimed it was the sensation of her shoulders rolling against my bed frame. Still my other friend and I felt nothing. So the experienced user took our hands and started to 'guide' us into the euphoric trip.  Which to my surprise worked.</p><p>Suddenly each of us began plunging into a state of total euphoria, empathy and love.  It was almost as though one minute we had no effects and then the next it was the peak.   My first thought, was how controlled I felt. I felt as though my mother could walk right in my room, right at that moment and I could handle the situation perfectly.  It was completely paranoia free. My head was in perfect control, but my heart was bursting. We began giving eachother, what we nicknamed 'fuzzy wuzzies' : sitting around simply complimenting eachother. I was able to tell each of my best friends how beautiful they were. I wanted my friends to know how much I cared about them and that I loved them, which was followed by hugs, and kisses all over the face.  This was not intended to be sexual in anyway.  It was purely an act of the love between friends.  We spent the night just talking. I didn't notice that I had too much energy, just that I was alert and awake.  I experienced no jaw clenching or nervous fidgeting. Although I guess the fact that we went through pack of gum had something to do with it.   When I breathed in, I felt as though my heart was expanding.  My room was only lit with candles, but it seemed much brighter.  Music seemed much louder and I appreciated it much more,  like when I smoke weed.</p><p>At around 5:00am my 20 year old brother (whom i get along with very well) came home from his New Years alcohol infested bash.  He was pretty sobered up though.  He sat in my room with my friends (all of which think my brother is gorgeous) and enjoyed the constant compliments about his hair.  It was sort of funny for me, because it was only I that realized that they had been talking about his hair for about 15min.</p><p>By 6:30 we were coming down, my brother had gone to sleep and the girl on mushrooms was getting quite annoyed and tired. So around 7am we smoked a joint out my window in hopes of falling asleep faster, as well as avoiding a harsh esctasy crash.  That was the only bad part of the night for me.  After smoking, we quickly cleaned up the bedroom and got in bed. I began hallucinating wildly: beautiful colours filled my room. The hallucinations didn't bother me. It was the feeling I had inside that ruined the night.  By mixing the comedown of ecstasy with weed had caused me to think too much about understanding things and life itself as organisms.  I began to feel like my best friends were intruders in my home. I felt as though my personal space was being invaded.  It took me a very long time to fall asleep, due to this feeling.  Although by 9am I believe I was asleep.</p><p>Nevertheless the more experienced ecstasy user thought the combo was amazing.</p><p>All in all, this drug changed my life and made me realize that I could be that happy. My friendships with the other girls who used ecstasy have become some of the most amazing friendships of my life at this point.  For three days after I could still feel the sensation in my chest when I breathed in, it felt beautiful. I had a very nice mood lift for those same three days. Afterwards life returned to normal. I suffered no depression from ecstasy.</p><p>I would not suggest using this drug very often.  My personal rule is to wait more than 4 weeks between ecstasy trips.</p>",
 "year": "2002",
 "id": "12505",
 "gender": "Female",
 "timestamp": "2005-01-26T08:00:00.000Z",
 "views": "8832",
 "dose": [
  {
   "time": "0",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 0:50",
   "amount": "0.5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  },
  {
   "time": " T+ 5:30",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
