{
 "id": 12512,
 "title": "A Deadly Combination?",
 "date": {
  "submission": "2010-06-23T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "CommissarioB",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Ketamine"
  },
  {
   "time": "0",
   "amount": "T+ 0:00",
   "administration": "repeated",
   "substance": "smoked"
  },
  {
   "time": "Cannabis",
   "amount": "",
   "administration": "T+ 0:00",
   "substance": "10 mg"
  },
  {
   "time": "0",
   "amount": "2C-D",
   "administration": "",
   "substance": "T+ 0:30"
  },
  {
   "time": "10 mg",
   "amount": "",
   "administration": "2C-D",
   "substance": ""
  },
  {
   "time": "1:00",
   "amount": "12.5 mg",
   "administration": "sublingual",
   "substance": "MDPV"
  },
  {
   "time": "(powder / crystals)",
   "amount": "T+ 2:00",
   "administration": "12.5 mg",
   "substance": "sublingual"
  },
  {
   "time": "MDPV",
   "amount": "(powder / crystals)",
   "administration": "T+ 3:00",
   "substance": "12.5 mg"
  },
  {
   "time": "sublingual",
   "amount": "MDPV",
   "administration": "(powder / crystals)",
   "substance": "T+ 4:00"
  },
  {
   "time": "12.5 mg",
   "amount": "sublingual",
   "administration": "MDPV",
   "substance": "(powder / crystals)"
  }
 ],
 "report": [
  "The first dose of  MDPV I took was at about 22.00 in the evening and was only a tiny bump under the tongue. Two friends and I had just had diner at a Japanese restaurant, it was Saturday night and wanted to go dancing at a club but felt tired and thought MDPV was a good idea. In total I think I took 50 mg of MDPV, spread across 4 hits taken one every hour until 3:00.",
  "I also took 2 tiny bumps of 2CD, one before taking the MDPV and the other around 00.30. Also that day I had smoked some pot before dinner, like one gr. and taken some Ketamine like 0.2 gr but nothing really extraordinary or unusual for me, really these were dosages I am well accustomed to.",
  "What actually made me write this report is the many side effects I experienced around 5.00 am. While I was totally enjoying myself dancing and so on taking tiny bumps of K and a few puffs of ganja, talking with friends making jokes and so on, I suddenly started feeling sick, felt light headed, couldnt breath in deeply and started feeling all my muscles and veins contracting in a way I had never felt before.",
  "I have tried all sorts of stimulants but the way MPDV affects my body I believe is very very dangerous. Nothing to do with a little anxiety or panic attack, this was a proper physical thing which felt much more powerful than other stimulants like amphetamines or cocaine. I felt as if the margin there is between a safe enjoyable dose and an overdose is TOO SMALL!!! The quantities I took of the MDPV were really tiny but probably also the 2CD, the cannabis and the ketamine did not help.",
  "I thought I was going to need to be hospitalized because the blood pressure rise was too sudden and intense; the word uncomfortable doesnt even get near to describing how I felt, all my muscles were so tense, especially around my stomach, it felt as if all muscles were being pulled from there and it was really hard to breath. I tried to drink some alcohol with orange juice to bring my pressure down but didnt work at all, maybe made it worse, I am not sure. I felt I was not getting enough oxygen so I went out of the club but didnt feel better until I took my jacket off.",
  "Luckily being winter here in Italy I managed to get some relief by standing in the cold (about -4C) with only my t-shirt on and practicing some deep breathing technique which I found much harder to do than usual. It was like the air would not really reach down my lungs but remain unabsorbed like all my alveoli were closed! So I started to only breath out air and noticed once I started the air wouldnt stop coming out like there was no end to my lung capacity, very strange Also as I was blowing out air I was producing lots of saliva, so I started spitting and that felt as if my body was trying to detox or something like that.",
  "Slowly, through breathing and also massaging my diaphragm and upper abdomen, after 40 minutes/one hour, I felt I was starting the process of coming back to normality. Luckily the friend that had given me the substances stood by me the whole time and helped by rolling some hash joints which always do the job when I need to relax Also drinking water gave me a relief much more powerful than when I take MDMA. Again I think water is extremely necessary in eliminating the toxins some substances produce. Moreover dancing while stomping my feet hard on the floor gave me a sense of relief and I am not sure if this has to do with the way our feet are connected and influence the whole cardiovascular system.",
  "I think my biggest mistake was to not read some proper information about the substances I was taking but just trusted my friend who told me MDPV is just like a bland aphrodisiac and 2CD just like 2CB. Obviously none of this was true but he did not know either, it was the first time both of us were taking this. It was very foolish not to read some experiences or find out the most possible information about these new drugs like I used to do when I was 15, I guess age sometimes makes you more arrogant rather than wiser and I surely need to correct that.",
  "I hope this experience will help anyone thinking of taking these substances, either together or on their own. I think the most concerning is MDPV but cannot be sure whether the cocktail with the other substances worsened the side effects of this stimulant. Surely if something the 2CD and K amplified the whole experience. I think these substances (MDPV and 2CD) are highly experimental with very little or no research done on their toxicity and various risks."
 ],
 "erowid": {
  "id": "83670",
  "citation": " CommissarioB. \"A Deadly Combination?: experience with Ketamine, 2C-D & MPDV (ID 83670)\". Erowid.org. Jun 23, 2010. erowid.org/exp/83670",
  "substance": "Ketamine, 2C-D & MPDV",
  "views": "14433"
 }
}
