{
 "id": 12529,
 "title": "Nasty on the Nose!",
 "date": {
  "submission": "2010-05-08T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RA",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "A few years back whilst at University and afterwards I experimented with most of the usual party drugs, being gay there is a continual and easy supply. Got quite hooked on Ketamine, but found the experiences to be getting worse and worse, so gave up completely and not touched anything since.  Anyway, got a new job, new home, new partner and the experimentation went out the window for a few years.",
  "So to my experience with Mephedrone, which I tried as its currently legal in UK, well as a plant food anyway.",
  "First expereince:- Approx 1400hrs, quiet and peaceful, not drank any alcohol, at home watching TV and on the internet.  Thought now would be a good time for a hit and a high.   I had previously bought 1g of mephedrone from the internet, and had had it sat in a draw for several weeks.",
  "1400hrs, slice and prepare a row.  Not sure of the weight, but from how much of the bag was left I estimate 200mg.  Snorted this using a straw!  Big mistake, the pain and suffering in the nose is not worth it! ",
  "1410hrs felt a little high, but a bit disapointed.  Seems to be very slow coming on.  Pain in the nose is mostly gone, but vowed never to do that again.",
  "1430hrs high is interesting, feel very buzzed, bustling around house doing chores at about twice the speed of normal.  Mind feels alert and active.  Eyes feel a bit funny, little difficulty focusing and eyes appear to be flicking back and forth when trying to focus.  Legs quite jittery, feeling of being a bit cold.",
  "1500hrs, high is waining, the alertness and attention to detail was a good feeling, but the eye thing was a bit annoying!  NOse is now ok, but still have no intention to ever do it again.",
  "1530hrs, a quick look on the internet for other methods of administration, and decided to try a bomb wrapped in paper.  I don't smoke so no rizlas, but tried a small segment of toilet paper and another 200mg (estimate) worked well, but quite a chemically taste.",
  "1615hrs, feeling a bit cheated as still feeling the after effects of first hit and nothing from the second.  Decided I had had enough indoors and took the dog for a walk around some fields and woods.",
  "1630hrs, walking through the woods the second hit suddenly took hold.  Literally as a rush all over the body.  Same feeling of incredible alertness, mind was active and aware of everything.  Outdoors I wasn't focusing close too and no problems with eyes, think the problem mentioned above might actually be a temporary long sightedness, and as long as your not trying to read there's no problem.",
  "1645hrs, best hit yet, the trees appear so hightened, can see all the birds and squirels, every little movement I am seeing.  No problem walking, but seem to be going slower that normal (opposite of first observed above).  Received a phone call and could talk perfectly normally, despite feeling wave after wave of hit.  If anything feeling quite talkative.  Made it home safely, with the dog, just started snowing.",
  "1715hrs, second hit now waining.  Feeling much as before, no longer getting waves of hits but mind still active and alert.  Muscles feel tired from being so active.  Have been very thirsty throughout the whole experience but have been drinking frequently.",
  "1800hrs onwards, pretty much all feelings have passed and heading back to normal.  No big come down, which was nice.  Can remember the entire experience, and found it positive. ",
  "Dont think this would be a party drug as didnt really get a euphoric high from it, but for a group of friends chilling at home or outdoors it would be great.  Having said that I tried the experience alone and found it a great experience. ",
  "Not sure why second hit took so long to arrive, possibly wrapped too tightly in the paper.  I certainly would suggest the bomb method as this stuff is seriously nasty on the nose."
 ],
 "erowid": {
  "id": "83806",
  "citation": " RA. \"Nasty on the Nose!: experience with 4-Methylmethcathinone (ID 83806)\". Erowid.org. May 8, 2010. erowid.org/exp/83806",
  "substance": "4-Methylmethcathinone",
  "views": "4416"
 }
}
