{
 "title": "The Effect Of Extreme Nothingness",
 "author": "Bachmeister",
 "citation": " Bachmeister. \"The Effect Of Extreme Nothingness: experience with Fentanyl (ID 12535)\". Erowid.org. Feb 12, 2002. erowid.org/exp/12535",
 "substance": "Fentanyl",
 "bodyweight": "125 lb",
 "header": [
  "DOSE: T+ 0:00",
  "50 ug",
  "transdermal",
  "Pharms - Fentanyl",
  "(patch)",
  " T+ 1:00",
  "50 ug",
  "transdermal",
  "Pharms - Fentanyl",
  "(patch)"
 ],
 "report": "<p>[50 ug per hour for 72 hours]</p><p>I obtained a few patches of 50ug per hour fentanyl after my friends father died, along with a nearly full 4 ounce dropper bottle of Morphine Sulfate.</p><p>I had good experiences, for the most part, with the morphine though the sides effects increased exponentially with continued use. After I ran out of the precious morphine I decided to try one of the Fentanyl patches. I had no idea what I was about to endure. I placed the patch under my armpit and felt nothing for at least the first 3-4 hours. It gradually began increasing in intensity and I began to feel numb. I went to sleep peacefully and slept for over 12 hours, still wearing the 72 hour patch.</p><p> Upon waking I actually felt very good and my body was painlessly comfortable. I remember waking up and smiling at the pillow. The numbness that I had felt before had increased to an almost nitrous like intensity, but I found my mind lucid yet deeply intoxicated. As soon as I tried to get out of bed I found that I was nearly unable to get out of bed. When I did stand up I immediately had to lie down due to overwhelming vertigo and nausea. It felt very different from the morphine, much more debilitating and less euphoric. I felt as if I had underwent major surgery, which of course is appropriate as it is often used as a powerful anesthetic. Like the package said, 'For post-surgical administration only under strict medical supervision'.   </p><p>Nonetheless, I let the patch remain and sat still the ENTIRE day. I was trying to overcome the dizziness and nausea but found it impossible to resist vomiting. I never vomit (I have consumed ipecac syrup and not thrown up) but I absolutely had too. I only vomited once. That evening I removed the patch, fully understanding that it was devoid of any recreational benefits. Perhaps extracting the fentanyl for immediate low dose ingestion could be more fun, but I would say morphine or heroin is more euphoric.</p><p>  Since I have never used IV heroin (only smoked) I found the fentanyl useless for my purposes; it was far too strong and dissolving. Yet I would expect experienced heroin users would find the effects satisfyingly powerful. I honestly don't think it gets you high but rather produces the effect of extreme nothingness.</p>",
 "year": "2001",
 "id": "12535",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-02-12T08:00:00.000Z",
 "views": "42852",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "50 ug",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "50 ug",
   "administration": "transdermal",
   "substance": "Pharms - Fentanyl",
   "form": "(patch)"
  }
 }
}
