{
 "id": 12561,
 "title": "Too Many Side Effects",
 "date": {
  "submission": "2009-11-17T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "A in Sweden",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "4-Fluoromethcathinone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Methedrone is soon to be scheduled as a class A drug. A successor, Flephedrone, aka 4-FMC or simply 'Flephe' amongst users, was introduced here last week, though it has been available elsewhere internationally. As of yet uncertain if it will catch on. I've read some mixed reviews so far. Bioavailability is said to be poor, it crosses the blood-brain barrier only with difficulty. Quite a few people have tried it already and there are one or two dozen posts on [forum] concerning its effects. Most reports I've read are sketchy and often contradict each other, so it seems that effects vary considerably between users.",
  "Effects",
  "One person, 30yo male, reports what sounds like very intense vasoconstriction after oral ingestion of 400mg (approximate, several doses spread out over 1.5 hours). The subject belives that 4-FMC has too many side effects while the sought-after effects are not prominent enough to make it worth while using. He reports pain and feelings of",
  "numbness in all extremities, intense tingling sensations and extreme sensitivity to touch, where even slight contact causes intense pain. Dizzyness, even feeling faintish periodically. Hand & feet freezing cold. Intermittent attacks of nausia. Unusually intense bodily (muscular) stiffness. Headache. Though the user claims to be generally",
  "sensitive to stimulants and ill effects thereof, he still points out that the side effects experienced with 4-FMC where more intense than usual. Claims to have a good amount of experience with other stimulants, legal and illegal alike.",
  "Many others who tried 4-FMC share this negative view of it, though their experiences aren't as uniformely bad. However, it's hard to discern any sort of majority opinion, (positive/negative). Others users report positive experiences; euphoria and empathogenic effects similar to MDMA, as well as traditional stimulant effects.",
  "Regardless of what view users have of this drug, negative or positive, most of them seem to agree that the effects are more long lasting than Mephedrone. (up to 5 hours compared to 2 hours for Mephe)."
 ],
 "erowid": {
  "id": "84061",
  "citation": " A in Sweden. \"Too Many Side Effects: experience with 4-Fluoromethcathinone (ID 84061)\". Erowid.org. Nov 17, 2009. erowid.org/exp/84061",
  "substance": "4-Fluoromethcathinone",
  "views": "11318"
 }
}
