{
 "id": 12581,
 "title": "Why Smoke Weed?",
 "date": {
  "submission": "2010-06-23T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Max10909",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "11 mg",
   "administration": "insufflated",
   "substance": "2C-P",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Its right after school around 3 oclock and my friend texts me. Wanna trip? I call him and say yeah I have money and head over to his house. I cough up 20 bucks and he gives me a little clear capsule. I was immediatlly pissed off because it felt and looked empty. he promised it wasnt and split it apart on a cd case. There it was, a fine white powder about 1/4 the size of an eraser on a pencil.",
  "So I got a dollar bill and snorted it. The first and only thing I notice it the burn. My nose burns so hard I tear for 10 minutes and my throat burns terribly for another 20. WTF did I snort? battery acid? so I was starting to get mad and I stand up to go push him against the wall. lo and behold, I cant stand up. I lay back, still tearing, to notice the ceiling swirling like food coloring in water. I feel a certain haze come over my body.",
  "Everything is so interesting. Smooth has never been this smooth before, red has never been this red before. There is motion blur and trails when I look around. The sun outside looked beautiful. The bed I lay in was so damn comfortable. it was like I was on a differnt planet. My thoughts were noticablly high too, I couldnt make a straight sentence, but my actuall ideas were genious and inciteful.",
  "Certain sounds I didnt hear at all, while the softest ones were the most prevalent. I could tell my friends amps were on in the garadge when I was upstairs. And that was me hearing the barely auidable static. When I had to leave and I was in public, it looked as if everybody knew I was high. But thats just paranoia I guess.",
  "Its 8 oclock and Im eating alone wondering when I would stop tripping balls. I go upstairs to my room alone. I draw pictures for hours. I usually dont draw that much, but last time I did shrooms I couldnt remember all my deep thoughts so I felt like recording them. I stopped tripping hard at around 4 am. So I had a complete 12 hour trip. Why smoke weed? this shit is un regulated, doenst show up on tests, fucks you up 3 times longer, doesnt make you tired, and doesnt smell for hours later when you do it.</p>"
 ],
 "erowid": {
  "id": "84241",
  "citation": " Max10909. \"Why Smoke Weed?: experience with 2C-P (ID 84241)\". Erowid.org. Jun 23, 2010. erowid.org/exp/84241",
  "substance": "2C-P",
  "views": "9209"
 }
}
