{
 "id": 12588,
 "title": "It Was Entertaining",
 "date": {
  "submission": "2001-11-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Thwar",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "9.5 g",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "tea"
  },
  {
   "time": "0:10",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "1:40",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "2:30",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "3:00",
   "amount": "225 mg",
   "administration": "oral",
   "substance": "Tramadol",
   "form": ""
  },
  {
   "time": "3:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": "3:20",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "6:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "7/28/01",
  "This report was started at T+50 minutes",
  "First tried to make tea about 3 weeks ago. I replaced two tea bags with a total 10 grams of powdered poppy pods. Boiled for like 10-15 minutes pushing the bags around and such. Split the tea two ways. Me and my friend drank it and didn't feel much more than high from the herb consumed. Thought i might have felt it but only slightly.",
  "Tonight i decided to make it more like how i had read. One person boiled 1 cup water in microwave, then dumped in 3 grams powdered poppy pods.",
  "let steep for 15 minutes, strained, and drank. He said it felt like a little more than a percocet. That sounded promising. I remember reading a while ago a lot of reports saying putting lemon juice in the water would extract everything out better.",
  "I decided, based on previouse experience with hydrocodone and a few other opiates, that i would require a little extra. I decided to triple the dose of the one i had read.",
  "T-30min - boiled 1 + 1/2 cups water with ~1tbs lemon juice on stove",
  "T-20min - dumped in 9-10grams powdered poppy pods and turned off stove let steep for about 15 minutes",
  "T-5min  - strained with basic fine plastic mesh strainer, left some sediment, it went into solution if the glass was swirled, it was a yellow tan brown color, smelled bitter",
  "T+0min  - drank vile yellow brown liquid, tasted bitter and slightly sour from the lemon, just enough nasty taste to be hard to swallow, chased it with apple juice and a peanut butter kudos bar, worked well",
  "T+10min - stomach seams ok, smoked kind stomach medicine just in case",
  "T+20min - took about a 25 minute shower, felt great, high, not sure if anything else",
  "T+50min - started writing this report, everytime i look at my hand there apears to be a bar of light over my fingers, strange, goes away within a fraction of a second, guess that was good bud",
  "T+1h\t- feel good, kinda heavy, read about a feeling in back of neck, sorta feel that, though not sure if it is just me thinking about it, I keep mispelling stuff",
  "T+1:15  - strong pain in lower stomach, tolerable, not like a vomiting feeling wich is good, still feel high maybe heavy too, pinch myself and feel little pain",
  "T+1:35  - feel altered, it feels like it is fading then it comes back, it is an odd feeling, somewhat annoying almost",
  "T+1:40  - open up a bud light long neck (born june 1, 2001), hopefully this will increase effects, though i read one report it made them through up within 5 minutes, we'll soon see, tastes alright",
  "T+2h    - beer done, no extra nausea, except maybe from the nasty beer/poppy burps",
  "T+2:30  - feel strange slightly off, kinda just a mild alcohol buzz, feels like the herb has worn off start ingesting beer number 2, bud light can (born same day!)",
  "T+3:00  - beer 2 done, no real rise in effect, decide to ingest 225mg tramadol, has a nice general sedative feel to it after a couple hours, couldn't hurt",
  "T+3:20  - smoke kind herb, started beer 3, feel high, not sure if i can even still feel the poppy tea no nausea for a while now, only one short bout of nausea at all",
  "T+3:45  - beer 3 done, feel alright, probably go to sleep here in a bit",
  "T+4:10  - tired",
  "T+4:30  - think I might try to sleep",
  "T+5h\t- instead of sleep decide to roll a cigarete, half kind half shwag",
  "T+5:10  - noticing some itching lately within the last hour or so",
  "T+6h\t- smoked some kind herb, don't think i can feel anything from anything other than the herb. But I just pinched myself and I am very numb to pain",
  "Well it seemed to come on strong to begin with, though i was high too. It didn't last more than 3 hours. Perhaps the sludged strained off should be eaten to get everything out of it.",
  "I hope this wasn't a strong dose and morphine just doesn't do much for me. I remember reading about how a lot of people find heroin boring. Hydrocodone, even in large doses is pretty boring for me.",
  "Over all it was entertaining. I think next time i will try to tuff out the nausea with no herb. So I can just feel what the tea is gonna do to me."
 ],
 "erowid": {
  "id": "8428",
  "citation": " Thwar. \"It Was Entertaining: experience with Poppy Tea, Cannabis, Alcohol, Tramadol (ID 8428)\". Erowid.org. Nov 10, 2001. erowid.org/exp/8428",
  "substance": "Poppy Tea, Cannabis, Alcohol, Tramadol",
  "views": "29676"
 }
}
