{
 "id": 12583,
 "title": "Don't Take Too Much",
 "date": {
  "submission": "2010-10-12T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "DailyTripper",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "JWH-018"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  },
  {
   "time": " T+ 2:00",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes"
  }
 ],
 "report": [
  "Here is some information on my psychoactive use, I am a regular user of Marijuana, Mushrooms, and Alcohol, I have done N,N,DMT, LSD, Ketamine, MDMA, Cocaine, Heroin, and many pharmaceuticals. I ordered a gram (1000+mg) ('99.5% pure') of JWH-018 from a trusted site. After nine hours of trial and error of finding a good dose (3-5mg) I was extremely 'high', I would say I did around seven 3-5mg hits (I didn't have a scale, so I divided my gram into around 400 tiny key bumps).",
  "Next day I woke up at around 11:30 am, oddly I was feeling great very energized (not like I would after a day of smoking some really nice bud). So I was like what the hell I'll just wake and bake (bad mistake), as I had forgot I woke up early in the morning and did a hit to help me go back to sleep. So I loaded up a dose about that I would say was 7mg (it was a normal dose and a half) that was my second mistake.",
  " (T)11:45",
  "After I dosed I smoked a cigarette, then I noticed something odd, I was the highest I've ever been in my life, it wasn't bad at the time...",
  " (T)12:?",
  "Then things turned for the worst, I started noticing some intense visual like I would get from mushrooms (things growing, morphing etc) that's when I knew something was wrong, I started getting this ringing in my head... it got louder and louder and louder, until I felt like there was a heart inside my head that was beating like a drum...",
  " (T)12:45",
  "I started feeling some nausea, so I went to the bathroom... last thing I remember was the room was spinning and it was like a full on mushrooms peak (colors and geometric shapes where moving all along my morphing walls)",
  " (T)?",
  "I woke up on my bathroom floor, with the drum beating in my head again at the loudest its ever been (I thought I was about to die) then suddenly it stopped, I was completely fine, I was not high anymore at this point (so I thought...) I decided I would jump in the shower, (taking a shower always helps me relax or calm a bad trip)",
  " (T)1:30",
  "After getting out of the shower I smoked a cigarette and sat on my couch and watched some tv, but for the next hour, every like 5-10 minutes my head would start having the drum beat inside of it and I would be tripping my balls off, eventually it went away.",
  " (T)3:30",
  "I eventually became sober (feeling great, and energized)",
  "My brother had some of the same effects when he did around a 7mg? hit, except he kept seeing his closest door open (when it was closed) and some monster thing in there..lol",
  "SO some fair warning I would suggest NOT doing over 5mg of pure JWH-018."
 ],
 "erowid": {
  "id": "84250",
  "citation": " DailyTripper. \"Don't Take Too Much: experience with JWH-018 (ID 84250)\". Erowid.org. Oct 12, 2010. erowid.org/exp/84250",
  "substance": "JWH-018",
  "views": "6367"
 }
}
