{
 "id": 12592,
 "title": "Impressions from Several Experiences",
 "date": {
  "submission": "2010-03-26T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "21st century 1776er",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "substance": "5-MeO-DALT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I thought I would add this information, that I overheard on the bus, to what is out there on this recently discovered substance. ",
  "The material labeled '5-MeO-DALT' was obtained from a chemical supply company and appeared as needle-like crystals, optically translucent, and with white coloration.  The scent from the material was like that of indole but faint.",
  "Inital experimentation was in line with the suggestion from the Shulgin article, 20 mg oral.  Effects set in rapidly, and creativity was stimulated.  Comprehension of complex mathematics was not impaired.  Slight visual disturbances were noted.  Subjective feelings of aesthetic appreciation were enhanced.  Experience lasted about 5 hours.  Caffeine and nicotine may have affected the experience.",
  "5 mg of the substance was heated gently in a test tube and some of it vaporized, the fumes were inhaled briefly.  The taste was repulsively bitter and the exposed areas inside the mouth were irritated for some time.  Onset was immediate. Visual disturbances were more pronounced than those experienced from 20 mg administered orally.  Effects faded within ~3-4 hours.  Amphetamine, nicotine, and JWH-018 may have affected the experience.  Smoking/vaporising this substance is not recommended.",
  "Initially 5mg were insufflated.  15 minutes later an additional 15 mg were insufflated.  The most memorable aspect of this experience was significant gastrointestinal discomfit that set in within an hour of administration.  Disturbing darkly colored patches in the subject's feces were noted.  Insufflation of this substance is probably quite dangerous and it is not recommended.",
  "The final two experiments were with oral administration of 35 mg and 40 mg of the material.  Touch, smell, taste, sight, and hearing were all affected in interesting and pleasant ways.  Subjective level of sensual appreciation was enhanced.  Visual disturbances were much more intense than with the 20 mg oral experience.  Both experiences lasted about 5 hours.",
  "Please be careful with this information."
 ],
 "erowid": {
  "id": "84328",
  "citation": " 21st century 1776er. \"Impressions from Several Experiences: experience with 5-MeO-DALT (ID 84328)\". Erowid.org. Mar 26, 2010. erowid.org/exp/84328",
  "substance": "5-MeO-DALT",
  "views": "9243"
 }
}
