{
 "id": 1260,
 "title": "AMT Rollercoaster",
 "date": {
  "submission": "2002-04-04T08:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:00",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:10",
   "amount": "5.0 mg",
   "administration": "insufflated",
   "substance": "AMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "10:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I started off by taking 25mg orally.  I washed it down with a soft drink.  The taste was not good but did not linger at all.  Within about an hour i felt like i was on some form of speed.  I could not sit still.  I was extremely talkative.  After about an hour i snorted approximately 5mg.  The burn was intense but subsided quickly.  My mind started to slow down a little and everything in the room started pulsing.  After another hour i snorted another 5mg. ",
  "My friends were talking about how they felt like they were on mdma.  I was skeptical because i wasnt feeling anything like that.  10 minutes later i understood everything they were saying.  I had a sense of calmness and felt like i should look out for and take care of everyone in the room.  Once i felt that, i decided to snort 5 more milligrams. ",
  "After the last i snorted i started to get visuals.  the walls were flexing and the floors were swirling.  I would have to say be careful though.  I found it easy to dehydrate.  I didnt get thirsty i just felt kind of sick to my stomach and my head had a slight throb.  I drank some water and felt fine. ",
  "Another thing i noticed was the willingness to do any form of drug.  I probably would have kept doing it if we hadnt of run out.  I remember taking some ibuprofen for a headache and thinking to my self 'if 2 are good then 10 are better.'  It was very startling.  After about 10 hours i decided to try and get some sleep. ",
  "I smoked a few bowls and noticed that it brought everything back to a previous level.  I finally went to sleep.  For the first part of my sleep i was lucid dreaming.  I could control every aspect of my dream.  When i woke up i felt fine.  I would definately try it again."
 ],
 "erowid": {
  "id": "13736",
  "citation": " anonymous. \"AMT Rollercoaster: experience with AMT & Cannabis (ID 13736)\". Erowid.org. Apr 4, 2002. erowid.org/exp/13736",
  "substance": "AMT & Cannabis",
  "views": "8021"
 }
}
