{
 "id": 12606,
 "title": "Vasoconstriction",
 "date": {
  "submission": "2010-03-22T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "chloric_icon",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "0:00",
   "administration": "oral",
   "substance": "2C-E",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "Pharms - Phenazepam",
   "form": ""
  }
 ],
 "report": [
  "I feel it my responsibility to inform 2c-e enthusiasts that all the stuff I read about it being safe to take way more than a normal dose was bullshit -- or at least if you're planning on throwing Methylone into the mix.",
  "Last night I eyeballed a 40 mg 2c-e dose from a 500 mg baggie. I'd been using methylone all day. I expected some mild leg spasms since the methylone had exhausted my muscles, but nothing else. About 2 hours into the ride my palms were purple and beating. They ached. My veins ached too. My knee caps were purple. My legs were turning blue. Moving around wasn't helping. My body was ice cold. I put my hand on my chest--I was having heart murmurs. 'Why is this happening?' I kept asking myself. Everything online said it was practically harmless to use 2c-e irresponsibly. Well, that's the last time I trust anything written on forums etc. about a drug's safety. Luckily I had some Phenazepam on hand. I took 5 mg and over the next twenty minutes my heart started to relax, I got the color back into my legs, and my body stopped feeling like an ice box.",
  "Moral: Don't think it's safe to take stupid doses of 2c-e, and don't use LOTS (like grams) of Methylone before, with or after using 2c-e. If I had not had that Phenazepam around I would have either died or suffered irreperable heart damage (I might have already in fact). Trip safe everyone : )"
 ],
 "erowid": {
  "id": "84417",
  "citation": " chloric_icon. \"Vasoconstriction: experience with Methylone (bk-MDMA) & 2C-E (ID 84417)\". Erowid.org. Mar 22, 2010. erowid.org/exp/84417",
  "substance": "Methylone (bk-MDMA) & 2C-E",
  "views": "11086"
 }
}
