{
 "id": 12615,
 "title": "Useful Healing Tool",
 "date": {
  "submission": "2012-12-10T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "8bitshaman",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "seeds",
    "quantity": "10"
   },
   "administration": "oral",
   "substance": "H.B. Woodrose",
   "form": "seeds"
  }
 ],
 "report": [
  "It is approx. 9 AM on a cool February morning. My mind is clear, yet stressed by some vague sense of anxiety. Resolved to overcome this elusive sense of foreboding, I decide to take a journey of self-overcoming and healing.",
  "At 8:30, I begin chewing and swallowing the seeds; by 9:00 I am finished.",
  "For the next several hours, I sit in my apartment living room contemplating the world beyond my window. I appreciate the micro-community surrounding me, and start to contemplate the wonder of human civilization.",
  "Around this time, I fall into a deeper state. I walk from room to room, as if searching for something. Standing before a tibetan tapestry, I marvel at the rich interplay of colors, shapes and patterns.",
  "At this point, I decide that I would like to experience life outdoors. I carefully make my way to a nearby park. Sitting in the open, I somehow feel communion with the land itself. It is almost as if my presence here is absolutely essential, as though I am part of an intricate scene from a jigsaw puzzle.",
  "Then, as if a thunderbolt strikes my mental state, I realize that I have unfinished business. I rush back to my apartment to find my cell and then return to the park. At this point, I feel uncoordinated and am prone to wandering aimlessly. I settle down beneath a pair of tall, towering evergreens and make my call. The call itself entailed a long-overdue promise/apology to an old friend. The conversation was lucid, and with great resolve.",
  "I smoke a couple of cigarettes and take in the surroundings. Once again, there is a great sense of being one with the earth, the trees and the sky overhead. I could feel the life of the trees embracing me, the solidity of the ground underfoot, and the light of the sky breaking through the branches high overhead. We were all as a family; it was as if the elements of nature around me took on very real and tangible identities.",
  "I leave, feeling blessed by the great majesty of nature. I return home; yet there are differences. The rooms now seem very vast, yet very finite. The next moment, the rooms seem very small, yet infinite. It all depends on the perspective.",
  "Then all at once, something happened. It was as though that rational part of my mind which asserts itself as a true and fixed identity crumbled into dust. I could see myself in my mind's eye independent of attraction or aversion. I realized that my failures and anxieties were no more concrete than the ego that manufactured them. Yet, that ego was gone.",
  "I sat in the encroaching dusk to bask in this revelation. Several hours later I decide to turn on cable news. Clips from the state of the union were being shown; yet the audience was vastly different from my previous recollection. The congress would rapidly desaturate before my eyes, transforming into a simple color scheme. Additionally, the members of congress would blend into three or four people. In other words, the many would merge into few. There would be many thousands in the audience; moments later there would be only a handful.",
  "Realizing that the daily news made little sense in my non-ordinary state, I decided to sleep. As I drifted off, vibrant geometrical patterns scrolled in my mind's eye as if an organic screensaver."
 ],
 "erowid": {
  "id": "84481",
  "citation": " 8bitshaman. \"Useful Healing Tool: experience with H. B. Woodrose (Hawaiian Strain) (ID 84481)\". Erowid.org. Dec 10, 2012. erowid.org/exp/84481",
  "substance": "H. B. Woodrose (Hawaiian Strain)",
  "views": "4325"
 }
}
