{
 "id": 1262,
 "title": "Happiness Now Comes In Bottles",
 "date": {
  "submission": "2007-06-21T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "IowaPunker",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Methamphetamine",
   "form": "powder / crystals"
  },
  {
   "time": "0:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "pill / tablet"
  },
  {
   "time": "0:00",
   "amount": "3 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "10:00",
   "amount": "1.5 g",
   "administration": "smoked",
   "substance": "Methamphetamine",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "First hand, I want to say that I've always loved to read, and combined with my interest in drug experimentation, I know enough about pharms and illicit drugs to amaze even the most experienced drug users. I've read almost every medical book worth reading. So when I sprained my ankle falling down stairs one night, and the doctor prescribed me Hydrocodone / APAP (Vicodin) for the pain, I knew exactly what they were.",
  "7:00 P.M.--It was a pretty slow night in my old third-floor apartment that blissful night. My friends and I were starting to come down from a 2-night run on meth. To avoid the unpleasant letdown effects of meth, I took two of my Vicodins and started gulping beer. My prescribed dose was one tablet as needed for pain, but one tablet never induced any 'down' effects. So I doubled the dose.",
  "7:30 P.M.--Just as the pills begin to take effect, I'm finishing my second beer. The throbbing pain in my ankle had ceased, but the mental effects were what really amazed me. Any tweeker knows how bad it sucks to come down from meth, but when the Vicodin took over, wow. I never felt more cheerful in my life. My face glowed with a cherubic pink color from what my friends told me, my whole body kept getting these warm (not hot) flashes. Positive vibrations were building--like everything is ok and always will be.",
  "8-9:00 P.M. The peak effects start hitting me during this hour. I become giddy, laughing at stupid shit as if I had smoked some potent weed. I feel warm, jelly-like, and jolly. Cigarettes taste very smooth and flavorful. I am chain-smoking by now. I figured the stuff would really knock me on my ass after being awake for two nights on meth, but it didn't. It only boosted my spirits.",
  "9:30 P.M.--I risk drinking another beer, being careful because I knew about the toxic effects that mixing alcohol with downers could cause. But it only heightens my feelings of awesome euphoria. I'm feeling so good that I decide to let my friends in on the Vicodin experience. I give each of my three friends two pills. They experience pretty much the same effects as I. We're having a blast.",
  "12:00 A.M.--The same feelings progress as the hours pass. By now I'm feeling drowsy. My girlfriend and I decide to go to sleep. We lay in my bed feeling drowsy as hell but not able to fall asleep.",
  "2:00 A.M.--We keep drinking beers and smoking cigarettes to pass the time. Finally we get up and decide that we'll sleep when our bodies let us. We come out in the living room to find everybody else still awake too. It's weird--all the effects of a good muscle relaxer but it keeps me awake.",
  "5:00 A.M.--We are blessed by the return of our meth dealer. We each by nice fat 1/2-gram bags. A little over 1-1/2 grams between all of us. We load up the glass 'dick' and smoke till we are spun again.",
  "Day broke and we were amped till around noon. Finally a lack of sleep and the pills and beer caught up to me. I fell asleep with a burning cigarette in my hand. Luckily my hand that was holding the cigarette was hanging over the edge of the bed, and that my floors were made of asbestos tile. Otherewise I would not be here to share this awesome experience with you.",
  "I strongly recommend taking at least two Vicodins in combination with a few alcoholic drinks to completely 'zap' the unpleasant feelings of anxiety, apathy, guilt or whatever that you may feel when coming down from meth."
 ],
 "erowid": {
  "id": "13744",
  "citation": " IowaPunker. \"Happiness Now Comes In Bottles: experience with Hydrocodone, Alcohol & Methamphetamine (ID 13744)\". Erowid.org. Jun 21, 2007. erowid.org/exp/13744",
  "substance": "Hydrocodone, Alcohol & Methamphetamine",
  "views": "17090"
 }
}
