{
 "title": "Ominous Hallucinations",
 "author": "Zmarsx",
 "citation": " Zmarsx. \"Ominous Hallucinations: experience with Coffee (ID 12635)\". Erowid.org. Mar 24, 2006. erowid.org/exp/12635",
 "substance": "Coffee",
 "bodyweight": "115 lb",
 "report": "<p>I had been having a very stressful week, and had been behind in all my work.  One day I decided to drink some coffee and finish most of the work do for my classes the following day.  So in preperation, I went to the store and bought about half a pound of coffee beans.  In order to garauntee premium caffeine content, I mixed all of the non-decaf beans together. </p><p>After I got home I took a nap and woke up at 10.  After doing a bit of work, I brewed 4 cups of my premium coffee blend.  It was amazingly strong.  It tasted at first like cinnamon, but had an aftertaste like onions.  It kept me awake and I finished what I needed.</p><p>It was late and I did not want to stay up more than I had to, so I layed down.  I put on some Bad Religion and tried to go to sleep.  It took a while, but I eventually slipped into a slumber.  While I was sleeping I felt a massive jolt of energy surge through my body, not wholely unpleasant, but startling.  Suddenly my eyelids starting blinking at an inhuman rate.  I remeber staring at my wall, waiting for it to move.  I got lost in its endless pattern of tiny bumps.  I guess I'd call the experience ominous hallucinations.  I looked around my room, everything seemed ready to contort violently, though nothing did.  My eyes were still blinking rapidly.  I turned again on my side and tried to fall back into a more tranquil state.  The dream that I had was one of the most realist I have ever experienced.  Part of my bedroom turned into my algebra classroom, and I talked to my bassist joseph for a little while, then I returned to my bed and went back to sleep.  I can't recall our conversation.  It all seemed a bit odd at the time but nonetheless real.  Also, after only 2 hours of sleep I felt quite well rested in the morning.</p><p>Peace to all</p>",
 "year": "2002",
 "id": "12635",
 "gender": "Not Specified",
 "age": "Not Given",
 "timestamp": "2006-03-24T08:00:00.000Z",
 "views": "12834",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "4 cups",
   "administration": "oral",
   "substance": "Coffee",
   "form": "(liquid)"
  }
 }
}
