{
 "id": 12635,
 "title": "SOPORIFIC",
 "date": {
  "submission": "2004-02-09T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "The Blaze",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclobenzaprine",
   "form": "pill/tablet"
  },
  {
   "time": "1:23",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Cyclobenzaprine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "NOTE: This report was written as I was going through the experience in order to illustrate what goes on in the mind of a user.",
  "As usual I got sort of bored. Ive been awake for days, only taking a few naps here and there for about an hour each time. Tonight Ive had enough of doing nothing, so at 9:32 pm I took two 10 mg pills of cyclobenzaprine (marked: GG 288). Around 9:50, I notice some slight dizziness accompanied by the feeling that theres something brewing inside my skull. Feelings subside at 10:05. At 10:21, I become aware of my head getting heavier, and I have to exert myself just a little in keeping it up as Im typing. Its 10:38 and I think I made a big mistake, I should have taken at least 5. Now instead of walking on jell-o, I have to settle for a headache. I should take more...that is a good idea.",
  "I took 2 more around 10:55, then I eat a brownie. The onset of the second set of pills is identical to that of the first set.  Nothing really interesting about this pharmaceutical tomorrow Ill probably take 6 at once first. I think today was a waste.",
  "Oh, I think I was wrong. I dont know which set kicked in or what, but it hit me at 11:24. I couldnt keep my head up, and I got really tired. At the moment, I can feel a minor squeeze on my forehead.. like I was wearing a hat. I got up for a minute and I could feel that the medicine has taken effect on my legs. They felt more relaxed, but balance was surprisingly not that much of a challenge. I was still ok, somewhat. Sleepy as hell though. I started to yawn at like 1 minute intervals. Also, it is important to note that Ive been listening to some music all throughout the experience so as to speed up the time.",
  "11:50 there has formed a strange feeling around my forehead region, almost as if I had been upside down and blood had been rushing to my head.",
  "11:54 its getting pretty hard to keep my eyes open. Its become a struggle to stay awake. I think I might walk over to the couch and lay down",
  "Its July 30th. As I was resting on the couch that night, I could feel having irregular heart patters yet I couldnt feel the heart itself beating. Additionally, I felt very weak as if my heart was about to stop beating (in an unpleasant way). It was a feeling beyond description. It was like my heart was taking breaks after each set of beats. The feeling was somewhat comparable to that of my soul being gently ripped out of me. Eventually, I fell asleep.. or rather, I was knocked out by the pills.",
  "Around 1am I had woken up. I was a total mess. My arms (and hands) were numb and I could hardly move around. I only sat up, poured myself a drink out of a bottle into a glass and had a sip. My thoughts were also blocked off. It was like I was using the maximum of my brain power just to think about moving my arms.. and I dont even remember having any legs. Afterwards, I laid back down and immediately fell back to sleep.",
  "The next time I came back to consciousness was around 4:10. I finally got back to my strengths. I could still detect my heart having a hard time, but I was fine. It was all over. I slept till 5:22 pm."
 ],
 "erowid": {
  "id": "8462",
  "citation": " The Blaze. \"SOPORIFIC: experience with Cyclobenzaprine (ID 8462)\". Erowid.org. Feb 9, 2004. erowid.org/exp/8462",
  "substance": "Cyclobenzaprine",
  "views": "65704"
 }
}
