{
 "id": 1264,
 "title": "Luckier Than Seven In My Mind",
 "date": {
  "submission": "2002-04-10T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "FlowGnome",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Even though it is no longer available in the US, I had wanted to try 2C-T-2 for a long time...  not sure why really, call it a quest, some weird desire to try every substance known to man in large quantity and live through it.",
  "I had tried 2C-T-7 when it was around, and in fact the 'Fractal Reality' report on this site was authored by me, describing a particularly difficult experience with that substance, one that turned me off to phenethylamines in general for a long time.   Anyway, after searching at great length I found a very expensive overseas source of 2C-T-2, and decided to make an order, so that I could at least try it once.  And so the story goes:",
  "25mg of 2C-T-2 powder was ingested on an empty stomach, late at night. My companions for the night were to be partaking in two of my least liked substances; cocaine & marijuana.   Still, I knew they would be up with me the whole time, and would sympathize with my pain if it turned out anything like our 2C-T-7 trips of the year before.",
  "About 30 minutes into it I felt a slight alert, and then a slow buildup to what you might call the peak at the 2 hour point.  The visuals were slow and wavy, and I think perhaps weakened quite a bit by a mushroom trip 3 days earlier.  None of the extreme body load I got from 2C-T-7 was present, no nausea, no discomfort, nothing, but an MDMA like warmth, and friendly, albeit minor, flowing visuals.   I wish I could say that I found something profound in this substance, probably it was the company, but it was more of a recreational, laid back trip than 2C-T-7, with none of the insane mental funhouse effects or insanely detailed geometric visuals.  These visuals were more flowing, much closer to mushrooms than anything else I've had experience with, although still with a different type of 'glimmer' and less color enhancement. ",
  "I stayed up playing cards with my friends, and watched a very interesting scratch video called Wave Twisters starring Q*Bert, that everyone should probably go out and see right now.  The visuals lasted maybe a good 3 hours, and then gradually tapered off into a dreamy afterglow period.  Some muscle tension became evident at this point, but it was time for my usual dose of Klonopin anyway, so this was relieved and sleep was had easily at maybe T+ 7 hours. ",
  "Although I didn't get as strong of effects as I desired, I'm now even more saddened that the actions of so many irresponsible individuals are keeping suppliers in the US from selling the 2C compounds anymore.  The taste I got of this showed much promise, but because of costs and who knows what upcoming laws this will probably be my only time trying it.  It did restore my faith in the phens.  It's amazing how many people ranted on about how good 2C-T-7 was and ignored this gem.  ",
  "Anyway, that's it, not much of a report, but I suppose a good report requires a wonderful trip."
 ],
 "erowid": {
  "id": "13747",
  "citation": " FlowGnome. \"Luckier Than Seven In My Mind: experience with 2C-T-2 (ID 13747)\". Erowid.org. Apr 10, 2002. erowid.org/exp/13747",
  "substance": "2C-T-2",
  "views": "10366"
 }
}
