{
 "id": 12659,
 "title": "Very Pleasant, Floating, and Relaxed Gassy",
 "date": {
  "submission": "2001-08-01T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "EarlyMan",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "2.0 g",
   "administration": "oral",
   "substance": "Lotus/Lily - Nymphaea nouchali var caerulea",
   "form": "extract - 5x"
  },
  {
   "time": "1:00",
   "amount": "joints/cigs",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I've been reading about Blue Lotus but not finding a whole lot of information so I decided to give it a try.  I ordered 30g from Louisville Botanicals and received my shipment just yesterday. The stuff arrived in a heavy ziplock bag and was a 5x extract powder. It was tan in color and did not have much of a smell.  After reading all of the trip reports here on Erowid, I decided to do both the tea and smoking it.  I began with the tea.",
  "I boiled enough water for 2 tea cups.  I measured out 2 grams of Blue Lotus powder and stirred it into the hot water after I poured the water into the mug.  I made 2 cups; one for me and one for my girlfriend and we both had 2 grams of product in the tea.  I let the tea sit for 20 minutes. Please note that I did not use any tea bags or anything like that, I just put the powder in the water and it disolved nicely.  I added a little sugar to taste.  We very easily downed the mugs within 2 minutes if that as the water was cooling after sitting for 20 minutes.  The flavor was not bad at all and went down very easy.",
  "After this, I began making dinner.  I wanted the tea to go down on an empty stomach.  About 45 minutes in, I began to feel lightly hazed as if I had maybe 4 hits of decent weed.  I tried packing a bowl of Blue Lotus, but being that it was a powder, I could not get any oxygen through it to smoke it.  I did get a little to burn but I never got much smoke off it and I might have only gotten about 1/2 gram to burn/smoke.  I decided the powder is not good for smoking and I would like to get some dried plant matter to smoke and save the powder for tea.",
  "1 hour in, we decided to roll up some MJ and smoke. My girl and I blazed a half of blunt and put it out. Therefore we each had 1/4 of the blunt.  I was definitely feeling the 'high' feeling from the MJ and I was also feeling a distinctly different FLOATING AND RELAXED GASSY feeling.  We were watching Chris Rock on HBO doing his stand up comedian material and I have never laughed harder in my life. I say this so that you know I probably had extra endorphins floating around inside me. Maybe the 'high' also made me that much more giddy..",
  "I laid back and cuddled a bit with my girlfriend.  She was NOT experiencing the same as me.  She felt the tea buzz like I did but the cannibis did not facilitate anything more for her and as a matter of fact she didnt even get all that high on the weed.  When I laid back and closed my eyes, I kid you not, I swear I was doing double back flips through the clouds!  I felt so DRIFTY, so SEDATE, so FLOATY and peaceful.  I felt as if I had been professionally gassed in an anesthetic way.  I swear you could have pulled six of my molars and showed them to me and I probably would have grinned and said something like 'neat'.  This was definitely different than what I experience on weed and I could feel the two working together. I also had some visual disturbances- I saw blue trails when my girlfriend hit her blunt and then her hand went down, it was followed by bright blue trails.  I also saw very slight colored trails when I shifted my eyes from one object to another. I also kept seeing something 'flying around' just out of vision up in the air in my apartment. I swear there was either a moth or a fairy flying around but I could never put my eyes on it. It was just a dark little shadow that would zoom around from time to time up near the ceiling. My girlfriend saw no such thing.",
  "We then dozed off together and I slept and awoke fine with no side effects.",
  "I plan to do this more maybe adding another 1/2 gram to the tea. I would really like to get plant material so that I could drink the tea and smoke a full bowl of it also.  Hell. After reading the above, maybe I dont need to increase the dose!",
  "Oh yeah. I'm very interested in Ray Allen's reports on Blue Lotus here on Erowid- but I did not have the aura thing going on this time around. I had more of an opium/gassed feeling that was very very pleasant.",
  "I reccommend Blue Lotus to anyone interested. Keep in mind it seems to work well with other substances and I plan to try it with wine also. Taken alone, it is probably compared best to codeine or vicadin. I'll keep you informed.",
  "EarlyMan"
 ],
 "erowid": {
  "id": "8477",
  "citation": " EarlyMan. \"Very Pleasant, Floating, and Relaxed Gassy: experience with Blue Lotus & Cannabis (ID 8477)\". Erowid.org. Aug 1, 2001. erowid.org/exp/8477",
  "substance": "Blue Lotus & Cannabis",
  "views": "52350"
 }
}
