{
 "id": 12676,
 "title": "With Various Recreational Drugs",
 "date": {
  "submission": "2010-07-21T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Notspam",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Mirtazapine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Various",
   "form": ""
  }
 ],
 "report": [
  "The following is a recollection of my experiences taking Mirtazapine (Remeron, Avanza..) in conjunction with various recreational drugs. I was prescribed Mirtazapine for depression and anxiety. I never got any benefit from it, though I was doing hard drugs a few times a month and that could have interfered with the treatment. I took Mirtazapine at doses of 15-90mg depending on what stage of treatment I was in. Ive read from various sources that say the maximum dose of mirtazapine was 45mg but my psychiatrist insisted that 90mg would be fine. I will now list the various drug interactions with mirtazapine:",
  "Alcohol: no difference in response at all dosages of mirtazapine",
  "Cannabis: no difference in response at all dosages of mirtazapine",
  "LSD: no response at all dosages of mirtazpine, I did not get high at all. Once, when I was not on mirtazapine, I was tripping on Acid and I used mirtazapine to come down. It worked very well; I fell asleep while I was still high which I think is very unusual.",
  "Ketamine: no difference in response at all dosages of mirtazapine",
  "Dexedrine: no difference in response at all dosages of mirtazapine",
  "Cocaine: no difference in response at all dosages of mirtazapine",
  "MDMA: Decrease in response during treatment with mirtazapine at dosages of 15-30mg, I had to take more mdma than usual to attain the desired effects. Very little response at 45mg of mirtazapine. No response at doses of mirtazapine above 45mg.",
  "I suffered no ill effects from combining mirtazapine with all of the above recreational drugs. I would not recommend that a person with depression use most of these drugs but I did and I respect your right to do so as well if you choose. I hope this information has been helpful."
 ],
 "erowid": {
  "id": "84876",
  "citation": " Notspam. \"With Various Recreational Drugs: experience with Mirtazapine & Various (ID 84876)\". Erowid.org. Jul 21, 2010. erowid.org/exp/84876",
  "substance": "Mirtazapine & Various",
  "views": "9933"
 }
}
