{
 "title": "Ecstasy at the Beach",
 "author": "Aurelius71",
 "citation": " Aurelius71. \"Ecstasy at the Beach: experience with Ecstasy (ID 1267)\". Erowid.org. Oct 15, 2000. erowid.org/exp/1267",
 "substance": "Ecstasy",
 "bodyweight": "190 lb",
 "report": "<p>For those who have only done Ecstacy at a Rave, I hate to inform you that your experiences may have been incredibly lacking.</p><p>Before this incident, I had only taken MDMA on one occasion.  For my birthday, a friend gave me half a hit and took me for a drive in the mountains.  I'd read a lot about MDMA and felt comfortable with the risks and understood the precautions.  It was a wonderful feeling, nothing too strong.  Subtle tingling, a noticeable shift in the tracking of my vision and my attention.  And overall, it just felt incredibly good.  A wonderful experience, seeing the beauty around me in a new depth.</p><p>But that was hardly a preparation for the beach. </p><p>I'd planned on taking a full hit at the beach, a beautiful unspoiled pacific beach in a Latin American country.  The setting was picture perfect, like something out of a post card.  The weather hot.  The waves beautiful.  Miles of smooth sand.</p><p>We arrived with our preparations.  Lots of sunscreen and a cooler loaded with beverages like gatorade.  We all were mindful of the important to keep hydrated and cool.  We continued to remind each other that under the influence of MDMA we had to be mindful that dangerous activities might look not so dangerous and that euphoric state might cause us to lose awareness of our bodies warning signs of thirst and hyperthermia.</p><p>We dropped.</p><p>45 minutes later, I felt it coming.  And it hit like a train.  I felt SO good.  The amazing natural beauty around me was now so compelling that I was astonished.  I simply could not fathom how beautiful everything was. </p><p>I wanted to experience and touch everything at once.  The water, the waves, the sky, the sand, the wind, the feeling of the sun on my body.  Trying desperately to take it all in. </p><p>The feeling the MDMA provides, not the tactile or visual sensory information, but the FEELING is amazing.  Everything is just so good, so right, so lovely.  I found myself just walking around saying, 'WOW!  WOW!  WOW!'  Often times, I could only say this to myself or under my breath.</p><p>A secondary feeling that MDMA provided me was that EVERYTHING seemed 'really, really cool.'  Someone brought a radio and started playing music I didn't like.  Was it a problem?  No.  I was dancing to music I don't like, thinking about buying the damned CD.  I don't even like dancing, but I felt that I couldn't stop.</p><p>I wasn't the only one to experience the 'really cool' evaluation of everything.  I'd walk up to a fellow tripper and grap their shoulders and say, 'It's really cool!' and then we'd both say at the same time, 'It's really, really cool!'  Seemed that everything was pretty darned cool, and I mean just about everything.  Stupid hats were cool.  Bad music was cool.</p><p>One thing I've noticed about MDMA that I've not seen others report is that people who are on it have very animated facial expressions.  Call out someone's name when they are on it and they will turn to you and it's like thier eyes buldge out and their eyebrows raise as if you were telling them something shocking or strange.  Not bad, just something intensely interesting.  I was doing this so badly in some conversation with some non-trippers that a friend gave me some sunglasses to mask my over-expressiveness.</p><p>I did experience the emotional closeness to others that is often described.  I don't know if it was the same thing, but it definitely makes you feel open and allows you to see the parts of someone that are 'really cool' without being hung-up on what you don't like.</p><p>The overall sensation I would describe of my time at the beach was one of an overwhelming sense of how wonderful and beautiful life is.  It was an experience so strong that I thought about all the people I'd love to share the experience with.  (The next day I realized this wouldn't be the hottest idea, but I think the drive to share the sensation it provided was interesting.)</p><p>My physical symptoms included a certain fidgetiness.  I loved standing and talking to people while working my feet deep into the sand.  Lots of jaw clenching which was alleviated by plenty of gum chewing.  ZERO appetite; only my pre-trip planning of bringing carb loaded sports drinks reminded me to swallow calories.  Solid food would have been impossible; absolutely no appetite for that at all.</p><p>It was just a few hours of really intense experience, walking around, turning around and just saying to myself, 'OH GOD!  WOW!  This is so beautiful!  I'm so happy!'  I would have loved to shout it, but I retained enough sense of things to not do that.</p><p>As the effects subsided, I began to feel more subdued.  Not tired, just very relaxed and contemplative.  It's hard to describe but I felt like sitting still on the ground, but getting up to get something was not an effort.  I just liked being still and checking things out, talking, contemplating.</p><p>While I've just described a very intense experience, something that many people would like to experience themselves, I want to caution all of those who read this about the dangers of MDMA.  Dangers such as dehydration and hyperthermia can be a big concern at the beach.  KNow what you are dealing with.  Make plans to deal with things.  Know that under MDMA you may engage in behavior that you would otherwise regard as risky.  Decide what you are going to do before-hand and stick to it.</p><p>Some time later, I finally went to a rave on MDMA.  It was a fun time, and the medicine still worked its magic.  But it wasn't the same.  Perhaps this is due to a lessening of the effects of the drug with time, but I don't think so.  I explain it as this:</p><p>At the beach, I was experiencing a reality that I'm very familiar with.  And thus, I was VERY aware of the changes, both striking and subtle, in my perception of things.  Raves are not like everyday life.. the darkness, the strange colors, and so forth are things that most people aren't surrounded by much.  They are kinda strange by themselves.  Under such conditions I presume that it's hard to appreciate the difference in how your brain is experiencing the world under MDMA.  Beyond that, the loud music precludes the type of dialogue with others that makes the experience so fun.</p><p>I had a good time at the rave, but I think I will be saving my future MDMA experiences for times when I am with people I enjoy, surrounded by great natural beauty, and able to really enjoy it.   Look at it this way, in a normal daylight environment, with people you love, you can more experience the change brought about by the MDMA instead of being in a strange dance place where EVERYTHING is different from everyday life.</p><p>I'd like to close with urging people to be careful.  Research, learn, know what you are doing.  Know if you are under medication which could cause complications.  Be prepared.  Don't take more than a hit and a half and space out your sessions by a few weeks.</p><p>It's really, really cool.</p>",
 "year": "2000",
 "id": "1267",
 "timestamp": "2000-10-15T07:00:00.000Z",
 "views": "9303",
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ]
}
