{
 "id": 12674,
 "title": "WeirdTwisting Salvia World",
 "date": {
  "submission": "2005-06-29T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "footstaintang",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  }
 ],
 "report": [
  "I smoked 25mg of extra strength Salvia divinorum leaf extract, which contains about 1mg of Salvinorin A. I smoked it in a bong (a must) and inhaled it all in one hit. I held the hit for approx 30 seconds (you must hold it in). Let me tell you folks, I you really want to be blown off your feet and freaked out, this is the way to go.  I've tried sublingual absorption with this stuff before and was disappointed and expected more. I always wanted to have some divine experience with psychedelics but I guess I really didn't understand the power. The power of Salvia will surely take you off guard the first time.",
  "I did it in my room so as to have no distractions (I don't think my room was a good setting though, you should do it outside or it's really bizarre). As soon as I put the bong down and laid on my bed I released the smoke. All of the sudden I could feel this intensity within seconds. It is hard to explain what happened next, you can only experience it for yourself. I did not talk to gods or travel to Mexico or turn into a tree, every visual was of my room. I closed my eyes as soon as it came on.  I remember being in my room, but in a different dimension. This weird twisting salvia world. You're in this new reality and completely out of touch with the old one. I guess I felt out of my body, I don't remember taking the hit, just all of the sudden being In this new world, spinning out of control, and having to accept it. I couldn't accept it though, it was too much. I was switching through this weird cartoonish room. I was my room, but it didn't seem real anymore. Like I was viewing it from a distance and not actually being connected to it. Just floating through this space, constantly shifting between different fantastical images of the old reality. All of these images were accompanied by a green spiraling fractical pattern which revolved around the edges of this strange world. I was trying to grip and touch something that I knew, (all of this happening with my eyes shut), but I couldn't. I remember thinking to myself, I was not prepared for this, why did I do this?",
  "I soon opened my eyes and was in disbelief that my eyes were shut to begin with. After some minutes passed I came down and started to realize where I was, just sitting on my bed. I started to grip the old reality and feel back on the ground. I just sat there astonished. Where had I just been to? I was in my room, but not really. The experience was not mystical, just astonishing, something I'd never been through or felt. It was the most intense 15 or so minutes of my life.",
  "I was not afraid to go back and try it again though. I was more prepared the second time and was able to let go a little more and flow with it. I think once you get accustomed to it you can gain more out of it. I you try to resist, it's just going to scare you more. Nothing can prepare you for that first ride though...Unbelievable."
 ],
 "erowid": {
  "id": "8487",
  "citation": " footstaintang. \"WeirdTwisting Salvia World: experience with Salvia divinorum (extract) (ID 8487)\". Erowid.org. Jun 29, 2005. erowid.org/exp/8487",
  "substance": "Salvia divinorum (extract)",
  "views": "3405"
 }
}
