{
 "title": "Yellow Deterioration",
 "author": "Blazed",
 "citation": " Blazed. \"Yellow Deterioration: experience with Tobacco (ID 12680)\". Erowid.org. Jan 26, 2005. erowid.org/exp/12680",
 "substance": "Tobacco",
 "bodyweight": "",
 "report": "<p>This report is about what I went through while smoking cigarettes (from my first to my last).</p><p>The roots:</p><p>I was born in Poland, so each summer I flew back to visit my family. The summer of '98 was different. When I went to visit my uncle, I found out that my cousin was smoking. I wondered how it felt like, so I smoked my first cigarette with him (Marlboro reds). It was during the day. We went about 100 meters from the house behind a small electrical building structure and lit up. I coughed through all of the drags off that first cigarette. I couldn't even stand the taste. I kept trying to spit it out of my mouth. The second cigarette was the same-- I couldn't stand it. I didn't understand what those things did for that kid, but I kept smoking with him. It was something to do. It gets really boring in Poland. There's never anything to do. We smoked to pass the time. On one night we even smoked in the house. We had to share a bed since there were a lot of people staying over, so we had a room to ourselves. We opened up the window at around 2am and blew the smoke out. My uncle was a smoker, so the house smelled like smoke already. This made us less worried. We never got caught, and his mom knew already that he smoked.</p><p>Another time we were out of cigs, so we ended up stealing about 2 (ultra lights) from my uncle. That's not much. We weren't dirtbags about it. A few days later, he met up with his friend who introduced me to non-filtered Lucky Strikes. Those were some potent fuckers. I remember smoking in the middle of the city on a park bench-- it felt a little like smoking weed with friends. It was illegal since we were underage, but we could smoke cigarettes in public as long as cops didn't walk by. I also remember a time when I had to talk to some lady to actually buy some Spike cigs. She didn't want to sell me any because I was underage, but I managed to get her to sell them to me. I calmly explained to her that I didn't look like a cop, and that I didnt smoke that much to begin with. I told her that I only bought some cigs from time to time, so it couldnt be that bad for my health. I said please again and again, and she sold them to me. Lights, but it was still something. When the summer came to an end, I dropped smoking and went back to my regular life in America.</p><p>New beginning:</p><p>I started smoking again around the end of February. I went over a friends house and took ecstasy. Around an hour or 2 into it, she started smoking menthol cigs. I wanted to see how it felt, since she said it enhanced the experience. I took one and smoked it. The menthol taste made it so much better. The taste! The cigs improved the process of the roll as well by setting me down in a tranquil, relaxed state. Id go on to smoke menthols later on, even though I wasnt thinking that I was. At that time, I was thinking It was only a one-time thing, since I was on x. Fortunately, Id go on to smoke around the time of a trip for a school club. We went to compete, and I brought a pack of non-filtered Lucky Strikes with me. There wasnt any place to smoke, except outside the building so thats where I smoked a cig with a friend (D). We kind of had to hide it, since even smoking wasnt allowed during the trip. It was at that time that I went on to smoke after I got back. D was a good friend, so I wanted to smoke kind of because he was. Smoking, it seemed, brought a certain group together. I wanted to be a part of that group.</p><p>After a few months, I smoked with another good friend (C). At the time, I lived in a condo with a sliding door (made for easy access to the outside). Wed hang out there and smoke one by one, while talking about random shit that was going on in our lives. Hed even give me a call around 11:30pm saying that he was around my area and was going to stop by to smoke. I loved those times, and I loved that area of the condo too. After school, Id just go out back there and smoke. It was so easy, but Id never hear my mom coming. Thats how I got caught twice maybe 3 times. After I got caught, Id go out with a cigar (that my mom would give me) and smoke it and the cigs. She knew I was out there, and she knew what the smoke was from. All was good.</p><p>During the summer, my mom and her fianc went to get married in Barbados. This gave me the opportunity to have friends over. Wed drink and smoke. On one of the nights, I got into a fight with C. We funneled a lot of beer and got violent on each other. It was a friendly kind of fight. We just wanted to get some aggression out. Later, Id go on to smoke with C and talk about how great the fight was. I loved being part of that group. During the days, Id sometimes get drunk with him and drive around smoking. Other times, wed smoke a joint and smoke. There wasnt much to do. Everyone else was working.</p><p>As the summer progressed, Id set myself apart from friends. I quit doing drugs, so I figured Id stay away from those people. Id still smoke cigs though. I smoked as I drove around, which was something that I did many times. Sometimes, Id smoke right after I bought a pack at the local 711. On the way home, Id get that sleepy feeling that comes with smoking cigs. It was then that I learned to drive carefully and pay attention to the road. The car was a useful tool. I used to have to walk to the mall (closest place) to get some. I didnt like that that much, since during the summer it would get really hot and humid. One time I got really pissed off that it got so hot. I wasnt about to walk to the mall, so I came back. I couldnt wait to start driving. Other times, Id drive at night looking at houses and things. I wanted some new scenery for my smoking habits. Id drive around so much that the smell got to be a problem, but I didnt care too much about it. Smoking made me feel very good. I began smoking so much that money became an issue too. I got to the point where it was a pack a day. I figured if I bought the regulars, then Id get more nicotine. I didnt bother with the lights, even though Parliament menthol lights tasted so good. Later on, Id discover that Newports were even better. The beauty of those was that the regulars tasted even better than P lights.</p><p>Around some time in October, I drank 4oz of Robitussin. During the trip, Id go out to smoke. Smoking made it more enjoyable. It set me at a more distant, relaxed state. I couldnt walk straight on DXM anyway, and the cigs made it so much better. My constant worry during DXM trips was that I wouldnt put out the cig right, or throw it somewhere where it could burn down significant things. I had to make sure to take care of it. It wasnt like I wouldnt smoke. I had to. I was addicted. Besides, what else could I do It became a part of my day to smoke. It was something that took up time.</p><p>End:</p><p>I would go on to meet up with more and more things that didnt agree with me. It started with a little notice of yellow shit trying to swallow me up. My teeth got more yellow, along with the areas around my fingernails and the areas where Id hold the cig as I was smoking it. Id also be on Vicodin on some nights. Of course, Id smoke then too. Thats a given. But smoking would get me nauseated at those times. Painkillers and cigarettes didnt go over too well for me, yet I had to smoke. The addiction got to be nuisance. One more reason -- I had to smoke on the days when it was really cold. I hated standing outside having to smoke. Id rather smoke during the summer heat than during the winter nights. I got tired of being controlled. On December 19, Id smoke my last one. Id go on to spend the next 7 days in discomfort. It wasnt painful at all. Heres the thing -- Id keep asking myself, Do I really want to quit? Since I had a problem with authority figures (tobacco as a form of control/addiction), my answer was yes. I wanted it to end. I also told many people that I quit, so I didnt want to look like a pussy going back. I had to quit.</p><p>Judgment:</p><p>Looking back at smoking, it was so relaxing, so pleasant. I dont consider myself addicted anymore. Its been a while, yet cravings came on recently (thats why I wrote this report). Theyre not enough to get me to smoke again, but enough to be detected. It didnt take much for me to quit -- for 2 reasons. I didnt smoke for that long to begin with, and my answer to the question was yes.</p>",
 "year": "2001",
 "id": "12680",
 "gender": "Male",
 "timestamp": "2005-01-26T08:00:00.000Z",
 "views": "14655",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": "(daily)"
  }
 ]
}
