{
 "id": 12695,
 "title": "Much Stronger Than Expected",
 "date": {
  "submission": "2013-01-18T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Grad Student",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Adrafinil",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I often find myself fatigued, not sleeping well, and it most certainly effects my performance at work.  I decided to try out adrafinil as a potential solution.  I ordered it from an online vendor that seemed reputable and it arrived in about 2 weeks.  I took it the following monday.",
  "7am.  Alarm goes off, I hit snooze, take the 300mg pill along with a tall glass of water, and promptly fall back asleep.",
  "8am.  I finally stop hitting snooze and actually get up, shower, and eat some breakfast.  I dont feel different.  I am possibly more awake than usual and wonder if the pill is doing its job.  It is impossible to tell.  I burp and it smells like asparagus (this was probably from the pill).",
  "10am.  I am at work and am slightly more effective than normal.  It is a good day.",
  "12pm.  I notice I am rather jittery and restless.  It is somewhat distracting.  I feel like running.  I think my heart is racing, but check my HR and its 62, which is low and normal for me.",
  "2pm.  Holy crap am I hyper.  I chat with friends online and feel like my fingers are flying across the keyboard.  I eat lunch and drink several glasses of water. I was not hungry, but figured I should probably eat anyways.  I use restroom and my urine smells terrible.  I look this up and apparently is normal for the drug.",
  "4pm.  There is a seminar that I attend.  I found it hard to sit still and pay attention.  I normally have problems paying attention, but normally because I am falling asleep.  Now my mind is wandering everywhere.",
  "5:30pm.  I am writing this and the energy does not seem to be going away.  I plan to use the energy at the gym.",
  "Summary:  it is a much stronger stimulant than expected.  It does have some amphetamine-like qualities for me.  I have high energy levels, feel restless, and lack appetite.  It has lasted for a long time as well.  The wakefulness effects are much stronger than coffee, but the jittery feeling is very similar to what I get from three or four cups.",
  "If I take more in the future I think half a pill will be more than enough to get me through a tough workday."
 ],
 "erowid": {
  "id": "84968",
  "citation": " Grad Student. \"Much Stronger Than Expected: experience with Adrafinil (ID 84968)\". Erowid.org. Jan 18, 2013. erowid.org/exp/84968",
  "substance": "Adrafinil",
  "views": "3461"
 }
}
