{
 "id": 12717,
 "title": "Euphoria and Paranoia",
 "date": {
  "submission": "2010-08-28T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Nowhereman",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "ground/crushed"
  },
  {
   "time": "0:15",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "ground/crushed"
  },
  {
   "time": "0:00",
   "amount": "3 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "This is my description of a low dosage in my opinion of Oxymorphone. I use fine cannabis daily and recreationally use opiods every 2 months or so. Along with that, I usually take Oxycodone but my usual dealer was out and suggested these Oxymorphone's in place explaining to me how they both work similar. This was my first experience with Oxymorphone. I mentioned how I used Cannabis. I used around 3 bowls and it maintained sedation mostly while eliminating most paranoia.",
  "Description of mindset & setting",
  "My mindset was to experience sedation and euphoria in excess amounts around 11pm on a weekday night. The setting was in a basement low temp of 62 degrees farenheit. This time, I was by myself playing video games all night and had nothing else planned.",
  "Details of any preparations made for the experience",
  "Cutting the outer tan layer off the 10 MG pill's using razor blade. Cannabis readily available as Cannabis reacts as a natural remedy to me. Drink and dry food which I rarely used.",
  "Dosage & timing information",
  "11pm - Cut the outer layer off the two 10mg pills using razor blade. I then insufflated 10mg of Oxymorphone.",
  "11:15pm - Eager to feel effects, I insufflated the other 10mg of Oxymorphone I had.",
  "12:00am - After sitting around playing video games I glanced around and noticed everything was slow motion kinda like Oxycodone. Comparatively feeling, I felt as if I had taken about 30mg of Oxycontin and was feeling it full on. I thought it would be like this the rest of the night...",
  "1:30am - I wrote my own reports at the time (about 5 days ago) and this is what I was experiencing. Every 30 minutes, intermittent paranoia for around 3 minutes and then complete BLISS EUPHORIA imagining I could do anything.",
  "Journal quote:",
  "'Everything could change life..as far as reading an article vs another...maybe I would get some kind of inspiratoinal idea off of it.'",
  "Adverse Effects: Paranoia",
  "2:30am - I am estimating 2:30 AM as I do not completely recall cause i was so sedated to the point Ive never experienced. I was trying to watch TV without completely falling over and trying to keep my eyes open. I was not tired, I probably woke up around 11 hours earlier and did nothing all day. I specifically posted this to my journal:",
  "'I layed here closing my eyes listening to a movie that I interpreted by listening but completely missed the point and everything about the real thing [what was really going on in the movie].'",
  "Basically completely in my own world with my eyes closed but open them and look around to reality. I specifically mentioned jitters which could be a immediate withdrawal symptom.",
  "3:00am?: Im guessing around 3 I passed out",
  "3:00pm next day: I woke up completely sick coughing and cold and am still sick to this day (5 days later). Other than that withdrawal was not bad especially when I smoke bowls of Cannabis, but I do remember getting really weird heightened senses at times almost reminding me I wanted the drug again. I also looked up 'heroin addict' on youtube the next day and it reminded me of myself the night before. I also snorted an Oxycontin 40mg 2 days later that did absolutely nothing compared to what it used to do to me.",
  "After affects/withdrawal personally wrapped up",
  "1.Cold, cough, sick.",
  "2.depression",
  "3.possible dependence",
  "4.tolerance built up",
  "5.minor joint aches",
  "This is the best feeling Ive ever felt and it will be hard not to do it again or want it all the time."
 ],
 "erowid": {
  "id": "85104",
  "citation": " Nowhereman. \"Euphoria and Paranoia: experience with Oxymorphone (Opana) & Cannabis (ID 85104)\". Erowid.org. Aug 28, 2010. erowid.org/exp/85104",
  "substance": "Oxymorphone (Opana) & Cannabis",
  "views": "8992"
 }
}
