{
 "id": 12716,
 "title": "Almost Overwhelming",
 "date": {
  "submission": "2010-04-29T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Lyrae",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "180 mg",
   "administration": "IV",
   "substance": "Methylone",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>A few friends and I came across Methylone some time ago as a hopefully non-neurotoxic alternative to MDMA. After spending a night with it and taking a number of oral doses, we called it quits for a while. Three days later, we decided to take a small dose (50mg) rectally to test tolerance, and when that worked just fine, we decided to see what a sizeable dose would feel like via IV.",
  "First off, we used distilled water that we'd boiled for five minutes to sterilize it. We used single-use, sterile sharps - no reusing those buggers. We swabbed the injection site with alcohol before and after. Long story short, we did this as safely as we could.",
  "I'd give timestamps, but unfortunately, I was too floored to keep track of time very well.",
  "180mg of 99.8% pure bk-MDMA was mixed into 1cc of the sterilized water and injected into a vein in my right arm at the elbow. Immediately after releasing the wrap on my bicep, I could feel a distinct warmth spreading throughout my arm, and then to my shoulder, chest, and onward. My vision tunneled slightly; I was told my pupils were dilated. I made my way to an armchair and laid down to let the drug come on fully.",
  "Let me tell you, it is a HELL of an experience. The first wave was incredibly intense. I was afraid something had gone wrong, but the blood pressure cuff on my wrist said otherwise - 140/100 @ 100bpm, normal for me when on stimulants. The wave was very similar to an MDMA come-up, but less frantic. Fully wonderful and pleasant, tingling as it went through my limbs, but without the forceful, overwhelming 'YOU FEEL AMAZING, WOOO' that molly tends to have. I spent the next hour just lounging about, finding that the effects were most noticeable while laying flat on the floor.",
  "All in all, this was a WONDERFUL experience. I totally plan on repeating it, however, 200mg is my upper limit, period. Passing this dose would be unwise in my opinion.",
  "Some cautions: First, I used at least 1.5g or Methylone only 3 days prior to this experience. I may still have had some tolerance. Second, I have ADD in the form of a lower-than-average baseline level of dopamine. This makes me need about 300mg orally to get what most people seem to describe as a 'normal' effect. My IV dosage is likely higher than normal as a result. Third, our source for the methylone is a trustable labratory, and tests out at 99.8% pure. Don't inject anything that could be cut, make sure everything is clean, pure, etc etc etc. Be safe. :)</p>"
 ],
 "erowid": {
  "id": "85096",
  "citation": " Lyrae. \"Almost Overwhelming: experience with Methylone (ID 85096)\". Erowid.org. Apr 29, 2010. erowid.org/exp/85096",
  "substance": "Methylone",
  "views": "5980"
 }
}
