{
 "id": 12726,
 "title": "Time Flies!",
 "date": {
  "submission": "2010-05-15T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TestSubjectB",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "repeated",
    "quantity": "="
   },
   "administration": "insufflated",
   "substance": "Napthylpyrovalerone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Previous Experience: bk-MDMA, 4-MMC, bk-MBDB, THC, Psilocybin, Salvia, LSD, Promethazine, Diphenhydramine, various legal smoking blends and legal highs.",
  "Setting:",
  "Relaxing morning alone at home, browsing the internet. Eaten a large meal 2 hours prior to experience and had a multivitamin supplement. Ensured that I was hydrated. Heart rate about 60bpm, temperature normal. Received 1 gram of Naphylpyrovalerone in the mail at lunchtime, it arrived as a chalky white dry powder without chemical description attached, simply labelled 'NRG-1'.",
  "+00 Having heard that Naphylpyrovalerone can be highly active from 0.03g I decided to be caution and start small. Without scales I eyeballed 0.01-0.02g, a line about 10mmx2mm. Upon insufflating there was no pain, no bitter drip and the familiar mild flavour of this class of chemical. I felt the usual excitement and anxiety that I get upon taking any new substance, especially stimulants.",
  "+30 Feeling no effect and suspecting that I incorrectly judged weight, I continued to redose with the same amount.",
  "+60 Increased body temperature, getting sweaty. Realised I've drank a pint of water in the last hour.",
  "+120 Redosed with same amount. Heart rate has increased to 90bpm, mild jaw clenching, feeling fidgety. Increased thirst and more frequent urination. Surprised that there is no pupil dilation. ",
  "+180 Short attention span, very easy to chat with people and music making the heart pump like wild. Stimulation effect is very body driven, no head rush or high whatsoever.",
  "+240 Redosed. Chest feels heavy, but not uncomfortably. Heart rate up to 120bpm. A bit speedy now.",
  "+360 Underestimated duration of effects, 2 hours without a redose and I feel exactly the same. Though not having any cravings, I long for something that this substance is missing, any kind of euphoria.",
  "+420 Final redose. Slight stiffness, nose is a bit runny now.",
  "+720 Attempting sleep, and failing, still very alert. Heart continuing to race at up to 100bpm. Disturbed sleep pattern.",
  "This substance has the potential for prolonged stimulation having the mental alertness and ability to maintain wakefulness, but lacks in any recreational value. The increased energy lacks the push that I'd get with bk-MBDB, and there is no empathegenic quality.",
  "An interesting substance, but not worth trying again. It also has the potential for heart problems, as even with low doses there is greatly elevated bpm, blood pressure and body temperature. People should be very careful with this stuff and never mix it with any other drug."
 ],
 "erowid": {
  "id": "85168",
  "citation": " TestSubjectB. \"Time Flies!: experience with Napthylpyrovalerone (NRG-1) (ID 85168)\". Erowid.org. May 15, 2010. erowid.org/exp/85168",
  "substance": "Napthylpyrovalerone (NRG-1)",
  "views": "16266"
 }
}
