{
 "title": "Only if You Want To",
 "author": "Isaac In Heaven",
 "citation": " Isaac In Heaven. \"Only if You Want To: experience with Amanitas - A. muscaria (ID 12728)\". Erowid.org. Jan 26, 2005. erowid.org/exp/12728",
 "substance": "Amanitas - A. muscaria",
 "bodyweight": "135 lb",
 "report": "<p>I think through the things that people say about them and the way they describe their experiences, one may get the notion that they are of a psychedelic nature. Not everything in this world that affects the minds function is psychedelic.</p><p>I ordered 25 grams of the mushrooms, even after signing a paper saying that I would not consume them. Awaking at about 2 in the morning, knowing that the mushrooms were sitting in my back pack, I eagerly jumped out of bed to try them. Consuming about 12 grams with no formal preperation method or meditation, or most importantly, WITH THE RED PART STILL ON THEM. I went and sat in the living room and watched the tube. I cant say I felt anything remotely off base for about 2 and a half hours. At around this time I felt a slight nausea, which I had anticipated but ignorantly thought I just might be immune to. Retiring to my bathroom, I went in there with one purpose, to smoke weed. I didnt have much, and for the record, I've never been one to find weed as a substance that eliminates my nausea. Yet However, I smoked it anyway.</p><p>Now there is really only one reason I am writing this report. I read another report where a young man reported feeling as though hundreds of tiny needles were inside his dick. Well here I am, reporting on this most unfortunate side effect which doesnt seem to effect anyone else. There I was, all the sudden I had the sensation in my penis as if I had had to urinate for 24 hours, decided to go, and then suddenly stopped. This was a most excruciating bizzare sensation, and you can believe I was on the floor, curled up, moaning in a somewhat ironic laughing at myself way. I knew I deserved this, and thats why this was happening to me.</p><p>Luckly, the penis pain subsided, I cant describe in anyway what a relieving feeling it is to notice suddenly that your genitals are no longer in excruciating pain. But these mushrooms were not done with me. The mental effects were starting. For me, it was anything but euphoria. My mind was pulsing, and my thoughts verbalized themselves in words. A NON STOP Voice in my head just going on and on in a fashion kinda like I am now only with no real subject at hand. The NAUSEA. Dear god. Try to follow. The Nausea rolled in like an ocean wave on the beach, one wave at a time. Here I was my stomach in extreme agony for about 30 seconds, then it faded for about thirty seconds. I was there in a state delerium, noticing my eyes had gone completly unfocused. The thirty seconds of the minutes that my stomach was not in a serious agonizing seizure of nausea, I was drooling. Folks, I had no idea a human could drool this much. I kept a towel near by, with which I kept on spitting into. </p><p>I've told this story a million times.But I can never get anyone to truly fathom this one interesting little fact, the 'peak' of the trip was marked. One LARGE SURGE of nausea, and then the most peculiar thing. Take your mouth, keeping it shut, and fill it up with as much air as you can to a point that your cheeks stretch. After the surge of nausea, my mouth very very very quickly filled up with so much saliva that my mouth was stretch in this fashion, I mean stretched. Even now I just cannot imagine a person creating that much saliva in one second. After this, the effect of the mushroom subsided considerably, and I drifted off to sleep.</p><p>The next day I felt fine see. No Hangover, just tired in a sense as if I hadnt slept well. But one thing was peculiar. My face and my neck were swollen. It was like I had two golf balls in my neck! Has this happened to anyone? I know it was the mushrooms for it happend a second time when I stupidly consumed the rest of the mushrooms I had.</p><p>Folks, just because it gets one 'fucked up' doesnt mean it's a guarunteed mystical experience. I see it in no other way than that of eating poisonous mushrooms, and I can't blame mycologists for seeing them this way, cuz to me thats what they are. Only under one circumstance will I ever do these again. With someone who knows what they are doing. I didnt then, and I still dont. So please be careful, and by all means, dont smoke salvia with these.</p>",
 "year": "2001",
 "id": "12728",
 "gender": "Male",
 "timestamp": "2005-01-26T08:00:00.000Z",
 "views": "13509",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "12 g",
   "administration": "oral",
   "substance": "Amanitas - A. muscaria",
   "form": "(dried)"
  }
 }
}
