{
 "id": 12722,
 "title": "A Being of Pure Euphoria",
 "date": {
  "submission": "2010-07-16T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Bardo5",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  },
  {
   "time": "1:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  },
  {
   "time": "1:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "2:00",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0:00",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract"
  },
  {
   "time": "5:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "A few years ago I came into possession of two blue tablets, each with a left-facing dolphin pressed into them. These tablets will forever change my attitude towards all drugs in general. I had heard about these notorious 'Blue Dolphins' beforehand, as the print is very common and the contents often questionable. I'd never taken ecstasy before and my curiosity was torturing me. Being unacquainted with the nature of mdma, I decided to explore it alone. In the past, I had enjoyed all kinds of different drugs but phenethylamines were brand new territory.",
  "I swallowed the first pill at approximately 10pm. I was excited. I was also a little nervous because I did not know what to expect from mdma itself, let alone some mysterious street pill. I played around on my acoustic guitar to pass a little time. The futon couch I'm sitting on is uncomfortable. I go get a bottle of iced tea with lemon from the refrigerator and head into the garage, which the owner/landlord has turned into a home theater room complete with projector/screen, surround sound and cable tv. It was 11 and the Daily Show with Jon Stewart was starting.",
  "I was starting to feel the effects which were very gentle and calming. My initial thought was 'Wow! This could work wonders for anxiety disorder.' As the minutes went by, the effects increased in constant waves. I've taken methamphetamine, cocaine, and other stimulants before but this was nothing of the sort. This was FANTASTIC! I was feeling no nagging stimulation, no impairment whatsoever, just pure heavenly euphoria. And it was just the beginning.",
  "I was losing interest in The Daily Show. The jokes didnt really seem as funny as usual and I was bored with current events. At around 11:30pm I decided to take the other pill and grab my bong from my bedroom. Next to my bong was a wooden, hand carved box with a yin-yang symbol on the top. I was amazed by the complexity of the woodwork and how much time and effort must've been put into this little box. Inside the box was a quarter ounce of high quality cannabis and about a half gram of 20x Salvia. I brought the box back into the garage and proceeded to smoke a bowl of weed while I listened to some music on surround sound. I had on the Brian Jonestown Massacre's Tepid Peppermint Wonderland: A Retrospective and it was doing the trick. Its a double greatest hits album so it was on for quite some time.",
  "By midnight I had adorned the ego of a Roman Emperor lounging in the shade surrounded by grapes, wine and beautiful women. I was experiencing true luxury. Although I was feeling a little lonely, as I had just recently moved to a new state, my mood was overwhelmingly positive. I smoked more marijuana to take my buzz to the highest possible level. The weed wasnt working. I wanted to take it higher. I then remembered the bag of 20x salvia in my yin-yang box. Perfect.",
  "I usually have mixed feelings about salvia. I find it neither good nor bad, positive nor negative, just super intense. But intense is what I was looking for at this time. I loaded up the bowl and fired up the contents. The smoke usually feels harsh and unforgiving but this time its kind of pleasant. I hold the first hit in for a few seconds then take another rip for good measure. Before I could exhale completely, I started to feel a growing excitement. Usually when I smoke salvia I feel nothing but a growing fear. But again, this salvia experience is unlike any I have ever had.",
  "I lay down on the couch as I surrender to the swirling chaos taking a hold of me. I no longer had a body; I was a being of pure euphoria. Rules of physics no longer applied to the space inside my garage. The surround sound made the music feel very cosmic and powerful as it cut through the air. I did this two or three more times until I was completely out of salvia.",
  "I realized I had only smoked three cigarettes during the entire night so far. This is strange because back then I would smoke like a chimney. I decided to smoke another bowl and then get into bed at around 3:30am. I still felt amazing. I thought about how lucky I was to have such a nice first experience with mdma considering I had notoriously shady pills. It would have been nice to share the experience with somebody but I had a great time nonetheless.",
  "I awoke the next morning in high spirits. I had been feeling pretty blue in the months prior, but I now remember that it is possible to be extremely happy. From then on I shifted my focus from getting wasted and partying to feeling good and truly having a good time. This experience opened the door to phenethylamines and tryptamines for me and I havent looked back yet."
 ],
 "erowid": {
  "id": "85138",
  "citation": " Bardo5. \"A Being of Pure Euphoria: experience with MDMA, Salvia divinorum (20x extract) & Cannabis (ID 85138)\". Erowid.org. Jul 16, 2010. erowid.org/exp/85138",
  "substance": "MDMA, Salvia divinorum (20x extract) & Cannabis",
  "views": "4212"
 }
}
