{
 "title": "White Castle",
 "author": "Lobster",
 "citation": " Lobster. \"White Castle: experience with Salvia divinorum (5x Extract) (ID 12747)\". Erowid.org. May 5, 2007. erowid.org/exp/12747",
 "substance": "Salvia divinorum (5x Extract)",
 "bodyweight": "155 lb",
 "report": "<p>My friend has been raving about this legal drug known as salvia, a substance I had never heard of. When he brought it over one day, I casually agreed, but not knowing what to expect. The hardest trip I have ever done has been a moderate dose of DXM, but he told me this was totally different, and a lot shorter. Whatever, just let me try it. Nothing on this earth could have prepared me for what I was about to experience.</p><p>I sat on my bed, with a bowl full of salvia and took one big ass hit. The smoke was so thick and it tasted like rusted metal filling my lungs. I let it out after about 20-30 seconds, and gave a little cough. By this time my hand was shaking but I knew I was supposed to finish the bowl. I couldnt hold the pipe anymore, so kindly my 'sitter' held it for me. I was feeling a mild euphoria and quite lightheaded after 10 seconds. I was a little incredulous at the head trip I was getting so fast and I barely got out the 2nd and final hit. By the time the smoke was leaving my lungs, I heard some voice I recognized telling me lie down on my bed. The house was dark, and of course Pink Floyd Echoes was playing. I was kinda disoriented, but nothing else was happening, until I closed my eyes.</p><p>I was NOT on earth, sure it looked similar; I was at the base of the most tremendous white castle, 200 feet high, standing on the greenest grass, and staring at the most beautiful blue sky I have ever seen. But this was not earth, this had to be someplace else. At this point I started laughing, and laughing, and I sorta came halfway back to reality when I realized that my pillow was running away from me. Sure enough, it grew six little legs and tried to escape! My mind knew it had to be the drug, so I thought if I yelled at my pillow, the sense of reality would bring me back to normal. Nothing. So I tried to jerk my body. Nothing, the pillow was still wriggling free under my head. I actually had to hold down my pillow for a matter of seconds. It seemed like an hour.</p><p>Now I could concentrate. As soon as my eyes closed, I was back at the castle. Althogh this time a tiny door appeared about 15 feet away, and two little gnomes with tall red hats started calling out my name. For some reason they didnt bother me, and I turned my attention on how I was going to get across the moat. Before I had any time I noticed my body was being pulled up into the castle by red cords tied around my wrists, ankles, and knees. Just then, my friend walked in and asked if I was done, I guessed I was, b/c I wasnt hallucinating anymore. He turned up Pink Floyd and told me I would come down for another 10 minutes.</p><p>As I laid in bed, I was back inside the castle and I heard a knight and a princess arguing in the corridor. My senses told me it was just my friend and his girlfriend arguing in the other room. As I reflected on what was happening my body just started drifted away from the castle, sorta just floating through midair as though it was perfectly normal. I drifted through a forest, then through a football field, through a cow pasture, and suddenly I was back in my bed. Sober, 100%.</p><p>I had felt like I was gone from my room for hours, I checked my clock, it had been a total experience of 7 minutes. I feel like I must be exaggerating, but I'm sure I'm not even telling the whole story. This may sound crazy for a legal drug, and it took me a few days to piece together everything that happened. Salvia is definetely a drug I recommend for a nice 10-20 minute study break. Ive smoked the the leaves and had no effect and Ive smoked the extract once more, where I ended up in Mr. Rogers Neighborhood, but thats another story for another time.</p>",
 "year": "2001",
 "id": "12747",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-05T07:00:00.000Z",
 "views": "2620",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "200 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 5x)"
  }
 }
}
