{
 "title": "Alternative to Alcohol and Cannabis",
 "author": "Malium",
 "citation": " Malium. \"Alternative to Alcohol and Cannabis: experience with Kava (ID 12752)\". Erowid.org. Aug 15, 2005. erowid.org/exp/12752",
 "substance": "Kava",
 "bodyweight": "300 lb",
 "report": "<p>I first tried Kava Kava at the suggestion of my physician, who thought it mighty be a helpful legal alternative to smoking pot and also something to steer me away from unhealthy and at times excessive alcohol consumption.</p><p>I credit Kava Kava with helping me change from drinking heavily at the time I first tried it to now only having maybe a few beers or glasses of wine a month. It is a known muscle relaxant. To me it has a similar effect physically to alcohol, but much less mental impairment and few or no unpleasant side affects, other than the taste or making me a little sleepy or queasy if I overdo it. I probably consume more Kava than most would be likely to ever do, buying it in bulk powder form and consuming probably a kilo a month or so. I've tried it in many forms. I've consumed it more or less daily for the last three years, off and on, and have yet to experience the skin discoloration side effect that's the only documented side affect I've seen mentioned.</p><p>LIVER CONCERNS</p><p>I can say that I've had blood tests that show my liver in fine shape after three years of heavy Kava consumption. It's certainly worth concern and moderation, but I figure that it's done me far more good than pot or alcohol ever did. I'm not sure consuming the whole root is a great idea as this is not the traditional method of consuming it and there little known history of it's use consumed whole.</p><p>MY EXPERIENCES</p><p>I first tried Kava Kava in pill forms and found little or no notable effect. Then I tried some extracts and found the alcohol-based extracts to produce a notable effect, but I wasn't pleased with the alcohol content. I found a few different liquid forms not based on alcohol and liked those also.</p><p>I moved on to ordering it in root form, wanting the closest to a native kava bar experience as possible. I tried roots from various vendors and found one selling a 'micronized' powdered form in bulk by the kilo. Compared to buying alcohol or pot, or extract bottles in health food stores $50 for 2 pounds seemed reasonable.</p><p>Kava Kava does have an unpleasant taste but I have grown to like the afterbite, like the bite from a good scotch liquor. To me, Valerian root's smell and tendency to bubble into belches that smell and taste like very moldy socks is much worse and more unpleasant. There's an immediate numbing to the mouth after ingesting Kava orally that reminds me a bit of cocaine, and a tingling of the spine shortly after. Sometimes it makes me sleepy, and on a few occasions it's made me mildly dizzy or I've felt a mild vision effect that to the best I could describe shifts my depth of focus slightly. I tend to prefer it on an empty stomach and it seems to have an appetite supressing effect, so sometimes I'll have a few glasses of kava in the evening and not eat until much later. If it does make me feel dizzy or queasy simply eating or sleeping resolves it. It can also cause some heavy coloration and odor in urine but that doesn't concern me much.</p><p>It's not hard to mask the taste by mixing it, but in strong doses I still feel the afterbite. I'm not sure if hot water does much good or harm but I figure it's not been traditionally prepared like that over centuries so they may be onto something in the methods used.</p><p>If using the whole or partial roots, I grind them a bit and knead in a mesh bag (pantyhose might work in a pinch, or mushing in a strainer or cup then straining it). There is a milky color in the water. This is a pain to prepare but I believe it's possible the friction or kneading can cause it to release more of the useful kavalactones and I suspect the extracts in most pill forms don't extract all the kavalactones. My personal feeling, unfounded in anything I've read, is that mixing it with something fatty like milk, coconut milk or soy milk may help release some of the kavalactones. I base this partly on knowing it's a member of the pepper family and loving hot spicy foods  and that hot peppers in the mouth are soothed by fatty drinks. When using the powdered form I add it to water with a little milk, soy milk, coffee creamer, or a few spoonfuls of frozen pina colada mix. Sometimes I add a little chocolate syrup also. I mix these in a plastic jug, shake it heavily and drink a glass quickly, then store the rest in the fridge. It settles quickly in a glass into layers and creates a thick goop on the bottom if left sitting long.</p><p>Reading anecdotal stories I see many people claiming no effect but I think this is due to the limited dosage in most forms readily available. Traditionally Kava Kava is a very social drug but I have yet to find any friends interested enough to indulge, so I guess it's a bit of an aquired taste.</p><p>Personally I find it a much better experience overall than alcohol and yet similar in some ways. I credit Kava with saving my liver from the ravages of alcohol and probably saving my marriage too.</p>",
 "year": "2002",
 "id": "12752",
 "gender": "Male",
 "timestamp": "2005-08-15T07:00:00.000Z",
 "views": "42551",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Kava"
  }
 ]
}
