{
 "title": "Lifestyle and Continuance",
 "author": "Anavrin",
 "citation": " Anavrin. \"Lifestyle and Continuance: experience with Tobacco (Cigarettes), Cannabis (ID 12763)\". Erowid.org. Feb 4, 2005. erowid.org/exp/12763",
 "substance": "Tobacco (Cigarettes), Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>Speaking generally, I started with interest in cigarettes when I was fifteen. I saw kids at play rehearsal go into the parking lot for a cigarette break and I was mystified. I had never imagined kids I knew and respected going so out of their way to smoke. I had to try it and I walked to my corner White Hen and picked up a pack of Marlboro Lights, ashamed of showing my face as a buyer of cigarettes, and scared for the lapse in legal behavior. I smoked by myself on the railroad tracks and was nervous when I got home that my brother and sister would smell it. When my sister found out months and months later that I smoked, she cried. I wasn't there and had to talk to her frankly when I got home.</p><p>I was entranced by marijuana and mushrooms, acid for two years before I went forth. I saw 'Altered States' and decided to skip pot and go right to real hallucinogens. Then everything disappeared and I was invited to participate with pot. My friend and a class friend told me I'd be hilarious stoned.</p><p>The night that I first smoked pot I just felt a subtle new sense of acceptance into a group (I smoked with my friend and, later, other classmates that I never hung out with socially), at first. The second time I smoked that night, I felt like I was watching a movie. I was at a party, the first party I was ever at where people (kids I knew) were drinking and smoking.</p><p>I had imagined that pot would take me to another reality of space and time. In the ignorance of my first encouter 'reality of space and time' was not defined in my mind, but in the last eight years, I've learned more about space and time, and the chemical nature of reality than I can verbalize. That first night, I was talking to a girl and all of a sudden she was at the end of a long tunnel. I was watching her speak as if in a movie and I got ebarassed when a girl I was more familiar with noticed my state and rolled her eyes at it.</p><p>I asked for help to a chair where people marveled at my 'cashed' (bloodshot) eyes and I reveled in love and numbness. When I put my hands in my pockets for my cigarettes, I couldn't find what I was looking for, but hands in the pockets felt like an orgasm. The next day I got new clothes with my mom and the bustle of the mall store overwhelmed me. I coped with the result of my indulgence, got new clothes, and felt akin to a new independance I had felt an itch for before, but not implemented, and an attitude I felt I now deserved.</p><p>Long story short: I started hanging out with a new friend and I followed his hardcore regimen while boosting his already present instincts. Together we formed a code of pot etiquette that I became proud of. I started smoking daily, and after that summer I got depressed. The thing I most cared about, the destiny up my sleeve since I was two, came into question. I relived my 8-year-old tragedy of moving to another school and being uprooted. I constantly doubted my choices and relieved the pressure of their consequences by deciding that I was deluded. This inner conflict came to a head when I felt dead and ineffectual while acting in a scene for Acing class. Acting had been a constant reminder of who I was since I was two and losing the feel for it finally knocked me back to the part of me that pleaded with me to stop smoking pot! I stopped smoking completely for (5) weeks and that was a huge relief. In fact, I felt better the first day of the planned cease-smoke. That convinced me how mental my experience was.</p><p>I smoked daily in college (while maintaining an on again-off again relationship with cigarettes). I fell in with another actor, and a filmaker (both with histories of alcohol and drug use), and we had wild, classic times of drunken mayhem and beligerence on the streets of New York City. It was an extension of romanticism and I got hooked on the romance of drunkenness. I trained to be an alcoholic.</p><p>The summer between my sophmore and junior years of college, I was 20 yrs old and got a DUI (Driving Under the Influence) right next to my home town. It was the first time I had gone out to a bar outside of my college city of New York City, and I took out (8) people in my little Geo Prism. We were pushed out of the bar at 1:00 am (unexpectedly because I was used to the 4:00 closing time of NYC) and the cops followed me for ten minutes before they pulled me over and ultimately arrested me.</p><p>I had to answer to an alcohol evaluation where they asked about other drug use and I said I had smoked marijuana and presently did so on a monthly basis (a reduction of the truth). Needless to say, the admission of smoking marijuana (which is all I admitted to in the survey, despite my infrequent use of psylocibin mushrooms, and scant hash and opium) promoted my sentence to (20) more hours of counseling and probably $1500.</p>",
 "year": "2002",
 "id": "12763",
 "gender": "Male",
 "timestamp": "2005-02-04T08:00:00.000Z",
 "views": "8318",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Tobacco - Cigarettes"
  },
  {
   "time": "",
   "amount": " ",
   "administration": "",
   "substance": "Cannabis"
  }
 ]
}
