{
 "id": 12776,
 "title": "Unpleasantly Spiced",
 "date": {
  "submission": "2010-10-11T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "Ergotist",
  "gender": "Female",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  },
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Pharms - Zolpidem"
  }
 ],
 "report": [
  "I tried spice for the first time in October of 2009. I had previously tried Salvia Divinorum a few times and not enjoyed the experience, to say the least. A friend of mine insisted that he had heard that spice was just like smoking marijuana, which I had had rather bland experiences with previously, and I agreed to try some.",
  "We started off packing a small amount into my bong, probably an amount the size of one's thumbnail. Each of us took turns taking hits, and the effects were almost immediately noticeable. Pleasant, warm sensation, overall sense of wellbeing, giddiness and the generally 'stoned' feeling one gets from good marijuana. We continued to enjoy ourselves, and my friends started taking another hit each from the bong. I was hesitant at first, remembering my bad experiences with Salvia, but took another it anyway. Almost immediately after the second hit, I felt a wonderful warm sensation in my chest, which felt like it was floating from my chest to my head...as soon as I started to tell my friends what I was feeling, I realized that I was the only person feeling this and that I was beginning to trip. Not being the type to enjoy trips, I immediately freaked out and started trying to mentally talk myself down, in order to prevent a total loss of control of self. I then had the sensation that everything out of my forward range of sight was disappearing and black, and that I was in danger of falling backwards into the darkness. I started gauging time by the length of songs on the radio, because it felt like time was dragging incredibly slowly (in reality, only about 20 minutes had passed). I proceeded to take an Ambien and go to bed, all the while thinking that I had smoked something horrible and was going to be altered forever.",
  "Needless to say, the next morning I awoke with a slight hangover and vowed never to smoke Spice again."
 ],
 "erowid": {
  "id": "85606",
  "citation": " Ergotist. \"Unpleasantly Spiced: experience with Spice and Synthetic Cannabinoids Spice (ID 85606)\". Erowid.org. Oct 11, 2010. erowid.org/exp/85606",
  "substance": "Spice and Synthetic Cannabinoids Spice",
  "views": "2739"
 }
}
