{
 "id": 1277,
 "title": "Don't Ever Do This!",
 "date": {
  "submission": "2002-04-10T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Diabolos",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "130",
    "grams": 0.13
   },
   "administration": "insufflated",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "The Following was my first real experience with 5meo-dmt, and it will probably be my last too.",
  "First of all Im aware I took way too much. I had read about it a lot, including the pros and cons, and a few glowing and negative experiences so that I could get both sides of the story. What screwed up my dosage was the first couple times I tried to smoke it and the effects were less than impressive, or at least nothing like I expected. This made me think I wasnt taking a full dose. I only know that it was 130mg's now, because I recently found a good scale and weighed out approximately the same amount on it",
  "Anyway, it started with me and a friend, who I originally wanted to sit and watch me as I tried it and vice versa. I educated him on the substance and made him read about it some, then we did some chakra balancing and decided to go for it.",
  "Justin wanted to try it first so I hooked up a smoking surface and poured out a little tiny bit. He smoked it, it smelled like ass to me but afterwards he claimed it tasted good.. yeah whatever. Anyway he starts chanting like hes an Indian and I just sort of watched slightly amused. It was neat. He really liked it a lot. This got me excited about using it, so as soon as he was in a stable mindset again (the Indian chanting had stopped) it was my turn.",
  "Since he didnt experience the level of intoxication and ego loss I had read about (which was my main goal) I threw some more on the foil spoon thing. Smoked up as much as I could, and sat back. It was disappointing. I felt an intense energy flow through my body a couple times, then just felt introspective and talkative. Looking back, I think my chronic bronchitis probably prohibited me from maximizing the smoke intake, and thats why I dint effect me as much.",
  "We waited a while and talked about are experience into the mic (we recorded everything...) then tried it again a little later. It was notably less intense for either of us. This bummed me out and I told Justin we should probably wait another day to do it again.",
  "Well, as the night rolled on we got bored and watched a Terence McKenna video. After watching that we both decided it was time to sniff some of the drug and experience it to the full effect. I broke it out and dumped a couple piles on a CD case. Since I hadnt achieved the level I wanted earlier I added more, and also since sniffing requires more than smoking, I added more again. We both ended up snorting what I considered about the same as a decent line of coke. This was way to much and a really fucking stupid thing for me to have done, especially since we both decided to do it at the same time this time.",
  "We snorted the stuff almost at the same time at about 11:00pm.",
  "The burning was horrible, it throbbed like having ants in your nose or something. Water helped a little. After the throbbing the feeling of burning crystals sliding down our throats came next, pretty unpleasant to say the least. This feeling and the feeling that it was about to hit me hard was the last thing I remember for the next 30 minutes. According to the tape, we both passed out for about 30 minutes.",
  "I awoke with my head leaning off the futon in a very odd way, drooling all over myself with Justin right in my face telling me that I 'cant go yet!' and that I 'had to pull through' He was attempting to help, but what it really did was scare the ever living shit out of me. After a couple minutes of this, I got up and walked away from him, wiped the drool up and changed my sweat drenched clothes after. I was terrified of death at while on the futon with Justin, now it had transformed into an uneasy feeling of total permanent mind fuck.. I saw myself it the mirror, my eyes were totally black. I looked like a weird alien creature. I know people say you dont get visuals from this stuff, but I did. Breathing bottles, and blurred objects, and everything shimmering. Justin had his fair share of visuals to. Anyway, after the mirror, I lay down in my bed and decided to sleep.",
  "I left Justin in the other room, he was cleaning up the beer and water he knocked off the table (we think with his head and he passed out, we cant be sure though). Soon my feeling of mind fuck went away (about 10 minutes after waking up I think. It seemed like my eternal hell though. I got up and moved into the other room and we started talking about what happened. Soon my negative feelings turned into the greatest feeling of my life...it was so very strange, one minute terror, the next utter bliss.",
  "Luckily the great feeling and insight lasted much longer than the other sections of the trip. I guess you could say I died (unconsciousness) then I went to hell (terror) then I was in limbo (the mindfuck) then I found heaven and stayed there. Feeling so happy felt very strange considering if either of us had been lying straight back while unconscious we could have easily choked to death on vomit or drool. Which I would think the biggest danger of this drug would be.",
  "Basically I went from having the worst trip of my life to the best feeling I've had in months all in about an hour. By the next day I felt 100% back to normal.",
  "Justin and I both experienced unconscious drooling, and our noses trying to force out the shit through these weird snorting sounds the tape picked up. It seems like our bodies were rejecting the drug in a big way. Also Justin puked all over the futon at the end of the trip. Needless to say between the drool the snot and the puke, my futon was a nasty mess.",
  "This was the biggest mistake Ive ever made with hallucinogens and even though I know if I took a lower dose of this again Id be fine, I probably will avoid 5meo-dmt for a long time. I learned just how dangerous these drugs can be and Im lucky it wasnt one of the more lethal ones. I also learned the feeling of a hellish bad trip seems like its a eternity, and its some place I will attempt to stay away from by any means necessary.",
  "Thanks for reading. I know its long. Thats what taking 130mg's OD 5meo-dmt is like in my experience."
 ],
 "erowid": {
  "id": "13799",
  "citation": " Diabolos. \"Don't Ever Do This!: experience with 5-MeO-DMT (ID 13799)\". Erowid.org. Apr 10, 2002. erowid.org/exp/13799",
  "substance": "5-MeO-DMT",
  "views": "27231"
 }
}
