{
 "id": 12774,
 "title": "Becoming Aligned",
 "date": {
  "submission": "2000-09-08T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Popgirl23",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "My friend (who tried it for the first time a few days earlier) prepared the bowl by filling it with cigarette ashes on a screen with the substance on top.  I had done yoga earlier and was sitting on the bed with this friend and another who was interested in it. Both of them were sober. I inhaled the nasty plastic tasting stuff and passed the bowl to one of them. In about 10 seconds I began to feel like my body was disintegrating along with my perception of reality. I knew I needed to lay down as I was losing touch with my body very quickly. When I laid down I focused on a 'point' in front of me. All around it were geometric abstract shapes forming and shifting around. Even my body was somehow registering these shapes. As I practiced relaxing I was made hyper aware of my body. My body felt like it was merging into a line through the center of my being. I had a few places where I was aware of 'body armor', places where your body holds on to issues from life experiences and was able to really see and let go. the more I let go the more my body merged into this line.",
  "After a few moments I became the 'line' totally and completely. I could 'see' a void space that was infinitly filled with other lines forming complex geometric shapes. I could still think as myself and never felt that 'I' was lost, even though I was now perceiving myself as only consciousness within this 'line'. I felt totally at peace and warm. The hum seemed to make sense as the universal Aum mantra. I understood this place as a place where any infinite levels of possibility could exist at once. the Alpha and the Omega.",
  "Eventually I heard someone in the room let out a deep breath and thats when I remembered there was another world, the one where my physical body was laying on a bed. I could sense the shell of my physical being return ( I could sense where my body existed vs. the universe), then I could sense the different layers of my persona returning...that was most interesting! I began to move my fingers and toes to feel my boundaries and all was intact. Voices in the hall sounded hollow and full of reverb. I opened my eyes to see my 2 smiling friends...except all I could focus on were thier eyes, everything else was a wet drippy mess of colors and shapes. I felt completely centered and I closed my eyes again to ride the experience out for as long as I could. My body felt like I had released everything I had been holding on to, like I had a great massage. Then I opened my eyes again. I wanted to say everything but my motor control was kind of weak still.",
  "My friend said 'you did good!' and they told me about what they saw coming from me. They said they could see my body going through the reactions of dealing with the 'issues' and could tell when I got through them into the void space. Then I looked asleep with a shit eating grin! (which I dont remeber having) It took about 15 minutes for the tripping to finish. Its strange to go from tripping sac to normal in 15 minutes!",
  "I am very glad I got to experience this and would like to do it again. I was able to feel a total connection with all of creation as well as my most inner sense of being. I understand that DMT is present in the Human pituitary gland and there is talk that this is released when you die. I am not sure of this, but was glad to get to see what I am holding onto before its final, and thus work on those things. I saw it as nothing but a positive experience.",
  "However in light of all this, it is nevertheless an extremely powerful experience. I was actually feeling emotional reaction and at some points painful reactions (though fleeting) with the experience of going 'up'. I suggest that only people with a good solid understanding of themselves and an ability to find thier 'center' take this venture. I am not saying you need to be a yoga master or somebody special, just someone who is somewhat secure in their position in the universe."
 ],
 "erowid": {
  "id": "856",
  "citation": " Popgirl23. \"Becoming Aligned: experience with 5-MeO-DMT (ID 856)\". Erowid.org. Sep 8, 2000. erowid.org/exp/856",
  "substance": "5-MeO-DMT",
  "views": "10349"
 }
}
