{
 "title": "I Never Really Did Leave......",
 "author": "Mork Moon",
 "citation": " Mork Moon. \"I Never Really Did Leave......: experience with Various (ID 12779)\". Erowid.org. Jan 26, 2005. erowid.org/exp/12779",
 "substance": "Various",
 "bodyweight": "220 lb",
 "report": "<p>I am an ex-freak (ok i am still a freak, but I dont trip any more except for the occasional 'e'). I am 26 now, but between 17 and 23 years I tripped on LSD probably a couple of hundred times or more, with plenty of speed, ecstacy etc to taste. Some trips were devastating, some corny (pretty patterns, thinking I had found the meaning of life, blah blah). I also indulged in mushrooms when possible (maybe a couple of dozen times), although I haven't found them particularly easy to come by, which is a pity cos I think they're lovely. I had quite a taste for psychoactive substances and even though I seemed to have more than my fair share of scary trips (maybe cos I didnt check my dosages sensibly), I liked it like I like rollercoasters. I always took something from the experience and I always came back for more.</p><p>I have found that since my days of warping the way I see the world, my vision never really went back to 'normal'. As in I still get visual distortions despite even having given up my bong :o(  I was a serious bonger for 10 years, being a bit of a lightweight when it comes to tobacco, I had to smoke my dope pure. Even after adopting my straight life - I am now a computer programmer (check out the cliche, I got fat!), and many of my peers consider me to be pretty good at what I do - I was still smoking bongs before meetings with managers at work, at 3 in the morning, before going jogging etc. Even my smoker mates could never understand how I could get fully stoned before doing these things and maybe you dont either. Anyway Im going off-track (ok so my mind never did fully straigten out I am still Mr Tangent).</p><p>Things wobble for me. I get tracers sometimes. I see things moving from the corner of my eye, then when I look at them properly I realise they are solid objects. I see cats that turn out to be shadows when I turn around to face them. I get noise in my vision sometimes (it's always there if I choose to see it if you know what I mean). Some days things simply have a haze over them. Despite this I don't think there is a physical problem with my eyes - in comparison with many of my friends it often seems that especially my long-distance vision is very good.</p><p>I also have an artistic leaning - I paint, and although I mentioned I am a programmer, I am also a web designer so much of my time still revolves around making things look good. I dont happen to think that my 'sparkly spectacles' cause me a problem (although if you ever see me piloting a plane you are about to board, take the boat instead for your own safety).</p><p>Everybody sees the world in his or her own way. One person's green is another person's turquoise is another person's blue. If I look at a brick wall and maybe the ridges are rippling a little I can pretty much rest assured that the ripple is actually occurring somewhere between my eyes and my brain. It makes things more interesting anyway.</p><p>Sometimes I make a bit of a fool of myself because of my slippery mind (like when I asked my flatmate if the landlord had sorted out a key for our windows yet - I didnt understand her confused expression until I realised that I was thinking about the last flat I lived in, over a year ago, with a different person!) but generally its good for a laugh and not many people run away screaming.</p>",
 "year": "1996",
 "id": "12779",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-01-26T08:00:00.000Z",
 "views": "6520",
 "dose": {}
}
