{
 "id": 1278,
 "title": "4th Dimension Horizontal Waves of Energy",
 "date": {
  "submission": "2001-07-30T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Satyasat",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  }
 ],
 "report": [
  "I have experienced Salvia twice now, and am still amazed at my experiences. Before my first try, I had obtained as much information on Salvia as possible. I have taken shrooms and rather potent LSD several times, and never attained any notable visuals, just physical effects. So upon my first session, I put on some Belle & Sebastian, dimmed the lights, lit some sage, and relaxed. I packed a bowl and inhaled deeply and held for about 30 sec. Feeling no immediate effect, like I thought I should, I immediately packed another full bowl and inhaled very deeply once again, hinking that because other psychedelics have not affected me, I needed more.",
  "And then it happened. For the very first time in my life I lost complete control of myself, and it sucked real, real bad. Suddenly my entire body felt like some external force was pushing me sideways. I saw no pokadots, colors or pink f*ckin elephants, I was seeing a fourth dimension, and even worse was hallucinating in it! I believe I began to flail about like a fish out of water, because this force was pushing me not really sideways or diagonal or down, but kind of a combination of both, and it was strong. All I remember seeing is three somewhat horizontal/sideways rippling waves of energy, and the color blue. Like I said, all this gave me a panic attack. My heart was racing and I wanted to bash out my brains, anything to stop it. I thank God I had knowledge of Salvia and knew I would be ok and soon it would be over. Suddenly, I became aware of presences (plural) around my bed, and cried out a woman's name and said something, but I have no idea who I named or what I said. I can't explain how it feels to be saying shit and having no idea why. I know what I said was important, and would very much like to remember. Finally, after about 15 minutes, I calmed down, and decided it would be best to sleep.",
  "The following dreams were extremely real, even for me, and even now I am having problems discerning what happened in those dreams from reality. Much later on that day, a friend and I tried some, and he experienced the exact same effects of being forced upon by an external force, and hallucinating in another dimension. I smoked half a bowl, and again felt the push, but kept my eyes closed. Still a little shell-shocked from before, I was unable to release my firm grip on reality. I still felt the other dimensional pull, but as I was relaxed and under control, I laughed and had a great time. About 40 minutes later, we both felt energized and were in good humor. We continued to receive some audio hallucinations for some time, and sitting here typing this, I am still hearing shit constantly (I just heard an owl hoot from the corner of my room, and keep hearing footsteps.) We smoked at 11:00 PM, and now its about 5:00 AM. Maybe I am just freaking my self out, but I know I didn't just imagine that owl.",
  "Overall, I learned I was not respecting the plant and its powers. It is EXTREMELY powerful and COMPLETELY unlike anything you have ever experienced. If you are not prepared for that, you will panic like me. My second trip was much more enjoyable because I remained calm and respected the power of the plant. I advise all new users to start very very slow, and have no expectations. Your first few times will take awhile for the Salvia's effects to set in -- so don't powerpuff  (trust me) -- and become comfortable with your profound experiences. Also, have a tape recorder and someone there who is sober, every time! Make no exceptions, if you do you will learn. This isn't something to be taken half-assed, or by anyone not fully mature and respectful. Two major questions I have right now (I am a philosophy major) are being able to experience this very strange 4th dimension, and the name of the woman and what I said to her. For some reason that feels very important to me. I am firmly convinced of the power and greatness of this plants spirit. Respect it!"
 ],
 "erowid": {
  "id": "138",
  "citation": " Satyasat. \"4th Dimension Horizontal Waves of Energy: experience with Salvia divinorum (ID 138)\". Erowid.org. Jul 30, 2001. erowid.org/exp/138",
  "substance": "Salvia divinorum",
  "views": "9628"
 }
}
