{
 "title": "So Relaxed",
 "author": "Nephandi",
 "citation": " Nephandi. \"So Relaxed: experience with Catnip (ID 12783)\". Erowid.org. Apr 14, 2006. erowid.org/exp/12783",
 "substance": "Catnip",
 "bodyweight": "170 lb",
 "header": [
  "DOSE:",
  "7 bowls",
  "smoked",
  "Catnip",
  "(plant material)",
  "",
  " ",
  "smoked",
  "Tobacco",
  "(dried)"
 ],
 "report": "<p>I had a left over cigar, and half an ounce of catnip, so I decided to give it a try.</p><p>I started off standing up while smoking my mixture of a pinch of tobacco and a pinch of dried catnip. After like the second bowl, I was falling against my wall, and felt a little disey. By the forth bowl, I layed down on my bed, and I just felt so relaxed. I didn't want to get up, so I stayed there for a few minutes. Finally after the diseyness passed, I got up and went against the wall and started smoking a few more bowls. I eneded up in my chair smoking it, and by the 7th bowl, I figured I had had enough and got up, put my baggie and bong away safely in my desk out of sight from my parents. I was feeling pretty fucked for the next few minutes, so I went upstarts to lye down in my bed. When I first layed down and closed my eyes, it felt like my body was moving foreward towards my head, a really cool experience.</p><p>So it's been around 20 minutes now and I decided to go back downstairs and go online. Discussing my experience with a friend, I come up with a term for smoking catnip, I call it Nipo now. hehehe Gotta love that. For sure I'll do it again. After a couple bowls standing up, that's when I felt the best, every bowl after that didn't seem to change anything much.</p>",
 "year": "2002",
 "id": "12783",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-04-14T07:00:00.000Z",
 "views": "12186",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "7 bowls",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(plant material)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": "(dried)"
  }
 }
}
