{
 "id": 12785,
 "title": "A Flow of Loving Relaxation",
 "date": {
  "submission": "2010-06-03T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zorgin",
  "gender": "Female",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "200",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "MDAI",
   "form": "capsule"
  }
 ],
 "report": [
  "I had heard about MDAI (through a passing mention online) that it was a potential non-neurotoxic alternative to MDMA. I managed to acquire 1g of this substance, a brown powder with the appearance of coca powder.",
  "Doing a great deal of research online, I expected it would have some similarities to MDMA, without the 'speedyness' or euphoria.",
  "On an evening with nothing else on the table, I suggested to my husband that we try it. I had decided on a dosage of 200mg for our first time, based on reading reports online that described that lower dosages were not rewarding.",
  "Within 15 minutes of ingesting my dose orally (powder weighed and then packed into a gelcap), I began to feel a happy come-up anxiety along with a mood lift.",
  "The high was quite pleasant. I felt the same familiar and 'soft' body load I was used to with MDMA. I felt significant mood lift, though not euphoric. My mood was not forced to be any particular thing, and would go up and down throughout the experience.",
  "Sitting and just being was easy. While I felt like I was in a new skin that allowed all sensory input to be quite pleasurable, I did not feel an urgent need to take any actions.",
  "While on MDMA, the feeling that everything in my head and heart must be said is overwhelming, I did not feel such urgency on MDAI. I did talk freely and honestly, and I felt that a new level of clarity was brought to my thinking about my relationship.",
  "I felt highly relaxed, and almost sleepy at times. The effects were quite noticeable, but none of it was unpleasant for me.",
  "The total time for this experience was approximately 4 hours. There was no crash or unpleasant comedown, just a feeling of slowly returning to baseline. I had no trouble sleeping after I came down. I would certainly ingest this substance again."
 ],
 "erowid": {
  "id": "85668",
  "citation": " Zorgin. \"A Flow of Loving Relaxation: experience with MDAI (ID 85668)\". Erowid.org. Jun 3, 2010. erowid.org/exp/85668",
  "substance": "MDAI",
  "views": "25993"
 }
}
