{
 "id": 12798,
 "title": "A Good Placebo Effect?",
 "date": {
  "submission": "2011-10-04T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zimbo",
  "gender": "Male",
  "weight": 168
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "2000"
   },
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "pill/tablet"
  },
  {
   "time": "6:00",
   "amount": {
    "unit": "mg",
    "quantity": "2000"
   },
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "pill/tablet"
  },
  {
   "time": "7:00",
   "amount": {
    "unit": "mg",
    "quantity": "2000"
   },
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "pill/tablet"
  },
  {
   "time": "7:45",
   "amount": {
    "unit": "mg",
    "quantity": "2000"
   },
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "pill/tablet"
  },
  {
   "time": "8:00",
   "amount": {
    "unit": "hits",
    "quantity": "4"
   },
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "gas"
  }
 ],
 "report": [
  "Gabapentin (400mg)",
  "Inhalant (Butane)",
  "Dose:",
  "2000mg, oral, Pill/tablet",
  "2000mg, oral, Pill/tablet",
  "2000mg, oral, Pill/tablet",
  "2000mg, oral, Pill/tablet",
  "Inhalants (Butane) 4 hits",
  "Background: Male, 370, 6,2ft tall.",
  "Ive never really tried any psychoactive drugs before, or for that matter, any recreational drugs. The only thing I ever tried was lighter gas (butane), which does give an interesting feeling, but I can really feel my brain cells frying, and I feel down for up to 24 hrs later. Huffing chemicals absolutely sucks.",
  "I also tried some dried psilocybin shrooms, but they did absolutely nothing. I suspect the dosage was too low, and since Im a big guy, I need more than people of regular size.",
  "Okay, lets try some Gabapentin. I have plenty of pills. Its early in the morning, and Ive just had breakfast, so my stomach is full. I feel neutral; neither happy nor sad.",
  "Total: 2000mg +2 hrs, 2pm",
  "I feel sort of good, like Im a tiny bit tipsy, a bit dizzy and floaty.  Theres a small amount of buzzing in my extremities.",
  "+5 hrs, 5pm: I can definitely feel the effects now. I feel pretty drunk and dizzy, and my eyes can only really focus on whats right in front of me, but I can still act sober. I get an occasional wave of pleasure running through my body, and it feels really good. I need more.",
  "+5,5 hrs, 5.30pm: Ate dinner, feeling a bit more sober now. My vision is still a bit blurry Okay, maybe I didnt sober up. Im smoking a cigarette, and just felt another wave in my head. This is weird, but it feels good. Smoking really seems to enhance the feeling.",
  "Total: 4000mg +6 hrs. 6pm",
  "Just doubled the dosage. Im considering huffing a tiny amount of butane, but I dont know. The stuff is nasty, causes headache, and I can taste the butane in my mouth for an entire day. The trip lasts only a few minutes, but it is awesome while it lasts. Well see. For now, Im satisfied with just the Gabapentin. Im in my recliner, just chilling, preparing to listen to some music. Its very serene around here. Birds are chirping outside and it has just rained, so the smell of flowers is amazing and very powerful. Mentally, theres no change. I feel exactly the same as when I woke up. Looking in the mirror, I can see bags under my eyes. I dont feel especially tired though. Physically I feel a bit different. It may just be my mind messing with me, but I seem to be able to breathe easier, almost like the air flows faster into my lungs.",
  "Total: 6000mg +7 hrs. 7pm",
  "I couldnt find any butane, which is probably a good thing, so I went to buy cigarettes. The physical effects seem to be gone, though my eyes are a bit more sensitive. I seem to notice things I usually dont: the bright color of the flowers, the faint shift of colors in hedges and bushes. White almost blinds me, yet I feel almost drawn to it. When I went into the shop, I noticed the hubcaps on a parked car. They seemed to move a tiny amount. Everything inside the shop (which Ive shopped at almost daily for 12 years now) is brighter than usual. Its an explosion of color. Even the skin of the cashier, whom Ive seen plenty of times, seems to be softer and more gentle than before. Its a bit odd, not unnerving or anything, but pretty cool. My eyes are hurting a bit from having such a hard time focusing on anything.",
  "Total 8000mg +7 hrs. 7.43pm",
  "Last chance for this to impress me. 8 grams inside me now. I feel absolutely nothing anymore. Lets see if anything happens.",
  "+8 hrs. 8.44pm",
  "Found some butane, and took 4 hits, to see if the Gabapentin would react to it. Doesnt really seem to do anything. I now honestly believe everything I experienced today was just a placebo effect, due to all the stories Ive read about it. I seem to be immune to Gabapentin. No numbness, Im not dizzy anymore and I feel absolutely fine. I probably got dizzy because I didnt sleep well last night. Its the same with shrooms, or anything else that has to go through my stomach. No effect. I even have to take a triple dose of Paracetamol to cure a headache. I thoroughly believe that my immune system is way too strong, and it just crushes anything unfriendly it comes in contact with. Of course, Im too much of a chicken to try anything stronger, to test my theory."
 ],
 "erowid": {
  "id": "85757",
  "citation": " Zimbo. \"A Good Placebo Effect?: experience with Gabapentin (ID 85757)\". Erowid.org. Oct 4, 2011. erowid.org/exp/85757",
  "substance": "Gabapentin",
  "views": "4354"
 }
}
