{
 "title": "Up and Down, Can They Be Get Along?",
 "author": "Lain",
 "citation": " Lain. \"Up and Down, Can They Be Get Along?: experience with Propoxyphene, Diazepam, Methylphenidate & Morphine (ID 12792)\". Erowid.org. Nov 9, 2007. erowid.org/exp/12792",
 "substance": "Propoxyphene, Diazepam, Methylphenidate & Morphine",
 "bodyweight": "190 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "120 mg",
   "insufflated",
   "Pharms - Propoxyphene",
   "(capsule)",
   " T+ 0:00",
   "20 mg",
   "insufflated",
   "Pharms - Diazepam",
   "(ground / crushed)",
   " T+ 0:20",
   "20 mg",
   "insufflated",
   "Pharms - Methylphenidate",
   "(ground / crushed)",
   " T+ 0:20",
   "10 mg",
   "oral",
   "Pharms - Methylphenidate",
   "(pill / tablet)",
   " T+ 2:10",
   "30 mg",
   "insufflated",
   "Morphine",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "2001",
   "12792",
   "Male",
   "",
   "Not Given",
   "Nov 9, 2007",
   "15705",
   " "
  ]
 ],
 "report": "<p>Mindset & Setting: I had a good breakfast on the day of this event.  I was in grad school and was experiencing no outside emotional strains.  I was not depressed or suicidal.  Consumption occurred at my house.</p><p>The lure of pushing the envelope is for some is a seductive ideal.  I realize the human body is not indestructable, but if Keith Richards is still alive it can sustain signigicant damage without being fatal.  I would like to preface this experience by saying it is not safe to mix uppers and downers.  The combination confuses the body and can be fatal.  But if you are reading this you probably already know that.</p><p>5:00 pm  I broke open two 60mg capsules of Darvon and dumped the contents onto a piece of paper. I then took two 10mg Valium and crushed them and mixed them into the Darvon.  I call this mixture a Partly Cloudy.  I poured the mixture on my tongue and chased it with a Coke.  I recommend something sweet, because the Darvon stings my tongue and the Valium is becomes bitter to the taste when powdered.</p><p>5:15pm  The Partly Cloudy had taken effect.  I felt warm and relaxed with a subtle euphoria.</p><p>5:20pm  I took three 10mg Ritalin (immediate release).  I crushed two and snorted them.  I ate the other.</p><p>5:30pm  The relaxing qualude like feeling of the Darvon/Valium mixture was accentuated perfectly by the Ritalin.  I was able to enjoy the opiate like high without the slow mental reaction and thoughts processes related their use.</p><p>5:45pm  I experienced a physical high like nothing I can describe.  It was the best I have ever felt in my life, but not the highest I have ever been.</p><p>7:10pm I began feeling edgy from the Ritalin.  Taking one if you are snorting them usually helps with this feeling, but you really only have two choices:  ride it out, or add some more downers to the mix.  I crushed up a 30mg Morphine tablet and snorted it-problem solved.  An excellent buzz and the best of both worlds.</p>"
}
