{
 "id": 12791,
 "title": "The Neverending Laugh",
 "date": {
  "submission": "2003-04-23T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dluv427",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0:30",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  }
 ],
 "report": [
  "I researched quite a bit about salvia before taking it, so I thought I was ready for the effects. Well the first time I smoked it, nothing happend. The 2nd time I smoked it (30min after the 1st) it felt like I was becoming the couch I was sitting in. That lasted for about 2 minutes, during that time I was telling my sitter 'look man, im melting into the couch' he didnt know what to say. The third time I smoked it was prolly 30min after the 2nd time. I shut my eyes and layed down. I then saw an entire story in my head. Its hard to explain exactly what I saw, but a lot of stuff was goin on, and it was goin on very fast. Well I took a nice rest, still not satisfied with my purchase. I smoked some bowls of weed, chilled out a bit, then called up my friend so we can do it together. He came over and we sat on my front porch. ",
  "It was about 2hrs ago, 3am, we were outside, I sparked up my 4th salvia bowl. After my second hit off the pipe, I was gone. IT HIT ME LIKE A TRAIN. I started laughing the hardest I have ever laughed b4 in my life and I couldnt stop. I was crying from all the laughter, but I was still in touch with reality cuz I was looking over at my friend and I motion to him 'WTF' I couldnt believe what was goin on. Why couldnt I control myself. During the laughing period I found myself putting my head down and staring at my shadow. I thought my shadow was a different person and that instead of just being me and my friend on the porch, it was me, my friend and my shadow. At that point I snapped out of my trance, and sat there in shock. I now am satisfied with my purchase, and I now respect lady salvia, whatta trip."
 ],
 "erowid": {
  "id": "8571",
  "citation": " Dluv427. \"The Neverending Laugh: experience with Salvia divinorum (5x extract) (ID 8571)\". Erowid.org. Apr 23, 2003. erowid.org/exp/8571",
  "substance": "Salvia divinorum (5x extract)",
  "views": "5515"
 }
}
