{
 "id": 12795,
 "title": "Warm from Chiles",
 "date": {
  "submission": "2011-02-22T08:00:00.000Z",
  "experience": "1995-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "spicy me",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Capsicum spp.",
   "form": "dried"
  }
 ],
 "report": [
  "Although not some sort of hot foods obsessive, I tend to eat chiles almost daily these days. Their health benefits are remarkable, and certain examples (such as fresh, not dried, cayennes) can be delicious, with a complex combination of heat, sweetness, and lingering effects. Some time back, I would occasionally meet someone at a Thai restaurant and at one point remarked that I felt as if I'd just smoked a joint after eating a dish that I added Thai chiles to (probably used that delicious garlic/chile sauce, too). She laughed and told me it was just my imagination, so I slightly doubted it and thought it was something else, but I enjoyed the lingering euphoria, which was like cannabis, indeed, and lasted 2 hours or longer. This happened on more than one occasion.",
  "One time we were at the same place and a young woman sitting behind us told her friend the same thing, so I knew it wasn't just my hopeful imagination. So I bought a container of the dried chiles, tried them at home, and was happy that they worked very nicely. A heaping teaspoon or so of the dried pods (or crushed pods, in some cases) was all that was needed. I also had the impression that including sweet foods, sugar of some sort, heightened the experience. Mental euphoria, physical sedation with a floating alertness, very nice. Even better when Thai iced coffee was included. Even with all the chiles I've grown and eaten, I've only had a similar experience one other time, with habaneros, which are really difficult to eat, NOT tasty (and not as certain for this effect), and the Thais are more effective and tasty and lingering, anyway. I look for the short pods (maybe 1.5' long), dark brick-red, often flattened when dried, with a squared-off lower end.",
  "The only thing I know that will ease the heat in the mouth is milk products. Using the whole pod or its dried remnants is best. I avoid pods which are discolored and dark, brown and crumbly, or otherwise obviously decaying and old. Caveat emptor!",
  "[Reported Dose: up to one-half oz. (dried), sometimes less]"
 ],
 "erowid": {
  "id": "85736",
  "citation": " spicy me. \"Warm from Chiles: experience with Capsicum spp. (ID 85736)\". Erowid.org. Feb 22, 2011. erowid.org/exp/85736",
  "substance": "Capsicum spp.",
  "views": "5038"
 }
}
