{
 "id": 12806,
 "title": "Alone, Has Very Little Recreational Value",
 "date": {
  "submission": "2010-07-22T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "DocManhattan",
  "weight": ""
 },
 "dose": [
  {
   "time": "0",
   "amount": "185 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>My history with substance experimentation, like so many of you, cannot and should not be summarized as a bullet-point list of substances in which I have or have not used.  Further, my chemical studies have always been viewed as an opportunity to expand my personal understanding of both myself and the reality in which I perceive.",
  "When I first came across the substance MDAI, I had done a lot of research on it.  It is my understanding that it is used in research laboratories as a serotonin releasing agent under careful experimentation models with animals  usually used as a basis for comparison on similar compounds.  MDAI is unique in that it seems to be restricted toward solely the serotonergic system. ",
  "My first use of this substance was carefully measured at precisely 185mg, administered orally.",
  "The primary resulting effects of this substance in the human model includes a perceived brightening of colors, enhanced empathy, and a subtle relaxation  all characteristic of increased synaptic levels of serotonin.",
  "Recreationally, this substance alone has very little value  which is fascinating when taken into consideration the unofficial belief that MDMAs primary effects result from increased serotonin activity.  Experimentation with MDAI has shown me, first hand, the drastic differences in primary neurotransmitter activity.  Without any action on norepinephrine or dopamine, this substances usefulness as a therapeutic tool seems to be quite low.",
  "An interesting aspect to note:  The recreational/therapeutic benefits of a correct serotonin/dopamine/norepinephrine ratio are indeed so important, that I found MDAIs usefulness to be markedly improved upon the implementation of mere D3 receptor stimulation through the simultaneous use of chewing tobacco.",
  "Paired with any stimulant affecting the dopamine/norepinephrine systems in the brain, this substance could have some usefulness.  More experimentation is in order.</p>"
 ],
 "erowid": {
  "id": "85824",
  "citation": " DocManhattan. \"Alone, Has Very Little Recreational Value: experience with MDAI (ID 85824)\". Erowid.org. Jul 22, 2010. erowid.org/exp/85824",
  "substance": "MDAI",
  "views": "23258"
 }
}
