{
 "title": "One Bowl",
 "author": "Savvy",
 "citation": " Savvy. \"One Bowl: experience with Mushrooms - P. cubensis (ID 12804)\". Erowid.org. May 5, 2007. erowid.org/exp/12804",
 "substance": "Mushrooms - P. cubensis",
 "bodyweight": "170 lb",
 "report": "<p>I was leaving a party at the end of the night, and coming down from the effects of ecstacy (half-cap) and marijuana (LOTS). I wanted to keep awake for an all-nighter adventure with my friends, so I figured 'hey, why not try smoking some?' I'd done it before when it was mixed with weed, and that was kinda fun but nothing like being stoned or high on mushrooms after eating them orally. It was a very laid-back experience with mild visual changes in lighting and perception.</p><p>So I figured smoking a bowl of pure mushrooms would be a more potent version of that experience. I split this bowl between 3 people. Before you go and say 'This never happens to me, he's lying', I must say that everything here in BC is better than most other places. It's something I take for granted too much. We smoked it for a LONG TIME. The dried, powdery mushrooms just wouldn't stop burning. I think we all got about 10-15 hits from the 0.5 grams in the pipe. After we'd finished, we immediately felt incredibly body-stoned, similarly to eating a pot brownie with 0.5 grams of THC butter in the recipe (yummy!). We went to a store to get munchies, cuz that's what happens when you're stoned. I was disappointed with the fact that we weren't seeing more visual changes, but as we were leaving the store and into the cold night, I was hit with a HUGE body rush and had to sit down on the corner. Everything that I had wanted to happen was happening. My vision was sharper than an eagle's and I could see shadows at a depth that can't be described. Everything was crystal clear and sharp, and I felt like something from the wild. My friends were having similar experiences, but I'd smoked more and so I was having heavier effects. Sounds were muffled and I no longer felt cold. These effects carried on for a few hours and were all quite pleasant. The only negative thing I can announce from the experience is the taste of smoked mushrooms is horrible and may very well make you gag. When my body finally gave up and let me sleep, my dreams were intense and twisted, and I remember them all quite clearly.</p><p>This was overall a 4-5 hour high from just 0.5 grams that were split between 3 people. When I pay $10 for 3.5 grams of these p. cubensis indoor-grown mushrooms, it's well worth it to eat 3 grams of them for the oral mushrooms experience, and then I'd suggest (at a different time) to smoke the last half-gram in a bowl or mixed with weed in a bowl, to yourself, and not with other people, for a very different and enjoyable high.</p>",
 "year": "2002",
 "id": "12804",
 "gender": "Male",
 "timestamp": "2007-05-05T07:00:00.000Z",
 "views": "10584",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Mushrooms - P. cubensis",
   "form": "(powder / crystals)"
  }
 ]
}
