{
 "id": 12837,
 "title": "Good for Getting Stuff Done",
 "date": {
  "submission": "2010-07-29T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Benny Boy",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "DAY 1:",
  "First experience with Amphetamines is Vyvanse with a prescription of 50mg. For me, I can't stand mindless office work, but that happens to be one of my jobs. I took two 50mg pills and an hour later at 8:30 they were running strong.  I was sweating and moving around to get the jobs I needed to do done.  By 5:00PM, I was off work and ready to go home and lay down. My pupils were still dilated until around 7:00PM.  I tried to go to bed around midnight but couldn't sleep, I was just completely restless all night. I didn't sleep one minute.",
  "DAY 2:",
  "After my sleepless night, I realized I needed to take 100mg again to keep me awake at my second job of flipping a house (yard work and picking up trash).  Just like before, one hour later my body was awake and ready to get this job done (9:00AM).  The temperature outside was over 100F and there was no A/C in the house. This is the most I've ever sweated in my entire life leaving my clothes and long hair drenched in it.  I was drinking water and gatorade throughout the day but around 3 I couldn't hardly function I was so tired.  So drank some more and worked inside until I started to get those 'pre-puke' burps.  I walked outside and puked everything I had eaten and drunk all day.  I had to go to the basement to cool off so I wouldn't pass out.  After I got over my heat exhaustion I kept working until 5:00PM. ",
  "When I got home I checked my eyes and they were crazy Dilated but just waited til 7:00PM like last time.  Still no Luck with them contracting but I wasn't worried. I took the Vyvanse later than the first day so I gave it time.  Around 10:00PM they were finally not noticeable.  After my exhausting day at work, I just sat down and watched tv to relax.  I kept yawning but around 11:30PM my body got over the tiredness. ",
  "So here I am now, it's 12:45AM and I doubt I'll sleep any tonight.",
  "OVERVIEW:",
  "Positive Effects:",
  " -No tiredness at all",
  " -Very high work effort",
  " -More Social and Friendly",
  " -Lasting all day",
  "Negative Effects:",
  " -A lot of shaking from my hips to my feet",
  " -Worst cottonmouth that I've ever gotten",
  " -Dilated Eyes",
  " -Vyvanse is suppose to last for around 12 hours; Maybe because   I took two, it lasts around 18 or so",
  "I think Vyvanse is a very good working stimulant if I want to get something done, but not as good to take for recreational purposes. It is not very euphoric but enough to keep my head high (no pun intended). I thik I'll use one of the other faster working amphetamines to get high and use Vyvanse to get some work done."
 ],
 "erowid": {
  "id": "86002",
  "citation": " Benny Boy. \"Good for Getting Stuff Done: experience with Amphetamines (Vyvanse) (ID 86002)\". Erowid.org. Jul 29, 2010. erowid.org/exp/86002",
  "substance": "Amphetamines (Vyvanse)",
  "views": "16875"
 }
}
