{
 "id": 12839,
 "title": "Careful with this Benzo/Dissociative Combo",
 "date": {
  "submission": "2010-09-22T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "undervet",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "IM",
   "substance": "Pharms - Tiletamine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "IM",
   "substance": "Pharms - Zolazepam",
   "form": "liquid"
  }
 ],
 "report": [
  "I administered .3 mL Telazol IM (available to vets in a 5ml multi-dose vial)  and then went to play some video games.  I managed to turn the system on, get the game running and then...whumph.  Double vision and extreme dissociation followed quickly though I was able to get to my bed (I felt very tired) without problems, this was clearly too much for someone with no benzo tolerance like myself.  As an experienced opiophile, I figured .3 mL of a downer like this would be no problem, boy did I underestimate these two very potent drugs.  My hand/eye coordination was impaired, though I managed to navigate some rather difficult obstacles in the dark.  Mostly, this drug combo made me feel as if I was Extremely Drunk w/o the nausea.  A little euphoria and  an overall positive feeling, though I wouldn't describe the experience as 'fun'.  Ultimately, I just fell asleep. ",
  "On another occasion (one day later), I administered .1 mL of the same solution (5mg Tiletamine/5mg Zolazepam) IM and found it to be much more pleasant, though of little recreational value.  A little double vision at first, quickly returning to normal.  An overall 'chilled out' effect, no euphoria or any particularly good feeling, though no bad feeling either.  Not something for the partier, but not unpleasant either. No real hypnotic effect at this low of a dose.  A really potent anxiolytic.  But that's it.(This report was written while under the influence of .1 mL Telazol IM)"
 ],
 "erowid": {
  "id": "86014",
  "citation": " undervet. \"Careful with this Benzo/Dissociative Combo: experience with Tiletamine & Zolazepam (Telazol) (ID 86014)\". Erowid.org. Sep 22, 2010. erowid.org/exp/86014",
  "substance": "Tiletamine & Zolazepam (Telazol)",
  "views": "6398"
 }
}
