{
 "id": 12834,
 "title": "Ultimate Opiate",
 "date": {
  "submission": "2010-08-28T07:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Vlad420",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "(ground / crushed)"
  },
  {
   "time": "2:00",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxymorphone",
   "form": "(ground / crushed)"
  }
 ],
 "report": [
  "I have been addicted to opiates of all types for about 3 years. My favourites were OxyContin and Heroin. That's until I procured 5 20mg Opana pils for $20 a pop, which I thought to be very expensive. This is the brand name for time-release OxyMorphone. Its the same as OxyContin with the time release coating that needs to be removed prior to snorting the pills. Me and my roomate snorted one of the 20mg pills each, because the guy we got them from told us it would be bout the same as doing a 40mg OxyContin. At the time we were on about 3-5 of the 40mg Oxycontins a day, so I figured this would be a conservative first dose at our tolerance level.",
  "So we crushed up the pills after we both got off work that day, which are much softer than oxycontin pills, and are very soft on the nostrils when snorted. I barely feel them going into my mucous membranes. We snorted our lines all at once, one pill each. Within a minute, a rush went through my whole body and I found myself lying back on the couch in a state of complete bliss and euphoria. I have never felt a rush like this from anything. I have never shot anything up, but smoked heroin doesn't come close to what I felt. This was complete euphoria, and complete dissolution of all problems in my life. I was happy.",
  "The rush seems to wear off in about 10 minutes, and a solid opiate high sets in and lasts a good 2 hours or so. It doesn't last as long as Oxy's but the rush is so intense and amazing. We both snorted another pill 2 hours later and got the same rush. The high is different from oxys as well. It feels stronger than Oxy, but at the same time softer and without the heavy load of oxy.",
  "I haven't been able to get any more of these since. But I have longed for them ever since. These provided the best opiate high I have ever experienced. I noticed no hangover or unpleasant effects of any kind from these pills. Just blissful apathy and euphoria that slowly fades back down to baseline.",
  "I still hope to find these again someday."
 ],
 "erowid": {
  "id": "85987",
  "citation": " Vlad420. \"Ultimate Opiate: experience with Oxymorphone (Opana) (ID 85987)\". Erowid.org. Aug 28, 2010. erowid.org/exp/85987",
  "substance": "Oxymorphone (Opana)",
  "views": "16796"
 }
}
