{
 "id": 12838,
 "title": "Please Don't Sniff Inhalants",
 "date": {
  "submission": "2005-06-30T07:00:00.000Z",
  "experience": "1995"
 },
 "author": {
  "name": "WorstMistakeofmyLIFE",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "I learned how to sniff inhalants by accident.  I won't go into the details, but it started with a can of compressed air, the kind you use to clean your computer keyboard.  I come from a conservative family and would never had tried it, but I was curious about how you could shake the can, hear liquid, but spray it and only air came out.  The first time I inhaled it, I blacked out and fell on the floor.  But because the feelings were so new and intense I decided to try it again.  I tried different things including air freshener aerosols and gasoline.  There are so many products that have these gases in them.  I knew they were bad for me, even though there was not a lot of education about these products at the time (late eighties, early nineties).  I was so scared that I would cause a brain injury that I would stop after a while.  I would go months without huffing.  After huffing, I would feel so bad about myself, and bad about how disappointed my parents would be in me if they knew I was doing this.",
  "I abused inhalants to escape life.  I didn't know how to face things.  Anyway, the last time I huffed was in 1995 when I decided to concentrate some isobutane in a condom so I could inhale the pure stuff.  I got somewhat high from that as usual.  I felt horrible that I had done it and stopped as usual.  What was not usual is that a few days later, I would be having lunch with a friend at the mall.  And while he was talking to me, I would have to ask him to stop.  I felt like I was going to lose consciousness or something and that if I didn't focus, I would die.  These episodes lasted only for about thirty seconds or so, but happened daily for about a couple of weeks.  I wasn't worried after the first one, but as they kept happening, I became very worried.  After the two weeks of the little episodes, I had a big one that laid me out on the floor of my second job.  I didn't know what hit me and thought I was going to die.  It was after this episode that I drew the connection to my last huffing experience.  I had had a grand mal seizure.  During the weeks prior to this, I was having petit mal seizures.  I was hospitalized where I had another grand mal seizure while talking on the phone to my mom, which of course worried her tremendously. ",
  "In a way, I am thankful for this horrific experience. I haven't huffed since and I never will again.  If this had not happened, I don't know where I'd be today.  In any event, I was put on Dilantin for 4 years.  At each step of the way and each doctor I saw I had to go through the embarrassment of telling them that I was huffing, and watch their disapproving faces as they thought how useless it was for me to be in the hospital since this was avoidable.  My friend who accompanied me to the hospital was so disappointed as well.  And I was humiliated (I had always huffed alone and kept it secret). ",
  "After the four years, I tapered the Dilantin and found that my seizures were gone.  With each year that I go without one, the chances of me having another one decrease.  I am thankful far beyond words.  I feel like I could not be more lucky if I won the lottery.  Please, please, please don't sniff inhalants.  It's not worth it.  Don't tell yourself, that you probably won't have an experience like mine.  It's not worth it.  It's just not worth it."
 ],
 "erowid": {
  "id": "8601",
  "citation": " WorstMistakeofmyLIFE. \"Please Don't Sniff Inhalants: experience with Butane, Isobutane & Gasoline (ID 8601)\". Erowid.org. Jun 30, 2005. erowid.org/exp/8601",
  "substance": "Butane, Isobutane & Gasoline",
  "views": "16406"
 }
}
