{
 "id": 12858,
 "title": "The Vasoconstriction is for Real",
 "date": {
  "submission": "2010-08-03T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Aurantiaca",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I have read reports of people's knees, feet, and hands turning purple from using high doses of mephedrone.  I've used it several times, in doses up to 800mg (over the course of 10 hours or so) and never had any problems at all, not even a slight hangover the next day.",
  "A few days ago, a friend of mine came over with 1 gram of mephedrone to share.  Hers was from a different supplier than any I had before.  In the past, I have not found insufflating it to be very painful at all, and has been my favorite way to do it.  A took a very small key bump of hers, and it burned like nothing I have ever felt before (and I've snorted many things).  I decided that just taking it orally was the way to go.",
  "We each consumed 300mg dissolved in juice, and within 20 minutes or so, we began to feel the effects.  It felt exactly what I expected it to feel like.  Intense euphoria for about 45 minutes, followed by about an hour of pleasant stimulation.  I went to the bathroom, and while I was in the bathroom, my friend prepared and consumed another 150mg boost.  While in the bathroom, I noticed that my knees were beginning to turn purple! ",
  "While I was in the bathroom, my friend had also prepared a 150mg boost for me as well, which I did not consume.  She never had any problems with anything turning purple, I was the only one affected.  I monitored my condition for the next few hours, and it was localized only to my knees and didn't get any worse.  When I woke up the next morning, it had resolved entirely.",
  "I don't know if it was just her batch or what, but what she had tasted and felt exactly like what I know mephedrone to feel like, so I don't think it was another chemical entirely, I think it was in fact mephedrone.  It seems odd to me that I am the only one who had this problem despite the fact that my friend consumed a higher dose than I, plus I have consumed much larger doses and had no problems at all.",
  "In conclusion, I found the whole experience very alarming.  Loss of blood flow to parts of your body cannot possibly be a good thing.  This didn't cause any serious problems and resolved in a matter of hours, but it was alarming all the same.  Mephedrone is an unknown substance which has not been studied for possible adverse reactions.  Even though it all worked out fine in the end, I'm a little afraid of the stuff now, and it is highly unlikely that I will ever try it again."
 ],
 "erowid": {
  "id": "86157",
  "citation": " Aurantiaca. \"The Vasoconstriction is for Real: experience with 4-Methylmethcathinone (ID 86157)\". Erowid.org. Aug 3, 2010. erowid.org/exp/86157",
  "substance": "4-Methylmethcathinone",
  "views": "10382"
 }
}
