{
 "title": "17 Lost Years",
 "author": "Donster",
 "citation": " Donster. \"17 Lost Years: experience with Diazepam (Valium) (ID 12869)\". Erowid.org. Jun 25, 2007. erowid.org/exp/12869",
 "substance": "Diazepam (Valium)",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "30 mg",
   "oral",
   "Pharms - Diazepam",
   "(daily)"
  ]
 ],
 "report": "<p>First I'd like to say I took valium for anxiety and had to pester my doc to get it. To be blunt this drug is very,very bad long term, I thought at first my anxiety problems were gone. After all all the drug from the doctor are good, right? I was entering a horrible world of addiction of not just valium but many other drugs, you see on valium I am very tranquil and after about 6 months I need it to feel normal, if I forget to take it I feel very stressed till U get more. And when on valium my inhibitions are lower like alcohol, I found that other drugs are easier tolerated on valium like acid, pcp, anything now after years of abusing it about 10 years, I decided to quit, Let me tell you my friends I was as wild as an animal and couldnt think and people thought i was crazy, this valium led to Cocaine, heroin all the drugs I could get my hands on I sold cocaine, and did valium at the same time to control the mood swings.</p><p>Finally, after 17 years I was in the mental ward for suicidal thoughts, they gave me what else? Valium. I seen a counselor and was told valium was leading me back to other drugs, I am an addict. Valium only supports that behavior, So I checked in to a high class rehab, lots of local celebrities used this place, They took me off valium cold turkey with only an occasional dose of Phenobarbital.</p><p>I would not wish withdrawal from this on my worst enemy. I was on heroin and valium when I entered. the heroin wasnt shit to quit compared to the valium, every nerve in my body screamed for this substance, It was just like tripping , the hallucinations were non stop for a whole month I wanted to kill my self , I didnt know who I was supposed to be, valium was in my mental bone marrow. I didnt sleep for the first week and those people at the clinic didnt have much sympathy for an addict . I was told to return to work, I still hadnt slept for more than one hour, and once I got home things got worse my doctor refused to see me anymore and I felt crazy and wired, and for some reason had a constant metallic taste in my mouth.</p><p>When I went back to work still no sleep I was treated badly by my co-workers, they fucked with me, played games called me psychotic it got so bad I slapped a co-worker as hard as I could on his head for welding my locker shut he was 6'2' and looked like Mr.T. Much to my amazement he ran away from me and I got newfound respect from my now humbled coworkers. I was new to this department and people didnt know this 'white boy' went to a 70% black Detroit school ,and not having any valium made matters worse so now I get lots of respect but dont quite know how to handle my emotions, again thanks to valium. </p><p>I was told by a doctor that this withdrawal was worse than heroin and crack combined! And I might feel better in 6 months, to this day I have not taken valium again I feel I lost my reality from age 25 to 42 and now after 6 months of abstinence from valium I feel actually human again but my nervous system is shot. My hands always tremble now but now I love life again. Like a snake shedding my old skin, I am new and real. I now feel like the young lad I should have been.</p><p>I gave some away to friends who got in a fight and bludgeoned the other with a pipe, I never faced my fears with valium, it controlled me, in every facet of my humanity. It took away 17 years of my life which I cannot get back. Its been 8 months now and God I wish I could get those years back ,and must face not taking any drug forever as to remain sane. I am an addict and my behavior will always be as an addict.</p>",
 "year": "2001",
 "id": "12869",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-25T07:00:00.000Z",
 "views": "43186"
}
