{
 "id": 1286,
 "title": "Out of Body LSD",
 "date": {
  "submission": "2001-05-15T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Misphunkshinz",
  "weight": 54
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "My friend and I consider ourselves experienced trippers to some degree or another, even spiritual if you will. We often would sit in my well designed basement bedroom, 'the acid room,' and trip for hours on end listening to goa. This is a most stimulating experience in itself, to listen to one of the most auditorily challenging music styles on the planet. This isn't any kind of techno, however; it is a very spiritual and influencing sound.",
  "One day I decided to indulge on my own, which I really do enjoy at times. I took 2 blotters, which I secured from a rave a few day earlier. The acid began to take effect and let down its unrelenting power upon my willful mind. General color pattern changes and breathing and molding occured. I sat and watched a candle move around for quite a while.",
  "I proceeded then in my peak to smoke a bowl or two of some good commercial and increase the auditory stimulation and reception of my mind. So there I lay on my couch between 4 three-foot three-way speakers and two tweeters, which created an enviroment with awesome surround sound. All was normal until the weed kicked in. Directly across from me there was a black light illuminating the room and lighting a Hebrew eye chart across from me and a few irridescent things in that area of the room. To give a short idea of what this room looks like, imagine half of a normal sized basement, a speaker in every corner, and on both concrete walls there were complete black light hand paintings I did that have UNINTENTIONAL 'hidden pictures' in them, which my friend pointed out for me.  One is quite impressive, it's a lake reflecting green hills and a mountain of volcanoes and it looks real only under the black light (painted in white light, mind you).",
  "So here I was in the center of this room staring at the wall with my favorite techno dj tape on (dan efex:protocols) and the moment it started I felt as though I was being pulled further and further away. When I finally looked at what I was seeing, I realized I was looking out of my face as if I was seeing through the holes of my eyes, nose and mouth. Eventually I was no longer there at all. The experience itself remains somewhat of a mystery, but  I do know that I attained knowledge, memories and life experiences of someone else which I knew of when it happened but the setting of this out of body experience was completely foreign to me, out of this world. I highly recommend to all those people out there who are into experience, find Hallucinogen:the lone deranger, or something known as GOA trance, and take a listen while in a good LSD/marijuana state and you will understand what I mean. Salvia is next on my list so expect to hear from me again."
 ],
 "erowid": {
  "id": "1384",
  "citation": " Misphunkshinz. \"Out of Body LSD: experience with LSD (ID 1384)\". Erowid.org. May 15, 2001. erowid.org/exp/1384",
  "substance": "LSD",
  "views": "23347"
 }
}
