{
 "title": "Came Very Close to Having My Heart Explode",
 "author": "'tanya'",
 "citation": " 'tanya'. \"Came Very Close to Having My Heart Explode: experience with Heroin & Cocaine (ID 12868)\". Erowid.org. Jun 28, 2007. erowid.org/exp/12868",
 "substance": "Heroin & Cocaine",
 "bodyweight": "115 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "IV",
   "Heroin",
   "",
   "",
   " ",
   "IV",
   "Cocaine",
   "(powder / crystals)",
   "",
   "4 tablets",
   "oral",
   "Pharms - Diazepam",
   "(ground / crushed)"
  ]
 ],
 "footer": [
  [
   "1991",
   "12868",
   "Female",
   "",
   "Not Given",
   "Jun 28, 2007",
   "52358",
   " "
  ]
 ],
 "report": "<p>1991: death year.  Heroin, cocaine, pills, living in and out of fleabag hotels, street prostitution, the works.  My escape from it all was to plug into the noise-fuck effect I got from mainlining speedballs.</p><p>I'm gonna keep this short.  Most of us know better than to do these particular drugs.  A few years before this I thought I did.  Our minds, though, they're tender things, really, and when support is pulled out from under you, and your connections to people and the world around you severed, and your own life's most meaningful objects taken from you (in my case, all my art and tapes being stolen or disappearing via various disasters) we are all too likely to fall into the slow-suicide syndrome.  I don't really want to die, I just feel like I do all the time, so I kill myself slowly, hoping I won't notice.</p><p>That's where I was at.</p><p>The coke was too pure.  I'd gotten it from a trick who was apparently at the top of the coke pyramid somehow so wasn't hauling cut street crap around in his suitcase.  He'd given me a little thinking I'd just be snorting it.  Would have been nice if he'd warned me about it being uncut.  </p><p>I almost died.  I know I came very close to having my heart explode.  I'd done speedballs before but this was a horrible, horrible overload.</p><p>There's a difference between body-unawareness on a psychedelic and this kind of body-blanking.  Because my body itself was not blanked, just ONE PARTICULAR NEUROCIRCUIT was cut: my ability to control my own muscles.</p><p>Arms, legs, fingers, toes, voice chords, neck backandforth flailing flinging spasming.  Thoughts ten thousand miles too fast to even know, only feel the vertigo of their passing.</p><p>My companion (essentially junk-friend, these kinds of things are why IV users should NEVER use alone) saved my life by grinding four valium tablets into a powder and putting them into water and making me swallow it.  In about four minutes the spasms and convulsions subsided and ten minutes later I was back in control and crying, feeling like every last bit of neurotransmission fluid I had was drained away but so thankful to be able to make my legs move the way I wanted them to and be able to do it effortlessly.</p><p>It was my last experience with any IV stimulant and a few months later I went to rehab for a short time, got on methadone for the heroin addiction, and never touched a needle again.  </p><p>Coke is bad, bad, bad, bad stuff.  I don't know why I'm alive.  Or if there's a reason.  This kind of luck isn't given out to many and I think I got the luck for about the next 10,000 years on that.</p>"
}
