{
 "id": 12861,
 "title": "How to Get Higher Than Ever (Not Really)",
 "date": {
  "submission": "2010-07-03T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "son of silence",
  "gender": "Male",
  "weight": "180 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Inhalants"
  }
 ],
 "report": [
  "[Erowid Note: Unconfirmed Death Report. This report of a death associated with an unspecified inhalant was submitted with no verifiable details and no contact information. Erowid is choosing to publish this report to invite public comment and to allow anyone who knows about this event to submit details which we can verify.",
  "Neither this report nor any report of a death should be considered reliable -- nor much weight given to it -- without details that can be verified through hospitals, police reports, family members, or news reports. If you have information about this or other deaths directly resulting from the use of any psychoactive substance we cover, please contact sage at erowid.org.]",
  "This is written out of love and the hope of reducing suffering.",
  "A dear friend decided he would stop smoking weed and cigarettes and drinkin to appease his girlfriend.  In everyones eyes he had given up all his vices for his love. Roughly 4 into his hiatus my friend was found dead with a plastic bag and aresol can. The fact of the matter is my buddy was not a stupid person ignorant of the dangers of inhalants, he was well versed in using inhalants, growing up playing around with this gaseous death. ",
  "I am no saint I have huffed my fair share. I have even talked about the dangers of inhalants and my own misadventures. I figured he also had given up on doin this like I had. But, he had not, instead he stayed secreted away killing himself.",
  "There are two lessons to learn, 1 don't ever do inhalants they are a waste, there is no counter argument. 2, be honest with yourself and others no matter the cost, if they really love you they will continue loving you.",
  "This is for A who was like a brother and just cool and with the flow. Don't let your friends kill themselves if you know they are huffin put a foot in there ass its better to have an angry friend than a dead friend."
 ],
 "erowid": {
  "id": "86181",
  "citation": " son of silence. \"How to Get Higher Than Ever (Not Really): experience with Inhalants (ID 86181)\". Erowid.org. Jul 3, 2010. erowid.org/exp/86181",
  "substance": "Inhalants",
  "views": "4046"
 }
}
