{
 "title": "Low Doses/Social Doses Instinct",
 "author": "Samanthe",
 "citation": " Samanthe. \"Low Doses/Social Doses Instinct: experience with 4-Methylaminorex & 2C-I (ID 12870)\". Erowid.org. Feb 28, 2002. erowid.org/exp/12870",
 "substance": "4-Methylaminorex & 2C-I",
 "bodyweight": "122 lb",
 "report": "<p>Setting: Private party of 25 or so close friends. Very casual. Activities included watching movies, lounging around and talking.</p><p>6:45 PM - Insufflated 10 mg of 4-methylaminorex. This was only my second time with aminorex and the other time was oral, so i was extremely cautious with the dose. Other people were doing 20 or so, and were totally fine. I would rather underdose than have an even slightly difficult experience in a social setting, so I took 10. The powder had a very light pinkish hue (pretty). I insufflated deeply, so ended up with a bad stinging in my nasal passage and post-nasal drip. Chased with a snort of water. Since the dose was so small, I did it in one nostril, but next time I'd rather do both. Spread the discomfort evenly...</p><p>T+0:15 - Notice a feeling of cold in my extremities, and release of tension in the muscles of my back.</p><p>T+0:45 - Internal suffusion of warmth. Post nasal drip finally gone. My mood has lightened. This afternoon -- I think because if hormonal fluctuations due to my cycle -- I was feeling alienated and very grumpy. My mood is lightening, I feel more relaxed and connected.</p><p>T+2:00 - Feeling of 'I took too little.' Don't want to boost with the aminorex because it's such a long experience anyway. Feeling gernally good, relaxed, connected -- this is definitely empathogenic right now. Thinking of taking some 2C-I.</p><p>T3:00 - I take 4 mg 2C-I (scale margin of error is +-2 mg), orally, get it on my tongue first so some may have crossed the mucosa. Taste is sharply 'chemically' as opposed to 'bitter'. Chase with gulps of water. Small dose chosen because of social setting, material that is new to me, and because I was told 2-CI doses are slightly smaller than 2-CB doses. This is a party where I would have taken 5-10 mg of 2-CB.</p><p>T5:15 - Wrote in my trip log, 'Yes, it's here.' Colors a bit brighter, I'm getting punchier, got a much needed backrub. Feel in my body like the muscle sensation of MDMA. Uniform feeling of slight, pleasant tingliness. Go to walk around for a little, feeling a little restless, munch on some chips, find a sucker, flop down on a couch for a bit. I'm jawing a little, feeling tiny MDMA-like rushes. Don't remember having felt rushes on 2C-B.</p><p>T6:00 - This feels more rooted, with more gravity (physical, not mental) than 2-CB -- 'more grounded', 'taller'. Just want to stay in serene sitting yoga position or lying down, still. Enjoying just being. Not euphoric. Have not stood up since I took the 2C-I. Calm. Content. My thoughts are about relationship stuff, but they are more 'observational,' detached, personal inventory, with some insights, rather than 'analysing.' *No self-judgment* -- what a relief.</p><p>T6:15 - This is how it differs from 2-CB --> A little slower thoughts, 'more langorous,' insights that can sink in deeper. Not too fast. Maybe that's just because it's such a small dose.</p><p>T10:00  - Been off the 2C-I for about 2 hours. Feeling totally mentally alert without speediness, and also aware that my body has been up for a long time, and that I skipped dinner. Not starving, but I grab some bread to eat.</p><p>T11:30 - Still mentally alert, body tired but not quite 'cracked out.' NOT delerious like I might be if I was just up really really late with no stimulants.</p><p>T12:00 - Take 1 tsp of GHB and go to bed.</p><p>T15:00 - Wake up. G's worn off. Want to sleep, but can't. Thinking speeded up. Maybe the aminorex is still there a little. Drink some water and try to sleep some more. Can't. Eat. Decide to be up for the day.</p><p>So, overall, I was really pleased with this combo, it enhanced my party experience and chased the blues. I felt very good the next day. Glad that I stuck to my small dose instinct. I felt like the aminorex was a good launching point for the 2C-I, though I normally like to try a new material on a blank mental state. Because the aminorex felt like it was generically slightly stimulating and opening, I may have been 'primed' for the 2C-I (i.e. no anxiety). The aminorex is very long-lasting. Definitely something to factor in when doing it.</p>",
 "year": "2001",
 "id": "12870",
 "gender": "Female",
 "timestamp": "2002-02-28T08:00:00.000Z",
 "views": "19986",
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "4-Methylaminorex",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 3:00",
   "amount": "4.0 mg",
   "administration": "oral",
   "substance": "2C-I",
   "form": "(powder / crystals)"
  }
 ]
}
