{
 "title": "A Tweaked-Out, Mind-Numbing Time",
 "author": "Cristoballz",
 "citation": " Cristoballz. \"A Tweaked-Out, Mind-Numbing Time: experience with Mushrooms  - P. cubensis, Caffeine & Cannabis (ID 12887)\". Erowid.org. Jun 14, 2007. erowid.org/exp/12887",
 "substance": "Mushrooms  - P. cubensis, Caffeine & Cannabis",
 "bodyweight": "175 lb",
 "report": "<p>Leave it to me to decide to trip for the first time on a Monday.  Last night was probably one of the most mind-wrenching, intense experience I ever had.  It wasn't even really planned.  Well, I had planned on eating shrooms a long time before, but not last night.</p><p>The setting:  Cluttered college dorm room with all sorts of trippy stuff... lightning ball, lava lamp, and winamp visualizations :-)</p><p>The mindset:  speedy from lots of caffeine, happy, hyper.</p><p>It all started when I wanted to work on a speech around 4 or 5:00 PM.  I decided that what I needed was some ephedrine, or some stimulant to get me motivated.  So, I made a trip to my local supermarket to get something.  I found the no-doz aisle and grabbed a bottle of 36.  Of course, being only mildly experienced with snorting drugs (I railed 1/2 of an X once), decided that I should try for a quick effect and rail a pill to see what happened.  This proved to be interesting.  It burned for a limited amount of time, and I rinsed my nose with water.</p><p>After about 5 minutes, I became slightly hotter, full of energy, vigor, piss and vinegar, what have you.  I was UP.  Now, being the typical stereotype of an idealistic college freshman, anything worth doing is worth overdoing to me (not anything actually, just caffeine).  I had 2 Sobe adrenaline rush energy drinks (which I think really helped replenish my brain with nutrients).  These things are full of all sorts of crap, like L-carnitine, D-ribose, Taurine, vitamins C, B6 and B12, Ginseng, guarana, Inositol, to name a few.  I have no idea what most of them do, save the vitamins, but I knew one thing:  I was too wired to write a speech. </p><p>At this point, a good friend calls up saying how he can get me shrooms finally, after months of anticipation.  I immediately comply and fork up my money.  Now, to anyone who hasn't shroomed before, the hardest part is letting go of the $35 that it costs.  I ate the bag over the course of 20 to 25 minutes, and actually enjoyed the flavor of them.  I don't see why everyone bitches so much about it.  They're rich-flavored, kind of salty, and have the most interesting aftertaste.  I ate about 5 to 7 stems, and 3 or 4 caps.  I knew that I was in for something big.  One of my friends told me that smoking my weed would make it that much better.  I smoked no more than 3 hits, and waited.  It was around 9:00 that I finished eating the shrooms.</p><p>After about 40 minutes, things started happening.  I had the most amazing bodily feeling, which I guess is called the 'body buzz' of the shrooms.  Nothing can describe what happened to me at this point.  So much happened at once, yet nothing was happening at all.  I think that the reason some people have freak-outs or bad trips is that they don't know how to deal with thinking in paradoxes.  I was having so many conflicting thoughts that I heard my mind scream at one point.  I was laughing like an idiot through most of the experience too.  This feeling of conflict didn't last all that long, though.  It gave way to some amazing visual effects.  I felt like I could see all the way around my head, even though the new fields of vision that were created were obviously made from what I was actually looking at.  I took a look at one of my friends sitting in my comfy chair, and it looked as if he was mumbling at me, like he does when we smoke weed, simply to throw me off (I get retarded when I smoke the ganja).  I said something about it, and he looked at me strangely, and I knew that it was my mind playing a trick on me.</p><p>All of a sudden, at about 11:00, my vision split, and I could see myself sitting in the chair out of the corner of my eye!  This made me feel like my soul was floating and drifting.  This was my first bona fide out-of-body experience. Every thought I had was repeating like a delayed and fading echo.  If someone talked to me, it woudl repeat and echo then fade away.  Some thoughts were delivered to me by a choir of beautiful voices singing in unison, making absolute beauty from my own thoughts.  This was the most amazing part of the experience.  I felt free.  Except when the ceiling, walls, or faces just melted in front of me.  That was disturbing yet fascinating.  I think it was the caffeine that drove me to open up Word and start typing my ass off.  This is what I wrote;</p><p>What the hell is this life supposed to be?  Am I doing what I am supposed to be doing?</p><p>Nobody knows, this is life.  It is boring.  But is this really life?  Or is this just a hallucination?  That is the true question.  It is cool, yet is has its hard times.  At this point, all I feel is like talking.  But, is there really nobody to talk to?  Is this all just some sort of dream that I have become?  That is when it hit me.  It just doesnt matter.  My world is all that matters.  True happiness.  This isnt reality.  This is just a phase.  A phase that I will someday overcome.  This phase of tripping, of drugging, or whatever it is, will someday come to an end.  That this may be real, or this might be something that is fake.  All I know Is that I am going to kick myself in the ass for not doing it sooner.</p><p>Same thing with the rest of life.  It is amazing.  At one point I felt like there was nothing left for me.  Now it is amazing.  Nothing could possibly describe what I feel right now.  Life is just amazing.  I could be just frozen in an alley somewhere,  but instead I am in the happiest place I could evfer have imagined.  I am in college and it is the most amazing this I have ever don.  If this is all that I could ever do with my life, then I wouldnt change a thing.  I could let go at any time, but I wont  Instead, I ll just stay and do the shit that I am expected to do for the next 100 or so years.  Life is just amayyyyyyzing.  Is this what Im supposed to do right now?  I have no idea.  All I can say is that I am enjoying it.</p><p>The words typed in the above passage pretty much describe the way my mind was acting for the duration of the trip. I am unsure of what exactly happened, it was a mind-boggling experience that I plan on repeating before too long.  It was borderline too intense.  I think that I am going to skip the caffeine next time.  It made my mind so wired that I probably missed a lot of the important things.  I loved every second of it, even though my mind was screaming bloody murder more than once.  Feeling thoughts?    Who would have guessed?</p>",
 "year": "2002",
 "id": "12887",
 "gender": "Male",
 "timestamp": "2007-06-14T07:00:00.000Z",
 "views": "11684",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "Caffeine",
   "form": "(ground / crushed)"
  },
  "1": {
   "time": " T+ 0:25",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "Caffeine",
   "form": "(ground / crushed)"
  },
  "2": {
   "time": " T+ 0:25",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "3": {
   "time": " T+ 0:45",
   "amount": "3 hits",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
