{
 "id": 12887,
 "title": "Been There, Done That but Not This",
 "date": {
  "submission": "2010-10-12T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "K. Harrington",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:50",
   "amount": "200 mg",
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:50",
   "amount": "2 mg",
   "administration": "oral",
   "substance": "Alprazolam",
   "form": "pill/tablet"
  },
  {
   "time": "4:00",
   "amount": "650 mg",
   "administration": "oral",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "6:30",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Diazepam",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "[Erowid Note: A combined dose of 1 gram of 4-Methylmethcathinone is considered an extremely high dose, see 4-Methylmethcathinone Dose Chart]",
  "Hey All,",
  "I've been reading all sorts of reports and data online for years, (since high school really) and have learned a great deal despite having the typically faux confidence of a guy in his late 20's whose tried a very wide variety of drugs: some more extensively than others but generally reflecting a well rounded repertoire of experiences. I'll spare you my personal drugalogues in lieu of offering a general thank you to the online community for the candid, wisely regulated, and on topic free flow of harm reduction information sharing.",
  "Prefaces aside I want to describe my (first) experience with mephedrone yesterday. I ordered a gram from a (US) domestic distributor whose service and responsiveness were professional and courteous. After picking up my order from the Post office I took it home and had the following experience which I should note came after reading literally hundreds of posts and trip reports online so I felt well informed from an academic standpoint.",
  "It was mid afternoon and I was well rested and hadn't done any other drugs in a while since I'm staying with a family member to help out for a while but I was getting bored...I started with a crudely eyeballed line which I would guess was 150-175mg. A fierce burn manifested the second the glittering white powder hit my nasal passage (much akin to MDMA) which subsided within a minute or so.",
  "COMING UP: (t+5) My initial reaction was one of trepidation since this is the first 'new' drug I had tried in a few years and I am used to knowing with some certainty what I am getting into. There was about 5 minutes of body anxiety and my mind bracing itself for the unknown.",
  "SETTING IN (t +12) : My nerves calm as the drug shows inklings of a rising mdma roll. Euphoria and enthusiastic energy are lacking so far.",
  "COMING of AGE (t + 25): Overall I feel an increased level of patience and mild 'oneness' with my surrounds but nothing compared to that which has been described by past trip reports. I also do not experience the fabled social skills exacerbation which attracted me to the drug in the first place. I am enjoying it at this point but no more than taking a mid dose benzo.",
  "PLEASE SIR CAN I HAVE SOME MORE (t+50) I decide to lay out a roughly 200mg line and see if if my initial dosing had been sub threshold. Not so much in my opinion. At this point I add a xanie bar for good measure. Effects of the re-dosing were slightly more pronounced than the first dose but again lacking in euphoria aka fun factor.",
  "BOMBS AWAY (t+4 hrs): I had read that parachuting creates a longer lasting and reportedly more intense trip so I took the rest of my gram and poured in in OJ for a down in one. (I know this isn't actually parachuting but the key point here is that it was not insufflated. It took 20 min to come on and it definitely came on stronger but not better. I was sweating like I had just stepped into a sauna with my Caribou hunting gear on. Again, no real euphoria came on and I had a hard time focusing on the tv. It did last more like 2.5 hours and seemed to be a more efficient method of ingestion and I definitely felt messed up but not in any of the ways I had heard meph described which was disappointing.",
  "DENOUEMENT (t+6.5 hrs): Annoyed with the excessive sweating/flushed face and despite it only being 10pm or so I want to retreat to my room and give a try to my ipod and do some reading (if possible). I now have greater sympathy for those with ADD/ADHD since I had a very hard time following along with the book I was reading nor did I notice any appreciative affinity for music which is odd for me because I love music, all music. Finally I took 2 ten mg diazepams which put me to sleep.  One final note, the urge to re-dose frequently which I had read so much about did not affect me.  This may seem to contradict the above report but my reason for re-dosing was to try to obtain the much loved effects that meph seems to have on those who have written previous reports not because of an urge to return to its peak effects.  Maybe it was the benzos?",
  "The AWAKENING (530am): much too early for me especially with benzos in the mix but I was surprised to wake up feeling rested and with negligible to no side effects.",
  "AND SO: I am ordering from a different vendor today just to compare products.  If the results are similar to those above I will probably downgrade methadrone to a drug of only occasional and mild interest on my part and stick to the tried and true combo of benzos and uppers as well as opiates and uppers.",
  "Hope this helps,",
  "K. Harrrington"
 ],
 "erowid": {
  "id": "86381",
  "citation": " K. Harrington. \"Been There, Done That but Not This: experience with 4-Methylmethcathinone (aka Mephedrone) (ID 86381)\". Erowid.org. Oct 12, 2010. erowid.org/exp/86381",
  "substance": "4-Methylmethcathinone (aka Mephedrone)",
  "views": "6659"
 }
}
