{
 "id": 12890,
 "title": "I Love Amphetamine",
 "date": {
  "submission": "2005-07-01T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "speed freak",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "160"
   },
   "administration": "oral",
   "substance": "Amphetamines",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "As a user of Adderall for more than four years i enjoy taking a shitload of it every now and then.  Then best experience i had was from taking 8 of my 20mg tablets.",
  "I took them around 4:00 pm and then went out to a tree house I had built for about 2 hours.  I started seeing things among the trees, little angels flying really fast in my side vision.  Then i started the usual blinking and twitching, but eventually calmed myself. ",
  "Then I went home at around 6:00.  I could feel my heart pumping blood through my chest. It felt so good.  Like the feeling of caffeine in your chest, but 500 times more powerful.  It felt so good, like there was something really good to look forward too, yet I wasnt impatient.  ",
  "It was 10:00 on a school night and i knew from all my years of experience that sleep wasnt going to come for another 8 hours or so.  So alone in my room I turned on Marilyn Manson and decided to find something to do to make the time go by.  I decided to fix bearings for my skateboard and sharpen screwdrivers.  As i was doing it time went by very fast.  hours turned into minutes, and minuets were seconds, and seconds where non-existent.  Then around 4:00am I decided to look out my door for some reason.  Across the living room I saw an angel about a foot high run into my moms room, I heard little voices, they where so soft and fast they were loud.  Then I saw ripples move through the walls and they kinda looked like they where breathing.  I was scared inside but my body led me back into my room.",
  "At 5:00, 1 hour before I need to catch the bus, I crashed like Ive never crashed before.  One second my brain was working double time, the next minute I was on the floor.  My alarm clock woke me up just before the bus came. ",
  "Then I took my regular dose of 20mg and went to school sick from not eating in a day. ",
  "After all my years of using amphetamines i have had no real negative side effects.  Amphetamine is the perfect drug for me, it will do what I want it to do. I have control over every emotion.  I feel like every body is my friend and try to share every thing with them.",
  "I dont find it to be addictive, Ive stopped in the summer and felt no withdrawals or cravings for it.  I love amphetamines."
 ],
 "erowid": {
  "id": "8639",
  "citation": " speed freak. \"I Love Amphetamine: experience with Amphetamines (Adderall) (ID 8639)\". Erowid.org. Jul 1, 2005. erowid.org/exp/8639",
  "substance": "Amphetamines (Adderall)",
  "views": "11624"
 }
}
