{
 "id": 12896,
 "title": "A Necessary Experience",
 "date": {
  "submission": "2011-08-24T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "SPACEYstranger",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I took the tab yesterday afternoon, and chased it a few hours later with 20mgs of 4-aco-dmt. It was by far the most incredible psychedelic experience I've had, and I know I found exactly what I've been searching for in LSD.",
  "The clarity of mind, and completely positive emotions gave me the best self image I've ever had. It allowed me to reflect on a lot of things in my life that would otherwise have been bringing me down, and draw meaningful information about myself. My music seemed to help a lot in this. I found a lot of new music on my own ipod, and it made me feel amazing. No other drug can compare to it. I attatched a song i found last night to this message.",
  "I was having amazing halucinations too, unlike anything I've ever seen and like everything I've ever wanted to experience. Everything I saw had an amazing relation to myself. I would look in the mirror and see a huge colorful weed leaf on the wall, or any number of other amazing images. we spent the night in my backyard (which is amazing). The purple and pink flowers seemed to reflect on to all other plants, lighting up the yard in an amazing array of colors. The pool was spectacular. The bark on the trees was breathing and wiggling on the trees, the grass and flowers were waving and breathing, and the leaves on the trees looked like bell flowers that had mouthes and were breathing the air. The sky, the stars, the sunset, everything was completely perfect. Also, being at home was great because I was so comfortable, I felt... right at home!",
  "I was drinking all night too, and had no problem with that. Also i amoked about a half ounce of my weed, i think i was holding my bong all night. It was great spending time with my girl, and i really got to reflect on my friendships wile everyone was over having a good time. Sometimes not so positively, but i think its amazing how acid can re-veil how you really feel about people.",
  "Needless to say, it was perfect. I've convinced all my buddies to give it a try (one already has), so were going to go up to my cottage and do a couple tabs, which I have no doubt will be an incredible experience.",
  "I played a lot of COD with my friends on Xbox Live wile i was trippen (which was forever), and it was incredible. Usually games like that feel so 2d to me, like theres almost no realism. I was playing, and it was as if I was in the game. I could feel the environment, every bit of the screen. It was a level of depth ive never felt before, plus I my mind was enhancing the visuals like crazy.",
  "I was never overwhelmed, and suggest this combination to anyone who thinks they are capable of it."
 ],
 "erowid": {
  "id": "86440",
  "citation": " SPACEYstranger. \"A Necessary Experience: experience with LSD & 4-AcO-DMT (ID 86440)\". Erowid.org. Aug 24, 2011. erowid.org/exp/86440",
  "substance": "LSD & 4-AcO-DMT",
  "views": "4813"
 }
}
