{
 "id": 12904,
 "title": "The Search Continues",
 "date": {
  "submission": "2011-06-09T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Octehedron",
  "gender": "Male",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "Mescaline-NBOMe",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:15",
   "amount": "68 mg",
   "administration": "insufflated",
   "substance": "Mescaline-NBOMe",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I'm a mid-20's male. I've done many tryptamines and phenethylamines. I'm starting with a baggie of 118mg of NBOMe-mescaline HCl. It's the 4th of July in America. I snorted about 50mg at 6:45 PM and put a little under tongue after that.",
  "Within minutes, I have blotchy vision with colors moving, chills at 15 minutes, with a trippy/anxious come up leading me on, making me think I'm about to trip hard. I went outside at about 25 minutes and then I calmed down a lot, virtually no visuals in the light, but much more in the dark of a house with no lights on but with the sun still up. After that, I'm really feeling normal again. Sober / at baseline. Waiting for the bus, got bored, decided to drive. Driving, feel fine, not messed up. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "Stopped and at 8:00 PM. Snort the rest (~68mg). This stuff is nasty but doesn't hurt like snorting some 2C. I put the last bit under my tongue.",
  "Then there are light tracers, moving stuff, very strange feeling. Like things could burst into much more trippyness at any moment, but it never quite happened. Walked past cops, all kinds of people, feeling like I'm tripping upstairs, but the visuals weren't really there. Light, very light tracers. Music sounds odd. There is definitely an auditory component to this stuff. It affects my perception of sounds.",
  "Not much action with the fireworks. :( I talk to people just fine, buy a sweet tea and drink it.",
  "Not much with eyes closed. By 10:00 PM it seems over. This experience seems really lacking.",
  "I buy beer and start drinking a bit (only 2 beers) and smoke some pot. Drive home after checking my drunk driving legal limit checker dial thing. I feel OK.",
  "4:00 AM. I just laid in bed trying to sleep, turning the radio dial for 40 minutes. Can't sleep. Closed eyes, see shapes and lights, moving, twisting, turning into other shapes and colors coming in and out of the shapes. Not bright stuff, but a little colorful - with a lot of darkness though. If only this could be amplified...",
  "Afterthoughts: perhaps redosing after initial dosing doesn't do much with this substance. This is the second time I've gotten lackluster effects and virtually no increase in effects once I've redosed at 1 hour or more from initial dosing."
 ],
 "erowid": {
  "id": "86468",
  "citation": " Octehedron. \"The Search Continues: experience with Mescaline-NBOMe (ID 86468)\". Erowid.org. Jun 9, 2011. erowid.org/exp/86468",
  "substance": "Mescaline-NBOMe",
  "views": "7515"
 }
}
