{
 "id": 12910,
 "title": "From Russia - With Not Much Love!!",
 "date": {
  "submission": "2010-11-03T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "giggly",
  "gender": "Male",
  "weight": "11.5 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "oral",
   "substance": "Pharms - Phenazepam",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:00",
   "amount": "1 mg",
   "administration": "oral",
   "substance": "Pharms - Phenazepam",
   "form": "(liquid)"
  }
 ],
 "report": [
  "<p>I felt I had to write this report out of duty to the drugs community and cause I could not find a single decent report online about it. Now I'm all for recreational drug use and advocate the legality of weed, LSD, Shrooms, XTC etc. However, the following substance has no real use to those interested in drug use as a means of spiritual enlightenment or as a means of having a good time. It's anti-anxiety properties are also heavily outweighed by it's negative features.",
  "I recently came into possession of the Soviet developed benzo called 'Phenazepam' in the form of 4x5ml bottles of clear liquid (1ml=1mg). After doing some research, I decided to go ahead and dose 0.5ml/0.5mg. Within 15 mins I felt the familiar feel of a benzo going to work on my GABA receptors (subtle relexation, less agitation, happy doing nothing). After one hour I felt that another 1mg was in order to gain a fuller experience and understanding of this substance.",
  "What was clear was that it relieves anxiety, no doubt about that, and that's good cause I suffer from mild social anxiety. However, it definetely lacks some of the other qualities and characteristics that make benzos so appealing in the first place. Mainly, there was a lack of euphoria. To clarify what I mean, this isn't the sort of euphoria one gets from MDMA or even opiates. It refers more to that feeling you get where you've been feeling anxiety for a prolonged period of time and then you take maybe 20-30mg of diazepam. After 20 mins you get that huge rush of relief, like 'Oh my God, I didn't know I had so much anxiety until the valium kicked in and lifted this fucking burden!'Well, that is precisely what is missing from phenazepam.",
  "Also, I feel that the more traditional benzos relieve my anxiety in such a way that I actually want to interact with people and go out to a bar or a party. Increased doses of Phenazepam just make me want to sit in front of my TV drooling out of my mouth. It also makes me grumpy with other people. Like if you take too much Nytol (diphenhydramine) and you're in that half-awake state of mind and people just keep bugging you, asking you what seem like stupid questions and you want them to just leave you be. To this end phenazepam is not a very practical day-to-day drug to be used at work or in everyday life.",
  "There are other major issues I have with this substance. Daily doses totalling 2.5-3.5mg make my head feel real heavy and clouded for ages but this is mainly due to the stupidly long half life of the substance (2 and a half fucking days!) It might be good if needed to abort a seriously strong acid/shroom trip or to help with either alcoholic or opiate WDs but on the whole it's not really a recreational downer and the only reason anyone would possibly want to fuck with it is 'cause it's legal in lots of places (No idea why this is freely available and diazepam/xanax is prescription - fucked up drug laws in the UK!!!)",
  "Increasing the dosage doesn't provide any euphoria, just amplifies the above negative effects. It also brings with it the risk of serious benzo amnesia and one that can last for days (or even weeks if you're stupid enough to keep re-dosing) and who fucking needs a situation like that where you can be so out of it that you end up in a cell for doing something you have no re-collection of?",
  "Also, the 60 hour half-life raises some issues of going into benzo withdrawal with this substance. Cause it's so potent and lasts so long I'd imagine a tolerance can build up quite quickly if you take it a lot. And let's be honest, the amnesia from a drug like this can make you forget when you last dosed, so you might end up dosing quite a lot in one day!",
  "All in all, a very large pair of thumbs down to Phenazepam with a 2/10 rating. Stay clear, the Russians picked a bummer here. No wonder communism fell if this the type of benzo they gave to their population!\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "PS I don't normally drive, but had to in an emergency the day after taking 1.5mg of Phenazepam. Not recommended in the slightest - feet were getting mixed up with the wrong pedals and ran a red light! Bad shit my friends, fortunately wasn't on the road for long. Peace!!</p>"
 ],
 "erowid": {
  "id": "86485",
  "citation": " giggly. \"From Russia - With Not Much Love!!: experience with Phenazepam (ID 86485)\". Erowid.org. Nov 3, 2010. erowid.org/exp/86485",
  "substance": "Phenazepam",
  "views": "11660"
 }
}
