{
 "title": "Never Again",
 "author": "ECGirlie",
 "citation": " ECGirlie. \"Never Again: experience with Caffeine (ID 1293)\". Erowid.org. Jul 16, 2000. erowid.org/exp/1293",
 "substance": "Caffeine",
 "bodyweight": "120 lb",
 "report": "<p>Quite a ways back, I (for whatever reason, I'm not sure I had one) took a pretty hefty dose of caffeine at school.  I had been up very late the night before, so I wasn't feeling to hot to begin with.</p><p>I, when the coast was clear, took down all 3 pills (on an empty stomach) at a water fountain.  I proceeded to my first class mildly nauseous.  After about 30 minutes, I began to feel very lightheaded and nervous.  My surroundings seemed surreal...I almost felt as if 'I' was floating aimlessly in and out of my own body.  Concentration was impossible and I began rocking back and forth in my chair.  Shortly thereafter, I found my arms tightly pulled in front of my body and I was pinching my skin, completely disassociated from my entire situation.</p><p>My pulse had quickened, and it was weak.  I became pale (as was recounted to me by fellow students).  I asked to go to the nurse, now becoming fearful of my own state.  When asked questions, it took me a very long time to answer (although it felt like a heartbeat to me) and it was hard to sift out unrelated thoughts.  I tried to avoid any incriminating evidence about my friend, who would readily be in trouble should they find out about the source of the pills i had taken.  I was severely nauseous now, in a cold sweat, and shaking.  I was sent to lie down and encouraged to sip on some orange juice, which proved completely useless and ineffective.</p><p>I was kept in the nurse's office for about 3 hours, during which I mumbled to myself and had difficulty understanding my condition because of the hyperspeed state my thinking was in.  I was thoroughly convinced that I was going to die.  After this, I was interrogated by our principal.  I, due to a weakened state of mind, blurted out something about my friend.  We were both assigned a special 'drug' seminar.  In the end there were no repercussions as a result of my mistake, but I now have a heightened caffeine sensitivity.</p><p>In the long run, the entire event was pointless because all that this dosage caused me was severe panic and fear.  There was definitely a 'high' of some sort, but not a favorable one.</p>",
 "year": "2000",
 "id": "1293",
 "gender": "Not Specified",
 "timestamp": "2000-07-16T07:00:00.000Z",
 "views": "16926",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "3 tablets",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 }
}
