{
 "title": "Euphoria in a Doctors Office",
 "author": "Anonymous",
 "citation": " Anonymous. \"Euphoria in a Doctors Office: experience with Morphine (ID 12930)\". Erowid.org. Nov 19, 2002. erowid.org/exp/12930",
 "substance": "Morphine",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "",
   "Morphine"
  ]
 ],
 "report": "<p>I'm not sure if having a morphine experience in a dentists office counts but I'm sure this was a good one.</p><p>It was a while ago and i had to get my wisdom teeth removed. Wanting to be doped up as much as possible (I told my doctor this) I got ready for the surgery. I asked what they would be using to dope me up before they put me to sleep they asked what i would like. They gave me a list of drugs and I chose the morphine. As soon as I said it the nurse came out with a bag of a clear liquid and injected it into me. Almost instantly I was thrown into another world. It was as if my head had tilted back and I was in another dimension.</p><p>In the distance I heard the doctor tell me to go into my happy place. And that I did. It was a lush open field of the finest marijuana one can imagine. Blocks of hash sitting on a table waiting to be eaten or smoked. A bottle of jagermeister in my hand and countless women surrounding me. I was in my happy place. Not just imagining it...I was in it. All the bad things I had heard about getting morphine were eliminated. I cant recall it completely but I was then put to sleep but I remained in my happy place. When I awoke it was a feeling of drunkness. Extreme drunkness. I am not an abuser of any narcotics but whenever I need surgery i ask for morphine. I also do not condone the use of heroin or any other injected drug for I think they are worse but it seems morphine is not the worst on that list.</p>",
 "year": "2001",
 "id": "12930",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-11-19T08:00:00.000Z",
 "views": "33444",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "",
   "substance": "Morphine"
  }
 ]
}
