{
 "title": "A Mild, yet Very Interesting Trip",
 "author": "Bat Country",
 "citation": " Bat Country. \"A Mild, yet Very Interesting Trip: experience with H.B. Woodrose (ID 12949)\". Erowid.org. May 4, 2006. erowid.org/exp/12949",
 "substance": "H.B. Woodrose",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "5 seeds",
   "oral",
   "H.B. Woodrose"
  ]
 ],
 "report": "<p>My friends and I have started using HBWR seeds.  They have turned out to have many different (and quite pleasent) effects, with only one major and one minor side effect(s).</p><p>I like to take light doses of just about anything, especially when starting with something new. I have a faily light tolerence, which is offset slightly by my weight.  So 5 seeds for me.  Forgive me as I don't remember the exact times of the night... We took our doses at about 8:30 - 9:00 pm.  For the first hour or so there is mostly a slight stomach discomfort, with a bit of giddiness. The next stage there is a feeling of being real lazy, yet content.  This lasts anywhere from 45 minutes to an hour.  During this time, I realized that if I wanted to, I could 'snap out' of it and become very active. </p><p>That is the overall feeling of the seeds, this up and down gentle roller coaster effect,  a moment of sluggishness, followed by a period of mental racing.</p><p>After the physical effects, there is usually a period of empathy/general agreement between others.  Conversations tend to start out as two different things, only to be mended into one concept about halfway through.  (We call this tree branch effect. Two trees start out as saplings planted apart. But as they grow, their branches intertwince and meet, forming a single outline/shape.) This makes these for me a substance I do as a group.  Sort of a mental X. My mind races for the rest of the night, well on into morning, around 5:00 am or so.  I only sleep 2 hours after these things, so burnout is a major problem.  The next day all I can do is sit around and nap.</p><p>I never become so screwed up that I can't recall all the neat ideas from the night before.  This is the major up for these. I've never had a bad experience yet.</p>",
 "year": "2002",
 "id": "12949",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-05-04T07:00:00.000Z",
 "views": "4014",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "5 seeds",
   "administration": "oral",
   "substance": "H.B. Woodrose"
  }
 ]
}
