{
 "id": 12956,
 "title": "Bipolar II Reaction",
 "date": {
  "submission": "2010-08-13T07:00:00.000Z",
  "experience": "2009"
 },
 "author": {
  "name": "racingmind",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Tryptophan - 5-HTP"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "<p>Unlike most users here, I was never into the whole drug scene. I was always a quiet kid growing up in an upscale suburban town which was composed of mostly rich, snobby, spoiled teenagers running around at night high as fuck. I was always the quiet kid. Not that I wanted to be quiet, but I could never keep up with what other people were saying. In social situations, I said the wrong things, felt anxious, embarrassed and often confused. I was very irritable and it took a lot of will power to keep myself from exploding on the outside. I blamed it on bad parenting and moving to different schools as a child.",
  "Fast forward to college- since I'm in a frat, where everyone either smokes pot or rolls, I figured I might as well try it once. One of the bros had invited me to EDC and I was ecstatic. We picked up two orange pokeballs which had a picture of butterfree. These pills are supposedly the cleanest pills you can find around and from pill reports as well as friends, it can't get any better than this. I popped some 5-htp for good measure and called it a night.",
  "I woke up, in an ok mood, but still a bit tired from the night of drinking from two days ago but I figured everything was fine. At the stadium, we waited on the bleachers till sunset and I said fuck it and popped a pill. I have to admit I was very nervous and was one of the last ones to pop. I had no idea what to expect. I lie actualy, the week before I was franticly researching the side effects of E and thoroughly trying to understand the consequences. I never would've known this would be the worst decision of my life.",
  "Still, there are reasons to be nervous. I mean, I'm at my first massive at EDC popping for the first time what is considered one of the strongest pills in the area. Fast forward an hour.",
  "The effects begin to kick in. It hit me like a train out of nowhere and I began to feel mildy euphoric. All of a sudden I felt warm inside and felt my head tingling. The body high sensation quickly overwhelmed me and before I knew it someone was giving me a message which was surprising because I never told anyone I was rolling. I guess  my face did all the talking. The effects were unbelievable.",
  "1 or 2 hours passed, and I figured I peaked. Without thinking twice, I grabbed the other pill and popped it and walked down to the base of the stadium feeling like a billion bucks.",
  "About 3-4 hours passed and now I'm screaming at the top of my lungs from the overwhelming joy that flooded my body. My eyes became glued to the lights and there was nothing on my mind but happiness.",
  "9PM- it's dark out now and I'm enjoying the roll, still peaking. I realize that I hadn't drank water for a long time now and start to worry a bit. I quickly find myself some water and start taking swigs. My friend notices that I am drinking my water pretty quickly and he tells me not to drink too much water. People have died from water poisoning. Now I'm starting to trip out, since if I don't drink enough water, I'll dehydrate which has also led to death, and if I drink too much it'll lead to water poisoning.",
  "I grab a seat and monitor the amount of sips I take. I really notice my head over heating at this point. The tingling had progressed to a brain frying sensation which I now know is related to BPD, but at the time I thought it was because I was getting dehydrated. I close my eyes a bit. This is where it gets bad. Another one of the bros tell me that if I close my eyes I may never wake up. I think to myself, fucking hell why did you have to say that. Now I'm really panicing and fear starts racing through my mind. Should I drink any more water, should I stop, what's this feeling in my head, etc and I quickly fall into a downwards spiral. To make matters worse, I get lost in the crowd and can't find my group.",
  "While everyone is screaming at the top of their lungs with tears of joy I am paranoid as hell now and tripping out badly. I just wanted it to be over.",
  "After it was all over, we headed back. I started to wonder if I had caused some permanent brain damage because of that dirty feeling that's still lingered. I also couldn't focus, couldn't remember anything, and felt cracked out of my mind. It didn't get better the next day. I fell into a manic state and paranoia completely warped my mind. I felt guilty of holding others back because they had to watch me. It felt horrible, like no one wanted to associate with me. Instead of euphoria which is typically associated with mania, I was irritable, anxious and very depressed. My mind raced with paranoia and I was constantly having flash backs.",
  "This persisted for about two weeks despite all the supplements I took for recovery.",
  "Now that I've been diagnosed with Bipolar II it all falls together now. The irritability, anxiousness. The depression that I always had. The crash that I couldn't handle from E. It all made sense. I never would've done it had I known I had undiagnosed BPD.",
  "I'm now recovered but I'll never try e again, or any kind of psychoactive substance stronger than weed. I will be trying lamictal in a few weeks for BPII and hopefully I'll be a different, better person.</p>"
 ],
 "erowid": {
  "id": "86823",
  "citation": " racingmind. \"Bipolar II Reaction: experience with MDMA (Ecstasy) (ID 86823)\". Erowid.org. Aug 13, 2010. erowid.org/exp/86823",
  "substance": "MDMA (Ecstasy)",
  "views": "4374"
 }
}
