{
 "id": 12963,
 "title": "Were They Perhaps Old?",
 "date": {
  "submission": "2004-05-12T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Morphium",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Poppies - Opium",
   "form": "extract"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Poppies - Opium",
   "form": "extract"
  }
 ],
 "report": [
  "I recently attempted to make smokeable opium from dried poppy pods I bought cheaply in the village I live. I used about seven perhaps old heads; broke them down and ground them to a semi-fine powder (coffee grinder). I boiled two cups of water and added some lemon juice. After taking the pot from the stove I added the powder and let it steep for 20 minutes while sometimes stirring. I used a T-shirt as a filter as I emptied the 'opium' tea into a bowl. I then added the semi-spent powder into another pot of boiling water, this time only one cup. After filtering, I combined the teas in a pot and let it simmer for about two hours (I've read boiling destroys the goods). What remained was a brown goo that looked amber-yellow when spread out. I scraped most of it onto a small glass plate which I allowed to further dry in the hot sun for a few hours the next day. I then scraped it into a big wad of brown gum which was very bitter.",
  "When I tried smoking it I put some on top of a small bowl of quality grass. It didn't burn well and when it did it wasn't good tasting and somewhat harsh. I took around twelve medium sized tokes and felt a more mellow largely cannabis influenced  high. The added 'mellowness' didn't last long so I later ate a couple small lumps hoping for added effect. I may have felt something an hour or two later but they may have been perhaps placebo effects. I also made a cup of tea with a nice lump of tar/gum but only got lite effects.",
  "I wonder did I do something wrong to make it less active or was it because they were perhaps old poppies? Maybe they were the wrong kind but I'm pretty sure after looking through pictures of Papaver somniferum."
 ],
 "erowid": {
  "id": "8685",
  "citation": " Morphium. \"Were They Perhaps Old?: experience with Poppies - Opium (ID 8685)\". Erowid.org. May 12, 2004. erowid.org/exp/8685",
  "substance": "Poppies - Opium",
  "views": "12631"
 }
}
