{
 "id": 12967,
 "title": "Body Load Psychedelic",
 "date": {
  "submission": "2010-09-08T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anonymous",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I've taken this chemical a few times at varying doses (20 mg -> 70 mg) and have found the only difference to be the duration of the trip, while the perceived intensity and effects remain pretty much the same.",
  "Orally dosed, the effects are felt with a unique speed: come up 15-20 minutes after ingestion, peaking at 30 minutes after. The peak lasts around 20 minutes, with a sharp comedown of 5 or 10 minutes. Minor residual feelings linger for another hour or so. (All in all, 2 hours from ingestion to return to baseline.)",
  "5-MeO-DALT has a very strong 'body load' that's associated with many psychedelics. I get the feeling that I'm about to 'break through' (colors start to dance a little, patterns seem to start forming) but it never actually happens, seemingly regardless of dose.",
  "The body load is fairly heavy and rather uncomfortable, though not terrible. I get the general feeling that my brain is being tickled, which affects the rest of my body accordingly.",
  "There is a moderate sense of time dilation, but since the chemical's effects are so brief, I never seemed to get lost in time at all.",
  "I did not experience mydriasis, change in heartrate, or any other physical side effects. My perception of heat and cold is moderately altered, with cold temperatures feeling somewhat warmer, and warm temperatures feeling somewhat cooler. Repeated dosing (same day, or several times within a week) did not seem to build tolerance or change the effect profile.",
  "All in all I can't recommend anyone taking this chemical recreationally, but it is moderately interesting, albeit unpleasant. The only use I can think for this would be for someone who wants to experience the negative physical side effects of RC psychedelics.",
  "I, and everyone else on BlueLight and other discussion forums, have found Alexander Shulgin's report on 5-MeO-DALT to be completely different from what anyone else has experienced. Either his synthesis contained some impurities, or the current manufacturers are synthesizing it incorrectly. I haven't seen any sort of chemical verification, though I would suspect the RC samples are fairly pure."
 ],
 "erowid": {
  "id": "86866",
  "citation": " Anonymous. \"Body Load Psychedelic: experience with 5-MeO-DALT (ID 86866)\". Erowid.org. Sep 8, 2010. erowid.org/exp/86866",
  "substance": "5-MeO-DALT",
  "views": "19793"
 }
}
