{
 "title": "Mania and More",
 "author": "Alexis",
 "citation": " Alexis. \"Mania and More: experience with Paroxetine (Paxil) (ID 12965)\". Erowid.org. Jun 25, 2002. erowid.org/exp/12965",
 "substance": "Paroxetine (Paxil)",
 "bodyweight": "130 lb",
 "header": [
  "DOSE:",
  "20 mg",
  "oral",
  "Pharms - Paroxetine"
 ],
 "report": "<p>I've had two experiences with Paxil, one positive, one down right horrifying.</p><p>Towards the end of my senior year in high school, I was experiencing very worrisome symptoms: dizziness, visual blackouts, extreme fatigue, and I even fainted once. So eventually, I went to the doctor. After numerous tests, he diagnosed me as having depression, and prescribed Paxil. The first two weeks were awesome, I hardly needed sleep, lost weight, always felt happy and productive, and for the first time in my life, felt outgoing.</p><p>It was great. Eventually the extreme effects wore off, but I continued taking it for a while.</p><p>Fast forward two years later. I'm kind of down, and withdrawn. I  figure I can just start Paxil again, have the nice effects for a while, and then settle down into a normal routine. So I went back to the same doctor and was got my prescription filled. Unfortunately my experience wasn't so pleasant. I didn't sleep for days at a time, and was irritible and paranoid. I quit my new job screaming and cursing at my employers. I walked home flipping numerous people off. I had constantly had crazy amounts of energy, I couldn't sit still, and was extremely emotional.</p><p>My boyfriend got worried about me and brought me over to his parents house to be 'supervised,' as he had to work, and his mother, being a teacher, had the summer off. Even that didn't work out. They took me to a local psychiatric hospital. I was all right until my boyfriend left, and the ICU door slammed in my face and I discovered it was locked. Then I freaked out. I started pounded on the glass at the nurses station screaming to be let out. They eventually wrestled me to the ground to give me a shot of Haldol, an anti-psychotic, and then forced me into a locked room. They said I assaulted a nurse, but I know I didn't, and I'm the one with the scar on my elbow because of it anyhow. I spent ten days there, was prescribed Zyprexa, and was released. Unfortunately, I still wasn't right. So back I went.</p><p>I only spent a few hours there this time, though. The other patients were seriously creeping me out, and they gave me some kind of medication that made me feel really weird. So I somehow tricked a nurse into signing something that said I could be let out. I had to call a relative to pick me up, so I called my mom, 100 miles away to pick me up. She took me back to my home town, which I don't remember at all, because I passed out. I woke up in the emergency room. A few days later, she made me admit myself to the psychiatric hospital there. That was particularly unpleasant. I had made suicidal remarks, so they were able to get a court order to keep me there.</p><p>I was misdiagnosed as being schizoaffective, which is kind of like a blend of schizophrenia and bipolar disorder. So I was on numerous anti-psychotics, which didn't work, and lithium, which sent my thyroid levels to hell. (I had a bad doctor!) Its possible that I was on anti-psychotics for so long that they prolonged my psychotic symptoms. I was very paranoid, and constantly had extremely morbid and disturbing thoughts going through my head. All I could ever do was walk, and I refused to eat.</p><p>Eventually, I was transferred to the State Hospital, which is in the city I live in. I spent six weeks there, and was still plauged by paranoia and morbid thoughts, although it was a bit better. The day after I was released, I went to see a completely new doctor and was almost immediately diagnosed as having manic depression, or bipolar disorder. Nearly all the treatments I recieved were completely wrong.</p><p>In the end, I spent over three months in a psychiatric hospital, brought about by Paxil. I'm currently on one steady medication, compared to the seven I was on at one time. It was a traumatic experience and I hope no one has to go through anything like it. Be careful with anti-depressants! If you feel highly energized, experience rapid thoughts and ideas, or other similar symptoms, stop taking the medication immediately, and contact your doctor. There is a chance you could be bipolar, and there are better treatments out there for you.</p>",
 "year": "2001",
 "id": "12965",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-06-25T07:00:00.000Z",
 "views": "28973",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine"
  }
 }
}
