{
 "title": "Nice Low Dose Combo",
 "author": "geesh",
 "citation": " geesh. \"Nice Low Dose Combo: experience with 5-MeO-DiPT (freebase), MDMA & Cannabis (ID 12979)\". Erowid.org. Jul 6, 2004. erowid.org/exp/12979",
 "substance": "5-MeO-DiPT (freebase), MDMA & Cannabis",
 "bodyweight": "117 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "20 mg",
   "smoked",
   "MDMA",
   "(powder / crystals)",
   "",
   "10 mg",
   "smoked",
   "5-MeO-DiPT",
   "(freebase)",
   "",
   " repeated",
   "smoked",
   "Cannabis",
   "(plant material)",
   " T+ 5:00",
   "50 mg",
   "smoked",
   "MDMA",
   "(powder / crystals)",
   "",
   "100 mg",
   "oral",
   "MDMA",
   "(capsule)"
  ]
 ],
 "report": "<p>So we had been experimenting with a homemade 5-meo-dipt freebase. Just put some foxy in househould ammonia and collected the flaky crystals that formed. We smoked it before and it had the very disting foxy feel to it, but it was different, more spacy and more of a 'high'.</p><p>I purchased 2 capsules of 100mg MDMA each, planning on smoking half of one mixed with some 5-meo-dipt between three people. I ended up smoking about 20mg of MDMA and about 10mg of foxy. Weed was continuously smoked throughout the experience. The feeling came on fairly slowly, the hits were not big though. After about 10 minutes my pupils were noticeably dilated and I felt a feeling of psychadelic euphoria. The mdma contributed nicely to the foxy, accentuating the visuals and making the foxy feel more warm and complete. When cannabis was smoked it felt as if I had just gotten stoned of some very nice bud, except it was much more euphoric than just weed and there were minor visuals throughout. My stomach became mildly irritated about T+30 minutes but quickly went away. The high lasted for about 4 hours total. Had it not been for the weed I would imagine it would have lasted half that.</p><p>When I got home I remembered that I still had 1 and half caps full of mdma and how can I not take mdma when it is available? So I decided to smoke the rest of the half capsule at about T+5 hours from smoking the original mix. It gave me a strong intense rush and I rolled very hard for about 5 minutes till the rush began to subside and I was left with the pleasant after effects. After the rush wore off I decided it was time to take that other capsule. The capsule came on in about 25 minutes and I shot straight up again. I rolled hard for another hour and a half and had difficulty finally falling asleep which happened about 5 hours after eating the capsule.</p><p>All in all this experience was very pleasant. I experienced no bad side effects and the mdma and 5-meo-dipt complemented each other well. I wish to repeat.</p>",
 "year": "2002",
 "id": "12979",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2004-07-06T07:00:00.000Z",
 "views": "7693"
}
