{
 "title": "Ka-Good",
 "author": "youdontknowme",
 "citation": " youdontknowme. \"Ka-Good: experience with Sceletium tortuosum (ID 12977)\". Erowid.org. Jun 25, 2002. erowid.org/exp/12977",
 "substance": "Sceletium tortuosum",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Sceletium tortuosum",
  "(powder / crystals)",
  "",
  " ",
  "smoked",
  "Sceletium tortuosum",
  "(powder / crystals)"
 ],
 "report": "<p>Hello there.  Seeing that there is very little info on Kanna (Kagoued to the Dutch) here or anywhere else on the net, I thought I'd share a few things.  This is quite an interesting plant with substantial historical use.  It also can be grown easily in one's home from cuttings or seeds.  It gives a nice, mild buzz.  And it's completely legal. </p><p>I ordered some dried Sceletium Tortuosum powder on the net a few weeks ago and have enjoyed it on several occasions.  There are many ways to do it including smoking, snuffing, or holding it in your mouth and swallowing the juices.  For my first experience I tried all three.  First I snuffed about 50 mg, a very small amount.  It burns a little, but quickly goes away.</p><p>Next I put another 50 mg on top of enough MJ to keep the powder from pulling through my pipe.  Different taste, but not bad.  For good measure, I also put a pinch under my tongue and swished it around for a couple minutes.  Five or ten minutes after this the effects started.  It was kinda mild, but nice.  It was very similar to the feeling I get right after finishing a fat bowl of MJ, except without the full stone.  It was more like the physical effects of MJ with the euphoria but without the hazy feeling.  It also made my legs and arms sort of tingly.  Very pleasant.</p><p>It's definately worth a try.  It's even well known in Holland.  That says something when the Dutch can get all the best buds around and they still mess with this stuff.  Anyway, it's also good on top of MJ.  A definate enhancer.  Makes the buds go much farther.  Dried herb is kind of expensive, but a little goes a long way and it can be grown easily and legally for next to nothing.</p>",
 "year": "2002",
 "id": "12977",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-25T07:00:00.000Z",
 "views": "26949",
 "dose": {}
}
