{
 "id": 12971,
 "title": "Protocols For Chronic Relapsers",
 "date": {
  "submission": "2010-10-08T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stone",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Ibogaine"
  }
 ],
 "report": [
  "In 2005, I took several flood doses of Ibogaine, including 4g over three days in a Tijuana clinic. That time I had very little auditory or visual hallucination; it was mostly a rumination on the imminence of death, a very shamanistic (and Buddhist) theme. What I noticed over the next 90 days or so, was that the addiction process had been completely annihilated, and my brain had been reset to a pre-addiction state. This faded at about 90 days (this presumably reflects the exponential decay of pharmacological efficacy), and at about 100 days a full-on cocaine craving developed. In my case relapses inevitably begin with cocaine cravings and inevitably end with heroin addiction.",
  "But this gave me the idea that the dose should not be restricted to the detox window. In fact, it is almost trivial to detox via the clonidine protocol. So why waste the precious resource of Ibogaine on detoxification? Since chronic relapsers typically have cycles related to brain chemistry (in particular, it is believed cocaine addiction causes drops in glutamate levels to trigger intense craving), whats needed are periodic doses before thresholds (in my case 60 days, 120 days, and so on).",
  "So instead of taking a flood dose at detox, I took a 2g (20mg/kg) HCL dose at 45 days. This got me past the 120-day threshold for the first time in years. I had planned on taking a .5g TA (Total Alkaloid) booster by this point, but so far havent felt the need to (nor had the opportunity to). I have used this window of opportunity to do 12-step, therapy, and so on to insure long-term success. It should also be noted that I daily take 1500mg of the over-the-counter supplement NAC, which normalizes glutamate levels and mitigates cocaine cravings. I still intend to take at least one TA booster dose at or before 6 months. The point is, its obvious to me that chronic relapsers need special protocols."
 ],
 "erowid": {
  "id": "86875",
  "citation": " Stone. \"Protocols For Chronic Relapsers: experience with Ibogaine HCL (ID 86875)\". Erowid.org. Oct 8, 2010. erowid.org/exp/86875",
  "substance": "Ibogaine HCL",
  "views": "8245"
 }
}
