{
 "id": 12976,
 "title": "Happy",
 "date": {
  "submission": "2013-12-17T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Fagboy",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Pharms - Oxycodone"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone"
  }
 ],
 "report": [
  "Let me start off by saying that I am not gloating about my experience, nor am I trying to glamorize drug use. Drug abuse is something that a lot of people don't take as seriously as they should, and those same people like to think that they are impervious to addiction. I'll admit that I was one of those people. I had grown up seeing my aunts and uncles smoking meth, shootin up smack and hittin a crack pipe. I grew up thinking all of this was normal, that everyone did drugs like that on an hourly basis. It made me want to try everything, and at the age of 13 I was already drinking and smoking both weed and cigarettes. I loved this life, but not enough to make me want to do it every day.",
  "I started high school still a little green, with about the same amount of experiences under my belt as everyone else. I did the usual shit my freshman year, drank, smoked, toked, and partied. It wasn't until my sophomore year that things changed. I was surfing the web one day and I came across the name oxycodone. It rung a really big bell, my dad has been pescribed oxycodone for a couple of years now for servere back pain. At the time he was prescribed four 5mg oxycodone instant release tablets per day, as well as four 10mg morphine per day. Throwing caution to the wind I stole one of his oxycodone, and it's what almost wrecked my life.",
  "I remember my first opiate high, it was like this beautiful perfect feeling radiating from inside my body. I had never felt so happy and confident and perfect. All I could do was smile, like everything was perfect in the world. I just laid on my bed for about an hour or so; the body high was so intense I was afraid of moving, thinking that one little movement would make it all end. I fell asleep more content and happy than I ever had in my entire life.",
  "It took a while for me to steal another, but after the second time I started stealing them in twos or threes. At this point I was in the begining of my sophomore year, which is when my life start to really take a turn. My dad never took all of his pills, he only took about half, when he needed to. He was a former heroin addict and he had made it clear that these pills reminded him of it, and that he would only take them when neccesary. That left about 30-60 pills a month. All. For. Me.",
  "Around the time I started to get really heavy into drinking and smoking bud, I started to take 3 oxys per day; one the moment I woke up, another at lunch when I was at school, and another the moment I got home. I spent about a month high, halfway through all of this my dad got his refill. I was loving it, but people started to notice. I was a zombie at school when I had first started my month long binge, Eyes half closed all the time, monotone voice, and sluggish, lazy movements. My friends talked to me about it, and I lied. And I slowed down. I kept using constantly through to the end of my sophomore year.",
  "And as a side note, I spent the majority of that year depressed, I had broken up with my boyfriend because I was a fucking retard. I pitied myself for it all, blamed myself, hated my self, and spent a long time trying to get him back. No such luck, which drove me into an unescapable depression that I am still dealing with today.",
  "At the start of my junior year I got the idea to snort it. By that time I had done coke a couple of times and also knew that it was possible to snort pain pills that didn't have tylenol in them. That first time was what really got me hooked, the rush and high were now so perfectly in balance that I never took another oxy orally ever again. And at this exact moment in time my dad got a higher dose of his oxycodone, now 10mg. I never really touched his morphine. I spent a month slowly increasing the frequency that I would snort a pill, and after that month it was a daily thing, and a month after that it was now an hourly thing. My dad got another increase in his dose, which made everything even better.",
  "I was snorting a 15mg pill, broken into chunks, every day. It was no longer about the high. I needed some kind of opiate in my system to function. Without them, even after fully withdrawing, I was depressed and lethargic, and extremely pessimistic. On them, I was functional, happy, motivated and extremely optimistic. It was to the point that the taste of the tiniest drip of oxy down my throat would give me a massive feeling of relief.",
  "I'm at the start of my senior year now. I am 17 years old. I used 30mg daily. I've been addicted to oxycodone from the moment I stole that first pill, I've been using constantly for over two years now. I hate myself for it, I am a wicked horrid person because of oxycodone, and this drug also makes me love who I am. I'm not me anymore, I'm someone I don't recognize. Even as I write this I have oxy drippin down my throat. This almost ruined my life, and it still might. I fear the withdrawls, what I have felt of them were like falling into the deepest pit of hell, and then digging even deeper. I am a functional drug addict, with so many pyschological problems that I am almost crazy. Don't ever think you are above addiction, that people who get addicted to something are stupid because they couldn't handle it. You don't handle oxycodone, it handles you."
 ],
 "erowid": {
  "id": "86915",
  "citation": " Fagboy. \"Happy: experience with Oxycodone (ID 86915)\". Erowid.org. Dec 17, 2013. erowid.org/exp/86915",
  "substance": "Oxycodone",
  "views": "1074"
 }
}
