{
 "title": "6 Months in the Black Hole",
 "author": "Steve",
 "citation": " Steve. \"6 Months in the Black Hole: experience with Heroin (ID 12974)\". Erowid.org. Feb 9, 2005. erowid.org/exp/12974",
 "substance": "Heroin",
 "bodyweight": "150 lb",
 "header": [
  "DOSE:",
  " ",
  "IV",
  "Heroin",
  "(daily)"
 ],
 "report": "<p>I used heroin for the first time 6 months ago, and I'm 19 years old. One of my friends whom I used to only smoke weed with, convinced me to try it. He had tons of fresh needles still in the plastic wrap, so I was not worried about the contraction of diseases. I did about a 1/4 bag my first time. He tied my arm up for me and did the shot. 10 seconds later, Im in heaven. I immediately fell in love with the drug. About an hour later I became violently nauseous, and proceeded to vomit 10 times on the way home to my house, 15 minutes away. I ended up doing another shot that night, another 1/4 bag. The next day I had no physical withdrawal symptoms, but I wanted to feel that rush of euphoria again. So I did, this time 1/2 a bag. From then on my life seemed to revolve around the drug, and I naturally gravitated toward people who did the drug. Less then 3 weeks after my initial trial use of heroin, I was doing one whole bag in each one of my shots. I would do perhaps 1 a day, and that would be it, a simple 10-dollar bag. Did I have a problem? Not that I thought so. I could easily afford this amountthat was until 1 bag wasnt enough; I moved on to two, then three, then four a day. Only 2-3 months after my initial use.</p><p>From then on, it is all a blur, I would wake up, see how I was going to get money for dope every morning. Mostly getting a dub ($20) off this person or that person; mostly borrowing from my girlfriend. 5 months since I started using I would load no less then two bags into each of my shots, doing about 7 bags a day. One night, I couldnt take it anymore, the people I stole from, and the hearts I broke became too much for me to bear. I went to the ATM, took as much money as I could out of all my visa cards, about 8 of them, only 3 of which still had money on them. I walked out with 120 dollars cash. Drove straight to my dope spot and bought a bundle (12 bags). I was so out of my mind because of this drug, I didnt even bother to prepare my shots, as I normally would have. I simply slammed as many bags as I could into my needle, slammed it into my vein, and drew back 60 units of blood. I removed the needle, shook it up, and bam straight back into my arm. I felt the most intense rush I have ever felt in my life, and then I blacked out. My intention was to die, just to end everything. I woke up, so surprised I was not dead, and drove myself home.</p><p>The next morning I checked myself into rehab. It was the best decision I have ever made. Today I experience a great deal of cravings, but I can deal with them. Heroin is not a drug to be messed with. I have seen so many of my friends simply die because of this addiction. Today, I will never use heroin again, and would warn any others thinking of it. Luckily my addiction never cost me incarceration or death, as it easily could have.</p>",
 "year": "",
 "id": "12974",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-02-09T08:00:00.000Z",
 "views": "33462",
 "dose": {}
}
