{
 "id": 1297,
 "title": "Why Drink It?",
 "date": {
  "submission": "2002-04-12T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "patience",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "3",
    "unit": "bowls"
   },
   "administration": "smoked",
   "substance": "Poppies",
   "form": "extract",
   "specific": "Opium"
  }
 ],
 "report": [
  "I purchased two bundles of dries poppy pods from a well Known",
  "nursery and crafts store recently, and despite the poppy tea",
  "methods I've been reading about, it just doesn't appeal to me.",
  "Where codeine extractions from acetamiophen products leaves little",
  "alternative, poppy pods can be dealt with differently. I don't",
  "like wasting a useful substance... or puking, for that matter.",
  "At least forty pods were crushed and dumped into an electric",
  "fryer pot with enough water to 'float' the matter freely.",
  "Setting the dial never above the highest simmer level, I allowed",
  "the mixture to heat for an hour or so, mixing periodically.",
  "Next, I poured the contents through a strainer into a bowl and then",
  "poured the cleaned liquid back into the fryer and let most of the",
  "water content to simmer away until thick but still pourable.",
  "I carefully poured the extract into a metal measuring cup and",
  "left it on one of those electric coffee cup warmers until it's",
  "consistancy was gooey, like peanut butter. There was an adequate",
  "amount of nicely dried 'tar' around the surface edges of the",
  "measuring cup to enjoy in a pipe right away. I placed the cup in",
  "a cool place, away from light to let the heavy resin continue to",
  "air-dry.",
  "A few good pipe hits at a time seems to pleasently relax me.",
  "I recommend the use of a small butane torch for maximum effects."
 ],
 "erowid": {
  "id": "13874",
  "citation": " patience. \"Why Drink It?: experience with poppy pods (ID 13874)\". Erowid.org. Apr 12, 2002. erowid.org/exp/13874",
  "substance": "poppy pods",
  "views": "29184"
 }
}
