{
 "id": 12987,
 "title": "Precipiate Of Thought",
 "date": {
  "submission": "2004-02-11T08:00:00.000Z",
  "experience": "1988"
 },
 "author": {
  "name": "Cap'n Zeep",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 ],
 "report": [
  "<p>First off, let me say that I have done ether more than a few times - but probably less than a dozen 'sessions' in total.  Yes, it is *extremely* addictive, and yes, it is absolutely mind-blowing, in the truest sense of the word.  Having done a lot of 'drugs' in my time (acid, x, herb, shrooms, mescaline, etc.), I would like to point out that ether took me further than anything else I have ever tried. ",
  "This was not a 'huff some ether-get a head rush-feel tingly-get a headache' sort of experience.  This was more along the lines of huff ether and stare straight into the gaping maw of Pure Potential for an eternal instant.  This was hotwiring reality by injecting my soul under the dashboard of eternity - this was the naked face of the Now - up close and personal.  The first time I tried it was in college ('88) and there was a headshop (which has long since been shut down I'm sure) which actually sold pints of reagent grade ether.  I asked them if they had any as a joke, and the guy there actually whipped out a bottle.  'Rocket-fuel' he said.  In a sense, he was right. ",
  "My roommate at the time and I shared that first bottle, passing it back and forth and soaking small towels to huff from.  It was an experience that changed me - completely - and there is no way I can adequately describe the effect.  I will say, however, to be VERY careful with the stuff - also, it is HIGHLY flammable.  And, if you decide to try it, for chrissake make sure it's the right stuff and not some potentially lethal variant.</p>"
 ],
 "erowid": {
  "id": "8701",
  "citation": " Cap'n Zeep. \"Precipiate Of Thought: experience with Diethyl Ether (ID 8701)\". Erowid.org. Feb 11, 2004. erowid.org/exp/8701",
  "substance": "Diethyl Ether",
  "views": "37053"
 }
}
