{
 "title": "All Hopped Up",
 "author": "HeWhoLives",
 "citation": " HeWhoLives. \"All Hopped Up: experience with Hops & Cannabis (ID 12984)\". Erowid.org. Apr 14, 2002. erowid.org/exp/12984",
 "substance": "Hops & Cannabis",
 "bodyweight": "140 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)",
   "",
   " ",
   "smoked",
   "Hops",
   "(plant material)"
  ]
 ],
 "footer": [
  [
   "2001",
   "12984",
   "Male",
   "",
   "Not Given",
   "Apr 14, 2002",
   "34991",
   " "
  ]
 ],
 "report": "<p>\nI received an amount of Hops from a friend who likes to experiment with psychoactive herbs. He bought the herb from a health food store. I first tried hops with this guy and we smoked it out of a glass marijuana pipe.</p><p>The herb looked like little flakes of hay. I thought it tasted a lot like weed but the smoke was extremely harsh, probably because the plant is so dry. Another friend who is a regular pot smoker tried it and disagreed that it tasted like weed. I got some mild weed-like effects my first time but nothing to write home about.</p><p>The experience that really floored me was when I smoked it out of a bong with weed. Several nights after my initial experience, I got the hankering to get stoned by myself (I only occasionally use this drug anymore). I didnt have much pot so I packed a medium size bowl with a 3rd weed and 2/3rds hops. The weed layer was on the bottom. I smoked most of the bowl in 3 big rips. I became extremely high but in a different way than with weed. </p><p>The heavy stoney sedative effects of schwag were there but very little of the psychedelic effects. I also didnt see any mild patterns or other visual effects that usually manifest with pot. My imagination wasnt stimulated like with weed. It felt like a cross between being drunk and high but more like being drunk. My eyes felt like they were bugging out of my skull, which I have never experienced on just pot. I also had cotton mouth pretty bad. This high lasted for a good two and a half hours and then I went to bed as it tapered off. I had a sore throat the next morning from the harsh smoke.</p><p>I smoked several bong loads of hops by itself last weekend and didnt experience the same intensity. I did feel some light effects like with my first experience but nowhere near the weed combo. It was on a small scale what that combo was. I am aware of the fact that weed makes active many substances generally deemed to be inactive. But the difference in highs makes me think that it wasnt just an enhanced placebo effect. My conclusion is that hops is a good filler material when I want to smoke weed for a purely intoxicating experience. This may not work for regular pot smokers though. </p><p>---HeWhoLives</p>"
}
