{
 "id": 12990,
 "title": "This Is What Heaven Must Feel Like",
 "date": {
  "submission": "2011-08-29T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HippiexChild",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "mg"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine"
  },
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "mg"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine"
  }
 ],
 "report": [
  "Well, I was drug addict through my high school years. It didn't really start off like that. First, I experimented with various drugs and psychedelics to expand my mind and achieve a state of well-being nobody has ever did before. I ended up trying DXM. It became my drug of choice. About a year after, I switched to opiates. Opiates were great, except for the itching and the constipation. One day, I decide to go get help. I met with this doctor and he talks to me about Suboxone. Now I've did plenty of drugs in my life, but I had never heard of that drug before. He told me it was better than methadone and you couldn't overdose on it. So he tells me to go get a medical alert necklace. The reason being, when you take suboxone, any other pain pill you take after that, won't work. So if you got into a bad accident while on Suboxone, and they didn't know it and had to operate on you, you would feel everything because the pain medication wouldn't work. He also told me it would give me a little buzz. So I'm trying to decide if I should. I go ahead and say yes.",
  "My first stop ends up being at a local pharmacy. I get the necklace and 7 Orange tabs of 8mg Suboxone. What stuck me odd at first was the symbol that was imprinted in it. It was a sword, and I had never seen anything like it before. So I figured, What the hell? I took one of the orange tablets and put it under my tongue for 15 minutes. After that I swallowed it.",
  "After about fifteen minutes, I start to feel a pretty peaceful feeling, much like regular opiates. About another 15 minutes go by and I get this intense head and body feeling. I start nodding off. I was expecting a pain pill high, but got way much more than that. I was feeling so damn good I could barely move. This went on for another 9-10 hours until it started to die down a little bit. All that time, I felt like I needed to go to the hospital because I was feeling TOO GOOD.",
  "So now, I've been taking it for two years. The only problem I have with Suboxone now is severe constipation. I've been tapering down little by little and now I only take 4mg a day. It is still hard to use the restroom. Magnesium Citrate has become my best friend, along with laxatives and stool softeners.",
  "But to be honest, this pill saved my life? Who knows what would have happened if I never met my doctor.. I might even be dead by now, But everything happens for a reason. I've dedicated my life to God now and I'm trying to do his Will."
 ],
 "erowid": {
  "id": "87034",
  "citation": " HippiexChild. \"This Is What Heaven Must Feel Like: experience with Buprenorphine & Naloxone (Suboxone) (ID 87034)\". Erowid.org. Aug 29, 2011. erowid.org/exp/87034",
  "substance": "Buprenorphine & Naloxone (Suboxone)",
  "views": "6367"
 }
}
