{
 "id": 12992,
 "title": "Unsure",
 "date": {
  "submission": "2010-10-27T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Seraphic Luna",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "4",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "powder/crystals"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "5",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "powder/crystals"
  },
  {
   "time": "4:30",
   "amount": {
    "number": "3",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "MDPV",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Yesterday I received about 100mg of MDPV in the mail from a very close friend of mine. I've never experimented with it before, but I have recreationally used Adderall and Ritalin for several months now.",
  "I started my morning late with a phonecall from my right hand man, who we'll call Dwindle. He had just left class so we were going to meet up and smoke a spliff. I got up, took a quick shower and rolled up a nice fat spliff, and decided to give the MDPV a shot. I bumped about 4mg or so off my knife before I left for the park.",
  "About 45 minutes or so later we're at the park and I'm feeling pretty good. The MDPV seems to have made my limbs very tingly and I feel a general energetic push. We smoke our spliff and go for a short walk to the playground.",
  "I'm sitting on one of the playareas while Dwindle swings, and I suddenly start to get this rush of euphoric pleasure through my body - almost like a weak orgasm. I'm guessing this is due to how baked I was + the MDPV. I sit and look at the clouds moving - they're going really damn fast and this fascinates the hell out of me. Everything seems a lot more inviting and I can't keep my trap shut, constantly talking. Dwindle and I do another 5mg or so each off his knife about 10 minutes later.",
  "Skip forward about 3 hours or so. We're sitting in a little crater in town with some friends of ours, playing cards. I redose a little bit, another 3mg or so.",
  "As I write this tonight I feel generally tired, partially due to lack of sleep the prior night and partially due to the comedown. I'm a big guy so I don't feel the negative effects of stimulants as much as Dwindle does (he's very short and skinny, and tends to feel rather negative while coming down from a stimulant). The euphoria lasted about 2 hours total and had definite stages. I peaked about 20 minutes after smoking the spliff - it seemed to amplify the effects quite a bit, offsetting the usual laze I get out of weed.",
  "It was rather fun and I look forward to using more. However, be careful, the desire to frequently redose is rather strong."
 ],
 "erowid": {
  "id": "87040",
  "citation": " Seraphic Luna. \"Unsure: experience with MDPV (ID 87040)\". Erowid.org. Oct 27, 2010. erowid.org/exp/87040",
  "substance": "MDPV",
  "views": "8063"
 }
}
