{
 "id": 13002,
 "title": "Tremors & Fuzz",
 "date": {
  "submission": "2012-11-30T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kyle",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "5",
    "unit": "hits"
   },
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "Background: I had been smoking this incense maybe 5-12 times per day for a few months as an alternative to failing drug tests. I had one bad experience when I first tried it, but all of them after that had been somewhat pleasant with the exception of this one.",
  "On the night in question I had smoked the substance probably at least 10 times previously that day.",
  "21:25 I load up one very fat bowl and smoke it out on my balcony by myself. This is unusual as I typically set my limit to 1-2 hits. I got 5 good hits out of this bowl. I immediately begin feeling high, a lot like marijuana at first.",
  "21:35 I am starting to feel much higher than I am comfortable with, and that is saying a lot. This is the point where it starts to become a little unpleasant.",
  "21:40 I feel awful and I just want it to end, I want to come down from this more than anything.",
  "21:45 I am starting to get a very strange tingling sensation in my hands and feet similar to a Nitrous Oxide experience,  but I realize this is not supposed to be happening. I had read horror stories of these incense products before, but never really believed them. Heart rate is at 120 bpm.",
  "21:50 I am painfully aware of every second passing by as though it were a lifetime. I am feeling absolutely terrible. The best way I can describe it is the feeling of being poisoned. The paranoia is overwhelming. My heart rate is at a concerning 130 bpm.",
  "21:55 I am literally laying in my bed, shaking uncontrollably. I am seeing fuzzy colorful dots when my eyes are opened and when they are closed. My hands are shaking, can't focus on finding a pulse. It is all I can do to focus on breathing in and out.",
  "22:00 I am having severe tremors and heart palpitations as I lay in bed. I am astounded that I am actually hallucinating from this as I have never encountered anything like this from marijuana. I am very scared. All I want is for this to be over.",
  "22:05 At this point the tremors have gotten worse and I am legitimately afraid for my life. My body is tingling all over and I am still seeing fuzz everywhere. I frantically call numbers until I get a hold of someone I know I can trust. My jaw is shaking and I can hardly talk. I tell him to call 911 and send an ambulance to my apartment if I don't follow up with him in 10 minutes.",
  "22:10 The tingling sensation and fuzzy vision has begun to subside, but I am still shaking violently. I try to get up to get some water but fall back in my bed.",
  "22:15 I text to my friend that I am doing okay and there will probably be no need for an ambulance. I can keep myself from shivering if I try very hard. I still feel terrible. My heart rate is at 110 bpm.",
  "22:30 (1 hour, 5 minutes): I am no longer shaking, seeing dots, or tingling. My heart rate has reached a moderate 85 bpm. I am not concerned for my life anymore, in fact I just feel high albeit shaken and disturbed.",
  "Over the next hour I feel occasional waves of anxiety that decrease with each occurrence. I had no way of telling how close I was to being in real danger, but I will say that I will not be smoking that much ever again. I just want to put this out there for people to realize that this stuff most certainly can cause hallucinations, it can cause tremors, and it definitely accelerates heart rate."
 ],
 "erowid": {
  "id": "87102",
  "citation": " Kyle. \"Tremors & Fuzz: experience with Haze (Synthetic Cannabinoid) (ID 87102)\". Erowid.org. Nov 30, 2012. erowid.org/exp/87102",
  "substance": "Haze (Synthetic Cannabinoid)",
  "views": "1178"
 }
}
