{
 "id": 13006,
 "title": "Smoking Possible, but It's Not Healthy",
 "date": {
  "submission": "2011-08-24T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Nyi",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "smoked",
   "substance": "2C-T-2",
   "form": "(powder / crystals)"
  },
  {
   "time": "19:00",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I want to keep it short. I have a lot experiences with different drugs, always being wise and doing a lot of research in front. This time I acquired 2C-T-2 and wanted to try smoking it. The sample came from a source I trust.",
  "Setting: Safe",
  "Set: Happy, needed some directions after long period of self-supported detox.",
  "Smoke felt toxic and in 10 seconds I knew it will be a harsh ride. Visuals were pretty strong, Persian carpet type, typical for 2C's. Colors of objects were cycling, CEVs were strong, fast and frightening - of a unbelievable complex fractal type, which I would describe as multidimensional (more then in space, more then in time, there were dimensions coming into existence and disappearing randomly).",
  "I've seen how the nature works. I learned how the stronger wins. And I've understood there are indefinite possibilities how to become the strongest and that there are no limitations. It's the universe... all the possibilities, no compromises. What happens can't be undone.",
  "It was a long torture, where I was hunted by the stronger organisms. No matter what they were. I couldn't escape to safety, I couldn't accept what's happening in my mind. I had to accept that nothing is granted and that I there is no rest.",
  "The strongest part of the experience, when I was completely paralyzed by the overwhelming psychedelia, took about 9 hours. Then I could see the world, the clock, understand what I am and rest a bit. I was not able to stand up for another 5 hours. At T+19:00 I went to have a joint with my little brother, but then the visuals returned, but this time in different manner, which was acceptable. I told him about the experience and told me I probably overdid it... very funny.",
  "In the latter experiences I ingested 12 and 16mg and all were great. I even met my new girl friend thanks to this material, which helped me to find something I've lost in my life... or at least, she helped me to find the path to it again.",
  "Thank you my fairy, I won't forget about you... :)",
  "I advise against smoking this material, it decomposed quickly on the foil to a black dirt and the smoke tasted toxic. Not really healthy. Anyway, we're living only once, so reasonable dosage would be in my opinion between 0.5-3mg.",
  "Good energy for all, let the universe take care about you."
 ],
 "erowid": {
  "id": "87161",
  "citation": " Nyi. \"Smoking Possible, but It's Not Healthy: experience with 2C-T-2 (ID 87161)\". Erowid.org. Aug 24, 2011. erowid.org/exp/87161",
  "substance": "2C-T-2",
  "views": "3152"
 }
}
