{
 "title": "Quality of Experience is Dose-dependent",
 "author": "Less may be more",
 "citation": " Less may be more. \"Quality of Experience is Dose-dependent: experience with MDMA (Ecstasy) & Alcohol (ID 13017)\". Erowid.org. Feb 1, 2005. erowid.org/exp/13017",
 "substance": "MDMA (Ecstasy) & Alcohol",
 "bodyweight": "100 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Alcohol",
   "(liquid)",
   "",
   " ",
   "oral",
   "MDMA",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>There seems to be a rich source of information from people who have lots of experience with high doses of everything. I am curious about the experiences of others who enjoy X on a much more occasional basis and offer this as my two cents. My experience with recreational drugs is limited to alcohol and a couple of hits of marijuana.</p><p>I think my first X experience was with a slightly tainted batch (speed, Im guessing), as my experience was limited to a feeling of being slightly drunk, with some muscle shaking while descending stairs and very mild teeth clenching. My partner, on the other hand, experienced quite a bit of euphoria, became incredibly talkative and excited, got very touchy and acted jealous and possessive -- all behaviors that he does not normally exhibit. Another behavior he does not normally exhibit is insisting on sex (were both sex fiends and insisting is not usually necessary for either of us, but I wasnt into it four hours after taking E)- and while we both enjoyed it in the end, neither of us was able to come.</p><p>NOW FOR THE CRASH: five days of UNBELIEVABLE listlessness and fatigue - felt like having the flu. A little depression - the kind that makes me think, am I a little depressed or just really tired? Nevertheless, profoundly unpleasant: physically, emotionally.</p><p>I tried E for the second time because I found the changes in my boyfriend during the high so fascinating, despite the awful crash. This time was with a different, what I believe to be a purer, pill. Because I suspected we had overdosed somewhat with the first pills, I gave him 3/4 and me about 2/3. Also, we each took a bunch of Vitamin E and green tea pills a few hours beforehand. This was a very different experience for me: LOTS of euphoria, very feely, very sexual. More emotional outpourings from the boyfriend. Fabulous orgasms for both of us, and NO hangover or crash. Three more great experiences each about a month apart, then the supply dried up for five months.</p><p>A new supply arrived last week and we were both so excited that it didnt occur to me to start with a really small dose. He took a whole pill and I took 3/4. Onset was very fast - within 30 minutes (usually takes  me over an hour) and I felt great, but in retrospect, I seem not to have been quite as euphoric - very, very high, but not in that fabulous way I had become accustomed to. Im completely convinced this was due to taking too much, especially as I am now experiencing the second day of a vicious hangover. Totally killed the sex drive for two days, although it seems to be back now for both of us. No depression this time, but again incredible fatigue, a bit of lightheadedness and an overwhelming need to sleep. So Im putting us on a three-week drying-out period and trying it again, maybe a half pill for me next time.</p><p>Epilogue: the boyfriends emotional loosening up is always entertaining and somewhat useful. A little annoying in that he doesnt want to admit to everything he said afterwards, and hard to sort out what is meaningful. On the other hand there truly has been some meaningful progress, because he has in fact become more open in everyday life. Because of the potential for exhaustion its difficult to fit this stuff into my life but WOW is is fun!</p><p>(I forgot to mention that  except for once, we have always had a drink or two shortly before taking E and noticed that the high seems to be of slightly better quality and duration with alcohol.)</p>",
 "year": "2001",
 "id": "13017",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-02-01T08:00:00.000Z",
 "views": "31132",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ]
}
