{
 "id": 13020,
 "title": "Mary's Little Cousin",
 "date": {
  "submission": "2011-02-12T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lola",
  "gender": "Female",
  "weight": 47
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "hits",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  },
  {
   "time": "0:10",
   "amount": {
    "unit": "hit",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "The following is an account of my experience(s) with one of the chemically altered herbal blends known as 'Spice', more specifically, 'Spice Diamond'.",
  "I heard about the 'Spice' herbal blends on an internet forum for marijuana smokers. Someone on the forum mentioned that they bought it from a stand in the mall that is across the street from where I live. So, one day, out of curiosity, I bought it.",
  "When I got home, I took out a blunt, filled it with the Spice Diamond and rolled up a joint just for myself. The initial experience goes as follows (the following times are rough estimates; not 100% accurate):",
  "2:20pm - I lit the blunt and took only two hits. Felt nothing really.",
  "2:30pm - I took a third hit. Didn't really feel much.",
  "2:40pm - Starting to feel a head buzz, relaxed feeling. It starts to slowly get stronger.",
  "3:00pm - Buzz felt like it was wearing off already, so I took a few more hits.",
  "3:15pm - Starting to feel the 'rising' feeling that I get from marijuana. I'm starting to feel it stronger now, and it is VERY similar to weed.",
  "3:18pm - I start to listen to some music, and it is ORGASMIC--the same effect that weed has when listening to music--feeling like I am one with the music, hearing instruments that I never bothered to listen to before, etc. The Spice Diamond really made me feel quite euphoric as I sat back and listened to my favorite music and watched television.",
  "3:45pm - Feeling a bit tired now, sleepy if you will. I can never remember what happens or exactly how long a 'trip' lasts while smoking Spice Diamond, because I always fall asleep without realizing that I am falling asleep.",
  "I've smoked Spice Diamond several times since then. I have ZERO problems with short term memory from it (as others report), and ZERO disorientation the next day. The only thing I would say about this is that I am VERY tired the next day after smoking it, but only if I smoke it at night when I am already tired. If I smoke it during the day and it wears off, then I'm fine.",
  "Again, the Spice Diamond brand I smoked is very, very similar to weed. The only difference for me is that it did not last as long as a marijuana high for me (only about two hours max, if that--maybe I don't smoke enough of it?). Also, I felt like I had to smoke more to keep the high going--with weed, I never have to do that; I can take a few hits of weed and be high for five or six hours straight without smoking it again after that.",
  "All in all, a great 'legal' alternative for anyone worried about getting busted with weed."
 ],
 "erowid": {
  "id": "87220",
  "citation": " Lola. \"Mary's Little Cousin: experience with Spice and Synthetic Cannabinoids ('Spice Diamond') (ID 87220)\". Erowid.org. Feb 12, 2011. erowid.org/exp/87220",
  "substance": "Spice and Synthetic Cannabinoids ('Spice Diamond')",
  "views": "6910"
 }
}
