{
 "title": "Into the Void",
 "author": "Packetaddiction",
 "citation": " Packetaddiction. \"Into the Void: experience with Inhalants (Gasoline) (ID 13034)\". Erowid.org. Jun 13, 2007. erowid.org/exp/13034",
 "substance": "Inhalants (Gasoline)",
 "bodyweight": "175 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "inhaled",
   "Inhalants",
   "(gas)"
  ]
 ],
 "report": "<p>[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]</p><p>I was only 15 when I had begun to feel the impact of peer-pressure. Everyone around me was getting high from one thing or another and I wanted to find out what the fuss was about. I had tried marijuana before but it had no effect on me (I inhaled and exhaled as if I was smoking a cigg). So a friend of mine suggested huffing some gasoline. It sounded like an OK idea so off to the garage we went.</p><p>We spotted the gas can and began our 4 foot journey to our bright red can of enlightenment. It had a nozzle on it that was about a foot long. It was very dirty and it looked like it had been used a million times for various intended purposes.</p><p>I wasnt sure what to do so I simply placed my lips around the nozzle and inhaled violently a few times. The effect hit me hard and fast. Blurred vision, very light-headed and the desire not to move. It only lasted but a few minutes but I loved those few minutes. They were filled with thoughts that made no sense whatsoever. So I decided to give it another shot, but this time I was going to put my heart into it. I placed my bright red lips around the nozzle and this time I inhaled deeper, harder and faster then before. The next thing I knew I was half conscious on the floor crawling around, lost in those same strange thoughts. I hadnt noticed that I had pulled that gas can down with me and I was lying in a pool of gasoline. Then I blacked out again and woke up about an hour later.</p>",
 "year": "1995",
 "id": "13034",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-13T07:00:00.000Z",
 "views": "13113",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ]
}
