{
 "id": 13035,
 "title": "What I've Learned about Muscle Relaxers",
 "date": {
  "submission": "2012-06-03T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "William S. Bunghole",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Baclofen"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cyclobenzaprine"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Metaxalone"
  }
 ],
 "report": [
  "I keep on ending up with muscle relaxers when my man is not able to get opiates. I have not been too impressed by recreational use of the pills but here is what I've learned.",
  "Baclofen",
  "I've had the most experience with them and I do like them. the main problem is that I'll be popping them every couple of hours and hardly ever feel any real effect, then when I wake up in the morning I feel amazing. I do feel them slightly after I take them but it is nothing compared to what I feel the morning after. so I'd be careful until you know how they treat you. I will have a good strong humming throughout my entire body that usually last from whenever I wake up in the morning to between noon and 2pm. The buzz is good and doesn't cloud my mind at all but they do make me a little clumsy even the night that I take them. The strange thing is that when I tried to take them super early so I could feel them without having to sleep on them it did not work but once I do wake up with the buzz from them taking more then will keep it going.",
  "Flexeril",
  "I was real excited about these because unlike baclofen I had heard of these. I ended up with about 12 of these the other week and after taking 2 I realized that the drowsiness the accompanies them is not worth the little buzz that they brought. My girlfriend didn't feel anything other than the drowsiness. They were great for sleep but shit for recreation.",
  "Skelaxin",
  "Ended up getting a load of these that were sold as percocet. Instead of making a big deal about being lied to I decided to give them a try and they are my favorite of the muscle relaxers so far. The buzz hits around 30 minutes after taking them and lasts about 3 hrs. They don't cloud my mind at all and they didn't make me even slightly drowsy.",
  "None of them that I have tried are very good for recreation use. These seemed to relieve stress better than the others.",
  "main things to remember about these pills are:",
  "Don't take too many Baclofen because they will end up hitting hard.",
  "Don't take Flexeril unless I plan on sleeping.",
  "Skelaxin are good for just chilling out."
 ],
 "erowid": {
  "id": "87311",
  "citation": " William S. Bunghole. \"What I've Learned about Muscle Relaxers: experience with Baclofen, Cyclobenzaprine and Metaxalone (ID 87311)\". Erowid.org. Jun 3, 2012. erowid.org/exp/87311",
  "substance": "Baclofen, Cyclobenzaprine and Metaxalone",
  "views": "12513"
 }
}
