{
 "id": 13042,
 "title": "Supposed to be Acid - Dangerous with Alcohol",
 "date": {
  "submission": "2010-09-29T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "OldTrips",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "7",
    "unit": "glasses"
   },
   "administration": "oral",
   "substance": "Alcohol"
  },
  {
   "time": "0:00",
   "amount": {
    "number": "6",
    "unit": "hits"
   },
   "administration": "oral",
   "substance": "Unknown"
  },
  {
   "time": "25:00",
   "administration": "oral",
   "substance": "Lorazepam"
  }
 ],
 "report": [
  "I was sold 6 hits of what was supposed to be LSD (white on white blotter).  I went home and started drinking with some friends, and after about 7 drinks I decided I wanted to take the acid I bought.  As a note, I am a VERY experienced tripper, having tripped on many RC's, LSD, Mushrooms, and Mescaline.  I have also done LSD many times while drinking, and each time has been enjoyable.  This time would be different.",
  "12:00am - I dropped all 6 hits of the blotter.",
  "1:00am - The alcohol seemed to be getting stronger (I have a high tolerance, and I had stopped drinking by midnight.  This was the first sign that something wasn't right)",
  "2:00am - I completely blacked out",
  "8:00am - I came to experiencing intense visuals, a body load similar to, but stronger than 2c-x drugs",
  "12:00pm - I was still peaking, the visuals were oddly colorful.  They seemed to be part of another dimension, and did not directly interact with the real world.",
  "4:00pm - I had come down enough to function, but there were weak visuals and a strong speedy sensation",
  "10:00pm - Visuals were still present, the body load became miserable.  Sleep was impossible.",
  "12:00am - I couldn't believe it was still going.",
  "1:00am - I took a few Ativan, and finally was able to get to sleep.  I had strange dreams throughout the night, and woke up early.",
  "The trip was entirely not fun, and lasted over 24 hours.  I later learned from my friends that from 2:00am until I came to, I had become violent and agitated.  This came as a surprise to me, since at first I thought I took Acid.  After reading PiHKAL (and various reports on Erowid), I determined the substance in question was a DOx - more than likely DOB.  This trip destroyed my love of psychedelic chemicals, and I can't help but wonder what could motivate someone to pass off a chemical like DOB as LSD."
 ],
 "erowid": {
  "id": "87388",
  "citation": " OldTrips. \"Supposed to be Acid - Dangerous with Alcohol: experience with DO* (Sold as LSD, suspected DOB) & Alcohol (ID 87388)\". Erowid.org. Sep 29, 2010. erowid.org/exp/87388",
  "substance": "DO* (Sold as LSD, suspected DOB) & Alcohol",
  "views": "7032"
 }
}
