{
 "id": 13056,
 "title": "First-time Comparison with 018",
 "date": {
  "submission": "2011-02-02T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Steel",
  "gender": "Male",
  "weight": "151 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "6 mg",
   "administration": "smoked",
   "substance": "JWH-073",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Note: both JWH-018 and 073 are currently legal where I am and at this time.",
  "1:34 p.m.",
  "Just finished vaping about 6-7mg of JWH-073. This is my very first time trying JWH-073. After the third inhale (I'm using a light bulb vape), I immediately noticed a small difference in my head. Like I was lost in thought for a moment, but there was no topic to be lost in. I could tell that this is different than 018. (1:37) In fact, it almost seems to be doing the opposite high as 018. My body feels 90% normal, but there is some strange block in my mind. 018 basically increases all of my senses, relaxes my muscles, and gives me a nice body-stone high. I'm trying to think about what kind of high is going on right now, but I can't seem to figure it out. (1:39) My thoughts still seem to be semi-clear, but it's hard to describe. I actually feel like I'm getting visual hallucinations and movement lag much more than JWH-018. I think I may be feeling some time-dilation, but it's too early to tell. While JWH-018 makes me feel relaxed and start thinking about things in a social way (go into philosophy mode), this seems to be a more personal lost-in-my-thoughts kind of high. I was actually expecting this to be the other way around, but I guess this is it.",
  "1:41",
  "I'm going to take a dump; the full effects of the JWH-073 will probably be apparent by the time I'm out of the bathroom. I will report back in when I return. (I got super high of 018 last night and ate a bunch of crazy random stuff).",
  "1:48",
  "Alright, what I've noticed is that 073 is definitely more of an 'outward-focused on the world' high. With 018, I'm more concentrated on my body and what my body is doing (senses etc.); with 073, I find myself looking and thinking about all the things around me. For example, when I was in the bathroom, I was looking at the wood panels and thinking to myself if I had to think of one thing on this planet that probably has the most wisdom, I think it'd be trees. and then I moved on to think about the wood panel: This is just a dead tree. A corpse of a tree. and then I imagined what it'd be like, being a tree and seeing all these small creatures making things out of their fallen friends; killing them. (1:52) Anyway, I think I can tell that 073 could definitely be a literary high, though I don't know how good the writing will be. The funny thing is, these are just the thoughts rolling through my mind; I don't think I'd even consider explaining them to a friend next to me (if I had one here), but I would definitely write them down. Very very interesting. I might experiment with this and finally commit to writing down some notes about my philosophies. Maybe even write a lovecraftian short story while I'm at it.",
  "1:54",
  "Anyway, I think that I will conclude my report for now. 073 seems to peak faster than 018 (when vaping) and  it already feels like I'm slightly coming down (but that may be because I am doing nothing besides typing right now or that a mind-high is easier to get use to). I'd like to also note that I don't feel much anxiety (don't feel any) and it is probably less of an anxious high than 018 from what I hear, but I honestly feel more comfortable with 018. 018 is something I can just sit back, relax, and enjoy myself immensely with. 073 seems to be thought-provoking as well as 018, but not on the deeper levels (of our normal, sober reality) that 018 has. 073 seems to just jump-start me into thinking, but being more concentrated on the experience than issues of sober reality. 018 puts me into philosophy-mode and 073 gets me thinking about outward and material shit. I'd say, based on my understanding of the different values men and women hold, that 073 is more of a woman's high and 018 is more of a mans high (if you could only choose one). But that doesn't mean any member of sex wouldn't enjoy either one."
 ],
 "erowid": {
  "id": "87438",
  "citation": " Steel. \"First-time Comparison with 018: experience with JWH-073 (ID 87438)\". Erowid.org. Feb 2, 2011. erowid.org/exp/87438",
  "substance": "JWH-073",
  "views": "6896"
 }
}
