{
 "id": 13058,
 "title": "Trekcho (the Breakthrough)",
 "date": {
  "submission": "2011-02-11T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Karuna",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "This was my first experience with any form of DMT.  I did very little research prior to embarking on this journey to inner space, therefore I had little idea what to expect.  Ive had numerous psychedelic experiences in the past 40 years, but none in the last 10.  None have prepared me for what 5MeODMT had to offer.",
  "The setting and intention for the experience is very important, as with all psychedelic journeys. After reading many accounts of many others who had negative experiences, this belief is reinforced. Just as the amount and means for ingesting the substance are also very important. ",
  "There were six of us, plus the 'medicine man'.  We sat in a circle around a mattress on the floor in a very special building on very special land. We were all instructed not to eat 3 hours prior to imbibing.  I fasted for 24 hours.  A glass pipe that was designed specifically for 5MeoDMT was used for the ceremony.  The pipe was made from a glass cylinder approximately 6 inches tall by 2 inches in diameter.  On the bottom was a brass plate with a hole drilled and a small brass pipe stem was affixed.  Inside the tube was a moveable piston with a leather seal.  The crystals were placed on the brass plate and the tube was filled with Argon gas (used by wine connoisseurs to prevent oxidation)  A butane flame was held under the brass plate until the carefully measured 15 mg of magical substance was completely vaporized, filing the pipe with cottony smoke.  We inhaled the vapor in one large breath, until the piston moved down to the bottom of the pipe.  Five of us 'held the space', or sat, for the one taking the journey.  From outside, the experience took between 15 and 40 minute.  Inside was a different matter, as time did not flow  No way of knowing, but I suspect each of us had a slightly different experience, perhaps reflecting different intents.  One cried the whole time (for the suffering of the world), a couple laughed hysterically,  one thrashed about, one got up immediately and stared into the eyes of all the observers.  I thought I was immobile, but was told I moved in a circle around the mattress. ",
  "Trite as it sounds, the experience is far beyond words.  It lasted about 15 minutes, but it could have been hours.  There was no time to consider what was happening (as with other psychedelic experiences). It felt like all my breath left in one big sigh (some have likened it to a cellular release or orgasm).  There was no decision to let go, only a brief realization that I was gone. It was not so much a sensation of falling, but rather of being launched.  If this is the experience of emptiness that Buddhists speak of, fullness seems more accurate, as it contained everything.  The only feelings were awe, wonder and amazement (and maybe a little fear).  In retrospect, it can only be likened to 'standing before God', and since there was no one standing, it must be God.  There were sounds and sights that had nothing to do with eyes and ears.  My mind is not large enough to hold the experience, as I am only able to recall the outlines and after effects. (Which I'm sure is why the developmental approach is far more effective than the discovery approach in achieving liberation). ",
  "As I was 'reforming' (puts a whole new meaning on the word),  I had a realization - Christ's saying 'do not hide your light under a bushel' was mistranslated, it should have been 'do not hide your light in a sack', which is how I saw my skin as a container for the light that was my true nature.  I had the distinct feeling that I knew this place - that Id been here before, that it was home.  I found myself wondering why I was coming back.  The thought that occurred to me was 'now I understand the Bodhisattva path'. And now I know what humble is.  Funny, since I had been arguing with friends a few days earlier that one couldn't really take Bodhisattva vows until one knew what they were foregoing.  How could one not want to show others the way to this experience (freedom from suffering)? ",
  "The first thing I said when I got up was 'the joke's on us' -  which the two who preceded me immediately understood (that we believe we are individuals).  At the end, everyone said they wouldn't hesitate repeating the experience (even the one experiencing the suffering of the world).  Though I agreed, I'm not so sure.  Although it was the most profound experience of my life, as long as the realization remains, what need to repeat it?  Perhaps to share it with friends?",
  "I believe there is an explanation of the experience in the Buddhist tradition, as there may well be in others.   In Tibetan Buddhism, there are six Bardos, namely the Bardos of Living, Dreaming, Meditative Stabilization, Dying, Reality-Itself, and Becoming.  I believe that 5MeoDMT offers a glimpse of Reality-Itself.  There are four practices that are each indispensable on the path to enlightenment. They are meditative quiescence (shamatha), contemplative insight (vipashyana), the breakthrough (trekch), and the direct crossing-over (tgal).  I believe that 5MeoDMT offers a momentary breakthrough (to the other side).  When we die, we may be offered a glimpse of Reality Itself, and if we arent frightened by the prospect of dissolving and Becoming Reality Itself, we may achieve liberation (direct crossing over).  And we may choose to reincarnate as a bodhisattva, to assist all sentient beings, in their struggle to become liberated.",
  "After 30 days, there doesn't seem to be any after effects, other than a slight sense on non-attachment.  Some of the images from the experience appear in my dreams.  I see people differently.   I'm left with a deep sense of peace.  Which I wish for all sentient beings."
 ],
 "erowid": {
  "id": "87448",
  "citation": " Karuna. \"Trekcho (the Breakthrough): experience with 5-MeO-DMT (ID 87448)\". Erowid.org. Feb 11, 2011. erowid.org/exp/87448",
  "substance": "5-MeO-DMT",
  "views": "4240"
 }
}
