{
 "id": 13062,
 "title": "The Cure",
 "date": {
  "submission": "2013-02-06T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "The Hollow",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.5 mg",
   "administration": "sublingual",
   "substance": "Pharms - Clonazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": "9:00",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "Amphetamines",
   "form": "(pill / tablet)"
  },
  {
   "time": "9:00",
   "amount": "2 shots",
   "administration": "oral",
   "substance": "Alcohol - Hard",
   "form": "(liquid)"
  },
  {
   "time": "9:00",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "****Note - marijuana was consumed throughout the whole expirience.",
  "I am a heavy user smoking .3-1gram per day******",
  "Last weekend I indulged in some klonopin and adderall. The best high I recieved from this combo was today, monday, after 5 days of straight use. I almost cried, and I could feel the surge or dopamine and serotonin rush to and through my head. Before I get started I should give some backround info.",
  "Friday-Sunday consisted of me taking my benzos with my potentiators (Tagamet + Grapefruit Juice). Once the buzz kicked in I would Crush up some IR adderall and I would be in heaven. Free from all the anxiety in the world, free from what anyone thought, cared, did, and I was motivated to live life. At first, the smallest line(1-5mg) would send me soaring into the clouds ready for anything. I would take the klonopin 2hrs before hand then rail a small line and 1-2 bong tokes every 15-30 mins.I was high all day.  I snorted about 20mg addy on saturday, 30mg sunday = 50-60mgs. 1.5mg Kpin friday, 3mg Kpin sat, 1.5 mg sunday = 5-8mg",
  "Monday: probably have roughly 4-6 mg in my bloodstream still and I can definetly feel the 'who gives a fuck' benzo buzz when I wake up. I decided to put .5mg under my tongue at 7AM and railed 10mgs Adderall. I felt like the fucking man at school. Well, I was too drugged up to even care what the fuck I said or did. I felt no anxiety throught the whole day besides coming down from the adderall 1-2hrs later which I combated by drinking an energy drink. Normally, I would be extremely anxious at people judging me, thinking about stupid stuff, anxious about some thing I said a day ago, anxious about something I said a month ago, or even a year ago. I like this combo way to much, and my gut keeps telling me to do more. To keep partying. This was supposed to be the day I took a break and waited until friday to buy the ticket and take the ride.",
  "This is where the fun begins........",
  "4:00pm - by this time, I have roughly 3-6 mg of klonopin in my blood stream and I can definetly feel sense of calmness.  I went into my family's drug stash and took out a peachy addy pill. Broke it up, cut it up, and railed it. The monkey was finally off my back, for now.....",
  "I decided to enhance whatever klonopin was left in my bloodstream by taking 2 shots of vodka.  Wow, I felt warm and fuzzy from the booze instantly. I could feel me coming up from the speed though. I felt instant addrenaline rush and screamed at the top of my lunhgs, 'aaahh!!!' it felt soooooooooooooo fucking good. I yelled again followed by laughter. After 30 mins I could feel the alcohol fully, but I was way to tipsy/buzzin for only 2 shots. My speach was slowed, my eyes wide open but with no anxiety.",
  "Complete utter euphoria. I chatted some people on facebook and took rips out the bong. Took 1 hit of decent grade and I could feel this is going to be good. 2-3-4 hits and Im HAMMERED. I have tool playing in the background and Im having reallly positive thoughts. More than usual. At the time, tears came to my eyes and I loved this fucking world.",
  "This combo is extremely addicting for me. I get the euphoria and alertness from the adderall. Beneath it, a warm cozy blanket covers my brain. I start to have blurred vision. After 2-3 hours of euphoria, Im back down to the ground, still stoned and buzzin.",
  "The kpin definitely insures a smooth high and comedown."
 ],
 "erowid": {
  "id": "87487",
  "citation": " The Hollow. \"The Cure: experience with Amphetamine & Clonazepam (ID 87487)\". Erowid.org. Feb 6, 2013. erowid.org/exp/87487",
  "substance": "Amphetamine & Clonazepam",
  "views": "3485"
 }
}
