{
 "id": 1306,
 "title": "Happy Hill",
 "date": {
  "submission": "2001-05-15T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Carpet",
  "weight": 47
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  }
 ],
 "report": [
  "Chair and I were at a barter faire in Eastern Washington, and we were enjoying the festive air of the place.  There were many people with booths full of goods to trade or sell set up along many straw-covered pathways.  People came from miles around to attend this fair gathering, and there was a lot to do.  So we set about obtaining some LSD.  It's not always easy to walk through a crowd of people not knowing if they're government agents or not, but we wandered through the late sun and located a man with an interesting shirt who offered liquid doses for $2 apiece.  We agreed, and decided that 5 drops would be a reasonable number for us each.  We knelt before him as though he were Queen Elizabeth and we were being knighted.  The drops that came from the little Sweet Breath bottle had a slight minty taste, but I'm sure our breath was sweeter for it.  We thanked and paid him.",
  "We were walking along with a set of bamboo Unklungs, which is an Indonesian instrument.  It consists of a hanger, with eight separate and removable instruments, each a different note on the scale.  Each of the eight handheld pieces is basically a frame with two bamboo cylinders that vibrate and make a noise when shaken.  There is a Primus song that uses these instruments (I think - it sure as hell sounds like it, but I've never checked the liner notes to know for sure) and it's track 8 on Pork Soda, if you want to know what they sound like, regardless of whether that's what they use or not.  We found a vendor with several glass pieces, and we worked out a trade for a foot-and-a-half bong.  The bong was the nicest piece the vendor had, and it would have sold for more than a hundred dollars at a head shop.  At the barter faire, it would have cost $50 to $70. The bong was predominantly blue, marbled through with green and orange and white.  It's absolutely beautiful, and thicker than any other bong I've seen.  It's still intact after being battered countless times, a year later.",
  "We had also obtained several types of beautiful buds (Mango, Pez, G-13, Smiley, Purple Star, and some White Russian we'd brought along) and we decided to go back to our tent and take some icy bong hits out of our new bong. We had brought a cooler full of ice for just this purpose.  Our tent was set up on top of a hill, overlooking the entire barter faire in all its glory.  The place was full of people - it looked like a temporary city had been erected in the middle of a desert.  There was a constant stream of incoming cars.  There were drums beating in the distance, and the happy cries of the delighted participants of the faire.",
  "We sat at the edge of our tent, taking bong hits and trying to decide which of our six varieties of weed we liked the best.  We watched the people from our hill, and sat and talked until we felt the acid coming on.  The body high was apparent rather soon, and it was very good.  The euphoria intensified gradually but surely, and we decided to descend back into the strange land of the people.",
  "We wandered through the aisles aimlessly, marveling at all the people.  The visuals began to kick in, and we were laughing and holding each other.  Many of the people stared, but they were not worried.  There were shops with huge shelves of multi-colored candles, and obviously those were interesting to look at.  We could smell the world, and all the strange herbs and foods.  As dusk slowly rolled in, we saw many fire circles being formed.  There would be a circle of hay bales and a fire in the middle.  A lot of smoking went on in these circles, as we soon learned.",
  "We sat at one fire circle in front of a booth where energy drinks were sold.  There was a giant tye-dyed mushroom tapestry stretched out above the shop, which is why we chose it out of all the other fire circles.  We sat down, marveling at the complexity of the hay bales, when the people already sitting there asked the circle if anyone had a pipe.  We happily procured a lovely glass piece, and to our amazement it was loaded with an amount of weed that it was never designed to hold.  The pipe was passed around a few times, and then reloaded to the same bountiful level.  The circle had broken up a bit, and after two hits, our happy pipe-loaders decided to go strolling, leaving us with this heaping bowl.  We smoked it, and then new people came to sit.  Seeing us with a smoking pipe, they offered to load some.  The fire was warm, and we were giggly and happy to the point of being stupefied.  There was no way to express the all-encompassing sense of happiness, giddiness, joy of life and sight and sound and creation.  These people with their generous weed-sharing ways were just small examples of the glory and bounty of this barter faire.  We were all one, all happy and all sharing in the beauty and warmth of the communal fire.",
  "Chair and I decided to explore this Nirvana further, and reluctantly left the circle of never-ending smoke.  It was soon forgotten, for the acid was triggering such euphoria and intense happiness that nothing could be regretted.  We gazed in astonishment at the people, each face a shifting psyche wanting to connect to us.  There were women with bells, and I excitedly pointed these out to Chair.  It was nightfall, and we ended up at the central fire, the massive, drum-surrounded heart of the barter faire.  The drums took our breath away - there was a community of drummers harmonizing and any one of the drummers could take the beat to a new level.  There had to be at least thirty drums going at once.  The people were dancing and laughing and blissfully gliding through each other.",
  "On our way back through, we stopped to catch the end of two fire-dancing women, and then the belly dancers came out.  They were beautiful, seductively instructing us in just how a body could flow like water, or take on a serpentine elegance of writhing and weaving and breathing together.  After that ended, we found a giant swing set in a less populated part of the whole affair, and began swinging and kicking our legs.  When we looked up at the stars, it was insane.  The stars - the whole sky - looked as though it were being stirred with an invisible spoon, like cookie dough and the stars were the chocolate chips.  But it was far more spectacular than that - the colors were so vibrant, and the stars seemed to wrap and undulate through each other as they swirled and sashayed through the deep blue night.  It was incredible.  The air even tasted better - we were so alive, all of our senses turned on to 'Divine Reception.'",
  "We made it up to our tent, although unfortunately, I thought the ground below was wriggling with rattle snakes.  Chair fortunately was not deluded by the ground, and we successfully planted ourselves in front of our tent again.  This time the lights were all turned on, as it was dark, and that was a whole new dimension, seeing the lights from above.  The stream of cars was still snaking through the hills, and the tent city of desert dwellers was swelling.  I zeroed in on a particular truck with a little camper, and watched it bumping along.  When the truck hit a particularly large bump, the back end dipped down, and the corner of it spiraled down and swirled to mix with the dirt.  I explained this to Chair, who laughed. ",
  "The whole place was vibrating and throbbing, and howls went up from around the camp.  I howled back, eliciting more howls in return.  This went on for a long time, throughout the night.  Chair and I went into the tent and laid together.  When I touched his hair, my fingers came away dripping with the rich darkness.  I could dip my finger into the puddle of his hair and pull it away, stretching long pieces of it out like taffy, even though I wasn't actually holding his hair.  I got an image of hundreds of eyes, and purple shafts of light shot out of the pupils of each in unison, shortly before a charcoal bullet was released from the same place.  Chair was lying right next to me, and one of his eyes kept disappearing.  His face was melting into the pillow, so I tried to keep his head up, but every time he put it back down, it would start melding with the pillow.",
  "Our conversation was about the true freedom we all need, and this, for just this short while, was that freedom.  In our glorious, infatuated, excessive bliss, we began singing 'Get Up, Stand Up' by Bob Marley, emphasizing 'So now you see the light...' for we'd never felt so unrestricted or truly happy.",
  "The next day, someone gave us an eighth of mushrooms.  The man camping next to us came over for a while to talk, and discovering that we'd purchased four hits of blue Felix paper acid, he offered to dose us from his vial.  We told him we were saving it for when we got home, so he put a total of twelve drops on some chips which we sealed up.  Then a man camped on a slope near our hill informed us that he'd been robbed, and since he was so upset, he wanted to smoke.  In return, he gave us a six-foot bong.  There were also some sugar cubes scattered on the ground from the bastard thieves' raid, and he told us that half of the cubes had been dosed and half had not.  He had been picking them up and eating them, and was quite fucked up.  He referred to the bong he gave us as a ten-foot bong, and had gotten scabs all over his face from who knows what.  He was barely coherent, but he enjoyed smoking, and it calmed him down.",
  "Later, before we left, another nearby camper smoked us out heavily and we traded a small bud of White Russian for a luscious, fresh, glittering green bud of Pez (that's where we'd gotten the Pez from earlier, too.)  The bud he gave us was easily four times as big as the one we gave him.  Everyone there was so generous, so wonderful - the experience was the single most happy event of my life (and Chair's) - until we took the chips that had been dosed when we were back at home."
 ],
 "erowid": {
  "id": "1389",
  "citation": " Carpet. \"Happy Hill: experience with LSD (ID 1389)\". Erowid.org. May 15, 2001. erowid.org/exp/1389",
  "substance": "LSD",
  "views": "14935"
 }
}
