{
 "title": "Mindfuck - Never Again",
 "author": "Cajun Girl",
 "citation": " Cajun Girl. \"Mindfuck - Never Again: experience with Mushrooms (ID 13077)\". Erowid.org. May 5, 2007. erowid.org/exp/13077",
 "substance": "Mushrooms",
 "bodyweight": "125 lb",
 "report": "<p>This trip happened 20 years ago, but it still seems as vivid as if it had happened yesterday. One afternoon I went with my uncle to my grandfather's farm to pick mushrooms. I had NO IDEA what we would be doing with them. All he said was 'We're gonna eat these later and go on a trip.' Later that afternoon, another uncle met up with us at my grandparent's home (they were gone away for the weekend). He'd brought along a lady friend of his too. They all had tripped on mushrooms before and did not offer any information to me about what might happen.</p><p>I recall that the mushrooms had been cooked in a beef gravy of some kind. We all sat around talking and eating the mushrooms off of a big platter. I was eating some (although they tasted like crap), but for some reason they weren't paying close attention and kept suggesting I eat more and more. I told them that nothing was happening and they assured me that if I waited a little while longer, it would kick in. They kept saying how they could feel the effects coming on, so I ate a few more to get my groove going too.</p><p>The first thing I remember is a tickly-tingle sensation running through my body and that EVERYTHING was so funny. When trying to walk, my legs felt like wire and it seemed like I was walking in jello. I laughed until I started to cry and then I couldn't stop crying. I experienced while crying, an overwhelming sadness. At one point I sat on the floor with my head in my hands, trying to understand what was going on. At that point, it felt like someone pressed a 'rewind' button on my life and whole existence. I went swirling back in time, to the first man and woman, Adam and Eve, and I was given to understand all that had happened in the universe, some pretty wild secrets which I could never manage to recall after the trip.</p><p>The walls seemed to breath and change a bit. The colors were extremely intense. Everything was so vivid. All lights had a white ringed aura around them. Everyone else seemed to be isolated in their own trip. I don't recall talking very much to anyone. I felt very thirsty and asked for something to drink. What they gave me tasted like gasoline so I immediately asked for something else. To my dismay, it also tasted like gasoline...then I realized that anything I would drink would taste like gasoline, so I gave up on drinking. I was walking around in complete fear and paranoia. The sound of my own breathing sounded so overwhelming and I wished the effect would go away. I recall asking if this was going to be over by the next day and I was assured that it would be over in a few hours. That offered me no comfort at all.</p><p>One of my uncles put on the B-52's which only seemed to offer extreme aggravation to my already distressing trip. I asked him to turn it off, which he did. I then decided that I could go to sleep and sleep this off. I layed down on the bed and tried to sleep but every time I closed my eyes, my body began to become one with the bed, very intense feeling indeed, as though I were being swallowed by the mattress. I got up and went into the kitchen where everyone was. I could hear them discussing a type of bread they were eating. As soon as I walked into the room, the whole scene, with all 3 people eating and talking, bacame a tv commercial.</p><p>The constantly changing scenes caused me great fear. I guess at some point, my tripmates caught hold of my distress and decided we'd go for a ride in the car. We stood outside for awhile and looked at the night sky. It felt as though the sky was a ceiling very close to my head...we rode around for an unknown amount of time and then I started to come down. They eventually brought me home and I went right away to take a bath. I was so grateful to be in my right mind again. I told my mother, which infuriated her because unknown to me, they'd given her mushrooms to take also, but she went home and decided against taking them. Thank goodness she didn't take them.</p><p>Since this trip, over the years, I've had many fearful flashbacks. I've had them a few times after smoking weed. They've become fewer and fewer over the years and seem to be brought about by a depressing or stressed out mindset. When I had my son in 1989, I was given Ketamine as a sedative. I was OK right after being given the Ketamine, but upon coming out of it, I experienced a severe flashback of my mushroom trip. I've since learned that Ketamine is used by people to trip. Last year, in New York, I was given Ectasy at a club and felt a 'trippy-mushroomy' kinda feeling coming on, after about 15 minutes of paranoia and fear, I mellowed out and fell in love with the entire world.</p><p>Overall, I can say that doing drugs isn't worth it. Once your mind is opened by mind altering drugs, you can never go back again. It's always with you.</p>",
 "year": "1982",
 "id": "13077",
 "gender": "Female",
 "timestamp": "2007-05-05T07:00:00.000Z",
 "views": "11258",
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(cookie / food)"
  }
 ]
}
