{
 "id": 13073,
 "title": "1 gram 4 Catheters and 2 Days of Hell",
 "date": {
  "submission": "2010-10-20T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Daniel",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 g",
   "administration": "oral",
   "substance": "DXM",
   "form": "capsule"
  }
 ],
 "report": [
  "It all started on Monday. It was a public holiday and there was not much to do around the house. I turned on my laptop and talked to some friends about DXM, I thought it would be a good idea to take a gram of DXM powder to have fun for the day. I went into my bedroom at 10am and washed down 3 pills filled with pure DXM powder (a total of 1000mg of DXM). I asked my dad to take me to the shops since I thought it would be fun, then it started.",
  "When we got to the shops, my dad said that my face was extremely red. I was getting dizzy and I felt like I was drunk. I blacked out for the next 5 minutes and then I noticed I was in the car driving home. I vomited and then blacked out again. I came back to see things flying all over my room (such as people and furniture). My sister then called the ambulance and they rushed me to hospital, while I was in the ambulance, I saw a lot awesome shapes and colors. Everything was just fun.",
  "When we arrived at the hospital I went into this black nothingness, it was so peaceful. Like I was in another world where the real world didn't exist. I opened my eyes a few hours later to see these blobs (which were nurses). I could only see their eyebrows and mouths and it was pretty strange. Then the doctor tried to ask me a few questions, somehow I answered them but in my mind I was trapped at the other end of my bed and unable to move anything. They then moved me to the emergency ward where they tried to get me to pee, but I couldn't so they had to put a catheter in. It felt like a sadistic nympho was stabbing my penis with a pen.",
  "The next day a small Asian doctor told me that I could go home as soon as I peed. she took the catheter out (it felt like somebody was pulling a fish hook out of my penis) but I couldn't do it, so she put one in again.",
  "Now it was Wednesday, the DXM had worn off and the doctors were pretty sure I would be able to go. They took it out and I drank 1.7L of water. It hurt... a lot. I pressed the nurse button and they put another catheter in.",
  "Then on Thursday (the day of me typing this) they had taken it out. I drank 1.4L of water and it hurt so they put another catheter in. The drug had worn off 2 days ago and I was still not able to pee. They sent me home with a catheter in me. And now I have to wait a week before they take it out."
 ],
 "erowid": {
  "id": "87524",
  "citation": " Daniel. \"1 gram 4 Catheters and 2 Days of Hell: experience with DXM (ID 87524)\". Erowid.org. Oct 20, 2010. erowid.org/exp/87524",
  "substance": "DXM",
  "views": "6023"
 }
}
