{
 "id": 1308,
 "title": "Having Sex With Keyboard Duster",
 "date": {
  "submission": "2005-08-13T07:00:00.000Z",
  "experience": ""
 },
 "author": {
  "name": "ciNNaSunD",
  "gender": "Male",
  "weight": "135 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "(gas)"
  }
 ],
 "report": [
  "[Erowid Warning: Our understanding of the literature is that there is no such thing as safe use of volatile solvents, aerosols and other street inhalants : their psychoactive effects are inseparable from nerve and organ damage. We have chosen to include these reports to help document the real world use of inhalants, but their inclusion is not intended to imply that they are anything but dangerous.]",
  "School ended at 9am today so i went home and waited for Vicky to get there so we could smoke and have sex. She got there and we puller her car into my garage around 11:40am and smoked a HUGE bowl. After that we got out of the car and smoked a cig in my garage.",
  "Proceeded to go to my room for the sexual conduct. We had discussed the day before having her take a hit from the keyboard cleaner while I performed oral sex upon her. The oral sex came and went, then we had sex. While having sex the keyboard cleaner popped in my head. having previously placed it on my nightstand thing, I took it and gave it to her.",
  "Vicky's description of what occured:",
  "'I take a hit. the biggest I can. It took a second to kick in but when it did....wow! Pulses, and beats and suddenly i have this huge burst of energy.....everything feels sooo good and I keep going. harder and harder. it was sooo great. go keyboard kleaner.'",
  "ciNNaSunD's description of what occured:",
  "'I took the bottle from Vicky's hand and at first contemplated whether or not to take a hit. So I did and i just closed my eyes and waited for it to kick in. It kicked in more and more and as it did i felt like superman or something. I had this continual flow of energy that failed to cease at all costs. My entire body had the most incredibly stimulating tingle to it. That just continued while i was listening to the typical 'wah-wah-wah' helicopter noise that is so common form nitrous. This remixed over dieselboy and having sex and being really stoned lead to one hell of an experience that i thought should be shared'"
 ],
 "erowid": {
  "id": "13904",
  "citation": " ciNNaSunD. \"Having Sex With Keyboard Duster: experience with Cannabis & Inhalents (ID 13904)\". Erowid.org. Aug 13, 2005. erowid.org/exp/13904",
  "substance": "Cannabis & Inhalents",
  "views": "11774"
 }
}
