{
 "title": "I have shit for brains",
 "author": "Goddess",
 "citation": " Goddess. \"I have shit for brains: experience with Caffeine (ID 1309)\". Erowid.org. Sep 8, 2000. erowid.org/exp/1309",
 "substance": "Caffeine",
 "bodyweight": "95 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Caffeine"
  ]
 ],
 "report": "<p>Dont let anyone tell you caffeine is mild.</p><p>The night before my pysch paper was due, i sat down to write the godammned 100+ pages. well one night aint gonna cut it, so i downed a two liter of coke while typing furiously on my laptop. i stayed up all night, and at around 7am, i leave the comp to get ready for school the paper is due in 12-13 hours. i swallow two cups of coffee before leaving, and swallow two vivarin tabs along with a red bull on my way out the door. at the campus, skipping all classes, i sit in the lounge, trying to type the damn thing. my eyes are frozen in the wide eyed position, hands cant seem to stop doing the jitterbug. i couldnt even hit the keys on my laptop, they were shaking so bad.</p><p>i had to finally get my b/f to type it out for me. my heart was pumping the mad dash, my breathing was furiously fast, and incredibly shallow. i couldnt get enough air into my lungs fast enough. my brain was doing shit things, instead of thinking of my psych paper, i had made a discovery in the field of physics, (it had to do with changing the state of matter: solid, liquid, gas, to accomodate human travel through electrical sockets...dont ask!) and come 9pm, when the paper is due, i throw it at the prof, sprint to my car, and try to drive home. im sick, my stomach feels like i just swallowed liquid plumr, and i nearly caused two wrecks on my way home.</p><p>i get home, and crashed. slept for almost two days straight. caffeine gives you a great feeling, but not that much. my advice. if u have a paper due, dont do it the nite b4. and dont drive home under the influence.</p>",
 "year": "2000",
 "id": "1309",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2000-09-08T07:00:00.000Z",
 "views": "20789",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "Caffeine"
  }
 ]
}
