{
 "id": 13093,
 "title": "Reflections",
 "date": {
  "submission": "2010-12-22T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "playastar",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 ug",
   "administration": "sublingual",
   "substance": "2C-C-NBOMe",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I've had an opportunity to trial a interesting new compound over the last couple of weeks NBOMEe 2cc (25C NBOMe) or 2-(4-chloro-2,5-dimethoxyphenyl)-N-[(2-methoxyphenyl)methyl]ethanamine or 2-4-chloro-25-dimethoxyphenyl-N-2-methoxyphenylmethylethanamine",
  "Set and setting: At home. bored on a weekday.",
  "First trial at 300umg sublingually, using the liquid measurement method at 100ugm,s per drop. Three drops were applied to a paper towel and were held under the tongue for 15mins. A slight numbing is noticed but this could a result of the alcohol the substance was dissolved in.",
  "30mins nothing really noticed at this point",
  "45min slight stomach discomfort noted",
  "60min starting to notice some color brightening and a slight energy push...",
  "75min coming up now. Color intensification increasing, a mild euphoria noted",
  "90 min Nice...effects are very manageable. visuals are like 2C-C visuals but, with a nice body high and slight energy push. No real negative body issues noted.",
  "90min -160min went for nice long walk around the neighborhood.The body feels good and mentally feeling quite in control even though I'm tripping at low +++",
  "300min I notice the energy push is waning a little. visuals still going ++ to +++",
  "300min - 360min body high slowly decreasing and visuals have decreased to ++",
  "480 mins back to baseline total duration is about 8 to 9 hours",
  "Second trial 400ugm sublingually",
  "Same effects as above are noted: euphoria and energy were increased somewhat. Visuals were still close to the same level low +++ level. Very 2C-C-like in nature.",
  "400ugms seems to be a good working dosage. Be careful going higher with this one though. I've heard reports of increasing negative effects going past 1mg.",
  "Better be safe then sorry....;-)",
  "All in all a very worthwhile and novel new compound. Its not a very introspective chemical, but more of a rave or party drug. Not in your face like MDMA but a special chemical in it own right.",
  "cheers"
 ],
 "erowid": {
  "id": "87671",
  "citation": " playastar. \"Reflections: experience with 25C-NBOMe (ID 87671)\". Erowid.org. Dec 22, 2010. erowid.org/exp/87671",
  "substance": "25C-NBOMe",
  "views": "10036"
 }
}
