{
 "id": 13098,
 "title": "Probably Overkill",
 "date": {
  "submission": "2004-05-03T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Shamanistic",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Harmaline",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "oral",
   "substance": "Harmaline",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "insufflated",
   "substance": "Harmaline",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "First time trying Harmaline after much research. I obtained the pure chemical after reading many reports of nausea with Syrian Rue and its extractions. The chemical is available off the net with some research. I took 2 pills of roughly 250 mg within 2 hours, plus I snorted some aditional 250 mg. This was probably overkill. I believe the substance would be effective in the 300 to 500 mg range but I am not a small guy.",
  "I found the substance to have a very heavy body load and reminded me of being seriously drunk. I could not stand up and would not recommend going out on a large dose of harmaline. The substance is definately psychotropic and was similar to shrooms and acid, although it physically made me want to only sit as I became extremely dizzy upon standing. The effects were major tracers like on acid, spirit communication, revelation of the atomic nature of life, etc. I noticed the presence of a South American Goddess in the chemical which I believe relates to Yage and the long tradition there. This drug would be heavy duty with a light amount of shrooms. I would avoid alcohol in any form as the body load is similar to being drunk. However, I did do a larger dose. Want to try a smaller amount with some Amanita Muscaria. Overall, this was a spritual experience and the drug does make me look inward. Enjoy!!"
 ],
 "erowid": {
  "id": "8771",
  "citation": " Shamanistic. \"Probably Overkill: experience with Harmaline (ID 8771)\". Erowid.org. May 3, 2004. erowid.org/exp/8771",
  "substance": "Harmaline",
  "views": "15830"
 }
}
