{
 "title": "Feeling Weird, Can't Stop Smiling",
 "author": "slayerfan666",
 "citation": " slayerfan666. \"Feeling Weird, Can't Stop Smiling: experience with Paroxetine (Paxil) (ID 13107)\". Erowid.org. Jun 25, 2002. erowid.org/exp/13107",
 "substance": "Paroxetine (Paxil)",
 "bodyweight": "145 lb",
 "report": "<p>I was given a presiciption for paxil that I never used up. The docs prescribed 10 mg a day for me and I followed their advice for nine months. The problem was that paxil was really interferring with my abiity to pay attention in school. I guess this was because the drug made me feel extremely talkitive so as a consequence I was always shooting the shit with my friends. This sucked because it was a college and I blew alot of classes over my inability to feel bad about things (like never doing any work or attending classes). I was too content to the point of apathy on this drug.</p><p>So I decided to quit. I tried just not taking any pills but within a day I started expeirencing uncomfortable phsyical syptoms that any of you who have done paxil are familar with. They included the sensation that every time I took a step the ground would depress underneath my feet like a trampoline, dizzyness, hostile angry mood (sometimes) , and finally nausea and vomitting.</p><p>Since the withdrawal sucked way worse than taking the drug I took some and felt relief pretty fast. I got myself off it by halfing my dose every two weeks and then talking the smallest dose every other day then every three days and then none at all.</p><p>After gaining some perspective on the whole thing I was curious to know what Paxil was like in bigger doses, just to see if it had any recreational potential. I discovered it does in a kind of uncomfortable way. Setting was my room, my mindset was curious, the time was 11:00 at night.</p><p>For the first few hours after taking a large dose (I typically take two to four times what I was prescribed but use caution cause I don't know what happens past 50 mg)  I felt energized and I couldn't stop smiling. My body and face were extremly animated and I was feeling a definite high. After a few hours my head started feeling really light but not like I was going to pass out, more like if I had been on a boat in the ocean and had suddenly stepped back on to land. While I had no problems falling asleep that night I slept for only three hours before waking up, which is extremely unusal for me. When I woke up I felt fucked up. Not too impaired though I just felt slow mentally. This may be because the stepped off a boat feeling was now at its most intense.I was pretty useless the whole day, couldn't get any thing done. After about 24 hours I returned to normal.</p><p>In conclusion I would say that if you are expeirenced with drugs that produce some discomforting side effects (DXM, for one) you may like its effects in larger doses, but the length of time it takes to  come down are a draw back if you need to get anything done. If you are only familiar with gentle drugs don't go down the pink pill road.</p>",
 "year": "2001",
 "id": "13107",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-25T07:00:00.000Z",
 "views": "37970",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "(pill / tablet)"
  }
 }
}
