{
 "id": 13107,
 "title": "High Doses Not Good for Stomach",
 "date": {
  "submission": "2010-10-26T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "LoveMDMA",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "My quest for an MDMA like substance has led me to some truly horrible experiences, this is one of them. One day they will legalise it and Ill not have to put my stomach in danger with a lot of unknowns.",
  "I took 200mg of MDAI and an hour after experiencing minimal effects took another 200mg. I had heard its slow to come up and it is.",
  "About two hours into my trip I have slight feelings of euphoria but nothing ground breaking.",
  "Three hours in and Im feeling dizzy, space out and tripping like mad. Some of it is enjoyable, some not. Its a bit too much so I drink some orange juice and have a cold shower.",
  "Four hours in and Im feeling incredible sick, I try to vomit but cant. I drink loads of water.",
  "Five hours in and I wonder if Ive done any permanent damage to my stomach, still trying to vomit but only bile comes up. I also have mega cramps in my feet. It also goes through my mind that this stuff could be lethal at high doses.",
  "Twelve hours in and Ive been up all night trying to vomit, regretting taking such a high dose and generally feeling like Ive screwed my stomach up. I go to work with difficulty.",
  "Im shivering all day at work. I try and go for walks. I try and force some food down me. I feel like Ive got unbelievable heartburn.",
  "Two full days after taking MDAI I feel back to normal except for the feeling of a scarred stomach and constant heartburn.",
  "Three weeks later and my stomach is back to normal."
 ],
 "erowid": {
  "id": "87855",
  "citation": " LoveMDMA. \"High Doses Not Good for Stomach: experience with MDAI (ID 87855)\". Erowid.org. Oct 26, 2010. erowid.org/exp/87855",
  "substance": "MDAI",
  "views": "6049"
 }
}
