{
 "id": 1310,
 "title": "For the Ill-informed Only",
 "date": {
  "submission": "2000-10-08T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "John H.",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 cups",
   "administration": "oral",
   "substance": "Datura",
   "form": "(tea)"
  }
 ],
 "report": [
  "My friend and I tried Datura as our first 'organic' trip, for chronic lack of any other available psychoactive substance (mid 1997). We were not aware of the toxicity of Datura. We boiled the leaves and yellow trumpet flowers for a couple of hours, mixed with copious amounts of milo, and strained into a thermos as we planned to drink it at half time of an AFL football match (Geelong vs Sydney, what were we thinking?), just for fun.",
  "We drank two small cupfuls each and after about twenty minutes the grass of the oval was beginning to float and glow. My friend and I looked at each other and I was taken aback at the sight of his eyes, the pupils were pinpricks and I realized I must look the same. Gravity was beginning to prevail upon me and I realized there was a long day ahead. At 3/4 time I knew I had to head for home (we had walked 30mins to ground). My legs would not work properly and I stumbled across the row (we were sitting in the members stand, what a sight we must have been). My friend, in the grips of his own malady decided to stay until the end of the game, and exit with 30,000 other people. Gripping the stair rail for direction, I felt numbly wise for sneaking out quietly. The walk home consisted of repeat auditory hallucinations, I must have turned around 20 or 30 times as I heard people calling out to me. Vaguely familiar people would appear ahead on the footpath and as I would finally reach them they would dissapear into the concrete below my feet. None of this was alarming or enjoyable, my mind was dull and I was just trying to get home.",
  "My friend arrived home about 50 mins after I did, and we really couldn't communicate with each other. He told me he saw me a couple of times on his walk, like I would step out from a behind a bush, and just as he said 'there you are', I would disappear again. At about 6 or 7pm I got it into my head that I had to work that night, tho I was of course in no state to do so. My friend being equally deluded, and even though we had planned to leave the night free to 'trip', believed me and walked round the corner to his parents home. He fell through the front door and his entire family was home. He found himself explaining to his mother about the football, and then she would dissappear and he would realize the entire family was looking at him as he had been talking to thin air. His dad sent him off to bed before his mother broke into tears (he was 19yrs old at the time, from a conservative christian family). It had worn off by midnight and I felt much better, except for blurry eyesight which returned to normal the next day.",
  "We didn't realise it at the time but it took us a couple of months to emerge from the mental cloud the datura caused. We were both very interested in psychedelics and have had much more satisfying experiences in recent years with more user friendly substances. It seems like we resorted to datura due to lack of information or availability of other alternatives. I would not recommend Datura to anyone. It is the only psychedelic I regret taking, and my friend agrees."
 ],
 "erowid": {
  "id": "1391",
  "citation": " John H.. \"For the Ill-informed Only: experience with Datura (ID 1391)\". Erowid.org. Oct 8, 2000. erowid.org/exp/1391",
  "substance": "Datura",
  "views": "17251"
 }
}
