{
 "id": 13128,
 "title": "Acting Syngergistically Together",
 "date": {
  "submission": "2011-02-14T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Teixiptla",
  "gender": "Male",
  "weight": 66
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "2",
    "quantity": "2"
   },
   "administration": "oral",
   "substance": "Tabernanthe iboga"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "DXM"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "oral",
   "substance": "DXM"
  }
 ],
 "report": [
  "I am a regular user of psychedelic and other drugs, and this was my third experience with two grams of iboga within two weeks. This plant has been the first true teacher psychedelic I've experienced, in spite of having extensively used LSD, psilocybin mushrooms, DXM, many so-called research chemicals (2C-I, 2C-E, 2C-T-2, 2C-T-7, alpha-O-DMS, and various other tryptamines I can't recall anymore), MDMA, and methylone for many years. In my opinion, iboga beats them all in terms of depth of insight and psycho-emotional healing capacity.",
  "I had been using moderate amounts of DXM on a fairly regular basis, but so far had not overlapped it with the iboga experience. After doing some research into the interactions of iboga with other drugs, I found, to my delighted surprise, that there was a clear link between ibogaine and dissociatives such as DXM, which, according to a journal I had read, had been co-administered with ibogaine in cases of opioid dependence with great positive effect. I took this as a sign that I should begin to integrate the two materials immediately. I wanted to be cautious, however, so I decided to begin by overlaying a small dose of DXM on top of the wonderful after-effects of the iboga, which for me occur for approximately a day after consumption.",
  "On a Monday evening, a night before work, I might add, I took two grams of iboga and had yet another awe-inspiring, tremendous experience that night. Once again I was astounded that a mere two grams could do what they did. I stayed awake past 3 AM, but decided to go ahead with the next day's business anyway.",
  "The next morning, I consumed 150 mg of DXM as an initial dose. At this point, I was still clearly experiencing the iboga after-glow. The 150 mg of DXM did not significantly change this, but rather seemed to join the ibogaine, alongside it as it were. Once this light DXM dose had fully manifested, I decided to take yet another 150 mg. At this point, I was at work. I would imagine that some people might find it hard to believe that I choose to use psychedelics in such settings, but I'm a firm believer in using psychedelics in real-world situations, in order to see the world rightly and act in accordance with it. I had often taken DXM at work, and always had had a very positive experience.",
  "The second 150 mg came on proportionately stronger than I was expecting it to. It had only been a few hours since the first DXM dose, so there was an additive effect, but this time it was different. The DXM was warmer, fuzzier as it were, and I was becoming quite aware of specific elements of the iboga from the night before: sensations of cold, smooth tension in my limbs which would repeatedly build, only to dissolve into a pleasurable warmth. This was typical of iboga in my experience, but it was not usual for it to be occurring this late in the experience.",
  "Emboldened, I took another 150 mg of DXM. I seemed to cross some sort of dose threshold this time. As the DXM came on in a wave, the iboga became fully re-expressed, almost as it had been the night before: incredible empathy, creativity, and self-awareness combined with the cold tension in the limbs as well as visual distortions and hallucinations. The DXM's character was in the fore now, but was rich and warm, as if the normally hard-edged and detached DXM experience had been somehow crossed with that of a generic tryptamine experience which softened it and brought out rich visuals. It was almost overwhelming, actually: far stronger than that amount of DXM should ever have been. I peaked for about 4 hours, and enjoyed a long, warm aftermath that evening.",
  "I am certain now that DXM and ibogaine act synergistically together. The amounts of the drugs I was using were small, so for such a pronounced enhancement to occur was shocking and wonderful to me. In the future I plan to mix the two more thoroughly."
 ],
 "erowid": {
  "id": "87990",
  "citation": " Teixiptla. \"Acting Syngergistically Together: experience with Tabernanthe iboga & DXM (ID 87990)\". Erowid.org. Feb 14, 2011. erowid.org/exp/87990",
  "substance": "Tabernanthe iboga & DXM",
  "views": "5168"
 }
}
