{
 "id": 13125,
 "title": "Uncontrollably Long High",
 "date": {
  "submission": "2010-11-09T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "John",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "administration": "oral",
   "substance": "Lamotrigine ",
   "form": "daily"
  },
  {
   "time": "0:00",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  },
  {
   "time": "0:05",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  },
  {
   "time": "16:00",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "Prior Experience with Recreational Psychoactive substances:",
  "Robotripping on full bottles of DXM",
  "Smoking cigarettes",
  "Limited and mixed experiences with marijuana",
  "Admitted caffeine/sugar addict",
  "Daily Use:",
  "100 mg Lamotrigine as an antidepressant",
  "I decided I'd go hang out with friends and smoke some herbal incense and have a good time for my birthday. We smoked two bowls of 'Da Shit' brand herbal incense. Here's the trip report for that experience:",
  "All times are approximate.",
  "T0:00 Outdoors at picnic table. Smoked one bowl of herbal incense, taking big hits, can barely hold smoke in.",
  "T0:05 Felt that 'am I getting high yet' feeling. Smoke another bowl.",
  "T0:07 Body high sets in, the mid-sections of my limbs start to feel shaky and rubbery, then tingly.",
  "T0:10 'Whoa!' moment, feels as though I tipped backwards off a boat and hit the water back-first. Total dry-mouth.",
  "T0:30-2:30 Internal monologue is present but not exactly audible. Time stretching and short term memory loss sets in and Closed eye visual hallucinations including clouds changing directions instantaneously, pins and needles body-high, total clarity inside my head that doesn't translate very well in speech and behavior. I have to keep moving around to find comfortable positions. My kidneys feel like they're very warm. Any time I talk, I hear how ridiculous my words sound in comparison to my thoughts and try to acknowledge it to my companions (who are far less high than me), but get caught up in the laughing fits before I can finish my thoughts. My short term memory falters, and my vision shutters and trails in a way similar to 2nd plateau DXM trips. I'm ready to get out.",
  "T3:00 Fall asleep",
  "T 12:00 (next morning) wake up, feel pretty normal except my body feels lighter, more fluid, and everything strikes me as awesome. I usually wake up very tight and sore in my muscles, but not today. I feel energized. As part of my morning routine, I ingest 100mg of lamotrigine orally. A bit surprised at how long the high has lasted. My friends are completely sober. At this point, I believed I was just placebo-ing, but as the day goes on, I get more and more freaked out that I can't stop feeling stoned.",
  "T 16:00 Smoke another bowl of incense, headhunter brand. Take a nap with friend. Completely different body high this time, like warm pins and needles mixed with energy rushing in waves through my body. Also, I feel as though I'm spinning around the body of my nap-mate. She feels very good in my hands. I get very sexually aroused. We begin to fool around but my horniness goes away as quickly as it arrived. This would be embarrassing and awkward if we hadn't established our 'not responsible for what happens when high' thing before we did it.",
  "T 1:00:00 Feeling normal",
  "Throughout the next few days, I continue to slip in and out of grogginess and numbness in my body and I am extremely anxious that I have fucked something up terribly and permanantly in my brain. Called my doctor who said the synthetic cannabinoid and lamotrigine reacted badly and that I would have to wait about 5 days to feel better. This was attributed to the fact that JWH cannabinoids and lamotrigine are both sodium ion channel blockers, and have an analgesic (painkilling) effect. Now that I feel safe in knowing I'm not permanently fucked up, I can enjoy the ride. It was saturday afternoon when I last smoked and it is now tuesday afternoon and I have 36-72 hours left of being high to contend with.",
  "Legal notice: At the time of the submission of this article, the possession and use of herbal incense blends containing non-structually-similar synthetic cannabinoids was not regulated in the city and state that they were purchased or used in."
 ],
 "erowid": {
  "id": "87958",
  "citation": " John. \"Uncontrollably Long High: experience with Lamotrigine & Spice and Synthetic Cannabinoids (ID 87958)\". Erowid.org. Nov 9, 2010. erowid.org/exp/87958",
  "substance": "Lamotrigine & Spice and Synthetic Cannabinoids",
  "views": "11406"
 }
}
