{
 "title": "An Alien Abduction",
 "author": "The Guru",
 "citation": " The Guru. \"An Alien Abduction: experience with Salvia divinorum (10x Extract) (ID 13136)\". Erowid.org. May 3, 2007. erowid.org/exp/13136",
 "substance": "Salvia divinorum (10x Extract)",
 "bodyweight": "160 lb",
 "report": "<p>Intensity: Full blown with travel and OOBE</p><p>Level 5 I Immaterial Existence</p><p>12/7/01, 3:26pm-3:40pm</p><p>First off I wouild like to mention that I am 19 years of age and well researched and experiemted concerning psychoactives of all kinds.  I had smoked natural salvia leaf before but due to its low level effects I decided to buy some 10x extracted leaf.  I had two mind blowing experiences with the extract previosly to this one, but my reported experience is my third experiment in which I believe to be the most fascinating. </p><p>My previous experience with the potent Salvia extract proved unimaginable.  Made fully aware of the infinite intensity Salvia possessed, I decided to venture on another journey.  I once again sat myself on the bed and leaned my back against the wall.  I let my friend Dave stay in the room and sit in the chair by my computer. I proceeded to smoked the material down in about four inhalations.  Instantaneously I felt the presence.  The Salvia twist began.  There still remained that split second where I thought realty would continue.  Once the moment was over, reality ceased once again.</p><p>I was somehow propelled into an entirely different dimension.  A dimension alien to our own.  My soul was spinning wildly through the fabric of time and space.  Dimension to dimension I went with no control over my direction.   While captive in this state of psycho travel I was witnessing an infinite galaxy of alternate realities.  I was spun around on a sort of circular conveyor belt with dimensions flashing past in rectangular modules.  I truly felt that my entire essence was spinning around this alien-like apparatus and I could feel the stress it was placing on my mind, body, and spirit.</p><p>At one point I could see myself spinning around the apparatus as if I was separate from my physical frame.  This was most definitely an out of body experience.  Whilst this psychedelic mayhem was occurring all concepts of time, being human, and general reality became non existent.  Dimensions sped by and my soul turned inside out as the alternate world spun chaotically out of control.  A zipper like feeling was felt in this alter dimension as my body twisted around the apparatus.  The sensations I felt during this time cannot really be described as pleasurable.  The feeling was more as if my soul was tearing and straining, almost painfully.  The feelings that came over me were extremely foreign and very overwhelming.  I was consumed in every conceivable way by this alternate dimension.</p><p>All of the experience happened very quickly and within minutes I had spun out of the 3rd world just as fast as I had arrived.  Once again the reality of earth and being alive, seemed to spiral back into place.  My dorm room returned to its sober state and Dave was recognized.  I had reverted back to my normal state of being and remember asking myself Where am I?  Oh yeah!  Thats Dave and my room.damn Im back!  I got this very strange notion that I had been gone for awhile, and I couldnt initially remember my past human existence.  It felt as if my soul had been shot into another galaxy only to be shot back to earth culminating in an intense round trip!  Reality made itself felt as I began comprehending my surroundings.</p><p>I felt an altered perception for an additional 6-10 minutes in which I was extremely confused regarding what had happened to me.  Following the experience I came to an interesting revalation.  The powers that chemically reside within our own brain are far more extraordinary than we could ever soberly imagine!  I say this because after having experienced Salvias intoxication, I now understand that the Salvia couldnt possibly have been fully responsible for the utter craziness that occurred within my own  mind.  The psychoactive properties need something to act upon; what they act upon is our minds, bodies and souls.  Without the chemical reactions that take place in our own bodies, the psychoactives would be nothing more than plants, powders, liquids, and gases.  If this is so, then would it be arrogant to think that the mixture of matter that constitutes us doesnt play a role in the fantastic consciousnesss unveiled by psychoactive chemicals?  The answer is no.</p>",
 "year": "2001",
 "id": "13136",
 "gender": "Male",
 "timestamp": "2007-05-03T07:00:00.000Z",
 "views": "3016",
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
