{
 "title": "Peace in the Valley",
 "author": "The Miles Away Girl",
 "citation": " The Miles Away Girl. \"Peace in the Valley: experience with Codeine (ID 13158)\". Erowid.org. Feb 15, 2005. erowid.org/exp/13158",
 "substance": "Codeine",
 "bodyweight": "44 kg",
 "header": [
  "DOSE:",
  "250 mg",
  "oral",
  "Codeine",
  "(extract)",
  "",
  "60 mg",
  "oral",
  "Codeine",
  "(liquid)"
 ],
 "report": "<p>I'd had a rather stressful week so I decided that I'd take some codeine to help me relax. As my parents were going out for the night I had the perfect opportunity to do this.</p><p>16:30-20:30 I went to the local chemist and bought a pack of 32 Co-Codamol (500mg acetaminophen/paracetamol with 8mg codeine & NO caffeine) and used the extraction technique mentioned in the FAQ. Once I'd done this I added 60ml of 'Pholcodeine' (a cough mixture that contains codeine phosphate & no other active ingredients) to make up for what I'd lost during the extraction and to make the mixture taste better. I then made myself a 'bed' on the floor of my living room.</p><p>20:30 I drank the mixture each time holding it in my mouth for approx 20 seconds before swallowing to help it to come on faster.</p><p>20:35 I began to feel the warmth, euphoria & relaxation that I normally get when taking opiates.</p><p>20:45 The itching that I normally get when taking codeine began. I normally find that if I ignore the itching it goes away within a few minutes but if I start scratching it I will continue to itch until the peak effects begin to fade.</p><p>21:00 By this time I could hardly feel the rest of my body and the other effects peaked at around this time. Also the itching no longer bothered me.</p><p>21:30 I watched 'Black Books' and I noticed that I found it far funnier that normal and the picture seemed brighter & sharper.</p><p>21:45 As the peak effects began to subside I drank a further 100ml of the cough medicine. Over the next few minutes the euphoria became more intense that after my initial dose.</p><p>22:15 I eventually (when on opiates I can never be bothered to do anything apart from laying back and doing nothing) got up to put some relaxing music on. Alabama 3s 'Peace in the valley' seemed particularly appropriate as I now felt at peace with myself whereas a few hours earlier I wanted to scream at everyone who even held up my journey home by a few seconds. I also felt as though I was away from the things I hate (like a valley is isolated from the surrounding world).</p><p>23:00 I tidied the house up before my parents came home and found out what I'd been doing. Then I took the rest of the cough medicine (approx. 50ml) and went to bed.</p><p>01:00 My parents came home so I pretended to be asleep so they wouldn't catch on to what I'd been doing. I must've fallen asleep shortly after, as I cant remember much after my parents came home.</p><p>10:30 I woke up feeling blissed out.</p><p>In conclusion this was one of the best trips I'd had on codeine, as I didn't feel any nausea, which is quite abnormal for me. I guess this was because I was laid down or that I had gotten used to it.</p>",
 "year": "2001",
 "id": "13158",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-02-15T08:00:00.000Z",
 "views": "76642",
 "dose": {}
}
