{
 "id": 13156,
 "title": "Nitrous, hold the Oxide",
 "date": {
  "submission": "2003-12-05T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Komrade",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [],
 "report": [
  "An inadvertent and somewhat unsettling experience today...",
  "I work in a low temperature physics lab and most of my experiments involve the use of cryogenic fluids (ie: liquid nitrogen & liquid helium).  Now, to fill my cryostat with LiqN2, I simply attach a short hose and a funnel on a stand and pour it in.  The last little bit seems to like to stay in the funnel bottom and (as impatient as I am) I decided to close the vents to the nitrogen chamber and suck on the vaccuum hose to pull the last of it through the funnel.",
  "I realized, of course that this meant I would be getting no oxygen for a breath or two, but I figured I can hold my breath under water for some time, so a few quick breaths should have no effect. (Keep in mind, getting screwed up was not my plan, here)",
  "Well, (duh) holding one's breath under water means holding a reservoir of air (and oxygen) while having a lungful of pure nitrogen means one has no oxygen at all.  So, after two quick huffs, my funnel was empty, but I all of a sudden felt a bit dizzy and noticed my lips mere starting to turn blue.   A good deep breath of air or two started to bring me back, but not before noticing the characteristic wash of 'mwow, mwow Mwow MWOW...' and other lightheaded somatic effects that I immediately associate with Nitrous Oxide!  The only thing missing was the giddyness....hmmmm",
  "My conclusion, especially after reading the lone report of someone experiencing 'psychedelic' effects sim]milar to nitrous from inhaling Argon gas (which is chemically inert, even more so than nitrogen and whose only function could be to displace oxygen) is that a good deal of the effects I thought were being produced by nitrous oxide were in fact symptoms of OXYGEN DEPRIVATION! ",
  "This is not to say that nitrous does not produce additional effects (or it would not be used by dentists as an anaesthetic) but that a suprising amount of the trip of inhaling pure nitrous (as is done recreationally) is simply the brain starving for oxygen.",
  "So be aware folks; nitrous is fun sometimes, but make sure billy upstairs gets his oxygen too.  Try to take a bit of air with your N2O or at very least try to hyperventilate a few times before taking the balloon.  Hyperventilating will temporarily charge your blood with a little more oxygen than normal...but not a lot, and not for long.  And don't get addicted to the stuff, it's WAY too easy!",
  "Peace all,",
  "Komrade"
 ],
 "erowid": {
  "id": "8817",
  "citation": " Komrade. \"Nitrous, hold the Oxide: experience with Nitrogen Gas (ID 8817)\". Erowid.org. Dec 5, 2003. erowid.org/exp/8817",
  "substance": "Nitrogen Gas",
  "views": "10443"
 }
}
