{
 "id": 13155,
 "title": "Far Beyond Driven",
 "date": {
  "submission": "2004-05-18T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "nebulo",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Methamphetamine"
  },
  {
   "time": "0",
   "amount": "T+ 3:00",
   "administration": "4.5 g",
   "substance": "oral"
  },
  {
   "time": "Mushrooms - P. cubensis",
   "amount": "(dried)",
   "administration": "T+ 3:30",
   "substance": "1 cig."
  },
  {
   "time": "smoked",
   "amount": "Tobacco - Cigarettes",
   "administration": "",
   "substance": ""
  },
  {
   "time": "0",
   "amount": "smoked",
   "administration": "Tobacco - Cigarettes",
   "substance": ""
  }
 ],
 "report": [
  "Being raised to have an open mind in most fields, I have tried many things that others will not dare to do.  I have done DMT on more than one occasion and I have tripped on acid more than I am willing or proud to say.  I have been around people tripping on shrooms and always wanted to try it, although the ability to get ahold of this masterpiece was always just out of reach.  I live in the washington dc area and am usually aware of the entheogens going around.  Shrooms are rare in fact, that i had been considering growing some myself. But luck was with me during the week of august 16th when i came in contact with a fairly fresh batch of P.cubensis. ",
  "An associate of mine (who i'll call A.) called and told me that he may have found what i have been searching for.  At first i didnt know what he was talking about because at the time i was waiting for a call from another friend of mine for some bottles of K because i was down to my last few twenty bags.  Then he mentioned something about fungus, and right away i felt a chill go up my spine.  A. told me to meet him in about two hours in our usual spot.  These were the longest two hours of my entire life.  Or so i thought...",
  "Our usual spot is the best location i have found around my area to chill for any illegal purpose.  I have never once seen anyone from the other side of the spectrum within miles of our cabin.  A friend of mine, JR,from out of town was visiting me and decided to go with me as i knew A. well enough to be sure that he wouldnt get sketchy over it. I have never been so wrong.  He showed up by himself and when he arrived he got out of his car and came inside.  He called me into the other room and started arguing with me about my friend being there.  Im guessing part of the reason was that he was glassed out of his mind and the other was that my friend looks so old.  I was eventually able to talk him down to reason after i introduced my friend to him, and my friend said the right things (my friend has been involved in many drug-related events over the years and knew exactly what A. wanted to hear).",
  "After a few minutes of smoking crystal A. busted out the most beautiful bag i have ever seen in my entire life.  Just looking at it made me want to eat the entire bag.  I had a slight crystal buzz now and could no longer contain my excitement.  A. saw my joy and laughed.  I knew what he was laughing at before he even did it. I was so happy i didnt care.  I felt like a little kid at a candy store.  I have heard so many good things about shrooms that i didnt care about containing myself.  I began screaming with joy.  JR had to bring me back down to reality...only to be released into fantasy again in a few hours.  We bought the shrooms and after a little more crystal i said i had to go.  I couldnt wait to get home!  A. knew this, and after thanking him we took off. ",
  "I have never always been a careful driver, especially when there are illegal substances in the car, but on the ride home i didnt go one mph over the speed limit.  WE MADE IT!!! As soon as we went in the house i went upstairs to tell my mom not to bother us for the rest of the night.  Upon asking why i told her and she understood.  I know that many people believe that parents who allow their kids to mess in drugs ruin their lives.  I too believe this, but in my case it doesnt matter.  My mom never introduced me to anything, and didnt know i was into anything until about a year ago, when i told her.  She was cool with it, because i am old enough me make my own decisions and i am of legal age to move out if i wanted to, and she doesnt want that to happen.  In fact as long as i am going to school and getting good grades, which i am, she basically says i can do what i want without interference from her...ANYWAYS...",
  "I opened up the bag and looked in at the dried half we had just purchased.  Since JR was my guest i paid for them all, as he returns the favor when i visit him.  Knowing the proper dosage, i decided that i would eat a little more than an eighth.  JR said he wanted to start out at an eighth.  I measured out an eighth and added about three more caps and five more stems.  JR ate a straight eighth.  He didnt complain about the taste, so i decided to dig in.  I have heard so many bad things about the taste that at first i was scared to eat them, fearing vomitting.  The taste was perhaps the most pleasant taste i have ever been in contact with.",
  "Just as i finished the bag i weighed-0utoffthe phone rang, it was K.  I told her what was going on and she came over with a few bottles.  She only lived down the street and was over at my house shortly before anything began to effect me.   She gave me the bottles and said she had to go, but wanted me to sell her an eighth. I said sure as she did me the favor of coming to me, instead of me going to her for the K.  It had been about 15 minutes since i first indulged myself, and i began to feel woosy.  I would compare the first feelings to an acid body trip, without the light-headedness. I asked JR if he was feeling anything and he said yes, but no visuals. ",
  "I began to get my first visuals a few minutes after i started getting the body feeling.  I went outside to smoke a cigarette and JR accompanied me.  He was wearing a brightly colored hawaiian shirt with flowers all over it.  The flowers were getting very bright and   seemed to stand out of the shirt.  We were on the back deck now.  On the deck we have a nome ornament and a table with a striped umbrella on it.  The strips on the umbrella were now dancing with excitement, similar to the pattern of an lsd trip.  It had been about twenty minutes to a half an hour when i finished the cig and we decided to go inside. ",
  "It felt as if my head to be very heavy and was wobbling when i walked.  I found it hard to stand, as i had a very bad case of anxiety.  We went inside and decided to watch TV.  Upon entering the house i noticed inantimate objects shifting in my peripheral vision.  Although nothing in my general visionary field was moving, i began to notice everything had an outline of white light-like material around it.  I have read about shrooming and one thing i have read is the ability to notice the energies that everything on earth and in the universe, for that matter, contain.  I wrote this white light-like substance off as being the energy that is normally beyond the capability of human visionary range.  ",
  "We sat down in front of the TV and i began to lunch out.  I was laughing uncontrollably at everything on the television.  We were watching The Daily Show with Jon Stewart when my first actual hallucination occured.  Jons hair began to mutate into what looked to be spider webs.  There was a distinct pattern from which this was happening by.  At this point into my trip i was noticing everything moving around the same way it does with very strong acid.  I decided that if this was all that was going to happen i would be satisfied.  I am pleased to say that my decision was exceeded. ",
  "Still watching tv and laughing i began to notice small waves of color in my vision field.  They seemed like strings jolting horizontally from left to right inside my eyes.  I could see them now everywhere i turned my head.  Everything in all parts of my vision were now moving and not all of them were following patterns.  Some would move randomly in and out and others seemed to be dancing to their own beat.  The energy i first saw was now stronger than ever around every object.  I felt very drunk and i dont think i could have stood up at this point if i wanted to.  Jon Stewart's voice was now changing.  Sometimes it would be very deep and others sounded like mickey mouse.  All sounds were now echoing and everysound that came out of the tv was followed by waves of color.  I percieved that i was actually seeing sound waves instead of hearing them. ",
  "The strings of color that i first saw was now more of a grid in my field of vision.  Both vertically and horizontally this grid pattern was everywhere.  Looking up at the clock, i was in total awe to notice that the hands of the clock were weaving in and out of themselves turning every color of the rainbow.  They too followed a patter. I could not tell which was the hour and which was the minute hand because both were about the same length interweaving.  When one would turn red for instance the other would turn blue, and when the red turned to orange the blue turned to purple.  They followed this pattern perfectly and i watched this phenomina for what must have been minutes. ",
  "After watching the clock, i looked over at JR.  His face was morphing into different people.  Anyone i was thinking of at the minute his face would morph into.  I specifically remember looking at Paulie Shore at one point and my father at another.  He looked over at me and said something along the lines of 'this is intense' although i couldnt be sure because my audio perception was now distorted beyond recognizable interpretation.  I think at that point i agreed and asked him if he cared to join me for a cig. ",
  "What happened next was greater than anything i have ever seen.  I have even thought about wanting to find a hallucinogen that would do this many times before.  I saw his lips move so say 'sure...', but instead of hearing it i actually saw the word come out of his mouth.  The 'S' was purple and the rest of the letters were irredescent.  I was shocked beyond the point of talking and decided just to start walking outside, and keep this experience to myself, and not tell him.  We walked for what seemed to be hours just to get to the door that was not more than fifteen feet away.  On the way to door i was hearing voices from outside that were saying my name. ",
  "Thinking back on it now, i dont know why this didnt scare me enough to stay inside, but i guess i wanted to find out who exactly was outside.  I got to the door and looked down to grab the handle, only to see my hand was no longer my hand but instead had only four fingers and seemed to be the hand of none other than bart simpson.  I busted out laughing and was unable to open the door because i was laughing so hard.  JR must have opened the door, because the next thing i remember we were on the back deck smoking a cig.  Everytime i exhaled the smoke it spelled something out.  Sometimes it said what i was thinking and others it was saying what JR must have been thinking.  I closed my eyes and tilted my head back. ",
  "Inside my closed eyelids i had the most intense CEV's i have ever experienced, even from DMT.  Beautiful kaleidiscope patterns were turning in and out, back and forth from one side of my mind to the other.  More than once the patterns took shape to form anything from scooby doo to an airplane.  When i opened my eyes(at least i think i did) i was in a different universe.  JR was no longer JR but what looked like an angel.  He was glowing white and transparent, though he was still in his same form.  I could no longer speak only send messages to JR with my mind.  It was shocking how he answered everything i said.  Only instead of speaking i could read his thoughts back.  I have heard of others having similar experiences on Peyote and other forms of Mescaline, but when one has this happen to there own self, the feeling is beyond words.  I will never forget this event, and i am sure i will tell many more stories involving this strange phenomia. ",
  "It now must have been hours since we first opened this magical portal and still i was seeing and hearing and mentally receiving more than i have ever experienced with all hallucinogens i have ever done combined.  Walking back into the house the door was no longer a door, and what happened next i cannot fully explain(as with most that has happened).  Instead of a door, a redish portal was standing where the door once was.  I looked over at JR who was morphing between cartoon and angel like form, and mentally asked him if we should go in.  His answer was spoken this time 'yes' only spelled out like before.  Somehow i walked through what should have been a closed door and ended up sitting back in my favorite chair watching tv.  I would estimate that half of everything in my field of view was either a cartoon or from a mystical land of dragons and warlocks. ",
  "This continued for a time which i would estimate three hours, never once talking or moving just enjoying the drug for what it was.  We decided to turn the lights off and get into bed as we now had more than a brain full of thoughts and intuitions to reevaluate.  As soon as the lights went out everything stopped.  The feeling in my body and head, and the visuals both audiotory and visually.  Everything returned after about two seconds, but for those two seconds i felt so scared they would not return, then beyond relief when they finally did.   ",
  "I closed my eyes and thoughts as well as patterns were running through my head.  I opened my eyes a few times and fan in my room was glowing much like JR did outside.  Everytime i looked at the ceiling fan it dropped to the floor then was pulled back up by what seemed like an irredescent cord being pulled by a god.  Eventually the feelings left my body and i dosed off.  I remember the dreams i have exactly as they occured.  Some of them were me in a future point in my life, going through an event that was likly to happen and i am more than positive will.",
  "The next day I awoke feeling somewhat groggy and somewhat refreshed.  I never got sick, and JR never did either.  We spent about three hours discussing what happened, and neither of us could come to a conclusion.  We both still feel that we experienced what it is like to be a god or what it is like to be dead.  If either is true i can only hope to die soon =P  I am not worried though as A. said he is getting into these now and in no time will have them constantly.  If you are lucky enough to find this true food of the gods, i suggest taking advantage of it as soon as possible.  Remember that everything happens for a reason and nothing is coincidental.  If you are thinking about doing them for your first time i highly recommend it and wish spiritual protection with all that you do."
 ],
 "erowid": {
  "id": "8816",
  "citation": " nebulo. \"Far Beyond Driven: experience with Mushrooms - P. cubensis (ID 8816)\". Erowid.org. May 18, 2004. erowid.org/exp/8816",
  "substance": "Mushrooms - P. cubensis",
  "views": "5042"
 }
}
