{
 "id": 13164,
 "title": "How Much Is Enough and Is It What You Think",
 "date": {
  "submission": "2011-02-15T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "The Bumblepuppy",
  "gender": "Male",
  "weight": "78 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:00",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  },
  {
   "time": " T+ 0:00",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "Found that I'd ordered 1g of 5 Meo DALT after a few beers late one night when the postman knocked with a jiffy bag. 1g of white needle like crystals. Having read about dose descrepancies decided to start small. After a tiny amount had no bad allergy response weighed out 10mg. Nothing of note. Next night had some mates round for a fireworks party. Had a few beers and some weed. After every one was winding down I took 20mg followed by another 20mg about an hour later. Slight stimulation similar maybe to a very small amount of MDMA. Thought maybe this lack of effect could be down to the 10mg the previous evening. Decided to wait a week and have another go.",
  "So 6pm took 30mg. washed down with a beer.",
  "7pm After an hour no particular effect. Took another 30mg.",
  "8pm Waiting for a curry to arrive (I still had appetite for food which was unexpected) I feel a bit trippy. Thoughts move quickly but all well under control. It's like it's about to come on strong. Felt a little nervous about how intense it might get. Will I keep it together by the time he comes? Edge of vision slightly wobbly, trails when moving hands about. Things don't get any weirder. Guy comes to door and was dealt with easily.",
  "Ate masses of Indian food. Best I've had for ages. Was it? or did the 5 Meo DALT enhance my enjoyment of it? I don't know.",
  "Tried to watch a bit of TV. Nothing worth watching. Faces seem a bit out of proportion and colour contrast seems a bit heightened.",
  "That's about it. It faded off about 1030ish. 4.5 hours after first dose, 3.5 hours after second. Felt pleasantly wasted throughout the experience.",
  "So was this 5 Meo DALT?? There's some similarities with reports of others. But the dosage seems a bit different. But maybe it's just my head needs a bit more to notice it. And I did drink a couple of beers and smoked a few joints as well.",
  "Not good but not bad. Caution with dosages out there though!!"
 ],
 "erowid": {
  "id": "88239",
  "citation": " The Bumblepuppy. \"How Much Is Enough and Is It What You Think: experience with 5-MeO-DALT (ID 88239)\". Erowid.org. Feb 15, 2011. erowid.org/exp/88239",
  "substance": "5-MeO-DALT",
  "views": "10082"
 }
}
