{
 "title": "I Was Shpongled",
 "author": "trancehippie",
 "citation": " trancehippie. \"I Was Shpongled: experience with Alcohol, LSD, Cannabis & MDA (ID 13178)\". Erowid.org. Jun 30, 2005. erowid.org/exp/13178",
 "substance": "Alcohol, LSD, Cannabis & MDA",
 "bodyweight": "135 lb",
 "report": "<p>The night began when my girlfriend and I were at a local club.  We had a few beers, then decided we'd go home, take some acid, and return to the club.  Upon returning home, we each took a hit of (apparently) some very strong acid.  The most I've done before was 4 hits of pretty strong acid, but this one hit outdoes that by far, but we'll get to that later.</p><p>So my girlfriend and I after having consumed our hits, decided to watch a little TV, and get some rest while waiting for our trip to begin. The onset was pretty slow, roughly an hour or so for noticeable effects (I've had trips start in about 15 min before). After the effects really started to begin, we got into our usual 'giggly' mindset of acid, where everything seems so new, and we feel quite mischievous.</p><p>This continued on for a while or so, until my girlfriend and I noticed that we were continuing to get higher, approximately 2 hours after we had taken our acid, and at a rapid rate.  It's at this point that we smoked some marijuana, just because we were a bit apprehensive at such a long yet rapid continuing come up.  The weed did nothing to slow us down though, and we just continued to get higher and higher.  For an example of how high we really were...I was able to move my hand in a circle, to create a tracer, then I was able to hit that tracer, and have it glide down my vision.  I was also able to close my eyes for a visual, then grab my head, pull that visual out of my head, and throw it into reality. I also saw my ceiling turn into a black hole, whereupon everything was ever so slightly being sucked into it, in a blurry way, such that everything existed where it was, but it was also being sucked into the black hole at the same time.  I also received tactile hallucinations, I began to feel as though I was floating towards it for a moment. It was all getting just a bit overwhelming for us though, and we decided to change rooms.</p><p>It's at this point, that things really started to change. Moving into another room just increased our coming up even more, and this is roughly 3 hrs into the trip.  I remember that at one point, all my senses formed into one sense, or consciousness, however there is no word to express what it was (I'm sure those of you that do acid frequently know what it's like to have a feeling and no word to express it), my eyes saw the same thing open as closed, which would have just been color, in a way; my ears constantly heard a low droning sound, and I couldn't feel how I was oriented in space.  If I THOUGHT of a word, I would hear it, only broken up, (ex. wo wo wo wo wo wo wo wo wo rd rd rd rd rd rd).  I also felt quite disconnected from my body.  There was also this feeling that all this sensory information I was getting, was also judging me in a way, it was painful, but also relieving in that it was cleansing in a sense.  It also felt as though we were trying to receive all the information that could possibly exist, at one time, and our minds weren't able to handle it all.  We had it together psychologically the whole time though.</p><p>My girlfriend and I endured for what we figure was about 3 hrs of this, and eventually, we decided enough was enough.  At this point we took a cap of MDA each and waited.  At about the time we took the MDA, to one hour after that, we basically have no memory.  When our thoughts returned to us, and we began to feel the gentle warming sensation of MDA in our bodies, we were lying huddled on our bathroom floor.  As it really started to kick in, things became brighter, clearer, and my mind was again able to think.  We sat and discussed the 'trip' we had just been through, and we came to the conclusion that very few people have been there.  We weren't sure what 'there' really was, we were happy we weren't 'there' anymore, yet, it wasn't a bad trip.  Never once was I overpowered by bad thoughts, the fact of it is, the sheer volume of sensory information prohibited me from having thoughts at all. It was the feeling of being absolutely overwhelmed and completely vulnerable. However at some points, I received quite a rush when I felt like I could funnel the 'energy' of the trip through me, and I was able to function, but I could only do that for so long, before I lied back down and stared into space.</p><p>So, I'm not too sure as how to rate it as being good or bad, I'm happy I've been there, but I'm also happy I'm not there now.  In the end, it feels almost like a rite of passage for trippers.</p>",
 "year": "2002",
 "id": "13178",
 "gender": "Male",
 "timestamp": "2005-06-30T07:00:00.000Z",
 "views": "10167",
 "dose": {
  "0": {
   "time": "DOSE: T+ 0:00",
   "amount": "2 ",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  "1": {
   "time": " T+ 1:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  },
  "2": {
   "time": " T+ 3:00",
   "amount": "0.5 g",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  },
  "3": {
   "time": " T+ 6:00",
   "amount": "1.5 capsls",
   "administration": "oral",
   "substance": "MDA",
   "form": "(capsule)"
  }
 }
}
