{
 "title": "Cough Syrup Addiction?? How embarrasing!",
 "author": "RaverBrite",
 "citation": " RaverBrite. \"Cough Syrup Addiction?? How embarrasing!: experience with DXM (ID 1317)\". Erowid.org. May 6, 2001. erowid.org/exp/1317",
 "substance": "DXM",
 "bodyweight": "200 lb",
 "report": "<p>The first time I tried DXM, I was at work. I had been partying all night, and I needed something to pick me up, and caffeine wasn't doing the trick. I had heard through friends that Robitussin could make you trip, and I was really curious. So during my break I grabbed a bottle of Robitussin DM Max Strength.</p><p>Following the initial experience, I wasn't too impressed. I hadn't taken more than half, and the taste was quite nauseating. But for some reason I was on the quest to do more. I began taking it on weekends, when there was nothing to do, and on days I had off, for fun. I grew to like the Robo Trip. Until my friends found out.</p><p>I was under constant scrutiny, because they were sure I was reaching addiction. For a period of 3 months, DXM was all I did, despite what anyone said. But I had an awful experience that prompted me to stop, cold turkey.</p><p>I was at a friends house one night, and we were lounging around, the guy I have liked forever was there, and we got on the subject of the Robo Trip. It got me thinking about the bottle that was in my purse, and I excused myself, went to the bathroom and drank the whole bottle. When I returned, T asked me what I did. My best friend looked at me, and said 'she just drank a bottle'. T was amazed that I carried it around with me, so he went to the bathroom, and grabbed another bottle, and coaxed me to drink it.</p><p>In an hour, he decided to take us out, and I was tripping pretty hard. His car was stuck in snow, and I had to help push it out. I started to go catatonic. They were so worried about me, and I desperately wished to tell them I was okay, I had auditory hallucinations as well as visual, swirling in my head, and I wasn't really in a talking mood.</p><p>I came to realize so many things that night, I cried myself to sleep. The worst thing of all was the depression seeping in, uninvited. I was upset for days afterwards.</p><p>T convinced me not to do it anymore, because he did not like the person I had become because of it, and truthfully, neither did I.</p><p>So kids, if you're looking for a way to get your kicks, stay with the tried and true standard--Marijuana.</p>",
 "year": "2000",
 "id": "1317",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2001-05-06T07:00:00.000Z",
 "views": "35857",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "700 mg",
   "administration": "oral",
   "substance": "DXM",
   "form": "(liquid)"
  }
 }
}
