{
 "title": "Heaven on Earth",
 "author": "Brian",
 "citation": " Brian. \"Heaven on Earth: experience with Cacti (T. pachanoi) & Ketamine (ID 13173)\". Erowid.org. Jul 14, 2002. erowid.org/exp/13173",
 "substance": "Cacti (T. pachanoi) & Ketamine",
 "bodyweight": "160 lb",
 "report": "<p>Psychadelics have always been my favorite class, mostly for the visuals, but also for the mind-expanding journey included in the experience.  Mescaline is by far better than anything else I've tried, surpassing mushrooms, acid, 2C-T-7, and even ecstacy.  It is intense yet without a loss of control, extremely powerful yet somehow smooth, something to be revered and respected, reserved for a special experience and not to be taken lightly. </p><p>I began preparing two 7' San Pedro cacti cuttings, each about 2' in diameter, by first removing the spines.  I then cut the cacti lengthwise, removed the small inner core, and continued to chop the cacti into small pieces, leaving them to air dry for a couple of days (still pretty moist).  When the time came, I put them all in a pot, covered them with a little water and began to boil.  I simmered for a half hour or so, mashing the cactus every few minutes with a potato masher to squeeze the juice out.  I then drained the liquid, set it aside, and boiled the remaining cactus down with fresh water.  I again drained the liquid, mixing it with the previous liquid and repeated this process until there was very little sap extracted during the boiling process, about five times in all.  When I was finished, I had about four cups of liquid. (I wound up eating the leftover cactus mash for breakfast the next morning).</p><p>I drank half of the liquid at 10:30 pm, waited 45 minutes, then drank the other half.  Though it was a little bitter, it really didn't taste bad at all, nothing like some of the reports I have read.  No nausea at all.  I met up with a group of friends (I was the only one using the cactus) and went out to a club. </p><p>I began to feel the effects around 12:00, which began to get stronger and stronger over the next two hours, leading to an incredible, amazing high which lasted for about seven  or eight solid hours, then gradually fading out over the course of the next day.  Throughout the duration of the trip I snorted about a half gram of K, but found that with too much at one time I lost control of reality and got a little overwhelmed.  Though I normally like the experience of going into a K-hole, it is little bit too much in a public setting, especially in combination with the mescaline.</p><p>The high was unlike any other experience I've had.  It gave me immense amounts of energy, amazing visual experiences without a loss of a sense of reality (except at a point or two when I had too much K), and a sense of wholeness, completeness, and total peace with the universe and my creator.  I feel like I somehow tapped into my 'true self' and came out of the experience stronger and ready to face the world in new ways. </p><p>Toward the end of the trip I enjoyed spending some time by myself to ponder life and to mellow out, and wound up taking a rainy-day walk in the park to look at the tree blossoms and welcome in the springtime.</p>",
 "year": "2002",
 "id": "13173",
 "gender": "Male",
 "timestamp": "2002-07-14T07:00:00.000Z",
 "views": "10378",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "14 in",
   "administration": "oral",
   "substance": "Cacti - T. pachanoi",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "insufflated",
   "substance": "Ketamine",
   "form": "(powder / crystals)"
  }
 }
}
