{
 "id": 13188,
 "title": "A Renewed Sense of Life Through Intense Fear",
 "date": {
  "submission": "2004-03-17T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "pgirl",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "0.125 oz",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  }
 ],
 "report": [
  "I went out into the woods nearby a secluded beach area and ate a little more than an eight ounce of mushrooms. This was my second experience with mushrooms. I decided to do this alone because I felt like I needed an intense experience to raise my awareness of life. This experience ended up being more than anything I could have imagined and here is the story.",
  "I ate some mushrooms out in the woods a few weeks ago. It was a pretty intense experience and I never wrote anything down about it. I feel like I'll remember it forever in some form, but I'm losing the words I had used to recount it before. I talked to god when I was out there in the woods, surrounded by darkness and fireflies and some frightfully screaming animal. Actually I never even used the word god, that night. I think I was talking to myself and my own version of god at the same time. As to who was talking back, that is up in the air still. After ingestion, I remember feeling anxiety at first, as the light began to dim. I knew that there was doom pending, just waiting for my guard to come down. I knew what I was getting myself into when I deliberately walked about 500 feet off the path to a circle of trees where I could look up and see the sky. I knew that I would feel that intense fear out there. It was what I was going for. The light was gone in a flash. It only took one second for it to cease to exist and that was it. It was okay at first, because I could still hear the sounds of humans, motorboats, laughing, music, cars.",
  "But then as I fell farther and farther into the mushrooms, and farther and farther into the night, the fear took hold. There was no slow transition from anxiety to fear, it just sort of took over every orifice of my body all of a sudden, or so it seemed... I screamed in my brain 'why are you doing this to me' over and over again, intermixing with an 'I'm so scared' and  a 'please help me'. My reasonability left my brain and all I had left was the present situation.  I heard an animal screaming, circling me, angry that I had inhabited its area for the night. I felt intense loneliness and and unbelievable fear that I've never ever felt before. I didn't know what was happening and I couldn't see a single thing. There were no stars to be seen and not even a glimmer of light from the moon. I kept asking my question over and over again, to no one in particular, maybe. Then reason came into view. I heard something (myself?) say 'you knew this was going to happen' and 'why did you do this'. Over and over calming my mind. Then I felt the intense loneliness. I asked for someone to be sent to me. I kept saying that I didn't want to be alone anymore. I cried and choked and whimpered.",
  "And then I saw the fireflies. A firefly in front of me floated up around and circled above me. And I felt a rush of warm air and I felt calm for a split second. Then that animal started screaming at me again and the fear was back. I tried to get up because I felt I needed to get back to my car, but my legs wouldn't move. I kept falling down and that animal kept screaming. I felt panicked and I felt like I needed to protect myself, not from the animal, but from something I just couldn't figure out. So I knelt on the ground and tucked my head under my body and put my hands over my head. It was the position that I learned to use if a bear ever tried to attack. I started wimpering and saying please help me please help me. I was getting really exhausted, physically, mentally, and emotionally. The animal finally stopped and I didn't hear it for a while so I tried to lay down and sleep for a bit. Of course this didn't work, it was cold and I was still fearful, although not quite as intensely scared as before. I lay there for a bit, regained some strength of mind, and finally decided to start moving.",
  "I got onto my feet and started moving them in a walking motion, but it was very hard. There was a lot of brush and I couldn't see anything at all, so I was stumbling. I layed down and rested every few feet. Each time I got up I  moved a little farther. Finally my strength came back and I was determined and strong again. The fear was completely gone. I felt warm again and ridded myself of the towel over my shoulders. I pushed through prickers and branches, got scratched and bloody from the mess I was moving through. It was rough going but every branch I pushed aside, every wall of brush I made my way through made me stronger and I moved faster as a result. I heard the sounds of the waves crashing on the beach and angled my direction toward it. Finally the path came into view and I followed it for a short distance. The sky broke out all around me and every single star was visible to me, an amazing dichotomy to the intense darkness I had just felt throughout my body and the lack of sight in the woods. I felt a rush of the warm night air pass through my body and I stumbled out of the woods and just breathed. I choked up and went to a bench to sit and watch the night.",
  "I felt so overwhelmed with intense feelings for the next week or so. I felt incredibly alive and completely satisfied. I survived! Now I would like to feel that again."
 ],
 "erowid": {
  "id": "8837",
  "citation": " pgirl. \"A Renewed Sense of Life Through Intense Fear: experience with Mushrooms (ID 8837)\". Erowid.org. Mar 17, 2004. erowid.org/exp/8837",
  "substance": "Mushrooms",
  "views": "6123"
 }
}
