{
 "id": 13198,
 "title": "Through the Tube",
 "date": {
  "submission": "2004-05-12T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "D Sage",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1.0",
    "unit": "g"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  }
 ],
 "report": [
  "This was my first experience with Salvia Divinorum and I had done several days worth of research before trying it. When I received the dried leaves I waited until dark and then instructed my sitter to be as quite as possible. I sat in front of our sliding glass door and proceeded to take two huge puffs from my Proto Pipe. The smoke was extremely hot as I expected and I held the two hits for about 20-30 seconds each. I exhaled and loaded the pipe again, but began to feel its effects.  I had the feeling of being alone, similar to how I have felt during the onset of mushrooms and LSD. I puffed two more times holding each the same length of time as before. I went to shut the sliding door and notice a change in perspective. It is like the feeling I get when smoking pot, but without the euphoria. I laid back onto the floor where I had placed a pillow for my head. I began to feel the heat surround the places on my body that were in contact with the floor. ",
  "I closed my eyes and tried to offer myself to the 'Goddess'. It took only a few seconds before I realized the signature pull to my left. It felt as if I were made of liquid and I was being pulled horizontally through a tube or drain. The feeling was amazing and I only wished it would have gotten stronger and pulled me into the other worlds I had read about. I was dissappointed when I heard the 'meow' of my cats and opened my eyes to find then all around my head wondering what I was doing on the floor. I must admit, there is no way to truely appreciate this plant if you are disturbed by any outside stimulus. I have set up another journey to take place in the mountains of Colorado within the next few weeks. I look forward to seeing the power behind this plant and to have it teach me more about my place in the universe."
 ],
 "erowid": {
  "id": "8847",
  "citation": " D Sage. \"Through the Tube: experience with Salvia divinorum (ID 8847)\". Erowid.org. May 12, 2004. erowid.org/exp/8847",
  "substance": "Salvia divinorum",
  "views": "4886"
 }
}
