{
 "id": 13212,
 "title": "Mellow Moxy Buzz Isn't So Mellow with K",
 "date": {
  "submission": "2011-02-02T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "troy a.",
  "gender": "Male",
  "weight": "140 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1/2 g",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "0",
   "amount": " T+ 0:30",
   "administration": "20 mg",
   "substance": "sublingual"
  },
  {
   "time": "5-MeO-MIPT",
   "amount": "(powder / crystals)",
   "administration": " T+ 2:00",
   "substance": "1/2 g"
  },
  {
   "time": "smoked",
   "amount": "Cannabis",
   "administration": "",
   "substance": " T+ 2:20"
  },
  {
   "time": "1/2 g",
   "amount": "smoked",
   "administration": "Cannabis",
   "substance": ""
  },
  {
   "time": " T+ 2:50",
   "amount": "100 mg",
   "administration": "insufflated",
   "substance": "Ketamine"
  },
  {
   "time": "(powder / crystals)",
   "amount": " T+ 3:55",
   "administration": "1/2 g",
   "substance": "smoked"
  },
  {
   "time": "Cannabis",
   "amount": "",
   "administration": " T+ 3:55",
   "substance": " "
  }
 ],
 "report": [
  "5:30 pm smoke 500mg of cannabus in bong",
  "6:00 pm dissolve 20mg of 5meo mipt under tongue and swallowed",
  "-horrible taste when rinsed out from under the tongue and seemed to linger for about 5 minutes or so.",
  "6:20 pm starting to feel a bit weird and chills up my spine much like the come up of mdma if ingested orally",
  "6:45 pm feeling stimulating effects although I just feel like sitting down and relaxing. I also notice my digestive system has also sped up being stimulated much like cocaine.",
  "7:15 pm still feeling over stimulated and talking at a fast rate, tending to ramble on about nothing. The buzz is very clean, no sketchy feelings or teeth clenching. I feel like I could sleep and am very hungry which is ironic since the buzz feels so much like mdma.",
  "7:30 pm smoked 500mg of cannabus in bong, hoping this will bring on visuals as I have havent had any yet.",
  "7:45 pm still no visuals, strong body buzz though as I find myself stretching and flexing muscles.",
  "7:50 pm in frustration I smoke another 500mg of cannabus, this is potent bud too and I'm finding that it is starting to mask the 5meo mipt buzz by the time I finish my bowl.",
  "8:20 pm again in frustration attempting to intensify my 5meo mipt buzz I insufflated 100 mg of ketamine. Now I've done alot of psychedelics and I do not recommend this to anybody inexperienced.",
  "8:30 pm by the time by drips of the wonderful menthol ketamine are gone I notice myself hallucinating finaly, minor visuals but finaly.",
  "9:00 pm visuals are somewhat like acid but they dont get carried away by a lysergic headbuzz or mind expantion. I notice distortions, geometric patterns within any image, and sometimes little neon lights scroll in for a split second out of the corner of my vision. I know understand why others compare the buzz to that of a hippie or candy flip, in my eyes this is like the acid of my generation being uncontrolled by the canadian or u.s governments at the moment, just like acid in the 60's",
  "9:20 pm I notice minor disosiative effects which is thaught to be the work of the k. I figure what better time to smoke something special.",
  "9:25 pm I smoke 500mg of cannabus with app. 15mg of honey oil(unweighed obviously)",
  "9:45 pm visuals are losing strength and coming in waves. I find myself still with the same 5meo mipt body buzz causing me to stretch and relax although stimulated. Honey oil has my eyelids heavy though.",
  "10:00 pm I decide its the end of my plateau and its comedown time",
  "10:30 pm little body buzz and still very hungry. Dosent feel like I will experiance any sort of negative comedown or hangover.",
  "12:00 am I lay down to bed impressed with my trip. On other drugs such as lsd and mdma my brain activity is still high which causes me to stay awake tossing and turning melting my brain with thaughts. But instead I find myself asleep by 12:30 am.",
  "9:00 am I wake up as I have hockey at 10:00 am. I find myself rested with no hangover or negative effects from the night before."
 ],
 "erowid": {
  "id": "88561",
  "citation": " troy a.. \"Mellow Moxy Buzz Isn't So Mellow with K: experience with 5-MeO-MiPT, Cannabis & Ketamine (ID 88561)\". Erowid.org. Feb 2, 2011. erowid.org/exp/88561",
  "substance": "5-MeO-MiPT, Cannabis & Ketamine",
  "views": "4879"
 }
}
