{
 "id": 1322,
 "title": "Beware of Satan's Piss",
 "date": {
  "submission": "2005-02-09T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Arcane",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "4 shots",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 ],
 "report": [
  "My memories of this event are a bit fuzzy, due to being intoxicated off my ass.  I will try to be as accurate as possible.",
  "It was a Friday night,..or was it a Saturdaywell, thats not really important, but I know it was at night.  My group of friends and I started the evening with a nice bowl of mary jane. We were all in a generally good mood, in a very comfortable enviroment at my friend's house. For the marijuana, we used my favorite instrument, the steamroller, individually taking a couple of tokes, and giving each other shot guns.  Being the sick and twisted individual that he was, my friend Chuckles wanted to see someone fucked up and wasted for his viewing pleasure.  He broke out the Bacardi 151, the drink we called satans piss.   Chiefly named for its foul taste, and the burning sensation produced as it flows down your esophagus and ignites your inner organs.  He passes the drink, but to no avail, as no one was stupid enough to partake.  No one that is, except me.  Me wanting to be the daring path-weaver, the one who always went first, I said what the fuck, pass it over here.",
  "Now, I already had a nice high going, but no, I had to fuck shit up and go too far.  Bacardi 151 is 75% alcohol, and yup, you guessed it, 151% proof.  The accounts are as documented:",
  "1st shot- I feel good, my high is intensifying, and I feel somewhat like Im flying. The high could be compared to smoking two and a half bowls. At this time, all is good.",
  "2nd shot- Im pretty much drunk at this point. Much more drunk than high. Everyone gawks that Ive taken a hit so strong.  I feel giggly and silly, and speaking off and on in Japanese.  I insist on narrating a movie where all watching, rather loudly in fact.   Not wanting the high to subside, I proceed to drink again.",
  "3rd shot- Im dancing...err, trying to.  Unlike ecstasy, where I have perfect coordination, and indefinite groove, my motor skills told me to fuck off, and jumped out of a window or something, cause their no where in site.  I can barely stand, I fumble a lot, and I mistake a friend for my boyfriend and lay on him.  Thinking becomes strangely difficult, and responses are definitely slower than usual.   Needless to say, I wasnt a pretty site.",
  "4th shot- It gets ugly, so ugly that I cant recall it all.  I do remember throwing up on my friends couch, (eh, sorry bout that Chuckles). After the couch, on the floor, and after the floor, finally in the toilet bowl, where I stayed for several minutes after playing in the toilet water.  It was fun no longer.  I tried to lie down, to ease the unstoppable discomfort of being on some type of amusement park ride from hell. Extreme nausea kicked in and everything moved at 900 miles per hour.  Little is remembered after this point, but I was told that I threw up several more times, and on one account, had to be carried off to the bathroom by my boyfriend.  I also learned that I attempted to take a 5th shot, but was tackled to the ground before succeeding.  Now those are real friends.",
  "The following morning I woke up, still buzzed.  The inner lining of my stomach felt soaked with alcohol, and I could still taste it in each burp that passed.  This induced more nausea, and I desperately searched for sustenance to absorb the excess.  For weeks afterwards I would not look at a bottle of alcohol without my stomach curdling.  I could kick myself in the ass for such irresponsibility.  I made an ass out of myself, while not taking my health into consideration.  Im sure Chuckles didnt get the last laugh since I puked on his couch. ",
  "If you dont remember anything else, remember to take in moderation, be in the company of good friends, and for christ's sake, know your limits."
 ],
 "erowid": {
  "id": "13954",
  "citation": " Arcane. \"Beware of Satan's Piss: experience with Alcohol & Cannabis (ID 13954)\". Erowid.org. Feb 9, 2005. erowid.org/exp/13954",
  "substance": "Alcohol & Cannabis",
  "views": "14241"
 }
}
