{
 "id": 13228,
 "title": "First Low Dosage Testing",
 "date": {
  "submission": "2012-01-11T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tabubue",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:20",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "insufflated",
   "substance": "4-Methylmethcathinone",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I ordered 1g of Mephedrone. I've got package of white powder with relatively intenasive sweet chemical smell. Taste was similar to soda bicarbona (I expected bitter taste like methamphetamine or MDMA pill). I decided to do testing with small amount of Meph to avoid any unexpected reaction (alergic, cardiac...)",
  "Set up: I was at home environment. Alone. Good mood, only slight head ache caused probably by low air pressure.",
  "Health status: Healthy, no known heart or pressure problems. No regular medication.",
  "Dose: 15+15 mg of pure (declared) powder.",
  "T+0: Snorted two small lines (each 7.5 mg approx.) to both nostrils. It burns but not so hard.",
  "T+10: I felt mild stimulation, no halucinations. Mood was improved. Felt strange taste in throat.",
  "T+15: I listened to music which seems to me unnormally nice.",
  "T+20: Snorted next 15 mg, same way as in T+0. Heart beat slightly increased, not unpleasantly.",
  "T+40: Pleasant mild stimulation, without need to contact with other people. Nice mood. Listening to music was pleasant. Dancing.",
  "T+50: Relatively rapid decreasing of effect, still strange taste in throat. Smelly slime run out of my nose.",
  "T+85: Baseline. Not negative feelings except of slime running out of nose.",
  "I started with really small dose. I have experiences with MDMA and methamphetamine. I was relatively sensitive towards this compunds. For example half of MDMA pill (approx. 50 mg of MDMA gave me really nice 4 hrs. ride).",
  "Next time I am gonna take 100 mg of Meph oraly."
 ],
 "erowid": {
  "id": "88665",
  "citation": " Tabubue. \"First Low Dosage Testing: experience with Mephedrone (ID 88665)\". Erowid.org. Jan 11, 2012. erowid.org/exp/88665",
  "substance": "Mephedrone",
  "views": "4535"
 }
}
