{
 "title": "Beautiful Panic Attack",
 "author": "Jack",
 "citation": " Jack. \"Beautiful Panic Attack: experience with LSD & Cannabis (ID 13236)\". Erowid.org. May 3, 2007. erowid.org/exp/13236",
 "substance": "LSD & Cannabis",
 "bodyweight": "215 lb",
 "report": "<p>Me and my best friend Al, whom I've tried every drug for the first time with and do 95% of my drugs with him, had the sudden *need* to trip. We had done shrooms once before and loved it. So, we contacted all the people we knew that would have shrooms, but to no avail. Finally, our main dealer of very fine hydro weed told us he had a lot of shrooms. We asked him if he could hold 1/4oz for him to drop off to us the next day since he said he was way too whacked out to drive anywhere and me and Al only being 16 and having only driving permits.</p><p>Well the next morning, I called him and he gave us some bullshit story about some kids beating him up and stealing all his shrooms (felt like crying). He then informed us he has some highgrade LSD that we cud buy for 5$ a hit. WOW! The shrooms cost us 50$ for 1/4 last time. Since my parents went shopping for the day, me and Al drove my sisters car to the dealers house (a lot of cars look like cop cars when youre driving without a liscense). Well we got to his house, purchased the lsd and drove his turn back home (first time we ever drove without a parent). We were so excited we took the acid in my driveway sitting in the car.</p><p>The dealer told us smoking after taking the acid would make the comeup more comfortable bescause youre already messed up. So, we smoked a shitload of some good weed. So we baked out my sisters car and finished the weed about T+45mins. We were very very stoned, definately the acid was taking affect. The next 5 hours I can't remember things in a linear sense of time, just in what room I was in when something happened.</p><p>My room</p><p>Feeling very panicy. Am I insane? Wait, no I'm on acid. But no drug is powerful enough to do this right? Pretty much what went through my mind for what seemed like 2 hours. Probably 10 minutes who knows. This was basically the only 'bad trip' part of the whole experience. Even though I did have slight panic throughout the trip, nothing seemed to be bad or good. Theres a huge mirror in my room and me and Al were just staring into it while we were in this room. Absolutely no communication between us. I could see my body mutating like i had hundres of birth defects. I much prefer the 'bubble-gum' like visuals of shrooms, but this will do =). I was mostly floating around the room having no thoughts at all just pure emotions. Fear, joy, everything. Don't get me wrong, fear felt just as pleasurable as joy did. Fear was like being afraid of the boogeyman under your bed when youre 8, but knowing youre older and nothings wrong. Sort of like having your cake and eating it too. We then decided to go back into my sisters car and smoke? I dont remember smoking but I wouldnt go there unless we were goin to.</p><p>Living room</p><p>We passed my living room on the way to the front door. Wow, every room has different faces on the walls. So, we went to every room in my house to see some very bizarre visuals. My mom used watercolor paint throughout the house so the walls look very odd. One room looked like a bunch of robot heads on the wall. Another room had heiroglyphic type writing inscribed on the walls. It wasn't as if these things were actually on the walls. It was more like what you would see in one of those 3D-eye books. Next we enter the room my family previously called the red room. Basically used for storage for important papers with red colored walls. Well these walls had hundres of demon-like faces on them. This scared the shit out of both of us and we quickly left that room. I don't really go in there anymore.</p><p>Oh yea we were going to go outside. Then it took a longass time to get my sneakers downstairs and return upstairs to the living room. Still no thinking going on in my head. That voice in my head that always talks to me. Dead. Just emotions 1000x stronger then normal. Finally sitting on the couch about to put my sneakers on. I then glance at the clock in the kitchen. From now on I had no visuals but time actually went backwards! I dont remember the exact times but I stared at the clock for a few minutes and each minute the clock would go one minute backwards. This really freaked me out, and the clock was digital not one of those littlehand bighand clocks. So I managed to get my sneakers on, wasnt able to tie them though and we trooped outside.</p><p>Sisters car</p><p>We sit down in the car and put on some music (Mystikal). This was a dumb choice for music to trip to, but oh well. In the car, I felt I had died and was in the after-life. This was a GREAT feeling. Most people would think this would be very very frightening but nope. I fel totally detached from the material world. I no longer had the overwhelming emotions from before. My mind was completely clear of anything, just pure euphoria. I remember the intro to the cd sounding exactly like my next door neighbor's dad yelling for me from his yard. But hes not dead like me right? Cant be. So, I just shrugged it off. At one point I remember having a ciggarette in my hand. Walking back from the car to my house was more like floating then walking. I used my mind to to move, not my legs. Wow, the after-life rules. I experimented with this around the house for a while which then reminded me of video games.</p><p>Back to my room</p><p>We put in NFL2K for dreamcast and played this while the trip began to slowly die down. Sort of like how marijuana tapers down. The same feeling just getting less and less noticeable as time goes by. We played a few games and were no longer tripping, but definately not at baseline. We decided to smoke the last of our weed which was about 2 grams. After the blunt, it felt like a very mild dxm trip. Very cool.</p><p>My parents returned home in perfect timing. Thank god they didn't come home while I was dead inside my sister's car. That would of been hard to explain to someone who is in another dimension then youre in. Later that night I was very tired but couldnt sleep. So, I took a few nyquil gelcaps. About 20 minutes later I felt I was on dxm again. Well technically I was, but nyquil never does this to me. About an hour after enjoying this state, I passed out (in my own bed somehow). I took the acid about 3p.m. and slept at about 12 a.m. Wow I never felt so good for so long. This would be my first experience of many psyhoactive drugs which I now love for recreation and as a key to the hidden secrets of myself. To think I was hiding secrets from myself!</p>",
 "year": "2000",
 "id": "13236",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-05-03T07:00:00.000Z",
 "views": "3401",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
