{
 "id": 13243,
 "title": "Worst Experience of Life",
 "date": {
  "submission": "2011-01-20T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Storm",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "JWH-018",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "Hello you all can call me Storm as my handle. I am 21 years old and recently have been laid off of my job that Ive held the past 2 years. Throughout the past 4 years I have dabbled in many different drugs ranging all over the spectrum. My drug of choice and the only one I do on a regular basis has been cannabis. I would say everyday for the past year and a half. I had been introduced to JWH-018 by a close friend I knew and being the way that I am, I always am up from trying something new at least 1 time, and trying this JWH-018 or what Ive heard called synthetic marijuana didnt sound like a bad idea, boy was I wrong.",
  "The first 2 times I had smoked the JWH-018 in crystal form I had sprinkled a very little amount on a 1 hitter bowl that was already fully packed with marijuana and probably smoked around 2 to 3 bowls on each of the occasions. Honestly on both the occasions I felt the normal high feeling from smoking the marijuana and a slight extra body buzz that I normally wouldnt have felt otherwise.",
  "On the last occasion I had smoked marijuana a lot early in the day as well as doing a couple of other things but met up with 2 of my friends to smoke more. One had JWH and asked if I wanted some I said sure thinking the same effect would happen to me on this occasion. My other friend had warned me to not do any because he heard stories of people dying overseas; against his wish I did it anyways. I took a nice small bowl packed it with mostly marijuana and my friend sprinkled some of the JWH on top at the time it didnt look like much but it sure turned out to be that and more. I took the fattest hit Ive taken off a bowl in awhile kind of like smoking salvia where I proceeded to blow out a massive amount of smoke. At first I felt great fine as I always usually have, soon however my friend was speaking about something and honestly what she was saying became more and more annoying and it really started to irritate me, shortly after that I had proceeded to close my eyes, BAD IDEA.",
  "Shortly after from what I can remember this is what my experience was like: I felt as though I was trapped in this alternate reality in my friends basement and there was no way of escaping. I felt so scared and it felt as though I was transporting to different parts of the basement when consciously I was stumbling around the basement. I remember in my subconscious hallucination I was vomiting, apparently as I later found out I really did vomit everywhere in the basement. No matter what I did I couldnt get out of this alternate reality and it scared the living hell out of me and it felt as though I was being hurt trying to escape this place. Eventually my friends said that I got so bad that they felt they needed to take me to the hospital. At this point in my hallucination I swear on my life it felt as though I was going over what had happened the whole day with this one calming person asking me everything I had done that night recalling what might have caused the end, it felt as though I was dying. In my mind all I could think about was not getting to say goodbye to my family or friends. I also started to see people who I thought were either angels or demons and I started to think about Heaven and Hell and what was going to happen to me where I was going to go.",
  "As my friends preceded to help me up the basement stairs to help take me to the hospital, in my hallucination I felt as though this calming feeling came over me and this group of people were there helping me up the steps through the door at the top which I honestly believe to be the afterlife, they were trying to help me get there to cross over but I wasnt ready to go. Saying no its not my time Im not ready to go. Soon after this I remember waking up outside the hospital stumbling to the emergency doors. I periodically awoke at the hospital not knowing what was going on. The next thing I remember was waking up in my bed this morning. Scariest moment in my life, I vow to never again do JWH, from my knowledge and what I have read it was an apparent overdose on JWH. I hope this is a lesson and warning to those of you seeking to try this DONT and if you must small very small amounts."
 ],
 "erowid": {
  "id": "88768",
  "citation": " Storm. \"Worst Experience of Life: experience with JWH-018 (ID 88768)\". Erowid.org. Jan 20, 2011. erowid.org/exp/88768",
  "substance": "JWH-018",
  "views": "7553"
 }
}
