{
 "id": 13254,
 "title": "Slightly High Dose for First Time",
 "date": {
  "submission": "2010-12-22T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Splitz",
  "gender": "Male",
  "weight": 60
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  },
  {
   "time": "4:00",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "oral",
   "substance": "AMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Well, I haven't tried psychedelics in a few months, and I got some aMT. I'm experienced with LSD, mushrooms and DMT, in terms of psychedelics, and many other things besides. The other night I tried this stuff.",
  "This experience was interesting. I'd very much like to try it again but perhaps next time sticking to a 50mg dose. I was on my own, and indoors throughout, because it was bloody freezing outside, and as much as I wanted to experience the snow... well, I don't do cold very well.",
  "8.00pm: I take 50mg orally, using a cigarette paper to bomb it. I then carry on my activities (watching a bit of TV, listening to music, playing guitar).",
  "9.00pm: By this point I was noticing a mild stimulation. It felt slightly speedy, I felt like I wanted to dance a little and was getting pretty excited about the experience.",
  "10.00pm: Now I started feeling a sense of disorientation when walking about. I started feeling pretty euphoric, and my vision was crisp and clear. I phoned a good friend and chatted for a while, which really helped my well-being along. After a while I found my vision jumping about, things flipping around my visual field. I turned the lights off and listened to music. At this point I could see dots and flashes, very mild visuals. CEVs were also mild and similar.",
  "11.00pm: I found that my thoughts were flying around and were confusing, I had alot of images in my mind of a sexual nature, and still I felt stimulated.",
  "12.00am: I decide to take another 50mg... here goes.",
  "1.30am: Now a nausea had settled in and I threw up. The energy I previously felt had left. Visuals didn't really increase. It was here that I started reliving painful memories, and the thoughts were looping in my mind. These remained for what felt like hours before I got them under control, but throughout I was feeling panicky. I developed a painful headache and I didn't want to move, although I kept thrashing in my bed. I tried to watch family guy but I couldn't concentrate on it and it made no sense. I felt the desire to just sleep.",
  "5.00am: No sleep came, although I felt calm and relatively content by now. Very tired, but satisfied.",
  "Overall, it was interesting. The frightening part was obviously nasty, but nothing that concerned me upon returning to relative sobriety, I considered it a warning to have a bit more respect for this stuff. I would say the mental aspect felt a bit shallow... I'm willing to try this again though. Visually I was disappointed, but do not underestimate the capacity for mind-fuck with this stuff. It's powerful."
 ],
 "erowid": {
  "id": "88820",
  "citation": " Splitz. \"Slightly High Dose for First Time: experience with AMT (ID 88820)\". Erowid.org. Dec 22, 2010. erowid.org/exp/88820",
  "substance": "AMT",
  "views": "8995"
 }
}
