{
 "id": 13251,
 "title": "Never Again",
 "date": {
  "submission": "2011-01-15T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Evilpoptart",
  "gender": "Male",
  "weight": 84
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Products - Spice and Synthetic Cannabinoids"
  },
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "IV",
   "substance": "Lorazepam"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Ziprasidone"
  }
 ],
 "report": [
  "Me and a friend were outside catching up over winter break and we packed up a bowl between us.  After about 10 minutes and only about 3 hits of the 'Smiley Dog' herbal incense we are so high we cannot stand or walk.  The idea of returning to the house and watching a movie is laughable in our state after about 15 minutes.  I lose motor control and can no longer stand after 20 minutes.  MY heart feels as if it is going to explode, I become convinced I could die at any moment.  A tingling feeling starts at the tips of my fingers and slowly works its way up to my hands, then up my arm.  It feels as if my bod is dyeing piece by piece before me. ",
  "At this point I lose it, and have my friend call an ambulance.  Sounds like over reaching, but my body will not obey my commands, I'm vomiting and the tingling feeling has moved terrifyingly close to my heart.  When the ambulance arrives they cannot bring me under control and i cannot stop my body from convulsing, shaking, and screaming like the demon infested girl from 'The Exorcist'.  They had to strap me to a gurney and put me in an ambulance.  It took six people to hold me down so they could put the straps on and get an IV in me.  They administered 10 milligrams of Ativan to try to calm me down but nothing really works until I'm at the emergency room and they put me down with Geodon.  I'm convinced JWH-018 triggered a full psychotic break in me.  DO NOT FUCK WITH THIS STUFF!  STICK WITH REAL WEED!"
 ],
 "erowid": {
  "id": "88807",
  "citation": " Evilpoptart. \"Never Again: experience with Products - Spice and Synthetic Cannabinoids ('Smiley Dog') (ID 88807)\". Erowid.org. Jan 15, 2011. erowid.org/exp/88807",
  "substance": "Products - Spice and Synthetic Cannabinoids ('Smiley Dog')",
  "views": "8144"
 }
}
