{
 "id": 13258,
 "title": "A Well Deserved Poisoining",
 "date": {
  "submission": "2012-01-13T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sam",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Well being the winter solstice, a full moon, and having a free eve, I thought Id push the boat out a little and have a solo sesh with 40mg 4-AcO-DMT.",
  "Just after dosing with it in a capsule, went and had a bath, started feeling giddy as I was getting out, time to go lie down.",
  "I did so, in the dark, on my bed, with music. Feeling quite sick as it comes on. Yet also feeling very nice. Weird this...sick to my stomach, and blissful at the same time. This is the source of some amusement. I suspect the nausea may have been due to my eating recently before hand, and possibly it not being the most nutritious or healthy meal in the world. Am definitely feeling the desire to be horizontal during the come up...powerful. Very impressive visuals in the dark. Im thinking maybe this stuff lacks a certain magical little something that mushrooms can have; I cant put my finger on it. And I definitely dont have a natural vs. synthetic bias. But I do like that mushrooms grow from the earth. You cant argue with that.",
  "Anyway, some impressive and very deep visual realms are experienced, beautiful with music. My nausea and a nasty stomach feeling are ever present. Most of the time my headspace is taken up with personal issues, focusing on my relationships with family and friends.",
  "Then suddenly, my nostrils are hit with this smell...my body odour! It is really overpowering. Not sure if anyone else here has been near gorillas in a zoo? Thats what Im talking about. I smelt repulsive. As I was experiencing this, I also felt like I was poisoned, and even close to death. The visuals during this time were pretty dark and dull as well...very far from magical. Hard to describe, even now the memory of the experience is fading, which is weird in itself as the experience was so incredibly vivid. In the light, in the mirror, my reflection was equally revolting. All manner of blotches and spots and imperfections. Wondering if anyone else here has seen the Cronenberg film The Fly? Well I looked a bit like Jeff Goldblum did some time into his metamorphosis!",
  "So yeah I seemed to be repulsive to myself on several different levels of sensory input. It wasnt the 4-AcO-DMT that had poisoned me though...it was I that was poisoned. Through my actions and inactions. University stresses and emotional relationship stresses have been messing around with my life style. I havent been getting enough exercise, fresh air or contact with nature, my diet has slipped, and my sleeping patterns are off. I also need to be more proactive with my university studies.",
  "I came out of this experience desperate for some fruit. I managed to concoct a smoothie out of frozen forest fruits, hemp seed, honey, olive oil, and a raw egg which Im drinking now (its like a party in my mouth and everyones invited). Im quite proud of this. I feel its part of what my body was yearning for. When Ive finished this Im going for a late night walk. Then shower. Then bed.",
  "So yeah. There you have it...a strange and completely unexpected evening. Ive never had an experience remotely like this. It was ultimately amazingly revolting in every sense, yet also very interesting, and helpful. Has definitely given me a powerful kick up the behind to take better care of this body I have, these amazing bodies were all so lucky to inhabit. So take care of yours to y'all!"
 ],
 "erowid": {
  "id": "88848",
  "citation": " Sam. \"A Well Deserved Poisoining: experience with 4-AcO-DMT (ID 88848)\". Erowid.org. Jan 13, 2012. erowid.org/exp/88848",
  "substance": "4-AcO-DMT",
  "views": "8676"
 }
}
