{
 "title": "A Little Giggly",
 "author": "Zam",
 "citation": " Zam. \"A Little Giggly: experience with MIPT (smoked) (ID 13268)\". Erowid.org. Mar 14, 2002. erowid.org/exp/13268",
 "substance": "MIPT (smoked)",
 "bodyweight": "220 lb",
 "header": [
  "DOSE:",
  "8.5 mg",
  "smoked",
  "MIPT",
  "(powder / crystals)"
 ],
 "report": "<p>I had the chance to encounter some MiPT crystals on the desert and only recently decided to taste it for the first time.</p><p>I was told that, when smoked, it produced a mild euphoria that was not unsocial.  I read the TiHKAL entries which suggested oral dosages between 5 and 25mgs with one entry for 20mg insufflated.</p><p>We put perhaps 10mgs in a clean glass pipe and melted it enough to keep the crystals from blowing down my throat.  The material melted and then vaporized quickly into a white smoke which tasted distinctly like a very mild DMT (I have only tried DMT twice, only once seriously and that was just a brush with it). </p><p>As always, as the smoke hit the top of my lungs, my body jerked in rejection.  The chemical smoke burned coldy on my lips and where my bronchi met my lungs.  I found that I was virtually incapable of taking solid 'hits' of it and instead found that by breathing lightly and steadily for long, slow breaths over the material as it started to heat and then vaporize, I could relax, relax, relax, relax into the feeling reminiscent of a sharp blade cutting the inside of the base of my throat.</p><p>After a few of these long breaths, I started to notice a change in perception.  My mood lifted from a neutral repose to a little giggly. I noticed changes in my visual perception, which were hard to pin down.. perhaps the world seemed 'brighter', but when I tried to identify what had changed, I wasn't really able to pinpoint anything.</p><p>I put probably another 10mgs of material in the pipe and heated it again to keep it from spilling out (melting it into liquid/honey at the bottom of the pipe).  I smoked another breath's worth and put the pipe down with 70% of the material still remaining.</p><p>I estimate I smoked 7-10mgs total and my partner perhaps 5+mgs.</p><p>I didn't feel much like sitting at my computer keyboarding anymore, so I bounced over to my partner and tried to convince hir to go play in bed with me.  Failing (per usual when such a mood is not shared :), I decided to poke around the room looking for /fun/ .. it was a weekend afterall.. no need to be dreary. </p><p>I put a movie in and decided to dye my hair :) As with all of the permanent varieties of the Miss Clairol Fun Ride , the chemicals are nasty as hell and burned my scalp and head for the duration of the Fun Ride.  The MiPT seemed to have dwindled from very mild euphoria to a nice quiet sense of emotional lightness in about 45 mins and then had a couple hour trailer of feeling mildly altered with nothing I could really latch onto linguistically. As with virtually every entheogen, I got a mild headache starting after the primary effects were gone, around T+2 hours.</p><p>Overall, a pleasant, mild, short experience that felt relaxed, a little giddy.</p><p>I hope I have a chance to taste it again someday.</p>",
 "year": "1998",
 "id": "13268",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-03-14T08:00:00.000Z",
 "views": "19246",
 "dose": {}
}
