{
 "id": 13262,
 "title": "Suicidal Ideation",
 "date": {
  "submission": "2011-05-20T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "longcat",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "75 mg",
   "administration": "oral",
   "substance": "Diphenhydramine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": ""
  }
 ],
 "report": [
  "I wanted some assistance in getting drowsy to motivate myself for sleep, so I enlisted the support of the pink Rite Aid brand diphenhydramine pills. ",
  "First night I took two (50mg), second night I took three and the third night I took three again. By the third day I was having nearly continuous desires to commit suicide. I think I took it a fourth night (3 or 4), but by this time I was becoming sensitized to its sleep-inducing effects. I think that each time I took the diphenhydramine it was also with varying amounts of alcohol (3-8 drinks).",
  "I was looking up the feasibility of using one of many nearby bridges to jump off of, and was preoccupied with the thoughts of my self induced demise. Looking up probability of death and planning for the broadcast live of my jump, and a short suicide note had been completed. I also personally scouted a good nearby candidate which un/fortunately did not have any pedestrian walkways. ",
  "I had taken it for three or four nights, and within two days of cessation, the thoughts subsided to their pre-diphenhydramine level, which is much more manageable. It was strange to be able to get a glimpse into the darker side of things and still come back.  Normally I don't experience such severe suicidal thoughts. ",
  "The last time I used diphenhydramine as a sleep aid, I experienced an intensification of existing annoying self directed negative thoughts ('I'm so stupid,' 'God what a piece of shit,' etc...) which prompted me to discontinue it, but was surprised at the different nature of the thoughts this time. ",
  "I couldn't find any link between diphenhydramine and enhancing suicidal ideation so I have posted this experience."
 ],
 "erowid": {
  "id": "88863",
  "citation": " longcat. \"Suicidal Ideation: experience with Diphenhydramine & Alcohol (ID 88863)\". Erowid.org. May 20, 2011. erowid.org/exp/88863",
  "substance": "Diphenhydramine & Alcohol",
  "views": "7439"
 }
}
