{
 "id": 13275,
 "title": "Untreated Seed Experience",
 "date": {
  "submission": "2004-06-01T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Atom Heart Brother",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "175 seeds",
   "administration": "oral",
   "substance": "Morning Glory"
  }
 ],
 "report": [
  "<p>  I had given up smoking cannabis for about three months to get my mind in order. A friend who I had not seen in a while called and asked if I could find some jah for a kayaking trip that he was going on. I said I wasn't smoking but I knew who to ask, and he said that he'd stop by. When he visited, he brought some morning glory seeds and a seed catalogue from the company that he had bought them from.",
  "  I like reading seed catalogues and planning gardens anyway, but he said that the seeds were untreated and that he had bought 100 grams of them. He gave me about 225 seeds. I had eaten some morning glory seeds about 8 years ago (two envelopes worth) and they had given me serious nausea and diarrhea. I figured that I had eaten treated seed back then. My friend assured me that he had tried these ones and they were good.",
  "  I didn't eat them that night, but later in the week I selected 175 of the nicest looking seeds and set them aside for psychedelic purposes. The rest I planted. Usually I transplant morning glory seedlings outside too early in the year and they get frost-bitten. It happened again this year.",
  "  The 175 morning glory seeds were placed in a coffee grinder and pulverised. The powdered seeds were then put into a small jar (about 200 mL) and cool water was added to fill. The jar lid was replaced and the jar was shaken for approximately five minutes. The jar was then set in a cool, dark place for about three hours.",
  "  The jar was opened and the contents were strained through a fine sieve into a cup. A small amount of seed pulp remained in the strainer and was discarded, but the majority of the seed material was suspended in the liquid. It tended to settle out onto the bottom of the cup. In order to maximise psychoactive content, the seed material was consumed with the liquid.",
  "  I mixed it with a little Rice Dream and some strawberries in the blender and drank it on an empty stomach. The amount of water diluted the rice milk and I only had about a half-dozen strawberries, so it wasn't really a taste sensation. It took about 20 minutes to drink it in small gulps, but I felt the beginning of the high in about 15 minutes.",
  "  It felt like the beginning of an acid or mushroom trip, with my body wanting to lie down as my mind started to gear up. It was a sunny afternoon, about 4pm. I had rented some videos, so I popped in 'The Thin Red Line' and by the time the movie started I knew that this was a good stone.",
  "  I could follow the movie pretty well, which doesn't always happen with acid. With mushrooms usually I can't even watch TV, but with morning glories the plot made sense and even when I started to get sidetracked by little details I could re-focus. I noticed that sometimes I couldn't remember what had just happened on-screen. The sounds of islanders singing (in the movie) was amazing. I got a little emotional rush from hearing the multi-part harmonies.",
  "  Visual effects were minimal and unobtrusive, no mutable (melty) images or visible patterns. My stomach felt tight, but not uncomfortable. (My friend recommends eating a little oatmeal porridge before tripping.)  When the movie ended, I checked my pupils and they were big and black. I was definitely high, but I could still function in conversation without giving it away.",
  "  I think I was dosed up for about four or five hours, gradually mellowing out and going to sleep at a normal hour (10pm or 11pm, rather than 3am or 4am). I woke up the next day with a slight headache (probably from all that thinking), but nothing serious. Later that day I smoked a little number to break my fast.",
  "  I might try the seeds again, probably around 300 to 325 next time, but I'd rather eat mushrooms because they seem 'cleaner.' They are an alkaloidal bulk-bin of mystery, and I like to know what I'm getting into (and what's getting into me.) So meditate before you levitate...</p>"
 ],
 "erowid": {
  "id": "8895",
  "citation": " Atom Heart Brother. \"Untreated Seed Experience: experience with Morning Glory Seeds (ID 8895)\". Erowid.org. Jun 1, 2004. erowid.org/exp/8895",
  "substance": "Morning Glory Seeds",
  "views": "18978"
 }
}
