{
 "title": "Killing Time",
 "author": "The Experiment",
 "citation": " The Experiment. \"Killing Time: experience with Hydrocodone & Oxycodone (ID 13276)\". Erowid.org. Mar 21, 2006. erowid.org/exp/13276",
 "substance": "Hydrocodone & Oxycodone",
 "bodyweight": "115 lb",
 "report": "<p>For 3 days I repeatedly used opiates.  The pills were acquired from the depths of the medicine cabinet; leftovers from past operations and sleeping problems of my family members. I wasn't doing anything all week but hanging out around my parent's house, which is mindnumbingly dull, so the finding the pills was a joyous event. </p><p>In the afternoon I took 3 hydrocodones and 2 oxycontins.  after about 20 minutes I started feeling pretty good, and while waiting for the pills to take full affect,  I crushed a oxycontin and snorted through a cut straw and took two more hydrocodone pills and one more oxycontin. </p><p>The oxy-snuff hit me in seconds. My nose became numb and started running, and I had an extremely bad bitter taste in the back of my mouth. My head seemed to float up from my body, my hands were shaking and fidgeting like a speedfreak's, and every movement I made felt fluid and wonderful, like I was dancing in warm water. I felt happy, talkative, and hyper.  impulsively, I called up old friends from high school and college and ranted to whoever answered the phone (or their answering machine). My words sounded fast and highpitched. I couldn't control what I was saying... that is, I couldn't think before I spoke, I just thought outloud, and made some embarrassing revelations.</p><p>Eventually I decided I had frightened enough people and jumped into my bed. I took an ambien (just for the hell of it- I was definitately fucked up) now that the numerous pills had digested, I felt euphoric and inspired. I wrote pages and pages in my journal about my state of mind, by this time I was very tired (but knew it was I bad idea to go to sleep).  the entry is barely legible, but here are samples:\r</p><p>'the safest place in the world is not any room, or building or forest, or valley or cave.  it is a state of mind, and of body: it is in sleep.  here you are protected, in the numb cushion of darkness and dreams.  you can never really be hurt here.'</p><p>'I'm seeing falling white spots and diagonal lines traveling downward from the ceiling.  these dark shapes on the wall are mutating too quickly for me to dicern what they are.  this pink wall is discolored and dirty.  graffiti dance around on it and make bright phasers of past messages when it changes.'</p><p>'how much longer can this go on.  I am a complete mess mess mess... a pest... a parasite... drinking and smoking and fucking my brain cells as much as possible... right now my teeth chatter, I have a hard time moving... the lights are everywhere, even though these is only one light bulb.  flashes dots shapes my sinuses are sore... I need to get up and move.'</p><p>'I feel deep, soothing relaxation... my skin soft and pleasing to touch.  I blink slowly; my eyelids feel nice as they slide up and down.  my lips are electricity.  when I move my head, blood rushes to my brain, and I lay back with my eyes closed, and I feel my spirit rise from my heavy, fragile body...  my ghost floats up up, and dances, it dances like an ameba would dance- with no shape or rigidity or boundaries- it hovers over me and gyrates and expands and the music changes and the vision disappears.'</p><p>'pulling, slowly, slowly... my muscles and pulling my skin, my organs, my bones down.  they embrace gravity.  I sink down down into the mattress.  soon it will engulf me, and cover me warmth and darkness.  I must resist sleep.  no matter how nice it is to lie still with my eyes shut and my breathing so slow and spread out I almost forget to take them.'</p><p>'is this a nice feeling or not?  am I happier now than I was an hour ago?'</p><p>'I am going to overdose.  I am going to have a seizure.'</p><p>'we are the privildged numb-cheeked light-headed smilers that will laugh and talk and float past the doors.'\r</p><p>There is much more of this mood-swing nonsense, but it gets irritating very quickly.  this state of mind lasted from three days, in which and slowly increased the dosage of narcotics. Whenever I would start to come down, I would feel lethargic and panicked, and I would itch all over my body.  it was an itching that was UNBEARABLE: it was behind my eyes, deep in my ears, on every inch of my skin, EVERYWHERE.  The itching was all I could think about, and it would not go away. I scratched my skin raw trying.  I was also painfully constipated during and after the experience.  I was miserable, and it prompted me to take more and get high again so I wouldn't feel so bad.</p><p>I had very little experience with the recreational consumption of painkillers, and in retrospect I see that the dose I took was very dangerous. I was able to function somewhat during the experience, but I was constantly dizzy and I laughed at everything, especially at times when it inappropriate: like when I heard my cousin was in a mental ward at the hospital.</p><p>Overall I had fun, maybe a bit too much, because I really want (almost crave) to do it again, and that makes me worry.</p>",
 "year": "2002",
 "id": "13276",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2006-03-21T08:00:00.000Z",
 "views": "10001",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Pharms - Oxycodone",
   "form": "(pill / tablet)"
  }
 }
}
