{
 "id": 13288,
 "title": "Very Interesting Thoughts without Any Panic",
 "date": {
  "submission": "2004-05-12T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Toben",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract - 5x"
  },
  {
   "time": "0",
   "amount": "1 cart.",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "My friend and I decided that we would purchase 2 grams of salvia 5x and a 24 case of ISI chargers with a portion of our recently aquired paychecks. Total cost $52. Once we got back home, I loaded a regular sized bowl with the 5x, lit it up and inhaled about half of it. The smoke was rather harsh, but had a very plesant smell. I held it in as long as I could and then blew the smoke into a balloon. I then cracked a charger of nitrous into the already smoked filled balloon, and inhaled it.",
  "What happened next is a little hard to describe. I layed back on my bed facing up and closed my eyes, still holding the nitrous in. My whole body felt as if it was floating.... without me in it. I was up on the ceiling looking down at my body and my friend, who was now getting pretty anxious and begging me for the balloon and cracker. I remember thinking to my self that I had better watch out for the ceiling fan. Then I felt as if I were a baby and I knew I that I did something wrong and I was scared that mom was going to find out. Just then, an entity appeared and scolded me as if I wasn't supposed to be there. It then slapped me back into my body and the trip was over. I would say that the trip lasted for about 2 minutes with a 3 minute come down. I would also like to add that I suffer from very severe panic attacks and extreamly high anxiety when I use psychoactive drugs, even weed. The only drugs that don't give me panic attacks are nitrous oxide and salvia. So as a suggestion to anybody with similar handicaps, give these two a try and they just might suit your traveling needs, if ya know what I mean."
 ],
 "erowid": {
  "id": "8902",
  "citation": " Toben. \"Very Interesting Thoughts without Any Panic: experience with Salvia divinorum (5x extract) & Nitrous Oxide (ID 8902)\". Erowid.org. May 12, 2004. erowid.org/exp/8902",
  "substance": "Salvia divinorum (5x extract) & Nitrous Oxide",
  "views": "9058"
 }
}
