{
 "id": 13289,
 "title": "Beware Seizure Warning",
 "date": {
  "submission": "2011-01-23T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "d3vast8",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300",
    "grams": 0.3
   },
   "administration": "oral",
   "substance": "Tramadol",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I'll keep this relatively simple. The main purpose behind this post is to warn others that this medication is very highly capable of causing seizures in ANYONE.",
  "One day, I decided I wanted to try this synthetic opiate [sic] my grandma takes for her chronic arthritis, called Tramadol. I took 3, and felt pretty good. Mood lifted, felt floaty, warm, fuzzy...typical of your average opiate. Well, the next time I tried, I upped it to 5 (4 50mg pills). Felt even better. Then, I pushed it to 6. I was in the living room of my girlfriends house, smoking a little bud, and felt suuuuper good. I began to feel weird spasms that were only a split second in duration. The best description was that I felt at the threshold of a seizure. Sure as hell, whaddya know. Next thing I remember is slumping over, then a blackout, then staring into the blurry image of an EMT's face. I couldnt even say my own name to them. I was rushed to the hospital, luckily with no damage at all. however, the doc said that my kidneys were very close to failing. This drug produces a good feeling, but it is not worth the recreation. Keep it under 200mg and I can still get a good feeling perhaps mixed with some herb and stay safe. Be careful."
 ],
 "erowid": {
  "id": "89022",
  "citation": " d3vast8. \"Beware Seizure Warning: experience with Pharms - Tramadol & Cannabis (ID 89022)\". Erowid.org. Jan 23, 2011. erowid.org/exp/89022",
  "substance": "Pharms - Tramadol & Cannabis",
  "views": "9891"
 }
}
