{
 "title": "Never a Bad Journey  - Only the Truth",
 "author": "Artcadia",
 "citation": " Artcadia. \"Never a Bad Journey  - Only the Truth: experience with Mushrooms (ID 13283)\". Erowid.org. Feb 26, 2005. erowid.org/exp/13283",
 "substance": "Mushrooms",
 "bodyweight": "175 lb",
 "report": "<p>Accompanied by an experienced sitter and a very close friend, on my third journey, I took 3 grams of dried mushrooms in tropical juice. I then danced in Tai-Chi fashion for 45 minutes to welcome the medicine and ingested another gram as a 'booster'. </p><p>My previous journeys had revealed the enormity of the pain that I have been carrying since my childhood (and perhaps before). They had also shown me the omipresent power of the life force, and the blessing of the love I share with my wife - a love that cannot even begin to be described, and so I will not attempt to. They made me see that my anger towards the old God for not helping my people or any people when they face brutality or extinction, had become a strange sort of misplaced atheism. Indeed, it now appears to me that there is no such God - instead there is Being and Sentience that transcend Time (I realize uppercase is a rather poor descriptive device). Perhaps even more importantly, they taught me that as terrified and filthy as I might have felt inside, judgement need not be stronger in me than loving myself. In other words, they taught me to honor myself in order to better honor others. How's that for a list of sweeping changes?</p><p>So now, on this third journey, my intent is to 'lay down my weapons', find out if I have been sexually abused as a boy (a theme that seems to recur in therapy), and just play. When the medicine takes hold of me after the familiar tingling and slight impairment of balance, I decide to lie down, and don the headphones and face mask that mark the inward portion of the voyage. The gifted and giving sitter has put together a music selection that seems to draw out the spirit of the medicine.</p><p>I know the medicine will show me everything that I'm afraid of looking at - I have asked it to do so after all. This may be the key to a successful journey: your wishes are invariably granted. My fear intensifies as my control recedes, 1 hour into the process. I see myself on a very high bridge, pirouetting on the railing. I do not look anything like myself, more like an acrobat from the Cirque du Soleil - but this is me, unmistakably. The sitter is probably familiar with this imagery even though I do not tell him what I see. 'It's like bungee-jumping', he whispers, 'just jump, there's always a cord.' As I jump, I start seeing the hallmark shapes of the medicine spirit. [I get this incidental intuition that the shapes are fractal in nature. They are alternating zones of bright complementary colors, possibly blues and oranges.]</p><p>I do not wish to dwell on the very private nature of the revelations that were offered to me. Let's just say that I was probably not physically abused, but my boundaries as a child were constantly violated. I lived in fear and self-loathing. I was a little boy who had crawled under the rock and pointed a pitiful spear at the world.</p><p>As I experience this revelation, my body becomes saturated with sadness. I sob incessantly, something enormous and vibratory wells up in me. Like the little boy, I try to scramble away from it, but it seizes and shakes my entire frame. I can't name it, but my mouth opens like a sewage main, and a black sort of energy comes rushing forth. By now, every cell in my body is vibrating, I am about to burst at the seams. A howl forms in my throat. A howl, a scream that goes on for hours. I am now on my knees about to explode with - with ANGER! ANGER! My friend is frightened and crying as he witnesses the pain. The sitter holds me, or should I say, is restraining me. Suddenly the howl stops, and the anger is spent. I get up and say: 'That's it. I am coming out as a man. I am no longer a child'. Even though I am journeying, I know I have never experienced release on such a scale. I also know this is a very meaningful rite of passage. And that I have been healing beyond my wildest expectations, thanks to therapy, the journey work and my loved ones.</p><p>The rest of the journey was beautiful, full of sorrow and joy. Lots of laughter too, as my friends did these hilarious Marx brothers routines. I got all the playfulness I needed and allowed myself to indulge in the bad pun-making that makes me the black sheep of our family gatherings (well, not quite, but I do have to take it easy with that...). I wrestled with my role as the leader of my company, saw what I can only call spirits, came to grips with a pesky demon who has been bothering me for decades, declared that my wife and I had been 'here before' (whatever that means), and just loved my friends, who well deserve it. No one can see you better than the sitter. If you both understand the power of the journey, your friendship will be deepened.</p><p>Coming down is a very tranquil, love-filled experience. We have so much love in us. So much room in our hearts, as the sitter puts it. How can we forget that? What has gone wrong with us that we lose sight of the very act of being? Perhaps we wish to be ... comfortably numb. </p><p>There is never a bad journey - there is only the truth of who you are and perhaps of what the world is. I am less sure of the latter because my rational mind still grapples with the implications. Sadness and fear are part of the continuum of Being - here I go again with that lousy uppercase. Most likely, one will encounter them if one needs to.</p><p>Perhaps you are a shining light who will go straight to the light that I am only glimpsing but see more clearly each time. Either way, I greet you with: Namaste.</p>",
 "year": "2002",
 "id": "13283",
 "gender": "Male",
 "timestamp": "2005-02-26T08:00:00.000Z",
 "views": "51553",
 "dose": [
  {
   "time": "0",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  },
  {
   "time": " T+ 0:45",
   "amount": "1.0 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ]
}
