{
 "id": 13298,
 "title": "Not for the Meak or Weak",
 "date": {
  "submission": "2012-04-22T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Matt",
  "gender": "Male",
  "weight": 118
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowls",
    "quantity": "3"
   },
   "administration": "smoked",
   "substance": "Products",
   "form": "ground/crushed",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "So this is a brief explanation of one of the worst times I've ever had on any drug. To give you a bit of background, I've had experience with several psychedelics, acid, mushrooms, mescaline, DMT, salvia, and a few research chemicals mixed in to boot. I also am a heavy marijuana smoker, and have been smoking daily for several years. Of all these drugs, not one has ever given me a negative experience like the one I had after smoking Spice.",
  "So the experience: I have close connections to the local head shop. As such I'm able to get some of the free samples of spice sent in from various companies. As I'm not rich, and can't always afford my herb of choice, marijuana, I'll occasionally smoke spice as a way of easing the pain on my wallet. I've smoked some of these samples before, and quite enjoyed the experience. It's not quite like cannabis, but not wholly unlike it either. For me it seems to give me a bit of a jittery, introspective high. Well that changed when I got one sample of spice called 'Demon'. Right on the package were the words 'Not for the Meak or Weak'. So right away I knew it was stronger than some of the other incense products out there. I got home and loaded up my bong. The bowl was gone in three hits, and as I sat there the familiar feeling of spice started to fill me. I suddenly became aware, though, that it was a much stronger feeling than I was used to. After about fifteen minutes I realized I probably took too much. I was listening to music and the beats started to become overbearing. I was becoming afraid of the music... The fear was primal and shot to my core.... I had to get out of the house... I RAN, not walked, out the front door, and by the time I got outside I was so scared that I hid between my roommates cars.... From this point on I can't really describe my experience in great detail... It seemed like very little of the outside world was getting in. I was overflowing with fear... not just fear but absolute dread. I remember thinking I must have died. The world was spinning, yet still. It was if I was stuck in the now, and could never experience the new ever again. I was in a state of such panic that I froze. I couldn't move an inch. The fear was flowing through me like waves. I thought, 'I've made myself crazy, and it can't be fixed'. Eventually I vomited, and kept vomiting, even after my stomach was empty. It felt like my heart was being ripped out of my chest, and my head was in a vice. I must have stayed outside huddled between the two cars for nearly two hours, just stuck there. I remember thinking of the words on the package 'Not for the Meak or Weak' and thinking, 'Man, they weren't kidding!' Eventually the panic and fear started to ease away. I was able to move again, and I slowly made my way inside. My roommates didn't realize what happened to me, but trying to converse with them to let them know was too difficult, so I just went to bed. It was only 9:00pm but I was totally exhausted from thinking myself in circles.",
  "So bottom line is, when you see a warning like 'Not for the Meak or Weak' you better watch out. The synthetic cannabinoids they use for spice products may be ok in small doses, or lower concentrations, but there is a definite line between an ok amount and too much. And once you reach that line you will wish that you hadn't."
 ],
 "erowid": {
  "id": "89070",
  "citation": " Matt. \"Not for the Meak or Weak: experience with Spice (Demon) (ID 89070)\". Erowid.org. Apr 22, 2012. erowid.org/exp/89070",
  "substance": "Spice (Demon)",
  "views": "2589"
 }
}
