{
 "id": 13295,
 "title": "Felt Like PCP To Me",
 "date": {
  "submission": "2012-12-27T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "BunnieBlood",
  "gender": "Female",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "4 hits",
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "I realize because of the variance of experiences from person to person with this chemical, my incredibly long account of this trip may seem like I'm green in the hallucinogen & chemical world, but that's not the case at all. This may be one of those freak occurrences with this chem. I don't know what 'color' the Mary Joy I smoked was but before I explain another horrifying experience like many of you guys have, my background is hardcore hallucinogen fan with lots of experience like many of you certainly have and I will try to make educated adventures into insane headspaces through many drugs.",
  "Like a complete moron, thinking I could handle most anything, I took 4 good hits.  It wasnt a minute after I put the bowl down that I tried unsuccessfully to explain to my equally seasoned friend I dont recognize this feeeell... and from then on out I was f*cked.",
  "This drug is not quite like any I've ever read about or experienced or heard of friends experiencing. Weirdest thing about this drug is that it works on everyone very, very differently, not sure why. Perhaps it works on receptors in the brain that are already occupied in some people by other drugs or substances, and that might be why some people have NOTHING at all happen when they smoke it. But for the rest like me, I experienced the most terrifying effects of the hardest, scariest mindfu*k I've ever had, despite DMT being my favorite hallucinogen. What I figure of this drug is:",
  "1. It's a dissociative. Ketamine and PCP are also dissociatives and PCP is the closest I've ever come to feeling like this. Relatively no body effects with the exception of a terrifying sensation of amplification of blood pressure causing panic and the 'Oh Jesus I'm going to die' doom feeling. Also, nausea seems to be a big part of this, in my case mainly because of dizziness and a terrible balance feeling as if I had so much to drink I had no spatial relation to objects. Even getting through a door was extremely taxing. Confused with the immediate intensity of this high, I figured Id gotten myself into another 'too much to drink and adding to it' situation, but I looked down and saw I had had 2 sips of a beer all day & no other drugs. Only one other person who I saw smoke it had this nausea and balance issue. He threw up for half an hour. His girlfriend smoked the same amount and said she didnt even feel high.",
  "2. As with PCP I became completely disconnected to anything going on around me. I found that I actually couldn't read. I knew what text was but didnt know what humans did with it. My brain refused to process it. I had lost any ability to communicate and judge what was going on around me. I felt I was someone else with someone elses thoughts which I couldnt remember a flat second after I had them. I couldnt draw from past experience to calm myself or master my high because I had forgotten who I was and didnt know if I even existed. My attempts to council myself internally were useless, there was no remnant of the rational, experienced me to help. Not in a wow, man, Im tripping and Im way out there, LSD kind of way. There was nothing psychedelic about it in my case. More like, I dont know who and what the f*ck I am, where am I, 'has it been 10 hours or 10 minutes?' time expansion/compression problem. I had no memory of who I was and couldnt remember anything that had happened in my life before this moment, I could only deal second to second with what I needed to to try to get myself through this nightmare.",
  "I flipped out so badly mentally I had to leave where I was, afraid of this new person that had taken over me and what they were capable of in a social situation, identical to my experiences with PCP, and apparently getting into a car seemed like a better idea in this mind state than staying there and handling this mind-disconnection issue with other people who were nowhere near as bad off as me and who just stared at me in my jumbled communication. This is the worst intoxication as far as danger in a vehicle I could imagine other than being blind, one-eyed drunk. The colossal dumbsh*t idea of driving made me realize that on a road I have driven possibly a thousand times I had NO concept of what was around each corner nor did I have any idea of what was a reasonable speed to drive. Not like being drunk or tripping, literally I couldnt tell you if I was going 80 or 20mph.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "I experienced fairly little distortion of vision or perception of distance but my mind reset every couple of seconds and the whole thing was repeatedly foreign to me. I kept awakening into this driving experience like 'OH! What the f*ck am I doing???, OH! What the f*ck am I doing?' repeated about 150 times. Not only is it terrifying I drove, but that I never would have driven intoxicated like this ever, but there was no such thing as reasonable thought. I could have killed someone on the road.  Once I was on the road I didn't remember how I got there or making that decision.  Apparently the company I was in had lost all reasonable thought as well because I dont remember any resistance to my declaring I was leaving to go home. Either that or I was very cool on the outside and a complete maniac wreck on the inside and they didnt even know. Thats really hard to believe, though. I half expected to wake and talk to those people the next day and for them to say something like 'you were never at our house last night!'",
  "All in all it was 1.5 hours of a hard head trip of similar magnitude of 10 hits of acid minus any body buzz but without my previous mental facilities and memories to draw comfort or reasonable actions from, mixed with dissociative properties of PCP leaving me feeling like my brain is separate from your body and its a brain I dont recognize the thoughts from. I feel I could actually better handle that. No, REALLY. And I'd have been less dangerous to myself and others. The first 20 minutes I fought the worst nausea & drunk feeling Ive ever known, and when that went away, it was like being tossed into open water with amnesia and a horrible feeling I might be swimming out there for the rest of my life. It scares the sh*t out of me that anyone can just buy this at head shops. ",
  "Not a pleasant vacation from reality."
 ],
 "erowid": {
  "id": "89061",
  "citation": " BunnieBlood. \"Felt Like PCP To Me: experience with Spice (ID 89061)\". Erowid.org. Dec 27, 2012. erowid.org/exp/89061",
  "substance": "Spice",
  "views": "1090"
 }
}
