{
 "title": "Jabba the Hut",
 "author": "Mr Orange",
 "citation": " Mr Orange. \"Jabba the Hut: experience with MDMA (Ecstasy), Mushrooms & Cannabis (ID 13299)\". Erowid.org. Feb 21, 2005. erowid.org/exp/13299",
 "substance": "MDMA (Ecstasy), Mushrooms & Cannabis",
 "bodyweight": "180 lb",
 "report": "<p>We had planned the night on simply wandering. We do this on occasion, its really quite an adventure, you never know what the night will bring. We had snorted the xtc (ewwwwwe) and had go to the store for pop, we got our pop and set off to the arcade where we would meet two of our friends.</p><p>This was my first time I had tried xtc, and to that point I had smoked weed off and on and on and on for about 5 years, and I had some experience with mushrooms, having ingested them 5 or 6 times, and I drink probably more then I should, any way this said, my good friend had some more xtc experience then I did and he new this perticular stuff having done it before and he confirmed its quality. I had introduced him to mushrooms and had more experience in that area. Anyway...here we were the xtc starting to take effect, and we had some mush to eat..'Maybe we should hold off till another night, I'm starting to roll',, said my pal, and yes roll was it, I felt a wonderful floaty lovey feeling. But 'hold off' was not an option,, this was the night we had planned for, and we had some shrooms to eat, so we did. We spent a half hour or so smoking and talking, when we decided to all go into the arcade for some games, the xtc was definately evidant, and the mushrooms were starting to creep on.  We played some games, had a blast, but I particularily remember playing a car racing game called rush (quite popular) This is when the mushrooms hit. I was actually quite capable, I thought I would suck at the game but I did'nt, I ruled and I found myself in 1st place...I was so proud...</p><p>then bang   .....   a car passed me leaving a huge streek on the screen, then another, I thought the game had malufunctioned in my drugged state. I remember saying to my friend playing me 'uh...I think its broke,' he did'nt respond. Anyway,I was driving in a foriegn world, totally messed, and the musrooms had only started.</p><p>This is Phase two of the experience. Unknown to me my friends had got a hold of another friend who was on her way to the place with her car, we were to meet her outside, then we would go to her house, because she was having some friends over. I seemed like a plan I guess the wandering plan went down the drain. I was a little in my own world, and a bit apprehensive about going to this shin dig. Anyway we drove there, me and my pal were still on our way up, then we got there. We went up to her appartment, and I didn't know anybody there, it was kind of not good, I felt like a total stranger, I only new a few people that I came with but that was all, that made me edgey,  anyway I shook some hands, and sat down.</p><p>This is phase 3 of the trip, the most bizarre one. I sat down, and talked to some dude, he was drinking,I thought to my self ' ahhh booze', but tonight was about a unexpected journey into the unknown, not the familiar, expected, tipsy, pukey, bland but fun of booze. I looked around,everyone was drinking. I had explained that me and my buddy were on xtc and shrooms, witch explained the absense of beer. ' OOOOhhhhhhh cool man' was said all around, that when it hit me, really really hard. I looked down at the carpet, and I swear I didn't look up for two hours. There were amazing little patterns everywhere, I had experienced visuals before, but nothing this intense. I saw a small train in the carpet, and it was approaching me and it was getting closer and closer. As it got really close to me, I saw a figures head on the train, it was a clown head, but it was a evil clown with big teeth, but I was'nt phased I kinda liked it even though it was evil. So more and more clown heads kept comin towards me. It was really fun. Then I bfoke out of my trance, and mananged to look up. To my surprise...eveythng had turned to lego, it wasn't the common 4 sided lego, but some alien octagonal lego that was made up of really bright colors. I knew this wasn't the xtc, but I new the amount of shrooms I ate would not have done this alone. I figured the Weed xtc shrooms combo definatly was to thank for the stunning visuals.</p><p>Phase 4</p><p>I was still very extremely high, everyone was drunk and stoned, and my other druggy buddy was in a world of his own on a bed. This is when I experienced some feelings and thought that I didn't really like.</p><p>I remember sitting there, I had chewed a piece of gum untill it was mush, and I tried to swallow it. It didn't quite make it down my throat, it was lodged in the back of my throat. I thought it might find its way into my wind pipe, and I would not be able to breath, but my mouth was so dry and I was in such an alien world, I could not force my self to get some water. So there was, with the thought I might choke to death on a piece on gum, and I was really high. Thats when I had the most weird, strange identity change in my life. I was licking my dry cracked lips and my mouth was like sand paper, and for some strange reason a reminded myself of the star wars character Jabba the Hut (because he licks his lips al the time). Then like magic I was jabbas the hut, me , I actually thought I was jabba the hut, and in my mind I related all of the settings and images in George Lucas's masterpiece STAR WARS, as having direct likenes with the world of narcotics (like weed was like it would be like in the forest in the Return of the Jedi, and evey character in Jabba palace was on Mushrooms) its very hard to explain..and I was Jabba...and definately on mushrooms.  I spent the next hour or so believing this, untill the drugs slowly started to ware off, but it was a long slow come down.</p><p>phase 5</p><p>The night was ending, more weed was smoked, and the best thing in the world happened. My great friend brought me water, I had forgotten what the stuff was, and was blessed to have rediscovered it at the time. We sat, and my friend was still on the bed in a fantasy of his own. We woke him up and my friend gave us a rde to my other friends house where we slept.(Or tried, I just listened to Zeppelin and Primus all night)</p><p>Conclusion</p><p>It was a very good experience having mixed the xtc and shrooms. I found that the xtc definatly hightened the effects of the shrooms, as did the weed. I did xtc one more time after this experience, and it wasn't neary as visual (hardly at all) I did experience some very good emotional feelings as well as some bad ones. But all and all it was a very good experience Other then the cost. I will diffinately do this one again.(Maybe lsd (if I'm ready)</p><p>And it turned out I didn't choke on gum, and I wasn't jabba the hut after all...</p>",
 "year": "2001",
 "id": "13299",
 "gender": "Male",
 "timestamp": "2005-02-21T08:00:00.000Z",
 "views": "6146",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "insufflated",
   "substance": "MDMA",
   "form": "(capsule)"
  },
  "1": {
   "time": "",
   "amount": "3.0 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  },
  "2": {
   "time": "",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
