{
 "id": 13313,
 "title": "Very Easy To Get Along With",
 "date": {
  "submission": "2012-12-27T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Durkamang",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "smoked",
   "substance": "JWH-250",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "JWH-250",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "insufflated",
   "substance": "JWH-250",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I purchased JWH-250 thinking it was complete bullshit and I had wasted $25 on a gram, but it turned out to be the real deal in more ways than one.",
  "Experience One: Vaped off aluminum foil - 10 mg - Hit me with a quick, heavy head stone that left in about 60 minutes. It hits almost immediately and the stone is very much like a mid/high grade non-chronic weed stone with the easy ability to perform various things while stoned. Little cottonmouth, no desire for food.",
  "Experience Two: Ground the end of a cigarette into the powder and smoked the cigarette - 10 mg - Much of the same as experience one, again a very heavy head stone immediately.",
  "Experience Three: Digested - 15 mg - No acetone, no gelcaps, simply the powder sprinkled in your palm, then licked up. After about one hour I was thinking that this method would not work, and then I felt the semi-heavy confusion of mind that comes with a decent stone but the high begins almost 2 hours after ingestion and lasts 3 hours or so. The high is much more time oriented when ingested. In other words, I looked at the clock and it's 6:12. I look at the same clock 15 minutes later and it's 6:13. I was surprised how nice this works when ingested - DO NOT TAKE TOO MUCH.",
  "Experience Four: Snorted - 15 mg - This was really funny but should be heeded by all. I snorted this on the night before work and felt nothing. The next day, around noon, I was at work and I began to clear all of the snot out of my nose and swallowed it. After about 3-5 minutes I began to feel strange and in about 15 minutes I realized I was completely stoned. This really surprised me because I had to dodge being stoned at work for about 2 hours. This JWH-250 powder works like a charm and I think I'll get some more.",
  "WARNING: at doses of more than 15 mg the stone is very high and made me feel very uncomfortable. I would recommend no more than that and do not redose - especially if you are ingesting it."
 ],
 "erowid": {
  "id": "89187",
  "citation": " Durkamang. \"Very Easy To Get Along With: experience with JWH-250 (ID 89187)\". Erowid.org. Dec 27, 2012. erowid.org/exp/89187",
  "substance": "JWH-250",
  "views": "889"
 }
}
