{
 "id": 13327,
 "title": "Achieve a Perfect State of Being",
 "date": {
  "submission": "2004-06-07T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "citanzero",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Codeine",
   "form": "liquid"
  },
  {
   "time": "1:15",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "My friend told me they had a bottle of Nucotuss which they had used hardly any of. The bottle was pretty much full. I had no idea what Nucotuss was until I was told it could get me fucked up as it contained Codein, a painkiller. So right before I left my friends house I got the bottle and I was told to feel free to use as much as i wanted. So I quickly went online to check and couldnt find anything in a rush so I decided to improvise. The stuff (as I later found out) had not only codein in it but a total of three different substances. These were Pseudoephedrine, Codeine, and Guaifenesin. The bottle itself read Nucotuss Expectorant. It said take one teaspoon every six hours. So I got a teaspoon and took seven teaspoonfulls of it. I then went to return the bottle but before I did so I took a big swig straight from the bottle which I do not doubt was more than another three teaspoons (as my mouth was full completely). Even still I will state for the anylization of my experience that I took ten teaspoons. I did this at around 12:45 PM.",
  "T 0 minutes - Ingested 10 teaspoons of Nocutussin",
  "T 15 minutes - I thought to myself I might be experiencing a bit of mellowing. I had a more clear focus of my own personal mood. In having that I could better control my mood.",
  "T 30 minutes - The effects I did not feel were great at this point and my mind was growing skeptical if this would do anything at all. The feeling from before was still there but I thought I might even be imagining it.",
  "T 1 hour - I knew I was feeling something. I strange calm. I could get irritated by little things but no longer than a second, I could realize I was fixating my thoughts on something bad and stop it.",
  "T 1 hour - I looked online and read one report that while on Codein they took marijuana also and felt something unlike and marijuana and codein. They said the two synergized into a new feeling of great calm and euphoria. I had to smoke :) Being rather late into the night it dimmed my chances of being able to, along with the fact I had gone broke yesterday and had no weed of my own. Luckily one of my friends was down to smoke and I admitted having no money and he didnt care.",
  "T 1 15 minutes - I arrived at his house via bike. We smoked a decent sized joint between us of regs. Not the best shit around but I would take it. I remember feeling so happy at his house after I smoked. I before was calm and mellowed, unable to be unrelaxed, but now I had suddenly gotten a great euphoria. It was as I had read online, a new feeling entirely. The whole part of smoking weed where my mind can drift off into thoughts that can make me paranoid or zoned out is not there at all. In fact the only effect the weed has seems to be making me more energetic to talk and do things, a feeling of great happiness, accompanied by extreme relaxation but no fatigue.",
  "T 4 hours 30 minutes - I am back home and writing this article at present. Music is wonderful and it moves my emotions at present. I feel the way the lyrics are meant to be. I feel eager to do things with my mind. My body feels banging and though my high might be gone or wearing away I still feel the same as I did earlier. I hope this stuff lasts a really long time. Anyway, my friend still has a whole bottle of the stuff practically so I might touch up on this feeling again. I do not do drugs habitually, the only reason I try things like this is to experience a new feeling. I do not use anything as an escape and I therefore reccomend none of you reading this do so. Be on a somewhat empty stomach and in a generally good mood. Dont do it near when you would normally be on the verge of going to sleep. I stay up all night in the summer so I was fine in taking it at around quarter of one. I hope you all have enjoyed this story."
 ],
 "erowid": {
  "id": "8925",
  "citation": " citanzero. \"Achieve a Perfect State of Being: experience with Codeine (with Pseudoephedrine & Guaifenesin) & Cannabis (ID 8925)\". Erowid.org. Jun 7, 2004. erowid.org/exp/8925",
  "substance": "Codeine (with Pseudoephedrine & Guaifenesin) & Cannabis",
  "views": "19449"
 }
}
