{
 "id": 13320,
 "title": "Started to Get Really Hooked",
 "date": {
  "submission": "2011-02-23T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "xlPsycholx",
  "gender": "Male",
  "weight": 170
 },
 "dose": [
  {
   "time": "0",
   "amount": "6000 mg",
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "capsule"
  }
 ],
 "report": [
  "[Erowid Note: This report mentions unusually high doses of gabapentin.]",
  "As my anxiety started to increasingly grow out of hand, along with my Bipolar, I was in and out of psychiatric wards for about a year and a half. I was of course given all sorts of medication to get my situation under control. Around August of 2010 I was given Gabapentin (Neurontin) 300mg along with 3mg Klonopin to help ease my anxiety. The effects of Klonopin for me are worth a whole other submission to be quiet honest. I eventually took myself completely off of Klonopin after about a month of use due to abuse of the prescription and the E.X.T.R.E.M.E mood swings and violence that came of it (I ended up minutes away from bleeding out from a cut I did after taking the medicine... nasty). But anyway, as I was taking Gabapentin as prescribed for about a few weeks I notice a relatively great relaxation and mild euphoria that came from taking the medication. About two months have passed and the effects start to get a little dull and I just think that the fun times are over but at the same time the medicine is still working for me and my anxiety as I notice it has gone down a lot from taking it over time.",
  "Skip to about four months of me taking Gabapentin, I ended a four year relationship and started a downward spiral into increased anxiety and depression. Most certainly my social anxiety was at an all time high. One day I start to think about the effects of Gabapentin when I first started taking it and was thinking to myself If I got those effects from a small dose maybe I can get the same effects, or even greater, from a much larger dose. I had taken into account that I have been on the medication for months now and being pretty sure that my tolerance to it is fairly high. So as impulsive as I am I took twenty 300mg capsules of Gabapentin. I was starting to think about 20-30 minutes into it that maybe my tolerance to it was just ridiculously high, but about an hour after taking it I started to really understand that I might have made a mistake, I thought at the moment that I was overdosing, but as time went on (about an hour and a half) I felt so relaxed and euphoric with the want to just go out and hang with my friends or go to a mall or something like that. I felt so in control and to be honest it felt, just a little, like I had taken a bump of cocaine. I was able to take things rationally and I felt like I could take on the world.",
  "No real bad experiences came from Gabapentin to me except in the much... much larger doses I have been taking (As seen down below). It took about 7-8 hours (best guess) for me to get off the high, I was so tired and felt like I could just fall asleep standing up. I didnt really start to take the medicine at this high of a dose on a regular basis until I started to sink into depression more, I used Gabapentin when I was going out with friends or if someone invited me to a party because of my increased social outgoing I was given from taking this medication.",
  "Months passed and I started to get really hooked into Gabapentin that I would run out of medication in about 6 days cause I would take it every day starting from the day I get the prescription (I was prescribed 120 300mg capsules). As a result I started to lie to my doctor to see if she could give me twice the amount so I can take it twice as long as I was. She finally caved in and started to give me 120 600mg capsules, which I took as I usually do with 6,000mg of it. After a while I increased that dramatically up to 15,000mg because I would take about ten of the 600mg capsules and after a few hours I would just take more to keep the high going, eventually taking about twenty-five (15,000mg) over the span of a day. I started to take twenty-five a few hours after I woke up because I became used to the amount. I strongly dont recommend anyone to take this amount of milligrams of this medication. Even though the effects of taking this amount of medication can feel like I am so sedated and at times feeling like a bad trip I still find it very invigorating to me.",
  "At this high of a dosage I start to feel very, very high with accompanying blurred vision, staggering walk, my mind is just at ease but I have a lot of trouble trying to think about certain things. I do, with regret, drive while taking this medication, and I will say that it is somewhat hard to do... I get really cramped in my brain, its hard to think about what to do such as whose turn is it in a 4 way stop sign, and I notice that I tend to swerve sometimes without being able to control it. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]  I also notice that when I smoke a cigarette that it increases my high and makes my eyes keep wanting to look down, weird in a way I know but its true. I, as Ive stated before along with a lot of other people taking this medication, experience extreme increased social ability which is The main reason I take this medication so I can interact with my friends and complete strangers. I am able to carry out conversation like no other, though I do catch myself ranting on and on and getting off topic very frequently. There really to me is no other kind of medication like this, I would say Im addicted to it but whenever I run out I dont really feel the need for it but rather would just like to have it so I can get out of the house if you know what I mean.",
  "I dont recommend anyone taking Gabapentin like I do cause I can only imagine the risks Im taking."
 ],
 "erowid": {
  "id": "89216",
  "citation": " xlPsycholx. \"Started to Get Really Hooked: experience with Gabapentin (ID 89216)\". Erowid.org. Feb 23, 2011. erowid.org/exp/89216",
  "substance": "Gabapentin",
  "views": "16462"
 }
}
