{
 "id": 13326,
 "title": "Pleasant Rush Pleasant Mind",
 "date": {
  "submission": "2011-02-21T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "mountainman",
  "gender": "Male",
  "weight": 94
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "capsule"
  },
  {
   "time": "0:00",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "capsule"
  },
  {
   "time": "0:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Vitamin C"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Sceletium tortuosum",
   "form": "extract"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Leonotis leonurus"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Damiana"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Spearmint"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Lotus/Lily",
   "specific": "Nymphaea nouchali var caerulea"
  },
  {
   "time": "0:00",
   "administration": "smoked",
   "substance": "Cannabinoid Receptor Agonists"
  },
  {
   "time": "0:30",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "capsule"
  },
  {
   "time": "0:30",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "capsule"
  }
 ],
 "report": [
  "Background: I am an overall healthy, 27-year-old male vegetarian. I have used in the past cannabis, psilocybe mushrooms, LSD, a wide range of pharmaceuticals (primarily opiates), methamphetamine, cocaine, alcohol and in a few occasions E/MDMA. More recently I have been experimenting with a number of entheobotanicals including Kratom, Salvia divinorum, and kanna, and research chemicals including JWH -018, -250, -081, -019, and -073. I have been a long-time cigarette smoker but am in a quit phase that has been going about a month. This report documents my first experience with  5-MeO-DALT, and it is the first trip report I have ever attempted to make.",
  "Setting: At home, roommates gone for the weekend. Evening.",
  "Intro: I had been sitting on the 5-MeO-DALT for a while as I wanted to dose it accurately and was waiting for the delivery of a mg scale that I had ordered online. Well today it came, and the idea of dosing the 5-MeO-DALT had been floating in and out of my mind all afternoon. I had been enjoying my smoking blend (damiana, dagga flowers, spearmint, a touch of blue lotus for color and flavor, all washed in JWH-019, -081, and -073) as usual and just playing a computer game when the thought came in again and I ran with it.",
  "I weighed out 15 mg of 5-MeO-DALT as I considered this a happy medium between the threshold doses I had read about and moderate dose. I am generally not overly sensitive to any substance and possess a stout mental fortitude that has gotten me through many a thing so I felt very comfortable starting where I did. I placed the weighed DALT in a capsule with 800 mg of Piracetam. I used the Piracetam to fill out the capsule and also as I am interested in its potentiating abilities. This was taken with 1000 mg of vitamin C and some Apple cider to wash it down. I had not eaten for approximately 4 hours.",
  "A few minutes after taking my capsules, I loaded up a bowl of my smoking blend and decided to throw some kanna on top. I have grown quite fond of this plant in the short time Ive been using it and I highly recommend it. From what I had read, the experience of 5-MeO-DALT felt similar to E/MDMA and this is how kanna feels to me so I thought theyd be a great mix.",
  "5-MeO-DALT came on quickly when ingested, and the rush of the kanna rolled right into the onset of the 5-MeO-DALT. Perhaps the most prominent effect of the 5-MeO-DALT for me was the body high. Rushes of good feelings kept passing through my body, very close to what I remember from the few times I have taken E/MDMA. Auditory enhancement was AWESOME. At first I was browsing the net a bit, listening to deadmau5 and enjoying the kanna. Since I could feel that the 5-MeO-DALT had come on and was comfortable with the amount and type of stimulation I decided to go for a real dose. I weighed out another 15 mg and encapsulated as above, again with 800 mg of piracetam. I lit my hookah and put the most-excellent movie The Wall (Pink Floyd) on as it is classically something I watch on psychedelics.",
  "Whenever a new song would come on the movie, I would get this amazing tingling rush all over my body. The body high with 5-MeO-DALT is just the bees knees. I enjoyed the entire movie, my body filled with these pleasant rushes basically the whole time.  I could feel beneath the rushes the familiar body load of psychedelics, closer to LSD than mushrooms. Also my head was definitely in a different space. Toward the end of the movie I started feeling really hungry. I made some blueberry Eggos and used them as the bread in a peanut butter sandwich. I also had a can of peaches and a roasted almond granola bar. It all tasted quite good, though there was no real dramatic increase in taste sensations. About this time the movie was over and I decided to play some guitar. Wow! I am still very new, but found on the 5-MeO-DALT that my fingers found the strings I wanted effortlessly and likewise it was very easy to sing in tune. I played and sang for about 40 minutes and it was very very enjoyable. At this point it was about 3 hours after my first capsule (about 2.5 after my second). The peak had gone but a pleasant body high and euphoric afterglow remained.",
  "Conclusion: 5-MeO-DALT is a very enjoyable substance which, for me, had absolutely no negatives or draw backs to the experience. I would consider it a mild psychedelic, not something to take to really go out of my mind or to see amazing things but a great, pleasant experience worth repeating. Its short duration, pleasant afterglow, and no hangover makes it a great weekday psychedelic. I think in general the 30 mg dose is good, but I will probably experiment with a bit more some time in the future, maybe around 40-45 mgs.  Of course, know your own mind/body/spirit and be responsible, but if youve been considering trying this substance I totally say go for it!",
  "[Reported Dose: '30 mg 5-MeO-DALT, 30 mg Sceletium tortuosum 15X extract, 10 mg JWH-073, 10 mg JWH-019, 10 mg JWH-081, 1600 mg Piracetam, 3 bowls dagga']"
 ],
 "erowid": {
  "id": "89246",
  "citation": " mountainman. \"Pleasant Rush Pleasant Mind: experience with 5-MeO-DALT, Piracetam & Smoking Blend (ID 89246)\". Erowid.org. Feb 21, 2011. erowid.org/exp/89246",
  "substance": "5-MeO-DALT, Piracetam & Smoking Blend",
  "views": "7450"
 }
}
