{
 "id": 13336,
 "title": "AMT Toxicity Warning",
 "date": {
  "submission": "2001-08-22T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mad Dog",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "70 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "  This is a warning about the toxicity of AMT.  A friend and I ingested 35mg and 70mg of AMT, respectively, with no other drugs.  We had a good trip for eight hours, then both became very sick.  My friend (110 lb. female) began to sweat profusely and vomit.  After about 30 minutes she was unable to sweat or urinate, and began to run a high fever.  She began to lose consciousness, but i was able to revive her to some extent with a damp rag, chicken broth, and plenty of drinking water.  At this time, I began to sweat profusely, and shortly was unable to sweat or urinate.  Although these seem to be obvious signs of kidney failure, I did not call an ambulance do to the general ignorance of AMT and improper treatment which can be given for overdoses of unknown substances.  After about one hour, my friend had gained full consciousness, but was unable to sweat or urinate, and had trouble gaining enough energy to vomit.  At this time, I began to lose consciousness, and was slowly revived in the same manner.  For the next two hours, we continued a cycle of swallowing water, chicken broth, and sugar water (our muscles were too weak to vomit without any quickly metabolized calories).  After the third hour, we were brought some acetaminophen suppositories, which were extremely effective in alleviating fever.  After the fever was broken, we were able to urinate, and our skin became moist again.  Full ability to sweat came about three hours later.",
  "My friend had recently had a kidney infection, though my kidneys were relatively healthy.",
  "In conclusion, AMT seems to have a high renal toxicity, and this merits research and greater caution in its use."
 ],
 "erowid": {
  "id": "8930",
  "citation": " Mad Dog. \"AMT Toxicity Warning: experience with AMT (ID 8930)\". Erowid.org. Aug 22, 2001. erowid.org/exp/8930",
  "substance": "AMT",
  "views": "14882"
 }
}
