{
 "id": 13331,
 "title": "Drunk and Off-kilter",
 "date": {
  "submission": "2004-05-12T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Junglist",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "7.0",
    "quantity": "7.0"
   },
   "administration": "oral",
   "substance": "Amanitas",
   "form": "plant material",
   "specific": "A. muscaria"
  }
 ],
 "report": [
  "My Amanita experience took place on june 12, 2001.  I had not taken any psychedlics in some 3 years, due to a major fear of bad trips.  As far as these mushrooms went, all I knew was that these were 'different' than psilocybin's.  I decided to eat them by themselves (bad idea...they taste AWFUL!!!) with a friend of mine, on a whim at around midnight.  I wound up falling asleep not long after I took them.  The friend that had purchased these mushrooms took notes on my experience until around 3:30 am...she decided to go to sleep because she thought I had fallen asleep. ",
  "Not long after she went to bed, my trip took a MAJOR turn for the better.  I wound up having the most vivid and intense visions I have ever had in my life.  I thought that I had died...I saw the creation of the universe and other universes.  I came to FULL terms with the reality of existense in this reality, as well as other realities.  Within a half an hour of experiencing all this, I woke myself out of my visionary slumber.  I woke my friends up to have them take better note of what I was doing. ",
  "I felt drunk and off kilter. My hallucinations were extremely wild, but utterly non-psychedlic.  I wound up going into a complete state of delerium...I was just firing off random words, and was making NO sense, or so my friends say. ",
  "I tried to wake up my friend who was tripping, but she could NOT be woken up.  She subsequently went for 8 hours without being woken up, and she could not describe her experience for weeks.",
  "It is a brutally powerful non-psychedelic world, and would freak mosa lot of people out.  Not for the weak minded..."
 ],
 "erowid": {
  "id": "8928",
  "citation": " Junglist. \"Drunk and Off-kilter: experience with Amanita muscaria (ID 8928)\". Erowid.org. May 12, 2004. erowid.org/exp/8928",
  "substance": "Amanita muscaria",
  "views": "10543"
 }
}
