{
 "title": "Flashback in 4D",
 "author": "CynicalMagician",
 "citation": " CynicalMagician. \"Flashback in 4D: experience with Cannabis & Salvia divinorum (6x extract) (ID 13342)\". Erowid.org. Jun 16, 2007. erowid.org/exp/13342",
 "substance": "Cannabis & Salvia divinorum (6x extract)",
 "bodyweight": "135 lb",
 "report": "<p>This is an interesting experience involving what seemed like a flashback of a salvia trip I had about 2 weeks prior. First the salvia trip (because it relates).</p><p>I had never broken through with salvia before, so this was my first time really getting an experience with the plant. I had smoked marijuana about 1.5 hours prior to this, so I was still somewhat high. I had my room to myself, so I turned off all the music & lights and got my bong and some salvia extract that I had ordered online out. I fired it up, and started feeling really heavy. I didn't want to not have an experience again, so I kept hitting my bong and reloading the bowl. By the 5th or 6th hit I moved over to my bed and turned off the light and layed down.</p><p>I felt an amazing cold texture almost like gravel where the blankets touched my face, and when I looked up again I saw that I was on a beach, looking out over the water. I was unable to get up and move around, but I watched the sky and the general scene for a little while. Also, the internal monologue that you have in your head when you're thinking had changed into a strange cajun accent, and it was leading my thoughts around. I can't recall what it was saying though. When I did close my eyes, I would see images of red green and blue figures moving around in slow patterns.</p><p>The way it felt like I was 'teleported' between reality and this beach was amazing. It felt like that as I was laying on the bed, I felt like my body would gain another dimension (ie. length, width, height, _______ ), that felt strange in the way that it feels when you're hanging upside down, but 100x more so. Eventually I came out of my trance and entered reality again. The rest of the trip isn't important to this experience.</p><p>Anyway, 2 weeks later or so, I was smoking some good weed out of my bong, and I smoked a fair amount, more than I normally would, because it didn't feel like I was getting as high as I wanted. However, I forgot to note that the peak high of cannabis occurs in about 15 minutes, not right away, so 15 or so minutes later I got just blown away. I was higher than I had ever been with weed, in memory anyway, and my vision was starting to trip out with colours and patterns. Uncomfortable though. I knew I was too stoned.</p><p>I went back to my bed and laid down, and had the same feeling on my face where the blankets touched me as when I tried salvia. I was surprised at this, and proceeded to explore the situation with my mind, trying to relax and concentrate on flowing where the high wanted to take me. After about 30 seconds I felt like I had a 'flash' of in and right back out, of the same dimensional body feeling as salvia had given me. It felt as though I changed from 3d to 4d, and then was gone again. I continued to explore the feeling, but could never stay in 4d for very long. Still interesting though.</p><p>I had never associated weed with this level of psychedelic experience before, and although is was scary and unfamiliar at the time, it was really interesting. I hope to try salvia again sometime, and perhaps that will shed some more light on this experience.</p>",
 "year": "2002",
 "id": "13342",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-16T07:00:00.000Z",
 "views": "4131",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 }
}
