{
 "id": 13342,
 "title": "Crystal Portal to TruthLove",
 "date": {
  "submission": "2011-11-07T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PsychAJelic",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "administration": "smoked",
   "substance": "DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "N, N Dimethyltryptamine: Crystal Portal to Truth",
  "As soon as the DMT vapor entered my physical system, it happened. Everything Ive ever heard about DMT is true and infinitely more. Words cannot ever come even close to explaining the overwhelming profoundness of what happens, but for now, these shadows of words will have to do. Nothing you have ever cognitively understood or observed in your life could ever prepare you for the truth you experience and ultimately become when you encounter those tiny crystal doorways to love.",
  "Anyways, I took my second lungful and that was it for me. Immediately I was caught up in what I can only inferiorly verbalize as Absolute Truth. I was literally transported into a higher dimension (I say higher only because I know total and permanent union with the Absolute could only be the highest.). Instantly the illusion of the ego and the adulterated reality of our present dimension evaporated just like those tiny crystals, as did time and space. I suddenly found myself in the realm of the Highest-Self. In that realm I saw what existence truly was. I saw what I truly was. I understood that I was all things, and the sudden overwhelming force of true and pure love washed over my entire being.",
  "Love, I know now, is the most powerful force in Existence, it absolutely is. In that moment I was everyone I ever loved, and everyone who ever loved me. Everyone I ever knew, and everyone who knew me. I was everyone I ever hated, as well as everyone who ever hated me, except now the concept of hate was a complete and utter impossibility. I was one with all things. In a single moment the True Wisdom of Existence totally encompassed and pulsated through every iota my being. I understood. I was One, All things became One. Human vocabulary cannot at all accurately describe the state of being I was allowed to experience. That state of being is what humanity has always yearned and searched for. That state of being is what I understand now to be what humanity has described as 'God'.",
  "Yes God is real. God is the 'Higher-Self'. God is the Non-Self, the Self completely devoid of ego. In that moment ego was absolutely incinerated. Like hate, it was an utter impossibility. Ego is what separates us from genuinely understanding the Truth of Existence. It is what keeps us from acknowledging that we are all actually of One Essence, of One Being. That there actually is no distinction in existence, It is all one. We Are Existence. We Are The Absolute. Now I understand what One Love means. Love is Us. Its been over an hour now since the experience but the truth of love is still shining ever so brightly and it truly has changed my life. I will never be the same. Truth is all that really exist. I am absolutely, positively sure now, Everything will be okay.",
  "Anyways its been quite some time now, but I still vaguely but somewhat vividly recall the attributes of the experience. Yes, as common knowledge about DMT says, after a while it does become like a dream, only vaguely sensed, only vaguely comprehended. After all, every night, in every human brain it is what causes dreams, N, N Dimethyltryptamine. But that revelation of truth profoundly shook my whole being, it savagely changed all I knew. I know without a doubt that was what is really real and thats where everything is headed.",
  "To end with, I encourage who ever is reading this to do your own research on this beautiful and awe-inspiring molecule, and when it comes to you, embrace it and allow that Supreme Intelligence to guide you as I know it will. There has never been anything to ever have come close to where I was brought to that day, so beautiful. Words are a grave injustice. When it comes to you, youll see., and youll see I was right there with you. Believe me, youll understand. Much, much Love to you. Whoever You Are."
 ],
 "erowid": {
  "id": "89332",
  "citation": " PsychAJelic. \"Crystal Portal to TruthLove: experience with DMT (ID 89332)\". Erowid.org. Nov 7, 2011. erowid.org/exp/89332",
  "substance": "DMT",
  "views": "2557"
 }
}
