{
 "title": "Dreams of Nothing",
 "author": "Datura_Leaf",
 "citation": " Datura_Leaf. \"Dreams of Nothing: experience with Chlorpheniramine Maleate (ID 13347)\". Erowid.org. Sep 21, 2005. erowid.org/exp/13347",
 "substance": "Chlorpheniramine Maleate",
 "bodyweight": "165 lb",
 "header": [
  [
   "DOSE:",
   "192 mg",
   "oral",
   "Chlorpheniramine Maleate",
   "(pill / tablet)"
  ]
 ],
 "report": "<p>I am a natural insomniac, never getting more than 2 hours of sleep a night, so I am always looking for a way to get a solid uninterupted 8 hours of sleep. I've been reading a lot about Chlorpheniramine maelate (I will call it Cm from now on), mostly in conjunction with DXM, but almost never by itself. After a little bit of research, I found out that Cm was an antihistamine, and one of the side effects was drowsiness... kool... so I bought a pack of Chlor-Tripolon. Before I took them, I grabbed a couple of blankets and a pillow, which I threw on the couch. Then I swallowed all the pills (I never do things halfway, but don't recommend it, there are dangerous side effects... seizures, comas etc...) I started playing computer, for about an hour when a sudden intense weariness came upon me. I tried to finish my game of Starcraft, but I couldn't keep my eyes open. It was all I could do to stumble over to the couch and flop down on it. Before my head hit the pillow, I was snoozing like a baby. I never dream, but tonite I did. It was quite weird actually, I dreamt of nothingness, the dream gradually shifted from pitch black to starck white, and back again; over and over. I was dreaming about nothing, but I was still dreaming.</p><p>13 hours later I finally woke up. My roommate told my that he put my blanket on me, cuz I was asleep before I lay down. He also said that I wuz unwakeable, almost in a comatose state and barely breathing. It took about an hour after I woke up before I had the energy to move, speak or even smoke... and about 4 hours before I felt normal again. In conclusion, what I did was very dangerous, I won't take more than 72mg next time.</p>",
 "year": "2002",
 "id": "13347",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2005-09-21T07:00:00.000Z",
 "views": "26512",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "192 mg",
   "administration": "oral",
   "substance": "Chlorpheniramine Maleate",
   "form": "(pill / tablet)"
  }
 ]
}
