{
 "id": 13343,
 "title": "Good Night Great Day After",
 "date": {
  "submission": "2011-08-24T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tom",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "15:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Tryptophan",
   "specific": "5-HTP"
  }
 ],
 "report": [
  "About a week ago a few friends and I decided to trip, we each had an eight of mushrooms and a hit of molly, about 100mg MDMA but we didnt weigh it. The trip was great. We got good quality mushrooms and molly, which was good because I didnt know the supplier of either. But all in all a pretty normal trip with friends.",
  "But what I'd really like to report is the day after. Normally after a mushroom trip I feel... off, like everything isnt quite how I remembered it the last time I was sober, and normally after taking MDMA I feel like I got hit by a truck. I woke up the morning following the trip feeling quite similar. Pushing 15 hours after we had started the night before I felt tired but I couldnt sleep, sore, thought process was slowed. Generally just not well, which I was used to. My friend noticed that I looked like a zombie and offered me some of his 5-htp, he told me it might make me feel better, and I figured, its over the counter, what could it hurt. Not long after I got a ride home, feeling quite zombified the whole way, when I got home I showered, and then ate. Which is odd for me following a night of MDMA use. Then I sat on the couch and watched tv with my family, I started to notice that I felt really good, not high just good, I was thinking on an even level. I wasnt depressed, I had the motivation to participate in trivial conversations, and after a few hours I took a long nap, woke up for a few more hours and then went to sleep.",
  "The next few days I felt completely normal, maybe better than normal. Not high, just in a good mood, content. 5-htp seemed to completely counter-act the seemingly inevitable 3-day down from MDMA I became accustomed too. All in all I would highly recommend 5-htp to anyone coming down from a night of MDMA who has to work, or is just looking to avoid the down"
 ],
 "erowid": {
  "id": "89339",
  "citation": " Tom. \"Good Night Great Day After: experience with Mushrooms, MDMA & 5-HTP (ID 89339)\". Erowid.org. Aug 24, 2011. erowid.org/exp/89339",
  "substance": "Mushrooms, MDMA & 5-HTP",
  "views": "4111"
 }
}
