{
 "id": 13352,
 "title": "Surprisingly Relaxing and Beneficial",
 "date": {
  "submission": "2013-11-21T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Flanders",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "425 mg",
   "administration": "oral",
   "substance": "Skullcap",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "850 mg",
   "administration": "oral",
   "substance": "Skullcap",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I originally did not use skullcap for recreational purposes. I found out about it while looking for herbs which could reduce the anxiety I got from some drugs such as cannabis. Before this I had tried St. Johns Wort, which simply made me feel more emotionless than calm, and also seemed to worsen my ADD.",
  "I got the skullcap in a bottle of 200 425 mg capsules, sold as a dietary supplement from a local health food store. The bottle said to take up to 3 capsules up to 2 times a day. After doing some research I found that 3 capsules should only be used in serious situations. Since I am fairly light weight I decided to start with only 1 capsule, just to see what effects it would have.",
  "Thinking any effects would be mild, I took it in the middle of the day in my room. Having ADD I quickly forgot I had taken it and began surfing the web. Then, around 15 minutes later, I suddenly noticed some pretty strong effects. As has been mentioned in other posts I have read, Skullcap seems to have a high fairly similar to Marijuana, but only in certain aspects. It seems to carry some of the overall haze which an indica strain delivers, and less of the euphoria, characteristic of cannabis.",
  "Anyway, I was sitting on my computer, and began to feel very relaxed and mellow, much more so than I had originally expected. Although My parents were home and I realized I was pretty high, I got none of the anxiety or fear which I would have gotten from marijuana.",
  "About half an hour after I had to have dinner with my parents. This was very strange because I could literally see myself from out of my self. It was like I had a third person perspective on the situation. I engaged in some interesting conversation with my parents, and seemed to arouse no suspicion. I was able to be very confident in my surroundings and I seemed to be able to completely control my self in a way I could not normally do.",
  "Dinner ended and I went back in my room. Over 2 hours had passed since I originally took thee Skullcap, and while the effects were weaker than earlier, they were still pretty strong. From here I started to do my homework. Because of my ADD this is usually a difficult task, I always get distracted and forget what I was working on, especially on math. I had heard from at least one source that Skullcap had been used to treat ADD but I didn't give it much thought. Anyway, I began working on my math and was surprised at how easily it went. I could stay focused on my work for much longer than usual, and was able to keep my thoughts very organized and directed at the current task. I was also able to do arithmetic, such as dividing fractions, much more quickly than I normally could. Overall it took me about 30 minutes to do an assignment which would have normally taken over an hour.",
  "After a total of about 4 hours, almost all of the effects were gone. They were mostly gone after 3, but were still noticeable.",
  "Later that night I took 2 capsules of Skullcap before smoking a bowl of marijuana. It seemed to magnify the high, and got rid of all anxiety or body shaking I would normally have. I did not directly notice it's effects while on cannabis, other than that I was higher.",
  "In conclusion this has proved to be a very useful herb. It helped me significantly with stress, muscle tremors, and ADD. Unlike Marijuana, it does not interfere with my mental capacity. So overall I have found this to be a very useful herb, both recreationally and medically."
 ],
 "erowid": {
  "id": "89402",
  "citation": " Flanders. \"Surprisingly Relaxing and Beneficial: experience with Skullcap (Alone and with Cannabis) (ID 89402)\". Erowid.org. Nov 21, 2013. erowid.org/exp/89402",
  "substance": "Skullcap (Alone and with Cannabis)",
  "views": "488"
 }
}
