{
 "title": "Light Aesthetic Appreciation",
 "author": "Zam",
 "citation": " Zam. \"Light Aesthetic Appreciation: experience with 2C-D (ID 13361)\". Erowid.org. Mar 19, 2002. erowid.org/exp/13361",
 "substance": "2C-D",
 "bodyweight": "210 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "1.5 mg",
   "insufflated",
   "2C-D",
   "(powder / crystals)",
   " T+ 0:30",
   "10 mg",
   "oral",
   "2C-D",
   "(powder / crystals)",
   " T+ 1:00",
   "10 mg",
   "oral",
   "2C-D",
   "(powder / crystals)"
  ]
 ],
 "footer": [
  [
   "2002",
   "13361",
   "Male",
   "",
   "Not Given",
   "Mar 19, 2002",
   "17589",
   " "
  ]
 ],
 "report": "<p>I weighed out a little over 20 mg of 2C-D.  The material is from an unknown chemist, synthesized in 1996 or so.  Nicely formed, fluffy crystals, slightly off white, almost a peach cream color.  Measured my resting BP & Heartrate at 104/65 52pm , 110/64 60bpm.  We got a new wrist-cuff blood pressure device last year, works great and easy to use.  Highly recommended.</p><p>I've had 40-50mg of caffeine during the day so far, in soda. I taste the material, bitter but not as strongly bitter as many phens.</p><p>T+0 mins: insufflated 1-2mg lightly, distinct burning sensation, causes my nose to run. I wouldnt want to snort a full dose of this.  Caused a burning-cold sensation in the back of the roof of my mouth, semi unpleasant.</p><p>T+30 mins: took half the oral, about 10mg, mixed in water.  Taste is not horrible. Distinct chemical bitter flavor.</p><p>T+60 mins: Take rest of material (total of 20mg oral and 1-2 insufflated at this point).  First alerts present.</p><p>T+90 mins: Noticeable increase in effects, decide to take BP again: 121/70 58, and 123/72 59. So my BP has increased, but not my pulse.  Increased in awareness of skin sensations.  Yawning repeatedly, a common side effect of tripping for me.</p><p>T+100 mins: A distinct Shulgin ++.  Effects are light but persistent and present.  I find myself easily enmeshed in aesthetics.  I spend the next couple hours playing with photographing items and examining seeds and flowers with a magnifying glass.  I chat with my partner and on irc and my mood is light, fun, and friendly.</p><p>T+2-3 hrs: Distinct, but light, phenethylamine muscle shudders & energy. I never find them particularly pleasant and at high levels they can be bothersome, but here they are just a sense of physical energy.</p><p>T+3.5hrs : effects distinctly waning, feel good, upbeat, relaxed.  </p><p>T+4 hrs : Start drinking a strongly hoppy beer, beer effects begin to overwhelm the 2C-D effect.  No significant synergy as the 2C-D effects are mostly gone.  Mild lingering 'I took a phenethylamine or something' feeling in my head and body.</p><p>Day After: Noticeable, but extremely mild after effects present.  I am particularly sensitive to hangover effects and find the level of after effect from the experience quite acceptable for the mild experience. It is different from, but on the same scale as, smoking a bunch of cannabis the night before.</p><p>Overall, very pleasant, about 3 hours of mild intoxication, enhanced aesthetic appreciation.  Some skin sensual sensations that could be fun to explore sexually, but not a strong erotic push at all.  Very little visual disturbance.  Distinct mood lift.  Definitely something I would repeat.</p><p>Its hard to compare to other 2C- phens because the effects were so light. I've worked with 2C-B quite a bit and 2C-I a little, but comparing how much body effect this had compared to 2C-B is hard.  Perhaps about the same?</p>"
}
