{
 "title": "My Beloved Partner",
 "author": "Reene",
 "citation": " Reene. \"My Beloved Partner: experience with Caffeine (Pepsi) (ID 13373)\". Erowid.org. Jul 16, 2005. erowid.org/exp/13373",
 "substance": "Caffeine (Pepsi)",
 "bodyweight": "160 lb",
 "header": [
  [
   "DOSE:",
   "200 mg",
   "oral",
   "Caffeine",
   "(daily)"
  ]
 ],
 "footer": [
  [
   "2002",
   "13373",
   "Not Specified",
   "",
   "Not Given",
   "Jul 16, 2005",
   "23961",
   " "
  ]
 ],
 "report": "<p>I was 12 when I began consuming a can or two (38.4-76.8 mg) of caffeine a day. Before that I had drunk maybe once every few days, and doing so would make me extremely energetic, allowed me to concentrate on any one thing (or many things at once) and, sometimes, if I hadn't had any for a week or so, jittery, excitable, and unable to sleep for at least 5-6 hours following. When I was 13 it was a can a day, every day. If I didn't have my usual amount, I'd get severe abdominal cramps, stiff joints, chronic twitching, and a painful migraine I would have to take prescription pills for (which also happen to contain caffeine) which would make me sleep for about 12 hours. The next day I'd crack open another can as soon as I got up. Considering I am raised by a single parent working at a drug store, the cost of keeping cans of Pepsi in the fridge got costly. Thusly, I was forced to quit for two painful months.</p><p>After the remaining supply of Pepsi was gone, I found it replaced with a cheap generic brand, that lacked any and all caffeine. My mother knew of my little problem with caffeine withdrawal, so she figured anything carbonated that tasted vaguely like Pepsi would be like a placebo. Needless to say - it wasn't.</p><p>The first few days weren't as bad. Some placebo effect took place - my joints weren't stiff, the cramps weren't as bad, and my headache could be cured with a few 800 mg acetaminophen. However, my sleep pattern was out of whack - one night I would fall asleep at 6 pm at night and wake up at 4 in the morning, the next night I would stay awake until 1 or 2 in the morning and sleep until noon, and I could not be woken up, even for school. Speaking of which, my grades began falling. I couldn't concentrate on anything. Word problems and algebra equations that would take a few seconds to do took me up to a half an hour to work out. Homework was a thing of the past. A straight A average dropped to a C rather quickly. Small headaches rose to blindingly painful migraines that occurred every other day. This happened for approximately two weeks before the symptoms became MUCH less severe. By the time the first month was done, I was fine, and the second month was much better, although I still couldn't concentrate like I used to be able to.</p><p>After that, I had my caffeine back, and I found myself able to be VERY hyperactive with just one Pepsi. Over time the amount I consumed rose to two cans a day, three cans. I would get a 24 oz at school every day and lump 3 cans on top of that when I got home, downing one can every 10 minutes or so, more (about 345.6mg) on weekends, holidays, and breaks.</p><p>And it continues like this to this day. As of now I consume Pepsi (Which still remains my drink of choice) like there is no tomorrow, I chew caffeinated gum, and I drink coffee and cappuccino when I motivate my lazy self to walk to the local convenient store for some. All of this is what it takes to merely function.</p><p>I've admitted to my friends and family that this is an addiction, though it's not one we often think about. That morning cup of coffee, a can of soda in the afternoon, nobody really thinks about it. But from my own personal experience, I can honestly say that opiates are easier to get off of than caffeine. I haven't tried to get off of caffeine for months, but the amount I consume every day has progressed to the point that getting off would be quite a task. I don't have plans on attempting it.</p><p>It is such a wonderous drug, though, and a godsend to geeks such as myself everywhere. I've never had trouble focusing on writing a story or poem, or on writing a new bit of code. However, it has it's pitfalls just as everything else, and moderation is and always will be the key to a happy, healthy addiction. ;)</p>"
}
