{
 "id": 13372,
 "title": "Really Scary Combo",
 "date": {
  "submission": "2011-02-14T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Ravunker",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "15 mg",
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "powder / crystals"
  },
  {
   "time": "0:00",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "powder / crystals"
  },
  {
   "time": "0:50",
   "amount": "115 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "powder / crystals"
  },
  {
   "time": "2:00",
   "amount": "85 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "powder / crystals"
  },
  {
   "time": "4:00",
   "administration": "oral",
   "substance": "Pharms - Eszopiclone",
   "form": ""
  }
 ],
 "report": [
  "A few days ago I had a really intense RC experience that I think changed my outlook on the whole scene now.",
  "I recently found a great RC website that had quite a product line of exotic RC's. I made a large purchase, and received the goodies few days later.",
  "I had taken 2C-E and 4-HO-MET before, but something went wrong this night.",
  "I started off with taking 15mg of 4-HO-MET and 20mg of 2C-E, weighed out, and parachuted. After 50 minutes, I took 115mg of 6-apb, which was a a light tan color. After 1.5 hours of taking the first dose of anything, I started to feel the familiar waves of the phen/trypt combo. I was watching Family Guy and having a blast.",
  "At the the 2 hour point, I didn't feel like I was rolling much with the initial dose of 6-apb, so I took another 85mg of it, parachuted, with some juice.",
  "At the 2.5 hr mark, something felt very wrong. I looked over at my buddy, and told him 'Something isn't right'. At this point, the bad trip began for the rest of the night. Somewhere in the mix I did something wrong, and I started to feel really shitty. Increased heartbeat, bad paranoia and anxiety. The visuals I had were very sadistic, sinister type visuals, can't really explain it any other way. My right arm was going numb, and I had to constantly rub it and try not to lay down and give in. This horrible feeling lasted for 2 hours. It was a bad trip gone horribly wrong, and the idea of dying was constantly being circulated in my head.",
  "After the crazyness, I procured some Lunesta to comedown, and started to gain control. After this point (4 hrs total later) I was in a cracky mood where I was all over the web, on multiple websites, tweakin out, listening to music, just trying to chill.",
  "This night completely scarred me and I don't think I well ever do a combo night ever again without proper research."
 ],
 "erowid": {
  "id": "89530",
  "citation": " Ravunker. \"Really Scary Combo: experience with 4-HO-MET, 2C-E & 6-APB (ID 89530)\". Erowid.org. Feb 14, 2011. erowid.org/exp/89530",
  "substance": "4-HO-MET, 2C-E & 6-APB",
  "views": "13735"
 }
}
