{
 "id": 13373,
 "title": "Entered",
 "date": {
  "submission": "2011-09-03T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": 78
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Cannabis",
   "form": "cookie / food"
  },
  {
   "time": "1:30",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "DPT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "9:00 ate some chocolate cannabis bar",
  "10:30 smoked about 20 mg DPT freebase in the machine.",
  "10:35 a bit nervous on the come-up.  Closed eyes, feeling just a bit queasy and anxious with some strange body sense though not unpleasant, and racing thoughts, changing to closed-eye visuals, mainly of Africanized looking art representing scenes of life in nature,  but in that odd tryptamine visual feedback kind of way.",
  "After about 5 minutes of that began to settle back into the trip.  I remember thinking about unity consciousness and the inevitability of folding back into the all.  I became conscious of being myself but also being another being in another dimension having a conversation with someone else about whether or not to enter me, whether I was ready, etc.  It took a while but I realized this was about whether I was a suitable vehicle for this other being, who was also me in some other dimension.  What the conversation was about was whether I was going to be able to sort of push through death, when that came, not by submerging myself back into the stream of energetic consciousness which is life, but by charging into death with my still-individuated consciousness, treating death not as the end but as a new beginning, as an opportunity.  Somehow this being from this other dimension decided I was ready and entered me.   This was all a very humbling and strangely inspiring experience, possibly deeply delusional, but meaningful.",
  "11:15-11:30  wrote the above."
 ],
 "erowid": {
  "id": "89533",
  "citation": " anonymous. \"Entered: experience with DPT & Cannabis (ID 89533)\". Erowid.org. Sep 3, 2011. erowid.org/exp/89533",
  "substance": "DPT & Cannabis",
  "views": "2848"
 }
}
