{
 "id": 13388,
 "title": "IM-Administered Rebirth Experience",
 "date": {
  "submission": "2011-02-27T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "cerebral flux",
  "gender": "Male",
  "weight": "78 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "IM",
   "substance": "DPT"
  },
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "IM",
   "substance": "Methoxetamine "
  }
 ],
 "report": [
  "Yesterday I decided to 'pop the cherry' with DPT. Since I tried DMT by intramuscular injection in doses up to 60mg I decided to jump in with both feet and start with 50mg DPT hcl. There was also 40mg methoxetamine in the same barrel, to ease the transition into (DPT-) hyperspace. My girlfriend played the tripsitter, so she stayed sober (stoned). A friend of mine was eager to try it as well, so he came by and took only a little less than me (10% less of both or so).",
  "So we lay down in the living room and injected simultaneously in the upper thigh (clap, clap). As we finished my girlfriend turned off the lights and left the room.",
  "About 4 minutes later my friend started to speak some words, words like 'no' or 'shit' in a really whiny fashion. So it was already taking effect, but not much more than a tryptaminy-fuzzy look to the world. A few minutes the experience started to get intense. The room around me took on a really bizarre style and it became difficult to tell if my eyes were open or closed. At the same time those really weird sounds appeared, just like on DMT, yet so different. They became louder and louder until my whole auditory perception consisted of a very loud deep frequency. My body felt really strange by that time, it seemed to me as if my bones consisted of strings bending outwards, trying to get out of the cage of my body. This feeling grew stronger until my body was gone.",
  "At this point there were corridors and I was laying in them, in fact infinite amounts of me were laying in them. Each corridor had an infinite amount of me in it and there were infinite amounts of those corridors. I started floating to the corridors, looking at each one of my selfs, laying there. At some point my perspective shifted, as if I'd look into another direction. I was one of those selves now. Then I stepped out of the self laying there, it really made sense now. After this point my memory is a real mess, I'd fail to describe what happened then, ego loss that's for sure.",
  "Half an hour later I was able to move again. I looked at my hands, which consisted of a slimy goo as the rest of my body. When I moved my fingers they would stick to other fingers and merge to one limb in the end. My friend was crying now and it was freaking me out, so I stood up and left the room. I felt reborn and couldn't stand this whiny mess... I walked to my girlfriend and tried to tell her what just happened. It didn't work, all I could say was nonsense, but I knew it. At that time I felt like a toddler, beginning to figure it all out.",
  "At t+2h I was baseline again. What a ride! I didn't regret starting out with such a dose. It seems to me that if DMT represents life, DPT is the force behind it. It's more abstract to me and not as gentle. Next time I will take more DPT, less methoxetamine or possibly no methoxetamine at all.",
  "Surprisingly my friend wasn't having a really bad trip at all he just wasn't prepared for the intensity as he never achieved the 'higher states' on smoked DMT because he can't smoke bong properly..."
 ],
 "erowid": {
  "id": "89635",
  "citation": " cerebral flux. \"IM-Administered Rebirth Experience: experience with DPT & Methoxetamine (ID 89635)\". Erowid.org. Feb 27, 2011. erowid.org/exp/89635",
  "substance": "DPT & Methoxetamine",
  "views": "7567"
 }
}
