{
 "title": "House of People",
 "author": "RITjoker",
 "citation": " RITjoker. \"House of People: experience with Salvia divinorum (ID 1338)\". Erowid.org. Sep 11, 2000. erowid.org/exp/1338",
 "substance": "Salvia divinorum",
 "bodyweight": "200 lb",
 "header": [
  "DOSE:",
  "25 mg",
  "smoked",
  "Salvia divinorum",
  "(extract - 10x)"
 ],
 "report": "<p>I had been anticipating getting salvia in the mail for two weeks now. I had tried regular salvia leaves once before, achieving nothing more than a *stoned* feeling. When I received my products in the mail, I located a bong and sat down to hit a small bowl in my room.</p><p>I had 4 friends standing with me, all of whom are experienced with LSD and the like, but had never heard of Salvia before I told them about it. I had prepared myself by reading about salvia on the internet, and told them what to expect (typically users of salvia will forget they smoked salvia, and will act confused). I lit the small bowl (25 mg 10X enhanced leaf) and inhaled the whole thing in one bong hit.</p><p>My heart was racing. Not from the salvia itself, but from anticipation of it, and hearing how strong it could be. What came next is strange, but in a way similar to an LSD trip.</p><p>I started feeling stoned, and was waiting for the effects to come on. Before I knew it I had launched into the salvia dimension, but had difficulty figuring out what I was experiencing.</p><p>I looked at my friends who were all standing near me waiting for me to say something. Behind them I saw my doorway, but my friends were the doorway and the door. This was confusing, so I looked to the other side of the room, and I saw images of my friends all standing side by side, as if they were now the wall. When I stared straight ahead, I 'knew' or 'perceived' rather than saw, millions and millions of people, all stacked upon each other like blocks, for miles ahead as far as I could see.</p><p>Soon it felt like the salvia trip was wearing off, so I turned to my friends to talk to them, but when I looked at them, it was like looking at a rolodex. My friend standing there was the 'top paper' in the rolodex, and there were images of him protruding from his front and back. This happened every time I looked at one of my friends, but didnt seem to happen if I looked at an object, nor did it feel like it was happening to me (I wasn't aware of my own body most of the time, except when I launched into salviaworld, I felt my head droop but could not make myself move it). The trip took around seven minutes, but feels shorter.</p><p>The two disappointing things about salvia are:</p><p>1. The stronger 5X and 10X extract needed for even mild trips are expensive, and last only a short time.</p><p>2. Unlike LSD or MJ, you don't really remember that you have taken a drug, so that you can't really appreciate the effects as you experience it. Basically, you are just trying to make sense of it all, and only when you finally come down, is when you realize how powerful the trip really was.</p><p>I would experiment with salvia more, especially because it is legal, and next time I would lie down and hold the smoke as long as I can. Also, I am going to try to retain consciousness as I trip, so that I can *understand* as I experience.</p>",
 "year": "2000",
 "id": "1338",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-09-11T07:00:00.000Z",
 "views": "6412",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "25 mg",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 }
}
