{
 "id": 13382,
 "title": "Fun Night With Friends",
 "date": {
  "submission": "2011-08-09T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gagak",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "administration": "oral",
   "substance": "MDAI",
   "form": "liquid"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "liquid",
   "specific": "Hard"
  }
 ],
 "report": [
  "Some friends and I ordered a few grams of MDAI on an internet website that we'd ordered other chemicals off before. I researched MDAI and honestly, had low expectations. My preferential chemicals are Methylone and MDMA. I had taken a couple months off doing anything other than alcohol so, I was excited to try something, but had read many descriptions of others taking this chemical with little or no effects. ",
  "We took 100mg dose mixed with liquid and had a couple of drinks (2 or three strong drinks). Not alcoholics anything, but we drink quite a bit, so when we started to feel it, we questioned ourselves and thought it could be the alcohol.  About 25 minutes after initial dose we knew it was more than the alcohol.  I had an inexplicable happy feeling and felt as if I could talk forever.  People I had been pissed at just an hour previous suddenly became my best friend.  The feeling was a lot stronger than I had expected it to be and I really loved it.  Everyone in our group had the same reaction to the initial dose and we all decided to up it about 50mg a little over an hour after initial dose.  I'm not sure how much this did, but my high lasted a very long time. I peaked at about 1 hour and stayed at peak for about an hour. After that, I stayed pretty high for 2-3 hours. ",
  "I slept easily through the night (usually does not happen with me and methylone or MDMA).",
  "The following day I was drowsy, but felt great.",
  "I don't know why my experience differs so greatly with others.  I was thinking at first that maybe the website had sent us a different chemical, but if so, which one?  I have tried the others that would be similar and it didn't feel exactly like any of them.  Also, the alcohol??  Perhaps a few drinks really boosts it a lot, I'm not sure.  Either way, my experience was phenomenal and look forward to trying it again."
 ],
 "erowid": {
  "id": "89583",
  "citation": " Gagak. \"Fun Night With Friends: experience with MDAI & Alcohol (ID 89583)\". Erowid.org. Aug 9, 2011. erowid.org/exp/89583",
  "substance": "MDAI & Alcohol",
  "views": "5368"
 }
}
