{
 "id": 13396,
 "title": "IBS Crohns and Opioid Addiction",
 "date": {
  "submission": "2011-02-21T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "deathbyibs",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "4"
   },
   "administration": "sublingual",
   "substance": "Buprenorphine",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "1"
   },
   "administration": "sublingual",
   "substance": "Naloxone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I have had a difficult relationship with opiates.  I had chronic migraines and IBS going on Crohns disease and needed something to keep me off the potty 20 times per day, and at first, opioids did the trick, 1-2 BMs per day, and the best part, they made me feel really good, too good.  I gradually lost the effectiveness of the opioids for pain and euphoria, and increased dosages of vicodin to 70mg per day, but the stomach pain was back in full force and there were times it would take me two hours to get to work because I had to stop at every gas station to use the restroom (normally a 20 minute drive), and since my script did not cover my requirement to function, I moved to methadone rather than risk prison seeking medicine outside the doctors office.",
  "Methadone worked quite well for the migraines and the GI pain from Crohns for a long time, but I needed to find a job because I was laid off,  and could not afford the clinic charges of $400 per month and a possible dirty urine. I figured that I could taper down on subs to something affordable, so I switched to Suboxone, Big Mistake.",
  "The Subs started pretty well using 16 mg per day, very little euphoria and that was pefectly fine with me, but it was not long before 16mg per day made me go into withdrawals, then the amount dropped to 12mg, then 8, then 6 and now I am at 4 mg and still after two years, when I take the half a sub in two quarters 10 hours apart, I start experiencing withdrawal symptoms.  I get withdrawals if I take more than 4mg, and if I take less than 4mg the withdrawals never go away and I am having to blow my nose constantly, yawning constantly, hot and cold spells, crazy legs and my Crohns flare-ups are so loud that people can hear a constant rumble in my stomach from a different room.",
  "I don't know why the ceiling effect has gone down, because even though I have been on 4mg for weeks, I tried taking up to 16mg on a really bad day of pain, and I just got sicker at the 8mg mark, and nothing changed after taking 8 more mgs.  If I had known that suboxone would have a diminishing effectiveness coupled with diminished ceiling dose meaning I will never not be in some form of withdrawals, I would have never taken it in the first place. Even worse, if I take my safest dose, 4mg, and I lift weights, the additional natural endorphins put me into precipitated withdrawals, just from working out! The withdrawals from too much are easier to cope with than too little, especially after a three day experience when I felt my entire skin was suffering second degree burns.",
  "Just be aware that you might end up in the same boat, but also be aware than not everyone has had the same problem as me.  Some people I know tolerate subs quite well at the two year mark.  I still think Methadone is ultimately a better drug, more history and more predictable in weaning especially if suffering from chronic pain.  Don't even play with this stuff if you are looking to get high because the downside is worse than heroin, but the euphoria is about the same as half a beer.  Whoopee..."
 ],
 "erowid": {
  "id": "89671",
  "citation": " deathbyibs. \"IBS Crohns and Opioid Addiction: experience with Buprenorphine & Naloxone (Suboxone) (ID 89671)\". Erowid.org. Feb 21, 2011. erowid.org/exp/89671",
  "substance": "Buprenorphine & Naloxone (Suboxone)",
  "views": "8338"
 }
}
