{
 "title": "The Thought Police and the Demonic Battle",
 "author": "Muzavazavaza",
 "citation": " Muzavazavaza. \"The Thought Police and the Demonic Battle: experience with Mushrooms (ID 13399)\". Erowid.org. Feb 22, 2005. erowid.org/exp/13399",
 "substance": "Mushrooms",
 "bodyweight": "160 lb",
 "report": "<p>It was a night that is impossible to forget. Memories of that night invoke dark twisted images of sinister demons as well as the light of divine spirits. It was a near death experience as it was a rebirth. Although it may have been reckless and irresponsible, nature taught me a thing or two about life.  It was the night before the fourth of July. Colorful clusters of explosion filled the sky. I felt like doing something crazy. So I called up a two of my friends, and broke out the stash of magick mushrooms I had purchased recently. They were supposedly very potent and powerful, but that didnt scare me. I had enough to supply ten people. But I only gave my two friends a meager portion, and I greedily devoured the rest. I even remember saying, Ill eat this last shroom to make me regret it, and indeed I would.</p><p>On top of eating about sixty dollars worth of shrooms, I ate them on a completely empty stomach, washing them down with water.  At first it was all fun and games. We threw waterproof fire crackers in a pond, amazed at the way the murky waters suddenly flashed. My first hallucination was a white fire ball that emerged from the water and soared in to the sky. Thundering speckles of fireworks tricked me momentarily to believe I was on the battle field of some forgotten war. A window of reality exposed the thoughts of my parents, who might be home soon. They would surely go haywire if they caught me in my condition, so I decided we needed to get away from my house. We hopped in my car and we luckily made it to my friends apartment in one piece. It was definitely a good thing the trip had not fully kicked in while I was driving. Hallucinogens and automobiles have to be the worst possible combination you can contrive.  [Erowid Note: It is extremely dangerous and irresponsible to drive while under the influence of a psychoactive substance. Don't Do It!]</p><p>Sorry dude, Im going to have to electrocute your snout, my friend John greeted at the door.  What What? I replied frantically  Dude, I said, Die pet tricks! Mo clesh razim dolphin elfin zippers, sorry man.  I was totally confused. Could not understand him.  Ethan, my fucking electricity is out, Im sorry dude, He slowly repeated.  Finally I understood. John knew it was going to be a long night.  His apartment was illuminated only by a few candles. There was no TV, no music, no form of entertainment. I horrible queeze was disclosing through my stomach, causing me to tremble. An overwhelming feeling of fear and uncertainty took hold of me.  At first my two friends who had also taken a small amount of the shrooms, Duddey and Fat Chad where chattering back and forth with John. I couldnt understand them. Then there was silence. We all sat at opposite sides of the room, giving each other the strangest looks. I had the assumption that I could read their minds. </p><p>He is thinking about blue paper clips, and he is thinking about how Mongolians have sex, he is thinking about Jazz. He is thinking about Satan. He is thinking about Satan. He, he, who is he? Ohh God Ohh gods ohh Jah ohh why starship enterprise tequila sunrise captains log stargate 771.895 is that pi? The waves are, biiiig, biggg ooooo beam me up now Scotty. Oh gods what if the neighbors call the police Im hungry holy shit what the...What the...What the the the the fuck is that!?  I jumped off the couch and pushed my back into the wall, quivering in fear.  What the hell is wrong with you E? Fat Chad interrogated.  Hell is wrong with me! Hell. Is. Wrong. With. Me. I just saw a strange little shadow scurry across the floor. It had two red flames for eyes. It looked like it hat antlers and tusks.</p><p>I explained. I felt like I was a part of the wall, as if my face was painted on the wall, and we were one.  Its just the shrooms, E, its just the shrooms, calm down Ethan, Fat Chat tried to comfort me. I stared at him.  Fat Chad sat their slowly, but deeply and heavily breathing. His stomach jiggled like pudding when he moved. He had a small mohawk hair cut, just a short patch of hair on top of his bald head. I looked away and looked at him again. His mohawk looked like a strip of iron. He sat there with an evil grin, in full steel armor. Metal spikes protruded through his armor. A fierce battle ax set against his leg. He sat on a gold thrown that sparkled in elegance. He was a goblin warrior king of Agartha I thought to myself.  You look terminator dude, I think I better step outside and have a smoke, I announced to the group.  I slid the door opened and stepped out on the balcony. It slammed shut behind me.</p><p>It was a sensory overload. I smelled a peculiar odor that I associated with the female reproductive system. I heard so many different noises; strange voices, computerized mechanical type sounds, a strange genre of music that sounded like a cross between bluegrass, jazz and Arabic melody and a noise that sounded like thousands of basket balls being bounced. Behind the apartment complex was a wooded area that looked very uninviting, and a small concrete lot over ran by weeds an enclosed by a shabby barbed wire fence. The cool breeze across my forehead which was gushing with sweat felt comforting.  My ears focused in on the errie demonic song of the nighttime insects. It was as if I could translate their language in to my own, but this frightened me because I have a phobia of insects. So I tuned them out and focus my ears on the strange music I could hear in the distance. A single tree standing steadfast and proud in front of the woods caught my tripping eyes. It was a mighty oak, and it had the face of an old man on its front surface, which smiled at me.  You shouldnt smoke, son. Its bad for ye lungs, the tree said to me with an Irish accent.  Your, your, your, alive! But, but, I quit eating meat because the animals are alive! And I eat plants, please dont be angry at me sir, I stuttered in disbelief. </p><p>Ha, ha, ha, ha. Look at my roots, I feed off the soil and the rain. It is alive also. We all must eat to live, it is all part of the cycle of life. Only when you exploit my family and I for your own commercial gain are you cursed. You where once me. You cameth from the soil. At one time you where composed of only one cell. Now look at you. You have trillions. But each cell is independently alive. Ha ha ah ha! Man! The kings of the planet. Ha! Your people have forsaken us! Look what mankind has done to our home. Come cut me down! One day your race will have killed us all. That day you will have to pay to breathe! Ha! The tree scoffed. </p><p>I looked down at the grass. Each individual blade of grass was dancing around and was alive.  Who the fuck are you talking to? John asked sticking his head out the door. I thought his head was not attached to anything, that it was just floating in the air.  That old Irish lad, over there, I pointed to the tree, but now his face was gone.  Come on back inside, before you hurt yourself, John persuaded me.  Duddey was still sitting across the room, speechless. I could tell he was in his own dimension. His dreadlocks began to slither, like snakes. He looked like Medusa for a few moments. Then a feeling of pure terror took over me.  I zig zagged my way over to the center of the room. I laid down on the floor with me head pointed north, stretched my arms straight out to my sides, and spread my legs. I began to visualize myself as a five pointed star, as a shining pentagram. I felt it was the only way to banish the evil that I thought surrounded me. I could hear thousands of horrible devilish voices all talking at once. Some were telling me to commit unspeakable acts. Some were laughing, and others where chanting an unknown language. I thought I was dying. Considering that I had overdosed on shrooms, I probably was. </p><p>I closed my eyes and began to pray. With my eyes closed, the hallucinations became more intense. I saw the shadow with flames for eyes that had made its presence known to me earlier.  Fuck you, I said to the demon. It was just the malevolent being and I, surrounded by red haze.  A black whirlpool formed beneath the demons eyes, where one would guess its mouth to be. Previously just a small walking faceless shadow, the demon began to change. It grew hundreds of times its previous size. It towered over me. It bent down, opened its swirling mouth and let out a fearsome earpiercing wail, exposing thousands off razor sharp jagged teeth that moved about like the blades of a chainsaw. Foul centipede like creatures danced on its forked scaly toung.  At that moment I thought I was surely dead. I repented. I begged for the divine spirit to save me. I visualized once again the silver pentagram emerged in white flames. As the beast was exposed to the sacred star, it shrunk back to a little critter and disappeared into the reddish mist. The mist cleared and I was surrounded by white light. A magnificent apparition of a bearded man with long hair appeared before me and smiled. I thought it may have been Jesus. When I thought that, he entered me.</p><p>I opened my eyes, but I was no longer in the apartment. Now I was crucified on a cross, floating face down above sand dunes. I thought I was Jesus.  Some one call the Enquirer, weve got Jesus passed out dead on the floor over here, I heard Fat Chads voice from the other side. It sounded like he was talking through a fan at the end of a tunnel. His words brought me back to reality.  I jumped up off the floor and was happy to see I was still alive. Duddey sat in the same position before, in his own little world. Fat Chad glared at me with a smirk. John strummed an acoustic guitar. I still felt like I was going to die. I knew what I had to do. I ran into the kitchen and began to take down glasses of water from the tap. It tasted like dirt. I drank the water until I felt completely bloated. Then I rushed into the bathroom. It was also illuminated by candle light.  I dont want to die here, like this. I better call my parents. No! Im fine, Ill do it. Call an ambulance. No. Ill be okay. How many trampolines are there in China? Terrible vibrations are all around. Dont teach an new dog old tricks, it could get brain cancer. Excursions. Toilet. Death. Onyx stalagmites are splendidly attractive. Ohh shit my coat has run away. My dear Giligan, tell those clowns they need to get out of Mayberry. Lights, please stop flashing. Ohh god ohh god Im going to die.</p><p>My internal dialogue was as erratic as a schizophrenic on acid at a circus.  Its time to die boy, its time to die, I heard a demonic voice tell me.  Do you accept initiation into this order? Another strange shimmering voice asked me. I began to see the Masonic symbol of the crossed compass and ruler looming in the air above me.  Do you want me to rip your spirit to shreds? Grind your bones and make gelatin to feed the legions of the underworld? Do you want me to castrate your soul? Chimed in another demonic voice  Do you accept initiation to this order? Repeated the strange shimmering voice.  Im the master of thirty three. Im the supreme council of the highest degree. I bathe in blood and swim in esoteric seas. Sacrificial rites of iron and stone is my decree. Follow me and join the elite. So mote it be! So mote it be! Uttered still another voice.  My body quaked and shivered. I felt a surge of intense power move up from the ground to my feet and then to my brain. I took a step back, tossed my head back and then threw it forward.  Die!  Do you accept initiation to this order boy?  No! I replied to the evil voices.  I heaved out what looked like a ten foot jet stream of black putrid projectile vomit. It filled the toilet. The vile substance bubbled and smoldered. I could see demonic faces within the noxious mass. Their claws reached for me from the bathroom fixture.</p><p>I flushed the handle. The evil swirled down the drain back to the earth from which it came. The horrific voices ceased. I was cleansed. The water filling the toilet was a florescent pink, and it turned to neon blue as it began to overflow.  Hey John, your toilet is overflowing, I shouted.  He entered to check on me and see for himself.  What are you talking about dude, no its not, he explained to me.  I was still out of touch with reality, but I was safe now. I expelled the demons. The dangerous amount of organic poison in my system was rejected and ejected. I decided I needed to take a shower and clean off. It was the most interesting drizzle I ever took.  I remember reaching down and turning the knob and was hit with what felt like a sub zero arctic blast. I slid back, but as I slid back, the wall in front of me that the shower nozzle was attached to appeared to expand for miles. The shower nozzle looked like a torch, emitting a silver flame. I was convinced that the water was actually fire, but it was cold. I felt as if I was being baptized. All of the sudden the wall started to move towards me, and the ceiling and surrounding walls followed suite.  I stumbled out of the shower, falling over its ledge onto the floor. I wrestled about trying to get the shower curtain I had entangled myself in off. </p><p>Now I couldnt see anything. I banged my fist against the wall.  Get me out of this incubator! Get me out of this calamity, I yelled.  John opened the door and I toppled out of his closet. How did I get there?  Back on the balcony I saw an orange lion come trotting my way. It leaped into the air where it suspended itself, as if god picked up his remote control and paused the entire world. I turned looking through the sliding glass door and the scene of my friends kicking back in the living room was frozen. John was in the middle of throwing a pack of cigarettes to Fat Chad, and Duddey just sat there stuck in his own realm. It seemed as if time action stopped.  Smash his clock, the lion communicated to me telepathically.  Now I couldnt see anything. I banged my fist against the wall.  Get me out of this incubator! Get me out of this calamity, I yelled.  John opened the door and I toppled out of his closet. How did I get there?  Look what you did to my clock Ethan, John said angered as he handed me a battered clock.  But, you were stuck, the lion... I tried to explain.  Damn E, you are out there arent you, John retaliated.  I dried off from my shower, put my clothes back on and strolled into the living room to see what was going on.</p><p>The first thing I saw was a girl with flowing golden hair and a bluish tint to her skin. She sat on Johns lap. I approached her and started to shake her hand.  Much oblige, Im Ethan my friends call me Ether but Im not flammable, hu uh ha, I rambled to her.  Yeah, I know, You told me that when you first got here, she answered.  Well Ill be damned. Pigs really can sniff out truffles. Would you like a toffee with your teal waffle? Jolly good show! Savor the flavor of those fungus wafers, I explained to her.  What do you mean you didnt notice her? You have been jabbering to her since you came here, chuckled John.  I was startled by the sound of sirens. I felt as if I was being watched by the ghosts of slain CIA agents.  Holy shit guys! There coming for us, run to the hills! They know we know that they know we know! I ranted.  I ran over to the door to Johns apartment and thrust my eye against the peephole.  AHH! I shouted. All I could see was another eyeball looking at mine.  I looked away and peered through the hole again. There was a man dressed in a black trenchcoat, and he wore a circular brimmed hat that shrouded his face. I watched in panic as he pulled out a wallet, and opened it exposing a badge of a seven pointed star.  Oh shit yall. The thought police have arrived, I slurred.  I looked again, but the man was gone. </p><p>The thought police huh? I think you better call in work tomorrow Ether, joked Fat Chad.  I held my hand up next to my ear as if it was a phone.  Sorry boss, I ate way to many hallucinogenic mushrooms, and trip still am I. Dont think Ill be work making in it today, I jested in return.  Now I couldnt see anything. I banged my fist against the wall.  Get me out of this incubator! Get me out of this calamity, I yelled.  John opened the door and I toppled out of his closet. How did I get there?  I looked at the clock on his wall. Five hours had passed since we had arrived at his apartment. I was confused to see that the clock was in mint condition, regardless of my memory of destroying it. My perception of the last hour was completely distorted.  Instantaneously, bright light filled the apartment. I heard a disembodied voice congratulate me on passing the test of using death as an advisor.  Hell yeah John, your electricity is back on, I told him.  Yeah I wish, then I could listen to my new Ratt compact disc, John complained.  The room dimmed back to the gentle glow of candle light.</p><p>That was my final vision of the event. I waited another hour, but my trip was over. Slight persistence of vision still lingered, but I figured it was safe to head home and call it a night.  On the ride home I found it very ironic that the song which was stuck in my head the whole time I was in spaced out, played three times on three different radio stations. I looked at Fat Chad who was sitting passenger side.  If I ever step into that apartment again Im going to get flashbacks. Man, I cant even begin to explain the insane delusions and thoughts I was experiencing back there, I muttered. A blank expression came over his face as he gazed into the distance.  Well, keep those thoughts to yourself, because we know that you know that we know that you know that you know he said in that familiar demonic voice I heard earlier. His words reminded me to be ware of the thought police.  I had peered into the face of death, and perhaps, the face of god, or at least one of his many faces. I had conversed with spirits and banished wretched demons. The experience may have been somewhat dangerous, but it did erase the ego, and shifted my perception on the way I look at the world and life in general, in a positive way.</p><p>Even though I never wish to be in that frame of mind again, it is something I do not regret and I wouldnt trade the experience back if I had the chance. In each and every one of us there are doorways to inexplicable zones that are waiting to be unlocked. You choose the key.</p>",
 "year": "2001",
 "id": "13399",
 "gender": "Male",
 "timestamp": "2005-02-22T08:00:00.000Z",
 "views": "4290",
 "dose": [
  {
   "time": "0",
   "amount": "14 g",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ]
}
