{
 "id": 13399,
 "title": "The Hallway of Souls",
 "date": {
  "submission": "2012-09-27T07:00:00.000Z",
  "experience": "2005-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Eyetranceend",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25",
    "grams": 0.025
   },
   "administration": "smoked",
   "substance": "5-MeO-DMT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Now that 5-MeO-DMT is schedule 1 in the United States, I have been thinking a lot about it. I have decided to share an experience with this drug that changed my life  in ways, changed it for the better, and in other ways, for the worse.",
  "At this time in my life, I had experimented with heavily with MDxx, LSD, Cannabis, and Dextromethorphan, and lightly with Amphetamine, Opiates, and Cocaine. I had a couple of previous experiences with 5-MeO-DMT that were universe-shattering, and a few other experiences that were lackluster.",
  "I. PRELUDE: Me and a friend decided to spend a weekend in the Ocala National Forest expanding our consciousness. We had brought nothing but 5-MeO-DMT and some herb. The first night, as we sat in our tent, we decided it was time to break out the pipe. We weighed out exactly 25mg, 10mg higher than I have ever previously used.  My friend went first, but never really got too far off the ground. Then it was my turn. I put the flame to the pipe, let it settle, and began inhaling. Before the smoke could even be exhaled",
  "II. ASCENSION:  It feels like I jumped on The Top Thrill Dragster rollercoaster at Cedar Point but then realized I forgot to buckle my seatbelt, but it's alright because I also feel like I was given an anesthetic dose of some kind of tranquilizer right when I was about to freak out (figurative, of course), because I wanted to scream, but was pretty much paralyzed. And then I really get scared when the rollercoaster took off at a blistering speed and flew off the tracks -- out of the tent, up the trees, through the clouds and into outer space at warp speed. I wanted to scream for help. I regretted taking so much, but that tranquilized feeling just wouldnt let me-- and on my way to the center of the universe the speed eventually became tolerable, as time/space bent around me, I knew that back on Earth I must have missed a million years and would return to nothing. This is the last I remember of my ego. It dissolved out there, somewhere in the terrestrial plane.",
  "III. BETWEEN MATTER AND NOTHINGNESS: Space-light. Crimson water over blackness, shadows from the other world enter, they twitch and dance within as the tide of light recedes. Shadows of fire. Of clouds. The starlight is filtered through a mirror, only peeking through as blinding human and animal-shaped light. Here, whatever I am is at the center of a spiraling system, perhaps insignificant itself as a passing atom in the world were familiar with, but to whatever I am, it is my sustenance. This is the weight towards which we fall, the weight that pulls planets to suns, to each other, pulling universe to universe, the Big Bang and what came before it. An ongoing explosion, in a color on the spectrums edge beyond the perceptibility of the eye. There is a window there. I look in.",
  "IV. THE WINDOW: James Lathrop. Born 1924. Served in Korean War. Was a 'Merchant Marine' Had 6 children. He was a conservative man -- the most he ever saw of the world outside of Ohio was New York City when he was stationed there. Got tricked into dancing with a 'drag queen' (before that was a common thing) and the boys never let him live it down. After that he swore off cities and lived the rest of his life in small towns, worked at a car dealership, and never made much money. Married a quiet Christian woman named Marilyn. Gave birth to six children. All of them had the initials D.J. Had a drinking problem, and loved mountain dew. He died March 4, 1985 after suffering a heart attack on his way to visit relatives in Xenia, Ohio. This is the day I was born.",
  "V. THE HALLWAY OF SOULS: After living his life, in my trip, I became his soul, and I was pulled into a field that looked like one infinite hallway, where there were billions , no  gazillions of these orb shaped souls -- they all gave off a different energy, and I could feel which ones were humans and which ones were animals and which ones were blades of grass and butterflies. Every  single one of these orb-soul-spirits looked unique, as if they were designed by an artist to reflect the experiences of each particular soul. Some were coarse and jagged, some were black with glowing orbs spinning around them. I remember particularly one that I could feel belonged (currently) to a horse. It was bleeding a blue syrup and was encircled by rings of honeybees (which is doubly odd, because each honeybee would have had its own orb as well). It was beautiful. Mine was covered in wilting, black rose-like flowers and had little pods, like a chrysalis, full of fire hanging from the stem of each one. Eventually, his (my?) soul was guided to this giant gaping hole which looked eerily similar to a vagina, by this strange figure with no arms or legs, but mosquito-like wings and a face that was made out of electricity. He shoved the soul into the vagina-like orifice. And I was shot through a tunnel, and then awoke, coming out of a vagina -- it was my mother's vagina. I watched myself get born, but just like James' life, I had no control over the infantile me. A voice said to me, as I stared out of baby-me's eyes, in a language that wasn't English, but that I could understand 'You will return, forever and always, so long as there is particles in the Universe -- but for now, you have trespassed the borders.' and also something about holding on to the new knowledge but not letting it dictate my future.",
  "V. EPILOGUE: I left that forest the same day. I have never gone back. I spent countless hours looking for James Lathrop's name. It dictated a good deal of my freetime for two years. I suffered through derealization, a mental health hospitalization, and depression. I am far better now. I have realized that this man does not exist. It was a creation of my imagination, and of the chemical. But to this day, I am still haunted from time to time. I have dreams at night where I remember the way he felt on the happiest day of his life, when his son David said to him 'I want to be a great man one day, like you, dad.'",
  "Rest in Peace, James. Perhaps we will meet again, someday forever and always."
 ],
 "erowid": {
  "id": "89685",
  "citation": " Eyetranceend. \"The Hallway of Souls: experience with 5-MeO-DMT (ID 89685)\". Erowid.org. Sep 27, 2012. erowid.org/exp/89685",
  "substance": "5-MeO-DMT",
  "views": "6761"
 }
}
