{
 "id": 13392,
 "title": "A Recovering Addicts Take on Vyvanse",
 "date": {
  "submission": "2012-12-05T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Rick",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Lisdexamfetamine",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Background  Im a recovering addict so I havent consumed any intoxicating substances in the past 5 months. I smoked marijuana and hash habitually (multiple times a day) for the past 2 years, I have experience with psychadelics (LSD, psilocybin containing mushrooms, MDMA, and salvia dinorum), and Ive abused various pharmaceuticals (Oxycontin, Vicodin, Percocet, Xanax, Ativan, Promethazine/Codeine cough syrup, DXM, ect). I have moderate AHDH. My symptoms are mostly of the attention deficit variety rather than hyperactivity. Most recently I was prescribed 20mg XR and 15mg IR of Adderall. The Adderall was discontinued after my parents and psychiatrist found out I was abusing it, which was around 4 months ago while I was in treatment. Ive also been prescribed Concerta, which made me really socially anxious and introverted. I ate a breakfast of 2 eggs, 1 piece of toast, a cup of coffee, and an 8 oz Redbull.",
  "T + 0:00 Its 12:00 on a Sunday morning. I took 2 20mg capsules of Vyvanse washed down with lemon water. Im going to go outside and have a cigarette.",
  "T + 10:00 Experiencing the usual nausea and buzz that accompany the first cigarette of the morning, but I can already feel an additional sense of awareness and centeredness that I get from Amphetamines. Im going to work on studying for a history test that I have tomorrow and listen to some Tech House to keep me entertained while I work.",
  "T + 25:00 Definitely experiencing what Im assuming will be close to the full effects of the Vyvanse. I didnt get the same rush that I did when I took Adderall. The onset of the effects are much more gradual. Every few minutes I check in with myself and feel a heightened sense of focus on whatever Im working on. I feel some slight euphoria; its nothing more than a mild sense of wellbeing, but its definitely noticeable. Im content and focused on writing my experience report, but its still a little difficult to stay on top of both the report and studying for my history test.",
  "T + 30:00 As a note, I dont think Ive spent more than a moment idly doing nothing since ingestion, and time seems to have elapsed really slowly as a result.",
  "T + 45:00 Two frustrating side effect of Adderall that I struggled with were dry mouth and complete loss of appetite. Right now, my mouth isnt dry at all. Im not hungry, but I feel like I could eat if I tried. I am thirsty though so I think Ill have another 8 oz Redbull. My pupils are currently normal size.",
  "T + 1:30:00 Smoked another cigarette. Finding it harder to focus on schoolwork than if Id taken 20mg of Adderall XR. Still feeling motivated to work and slightly euphoric, but I wouldnt classify the experience as mood altering, its more like I have an increased sense of self awareness and satisfaction that Im doing what I need to do (study history). Studying is going well. The past hour and a half has felt like ages though. I feel like my brain is working faster than normal, but not in an artificial or forced way. Im not the least bit drowsy. I feel a little over caffeinated and my level of anxiety is definitely heightened, but its not oppressive. I feel compelled to do work though. Any wasted time makes me feel kind of worried that Im wasting my meds and not living up to the expectation I set for the drug.",
  "T + 1:45:00 Just turned my music off, making things much easier to focus on. The work is engrossing enough to keep me occupied without having to rely on the distraction of music.",
  "T + 4:25:00 Just did 2.5 straight hours with SAT tutors and the effects of the Vyvanse are still going strong. I felt engaged and not the least bit bored the entire time I did SAT prep. Social skills seem enhanced as communicating with my tutors was effortless. The methodical and arguably tedious SAT work I did was almost fun and extremely satisfying to complete. Physiologically, my mouth is starting to get pretty dry, but its hardly comparable to the cottonmouth from smoking cannabis or even Adderall, but its definitely noticeable.",
  "T + 5:00:00Im going out to dinner in an hour and a half, but the thought of eating right now isnt very appealing at all. Im starting to feel pretty anxious. I dont have the normal fog in my brain and all of my thoughts and conscious contact with my brain and body is totally concise. As I write, I find that I have my sentences written in my head before I type them out, while I usually write and then think about my sentence when Im not on a stimulant. Im putting on some Flying Lotus and ambient dub and going outside to chain-smoke to try and relax.  The anxiety Im feeling is the kind that sits in the back of your neck around the brainstem. I have the feeling that its from overdoing the caffeine this morning, so Ill have to write another experience report when I havent ingested any caffeine. The anxiety makes me question whether or not I want to continue taking the Vyvanse, but its slowly subsiding. The benefits of how well I can focus and how engaged I am by my studying undoubtedly makes up for the mild to moderate anxiety Im experiencing.",
  "T + 5:15:00The anxiety is definitely predominantly from the caffeine crash Ive decided. Despite the anxiety, I still feel content and extremely focused. The nicotine and easy tunes really helped me center myself. I had a conversation with my brother that went really. I feel more inclined to be extroverted and pleasant than normal. If I dont focus so much on the anxiety itself and just concentrate on the work at hand, it really starts to go away. Its easy to get trapped in your head and over-analyze things, especially uncomfortable feelings like anxiety. When I start talking or writing those feelings go away and my train of thought shifts exclusively to the task at hand. Im going to take a break from my work, which has been pretty constant for the first 5 hours after ingestion, and play some Call of Duty. My prediction is that my KD will improve.",
  "T + 5:40:00Anxiety is totally gone. Xbox is going fine, not doing any better than usual, but I guess I make less stupid mistakes and am more meticulous about placement. Game is more engaging than usual and is a lot of fun.",
  "T + 8:00:00Im exhausted. I totally crashed from the caffeine though I can still feel the stimulating effects of the Vyvanse, though much more subtlety than 3 hours ago. I only managed to eat an appetizer at dinner, and Im totally full from what little I ate. Im not feeling any anxiety or nervousness right now. Im going to try and get another hour of work in before I give up until school tomorrow morning. I dont feel the same sense of contentment that I did earlier in the day, but I by no means feel depressed or down. The comedown was fairly smooth, but definitely more noticeable than the comedown off of a comparably small dose of Adderall.",
  "T + 8:15:00Im not  as focused as I was earlier. I think Im just experiencing the dregs of the drug at this point. My mouth is still dry though! Im really hoping I get to sleep without any problems tonight. Even though my level of focus is declining, the alertness and sensitivity to my surroundings aspects of Vyvanse are still present.",
  "T + 9:00:00I feel as if Im almost totally back to normal. Im still wide awake despite a long day of work, but my level of focus is at its normal level, below average. I dont have a headache or any anxiety. The only physiological effect is still the dry mouth, which has been unrelenting.",
  "Concluding thoughts",
  "Overall, I really liked Vyvanse. Since I started taking Adderall Ive felt strongly that Amphetamine is a wonderful drug and can make a huge difference in peoples quality of life. I found the onset of the drug to be slow and steady and the comedown was likewise. The side effects I experienced were mild anxiety, mild euphoria, dry mouth, and loss of appetite. Though undoubtedly apparent, the side effects were mild in comparison to those of Adderall. Vyvanse is an excellent alternative to other stimulants for treating AHDH, with the added benefits of reduced abuse potential, lasts about 2 or 3 hours longer than Adderall, and the onset and comedown are milder than on both Adderall and Ritalin."
 ],
 "erowid": {
  "id": "89651",
  "citation": " Rick. \"A Recovering Addicts Take on Vyvanse: experience with Lisdexamfetamine (ID 89651)\". Erowid.org. Dec 5, 2012. erowid.org/exp/89651",
  "substance": "Lisdexamfetamine",
  "views": "9449"
 }
}
