{
 "id": 13409,
 "title": "I Had Forgotten What the Universe Was",
 "date": {
  "submission": "2011-08-23T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Cedric",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "(powder / crystals)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Diazepam",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Tobacco - Cigarettes",
   "form": "(plant material)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Note: 200 mgs of 4-AcO-DMT is considered an extremely high dose, see 4-AcO-DMT Dose Chart]",
  "Before this, I had done 4-aco-dmt probably 3-5 times at much lower doses (30-60mg, sometimes with a redose). It had been at least a week without 4-aco, completely sober. Before trying 4-aco, I had done 2c-e many times, acid once, lots of weed, lots of alcohol, numerous pills including opis, benzos, amphetamines, etc. Lots of DXM (OTC and pure powder). Plus many combinations in-between. I do a lot of meditation and consider myself to have good control over my mind. I have successfully gotten myself out of bad trips many times in the past, including a one on 50mg 2c-e by myself.",
  "All of my previous experiences with 4-aco made me honestly believe it was impossible for me to have a 'bad trip'. It feels clean, smooth, and lazy. Say what you will about placebo, whatever. But I don't see how anyone can have a bad experience on 4-aco, unless they take way too much and/or don't have much experience with psychadelics. Many of the reports I read about bad trips on 4-aco can probably be narrowed down to conflictions with other chemicals, wrong chemical, or maybe just a really bad set and setting.",
  "I got a gram of 4-aco-dmt from a well-know trusted supplier with high ratings. I had no milligram scale, so I had to cut it up into even piles.\r[Erowid Note: A volume amount of one powder doesn't necessarily weigh the same as the same volume of another powder. For substances active at such a small dose, eyeballing is particularly unwise. See related article]",
  "I took some of the piles and put them into little baggies as ~125mg 4-aco. Sorry about not having a good timeframe on this report.",
  "I ate a bag to myself, then shared one with a friend. We had taken it before. My other friend who had never taken it before, took a bag to himself. The comeup was slow at first, then suddently kicked in really fast. Suddenly I found myself in ego-death. I had forgotten what the universe was, what existance was, what I was, etc. Then, one by one these things started to reoccur to me.",
  "Suddenly I was overwhelmed by happiness when I realized that I actually existed and could affect the psysical reality around me. I jumped out of my chair (which was amazing because 4-aco usually limits my motor skills moreso than alcohol) and started rampaging around, overturning things and running around. At one point I took a package of some precooked meat and threw it all over the place, just for the hell of it. I wanted to affect the reality around me as much as possible.",
  "While I was doing all these things, one of my friends retreated to his car to listen to music or something, maybe he was uncomfortable and thought I was destroying my house (I didn't actually break anything). My other friend was laying on the floor laughing his ass off. I wrestled with the dog for a while, then eventually I was laying on the floor exhausted, with the characteristic laziness in full effect.",
  "My other friend came back inside and insisted that we join him out in his car. After much coaxing, he helped us both off the floor and we got in his car. In the dark we had some pretty sweet visuals and the music was amazing, no matter what it was (i think he just had the radio on). We sat there for a long time just talking about random shit.",
  "Eventually one of my friends went to bed, the other stayed up with me and we redosed a baggie each. I barely noticed an increase in effects, but my friend said he felt amazing. We sat there in darkness+silence for what seemed like forever. We stayed up all night and he left somewhat early in the morning because he had to be somewhere. We were still definitely tripping a little, but I knew he could drive.",
  "Then I started to do some stupid shit that I never imagined I would ever do. Ready to crash after such an awesome night, I took a handful of vikes and valiums. I chewed them into a powder and washed them down with water. Then, I took a little cup of yogurt and in it mixed a pile of about 50mg 2c-e and 40mg M1. I just wanted to finish up the supply, I wasn't even thinking about getting effects from them.",
  "Realizing what I'd done, I woke up my friend and told him. He was like, 'What??? You took all those valiums!' lol... So he watched over me, kept me awake and stuff, until he had to leave. Apparently I kept nodding off and saying random stuff when I woke up. I remember having these little dreams that seemed at least 5 minutes long, then when he woke me up the dream would continue a little bit, thus the random outburst. They were all some comment about the dream, or maybe dialog, it just depends. I don't remember anything specifically, and neither did he. Eventually he had to leave. I then stuffed my lips with packets of Snuss, then went outside and chainsmoked my last 4 camel menthols.",
  "I ended up falling asleep on a couch, not waking up until woken on Sunday sometime, I'm thinking PM. A relative of mine entered, seeing everything that I had done. In a fit, he stated that he would keep it a secret if it was all gone by the time she got back. I started cleaning up, but apparently the valiums were still affecting me. I must've been pacing back and forth the whole time. She got back and found everything just laying on my bed, and I was next to my parents bed, making sure it was straight (since my friend slept on it).",
  "After what seemed like only a few minutes, she returned and confiscated all of the empty baggies and searched my backpack, taking everything in sight (luckily she didn't find the 2 still full baggies in a front pocket, along with some other paraphenelia).",
  "4-aco has become my favorite drug so far. It is psychadelic and very euphoric. I got a clight fear right at the peak when I was in ego-death because I thought I might die. My breathing was depressed and as the ego-death was developing, I did feel like I was dying. But this slight fear didn't phase me one bit."
 ],
 "erowid": {
  "id": "89709",
  "citation": " Cedric. \"I Had Forgotten What the Universe Was: experience with 4-AcO-Dmt (ID 89709)\". Erowid.org. Aug 23, 2011. erowid.org/exp/89709",
  "substance": "4-AcO-Dmt",
  "views": "4574"
 }
}
