{
 "id": 13403,
 "title": "Velvet Feeling",
 "date": {
  "submission": "2002-06-14T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Randompoet",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Warning: Because opiate use can lead to significant tolerance (requiring higher doses for the same effects), the dose used by a first time user is significantly smaller than that used by a regular user.  It can be extremely dangerous to choose ones dose on the basis of the amount taken by someone else.  Overdoses of opiates can be fatal.]",
  "I'm writing this simply cos there is nothing else in the vaults about this drug. ",
  "My experiences with drugs are simple, weed, alcohol, mdma, shrooms, and many pharmacuticals, anything from ritalin to vicodin.  Oxycontin, however, is quite a different matter. ",
  "I think about this drug all the time, I came into contact with it for free, finding a bottle of my aunts pills in our house.  I looked up how to abuse it on the internet (the wonders of modern technology)  I had three 20s, so i broke them up and in 4 lines, i was feeling amazing.  Heroin is the closest thing i can think of, even though i have never done it.  In reading Junky by Burroughs, The Basketball Diaries by Jim Carrol, and various morphine poems by Kerouac, i knew this was it.  I laid back, and let the closest thing to a nod hit me.  I've never really had a full trip, or at least anything close to the things my acid using friends describe, but this was something completely different, obviously. ",
  "I felt like a ghost.  Unlike enlightenment, i felt contentment of the extreme.  I laid back on my bed, and thoughts entered my head as if they were on lazy sunday afternoon walks, and sometimes would stop and smell the flowers,and sometimes talk to each other in a language i couldn't understand, but i could see it as beautiful.  My body would grow numb, and then feeling would come back. ",
  "Overall, it lasted perhaps 5 hours?!?  I would love to see on erowid a effects curve, to see when this drug peaks, and then levels off.  I am always just too caught up in the beauty of lethargy.  I suppose this could be described as a fascination with death, because thats what it feels like.  A sweet beautiful mercy-filled death, where i watched movies of my life and of lives imagined. ",
  "I'm not going to recommend this drug.  I'd never recomend any drug, because that is all up to you, dear reader.  In my limited experiences, drugs have given joys unimaginable and shown me the true meaning of boredom.  I worry about oxys, cos it seems to be short for heroin, but a fast way to get there..."
 ],
 "erowid": {
  "id": "8969",
  "citation": " Randompoet. \"Velvet Feeling: experience with Oxycodone (Oxycontin) (ID 8969)\". Erowid.org. Jun 14, 2002. erowid.org/exp/8969",
  "substance": "Oxycodone (Oxycontin)",
  "views": "50896"
 }
}
