{
 "id": 13407,
 "title": "wOAH",
 "date": {
  "submission": "2011-02-25T08:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "MDPVbnger",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] ",
  "Well, here goes. My friend is a cocaine addict, and came across MDPV recently. He hasn't used in a couple of years, but also never started or got involved in a program. Anyway, he came across MDPV at a smoke shop, and got some. I FINALLY got a hold of him 3 days later. I picked him up from work, and he proceeded to tell me about his binge (Also throwing in there that its like pure 100% Colombian cocaine).",
  "Needless to say, the seed was planted. About a week or two later, I went and picked some up. All I can say is....WOW. This stuff is serious business. The high is euphoric, I feel busy, light on my feet, capable.",
  "I bought either 1g or .5 g, but only did a slight amount at a time (insulfated). My first dose was about 3-4 ml in length, very small. I felt that in about 10 mintues. Not strong, but enough to know it was there. I watied about 20-30 minutes, and did a line about a little less than a .5 inches. That was my regular dose about every 2-3 hours, until later that night, when I cut my time between doses to about 30 min. For about 5 doses. About 4-5 hours after my last use, I felt absolutley HORRIBLE, and threw the rest out, flushed it down the toilet. I felt cracky, not like myself, not able to get words out of my mouth. Feeling like a drug addict. AGAIN. (I JUST got off H about 2 months ago, maybe I'm replacing addictions, but I digress). I took 1.5 mgs of Klonopin about 8hrs after my last use, drank about 3 beers, and went to sleep around 3am. Woke up at 9am feeling great, no issues, completley fine. BUT, my mind got a taste for the Euphoria, and again, I got it around 9:30am from my local smoke shop. Its the next day now, 8am after staying up all night, and god dammit, how I WISH I never got any of those damn 'bath salts'. I keep using more when I come down, trying to avoid the comedown. It is really harsh. I feel really cracked out, and like I want to crawl out of my skin. The only way to avoid it is to do more!! I have a line in front of me, but every time I do it, I feel worse on the comedown. Also, the high and feelings of coming down last MUCH longer after I've been doing a bit of it. Ive bought it 3 times, totaling about 2 grams total, ingesting about MAYBE a little over a gram. This stuff is REALLY potent, and if I do too much, I have a feeling that I'm gonna be sorry.",
  "In closing, don't do this drug. Just DON'T DO IT!!"
 ],
 "erowid": {
  "id": "89699",
  "citation": " MDPVbnger. \"wOAH: experience with Products - 'Bath Salts' (ID 89699)\". Erowid.org. Feb 25, 2011. erowid.org/exp/89699",
  "substance": "Products - 'Bath Salts'",
  "views": "17774"
 }
}
