{
 "id": 13415,
 "title": "Visuals But Not Much Else",
 "date": {
  "submission": "2011-03-02T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "jaggerjack",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "4-HO-MPT",
   "form": "(capsule)"
  }
 ],
 "report": [
  "<p>T+0.00: 16 mg 4-HO-MPT Freebase",
  "Age: 18",
  "Weight: 128 lbs",
  "Gender: Male",
  "Prior substance use: Started doing drugs 8 months ago. Marijuana, Alcohol, Kratom, Nitrous, Shrooms, DMT, Salvia, Vicodin, Acid (likely not LSD), 4-Aco-DMT, Ketamine. I had smoked marijuana last night. Last tryptamine taken was 4-Aco-DMT three weeks ago.",
  "I had gotten a sample of approximately 50 mg 4-HO-MPT which I split between my two close friends M and A. I had tripped with them before but not with the two of them together. I hadnt set any specific purpose for this trip as I like to do, but that wasnt much of an issue. The material tasted a bit bitter but not harsh, appeared white and fluffy, and was received one week ago. The sample was weighed out and then split into three equal sized lines which were placed into capsules and then weighed later. A and I got the 15 and 16 mg ones, while M got the 18 mg one. This all could be off by one or two mg in either direction, but Ive found my scale to be pretty good. I hadnt eaten for about 3 hours before this.",
  "At 6.30 we took our gel caps in my house. My sis came and talked to us for a little bit and 20 minutes later we took a walk outside. It was cold but not bad. I expected to be feeling it a bit by now, since usually Im quickly affected by tryptamines. Within 5 minutes I was starting to feel it. There was a lack of the chilled feeling I get from shrooms and 4-Aco-DMT. It was a bit more spacey, chill, and euphoric, no nervousness or anything like that, no sitting back and waiting for it to hit. It just slowly crept up to me and within 40 minutes of dosing I was pretty close to peaking. We kept on walking and made it to the beach, where we sat around for a while. I was tripping hard, much harder than 18 mg 4-Aco-DMT, I was at a most definite +++. Everything was moving, but not breathing. The woodchips on the ground morphed into leaves and the trees shifted about. Everything looked a bit fuzzy, not at all crisp or 3D like (something I get from shrooms). Talking was very hard. We all noticed we were laughing and smiling tons. I was feeling rather tingly and removed from my body.",
  "I felt very confused; paradoxically I was both quite cold and yet oddly warm. I was a bit happy but often times thinking about sad things. Thoughts made sense but didnt. I was in a similar mind space to shrooms and 4-Aco-DMT but my thoughts had much less meaning. After a little while we started walking back, we knew we were cold even though we didnt really care. We stared at a wall for a little while and it didnt swirl or breathe, the texture just became shapes, specifically little gnome like creatures. M mentioned he was seeing textures he felt, but A and I didnt have that. Walking past people was a bit weird, for we knew if we looked at them we would stare and search their thoughts and minds.",
  "About an hour and half after dosing my visuals were significantly less pronounced, still noticeable but not all that strong. I started thinking about how fortunate I am, and was focused on this for a while. We went into my house and talked for a little while, M was still tripping pretty hard but A and I were definitely coming down. I was surprised by this but wasnt going to complain. My visuals were all gone after two hours and the trippy thoughts tapered to an end after another two hours.",
  "Overall it was an enjoyable experience but not particularly meaningful. While it had a similar head space to shrooms and 4-Aco-DMT nothing meaningful came of the thoughts I was having, it was lacking in depth. After taking those substances I can later remember my thoughts and they feel like they have some merit even while sober. With 4-HO-MPT I dont really remember much of what I was thinking and know that the thoughts were pretty meritless. The visuals were greater than what Ive experienced from 4-Aco-DMT and different from shrooms in the way they didnt breathe, they moved in other ways. There was significantly less euphoria from this than the other previously mentioned substances. Coming down made me feel a bit empty. I was also very surprised by the short duration, only tripping hard for one and a half hours. M tripped a little while longer than A or I, but he did take a teeny bit more. On another note, I think that 3 is a hard number to trip with. It loses the intimate connection one makes with 2 and doesnt have the group mentality of 4 or more.",
  "Lastly, like usual there is a tingly effect that lasts significantly after the trip. Seven hours after dosing its still there.",
  "Note from the next day: I forgot to add that around two hours after dosing I explored my CEV, they were very immersive, calming, and fractal like. And seven hours after dosing it was very hard to get it up.</p>"
 ],
 "erowid": {
  "id": "89739",
  "citation": " jaggerjack. \"Visuals But Not Much Else: experience with 4-HO-MPT (ID 89739)\". Erowid.org. Mar 2, 2011. erowid.org/exp/89739",
  "substance": "4-HO-MPT",
  "views": "5145"
 }
}
