{
 "id": 13427,
 "title": "Tug-of-War",
 "date": {
  "submission": "2004-06-04T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "racine",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "extract-5x"
  },
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": ""
  }
 ],
 "report": [
  "I tried salvia 5x extract about an hour ago.  I had sent away by the internet for some, along with a pipe to smoke it in (I don't smoke).  I am on prescription medication; I take paxil, 30 mg per day, which supposedly would help me with depression and 'social anxiety.'  I also take a multivitamin every day.",
  "I was very conflicted about trying it.  First, I had never tried any drug save for alcohol, and then only a few times.  Second (and this probably sounds strange to most people), I was afraid that, if I ever have a girlfriend (I'm in my late twenties, am straight, and have never had a girlfriend) she might not like me if she found out I ever did a drug.  Third, I was concerned about the affects; since I have no friends who I'm close enough to to be a sitter and make sure I not hurt myself, I worried that I might inadvertantly start a fire.  Fourth, I had done some reading on the 'net about how some consider this a sacred plant.  Even though I'm not particularly religious, I was (and am) still somewhat cautious/afraid that I was not going to use the drug spiritually, but rather for my own enteretainment.  I guess I feared performing a sacrilege.",
  "I tried it anyway.  I went to my apartment bathroom, where if I dropped the pipe, it would presumably not start a fire on the tiles.  I opened the small vial the salvia came it and put a very small amount in the pipe.  I used a lighter and held the flame over it as I inhaled (the instructions suggested I do this), and smoked.  I didn't feel anything.  I did this several more times with very small pinches of salvia, all to no effect.  I then took (what seemed like) a large amount, put it in the pipe, and smoked it.  I smoked another amount of about the same size.  I may have smoked a third or even fourth time, but I don't remember.",
  "I had music playing on the radio ('Tainted Love') and when I heard the part of the song where it switches over to those words from the supremes song ('Baby, baby, where did our love go...') I thought the music was actually an airplane flying over my apartment building.  I was sitting on the bathroom floor (I had tried to walk, and it was dizzying).  I closed my eyes and (it's hard to explain) I felt as if I were part of the floor, and the floor was moving in waves. ",
  "One important effect/mindset during the whole experience was my original concern that this may be a spiritual tool (and not a recreational toy).  In the various patterns, etc., that I saw, I shifted in my thoughts from 'cool, this is an interesting trip' to 'cool, this can be a spiritual journey.'  I guess I retained enough of my rational senses that I felt a tug-of-war, so to speak from this high in trying to assess the meaning or whatever.",
  "I guess I take from this a few things.  First, my curiosity about other drugs is actually less acute than before.  I have no idea if it's like marijuana, etc., but having felt my first non-alcohol chemically induced altered state, I realize that life can be full without these drugs (though I might try it again).  I appreciate 'sobriety' more than I otherwise might have before.",
  "Second, I think there's something to the spiritual connotations with the drug.  One's experience might be richer if they did it somehow in a spiritual context.  'Spiritual' is a vague and abstract word, I know, but it seems to fit in with the experience.  This drug might work good either for meditation or for communication with another person on a deeper level.  I wouldn't think people would have fun partying with it.",
  "I consider myself lucky that no serious harm came to me.  I had no 'sitter' to watch me should I have done something foolish.  Also, given a different environment or different preparation (in terms of research into salvia), this might have been a scary, unpleasant, even dangerous experience.  If you really want to try this, I hope you are fortunate enough to have a friend who's willing to 'sit' for you.",
  "I would also advise against driving even several hours after use even though the noticeable effects appear to have worn off within an hour.  As far as I know, the drug is legal, though in some localities it might not be."
 ],
 "erowid": {
  "id": "8988",
  "citation": " racine. \"Tug-of-War: experience with Salvia divinorum (ID 8988)\". Erowid.org. Jun 4, 2004. erowid.org/exp/8988",
  "substance": "Salvia divinorum",
  "views": "4669"
 }
}
