{
 "id": 13429,
 "title": "Hell, Heaven and a Bunch of Other Places",
 "date": {
  "submission": "2000-09-09T07:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Direct86",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "25 seeds",
   "administration": "oral",
   "substance": "Datura",
   "form": "fresh"
  }
 ],
 "report": [
  "Well, where do i begin. me and two friends found a datura plant just growing in some garden. we've heard that if you eat it you trip, it sounded cool, and were stupid 16 year old, so why not. we didn't know how much to take so we decided to cut the fruit to 4 pieces and each eat a quarter. as i said, we didn't know what it was and how much to take and in retrospect, it was way too much. from what i've heard you're only supposed to take a few seeds, 10 tops. we each took like 20 or 30. we didn't even know how to take it and we just swallowed the seeds (since I've read you're supposed to put it in hot water and boil it).",
  "anyway, so we eat the seeds and just hung and walked around. it took it like 30 minutes to start and i really can't say that i remember much. all i know is that it was pretty cool for the first few hours, we were tripping like hell but i also did a lot of acid at that time so i was used to that. then after the first few hours we all started throwing up and both me and the two girls said that our eyes went blank. i couldn't see anything, everything was just white and i wasn't even tripping, not visually anyway. i felt wierd as hell, like nothing before. as i said, i can't remember much but the thing lasted 4 (!) days. i don't know where i was or what i did. i remember throwing up a lot and sweating like a hourse. i was definitely not o.k. i kept fainting and falling asleep on and off. it's like i was in a totally different state of existence, unlike acid or any other thing. much stronger even than DXM. unlike anything i've done before or since.",
  "i can't say it was pleasent. and i can definitely say i will never do it again. BUT, maybe if i knew how to take it it wouldn't have been that bad. i had flashbacks of those 4 horrible days for like 2 months, both seeing and hearing things of stuff i experienced while i was on it. the feeling of throwing up and sickness that i felt while on the stuff was the worst feeling ever. buttom line, don't do it. (but if you're gonna do it anyway, take just a small amount - like 5 to 10 single seeds)"
 ],
 "erowid": {
  "id": "899",
  "citation": " Direct86. \"Hell, Heaven and a Bunch of Other Places: experience with Datura (ID 899)\". Erowid.org. Sep 9, 2000. erowid.org/exp/899",
  "substance": "Datura",
  "views": "16445"
 }
}
