{
 "id": 13420,
 "title": "200 Plus Trips and Not Counting",
 "date": {
  "submission": "2004-06-07T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "doodahman",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Greetings.  On August 4, 2001, I ingested approximately 4 grams of mushrooms purchased a month earlier.  This was the third trip out of the same bag, the prior trips occurring approximately two weeks apart, starting six weeks from the time of the third trip. ",
  "At this time, I was sharing the mushrooms with a novice on her first trip of any kind.  She took approximately 3 grams, her weight being approximately 130 lb. Unlike the first two trips, I ritualized the ingestion by preceding it with a fast (eating only a few raw vegetables earlier in the day, drinking only water) prayer, burning sage, requesting guidance, and the passing a pipe of marijuana.  Within approximately one hour of ingestion, we were both slightly nauseous, with a severe tightening in the chest.  I recognized the symptom from the earlier two trips, and was able to quickly overcome both the nausea and the tightness by forcing myself to breath deeply and from the diaphragm.  The breathing triggered an ecstatic high which lasted approximately three to five hours.  During that portion of the trip, I achieved an extreme degree of clarity of mind which I had experienced a few times in the past using LSD.  I was completely aware of my location, surroundings, the circumstances of my trip, and all facts normally associated with complete orientation to time and place (my name, the date, the current president, etc.)",
  "During that time, however, I accessed a great degree of spiritual 'knowledge.'  Emotionally and intellectually, I was in a state of complete peace and happiness.  I would best describe it as being in Nirvana, or a heavenly state of grace.  I understood that pain and suffering existed, but it did not matter to me, as I did not associate the condition of my body with my true condition.  I saw only beauty and energy permeating everything around me, from the blades of grass to the rails of the train track behind my house.  During this revelry, I was able to guide my companion through a difficult trip.  It was not a bad trip, simply far more intense than she anticipated.  By getting her to breathe as I did, I was able to help her regain some control over her focus of attention.  It was overwhelming for her, but not really unpleasant, and she affirmed a desire to continue experimentation.  For me, it was one of the most moving and spiritually enlivening experiences of my life.  I felt then, and feel now, that I had achieved, for those few hours, a state of complete grace. ",
  "The feeling has been retained since; I have renewed my spiritual studies and feel invigorated as never before.  The conclusions which I drew about our collective and individual existences remained with me as well.  I wrote the statements which 'came' to me several days later.  There was nothing new in the statements, but to me it was a crystalization of the concepts of the eternal soul, free will, ego, and karma/sin.  They were concepts that were taken from many philosophies, but were simply brought together in a comprehensible form in my mind at that time, reinforced by an absolute certainty derived from my emotional state of grace.  Interestingly, the second trip seemed to be a precursor of the third. In the second, I did not achieve the state of grace; I did, however, start obsessing over the question of 'where do wants come from?'  This question turned over many times in my mind, and it seemed that in the third trip, the answers to that question came forward.  This is the first time that I ever felt that one trip was a continuation of the prior trip, rather than an entirely separate event. Peace."
 ],
 "erowid": {
  "id": "8981",
  "citation": " doodahman. \"200 Plus Trips and Not Counting: experience with Mushrooms & Cannabis (ID 8981)\". Erowid.org. Jun 7, 2004. erowid.org/exp/8981",
  "substance": "Mushrooms & Cannabis",
  "views": "6677"
 }
}
