{
 "title": "High Was Mostly in the Head",
 "author": "Da Mad Scientist",
 "citation": " Da Mad Scientist. \"High Was Mostly in the Head: experience with 'White Rock Opium' & Cannabis (ID 13428)\". Erowid.org. Oct 22, 2007. erowid.org/exp/13428",
 "substance": "'White Rock Opium' & Cannabis",
 "bodyweight": "210 lb",
 "report": "<p>I had an encounter with the mysterious substance known as 'White Rock Opium' the other day, and since I couldn't find any real information on the net about it here is my encounter.</p><p>I went over to my friend's place to smoke down with him, someone he knew had dropped off maybe a few grams of 'White Rock.' It was smoked out of a 'bubbler' glass pipe, mixed with some very good dried and crushed buds. Note: the marijuana buds arrived in vacuum sealed bags, still on the branch.</p><p>Physical Characteristics:</p><p>It looked like washed rock salt, most probably forming a crystal lattice structure. The sample consisted of several rocks, approx. 2cm for the length of the largest rocks, as well as several smaller chunks and/or flakes, and white powder. Visually it looked as if it may have been brittle, considering the inconsistency in the form of the chemical. The larger rocks appeared to be somewhat translucent and reflected light as you would expect from a clean piece of rock salt. The flaked and broken off pieces were more opaque, with the dust appearing almost completely white, especially as the sample became finer.</p><p>When heated the broken pieces of the chemical melted somewhat and fused to the glas side. When fused it appeared opaque white and flaky. Note that it was smoked with marijuana and the appearance may have been altered due to ash/resin/etc., although there was no noticeable taste of marijuana after it had been burned off.</p><p>The chemical did have an opium like taste, regarding mostly to its complexity. There appeared to be a 'sharp' taste on the tip and center of the tongue with a somewhat sweet on the sides in the back of the mouth, it was also somewhat bitter somewhat like a burning plastic.</p><p>The smoke was very fine when exhaled and the sample did not produce much smoke when burned. The sample had a fire red appearance as it was being lit and burned.</p><p>Effects:</p><p>Note: that the chemical was smoked with marijuana so the effects were not purely from the chemical.</p><p>Onset of effects were subtle and not instant, though relatively quick, much like the way marijuana hits me over a course of several minutes.</p><p>When full blown there was a distinct 'opiate like' feeling from the chemical, but this was mainly in the head. It was a sunny day and things did have that slight glow that I often get with opiates, and my senses did seem altered and heightened somewhat as with opium, although some of this could be attributed to the marijuana.</p><p>The real major difference was that the opiate effect that normally sets into the body was not present, rather the high was mostly in the head.</p><p>There did not appear to be any withdrawal symptoms from the drug, and being consistent with the absence of the visceral high I did not become constipated as I would have with a real opiate. (i.e. In my opinion the chemical's molecular structure of binding sites probably will not resemble opium, and if they do will probably have a low affinity for opiate receptors, if they even bind to opiate receptors at all.) Note: lack of withdrawal may have been due to the fact that I continued to smoke marijuana throughout the rest of the day.</p><p>Personal Note:</p><p>As an opium user I would not take this drug again, in my opinion I'd be more satisfied and better off smoking the real thing. Although I do not know if I recieved a proper dose to recieve the full effects of the chemical. Since the chemical is unknown it should be considered unsafe and I advise anyone who partakes in it to be careful, since an overdose would be hard to treat owing to the uncertainty of the chemical's composition.</p>",
 "year": "2002",
 "id": "13428",
 "gender": "Male",
 "timestamp": "2007-10-22T07:00:00.000Z",
 "views": "20028",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "smoked",
   "substance": "Unknown"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 }
}
