{
 "id": 13423,
 "title": "Meditative State",
 "date": {
  "submission": "2004-05-13T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "dZ El",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.8 oz",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(tea)"
  }
 ],
 "report": [
  "I wanted to see for myself that OTC nutmeg was a waste of time. Being that it is the same seed and seems awkward that spice producers would extract the essential oils from the seed. So I tried the experiment twice. Once with a small dose of nutmeg from my kitchen .6 ounces simmer in a tea.  This Nutmeg brand came in plastic and had been aging a few years. The results were mild changes in sense and something a lil short of a headache. So I went to the store a few days alter and decided try it right. This time I bought 1.8 ounces of in glass.  This time I just dumped it all into a tea.",
  "1st Four Hours: unfortunelty I was called into work an hour or so after I start sipping my concoction as it was first starting to Come on. Through my 3 hours at work I noticed a fog in my vision and some vibratory hallucination. The Nutmeg didnt seem to affect my judgment and no one noticed. My hours at work passed very calmly and I was excited about continuing on.",
  "5 hours and through Night: I began to sip the tea now again re boiling it and stirring it up. My tea bag was drenched in soot by now. Disorientation began to pick up a bit more.  I could really feel the nutmeg now and sipping on it became something ritualistic. A communication of sorts as I could feel the oil of myristica gathering on my nerves and blood etc.  The fog began to deepen to a meditative level. I felt like I was high of marijuana for the first time. My eyes got red and I got the giggles. At this point I was just sitting in front of my monitor very introverted and giggling at nothing. I was just sitting around laughing. It was hard to keep my concentration at this point and I loss a sense of my conversation; this is when id says I was a point of enlightenment. I felt like id reached a state of chemical myrisiticsm.  I decided then to use nutmeg sparingly so that it would continue to enhance my connection to the world around me.  The nutmeg seemed to enhance my mood and senses making things seem a bit more profound. The interesting part came late in the morning. The Nutmeg did not have a depressing affect that would have made me goto sleep. I went to sleep just fine but before I fell asleep I felt my spirit like a vortex. As my dreams began to start I felt the presence of spirits communicating me through sensation and feelings. As if each of my thoughts was a specific conversation with a pocket of energy. My computer though shut down creaked and the vibration ran through me as if was awakened on an electro-magnetic level. Even on high amounts of LSD Im not the type to see much for hallucinations. But I did have a visualization of an energy cloud around me as I lay in the meditative Nutmeg State. I did not drink all my tea. I didnt want to throw up so its hard to say how much of the good stuff was boiled into the liquid I drank and how much of the reaming soot was left.",
  "Next Morning and Day: My sister woke me up. My eyes were very blood shot and I yelled up at her  I am STOOONED and got up. My dad decided for some reason that he would take me driving in traffic for the first time. I hadnt the nerve to tell him id been eating nutmeg. So though I was disoriented and red eyed I played it off as fatigue and drove successfully to the gas station and back some 20 miles.  He would have definitely busted me if I had been smoking Marijuana. This buzz wasnt terrible wasnt a headache. It lasted all day to the next morning. The Sensation of the trip was there for a few days. I felt Spiced up.  I did feel weak however not tired. My muscles just seem to be a bit limper then normal and even moving at first wasnt tiring but wasnt as regular as usual.",
  "I am now a MEGANUT high prophet of the Nutmeg seed. I will tell people who are appropriate about this experience and plan to try it again soon when I have some free time.",
  "Negative Side effects: 18 hours after ingestion stomach cramps and a rather fowl excrement. With the plastic bottle stuff I had a bright yellow splat of excrement. And then I felt fine but with the 1.8 glass I had at most two hours of stomach trouble.  Other side effects disorientation, weakness and red eyes.",
  "DZ EL MegaNut prophet of Nutmeg"
 ],
 "erowid": {
  "id": "8983",
  "citation": " dZ El. \"Meditative State: experience with Nutmeg (ID 8983)\". Erowid.org. May 13, 2004. erowid.org/exp/8983",
  "substance": "Nutmeg",
  "views": "24138"
 }
}
