{
 "id": 13434,
 "title": "Gentle Euphoria",
 "date": {
  "submission": "2011-03-29T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "BeerAndWeedDiet",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "2C-C",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Ive been pursuing lately the gentler 2C-X compounds, namely 2C-C and 2C-D. Having tried 2C-I (which provided body load and stimulation but not much mind-space alteration at all), 2C-E (an excellent psychedelic, but a little bit long lasting for what I am usually trying to accomplish), as well as 2C-T-2 (which was a positive experience, but I will not continue to explore the sulfuric compounds because of their MAOI action).",
  "I am in search for something that is gentle on the body and shorter in duration to enable mellower, glowing, analytical, and lucid experiences. I have not been able to get a hold of 2C-D yet (almost), and this was my second experience with 2C-C. My previous experience with it (at 20mg orally) was clouded with alcohol consumption.",
  "I decided to try 20mg orally to establish my reaction to the drug and to note its effects.",
  "Here goes:",
  "T-1hr: A large steak was eaten, and two beers were consumed with the meal.",
  "T+0:  Swallowed 20mg +/- 1mg wrapped in tissue. Mindset: lethargic (maybe from beers or from sleeping all day).",
  "T+35min: Slightly anxious. First alert. I feel slightly warm and my body feels slightly euphoric. I am fixing minor things in my car outside. Outside temperature is perfect.",
  "T+50min: I feel slowed down and chilled out. Still warmer than when I was before the alert.",
  "T+65min: Slight dry mouth, slight jaw tension. Body feels good. Great side effect profile! Still coming up slowly, probably due to a slightly full stomach.",
  "T+1.5hr: Feels like Im stoned from weed, but with mental clarity. Body feels euphoric and, like weed, makes me more aware of physical sensations (including discomforting ones, like aches). Absolutely no visuals, OEV or CEV, but mind-space is altered and I feel like I blend right in with my friends who are socializing with me in the living room (they are smoking lots of weed). I have no anxiety at this point. Still only a Plus 1, unfortunately.",
  "T+3hr: Feels like Im coming down already, although I wasnt feeling much in the first place. Appetite is good. Ate Ramen noodles and after that, I seemed to be at baseline. ",
  "Conclusion:",
  "For me, 20mg orally barely had an effect. However, I feel that with a completely empty stomach, the effects may be greater (almost a ++), although probably short lived. If I were to take something in a public setting (museum level), I would probably take 25mg on an empty stomach. Next trial will be 30mg orally on an empty stomach. A 50% increase might even bring it to a +++."
 ],
 "erowid": {
  "id": "89915",
  "citation": " BeerAndWeedDiet. \"Gentle Euphoria: experience with 2C-C (ID 89915)\". Erowid.org. Mar 29, 2011. erowid.org/exp/89915",
  "substance": "2C-C",
  "views": "6018"
 }
}
