{
 "id": 1344,
 "title": "My Release",
 "date": {
  "submission": "2007-06-16T07:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Anounymous"
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Albuterol"
  }
 ],
 "report": [
  "It is true that a buzz can be obtained off of albuterol inhaler, and sometimes a very fun one (especially when Im bored with nothing to do). The high can be compared to nitrous or dust off inhaling, but with subtle differences. It isn't worth it though, I've had sever asthma all my life and in about first or second grade I discovered the little 'high' it gave me by accident.",
  "At first I would only do it once every so often. I remember waking up very early in the morning so I could go upstairs and buzz of my inhaler while watching cartoons. I don't know when I started increasing my recreational usage of it, but I'm pretty sure it went up with the severity of my asthma. I only specifically remember a couple periods of trying to quit in grades four and five. After those (semi) successful quitting periods I had pretty much forgotten about getting high of my inhaler until about fifth or sixth grade when I guess you could say I 'rediscovered' it. I began using it as a sort of release from my father's alcoholism. This is when a real mental and physical addiction started to develop.",
  "The length of time I kept an inhaler went from the recommended three weeks, to two, then one, then to about three days an inhaler. Obviously my parents began to notice something was wrong and thought that I my asthma was getting very serious. I was so addicted to it that if a single unpleasant thought popped into my head I would immediately slip my hand into my pocket and take a couple hits off of it, it was my security blanket. If I didn't get high off of it a couple times a day I would feel scared and alone. I remember taking about ten successive hits in the middle of class without even caring.",
  "I have also gone through a whole inhaler in the course of an hour (200 puffs about). The side effects of taking too much are headaches, throbbing eyes, fast heartbeat, unsteadiness and a strange numbness to the mouth that would often last for weeks at a time for me.",
  "As early as seventh grade I started trying to quit using it that way but I couldn't. its hard quitting something I keep in my pocket 24/7. I have pretty much stopped my addiction but still reach for it at times when I need comfort."
 ],
 "erowid": {
  "id": "14041",
  "citation": " Anounymous. \"My Release: experience with Albuterol  (ID 14041)\". Erowid.org. Jun 16, 2007. erowid.org/exp/14041",
  "substance": "Albuterol ",
  "views": "20042"
 }
}
