{
 "id": 13458,
 "title": "Pleasant and Mild",
 "date": {
  "submission": "2011-09-21T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "jaggerjack",
  "gender": "Male",
  "weight": "132 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "20 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:20",
   "amount": "10 mg",
   "administration": "insufflated",
   "substance": "DPT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>Prior substance use: Started doing drugs 8 months ago. Marijuana, Alcohol, Kratom, Nitrous, Shrooms, DMT, Salvia, Vicodin, Acid (likely not LSD), 4-AcO-DMT, Ketamine, 4-HO-MPT. No substances for the last week. Last tryptamine taken was 4-HO-MPT two weeks ago.",
  "The purpose for this trip was to explore DPT. Everything I had read said DPT was pretty similar to DMT, with the main difference being it was a bit darker. I was considering 35-40 mg but settled on 30 after reading some cautionary notes. I hoped it could possibly give me some insight on what I wanted to do with my life romantically and as I expected to be alone for part of this trip I hoped to probe myself.",
  "I weighed out 30 mg DPT before my friend D came over to try DMT for the first time. D hit the pipe and once he was in the non-visual phase I snorted 10 mg in each nostril. It didnt sting at all. The drip was significantly less bad than the drip from Ketamine (the only other thing I have whisked up my nostrils); in fact it did not detract from the trip. I then waited around for about 15 minutes before I noticed anything, I would describe it as an airy or spacey thing. After another 5 minutes I decided to snort the rest of my dose, brining the total to 30 mg. I expected this to be rather strong considering the warnings I had read online but I was very surprised to find that it wasnt. While I had anticipated a decent visual trip spread out over a few hours I was greeted with a very gradual come up that left me at a state that was analogous to being borderline between visuals and not having visuals for DMT.",
  "My friend S came over for he wanted to try the DPT too. This worked out very nicely since D ended up leaving soon after and I didnt particularly want to be left alone, although by now I had established the trip wasnt going to be all that intense. Walking downstairs I noticed that lights had auras, although the auras didnt look like flowers, what I get from 4 subbed tryptamines, they instead simply radiated outwards and were different colors than the lights themselves. Non-light source objects glowed when light reflected over them, it was mostly blues and greens. As a note, I dont get alteration of light from DMT. S ended up doing 25 mg of DPT which I weighed out for him. I had an irrational thought that I had accidently weighed out 2C-I, which was in a different sized bag and is a different color and texture. This was odd but quickly passed when S didnt scream in pain once he snorted it.",
  "Listening to music I noticed significant alteration, the distance between me and my speakers appeared to be changing causing fading ins and outs. Certain instruments were more enhanced than they typically were. I noticed slight visual movement if I stared at things up close. The usual breathing and swaying, nothing out of the ordinary. Colors were slightly different, specifically yellows and light browns appearing darker and more orange.",
  "After close to an hour and a half I would say I was peaking. It could have been before that but I lost track of the time and was very surprised by the length of the come up. Perhaps it was due to staggering the dose. Anyway after a slow climb, say linear instead of the parabolic I get from 4-subbed tryptamines or the rocket cannon of smoked DMT. The high was light, I felt a general sense of wellbeing and pleasantness coupled with general euphoria. I wasnt compelled to smile but I enjoyed everything.",
  "S and I decided to go for a walk and I found myself very stimulated, I was getting lost looking at the intricate textures on the snow. I had trouble telling where sound was coming from. This was obviously very disorientating. Combining this with louder sound than usual caused a near freak out when I thought someone was yelling very close to me, when it just turned out to be a loud quite possibly drunk group of people across the street from me. After a little while S and I returned to my house and I got some food. It was very easy to eat. I went into my bathroom and was rather startled to see my dilated eyes. Very dilated, something I had never seen in myself before except after one of those unpleasant visits to the optometrist. To an outsider viewer who cared to check I was clearly under the influence. This was rather unnerving.",
  "We were deciding what to do and chose to head over to my friend Ls house. S told me he was good to drive. I was a bit worried about but since he repeatedly told me he would be fine and I didnt think DPT would boost his courage or anything like that I decided to get in the car. I would certainly have been unable to drive because lights were profoundly different and my sense of depth was impaired. We arrived safely at our destination but waited in the car before leaving. The small confined space was intensely comforting. It felt to me like what wrapping up in a sleeping bag does when sober. The pounding music reminded me of home. After a minute or two we got out of the car and walked to my friends door, ready for whatever they had in store.",
  "There were now seven of us and S and I were the only ones under the influence. The others were being very loud and talking quickly. I was completely lost and a glance at S revealed he was too. The rest of the night was spent with this rambunctious crew; it was very entertaining watching them. Any interactions between me and them were fine, not forced or struggled. Over the next two hours I gradually came down and around four and a half hours later I would say I was completely down, save for the occasional glowing object I would see when an odd ray of light hit it.",
  "This was a very pleasant experience and if someone was fine with snorting a substance I would recommend it (the dose and substance) as a first psychedelic. I would do this for many reasons. Firstly the entire duration was not particularly long. It is comparable to most 4-subbed tryptamines. The peak was shorter than most 4-subbed tryptamines and there was no mind fuck. The body high was very pleasant. Overall an experience I am looking forward to repeating at a higher dose, perhaps 50 mg?</p>"
 ],
 "erowid": {
  "id": "90025",
  "citation": " jaggerjack. \"Pleasant and Mild: experience with DPT (ID 90025)\". Erowid.org. Sep 21, 2011. erowid.org/exp/90025",
  "substance": "DPT",
  "views": "3526"
 }
}
