{
 "id": 13453,
 "title": "A Sudden Jolt",
 "date": {
  "submission": "2004-02-11T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Ginseng",
  "gender": "Female",
  "weight": "120 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "inhaled",
   "substance": "Ether",
   "form": "(gas)"
  }
 ],
 "report": [
  "I know people are going to read this and say, 'Well, she deserved that because she was stupid,'. In a way it's true, but I just want to stress the importance of the unknown. And when I say the unknown, I mean that even experienced, long-time drug users (like myself) can sometimes fuck up and not realize how intense consequences will be. Anyway, I was driving to work on a Tuesday morning, not even to the Interstate yet, and had a little bit of ether left in a can. I know it messes me up real bad, but I figured hey, I can handle doing a small bit and still keep my eyes open enough to drive. Wrong. I guess I ended up passing out or zoning out, and a few minutes later (my memory cuts off after the first hit but I had to have still been awake at first because I made turns) while taking a shortcut to the Interstate I went through a fence and into a ravine. I don't remember the wreck at all (like I said, my memory stops about 2 minutes before) but I do remember 'coming to' from an ether high, experiencing that wierd ringing in my ears and feeling an enormous amount of pain surge throughout my ENTIRE body.",
  "I ended up totalling the rental car I was driving (a 2001 model, at that), having 2nd degree burns on my neck, chest and stomach (seatbelt), fracturing my shinbone on one leg, badly fucking up my other leg and cracking a rib. I thought I could handle it, but I made an almost deadly mistake. I just thank God I didn't involve anyone else in this stupid, preventable wreck. I still mess with weed but ether is off my list completely, as are all other inhalants."
 ],
 "erowid": {
  "id": "8999",
  "citation": " Ginseng. \"A Sudden Jolt: experience with Diethyl Ether (ID 8999)\". Erowid.org. Feb 11, 2004. erowid.org/exp/8999",
  "substance": "Diethyl Ether",
  "views": "36307"
 }
}
