{
 "id": 13456,
 "title": "A Well Thought Out and Wonderful Trip",
 "date": {
  "submission": "2011-05-02T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Luc Cedsiby",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "17 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I felt like I should probably share my fairly wonderful experience. I ordered a few grams from an overseas chemical company that I have had fantastic luck with before. This being said I have fairly high confidence in their products. I spent about three months reading up as much as I could about the substance and the different experiences people have had with it. I also took a couple different finger dips throughout this period to make sure there was no allergy to worry about. I feel like the biggest thing standing in the way for 5 meo DALT is how often different chemicals are mistaken for it. Anyways here goes my night wth Mr. Dalt Whitman.",
  "I weighed out 17 mg of 5 meo DALT and put it into half a gel capsule, pouring the substance onto my tongue. I feel it should be noted that the taste was not bad by any stretch. A faint indole taste but nothing to write home about. Not nearly as bad as say MDMA and I don't even mind that taste. I let the substance sit in my mouth and rubbed it around my gums with my tongue. After about half an hour it began to kick in. It was a very mellow build up with absolutely no body load. It was honestly the cleanest feeling high that I have ever experienced. It is difficult to explain how it made me feel as is usually the case with entheogens. It was a very mellow build up causing me to pick up my ukulele and write some haikus. After about an hour I began listening to music and falling into that special revelry appreciating every little vibration.",
  "I began feeling a large amount of euphoric energy but absolutely no pressure to use it. No edginess whatsoever. I switched from dancing around my room to turning all the lights off and meditating for the last hour of the trip.",
  "This has the potential to be a wonderful tool in my opinion. I agree with an earlier report that this could have amazing therepeutic value due to how mellow it is at least in small doses. All in all it as a fantastic trip that lasted about two hours and resulted in zero hanover just a pleasant after glow. I will experiment again when the time is right. Be safe out there my friends, be safe and be smart. Please do your research and go into your experiments in grand moods!"
 ],
 "erowid": {
  "id": "90014",
  "citation": " Luc Cedsiby. \"A Well Thought Out and Wonderful Trip: experience with 5-MeO-DALT  (ID 90014)\". Erowid.org. May 2, 2011. erowid.org/exp/90014",
  "substance": "5-MeO-DALT ",
  "views": "9202"
 }
}
