{
 "id": 13477,
 "title": "Fast Forward",
 "date": {
  "submission": "2012-01-11T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Kewagi",
  "gender": "Male",
  "weight": "65 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "17.5 mg",
   "administration": "IV",
   "substance": "4-AcO-DALT"
  },
  {
   "time": "1:30",
   "amount": "17.5 mg",
   "administration": "IV",
   "substance": "4-AcO-DALT"
  }
 ],
 "report": [
  "Used mixture: 35mg of 4-AcO-DALT and a hint of citric acid, dissolved in saline solution. Set & Setting: Alone in a studio with some low lights and soft trance music. Interested in the substance, emotionally a bit shaken, but well, physically healthy.",
  "(with ~15-20mg IV) The effects are very close to mushrooms, but it's like somebody pushed fast forward - while I was still injecting, the world already washed away in a blurry wave of color and light, hence the inaccurate dosage report. Reached ++ instantly, then went up to +++ for a few minutes. Everything was over within less than an hour but there's a distinct 'shroomy' feeling from start to finish - I could swear I even had the taste in my mouth.",
  "Felt very primitive and animalistic for a while, but no mushroom-like 'earth connection'. Wandered through the hallways, everything appeared like a futuristic ruin/dungeon setting, and I had a strong urge to rip my clothes off, throw stuff around and stare into a fire. Resisted said urges.  This was the first time I iv'd a tryptamine, so maybe that high-speed effect came from the ROA rather than the substance itself - I really should read up on this :)",
  "(with ~15-20mg IV, T+01:30) Slight visual, but pronounced mental effects, started coughing and retching heavily after a minute, was pretty sure that I was about to die, in a relaxed, matter-of-fact kind of way. Made it out of this through some mental exercises. Resdosing was not a good idea -  I'm left with a 'dark' afterglow and a slight headache.",
  "What a peculiar substance. I'd love to try this again in a few weeks, with a higher starting dose and no redosing next time."
 ],
 "erowid": {
  "id": "90162",
  "citation": " Kewagi. \"Fast Forward: experience with 4-AcO-DALT (ID 90162)\". Erowid.org. Jan 11, 2012. erowid.org/exp/90162",
  "substance": "4-AcO-DALT",
  "views": "4660"
 }
}
