{
 "id": 13474,
 "title": "Experiment CWE Grapefruit Smoking",
 "date": {
  "submission": "2011-11-22T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "casual",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "21 tablets",
   "administration": "smoked",
   "substance": "Hydrocodone",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "The past 2 days i have been experimenting with CWE, grapefruit potentation, and smoking methods for 5/500 vicodin.",
  "CWE: In stead of using my jar to CWE the 20 and 1/2 vics that i had i used a measuring cup with a very wide base (about 6-8' in diameter), mixed it with a 1/2 cup of water coffee and put it in the fridge. When extracting, i was out of coffee filters so i used placed one wet paper towel over the jar, layered 5 pieces of wet toilet paper on top, and an ice cube. i then proceeded to filter the vics 3 times.",
  "CWE Results: The wider base made it a lot faster for the acetaminophen to settle in the fridge. the paper towel/toilet paper/ice cube filter worked amazingly! It was allot faster, and due to the strength of the paper towel and the density of the toilet paper, i was able to squeeze the water out with no tears or apap leak. I got a very fast, clear, and potent CWE using this method.",
  "Grapefruit: In stead of buying grape fruit juice i decided to buy two huge grapefruits. i ate one entire grapefruit one hour before taking the CWE and one 30 min after.My hypothesis about this is that: one, allot of the enzymes which suppress opiate digestion exist within the flesh of the fruit. Two the flesh of the fruit acts as a time release for the juice, extending its effectiveness.",
  "Grapefruit results: i felt the actual fruit made my high more potent last considerably longer. That being said i do not sufficiently recall my last experience with grapefruit juice to make a very accurate comparison. but it is still worth trying.",
  "Smoking: I soaked a black and mild cigar in my more concentrated, and extremely pure, CWE. after thoroughly soaked i placed it in the oven at around 120 until it was still damp but dry enough to smoke. My hypothesis was that though hydrocodone is destroyed at something like 140 degrees, the heat from the cherry will vaporize the yet unburned hydro just ahead of the cherry.",
  "Smoking Results: I was surprised to find that i got a nice buzz from the cigar. it was not from the tobacco because i smoke black/milds daily, and it definitely felt like a very light opiate buzz. some may say it is a wast but with the whole cigar soaked it probably only had about 5mgs of hydro tops. Its nothen thats gonna nock you on your ass but i think its fun to smoke a hydro laced cigar just to add an extra chill factor to your tobacco fix. WARNING: if any one does try this make your CWE exceptionally pure. you do not want to be smoking tylenol!"
 ],
 "erowid": {
  "id": "90145",
  "citation": " casual. \"Experiment CWE Grapefruit Smoking: experience with Hydrocodone & Grapefruit  (ID 90145)\". Erowid.org. Nov 22, 2011. erowid.org/exp/90145",
  "substance": "Hydrocodone & Grapefruit ",
  "views": "12723"
 }
}
