{
 "id": 13471,
 "title": "Understanding the Universe",
 "date": {
  "submission": "2013-12-25T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "ThePerformer",
  "gender": "Female",
  "weight": "45 kg"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms"
  }
 ],
 "report": [
  "<p>I was in Koh Phangan for the Half Moon Party on the 12th of March 2011. It was 5pm and we had been out on the beach the whole day. Feeling pumped and happy at what a good day it had been, my 5 friends and I decided to head to a famous bar for infamous mushroom shakes. We each had one full glass each (about the size of a regular Coke at McDonald's). I was feeling quite nervous because this was to be my first experiences with shrooms. After about 15 minutes, I felt my insides warming up. I was the first to go, as I tend to get 'hit' fast by everything from marijuana to rotten food. Most of my friends were there after 20 minutes or so. I went to the toilet and I noticed that it was starting to hit when I looked at an insect and I felt like I was talking to it and it was going to attack me. So I immediately rushed out of the toilet and joined my friends once again. I felt the sensation of drunkenness at first so I lay down and looked at the lights. The bar was built on a cliff overlooking the sea, so in the distance we could see the sea as well as lights coming from the bars on the beach. It was lit up around where we were seated as well, so I stared at the lights.",
  "At this point in time I felt uncomfortable sensations in my mouth and limbs but I chose to ignore them and focused instead on how beautiful the lights were. In no time I was transported into a different world. The friends around me had disappeared and I was on a fancy wooden carousel. I could hear sounds of happy children in the background, as though this was a scene from my childhood. I then decided to close my eyes and that was when I fell into a trance. In this trance, I was launched into a world that was so unfamiliar and yet so magnificent, wild and beautiful. It was unlike anything that I could ever have dreamed up or visualized on my own and I consider myself an extremely creative person. I saw a lot of sexually-related images: a massive orgy, man and man, woman and woman, man and animal, woman and animal. I also saw many humans without arms and legs. There were lots of geometric shapes and fancy circles in every single colour imaginable to mankind. These shapes formed alleyways and tents and massive dance floors. However these were not just visions. I was living in that world. These humans in my visions were talking to me. Most of the time they were either inviting me to join their experience, take pictures of me or cheer me on. These people were my fans. After the whole trip ended my friends actually told me that I was talking and laughing to myself, mumbling gibberish. They were initially very worried because I was in a trance for a full hour and I was the only one in that state. I was responding to them, talking with them, posing for photographs, laughing, and acknowledging their admiration and love.",
  "And then....the music. THE MUSIC!!! My world would change shape, size, color and mood, depending on the music and so would my body movements. The whole time I was laying on the floor I was moving. Different parts of my body took on the characteristics of different parts of the music. I could hear every beat and sound with crystal clear clarity and my body moved accordingly. My leg was the bass-line and it would move to the bass beats while my arms were the melody. Also, the different layers of the song would come from different places. Some came from the floor, some came from the trees and some from the sea.",
  "After about an hour or so, my friend slowly brought me out of my trance and she told me this, 'Are you ready to come back to this world?'. Initially I wasn't and I told her to give me awhile, because I did not want to leave. But eventually I accepted that this magic world couldn't last forever and it was time to return to the real world so I took her hand and she brought me back. I opened my eyes and looked around at my friends and began to soak in the atmosphere of everything around me. My friend said, 'It's okay. This will be a different kind of trip now'. I initially thought I was coming down, but then the second part of my journey began.",
  "But before I tell you that I must tell you about A, K, L, R and B. Those were the 5 friends I tripped with. A, K and L are my best friends and I love them very much. R is an old friend I am fond of whereas B is a person I like but am not close to. L was going through a phase of indecision about a personal matter at the time: she was contemplating whether to break things off with her fianc.",
  "Now, when I woke from my trance, I saw that L was tearing. I looked at her and I just started crying uncontrollably. I could feel her pain and the emotional turmoil she was going through. I suddenly felt a strange closeness to her fianc and the pain of having to let him go. It was almost as though her fianc suddenly became mine and I was breaking things off with him. However, K, who is an experienced shrooms user, managed to calm me down and gave me a hug. L also calmed me down and told me she had already come to terms with how the relationship had fizzled out. Then she changed the topic by talking about how women have secret gardens. Then I started talking to A and giving him hugs and A said I Love You and I said I Love You back to A, and then we all started showering each other with love and praises and we shared how much we all loved each other. At this point in time though, I noticed that B was extremely quiet and I could not look him in the eye. That was when I started to take a step back and I saw something very interesting. I could see auras, wavelengths and energies in the air. Different people had different colour surrounding them. Even though the place was well-lit, B had a darkness to his face. I could also see waves as though someone had ran a finger through the air connecting certain people to others. I looked around at the groups of people in the tables next to us and I saw it too. In theatre training we are always taught to familiarize ourselves with the energy of a group or a place. I had always understood it as something quite abstract. But on shrooms, this abstract concept took solid shape. I could physically see this energy. Different groups of people had different energies, and A, K, L and R had the same energy whereas B had a different one. And then I said, 'I get it'. I got it. I finally did. I understood that this universe has many more things than it is within our power to perceive. I grasped how clairvoyants, fortune tellers, diviners and do their thing. They don't have a 'power from the demon' and neither are they con artists. These people have higher powers of perception than normal humans. It's just that ever since we were young we have been indoctrinated by logic, science, religion, laws, rules and barriers that stop us from perceiving a lot of extra stuff that this universe has to offer us. But what shrooms does is break down those barriers. And that is because these barriers only exist within the mind. And so began the next part of my trip.",
  "I decided to go to the toilet again. When I got up on the toilet platform, I became extremely giggly and started laughing uncontrollably. I became so happy and so liberated. I felt that I was free from every single chain that had held me down in the past. I was so happy I took off my shorts and just started to move about. Then I saw this giant sitting on the bench near the toilet, and I started talking to him although I can't remember what I said. Then K brought me back down to our table and that was when something extremely empowering and enlightening happened. Whenever I listen to music I often close my eyes and imagine out a perfect dance routine for the song or piece I'm listening to. In this fantasy I am of course a superb dancer with incredible skill. In real life of course I haven't danced for at least 5 years or so and I stopped ballet training at the age of 13. But on that day, I felt like the dancer in my fantasy. Skilled and confident. I started dancing in my spot at first. Really feeling the music. And before I knew it I was dancing in front of the whole bar. Spinning on the poles, doing acrobatics from table to table. I was performing for the crowd and loving every minute of it. I was on a high from having an audience to perform to. It made be deliriously happy. I was doing stuff that I never thought I could or would do. I hadn't been this flexible in a long time. I was executing all kinds of moves that were very uncharacteristic of my personality and also my physical ability. It was then that I had my 'Aha' moment: everything really is in the mind. Our physical abilities are really only limited by our mental barriers.",
  "I saw a group of 3 guys at a table at the far end of the bar and then this strange thing happened. I became a lion. No words I use right now can describe how I felt. But I really was a lion. I wasn't pretending to be a lion. I became a lion. I felt like I was prowling around the 3 guys, kind of like choosing which one to devour. And I just prowled around the bar of a bit. Then 5 minutes later I became a spider. My hands moved like a spider on its own accord. After that, I became a scorpion. And I felt what it felt like to be an insect. To crawl on the ground. One of the guys lifted up his toe and I got so frightened. Everything around me was huge and tall, but my tail (which was my leg) was always ready to sting if the need be. After a while, K became slightly worried. She acknowledged my existence as a scorpion, and after she did that she brought me back to the table where I calmed down for a bit.",
  "Then I proceeded to tell everyone about the realization that I had come to. I told them that my experience so far had been terribly liberating and it made me realize my calling and that no matter how much I try to suppress it for whatever personal reasons, I am a performer. I revel in audience appreciation. Everything from the tripping bit, people taking pictures of me, the thrill, rush and pure happiness from performing for an audience was just so telling. I realized that since I was a little kid that was all I had ever been doing. That was my form of personal expression, performing. It was something necessary for me to do. And whatever I had just done was cathartic. I expressed to them that that was all I ever wanted to do but for fear of being judged or fear of familial or society pressures I had to conform to being something else, but I was so happy that the group A, K, L, R accepted that this was my calling and I knew they support me. R was so overwhelmed with emotion and happiness for me and he gave me a hug and then everything else came out. All the rest also revealed emotions and fears and secrets (expect B who was just emitting a dark aura all the while). And we all just started hugging and crying. Then, I got up and asked a table of 5 guys next to us to help us get a group picture of our perfect, loving moment. The dude I passed the camera to had a leg with a wound and when I looked into the wound it felt like his leg was going to be consumed by it...it was very scary so I immediately looked up at his face...and it was fine. And at this time I launched into a long explanation of how much I loved all my friends to these 5 Canadian dudes and they in turn told me their friendships, and then K came along and got me back on focus about how I should be asking them to take a picture. I can't remember what happened, but immediately the energy switched and turned slightly negative, and I felt scared so I found a way to walk away, but the guy still helped us take our picture though.",
  "We all then proceeded to sit and talk some more and I thought that life was so perfect...expect for this one thing...and then I started to think about my father and my parents and my family...and immediately my mood switched. From being at 100% happy, I was scared, frightened and depressed. And then I started toying with the idea of suicide, and I was very tempted to jump into the sea. I thought about it, and I thought that it didn't matter even if I did commit suicide. But then, I started to remind myself about reality and immediately said to K, 'Make me happy, make me happy!' And she just held my hand and smiled, and then I looked at A and at everyone else and got caught up with their conversation and I started going up again. And then it was just up, up, up and I started losing my grip on reality. I forgot how my mind behaved without shrooms, and how normal perception works. But all the while I just kept repeating to myself, 'OK. A has done this before and he became normal.' And after some time in which everything was pure happiness, I felt the effects of the drug wear off.",
  "I then got up and went to the toilet with K and we just started talking and laughing and being happy and telling each other how beautiful we were. And I looked in the mirror and saw myself, and it was the strangest thing ever, it was like it wasn't me. I felt I was someone else looking at me. Then L came up and K and myself started talking to her and we shared such powerful moments together about what L was going through. We laughed, cried and reassured each other, and I can honestly say, this experience has created a bond amongst all 5 of us that is extremely powerful. It only cost us 450 Baht each, and it lasted for only 5 hours.",
  "But in those 5 hours I learned about myself, my fears and how to control them. I learned that the mind is a powerful tool. I also let go of a lot of things I had been suppressing and I bonded with my friends in an amazing way. I also felt the presence of God. It was just a 5 hour trip but it seemed like a 5 year journey. Now, every time I tell people about shrooms, I won't ask did you have a good 'trip'? I will ask, 'How was the journey'?",
  "We were meant to go for the half-moon party after the shrooms. But we didn't because we were the party. =)</p>"
 ],
 "erowid": {
  "id": "90126",
  "citation": " ThePerformer. \"Understanding the Universe: experience with Magic Mushrooms (ID 90126)\". Erowid.org. Dec 25, 2013. erowid.org/exp/90126",
  "substance": "Magic Mushrooms",
  "views": "207"
 }
}
