{
 "id": 13482,
 "title": "Abject Life-Changing Euphoria",
 "date": {
  "submission": "2011-11-04T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jozef",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100"
   },
   "administration": "oral",
   "substance": "Tryptophan",
   "form": "daily",
   "specific": "5-HTP"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "3"
   },
   "administration": "oral",
   "substance": "Melatonin",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "daily"
  }
 ],
 "report": [
  "First, some very light background info that I think may be relevant.  I'm a somewhat heavy drinker, a nightly cannabis user for insomnia and I take 3mg of melatonin as well.  This has been my sleeping combo for a couple years now and the weed has definitely taken its toll on my short term memory, reaction time, and it seems to have put me in a chronic mild depressive state, but since the option was that or don't sleep, I decided on the depression.",
  "With that said, 5-HTP has been a godsend.",
  "Though it is sold OTC as a sleep aid among other things, sleep is not what 5-HTP induces in my body (though it does help with that too sometimes).  On the contrary, I feel better than I have in years and I believe I am involved in some drug-induced hypomania.",
  "It's only been a few days at 100mg a day (Important: I take this at bedtime, so the effects I will describe are not when the drug is still in the blood stream but well after the serotonin itself has been metabolized), but let me give the rundown of changes:",
  "Positive:",
  "1.  While I've generally become an anti-social and introverted individual since starting cannabis, within 24 hours of my first 5-HTP dose, I felt like my old 21 (Im 27 now) year old self again.  Whether I've been in class or at a bar, I've become the life of the party again, or so to speak.   Ive been getting along with people that used to dislike me, Ive talked to new people at bars and Ive dropped all my anxiety I had with approaching the opposite sex.  I feel like a million bucks and like the star in every room.",
  "2.  Alcohol has almost no intoxicating effect on me.  I drink a few days a week and I usually drink a pretty decent amount (240-300ml in a night).  Since starting 5-HTP I am unable to get drunk.  I still lose inhibitions when drinking to a certain extent, but I don't get the depressive effects or the 'drunkenness' feeling at all.  To test this I drank about half a bottle of scotch last night and I was still 'on' - no one would believe me when I told them how much I'd had to drink.  Im putting this under positive because I believe I may stop drinking altogether if this effect continues.",
  "3.  My wit and reaction time has increased exponentially.  I don't need to 'think' of a comeback or a response; it's just kind of there.  This was another feature of my old personality before years of pot and alcohol.",
  "4.  I have a LOT of energy and I need a lot less sleep.  I can get by on 4-6 hours a night and when I wake up, I am *awake* almost immediately.",
  "5.  My mind is fast and clear.   I can easily trace a few different lines of thought in my head all at the same time and not lose any meaning in the process.  While I think I may be a little more easily distracted than usual, my processing power has increased and my speech is a lot faster  but bear in mind that I am fully lucid and understood when I talk.",
  "6.   I am happy and detached from the every day stresses of life.  I feel like I can take on the entire world if I need to, so sweating the small stuff just seems pointless and it doesnt aggravate me like it used to.",
  "7.  My self esteem is much higher than it was.   There are a few people in my life that Ive let walk over me for the past few years, but thats completely changed.  Ive become the dominant person in most of my relationships and the dynamic has changed greatly.",
  "8.  This may be a little premature, but I think I may start losing a good amount of weight.  Im a bit flabby at the moment, but 5-HTP restricts my appetite in the sense that I eat less in every meal than I normally would.",
  "Negative:",
  "1.  5-HTP makes me crave cigarettes a lot.  I just switched to electronic cigarettes in hopes of quitting but my craving increased severely for real smokes after I started 5-HTP.   Even then, a cigarette doesnt seem to reduce the craving that much nor for that long.  Another drug that has made me feel like that is adderall (as well as the constituent amphetamines in adderall, if taken alone).",
  "2.  Ive gotten somewhat intense tachycardia each time Ive taken it, for about two hours afterwards.  Night #1 I took it with melatonin and cannabis, and it was somewhat pronounced.  The next two nights was with melatonin, cannabis and after a night of drinking, and it was a lot more pronounced.  From now on I will be taking it when I wake up instead of when I go to sleep.",
  "In my research of 5-HTP I have found only a few people who have had experiences like mine, and Im not sure what the implication of that is.  Am I an undiagnosed bipolar?  Has weed and alcohol just drained my body of serotonin?  Do I have a nitric oxide synthase or NO deficiency?",
  "I dont know if I will ever have the answers to these questions, but what I do know is that, thus far, 5-HTP has completely changed the way that I look at life, the way I feel about myself, and the interactions I have with other people."
 ],
 "erowid": {
  "id": "90209",
  "citation": " Jozef. \"Abject Life-Changing Euphoria: experience with 5-HTP (ID 90209)\". Erowid.org. Nov 4, 2011. erowid.org/exp/90209",
  "substance": "5-HTP",
  "views": "11815"
 }
}
