{
 "id": 13490,
 "title": "Perfect Cocktail",
 "date": {
  "submission": "2012-01-30T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tiberius",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1.5",
    "quantity": "1.5"
   },
   "administration": "oral",
   "substance": "Piracetam"
  },
  {
   "time": "3:00",
   "amount": {
    "unit": "mg",
    "quantity": "150",
    "grams": 0.15
   },
   "administration": "oral",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "5:00",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Methylone"
  },
  {
   "time": "8:00",
   "amount": {
    "unit": "cig.",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "0:00 1.5 grams Piracetam",
  "3:00 150 mg 4-FA",
  "5:00 200 mg Methylone",
  "8:00 One joint Cannabis",
  "A friend recently bought piracetam,   which I promptly looked up. There were a few reports that state that using Piracetam before Methylone really lengthened the plateau, from an average of 1.5 to two hours to more like 4-5 hours.  Another interesting reported effect was that piracetam  mellows the comedown.",
  "The Experience:",
  "Mindset: Excited for electronic show that was happening later that night.",
  "I had already planned to take 4-fa and then Methylone later, because of the synergy between the two substances.  2 hours before the electronic show started, I took the 1.5 grams of Piracetam, and felt no mental effects from it.",
  "Arrived at show, and started taking photos ( my job that night).  Took the 4-fa 30 minutes before the show was going to start. People crowded the dance floor and the lights were very well done. I could not stop moving, but I was not rushed like many of the amphetamines that I have experienced.  The 4-fa enhanced my communication ability, and I was less inhibited. This lead to me meeting and exchanging information with two of the performers that night. There is never any pupil dilation that I have found with 4-fa (my experiences have always been below 180 mg).",
  "Two hours into the show, it seems like a good time to take the methylone. In retrospect I probably should have dosed  less. The comeup was dizzying, very MDMA like, and very unlike my previous methylone experience. I started to overheat for a little bit, and worry about what I was doing to my body, and question why I took another substance when  was feeling dandy just on the 4-fa. But I got my thoughts in control, and the overheating stopped. Pupils were extremely dilated. ",
  "My thoughts were very calm, and not all over the place. I felt that I was suspended in my own personal water tank that I could bring around with me, so weightless and light  I felt.  Sound was crisp- a few of my friends were already losing some hearing due to the loud show, but I could hear them everytime.  It was harder to start dancing again, but when I got going, it brought back memories of my first and second MDMA experience. I felt that the crowd and the music became serene, and my mind was totally into the moment, thinking about the future was almost impossible. A girl motioned to talk to me, and she pressed her hand against my cheek as she whispered into my ear- Her touch shocked my being to its core- I never knew that touch could be such an electric, mind blowing experience.",
  "The show was over at Midnight. Luckily there was an after party to go to, for I was full of a calm energy. Contrary to many of the experience reports concerning Cannabis usage and Methylone, I found the pairing to be very good.  It was as if the Cannabis was adding Color back into my world that was whited out by the ecstasy I experienced.",
  "Ran into a friend who was disappointed by his bunk MDMA.  Told him of my experience and he as very much interested in trying the combination.",
  "Conclusions:",
  "Piraceam + Methylone =  Return of Magic?",
  "There is definitely something special with piracetam/methylone combinations. Mine is not the first report to tell of how great methylone can be when used with piracetam. I found the 4-fa to be a great intro, since it provides long lasting subtle stimulation without being jittery, at least in my case. Usually I end up with a comedown much later, the same with methylone. However, I had no problems going to sleep after the afterparty. Which is pretty amazing to me considering the amount of stimulants I consumed that night."
 ],
 "erowid": {
  "id": "90274",
  "citation": " Tiberius. \"Perfect Cocktail: experience with Piracetam, 4-Fluoroamphetamine & Methylone (ID 90274)\". Erowid.org. Jan 30, 2012. erowid.org/exp/90274",
  "substance": "Piracetam, 4-Fluoroamphetamine & Methylone",
  "views": "7697"
 }
}
