{
 "id": 13497,
 "title": "Argument Against an Opiate",
 "date": {
  "submission": "2013-12-25T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Dave",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:30",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>Arguments Against Mitragyna speciosa as having properties with an opioid-binding mechanism of action.\rMitragyna speciosa Standardized Extract 10% mitragynine: 350mg (threshold)",
  "0.00hrs: Using my tongue, I wet the tip of my index finger and tapped the surface of the Mitragyna speciosa Standardized Extract 10% mitragynine powder. The small amount that I lifted away from the pile using my finger was minute, around 25 to 30mg I'd say.",
  "0.01hrs: At the instant I tapped the powder to my tongue, I felt the initial small peak in the dose response curve and felt it for nearly a minute. Visual disturbances were present.",
  "0.17hrs: After 10 minutes I didn't feel very much. A slight dissociation from reality and the self along with continued slight visual disturbances.",
  "0.25hrs: At 15 minutes I felt no different and repeated the same dosage as before. Nothing was experienced; only the slightly bitter tea-like taste lingering in my mouth, and the epithelial tissue of the mouth feeling somewhat numbed.",
  "0.50hrs: After 30 minutes post 0.00hrs., I decided to take a full recommended dose of around 300mg of the extract, which is slightly less than half a teaspoon full of the powder. I heated some water and made a tea out of it. It tasted simply like a slightly bitter tea so I added some sugar and it was fine. Nothing seemed to be lipid soluble as everything dissolved in the water, less some of the black particulate matter which simply fell to the bottom.",
  "0.75hrs: After 15 more minutes (45 total) an above normal euphoric but slightly anxious rush came on and consumed the senses. My vision was distorted in an interesting and soothing way, with objects colorful and sharply contrasted, being able to see very clearly. I could not think very clearly though as my senses and particularly my vision, seemed to rush forward with time, with objects seemingly rushing towards me and then even past my peripheral vision. As mentioned, this rushing sensation also very much distorted time, and minutes would pass by very very quickly. This effect lasted for only about 15 minutes.",
  "1.00hrs: Before I knew it, over 30 minutes had passed since I drank the tea.  At this point there was a marked slowing of time and the reverse effect occurred with my sense of time as well as all my other senses. It was very soothing and calming and the visual disturbances had stopped. Up to this point in time, I can confirm that the experience reports I had read earlier, in which the participants had similar effects, are as truthful as can be.",
  "Results: From 1.25hrs  2.00hrs. The feeble narcotic-like effect stayed the same and did not strengthen as time passed. I only felt a slight dissociation from my own self and there was no relief in the neuropathy in my left arm. This would not be true if I took a dose of an opiate that would give the same calming effect. I.E. The opiate would give me pain relief. Therefore, if it does bind to the opioid receptors as hypothesized, it must bind more to the delta- and kappa- receptors much more so than the mu- receptors, if in fact the plant has properties which bind to any of them at all. Furthermore, if this low to mild dose can cause these distortions in time-space and the dissociation of the self, combined with the general experience resulting from ingestion, I would hypothesize that there are at least more prominent mechanisms of action other than that which involves the opioid receptors, if not an entirely different mechanism of action to begin with. It just does not feel like a pure opiate, a semi-synthetic, or even a purely synthetic opioid.  Those of you experienced in psychopharmacology know that it usually requires moderate to high doses of morphine or another strong opiate to cause a dissociation effect and distort the vision and senses, at least to the extent that occurred from this plant at these reported doses.",
  "Conclusion: As a gram of this Standardized Extract only costs around 5 dollars, and if one does not have access to proper medication management, it would be a good investment to keep away anxiety for around 4 hrs and not cause the drowsy side effects one would get from the benzodiazepines. Because the effects experienced here were the same as other experience reports, I imagine that at higher doses it would do unto me as it has already been experienced and reported by others. I would not use this substance for the treatment of Panic Disorder or for relieving pain. However, as the plant is known to contain numerous alkaloids, many of which have active properties, it is very likely that if each of these were isolated and studied separately that a medication for use in the treatment of an anxiety-related disorder would result.</p>"
 ],
 "erowid": {
  "id": "90348",
  "citation": " Dave. \"Argument Against an Opiate: experience with Kratom (ID 90348)\". Erowid.org. Dec 25, 2013. erowid.org/exp/90348",
  "substance": "Kratom",
  "views": "1480"
 }
}
