{
 "id": 135,
 "title": "On the Verge",
 "date": {
  "submission": "2013-08-13T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "frontbluntt",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "AL-LAD",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "I took the AL-LAD laid on blotter with the name on one side and chemical structure on the other a couple days ago.",
  "I decided to start pretty HR so I took only a little more than half a blotter, I'd say around 90-95 mcg.",
  "8:44- Swallowed it without letting sit at all",
  "9:24- First alerts, things started to look different, breathing, body high felt",
  "9:49- Felt a very slight queeziness (I am extremely prone to nausea on psychs so this is as good as it gets for me)",
  "10:00- Commencement of the giggles",
  "Not much visual activity at this dose but I felt I was right on the brink of a good, full-blown trip.",
  "Really fantastic body high and euphoria.",
  "Could feel the peak start to come down around 3:00 or 3:30",
  "Knocked myself out with benzos at about 4:00 because I had shit to do the next day, actually took a pretty hefty dose before I passed out.",
  "Next day I felt pretty much the same way I do the day after acid, as one member once put it, I felt as though 'I was missing a chromosome' haha. Nothing some wine and a good dinner didn't fix.",
  "One really weird thing that happened was that the day after I tripped, I took a nap at around 3:00 or 4:00 pm for about an hour and when I woke up if I focused in on stuff I would start tripping. The weird thing is that the night when I actually tripped I had almost no visual activity but the next day after waking up from a short nap I was seeing little red dots on the bed sheet turn into insects and walk around and other crazy stuff. I'm not sure what could have caused this, it seemed closer to the type of visuals you get from delirium/psychosis than a psychedelic. If anyone has any thoughts on this phenomenon I'd love to hear it.",
  "All in all I have to say it was very, very similar to acid. The only difference that stood out to me was the duration, but then again I took a tiny dose.",
  "I also felt like I might have had more of a body high, but if I did it was in a good way because my body felt great. However, this could just be part of the trip and not necessarily due to the drug itself. Hard to say until I conduct more trials.",
  "Next up once my tolerance is gone is LSZ at the same dose, and then I'll be exploring higher doses of each.",
  "I spent this trip with my friend who was on LSZ at the time and he seemed to experience more or less the exact same trip I did, but I won't make any analysis of that chem until I try it myself sometime next week.",
  "I pray to whoever is up there that even if these chems are made illegal, they replace the NBOMEs and DOx's as the active ingredient in counterfeit acid because in that case I honestly wouldn't mind, and might not even notice."
 ],
 "erowid": {
  "id": "101018",
  "citation": " frontbluntt. \"On the Verge: experience with AL-LAD (ID 101018)\". Erowid.org. Aug 13, 2013. erowid.org/exp/101018",
  "substance": "AL-LAD",
  "views": "1795"
 }
}
