{
 "id": 13508,
 "title": "Floating on Serene and Tranquil Waters",
 "date": {
  "submission": "2013-12-17T08:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tranquil",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Hydrocodone",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Pharms - Oxycodone",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Up until about two years ago I had never abused drugs. I smoked cannabis with a disappointment at the time. I had been 'high' but I had never experienced true euphoria. I didn't know what euphoria was. At the same time I was introduced to someone whom I now consider one of my closest friends. They introduced me to something to which I now have a 'love-hate' relationship with. They introduced me to Opiates. ",
  "I was on a business delivery with my friend and had a severe headache. She gave me a pill and said it was 10mg of hydrocodone. I had heard of them before and I didn't know what to expect when I took it and because of that I waited until I got home to take it. As soon as I got home I took the pill and waited for the headache to go away, not really expecting much else to happen.",
  "About twenty minutes after taking the pill and lying on the couch I realized that my headache was lifting but didn't feel much else. Feeling much better I decided to get my iPod and listen to some music while I relaxed. As I laid there relaxing in my own world I suddenly felt a calm, warm, and serene wave come over me. A warmness and calm like no other. Nothing like I have ever felt in my life. I understood life and accepted myself. I can't explain how I felt. ",
  "It was about 45 minutes of taking the pill and I felt wonderful. I felt calm, happy, and warm. I then realized what I had been wanting and what I had been missing this whole time. I realized I was experiencing what everyone wants and longs for. I was experiencing euphoria. ",
  "I laid there for the next 4 hours enjoying the feeling. The feeling was like no other. I can't explain the wonders and the warmth I experienced. The feeling was like of something that's better saved for the Gods. I felt like a God.",
  "The feeling started wearing off and I fell asleep. I had the best sleep of my life. I had the feeling that I longed for. I woke up feeling peaceful and immediately craved more. I wanted to feel like a that again. I wanted the peace, the joy, I wanted the high. For me, that was euphoria. I wanted euphoria again. I was able to find ten 5/500mg oxycodone pills shortly after that.",
  "I started using opiates recreationally after that. I was in a tough time in my life and the pills made me numb. I was numb emotionally and physically. I didn't have a care in the world. Nothing mattered. I was perfect. I was euphoric. I used them about 3  4 times a week after that. I chased the feeling that I experienced the first time. A feeling never to be seen again. I missed her. I missed true euphoria.",
  "I used it more and more often after that. It's been two years now and I take about 20mg  25mg of oxycodone and/or hydrocodone a day. I don't see as because I have to, rather I want to. Opiates are not safe but they are not dangerous. Life isn't easy but they make it rather worth it. I enjoy taking opiates. Every time I do I experience the true euphoria that comes with them. ",
  "I smoke cannabis and do use other things recreationally from time to time but they are no replacement for opiates. Nothing compares to them. I love them. I do feel as if I need to slow down but I don't want to. There is nothing like the feeling they give: the warmth, the peace, the tranquility. ",
  "The only thing that's keeping me from going insane in this life is opiates. They are my friend. They have never let me down where everyone else seems to be doing well at.",
  "When stress is consuming me and life gets hard opiates help me. When the going gets tough and I take something I feel better. I begin to care less. I begin to feel wonderful and I begin to float on the serene and tranquil waters in the ever flowing and everlasting river of Life."
 ],
 "erowid": {
  "id": "90387",
  "citation": " Tranquil. \"Floating on Serene and Tranquil Waters: experience with Hydrocodone & Oxycodone (ID 90387)\". Erowid.org. Dec 17, 2013. erowid.org/exp/90387",
  "substance": "Hydrocodone & Oxycodone",
  "views": "974"
 }
}
