{
 "id": 13516,
 "title": "Nothing More Than a Novelty",
 "date": {
  "submission": "2011-07-01T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Genesis",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:15",
   "amount": {
    "unit": "mg",
    "quantity": "50"
   },
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0:45",
   "amount": {
    "unit": "line",
    "quantity": "1"
   },
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "line",
    "quantity": "1"
   },
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "4:00",
   "administration": "smoked",
   "substance": "Cannabis"
  }
 ],
 "report": [
  "I recently had the opportunity to try 4-Methylethcathinone at an anime convention, but I had very little cash, so I only got to sample a small amount.  Then yesterday a friend of mine let me know that the shipment of 4-MEC he was expecting had finally arrived. A small history of my past drug experiences include LSD, MDMA, MDAI, MDA, 4-MMC, 2C-I, 2C-E, Psilocybin mushrooms, DMT, 5-Meo-AMT, Cocaine and I am also a daily cannabis smoker.",
  "Getting back to the report, I went halves on a gram with a buddy of mine. What my buddy had received from online was quite a nice product, consisting of beautiful rice shards and nice crystalline chunks. I was surprised by the great quality because what I had tried at the anime convention was very clumpy, like some of the lower grade Mephedrone Ive seen around my area.",
  "+0:00  I weighed out 50mg to start out with. When I tried it at the anime con I had done 80mg of the clumpy impure stuff and I had been fairly high. So I thought Id begin my night with a smaller dose, since this was the crystalline stuff after all. I snorted the half point and to my surprise the burn was nothing near as bad as with Mephedrone.",
  "+0:05  Definitely already feeling it kick in. Having tried this chemical before, I already knew 4-MEC was nothing fantastic or extremely euphoric but if I were purchasing this substance without prior knowledge of its effects, for say an EDM show, Id most likely be disappointed. Its simply a novel cathinone, nothing to rely on to enhance my night.",
  "+0:15  Feeling full effects of my 50mg line, I decide to take another half point bump to get things going. Once again, nothing extraordinary or unique, feels like mephedrone without the intense euphoric edge. Talking is easier and I can barely sit still. Increase in appreciation for music but nothing too incredible is noted.",
  "+0:45  Times flying by and I can barely keep focused on one thing or another. I weighed out another line, thought Id do about 70-80mg this time around. Snorted her up, this time is burns a little more. Probably just wearing on my nasal tissue from the previous bumps.",
  "+1:30  Pretty energized, thoughts are kind of scattered but watching a couple episodes of random TV shows proves interesting and easy to follow. Usually on mephedrone or when Im rolling I can never focus on TV or movies, but with 4-MEC this wasnt the case.",
  "+2:00  Weighed out and snorted another 70-80mg line, not really feeling an elevation from each bump anymore, but rather I feel like Im just extending my current level. Typing is easy and thoughts are flowing pretty nicely considering how antsy I feel physically.",
  "+3:00  Coming down very nicely in comparison with mephedrone. I always get such a horrible craving for more when my drone runs dry but I even have some of this 4-MEC left over which Im going to save for tomorrow or the next day. Sleeping seems like a great possibility rather than a daunting task that will never get accomplished which I feel with a lot of stimulants.",
  "+4:00 - I drank some calming tea and smoked some of the resin in my bowl, after which I proceeded to lay down and fall asleep with no major issues. A little tossing and turning at first but nothing like drone.",
  "Overall, 4-MEC is nothing more than a novel research chemical which has a few perks of its own but they are overshadowed by its lack of euphoric effects. One of my favorite things about this substance is the lack of any serious cravings afterwards. I always just feel so dirty and depressed when the fiending after mephedrone hits but I didnt experience anything close to that with this stuff. Today I feel fine, no hangover and Im not completely drained either. The bottom line is its nowhere near going out of one's way to acquire it."
 ],
 "erowid": {
  "id": "90453",
  "citation": " Genesis. \"Nothing More Than a Novelty: experience with 4-Methylethcathinone (ID 90453)\". Erowid.org. Jul 1, 2011. erowid.org/exp/90453",
  "substance": "4-Methylethcathinone",
  "views": "18210"
 }
}
