{
 "id": 13529,
 "title": "Here We Go Once More",
 "date": {
  "submission": "2011-08-09T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "thercking1122",
  "gender": "Male",
  "weight": "215 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "4-Fluoroamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:15",
   "amount": "70 mg",
   "administration": "insufflated",
   "substance": "4-Fluoroamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "4-Fluoroamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "4:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "4-Fluoroamphetamine",
   "form": "(powder / crystals)"
  },
  {
   "time": "0:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "I just got 1 gram in the mail today I am currently on this substance as I type this.",
  "I smoked / vaporized 50mg to start off I have never done this substance",
  "Got mild rush and slight speed and euphoria not very intense",
  "About 15 later I decided to snort 70mg the pain was excruciating ten time as  bad as 2c-I or 2c-e",
  "The pain lasted about 5 mins but the drip was horrible I almost puke I actually did in the back of my mouth and managed to swallow it as to not waist the chem. I will never snort this again",
  "Once I could stand not to puke I seeped outside for a cig the euphoria is slowly creeping up my legs nothing powerful definitely not like mdma. I sat down and had one more cig and  started typing this on my phone I just lit another cig and just noticed the effects creeping up (3rd cig) the effects are stimulation and mild euphoria I noticed my foot was pressed into the brick steps and I could not feel the pain until I stood but it wasn't painful I guess the euphoria is a lil body numbing. I will continue this once the effects do more as of the moment I feel compelled to do some cleaning definitely feel the amphetamines of this chem.",
  "No pupil dilation",
  "Just turned on some techno to get in my vibe",
  "Euphoria in my face",
  "It's been about twenty or thirty min sents snorting it I am starting to sweat a little and slightly more euphoria nothing extraordinary really would probably be a nice roll if I  were to just ingest 200+mg I don't see anything special about this chem other than it does seem to help with my ADD not much  tho possible placebo effect.",
  "I decide to eat 100mg to see of it will most my experience I am weighing it now",
  "30min sents ingestion starting to feel slight effects not quite positive however I am chewing my tounge quite a bit which also happens to me on mdma",
  "Ok I am definitely 'rolling' if that's wat u would call this I think this chem would go great with others just to give them substantial boosts is seritonin levels but as for by itself its fun at high doses but because of that this chem is too expensive for my taste I believe I will stick to my phenethylamines for it takes a much lower dosage to achevive the sents of nirvana I strive for",
  "But as for this drug the effects I'm feeling are mild euphoria, elevated body temperature, jaw tension, a sents of well being, being quite social, and sweating",
  "I am also enjoying moving and dancing music is very enjoyable and sound seem to have an extra sensitivity to them (not sure if that's the right word but they sound absolutly vivid), my hand eye cordination is slightly off (I went to scratch my nose and hit my cheek twice in a row ha ha but 3+ times I got it everytime), and I'm slightly off balance.",
  "I feel like I'm coming down now after about 4 hours sents I first smoked a little its only been 2 hours sents I ate it and I'm considering taking another 150-200mg orally",
  "I feel like I could go to sleep if I tryed I'm about to measure out another dose of 200mg ",
  "Feeling slightly hungry I smell food but don't really feel like eating although I could no problem",
  "I noticed my pupils have dilated right before I ate the next dose I'm feeling very nice now I can't wait for the rest to kick in this is going to be very fun ",
  "Ah yes this is much much better now this is as close to mdma as this stuff is gonna get me I will not take more I've already done enough",
  "I'm feeling mild to strong euphoria it comes in waves I'm still only slightly dizzy still everything feels so nice on my skin and the warmth is unbelievablly lovely still clenching my jaw but its much less noticeable. My mouth is dry but its not too bad I really wish I had someone to talk to right now. Chating on Facebook isn't enough I want someone here infringe of me but I'm getting too far into this to continue anymore I keep forgetin to continue my story between all my other activities I am persuing but this is a nice chem if taken in high doses I don't believe I will continue buying more tho thank you all for reading my experience but I have to go enjoy my ride"
 ],
 "erowid": {
  "id": "90552",
  "citation": " thercking1122. \"Here We Go Once More: experience with 4-Fluoroamphetamine (ID 90552)\". Erowid.org. Aug 9, 2011. erowid.org/exp/90552",
  "substance": "4-Fluoroamphetamine",
  "views": "8161"
 }
}
