{
 "id": 13525,
 "title": "It Did Wake Me Up",
 "date": {
  "submission": "2011-08-30T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "honest man",
  "gender": "Male",
  "weight": 65
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Products - Bath Salts, Plant Food, etc",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "[Erowid Note: 'Bath salts' and similar products generally do not list ingredients or dosage on their packaging. Analysis has revealed that ingredients in a single product of this type may vary over time.] ",
  "I've met the bath salts recently, about 1 month ago, and did it about 4 times *including just now*. My anecdote is not an extensive investigation, rather than a personal overview on the substance. I've try cocaine, and that's what I was looking for when I stepped into these bath salts *as the majority, I guess* I smoke weed almost daily, and sometimes want something with a different effect, so it's not always the same kind of energy.",
  "First time I've tried the bath salts I was at a party, and it did wake me up, I was sleepy from my day smoking and doing a bunch of stuff and wanted something that awake me a little bit. The feeling in the nose was fine, it didn't burned me that much, and after 2' of inhaling a bit I was much more awake. I started to feel the effect of the substance, and I already could tell that it wasn't as cocaine. My heart beat was the same or even faster than with cocaine *maybe not as louder but faster*, but the complex effect that cocaine produces in a psychological and philosophical level, what I could relate to something interesting and deep, with bath salts seems more flat and superficial.  That occasion I had a bit more and that was it, didn't seemed to worth taking more since it was proved that, even it had some notorious effects, they weren't like cocaine good side of the effects.",
  "Next time I've had I was with a girl I liked, and couldn't get to have proper sex, the sexual impulse was very much reduced, and there was no cocaine romantic feeling, just being more awake. I slept pretty bad, but could have a good day after that evening.",
  "Third time I took it because I was bored and needed some action. It was good for putting down some thoughts and planning, but nothing beyond.",
  "Fourth and last time was today. I've had a very active and exhausting week, I was smoking a lot and felt I needed some cocaine. I didn't look for it, so finally around 1am I passed by a smoke shop. I bought some bath salt and took 'em right away. Right away it took me off all the tiredness and sad that I was feeling, also for some other reasons. Even though it was flat, it was effective, so I've gone back home to do some writing and creative evening stuff. I could notice the powerful addictive effect it had. Even it had a worse effect compared to cocaine, it seemed to be as or even more addictive than cocaine, making me want to have some more every a few minutes. My heart beat and my breathing were abnormal, so finally I've decide to throw it away, since I knew I'd like to had some more and it would only increase my heart rhythm and feeling of unhealthiness, meanwhile I also google bath salts and not very promising things were said.",
  "Of course this was my experience,  but still I think I could give some observations",
  "- it can be effective if there is really a need to wake up",
  "- in the other hand, is more addictive and unhealthy than it should be, for the given symptoms.",
  "- it's ok to do it once, in a cool moment at time, but",
  "- it's not something to count on, as a plus for party.",
  "- i don't feel it's more harmless than cocaine, it's just more legal",
  "Well, that's pretty much it. I hope you have a good perspective of the object in question, I've tried to give you as a wide point of view as I could. thanks"
 ],
 "erowid": {
  "id": "90517",
  "citation": " honest man. \"It Did Wake Me Up: experience with Products - Bath Salts, Plant Food, etc. (ID 90517)\". Erowid.org. Aug 30, 2011. erowid.org/exp/90517",
  "substance": "Products - Bath Salts, Plant Food, etc.",
  "views": "5218"
 }
}
