{
 "id": 13523,
 "title": "My New Drug of Choice",
 "date": {
  "submission": "2011-10-02T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Happy_Camper",
  "gender": "Male",
  "weight": "184 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1800 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  },
  {
   "time": "1:45",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I'll be writing a short report on my findings with Gabapentin.",
  "(past)Background:",
  "I'm not a heavy drug user. I don't regularly partake in any recreational drugs. Just the occasional weekend trip. In the past I've experimented with Pot on a few occasions, opiates, alcohol, ambien. I take Butalbital for migraine headaches when needed.",
  "On with the trip!",
  "A few weeks back I was a tad depressed, and needed to get out of my mind for a few hours. I knew of barbiturates, and had taken 4-5 times the recommended dose of my headache pills on a few occasions. Though, now I know it was mainly the codeine I was feeling.",
  "After throughly searching our cabinet, I found 5 full bottles of gabapentin. A close family member receives this for nerve pain, but won't take anything expired (go figure!).",
  "Thrilled, I messaged a good friend who's quite in-the-know and has much experienced with pharms. She informed me that this could be used as a recreational, and I would need about 1.2-3 grams. Along with her research, I read quite a few reviews and decided that tonight was appropriate, and started to set the scene.",
  "After running to the store to pick up some of my favorite ginger-ale and flamin' hot cheetos, I fasted for about 5 hours. At about 9:00 pm after the house had settled down and most of the family was asleep I quietly poured out 5 of the 600 mg pills. My mood at this time was very excited, I was in anticipation of the high, and ready for an escape.",
  "(Mind you the times are a guess)",
  "(11:00 PM)",
  "Take 3 of the pills (1.8 grams), with a can of ginger-ale.",
  "(12:30 AM)",
  "First changes in my body that I can feel.",
  "Slightly wobbly walking to the bathroom, and mild euphoria. Similar to a few shots, without the spins.",
  "(12:45 AM)",
  "I want to intensify the high, so I take the other 2 bringing me to the full 3 grams. Taken with 2 more cans of ginger-ale.",
  "(1:15 AM)",
  "All of the sudden it hits me like a brick wall. I feel warm and fuzzy, and cozy under my blanket. I feel like I'm slurring my speech, but I know I'm not. Short conversation with my father about camping this spring. Something inside of me screams for socialization. Decide to call my friend max.",
  "(1:30 AM)",
  "After a short bout of carpet sprawling, I find the phone and dial. Everything is okay, and nothing needs to be hidden. I speak of everything that comes to mind, and he's happy to hear it. EXTREMELY euphoric. The strongest euphoria I've ever felt. I see mild hallucinations. What I most vividly remember is a band I saw that stretched the distances of the ones I love. Hard to explain.",
  "(1:45 AM)",
  "I realize I'm being really loud, and try to quiet down. Not happening. Still feeling great, I log onto MSN while on the phone. My typing skills are impaired. People know I'm high, which isn't like me.. So I log off. Say goodbye to max. Back to the living room!",
  "(2:15 AM)",
  "Sitting on my couch, thinking about the world. Everything feels nice to touch. Great body high. I eat my cheetos and snuggle up to a weeds marathon on television. Still being really loud, singing and such. (mind you, the room I'm in has three sleeping people in it) I fade in and out of sleep, with super-awesome-colorful lucid dreams.",
  "(3:15 AM)",
  "I decide it's time to lay back for sleep, as I have school in the morning.",
  "FAST FORWARD!!",
  "I get a text at about 7:00 am, informing me my classes are canceled. I go back to sleep.",
  "(10:00 AM)",
  "Wake up, refreshed and feeling great! Happy! Still feeling slightly wobbly when I walk, and still very chatty. About an hour later this slowly tapered off.",
  "So, conclusion.",
  "This felt similar to an opiate, without the comedown.",
  "Wonderful, LONG high.",
  "After this experience I've taken gabapentin about 7 more times with about the same turn-out. 3 grams seems to be peak, with no other changes up to 5. Under about 2 grams I can function 100% normally and find that it just brings up my mood.",
  "I have plenty of it, and a steady supply. I plan to take this as a recreational as long as I have it.",
  "A+"
 ],
 "erowid": {
  "id": "90503",
  "citation": " Happy_Camper. \"My New Drug of Choice: experience with Gabapentin (ID 90503)\". Erowid.org. Oct 2, 2011. erowid.org/exp/90503",
  "substance": "Gabapentin",
  "views": "17599"
 }
}
