{
 "title": "A Glimpse of Understanding",
 "author": "Gregory",
 "citation": " Gregory. \"A Glimpse of Understanding: experience with Cacti (ID 13528)\". Erowid.org. May 2, 2002. erowid.org/exp/13528",
 "substance": "Cacti",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  " ",
  "oral",
  "Cacti",
  "(plant material)"
 ],
 "report": "<p>Three good friends and I had been wanting to do mescaline for a while, so we planned a trip to death valley and all bought two feet of San Pedro Cactus per person. We camped in a place called Hole in the Wall, it pretty isolated not many people go there and there is vast land that is extremely interesting to explore. It is a valley surrounded by giant walls which have many holes in them, infact we decided to name the place Valley of the Ghouls although it is not at all scary. The first night we arrived set up camp cleared our minds and became as much as possible at peace with ourselves to be in purity for the eating of the San Pedro. The next morning we got up fairly early and began the preperation of the cactus using the Shaman method, that of cutting the spines out, then getting rid of the core, peeling the wax like layer of skin off and get the dark green pieces which contain most of the mescaline. Preparation took approximently two hours. Then we all sat around camp eating the cactus which has an extremly bitter disgusting taste for which I used grapefruite just to counter it. After about a half an hour two of my friends threw up. One who could not longer eat. And the other two continued to eat as much as possible. I was the only one who experienced a full blown trip, but everyone experienced something. Anyways now to the experience. I began to feel an extremly deep connection with the earth it gave me an enourmous amount of strength, but overpowered me at the same time. The connection was absolutely fascinating. I could look at anything for hours, everything I looked at morphed itself into different images, I saw many spider like patterns (I later looked up the characteristics of the spider from a shamanism and felt that it was my power animal) and neon green webs spun around me. The clouds also swirled in and out moving very quickly, it was a quite interesting. It was very controllable for me, I could stop the visuals if they became to intense for me. I got scared only a couple of times by giant spiders I saw in the wall while I was hiking. I was lucky to have three other people to guide me through the hikes for I would not have been able to do this myself. What I saw was a glimpse of something so complex that I was incapable to comprehend. I learned how important the earth is and how we must keep it alive, and help it. I felt that the center of the earth was a heart beat and the oceans are its veins. At one time I was in my tent and saw skeletons dancing on the walls, they were very happy, like as if they were there to congratulate me for helping and trying to understand. It is a very worthwile drug and an extremely pleasant experience. I was very glad to have mescaline as my first phycdelic drug. I would estimate that the trip lasted approximentaly seven hours. And can assume I ate twelve inches of cactus although I am not sure for we put six feet of cactus in a pot and ate as much as we could.</p>",
 "year": "2002",
 "id": "13528",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-02T07:00:00.000Z",
 "views": "12937",
 "dose": {}
}
