{
 "id": 13531,
 "title": "A Day With bk-MDMA",
 "date": {
  "submission": "2013-12-25T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "HiLights",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "1:10",
   "amount": "150 mg",
   "administration": "insufflated",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "3:20",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "capsule"
  },
  {
   "time": "8:30",
   "amount": "75 mg",
   "administration": "insufflated",
   "substance": "Methylone",
   "form": "capsule"
  },
  {
   "time": "8:30",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "",
   "specific": "Hard"
  },
  {
   "time": "13:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "capsule"
  },
  {
   "time": "13:00",
   "amount": "37.5 mg",
   "administration": "insufflated",
   "substance": "Methylone",
   "form": "powder/crystals"
  },
  {
   "time": "17:00",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "Methylone",
   "form": "capsule"
  }
 ],
 "report": [
  "[Erowid Note: 862.5 mgs of methylone is considered an extremely high dose, see Methylone Dose Chart]",
  "Medications: None",
  "Drug experience: Alcohol, nicotine, Cocaine, Cannibus, MDMA, Ketamine, opiates, mushrooms, salvia, amphetamines, Adderall, and others I'm sure.",
  "Today: ~3/4 gram Methylone (first attempt with this chemical) Couldn't sleep and was texted by a friend to come over. I ate breakfast and then jogged over. He presented me with this gift and we were on our way! I had been reading about BK-MDMA for a week or so and was excited as MDMA is my favorite narcotic and the gear in this town is hard to come by.",
  "T0:00 (~6:00am). Two of my friends, P and G, were sitting in the living room as I arrived and they had already ingested roughly 150mg and were feeling good. We scaled out a 150mg dose and I did a line of it. The straw was a little too long for my tastes but oh well. Burn wasn't too bad, but drips hung on for a few.",
  "T0:20. Got a small boost of energy and felt tingly. Lights seem a little more vibrant. Hair on neck stands on end.",
  "T1:10. We decide to do another line, mine being another 150mg dose (300mg at this point), and theirs being 75mg, but used a $100 bill of mine, classy.",
  "T1:50. I feel great. Full body high, and I just want to do something. Really tingly, and feel like I've been doing coke, with a light undertone of MDMA.",
  "T3:20. Effects are making me tweak slightly and everything feels good to the touch. Feeling very chatty and giddy. They do another 75mg line and I decide to do a 150mg cap.",
  "T3:40. Peak hits a new level. Getting waves throughout my body. MDMA euphoric effects increase and I feel great. Colors and music are fantastic and I can't stop smiling.",
  "T7:30. We decide to leave the house and visit a local hangout and run into some friends. We get to talking about this experience and end up selling some.",
  "T7:55. Energy level dropping. Effects coming in smaller waves. Still feel great.",
  "T8:30. I go out to a friend's car and we both do a 75mg line. I look at her and see that she is gorgeous and realise that I am extremely turned on. I don't know her too well though, and decide to not try anything with her. Chock that up to the drug I guess. Then I go out to eat with a friend. I can definitely function on this, with no one knowing if it wasn't for my plate-sized pupils. While eating, my friend thinks it would make my experience better to give me a shot of Patron. I don't ever feel the effects though.",
  "T11:00. I meet up with some friends at a local bookstore and we all hang out talk for a while, still feeling the effects somewhat. One of the girls in the group comes and sits in my lap. This sends that horny factor to a new level as she has an amazing body. We kiss some, which feels great and then part ways. Still feel very good and sociable. I text up some girls (S, M, C) and convince them to come partake.",
  "T13:00. The girls and I go back to P's house for some rolling enjoyment. We all watch tv and talk while P weighs out our doses. They are inexperienced in anything but pot, so they are excited. They are also sober, except S, whom has been smoking weed. The four of us take a 150mg cap each and then shortly after I split a 75mg line with C.",
  "T13:40. Girls are feeling great and loving it, and I am being hit by powerful waves. P does a 150mg bump to keep up and then starts playing guitar and singing. The music sounds amazing and we all are enjoying the feeling.",
  "T15:00. We are peaking some and G comes over to see C. They go outside and the rest of us are watching Alice in Wonderland and talking about everything. Time is moving creepingly slow for all of us.",
  "T17:00. S and M start coming down some so the three of us take a 150mg cap. S is sitting very close to me so we hold hands and rub each others skin. We feel good and I give her a back and shoulder massage while we all keep talking about randomness.",
  "T18:00. They are getting hit by waves and keep commenting that this is the best experience of their lives. I am rolling harder than I ever have on MDMA. My eyes are rolling around and I feel amazing. I rub S's skin and get tingles. I feel the need to bite so she tells me to bite her and she gets really giggly. We kiss for a bit, which feels great, and continue to rub all over each other.",
  "T18:30. S and I are feeling it more than the others. I am definitely having the best experience out of all of them though. She comments that I am pretty shakey. I feel large amounts of waves of pleasure throughout my body. I can't help but just lay there as I feel amazing.",
  "T20:00 (4am). We all are coming down softly and feel good still. No matter how much water we drink, we can't relieve the cotten mouth. The girls thank me for the great time and then we all go home.",
  "----------",
  "Conclusion",
  "----------",
  "Definitely a fun drug, but high doses must be ingested for a feeling like it's big brother. This will be a frequent of the future despite the price. Also, functionality is very doable while on this, as my mind wasn't clouded, and actually functions at a higher pace. I found myself speaking without a filter. Positivity and love were promoted and so are more primal urges. There wasn't a hang over the next day, easy to continue with existance."
 ],
 "erowid": {
  "id": "90570",
  "citation": " HiLights. \"A Day With bk-MDMA: experience with Methylone (ID 90570)\". Erowid.org. Dec 25, 2013. erowid.org/exp/90570",
  "substance": "Methylone",
  "views": "300"
 }
}
