{
 "id": 13549,
 "title": "That Wasn't What It Was Supposed to Be",
 "date": {
  "submission": "2011-07-25T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sakithin",
  "weight": 45
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "Unknown",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Before beginning, I'd like to clarify that this report is intended for the family vault, as I was not actually taking the substance in question, but trying to keep the people taking them out of danger/trouble as much as I possibly could.",
  "The substance in question was taken by my step-daughter, and some of her friends. The deal that I have with my step-daughter is that if she's planning on using drugs and lets me know about it (so I can do some basic harm reduction for her) then I'll accept the information in confidence, and give her any information, equipment, etc. that she might need to make the experience as safe and enjoyable as possible. I won't help her obtain drugs, hide her use from her parents, etc., and any use that I find out about by means other than her telling me, gets passed along to her parents (being a younger step-parent, I find it much more comfortable and appropriate to try and relate more as a much older sibling than as a parent; the other end of the deal is that she fill a similar harm reduction role for her sister--my daughter--when the time comes, as I'll be focused on the incompatible task of use reduction).",
  "Anyhow, a week before this experience, my step-daughter (who I'll call S) started asking me which vitamins and supplements are currently recommended for minimizing MDMA hangovers, and reducing any long-term effects. I reminder her of our deal, and asked her if she had any upcoming plans to use any MDMA. She told me that a friend was going to get some, which she was going to try with some friends at a house party in a week's time. I told her that I'd pick up some 5-HTP for her, and immediately ordered a testing kit with a rush on delivery so that it would arrive before her plans. I also advised her on the value of consuming antioxidant vitamins, the risks of hyperthermia and dehydration, and also on the risk of hyponatremia from overcompensating for the dehydration risk. I also encouraged her to take a good look at the MDMA vault, and ecstasydata so that she could get an idea of what adulterants and substitutes are common, and just how common they are.",
  "A week later, when it was time for her to prepare for her experience, the testing kit had not yet arrived. She was also having problems with her supplier, so I advised her not to try too hard to get her hands on something, as we were unlikely to be able to test it, and that there would always be other opportunities.",
  "Now since there's only so much advice that a teenager can actually take, the recommendation to delay the experience fell upon deaf ears. The plans had been adjusted to take place in a large public park (it was early spring, and barely above freezing, so this was intended to make it easier to manage the risk of overheating), and I approved of that setting.",
  "Owing to the inability to test the substance in question (sadly, it was all capsules full of white powder, and wouldn't admit pill identification), I also sat down with S, and reviewed ecstasydata with her, as well as showing her the PMA vault (since it's a particularly dangerous substitute) to reinforce the idea that she really should wait, but if she doesn't wait, she should absolutely not redose on any substance of unknown purity.",
  "She thanked me for the advice, and my concern, and for the 5-HTP, and headed out to the park to meet her friends and dose. I left my evening relatively clear, in case something were to happen. A few hours later, I was really glad to have done so. My phone was ringing, and the caller ID said it was S.",
  "When I answered the phone, S's boyfriend (B) was on the other end, telling me that S appeared to be in some sort of crisis. She was crying, and unable or unwilling to speak. Immediately concerned with the potential impact of panic with stimulants, I told B to ask S if she'd like him to hold her hand. S agreed. I asked B to try and get a feel for S's body temperature and pulse from her hand, and he reported that there was nothing terribly alarming with either of these.",
  "Being reasonably assured that a life-threatening overdose was not happening, I began to focus on her emotional state. Since the drug in question was probably a stimulant, I was concerned that S may have been panicking, and setting up a physiological feedback loop. In order to break this loop, I told B to give her one of her 5-HTP pills to help settle her down (my unstated expectation was that it would serve as a placebo, break the anxiety feedback loop, and allow some calming to happen, both emotionally and metabolically).",
  "Upon giving this instruction however, I was informed that S was unable to take the pill into her mouth, so I instructed B to crush one of the pills into her orange juice so that she could take it by sipping. He did this, she drank, and was able to regain enough control in her mouth to complain that her muscles were all tight and pulling against each other, and that she hurt, and it was hard to move. I told her that this would eventually pass, that she appeared to be through the worst of it, that she didn't appear to be in any immediate danger, and that she should consider walking around some with her friends, as soon as she felt able to do so, in order to try and dissipate some of the extra stimulation from the drug.",
  "I also asked if there was any variation in the doses taken by each of the friends, and if any of the drug had been saved for analysis. I was told that everyone had taken a single capsule, and that there was none left over. I asked if anyone else was experiencing any similar effects, and everyone else was reported to be fine. I then asked if anyone was as light as S, or how much more everyone else weighed. I got the answer that S was the lightest of the group at close to 100lbs, and that the heaviest of the group weighed around 200lbs, and was reported to have a decent buzz. Based on this, I theorized that the group had gotten a batch of a highly dose-sensitive stimulant as a substitute or adulterant, with some entactogenic effects (as some of the teens claiming more experience in the area claimed that it felt like real MDMA). My best guess is guess is that the substance in question was actually PMA, and that S had had a non-life-threatening overdose.",
  "By this point, S was in the mood to walk around, interact with her friends, and generally shed my step-parental oversight, so I reminded them to call me if things seemed to be going wrong again, and asked B to keep an eye on S's body temperature and pulse.",
  "About an hour later, I got another call from S that her overdose symptoms were returning. Since she was still capable of speaking, I told her to take more 5-HTP and orange juice, and to walk around some more. She did this, and the second peak of symptoms seemed to lighten off. She thanked me, and apologized for interrupting my evening so frequently. I reassured her that I'd structured my evening so as to be available for such interruptions, and that she should feel entirely free to call if she felt any need to. I also asked for a follow-up call when she seemed to be definitely coming down, and unlikely to experience any further overdose effects, and another the following morning upon waking up, so that we could see what sort of hangover she was looking at having to manage.",
  "I eventually received these updates as text messages, with assurances that she seemed to be safe now, thanks for the help, and the occasional complaint about the severity of her hangover. I encouraged her to eat a large breakfast, take plenty of 5-HTP, finish off her juice, and generally endeavour to replace any nutrients that might have been depleted by the unknown drug. She reported her hangover as having finally worn off about 2 days later (again, by text message). After reviewing the vaults, she agrees with the theory that she and her friends had been given PMA, so I notified a few friends who volunteer (or work) for a local harm reduction group, so that they could make appropriate preparations and warnings."
 ],
 "erowid": {
  "id": "90708",
  "citation": " sakithin. \"That Wasn't What It Was Supposed to Be: experience with MDMA (Ecstasy; speculated to be PMA) (ID 90708)\". Erowid.org. Jul 25, 2011. erowid.org/exp/90708",
  "substance": "MDMA (Ecstasy; speculated to be PMA)",
  "views": "4400"
 }
}
