{
 "id": 13551,
 "title": "Van-Goghian Masterpiece",
 "date": {
  "submission": "2011-06-09T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Dondante",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "500 ug",
   "administration": "insufflated",
   "substance": "2C-C-NBOMe",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I planned for a springtime trip with a good friend, M. Id taken 1 tab of LSD about 10 days earlier in Canyonlands National Park, Utah. Otherwise, I hadnt used a serotonergic psychedelic in about 3 months. Id also recently experimented with methoxetamine a couple weeks before, having had an extraordinarily enveloping experience with 20 mg insufflated at a showing of Black Swan. No residual tolerance was present.",
  "T+0:00; 6:30 p.m.",
  "I nasally administer 500 g 2C-C-NBOMe in 10 L water (required gentle heating to remain in solution) with a 2.0-20.0 L pipet. The volume of liquid was too small to feel the drop. Initial uncertainty as to whether or not the volume was dispensed disappeared as I sensed a very minor burn.",
  "T+0:02",
  "Abrupt departure from baseline. I can almost feel the molecules diffusing through my CNS.",
  "T+0:05",
  "I feel slightly off kilter and for a few moments Im alarmed by the rapidity of the onset, but my facial muscles are slowly overtaken by an irresistible grin as I realize that I am okay. I remain lucid, but am propelled into a state of powerful psychedelia. The unremarkable room I'm in is suddenly transfigured into a Van-Goghian masterpiece. Looking out the window, the world has come alive, flowing in wavy brushstrokes. Visual trails leave clearly discernable ribbons of color in the air. I am completely enraptured by the stunning visual effects. My entire sensory experience takes on full salience. Every sight, sound, and smell enters my conscious awareness with unfiltered vitality.",
  "The thought occurs to me that this compound could somehow be of immense value in the field of human perception research.",
  "T+0:10",
  "My friend, M, decides to first make all necessary preparations for our outdoor adventure before taking 375 g (7.5 L) of the same compound.",
  "We both agree that the substance felt very clean from the start. There is no nausea (a rapid come-up from insufflated 2C-T-2 once resulted in unrelenting vomiting and sickness for myself). There is not even a hint of gastrointestinal distress. There is surprisingly little anxiety, except for minor concerns regarding the fact that we are venturing into a public area in such a state. Fortunately, we didnt end up having to interact with anyone, except briefly with a territorial dog after dark. Could we gather ourselves? I think so, at least for a very quick interaction. Mild muscle tension and a fine tremor are apparent. Mydriasis is prominent. No bruxism. We both noted some minor changes in mucous production, but nothing like the flowing snot that can accompany certain tryptamines at high doses. Appetite is suppressed. No significant vasoconstriction or thermoregulatory problems are noted. My heart rate seemed slightly elevated, but I never measured vital signs.",
  "T+0:20",
  "Transition #1: leaving the house. There are minor difficulties that delay our departure. My friend becomes ensnared in a thought loop on his front door step after dropping his water bottle. Is it damaged, dripping perhaps? Damaged?  yes. Dripping?  maybe. Dropped? Dripping? Somehow, confusion ensues. What were we doing again? Ah, yes",
  "We finally leave his house and set out for an open field with a grand view of rolling hills, immersing ourselves in the intoxicating beauty of early spring. The sky is brilliantly blue and the sun hangs low on the horizon, bathing our surroundings in a rich warm glow.",
  "Its about a 15-20 minute walk. We bring frisbees, as we think this will make us appear less suspicious...were embarking on a free-range disc golf adventure.",
  "T+0:40",
  "We find a perfect spot near the top of the hill beneath a lone tree casting its great form out into the resplendent skies overhead. I am finally able to lay down and stretch out on Mother Earth as I had desired since the chemical had taken hold. A standing cloud shape shifts on the horizon, dripping impossibly deep aurelian hues as the suns last rays are scattered above.",
  "Thought patterns are significantly altered, but yield to creative analytical tangents. Words are elusive at times and conversation is anything but linear, but we talk. My memory is a porous sieve. I have some difficulty differentiating real memories from my imagination. Short term memory is significantly impaired; neural circuitry is overwhelmed by the flood of sense information. I frequently lose thoughts before I am able to articulate them.",
  "T+2:00",
  "Before long, stars begin to emerge like jewels out of the deep violet. We stay as long as we can bear the dropping temperatures.",
  "Proto-language systems inform my thinking at times. Thoughts often present themselves without definite form, comprehended but in a pre-linguistic fashion. Attaching symbols (words) to these thoughts for the purpose of communication occasionally proves impossible. Are there genuine insights? I think so, except that the constant struggle to maintain verbal communication makes it difficult to dwell on these deeper reflections. A solo trip would certainly be very different. At other times, explicit articulation of an idea is unnecessary to convey the intended message. In a few instances, we seem to understand each others thoughts to an eerie degree.",
  "T+3:30",
  "A little after 9:00 p.m. we start the journey beck to Ms house. His roommates are watching the final four, so we decide that we need to find a new environment  a warm, safe place. Whats going on in my head at the moment is much too interesting for me to shift my attention to the television. Not long after the four hour mark, the effects had subsided significantly, and I felt comfortable making the short drive home. Psychomotor skills were fully intact. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] After some debating as to our next move, we drive back to my house together. The night ends with copious pot smoking (we both rarely smoke, but his friend had recently left him with some high quality herb). We talk my wife into joining us. Giggling ensues. Finally, we are able to add music to our experience, and it is fantastic.",
  "T+6:30",
  "I get in bed around 1:00 p.m. and drift to sleep around an hour later. I woke up feeling a bit fuzzy headed from the pot, but otherwise in good spirits.",
  "In summary, 2C-C-NBOMe is a spectacular compound, a highly refined psychedelic molecule with all the positives and few of the negatives of the vast repertoire of serotonergic psychedelics. I may prefer it to any phenethylamine or even LSD. The unique attributes of tryptamines, and a particularly influential peak experience, prevent me from declaring a further relative value judgment.",
  "I suspect that the lack of 5-HT1A agonism keeps the trip more lucid, soaring above the grungy feel that can contaminate high dose tryptamines, which M eloquently refers to as the sticky ickies. Although Im not certain, I think hes referring to the more grotesque hallucinations that can occur with tryptamines  viscera, flesh, weirdness  and also to the carnal feeling that youre crawling out of the muck toward the end of a tryptamine experience. I only include this because I think its an interesting concept, though it doesnt apply to the majority of my tryptamine experiences. There is little to no adrenergic component, though there is some cardiovascular response likely directly resulting from 5-HT2A/2C activation. 2C-C-NBOMe also lacks the overpowering eroticism of 4-HO-DIPT, 5-MeO-DMT, and 5-MeO-DIPT (Im curious about the mechanism for this unique effect). That said, I still think this compound could lend itself to a sexual experience in the proper setting. Lastly I had the impression that the increased preference for 5-HT2A over 5-HT2C, even if mild, is responsible for decreased anxiety."
 ],
 "erowid": {
  "id": "90724",
  "citation": " Dondante. \"Van-Goghian Masterpiece: experience with 25C-NBOMe (ID 90724)\". Erowid.org. Jun 9, 2011. erowid.org/exp/90724",
  "substance": "25C-NBOMe",
  "views": "29519"
 }
}
