{
 "id": 13566,
 "title": "Two Experiences With Night Lights",
 "date": {
  "submission": "2012-11-28T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Urizen",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "Unknown",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "Night Lights are marketed as an XTC like pill. I bought two pills at a local head-shop for $17 dollars apiece. I was skeptical, but I had heard good things. The packaging does not list the ingredients or the place of manufacture. So, I have no idea what was in them. Even now, after researching here on Erowid, I still dont know what they are. So, Im making this post, because I needed this information a month ago and it was not available. All I know is it was one large red pill, filled with a dry, fine white powder inside. I have done lots of Mushrooms and LSD. Ive done ecstasy a few times. So thats my prior experience.\rI took the pills nearly one month apart. There was no desire to re-dose, so I do not think these are addictive. Both experiences were the same, even though the environment was different. I felt no sickness or negative feelings at all after taking them. I was afraid they would make my stomach hurt or make me nauseous. They did not. I dont know if they are safe, but my body accepted them happily, compared to say a stomach full of mushrooms. I took the first one on an Empty stomach and the second one (a month later) on a full stomach. This did not make any difference. They began to kick in around 30 minutes both times.\rThe Positive EFFECTS:",
  "Euphoria all over my body. It covered me in pleasure. My skin felt ridiculously good. The wind/sunlight was damn near orgasmic feeling. It is truly one of the best feelings Ive ever experienced. This effect lasted for at least 3 solid hours and slowly tapers off.\rVisuals: The were no hallucinations. No light trails, no shifting patterns, nothing. However, colors were magnified by 10. To the point of glory. Everything is so beautiful. I spent both of my trips just looking at things in amazement. Sounds, including natural sounds, voices, and music take on a new dimension too.\rLove for Humanity: I am normally an anti-social misanthrope with severe social anxiety. These pills made me just the opposite, which was a completely new experience for me. I loved (not sexually) everyone. I felt I could trust anyone and opened up to complete strangers every chance I could. This is both good and bad. The filter between stranger and friend seems to dissolve.\rNo Fear: With Mushrooms and LSD, The Fear was always part of the fun to me. I would never take such drugs in public, because Id likely freak the fuck out. Night Lights induced no fear. Instead they eradicated it entirely. Everything was right in the world and I felt peaceful and benevolent.The Negative Effects:",
  "Jaw clenching and teeth grinding. My jaws ached the day after I did it the first time. The second time I chewed bubble gum which gave my mouth something to do. This seemed to help out a lot.\rThe Next Day - I needed two days of free time to take one of these. The day after is kind of shitty. I was mentally and physically exhausted. I had a splitting headache. I felt sleepy. The process of going from a world without fear and suspicions and a sense of connection to the human race (and nature) back to normality is jarring. I wish I could hold on to that sense of connection, but alas, it fades away. By the 3rd day, its gone entirely.That pretty much sums up my experience. Maybe this will help inform others. I dont know what is in them, and they may be dangerous. But the side-effects seem far milder than most time-tested psychedelics. I would gladly do them again, and would prefer these over LSD or Mushrooms."
 ],
 "erowid": {
  "id": "90847",
  "citation": " Urizen. \"Two Experiences With Night Lights: experience with Night Lights (ID 90847)\". Erowid.org. Nov 28, 2012. erowid.org/exp/90847",
  "substance": "Night Lights",
  "views": "1433"
 }
}
