{
 "title": "OD, Hospitalization",
 "author": "Leigh",
 "citation": " Leigh. \"OD, Hospitalization: experience with GHB (ID 13560)\". Erowid.org. Nov 9, 2005. erowid.org/exp/13560",
 "substance": "GHB",
 "bodyweight": "",
 "report": "<p>Due to my ignorance and lack of information about GHB I ended up OD'ing.  I was at a friend of mine's house and her brother (an avid drug user) brought us a bottle of GHB.  He had told us that there was enough in there for 3 people.  People who have studied up on GHB know that a little goes a long way.  Since we were idiots and didn't do our research, we did not know that.  We decided that there wasn't enough for 3 of us to do it so I ended up drinking the whole thing.  I started feeling the effects not long after I had taken it.  A feeling of being drunk is what I can relate it to.  I remember being dragged from one room to another by my friends, unable to walk on my own.  The very last thing I remember is lying on a mattress, talking about how much I love tool's music, while my friends were throwing a soccer ball at me.  The next thing I remember is waking up in a hospital. </p><p>This is what my friends told me happen during the time I passed out and woke up in the hospital.  First off I stopped talking.  My friends thought I was faking it so they didn't mind me much.  One of my friends heard me starting to breathe strangely - sort of like wheezing.  She came over to me and at that point I stopped breathing all together.  I am very lucky because she knows CPR and administered it to me which made me start to breathe again.  During this time my other friend called 911 and woke up my friend's parents.  The ambulance came and I once again stopped breathing.  At one point my heart stopped as well. </p><p>I sat straight up when I finally woke up a day later.  I tried to scream but there was a respirator down my throat.  My family was there all crying.  My brother later told me that on the way to the hospital my mom looked at him and said 'you know your sister's probably dead'.  I was lucky that I made it.  I had friends there that acted instead of saying 'oh she'll sleep it off'.</p><p>The intent of me writing this is not to preach.  I simply think you should ALWAYS be educated on what you are about to but in your body.</p>",
 "year": "1999",
 "id": "13560",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2005-11-09T08:00:00.000Z",
 "views": "11524",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": " ",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 }
}
