{
 "id": 13565,
 "title": "Journey to CandyLand",
 "date": {
  "submission": "2004-02-19T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dion",
  "gender": "Male",
  "weight": 113
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowls",
    "quantity": "2"
   },
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "dried"
  }
 ],
 "report": [
  "A friend had invited me to his house to try some salvia.  He wouldn't tell me anything about his experiences, though he told me about his observations of some other friends who had experienced it at his house the preceding evening.  I had no idea what to expect, which is as I think he wanted it.  He's kind of a 'psychologist' type, and I suspect he was wanting a raw, unbiased experience to compare to his own, to see if there was anything to some of the deeper, more subtle aspects of it or if he might have been biased.",
  "So we eventually got down to business.  He took me upstairs to his guest bedroom, I sat back on the bed.  He told me to be ready to pass out without being able to slow my fall, because sometimes that happened.  He filled the water pipe once with two leaves.  I lit it and inhaled the whole two leaves in one lungfull.  I held it for about 30 seconds, as he spoke words of encouragement.  I couldn't understand why he was being so 'encouraging', as though I might be in a 'delicate' state or something.  But I said nothing.  I exhaled, and inhaled the next bowlful.",
  "I don't remember going down slowly, I just remember seeing his face through a gray 'haze' which seemed to be covering everything as he said, 'Oh, yeah, you're going under now!'  He then turned off the lights and left the room.  I don't remember everything 'becoming' gray, or anything like that.  It just seemed like it always was that way.  Then I remember just being on the guest bed, laying and staring at the dark wall.",
  "Then all kinds of things began which I can only describe as 'weird shit', but I was excited as hell about it and eager to go deeper into the experience.  The entire room began looking somewhat as if it were a depiction in stained glass.  The borders between colors became solid, the objects themselves like some vague, misty 'space in between'.  Words appeared on the wall in that same stained-glass style, as the stained glass broke down even further until it was as if every particle and ray of light were itself a cell of stained glass.  The words I can't remember, though I know the letters 'G' and 'K', and that it was a very brief sentence indicating an 'awareness' which is always watching and waiting for its chance to show itself to us.  Then, the 'real world' disappeared.",
  "I looked up and realized that I was in a kind of 'CandyLand', where strange little 'people' were just 'emerging' from the candyland world itself.  They looked like little 'puppets', but alive and with awareness of their own.  There were 'toy soldiers', for want of a better word, and all around me there fell heavy, fresh white snow.  The puppet beings were themselves pale as snow, and I became aware of a rhythmic 'hammering' in the background, a hammering which seemed to form the basis of a kind of 'music' which drove the existence of this very world.  It was as though I were a flat sheet of paper laying on the surface of their world, and they were erecting a candy cane 'fence' around me, starting at my feet and working their way up to my head.  As this fence erected, it felt as if it were simultaneously 'pulling me down', enveloping me, pulling me into their reality and encasing me within it.  I remember one candyland puppet, a beautiful blond 'female' of sorts, with enormous blue eyes and in her best 'goldilocks' outfit. ",
  "They all looked intense and alive and aware, yet almost frighteningly cold and detached and emotionless.  Mechanical and calculated, that is how their efforts at 'fencing me in' felt.  There felt to be a strong sense of purpose behind this, and I was doing my best to go right along with it (I've never been one to shy away, not even from the scariest of demons, as in the end, for me, the demons always turn out to be the most powerful of friends).",
  "Then I heard my friend's friggin' *DOG* come in from outside.  The rattling of the trinkets on its collar were more than enough to bring me crashing back down to Earth.  Literally.  I suddenly found myself in the bed again, and was bouncing on it as though I'd just fallen there from a great height.  The female candyland puppet, she emerged then, arising from the bed like a cloud of scattered light.  And for a moment I saw her swirling into a mist in the center of the room, and felt her eyes looking back at me.  Only this time, she smiled, and I felt a great sense of 'welcome' from her.",
  "I am not a religious or superstitious person at all, which is why I face demons so bravely.  So this experience was not induced by supernatural expectations.  Yet it had a multi-tiered reality feel to it, as though this world were just a production, a theater, and those which I percieved as puppets on the other side - they were actually the puppetteers.  The intense, refreshing coolness of the snow, the little CandyLand huts glowing with their own mysterious light...  I remember it all very well."
 ],
 "erowid": {
  "id": "9084",
  "citation": " Dion. \"Journey to CandyLand: experience with Salvia divinorum (ID 9084)\". Erowid.org. Feb 19, 2004. erowid.org/exp/9084",
  "substance": "Salvia divinorum",
  "views": "5695"
 }
}
