{
 "id": 1356,
 "title": "Seizure at Dinner",
 "date": {
  "submission": "2007-06-15T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zarathustra",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.77 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "tea"
  }
 ],
 "report": [
  "I had a dinner party last night followed a bit later with a mushroom trip. Six of us tripped, four of whom had also had dinner with us, which finished at around 9PM. The other two (lets call them 'John and Lana') joined us at around 10:30, when I began making the tea. I boiled water, let it stop boiling, put it in a teapot with mushrooms, some lemon juice to help with the extraction and some ginger for flavor and to calm the stomach, a combination that has worked well for me in the past.",
  "I let it steep for about 20 minutes, and then we drank it. The four of us that had had dinner together also ate a small bit, but John and Lana did not.",
  "About 45min to an hour later everyone was starting to have visuals, and also felt a bit queasy. I didn't, but I had taken less, as one of the dinner guests was taking it for the first time and I wanted to be somewhat sober for him (he was fine, had a great time). Lana became rather upset, said it was too much, and I suggested she relax her muscles, drink some water and move around to help flush it. She stood up, remarked she felt a bit better, and John stood up with her. We were both watching her. I was asking her to relax when John locked up and fell over, hitting the ground like a statue. He lay there shaking and stiff, for a few seconds, then snapped out of it. From when he locked up till when he came to took about 10 seconds. When he got up he broke out in a sweat, which lasted a couple of minutes. He tried to describe the experience then, saying the only comparable one was when he had cut himself deeply and passed out after examining the wound.",
  "I prepared a bed for them and checked on them at regular intervals, John threw up a couple of times but was otherwise ok. Lana was of course quite shaken, but they were otherwise fine after that, tripping a good bit, which passed after about two hours. Everyone else missed this and were and enjoying themselves, so I told them Jon had fallen over, he seemed ok now, and that I was keeping an eye on it.",
  "The rest of the night went fine, everyone found their way home in the early morning, I've talked to them and they're all feeling pretty good, just a bit tired.",
  "John and I have taken mushrooms together a lot in the last few years (about once every two months), without difficulties. I've eaten from this batch twice before and John once before, and several friends as well, without any problems. This was the first time I made a tea out of this batch, but a friend of mine had made a tea in the same manner once before.",
  "John and Lana had eaten dinner around seven, John had had two beers between then and when he drank the tea. For dinner they had eaten rice and vegetables with a store-bought Chinese sauce, which contained msg and molasses, among other things. They had not had any other foods or drugs in that period."
 ],
 "erowid": {
  "id": "14095",
  "citation": " Zarathustra. \"Seizure at Dinner: experience with Mushrooms - P. cubensis (ID 14095)\". Erowid.org. Jun 15, 2007. erowid.org/exp/14095",
  "substance": "Mushrooms - P. cubensis",
  "views": "2932"
 }
}
