{
 "id": 13574,
 "title": "Test Shots Save",
 "date": {
  "submission": "2003-10-30T08:00:00.000Z",
  "experience": "2000-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "anonymous",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "administration": "IV",
   "substance": "Heroin",
   "form": "tar/resin"
  }
 ],
 "report": [
  "When I had my first O.D. I had been using heroin for a little over two years.  At one point, I somehow managed to get off it and stay clean for about 3 weeks.  Something went wrong though, and I scored a bag and fixed 40 thick units of black tar.  Now I thought I was being safe and responsible here, because I normally slam around 70 or 80 units, or about 1/4 gram.  Unfortunately for me, this dope was really good, and my tolerance was very low.  I remember making a loud sigh of intense pleasure after I fixed, and that warm, strong rush flooding the whole of my being.  I stumbled out of the bar bathroom and onto the street about one minute later, and the last thing I remember thinking was, 'I think I did too much.'",
  "The next thing I know I'm kicking and cussing and trying to rip all these tubes out of my body and I'm scared bad because I can't breathe.  It takes me a while to realize I'm in an ambulance, and this nurse is looking down and me asking me what I took, and telling me my left lung collapsed.  The next 3 hours was the most terrifying experience of my life, and that says a lot 'cause I've been through some crazy shit. ",
  "I remember each breath sharp and painful and terribly insufficient.  I kept blacking out because I couldn't get enough oxygen, even with the mask, and when I looked down I saw I was naked with a catheter up my cock and a tube the size of my index finger stuck through my rib cage and into my lung, draining out about a half pint of bloody fluid.  I was so scared I used what little air I had to scream at the doctors that I couldn't breathe, over and over. The next 6 days I ran up a $25,000 bill, which I'm not even going to try to pay off, as I slowly recovered and fully reinflated my lung. ",
  "The insanity of heroin addiction is, that the day I got out I was back in it all again, and since I couldn't find a rig, I was actually SMOKING tar and crack and cigarettes, the whole in my chest still wide open and filled with blood and pus. (the doctor told me NOT to smoke anything, if I did he said chances are 2-1 my lung would collapse again.  So far I've been lucky)",
  "Six weeks later I O.D.'d again, trying to get that same old feeling by loading up on more dope than usual.  My buddy saved my life, he found me in his front yard with a cigarette burned down to my fingers, leaving me with a nasty 2nd degree burn.  Strange that the cigarette didn't wake me, but his yelling in my face did...",
  "Both trips the hospital required Narcon, and opiate blocker, to bring me back.  Narcon saved my life but it's a bad feeling.  Your high drains out of you as soon as they give it to you, and get filled with rage and restlessness, as reality slaps you in the face.",
  "I've since completed a 12 step recovery program and am clean and sober, though I'll take LSD occasionally for spiritual purposes.  Staying clean is a daily struggle, as the obsession with dope is alive an well, and, I'm told, will always be with me.",
  "If you're thinking about trying heroin I would advise against it. ",
  "Once you cross that line and do it just once, it's so easy to do it again.  Besides, there are so many better drugs out there, like MDMA, LSD, fungus, peyote, herb...",
  "I wouldn't even say heroin is fun, it's just really damn good. But please, if you do slam dope, be careful. Do tester shots to be sure you can handle it, and ALWAYS FUCK SAFE & SHOOT CLEAN.",
  "(Hep C is a pain in the ass)"
 ],
 "erowid": {
  "id": "9089",
  "citation": " anonymous. \"Test Shots Save: experience with Heroin (ID 9089)\". Erowid.org. Oct 30, 2003. erowid.org/exp/9089",
  "substance": "Heroin",
  "views": "26208"
 }
}
