{
 "id": 13579,
 "title": "Natural Exstacy (Writhing in a Snake Pit)",
 "date": {
  "submission": "2013-12-20T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PinnealMagic",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "12",
    "unit": "in"
   },
   "administration": "oral",
   "substance": "Cacti",
   "form": "extract",
   "specific": "T. bridgesii"
  }
 ],
 "report": [
  "A 12' section of beautiful blue Trichocereues bridgessi (Achuma) was carefully de-spined and then the outer skin cut length-wise and removed discarding the useless inner core. The remaining product was 8oz of what looks similar to green beans. This was then boiled on medium heat for 4 hours adding water as necessary. When nearing completion, the experiment was filtered and boiled down to 1 shot glass. The water had become a brown/ yellow color.",
  "The shot was taken in one gulp. The taste was the most bitter one can experience. In fact so, I still wince just remembering it. Cati are extremely alkaline. People usually don't enjoy alkaline foods, but more acidic ones. Hence the entire 'journey' my mouth felt like I had eaten 1000 lemons washed down with purified green bell pepper juice. Perhaps dehydrating the remaining shot and putting into a gel cap could pacify the flavor. Another thought is to put it in jello.",
  "What happened seems to happen every time a mescaline cacti extraction is taken in this manner. At first, immediately after consuming the shot, I decided I did not want to trip anymore. I decided I could subdue the trip by focusing hard enough and felt I could overpower the chemical. I laid down on a couch. What happens next is always very unusual. On the couch, I start to toss and turn frequently, but never really feeling anything uncomfortable or trippy. I try to go to sleep, and feel I do, but I wake up every 5 to 15 min. 1.5 hours pass by in what feels like 10 min.",
  "I then get up and realize I am feeling something. I walk to the bathroom mirror and stare at my reflection. My eyes were very dilated. I had a flush red face with an elevated heart rate. I thought to myself 'This must be the cactus. It does work.'",
  "The effects lasted very strongly for 12 more hours when it started to trail off. The main effects were gone after 18 hours leaving only afterglow. The experience was very beautiful. The entire night was spent Indian style on the couch tipping back and forth in amazement at the purity of the magic. My teeth were grinding and my jaw cleched tight the whole night. I felt like I was candyflipping (MDMA & acid). I repeated to myself all night 'Thank you for this medicine.' I was amazed that such an experience could occur from a cacti growing from the dirt. I was then extremely thankful for the simple dirt and the earth and the story we have to live here as humans all night long. I was in complete awe that the experience was so abundant and hidden.",
  "Prepared this way, Achuma is a very very strong natural MDMA. It was obvious to me that synthetic MDMA was thought of by people who had experienced this cacti magic first.",
  "Achuma is almost too strong. I wanted to let it caress me and make me warm like a cozy blanket, but the taste and jaw grinding distracted me all night. I felt power. It was as if I was sitting on the tallest mountain invisible looking down while the wind, light, and sound went straight through me. I was one with these natural forces.",
  "On another occasion I cut a 6' section of achuma into a cylindrical shape. I basically left the outer despined skin intact and popped out the inner core leaving a 6' tube of just the precious skin. This is easily juiced using the Jack Lalane juicer. This yields about 2 shots of a pure green liquid with no mucus if done properly.",
  "When this was ingested orally, the experience was much different. I do not recommend this. The unboiled juice is much different than the boiled.",
  "The same 'sleeping on the couch and 1.5 hours slipping by in what feels like 10' took place as usual. This experience, I felt like I was flipping back and forth between dimensions all night long every 30 seconds. It was rather exhausting. I wanted it to let up a little, but it had a hold of me. With eyes open, reality was somewhat normal. I definitely compare the 'trippy' eyes open experience to the woozy, hyperventilated feeling from running faster and longer than usual trying to catch your breath. The walls were breathing and the experience was extreemely physical.",
  "With eyes closed, it was a different story. I honestly felt trapped in a cage and just wanted it to ease up to something more mellow. When I closed my eyes different realities took place the most prominent and the one I remember the most was that it felt like I was in a dark hole in a dungeon in a pit with 10,000 writhing snakes. The mescaline let me see and feel each one crawling on me and suffocating me. Not too much fun right? It let up after 12 hours again. I won't be doing that method again.",
  "In conclusion, achuma is much stronger than San Pedro. I have friends who have eaten both that strongly vouch for this. Achuma contains many more alkaloids in it and most likely some MAOI inhibitors which makes it much much stronger and less pure. I felt many many different feelings due likely to the larger mix of chemicals. Respect this and other cacti. They are not meant for recreation, but to be used as a medicine. Research and learn before making this journey. The Native American and Peruvian medicine man rituals are the most beautiful you can imagine in this setting, and should be incorporated. One last thing, people that know and understand this are recommended to keep it to yourself no matter how much you indulge. I know first hand that no matter how logical you are, everyone will always think you are a crackpot for messing around with the stuff. Don't jeopardize this medicine with a loose mouth. It is a secret."
 ],
 "erowid": {
  "id": "90918",
  "citation": " PinnealMagic. \"Natural Exstacy (Writhing in a Snake Pit): experience with Cacti (T. bridgesii) (ID 90918)\". Erowid.org. Dec 20, 2013. erowid.org/exp/90918",
  "substance": "Cacti (T. bridgesii)",
  "views": "315"
 }
}
