{
 "id": 1358,
 "title": "Very Relaxing Effects",
 "date": {
  "submission": "2005-10-05T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "DaggaHead",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Skullcap"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Leonotis leonurus"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco"
  }
 ],
 "report": [
  "I'm growing about 15 plants of lion's tail, and decided one day to use 3 of the leaves along with some home-grown skullcap to make a joint out of a cigarette.  Keep in mind that the lion's tail leaves were VERY young, as the plants were only about a foot high or so.  Me and my friend 'A' (one joint each) start smoking outside, taking in each hit and holding it for 20 seconds.  The taste was pretty mild, not a bad taste at all... after about 3 hits I could definitely feel something coming on, so could A.  It was a little like MJ, a mild buzz with light-headedness.  Finally, we finished the joints.  By then, we were laughing and fucking around a hellavulot more than usual, and we were definitely REALLY buzzed, could hardly stand up.  This I feel was the lion's tail.  Unfortunately, after about 5 minutes after smoking it completely wore off, and we were left with an extreme chill, just relaxing, lazy as hell.  The chill afterwards was most likely the skullcap. ",
  "Conclusion: The lion's tail produced a great, fun buzz... for a really short time.  However, the leaves weren't great cause the plant was premature, and we didn't smoke much anyways.  If we had smoked more and used the buds, I'm sure the high would've been goddamn awesome.  I can't wait till harvest...."
 ],
 "erowid": {
  "id": "14102",
  "citation": " DaggaHead. \"Very Relaxing Effects: experience with Leonotis leonurus, Skullcap & Tobacco (ID 14102)\". Erowid.org. Oct 5, 2005. erowid.org/exp/14102",
  "substance": "Leonotis leonurus, Skullcap & Tobacco",
  "views": "13791"
 }
}
