{
 "title": "Just Horrible",
 "author": "Trippernaut",
 "citation": " Trippernaut. \"Just Horrible: experience with Calamus (ID 13597)\". Erowid.org. Jan 27, 2004. erowid.org/exp/13597",
 "substance": "Calamus",
 "bodyweight": "140 lb",
 "report": "<p>I read some calamus experiences and was taken in by stories of seeing feries and easter island statues, and I passed off all the sickly trip reports as people with weak stomachs.</p><p>So just to be safe I started off with only 2 1/2 grams.  I capsulised the root powder into five size 00 capsules (this comes out to be almost exactly 1/2 a gram per capsule).</p><p>I swallowed all 5 capsules on a somewhat empty stomach and waited for awhile.  About half an hour later I notice that I feel weak, a bit shaky and slightly strange, nothing fun at all. So I told myself that I'll try a larger dose tomorrow. A couple hours later I went and ate chinese food.  I came home feeling absolutely horrible.  I wasn't just nausious, I felt shaky and weak and even had a slight headache all at the same time.  It was absolutely horrible. Normally, I don't mind blowing my groceries when i'm on something, cause I usualy feel so much better after I puke.  But this wasn't like that at all, I didn't feel any desired effects, it's like I had just taken some pills that gave me the stomach flu. I threw up all the chinese food that I had just barely eaten.  Which was absolutely horrible cause it was all chunks, and I hadn't drunk much liquid with it so I thought somthing was going to get stuck in my thoat and I was going to choke.</p><p>After that I felt a little better and I drank a bunch of water.  Then I started feeling horrible again, so I would have to go right back to the bathroom and puke up all the water I had just drunk.  I would do that again and again throughout the whole night, until eventually I was puking yellowish-green bile.  I puked until 2:30 AM, and then I finally fell to sleep still feeling like shit.  I puked a total of 23 times that night!  It was making me cold too cause I would drink cold water, and it would cool off my stomach, then before my stomach could warm the water up, I would puke up the cold water and drink more cold water.</p><p>I still have a respect for this plant, but it is definately somthing that I will NEVER try again, it was absolute misery.</p><p>Peace</p>",
 "year": "2002",
 "id": "13597",
 "gender": "Male",
 "timestamp": "2004-01-27T08:00:00.000Z",
 "views": "14844",
 "dose": [
  {
   "time": "0",
   "amount": "2.5 g",
   "administration": "oral",
   "substance": "Calamus",
   "form": "(roots)"
  }
 ]
}
