{
 "id": 13593,
 "title": "Almost but Not Quite",
 "date": {
  "submission": "2011-06-09T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Zilpe",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.6 mg",
   "administration": "buccal",
   "substance": "2C-D-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Note that as this report was written post-trip all timings are approximate. I had recently managed to get my hands on some 25D-NBOMe from a trusted vendor, as I didn't have an accurate scale at the time and didn't feel like going through the hassle of volumetric measurement, I opted to buy the pre-laid blotter offered by the vendor. Previously I had tried 1 hit (800ug) and found the experience to be a little underwhelming so I decided to up the dosage to 2 hits (1.6mg).",
  "I placed 2 hits between my upper gum and cheek and went out to practice the piano. The blotter had quite a bitter taste and I did my best not to swallow often as I had read that this compound was inactive orally. The first  alerts became present after about 10 minutes, a strange buzzing sensation in my head very reminiscent of LSD. I then preceded to go take a walk in a nearby forest. Walking through the forest the colours seemed to be a lot more vivid than usual, I found that I was able to perceive all the subtleties in a single shade of colour. Where normally I would only see a leaf as green, I saw the full spectrum that that particular shade of green had to offer. As I was walking I became more and more stimulated, by the time I stopped the slight buzz in my head had evolved into a strong sensation which was remarkably similar to LSD, if I had not known better I could have easily mistaken this substance for acid.",
  "I spit the blotter out at about T:+00:30 and this is when the visuals began to ramp up, mostly just the typical breathing and patterning of surfaces that I get on other psychedelics. At this point I began my walk back because I felt that this could end up being quite intense and I wanted to be in the comfort of my room if that were to happen. By the time I got back (T+00:50) the trip was in full swing. I tend to be fairly sensitive to stimulant effects and physically this compound was hitting me hard. My heart rate was very rapid and I was experiencing a lot of unpleasant muscle tension, pupils were very dilated. I started to regret taking this compound at this dose because it really felt hard on my body. The body high and visuals were indistinguishable from a moderate acid. The headspace, however, had some subtle differences. Many people have described this compound as very peaceful and I could understand why, as I lay in my bed tripping and worrying about the physical side-effects my thoughts were definitely psychedelic but nowhere near as chaotic as LSD and without the thought-loops of shrooms. My thoughts were tranquil and easily controllable. There was a good deal of introspection with this compound, I spent a lot of time thinking about what exactly I get out of my usage of psychedelics and whether or not I had been irresponsible with them lately, but the few times I ventured downstairs for food or water I had no trouble interacting with my family.",
  "This is definitely something I could see myself taking at a social event (at a lower dosage of course). Musical enhancement was also another positive aspect of this trip, although all psychedelics I've tried have enhanced my appreciation of music to some degree some have not been as satisfactory for me as others. 2C-E, for example, has not been nearly as good in this regard as acid or shrooms. 25D-NBOMe, however, was excellent, maybe even rivaling acid. After spending some time listening to music and waiting for the concerning physical effects to pass I decided to start sketching (T+03:00). Although I can't draw at all this was extremely rewarding for me, I would start with just some random scribbles and as soon as my mind saw something in the chaos I would just go with it and attempt to flesh out the images that were jumping out at me. This creative outlet took my mind off of the negative physical sensations and allowed me to focus the trip in a positive way.",
  "At about T+05:00 I had come down to the awkward stage where you're not really tripping anymore but you're still not sober. So I took some melatonin and attempted to sleep. As was expected, insomnia prevented me from getting to sleep until about T+08:00. Overall this compound is by far the closest thing to LSD that I have ever tried, the only real differences I found were the more tranquil, less chaotic headspace (as someone put it, a high signal/noise ratio), the shorter duration, and the more unpleasant physical side effects. It's unfortunate that I find this chemical to not be worthwhile at more reasonable dosages since the side-effects I experienced were really too worrying to warrant further exploration at this level."
 ],
 "erowid": {
  "id": "90995",
  "citation": " Zilpe. \"Almost but Not Quite: experience with 2C-D-NBOMe (ID 90995)\". Erowid.org. Jun 9, 2011. erowid.org/exp/90995",
  "substance": "2C-D-NBOMe",
  "views": "14714"
 }
}
