{
 "id": 13597,
 "title": "A Wonder Drug",
 "date": {
  "submission": "2011-09-28T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Former All-Star",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "300 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "pill/tablet"
  },
  {
   "time": "0:45",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "pill/tablet"
  },
  {
   "time": "1:15",
   "amount": "600 mg",
   "administration": "oral",
   "substance": "Pharms - Gabapentin",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "I was in a car accident almost a year ago and I've had neck, back and nerve pain since the accident and it has been progressively getting worse. I had a MRI recently that showed two herniated discs as well as a pinched nerve. I've been in pain and a new Dr I saw gave me a script for Gabapentin.",
  "Let's just say I know my way around the medicine cabinet but never heard of this being used for recreational use. I've used pretty much everything at one time or another for recreational use; mostly opiates like Vicodin, Oxycontin, Benzo's and many others.",
  "Today I took 7.5 mg Vicodin ES for pain (2 taken at 9:00am) and got a new script for",
  "7.5/325 Percocet today because the Vicodin has lost effect. (1 taken at 10:00am, 1 about 12:00pm) (note: I drank two cans of Mt Dew to wash them all down.)",
  "10:30-11:00pm: I took one 300mg, That is the recommended amount to be taken once at bedtime.",
  "11:30pm: Not feeling much affects so I took another 600mg.(2x300mg) Now starting to feel I a little light headed after about 20 minutes and getting slight visuals when looking around, everything's a little foggy and Im starting to see patterns in the darkness(similar to when you look at something bright and look away)  and I feel pretty good.",
  "12:00am: I took another 600mg (2x300mg) about a hour later and I'm starting to feel relaxed watching tv and typing this at the same time.",
  "12:45am Its gotten pretty intense now so I'm just absorbing my environment and kinda looking around.",
  "1:30am: the high is coming in waves. Gets intense but then it mellows out. The intensity goes up and down and at times I'm kind of spaced out and very tingly. When I get in that spacey Zone start to see the patterns and taking deep breaths feels really good.",
  "1:45am: I'm just sitting here taking slow, deep breaths with my eyes closed and it's a very satisfying, pleasant feeling right now. kind of like mdma-ish And I'm feeling like a pulsing in my feet.",
  "About 2:00am I actually fell asleep shortly after the last check in.",
  "4:45am:  I woke up on the couch and feeling somewhat alert. (probably because I passed out while relaxing and indulging in the experience and was a bit startled). 5 minutes after I got in bed and had all types of things running through my head random things. I can't recall what but nothing upsetting or anything.",
  "5-5:30am I had fallen alseep again.",
  "7:00am I awoke and felt pretty good started out my day and doing some rather strange things. Looking through boxes of things I haven't unpacked since I moved into my current home about 3 years ago and im in an extremely good mood.",
  "11:00am: I had physical therapy and got very caught up in searching through things from my past. I spent about 4 hours starting one task and getting side tracked as I was going through my old stuff, I really didn't accomplish anything just kind of rifling through things I didn't remember having and taking some items I felt I'd have use for now.",
  "1:00pm I called my wife while on my way home and she said I sounded funny, that I was pausing after a few words when speaking. She said I sounded kind of out of it. In driving I kind of felt strange. Its not like I couldn't drive ok but kind of focusing on many things I was passing by so it was very distracting. I do not recommend driving while taking this medication in high doses at all, the affects seem to have been lingering and it is annoying when I need to be alert. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "2:00pm: I stopped to get a sandwich because I was hungry and I have not eaten since last night at about 8:00pm hoping food may make me feel better.",
  "2:17pm, just ate and I'm feeling semi back to normal with a little spacy feeling now and again.",
  "Conclusion:",
  "I honestly can say the experience wasn't bad at all, it took a total 1500mg doesage to really get things going but I don't think I'll be taking any dose above 300mg as prescribed in one sitting. I'm glad I checked it out but it's affects are lasting much longer then I'd expected it too. Luckily I am not working today or I don't know what I'd do, I couldn't function with the spaciness feeling all day. I only took 1500mg within about 3 or so hours and it's now 15 hours later and I'm still feeling subtle affects.",
  "I can't imagin taking 3000mg. I think I'd be screwy for a few days taking that much Gabapentin (Neurontin).",
  "I hope I've given some people some insight on taking Gabapentin.",
  "I don't recommend abusing it though and do not drive on it. When taken according to my Dr's orders it's working really well and doing the job. If you have cronic neck and back pain or nerve related pain it's a wonderful drug but for recreational use I'd rather just smoke some weed or have a few drinks. Plus I'm sure there are probably some unknown long term affects associated with abuse of the drug as well. You only have one body and brain once you damage it enough you aren't worth shit. I've see it happen to many people I've known in my life.",
  "Use caution when experimenting and it's always good to have a partner in case something goes wrong.",
  "Regards",
  "FAS"
 ],
 "erowid": {
  "id": "91012",
  "citation": " Former All-Star. \"A Wonder Drug: experience with Gabapentin (ID 91012)\". Erowid.org. Sep 28, 2011. erowid.org/exp/91012",
  "substance": "Gabapentin",
  "views": "9923"
 }
}
