{
 "id": 13595,
 "title": "Breakfast of the Gods",
 "date": {
  "submission": "2011-09-21T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dr. Ylee",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "150"
   },
   "administration": "insufflated",
   "substance": "DPT",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "It came about on a bright May morning that I decided to take another psychedelic attempt at my new fascination at the time, DPT. I awoke at about 10am and I realized the day was upon me that I must deepen my psyche and I had acquired this strange powder from a friend a few weeks ago and I had been dying to give it another try. Previously my buddy and I had done DPT and the dose I took was wayyyy to strong. The hallucinations were overwhelming, both with eyes open and closed. The latter were much more elaborate and unfolding and were easier to integrate into my mind. Words always fail to accurately describe vivid hallucinations because as always, one must experience the madness firsthand. I will try to articulate my mind's eye. With eyes open sitting in a chair in my living room, where these two walls meet with the ceiling there ceased to be an external meeting of right angles, however they protruded outwards into my visual field. The corners of the room were coming straight for me and I couldn't escape.",
  "No amount of marijuana or music could soothe this madness. No sleep for the wicked. With eyes closed I sat back in my chair and felt as though I was in the clouds floating in a purely medatative state, visuals of figures mimicking myself floated past me on mountaintops. I felt as though I were doing front and backflips simultaneously, such a strange paradoxial feeling. Pure beauty; straight up alex grey shit. After hours of mental pleasure/torture I was gradually allowed to regain my consciousness by some divine force, for I was not in control of myself at the time.",
  "Now, on to today's experience.",
  "I awoke early around 10am and ripped a huge line of DPT, roughly 100-150 mgs. I jumped into the shower with the hopes that by the time it was done, I would be tripping face. Toward the end of the shower I started getting tremors in my limbs and I knew I was in for something very infinitely interesting. I quickly got out of the shower and got dressed and started blasting mellow STS9 out of my amp and laid down for the effects to override my mind. Within minutes, my closed eye visuals were changing with ever note and transition of the song, it was amazing. I strongly recommend closing the eyes and taking in music while on DPT. All my thoughts flowed with the music, everything in my mind, everything from this day back to my childhood raced through my mind. Everyone I'd ever met, had fun with, screwed over, laughed with, cried with, and especially cried over were flowing through my mind like an endless stream, however this stream was made entirely of grains of sand, each grain was an aspect of my life which had affected others in positive, negative, and neutral ways. Very spiritual, very overwhelming, VERY necessary.",
  "I had recently been in a serious car crash in which I went through the windshield and this was like a beacon in my mind for a perfect second chance at life, I cheerished every minute of life, and I would, as the dpt showed me, cheerish every day, every moment, ever interaction, every action and reaction. . . a perfect paradoxial mindfuck. Life is great and there is no need to be afraid to do anything you set your mind to, as you are the only one who can create that action through your potential cooped up inside you, just let it out. No need to hide the funk, let it flow. After about 3 hours of intrinsic thought I gradually went outside and went for a walk. The day was sunny and warm, the trees, plants birds, people all seemed to vibrate with vivid energy, it is so hard to explain I wish you were there. On the walk I saw an old dog and I stopped to pet him, he seemed to talk to me in a silent tone and I understood his life story. Nice fellow.",
  "I gradually made my way to Wawa and got a necessary drink since the drip was chemically nasty as fuck. I walked around admiring the rest of the street for about an hour and then eventually went back to my apartment to mellow out and possibly write this report. At the moment I am baseline and writing all of this still seems like it did not capture the essence of my entire experience, however I emplore you to try a hefty dose of DPT for yourself and try to articulate what just happened to you. Its virtually impossible. All in all, this dose was perfect for me because I was purely intrinsic and thought provoking which was exactly what I was looking for. Earlier when I was faced I texted my friend 'dpt for breakfast' and he just responded now 'Breakfast of the Gods'. I hope to dine with the gods soon enough, until then, live your life."
 ],
 "erowid": {
  "id": "91004",
  "citation": " Dr. Ylee. \"Breakfast of the Gods: experience with DPT (ID 91004)\". Erowid.org. Sep 21, 2011. erowid.org/exp/91004",
  "substance": "DPT",
  "views": "2942"
 }
}
