{
 "id": 13619,
 "title": "Completely Unprepared",
 "date": {
  "submission": "2003-12-05T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Smokey",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis"
  },
  {
   "time": "0",
   "amount": "",
   "administration": "",
   "substance": "smoked"
  }
 ],
 "report": [
  "Me and a friend dosed at 6:09pm on a Saturday. We were unsure of how much to take so we decided to start with a light dose.  After only 10 minutes my friend began to feel extreme anxiety and nausea so he went for a walk.  When he came back we smoke a couple bowls to calm us down.  30 minutes after we took them I began to feel a strong body buzz.  The buzz became so intense that I had to sit down to take it all in.  My vision became distorted and dreamy and my body felt swimmy and rubbery.  To move my arms and dance became amusing and fun.",
  "by 7:30 we were full blown tripping with extremely intense waves of visuals.  The room we were in was dark.  I can recall the insense smoke that we had set infront of a psychadelic bubble projector as being one of the most beautiful things I have ever seen.  The whispy smoke seemed to turn to faces.  We stared at the smoke for what seemed like hours. ",
  "The next couple hours were the most intense drug experience I've ever had.  I had trouble controling the thoughts and visual sensations that flooded my brain and eyes.  I had a constant fear that we took too much and that I was going to die.  I lied on my bed covering up my eyes trying not to accept what was happening(not a good idea, you should just accept it and let it flow).  It felt like my bed was really high up and i became frightened of the ground.  While my eyes were closed I had visuals of mushrooms and when I opened my eyes I was almost convinced that they were growing on my arm. ",
  "Eventually I overcame the fear by watching some television. As we were coming down we smoked another bowl or two and talked about our trips.  While I was coming down my hands were shaking and my voice was quivering.",
  "We were completley unprepared for that trip.  Since then I have dosed at 1 gram.  I found this to be more comfortable for me.  I would recommend dosing during daylight hours and mentally preparing for your trip.",
  "Peace"
 ],
 "erowid": {
  "id": "9113",
  "citation": " Smokey. \"Completely Unprepared: experience with Mushrooms & Cannabis (ID 9113)\". Erowid.org. Dec 5, 2003. erowid.org/exp/9113",
  "substance": "Mushrooms & Cannabis",
  "views": "5879"
 }
}
