{
 "id": 13612,
 "title": "Long-Term Use",
 "date": {
  "submission": "2011-05-20T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "PurePoison",
  "gender": "Female",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "800"
   },
   "administration": "oral",
   "substance": "Quetiapine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "155"
   },
   "administration": "oral",
   "substance": "Oxycodone",
   "form": "daily"
  }
 ],
 "report": [
  "I was prescribed Seroquel by a psychiatrist about 8 years ago when I first discovered I was bipolar. After trying just about every psychotropic medication on the market, Seroquel was, thankfully, the one I had been looking for all along. The drug changed my life completely and helps me function normally now.",
  "I was really surprised to read that this stuff is actually used recreationally and has a street value. I am also shocked to see that people are taking as low as 50mg to get high. I take 800mg every single day! I went from sleeping 2-3 hours a night to 12-14 hours a night in just a few weeks. I definitely have incredibly vivid dreams that have me shouting obscenities and other things in my sleep, and even throwing myself out of bed while sleeping. Sounds crazy, but its nothing I can't handle.",
  "Despite the many upsides of this stuff, it most certainly has its downfalls. Once my mind and body got used to a certain dosage, I would feel awful if I take any more than that. I start to feel weird and my brain just flips out for no reason. Every time I take an extra one thinking it will help, I end up a fricking wreck. I do not recommend extreme experimentation with this stuff. I take 155mg of oxycodone a day, and know how shitty it feels to go through narcotic withdrawal. But once I start to withdrawal from Seroquel, I will be begging God to make me a withdrawling opiate addict. Going without Seroquel when my body and mind are used to it is pure hell."
 ],
 "erowid": {
  "id": "91106",
  "citation": " PurePoison. \"Long-Term Use: experience with Quetiapine (ID 91106)\". Erowid.org. May 20, 2011. erowid.org/exp/91106",
  "substance": "Quetiapine",
  "views": "5061"
 }
}
