{
 "title": "Knocked the Fuck Out",
 "author": "Blazed",
 "citation": " Blazed. \"Knocked the Fuck Out: experience with Pseudoephedrine (ID 13617)\". Erowid.org. Oct 25, 2006. erowid.org/exp/13617",
 "substance": "Pseudoephedrine",
 "bodyweight": "169 lb",
 "report": "<p>Why the fuck did I even do this drug again? I popped 3 60mg pills of Actifed around 9PM. I figured I wouldnt be going out, so it was ok. I usually like to experiment with drugs when Im alone. It gives me the chance to find out what drugs do, while I dont act like an idiot in front of other people.</p><p>For the next hour, I would feel a constant increase in drowsiness coming on. After that, it only took 30 min To knock me out. I saw a friend online, and I wanted to hang out; unfortunately, it wasnt going to happen. If I hung out, Id smoke weed. This would make me feel 10x worse. Instead, I laid down on the futon and tried to relax. I wouldnt get up from that point on.</p><p>I noticed myself getting dizzy, and that did it. I was gone, and it was only 10:30.</p><p>I woke up at 530AM to a head that felt like it was cooked on the inside, so I went outside to smoke a cig. I could feel the hangover. It does feel bad. It feels like Im at the verge of a headache, but not there yet.</p><p>Standing there, I couldnt really pay attention to everything around me. Id either have to pay attention to the sound of the wind blowing, or getting some eye visuals. Cigarette smoking took a back seat to this. Simple things would amaze me as well. A plane flew over, and I found myself staring at it until it disappeared into the clouds.</p><p>The hangover the following day isnt pleasant. Ive had much better drugs. Acid doesnt even have this bad of a hangover. Fuck it.</p>",
 "year": "2002",
 "id": "13617",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2006-10-25T07:00:00.000Z",
 "views": "28336",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "180 mg",
   "administration": "oral",
   "substance": "Pseudoephedrine",
   "form": "(pill / tablet)"
  }
 }
}
