{
 "id": 13617,
 "title": "End of the Long, Dark Road",
 "date": {
  "submission": "2011-05-23T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Zonie",
  "gender": "Male",
  "weight": "225 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Buprenorphine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Naloxone",
   "form": "(daily)"
  }
 ],
 "report": [
  "It has been a long year since I have been  on methadone maintenance. This is how I went from 2 grams heroin daily, to 110 mg methadone daily, to completely sober now.",
  "After 5 years on heroin, I went to the methadone clinic, stabilized at 110mg, and then steadily lowered my dose 5% a week, until I was at 30mg. Then I consulted with a doctor that prescribes Suboxin, and he suggested I start at 24mg a day suboxin, after 2 days from my last dose of methadone, I began. I wanted to make the suboxin last so I took 16 mg a day for 2 months, then I inched my way down to 8mg a day for another 3 months. After that I went to 4mg in a couple days, and then I went down another 50% every 2 weeks, until I was at the tiniest little piece of a film strip suboxin possible. I used the film so I could precisely cut the doses, I went to .25 mg daily, and then after that I went to 0. For 2 months I felt achy, and tired, a little irritable, but no serious withdrawal or cravings. Slow and Steady worked for me.",
  "Overall it took me 5 years to get to my level of addiction and tolerance, so it took me almost 2 years to get to sober, withdrawal is unavoidable but it can be done with minimal suffering, but there will be discomfort, that is unavoidable. It was worth it though, it is worth it. Good Luck to anyone ready for this life changing event, and only partake when you know you are ready."
 ],
 "erowid": {
  "id": "91116",
  "citation": " Zonie. \"End of the Long, Dark Road: experience with Buprenorphine & Naloxone (Suboxone) (ID 91116)\". Erowid.org. May 23, 2011. erowid.org/exp/91116",
  "substance": "Buprenorphine & Naloxone (Suboxone)",
  "views": "7429"
 }
}
