{
 "id": 13618,
 "title": "Fun, Friendly and Functional",
 "date": {
  "submission": "2011-08-10T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Lady Codone",
  "gender": "Female",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Pharms - Propylhexedrine",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "4-Fluoroamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "administration": "",
   "substance": "Poppies - Opium",
   "form": "tea"
  }
 ],
 "report": [
  "Background:  Similar drugs tried include MDMA, methylone, mephedrone, MDPV, propylhexedrine and ephedra.",
  "Set/Setting:  Slightly tired from several weeks of poor sleep.  Full stomach, relaxed.  At home on a rainy afternoon.  No work and no distractions. ",
  "Dose:  Unknown.  Started very small with just a few crystals but ended up taking around 75-125 mg. (estimated) over about 7 hours.  Exact intervals not known.",
  "Method of Ingestion:  Insufflated and oral.",
  "Other Drugs Taken:  Poppy tea (opium).",
  "Activities:  Coloring, watching TV, listening to music, talking with roommate, writing, eating popsicles.",
  "_________________________________________________________________",
  "NOTES DURING THE EXPERIENCE:",
  "This stuff burns pretty badly when snorted.  Smells and tastes like burnt plastic.  Nose and mouth go slightly numb on contact. ",
  "Visual changes are first effects I notice.  Hard to describe. ",
  "Need to poop.  Ah, yes.  Same feeling as MDMA, methylone, mephedrone and MDPV.  Classic stimulant effect.",
  "Some jaw clenching.  Touch feels great! ",
  "Find myself smiling for no good reason.  No real stimulation yet, or at least not the type Im used to.  Been on propylhexedrine for the past few weeks and am used to a tight-veined, adrenaline-rushy feeling.  This is more like pure MDMA.  My body feels light.  Music sounds great.  Vision is still slightly trippy.  Again, hard to describe.  Kind of a halo glow around things along with some slight movement/vibration. ",
  "Peeing every 10-15 minutes.  Annoying, but not unheard of for me. ",
  "Brain feels a little fried by now.  Trying to sing/rap along to music is all but impossible.  I seem to have developed a stutter.  Still no pupil dilation or heart pounding.  Could definitely eat something but gonna hold off. ",
  "Urge to snort more rather than swallow.  I see some habit-forming potential in 4-FA at least for this stim lover.  But then again, I use one of the dirtiest stims (Benzedrex) daily and love it, so I'm a bit biased.",
  "________________________________________________________________",
  "AFTERTHOUGHTS:",
  "Positive:  Overall, I think 4-FA has positive characteristics of several other stims and empathogens I've tried.  The 'lightness' of my body feels just like MDMA; the stimulation is similar to that of mephedrone with the duration of propylhexedrine.  My appetite is pretty dead, but I can still manage to eat without feeling sick. The ride is a lot smoother than short-acting stimulants, which are much more addictive IMO.  Euphoria is mild, which is good in that it allows me to focus and function without that e-tard feeling. ",
  "Negative:  Like MDMA, 4-FA kind of makes my brain feels scattered and foggy (not nearly as severely).  My hands and feet are very cold, but no worse than with caffeine or any other stimulant.  There is a nagging urge to re-dose, but nowhere near as bad as MDPV or mephedrone.  (Snorting is not the best way to avoid addiction, btw.)  There is some 'nervous energy' with this drug, but it's more a compulsion to move than actual anxiety.  I haven't experienced the comedown yet, but am hoping it won't leave me feeling exhausted and depressed like other serotonergic drugs."
 ],
 "erowid": {
  "id": "91119",
  "citation": " Lady Codone. \"Fun, Friendly and Functional: experience with 4-Fluoroamphetamine (ID 91119)\". Erowid.org. Aug 10, 2011. erowid.org/exp/91119",
  "substance": "4-Fluoroamphetamine",
  "views": "11610"
 }
}
