{
 "id": 13616,
 "title": "Research Results This Sucks",
 "date": {
  "submission": "2011-06-01T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Sourpants23",
  "gender": "Male",
  "weight": "175 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "5-MeO-DALT",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:30",
   "amount": "1 ",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "A while back at a techno party, a friend of mine asked me if I would like to try 20mgs of 5-MeO-DALT. He told me it was nice and mellow, and this was a small dose, and it wouldn't be anything too extreme. It was in the wee hours of the morning, probably around 9am, and I had already been playing with chemicals all night (Ketamine, LSD, and MDMA). I tried it, and didn't feel a thing, because I was on the influence of so many other drugs and was super tired.",
  "So, I decided to order a gram of 5-MeO-DALT from a research chemical website on the internet for my own experimentation at a later date.",
  "I received the packet it in the mail, and took a few small unmeasured licks out of the bag during the course of a hard partying weekend, and again; didn't feel a thing.",
  "Fed up with this nonsense, I got off of work early, went home, and decided to get some results.",
  "I've done a lot of drugs, I wasn't scared of a little sketchy white powder. My cheap scale says I did about 60 milligrams, but it's a cheap scale and I rounded down instead of up.",
  "I was in a good mood, well slept, and had a relatively empty stomach. The setting was at my house on a nice sunny day at around 3pm.",
  "I put the powder on my tongue and washed it down with some water, and then took my dogs out for a walk. On my stroll around my neighborhood, I started coming up in about 20 minutes. I was feeling lightheaded, warmer, and my legs were getting a little wobbly. I started getting higher so I walked towards home just to be safe.",
  "At first the come up was a little similar to LSD or MDMA. But I didn't get any visuals or and happy fuzzy feelings. Instead, my inner monologue turned towards a negative direction, and then into total panic. I decided that I should head for my room and lay on my bed and ride it out.",
  "I've had some bad trips on other substances, so I told myself that I'd be okay. My curiosity got the best of me, so I started reading about 5-MeO-DALT experiences on the web, while peaking. I got through the first few sentences of someone describing their overdose and subsequent trip to the hospital; then I decided that was a stupid thing to do while freaking out on drugs, so I closed my laptop and cuddled my dogs for a few moments.",
  "I decided that I had taken way too many drugs before, and they didn't kill me, so this one most likely wouldn't kill me either.  I got myself together, lit a cigarette, and smoked it in a hammock in my yard. I was done freaking out, and I didn't feel so high anymore either. It was about 4:30pm.",
  "I made some phone calls to some people I love, and then walked my dogs again, and by 5:00pm I was pretty much back to normal and feeling much better.",
  "Maybe if I was in a fun environment, like a dance party, or at least with some friends, it could be fun. I'll try it again sometime, maybe 20 milligrams on the hour every hour for four hours.",
  "All in all, this my 5-MeO-DALT trip sucked. The come up wasn't anything to write home about, and can be summed up as disorienting. The peak was more or less a panic attack. My chest got a bit tense, and I was taking heavy breaths. My thoughts were troubled, and I just wanted it to stop. The comedown wasn't bad, maybe a bit confusing.",
  "The same results can be achieved by riding a sketchy carnival ride that might fly to pieces and kill you, but really just scares the shit out of you for a little while and returns you to the ground."
 ],
 "erowid": {
  "id": "91114",
  "citation": " Sourpants23. \"Research Results This Sucks: experience with 5-MeO-DALT (ID 91114)\". Erowid.org. Jun 1, 2011. erowid.org/exp/91114",
  "substance": "5-MeO-DALT",
  "views": "16234"
 }
}
