{
 "title": "Knowing the Truth About Turtles",
 "author": "Don",
 "citation": " Don. \"Knowing the Truth About Turtles: experience with Mushrooms (ID 13643)\". Erowid.org. Jun 10, 2006. erowid.org/exp/13643",
 "substance": "Mushrooms",
 "bodyweight": "180 lb",
 "header": [
  [
   "DOSE:",
   " ",
   "oral",
   "Mushrooms",
   "(ground / crushed)",
   "",
   "500 mg",
   "oral",
   "Vitamin C",
   "(pill / tablet)"
  ]
 ],
 "footer": [
  [
   "2002",
   "13643",
   "Male",
   "",
   "Not Given",
   "Jun 10, 2006",
   "3374",
   " "
  ]
 ],
 "report": "<p>Let me start off by explaining that I am one of those very rare people that reacts very badly to THC, there is no such thing as a good weed high for me, paranoia doesn't describe what weed does to me, I think paranoia is when I become convinced someone in the room is a narc and cops are coming to bust me any second(typical weed paranoid story from friends).</p><p>What happens to me on weed is on a whole other level, more like delusional psychosis. I become convinced that every word from any person/tv show has some kind of horrific double meaning that I cannot figure out, that everything that has ever happened to me had some hidden agenda that I can only see while high on weed. Nothing can bring me back to reality accept facing the wall and sleeping it off. Someone talking in a voice too quiet for me to hear AUTOMATICALLY means they are ploting something against me, I have horrific 'realizations' about the nature of existance itself.</p><p>Its very very bad and I never ever smoke weed anymore because of it.</p><p>I always assumed this was because of the 'mild' disassociative effects of weed, I decided to test this theory by taking mushrooms the first day of my semester spring break. I got 60$ worth, I asked my roommate(who knows all about my weed reaction) that if I start to really freak out would he please turn everything off and go to sleep and I will take some sleeping pills and sleep it off. He agrees.</p><p>I divide the bag in half and grind the mushrooms up, I then wash it down with orange juice and take a chewable 500mg vitamin C tab. All on an empty stomach.</p><p>My source tells me that is enough to where I will be convinced the people in the posters on my wall are talking to me.</p><p>My friend downs the 2nd half of the shrooms, I play computer games and wait VERY nervous that any second now I am going to freak out and wake up the next day in a mental institution in a straight jacket.</p><p>After about 30 minutes I start to feel a little 'off' like I have had 2 or 3 beers, not quite messed up but not 100% normal. My heart is beating very fast, not due to the shrooms I think but just because I am so scared.</p><p>After an hour or so I am really feeling it, colors look much brighter and I feel euphoric, very nice, I start to calm down, I put on some dance music mp3s and use a 3d vis plugin for my mp3 player. The colors swirl together like on weed but much more strongly and I have no bad paranoia clouding the experience and brining me down. I go out to smoke with my roommate, the hallway looks really long and the floor is moving up in down like waves.</p><p>None of this wierds me out at all, it just makes me laugh. The cig smoke looks very trippy, we stare at trees for a while and they look very very cool, I am still not wierded out, and I fine if I really concentrate on something all the effects go away, I feel totally sober. Then I relax and watch more mp3 vis and I am having a blast.</p><p>At this point I am very euphoric, I become talkative and extremely energetic, I have tracers in my vision, no negative thoughts in my head, nothing can touch me. </p><p>I decide to put on a cheesy movie for a while, we put on Teenage Mutuant Ninja Turtles the live action movie. I cannot stop laughing at how stupid it is, I laugh so hard I make no noise and have to lean forward on my desk, I am having a blast. I love this feeling.</p><p>I spend the rest of the night running around campus and being very open and friendly, and drinking orange juice like their is no tommorow, I spent 15$ on orange juice that night alone.</p><p>The sun finally comes up and I walk outside to have a last smoke, the hallway is bathed in yellow light and it looks so beautiful, I am at peice, I feel great, finally a drug I can do and not freak.</p><p>After my smoke I decide to see if I can force a bad trip somehow, I put on a really violent horror movie and listen to death metal mp3s, I still feel fine just slightly less euphoric due to the more serious subject matter.</p><p>All in all it was great, I had a lot of fun, and did mushrooms every night that week. I had no hangover the next days after that, just a slight euphoric feeling still.</p><p>I love shrooms and plan on doing them whenever possible.</p><p>Oh yeah BTW, the ONLY negative side effect is that I felt really dirty when the shrooms hit, I had taken a shower 6 hours before my trip but I could feel the oil on my hands and it grossed me out, I took a shower and changed into all clean clothes and felt way better.</p>"
}
