{
 "title": "I Felt Magnificent",
 "author": "livetoride007",
 "citation": " livetoride007. \"I Felt Magnificent: experience with MDMA & Mushrooms (ID 13658)\". Erowid.org. Mar 3, 2005. erowid.org/exp/13658",
 "substance": "MDMA & Mushrooms",
 "bodyweight": "135 lb",
 "report": [
  "<p>I had recently aquired 6 grams of highly potent mushrooms but had planned on saving them to trip with 2 of my friends, I also aquired an mdma pure cap from a friend which I had planned to eat the night of my experience. I had no plans that friday night 'as usual' so I decided it would be a fun night to roll. I waited until my parents went to their room and took my capsule at 10:00pm. After 45 minutes of eating the cap, I wasn't feeling any come up effects and had no pupil dilation, so I thought the cap may be a fake and decided to eat some mushrooms. I ate 2 grams of shrooms and turned on some music to chill with.",
  "About 45 minutes later, I was looking at my ceiling light and noticed intense rippling coming off the light and thought, 'well at least my shroom trip will be fun.' All of a sudden I got a huge body rush and stood up. BOOM! The mdma which I thought was fake hit me. I was listening to string cheese incident and started running around in circles to the song 'black clouds.' Then I picked up the phone and called a friend to tell her how my trip was going. As I talked on the phone, my visuals began to increase, I saw what looked like the shape of big goldfish swimming across my ceiling, when I looked out my window, the sky appeared as an absolutely beutiful orange psychedelic painting. I said good bye to my friend and then went in my bathroom to look in my mirror. As I looked directly into my eyes in the mirror, my surrounding face began to look like it was melting and aging. I saw what I would look like when I reached my 20's then 50's then 70's, I kept looking older and older until I stopped aging and my skin started to deteriorate down to the bone. This may have scared me if i was just shrooming but the mdma kept ALL bad thoughts away. I felt magnificent!!! Everything felt absolutely PERFECT!!! 'I consider taking mdma by yourself equivalent to having sex with yourself.' Then I thought 'what better than to be having sex with yourself in the shower.'",
  "So I turned on the water and got in. It was amazing washing my hair while at the same time checking out insane closed eye visuals. After my shower, I grabbed my guitar from my room and went outside to sit on our deck by the creek and play. I felt total comfort and serenity while listening to the sounds of my acoustic with frogs croaking and crickets chirping in the background. After playing guitar, it felt as though my soul had been cleansed. I went back inside and listened to music while watching the visuals on my wall. All of a sudden, the euphoria of the mdma stopped. As soon as that happened, I wanted to stop shroomin so I could go to sleep but that was not an option. Even though I was still trippin hard on the shrooms, I felt level headed since the mdma effect was over. So while I was still tripping, I evaluated my experience, something I always do when a trip has ended. As far as hippyflipping, it is an AMAZING experience but the next time I do it I'm going to wait until the shrooms kick in before taking mdma so that I'm rolling more during the peak and come down off the e while I'm coming down off the shrooms.</p>"
 ],
 "year": "2002",
 "id": "13658",
 "gender": "Male",
 "views": "7520",
 "dose": [
  {
   "time": "0",
   "amount": "1 capsl",
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "0",
   "amount": " T+ 0:45",
   "administration": "2.0 g",
   "substance": "oral"
  }
 ],
 "submissionDate": "2005-03-03T08:00:00.000Z"
}
