{
 "id": 13665,
 "title": "My Future and the K-Hole",
 "date": {
  "submission": "2012-10-23T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Dark Hero Akutare",
  "gender": "Male",
  "weight": 102
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "650",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Ketamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "I am 30 years old, white, moderate smoker (love my cloves), who is a student in college, getting my life back on track.  Throughout my life I've done LSD, weed, DXM, peyote, MDMA, spent a horrific 6 months addicted to crystal meth, and my favorite, ketamine.",
  "I first used ketamine back in 2008.  A friend of mine (who we will call Q) wanted to take what he called a 'trip' on ketamine, and wanted somebody else to join him.  We had a sober sitter (EMT friend, we'll call him R) all setup, so I figured 'Hey, I'll do it.  Why not, try something new.'  Little did I know at that time.  I met Q at his house, and R came by shortly after.  My friend prepared what he thought was a good starter dose (125mg) for me, and an equal dose for him.  Having been no stranger to various drugs, I thought it was suitable.  Needless to say, it was about to take me into myself in a way I'd never managed before.  But that's an experience better written about later.  This is about my trip into the innermost reaches of myself.  My trip into the deepest K-hole I had ever gone into.",
  "Since the first time, I've learned the doses, and how much to take.  I generally take 40-75mg on average, every 2-3 days, to enjoy the sensations.  I'm always careful to not take heavy doses when I have to work early the next day.",
  "Also, Erowid recommends, 'Know your Body, Know your Mind, Know your Substance, Know your Source.'  This is all too true.  Knowing your body and how it reacts is important.  Knowing ones mind is harder at times, but still doable, but you have to know what thoughts are outside of your normal ones, which can be an indication of something wrong.  Knowing the substance is somewhat easier, as the internet makes it possible to perform research on a scale that was unheard of 20 years ago.",
  "Also, some people may look at the doses I provide, and go, 'Those are high/not high enough.'  I am 200-220 lbs, and I've taken enough doses of various items I know how they affect my body.",
  "My roommate serves as my sober sitter, we usually take turns, one time he'll trip on something as I watch him (usually LSD, his drug of choice), and the next I'll trip on something as he watches me(as mentioned above, usually ketamine).  Now, in my experiments with ketamine, I've taken a multitude of doses, but I had never taken a huge massive dose, but my heavier doses have usually been enough to take me to the K-hole.  But this time, I wanted to plunge into the K-hole, to experience what I knew I would find there deeper than I ever had before",
  "My roommate and I have a room, we call it the 'trip room'.  It's colored in cheerful, non-threatening colors, soft lighting throughout the entire room (to prevent shadows appearing that might cause a freak out during a trip) very soft couches and beanbags, and has an awesome music system.  Now, normally, I listen to soothing music, usually light classical as I trip.  But this time, I put on a self-made trance music CD, with the tracks looped into a 45 minute long track.  Setting that into the player, and prepared in every other way, I took my dose of 650mg, the highest I had ever taken previously was 400mg.  Mixed into that (along with the obligatory water to dissolve the powder), was Florida's Natural OJ, non-pulp.  I took my dose, and my friend recorded it, I'm providing my recollections with the tape he shot (we tape our trips, one at a time, to review in case of a bad trip, and try to figure out what might have caused it).",
  "7:00p - 650mg ketamine taken orally",
  "About 6 to 10 minutes later, I started to feel light, I felt my hands start to become unresponsive, along with my feet, as they always did.  I found myself slowly detaching from reality.  I closed my eyes to focus on the aspects of my trip.  I knew the feeling of paranoia and guilt would hit for a few moments, and then it would pass, so I blocked it out, willing myself to go deeper.  I've found that by closing my eyes, and focusing on what was coming, I would be ready and willing for it, and it seemed to help it come on stronger.",
  "As I felt myself spiralling deeper and deeper, my heart started pounding, as it normally did when I dosed, going 'Oh shit, did I make a mistake?  Did I take too much this time?  Will I get back?'  These thoughts I've had every time I do ketamine, and I've learned to ignore them.  Granted, one of these times it might be the end of me, but being meticulous about my doses, the source, myself, and environment I take them in, the risk is slim.",
  "The feelings of panic, paranoia, and guilt slipped away, and I felt my mind disconnect from my body completely.  As I fell, I tried to move my arms and legs, but my body would not respond, and I felt myself falling deeper and deeper.  I passed through a ring of darkness and emerged into a room of pure white.  No walls, no floor, no substance, it just existed.  I was deeper inside my mind than I had ever been before.  Looking around, I saw doors.  Row upon row of doors, inside my mind. In previous trips to the K-hole, I've been here, but never with so many doors.",
  "Walking down the rows of doors, I see most are regular, standard light-weight steel doors like you'd find in an office building, most of them painted light blue.  But then, I came to a door that was blacker than night, and I backed away from it, knowing what lay inside there.  I had come to the K-hole for a reason.  I opened that door, and it was as if I saw a line of my life.  There were divergences along it, but it always returned to the same path.  Then, I saw a branching, coming up ahead, and it would take me one way or another, and that path would not ever go back to the other.  One, led to great possibilities, but required more work.  The other, would be an easy life, before it spiralled into the depths of darkest night. ",
  "I knew there was a choice coming up in my life, and I had to choose.  I wasn't sure where, but I knew enough of myself to realize I would have to make that choice.  Once again, something I wasn't fully aware of was brought to my consciousness, something I have always enjoyed coming to the K-hole for.  But this time, after I opened that door, I had no more control, I saw visions of past events, and the feelings associated with them returned.  Most were benign, but some were really uplifting, and some were really depressing.  Finally, I felt like I was swimming back to the surface of a really viscous lake.  It was harder and harder to try to re-connect to my body this time, but I kept trying, and finally I made it.  I started to feel my body around me, and when I opened my eyes, I saw the room, my friend watching me, and I slowly, ever so slowly started to feel my body reunite.  My friend, having seen many of these episodes, didn't try to carry on a conversation, knowing I was coming out of it.  Looking at the clock, it was 8:25p.  I had been there for 40+ minutes.  It felt like eternity.  I just say there, spacing out, and finally, felt the urge to talk to my friend.  Looking over at him, I asked, 'How long, man?'  He said, 'It's about 9:10.'  About 15-20 minutes passed, and I got to my feet, with help, and said, 'I'm out now, let's go to the front room.'",
  "We went into the front room, put on Cartoon Network, and I just laid there in the chair, and eventually drifted off into sleep, as I normally do soon after a trip.  The next thing I know, my cell phone alarm was going off, I looked at the clock and it was 10am.  Being off that day, I leisurely got out of the chair, took my shower, and sat down for my breakfast/lunch, feeling just fine.  I felt refreshed, and confident about my future.  Once again, I had gone into the K-hole, and returned semi-triumphantly.  I felt a little fuzzy headed, but that wore off by mid afternoon, and I was myself by that evening."
 ],
 "erowid": {
  "id": "91418",
  "citation": " Dark Hero Akutare. \"My Future and the K-Hole: experience with Ketamine (ID 91418)\". Erowid.org. Oct 23, 2012. erowid.org/exp/91418",
  "substance": "Ketamine",
  "views": "9367"
 }
}
