{
 "title": "Warm Fuzzy Feeling Encompassing My Body",
 "author": "Odd John",
 "citation": " Odd John. \"Warm Fuzzy Feeling Encompassing My Body: experience with AMT, Alcohol, and Cannabis (ID 13668)\". Erowid.org. Sep 2, 2002. erowid.org/exp/13668",
 "substance": "AMT, Alcohol, and Cannabis",
 "bodyweight": "150 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "25 mg",
   "oral",
   "AMT",
   "(powder / crystals)",
   " T+ 9:00",
   " ",
   "oral",
   "Alcohol - Hard",
   "(liquid)",
   "",
   " ",
   "smoked",
   "Cannabis",
   "(plant material)"
  ]
 ],
 "report": "<p>I've tried AMT (alphamethyltryptamine) about 10 times in the past but always with higher doses.  I noticed that at 50mg the negative effects, 24 hour insomnia, unbearable body load, heavy perspiration, and uncomfortable nausea, made it not worth it to even take the drug.  I figured maybe half the dose would give almost the same positive effects without the extreme negatives.</p><p>5pm: poured out a capsule of 25mg in water and drank solution. I also swallowed the gelcap in order to intake the leftover powder in the capsule.</p><p>5:45: began feeling a warm fuzzy feeling encompassing my body but mainly as sweat beginning at my forehead.</p><p>7pm:  still am not peaking however the visuals have just begin to appear.  Very mild but nonetheless visuals.</p><p>8pm:  I think I have hit the peak:  laughter comes very easy, peoples' faces are very distored and my face looks as though I am breaking out, however, my face always looks like that whenever I trip.</p><p>The experience was mild, I can still talk to my parents, however I have to watch what I say because the truth seems to slip out a lot easier.</p><p>2am:  After drinking half a fifth of Soco and smoking some herb I find it very easy to fall asleep.</p><p>7am:  Wake up the next morning feeling hung over from the alcohol rather than the AMT.... I think that is a good thing.</p><p>The point of my experience was just to see if a low dose of AMT was worth ingesting.  It definately was.  I had a 7 hour trip and was able to fall asleep, not act too stupid, and did not experience any come down whatsoever.  Therefore, I recommend for first time users to start at a low dose, ie. 20-25 mg orally ingested and seeing what it does, then moving up depending on how hard you want to trip and how much negative effects you can stand.</p>",
 "year": "2002",
 "id": "13668",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-09-02T07:00:00.000Z",
 "views": "9082",
 "dose": [
  {
   "time": "DOSE: T+ 0:00",
   "amount": "25 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(powder / crystals)"
  }
 ]
}
