{
 "id": 13672,
 "title": "Eternal Hell",
 "date": {
  "submission": "2011-06-10T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Leaf",
  "gender": "Male",
  "weight": 88
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12.5"
   },
   "administration": "IM",
   "substance": "Risperidone",
   "form": "liquid"
  }
 ],
 "report": [
  "It has been 7 months since my one injection of risparadone consta. 12.5mls",
  "The first 2 weeks after the injection seemed like utter doom. There was not a dopamine receptor in my brain that was functioning properly. The drug seemed to be sending waves and waves of medication and what seemed like an electrical current towards my head from my left gluteal muscle where they injected it. Soon after my testicles began to shrink and soften up. At the 4th week after the injection I was outside my home every day screaming because it was cooking me. I would walk all around the city I lived in through the woods back and fourth from church begging for the release from this horrible curse. I decided to go back to college but that was a mistake because after about 3 months of people hearing me yelling and punching walls my landlord finally kicked me out and I had to move back in with my grandmother. Once 6 months had elapsed since the injection I knew it was time to see a psychiatrist. I told him what happened and after a little convincing he signed me up for an MRI of the muscle with the implant inside.",
  "The worst times on this drug was when I realize it had spayed me. The constant feeling of current running through my body sucked but the worst was what it did to my mind and testicles. I drove 5 hrs away and hiked up to a 500ft cliff in the appalachians in order to end my life. The constant torment and sexually diminishing and mind dissolving properties of the implanted polymer/risparadone complex was the only reason I'd ever had to feel suicidal in my life. I decided that that would be the easy way out and if others could live with the effects of this medication that I must also do the same.",
  "It has now been 7 months...i feel the injection site releasing what feels like electrical currents though my body all day and all night still. My testicles seem ruined to me. I will get the MRI and then if they can locate the polymer I will get surgery and remove this hell on earth.",
  "i wouldnt give this medication to goats or pigs or even worms this is poison."
 ],
 "erowid": {
  "id": "91447",
  "citation": " Leaf. \"Eternal Hell: experience with Risperidone (Consta) (ID 91447)\". Erowid.org. Jun 10, 2011. erowid.org/exp/91447",
  "substance": "Risperidone (Consta)",
  "views": "4925"
 }
}
