{
 "id": 13678,
 "title": "Rhythmic Meditation",
 "date": {
  "submission": "2001-11-30T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "weev",
  "gender": "Male",
  "weight": 56
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 mg",
   "administration": "oral",
   "substance": "Caffeine",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I ingested 800mg of caffeine at a local club at around midnight to 12:30. I had not done caffeine in over 9 months, and was anxious to see the effects of the drug's return at a new level of intensity. During the onset of the caffeine, I felt mentally aware and calm, yet physically hyper. I originally went to participate in rigorous physical exercise (moshing) but did not feel like it after ingesting the caffeine. The whole time, my hands and feet felt numb and were very cold, and my torso and head felt extremely warm. I had occasional waves of nausea. At 1:40, my friend picked me up and started on the drive home, during which I got horrible motion sickness.",
  "I got home at 2:15, and drank a couple glasses of water. At 3:20, the caffeine really started to hit hard. I started urinating frequently, then my heart rate was racing, and my temperature felt extremely high. My heart beat faster and harder, and was starting to be accompanied by chest pains. I started to hyperventilate, and purposefully supressed my breathing in order to slow down my pulse.",
  "After a little bit, I began to feel oxygen deprived and lightheaded, so I began letting myself breathe normally again, only to have my pulse rate shoot back up to a blazing 122 beats per minute, thumping very audibly in my chest. After a while,  I began to start to achieve a balance in my breathing. I would walk through a programmed routine of resting and walking around, breathing hard and softly, wrapping myself in blankets and walking outside in the cold of the night - a sort of foreign meditative state.",
  "The waves of racing pulse and constant urination got stronger and stronger until around 6:45, when they peaked and began to rapidly get weaker. After that, I was plagued by muscle hyperactivity and shortness of breath until 2:15 that day. I never went to sleep. I did, however, experience a great mental awareness that I never achieved using smaller doses of caffeine.",
  "High doses of caffeine are extremely intense and can be too strong for a lot of people.  My girlfriend took the same dose that night and ended up putting herself in the hospital for an i.v. and sedative. But for those who are willing to take the negative sides of this dosage level, I have found an enjoyable reward in this in the form of mental awareness and a feeling of achievement for conquering the 'sickness' that comes along with it."
 ],
 "erowid": {
  "id": "9149",
  "citation": " weev. \"Rhythmic Meditation: experience with Caffeine (ID 9149)\". Erowid.org. Nov 30, 2001. erowid.org/exp/9149",
  "substance": "Caffeine",
  "views": "19537"
 }
}
