{
 "id": 13696,
 "title": "Talking My Face Off",
 "date": {
  "submission": "2011-07-21T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "scott",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Napthylpyrovalerone",
   "form": "liquid"
  }
 ],
 "report": [
  "I Have experience with lsd, psilocybin, ecstasy, mephedrone, benzo's, opiates and a few others. Found this to be the most potent stimulant I have tried, but still a worthwhile drug. I consumed 50 mg by swallowing and had effects lasting for ten hours.",
  "00:00 received it in the mail, mixed 50 milligrams in water and swallowed.",
  "+45 Begin to feel the full effects but still coming up. No longer tired, walking around and talking",
  "+2 Talking to strangers, telling all my friends how great they are, love meeting new people and striking up random conversations. slight euphoria but more of a stimulant",
  "04:00 Moving around constantly, drinking lots of water due to dry mouth, want to do something exciting or dangerous, feels like i am still coming up and wonder how high I am going to get.",
  "06:00 still feel the effects and still talking my face off.",
  "09:00 now just feel wired and unable to sleep. cant really get myself to do anything, but fall asleep in the next hour after laying down",
  "Overall I found this to be a very fun compound and made for a very fun night with not a lot even going on. I was very focused in all my conversations and could even make very intelligent discussions. I have never felt the need to talk or make new friends like this before and even felt like I was capable of anything. If used under small dosages with no redose this can be fun, even with a little bit of a prolonged comedown. Also, I had a lot of jaw grinding and loss of appetite."
 ],
 "erowid": {
  "id": "91617",
  "citation": " scott. \"Talking My Face Off: experience with Naphyrone (ID 91617)\". Erowid.org. Jul 21, 2011. erowid.org/exp/91617",
  "substance": "Naphyrone",
  "views": "6868"
 }
}
