{
 "id": 13690,
 "title": "Nothing Really",
 "date": {
  "submission": "2011-08-11T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "belostenec",
  "gender": "Male",
  "weight": 76
 },
 "dose": [
  {
   "time": "0",
   "amount": "6.5 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "tea"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Tea"
  }
 ],
 "report": [
  "Bought dried kratom Premium cut dried leaf from a well-reputed internet supplier.",
  "I brewed the tea late in the evening, last eaten some 2 or 3 hours earlier. I took 3 teaspoonfuls of the herb, poured 2,5 dcl of cold water over it, brought the tea to boil and then brewed on moderate temperature, in a closed kettle, for 15 mins. Strained the (very dark) liquid through a metal (was that the problem?) strainer, then poured another dcl of water over the leaves and left this second batch to simmer for 15 mins more. Then I strained it, mixed the two batches and reduced the tea in the kettle to some 2 dcl or less of dark infusion. I added Earl Grey black tea and a tablespoonful of white sugar. The resulting mixture tasted just fine, quite heavy, but spicy and seemed a bit sirupy.",
  "I drank it slowly in a darkened room and waited, sitting and lying. Good music was on. No effects came, not even after 2 hours. Then I decided to go to sleep - I had some difficulty falling asleep, in fact. I had perhaps a slight feeling of time warp, as though much more time had passed than the clock showed, but this could be easily attributed to the ungodly hour (4:30 in the morning, dawn approaching). Having fallen asleep, I slept ok, dreamt nothing of importance and woke up to feel as normal as one can after going to bed at the hour.",
  "Conclusion: I'll increase the dose by at least 100% and see what happens. Either it will work, or another expensive herb (after kanna last week) has failed me. I might have underestimated the neutralising potential of my endocrine or nervous systems... Or I might well be forced to conclude that legal 'drugs' are legal for a reason."
 ],
 "erowid": {
  "id": "91572",
  "citation": " belostenec. \"Nothing Really: experience with Kratom & Tea (ID 91572)\". Erowid.org. Aug 11, 2011. erowid.org/exp/91572",
  "substance": "Kratom & Tea",
  "views": "3267"
 }
}
