{
 "id": 13693,
 "title": "Visual Distortions Similar to Other Dissociatives",
 "date": {
  "submission": "2011-08-23T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "hyperobjects",
  "gender": "Male",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "4-MeO-PCP",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>The universe sent me a free sample of 200 mgs 4-meo-PCP (methoxydine) today. This Methoxydine Powdah is white amorphous crystal shards.",
  "About me:",
  "23 year old male, 58, 150 lbs.",
  "Fairly seasoned psychonaut here, Psychedelic/RC Background:",
  "DOB, DOC, 2c-B, 2c-E, 2c-I, DMT, 5-meo-DMT, 5-meo-DiPT, 5-Meo-Mipt, Bufotenin(5-HO-DMT) , 4-aco-DIPT, DiPT, Ketamine, Methoxetamine, MDA, MDMA, MDAI, LSD, Mushrooms (Amanitas and Psilocybe), Peyote",
  "1st Attempt:",
  "Location: my apartment, watching Shamans of the Blind Country.",
  "100mgs insufflated.",
  "12:45AM 50mgs up each nostril. ^_^",
  "12:47: Slight pain, cup of grapefruit juices to help with anticipated drip.",
  "12:58 First flush of effects, the drip is gross. Yay, juice!",
  "1:00 Turning off this movie. Too much blood sacrifice. Lets see whats on Netflix.",
  "1:02 oliss effects, timee slowinggg downnn.",
  "1:05 Banana + LOTR time.",
  "1:36 Snorting not the way to go with this substance, blowing this shit out of my nose and going to bed.",
  "Retrospective: even though I crushed up the 4-meo-PCP as much as I could, snorting it still hurt like a fatherfucker. Couple that with disturbing media and my first experience was pretty much a bust.",
  "2nd attempt (a week later):",
  "Location: my apartment again, interneting.",
  "33mgs up each the nose every 10 mins.",
  "Much less painful way if you are going to snort it, although most TRs Ive read recommend plugging it, maybe next time. 0_0",
  "Spent most of this experience online chatting with a friend. Dont have time stamped notes from the experience, but I have to say this was very enjoyable The head/body-space was immersive and conducive to creative associations. Not really visuals to speak of, but visual distortions similar to other dissociatives. At this level I felt slightly dissociated and would definitely explore again at this level, would also like to explore at higher doses (220+ mgs) to see what the mind shattering Trip Reports on this one are about. The total duration of the effects including the afterglow lasted about 24 hours, although the main effects lasted about 8 hours. I spent the whole next day in bed watching netflix and just relaxing, so Its probs best not to explore this one if you dont have the next day to recuperate.",
  "Snippet of something I wrote on it:",
  "The queer community has had enough stories of sad and tragic endings. We need a story of successful dreaming that defies the tacky gay happy endings --which are just cheap analogs of heterosexual pipedreams (ie. of monogamy, *forever*) and a bourgeois complacency/march towards normalization.",
  "Comparisons of Methoxydine to Methoxetamine and Ketamine:",
  "The effects of 4-meo-PCP at this range are quite different than Methoxetamine, closer to Ketamine, although there's a more pronounced euphoria (I suspect this may be due to the dopamine output) and more motor coordination than what I would have with Ketamine at this dosage.",
  "I like Methoxetamine for parties and it seems to be conducive to some deep space exploration. Although I haven't explored Methoxydine at the higher dose range yet, it seems even more promising than MXE at higher levels for those interested in more abstract experiences.",
  "I love how creative and compelled to write I feel on 4-meo-pcp at low doses. I feel very concise and articulate, which isn't quite the case with MXE, but with MXE I still have the fine motor skills in tact to be able to verbally communicate my ideas with friends, something I wouldn't be able to do whilst on Ketamine.",
  "Downside to MXE: I generally have a headache/hangover the next day; although, this is only true if I go to bed immediately after I come down. If I do MXE in the day, and do things after I come down, and then go to sleep later on in the evening, no hangover.",
  "Downside to 4-meo-PCP: even exploring it at 100mgs you feel it well into the next day, negative ideation similar to Ketamine the day after.",
  "Upside to MXE: Cheaper to get than K, the scary/violent-bits of K are removed.",
  "Upside to Methoxydine: I think this would be very conducive to a having a crazy art making weekend at lower doses, and higher dose trip reports data show some profound dissociative ego shattering effects.",
  "4-meo-PCP might also be suited to working in visual mediums and I rather enjoy DJing and creating audio mashups while twisted on Methoxetamine. I also use MXE when double-checking my HW, or practicing writing Chinese Characters. I would be too distracted by my own thoughts to focus on these tasks on 4-meo-PCP I feel.</p>"
 ],
 "erowid": {
  "id": "91604",
  "citation": " hyperobjects. \"Visual Distortions Similar to Other Dissociatives: experience with 4-MeO-PCP  (ID 91604)\". Erowid.org. Aug 23, 2011. erowid.org/exp/91604",
  "substance": "4-MeO-PCP ",
  "views": "9335"
 }
}
