{
 "title": "Very Pleasant Mellowness",
 "author": "Dougie",
 "citation": " Dougie. \"Very Pleasant Mellowness: experience with Alprazolam  & Alcohol (ID 13703)\". Erowid.org. May 23, 2002. erowid.org/exp/13703",
 "substance": "Alprazolam  & Alcohol",
 "bodyweight": "200 lb",
 "header": [
  [
   "DOSE:",
   "1 tablet",
   "oral",
   "Pharms - Alprazolam",
   "(pill / tablet)",
   "",
   "8 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)"
  ]
 ],
 "report": "<p>\nOne experience worth of xanax & alcohol leads me to believe I'd like more. Was sitting around with my girlfriend and her boss, who suffers from sleeping problems.  It was a very pleasant evening, lots of very interesting and stimulating conversation, with a strong intellectual undercurrent.  It was the first time I'd actually spent time with her boss, and he and I ended up with so many similiar experiences (he's 15 years older)  that he half-adopted me as his younger brother (we also share the same first name!).</p><p>The conversation steered around to his divorce (which has recently become final) and the biggest trouble that was causing him was the ugly custody situation going on, and how it was causing him a lot of trouble sleeping at nights (which is how he came by the Xanax.)  He offered me one, and as all three of us are fairly experienced and responsible drug users, I felt comfortable taking it for the first time despite the 6 beers already.</p><p>About 20 minutes after taking the drug, I felt a slight tingling in my legs and feet, and a very warm relaxed feeling creeping over my whole body.  The high it provided was similiar to coke & alcohol's whole-body numb/high feeling of relaxed pleasantness. </p><p>After an hour, I was very off my face and loving it.  I knew I was fairly well into the effects, as my speech felt slurred (my girlfriend later told me I slurred a very small amount, but not enough that she thought a person less familiar with me would have noticed.)  My entire body was into a nice and pleasant humming buzz, from my feet to my head, and everything felt warm and very comfortable.  We continued discussing things for another hour or two, at which point we all headed off to bed (we had been planning on staying at his house, as it was a 70 mile drive home).</p><p>I was fairly well gone by this point, and my girlfriend had to steer me into bed (but she also mentioned that I wasn't sloppy, just half-asleep on my feet.)  I slept like a freaking dead log, and woke up a mere 7 hours later feeling like a brand new man. No headache, no hangover at all (which surprised me, considering how OTC sleep assistance leaves one drugged-feeling in the morning), and I was set to be outside in the bright SoCal sun half an hour after getting up.</p><p>I will definitely be pleased to get my hands on Xanax again, it was a very pleasant evening.</p>",
 "year": "2002",
 "id": "13703",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-23T07:00:00.000Z",
 "views": "48565"
}
