{
 "title": "My Drug of Choice",
 "author": "The Housefly",
 "citation": " The Housefly. \"My Drug of Choice: experience with Oxycodone (Oxycontin) (ID 13707)\". Erowid.org. Jun 14, 2002. erowid.org/exp/13707",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "140 lb",
 "header": [
  "DOSE:",
  "40 mg",
  "oral",
  "Pharms - Oxycodone",
  "(powder / crystals)"
 ],
 "report": "<p>[Erowid Warning: Because opiate use can lead to significant tolerance (requiring higher doses for the same effects), the dose used by a first time user is significantly smaller than that used by a regular user.  It can be extremely dangerous to choose ones dose on the basis of the amount taken by someone else.  Overdoses of opiates can be fatal.]</p><p>Oxycontin is definately my drug of choice. Not always because it is my choice. The drug in itself gives me the most euphoric high I've ever felt. I have had alot of experience with other substances and none compare to OC. I never take more than one 40 mg pill crushed and taken orally. The effects usually hit at around 45 minutes. This is becuase I have a high tolerance for opiates.</p><p>The euphoric high will last until I pass out. Smoking weed while on OC intensifies the opiate 'buzz' for me. I won't take OC without weed.</p><p>NEGATIVE</p><p>OC's have a very high addiction level. Take it from someone who knows. I sit and wait for my friend to get off work everyday to get some more. My tolerance went up very fast. I began by only eating 20 mg. By the end of the month I was taking 40mg, and wanting more. I know better though and restrict myself to 40mg. After several days w/o OC I begin to 'fiend out' and can't sleep. My appetite will go and come back in the strangest hours. I get stomach pains and cramps. Sudden bursts of energy that almost feel like anxiety. Also at any given time while on OC I begin to feel sick and even vomit.</p><p>POSITIVE</p><p>The euphoric high. The ability to be comfortable anywhere. A great sense of well being. I feel like I own the world and nothing can go wrong. At the same time that I have this unbelievable body buzz, I can still maintain balance, maybe a little swaying. Advantages are that I'm not as incoherent as I may be on other substances, but at the same time I'm wasted. Social skills are heightened. I can fall asleep when I want. While I'm on the substance I can eat, unlike the on other substances.</p><p>Note that all this is my personal experience with OC. You may hate it. Remember everyone reacts differently to everything.</p>",
 "year": "2001",
 "id": "13707",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-06-14T07:00:00.000Z",
 "views": "67217",
 "dose": {}
}
