{
 "id": 13704,
 "title": "Morning Wouldn't Come",
 "date": {
  "submission": "2012-01-23T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TranscendEmotion",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": "16 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "4 mg",
   "administration": "oral",
   "substance": "2C-E",
   "form": "(powder / crystals)"
  },
  {
   "time": "2:00",
   "amount": "5 mg",
   "administration": "oral",
   "substance": "4-AcO-DMT",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Well, I'm going to preface this with a little bit of information. I began my interest in psychedelics around two years ago and never quite lost interest yet I had only tried Hawaiian Baby Woodrose seeds and found the trip gratifying but not extraordinary.",
  "I went online recently and found a vendor offering 99%+ pure 2C-E and I jumped at the chance of trying it. I bought 1000 mg, which is quite a bit more than what I'd probably ever need for just myself. Either way, it came in the mail soon after (I was quite pleased that the vendor had a tracking number.) I was eager to try it but I waited a couple of days. Then when the time felt right, I dug out the bag of this wondrous chemical and weighed out 16mg of it. I put it in a gelatin capsule and swallowed it.",
  "2 hours later nothing was happening. I had went out with a friend within this time and had acquired 5mg of 4-Aco-DMT as well. Since the original dose I had taken hadn't kicked in, I took 4 more mg and I also took the 4-Aco-DMT with it. Now I'm at 20 mg. of 2C-E and 5 of 4-Aco-DMT. Little did I know this would become a crazy, crazy night. I remember having checked online for info on 2C-E and all of the ones I read had capped the dose at around the 15-18 mg mark. I was quite a bit over that and there was no turning back now. I laid down and put on the Lateralus album by Tool. As I listen to 'The Grudge' the lead singer is saying",
  "'Defining, confining, sinking deeper. Controlling, defining, and we're sinking deeper.'",
  "I know at this point something is coming on because my head feels like it is gaining and losing space. It's hard to explain but it felt as though there was pressure pushing on my head yet it was expanding. Soon enough the pressure got stronger, so intense at one point that I got a headache. This was all I felt as the lead singer continued and said:",
  "'Let it go'",
  "The next song then came on and it was 'The Patient.' At this time I was wondering if anything else was to happen. Not sure as of yet and concerned I kept listening to the Tool album. The lead singer then continuously repeated:",
  "'Be Patient'",
  "towards the end of the song. I did. I actually fell asleep. When I woke up, the songs I woke up to were Parabola and Schism and those who know Tool, know that these are some intense trippy songs. By now the effects kicked in fully. I looked towards my wall and saw geometric shapes in the metallic spatter paint design. They looked as though they were 3 dimensional octagons or a shape similar with many sides. They all spun together in sync every time I moved my eyes. When I didn't move my eyes they spun, but as soon as I moved my eyes, they'd go faster. This was odd, very intense. I then turned of my music.",
  "I was laughing because I was excited. A little later the tables turned. I became tired and the walls were making me sick with the movement. Throughout the night I felt like vomiting but I never did. I eventually went and shut the lights off and tried to go to sleep but that attempt failed. I closed my eyes and it was as if strobe lights were going off in my head. I opened my eyes in the dark realizing I can feel the trip but I can't see it. I then saw a clock in my room, it is bronze and had a reflection of light shining upon it. That reflection began to spread across my room in a vine pattern. So intense, so tired. I turned the lights back on and watched the wall, then quit knowing I'd be sick if I continued. My bed sheets were flowing like ocean waves and my wall became a kaleidoscope.",
  "Another thing I noticed was my hearing, I could hear everything though I don't know if it all existed. I heard a sound like scraping or a computer loading and couldn't explain that one. Everytime I moved in my bed though it sounded like Santa's Sleighbells, at least thats how I described it in my notes.The patterns were intense, the sounds amplified, I couldn't sleep, everything good was going downhill but I still felt alright. I knew it would end in.... 8 hours..... I had to go to the bathroom so I got up, I stood at my door for what seemed like eternity because my room would go through sudden color changes and my door had turned red and looked like swirling blood as I looked at it. Weird.",
  "I finally got to the bathroom and took a leak. I looked down... I shouldn't have. Everything was normal except for the hair on my legs and my pubic hair. The hair on my legs looked flat, I paid little attention to this. My pubic hair looked like a grayish blue color and resembled spiderwebs, thick spiderwebs. It was frightening and not fun to look at. I went back to my room and laid back down. Throughout the night, multiple times I tried to sleep and failed. I didn't sleep that night at all. I turned on my webcam at one point and just recorded myself watching my face warp and distort. I thought this was funny so I was laughing hysterically every once in awhile. Then through the webcam I saw the walls spinning and I began feeling sick again. I couldn't watch it. The webcam showed I was disturbed. I looked at my face again and laughed.",
  "Later I looked at my legs again and the flat blueish swirling hair patterns and I noticed that every time I moved my eyes, the 2 dimensional bluish swirling hair became 3 dimensional actual hair. It looked as though it was growing before my eyes. I was still tired and the trip still had a couple of hours. I wasn't watching a clock though. That would make me more tired. I looked at my arms at one point and they looked as though they were decaying. It was interesting and disturbing but it didn't bother me much. For the whole night, the walls spun, the door swirled, the sheets waved, my hair 'grew,' my face warped, mental lights strobed, and reflections vined. It was intense but I learned something. Intense trips are enjoyable if you let them be, also I learned I'm definitely not ready for anything stronger, Acid or DMT. I'm glad my first trip was not with those substances."
 ],
 "erowid": {
  "id": "91694",
  "citation": " TranscendEmotion. \"Morning Wouldn't Come: experience with 2C-E & 4-AcO-DMT (ID 91694)\". Erowid.org. Jan 23, 2012. erowid.org/exp/91694",
  "substance": "2C-E & 4-AcO-DMT",
  "views": "3627"
 }
}
