{
 "id": 13714,
 "title": "10 Years On It",
 "date": {
  "submission": "2011-08-29T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Notme",
  "gender": "Female",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Tramadol",
   "form": "daily"
  }
 ],
 "report": [
  "I started taking Tramadol after my doctor decided it would be a good alternative to Vicoden for my neck and peripheral nerve pain in my left arm. Apparently he thought that the Vicoden was too addictive and I would need long term pain management.",
  "I had trouble taking the Tramadol at first because it upset my stomach so much but I lost 25lbs and this made me very happy so I stuck with it. I never really got 'high' from these pills but I did get a feeling of increased energy and often would get muscle and head aches.",
  "After the first six months I found I needed more to get the same results so I had my doc up my dosage and he started writing for 90 day supplies. The first time I ran out 5 days before my new prescription came in the mail I was in pretty bad shape. I had horrific restless leg, didnt sleep for two days and then only slept because I drank myself to sleep. I had chills, sweating, auditory hallucinations, nausea and a terrible crawling sensation in my spine that would not go away. I ended up going to the ER for relief. They thought I was nuts and gave me Haldol which only made it worse.",
  "I have experienced withdrawal from Hydrocodone and other opiates before and it is a drop in the bucket compared with Tramadol withdrawal. I cant believe any health care professional would think that this drug is less addictive than traditional opiates. I have tried to stop this medication several times over the last 7 years and have been unsuccessful due to the severe withdrawal that for me has lasted as long as 15 days before I gave up and resumed taking Tramadol. Taking other opiate medication, such as Hydrocodone or morphine, really helps with the flu-like withdrawal symptoms but not the rest.",
  "I am currently down to 25mg every 6 hours, but if I am late on taking that dose by even a few hours my withdrawal symptoms come back. I cant seem to get any lower than that. My doctor thinks I should stay on the drug at this point, but I really want off it.",
  "I am also having low blood pressure problems and heart palpitations which I attribute to the long-term Tramadol use since there is absolutely no history of heart trouble like this in my family.",
  "Just my opinion, but if you have a choice dont start with this drug. Too addictive, to many side effects, and not very well studied yet."
 ],
 "erowid": {
  "id": "91729",
  "citation": " Notme. \"10 Years On It: experience with Tramadol (ID 91729)\". Erowid.org. Aug 29, 2011. erowid.org/exp/91729",
  "substance": "Tramadol",
  "views": "6590"
 }
}
