{
 "id": 13725,
 "title": "Better than MDMA",
 "date": {
  "submission": "2012-10-07T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Kevdog",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "MDAI",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "60 mg",
   "administration": "oral",
   "substance": "5-APB",
   "form": "(capsule)"
  }
 ],
 "report": [
  "Let's skip my history because its a long one. I have tried most everything in most every form, except IV, more than once and would call myself a very experienced user.",
  "Now for the fun.",
  "I procured 1000mg MDAI and a small 100mg 5-APB, of which actually contained 120mg :) Any way me and my girl decided a little experiment was in order. I quickly weighed out two capsules containing 100mg MDAI and 60mg 5-APB.",
  "0:00- Swallowed our goodies while just hang at my house. I got them and told her what it was and she was just as interested to try. So with that, down our hatches.",
  "0:15- Both us can feel a little heat in our bodies not like being hot but warm with joy. We talked listened to music and chilled.",
  "0:50- Before I knew it the most wonderful sensation knocked me on my bed. Laying there with my girl I could feel me body high go from 0 to 10000. The most amazing rush crept over me.",
  "1:20- Floored.  Total euphoria and ego softening. Touch was not as amazing as mdma but the emotion was so strong, just rolling around in pillows created a total body orgasm but in my mind. No tingles in my extremities but total euphoria. At this point time goes out the window. All I know is we dropped at 5pm and were on the best one till 3am.",
  "?:??- Everything is great feels like my first ever roll but so clean. Me and my girl talk for hours. We laughed, we cried, made love, and we explored each other.  I feel with this substance there is no ego. Only truth. I had a secret addiction to heroin, told her and she helped me get over it. Not only did it actually help me but was wonderful.",
  "I have to say this is a great one, not too harsh but so good. Only problem I had was sleeping but that only lasted like two hours. All in all I LOVED IT. Highly recommended for taking with a loved one."
 ],
 "erowid": {
  "id": "91769",
  "citation": " Kevdog. \"Better than MDMA: experience with MDAI & 5-APB (ID 91769)\". Erowid.org. Oct 7, 2012. erowid.org/exp/91769",
  "substance": "MDAI & 5-APB",
  "views": "6268"
 }
}
