{
 "id": 13737,
 "title": "Today a Day I Won't Remember",
 "date": {
  "submission": "2011-07-23T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jaybee",
  "gender": "Male",
  "weight": 64
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 bump",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder / crystals"
  },
  {
   "time": "0:40",
   "amount": "1 bump",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder / crystals"
  }
 ],
 "report": [
  "I am a Canadian ketamine lover, been doing k almost 8 years on and off. But in the summer of 2011 there was a huge ketamine bust in Vancouver and it appeared that it was the whole supply for the country this season. Since ks been missing for almost 4 months, it was time for me to find an alternative. Methoxetamine. I first heard of MXE last year but I never thought it would be available to buy. Got from a trusted vendor, 2 grams came well packaged, and it appears as an off-white fluffy powder.",
  "Im feeling alert, just woke up, and have an empty stomach.",
  "Here I go",
  "9:40am: (1 bump)",
  "Tasted it on the back of my throat. Like if I were to crush a Ritalin and snort it, the same chemically taste. Now I have the urge to rail more and more, like k, but I know this stuff can take up to an hour to set in. So Ill be patient.",
  "9:45am:",
  "Everything looks a bit clearer and Im feeling kind of trippy already. This could just be the placebo effect though; I have Hallucinogen Persisting Perception Disorder so my mind likes to play tricks on me sometimes.",
  "9:50am:",
  "Feel it dripping down the back of my throat. Similar to a k drip it was kind of cold.",
  "10:00am:",
  "Feeling kind of slow and sleepy. Not much else.",
  "10:10am:",
  "Ah ha! I have those classic dissociative slow-eyes. When I jut my eyes back and forth, the image trails a little. Mentally I am feeling happier; thoughts are jumping around like they do when I'm on a low dose of k. Thinking about doing more but Ill first take a little walk-around and see how I feel physically.",
  "10:15am:",
  "Went to the bathroom, I always realize my state of intoxication best when peeing. Theres something very grounding about it. I know Ive drank too much when I cant help but sing as I pee, know Ive smoked too much weed if I forget that Im peeing while Im peeing and know Ive done too much k if I have to sit down and communicate with the fractals of the dividing world. This time it felt like I had taken a large dose of Lorazepam. I once took 10mg and experienced a time-lapsed feeling. Like, Im here, then Im there but there was no where in-between.",
  "10:20am: (1 bump)",
  "Decided to up the dose. This time I noticed the smell and taste of it a lot more. Its not the most pleasant thing to snort because of its fluffy powder form it shoots to the back of your throat quickly.",
  "10:30am:",
  "Im just too excited! Feel like a kid at Christmas. Im beginning to feel very similar effects to ketamine. Everything sparkles and trails a little, electronics are bright, things appear bigger that usual. Im feeling very motivated to do something, so Im going to go make breakfast.",
  "10:35am:",
  "Wow. Okay I just got a huge rush of something. I felt really great for a minute. Went out to talk to my roommates for a while and tell them what I was up to. Theyre all just getting up for breakfast. Wild.",
  "11:00am:",
  "I am feeling grand! I love how dissociatives make me appreciate the little things in life. I achieve this awesome gain of perspective, the very familiar bliss.",
  "11:10am:",
  "Feeling a welcoming tornado of positivity. The khole like experience feels like it could be close.",
  "11:15am:",
  "Things flow and pull.",
  "11:20am:",
  "I close my eyes and let the drug take me but, I did not go very far at all. I may have missed its peak and take-off so I think I will do a little more. Eating a strawberry feels godlike.",
  "11:45:am:",
  "I dono what happened. I got stressed at one point, very worked up and emotional, felt like I had to do something with myself. Inspiration?",
  "11:00pm:",
  "What happened between the last 12 hours and now was terrible. After the emotional burst, the drug started to warp my mind like madness. It sounded like dubstep blasting through my head and I could barely walk or even think. It felt like poison was coursing through my whole body and I was ready to call 911, then I puked. After throwing up I felt better and decided to rest. Thankfully my roommate came home and I was no longer alone. What a stupid decision this whole day was.",
  "My final thoughts on this drug are Well, it kinda sucked. I am still feeling its effects. It made me look and feel like crap. Ketamine is MUCH friendlier! With k, I can be wrecked one hour and then fine the next. With MXE, if I'm wrecked, I'm wrecked ALL DAY! And no, it is not fun.",
  "I am not sure if I will be taking this drug again. And I won't recommend it to friends.",
  "[Reported Dose: 75mg]"
 ],
 "erowid": {
  "id": "91862",
  "citation": " Jaybee. \"Today a Day I Won't Remember: experience with Methoxetamine (ID 91862)\". Erowid.org. Jul 23, 2011. erowid.org/exp/91862",
  "substance": "Methoxetamine",
  "views": "14709"
 }
}
