{
 "id": 13733,
 "title": "Gentle and Mild with Some Body Load",
 "date": {
  "submission": "2011-07-07T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "champ",
  "gender": "Female",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "30",
    "grams": 0.03
   },
   "administration": "oral",
   "substance": "TMA-2",
   "form": "capsule"
  },
  {
   "time": "2:00",
   "amount": {
    "unit": "mg",
    "quantity": "15",
    "grams": 0.015
   },
   "administration": "oral",
   "substance": "TMA-2",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "This was my first time taking TMA-2 and although I have taken a lot of psychedelics I wanted to be cautious with a new compound. Particularly because there is not very much information online about this one and the experience reports are all over the place in terms of both dosages and people's response.",
  "I started out with 30mg in a gel capsule on an empty stomach, first alerts were felt within 45 minutes but I was already suspecting that I hadn't taken enough. The coming up process took about 2 hours and mainly consisted of waves of shivers, my body was very sensitive and I was getting alternately hot and cold. A feeling of extreme sedation overcame me and I felt very slow and languid. The TMA-2 came in waves and had a very typically phenethylamine character, it was a little like MDMA and a little like mescaline, not at all like the 2cx chemicals or tryptamines.",
  "I was very hungry and once I realized I wasn't going to get nauseous or throw up I made a salad and some corn on the cob for dinner. Eating was really strange and I felt hyper-conscious of the mechanics of this process. My teeth felt very 'squeaky' when I was eating the corn especially. I ended up feeling hungry most of the night and had a case of psychedelic munchies (wtf) and ate cereal, crackers, some ice cream. So weird.",
  "I wasn't really happy with how high I was so I ate another 15 mg about 2 hours into the experience and did experience an increase in effects--I felt a bit rushy and visually I think my eyes had nystagmus because things looked blurry and when I looked in the mirror my pupils were very large.",
  "Overall: my friend said that he thought this would be a good psychedelic for old people and I laughed but now I see what he meant. It's rather slow, didn't feel very taxing and is suited to a quiet night at home listening to music and snuggling with your partner. It's a little like MDMA, but not as intense, lasted about 8 hours and I feel that I probably could start out with 60 mg and see if that is any deeper or more intense. I would also perhaps try it with 2C-B or something...maybe kick up the visuals a notch. My favorite thing about it was the relaxed character of it, the gentle rushing and the sensual, tactile enhancements. I liked how it wasn't pushy like MDMA, it is like mescaline in that sense--a gentle opening of perception that may be too subtle for some folks.",
  "I don't think I got any higher than a ++ on the Shulgin scale"
 ],
 "erowid": {
  "id": "91831",
  "citation": " champ. \"Gentle and Mild with Some Body Load: experience with TMA-2 (ID 91831)\". Erowid.org. Jul 7, 2011. erowid.org/exp/91831",
  "substance": "TMA-2",
  "views": "4968"
 }
}
