{
 "id": 13741,
 "title": "Will Never Try It Again",
 "date": {
  "submission": "2011-07-21T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Abby",
  "gender": "Female",
  "weight": "150 lb"
 },
 "dose": [
  {
   "time": "DOSE: T+ 3:00",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "5-MeO-DiPT",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:00",
   "amount": "200 mg",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "I'm only submitting this experience in hopes that it saves at least one person from having the kind of night I did last night.",
  "I was at a music festival in New York for the weekend, and of course my friends and I were all raging on an assortment of substances. I had taken it pretty easy most of the weekend, only smoking weed and dabbling in a little bit of ketamine. The last night of the festival, I ingested about .2 grams of of MDMA around 8 PM. Throughout that day, I had kept myself well fed and hydrated and mostly relaxed at our campsite. It was warm outside, but not too terribly hot. The effects of the MDMA were weak, and I had already experienced a peak and come down completely. Around 11 PM, I asked my friend I was with to head back to our campsite with me so I could get some more MDMA, but she didn't want to leave the last set of the show, so she offered me a capsule of 'foxy,' or 5-MeO-DIPT. She and another one of my friends had eaten it earlier in the day for their first time and were raving about how much they loved it. She told me it wasn't too intense, I would just kind of feel like I was tripping and rolling. Knowing that my friends had already tried it and had also purchased it from someone I knew and trusted, I ate it.",
  "I've eaten a lot of hallucinogens and a lot of stimulants in my life, and I have NEVER experienced anything like what I experienced with foxy. I've been sick from rolls/MDMA before, but it has always come and go quite quickly. About an hour after I ate the capsule of foxy, I started to feel a strong body buzz come on. It felt like I had a lot of energy but at the same time, all I wanted to do was sit down because the feeling had come on so quickly. I convinced my friend to return to our campsite with me. By the time we got back, I was sweating like a pig. Over the next half an hour, I became unbearably hot. I started experiencing visuals much like an LSD trip. If I closed my eyes, colors swirled around everywhere. Very intense tracers. When I closed my eyes, it felt like I was drifting off into another world. My thoughts kept wandering to the most random things, and when I would open my eyes and snap out of it, the visuals were even stronger. My vision became so blurred that all I could see were layers of patterns in front of me. I kept drifting in and out of reality.",
  "Doesn't sound so bad, except for the fact that my body must have been LITERALLY 110 degrees for about 4 hours. I was absolutely drenched in sweat and my whole body felt like it was melting. My brain seemed like it was frying. If you've ever seen the movie Fear and Loathing in Las Vegas, my experience was very comparable to the one Johnny Depp has when he experiments with adrenochrome, I was obviously very overheated, but I was unable to communicate how terrible I was feeling to anyone because of how ill I was. My heart was SLAMMING in my chest. I felt like I was having a heart attack and seriously began considering calling for medical help. I began vomiting about an hour into the whole thing. I tried sipping on cool water but nothing would stay down. Pretty soon I was dry heaving and forcing up stomach acid. I couldn't walk, speak, or function. I tried to use the rest room and fell over. Once in a while, the extreme heat would be replaced by chills and I would wrap myself in a blanket, only to become unbearably hot and start throwing up again.",
  "These symptoms occurred steadily for about 5 hours. I tried laying down but my heart was beating so fast and so hard I couldn't relax at all. I finally fell asleep for about an hour around 5 or 6 am, but when I woke up my heart was still pounding the same as it was when the drug kicked in. I considered taking a Xanax, but I was worried my heart would just stop. I am writing this now, nearly 24 hours after taking the drug, and my heart still doesn't feel right. My chest feels very heavy and achey, and if I exert to much energy, it goes back to beating very profusely.",
  "I cannot seem to find accounts of anyone else having experiences on foxy that parallel mine. I don't know if perhaps the combination of the MDMA I ate was too much with the foxy, but I know my tolerances pretty well and I am usually not a lightweight. I feel like if the MDMA had something to do with it, it would have been a pretty minimal effect considering the low dosage and the time in between taking each drug. All I know is that will be my first and last time with foxy, and I don't recommend anyone try it. If you want to trip, eat LSD. If you want to roll, eat MDMA. Don't screw around with ridiculous research chemicals."
 ],
 "erowid": {
  "id": "91890",
  "citation": " Abby. \"Will Never Try It Again: experience with 5-MeO-DIPT (following MDMA) (ID 91890)\". Erowid.org. Jul 21, 2011. erowid.org/exp/91890",
  "substance": "5-MeO-DIPT (following MDMA)",
  "views": "8568"
 }
}
