{
 "id": 13759,
 "title": "Sex Cocktail Effects and Aftereffects",
 "date": {
  "submission": "2011-07-20T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "SorryCharlie",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Catuaba",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Damiana",
   "form": "(extract)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "(extract)"
  },
  {
   "time": "0",
   "amount": "8 drops",
   "administration": "oral",
   "substance": "Ginseng",
   "form": "(extract)"
  }
 ],
 "report": [
  "<p>Here is my report of my first two experiences with a 'sex cocktail' as listed in The Curious World of Drugs and Their Friends: A Very Trippy Miscellany by Adriano Sack and Ingo Niermann. (Plume, 2006)",
  "In the book they suggest making buying a half pound of catuaba root, and letting it sit in 1 liter of ethanol for 15 days. You then strain the mix through a coffee filter, leaving you with an iodine-like liquid. Then combine two teaspoons of the liquid with 30-60 drops of both yohimbe and damiana tinctures, and 8 drops of Siberian ginseng. I bought the catuaba online, and the other three I purchased at a health food store. One night I decided to try the mixture and see if this would produce an erotic experience or aid one.",
  "I take no medications and live a very active lifestyle of yoga, cycling, and pilates. I smoke pot semi-regularly as a relaxant and also as an erotic stimulant, esp. if the strain of weed is more of the stimulant side. I drink alcohol socially. This night I hadn't really drank alcohol. I was in a good mood and curious to start, so I made the dose [2 teaspoons] and knocked it back. Thirty minutes later nothing had happened. I worked out a bit. An hour later nothing had happened. The recipe had promised results in an hour or less. Frustrated/disappointed, I took a hit of weed and immediately noticed a difference. I got a huge erection within 30 seconds and felt extremely sensitive. My skin was tingly. I went on an auto-erotic journey for about 2 to 3 hours, with no moment where I lost my erection. In fact, my usual cock-ring felt tight and too small. I had to take it off. (TMI for some people, but this is a sex drug story). When I finished up I was tired, but I still felt warm sensations in my groin. I went to sleep and the effects wore off.",
  "The second time I tried it I was in a bit more agitated state, but I felt that maybe the pot would take the edge off. I had also been going through some personal trauma (girlfriend related, the best/worst kind) and had been upset earlier in the day. I took the same dose but this time I smoked one hit of pot at the same time.",
  "The experience was as intense as the first, but I never had to take another hit of the weed. My erection remained full for 3 hours and ended with an amazing orgasm. HOWEVER, as I laid down to sleep, I found I couldn't. My heart rate was super high, and I swear I could feel two heart beats going on. I was wide awake and felt like I was having anxiety or a panic attack. I started to freak out a little bit, worried that I had done something to my heart or my brain or if I would have to go to the hospital. I got up and did housework. I read a book, but couldn't keep focused. I would almost nod off, but the anxiety would wake me up immediately. I felt very disassociated, and I couldn't remember what my girlfriend looked like or why I loved her, or what my friends had said to me that day. I felt my reality was crumbling from inside my brain, like the 'scales falling from my eyes,' but in a bad way. I tried meditation techniques and breathing exercises, but nothing seemed to lower my pulse. It was a pretty rough four hours. So the effects of this cocktail *may* last 6 to 7 hours. However, because I had already had some anxiety that week, I am not sure. Maybe the increased heart rate from the cocktail induced the anxiety that I had kept at bay. Maybe the weed led to the headtrips (although I had very little).",
  "I do want to try it a third time, but I feel I better wait until I feel a bit more centered in my life. I want to verify what is doing what. BTW, I have given the cocktail to a girlfriend of mine (not somebody I am involved with), and she came back the next morning saying it did nothing for her. So I think this only works on males.</p>"
 ],
 "erowid": {
  "id": "91941",
  "citation": " SorryCharlie. \"Sex Cocktail Effects and Aftereffects: experience with Catuaba (infusion), Yohimbe & Damiana (ID 91941)\". Erowid.org. Jul 20, 2011. erowid.org/exp/91941",
  "substance": "Catuaba (infusion), Yohimbe & Damiana",
  "views": "11291"
 }
}
