{
 "id": 13760,
 "title": "An Overdose No Really",
 "date": {
  "submission": "2011-07-25T07:00:00.000Z",
  "experience": "2008-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sakithin",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Chocolate"
  }
 ],
 "report": [
  "My partner was hosting a party for local green businesses, and one of the businesses being featured at this party was a chocolate trading company. As a result, the whole house was beset with chocolatl, cacao beans, cacao nibs, and various raw chocolate bars. We also have a chocolate fountain, which we like to fire up whenever we have an excuse, so that was loaded dark chocolate.",
  "Leading up to this experience, I'd had probably about 4 or 5 (large) cups of (strong) chocolatl, several hands full of beans and nibs, and maybe a bar or two. One of the guests had dropped a cacao bean into the chocolate fountain, and the fountain had jammed until the back pressure from the chocolate being pumped up was enough to force it through the top of the riser. This naturally led all this compressed chocolate to explode all over the room, and being the chocoholic I am, I decided that the only non-wasteful way to clean it up was to wipe it off with my fingers and lick them. I probably consumed another half-pound of chocolate or so in this manner (and I'd only started consuming chocolate about 2-3 hours prior).",
  "Partway through this consumption, I started to feel like the party around me was just too much. I also felt a little twitchy. I retired to a corner of the kitchen where I sat down, curled up, and quickly rocked back and forth. I didn't think to check if my pulse or body temperature were elevated.",
  "A short while later (I forget how long, since I'm writing this report a few years after the fact), I felt a little more normal and returned to the party, and eventually helped clean up.",
  "The following morning I was lethargic and headachey. I was also deeply reluctant to give my headache a little hair of the dog, so it persisted through much of the day, but I was back to normal the following day (including my appetite for chocolate)."
 ],
 "erowid": {
  "id": "91946",
  "citation": " sakithin. \"An Overdose No Really: experience with Chocolate (ID 91946)\". Erowid.org. Jul 25, 2011. erowid.org/exp/91946",
  "substance": "Chocolate",
  "views": "10760"
 }
}
