{
 "id": 13763,
 "title": "A Wild Night",
 "date": {
  "submission": "2011-07-19T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "SydPar",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "1",
    "unit": "capsl"
   },
   "administration": "oral",
   "substance": "MDMA",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "On a warm summer night in the middle of June, and the last day of school, my 2 friends B and M wanted to celebrate. We got a ride to a rave in the middle of nowhere. Myself being someone who likes to smoke weed and drink, never popped anything. Going to the rave I was aware that people pop, and its kind of the norm for the rave community. But, I had no plans to pop any pills. This rave was around 11 hours long. After hours of dancing, B, M, and I, met  a man who obviously had a bit of a crush on me. He happened to have Molly on him. (since pretty much everyone at the rave scene has some kind of drug on them) He offered me some.",
  "I didnt know what Molly was. He told me it was just an intense form of pure ecstasy and it makes you feel really good. I thought Id give it a shot out of pure curiosity. I had no money so he gave it to me for free. I asked if it was laced with anything and he assured me it wasnt. I swallowed it with water and went back to the dance floor waiting for it to kick in. About 25 minutes late it started to kick in. I had serious dry mouth and had to sit down. I got in what is called stuck mode once you sit down, you cant get up. I sat for a long time it felt like. Being verrrryyy talkative with anyone I could talk to. All I wanted to do was talk. I was also very very cold, I had to have a guy give me his jacket. I was shivering and tweaking. I had a binky in my mouth which prevented me from biting my tongue. I had paranoid thoughts and just wanted to lie in my bed. I was scared it was my time to die. I had to have some movement, so I moved my head back and forth uncontrollably. After it wore off I felt so much better. I still had the Molly in my system and still felt dazey, but in a good way. I was happy and energized and buzzed. The last hour was really fun.",
  "The first time for me was over all a good experience and I would definitely recommend having water and also have someone to talk to."
 ],
 "erowid": {
  "id": "91958",
  "citation": " SydPar. \"A Wild Night: experience with MDMA ('Molly') (ID 91958)\". Erowid.org. Jul 19, 2011. erowid.org/exp/91958",
  "substance": "MDMA ('Molly')",
  "views": "6252"
 }
}
