{
 "id": 13764,
 "title": "Casual User's First Bad Trip",
 "date": {
  "submission": "2012-01-03T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JTHebert",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": ".6 g",
   "administration": "smoked",
   "substance": "Products",
   "specific": "Spice and Synthetic Cannabinoids"
  }
 ],
 "report": [
  "The night started like many before it, a couple of our friends arrived at the apartment shared between myself and my roommate to smoke spice and dick around. A friend bought 2 grams of blueberry-scented spice, .5g for each of us roughly. We'd smoked spice many times before, and suffered no ill effects.",
  "Personally, I had seldom used any form of drug, but I found spice to be very relaxing and confounding. I'd never had a bad trip...",
  "[2130 hours]",
  "At the time, the friend who bought the spice was working for a local mining company that had a very strict drug policy, so we smoked from a glass pipe that was only used for spice. We sat down Indian-style around our coffee table and packed a bowl. The pipe was passed around multiple times until my roommate (we'll call him 'K') and the non-mine worker friend (we'll call her 'T') decided they'd had enough. My miner friend and I continued loading and hitting the pipe; we'd grown quite tolerant to spice over a few months of use.",
  "[2145 hours]",
  "My roommate's mother lived next door at the time, and we all stopped in and visited to chat. I sat down on her bed with my back against the wall as my miner friend (we'll call him 'S') spoke nonsensically to K's mother. Everything was absolutely uproarious. After a few short minutes K, T, S and I decided to migrate back to my apartment. Halfway between K's mother's room and her front door I began to feel violently ill. My head began pounding, my vision distorted and I began experiencing extremely loud tinnitus.",
  "I did my best to ignore the symptoms and carry on to the comfort of my couch. Before I could get to my front door, I began to space out.",
  "'...Where am I going...?'",
  "'...What am I doing...?'",
  "[2200 hours]",
  "I made it to my front door, entered my apartment where T and K where sitting at the dinner table. S sat on the floor cross-legged in front of our big screen. I walked to the opposite side of the apartment near the bedrooms and to the little bookshelf we store DVD's and video games in. I stood there for what seemed like an eternity listening to my louder-growing tinnitus and heartbeat. After a short while, I managed to stumble to the couch and sit down.",
  "[2210 hours]",
  "I was completely, 100% spaced-out. I had no control over my thoughts and, due to the tinnitus and heartbeat, I felt as though I was slowly dying. I did my best not to move. I would find a comfortable position and my muscles would lock up in that particular position. Moving was a monumental task, and it felt VERY unpleasant to do so. I stared into the television and had an intense feeling of falling. I developed a tunnel vision-like hallucination of sorts where in my field of view, without disrupting my vision, I could see what looked like being sucked into a black hole. Little white sparkles formed a rapidly-moving tube in my vision and gave me a sense of falling. Every once in a while, the hallucination would shift and it was if I was falling back-first, looking up at the passing sparkling lights.",
  "[2220 hours]",
  "My roommate began to play 'Every Planet We Reach is Dead' by the Gorillaz. The beats were penetrating my existence and gave me a very unpleasant feeling (I didn't know it at the time, but he played the song several times that night according to him). I asked K for a glass of water, as I was beginning to experience severe cottonmouth. Water delivered, I sat on the edge of the couch and began rocking side-to-side to the beat of the song; hallucination still intact.",
  "The most interesting part of this trip was the feeling of being a child. I felt very much like I was reliving a part of my childhood for whatever reason, it felt very familiar and began to scare me.",
  "[2300 hours]",
  "My heart was beating loudly and the tinnitus kept up for close to an hour. The hallucination retired shortly before the heartbeat and tinnitus.",
  "I began to plateau and I felt much more mellow, and less ill. I managed to get up and walk to the kitchen to grab a bite to eat. I consumed some tortilla chips and bean dip.",
  "[0000 hours]",
  "Just as soon as the bad trip hit me, the all sensation of intoxication left me, probably around 2 hours after the initial onset of effects."
 ],
 "erowid": {
  "id": "91960",
  "citation": " JTHebert. \"Casual User's First Bad Trip: experience with Products - Spice and Synthetic Cannabinoids (ID 91960)\". Erowid.org. Jan 3, 2012. erowid.org/exp/91960",
  "substance": "Products - Spice and Synthetic Cannabinoids",
  "views": "4249"
 }
}
