{
 "id": 13788,
 "title": "Triple Encounter",
 "date": {
  "submission": "2004-06-24T07:00:00.000Z",
  "experience": "2000"
 },
 "author": {
  "name": "Gould",
  "gender": "Male",
  "weight": "145 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "2 leaves",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "I've had a few experiences with Salvia before this one, but none quite as powerful. I met with my friend E. at his apartment, sat on his bedroom floor, and dimmed the lights.  After he had his experience, I proceeded to smoke a couple of leaves out of the hooka I brought, which I use exclusively for Salvia (I don't do pot or any other drugs anymore).",
  "All of a sudden, the room was covered with a fractal cell/leaf like membrane which swirled and focused  towards the space that we both occupied. It was like the universe focussed on us and was trying to communicate with me. I saw my friend, and he was a cricket, a friendly smiling hairy cricket. I wasn't frightened by the sight. It seemed quite normal. I looked at him and he looked at me with a big wonderful smile. Then I felt the Salvia entity contacting me. I've had this feeling before and I recognized the entity from past experiences. It has a definite female character to it and very loving and protecting (Although in my first couple of experiences, it was a bit frightening since she seemed to possess me, pull me off the floor and out of the room). I started to ask questions and she was answering me, but I do not remember either the questions or answers. Then I came back to reality.",
  "Feeling like the experience was not quite finished, I smoked some more. This time the room dissapeared and I was in black space. I saw some floating islands in this space and on the islands were children being taught by  a motherly salvia entity. Then I realized I was on one of these islands myself and the salvia entity was teaching me, answering all my questions. I was quiet this time, just listening. Then I came back...",
  "I was still not satisfied, there was communication but it wasn't clear. I knew there was more to be said. I smoked again and now I distinctly felt the entity taking my hand and leading me through a series of rooms. In each room I was incarnated into a different person in a different situation. They were all me, but I hadn't recognized myself. I was a college student in a dorm while somebody was knocking at my door. I was a child. I was an old man. I was an old lady. I was a young girl. It was like reality had many levels which run simultaneously and I inhabited all of them simultaneously, but was not aware of it untill this moment, and neither were my incarnations.",
  "After the salvia dissipated I felt a tremendous sense of happiness and well being. It was the most comfortable I had felt with salvia so far. I could trust it now and it would show me wondrous things."
 ],
 "erowid": {
  "id": "9209",
  "citation": " Gould. \"Triple Encounter: experience with Salvia divinorum (ID 9209)\". Erowid.org. Jun 24, 2004. erowid.org/exp/9209",
  "substance": "Salvia divinorum",
  "views": "7019"
 }
}
