{
 "id": 13781,
 "title": "Good Day Later with a Double M-Hole",
 "date": {
  "submission": "2011-07-27T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Andex",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "10",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "0:45",
   "amount": {
    "number": "60",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Memantine",
   "form": "pill/tablet"
  },
  {
   "time": "5:00",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "9:30",
   "amount": {
    "number": "30",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "It was a bright summer day and it started with me and two of my friends having stayed up late the night before we woke up at about 12:00 noon and we had already planned on going swimming. Before my friends got up so around 11:30 I did a small 10mg line of MXE and was buzzed but not intoxicated off of that.",
  "At this point I had finally decided to try about 60 milligrams of this memantine I had purchased weeks before but was scared to because of its long duration.",
  "12:15 - I pop a pill that has roughly 60 milligrams of Memantine in it.",
  "1:00 - We arrive at the beach that's just down the road after going for a small bike ride just before. The beach was pretty busy so we just sat at the table.",
  "1:30 - While although I'm coming down from the small amount of MXE I can swear I'm feeling drunker. We are still sitting at the picnic table.",
  "2:00 - Effects from the memantine are definitely more noticeable now as I continue to become more initiated and more talkative and silly like.",
  "3:00 - Still at the picnic table talking away as I'm feeling pretty good and pretty intoxicated. It is a very DXM like intoxication feeling much different from MXE however because it's not at all speedy which is why I prefer dissociatives that do not increase dopamine levels. Although the 'drunk' feeling is a lot like DXM it doesn't quite match up to DXM's euphoric and magic effects but it's still quite decent. Not to mention I had the whole night of this coming up!",
  "4:00 - So the beach finally clears and the 3 of us had been sitting in the same spot for hours! Feeling hilarious! At this point my friend A had invited one of his friends to come down who showed up shortly after 4 and he walked down from his car and talked to us for a bit. At this point it was time for us all to go swimming! The water was quite warm in the small lake we were by so we got in quite fast.",
  "4:30 - I got back out of the water to run to the table and do a quick 20mg line of MXE. After I quickly ran back into the water and swam back out to the dock. Now when this kicked in.. my perception got even more shifty and hilarious while we were all jumping off the dock and getting back up. I was trying to do dives which I was always in the past too scared to try, let's just say I have more work to do. That and while jumping into the water it felt like I was snorting huge lines of water which felt worse than snorting anything else could of possibly felt. After we were done talking we pretty much just sat on the dock and talked which was fun and I was feeling pretty hilarious.",
  "5:50 - At this time we finally got out of the water and dried off. The friend of my friend A gave my other two friends a ride back home while I biked back to my place.",
  "6:00 - When getting back to my house I had come to remember that the night before when I first went to pick up my friends I had tripped over the Internet cable outside my house and I had not yet been able to get around to fixing it so I had to do that first because I just can't live without it. Finding out that when I tripped over the wire I had ripped the connector piece a part and would have to try and find a new one, try doing this on these dissociation! especially when my mind constantly keeps drifting off into space and I cannot for the life of it concentrate on one thing at a time!",
  "7:00 - I kept loosing concentration and would repeat looking in the same spots over and over again accomplishing nothing. It wasn't until I began getting angry and frustrated with myself that I had to keep saying 'STAY ON TRACK' 'WE NEED TO FIX THIS' I would stop and get this irritable feeling that I was climbing a mountain. Having tried many different things that didn't work I finally found a connector piece that worked after having to discipline myself to stay on track.",
  "9:00 - I must of been on the computer until about 9 when I decided to do some more MXE. I decided to go a little beyond where I usually go because I hadn't M-holed in awhile so I did a few small lines then did another few. when things began to get really intense and I began to M-hole. It felt as if I had fallen into another dimension and as I was walking around the house a sudden fear of encountering a spirit came to me and I began to get very scared. I decided to grab my laptop and go lay in the tub and while walking through the house I feared every corner I walked around.",
  "9:15 - After finally getting into the tub and trying to create a more comfortable setting my fear went down and was manageable. It was a very intense experience but it wasn't uncomfortable or bad it was just a little scary. I pretty much just laid in the tub on the computer and listened to music and drifted through my mind feeling as if I was in a complete sense of emotion and that I wasn't really there I was just floating emotions.",
  "10:30 - At this point having left the M-hole I got back out of the tub and headed back to my room where while I was still feeling the very DXM like drunk feeling, the last MXE was wearing off slowly.  I don't think I ended up getting to sleep until around 1 am.",
  "The next day I woke up at about noon and felt much more sober than the day before but there was still a pleasant yet bizarre dissociated and partially intoxicating like feeling most definitely. Of course after that day and night anything would feel sober! Even after biking back to town that day I could still feel the Memantine intoxication. It was probably completely gone by that night so as long as Memantine is taken early one day, it's wearing off by the time I wake up the next day and probably wouldn't interfere with anything I had to do. I must say though that it's an impressive substance!"
 ],
 "erowid": {
  "id": "92047",
  "citation": " Andex. \"Good Day Later with a Double M-Hole: experience with Methoxetamine & Memantine (ID 92047)\". Erowid.org. Jul 27, 2011. erowid.org/exp/92047",
  "substance": "Methoxetamine & Memantine",
  "views": "6787"
 }
}
