{
 "id": 13783,
 "title": "Euphoric Stimulation",
 "date": {
  "submission": "2011-08-15T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Wintermute",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol",
   "specific": "Beer/Wine"
  },
  {
   "time": "0:00",
   "amount": "60 mg",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "0:30",
   "amount": "60 mg",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "3:30",
   "amount": "60 mg",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "4:00",
   "amount": "60 mg",
   "substance": "4-Fluoroamphetamine"
  },
  {
   "time": "5:30",
   "amount": "1 line",
   "administration": "insufflated",
   "substance": "Amphetamines"
  }
 ],
 "report": [
  "Prelude: I have experience with MDMA, Speed, am a long term user of Ritalin, smoked weed often, and have taken mushrooms every now and then. I love dancing, no matter if completely sober or intoxicated.",
  "Friday Night: Met with 2 Friends, and left for our usual meeting point, a park on the fringes of a nearby major city. There were about 40-50 familiar people there, and about 20 which I would consider Friends. Drank a beer, and at 20:00 I took the first 60 mg's of 4-FMP. Noticed slight euphoric effects half an Hour later, and talked slightly more than usual. Took another 60 mg's at 20:30, and by 21:00 I began experiencing a definitive euphoria, and a strong sympathy towards the people surrounding me, much like MDMA, yet slightly weaker, and much more controllable. I talked alot, and was very direkt, but always meant well, and when I wanted to, I could easily supress the talking / openness, unlike MDMA, which tends to overcome me. The Stimulating side began to take over at 22:00, where we (me + one Friend) started leaving from this meetingplace, to a Club of the EBM/Industrial Scene. Had to go by train, felt very controlled on the way.",
  "Arrived at 23:15, took another 60 mg Dose at 23:30, and started Dancing. Even though I had an exhausting day, movement was easy, and felt good, not in the slightest way I tired. Took the last 60 g dose at 0:30, and felt Great! Only ever stopped dancing this evening to get a drink of water. At 1:30 I sniffed a small line of acceptable grade Amphetamine, just to keep the night going. From then on, Just nonstop dancing till 4:00. 4-Fmp was proving to be an awesome Club/Dance Drug for me. Had to leave at 4 as my Friend had to work next day, and we both had to get up and be in acceptable state by 12, took until 6 to get to my mates house, I continued to dance in the train, listening to Music on my Mp3-Player. Then it took me till 7:30 to go to sleep, then however sleeping until 11:30, and waking up completely refreshed.",
  "Experiencing slight MDMA like Depression on Monday  Tuesday, however it is possible that there is no connection between the drug use and this. I would definitely take it again."
 ],
 "erowid": {
  "id": "92053",
  "citation": " Wintermute. \"Euphoric Stimulation: experience with 4-Fluoroamphetamine & Amphetamine (ID 92053)\". Erowid.org. Aug 15, 2011. erowid.org/exp/92053",
  "substance": "4-Fluoroamphetamine & Amphetamine",
  "views": "8051"
 }
}
