{
 "id": 13790,
 "title": "Zapped Away Methadone Withdrawals",
 "date": {
  "submission": "2011-08-22T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "msFancyPants",
  "gender": "Female",
  "weight": "110 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "7 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(dried)"
  },
  {
   "time": "1:55",
   "amount": "7 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(dried)"
  },
  {
   "time": "10:00",
   "amount": "7 g",
   "administration": "oral",
   "substance": "Kratom",
   "form": "(dried)"
  }
 ],
 "report": [
  "A little background:",
  "I'm a 29-year old female living in the US.",
  "ADDICTION HISTORY: I have an off and on active opiate addiction of about 15 years (and more on the 'on' side than 'off'.) By opiates, I mean any and all of them- started off as vicodin, then went to percocets, and on to oxycontin, heroin, and eventually the methadone monster (I was taking 100/mg a day in my methadone clinic.)",
  "EXPERIENCE/ TOLERANCE: I also have quite a bit of experience with other substances, mostly hallucinogens and empathogens such as MDMA, mescaline, mushrooms, ketamine, and DMT. I am a moderate user of alcohol, though not recently, most likely because I was experiencing symptoms of withdrawal that killed my desire to drink booze.",
  "OTHER BACKGROUND: I recently moved from NYC to Upstate New York, thinking that the clinic in this area could at the very least give me a guest dose until they could take me on as a full-time patient. To my dismay (and horror) the local clinic here had a waiting list of six to twelve months, which meant that my choices were to a) move back to the city, b) go to a rehab and detox, or c) come off of methadone cold turkey. Being that I didn't really need to go to rehab, and that moving back to the city JUST to stay on or taper off slowly of methadone was a very pathetic prospect, my choice was limited to coming off cold turkey.",
  "This idea scared the shit out of me, having been through methadone withdrawals in the past and knowing that they last much longer and are stronger in intensity than heroin or other opiates, so before I started having really bad withdrawals (it usually takes three to five days off of methadone to start experiencing acute symptoms for me personally, most likely as the half-life of this drug is especially long) I decided to do some in-depth research on some natural or over-the-counter remedies for at-home detox. Expecting to not find much other than some beefed-up versions of The Thomas Recipe I came across a (surprisingly) large amount of articles, experiences, trip reports, etcetera, containing info about kratom and opiate withdrawals, with more people advocating mytragynine than not for this purpose. I decided to give this a try so ordered 6 oz. of powdered 'premium' kratom (not extracts or 'super' strains.)",
  "4 days later, and ridiculously ill, with symptoms such as nausea, vomiting, diarrhea, muscle aches,  I receieved my order of kratom (this was the POWDERED leaf, standard Bali) and begun my journey into the Land of No Opiate Withdrawals. An account of my first experience with this wonderful plant.",
  "PREPARATION: 10pm-- I mix 28 grams of kratom into a pot of 4 cups of H2O, using a wire whisk, continously stirring and bring the sludge to a gentle boil, then turn it down to simmer for 15 minutes (stirring every few minutes.) I add about 2/3 cup of sugar to the hot  mix, let it cool for a few minutes, and divvy the water with the plant material still in it (stirring as I pour) into 4 glasses (to measure 4 doses of 7 grams.)",
  "THE TRIP: 10:30pm-- I begin to drink the mixture from one of the four glasses (plant and all, still stirring as I chugged) and found it quite bitter, so added a little milk, which made it much more palatable.)",
  "10:40pm-- My nausea is subsiding, and anxiety level seems to be much lower. Could be placebo at this level.",
  "11:00pm-- Nausea and churning of stomach definitely gone, almost 100%. Symptoms of Restless Leg Syndrome seems to have dissipated. My limbs feel a little more heavy, in a good way. My mood has gone from despaired to content. I wouldn't say I am experiencing euphoria or a 'high' but I liken the feeling to getting my methadone after missing a dose of it one day.",
  "11:30pm-- I have energy to do things for the first time since I stopped my methadone. I get up and begin to clean the house, doing dishes, and listening to music. The music is enjoyable, and I find myself wishing I had company around.",
  "12:00pm-- The initial energy burst I got seems to have tapered off, but I now feel relaxed, content, and have almost NO symptoms of withdrawal from the methadone at this point.",
  "12:25am-- I feel like I can actually fall asleep for the first time in days, so I take another 7 gram dose of kratom so that it lasts me through the night (I have read that mytragynine has a very short half-life) and proceed to lay down.",
  "12:40am-- I feel myself fade off to sleep-- no issue whatsover.",
  "THE NEXT MORNING-- I wake at aproximately 8:30am with some very mild anxiety and fatigue, but after dosing again with the kratom get energy and anti-anxiety effects almost immediately.",
  "CONCLUSION-- For me, kratom is extremely effective as an opiate withdrawal remedy when used in the right doses and frequently ( 2-3 times a day) as its effects do not seem to last as long as methadone or bupenorphine. I plan to use this as a long-term taper (several months) and possibly in place of methadone maintenance. I will post a follow-up in a month or two on how the kratom taper or maintenance is working for me!"
 ],
 "erowid": {
  "id": "92099",
  "citation": " msFancyPants. \"Zapped Away Methadone Withdrawals: experience with Kratom (ID 92099)\". Erowid.org. Aug 22, 2011. erowid.org/exp/92099",
  "substance": "Kratom",
  "views": "19134"
 }
}
