{
 "id": 13800,
 "title": "Nothing Seemed Real",
 "date": {
  "submission": "2011-08-23T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "sam seed",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "liquid"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "I received a gram of Methoxetamine from an overseas supplier and was eager to find out what it felt like. Around 5 p.m. I took my first dose which was a small key bump. I felt a lil funky but thought i needed more so i did another one about a half hour later. About 5 minutes later I started to feel the extent of this wicked substance. It felt a sort of like K but something was diferent but I couldn't quite figure out what. By that time my friends had showed up to my house so we could all go see my other friend about a half hour away. I decided to do one more bump before I left. That's when things began to get strange. On the ride there I began to feel real wonky but very happy. My vision began to become distorted, blury and choppy, my mouth and lips numb.",
  "When we arrived at my friends I stepped out of the car and struggled to keep my balance, felt as though my legs were wieghtless and didn't want to listen to my brain.",
  "When we got inside my friend imediatly started filling up balloons full of NO2, packed up a bowl and did a healthy amount of the MXE I hooked him up with. By that time the MXE had begun to kick in even more. I took a big riff off the bowl and a big huff off of the balloon and had to sit, if i didn't i'd surely just crumble to my knees.",
  "My friend began to feel the effets of the MXE also and began stumbling around, trying to talk about something but couldn't manage to quite say it. He had to sit also but knocked over a bunch of stuff on his way down. We hung out with him for about 2 hours and I was still feeling it, but even more so now. We got back to my house and smoked some more and hung out for a bit, waiting to go to a friends party. I was still feeling it but not so much any more, especially after i ate a bunch of tacos.",
  "We got to the party and word spread fast about the powder in my pocket. Before long almost everyone wanted to give it a try. So i hooked up about 5 of my friends. With every bump they did, I did one....big mistake. Soon enough they were all begining to feel it.",
  "Next thing I know everyones stumbling around, taking giant steps trying to compinsate for the wieghtlessness of their legs, all staring off inot space, laughing, saying they felt really weird.",
  "Meanwhile I was off in another planet. I had drunk about five beers which isn't much for me but combined with the MXE it kicked my ass. Everyone's voices had a terrible frightening echo to them and my vision was in frames again, almost as if i were in an old time movie where you can see the frames flicker as they run on a projector. Walking was nearly impossible, at one point i got up to go outside to smoke and slowly collapsed onto the ground before i reached the door. As time went on the buzz grew stronger and stronger even though i wasn't taking any more doses.",
  "Everyone began to leave and I managed to find a ride home. When I got there everything seemed foreign, almost as if I knew my house but didn't live there. Nothing inside seemed real, almost like I was inside a dream. I layed down to watch a movie and felt the familiar feeling of being in a k hole.",
  "I ate some food and my buzz began to slowly fade but when i closed my eyes I saw static, almost like an old TV with no signal. I got some really good sleep afterwards and woke up feeling great. When I do K I usually wake up feeling grumpy and like carp.",
  "MXE was much more powerful than normal K and unlike K it lasted much longer and the effects grew stronger as time went on, without redosing. Altough the experience was a tad bit to intense at times it was enjoyable and much less expensive than Ketamine.",
  "The effects reminded me of DXM, alcohol and K at the same time."
 ],
 "erowid": {
  "id": "92148",
  "citation": " sam seed. \"Nothing Seemed Real: experience with Methoxetamine, Nitrous Oxide & Beer (ID 92148)\". Erowid.org. Aug 23, 2011. erowid.org/exp/92148",
  "substance": "Methoxetamine, Nitrous Oxide & Beer",
  "views": "4340"
 }
}
