{
 "id": 13804,
 "title": "Truly Remarkable",
 "date": {
  "submission": "2011-11-03T07:00:00.000Z",
  "experience": "1979-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Redacted"
 },
 "dose": [
  {
   "time": "0",
   "administration": "",
   "substance": "Phenethylamines",
   "specific": "Other"
  }
 ],
 "report": [
  "[This report originally appeared as typewritten page pasted into Book 3, pages 325 of the Shulgin Lab Books.]",
  "\rREPORT OF EXPERIENCE WITH MDOH",
  "On June 30, 1979, 10:30AM., ingested 100 m.g. of MDOH along with [Redacted], Sasha, Anne, [Redacted].",
  "This time the drug seemed much slower coming on than in my initial trial.  I felt that I was dragging a heavier load inside, although I felt in general in a better space than on my first trial.  The intoxication was slower to develop, and took almost an hour before it reached full effect, about twice as long as the first time.  The feeling when it developed was marvelous, but not the same intensity of giddiness as the first time.",
  "I felt hampered the first hour by some internal barrier, which prevented total enjoyment.  However, this began to break through in a wonderful way just before the supplement was offered.  Since I felt I was beginning to move through the barrier, I declined the supplement, particularly since I was anxious to compare the after-effects with my first experience.  I had found the first time a very remarkable experience, but felt unusually tired for several days after the first trial.  I feel it is important to know whether this is a specific drug-induced affect, or the result of psychological phenomena.",
  "The experience continued in a rich, meaningful way.  There was a marvelous inner glow, the warmth from all the other participants was marvelous to feel, nature was most beautiful.  It was easy and very fruitful to think about various subjects. There were no dramatic breakthroughs, or rushes of insight or energy, but just a",
  "wonderful contemplative space where things gently unfolded as you put your attention on them.",
  "Going inside was particularly blissful.  It felt very good to just close the eyes, relax, and move with the interior experience.  Everyone's face took on a marvelous glow; everyone looked blissful and beautiful.",
  "The whole day moved on in like manner, everything being just wonderfully enjoyable, easy, mellow, delightful.  A highlight came for me when Sasha put on Brahm's 2nd piano concerto.  I was deeply moved by the music, looking up through the trees to the sky, and was quite overcome by the beauty, wonder, and goodness of everything. I felt so very, very fortunate to be part of it all.",
  "The wonderful experience lasted right on through the evening, with the marvelous glow continuing.  It was a truly remarked experience, and one that brought us all very close together."
 ],
 "erowid": {
  "id": "92167",
  "citation": " Redacted. \"Truly Remarkable: experience with MDOH (ID 92167)\". Erowid.org. Nov 3, 2011. erowid.org/exp/92167",
  "substance": "MDOH",
  "views": "4445"
 }
}
