{
 "id": 13820,
 "title": "Oh So Right",
 "date": {
  "submission": "2012-11-19T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "suburbandad",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "2C-C"
  }
 ],
 "report": [
  "After experiencing 2C-C at doses in the range of 15-30mg at various times, I had a lazy afternoon to myself and decided to take it up a notch. I was in a good mood, the weather was great, it was sunny outside, and 40mg seemed like reasonable dose considering that my 30mg doses hadn't been that intense. I should mention, however, that I was really tired from my daughter waking up extra early the night before and I probably should have taken a nap but an afternoon at home alone was a rarity, so I went for it.",
  "I carefully measured out 40mg of 2C-C on my milligram scale and mixed it in with some ginger ale, downing the whole glass pretty quickly and then re-filling the glass with water and drinking that to make sure I got any residue that might have stuck to the sides. I find that 2C-C has no identifiable effect on the taste of a regular sized glass of any beverage.   ",
  "About 20 minutes in I got some first alerts: slight euphoria and a sense that my visual field was changing in unidentifiable ways. This was much earlier than my first alerts on smaller doses, so I was looking forward to really 'feeling' what 2C-C could do for me now. By an hour after dosing, I was feeling really good, enjoying some music and feeling just slightly 'altered'. I had a lot of extra energy despite still being tired and it was hard for me to keep focus on just one activity. I wanted a glass of water but going to the kitchen made me notice a mess. Putting away a magazine that was laying on the counter led me to notice I had left the TV on, etc. By the time I finally got my glass of water and got back to listening to music, probably ten minutes had passed.",
  "By this point I was feeling great and I felt an overwhelming desire to find a comfortable position where I could listen to music. I tried the living room but electronics didn't seem to agree with me and I couldn't get the stereo working. I tried sitting in a chair and listening to music on my laptop, but this was slightly disagreeable due to the sound quality from the computer. Also, I was still so damned tired. Finally I just decided, screw it  I'm going to put on headphones and lay in bed with my eyes closed and if I fall asleep so be it. This was the best idea I've had in months.",
  "I laid down in bed as the peak was coming on. The whole room looked a bit like I was viewing it through wet glass, although that's a slight exaggeration. Everything just seemed to have a slightly distorted filter on it but more or less looked normal. Laying in bed, I can say that very few times in my life have I ever felt more comfortable. It was so rewarding, being so tired, to feel so physically amazing. Just complete comfort throughout my body with an almost opiate-like glow to my muscles and skeleton. I closed my eyes and relaxed to the music. It sounded GREAT. I found the chillest tunes I could find and it was like being on the beach at the height of your vacation with a cold drink, only on a feather bed. I began to think of my wife and daughter, and how much I loved them. My daughter's stuffed lion was still on our bed from her early morning and it became symbolic of her. I snuggled with it like a child and it was so reassuring and comfortable and relaxed that I shed a few tears of joy. It was a truly wonderful mental state. Even though I was tired, I couldn't fall asleep, but I laid there listening to music for two hours or so just feeling blissed out and relaxed.",
  "At that point I put on some more upbeat dance music and its energy filled my soul. I started moving to the music in bed. I felt great. I wasn't tired any more, I felt like I had just taken a four hour nap. I got up and got a wild hair up my ass to clean. I left on the tunes and just danced around the house, cleaning everything I saw: taking care of those little messes that you just leave for months, like the boxes of Christmas lights that were hidden behind the end table in the living room, the child's toys my daughter had outgrown, etc. It all filled me with joy because I knew when my family got home my wife would be so pleased to see everything looking tip top.",
  "I came down slowly and easily. I couldn't have had a better afternoon to myself, and",
  "I was productive at that!",
  "I see a lot of people disappointed in this substance, but for me, it's just what I need to unwind, relax, reconnect with the feelings for my family and refresh my soul. I think it has great therapeutic value and should be studied medically."
 ],
 "erowid": {
  "id": "92238",
  "citation": " suburbandad. \"Oh So Right: experience with 2C-C (ID 92238)\". Erowid.org. Nov 19, 2012. erowid.org/exp/92238",
  "substance": "2C-C",
  "views": "2158"
 }
}
