{
 "id": 13838,
 "title": "Sex Magnified by One Thousand",
 "date": {
  "submission": "2001-09-05T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "FreakBoy",
  "gender": "Male",
  "weight": "210 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 tablet",
   "administration": "oral",
   "substance": "MDMA",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "I have always wanted to try E, and the first time i did , i made the mistake of drinking about 3-4 beers and the mistake of doing it around alot of strangers and the mistake of doing it just by myself, and i must say it wasn;t quite the experience i was hoping for. I was very quiet and in a shitty mood. So you would think i would learn from my experience, about 4-6 weeks later i took another pill at home on a nice sunny day, and i started to feel the effects of this amazing drug, but once again, for some reason, i felt the need to have a few beers, and then my e feelings were gone, another waste. My experience is that alcohol kills the effects of xtc.",
  "So i vowed to myself to try it again and DO NOT drink any alcohol.",
  "I wanted my g/f to try it with me, but she was paranoid, so i took it by myself. I was just sitting in our place with her, just hanging out, when about after 45mins after i took my pill i started to feel this beautiful europhic feeling come over me. I just felt so good, and i wanted to listen to music, so we played some cd's. about an hour and 1/2 had past and i was feeling better and better as the minutes went on. I had to get up and dance, so we started to dance to the music that was playing, it didn;t matter what was playing, it sounded so good. And the feelings i had towards my g/f were growing out of control. I started to get really close and feeling her up as we were dancing, everytime she touched me it felt so wonderful. And once we started to kiss, it felt so good, like nothing ever felt this good before. I kept telling her this is the best time i've ever had in my life. I tried to explain how great i was feeling, but just couldn;t find the words. it was so amazing. After dancing for a couple of hrs, we laid down on the couch and started making out.",
  "I was looking into her eyes and every feature on her body was so beautiful, her eyes were the most beautiful thing i've ever seen, i couldn;t stop staring at them and her face, she slowly started to touch me and i swear i never felt so good as i did then. I started beathing very heavily and making noises, just from kissing and being touched very lightly around my groin area. It was like i was having an orgasm, but actually wasn't. She couldn;t believe how i was starting to get off from so little effort. Her hair was so beautiful looking and her lips, everything was so clear and magnified. I was so hot for her. Then we went into the bedroom and she stripped me and took off her clothes. She looked absolutely amazing, her breasts, everything was so beautiful and wonderful. I started to touch her and kiss her all over her body and i can't even explain how great it felt. She started to stroke my penis and i've never felt so good, it was like complete heaven. it was like any other sexual encounter magnified by 1000 times over and over. I won't go into details, but once we started to have sex, i was in complete ecstasy, now i know why they call it that. The best sex of my life, it lasted for about 2 hrs. and once i was on the verge of orgasm, i freaked out, i started screaming in complete pleasure, yelling and moaning like an animal, grabbing the pillow with one hand as hard as i could, and the other hand was holding onto a piece of wooded rack, i was squeezing so hard i broke the wood in half, biting my lip very hard, i couldn't believe how great it felt. and the orgasm felt like it lasted much much longer than any other. My girlfriend had to put a pillow over my mouth becasue her parents were upstairs sleeping and i was out of control with the noises i was making. I was almost in tears from it, that's how great it felt, it was so amazing, just looking up at this beautiful, sexy girl, giving me the time of my life as i came. Nothing could compare to it.",
  "Sex never felt so good, as i found out the next night. Nothing will compare to having sex on E. Even before the sex, i was still aroused to be around her and having her touching me, in a sensual way also.",
  "Now i am going to try to convince her to try it with me, i can only imagine how much greater everything will be if we both did it at the same time."
 ],
 "erowid": {
  "id": "9233",
  "citation": " FreakBoy. \"Sex Magnified by One Thousand: experience with Ecstasy (ID 9233)\". Erowid.org. Sep 5, 2001. erowid.org/exp/9233",
  "substance": "Ecstasy",
  "views": "22451"
 }
}
