{
 "title": "The Young and the Mindless",
 "author": "Angry P",
 "citation": " Angry P. \"The Young and the Mindless: experience with Cannabis ('with PCP') (ID 13845)\". Erowid.org. Mar 15, 2005. erowid.org/exp/13845",
 "substance": "Cannabis ('with PCP')",
 "bodyweight": "135 lb",
 "report": "<p>[Erowid Note: Some authors report suspicions that their cannabis has been 'laced' (adulterated), in some cases presumably with PCP. While this is possible, readers should be aware that idiosyncratic response to the effects of cannabis (usually higher doses) can lead some users to presume their cannabis has been 'laced'. There is no way to know if the cannabis in the report below was adulterated or not.]</p><p>It was just another night...</p><p>I was an average Smoker (pot) and what else was there to do on a Friday night? we all gathered at our usual spot and heard about this little get together our friend was having.  We all krept into the room and looked at the bags of grass in front of us. </p><p>Our friend R had rolled a significantly large joint...he passed it to me and said 'dont put your lips on it, just pull right by the end'. I ignored him and took what was one of the harshest hits ever.  I sat there blowing out smoke for what seemed like an hour.  We packed 2 bowls which went around until they were done, and then repacked.  All of a sudden I feel uneasy, I'm observing people, and it seems im the only one who is affected so strangely.</p><p>My friend rises up and sits back down rather quickly...'what the fuck is going on?', I answered with a shrug thinking my little bug out would end soon.  I then started to feel the cold air entering my lungs and hot air rushing out, I sat there noticing the rapid heartbeat which made me more uneasy, my friend was having the same experience, gripping his seat he said 'I have to leave now'.  I looked at R and noticed that his NIN emblem just floated off his shirt...I grabbed P and we went upstairs, this girl had mirrors all over the fucking place, I didnt think we'd make it out. </p><p>I decided to take a walk, as we were walking I notice the sidewalk seems to be melting away with every step, as if it's avoiding my feet, now faces seem to be appearing in the grooves of the sidewalk...I'm fucked!  I look straight ahead and reassure myself that if I act in control, I will be...We get to the store on the corner and everything around me is insignificant, I can't feel I think I said to myself.  We take a shortcut to my house and the trees and train tracks left an erie feeling in the air.</p><p>The wierdest thing was...I dont know WHY we went to my house. It was a destination, and I didn't want to pass out in a strangers house.  I was stupid for smoking in the first place, since my steroid inhaler probably hurt me more than it did good earlier that day.  As my mother is lecturing me and my friend on our stupidity, all I see is object hovering, I look over at my lamp, and then over at my mother again, but the image of my mother isn't there, its still the image of the side of the room. </p><p>We decide to hit the sack, but everytime I'd fall asleep I'd wake up short of breath, as if I was running in my sleep. The next thing I know, I woke up, happy to be alive and quite stoned, I stumble to my feet to get food.</p><p>This was the start of the end of my days with drugs. To this day, it is a very vivid memory.</p>",
 "year": "2002",
 "id": "13845",
 "timestamp": "2005-03-15T08:00:00.000Z",
 "views": "4067",
 "dose": [
  {
   "time": "DOSE:",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ]
}
