{
 "id": 13854,
 "title": "Significant Psychedelic Adventures",
 "date": {
  "submission": "2012-12-03T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "No Big Deal",
  "gender": "Male",
  "weight": 59
 },
 "dose": [
  {
   "time": "0",
   "amount": "7.5 mg",
   "administration": "oral",
   "substance": "DOC",
   "form": "liquid"
  }
 ],
 "report": [
  "In the last three months I have been experimenting with large doses of DOC, which I have taken orally in diluted water over twenty times at several different doses. At higher doses, +5 mg DOC seems to take me to a more uncontrollable interaction with past memory and therapeutically self reflection somewhat like LSD. I remember at this stage, my mind slips away as I would believe that I had completely died and been introduced to a complete dreamlike reality where usually many negative self realizations were faced and enforced on everything I thought was possible about myself.",
  "I have also found a common bad trip or very powerful trip can be experienced in a spiral of realities where identity lost is common, where I continuously loop in my memories like a movie that continues to fast forward and rewind, I called this the loop. Which was experienced by myself about five times, and seem to activate when there was a lot going on at the location, like loud noise and new people coming into the picture.",
  "Even at lower doses with inexperienced psychedelic users the loop was common if they were in a uncontrollable environment, it's just their actions and the hallucinations wouldn't be as near as strong as a higher dose. A lot of time for the people who went in the loop, they won't really remember what exactly had happened in till days, weeks, or even months after the comedown.",
  "After about ten times however with DOC, I had learned what to expect and even if I tried extreme high doses 10mg + I could control it where I wouldn't go in the loop but just have very intense euphoria, mental and physical stimulation, and Beautiful geometric patterns with opened and closed eyes. When the eyes were closed, tunnels of colors would appear, and sometimes mask of entities with past experiences of LSD, DOC, DMT, and psilocybin mushrooms would be seen.",
  "Though there are many profound things I would like to share that this very magical compound has to offer, there is one thing that DOC has shown me that is only comparable to one other substance I have ever done, and that was DMT. With DMT the hallucinations are much more realistic, and much more alive and intense. I had experienced a series of alien abductions with DMT, and those experiences had stayed with me forever. With DOC once however, I did with two other people. I was given 5 drops of DOC diluted into water which was approximately 7 to 8 mg of DOC, my friend was given two which was up to 2 to 5 mg of DOC, and my Uncle was give 8 drops which could of been up to 12 mg of DOC.",
  "That night turned into a total nightmare as I felt the same alien presence DMT had given me before, I felt as if we all three had been totally abducted by the same force and were experimented with. I had felt as if I were placed in others life, and my deepest secrets had been revealed to everyone in the external world around me, I also felt strange telepathic connections from and external force just like I did on DMT. When I finally started to realize where I was and who I was, I realized I was in the garage walking around after the last thing I remember was being in the car listening to music with my friend and uncle. I look down to see my friend rolling around on the ground completely tranced out, and my uncle still in the car just sitting there, him too tranced out. We all ended up going inside, complete confused at each other, my Uncle was angry for some reason threatening me and my friend. My friend hit the loop after we went inside and was completely spun, and I had finally came down to the DOC high I had been used too, still tripping hard, but nothing like the shit I had just experienced.",
  "After the complete come down, my uncle went into a DOC/sleep stage for the next two days while my friend came completely down the following day along with me. None of talked about exactly what had happened in till about a month later when we all felt that a force had placed us in each others lives and we all felt telepathic signals coming towards us from some very strange force. I also will be the first one to tell you that this experience was different than all the others because it wasn't just like I was tripping, it was all so real. It's the things like this that really makes you wonder I suppose.",
  "Also the DOC is active as low as 1 mg with threshold effects such as a speedy and low euphoric high with visual distortion. 2-5 mg takes up to 2 hours for full affects, however 7-10 mg can sometimes be felt within 5 minutes and last up to 20 hours. Usually after 12 hours the affects began to come down and within hours and sleep are completely gone. When snorted the effects were shorter but kicked in faster. It really stings also, and yes DOC is very bitter."
 ],
 "erowid": {
  "id": "92396",
  "citation": " No Big Deal. \"Significant Psychedelic Adventures: experience with DOC (ID 92396)\". Erowid.org. Dec 3, 2012. erowid.org/exp/92396",
  "substance": "DOC",
  "views": "1409"
 }
}
