{
 "title": "Abuse Causes Long-term Insomnia",
 "author": "Andrew",
 "citation": " Andrew. \"Abuse Causes Long-term Insomnia: experience with GHB (ID 13866)\". Erowid.org. Nov 9, 2005. erowid.org/exp/13866",
 "substance": "GHB",
 "bodyweight": "165 lb",
 "report": [
  "<p>I first started taking GHB a few years ago, but only drank it on the nights I went out. It was really fun to use in clubs and I saw no side effects for a long time. I would also use it sometimes to put me asleep, I never had a sleep problem, but it was nice to use when I wanted to go to sleep early for a long night's rest. Then I saw myself taking it every night. I took about 8 caps one night (not all at once) and couldnt sleep, I was having bad withdrawals, my symptoms were jitters, stress, heart palputations, and a BAD case of insomnia. In fact, I went six days straight without sleep, until I got my hands on some valiums. The insomnia lasted about six weeks with the help of melatonins. Tylenol PMs would give me about 2 hours of sleep.",
  "After about 2 weeks that the insomnia was gone, I took a little G and the insomnia came back, it lasted a month. But I still didnt learn my lesson, so I took a six month break from taking it, and got away with it for about 5 nights, this case was the longest, 2 months of taking sleeping pills, my doctor gave me tamazapans. They work well but my racquetball game sucked the whole time. I took another six months off of it and thought maybe I can get away with it once a week, the 3rd time I took it, back to the insomnia today. I know that this is called the dopamine rebound, and the brain gets flooded with dopamine causing no sleep. Therefore I dont think I can ever take it again and I would like to take some just occasionally.</p>"
 ],
 "year": "2001",
 "id": "13866",
 "gender": "Male",
 "views": "7866",
 "dose": [
  {
   "time": "0",
   "amount": " repeated",
   "administration": "oral",
   "substance": "GHB",
   "form": "(liquid)"
  }
 ],
 "submissionDate": "2005-11-09T08:00:00.000Z"
}
