{
 "id": 13871,
 "title": "Qualitative Description",
 "date": {
  "submission": "2011-08-16T07:00:00.000Z",
  "experience": "1976-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Alexander Shulgin",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": "13 mg",
   "administration": "oral",
   "substance": "TMA-2",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "[This report originally appeared as handwritten notes in Book 1, page 219 of the Shulgin Lab Books.]",
  "Qualitative Description: TMA-2",
  "Dose: 12mg + 1mg = 13mg",
  "Date: Sunday May 30, 1976: 11:40 = 0.00 - no EtOH for 5 months",
  "1:10 Onset of first threshold effects - slight nausea - probably coincidence - but numbing of 4-5th fingers of the left hand. But these fingers have been troublesome (Right hand too) and are often asleep on awaking in mornings.",
  "3:00 Really pleasant, with-nature euphoria. Sat behind lab on steps in the sun how often I have been apprehensive in a drug using that some emergency or other crisis might occur requiring sane logical action, and would I be able to respond adequately - but I here realize that if a fire, strange person, insect- were to threaten - then, and only then, do I need to consider the situation -so- until then enjoy - I did.",
  "This was in especial contrast to yesterday's study on DMT - perhaps I was so attentive to the possibility of some falling-down-stoned response, that I neglected to be receptive to a true altered state of consciousness - without perceptual change, without pretentious impact, without the LSD impact or the DMT physical aspects.",
  "I am completely convinced I would be able to handle 16 mg by myself and this as a full dose would quite accurately be 20 M.U. (with mescaline at 300 mg base - say 320 mg = exactly 20 M.U.). However, I would not care to pretend to be responding normally to a demanding world.",
  "5:20 still with it. Tried to elicit visual distortion by going (1st time) into Cost Plus Imports in W. Creek. No such induction. Did a rather bad job of driving however. Had to pretend distractions. [Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!] To 'All the Presidents Men' - with no clear visual distortion. I MUST REMEMBER - an ASC need not have visual disruption as a symptom!.",
  "8:00 Drove to Berkely Farms for dinner with N & her mother. Still odd driving which N. commented on (What is the matter with you?). I had forgotten where the place was! Clearly emerging. On into evening without further events except a light sweatyness 10:00-12:00. Difficult (mental disturbance) in going to sleep",
  "This is a clear ASC process - perhaps valuable to describe (display) to a subject what this all is - without some annoying sensory modality demanding attention by misbehaving. Interesting day!!"
 ],
 "erowid": {
  "id": "92434",
  "citation": " Alexander Shulgin. \"Qualitative Description: experience with TMA-2 (ID 92434)\". Erowid.org. Aug 16, 2011. erowid.org/exp/92434",
  "substance": "TMA-2",
  "views": "5544"
 }
}
