{
 "title": "Intricate Absolution",
 "author": "droplet",
 "citation": " droplet. \"Intricate Absolution: experience with Wormwood & Catnip (ID 13878)\". Erowid.org. Apr 11, 2002. erowid.org/exp/13878",
 "substance": "Wormwood & Catnip",
 "bodyweight": "65 kg",
 "report": [
  "<p>It was about 10:00 at night in my house in the middle of nowhere, a ten acre bush. I felt like chillin' and I'd heard that Wormwood and Catnip could both get you high. They were meant to be like pot but not as good. I'm not a big experimenter... it was meant to be light and I just wanted to relax. I'd dried a few finely broken up leaves of wormwood and catnip just on my desk for a couple of days. They were not moist to touch like when you just pick them off the plant, but not dry and brittle either. I rolled a joint mixing them both in evenly. I took it outside to smoke it. I wasnt expecting much... in fact while I was smoking it I forgot that I was doing anything mind altering. The smoke was bitter... but not completely unpleasent. It still went down quite easily and I had no trouble holding it in my lungs (I'm not a big smoker; dont smoke tobacco).",
  "While I was taking the last few hits I started to notice that color was more evident. There were no dramatic changes in my state of mind or anything like that yet... but things seemed more... lucent and intricate. This became more and more evident. I felt quite happy while I didnt conciously feel a sudden euphoric boost. When I finished the joint, I decided to sit on the table and meditate.",
  "It was a cold night and life was teaming around me. Normally I wouldnt go and sit on a table outside at night... but I saw nothing against it then. I sat there, staring into the distance. The trees and the stars. Just letting it all in. I looked into the distance. Everything else started to dissapear. Just what I was staring at remained. Even visually. I can usually achieve this with deep meditation in the right state, but now it just happened.",
  "Everything was there... it started to go blotchy while I did not move. I just sat staring. I remembered seeing figures emerge out of blackness... just blackness. A path, a palace. It was not the kind of hallucination you would experience on 'shrooms or anything. I definiteley knew what was real and what was not... but that was not what I was thinking about. I sat there... just staring. God knows for how long. I honestly lost track of time.",
  "As I looked around I *definitely* experienced more evidence of color. It was just like broom tops were meant to produce (or so I had read). Especially the reds. The orange plant outside my door seemed to be amazingly red. I know it doesnt sound amazing... but it was... just red. I began to feel enlightened. I really was quite sure I was enlightened. I could think and not be scared. Everything seemed just... there. I walked around a bit, thinking of how I felt. I felt no fear, hatred, or anger. I felt at one. I went back to my room, feeling quite enchanted. I saw my computer was on and I decided to write a poem. A poem of how I felt being enlightened. It was quite long, looking back at it. The first few lines read:",
  "No vibrant patterns",
  "No colorfull gurus",
  "Just here",
  "Here/there",
  "Behold",
  "Its beauty",
  "No long enchantments",
  "No Heroic experiences",
  "Just here",
  "Here",
  "Behold",
  "And spoke I not",
  "Need I do",
  "Behold",
  "My greatness",
  "No more than yours",
  "Behold",
  "His, Her greatness",
  "Or All",
  "It could all disappear",
  "And I would be here",
  "I felt in love with everything. Then I went to my bed. I noted how sleepy I was... I usually wasnt this sleepy at 10:40. But it was peacefull sleepy, not nagging sleepy. It was inviting me to come to the land of dreams, not bugging me to go to bed. I lay down and felt warm. Warm and at rest. I began to think about my state. Then for the first time I got frightened because I thought that explaining it would destroy it. But quite quickly I concluded, which I'm still quite amazed with, that in this state of mind, everything has meaning... nothing was just a token. It was unbelieveable.",
  "I then saw a friend was messaging me on my computer. By now it was about 11:00. I started talking to him and I didnt think I said anything perticularly strange. I think it was starting to wear off... now I just felt peaceful. I pottered around for another 40 minutes... much of which was spent writing this. Its now 11:50. The orange tint on everything is waring off. Now I just feel happy and peacefull. I have a mild headache and and stomach ache, not enough to bother me though. I feel great actually. I dont think I'll do it every night though beacause a) I think I've gathered as much as I ever will from it; its not the state of mind that I really enjoyed, and b)I hear that wormwood is, although a mild one, a narcotic and continued use can cause addiction.",
  "In conclusion, a great experience. I did not particularly enjoy the weird red tints on things and mild hallucinations, although I'm sure these aided the state of mind. I really feel quite enlightened. I dont know if it was just me, but you should definiteley give it a go. If you benefit from it as much as I did, you wont regret it.</p>"
 ],
 "year": "2002",
 "id": "13878",
 "gender": "Male",
 "views": "55567",
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Wormwood",
   "form": "(dried)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Catnip",
   "form": "(dried)"
  }
 ],
 "submissionDate": "2002-04-11T07:00:00.000Z"
}
