{
 "id": 13886,
 "title": "Depressive Bliss",
 "date": {
  "submission": "2011-08-31T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "dearpsychonaut",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "insufflated",
   "substance": "4-Methylethcathinone",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco",
   "specific": "Cigarettes"
  }
 ],
 "report": [
  "Recently, I ordered some MXE online. Knowing online vendors I was nowhere near surprised when I received 4-MEC instead of MXE. This drug was never of much interest to me; I know very little about its pharmacology, I typically do not like stimulant drugs, and I never saw any long lasting effects of this substance for the positive.  So obviously I wasnt too happy when I received this in my mailbox, plus the little baggy it was packaged in had opened and fallen apart during the shipping process, so I had to recollect all the powder, losing much of the product in the process, weighed out to .645 grams when it was supposed to be a full gram. Damn chemical vendors.",
  "I decided, what the hell Ill give this shit a shot. Took a few small snorts, probably around 5 milligrams for allergic reaction test. Felt a little sweating and a tiny amount of nausea, but only lasted a few seconds. I decided after reading forums of oral doses around 200-250mg and insufflating being much lower, but most people said it was extremely unpleasant. One fellow mentioned that doses that were going around were much too high and that 50mg insufflated is perfect. I weighed up 50mg and decided it was time.",
  "This stuff is pretty crystalline, so I crushed it up with my debit card and it easily powdered up. Rolled up a piece of paper and sniffed the stuff up. Immediate uncomfortable nose sensation, kinda like a burn but nowhere near as bad as some of the 2c-x chemicals, I shook it off quickly. Right away a felt some sweating and again the baby nausea. I sat down on my couch on FB for a while, and noticed some energy lift after about 2 minutes..I looked around and got some after images, which I usually get because of my mild HPPD, but it was more intense. Next I can only describe as a slow rushing sensation, my head lit up and I felt almost as if I smoked 20 cigarettes at once. Pretty energetic, but as I am currently pretty depressed and always have low energy I just sat there and observed. I was scared shitless, I just wanted it to be over the effects werent overbearing I just couldnt handle being intoxicated at the time. I tried listening to some music which I found interesting but not consuming like psychedelic drugs, although there is a lingering psychedelic feeling of this compound that Im starting to enjoy. ",
  "I decide to go outside and smoke a cigarette, my anxiety may have been coming from being cooped up inside stuck on my computer like always because as soon as I went outside I felt nothing but amazing. Lit up a cig and suddenly my life was amazing, music became extremely intense, not deeper, but intense for sure.  I smoked the cig and became super excited but then I started to come down and before I knew it I was back to baseline.",
  "The comedown wasnt too bad, but there was a strong desire to do more, pretty addictive. I was going to rail up some more, but decided not to after a while. After I hit baseline, I became very depressed and bored lonely as well. I am usually pretty depressed; I have a lot of issues to work out.  But this was a little more  than normal and a little more in your face. I made it through and it wasnt anything I havent faced before.",
  "I think Ill do this again, probably another 50mg dose, and then possibly 100mg. I can see this being pretty euphoric in the right circumstances, just not alone and depressed. Seems to be some entactogenic properties to this compound, as I felt a slight psychedelic nature to it, and missed some close friends.",
  "All in all, be careful. Not much known about it, and very addictive. Not a bad experience tho, coming from someone who hates stimulants thats saying something I guess. Happy tripping."
 ],
 "erowid": {
  "id": "92510",
  "citation": " dearpsychonaut. \"Depressive Bliss: experience with 4-Methylethcathinone  (ID 92510)\". Erowid.org. Aug 31, 2011. erowid.org/exp/92510",
  "substance": "4-Methylethcathinone ",
  "views": "6721"
 }
}
