{
 "id": 13883,
 "title": "Sex Hell",
 "date": {
  "submission": "2012-03-08T08:00:00.000Z",
  "experience": "2009-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tripland",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "2",
    "unit": "capsls"
   },
   "administration": "oral",
   "substance": "Cathinone"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "specific": "Hash"
  }
 ],
 "report": [
  "I met 'A' in a dating site online. I called myself 'cat on mdma' and of course I got many many messages. A is one of those guys that everything going just great for them: looks great, have a degree in economics, work in an investment company, makes lots of money, do drugs like a pig and somehow everything is great.",
  "We spoke on the site and decided to meet. We have something in Israel calls 'hagigat'. From what I research on the net it's Cathinone. It's not legal in Israel but from time to time u can buy it in seven eleven places. We started to smoke hash and took one capsule each from the hagigat. We started to have sex and it was the craziest thing ever. I felt like a whore and all I wanted is more and more sex. I started to think that he is the perfect guy for me and that a great love story will come from this and life is perfect.",
  "At 11 we decided from some reason to take more. And that was a big mistake. We kept fucking and smoking hash till like 4 am. And than suddenly this motherfucker tells me that his brother was stuck with his car and that he is going to help him. I told him ok but come back I don't wanna be high like this alone. He told me yah sure I will come back. He left. 1-2 hours passed and he didn't come back.",
  "My brain was on full speed , I couldnt stop think like million thought per second. I didnt understand why he dont come back. I start to call him and he just turn off his phone. I couldnt understand why he does that to me. I try to go to sleep but I couldnt. I tried to relax but I couldnt. I thought Im going nuts. I took Clonazepam in order to go to sleep but I still couldnt sleep. It just drove me nuts that he left me like that alone and high. In the end I understood that I just can't sleep and somehow I passed the day. Only at 6 pm I finally fell asleep.",
  "It was one of the hardest trip I had on drugs. It was too much. the sex was amazing."
 ],
 "erowid": {
  "id": "92501",
  "citation": " tripland. \"Sex Hell: experience with Cathinone (sold as Hagigat) (ID 92501)\". Erowid.org. Mar 8, 2012. erowid.org/exp/92501",
  "substance": "Cathinone (sold as Hagigat)",
  "views": "8246"
 }
}
