{
 "id": 13880,
 "title": "The magnifying glass",
 "date": {
  "submission": "2001-09-09T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Catfish Rivers",
  "gender": "Male",
  "weight": "245 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "AMT",
   "form": "(capsule)"
  },
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "smoked",
   "substance": "DPT",
   "form": "(freebase)"
  }
 ],
 "report": [
  "I won't get into the hour by hour particulars of the trip, but rather I'd like to share the synergy I found to exist between AMT and DPT freebase. I have experimented with this combo on 3 seperate occasions now, and each time I have experienced pretty much the same effect. Each time I had taken 50 mg AMT (in two 25 mg doses separated by an hour) and aprox 50 mg DPT freebase oil on clubmoss as a carrier, in additiopn to sporadic cannanis throughout the experience.",
  "What I felt throughout these experiences was what seemed to be a grand magnifacation of all the desirable effects, without a change in the overall signature of the AMT high. The body high was made much more prominent and enjoyable. I revelled in the excessive yawning and compulsion to strecth. My mood was euphoric through the roof. Madcapped for sure. The visuals become more 'distinct' or defined somehow. For example, if I were to see a subtle breathing effect in the wall on AMT alone, the DPT would enhance this visual greatly, making it look like a wave moving through the wall's space, a ripple through the entire fabric of my visual field, not limited to just the wall anymore. The visuals in general were greatly enhanced, as I said, due to being more definable and thus easier to focus on. Upon glancing up at the nearly full moon one night, I watched a serpant like phantom curl DNA style around the glowing orb like an egg. It was a true 'cosmic' moment and I had to laugh at myself for having it later on.",
  "I also found an unusual ability to split my attention and focus on music at a micrscopic and macroscopic level, I was hearing the uniqueness of each instrument, of the players behind the instruments, while at the same time able to grasp and follow the music as an intergral working being. For some reason I was intuitively drawn to make comparisons between the flow of a jazzband that knows itself, and the human body. All of the organs functioning separately, yet united by their song. This image warmed my spirits. People don't seem all so at odds with each other anymore. There's a song were all singing if you stop and listen.",
  "Overall, this is a combo I'd like to see more reports on. I'm wondering if the slight MAOI activity, rumored of AMT, could possibly be making the DPT experience synergize so profoundly. I've combined DPT freebase with other tryptamines and none (as of yet) to such a dramatic effect. This is a definite tag team with contention for the title. Watch out!"
 ],
 "erowid": {
  "id": "9249",
  "citation": " Catfish Rivers. \"The magnifying glass: experience with AMT, DPT freebase (on club moss), cannabis (ID 9249)\". Erowid.org. Sep 9, 2001. erowid.org/exp/9249",
  "substance": "AMT, DPT freebase (on club moss), cannabis",
  "views": "15205"
 }
}
