{
 "id": 13905,
 "title": "Limtless Addiction Healing",
 "date": {
  "submission": "2012-06-04T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pallinard",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "50",
    "grams": 0.05
   },
   "administration": "oral",
   "substance": "Baclofen",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "400",
    "grams": 0.4
   },
   "administration": "oral",
   "substance": "Modafinil",
   "form": "pill/tablet"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200",
    "grams": 0.2
   },
   "administration": "oral",
   "substance": "Orphenadrine",
   "form": "pill/tablet"
  }
 ],
 "report": [
  "Over my life I have struggled with addictions of one sort or another. My entire family tree is littered with alcoholics and opiate abusers. By the age of 30 I was well on the way to becoming another casualty with alcohol abuse which was destroying my life, career and family.",
  "After a stay in rehab, AA, divorce and job loss due to substance abuse (opiates and cocaine) I was on my knees. I finally decided to try and solve my addictions by trying baclofen in high doses beginning with a loading dose of 80mg after 24 hrs abstinence when the DTs were really kicking in and then 40mg 4 hrs later.",
  "The results were astonishing. My craving went to be replaced by extreme relaxation and clarity of thought. In my case it was as if my soul was being linked to something old and (oddly) Nordic, where the old gods of Valhalla were helping me to become a man and take responsibility for myself and my family. I am not going to go into it all as it was intensely personal but It resonated within me in a way I would not be able to ignore.",
  "Over the next two weeks I continued with high-dose baclofen and (apart from somnolence) I was completely free of my physical dependency. I gradually then titrated down in 10mg increments until I was no longer using anything...I was free at last. Gone was the anxiety and sweating, gone was the guilt and self loathing. I was alive again.",
  "I have continued to use baclofen as required (in tense moments) and was recently prescribed Modalert because my work meant extensive travel and long hours, I also was prescribed Norflex for back pain.",
  "Now something peculiar happened again. Using all three of these substances in combination made me feel intensely calm, focused and, well, clever. I was able to react very quicky to issues in life and found myself solving tricky problems effortlessly. Just like the main character in the film 'Limitless',  was me 1.1. smarter, wiser and bolder.",
  "There is something in this nootropic+gaba receptor blocking combo that improves me...cessation is not a problem as none of these molecules is addictive...but it is such a great feeling that I would warn fellow travellers to use in moderation for fear of psychological dependency.",
  "I have seen no comedown, no overt hangover. I think it will prove to be a marvellous smart drug if ever investigated properly.",
  "I would urge all those trapped by opiates and/or alcohol to try baclofen. The others if you want to boost your performance and (temporarily at least) give yourself a break from depression if that is a factor with you as it is for me."
 ],
 "erowid": {
  "id": "92586",
  "citation": " Pallinard. \"Limtless Addiction Healing: experience with Baclofen (ID 92586)\". Erowid.org. Jun 4, 2012. erowid.org/exp/92586",
  "substance": "Baclofen",
  "views": "7912"
 }
}
