{
 "id": 13907,
 "title": "New Hallucinations",
 "date": {
  "submission": "2013-06-18T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "RasOtis",
  "gender": "Male",
  "weight": 95
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "300",
    "grams": 0.3
   },
   "substance": "Cocaine"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "125",
    "grams": 0.125
   },
   "substance": "L-DOPA"
  },
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "12.5",
    "grams": 0.0125
   },
   "substance": "Carbidopa"
  }
 ],
 "report": [
  "Cocaine has well-documented highly pleasurable effects that are produced by block of dopamine reuptake at synapses. I was interested in whether the reward properties of cocaine could be enhanced in combination with the dopamine precursor L-dopa. I tried a number of self-experiments with this drug combination, starting with modest amounts of cocaine (e.g., ~50 mg) and extremely small amounts of L-dopa in the form of carbidopa tablets. The precautions were necessary because L-dopa might also enhance the cardiotoxicity of cocaine.",
  "What I first found from multiple self-trials with various doses of cocaine followed by L-dopa was that rather than enhance cardiac effects, L-dopa was an effective post-cocaine therapy to rapidly return to a normal state. I found L-dopa could relieve feelings of anxiety and increased blood pressure. As might be expected from these observations, L-dopa used before cocaine produced significant decreases in all actions of cocaine. But when I used L-dopa in combination with cocaine, something unexpected happened. The cocaine experience may have been a little better, but not much. The interesting thing is that for about the next 5 hours after combined use of these drugs, I felt great. My mind was sharp, rational, and lucid. I was comfortable in my body - no residual sympathomimetic effects. Words flowed freely. I could express my thoughts clearly and elegantly  almost as if scripted. I was motivated to do things such as complete neglected projects.",
  "My general impression was that this experience was similar to the actions of an MAO inhibitor or other antidepressant. Then after about 6 hours I noticed something else. I started to see patterns in the walls and the carpet. I looked into the air and I saw millions of small particles of light zipping in all directions at unbelievably fast speeds. Then I began to see objects start to melt (slowly). Photographs became animated. People in the photographs slowly made adjustments in their hand positions. These and other hallucinations that I experienced are closely comparable to LSD. Yet unlike LSD, I had no feelings of paranoia or confusion about my experiences. I was able to rationally evaluate my mental state and note that these hallucinations were drug-induced. I did not sleep the entire night and I felt fine at morning with no need for a nap later."
 ],
 "erowid": {
  "id": "92614",
  "citation": " RasOtis. \"New Hallucinations: experience with Cocaine, L-DOPA & Carbidopa (ID 92614)\". Erowid.org. Jun 18, 2013. erowid.org/exp/92614",
  "substance": "Cocaine, L-DOPA & Carbidopa",
  "views": "1862"
 }
}
