{
 "title": "Maelstrom From Hell",
 "author": "XEROX",
 "citation": " XEROX. \"Maelstrom From Hell: experience with 2C-B (ID 13913)\". Erowid.org. Apr 19, 2002. erowid.org/exp/13913",
 "substance": "2C-B",
 "bodyweight": "185 lb",
 "header": [
  "DOSE:",
  "17 mg",
  "insufflated",
  "2C-B",
  "(powder / crystals)",
  "",
  "17 mg",
  "insufflated",
  "2C-B",
  "(powder / crystals)",
  "",
  "17 mg",
  "insufflated",
  "2C-B",
  "(powder / crystals)"
 ],
 "report": "<p>I had bought six capsules containing 17 mg each of 2C-B, which was sold as mescaline.  I was eager to do it again because I had had two great experiences on it before.  The first night I had insufflated 34 mg (2 capsules), with a fun but minimal effect.  I actually bought the other three the next day, and prepared once more.</p><p>   Being a very high tolerance and experienced tripper, the second go around I was driving home and decided to snort 17 mg. [Erowid Note: It is extremely reckless and endangers others to use powerful psychoactives while driving.  Do not do it.]  When I got home, another 17 mg was snorted.  Ten minutes after the second dose I was feeling great, seeing nice patterns that all shared a pink,purple,light blue-(all fruitcake colors).  It also had a a 'sharp' effect to it, which led to like one said 'digital' patterns, etc.</p><p>I decided I wanted to push it a little more, so half an hour later I snorted the remaining 17 mg, equaling 51 mg.- Yes, it does burn, but you get over it after a while.  Needless to say, twenty minutes later I was having a WONDERFUL time, very anxious, and the most intense rush I have ever had in my life.  It wasn't as visual as acid, but the body trip was VERY intense.</p><p>I decided I needed to calm down a bit so i proceeded to the garage to puff on some alaskan thunderfuck (Alaska #2, from Matanuska, which was very dense indeed).  The patterns began fluctuating and had a strong strobing effect.  My balance was COMPLETELY BLOWN and kept falling backwards and running into walls.  I could think, but at the same time, I would have to think about something for at least five minutes just to comprehend what I was trying to think about.  I would look in the rearview mirror of my truck, and sit there trying to think of what I was actually seeing.  The good, fun part lasted for about two hours- and unexpectedly, I was deliberately thrown into the most hellish nightmare of pain I have ever endured.</p><p>It started with my throat, flushed into my face, and worst of all, into my eyes.  My entire muscular system felt like it was going to explode.  It felt like steel balls the size of a large marbles with spikes on them were ripping through every vein in my face, tearing open my blood vessels and eating away at my flesh.  I was punching myself in the face, spinning around to get dizzy, and kicking at the wall with my knees just to take my mind off the pain.  It was so severe, I was seriously thinking of stabbing myself in the leg because that actually would have feld GOOD compared to the pain I was dealing with.</p><p>I couldn't stop moving, and felt like I needed to dip my face in a bucket of liquid nitrogen.  I was literally ripping my face off, trying to get the evil terrors ripping thru every square inch of my jugular from the chest up.  I would have called the police if they could have done something, but it would have been useless. </p><p>This living hell lasted for over two hours, and yes, i was still tripping my balls off.  (That was the good part.) </p><p>Im not saying this substance is bad in any way, because at lower doses it is a BLAST- but to warn you from my experience, please, please don't snort as much as I did or you will wish you were dead.  I don't know if I just had a bad reaction, but im used to taking large doses of anything-(once eating 24 grams of dried liberty caps)-(hell, that was REALLY fun,) but these synthetic chemicals can be very dangerous, VERY VERY VERY COMPLETELY OVERWHELMINGLY UNCOMFORTABLE to your body at higher doses.  Doing that to myself was just granting me my own death wish.- I know I wouldn't have died, but I think I rather would have.</p><p>Anyway- if you learn anything from this- please take a smaller dose and stay there for a while untill you are completely comfortable taking more, because it can and will backfire on you- BIGTIME</p><p>Late-</p>",
 "year": "2002",
 "id": "13913",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-04-19T07:00:00.000Z",
 "views": "18657",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "17 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  },
  "1": {
   "time": "",
   "amount": "17 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  },
  "2": {
   "time": "",
   "amount": "17 mg",
   "administration": "insufflated",
   "substance": "2C-B",
   "form": "(powder / crystals)"
  }
 }
}
