{
 "title": "D.T. Circus",
 "author": "Lunapapa",
 "citation": " Lunapapa. \"D.T. Circus: experience with Alcohol Withdrawal (ID 13910)\". Erowid.org. Mar 21, 2005. erowid.org/exp/13910",
 "substance": "Alcohol Withdrawal",
 "bodyweight": "160 lb",
 "report": "<p>I have enjoyed a life full of adventures.  I saw Terence McKenna speak in Maui twice.  I have smoked NN and 5-MEO DMT.  I have moved objects with my mind while on mushrooms.  I found God through Salvia Divinorum.  Had Synesthesia on Acid.  I had lots of fun, no doubt about it.  But I also had a tendency to push the limit, to always want more more more, and that led me into some very unfriendly terrain.  Crystal Meth addiction.  Ditto benzoes, opiates and GHB.  Suicide attempts.  Withdrawal from society.  Choosing to use substances which alter perception is a path riddled with land-mines.</p><p>I stepped on many.  After years of experimenting with the more exotic substances, I found myself financially and mentally unable to keep up the frantic pace I had established.  Still suffering from a tendency to over-use, I began drinking more than I ever had.  I have always enjoyed beer, but found myself moving on to wine and hards.  My job suffered so I drank more to 'compensate.'  I was drinking in the mornings, drinking to pass out, drinking all the time.</p><p>Days became weeks became months.  I was officially a lush.  It got to the point where in one day I drank a 750ml bottle of vodka.  And did the same thing the next day.  At this point my roommate had quite enough.  He drove me to the nearest emergency room, where I had a blood alcohol of 0.8-far over the drunk driving limit.  In the emergency room bed, I waited.  I talked to shrinks, who gave me some ativan (similar to valium) for the impending DTs - Delerium Tremens - Withdrawal symptom from heavy alcohol use, sometimes involving hallucinations.</p><p>When I was finally able to walk straight, hours later, my roommate picked me up and brought me back home.  I curled up on my bed, depressed,  still extremely drunk, and just wishing I could go to sleep.  I was looking around my room (lights out) and noticed something strange.  It was similar to the visual effects I had gotten from taking 8-10 benadryls and smoking pot.  While looking at, say, the wall, it was as if a mosiac filter from Adobe Photoshop was applied to my entire visual field.  The solid brown of the wall paneling became many odd-shaped tiles of interlocking shapes.  They were also moving.  The tiles would arrange and rearrange themselves into different patterns.  After a bit of this, not content to be simple wall-flowers, the mosaic patterns started to extend into the space between me and the wall.  The action was becoming quite animated, with motion creating and recreating patterns now fully 3-D at an amazing pace. </p><p>Instead of indistinct shapes, the tiles began to cluster  themselves into beings - intelligent beings who were fully aware of my situation.  I could almost practically hear their thoughts as they morphed into a Dragon, a Lizard, Dinosaur Machine, terror elf, laughing cow.  All these were faces belonging to the same group of beings which were out to scare me witless.  Around this time, I began  feeling heat radiating from below - my futon felt as if it were on  fire.  And it was slowly rotating clockwise underneath me.  First visual and now tactile hallucinations.  Wonderful.</p><p>Luckily, I had experienced hallucinations before.  These now reminded me of NN DMT visuals in complexity and activity.  Positive  that they could not physically hurt me, I let my eyes 'glaze over' in a manner that strengthens visuals when tripping.  The creatures assumed an amazing variety of forms to threaten my sanity with.  They appeared to be souls waiting to be born, the idea being that I had died and was awaiting my next reincarnation.  They called me by name, and assured me that I was dead.  Since I was absolutely sure that all this was 'just' a hallucination, I was able to face them down.  I felt that they were surprised I could resist them.  They expected me to be terrified, while I just lay there the watching scenes unfold, confident of my ultimate physical safety.</p><p>This lasted about 3 hours.  Eventually the bed and walls slowed and finally stopped moving.  Disoriented and unsure of what to expect, I got up and walked to yet another emergency room, asking them if I was done hallucinating or if there was more to come.  I was lucky.  The worst had passed.</p><p>The moral of the story?  Plants and drugs can be glorious blessings, providing access to spiritual realms in a visceral manner that churches cannot match.  Enlightenment and spiritual growth can result from proper use - specifically, dosing with the intent to grow into a better person.  Drugs can ease anxiety, lubricate social contact, help one sleep, sharpen one's wits.  But they do, without exception, change the way our body functions.  At reasonable doses and frequency of use, the changes last only for the duration of the drug in the body.  But an attitude of wanting more and more can easily lead one into physical dependence.  The reality of this was not clear to me when I started messing about with psychedelics and other drugs.  To me, it was all fun and games, until suddenly it was too late.  I found myself trapped in a snare of my own making.</p><p>Addiction is a very real possibility, and should be seriously considered when choosing to use drugs.  Once addicted, you have to face withdrawal symptoms.  That's your body trying to return to normal functioning.  Withdrawals are every bit as bad as trips can be good.  Please respect yourself, recognize that drugs are extremely powerful, and choose to use them thoughtfully and carefully.  Otherwise, you only stand to hurt yourself and those you love.</p><p>Postscript:  In America we are very lucky to have programs to help those who become addicted.  Yes, I'm talking about the 12-step programs of Alcoholics (or insert other drug here) Anonymous.  These groups are fellowships of people who have been addicted and found a way out.  And, more than just a remedy for addiction, these programs offer a viable alternative to using which is every bit as spiritually fulfilling as drugs can be at their best.  After using everything I could get my hands on for about a dozen years, sobriety was a major consciousness-change.  And I didn't lose anything I learned in my trips - rather, I gained a way to integrate those insights into a productive and healthy lifestyle.  Couple sobriety with yoga or meditation and you have a whole new trip altogether!  And it's legal and healthy to boot!  I actually feel that it was worth being a drunk just so I could have the AA experience.  There is nothing to fear in sobriety, despite what I had expected.  We all have our own reasons for using drugs.  Those same reasons might just be a reason to be sober.  Keep an open mind and an open heart. God Bless and Good Luck!</p>",
 "year": "2001",
 "id": "13910",
 "gender": "Male",
 "timestamp": "2005-03-21T08:00:00.000Z",
 "views": "21517",
 "dose": [
  {
   "time": "0",
   "amount": "750 ml",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": ""
  }
 ]
}
