{
 "id": 13924,
 "title": "Wow. Wasn't Expecting That",
 "date": {
  "submission": "2011-09-02T07:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Embrog",
  "gender": "Male",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "9",
    "grams": 0.009
   },
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "The 4-HO-MET I had was presumably the fumarate salt. It was from a Polish source, and I'm pretty confident that all the Polish sources at the time had only the fumarate salt.",
  "Setting: alone at home, feeling good enough to down some psychedelics which I find myself more and more trepidacious of these days. I quickly skim some reports on other people's experiences. They go as high as 27 mg, but most are around 15-20 and say it lasts about 4 hours. OK, 9mg should be a good test-it-out dose. I can spare 3.5 hours or so.",
  "Started ingesting at 6:48 PM, barely finished my glass of green tea + 9mg 4-HO-MET mix and within minutes at 7:05 it has already hit me, kind of a strong come-on too - AND I ATE A SANDWICH NOT HALF AN HOUR AGO... I'm surprised already. Colorful tinges of light all around me, like flashes. Nice. :) Little colorful swirly patters in my peripheral vision. This stuff is a winner already.",
  "7:10 Chills and shivers. It's deff workin' - this is always my sign that the drugs have begun to take hold. A little trippyness playing with my hearing too. :) What follows until 7:50, I wrote in retrospect.",
  "I get under the covers on my bed to beat these chills. Within minutes I get up to write something I wanted to write, but I find I can't focus enough for that. Back to the covers. I'm restless.",
  "Patterns emerge in the carpet, pleasing me. This stuff produces some colorful visions. This is very surprisingly intense for 9mg! I can't do work now, nothing requiring a focused, linear mind anyway. I think of all kinds of things with my mind bouncing from one topic to another. Paranoia floods my brain, I think of so many things I have to do and things I need to change or stop within my everyday life. This is not bad, but I'm realizing that I don't review my actions and the consequences of them well enough lately. Am I in too deep? I don't know. Surely I am. Serious, somewhat intense introspection going on. This is good for me, but not what I want to be doing right now. I want to be laughing and having a good time. I had planned on maybe watching a movie, but there is no way that I could pick one out and be satisfied with my selection, nevermind pay attention to it, nevermind not get distracted by other things and forget I'm trying to select a movie to watch. What do I want? I don't know. I've got enough paranoia. I go into the bathroom and kitchen several times. I'm losing track of what I intend to do when I go to a room... several times.",
  "7:50 Well that wave on intensity is over. Still paranoid thoughts addle me, but not as much as before.",
  "9:30 Intensities of this trip are over now, visual stuff still there. I'm not totally functional at least not on a normal level. I would be very uncomfortable if something unplanned happened right now, like someone coming to my place out of the blue. I go outside on the porch in the dark. Watch for people before sitting down. Still paranoid, but I am daily anyway - just not this much. Watch a neighbor smoke a cigarette. Thinking about stuff. I've calmed myself down quite a bit. This paranoia was fucking with me big time. But like I said, this is good for me.",
  "10:00 Still some butterflies / tenseness / anxiety, visual stuff still there, but not so abundant as it was.",
  "11:13 It's mostly done now. Some visual stuff is still there, but things are winding down.",
  "11:56 It's pretty much over. Some feelings and visuals still linger.",
  "12:15 Pretty much baseline other than some little fading visual tricks.",
  "1:30 My mind is still affected I think, but I took a shower, feeling refreshed - some ever so slight jaw tension... otherwise I feel cleansed. No visuals to speak of.",
  "2:45 Completely baseline now, except, look at that - there's slight rainbow-flaired tracers when I move my hands against a dark background still :)",
  "Notes: I'd say this was about as intense as 25mg of 4-AcO-DMT fumarate, but much faster acting. 4-HO-MET is a potent winner. All the visuals were the classic tryptamine stuff. I would note that this seemed more colorful that most trips though. Total duration: 6 hours with a few more hours of reentry into sober-land."
 ],
 "erowid": {
  "id": "92687",
  "citation": " Embrog. \"Wow. Wasn't Expecting That: experience with 4-HO-MET (ID 92687)\". Erowid.org. Sep 2, 2011. erowid.org/exp/92687",
  "substance": "4-HO-MET",
  "views": "10519"
 }
}
