{
 "id": 13931,
 "title": "METahuasca",
 "date": {
  "submission": "2011-10-04T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "any major dude",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": "165 mg",
   "administration": "oral",
   "substance": "Harmine"
  },
  {
   "time": "0:25",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "MET"
  },
  {
   "time": "0:25",
   "amount": "20 mg",
   "administration": "oral",
   "substance": "Harmine"
  },
  {
   "time": "0:45",
   "amount": "18 mg",
   "administration": "oral",
   "substance": "MET"
  },
  {
   "time": "0:45",
   "amount": "40 mg",
   "administration": "oral",
   "substance": "Harmine"
  },
  {
   "time": "2:35",
   "administration": "smoked",
   "substance": "Tobacco"
  },
  {
   "time": "2:35",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "2:35",
   "amount": "15 mg",
   "administration": "smoked",
   "substance": "MET"
  },
  {
   "time": "2:35",
   "amount": "20 mg",
   "administration": "smoked",
   "substance": "Harmine"
  }
 ],
 "report": [
  "Got a chance to try some MET (n-ethyl-n-methyl-tryptamine) orally with harmine recently, here's the rough notes:",
  "I usually work nights so I have a somewhat inverted sleeping schedule, I'd been awake for about 6-7hrs when I first took the harmine.  I was alone in my apartment for the duration of the experience.",
  "4:45am - Took 165mg Harmine freebase",
  "5:00am - Starting to feel a little different, elevated heart rate & such. Could just be my excitement at the thought of experiencing something rather novel though.",
  "5:10am - Took 40mg MET freebase & 20mg Harmine freebase",
  "5:30am - Definitely starting to feel it, getting some, for me, typical tryptamine arabesque-type visuals & definitely feel off baseline. I'm a bit worried I didn't take enough harmine or possibly MET as well, so I took about 18mg MET & 40mg Harmine.",
  "5:45 - Definitely turned on now. Back & forth between strange & deep thought loops & fits of laughter. Listened to the new portugal the man album. I liked it anyway, but particularly enjoyed it this time.",
  "6:00am - Quite visually rich now, if I let it. Patterns on my kitchen counter etc are raising up & twisting around, but I can control it to some degree, not that I necessarily want to.",
  "~6:30-7ish am - sat out on my back stairs & smoked a few cigarettes while staring at trees (which looked incredible by the way) & pondering the mind & the universe. Leaned back with my eyes closed for a bit & had an interesting vision/train of thought regarding the brain as an inference machine & my odd mental habit of having imagined conversations with my mental constructs of various other people.  The visual aspect of this consisted of visible bits of data flowing into my brain from 360 degrees in all dimensions around my head, ruminated on that for a while.",
  "7:20am - Smoke a joint of mostly cannabis leaves & a little tobacco with 20mg harmine & 15mg MET, definitely kicks things back up a notch or three. Listen to some more music.",
  "8:30am - Definitely on the downslope now, but still wavering between ++ & +++, have a strange urge to watch Arrested Development, so I do.",
  "9:30am - Effects are lingering longer than I thought they would, still in good spirits though. Watching arrested development is causing me almost painful fits of laughter. Good times.",
  "10:30am - Still some lingering effects, not much different than an hour ago, Arrested Development is still hilarious.",
  "11am - Mostly down now, still an occasional undulation in my vision, but those are increasingly infrequent.",
  "All in all a very positive experience. Was truly in need of that laughter as I've been dealing with a couple of stressful personal situations lately. Will definitely repeat, though likely with a single larger dose at the beginning, probably smoke a slightly larger dose at the peak as well. Also plan on doing a combination of MET & DPT with some harmine & harmaline (and possibly tetrahydroharmine as well) at some point in the near future, that might actually be next on the to do list. Especially since this didn't really have that 'jarring' effect I've come to expect from simple tryptamines (DMT, DPT, etc). MET, at least in this context, seems to offer a substantially 'lighter' experience than DMT or DPT. I'd also like to give MPT & mipt a shot at some point as well, all in due time I'm sure.",
  "Thanks for reading!"
 ],
 "erowid": {
  "id": "92719",
  "citation": " any major dude. \"METahuasca: experience with MET & Harmine (ID 92719)\". Erowid.org. Oct 4, 2011. erowid.org/exp/92719",
  "substance": "MET & Harmine",
  "views": "4138"
 }
}
