{
 "id": 13939,
 "title": "Meeting the Spirit Plus a Territorial Dog",
 "date": {
  "submission": "2012-03-07T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Flickering",
  "gender": "Male",
  "weight": 63
 },
 "dose": [
  {
   "time": "0",
   "amount": "g",
   "administration": "oral",
   "substance": "Cacti",
   "form": "dried",
   "specific": "T. peruvianus"
  }
 ],
 "report": [
  "This being a hopefully useful report on low-dose mescaline...",
  "I met the cactus spirit at a strange time in my life (though I wonder if indeed there ever was a time in my life that wasnt strange). Effectively hooked on the psychedelic journey in my increasingly undisciplined quest to find My True Self, I sat down to eat a bowl of cuttings despite having had a terrible week, and not enough sleep. And as it happened, I couldnt even finish the bowl. Not even close  I managed perhaps two thirds of it, or eight inches. My tolerance to its at first anticlimactic bitterness rapidly diminished. After throwing up everything Id choked down, I gave up, and sunk into apathetic resignation that todays experience would have to be postponed. Of course, something did happen  a light experience for sure, but nonetheless distinct  and I resolved to try again in three days, this time, believe it or not, with a significantly higher dose. Not only a whole new branch, but the leftovers from the present one as well. Drying and boiling this time, being one who learns  from his mistakes.",
  "Gradually I noticed that my consciousness was expanding in that most welcoming of ways, and that a jungle-esque mood was coming over me. The rain pattering the rooftop sounded alluring, so I opted to take a walk down to the local fire trail.",
  "As I wandered the rainy streets, I reflected on this beautiful experience I was starting to have. The thought occurred to me that the cactus was, in fact, sharing the experience with me in some way I could not hope to understand. I was witnessing the qualia of the cactus, and the cactus in turn was witnessing the qualia of a unique, disturbed human being. I cannot claim credit for this original idea, but it overtook me, and I fantasized that I was showing this alien entity what it was like to be a human, from the senses down to the physical boundaries and capacities of the body, to the thoughts and emotional complexes. What a strange trip it must have been for the cactus spirit! Perhaps we are similarly gobsmacked at an equally valid world we cant comprehend, when we inhale dimethyltryptamine.",
  "The cactus has a very distinct character to it. Ive heard people say that LSD, psilocybin and mescaline are similar. To me, they are not. There are similarities in terms of intensity, sort of, but each carries a decidedly different mood. First, mescaline is a phenethylamine; and in my opinion, it will not warp your mind like acid, or fuck you like mushrooms. You remain yourself, just a very slowed down, detached version of that self. You take on the cactis inertia, its indifference, its smooth curiosity and its gentleness. In synthesis with the cacti, you arent incapable of moving fast  as I discovered  but you simply do not want to. Being anywhere but at your own center, getting anywhere in a hurry, just doesnt feel right and theres nothing youd rather do but be right where you are, in the moment. In my opinion, you feel at home in nature and dont like confined spaces. Outside, standing still, I resonate with pure energy, ecstatically rushing from the blood in my arms to the nerve endings in my hands. Life is beautiful and everything moves at its own pace, quiet, and calm. So much so that I can almost feel a physical resistance when I move anywhere but where I am at that very moment, as though the world tilts to draw me back to that gravitational core.",
  "Poor timing, then, that at the peak of my trip, I happened to pass by a large house with a big dog. And the gate was open.",
  "I noted this with idle curiosity at first. There he came, loping towards me, barking. Through the open gate. A few rather concerning thoughts popped into my mind: first, obviously, that I was tripping, and in no state for fight or flight. Second, that even sober, I am usually so dissociated that I dont actually feel fear. (Yeah yeah, big tough guy, but it's actually a bit of an empty way to live.) Third, that is a rather large dog with decidedly large teeth, and if I dont do something, he is going to kill me. All of these facts added up to what seemed like nothing but a mildly unfortunate position to find myself in.",
  "I told myself to run. But its hard to kick into full gear when the universe itself is urging you back to that perfect place where you were just standing, and you dont feel any sense of danger, even though you can just about hear this dog panting down your neck. I realized I wasnt going to be able to outrun the hapless creature, so I vaulted the neighbours fence. That it was as tall as I am and had hooked barbs at the top didnt seem to matter, somehow. I avoided the dog and his teeth, I avoided getting spiked, but my shoe still got caught in one of the barbs, twisted me upside down, and dropped me to the dirt.",
  "Ouch, I said, after tugging myself loose. Then, after a moments thought, Well actually, it didnt hurt that much.",
  "The dog, victorious defender of his territory, ran back home. The gate to the property Id trespassed was also open, but he didnt come through. Turns out he didnt feel all that motivated to murder me, either. Nice dog, I reflected. I like him, even though he tried to kill me.",
  "I made my way home, and commented aloud that if the propertys claim to being monitored with surveillance cameras was true, they were free to post this on Youtube. Hippy escapes certain death funny lol. Search for it, it might be up by now.",
  "With none of my flatmates at the house, I sat around playing music, writing this report, and just generally enjoying myself, very chilled out. Looking forward to the next time, thinking about fixing my life somehow. I like mescaline. Peruvian torch has a very friendly quality to it... doesnt judge... just open and warm. I think were going to get along well.",
  "Yes, I wrote this high, and that strange time in my life is now. But, for some more technical notes, post-trip:",
  "It will always be difficult to gauge, especially on a first trip, but my guess is I absorbed anywhere from 150 to 200mg of mescaline. It lasted about four hours, with a nice after-buzz, and at the peak, it crossed from threshold to a light experience.",
  "At this level, there were almost no sensory distortions. I was more sensitive to artificial light, everything seemed more interesting, and when I stopped in the middle of the street, I could feel the world radiating away from me, with a hint of being able to see this happen. The primary effects were in the altered, relaxed state of mind, which I can best describe as feeling primal, natural and very approachable. Soft tribal music would be perfect for mescaline. The percussive rhythm lights up whatever part of the brain stole the show when our ancestors were hunting woolly mammoths and brewing their first Peruvian Torch cactus.",
  "Nausea was minimal, but I threw up three times in quick succession, about an hour and forty minutes after I started eating. Thirty seconds prior, fluid flooded my mouth and I felt strange, prompting me to get a bag to my mouth just in time. The sensation of every last portion of your stomach contents bucketing out your mouth is not pleasant. What is pleasant is how completely fine you feel after  purged, as the shaman would tell you. Its probably an inevitable part of it for me, and I actually prefer it to having enormous quantities of cactus bloating my stomach.",
  "I would only recommend actually aiming for this most mild of levels to someone with a particular reason to be overly cautious. Only a grander experience could possibly be worth enduring that much cactus flesh. Ive downed larger amounts of cough syrup than I like to think about, I survive the notorious Calea Z tea experience every week, but this is too much. They say the pure of heart dont taste the bitterness, which makes me the Devil incarnate. Dry it and boil it into a tea. Im sure it tastes even worse, but at least its gone in a few gulps, and it saves you the ordeal of mouthful after mouthful of sourest gunk that just wont go down your throat until its chewed into liquid. Would recommend gelcaps, but its bound to exacerbate the nausea.",
  "Unlike acid and DXM, there doesnt seem to be any hangover. The price to mind and body is paid at the beginning, not at the end.",
  "My last note is that this psychedelic feels best suited for the spiritual visionary. Its gentle and it wont bite, unlike some large dogs, but its not a party fun drug. I expect to be able to say more on this in a few days, when Ive taken somewhere in the range of 350  450mg. The preparation, ingestion and intent, I believe, should be approached as ritualistically as possible. The cactus will never judge you, and there is no good or bad host for the cactus, but showing respect will enhance the experience. This is probably why it makes for such a powerful healing tool in the Mexican mountain ranges.",
  "Take care, and peace."
 ],
 "erowid": {
  "id": "92798",
  "citation": " Flickering. \"Meeting the Spirit Plus a Territorial Dog: experience with Peruvian torch cacti (ID 92798)\". Erowid.org. Mar 7, 2012. erowid.org/exp/92798",
  "substance": "Peruvian torch cacti",
  "views": "4802"
 }
}
