{
 "id": 13937,
 "title": "So Abstract and Yet Feels so Real",
 "date": {
  "submission": "2012-01-06T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Mootoo",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "100",
    "unit": "mg"
   },
   "substance": "Salvia divinorum"
  },
  {
   "time": "0",
   "amount": {
    "number": "50",
    "unit": "mg"
   },
   "substance": "Methoxetamine "
  }
 ],
 "report": [
  "I originally wrote this for another site that uses the 'SWIM' meme, so excuse me for the ludicrous references to huge mammals.",
  "---",
  "A little green elephant on my roof did Salvia divinorum every few months for a year and a half now; always been a very interesting experience, almost dream-like, but in some way very abstract. Which is why this elephant can't seem to relate to most others' experiences, since they usually involve entities and distinct objects (hallucinations? Or just a misidentification of items in the room?) Most of this elephant's experiences weren't very easy to describe (besides the physical effects), but a recent bout with salvia ended up being much more overwhelming and vivid, in a way so clear he can recall it with enough effort (not so much using 'memory'... it's more of a feeling, isn't it? Or something deeper?) He felt a desire to post here in an attempt to clear his mind of this haunting event (not to say it wasn't interesting - in fact, there may be a correlation).",
  "What has been happening in previous experiences mostly centered around this elephant's life (predominantly worries... which, as he has learned now, is the consciousness being slowly unleashed onto the body... or something). This time around, though, the mind went further ahead (oh, it might also be due to the brilliant idea this elephant had of combining the two dissociatives, SD and MXE, both legal in his country as of this time) - so far it completely forgot about this animal's bulky body, or the nostrils for that matter. This was a brain in a vat.",
  "To cut to the chase (he tends to ramble on about physical, inconsequential stuff) this elephant seems to have gone beyond life, and from what looks like time itself. Now this may be the tricky bit - either this was a display of the meaning of life, or... some kind of representation of everything in thought form. This reality was, after all, made of just thoughts; assumed subjective, which must be why this mammal remains confused even after checking other experiences, poetry and art (which he is terrible at).",
  "This could have also been some collective consciousness, as it felt like the mirror to infinity. What was frightening, though, was the meaning embedded within this consciousness. Is that something the mind can do on its own? It really was an alien concept, none he had ever experienced awake or asleep, even in the strangest of nightmares (and this was yet distinct - it felt more real than anything). He felt like he was looking at the whole of life... and the closest analogy waking consciousness could come up with after all of this is lined dominoes. Somehow everything felt like a single slab, or even stuck as an individual rubik's cube, and as such everything was connected. But the connection had a purpose for some reason; as if every single life form had to send a message to the next, and after they all did life was complete. Perhaps, this elephant could also be confusing life with existence itself, as this felt beyond simple biological interaction.",
  "What really interested him, on the other hand, was this implicit communication that every single 'node' they could feel only existed as some form of test (like a modem being reset, though that's nothing like he actually thought - it was way more abstract) or, it seems, a joke (like a bully playing with ants on a cosmic scale?) - he knows this may look like it implies a god, but it really didn't feel divine! (He also recently encountered a bit of humor in this regards: 'Salvia divinorum is what you get by crossing an entheogen with an atheist.')",
  "After a while, as a good proportion of the time (around half an hour) seemed to be spent in what 'felt' like ego-death, this elephant discovered himself again... very slowly. First by 'looking' at the relative position he was in (it wasn't actually done through the eyes, of course) and then finally realizing that he is separate from all other existence, and that somehow he had to comply for this function to be activated (most likely a test, or perhaps even a puzzle) - a chain reaction in some ways, but with gears (now this is really using quite a few familiar analogies to explain... this elephant most likely did not know of these concepts in this realm).",
  "He seemed to feel like he had a choice just after he was conscious of himself, but feared that non-compliance led to a trampling by the herd (and as such this 'collective compulsion' felt strong). Thereafter, entities from his life started to appear in his consciousness (assuming external, non-salvia induced thoughts?) and soon after the waking state itself, very slowly.",
  "These, by the way, were all either thoughts or feelings, or somewhere in between. No 'hallucinations' were ever identified, but the strong effect was nonetheless felt. It was incredible how existentially powerful this experience was - not scary like death is normally thought of, just extremely strange.",
  "It was mostly abstract, no 'entities' per-se. The only other substance with such an overwhelming experience this elephant has read about (not yet experienced) would probably be 5-MeO-DMT, and as such wonders how the experiences could differ."
 ],
 "erowid": {
  "id": "92791",
  "citation": " Mootoo. \"So Abstract and Yet Feels so Real: experience with Salvia divinorum & Methoxetamine (ID 92791)\". Erowid.org. Jan 6, 2012. erowid.org/exp/92791",
  "substance": "Salvia divinorum & Methoxetamine",
  "views": "2945"
 }
}
