{
 "title": "The Psychedelic Travel Agent",
 "author": "Perceptions Altered",
 "citation": " Perceptions Altered. \"The Psychedelic Travel Agent: experience with Salvia divinorum (10x extract) (ID 13948)\". Erowid.org. Oct 1, 2004. erowid.org/exp/13948",
 "substance": "Salvia divinorum (10x extract)",
 "bodyweight": "155 lb",
 "report": "<p>Intensity: Full blown with travel and entities</p><p>Level 4 & 5 V & I  aspects of Vivid Visionary State and Immaterial Existence state.</p><p>10:25pm-10:40pm</p><p>For a quick intro: I am 19 years of age, experienced with substances of all kinds, and most importantly, thoroughly researched regarding psychoactives.  I believe that drug use should occur only when educated and in conjunction with respect and responsibility.  This writing concerns my 2nd experience with Salvia 10x extract.  I had previously smoked the natural leaf with mild effects.</p><p>Following my last experience with Salvia and my first test of the 10x extract, I decided to give the extract a second try.  I sat down on my bed and rested my back up against the wall.  I packed a strong dose into my glass pipe and smoked the hits down with aggression, determined to achieve full blown effects.  Upon smoking, I felt the initial Salvia presence set in.  At first I thought that I would not achieve an all out visual experience, but what happened the next moment proved my prediction wrong.  Reality as I knew it ceased to exist.  My dorm room vanished and was replaced by an all encompassing hallucination.  The vision was so realistic that while under the influence, I had no idea it was false.  Plainly, the Salvia state became my reality!  Life had turned into a living dream of sorts.  My dorm room and everything in it disappeared and a real life scene appeared in its place.  The transformation was instant.  My earthly surroundings were no longer visible. </p><p>My dorm room had turned into a city street at night!  There was a metal fence and street lights on the right, and a street in the middle.  The area around the vision was dark as it would be beyond the glow of the street lights.  This whole vision was taken in as if I was a ghostlike entity witnessing an earthly scene.  I was elevated from the street scene I was experiencing.  The only explanation I can give that might clarify this notion is that I felt as if I was in the film A Christmas Carol, and I was a ghost hovering above a real life scene as Scrooge was.  My bed was elevated from the street and was the only piece of furniture in my room that hadnt transformed into the vision.  I sat immobile and looked on with no fear or paranoia involved.  I was actually in a pleasant trance while engulfed in this major hallucination.  On the street there were people walking in my direction.  The street didnt seem overly busy, but that there were at least ten full blown human beings walking on the street, all in the same direction.  The people were all wearing lengthy coats which seemed to be variations of the same color. </p><p>In other words, the people were all wearing similar tan colored coats.  I failed to pick out a woman among the bunch, so they may have been all men.  The people continued to walk in my direction and I could here the sounds of their walking and other sounds that go hand in hand with a  group of walking people.  I could even hear faint talking but couldnt clearly make anything out.  This proves that I was not only seeing full blown entities, but also hearing the full blown audio hallucinations that came along with the presence of these entities.  There were no cars or other aspects to the vision.  It was just the fence, the lights, the street, the dark background, and the group of people walking.  The people continued walking, all with their heads tilted partially down so that I could not make out any of their faces.   This was the case as they moved closer and filtered almost underneath my point of view.  All of the people kept their heads down until one man in the lead raised his head up, looked me dead in the eyes, and proceeded to walk. </p><p>The entity that made eye contact with me was a young to middle aged black male.  He too was wearing a tan trench coat of sorts and walking with the rest.  Just as soon as he looked at me and put his head back down, the hallucination began to dissolve.  The vision had come without warning and soon faded into a hallucination that consisted of the furniture and the room twisting out of a center vision until they returned to their normal states.  It was like reality spiraled back into place, something I would expect in a strange sci-fi scene.  The black man turned back into my chair, which had a pair of khakis draped over it.  This could explain why the people had tan coats.  The two standing dressers as well as my computer desk spun in a circular motion until they situated themselves back to where they normally appear.  Just as fast as the vision came, it left with the same urgency. </p><p>Overall the experience was intensely visual, dissociating, and immobilizing on my mind and body.  I sat in the same position from start to finish with my back securely rested on the wall.  Time was of no importance.  I had seen entities, witnessed my room change into a city street, and heard the voices and footsteps of the entities walking before me.  The description of my experience may sound absurd to someone inexperienced with psychedelics, but I assure you the experience I had was as real as anything.  Not one part of this story is fabricated in the least.  This is because the experience I received needs no exaggeration.  What happened to me in that 5-10 minutes of my life was something I could have never prepared for, nor expected.  The experience in all its intensity urges me to ask questions of life and meaning.  Why was a young black male the only one to make eye contact with me?  Why were the rest of the people refusing to raise their heads and make their faces known?  Why did I witness a group of males opposed to females?  Why did my field of vision turn into a city street opposed to a mountain valley?  For these are questions I cant possibly answer, but firmly believe the Plant Teacher wants me to ask.</p><p>Knowledge&Respect=Understanding</p>",
 "year": "2002",
 "id": "13948",
 "gender": "Male",
 "timestamp": "2004-10-01T07:00:00.000Z",
 "views": "13156",
 "dose": [
  {
   "time": "0",
   "amount": "1 bowl",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(extract - 10x)"
  }
 ]
}
