{
 "id": 13942,
 "title": "Sight Seeing With Cubensis",
 "date": {
  "submission": "2013-07-19T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hannibal",
  "gender": "Male",
  "weight": 86
 },
 "dose": [
  {
   "time": "0",
   "amount": "5.5 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "dried",
   "specific": "P. cubensis"
  }
 ],
 "report": [
  "Me and B were quite the drug users. We were best friends, we hung out almost everyday and smoked bud. We've had several experiences with mushrooms and other hallucinogenics. This was one of about 8 trips that we've done. Most of which we did together. B and I never really liked other people. We never drank, never took pills, never did coke, or even ever partied. We were two good friends who both explored psycadelia, and meditated, and smoked pot, and studied many sciences.",
  "One summer morning I got a text, 'Today, we trip'. We were quite dedicated about what we did. So, of course, that day I canceled all my plans, and took the day off from work. The night before we bought two bags of Psilocybe cubensis (dried) for about 40 dollars per 1/8. Yes, I know that's a lot, it's a monopoly here in Iowa. Both weighing 5.5 grams.",
  "T+ 00:00. B made a sandwich and put the fungus on that and ate it. I just ate them plain. I find eating them plain to be the easiest way.",
  "T+ 00:10-15. After we ate them we remembered that we were going to meet our trip-sitter at the McDonalds a few blocks away. So, we walked over there. About 10-15 minutes after eating them we started feeling the effects. Lightheadedness, spacing out, anxiety, numbness, confusion. All of this started about the time my friend ordered his food. I walked up and ordered it all for my trip sitter, but I didn't eat anything.",
  "T+ 00:30. Once we sat down to eat, me and B both were at about the same level of consciousness. This was at the stage of the come-up, but not a full blown trip yet of course. B's pupils were more dilated than I've ever seen; blackness just completely over his eyes. At this point we were both laughing extremely hard at everything. To me, everything looked, and felt, like it was a cartoon. My body felt like it was kind of melting in with everything around me (which feels pretty amazing, I should say). Once we sat down me and B both just laughed and talked. We almost forgot about the drugs we just consumed.",
  "T+ 00:45. We finally left McDonalds and we were pretty close to peaking at this point. My consciousness seemed to overlap into my senses. Everything I thought about I could pretty much sense, and see. I had a complete change in depth perception. Everything around us looked as though it was 50 feet tall, and I felt like I was shrinking by the minute. Sound took a whole new meaning. All of the noise from the cars and the wind seemed to flow much smoother. Everything we heard had a certain depth to it, like we were in a giant auditorium.",
  "T+ 01:00. By this time me and B were alone together with out a sitter. I remember sitting at the park on a bench just looking around. My visuals were quite intense: melting, twirling, cartoonish color schemes. Objects tended to shrink, and get bigger, and breath, and appear alive. Sitting on the bench felt like we were on a huge mass of wood about 500 feet tall, and we were looking out at the scenery like we were looking over the Grand Canyon.",
  "T+ 01:30. B starting feeling slightly nervous, considering a  group of people started walking through the park. We decided we would walk back inside. B's house was about a block away from the park, so we walked the trail over to his road. The whole walk felt like a ride in a plane. The ground, and everything around me had a certain blurriness/tint to it. The ground also moved up and down like waves in the ocean. Once we made it to the road, cars looked like giant space ships. As the cars drove by they looked like giant, bulky spaceships just hovering by with a gust of wind that almost knocked us over.",
  "T+ 02:00. B and I finally made it home after about a 5 minute walk which felt about 2 hours. We both ran inside of his house. His house felt like a giant machine. The entire house felt like it was breathing, and we were just little insects crawling around inside of this massive factory. The ceiling boiled and the walls looked like water. We both jumped on his parents' and sister's beds and we rolled around and laughed and ran around his house just laughing and singing.",
  "T+ 3:00. While still peaking pretty hard, we laid on a bed listening to Dark Side of the Moon, just staring up at the ceiling as it took shape, and performed a light show for us. His entire room melted and flowed in and out. His bed felt like a ship, and the whole room was the ocean. As the music played, the room shifted and breathed to the sound of the music. The music could be seen and felt. Waves rippled the walls around the speaker like some one threw a rock into water.",
  "T+ 3:30. After our trip started to come down, B and I had a smoke outside. We talked about our deepest emotions. And our true thoughts on things. The cigarette buzz was enhanced by several thousand. The smoke was elegant and was beautiful.",
  "T+ 4:00. The effects were mostly wearing off but I still had the intense euphoric body buzz, and the melting feeling in my arms and legs. My vision was mostly back to normal, just a slight blur.",
  "This was my best trip I ever had. B and I both had things planned out. We had the best place to trip and everything was in the best condition. Overall the trip, just like all my other trips, made me have a mental state of complete comfort with the world. I had a profound interest in the world around me. My boundary between my reality and my subconscious was broken. I felt like I understood everything about myself. Everything that ever happened in my life flashed in front of me and I forgave myself for everything I ever felt guilty for, and I was fully accepting of my life and all the things in it."
 ],
 "erowid": {
  "id": "92813",
  "citation": " Hannibal. \"Sight Seeing With Cubensis: experience with Mushrooms - P. cubensis (ID 92813)\". Erowid.org. Jul 19, 2013. erowid.org/exp/92813",
  "substance": "Mushrooms - P. cubensis",
  "views": "755"
 }
}
