{
 "id": 13958,
 "title": "At the Center of the Universe",
 "date": {
  "submission": "2013-07-27T07:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "JD",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "insufflated",
   "substance": "Cocaine",
   "form": "powder / crystals"
  },
  {
   "time": "0",
   "amount": "5 tablets",
   "administration": "oral",
   "substance": "MDMA",
   "form": "pill / tablet"
  },
  {
   "time": "0",
   "amount": "joints/cigs",
   "administration": "smoked",
   "substance": "Tobacco",
   "form": ""
  }
 ],
 "report": [
  "The most recent time I rolled was at the Identity Festival at the Gorge Amphitheater in Washington. I hadnt done MDMA since Sasquatch in May and I had a great time there so I really couldnt wait to do it over this weekend.",
  "My experience with molly was quite limited as I had only done it twice before. The first time was at my house with a few close friends. Most of us didnt know what the hell we were doing so we each only took one hit. Although I had to wait for about 2 hours for it to kick in, the effect was amazing. My friend and I just ended up wailing on the heavy bag for a good 2 hours and by the end our hands and knuckles were completely torn up and blood was running down my arm. People say molly is more of an emotional experience but perhaps due to my background in athletics the physical release accompanying the emotional high is what creates the pure ecstasy.",
  "The second time rolling was at Sasquatch Festival in May. When I got there on Saturday at about 11, I had a fifth of vodka downed in about 20 minutes and blacked out until about 4:30. I was out of money and had to leave the venue in order to get food and water because I felt like absolute shit. There was no re-entry, so in order to get back in I ended up somehow making it onto the VIP shuttle and was dropped off backstage at the Matt & Kim show. After hanging out there for a time I finally walked back into the festival grounds. My body caught up with me though, as I began to wretch everywhere and had one of the worst headaches in my life. I popped 2 rolls and ate a little in order to recover. After about an hour my headache was completely gone and I felt awesome. Sleigh Bells and Bassnectar were so much fun while rolling. In retrospect I treated myself like a piece of shit on that day, completely disregarding my personal health in order to have a good time. I decided that the next time I rolled I would take good care of myself.",
  "On to Identity.",
  "My friends and I arrived at the gorge around 1:30 in the afternoon as the show was set to start at 2. It was about 100 degrees that day so everyone was taking care of themselves by getting adequate food and water. I knew I wouldnt really be eating again until late that night so I decided to chow down in the morning/afternoon, which was a great decision.",
  "I was planning on getting drunk but we went into the festival almost as soon as we got there so that was a no go. Looking back on it, that was definitely the best thing that could have happened to me. I would now be able to experience the full effects of MDMA and my body would not be burdened down at all. I knew that if I smoked I would just end up getting stoned and tired, and I wasnt planning on rolling until later that night. My friend had some blow so we decided that would hold us over until later. I did about a line an hour, and honestly it really didnt do much. I used to think cocaine was the best feeling I could ever have on a drug, but this time it was more of an energy shot and nothing else. I got a headache from railing it and the drip tasted disgusting.",
  "So theres the context, now I want to get into the actual experience.",
  "Now I had never been to a real rave before and hadnt really even listened to any of the artists that were going to be playing. I enjoy dubstep but this was more of an electronic concert so I was interested to see how the performers would amp up the crowd with what I thought would be chill music. There were about 14,000 people there and the venue was packed. I was planning on taking 5 hits and was a bit apprehensive. I was a bit coked out too, so questions were constantly running through my head: What if it doesnt work? What if I havent had enough to eat or drink to day? What if I pass out from dehydration? What if I pass out from water intoxication? What if I go too nuts? What if I die? What will my parents think? I calmed down by reminding myself I had taken all of the necessary precautions and it would take some freak and ridiculously unrealistic accident to happen to fuck things up; everything was going to be ok and I was going to have a great time.",
  "The time had come. It was 7:35 and the Pretty Lights set started at 7:45. I took all 5 of my hits at once. I chewed up the caps and was surprised that the taste was not as bitter as I anticipated. Since my stomach was completely empty, the first wave hit me after about 5 minutes. I looked up and around at the crowd and a pulse went through my body, starting at my feet and continuing through my chest and head. It felt like an EMP going off inside my body while doing a morning stretch right after waking up. I smiled, a huge smile, I felt amazing.",
  "This night was going to be epic.",
  "Pretty Lights began his set and the energy was wild. The gorge had a beautiful sunset going down, and my friend had red tinted sunglasses that made it look even more amazing. The group I was with was about 7 rows back from the front, and the light show was awe-inspiring. Most of the night is just an ecstatic blur. Every moment is clear but most details are lost as I lost myself inside the music. Two more of my friend somehow ended up finding us and told us to come to the outskirts of the pit to dance around.",
  "The people right outside the main mob by the stage are the ones you wanna be with. When I roll I have an extreme amount of energy, more than all of my friends, so the more room to smash around the better. Even my friend Dave who I was with noticed that the two of us had more energy than everyone around us. Just dancing our hearts out, jumping to the bass was bliss, pure bliss.",
  "Everyone at a rave is awesome. People know exactly how others are feeling and do all they can to increase the experience of everyone around them. Pouring water on people, massages, Vicks Vapo-rub, breaking open glowsticks and throwing the juice around, it was all awesome. One of my buddies described a rave as a giant party with your best friends who youve never met. Its true, and the emotional effect of the molly made me want to connect with each and every person that was there. This connection was most apparent during Kaskades set when he played Eyes. I stared into the eye visual and felt the most intense love for every person in attendance. We were all there to just listen to beautiful music and have a day none of us would ever forget. The music brought us together as nothing else could. We all look different, have different interests, know different things, think different thoughts, yet when that bass drop and fills our tiny little world with the most intense, positive emotion imaginable, everyone is the same, and all are one.",
  "I imagined music advancing the struggle for peace in the world. Then I realized that we were all there because we liked the same music. If someone put on some country music or chanting or something, everyone would have been pissed and confused and wouldnt want to listen to it. I reasoned that there will probably never be ultimate peace in our world because we all have such vastly different tastes and are rooted so firmly in what we believe that we despise anyone who thinks differently. For me personally, I imagined all those who werent there, but loved them too, as they were hopefully doing what they felt was right and good. I thought of the millions of different communities throughout the world, and the overwhelming amount of people on this planet, all giving something different to the world. This myriad of human experiences let me know that, although we may have different struggles and points of happiness, we are all connected at a mental and spiritual level.",
  "While dancing around I did my best to get people who werent feeling it to the same level that I was. Some just kept doing their own thing, others responded positively and reacted to what I was doing. Those connections in the eyes and emotions are unforgettable. Although Ill probably never see any of these people ever again, I know that this one night, at that one time, we were together at the center of the universe.",
  "I smoked a menthol at one of the drops and was blown away at the power the tobacco had. My feet had gone from my body and I was dancing on air, floating in space, consumed by sound. My body was moving with the music, I was the best dancer to ever live. I watched multiple people do the light glove thing, and could easily tell who was better and who was worse. Yet I didnt prefer either, I was just so happy that those who werent that good were still taking the step to perform in front of others. All barriers had gone down, all insecurities had dissolved, life was beautiful, seen without the cloud of doubt and second-guessing. Everything had meaning, I could read the emotions of people simply by looking into their eyes; every single person was a interesting, unique entity.",
  "I kept making eye contact with many different girls to see if any would click and there were a few that did. It wasnt a sexual thing at all, I just wanted to connect with someone of the opposite sex, to feel that love that a girlfriend gives you, something I hadnt felt in a very long time. That feeling was never fulfilled but it was fine, life was gorgeous no matter what happened to me.",
  "The show was over, my come down included falling asleep. People stayed up to party, but I didnt really want to talk, just sit there and reflect and cool down. My ideal situation would have been for everyone in my group to lie down in the grass in a circle with our heads in the center. Not saying anything, just drifting off while staring at the moon and stars.",
  "The next day I felt happy. I was completely wiped from the day before but my mindset was so positive. Im writing this five days after rolling, and my mindstate is still on the up. The best thing is that I remember every emotion I felt while rolling, and can easily connect to it now while sober. There was really no comedown.",
  "All in all, through introspection and reflection on that night, I have been so much more motivated to fill every moment of life with all that I can. I ended up listening to Time by Pink Floyd for the first time, and it hit me so deep. Life is simply about making connections, with as many people as you can and as deeply as you can. Whenever I am apprehensive about approaching or talking to someone, I now think how all anyone wants is a friend. Everyone loves it when people talk with them, when they are able to express themselves to another person, to put their ideas and interests in the mind of another. My love of life has increased so much, and yes, I have a drug to thank for that. Everything in existence is here for a reason, whether good or bad, and MDMA has helped me personally realize that. All life, all matter, every person, should be cherished and loved.",
  "~ Say who I am, say I am you ~",
  "~ Theres no me or you, its just us ~"
 ],
 "erowid": {
  "id": "92867",
  "citation": " JD. \"At the Center of the Universe: experience with MDMA & Cocaine (ID 92867)\". Erowid.org. Jul 27, 2013. erowid.org/exp/92867",
  "substance": "MDMA & Cocaine",
  "views": "1106"
 }
}
