{
 "id": 13956,
 "title": "Divine Frustration",
 "date": {
  "submission": "2004-09-23T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "soundgardner",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "5 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  {
   "time": "9:59",
   "amount": "6 hits",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "So I get in the mail my 60 grams of Salvia divinorum foliage, more excited than the day I bought a pound of herb. I have read just about everything I can find about it and I'm psyched as hell when I whip out the bong and pack a medium sized bowl. I smoked about 5 or 6 hits, after each hit I felt kinda more and more spacey, and at that point I get this head rush of heat, like being in the sun all day with no water, figure it's time to put the bong down, so I lie down, and besides being spacey my body feels kinda weird, but to my dissapointment 5-10 minutes later I feel sober and super burnt like from smokin alot of bud.",
  "So then I decide, well maybe its something u gotta get used to like acid or weed, and smoke myself stupid with fresh kind buds. My friend motions to me to pack more salvia, and feeling like the weed might give it a push like it does to most hallucinogens, we smoke like 6 more hits each. This time I notice a slight tryptamine like patterning, and weird body feeling, but still only for like the length of one soundgarden song (like 5-7 minutes or so). I'm begining to get really frustrated because since then I've smoked nearly 10 grams of it to myself over like a week and a half but still no intense spiritual experience or even anything as powerful as a weak acid trip.",
  "Its just about the most confusing thing to smoke and tastes much worse then resin especially when u gotta hold it in for so long."
 ],
 "erowid": {
  "id": "9286",
  "citation": " soundgardner. \"Divine Frustration: experience with Salvia divinorum & Cannabis (ID 9286)\". Erowid.org. Sep 23, 2004. erowid.org/exp/9286",
  "substance": "Salvia divinorum & Cannabis",
  "views": "4986"
 }
}
