{
 "id": 13964,
 "title": "Clean Stimulation With Mellow Comedown",
 "date": {
  "submission": "2012-01-03T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "exopian",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "oral",
   "substance": "4-Fluoroamphetamine",
   "form": "powder/crystals"
  },
  {
   "time": "22:00",
   "amount": {
    "unit": "mg",
    "quantity": "100",
    "grams": 0.1
   },
   "administration": "oral",
   "substance": "4-Fluoroamphetamine",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "The 'trip' of this really isn't a dynamic journey as I would experience on a hallucinogen, so I will explain it in more of an outline/timeline of effects. I take recordings of my state and experience on a voice recorder whenever I notice the effects shifting. This helps to recount states, and get an accurate timeline of effects.",
  "Firstly, I would like to say that this is a promising compound. It shows some homage to MDMA, being both a phenethylamine and an amphetamine. This certainly puts it a step above most cathinone stimulants which are flooding the RC market today (MDPV, for example). Though that isn't to say this is entirely a forgiving substance. Phens and Amps alike both have notorious side effects when abused. Be advised it may cause a false positive for MDMA or amphetamine on a 5 panel test.",
  "My 4-fa was a white powder with a somewhat coarse consistency, with 'rocks' being distributed throughout. It easily broke down into a fine powder when kneaded. 100Mg was weighed out on a nice scale, then added to a small cup of orange juice and downed. I had some definite anxiety going in, as I would with any substance. I was concerned this anxiety might get worse when the effects hit full gear, but this was not the case.",
  "T + 35 minutes :  The effects are coming on strong and rapidly. A warm and floaty sensation fills my body.  Anxiety is gone, and my mind enters a somewhat placid, but focused state where I'm able to fluidly converse.",
  "T + 45 minutes :  I'm riding (not driving) in a car at this point. I feel very at ease, but my situational awareness in regards to traffic feels quite sharp. I'm conversing with the passenger and other driver, and the empathogenic effects feel noticable. I sense a deeper level of understanding in regards to the subleties of the conversational flow and body language. I check my pulse, and feel my blood pressure has markedly increased.",
  "T + 60 minutes :  We are no longer in the car. This is a large social function, and I'm to be the designated photographer and audio/video person. I introduce myself to everyone on site and make some small talk, as to make them comfortable to the presence of a photographer. This is an effortless ordeal in this state of mind. In the floaty yet engaged state I'm in, it almost seems to happen under it's own accord.",
  "T + 2.5 hours  :  The floaty/warm/placid feelings have diminished. I've been busy and engaged the past 90 minutes, totally absorbed in my task. I check my pulse. Blood pressure has gone down somewhat. I feel incredibly thirsty, and make a personal note-to-self to stay hydrated.",
  "T + 4.5 hours  :  At this point, the floaty/entactogen effect has long since passed.  The peak came and went.  However, the stimulant-assisted focus is running strong. I feel somewhat worried that I was going to start to come down and crash, but this did not happen.",
  "T + 10 hours  : It's well into the night, and I'm physically exhausted. The event was pretty much over, save for a small handful of dedicated partygoers. Only after witnessing the cleanup of the food and banquet tables do I realize that I had not eaten anything the entire day. Indeed a characteristic amphetamine side effect.",
  "T + 12 hours  : I'm given the duty to drive my party home, as I'm the only one who did not partake in any alcohol. I feel up to the task, and make the drive. With no physical activity, fatigue begins to surface and battle with the stimulation.",
  "T + 16 hours  :  After some good chats, my party and I go to sleep. Yes, I said sleep. I get some rest without much trouble, and manage to sleep about 4 hours. I wake up feeling refreshed and fantastic.",
  "T + 20 hours  :  It's been nearly 24 hours since I'd last eaten, and that was just a snack taken with my dose. I have another busy day ahead of me retouching these photos, going out on the town with an old friend, and doing yet another photoshoot in the evening. I try to eat, but food is not agreeing with me. I feel cold, and my lips are badly chapped. I instead make myself a nice glass of tea and take it with a few glasses of water. Oddly enough, I feel mild residual stimulant effects. I think this is much longer acting than people give it credit for.",
  "T + 22  hours   :  Deciding my experience was successful, I redose another 100mg with orange juice to help me assist in my tasks.",
  "T + 22.5 hours   :  The warm floaty effects are coming on, but they are quite mild compared to last time. The familiar stimulation sensation kicks in, and I'm ready to get down with my days tasks.",
  "T + 25 hours  :  Basically the same effects as the day before, with diminished entactogen effects. Paranoia is coming in waves. It's quelled with a bit of self-centering.",
  "T +  37 hours   :  Paranoia waves have subsided, and I finally manage to eat a meal. The meal and break from tasks come as a pleasant reprieve for both mind and body.",
  "T +  45 hours  :  I finally start to wind down, and get a hot shower. This is incredibly relaxing, and I fall asleep easily.",
  "T + 48 hours : I wake up feeling absolutely dreadful. My kidneys hurt.  There is terrible nausea. Despite being exhausted, I cannot quiet the cacophony of painful echos that ambient light and sounds seems to trigger. I drag myself up out of bed and fix a cup of ginger tea. Anything with more weight than that sounds putrid. I decide that I'm going to detoxify.",
  "T + 49 hours : The dread has subsided, and I feel incredibly light-headed. I don't know how much this has to do with nutritional deprivation, and how much of it is to do with the drug. Regardless, I manage to drink a soda and a few glasses of water.",
  "T + 49.5 hours : I'm feeling back to my normal self. The crash was actually quite manageable. I'm back on my feet in my usual state, enjoying my day off, and drinking lots of juice! This is the last pertinent update I have to give.",
  "So in closing, I'd like to say that this seems like a very feasible stimulant if used in moderation. It has a mellow, but firm kick that won't make me act tweaked out. The crash is gradual and manageable. In my case, it probably could have been diminished with better nutrition and hydration.",
  "I can certainly see habitual use forming if you depend on it for anything other than an occasional boost. Keep yourself hydrated, and remember to get some light food in your system throughout. It's entirely too easy to get absorbed in what you're doing and lose track of time.",
  "Perhaps keep a bit of chapstick handy! ;)"
 ],
 "erowid": {
  "id": "92882",
  "citation": " exopian. \"Clean Stimulation With Mellow Comedown: experience with 4-Fluoroamphetamine (ID 92882)\". Erowid.org. Jan 3, 2012. erowid.org/exp/92882",
  "substance": "4-Fluoroamphetamine",
  "views": "14467"
 }
}
