{
 "id": 13969,
 "title": "Doses with Respect to SSRI Use",
 "date": {
  "submission": "2004-07-02T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Afflatus",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "3.5 g",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(dried)"
  },
  {
   "time": "0",
   "amount": "drops",
   "administration": "oral",
   "substance": "Pharms - Venlafaxine",
   "form": "(daily)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "First I will get the technical stuff out of the way.  I am a 23 yr old male and take 275mgs of Time Released Effexor every day.  I have currently been on the medication for a year (and doing quite well I might add).  My first experiences with halluncinagens were in my early teens when on no medication.  They were all filled with vibrant intensity (sometimes too much in the case of lsd). I always held a special place for shrooms in my head.  So the memory of the vivid colors, loss of time concept, the feeling of being inter-connected with everyone and everything was enough to spark a renewed interest in the substance.",
  "Approximately with a four year lapse in experiments with the drug, I recently had the opportunity to revisit that special place.  What better a time and place than seeing Phil Lesh in Berkley, Ca.  I ate 3.5gms of what appeared to be good looking cubensis stems and caps.  My friend did the same.  In about a half of an hour, I could tell the effects were showing themselves to my friend, but I, however, was not so sure.  With a little bit of placebo and probably some real affects, I agreed with him.  I felt the familiar feeling of the looseness in my arms and legs.  Peripherals were all too active, so I knew I was beginning to trip.  After about an hour, however, my friend was in the zone.  I was only merely feeling the body high, waiting patiently for that loss of ego that seems to happen in every trip.  As he glistened with delightment, I realized I was not tripping as hard as he.  I smoked some high grade marijuana to see if I could catapult myself into the divine.  It did do the job for around a half of an hour, yet I still knew I was not 'as far gone' as I remembered being, or that of my friend. ",
  "It was then that I wondered if the SSRI that I take might have an effect on my trip.  I knew that both involved serotonin and decided to research my dillema.  I did not initially find much information on any interactions between SSRIs and shrooms.  I did, however, find evidence of the trip being enhanced by an MAOI.  As SSRIs and MAOIs can have severe drug interactions (which I have experienced and do not reccomend), I was a tad bit worried that a possible ill affect might result in combining shrooms and SSRIs. [Erowid Note: there is not indication the author took an MAOI]",
  "Because I did not feel any of the ill affects of a drug interaction during my trip, I decided to experiment with dosage.  For the next trip I ate the same amount (3.5grams) of what looked to be lesser quality cubensis.  Again, the friends that I ate with were far beyond my state of mind, so I downed another 3.5 grams.  Within an hour, I was in that place that I was trying so hard to remember.  I had no concept of time (it was uneseccary).  Colors were so vivid that I felt I could feel their energy.  I proceeded to get lost from my group, but it was no cause for alarm.  I felt an all encompassing peace around me.  Everything was as it should have been, all was right with the world.  If I stared for more than a second on any one thing, I could watch a dance unfold around me.  Peripheral vision seemed so acute, although I could not concentrate on anything in particular.  When I closed my eyes, colors appeared in all shapes and forms not explainable with words.  It was the glory for which I had been searching. ",
  "With my theory on its way, I proceeded to trip three more times in the following months.  During these I recorded the dosage and the affects compared with the same individual.  He is a very good friend of mine, and we communicate very well.  I had tripped with him many times before taking SSRIs and knew his descriptions to be accurate reflections of my experiences.  Through him, I was able to find a very similar experience when I dosed twice the amount he did.  I know I have not the scientific knowledge or enough experiments to make any sort of ratio (too many factors including the type of SSRI, the dosage of an SSRI, or even a recent trip without an SSRI being taken).  But with my best memory of pre-SSRI trips and subsequent trips, and the recorded evidence of my experiments, I found that I need to eat about twice as much as I normally would.  The effects of the shrooms were surely decreased. ",
  "I am planning on trying the same experiments while refraining from my SSRIs for at least three days.  I have read that this is enough time to improve sexual disfunction that can sometimes occur with SSRIs.  I presume the effects of the trip will be greater at a lower dosage if I am to refrain from my SSRIs.    I hope this is read by anyone else who has the question of the relationship of SSRIs and shrooms, and I hope that it might shed some light on an undiscovered topic.  If you have similar or conflicting stories, I urge you to post them, as I am interested, and am sure many others are as well."
 ],
 "erowid": {
  "id": "9291",
  "citation": " Afflatus. \"Doses with Respect to SSRI Use: experience with Mushrooms (P. cubensis), Venlafaxine & Cannabis (ID 9291)\". Erowid.org. Jul 2, 2004. erowid.org/exp/9291",
  "substance": "Mushrooms (P. cubensis), Venlafaxine & Cannabis",
  "views": "14481"
 }
}
