{
 "id": 13966,
 "title": "Fun Fear and Situational Comedy",
 "date": {
  "submission": "2004-06-24T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Glowstickfluid",
  "gender": "Male",
  "weight": "142 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "2 hits",
   "administration": "oral",
   "substance": "LSD"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Cannabis"
  },
  {
   "time": "17:00",
   "amount": "2 tablets",
   "administration": "oral",
   "substance": "Pharms - Sertraline"
  }
 ],
 "report": [
  "My friend and I had smoked about an eighth of some absolutely chronic weed and were very stoned when we were offered acid in a park nearby.  My friend having done acid before decided that I needed the experience, so I agreed and bought 8 hits, my friend immediately consumed 4 whole hits of very good acid.  I held on to mine.  We walked home about an hour later and my weed effects were starting to wear down, I was feeling a little bit tired and hungry, so I decided to drop the acid about 2 minutes away from my house, I gobbled down the sugarcube (2 hits) and then another half (1 hit) and continued walking. My friend took another 1 hit, he was telling me that this stuff was amazing quality and I started to get excited.",
  "0:10- no effects as of yet, talked to my parents and was a little nervous I would start tripping while talking to them.",
  "0:20- ridiculous body sensations, feeling odd and light headed, got some food and went to basement, weird stomach cramps",
  "0:50- the trip begins, I start giggling and I feel like everything inside of me tickles, it's very funny and I can't stop laughing, I am sitting on my bed drinking orange juice and my friend is sitting on his bed throwing a tennis ball up and continually missing catching it.",
  "1:00- stomach cramps, burping, strange nauseaus feelings which I ignore and enjoy the trip, time becomes bizarre, time skips (ie. 10minutes where I couldn't remember a thing that had just happened)",
  "1:40- almost 2 hours after taking it and the effects are still getting stronger, I am slightly scared it's never gonna end getting stronger but am having too much fun to care, my friend and I are making strange noises trying to communicate how we feel",
  "2:30- playing with pillows, drew a 30minute blank where I can not remember a thing that has happened, just remember feeling and seeing orange everywhere, like flying inside a peach (coincedentally or not my pillow is orange)",
  "3:00- friend and I are silent totally zoned out occasionally broken by giggles it's now about 2 in the morning",
  "5:00- I pee about 15 times in the space of an hour, feeling awkward, giggles occasional, weird muscle twitches and cannot sit still, go to bathroom and look at face, VERY funny and scary, patterns on wall are moving in a spiral, colours are very increased, starting to come back to some semblance of reality but still feeling amazing and weird",
  "5:30- am I bad tripping, I'm scared, should I turn off the lights, I have no control of my body, my skins itchy, sticky, I'm a lizard, help... I tell this to my friend who's been with me when I bad tripped on mushrooms once, he didn't want me to bother him again so he told me, 'shh... it's ok man, you're fine, we took acid and boy it's good, it's about 4:30am we should get some sleep eh?... this was very soothing",
  "6:15- we sleep",
  "8:15- my dad barges into the room, come on guys GET UP, time for your wilderness camp, 'what the hell?' I think... oh NO! I just remembered that I have a kayaking trip starting today and I haven't packed!  oh my god I'm still absolutely ripped on acid! ",
  "8:30- I get up in a hazy fog, my body feels like I'm being tickled by a thousand feathers, my vision is acidy, in a kind of flashy way, almost like a strobe light.  I take a bath and feel all kinds of awkward sensations, I am tired too, but the trip is still at a good strong strength... but my mind is there too, I am feeling all the body effects, and a quarter of the visual strengths but I still feel muddled and confused.",
  "9:00- I start packing for the camp, I establish with my friend that he's still ripped on the acid too, our eyes are huge, we gulp down orange juice and I feel sick.  but I try to concentrate on packing my bag, let's see I have a list in one hand... I try to read the letters, they are dancing around the page... fuck it, just grab stuff and fill your bag...",
  "Even this was complicated, we'd go through 5 minute laughing breaks, and stop and talk and forget what we were doing, it took nearly 2 hours to pack our bags, ( I later discovered that my bag was filled with useless shit ie. bath robes, 4 sweaters even though middle of summer, no shorts etc.)",
  "11:20- my dad drives us towards the camp but stops to pick up my sister from a seaport, my friend and I are in a small island village feeling intensely messed up after 2hours of sleep and of course the LSD... everythings skipping, like cars weren't moving fluidly they would disappear and reappear 10m ahead... I can't tell you how hard it was to cross the road, we were stumbling trying to find some weed while my dad waited for my sister but we only imagined dealers and were too nervous to ask anyone... we got back to my dad and in the car",
  "12:20- arrive at camp still totally whacked and meet all these new faces and total strangers, we must appear nervous but that's because we're hallucinating and they look more like 6 foot tall demons than teenagers.",
  "12:40- we end up explaining to them we are still messed on acid and fortunately they are an open minded lot and talk to us about their experiences and trip us out by waving fingers at us etc.",
  "15:00- a few hours pass being talkative and meeting new people, visuals disappear and colours dim back to normal shades, body feelings continue, it's about 1 in the afternoon I think",
  "16:00- we go swimming I can not tell you how good and strange it felt.",
  "17:00- acid trip is all but memories and a vague tired feeling and giggly feeling, though we then pop 2 antidepressants each and come straight back up into a nauseaus speed frenzy",
  "17:45- antidepressant sickness ends, just speed feeling",
  "18:30- it's over again... the end... it was FUN!"
 ],
 "erowid": {
  "id": "9290",
  "citation": " Glowstickfluid. \"Fun Fear and Situational Comedy: experience with LSD, Cannabis & Sertraline (ID 9290)\". Erowid.org. Jun 24, 2004. erowid.org/exp/9290",
  "substance": "LSD, Cannabis & Sertraline",
  "views": "6365"
 }
}
