{
 "id": 1397,
 "title": "Plants, Cartoons, and The Matrix",
 "date": {
  "submission": "2005-07-19T07:00:00.000Z",
  "experience": "2002"
 },
 "author": {
  "name": "Torque",
  "gender": "Male",
  "weight": 82
 },
 "dose": [
  {
   "time": "0",
   "amount": "1.0 g",
   "administration": "smoked",
   "substance": "Salvia divinorum",
   "form": "(dried)"
  }
 ],
 "report": [
  "Last week I ordered 1/4 oz. dried Hawaiian Salvia leaves. The bag was sitting happily in my mailbox the following Thursday, and I eagerly tried it out with some friends the same night. Our first attempt at a Salvia trip several months prior had been a complete dud, but we had gathered more information on proper smoking techniques since then. The tools of choice were a well-loved hookah and a newly purchased handheld butane torch (for seriously heating that bitch-weed up, since higher temperatures release more chemical goodies).",
  "For this report, I'll be referring to my friends as 'E,' 'S,' and 'M.'",
  "We set up the hookah in the living room, leaving only one very dim light on. Radiohead was playing fairly quietly from the entertainment center. I was the first to go. E loaded me up about 3/4 of a gram while I got comfortable on the couch. It only took two large hits, each of which I held for about 20 seconds, to decimate the contents of the bowl. As I was taking the second hit, I began to laugh heartily, though nothing seemed particularly funny. Then, what can only be described as electricity began pulsing throughout my entire body. I felt something moving, slithering up my torso towards my head, and it was as if a vortex of some sort were sucking me away from reality. But that was it: I opened my eyes and came back to normality, except that colors were somehow brighter, similar to the onset of a shroom trip.",
  "E took a go at it next. He smoked a bowl approximately equal to mine and experienced the same basic sensations. His description was that the effects pulled at him 'like water flows.' Unfortunately, like myself, he did not get completely sucked into the vortex. What, we wondered, was to be found there?",
  "I tried a bigger bowl, this time a gram or more. It took three hits, and by the third I was detaching from the universe. The plant pulled me into that vortex and, for lack of a better explanation, smeared me across infinity. My ego retained its grip on reality by only the thinnest thread, which is very hard to describe, but I'll give it my best: My view of the room in the last second before closing my eyes burned itself into my consciousness, then 'inverted' itself, so that the 'positive' space, which was E and the bong right in front of me, became nothingness, and the 'negative' space transformed into strange, otherworldly humanoids who were reaching out to me, imploring me to return. Meanwhile, the music took the form of wet blobs, not visually, but by some other sense which I didn't know existed, which pulsed and smothered me in rhythm. It was very, very cold, and I couldn't escape the feeling of multitudes of fleshy fingers rubbing me, though I wasn't terribly aware that 'I' existed at that point. This may seem creepy to read, but in fact the notions of pleasure and suffering were unknown during that time. Overall, the trip only lasted a couple of minutes, but it seemed like I had stepped outside of time altogether.",
  "The next person to smoke was M, who afterwards said, strangely, that he had been 'hit with a plant.' We all wondered what the hell that meant, and his best explanation was that he had actually become a plant. Go figure.",
  "S was the last to try it. He seemed to go pretty deep, wiggling and rubbing his face during the trip, but not remembering having moved at all when he returned. S described going to a pseudo-cartoon world, much like a cross between Mario Brothers and anime (or something like that, I didn't really understand).",
  "So we all had very different trips. What did they mean? Were these alternate planes of existence? Perhaps we were drawing from the same source as dreams come from. Or maybe the 'spirit' of the plant was choosing to show us something from deep within our psyches. There are a million possibilities, and no real evidence to support any of them.",
  "The one thing that struck us as really 'neat,' was that the onset of each trip had uncanny similarity to the scene in 'The Matrix' where Neo touches the mirror and the mercury-like substance flows up him into his mouth. This is exactly what we felt: a cold feeling, like liquid, rushing up your body and into your head, then sucking you into some sort of vortex. Creepy!",
  "This is definitely a 'mood' drug, meaning that I have to establish the right setting, both physically and mentally, before it will work properly. Neither I nor my friends felt that we had been COMPLETELY dissociated from this world, but even partially doing so could be frightening to many people, so a word of caution: be ready for ego dissociation or don't do this drug!"
 ],
 "erowid": {
  "id": "14264",
  "citation": " Torque. \"Plants, Cartoons, and The Matrix: experience with Salvia divinorum (ID 14264)\". Erowid.org. Jul 19, 2005. erowid.org/exp/14264",
  "substance": "Salvia divinorum",
  "views": "3314"
 }
}
