{
 "id": 13978,
 "title": "Dissolved Distorted Puzzle Inside Reality",
 "date": {
  "submission": "2011-12-06T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Hallucination",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "repeated",
   "administration": "",
   "substance": "Methoxetamine "
  }
 ],
 "report": [
  "Dosed approximately 200mg in one setting, over 6 hours.",
  "First noticeable effects we're dissociation, altered states of thoughts, feelings and emotions  & sort of looping patterns began to take place in my consciousness - like I had been trapped in the house and the thought that I was now in the very meaning of the word in - like a was stuck in a puzzle like world, sort of the game called myst where there's different kind of reactions to certain things you do and the whole situation seems like a mystery of some sort with a time limit in it - so that you have to be fast in realizing what's going on - apparently I didn't - I ended up fucked up on a bed thinking what the hell is going on, perhaps there's something in to this, something in the universe, some secret to be revealed, I cant be sure but i'll have to think about this some other time, when I take a trip again with dissoative drugs.",
  "This and dxm have given me the same kind of feeling like I would be in a house inside the real house which is a constructed hallucination of my imagination - the trip consisted of me trying to solve out what's causing the weird feelings or more like what is the reason for the visions and feelings that I saw & felt.",
  "The trip began to dimly fade away after maybe 6-8 hours, due to constant redosing. I experienced the peak maybe around 5-7 hours from the first dose, which was about 5-15 mg, after which I waited approximately one hour before an another dose of the same size.",
  "The major downside in this for me, I don't know if others have noticed the kind of feeling - feeling of losing control & violent thoughts - fear of harming myself or somebody else.",
  "I think i'll need some rest - and I think that I need some opiates or relaxing pills, meditation, sex, love, friendship & inner peace so that I can live the way I want to.",
  "Peace!"
 ],
 "erowid": {
  "id": "92947",
  "citation": " Hallucination. \"Dissolved Distorted Puzzle Inside Reality: experience with Methoxetamine (ID 92947)\". Erowid.org. Dec 6, 2011. erowid.org/exp/92947",
  "substance": "Methoxetamine",
  "views": "4735"
 }
}
