{
 "id": 13976,
 "title": "My Mind Is Full of Music",
 "date": {
  "submission": "2012-03-25T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Vert",
  "gender": "Male",
  "weight": "230 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:00",
   "amount": "1 g",
   "administration": "oral",
   "substance": "Vitamins - Choline",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 4:00",
   "amount": "3 g",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 6:00",
   "amount": "2 g",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "<p>I've tried piracetam before, in caplet form, but ran out before I could really experiment with it in large doses. This time I ordered 500g of it in powdered form.",
  "It arrived around 3 o'clock, along with 500g of powdered choline citrate. It is generally recommended to take choline with piracetam to prevent headaches. I immediately mixed 1g of choline citrate and 3g of piracetam in about a half cup of water and gulped it down on an empty stomach. Piracetam has a extremely bitter flavor but not enough to cause nausea.",
  "Within about 45 minutes I noticed colors looked brighter. Remember the old Saturation/Intensity knob that TVs had in the 80s? You could turn up the intensity until the colors were so bright they bled into each other... that's exactly what it looked like. In addition, I became very aware of the color of ambient light. I noticed that some of my CFL lights are bluer than others, and I could see how that altered the inherent color of nearby objects. It's nothing I can't see in ordinary circumstances, it was just somehow more noticeable with the piracetam in my system.",
  "My thoughts were racing and that my usual internal music was much more consistent and complex than usual. There was a very mild sense of euphoria.",
  "Programming was easier, and my creativity seemed improved; answers to knotty problems came easily to me and the solutions were elegant.",
  "Typing seems easier and I am convinced my WPM went up, though I did not actually test this.",
  "I took another 3 grams about 4 hours later. Effects did not intensify, though the color effect had faded and returned in full force after the second dose. Just before bed, about 2 hours later, I took an additional 2 grams. I have heard piracetam affects dreams and wanted to experience this.",
  "My dreams the next morning were beautiful, rich, complex and very, very vivid. I noticed smells in my dreams, something that I've never had before.",
  "What really made it special, though, was the music. Marvelous, sweeping, majestic music FILLED my dream. I was composing it. It was sweet, so sweet that I awoke weeping with the sheer joy of it. It stayed with me all morning, filling my mind. My emotions were tumultuous. I felt like a child again, every thought and sensation almost unbearably vivid. A very pleasant sensation.",
  "I continue to take piracetam, 3g 3 times/day. Although the effects are no longer as dramatic, I remain more creative, thoughtful and aware than before. Focus is also easier. The effects of my ADD seem less bothersome than usual.",
  "Good stuff.</p>"
 ],
 "erowid": {
  "id": "92934",
  "citation": " Vert. \"My Mind Is Full of Music: experience with Piracetam & Choline (ID 92934)\". Erowid.org. Mar 25, 2012. erowid.org/exp/92934",
  "substance": "Piracetam & Choline",
  "views": "11330"
 }
}
