{
 "id": 13983,
 "title": "A Great Evening",
 "date": {
  "submission": "2001-09-07T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "maggie luvs u",
  "gender": "Male",
  "weight": 77
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "40"
   },
   "administration": "oral",
   "substance": "2C-T-2",
   "form": "powder/crystals"
  },
  {
   "time": "5:00",
   "administration": "oral",
   "substance": "GHB",
   "form": "liquid"
  }
 ],
 "report": [
  "After doing enough investigation I decided to experience 2ct2. It had been way too long since I'd cracked my head open , if you will, and decided enough was enough. I had only had a threshold taste of mescaline years ago. All other keys were via tryptamines, so I was excited to see thru a phenylethylamine. My traveling companion's only psychedelic experience has been with psylocybin, and 5 meo-dipt. She has never really experienced what it is these substances can facilitate, but is waiting for it nevertheless. Unfortunately, she is unwilling to tolerate negative somatic side effects( naseau, vomiting, diarreaha, etc.), so she may never be ever to receive the 'gratuitous grace'. Anyways....",
  "We decided to start with 20mgs. Set was casual, just checking this substance out. Setting was home with the cats. Nightime low light soft music, candles, incense, etc. The 20mgs provided a threshold psychedelic effect. Sensory enhancement, good body energy, no significant bodyload however. I had anticipated this, but hey. A nice 6 hour ride, with a lovely sunrise that morning. My lady was not significantly impressed even after I suggested that doubling the dose would provide any and everything this compound had to offer. So... I took the challenge.",
  "One week later with the same set and setting, I went solo. After fasting and hydrating all day, I took 40 mgs at midnight. Came on in a hour WHAM! Visually spectacular! Serious waves dissolving the house down if you know what I mean? But there was someting else...The somatic energy was fucking astounding! I have never felt such physical euphoric bliss. The mantra I spoke aloud was love, love, love, until I was out of breath. Then as I took big lung fulls of air this incredible energy would pulsate and then explode thru my chest! Like i said, the somatic energy was utterly intense. This give and take went on for atleast 3 hours. Oddly enough the experience, as powerfull as it was, gave no head change so to speak. Ego was left alone and there was no hint of boundry dissolution. Cognitively, I was very lucid and aware as I closed my eyes and literaly melted away. On the decent I augmented with some ghb, and BAM! More somatic rushes thru out my entire body, mind, and soul. After 6 hours there was diarreaha, and it felt great. A price willingly payed for a magical night. After reaching baseline I was completely drained. For hours sleep gave little respite, as I was utterly wrung out to dry. Fortunately it was saturday.",
  "In restrospect I consider this stuff not an entheogenic substance per say, but a blessing cloaked with loads of high orbiting energy. Thank you Dr. Shulgin. Until next time...."
 ],
 "erowid": {
  "id": "9296",
  "citation": " maggie luvs u. \"A Great Evening: experience with 2C-T-2 (ID 9296)\". Erowid.org. Sep 7, 2001. erowid.org/exp/9296",
  "substance": "2C-T-2",
  "views": "10739"
 }
}
