{
 "id": 13996,
 "title": "Effective in Permitting All to Drop Concerns",
 "date": {
  "submission": "2011-10-28T07:00:00.000Z",
  "experience": "1978-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zeke Ralston",
  "gender": "Female"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "120",
    "grams": 0.12
   },
   "administration": "oral",
   "substance": "MDMA"
  },
  {
   "time": "1:30",
   "amount": {
    "unit": "mg",
    "quantity": "40",
    "grams": 0.04
   },
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "[This report originally appeared as a typewritten page pasted into Book 2, page 289 of the Shulgin Lab Books.]",
  "[Erowid Note: Anonymized names appear to have been done in error, Erowid corrected to Holly as the female discussed throughout story. Should be re-checked at a later date.]",
  "Report on Experience with MDMA",
  "Participants: Greg, Elizabeth, Tatiana Ralston, and Holly Ralston",
  "Background: Greg & Elizabeth were visiting for two days, at the same time that Tatiana arrived for a visit. We spent a very pleasant day visiting, but Holly was not feeling well. She reports that she was suffering a horrendous depression, anxiety, and felt exhausted,-completely below the line. Greg noticed her state, and suggested that an MDMA experience would be helpful. All agreed, and Tatiana had been hopeful that she would have an opportunity to repeat the experience, as she had gotten so much from her first one. So the experiment was conducted on the following afternoon, after the practical matters of the arrangements were completed, including the weighing of the doses.",
  "2:20 p.m, All ingest 120 m.g. of MDMA except Holly, who started with 100 m.g.",
  "The experience developed nicely for everyone. It was a perfectly beautiful day, the air nice and warm, bright and sunny, with marvelous visibility and the colors of fall showing on the mountain. We walked around the property, and responded to the beauty of the surroundings. After an hour we returned to the house and sat outside on the deck. By this time, everyone has blossomed and opened up and were feeling marvelous. Holly became deeply relaxed, and all of her troubles melted away. Everyone's faces became soft, young looking, and took on an transcendental look. The experience seemed particularly rich and deep.",
  "3:50 p.m. All took a supplement of 40 m.g. including Holly which is the largest supplement she has taken. The experience continued to design for everyone, and we had a marvelous time being together, sharing each other, and feeling the depth of our experience. We felt a particular blessed group, as we all fit in so well together. We could not get over how effective this agent is in permitting everyone to drop their concerns, complete relax, and feel the deep warmth of their inner being.",
  "5:00 p.m. (approximately) We moved inside to listen to music. I put on the tape of the Grieg Lyric Pieces, which we listened to in its entirety (90 minutes). We were extremely at piece, the music was outstandingly beautiful, and seemed to aid us all in going much deeper within ourselves. We felt the experience to be particularly profound. Tatiana left during the music to visit a neighbor, and came back later. We ate lightly, soup and bread, and yet it seemed completely adequate and satisfying. Then we listened to Tatiana sing as she played the guitar, and it seemed also very appropriate and maintained the group bond.",
  "The afterglow the next day seemed particularly outstanding. Everyone felt it had been a particularly moving experience, and it was difficult to separate. Holly was totally changed and had risen completely about the line, where she has remained since."
 ],
 "erowid": {
  "id": "93025",
  "citation": " Zeke Ralston. \"Effective in Permitting All to Drop Concerns: experience with MDMA (ID 93025)\". Erowid.org. Oct 28, 2011. erowid.org/exp/93025",
  "substance": "MDMA",
  "views": "2571"
 }
}
