{
 "id": 13993,
 "title": "Experiencing the Blackest Side of My Life",
 "date": {
  "submission": "2011-10-28T07:00:00.000Z",
  "experience": "1978-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zeke Ralston",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "8",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Aleph-4"
  }
 ],
 "report": [
  "[This report originally appeared as a typewritten page pasted into Book 2, page 296-7 of the Shulgin Lab Books.]",
  "Experience with Aleph 4",
  "Guests: Holly Ralston, Elizabeth, Greg, Carl and Maggy N, Sharon, Bob, Sasha",
  "Time: Experiment started at 10:00 A.M.",
  "I personally felt in the best shape for the experiment than in a long time. We drove to the hiking area we have dubbed 'Uriah's', because it starts up behind the house that Grockit built. As we got out of the car and started up the hill, I was feeling quite good. This was some 40 minutes after ingestion. I remembered that with my first Aleph 4 experiment, as soon as I felt any affects, I felt uncomfortable, and the discomfort grew as the affects became stronger, along with the enhanced perception. This time I felt euphoric with the first traces, and was confident that I would head up into a pleasant experience, and reported so to Sasha. As we climbed up the hill, 1 to 1-1/2 hours in, the euphoria grew, as did the beauty of the surroundings.",
  "Around noon, we settled into a little valley with a magnificent view of the surrounding countryside. I was feeling the effects much more strongly, and was beginning to get a trace of discomfort. I was aware of the beauty of our surroundings, and noticed some visual hallucinations when looking at homes on the hills across the valley, in the form of smoke trailing across. I lay back and looked up at the sky, and the sky and clouds were incredibly beautiful. I sensed my pain as my inability to accept such fantastic beauty--it was if it were more than I could bear. I became aware of how my cybernetic system is not accustomed to joy, and felt how grand it was to let joy creep into the various corners of my being. I felt Sasha's greatness next to me, and how wonderful it was to have the opportunity for such experiments.",
  "I thought the experience was progressing nicely at this point, but unfortunately the discomfort continued to increase. It felt good to lay back and watch the sky, and close my eyes. With eyes closed, I had some marvelous imagery, which most often took the form of various plastic shapes imbued with color. At times the colors reached intense brilliance of magnificent beauty. Yet nothing seemed to receive the tension that was building up, and continued to build up throughout the afternoon.",
  "The rest of the afternoon, there were many experiences of great beauty, but I was always pulled into the great pain I was experiencing, and could not get free of it. I regretted asking for an additional m.g. of dosage, and felt I had too much, but saw nothing I could do but ride it through. The experience was so intense I felt I could do little to direct it, but just flowed with it. it was hard to get my analytical mind to work. This showed up most strongly when I took a little walk aside with Sasha, and he computed the directions by the position of our shadow. I could in no way make my mind follow the reasoning to establish direction, I simple went blank, and was astounded by my inability to think.",
  "The affects continued well into the evening. Going down the hill, I felt at maximum intoxication, and at some moments had very beautiful experiences. They would lift me out of my pain into intense enjoyment, then I would subside back into the pain. In my first Aleph 4 experience, the late afternoon and evening were glorious, but this time the tension held on right through the rest of the day, the evening, and even through the night. It was not until the next day that I felt relaxed, euphoric, and at peace.",
  "The pain I felt all afternoon and evening was the result of experiencing the blackest side of my life. It seemed as though everything I had done was totally wrong, and I could only see the black side of everything: my marriage, my move to Barstow, my withdrawal from life. I experienced myself as completely empty, just being a parasite on others, constantly taking and contributing very little. Such simple acts as tending the fire and washing the dishes brought temporary relief from such feelings. I felt all my major life decisions were wrong, and yet I could see no way out, as I had boxed myself in by reducing my income, and moved into a simple life style which I had no way to reverse. The though that my activities at Multi-Media were no longer needed and I must find another source of income was extremely frightening. And the extreme irony was that I was supposed to be a proponent of higher consciousnesses, and man's limitless abilities, and yet I could find nothing but emptiness in myself. I wanted to crawl back to Barstow and die.",
  "During the night I churned and churned over these issues, and came to peace with returning to Line Pine and becoming a better partner to Holly, if she really wished to return with me. I could see that my dissatisfaction's were unwillingness to face unsatisfactory areas in myself, which I resolved to correct. One of the main elements here was to stop using her unwillingness as an excuse for me not to do things which I know in my heart should be done.",
  "The following day was by and large a day of great peace and warmth. It was marvelous to be with the rest of the group, and I was still quite open to all of the surrounding beauty. Plunging into such activities as giving Kojack a bath with total un-self-consciousness was a great joy. I could see and appreciate the wonderful qualities of all other other group members.",
  "During the next few days, anxiety returned many times, and it took time to totally wear off the tension. However, I began to learn ways to dissipate the pain. This is primarily by instead of allowing myself to be blocked by the pain, to turn it around and see what can be done. There would follow a flow of creative ideas of around alternative actions, which felt very good to see. I learned the importance of once seeing what needed to be done, to move quickly, before lethargy sets in, as the moving and acting releases new energy.",
  "The drive back to Barstow was a very beautiful one for both Holly and myself. It was like having another good experience, as we were both wide open. We had much energy, and were not tired from the long drive. We both felt good to be home again, and we have much new energy and insight."
 ],
 "erowid": {
  "id": "93022",
  "citation": " Zeke Ralston. \"Experiencing the Blackest Side of My Life: experience with Aleph-4 (ID 93022)\". Erowid.org. Oct 28, 2011. erowid.org/exp/93022",
  "substance": "Aleph-4",
  "views": "4248"
 }
}
