{
 "id": 13995,
 "title": "Achieving a New Closeness",
 "date": {
  "submission": "2011-10-28T07:00:00.000Z",
  "experience": "1978-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Zeke Ralston",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "20",
    "grams": 0.02
   },
   "administration": "oral",
   "substance": "2C-D"
  }
 ],
 "report": [
  "[This report originally appeared as a typewritten page pasted into Book 2, page 285 of the Shulgin Lab Books.]",
  "Experience with 2-CD",
  "Guests: Holly Ralston",
  "We were alone in our back yard, a beautiful day. We begin to feel the effects in about 20 minutes. Holly gets nauseous; I feel it somewhat, with some tension, but otherwise develop nicely. It becomes apparent that we are alone in an experience for the first time in a long time, and will thoroughly confront each other. We have mixed feelings about such a prospect.",
  "In about one hour, most of the uncomfortable feelings have left me, but Holly still feels quite uncomfortable. Everything is quietly getting very beautiful, not dramatically like the MDMA, but quietly like the onset of Aleph-4. We talk a lot about our relationship, and I am able to joke and kid, but it doesn't seem so funny to Holly.",
  "At 1-1/2 hours. I feel well into it. Holly is reading some E.E. Cummings poems, inspired by Arlo the day before. I find them quite beautiful, and suggest we go inside and explore things more closely. We lie together for a while, but Holly feels cold and wants to go back outside. We feel the shade as very cold, and the direct sun as quite warm. We stay as the edge and move back and forth, and have an excellent visit. I am enjoying nature very much. I find it a quiet, but subtle and free material. Nature is beautiful in an enhanced by quiet way, and my mind is very free to entertain ideas of many different natures; I feel much freer and clearer than with MDMA, for example, although the latter is most enjoyable.",
  "Holly gradually drops her discomfort and begins to accept me more, which I sense as hard for her. We continue to talk quite freely.",
  "Around 2 p.m., we go back to bed and lay there for 2 to 3 hours. We both felt quite tired, and it was very peaceful to lie in bed. I began to feel Holly's closeness very much, and enjoyed immensely our being together. While I did not feel much sensory enhancement, I felt I was aware of the enormous potential this material has in this direction as two persons care more for each other.",
  "Holly and I grew in closeness through the rest of the day, and even on though the week. We retired early, as we felt very tired. However, I felt fine the next day and got a lot done without distraction. We felt the let-down from this experience was quite gentle and very pleasant and peaceful, although we felt tired. The feeling of tiredness did not linger afterwards, as it does with me with MDMA, and I was very alert and energetic for the following week. Holly and I achieved a new closeness, so that we felt much more energy flow between us when we are physically close, and have enjoyed each other much more. We feel this experience very appreciably improved our relationship. We are anxious to try it again, with a larger amount."
 ],
 "erowid": {
  "id": "93024",
  "citation": " Zeke Ralston. \"Achieving a New Closeness: experience with 2-CD (ID 93024)\". Erowid.org. Oct 28, 2011. erowid.org/exp/93024",
  "substance": "2-CD",
  "views": "4031"
 }
}
