{
 "title": "Life-Line",
 "author": "bendyguy",
 "citation": " bendyguy. \"Life-Line: experience with DXM (with CPM) (ID 14)\". Erowid.org. May 31, 2000. erowid.org/exp/14",
 "substance": "DXM (with CPM)",
 "bodyweight": "160 lb",
 "header": [
  "DOSE:",
  "720 mg",
  "oral",
  "DXM",
  "(pill / tablet)"
 ],
 "report": "<p>[Erowid Note: Coricidin Cough & Cold contains chlorpheniramine maleate which can be dangerous and/or fatal at high doses. This product should not be used as a source for recreational DXM.]</p><p>My friend 'Bill' and I were going to do dxm together for the first time.  He was experienced, but more with the robitussin side of the field.  We would be trying Coricidin cough tablets, 30mg per pill.  We bought three boxes and split them up evenly.  Using gatorade to wash them down, the plan was to take them one at a time every minute until we were done, starting at 7 pm.</p><p>We would be watching 'What dreams may come' for the stunningly vivid colors and grand theme until we started to feel some heavier effects and then switch on the cd player and listen to some music a friend reccommended for the night.</p><p>We started taking the pills.  Bill had a much harder time of it than I did, for some reason.  He says he just hates taking pills.  After about 6, I decided to just take the rest all together.  After about 3 more, Bill did the same.  He says he now feels it's better to get it over with all at once.</p><p>Awaiting the experiences start didn't take too long.  At about 8pm we both started seeing trails and feeling the 'monkey on your chest' phenomenon, which he told me to expect and to not panic when it happened.  It was not serious and would pass.  It soon did and I felt a little nauseated.</p><p>He went upstairs to puke and I went to the kitchen sink.  After a bit he came back downstairs and stood with me a while.  We were too unstable to walk back to the living room for a little while, but we finally made it, walking, as we say, like lizards.  That is, you sort of furtively sneak around, moving a few steps, regaining your equalibrium, looking around to orient yourself to the surroundings, them move a few more steps, repeating the process until you get to where you want to go. (Or think you do!)</p><p>We sat down, each on our own love seat(arranged in an L- shape) and started telling each other about what we were seeing.  I don't remember much what he saw, but I saw little cut-outs of Jimi Hendrix in an army uniform speeding around my line of vision.  In fact, they are all I saw, for a while.</p><p>After a bit, I realized we were both lying down on our couches and something wasn't right.  The cd was skipping!  I told Bill and he didn't seem to realize what I was talking about.  Then suddenly he sprang into action to fix the problem, first trying the remote, then moving up to the player directly.  It seemed to take him about an hour to find out how to skip to the next song, but when he looked at the clock on the vcr it was only 10:30pm!  Woah, talk about time dilation!  We were both freaked out that so much had happened in so little time.</p><p>As he sat down we both started off on our own little journeys again.  I was a house in New Orleans talking to Jimi Hendrix.  There was a red light on in the background.  When I would open my eyes I was back in Bill's living room.  Weird!  I would close my eyes I would return to talking to Jimi, or go somewhere else.  (Needless to say, at this time, Jimi's cd was playing.)</p><p>Sooner or later I found myself in the kitchen at Bill's house.  I didn't know what I was doing, so I decided to go ask Bill.  Maybe I'd told him.  I started walking back to the living room and realized my eyes were closed, but I could still see the furniture and room!  I opened them and the room still looked a bit different, but it was mostly the same.  I closed them and kept walking, as this seemed to make more sense.</p><p>I got to my couch and lay down, soon lost in another world again.  Suddenly I was lost.  I had to find Bill!  I opened my eyes and saw that I was grasping his arm in mine, as in an old style arm clasp, where we were each grabbing each other's forearm.  He had a shocked look on his face and his mouth was forming a little o-shape. </p><p>Later he told me that I said I needed an anchor to reality.  We held each other's arm for most of the rest of the night and came to call it the life line, as at one point we both had the same vision that our life forces were intermingling along this link.  One of us would press on the other's forearm with our index finger extended.  In an echo I would hear Bill ask me, 'Did I do that, or did you?'  I had to honestly tell him that I didn't know.  Our own thoughts seemed to cross this life line as well, and occasionally we would lose our own identities and become one.  Kind of freaky, in retrospect, but at the time, not unpleasant at all.</p><p>At some time in the night we fell asleep and awoke the next day feeling relaxed and lazy.  Still a bit shaky, we went to Denny's about 8 am and chilled out for a while, just feeling weird being around 'normal' people. </p><p>We'll never forget that first time we did dxm together, but now we regularly try to set appointed weekends, at least one per month, to check out of reality for a while and experiment with seeing another point of view.</p>",
 "year": "2000",
 "id": "14",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2000-05-31T07:00:00.000Z",
 "views": "14996",
 "dose": {}
}
