{
 "id": 14,
 "title": "Liminal Escapades",
 "date": {
  "submission": "2004-02-10T08:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Pandaimon",
  "gender": "Male",
  "weight": 99
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 mg",
   "administration": "oral",
   "substance": "Pharms - Zolpidem",
   "form": "pill / tablet"
  }
 ],
 "report": [
  "I had picked up some zolpidem tartrate (Ambien) after doing a little research on the drug.  Several reports of recreational use have been popping up, telling tales of incapacitation, hallucination, and intense lucid dreaming - something that really appealed to me.  So, I decided to check it out.",
  "My girlfriend was over, so, we figured we'd both give it a shot, thinking the worse case scenario would be us falling asleep immedietly. ",
  "We each popped a 10mg pill, turned out the lights, and hopped into bed.",
  "After about 15 minutes, we both mentioned that we were feeling 'something'...a bit of strong relaxation.  Our eyelids were getting heavy, and it seemed like the drug was doing what is was supposed to - put us out.  After lying there silently for another 10 minutes, my girlfriend said something kind of incoherent.  I looked over, and she was pointing at some candlestick holders on a shelf.  They were dancing, undulating, moving.  I couldn't believe my eyes.",
  "Looking at her face, I saw massive distortions.  Every feature was writhing.  She began talking about the hallucinatory images she was seeing, and soon enough, I was experiencing them too.",
  "Our minds were very lucid, although physically we were pretty inept.  Words were jumbled, and slurred, movement was slow and heavy....but our thoughts were very focused.  We both seemed very calm and collected throughout the experience.",
  "Most of the room stayed 'normal', but there were some serious dimensional distortions with shape and size.  It also seemed that only some objects were 'active' in a hallucinatory sense.  The candlestick holders were thin, and s-shaped.  The decorative moulding on my walls were very 'frisky', and they were comprised of a large block of wood, with carvings of concentric circles on it.  The speaker cones on my PA's were breathing.  The vertices of the room is where most of the spatial distorion took place.",
  "After about an hour, my girlfriend mentioned she was hearing a conversation.  That kind of freaked me out - I was wondering if this could have been triggering some sort of psychotic episode.",
  "Moments later, both of our heads were on the pillows, and our eyes were closed.  The last thing I recall was her snoring.",
  "The next day (today), the whole experience seems like a foggy dream.",
  "This is some very interesting, very powerful stuff.  It's like a lucid dream or acute visual schizophrenia in a pill."
 ],
 "erowid": {
  "id": "10007",
  "citation": " Pandaimon. \"Liminal Escapades: experience with Zolpidem (Ambien) (ID 10007)\". Erowid.org. Feb 10, 2004. erowid.org/exp/10007",
  "substance": "Zolpidem (Ambien)",
  "views": "48351"
 }
}
