{
 "id": 14007,
 "title": "Direct Connect - Communication with Beyond",
 "date": {
  "submission": "2011-12-01T08:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Omni",
  "gender": "Male",
  "weight": "13 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "44 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:20",
   "amount": "44 mg",
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 0:20",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "<p>I began with 44mg, insufflated, and chased it with a mouthful of water, tilting my head back to allow moisture to permeate into the membrane area and encourage uptake.",
  "Nearly immediate results; visible tracers, feeling of displacement.",
  "Within 20 minutes I felt a physical sensation of gravity shifting -- instead of gravity pulling down, it was pulling back somewhat (as though I was accelerating). [side-note: the gravity-shift feeling was very similar to a Salvia Divinorum exprience almost exactly a decade ago.]",
  "Inspired by the physical sensation of propulsion, I went for a walk.",
  "Before my walk I made preparations; insufflated another 44mg, totaling an 88mg dose including the 44mg from 20m prior. Took a drink of water (tilting my head back and allowing the moisture to soak into the membrane) and excited the imbibement by smoking 30mg THC.",
  "I walked to one of my usual places of divination. It was a short walk, ~50m at a 55 incline, then ~40m planar, then ~200m slight varying decline, resulting in the arrival at the location I consider to be my Nexus of Spirit.",
  "I then performed a few basic rituals (pleasantries, followed by deconstruction of the Self into a Point through incantation and relaxation of the material Self) and was immediately catapulted into cosmic travel  depths reached previously only through nigh abandonment of the corporeal self. [It is a worthwhile distraction here to note that going 'Outside The Gates' is considered, by some, to be breaking certain Law  dogma easily sidestepped by those understanding of the parting words of Hassan-I Sabbh.]",
  "Primordeal creation and Grand Structure, all at once, and with it a sense of direct communication with a distinct being. Perhaps what the OTO would classify as the HGA, though it is worth noting that strong undercurrents of Nibiru energy were abound.",
  "No specific message was conveyed, other than a feeling of success in establishing communication.",
  "Then, a wash of Earth realm as I opened my eyes to focus on the stars above, reassuring me of my safety and connection to this sandbox we all play in.",
  "Sat up, trundled on home, reflected, and munched on a tomato.</p>"
 ],
 "erowid": {
  "id": "93069",
  "citation": " Omni. \"Direct Connect - Communication with Beyond: experience with Methoxetamine (ID 93069)\". Erowid.org. Dec 1, 2011. erowid.org/exp/93069",
  "substance": "Methoxetamine",
  "views": "3813"
 }
}
