{
 "id": 1400,
 "title": "Summary of 12 Experiences",
 "date": {
  "submission": "2002-04-27T07:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "Zam",
  "gender": "Male",
  "weight": "220 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "MDMA"
  }
 ],
 "report": [
  "The following is a brief summary of my experiences with MDMA.  Several times I have lost the summary and in trying to write up the experiences it has become clear that the context is necessary to explain how and why I make the choices I do about MD-compounds.",
  "This report is probably not very interesting, except to contextualize my other reports.",
  "1: June 1996 - First time : aprox 130mg MDMA.  Amazing experience. I remember looking at the eyes of my partner as we both felt it settle in and the sun was on her face.  Her pupils dilated, a knowing smile grew.  Wow.  I'd never before felt so grateful, so at home in the world.  I forgave all the wrongs others had done to me and, perhaps more novelly, forgave myself for all the wrongs I had done to others.  It was a really surprising experience.  We lay in the forest, watching the sunset through as it turned the tops of the redwoods golden and then darken.  I didn't want it to end, but felt an afterglow that carried me through the emotional let down.  It still makes me gushy just to think of the feeling.  When people talk about 'The Experience', I think of this one.",
  "2: Burningman 1996 - Second time.  My partner and I took our 130mg / 100mg MDMA on saturday night, the night of the Devil Opera thing, and then friends who had taken 2cb started having panic reactions.  Zara decided she was going to stay with them and help them through their difficult experience and I went with a friend to go to the CCC rave 2 miles away.  I ended up having a very nice walk back acros the playa under the full moon,  a beautiful, but somewhat melancholy, walking meditation.",
  "3: Nov 1996 : Candyflip.  1 blotter LSD then T+70mins, 120mg MDMA. The Fun Monster experience.  3 day hangover.  Very fun, very draining.",
  "4: Feb 1997: Introduced a friend and took a low dose myself, then boosted.",
  "5: Feb 14, 1997 : with friends at a rave, got pulled away from a very pleasant cuddle group by someone for work at the gate right at the peak.  In the MDMA space I was unable to say no to this person, but I always felt cheated that I had been pulled away.  Leo died the day before, hangover was melancholy but not bad.  A few days later, experienced the mid-week depression and was irritable.",
  "6: May 1997: Partner and I at home, wandering around, found a swing, watched Henry & June (?).. I don't remember any hangover from this, but I don't really remember anymore.",
  "7: May 1997: Friend's wedding reception. String ceremony.  I remember having a very pleasant, sort of opiated feeling time.  I don't remember anything about the hangover from this one.",
  "8: Burningman 1997: with mntd, ab, and tnx.  First time I'd had trouble with coming up on MDMA.  Had to take a boost to get into the space, felt very restless until the boost hit.  Spent time on the blanket out on the playa.  Very enjoyable.  Hangover and week after quite noticeable.  Partner did not experience week-after effects.",
  "9: L NYE 1997-1998: seattle. Again, required an initial boost to reach the effects.  Ended up at 150mg starting, redosed with 50, then took 2cb.  Didn't get much sleep, felt pretty drained the next couple days and mildly depressed for a week afterwards, difficulty focusing on tasks.  I enjoyed the experience, but this the first time I felt rough edges during the experience. Irritation, displeasure, cynicism, etc.  Sort of the mirror opposite of what I was looking for in MDMA.",
  "10: Burningman 1998: bad time.  The culmination of stress and collected garbage, took 130mg MDMA, then 30, then 30 more.  Increasingly restless, irritable, isolated.  Yuck.  Felt terrible the next day.  Week-after effects very pronounced.  Felt beaten up.  Mild nystagmus that lasted for weeks.",
  "10e: NYE 1999-2000 tried MDE, good experience, rough coming down.",
  "11: October 2000 : low dose reintroduction.  It had been over 2 years since the previous experience and I was trying to reintroduce myself too it.  I took 60mg and had an OK time, had hangover effects that were pronounced.  Definitely felt sad as the effects tapered.  Mild nystagmus lasted for weeks.",
  "11a: September 2001: tried MDA, good experience, a little hard coming down, distinct hangover and week after effects.",
  "12: April 2002: 2.5 grams p. cyanescens, T+45 100mg MDMA, T+3: .8grams p cyanescens.  Very positive, intentionally tried to re-contextualize coming off MDMA to be a positive thing and succeeded.  Themes: 'Pre-conscious emotional reactions to peripheral stimuli can cause huge changes in the conscious intellectual decisions made about them.' 'Meta-Stable' 'Ambi-valence is not apathy, it is the holding of two views which can make decisions hard.' Worked out very well, slept a little more the next day and was a little tired, but no real 'hangover' like in previous trials.  No week-after depression or inability to focus.ng"
 ],
 "erowid": {
  "id": "14279",
  "citation": " Zam. \"Summary of 12 Experiences: experience with MDMA (ID 14279)\". Erowid.org. Apr 27, 2002. erowid.org/exp/14279",
  "substance": "MDMA",
  "views": "12969"
 }
}
