{
 "id": 14018,
 "title": "Willpower Supersedes Addiction",
 "date": {
  "submission": "2012-09-27T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "DetecitveDan",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Heroin",
   "form": "(daily)"
  }
 ],
 "report": [
  "<p>A brief background, Ive done all the major/popular drugs for my generation (coke, shrooms, pharms, ect, ect). I grew up in a upper middle class family, with an older sister who did a fair amount of experimenting with drugs as well. I too also thought I could never get addicted to any form of drugs I could never have been more wrong.",
  "I started the same way that 98% of heroin addicts my age do, pain killers. Me and all my buddies had dabbled with painkillers for about three years, and out of a group of about seven of us only one got bit by the addiction bug. That friend was C. C got pretty deep into an oxycontin addiction which led to Herion, and did the usual beg, borrow, steal, and rehab. Well after seeing that train wreck of Cs life, I swore I would never let myself try herion or become addicted. Well that all changed when they took oxycontin off of the market and switched to the OP formula.",
  "When the pharm manufacturers switch from OC to OP, it meant that I could no longer get my occasional nod off weekend from buying an 80mg OC. I snorted it by the way, I had tried smoking it but for some reason it never affected me like everyone else. Well the 80s dried up, and even when they came around people were charging upwards of $75 for a fucking pill. No way jose. (side note: OP has a polymer agent in it so if you introduce any form of moisture to it, it will turn into a gooey substance and clog your nose.. No dice)",
  "Well I got laid off from a very profitable job and I filed for unemployment, I went from making $1300 a week to $490. Needless to say I got by comfortably, for the first months. That all changed one summer night while looking for some pills, my friend R informed me that he could attain Black Tar heroin. R had preached to me for some time about how Herion was even better than an OC high at 1/100 of the price. Needless to say I caved and bought .50g for $35. R came over to my apartment and produced a little sealed piece of plastic with a dark brown powder in it He hands it to me and I reply, WTF is this powder, to which he replied Breathe on it and it will turn into tar I followed his lead and made a ball that weighed about .10g, prepped the tin foil, disassembled a pen and started chasing the dragon. WOW my mind was fucking blown away, it was like doing a whole eighty at once. I think that .50g lasted me two weeks of occasional smoking",
  "My rise to addiction fame goes pretty much the same as everyone elses. My use went from bi weekly, weekly, mid week, every 3 days, and Ta-Da Everyday use. I lived alone and had begun working at my fathers business and got paid under the table, so that meant I could still receive my fun-employment. I was smoking anywhere from .5 to .8g a day and could still pay my bills. Well this vicious cycle went on for about seven months, and no one knew, I was very careful. I only smoked it, never IV. I always thought of IV as my contingency plan for if I ever wanted to kill myself. So I did the routine of wake up, call my dealer get high, work, rinse and repeat. I started to not care about how I looked, how clean my car/apartment was. So long as I had my warm and fuzzy heroin veil pulled over my eyes I did not care.",
  "Luckily I never had to beg borrow or steal for my addiction, thats not to say I did not tell a few white lies to explain why I would have to leave at completely random times to go and get my fix. My life changed one day when I was waking up to go to work and I was looking in the mirror. I looked at myself and hated everything I had become, all I cared about was getting high. Of course I said fuck it and called my dealer, when I met him that morning I started to look at him. He was probably 40 and looked 60 years old, missing teeth, just a good stereotypical seasoned tweaker. I could not help thinking if I continue down this road that is how Im gonna end up. Well he could only sell me .3g and I would have to meet him when I got off of work. That night when I met up with him, he had me give one of his other clients a ride home along with him. His Client was a 21 year old girl who was fairly attractive, she started talking about how she was homeless along with various other troubling things about being an addict. When I got back from that dope run I knew I was done. Looking around my apartment at all the used pieces of foil and black marks from my hands touching everything disgusted me. The next day I told my parents.",
  "Surprisingly enough my parents were pretty cool with the whole situation. I ended up going through a week long withdrawl at their house. I did not sleep for more than 6hrs in 7 days, it was complete hell. But as the sands of time pass and they slowly cover up my relationship with herion I feel better everyday. Also I feel pretty shitty knowing that once an addict always an addict. Now getting my life back on track and taking everyday as it comes. I have not used in 3 weeks",
  "Update: I wrote this over 6 months ago and never knew what to do with it. I was doing a lot of reading on erowid while I was withdrawling and had intentions to post it. But now that I am completely free and clear of drugs I would just like to give someone that is in or recovering state my little bit of knowledge I apprehended from my experience.",
  "Fuck that saying Once and addict always an addict. The only way your ever going to quit and stay clean is by Wanting it. I understand that I did not do drugs to fill emotional holes, but I was addicted and lived the life with that monkey on my back. I have not told any of my friends or co-workers about what happened and I never will. The word Addict is thrown around too loosely these days. I am not a lifer in the game of addiction, and no one else is a lifer either if they want it. All it takes is will power, you have the will power inside you to quit and be independent. Fuck methadone, or any other replacement drug. Your going to get sick, your going to feel like shit, your going to want to get high. But if you can get through the withdrawls and the first few months you will realize how strong of a person you are and what you can achieve with will power.</p>"
 ],
 "erowid": {
  "id": "93136",
  "citation": " DetecitveDan. \"Willpower Supersedes Addiction: experience with Heroin (ID 93136)\". Erowid.org. Sep 27, 2012. erowid.org/exp/93136",
  "substance": "Heroin",
  "views": "10628"
 }
}
