{
 "title": "Totally Addicted",
 "author": "Ritz",
 "citation": " Ritz. \"Totally Addicted: experience with Oxycodone (Oxycontin) (ID 14029)\". Erowid.org. Jun 23, 2007. erowid.org/exp/14029",
 "substance": "Oxycodone (Oxycontin)",
 "bodyweight": "135 lb",
 "report": "<p> Oxycontin is the greatest drug that I have ever tried. I have tried a numerous drugs, but nothing particularly too interesting besides ecstacy and oxycontin. I have gone through numerous ups and downs with Oxycontin. I have been addicted for about a year. Even though I try to tell myself I am not addicted, I cannot fool myself. I'm a young female, going to school and trying to lead a social life. Oxycontin makes those things particularly difficult. Coming down is the worst part. I tend to get sleepy, itchy, and a little short with people. My grades have gradually slipped from outstanding to so-so, and my parents are starting to notice.</p><p>The first time I tried oxycontin was about a year ago, I started first with a 5 mg of an Oxy IR, which is like Oxycontin, only immediate release, then gradually increased to a wopping 140 mg where I stand right now. Since the first time I tried them, I was hooked. Sometimes I find myself in the bathrooms of resteraunts and between classes crushing up huge amounts of Oxycontin and snorting it off the sink. I'm not at all proud of my addiction, and wish I could stop again.</p><p>At one time about six months ago I actually managed to fight against my addiction, when my sources were cut off. The worst is to come off of OCs. I got hot and cold flashes, while sweating constantly. I didnt want to be anywhere, I just wanted to sleep. My entire body ached like I hadnt slept in a couple days, and I got tremendous headaches that felt like the top of my head were going to blow off. In about a week I got over all of that, and decided to lead a sober life again.</p><p>Wrong! About a week and a half after I thought I wouldnt touch an Oxycontin again in my life, a couple friends at a party had some, I grabbed some up as quick as I could and snorted them right there. Sometimes I think that if I never would of gone to that party my life would be a lot differnet right now. I cannot stop my addiction, and the drug keeps getting more expensive as time goes on. I'm building a tremendous tolerance to this drug. I am now currently at 140 mg dosage, which would kill anybody my size in a heartbeat. I sometimes tell friends how much I have to do to get fucked up, and they practically shit their pants.</p><p>I am not here at all to diss this drug. This is the best drug I have ever tried. I'm just here to tell of the effects that it had upon myself and my story. It is especially hard to get off of these and not relapse. I am soon going to try to start doing them on a weekend basis only. Then eventually cut them out completely. Not only are Oxycontin mentally addicting like most drugs, but they are physically addicting. My addiction is soon going to come to a slow hawlt, and my life will be a lot better because of it.</p>",
 "year": "1",
 "id": "14029",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "6691",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "140 mg",
   "administration": "insufflated",
   "substance": "Pharms - Oxycodone",
   "form": "(daily)"
  }
 }
}
