{
 "id": 14022,
 "title": "Disappointed",
 "date": {
  "submission": "2011-10-14T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "V300",
  "gender": "Male",
  "weight": "70 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "100 mg",
   "administration": "oral",
   "substance": "Ethylcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 1:40",
   "administration": "insufflated",
   "substance": "Ethylcathinone",
   "form": "(powder / crystals)"
  },
  {
   "time": " T+ 2:38",
   "administration": "insufflated",
   "substance": "Ethylcathinone",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Recently I acquired a bag of Ethylcathinone. I had tried the substance before - at a concert and really liked it - the euphoria was amazing. I split the gram I had, by drawing a long line of Ethylcathinone and then separating it into even parts, so everyone got an even amount of it.",
  "I met with a friend who had just took it an hour ago, and he said he never felt so good in his life. I had taken the substance before, so I smiled and became a bit inpatient to go back home and dose.",
  "I had smoked a joint about four hours before taking the Ethylcathinone and I believe the effects had completely diminished. I weighted out the half of the bag I had (I had around 200 mg) and ate it taking a glass of water to wash away the taste. I heard many reports of Ethylcathinone being very nasty to insufflate, but in my opinion eating it is worse as its taste is very bad.",
  "T+0:40 - I'm expecting it to hit me already, but nothing is happening",
  "T+1:20 - Still nothing happening except for stronger pulse",
  "T+1:40 - Chatting with friend who dosed the same amount at the same time as me - we decide to draw a line",
  "T+1:50 - Slightly stimulated",
  "T+2:00 - Pulse rate increases, music sounds slightly better",
  "T+2:38 - Drew another two lines of about 30 or 40 mg each. A bit painful, but it's a nice kind of painful.",
  "T+2:50 - Stimulated and concentrated, nothing more.",
  "T+3:00 - Friend tells me he's feeling the euphoria - I feel nothing.",
  "T+3:20 - Disappointed, go to sleep.",
  "In the morning I found it quite difficult to get out of bed, and I'm not sure if it has to do with the substance or going to sleep at 3 in the morning. My friend is about 60 or 70 kg in mass and is about 1,75 meters tall. I am two meters tall, also 70 kg, but very, very skinny. Just some additional information. Also, before taking the substance I ate meat for the first time in three weeks, so that might have affected my metabolism. Anyways, I would suggest not taking the substance orally, but drawing a few lines. I had 200 mg, but I was concerned about taking too much and started very slow. But that's just from a single experience, so don't take it as a rule. Peace!"
 ],
 "erowid": {
  "id": "93198",
  "citation": " V300. \"Disappointed: experience with Ethylcathinone (ID 93198)\". Erowid.org. Oct 14, 2011. erowid.org/exp/93198",
  "substance": "Ethylcathinone",
  "views": "5708"
 }
}
