{
 "title": "Ghostly!",
 "author": "Oompaloompa",
 "citation": " Oompaloompa. \"Ghostly!: experience with Scopolamine (ID 14031)\". Erowid.org. May 1, 2002. erowid.org/exp/14031",
 "substance": "Scopolamine",
 "bodyweight": "145 lb",
 "header": [
  "DOSE:",
  "10 ml",
  "oral",
  "Scopolamine",
  "(liquid)",
  "",
  " ",
  "oral",
  "Pharms - Lorazepam",
  ""
 ],
 "report": "<p>This happened quite a while ago when i was in a hospital, i had been admitted because of error, but got to try scopolamine. BTW I had not eaten food for 6 hours, my stomache felt empty preceeding the intake of scopolamine. I was also on a prescription Benzodiazepam at the time (Ativan), but i don't think it affected the following experience as i had taken the Benzo that morning.</p><p>T+0:00 - Liquid scopolamine of 5-15 ml, [wasn't looking at how much i was given, but it tasted like cherries, so yummie] I go to lay down and try to sleep.</p><p>T+0:05 - Nausea begins to form.</p><p>T+0:10 - Nausea becomes increasingly unbareable, it feels as though someone or something is grabbing my stomache and it does not feel good.</p><p>T+0:15 - Nausea has transcended into an extremely unpleasant feeling, (it feels as though someone is trying to tear my stomache apart) I toss and turn because it hurts so much, and i start to feel as though a dream-like haze has come over me.</p><p>T+0:25 - I am sitting on my bed next to a curtain which has flowers all over it; This curtain starts to flutter a bit as though it is windy out, but there is no window open.</p><p>T+0:30 - I feel weird, looking to and fro everything starts to look somewhat blurry and dreamy.</p><p>T+0:35 - I look at the curtain and i see a face where there should be a flower.  I look away and then quickly look back and see 2 faces, then 3, 5, and so on.  By now it looks as though these children I am seeing are spirits.  The spirits look just like the ones off of the haunting (that movie where the rooms are distorted so that they look as though there are ghosts).</p><p>T+0:40 - The spirits start calling my name in whispers.</p><p>T+0:?? - I fall asleep, or lose cosciousness shortly after.</p><p>All in all, this experience was very interesting, very hard on the stomache, but not scary like some substances may seem to some people (acid for example).</p>",
 "year": "1999",
 "id": "14031",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2002-05-01T07:00:00.000Z",
 "views": "19668",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "10 ml",
   "administration": "oral",
   "substance": "Scopolamine",
   "form": "(liquid)"
  },
  "1": {
   "time": "",
   "amount": " ",
   "administration": "oral",
   "substance": "Pharms - Lorazepam",
   "form": ""
  }
 }
}
