{
 "id": 14054,
 "title": "Night of the Living Dead",
 "date": {
  "submission": "2004-12-27T08:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "Stoner",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "50 mg",
   "administration": "oral",
   "substance": "Hydrocodone",
   "form": "(extract)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 glass",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  }
 ],
 "report": [
  "I wanted to try opiates for a long time but the only things I could find was 10 pills of vicodin (hydrocodone mixed with acetominophen 7.5/750mg). I found a way to extract the hydrocodone and get rid of the acetominophen cause that's the stuff that damages the liver. This would also enable me to take higher doses of the hydrocodone without getting the acetominophen crap.  Through the extraction process 10 pills became about 75 ml of solution. I drank about 2/3 of it. The intial effects were very pleasant and I felt very peaceful and content in about 30 minutes. I then drank a beer which intensified the effect. I began feeling nauseous so I layed down. I was worried I would throw up so I kept really still and dozed off to sleep very, very slowly.",
  "Although I was dizzy and nauseous and the peaceful feelings had turned into strange mental visions, the experience became more interesting. I was very conscious as I fell asleep slowly drifting deeper into the arms of sleep. Then it came to a point where I didn't know if I was awake or asleep. My dreams seemed so real that I didn't know if they were dreams or hallucinations. I thought I had walked into the other room and scribbled on the wall but in the morning when I woke up I had never moved a muscle as I awoke in the same position. My dreams were very real, lucid, hightened and vivid.",
  "Overall, it was a good but unpleasant experience. I'm glad I tryed it once but I'd never try it again."
 ],
 "erowid": {
  "id": "9338",
  "citation": " Stoner. \"Night of the Living Dead: experience with Hydrocodone (ID 9338)\". Erowid.org. Dec 27, 2004. erowid.org/exp/9338",
  "substance": "Hydrocodone",
  "views": "33960"
 }
}
