{
 "id": 14050,
 "title": "NBOMazing",
 "date": {
  "submission": "2011-11-01T07:00:00.000Z",
  "experience": "2011"
 },
 "author": {
  "name": "Baked G00DS",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "750 ug",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Set: Weekday afternoon in a major metropolitan area.  Beautiful, cloudless day with reasonable temperature (about 25 C).",
  "Setting: Was quite content with myself and happy about how the day was panning out. I had previous 3 or 4 week stint of deep depression (broken-heart), but in the days leading up to this experiment I had been coming to terms with it much better. With a good friend, who we will call R, who is also an experienced psychonaut.",
  "Previous experiences include: Mushrooms, LSD, MDMA, 2C-I, 2C-E, DMT, DiPT, 4-HO-MET, Ketamine, MXE, 5-HT, bk-MDMA, Salvia, and various other pharmaceuticals",
  "About Me: I am a 20 year old college student studying chemistry and I have been very interested in psychedelic since I was about 16. Having the opportunity to try such a novel RC was very, very exciting for me, and I hope that this report helps to shed light on how positive this compound was for me.",
  "0:00  Place 1 blotter of 25I-NBOMe approx. 750 g. Held this blotter under my tongue for about an hour, and didnt swallow or spit out any saliva for 30 min. The blotter was quite bitter, and had a surprisingly strong tongue numbing effect on my tongue.",
  "0:30  Start to feel the first waves of a typical psychedelic coming on. A bit tingly and light headed, with deeper feeling of heaviness. (if this makes any sense to any of you). Still had the blotter in my mouth at this point. At this point me and R leave Rs house to go the park, it was a really nice day.",
  "1:00  I swallowed the blotter. At this point I was starting to have some very slight OEVs and much more vivid CEVs. These consisted of fractal patterns changing colors.",
  "2:00  The full effects of this compound have started to reveal themselves, and I would say that this was the first (and least dramatic) of three distinct peaks. I am wavering at the point between ++/+++. Amazingly similar to LSD, but much more clear headed and less candylandy, but still body load and visuals were very similar.",
  "3:00  I am again at another peak, and this one a definite +++. I was laughing hysterically at everything R is saying, and vise versa. The OEVs/CEVs are incredibly intricate an unavoidable. Definitely an incredibly detailed and layered fractal pattern. I am most certainly in a profound psychedelic headspace (i.e. I intuitively understand the universe, society, etc.)",
  "4:00  This is the last peak, and definitely most intense. Most clear and vivid OEVs, this fractal pattern layered on top of everything, as if my vision had become incredibly kaleidoscopic. Definitely a rolling +++",
  "5:00  Definitely back down to about a + and a half by this point. Still some apparent visuals and strange body feeling, but nothing memorably uncomfortable or upsetting. R and I talk about our experience, amongst other things, while we wait for the compounds effects to slip away",
  "7:00  Almost back to baseline and am feeling pretty good about myself, and the experience that we had just had. So much so that it was at this point that I decided I had to write this report before going to sleep, so as to make sure everything was accurate for me to tell.",
  "11:00  Finally get to sleep, not because I couldnt, but mostly because I didnt want to the experience being so fresh in my mind and so much to take in. Wrote about half this report before finally going to bed.",
  "Conclusions: DAMN!!!! This was a really good one. For me, it was like taking all the good parts of LSD, and making them more psychedelic. To quote R, This is a psychedelics psychedelic. I spent a good 4  5 hours in a place that I had been before only once on LSD, only this time it was more real to me. Like I said before, I feel as if with LSD there is sometimes almost too much color saturation, to the point where it almost looks as if youre in a sort of candyland, or something like that.  The visuals were breath taking, some of the best I have ever had. Fractal patterns everywhere, in the gravel, in the trees, etc. Being that this experiment took place in autumn, the leaves on all the trees were turning red and yellow, which made for a spectacular show. Overall, I would say this is my favorite compound I have tried to date. Its much more of a pure psychedelic than its non-benzyl substituted cousin 2C-I, while still retaining some of the entactogen qualities. In my opinion this is what separates it from LSD. It was as if it came with all the beauty and wonder of LSD, with just the right amount of love and understanding to make one appreciate the life he/she has been given. Everything felt soft and lovely, but not too overly stimulated so as to get wrapped up in the sensation of feeling so good that you lost track of what is happening around you. I wish very much to experiment further with this compound and other ones of the NBOMe and substituted benzyl phenethylamines in the future. And if you are like me and have a great love for psychedelic compounds, then you will find this one to be a real gem."
 ],
 "erowid": {
  "id": "93342",
  "citation": " Baked G00DS. \"NBOMazing: experience with 25I-NBOMe (ID 93342)\". Erowid.org. Nov 1, 2011. erowid.org/exp/93342",
  "substance": "25I-NBOMe",
  "views": "23883"
 }
}
