{
 "id": 14051,
 "title": "Methoxetamine Psychosis",
 "date": {
  "submission": "2012-01-07T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Imakamera",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "200"
   },
   "administration": "oral",
   "substance": "Methadone",
   "form": "daily"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "IM",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Let me first explain that I am a very experienced drug user and phsychonaut. Since 14 I have had hundreds of experiences with mushrooms, pure LSD25, DMT and Ketamine. Have always been able to handle my psychedelic experiences even when I have had the unfortunate bad trip, always been able to stay rational, maintain some shred of reality, but generally have very positive trips.",
  "I am also a recovering heroin addict, shot dope for 4 years straight and have been on methadone maintenance for the past 9 months, it has saved my life. I recently have experimented with ketamine for spiritual growth and had great mind expanding enlightening positive experiences with ketamine. Doing research on arycyclohexamines,",
  "I learned about a new ketamine analogue that was supposed to be a stress free version of ketamine, have great anti depressive potential and last twice as long as k. So I acquired methoxetamine from a reputable source and tried it, by the way I I.M ketamine into my shoulder, sometimes I.V smaller doses but mainly I.M because it's the best route of administration and I enjoy needles and have great technique and very hygienic practices. Anyways, I did methoxetamine in 20, 30, and 50mg doses over the course of a day and enjoyed the warm opiate like buzz it produced, which surprised me because I take 200mgs of methadone a day and that pretty much insures that I can't feel any opiate, if I were to shoot up a quarter ounce of smack it would be pointless, my opiate receptors are blocked and filled with methadone. Yet methoxetamine had a nice opiate buzz effect on me, though I do get an amazing body high buzzing sensation from ketamine, with k it's more a cross between Nitrus oxide buzzing and opiate body high, while with m it was significantly opiate warmth, very nice, it was also accompanied by an inner calm, and silence.",
  "It seemed like everything was dead quite inside me, and my visual distortions were much different than k, everything was bright, tinged with a white light, all things had bright hallos around their edges, artistic endevoures were beautiful. Only bad part was the presence of a high pitched noise in my ears, but that went away.",
  "This is where things went bad. The next day I was sober all day and in the evening I decided to take 50 mgs of methoxetamine, did it, no effect over a two hour period, strange I thought, took another 50-100mgs (a dose I had done before), I was instantly catapulted into a deep M-hole, my mind somewhere on the otherwise of the galaxy orbiting a Blackhole, I don't remember this period but my friends said I was catatonic, spoke very very strange and at one point made a gasping sound, like I was having trouble breathing, not knowing what drug or drugs i had taken they decided to take me to the emergency room, this is were i start to remember, I come to in the back seat of a fast moving vehicle, the energy inside the car was one of panic and frenzy, there was screaming and chaotic driving, I looked outside and it appeared to me that the sky had opened up and everything around me was flying into space, all the landscape was warping and twisting, there was fire and strange light in the sky and a horrible sound, I felt an awful sense of impending doom and I believes the world was ending, I mean it seemed like everything was upside down and absolute chaos was taking place as though all the laws of physics and the universe had disappeared and everything was falling and flying apart around me and the vehicle I was in.",
  "My friends were screaming at me' what drugs did you take?' but I couldn't remember or respond, the only thing I could say eventually was 'what the fuck is happening to the world?' as soon as they pulled up in front of the emergency room and walked me in, I immediately sobered up to the reality of the situation, I was in shock and disturbed, embarrassed but So thankful that the world wasn't ending and I was alive. The doctors took my vitals, my blood pressure was slightly raised but that was probably from the stress of the car ride over and the terrifying hallucination, and after taking a blood and urine sample, flushing my blood out with an I.V for an hour, I was completely sober and good to go home.",
  "Now I do not know why this happened to me but it was very frightening, I have never overdosed or been to the emergency room in all my years as a heroin addict, and this scared the hell out of me, I'll never do methoxetamine again. I just still do not understand how the drug hit me so hard so fast when I I.M'ed it and it has a much slower onset than ketamine, it takes 20mins to come up fully. Nor have I ever had a psychotic break likE this where the world was ending, so word of warning, stick to ketamine, it's much safer in the sense that it's been used in hospitals and by people for therapeutic recreational and spiritual purposes since the 60's."
 ],
 "erowid": {
  "id": "93351",
  "citation": " Imakamera. \"Methoxetamine Psychosis: experience with Methoxetamine & Methadone (ID 93351)\". Erowid.org. Jan 7, 2012. erowid.org/exp/93351",
  "substance": "Methoxetamine & Methadone",
  "views": "9984"
 }
}
