{
 "id": 14067,
 "title": "Nice and Mellow Buzz",
 "date": {
  "submission": "2012-02-08T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Fatty",
  "gender": "Male",
  "weight": 147
 },
 "dose": [
  {
   "time": "0",
   "amount": "1200 mg",
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": "1800 mg",
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "capsule"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "oral",
   "substance": "Gabapentin",
   "form": "capsule"
  }
 ],
 "report": [
  " First off let me say, if you are expecting some glorious end all be all high from this medication, you are in for disappointment. The high I got was VERY VERY mellow. I know it effects people differently, sometimes to the extreme. I don't personally need this medication, so for me the effects were 'normal'.",
  "I always do my research when it comes to experimenting with various drugs, and Gabapentin is no exception. I looked up the experiences and the doses others had taken and I started off with that. The pills I have are gelcaps, 300mg. The following is my account of the 3 day period that I was using them recreationally.",
  "I started off at about 9pm on Halloween, taking 1200mg. Now, I know it has a long onset but I was planning on staying up for a while so I decided to take it. Unfortunate for me, my wife decided she wanted to go to bed at 10:30pm, and begged and pleaded with me to go with her, reluctantly I agreed. I hadn't really felt any sort of change yet at that point, so I went to bed and fell right asleep as I usually do. I had an unusually awesome nights sleep. I normally toss and turn all night long, sometimes waking up enough to realize I'm doing it. This night was MUCH different, I didn't wake up even once the entire night until my alarm went off, and I woke up in the last position I remember being in while falling asleep. I have a hard time retaining any dreams I have, most of the time by the morning I don't even know if I've dreamt or not. I certainly had some vivid dreams this night, though I don't remember a thing from any of them I just know they were more vivid than my normal dreams.",
  "I woke up the next day freaking BEAMING. I have been unable to achieve this feeling since though. It was the first of the month, food stamp day, and I needed to run to the local market to grab breakfast for my family. Don't worry, it is literally less than 100yds away from my house and this stuff doesn't effect my motor or thinking skills at all. Was certainly a fun experience, but by the time I got home the beam had pretty much worn off, and was a slight mellow buzz. Seeing as how I didn't really know what to expect out of this drug, I immediately took 1800mg when I got home to try to get back to the point I was at when I woke up. Every 2-3 hours after that I would take another 900-1200mg to keep the buzz going. I must have taken almost 5,000mg during the course of the day, I honestly don't remember exactly how many times I took more, it must have been 5-6 times. This is a leftover prescription from my wife, unsure as to how many were in the bottle at the time.",
  "I certainly got more talkative as suggested on wikipedia. I ended up staying up till 4am doing various things on the internet such as posting to forums. I even got the inspiration to design a couple logos and websites that some people had requested of me. I was still feeling pretty good, and as I got more and more tired the high seemed to peak higher and higher.",
  "I had another good night's sleep, but did not wake up with the same beaming feeling I had the previous day. I hadn't taken a dose before I went to bed though, so that's probably why. I felt entirely normal, 100% sober. No hangover feeling, no lingering effects. I went on about my morning routine getting my daughter ready for school and making breakfast for my wife. At around noon I decided to take a dose. Seeing as how I had taken so much the previous day, I started off with 2400mg. After about 30 minutes, my wife noticed my eyes were bloodshot, which I thought was odd that it had happened so quickly and I hadn't felt anything yet. My wife decided to take a dose herself, seeing as how I was saying it had an effect and she was fiending for some bud. She took 1200mg, and about 20 minutes later one thing lead to another and we ended up having sex. I mention it because the Gabapentin had an effect on this, it was noticebly harder to orgasm for myself. For the most part the Gabapentin was causing me to hardly feel any pleasure, it was also noticeably harder to maintain an erection because of this. I finally did the deed and afterwards we both felt the effects of the med pretty well.",
  "As I'm writing this she has a nice buzz going, according to her. I personally feel a little numb in my body, a nice feeling and more intense than the previous day's high. Probably because I'm taking a much larger dose than before. It's been 3 hours since I started the dose at 2400mg, and I've taken two doses of 1200mg since. (One dose right after the sex, and another more recently at about 3pm)",
  "Taking that much I would think would cause an overdose or something, but I felt perfectly fine with a nice mellow buzz the whole time. A buzz akin to taking 3 or 4 tokes of good bud, not HIGH but high. Not head high either, just body. This medication by itself is certainly not much of a 'recreational' drug, it does give me a decent change and mixed with other things such as bud or another med would certainly make for a nice day/night. BEWARE of long-term use, if you aren't prescribed this medication and you get addicted to it when you run out and have to stop cold turkey the side effects are severe, comparable to Alcohol or Benzos."
 ],
 "erowid": {
  "id": "93493",
  "citation": " Fatty. \"Nice and Mellow Buzz: experience with Gabapentin (ID 93493)\". Erowid.org. Feb 8, 2012. erowid.org/exp/93493",
  "substance": "Gabapentin",
  "views": "14415"
 }
}
