{
 "id": 14063,
 "title": "A Very Insightful Strange Experience",
 "date": {
  "submission": "2012-11-14T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "doubtofalx",
  "gender": "Male",
  "weight": 73
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "160",
    "grams": 0.16
   },
   "administration": "oral",
   "substance": "6-APB",
   "form": "powder/crystals"
  },
  {
   "time": "0:50",
   "amount": {
    "unit": "mg",
    "quantity": "140",
    "grams": 0.14
   },
   "administration": "oral",
   "substance": "6-APB",
   "form": "powder/crystals"
  },
  {
   "time": "3:50",
   "administration": "inhaled",
   "substance": "Inhalants",
   "form": "liquid",
   "specific": "Nitrites"
  },
  {
   "time": "6:00",
   "amount": {
    "unit": "carts.",
    "quantity": "2"
   },
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": "gas"
  }
 ],
 "report": [
  "Having quite a bit of experience with 6-APB, we decided to push things a bit further than normal.",
  "10:40PM 160mg 6-apb parachute with 1g Vit C tablet",
  "11:30PM 140mg 6-apb parachute.",
  "12:00PM Coming up, the music sounded so much better favourite DJ has just came on, normal MDMA-esque effects I normally get (only more stimmed than lovey feeling in my body)",
  "12:15AM Everybody else comes up strong, group hugs and photos begin!",
  "12:30AM Waves of rushes, even more intense by the heat in the room. (pupils considerably dilated)",
  "12:45AM Shivers of euphoria as the strobes go and the beat drops!",
  "12:50AM Friend runs her hand through my hair and down my back and my whole body freezes from such an intense feeling.",
  "1AM Cigarette, long drags really give a strong head rush and 'high' feeling",
  "2AM Contact with people is amazing, appreciating every beat of the music. Familiar 'lovey' feeling for whoever I speak to, just like a certain similar illegal chemical!",
  "2:30AM Deep hits of the popper, makes the lights sensational and my body pulsing with waves of amazingness.",
  "Continued with approx. 3 more cigarettes, and poppers maybe 5/6 times per hour until 5AM. Dancing and contact with women/friends brings waves of happiness and energy.",
  "5:00AM Lights on. Music off. Still trying to dance and make music up in our heads! Peoples faces look very slightly 'smudged' (potentially dilation of pupils preventing eyes to focus properly, or just tripping!)",
  "5:30AM Home, music put on and everyone begins subtly moving to the beat. Each take a double 8g charger balloon, inhaled whilst doing head rush (head between legs stand up etc.) all of us trip hard. What I could imagine an LSD trip to be like, was a very insightful strange experience. ",
  "Take single 8g charger balloons and lay with head off the bed inhaling/exhaling into balloon for aprox. 3mins? Swirling visuals, went into trip mode again. Altering each time with what noises are playing. (With my choice of song, I ceased to exist and could only see strobes of bright colours and feel each beat of the music pass through me)",
  "9:00AM Call it a night.",
  "Struggle sleeping, take 2 x 100mg 5-HTP and after getting about 3 hours sleep and waking up at 4PM, I felt amazing, no comedown as usual."
 ],
 "erowid": {
  "id": "93452",
  "citation": " doubtofalx. \"A Very Insightful Strange Experience: experience with 6-APB, Amyl Nitrate & Nitrous Oxide (ID 93452)\". Erowid.org. Nov 14, 2012. erowid.org/exp/93452",
  "substance": "6-APB, Amyl Nitrate & Nitrous Oxide",
  "views": "1620"
 }
}
