{
 "title": "Flowing Through the Crowd",
 "author": "Gary Fladams",
 "citation": " Gary Fladams. \"Flowing Through the Crowd: experience with Morning Glory & Alcohol (ID 14066)\". Erowid.org. Jun 23, 2007. erowid.org/exp/14066",
 "substance": "Morning Glory & Alcohol",
 "bodyweight": "250 lb",
 "header": [
  "DOSE:",
  "460 seeds",
  "oral",
  "Morning Glory",
  "(extract)",
  "",
  " repeated",
  "oral",
  "Alcohol",
  "(liquid)"
 ],
 "report": "<p>I had been experimenting with morning glory seeds. I was using a standard cold water extraction. I would finely grind up the seeds in a coffee grinder, mix with a roughly equal part of lemon juice, then add enough water to make about 2 pints. The mixture would be shaken vigorously, left to stand overnight, and then strained through 1) a mesh screen and then 2) an old tee shirt. This seems to work very well. I was gradually increasing my doses over time, so I could see what my tolerance was. On this particular occasion I used approx 460 seeds. I drank down the disgusting concoction, even though I added cool aid this stuff still tasted foul. I drank the entire mixture in about 5 minutes. After about 10 minutes, the usual upset stomach came into play, but I knew it would so I wasn't too concerned.</p><p>We were heading up to a friends place in Chicago (Im from the burbs). After about an hour the nausea was still there but my trip was starting. We had quite a few drinks at my friends, but when Im tripping I usually don't feel the effects of alcohol as much as I usually do. We went to a dance club via taxi cab. In the cab I was definitely starting to trip, my pupils were pretty dialated and I was feeling a lot of tingles throughout my body.</p><p>Once we got to the club, all the fun started. I was still tripping when we walked in. We did a walk around the bar to try and find some friends, and after one time around I was in another realm. I could feel waves of pleasure all over my body, almost like rolling. And as I walked through the crowd, I felt as if I was floating. Im sure I was bumping into people a lot because I was a bit unsteady at this time, but I couldn't feel it, and really didn't care.</p><p>Finally we found our friends. When I would talk to people, when they were talking I could see them, but if I started to talk, they would disappear, and then if they started talking, reappear. Very strange. Trails were everywhere. The strobe lights and other lighting effects in the club were completely captivating. I felt like I wanted to dance, but found I couldn't quite get my body to do what I wanted. I pretty much just watched everything, because if I tried to talk to someone they would disappear. All and all a very good evening. The peak lasted for about 4 hours, then I smoked some pot and went to sleep, very good dreams.</p>",
 "year": "2002",
 "id": "14066",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "2632",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "460 seeds",
   "administration": "oral",
   "substance": "Morning Glory",
   "form": "(extract)"
  },
  "1": {
   "time": "",
   "amount": " repeated",
   "administration": "oral",
   "substance": "Alcohol",
   "form": "(liquid)"
  }
 }
}
