{
 "id": 14062,
 "title": "Nostalgia, Concentration",
 "date": {
  "submission": "2001-09-09T07:00:00.000Z",
  "experience": "1996"
 },
 "author": {
  "name": "Blixco",
  "gender": "Male",
  "weight": "200 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Hydergine",
   "form": "(pill / tablet)"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Piracetam",
   "form": "(pill / tablet)"
  }
 ],
 "report": [
  "<p>First hydergine experience was with piracetam as a 'booster' of sorts; the two are very complimentary.  First dose was an attack dose (hey, I was young and didn't know any better) of 3 25mg Hydergine pills followed by 2 800mg piracetam.  I'm a pretty big guy, so I felt I was safely under toxicity. The effects came on fairly quickly (20 minutes after taking the attack dose and washing it down with a blue Brainwash soda).  The most noticeable effect was the sudden lack of conversation in the car....myself and my good friend both had taken identical doses, and we suddenly weren't speaking.  We were listening intently to the music, and watching the sunset, a beautiful southern New Mexico sunset.  The entire scene was washed in a nostalgia filter so thick that neither of us could concentrate on anything else...just the lucidity, the 'now' of the entire scene, the way the light took on new depth.  Visually, this was the most amazing drive from El Paso to Las Cruces ever made by anyone.  We had to pull over due to a complete inability to drive....couldn't concentrate on anything but the sunset, the air, the detail around us.",
  "This lasted the better part of four hours, during which time we took another two 800mg piracetam.  I developed a massive cluster headache by the end of the evening.  Sleep was empty of dreams that night.",
  "The next day, we started a regimin of one 25mg hydergine in the morning followed by two 800mg piracetam spaced out over the day....one in the mid- morning and one in the mid-afternoon.  The piracetam was a 'known' effect, as we had used it many, many times in the past (for very prolonged periods).  The hydergine seemed to enhance the better aspects of the piracetam, and added a ton of interesting visual candy to the surrounding air.  The effect wasn't was distracting, but we'd still find ourselves getting very lost in thought, concentrating on one thing very, very well....but sometimes not the one thing that we expected.",
  "All in all, a wonderful reality enhacement, but you will want to experiment with doses if it's increased cognition you're going for.  Too much = inability to concentrate on what you want, and more on the nearest shiny object.",
  "Can be easily found in Mexico, is a product of the same fertile mind that gave us LSD, and is an ergot derivative.  Unknown what the toxicity is, though I've pushed it pretty far (200mg at one dose, followed by 200mg two hours later) and not felt anything but really awful cluster headaches.</p>"
 ],
 "erowid": {
  "id": "9345",
  "citation": " Blixco. \"Nostalgia, Concentration: experience with Hydergine & Piracetam (ID 9345)\". Erowid.org. Sep 9, 2001. erowid.org/exp/9345",
  "substance": "Hydergine & Piracetam",
  "views": "22239"
 }
}
