{
 "id": 14075,
 "title": "Nice Visuals but Sore Kidneys",
 "date": {
  "submission": "2011-11-18T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Jostie",
  "gender": "Male",
  "weight": 85
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "20",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "4-HO-MET",
   "form": "capsule"
  }
 ],
 "report": [
  "Here is the report of the second time I used 4-HO-MET. The first report can be found under the title Strange Conversations.",
  "My background: Male philosophy student, 29 years old, reasonably fit. Prior experience: lots of weed, MDMA, LSD and mushrooms. Some experience with: Speed, salvia, 2-CB and of course 4-HO-MET.",
  "Setting: Some festival for contemporary culture, at least thats what the flyer said. A mix of art, visualizations, and modern classical and electronic music spread out over a couple of locations in the city where I live.",
  "20:00",
  "Take 20 MG I have weighed out myself in a capsule and proceed to the festival. My friend who suggested we go to this festival was not due to arrive until four hours later but I wanted my moneys worth so I went to the first act. Upon arrival my suspicion was immediately confirmed. Contemporary culture means hipsters all over the place. I am talking skinny jeans and thick rimmed glasses everywhere.",
  "21:15",
  "Guess my stomach was not entirely empty because it took forever for me to notice any effects. I think I maybe had one weird burp about half an hour after I took the capsule. I was sitting in the back of a dark church room whilst some artists up front were mixing freestyle classical music with ambient electronic. This was actually quite nice. There was a big screen in front and the first thing I noticed was colorful auras around peoples heads as they moved in front of the screen. Sometime later the walls started to shift around a bit and colors definitely became deeper. Due to the already changing lights it was difficult to tell whether it was the drugs or the visualization but stuff was definitely colorful. Not really awe-inspiring though.",
  "22:00-00:30",
  "I was just chilling out in the back of the church as different artist did their thing. It was mostly classical music combined with ambient/industrial electronics. My mindset was completely calm without a hint of any anxiety. For me 4-HO-MET has a profound lack of bodily sensations. There is a constant sense of anticipation when I have an interesting visual without any other feelings. On LSD and mushrooms the most intense visual parts are usually combined with intense gut-sensations, this is totally lacking with 4-HO-MET, but for some reason I keep expecting it.",
  "I had some nice CEVs. Most were like messy stick figures drawn with fluorescent ink but some beautiful space vistas did also occur. There was an exceptional beautiful one, resembling a moving oil stain when one of the artists played a Cello solo. I did not feel the need to talk to anyone and when I had to interact with one of the security people it felt really awkward to hear my own voice. I was also quite bothered by any bright lights. Peoples telephone screens were almost unbearably bright and for some time I thought I was going to have a severe headache but the feeling passed.",
  "00:30-03:00",
  "Friends arrive and we proceed to the big hall for the main event. By this time there were still some minor visual effects. I was still unable to carry on a normal conversation and was just laughing like an idiot the whole time. The music was kind of crazy and I did not feel like dancing. I just stood around a bit and felt like an old guy for not understanding this state of the art dance music. People came and talked to me but the music was very loud and I had trouble understanding what everybody was saying to me. Sounds like an uncomfortable scenario but I was feeling very detached and could not be bothered to have a bad time. I was just in a calm state of being.",
  "It was somewhere around two in the morning that I started to feel pain in my lower back.",
  "03:00-5:30",
  "Music has picked up and I spend the rest of the night dancing. My kidneys are killing me. I have been drinking a lot of water throughout the evening and frequently have to take a piss. My urine is pretty dark most of the time even though I must have drank more than 3 liters of water. Because of the smell in the toilet I could not determine if my urine smelled any worse than normal.",
  "05:30-09:00",
  "The pain in my kidneys stayed until I went to bed somewhere around nine. I had kept on drinking water and tea later on but my urine stayed dark. The day after still some occasional pain in my kidney area. When I took a piss at home it smelled horrible, like old men's urine. This also happened the last time I took 4-HO-MET but then I did not link the two together. This is one aspect of the substance that makes me hesitate to use it again.",
  "+ Easy on the psyche",
  "+ No fear",
  "+ Party suitable",
  "+ Nice coloration",
  "+ Pretty CEVs",
  "- No insights",
  "- No added significance",
  "- Pretty intense kidney pains",
  "- Dark smelly urine during the trip and up to days after\rFOLLOW-UP - TEN DAYS LATER",
  "Now two weeks later my piss still is more dark and stinky than is normally the case.",
  " Normally when I close my eyes it gets pretty dark. For a week or so after the experience I experienced occasional flashes of light and other strange head space sensations whenever I closed my eyes for an extended period of time.",
  " For the last two weeks without exception crazy vivid dreams every time I sleep or take a short nap.",
  "All in all its nothing too serious and I will probably live but I am thinking of flushing my remaining mgs down the toilet."
 ],
 "erowid": {
  "id": "93540",
  "citation": " Jostie. \"Nice Visuals but Sore Kidneys: experience with 4-HO-MET (ID 93540)\". Erowid.org. Nov 18, 2011. erowid.org/exp/93540",
  "substance": "4-HO-MET",
  "views": "7549"
 }
}
