{
 "id": 14090,
 "title": "Fast Learning",
 "date": {
  "submission": "2012-01-02T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Gorilla in the Room",
  "gender": "Male",
  "weight": 104
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "mg",
    "quantity": "25"
   },
   "administration": "oral",
   "substance": "Methiopropamine",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": {
    "unit": "g",
    "grams": "1",
    "quantity": "1"
   },
   "administration": "oral",
   "substance": "Piracetam",
   "form": "capsule"
  }
 ],
 "report": [
  "Background - I've been using psychoactive substances for about 4 years now. I have experience with: weed, LSD, mushrooms, amphetamines, benzodiapines, a few different opiate pain killers, MDMA, DXM, alcohol, many of the 2c-x compounds, a lot of different research chemicals and legal highs that I don't want to waste time listing, and probably some others that are not coming to mind right now. I became interested in MPA while browsing through available research chemicals. My thought was that it might make a good substitute for Adderall or Ritalin because my connection stopped selling and being a dumb collage student I need a little learning boost. I've been experimenting around with MPA since I got it trying to find the perfect dose. From my experience snorting it is not a great idea, When I tried snorting it I just got jittery and kept re-dosing thinking I could get some good euphoria out of it but instead just had a jittery sleep-deprived night. Because this substance is lacking a good number of experience reports I decided to share my knowledge of this helpful substance.",
  "The sweet-spot dose that I've found is perfect for me is 25mg orally combined with 1g of piracetam packet tightly in a size 0 gel capsule. Its great for school work as well as keeping me awake and alert for several hours for whatever else I need to get done. Overall duration is about 6 hours, the first 3-4 hours are very productive then it slowly trails off over the next 2 hours. There isn't a noticeable comedown which I like a lot. Effects generally become noticeable about 20-30 min after taking the capsule on a lightly fed stomach. Unlike Adderall I have never gotten any euphoria from MPA, however I have actually found this combination to be more effective as a study drug than any ADHD medication I've tried. I've found that when studying with this combo I retain much more information than I can with or without Adderall. (for comparison I usually will take 20mg instant release Adderall when I'm trying to study)",
  "Overall if you're looking for a clean-headed straight stim MPA might be it.",
  "I have yet to experience any major negative side effects with this drug. That being said safety is always important. This is a research chemical with very little studies done on the effects of this drug on humans. I have never exceeded 50mg of MPA in a day and try not to take my learning cocktail on a very regular basis. Although I do believe I've built up a tolerance and I have reason to believe that it shares a cross tolerance with other amphetamines.",
  "I hope my report is helpful to someone. Long live knowledge!"
 ],
 "erowid": {
  "id": "93620",
  "citation": " Gorilla in the Room. \"Fast Learning: experience with Methiopropamine & Piracetam (ID 93620)\". Erowid.org. Jan 2, 2012. erowid.org/exp/93620",
  "substance": "Methiopropamine & Piracetam",
  "views": "5660"
 }
}
