{
 "id": 14092,
 "title": "The Plateau",
 "date": {
  "submission": "2011-11-30T08:00:00.000Z",
  "experience": "2011-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Heat",
  "gender": "Male",
  "weight": 100
 },
 "dose": [
  {
   "time": "0",
   "amount": "750 ug",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "blotter / tab"
  },
  {
   "time": "0:30",
   "amount": "750 ug",
   "administration": "sublingual",
   "substance": "2C-I-NBOMe",
   "form": "blotter / tab"
  }
 ],
 "report": [
  "For 11/11/11 I decided to experiment with a new compound  25i-NBOMe. I had obtained two 750ug blotters (1.5mg total) and, having used several of the 2C family before, decided to take both to see the full scale of what this compound had to offer.",
  "Ive omitted most time stamps due to the extreme time dilation of this substance. I tiered the dosage, taking the first blotter sublingually at 11:30am, swallowing at 12:00pm and immediately placing the second under my tongue. I swallowed the second at 12:30. By 1:00pm I was at a (++). Over the rest of this report, I proceeded to peak at a strong (+++), stay there for a significant amount of time (approximately 1-1.5 hours) and was back to a (+) by 6:00pm.",
  "The blotters themselves are a bit bitter, but not bad when held under the tongue. I did have some slight nausea during the come up, but nothing overwhelming or disabling. The come up is not terribly rapid, slowly allowing all surfaces to start breathing and flowing  typical of the other 2Cs for my trials. Once at the peak (or peak-plateau, given the length) things started to get interesting.",
  "I had been sitting, watching television while waiting for the effects to kick in. Suddenly I became aware of the TV itself drooping, which was a little unsettling, so I turned it off. I stood to walk around and my motor function had become fairly impaired  it felt very much like trying to walk while drunk, except for my extreme lucidity. I turned to face a painting of a tiger and the picture itself started moving. The frame was buzzing, but while focused on the tigers eyes, I barely noticed. The tigers muscles were moving, not as if he was walking around, but rather flexing and relaxing them organically. His head continued to grow and shrink in size and, so long as I maintained eye contact, we seemed to physically get closer. This was actually a little upsetting, as I would have sudden depth vertigo when I looked elsewhere. Interesting to say the least.",
  "At this point, the body buzz was getting pretty strong  unintentional muscle tightening and the occasional shiver. I decided to walk to some nearby woods with a friend (sober) and just explore nature. The walk was pretty exhausting  but nothing I couldnt handle. When we got to the woods, I had several revelations about the size and longevity of life. A tree, for example, is here long before I was born and even if felled, will be here long after I am gone. In that regard, the tree doesnt care about my timeline  Im a blip on its timeline. In a larger way, the universe doesnt care about our BRIEF little human specieswe cant even comprehend the scale. This wasnt a negative thought line, just an interesting reflection on the scope and importance of things.",
  "I did not get much color or touch enhancement from this drug, so the woods didnt yield much there. But the depth and time dilation mentioned earlier was still in full effect, so I would walk from one tree to another that seemed far away, and seemed to take the appropriate time to walk to, but when I would turn to look back where I came from  shock me with how close it was. At one point, this seemed like some trickery in the woods, and I became a little paranoid. I shook it off a few minutes later.",
  "I returned back from the woods and sat down, the warmth from inside sending the visuals into high gear again. I saw rainbow prisms coming off of every object  similar to looking at a streetlight at night, but in broad daylight. I also had a significant disco ball effect  small spots of light on every surface. I put some Pink Floyd to relax and decided to experiment with some closed eye visuals. One song had a water dropping sound and I instantly pictures three hooded heads, foreheads touching, dropping water from their mouths into a pool. My point of view was from the pool, the room was black and everything was cast in a blood red light. In a moment, on my peripheral vision (or where it would be had my eyes been open) the scene shifted over and small red people were writing something in a shining yellow cursive on the blackness. It was as if written with lightning bugs and burning titanium flakes. The best way to describe the shift is as if the whole time I had dual monitors, was focused on one, then noticed something happening on the other. The dripping heads were still there, but just shifted slightly over. I thought, is this what a (++++) looks like? And as I tried to see more of what they were writing, it moved slightly further out of my periphery, with each attempt to recapture it pushing it further away. I could not make out what they were writing, but I trust it was important and I look forward to returning.",
  "Ultimately, this is a very pleasant compound.I would caution everyone that I found it to be fairly exhausting. The whole experience was only 5-6 hours, but easily felt like 12-15."
 ],
 "erowid": {
  "id": "93624",
  "citation": " Heat. \"The Plateau: experience with 25I-NBOMe (ID 93624)\". Erowid.org. Nov 30, 2011. erowid.org/exp/93624",
  "substance": "25I-NBOMe",
  "views": "15950"
 }
}
