{
 "id": 141,
 "title": "Is This a Simulation?",
 "date": {
  "submission": "2013-12-25T08:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Sun Drugs",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "80",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "1:30",
   "amount": {
    "number": "75",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  },
  {
   "time": "2:30",
   "amount": {
    "number": "75",
    "unit": "mg"
   },
   "administration": "insufflated",
   "substance": "Methoxetamine ",
   "form": "powder/crystals"
  }
 ],
 "report": [
  "Background: I had been using methoxetamine for more than a year on a daily basis. A couple of months prior, I graduated from college and found myself free to indulge in more drug experiences before I found myself a job. My tolerance to methoxetamine had increased dramatically and I found myself pushing for higher doses. I was on no other medication at the time of this experience.",
  "The timing seemed perfect. I was alone with my cat and dog, and I figured I should have a memorable experience at least once before I begin the next chapter of my life. I began by adding 80mg to chocolate milk at around 8PM. I lit some incense to add to the experience and sat down and placed a vinyl record on the turntable. The record was The Ballasted Orchestra by Stars of the Lid. Ambient music was my preferred genre whenever I took large doses, as it puts me in an ideal state for the trip. I drank the chocolate milk over the span of 15 minutes.",
  "Feeling only slightly above baseline as 9PM passed, I weighed out 150mg and split it into two lines. At around 9:30 I snorted the first line. Since I had eaten a meal an hour before my first dose, I did not want to waste any more time waiting for it to hit me, as it had been a rather large meal.",
  "I was feeling the effects more strongly now. I was in that very familiar place where everything seems warm, profound, and very slowed down. I changed the channel to a documentary on the Antarctic regions. Everything was brilliantly orchestrated  the penguins shuffling along with the music playing in my headphones. My cat jumped from my desk and fell asleep on my lap. My dog rolled onto his side and was breathing heavily. The aroma in the air and the lighting in my room was like no other. Everything was exactly as it was supposed to be.",
  "I wanted this feeling to last, so I snorted the second line at about 10:30PM. I sat back down and put on my headphones. I felt the cord on my chest and pushed it aside. Then I crossed my legs and uncrossed them.",
  "Its happening, I thought. I knew immediately what this meant and began to panic. I had taken far too much. I had fallen into a loop like I had a couple of times before. I was no longer in control of my body. I took my headphones off and put them on again. I took a drink from the water bottle and put it back down. I checked my phone for messages. I crossed my legs and uncrossed them again. I looked at all the items sprawled on my desk and pinned to the walls. This is a sandbox I created for myself. Its a simulation, I think I managed to say. I was in this place for what seemed like an eternity. There was no time here. I felt as if had been there before, except I didnt remember it until I was there. This was some sort of game  and Ive always known it.",
  "I very gradually came down over the course of several hours. Most of this time was spent watching comedies on television, in a somewhat content state knowing that I was okay. Sleep eventually came at around 4AM.",
  "This experience really shook me to the core. It is very difficult to put into words the sense of panic and confusion I had when I found myself in such a familiar yet at the same time very unfamiliar and bizarre place. I have had some similar experiences like this in the past but I think this one was made more intense due to the fact that a couple of days prior to this I had been discussing philosophical ideas with a friend, and all those thoughts were still fresh in my mind.",
  "In retrospect, what previous similar experiences have had in common with this one is the very similar set and setting -- me, sitting alone in my room listening to music via headphones late at night watching the television. There always seems to be some sort of trigger  maybe a piece of music I was listening to or a familiar sensation I experience. It really does seem like a perfect storm situation where all the elements come into place and things spiral out of control quickly. I dont think this would have happened if I were doing something else like playing a video game, which I also like to do on methoxetamine.",
  "But what did it all mean? Surely it must have some meaning. Can it all be just a coincidence that a couple of days after I discuss the simulation theory with my friend I happen to have this experience? On methoxetamine, I find that everything seems profound and happening for a reason. I must brush these thoughts aside and realize that I took a drug. This experience has meaning only if I tell it to.",
  "The meaning I chose to take from it is not that I discovered that I am living in a simulation but rather that I need to take a break from mind altering drugs for a while. I will definitely take a long break from using methoxetamine. It seems about time."
 ],
 "erowid": {
  "id": "101066",
  "citation": " Sun Drugs. \"Is This a Simulation?: experience with Methoxetamine (ID 101066)\". Erowid.org. Dec 25, 2013. erowid.org/exp/101066",
  "substance": "Methoxetamine",
  "views": "884"
 }
}
