{
 "title": "Fried in the Head for a Week",
 "author": "Katmai",
 "citation": " Katmai. \"Fried in the Head for a Week: experience with Alcohol, MDMA (Ecstasy), GHB & Cannabis (ID 14100)\". Erowid.org. Jun 30, 2007. erowid.org/exp/14100",
 "substance": "Alcohol, MDMA (Ecstasy), GHB & Cannabis",
 "bodyweight": "170 lb",
 "header": [
  [
   "DOSE: T+ 0:00",
   "3 glasses",
   "oral",
   "Alcohol - Beer/Wine",
   "(liquid)",
   " T+ 0:00",
   "1 tablet",
   "oral",
   "MDMA",
   "",
   " T+ 2:30",
   "1 cap",
   "oral",
   "GHB",
   "(liquid)",
   " T+ 2:30",
   "0.5 tablets",
   "insufflated",
   "MDMA",
   "",
   " T+ 3:00",
   "5 caps",
   "oral",
   "GHB",
   "(liquid)",
   " T+ 0:00",
   " repeated",
   "smoked",
   "Cannabis",
   ""
  ]
 ],
 "report": "<p>I think the feeling that I know a few hours from that moment I'll be rolling is a rather amusing thought. Thinking to myself, 'I'm gonna be rolling balls in a few hours' kinda makes me laugh because its always an amazing experience everytime I roll.</p><p>The location was a friends house where there were no parents for a week, along with about 15 other people. It was what we call a 'factory.' A factory is a roll party of medium size among our closest friends. It usually involves a night starting with drinking, then taking some pills when we're sloppy drunk, and then smoking a few bowls to keep things going.</p><p>At about 11:00 that night we began drinking. I had about 3 beers with some buddies of mine. Half an hour later, the pills came. Quickly people hurried to get their desired 'dose' for the night. I bought two pills. I took one orally right away and waited 20 minutes. Nothing. I waited 40 minutes. Nothing. I waited an hour. Nothing. I was sure I got a dud, but I could see my friends' eyes starting to light up (pupils getting huge). I figured I'd just smoke a couple of dank bowls and see if that helped. 4 bowls later I was rolling balls.</p><p>I turned to a girl and said 'Hi, I'm [my name]. Wanna go for a walk?' She nodded and we walked around the house a bit looking at the different black light posters, and the people dancing and all the glow sticks flying about. There was a constant smell of vicks around the house. Everyone was using the vapor blowers. We walked up to my friends' bedroom where there were some people smoking again. They invited us to join them so we sat on the bed and waited for our hits.</p><p>It was about 1:30 at this point. After a bit of smoking I noticed another friend had a water bottle filled with a blue liquid. I asked him what it was. 'G,' he replied, 'Want a cap?' Now I had seen most all my friends take down G before a couple times and it didn't seem to bother them much so I figured I'd try it out. I took 1 Cap. It tasted like salt water. I got up, somewhat repulsed by the taste, and walked over to a friend who had only taken half a pill. He wasn't really feeling it at all so I offered to let him take a few bumps off my 2nd pill. He did about half and I did half. I did my whole half in a single blow. My nose started to hurt so I sat down. I was laying down on my friends bed, just looking at the fan. He had the tips of his blades painted in glow in the dark paint with a black light on so it was pretty trippy. I felt like I was being sucked into the fan and before I knew it, all I could see was swirls. This lasted for about 30 minutes before I began to move and talk again.</p><p>The G bottle was still being passed around. It reached me. There was about 5 caps left, a friend told me. Without thinking, I drank the whole thing. I chugged it like it was nothing. Everyone in the room saw and stopped and just looked at me. 'You're fucked man,' is what one person said. But I wasn't worried, I felt fucking great and I didn't care.</p><p>15 minutes later I could barely hold my eyes open. I was so incredibly tired I couldn't even move. My friends tried to keep me awake but I kept falling asleep. They got worried. I was moved to the bathroom in case I would throw up. I didn't move again for another 20-30 minutes. People began to pick up phones and prepare to call 911 but I told them I was fine. Then I blacked out.</p><p>8:00 am the next morning I opened my eyes. I had never felt so exhausted in my life. I was in a bathtub. My body ached. I got up and walked around the house. My friends all said the same thing, 'I can't believe you're alive. What happened to you?' I had no idea what they were talking about. I asked what had happened. They told me I was yelling jibberish and talking to people in 'languages we didn't understand.' They said they thought I was dying because I couldn't move after I was in the bathtub and that they couldn't figure out what to do.</p><p>I was humiliated. I looked like a stupid kid just trying to do all the drugs I could and get fucked up. I made a huge mistake that night. I had no idea what I was getting into and I just kept getting worse and worse.</p><p>For the next week or so I was completely fried in my head. That night I will never forget. My life was on the line. Since then, I have not used ecstasy or ghb. I don't plan on using them either. It taught me about drug combinations and making dumb mistakes.</p>",
 "year": "2002",
 "id": "14100",
 "gender": "Male",
 "age": "Not Given",
 "timestamp": "2007-06-30T07:00:00.000Z",
 "views": "12994"
}
