{
 "id": 14107,
 "title": "Warning Online Police Blotters",
 "date": {
  "submission": "2012-02-10T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "MilleniumMan",
  "gender": "Male"
 },
 "dose": [
  {
   "time": "0",
   "substance": "Crack"
  },
  {
   "time": "0",
   "substance": "Heroin"
  }
 ],
 "report": [
  "Many police departments have online police blotters. Some of these online police blotters mention the names, ages and locations of those arrested. Even in the cases where the aforementioned are not convicted of the offence for which they are arrested, the names, etc. will remain posted on the sites containing the police blotters. Furthermore, the arresting officers will not always mention the fact that ones name, etc. will be posted.",
  "Be aware; this is becoming increasingly common. There are also mug shot sites which might cause more damage in the future.",
  "Look yourself up on a search engine if you have been arrested. If you have a common name put your  home location in the search. If you have a rare name this will be more of a problem if your name is posted as this may be the first entry the search engine shows.",
  "The collateral damage caused by this information being online is not trivial. This day and age, given the economy, it will be much harder for anyone whos name is on any of these sites to get/stay employed as well as the fact that relatives, friends and acquaintances may also turn their backs based on information on these sites.",
  "I am posting this because I was arrested with two of my friends for crack and heroin. Our names, ages and home locations were posted on such a site three or four days after the arrest. We were not told of this online posting by the arresting officers. One of my friends and I had the charges dropped and the other had his reduced. There was no mention of those facts on that or a later post. The point here is to warn as many people as possible about this. Be careful."
 ],
 "erowid": {
  "id": "93725",
  "citation": " MilleniumMan. \"Warning Online Police Blotters: experience with Crack & Heroin (Police Encounter) (ID 93725)\". Erowid.org. Feb 10, 2012. erowid.org/exp/93725",
  "substance": "Crack & Heroin (Police Encounter)",
  "views": "13267"
 }
}
