{
 "title": "Longer Term Effects",
 "author": "Sue",
 "citation": " Sue. \"Longer Term Effects: experience with LSD & Cannabis (ID 14111)\". Erowid.org. Aug 1, 2002. erowid.org/exp/14111",
 "substance": "LSD & Cannabis",
 "bodyweight": "8 kg",
 "header": [
  [
   "DOSE:",
   "1 hit",
   "oral",
   "LSD",
   "(blotter / tab)"
  ]
 ],
 "report": "<p>My first trip was a psychedelic blast.  My girlfriends and I were out watching a band at one of our regular haunts.  The lights were awesome.  We danced all night.  I didnt drink but I was so happy I spent $50 shouting other people drinks.  Ouch!  Unfortunately this wild night led to a two year tripping binge which totally fucked me up, without me knowing it.</p><p>Throughout this time I had a few bad trips, many good.  Acid tricks your mind.  I told myself I should never end on a bad trip and of course after a good trip, there was no need to give up.</p><p>I was a good girl from a good home in a good middle class suburb.  My parents broke up and moved and I felt like I had no real sense of home.  I lived as I chose and I thought this meant I was free, but in all reality I was falling into a lonely life of grungy drugs and rocknroll, which tore at my self-esteem.</p><p>My worst trip began as a real hoot, as many bad trips do.  My boyfriend and some of his friends and I were driving around in the hills, checking out the forest.  The trees vibrated, leaves pulsed, it was awesome.  We drove up to a huge weir and watched the sun go down.  I remember we were on top of the world up there and I dont even remember whose idea it was, but one of the guys and I did something terribly stupid, which could have ended in disaster for me. </p><p>The stars were bright and the water shone far below and Geoff held me by the ankles and I floated there upside down looking  at the water.  I felt free, truly free and  I remember thinking, if he dropped me I would either break my back or drown, then my boyfriend saw us and said oy you two, stop being so stupid and Geoff pulled me back up.  It was really weird.  We laughed and kidded around for a while then went back to the car, which was Geoffs Mums. </p><p>It was dark and Geoff was spinning out so he pulled over and we all just sat there silently in the dark.  The tension was frightening.  I felt negative vibes pouring from Geoff towards me and I felt incredibly vulnerable like I needed to be hugged and loved and I was stuck in this car with four negative yobbos.  I closed my eyes and watched as pictures came, bright moving pictures, of space and time and dimension.  I saw universes inside universes and it freaked me out.  I felt tiny and worthless and miserable and I vowed to give up acid, but it took me another year before I did.  I have used it occasionally since as a party drug, but now I am too old to trouble my brain with it.  I would maybe indulge in a quarter tab at a concert one day but it would have to be damn good outdoor concert.</p><p>I have smoked pot off and on over the years, much more on than off though.  I wish I smoked less but I dont.  I have had difficulty finishing things, finding myself and I have noticed that in research of former LSD users this is quite common.  The experience I had both at the weir and after in the car, were so huge, that they numbed me spiritually for about five years.  Since then I have been lucky to find God and Goddess in nature and feel the natural highs of life without chemical drugs. </p><p>After much growth and finding myself I have recently come to notice how much the casual drug use I grew up with, has affected me for the negative.  I have suffered from depression at times although I have tried to hide it from myself.  Denial is my middle name.  I had low self-esteem and endured crappy relationships because I felt like a cracked fragile person.  I am now finally seeing some successes in my life, through following my heart, my intuition, God and Goddess.</p><p>I still feel like I need to learn people skills, like many acid heads, I have hidden away from the 'real world' for a long time.  I find sustained conversation with strangers difficult because I am always stoned.  I plan to cut down my pot intake soon, maybe give up for a year, and go to uni, start learning again.  I do a lot of research about subjects I am interested in but until recently I have had trouble remembering what Ive learnt.  I think this is more the pot than the lsd but who knows?</p><p>I would give up pot today if I could stop kidding myself I need it to have creative thought as a writer.  Perhaps by admitting this now I am half way there.</p>",
 "year": "1985",
 "id": "14111",
 "gender": "Female",
 "age": "Not Given",
 "timestamp": "2002-08-01T07:00:00.000Z",
 "views": "12382",
 "dose": [
  {
   "time": "DOSE:",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(blotter / tab)"
  }
 ]
}
