{
 "id": 14117,
 "title": "A Divine Meeting",
 "date": {
  "submission": "2013-06-09T07:00:00.000Z",
  "experience": "2010"
 },
 "author": {
  "name": "Leth",
  "gender": "Male",
  "weight": "130 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "oral",
   "substance": "Mushrooms - P. cubensis",
   "form": "(ground / crushed)"
  },
  {
   "time": " T+ 0:00",
   "administration": "oral",
   "substance": "Cannabis - Hash",
   "form": "(liquid)"
  },
  {
   "time": " T+ 1:00",
   "amount": " repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  }
 ],
 "report": [
  "I am a 21 year old male. I am a chronic cannabis smoker. I had done shrooms four times previous to this event, all of which were all very pleasant experiences. This time however, I was met with the scariest moment of my life, followed by the most profound thing I have ever experienced.",
  "I had been tripping with my two best friends on all my mushroom trips, and we (or maybe it was just me) decided to step it up a notch. I had some x3 hash oil pills I had accrued from a contact of mine with a medical card. These pills are extremely strong  I can handle the x1 and x2 but the 3 will make me green out. Anyway, I figured I would make some crepes so we could have a wild ride. We chopped up the dried P. cubensis into a powder, and made chocolates with the powder in the middle. I poked holes into the hash oil pills and distributed the oil between our three portions. This mixture is very intense  the hash oil intensifies the mushroom peaks incredibly, too much even.",
  "Anyway, we ingested the crepes wholeheartedly. They were disgusting. Chocolates were a bad idea, especially with the hash oil. In any case we chilled around the apartment we live at waiting for the effects to kick in. I was half-way through a pastel painting I had been working on, so I got everything ready to go for when I started peaking.",
  "I was feeling the mushrooms an hour or so after ingestion, but not to the level I wanted to be at. I suggest we smoke a bowl or two to get things going, and my friends agree. This turns out to be a big mistake, but at the same time ends up being the catalyst to a very mystical experience.",
  "I felt at this point like I was a shaman, I was dancing with my big bong in one hand in a tribal fashion, and taking monster sized hoots. I never felt the smoke however and ended up smoking many bowls between the three of us. I remember watching the cabinets in the kitchen where we were smoking for a long time. There were faces in the wood, and I see them even in real life now when sober. I never noticed before. The surfaces appeared to be like a waterfall over the wood-grain surfaces. This amazed me for quite some time.",
  "I migrated into my friends bedroom, where the three of us were sitting in front of these big floor-to-ceiling sliding mirrors that make up his closet. My one buddy, we can call him N, started flailing his arms and making hysterical noises, as per usual. He leaned back into the one mirror, and I was freaking out a little bit because it looked to me like he was breaking it and pushing it back into the closet. I think most of this was hallucination. He was unresponsive at the time, and apparently he was having an out of body experience, unbeknownst to me.",
  "I dont remember events between the last paragraph and this one, likely because of how traumatizing the following events were to me. I made my way back to the mirrors, where my other friend S was standing. N is lying down on the couch having a blast. I start playing around with my visuals I was getting looking in the mirror. When I would stand in front of one, the edges of my body were morphing off in fractal formations. It looked so incredible I was having a blast and explaining everything I was seeing to my friend S. When I would jump sideways in front of the other mirror however, all my hallucinations would disappear! I would hop back and forth between mirrors in my amazement as my visuals would go from full-blown to non-existent.",
  "I noticed S hadnt said anything the whole time I was playing in the mirrors. I asked him, Hey dude whats going on? You havent said anything. I then looked at his face. He was white as a ghost and tears were pouring down his cheeks. His eyes looked like they were popping out of his head, and his mouth was wide open. He looked like a corpse. He made a kind of groaning sound until he fell to the ground. He was out cold  completely unresponsive. I kept slapping him on the face lightly and shaking him to try and get him to wake up. He came-to slightly and said, Whoa Im back. He talked very lightly saying some gibberish shit but asked me to turn the music off in the living room. He looked so godamn pale, like all the blood was flushed from him. I ran to the volume console in the living room and turned it off. This led to N asking whats going on. He was just having another OBE, after the trip he told me he was flying with a beautiful feminine looking entity with moth like wings. She appeared to be made of light, and they flew over a planet in a higher dimension. When I looked back to S where I left him on the floor I was met with extreme fear. I thought he was having a seizure, he was convulsing so violently. I rushed over and tried to shake him awake again. I was so completely terrified. This was my best friend and I fed him the crepes without thinking of how potent I made them or the consequences they held. He muttered a mewling, Im ok. Im ok. Later, he told me he had to try so hard in the blackness he was in to say that, but he wanted to make sure I wasnt freaking out. He ended up saying he needed to puke, so N and I had to help/drag him into the bathroom. This was not easy  we were nearing the peak of the most intense trip any of us have had. S didnt puke, but blacked out many times after getting him to the toilet. I hear the door of the apartment open, and our other friend who lives with S was home along with the girl from downstairs and her new boyfriend as well as another girl we will call J. All these people are friendly, so I yell at them to get in here quick and help.",
  "S kept blacking out over the toilet and I was struck by this thought: if he dies tonight I dont know how Im going to live. At this point the edges of my vision started to whomp violently. I started hearing this high pitched frequency and I realized something bad was happening to me. I slid against the wall of the bathroom until I was sitting on the floor. J is saying things to me but I just tell her Im going away I think. I cant hear you.",
  "At this point I feel something grasping my brain. My consciousness was ripped out of my body and launched at such a frightening speed and force right out of nowhere. When I stopped I was right up against the most terrifying being I have ever been witness to. It was so massive, and roiling on itself. I was so terrified; I didnt know where I was at first or what this thing was. All I could hear was this blasting sound it was pumping into me. It was like hearing every frequency at once, at max volume. I could see this entity right up against me although I didnt have a physical body and I could see in all directions at once. This is very hard to describe, it was completely ineffable but I am trying my best. This thing then blasted me with this incredibly intense feeling of pure love. The epitome of love. Time wasnt existent in this dimension I was in, either. A second was a thousand years; I was literally there for what seemed like an eternity. After it showed me such an incredible loving vibe I realised this was a being that wasnt me. At the time I thought god, but I dont think this was the case. A higher dimensional being, is the only thing I can come up with. Anyway, I remember so vividly what I asked this being. I shouted at it, screamed with the loudest thought I have ever had, WHY AM I EVEN HERE!?",
  "And then it told me. Not in words, but raw feelings and emotions. The most pure form of communication I have ever witnessed. All the while being blasted by this all-frequencies-at-once sound. The next thought I had in this timeless dimension was, Im ready to go back now. And then I did. I started to hear sounds from the real world, but my vision was 100% kaleidoscope patterns. I couldnt see solid objects for some time. I then get up and walk to the other bathroom where I take off all my clothes. I was afraid I had shit myself, so I had to check that everything was ok in that regard. Turns out I was just extremely sweaty, so I put all my clothes back on.",
  "My brain felt completely jumbled. Rearranged. I didnt feel like the person I was before the three minute long OBE I had just experienced.",
  "I should probably note that I had previously been going through an extremely difficult time in my life. I have had suicidal thoughts and was in such a state of self-condemnation and judgment. I hated my father. I hated the people that bullied me during my middle/high school life. I was so fucked in the head I felt like I was at rock bottom. My personality was split, and when I used to think it was like there were two sides of me in my head, with separate voices. The darker side was one I grew to rely on, when I had nothing else. For me, this was normal.",
  "After this I went to the table in the living room and sat in front of my painting. The girl downstairs was preaching about how we were being reckless, things like that. Not the vibe any of us needed at the time. Her boyfriend, I told him I couldnt see him, and likely wouldnt remember what he looks like so I would have to meet him tomorrow, was encouraging and told us about some of his mushroom trips he had. I dont remember any details of what he said.",
  "At this point I start painting, and the guests from downstairs leave. I ask Ss roommate to stick around and hang with us until the trip is over, and he agrees.",
  "My friend N has been on the couch this whole time, and after talking about our experiences later he explained how it was at this point that he decided it was then or never  he was going to open his third eye. He explained seeing the exact same entity I saw. He asked the questions: what is the universe? Who am I? What are you? What do you see?",
  "He would come back to reality between these questions, and was freaking out about his limbs being numb and blood not getting to his brain when he left his body. He then started to talk and explain what he was experiencing while having these OBE and every time he left his body, my reality started ripping at the edges of my vision. I was grinding my pastels into the canvas so hard. I gripped onto that painting like I was gripping onto my life.",
  "That entity, whatever it was, told me the meaning of the third dimensional experience. It said we are meant to form love connections with other selves. We are to see the universe as one, and see the infinite creator in everything. We are the creator. When you see another self, you should see yourself, and see the creator. The universe feeds on this love, this network that connects all things to one another.",
  "I spent roughly two hours reiterating what the being told me to my two tripping friends while I painted, but that is the gist of it.",
  "Another side note  after the guests left aside from the tearing reality I would experience when N would have an OBE I was having no visual hallucinations. On the contrary, I could see with such precise vision I was simply blown away. It was like every pixel of my vision was a fractal that contained in itself thousands of pixels that contained thousands of pixels. I was amazed at this.",
  "I had no religious beliefs prior to this experience. I thought when a person died it would be like turning off a computer. I believed there was no purpose in life.",
  "Since this event, I have felt like Ive been enlightened. I no longer feel any hateful feelings, or negative feelings in general, toward other people. The world looks so incredibly beautiful to me now. Whatever negative voice was in my head before, it too was stripped away from my being. I feel like I had come out of this trip as the real me, and any previous idea of self was completely distorted and corrupted by my past. I have a real sense of purpose in this life where before I only had sorrow. This happened roughly over a couple months ago.",
  "Meeting that entity, which we have come to call The Eye, was hands down the most profound experience of my life. It changed me for the best in a way I had never thought possible. Both my friends felt in a similar way. N had the same mystical experience with The Eye, S only had blackouts.",
  "Take home messages  maybe dont mix hash oil with shrooms, or if you do, dont smoke so much on top of it that you are having seizures. The frightening sight of my best friend in that state is one that I dont think I will ever forget. We tried shrooms again a couple months after and even though I had a smaller dose, I would see that same corpse face on my friend almost every time I looked at him. I think this was triggered by seeing him looking in the mirror in much the same way again. I had such bad vibes the whole night I had to look away from him the whole time I was there until I just asked my brother to drive me home. I hope this doesnt happen in the future, it was not an enjoyable thing to re-witness."
 ],
 "erowid": {
  "id": "93800",
  "citation": " Leth. \"A Divine Meeting: experience with Mushrooms & Cannabis (ID 93800)\". Erowid.org. Jun 9, 2013. erowid.org/exp/93800",
  "substance": "Mushrooms & Cannabis",
  "views": "802"
 }
}
