{
 "id": 14112,
 "title": "Real Ice",
 "date": {
  "submission": "2012-02-08T08:00:00.000Z",
  "experience": "2005"
 },
 "author": {
  "name": "Michael R.",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "administration": "smoked",
   "substance": "4-Methylaminorex",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "A friend of mine who regularly uses meth to excess on one occasion was offered to get real ice from a dealer.. It cost 500 dollars an eight ball and the friend offered me some when she got it. My experience was an immediate very intense euphoria. At first it seemed like perfect meth (it was obviously not though), it also left no residue in the pipe, which in the meth world is a very good sign. Then I started craving more really bad and of course could not afford to buy my own so could not get any but what started to happen was I started hallucinating crystals of ice everywhere, for days afterwards.",
  "They looked so real that I was trying to actually pick them up. I ended up smoking insanely out of an empty pipe and picking up every crystal I could find and ended up smoking a whole lot of bread crumbs.. About two years later I found a small crystal that had been left over and although I did not get high I was intensely reminded of the intensity and euphoria of the stuff. I am against drug prohibition it is a failure but it is probably lucky the stuff is hard to get. I detest drug abuse but unfortunately some good medicines are illegal because of lies and misconceptions.",
  "It is possible that my reaction to this drug was unique, but if a few hits did this to me I cannot imagine what regular use would do. It was a stimulant but calling it a smart drug is really a stretch. Physiologically it was a very intense stimulant. It did not remind me of MDMA at all. But then my reaction to that was not impressive at all."
 ],
 "erowid": {
  "id": "93760",
  "citation": " Michael R.. \"Real Ice: experience with 4-Methylaminorex (ID 93760)\". Erowid.org. Feb 8, 2012. erowid.org/exp/93760",
  "substance": "4-Methylaminorex",
  "views": "4021"
 }
}
