{
 "id": 14137,
 "title": "100% Visual Hallucinations",
 "date": {
  "submission": "2005-07-05T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "parXal",
  "gender": "Male",
  "weight": "60 kg"
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 shot",
   "administration": "oral",
   "substance": "Belladonna",
   "form": "(tea)"
  },
  {
   "time": "0:30",
   "amount": "2 bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "ParXal : Portugal : 10/07/2001 : 19 years old",
  "I was in a trance party, when a friend come with some bottles of Bella Donna, the people who drink it disappear...and everyone was afraid to drink it.",
  "One day later: 10/07/2001",
  "I was in a friend house that keep the bottles, it was 00:00 when I and my 2 friends (Andr and Anthony) start to drink it. It was the first time and I said that it couldn't be more harder that liquid LSD, but 30 minutes after a start walking and I a couldn't walk straight and I was seeing very bad.",
  "I get the car and go buy some cannabis, we smoke 2 bowls of it and I felt my mouth very dry, we went to a coffee we drink some water, and more water and more, but my mouth was always dry. My friend Antony started to vomit, for about 30 minutes we were vomiting, until we got home.",
  "Me and friend were going to a park, but my friend that was driving very bad, we werent seeing the road and for 3 times we get out of the road. I decided to stop. It was 4 o'clock and we started to trip very hard, I was seeing little people dancing in the street, the signs were balancing to right and then to left, every object was different, rock were dogs, trees were stone, everything was different, my friend start running from a dog but it was only his right leg. We start talking without any sense, were short phrases with no logic. I didn't understand anything. My friend disappeared and I find him talking to nothing, he said that he was talking with some old man. But there was nothing there.",
  "We get home (5:00pm) after great hallucinations. I was walking home, but I dont remember anything. It was 6:00 pm and I was in a friends car, I gave one pipe to a friend, but suddenly I woke up and I was in the police car driving me home I got home and start to sleep.",
  "In that hour that I dont remember anything, I was trying to open a car that I thought it was Andrs car, I was talking to my friends that were in the car (but the car was empty and wasnt Andrs car), I tried and talk to every car in the street and police saw it, and thought that I was trying to steel the cars.",
  "In the next day I wake up (12:00)and I was seeing very bad and still stoned, I run into Andrs house and some images come.",
  "Andre's night",
  "Andre was jumping in his grandfathers bed and running in the house.",
  "Antony's night",
  "He was all the night seeing people walking and talking in his bedroom.",
  "My night (6:00pm-12:00)",
  "My mothers said that I scream and talk all the night, I got out of the bed and talk to my clothes and furniture. They tell me that I was talking to my shadow. All they night I saw pipes in my hand, and when I was going to some it, it disappear.",
  "Bella Donna is very hard. It's not of this world, I have seen thing that were so real. Nothing compared to LSD. I think that drinking Bella Donna we stay in a state that is not death and not alive.",
  "Be careful with Bella Donna. I couldn't know what was real and what was fake."
 ],
 "erowid": {
  "id": "9392",
  "citation": " parXal. \"100% Visual Hallucinations: experience with Belladonna (ID 9392)\". Erowid.org. Jul 5, 2005. erowid.org/exp/9392",
  "substance": "Belladonna",
  "views": "37420"
 }
}
