{
 "id": 1413,
 "title": "Experimenting with a Panic Disorder",
 "date": {
  "submission": "2003-03-12T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "TheSlaveFlower",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "unit": "bowl",
    "quantity": "1"
   },
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  },
  {
   "time": "0",
   "administration": "insufflated",
   "substance": "Clonazepam",
   "form": "ground/crushed"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Venlafaxine",
   "form": "daily"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Bupropion",
   "form": "daily"
  }
 ],
 "report": [
  "It was a balmy, rainy Sunday with a powerful thunderstorm brewing a few miles away, and I was sitting on a comfy couch at my friend Brett's house with 8 very good friends enjoying myself.",
  "First off, I used to be a fairly regular marijuana smoker, but stopped due to extreme Panic Attacks. When I used to smoke, I was taking Paroxetine (Paxil) for my anxiety and Lorazepam (Ativan) also for my Panic Disorder, along with my Singulair and Zyrtec for allergies and mild asthma. Usually, I reacted quite well on the scale of calmness. I really don't know if this is due to taking Paxil, but I also used to experience powerful hallucinations and amnesia. My friends told me that I often did crazy things such as running around the woods naked and stuff. I find it extremely funny that I did those things because as long as I didn't have a Panic Attack, I was fine. Those of you who have experienced a Panic Attack know exactly what I'm talking about. They're absolutely horrid.",
  "Anyway, I started smoking (taking a few hits a day) for the past week. Each and every time I experienced anxiety, and had a few Panic Attacks but controlled them through breathing exercises and stopping to meditate. What I'm currently doing is more of an experiment. I want to see if I can become used to marijuana to the point where I no longer experience anxiety or Panic, and feel calm. After that, I may or may not continue to smoke, I don't know. Anyway, today I experienced a Panic Attack that I was unable to control through breathing exercises and meditation. It was a slap in the face, heart palpitating, sweat-drenching, trembling and paranoia causing Panic Attack. I knew it was getting to the point where I was going to be out of control and start crying and hyperventilating extremely hard, so I finally intervened by insufflating Clonazepam (Klonopin). I am prescribed Klonopin (not prescribed to sniff it of course, but it's the second-fastest way of getting it into your system besides IV).",
  "I also take the medications Effexor, Wellbutrin, Zyrtec, and Singulair as listed above. It's possible Effexor had something to do with making my Panic Attack severe since I just started it two weeks ago and am having the 'initial anxiety' of starting an SSRI. Actually, Effexor is an SSNRI, but it's similar. Panic attacks are very scary, so if you have an Anxiety or Panic Disorder, I suggest not smoking pot, and if you do, have a benzodiazepine on hand (Klonpin, Xanax, Valium) as a Panic intervention. It could just be me who reacted like that, and everyone's different. Take care."
 ],
 "erowid": {
  "id": "14319",
  "citation": " TheSlaveFlower. \"Experimenting with a Panic Disorder: experience with Cannabis, Venlafaxine (Effexor) & Bupropion (Wellbutrin) (ID 14319)\". Erowid.org. Mar 12, 2003. erowid.org/exp/14319",
  "substance": "Cannabis, Venlafaxine (Effexor) & Bupropion (Wellbutrin)",
  "views": "38281"
 }
}
