{
 "title": "To Hell and Back",
 "author": "JOS",
 "citation": " JOS. \"To Hell and Back: experience with Cannabis (White Widow) (ID 14146)\". Erowid.org. Mar 9, 2005. erowid.org/exp/14146",
 "substance": "Cannabis (White Widow)",
 "bodyweight": "75 kg",
 "report": [
  "<p>Im writing this down in as much detail as possible now because its fresh in my mind, and I feel its important to get it done accurately. Reading about other peoples experiences has helped me recover from my own bad experience (last night, Monday), and I hope that I can help someone by submitting my own.",
  "I am currently working abroad, and I sometimes have problems getting along with people, maybe Im just shy. Anyway, this unease, along with various other little concerns in my life, is what I believe provided the raw material for my bad experience.",
  "Ive been smoking cannabis (weed and hash) quite heavily for the last 7 months or so, with only a very occasional break, usually for a couple of days. I have to say that for the most part my experiences have been very good. When Im at home in a relaxed atmosphere listening to music etc., I smoke 1 or 2 joints in the evening and feel great, even if I ramble a bit. I have had the usual stimulating mental experiences only a pot smoker enjoys. Although Ive had some bad, vaguely paranoiac experiences before, nothing came as close to breaking me as last nights episode did.",
  "I should first note here that I had given up smoking weed for two weeks, and that I just started smoking weed again on Sunday (I had a long, intense high, so I knew this particular batch of white widow was strong stuff, but it was from a coffeeshop so I know it was okay). So the bad experience yesterday was my second weed smoke after this 2 week abstinence. From what Ive seen, it seems to me that an abstinence like this commonly starts a change in the body which leads to unpredictable results when smoking is resumed, probably just from changes in a persons tolerance.",
  "I was spending the evening alone, pretty much, after my days work. I hadnt been feeling so good during the day, my mindset was a little negative, so when I decided to smoke one weed joint, I knew I was taking a bit of a risk. However, confident in my ability to manage the stuff, I went out to the backyard, sat in a deckchair and smoked it. I felt a rather strong high, and had some very intense philosophical thoughts. However, pretty soon, things started to change for the worse. I interrupted my own stream of thought, remarking (mentally) at how messed up my thoughts were, how messed up I was, and asking myself what the hell was wrong with me, then my head started spinning and I kept hearing these high-pitched voices saying over and over, What the hell is wrong with you?. This part probably stems from the fact that Ive been told since I was a child that drugs are drugs, drugs are bad, and obtaining pleasure from a substance (even alcohol) is inherently bad in itself. I had thought I had subdued this aspect of my character.",
  "At this stage my mouth and throat were dry, and it felt like my windpipe was pushing itself into my mouth, when I tried swallowing I had this awful feeling of constriction in my neck. Although I dont think I was in any real danger of suffocation, for a while I was trying desperately to swallow and get my windpipe to feel okay again. I probably looked like a fish out of water, but I eventually ended this gasping by drinking some tea from a mug I realised I had beside the chair. I started to feel better after this, somehow managing to change my train of thought and feel better again. After feeling quite good for a while, I got up from my seat and went back into the house. I had some brief but intense moments of dizziness and cold sweat, so I sat down on the couch, without listening to music or watching TV, I needed silence, and eventually managed to compose myself again.",
  "Maybe I would have been okay after this if I had gone to bed straight away, but just as I was about to go, a friend of mine rang the doorbell, bringing another friend of his who Id met briefly before, but didnt know. I invited them in, but they probably saw at this stage that I was wasted. So we sat down watching TV for a while, and the guy I didnt know started asking me questions, just to be friendly. However, I was not ready for these questions. It was just little things, like what I was going to do next year, would I go back home? Am I homesick? What did I do this evening that caused me to feel unwell? I tried to respond, I dont know what Im doing next year... I dont think Ill go back home... Im not homesick (maybe I am)... I feel unwell because I had a joint. The answers to all of the questions were manifestations of all my little insecurities, and my mind started to tear itself up (this is the best way I can describe it). This went on a little while, I became more and more insecure, and the guys appeared to know I was really bad.",
  "However, they had little knowledge of cannabis and probably didnt have a good idea of what was really happening. My nerve shattered, and I started shivering and shaking uncontrollably on the couch, and eventually I told the guys I had to go to bed. I saw them off, but Ill never forget the look of pity in their eyes, as though looking at a wounded animal. One of them (the one I didnt know) seemed quite distressed and kept saying the poor guy, and Its so very sad, which did nothing to help. Maybe he just didnt realise that not only was I conscious at this time, I was orders of magnitude more sensitive to his comments than would be considered normal. After seeing them off, I went straight upstairs to bed, and after what seemed like an eternity of being essentially insane, I fell asleep.",
  "So, its the next day. I woke up, feeling very... shocked, like someone had strapped me on an electric chair and cranked the lever. I feel fragile and paranoid, which is not good, but nowhere near the second-by-second mental torture of last night. I honestly thought that this was it, my mind was blown, and I would suffer in insane agony for the rest of my miserable life.",
  "So Ive made decisions. Cannabis, while it has given me much, now has shown itself to have the potential to take much more. I do not know if I could survive something like this again. So Im leaving it, indefinitely. I dont know what my advice is to others, perhaps just to know that changing the frequency with which you smoke can lead to unexpected consequences, or just to bear in mind that no matter how experienced you may consider yourself, it can still go bad, worse than you can imagine.</p>"
 ],
 "year": "2002",
 "id": "14146",
 "gender": "Male",
 "views": "8096",
 "dose": [
  {
   "time": "0",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "submissionDate": "2005-03-09T08:00:00.000Z"
}
