{
 "id": 14158,
 "title": "More Potent Than I Thought",
 "date": {
  "submission": "2013-02-03T08:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "Just A Guy",
  "gender": "Male",
  "weight": "170 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "150 mg",
   "administration": "oral",
   "substance": "6-APB",
   "form": "(capsule)"
  },
  {
   "time": " T+ 0:00",
   "amount": "25 mg",
   "administration": "rectal",
   "substance": "6-APB",
   "form": ""
  },
  {
   "time": " T+ 6:00",
   "amount": " bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 7:30",
   "amount": " bowls",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": ""
  },
  {
   "time": " T+ 8:00",
   "amount": "2 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": ""
  }
 ],
 "report": [
  "When I returned home from work, I was excited to find that the 6-APB had been delivered. I hadn't planned on experimenting with it that day, but since it was there, and I had a couple days to recover, I decided to go ahead with it. I took a 500mg of magnesium to help with any jaw clenching I might experience, and took a multivitamin, and some Vitamin D3. The following comes from notes (in a very rushed, shaky handwriting):",
  "T+0: The 6-APB came in 50mg green and white capsules containing a very light tan grainy powder. I took 3 orally, and I dissolved half of one in water and took rectally.",
  "T+1:00: I experienced a slight trembling in my extremities. I found myself clenching my jaw, but I was able to resist the impulse. I experienced short, mild rushes of heat and head pressure, and enjoyed the mild pleasure of coming up. I felt that this come up was very similar to the one I feel when I eat shrooms. Saliva kept filling my mouth and I made frequent trips to the sink to spit. I enjoyed a cigarette and drank approximately a liter of water. At this stage I found myself taking care of short, simple chores like washing the dishes, feeding the dogs, making the bed. I was listening to some music, and decided to draw a bath.",
  "T+1:15: I observed pronounced dilation of my pupils and my pulse was strong and fast. The warm rushes were more intense, and my feet were hot and sweating, but my hands were cold. Took a bath.",
  "T+1:30: I found myself leaning over the bath to vomit in the toilet. Nothing came up, but it quelled the nausea I began to experience. My body was starting to get very shaky, but it was pleasurable. A thick haziness obscured my vision, like looking through fog. Movement seems effortless, like my body is self-propelled.",
  "T+1:45: I'm definitely experiencing a stimulant effect from this chemical. My body is tingly, especially in my extremities (hands, feet, face). I finished w/ the bath and decided I was very comfortable naked. At this point I feel like the full effect was coming upon me and I was losing balance and felt like I could pass out. I started sweating but I was still enjoying the experience.",
  "T+2:00: I threw up violently. But boy did I feel better after that. I thought my internal temperature might be running high, but my digital thermometer actually displayed LO, meaning I was my core temp was actually below 95 degrees. I wanted to dance, and I did, but I got bored quickly. The time was really flying by. I decided to turn off all the lights, and felt like now was a good time to physically stimulate my body with self-massage and yoga. I was listening to Francisco Tarrega, the classical guitar helped keep my mood inspired, and my attitude mellow. I started to write in a mad rush and it was pretty abstract but neat.",
  "T+3:00: I started to feel like I was slowly coming back to myself. (Little did I know that this ride was far from over.) I was definitely rolling or at least what I think rolling is like since I've never used ecstasy. But everything was very pleasurable and just nice! Jaw clenching like crazy though. For the next three hours I was playing with myself to no climax, but it felt good anyway. I drank another liter of water.",
  "T+6:00: I'm back to working on projects again. My mind is back. I smoked a bowl of weed, of the Cheese strain. I finally jerked off to a massive (biggest ever) ejaculation.",
  "T+7:00: My eyes are dilated as if I'd had dilation drops administered. They are just big black orbs. My body is so stiff and tense. I'm wiped out. I'm straight shot. Hard to urinate. I must have stood in front of the toilet for fifteen minutes trying to relax so I can pee. It inhibits the bowels and urination.",
  "T+7:30: I smoked a cigarette. It was nice. I smoked another bowl of weed. I'm starting to relax.",
  "T+8:00: I decided to eat some dinner. Ate a big plate of leftovers and drank some more water. I decided to lay down and watch a movie. It felt good to lay down but I could tell I was still experiencing the stimulant effects of this chemical. I chugged two high-proof beers to help bring me down a bit.",
  "T+10:00 I finally got to sleep.",
  "T+14:00 I'm wide awake with only four hours of sleep. I'm in a good place. I'm still feeling sharp, like the stimulant is still effective. My eyes are no longer dilated. I could go to work now if I wanted to. I'm drinking coffee, though, because my body craves it.",
  "Overall Thoughts: This is something that ought not be done more than once a month. It's very potent, much moreso than I expected. I would probably do it again, but like all drugs, I will be sure to be careful. The dosage seemed perfect for me."
 ],
 "erowid": {
  "id": "99142",
  "citation": " Just A Guy. \"More Potent Than I Thought: experience with 6-APB (ID 99142)\". Erowid.org. Feb 3, 2013. erowid.org/exp/99142",
  "substance": "6-APB",
  "views": "5078"
 }
}
