{
 "id": 14161,
 "title": "A Completely Unenjoyable Experience",
 "date": {
  "submission": "2013-03-02T08:00:00.000Z",
  "experience": "2012-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Guy Incognito",
  "gender": "Male",
  "weight": 79
 },
 "dose": [
  {
   "time": "0",
   "amount": "250 ug",
   "administration": "sublingual",
   "substance": "2C-C-NBOMe",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "I've never written a report, but I had such a poor time with this substance that I decided to share my story in the hopes of convincing people not to waste their time.",
  "I'm a young, healthy guy with a loving wife and a great job. My headspace is fine. I've done mushrooms a number of times without ever having a bad trip, and I tried to set everything up this time for a similar experience. Cleaned the apartment, set up music and food, made sure I had plenty of blankets out to wrap myself up in.",
  "At 3:15 I took a blotter containing 250 micrograms of 25-C NBOMe and placed it in my mouth between my lip and gums. I held it there for 30 minutes, waiting as my mouth filled with spit. The blotter was complexed, so it didn't taste like much of anything. After thirty minutes I spit out my mouthful of saliva. I could feel things were a bit off, but I wasn't seeing any of the traditional effects I got from mushrooms. No visuals, no difference in music or lighting, just a weird feeling in my head. For the next hour and a half, I tried watching TV and listening to a podcast, but I couldn't focus. My hands and feet were cold, and my stomach felt awful. I threw up my lunch, and felt a bit better.",
  "At this point I was pretty sure it wasn't going to be a fun trip, but I reassured myself that it wouldn't last forever, and decided to just get in to bed with my computer and cuddle up. Started feeling calmer, but still no psychedelic effects. Watched some standup comedy, which I was able to enjoy, but the entire time I was conscious of how 'off' everything felt.",
  "At approximately +3:30 I was really hungry, but my stomach was still feeling bad. I made some plain noodles and tea. Half an hour later I threw that up, too, and resumed feeling awful. I picked this substance because of its supposedly light body load and easy-going profile, and I was having a terrible time.",
  "I more or less spent the next 5-6 hours lying in bed and taking controlled breaths, just waiting for it to end. The whole thing was miserable, and I wouldn't recommend it to anyone."
 ],
 "erowid": {
  "id": "99173",
  "citation": " Guy Incognito. \"A Completely Unenjoyable Experience: experience with 25C-NBOMe (ID 99173)\". Erowid.org. Mar 2, 2013. erowid.org/exp/99173",
  "substance": "25C-NBOMe",
  "views": "2717"
 }
}
