{
 "id": 14168,
 "title": "Spice Adventures Pt.1",
 "date": {
  "submission": "2004-08-07T07:00:00.000Z",
  "experience": "2001-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Tennessee Jack",
  "gender": "Male",
  "weight": 68
 },
 "dose": [
  {
   "time": "0",
   "amount": "10 g",
   "administration": "oral",
   "substance": "Nutmeg",
   "form": "(ground / crushed)"
  },
  {
   "time": "0",
   "amount": "6 glasses",
   "administration": "oral",
   "substance": "Alcohol - Beer/Wine",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "I have had many experiences with hallucinogens, mostly LSD and psylocibin.  I decided to try nutmeg after reading all the literature I could find.  From the information on this site I figured the trip could go either way, good or bad. My roommate and I invited some daring friends over on a Thursday night to see if this substance would provide any kind of buzz.  We bought a jar of whole nutmeg from the local grocer and, with only the aid of a knife, grated the nuts into fine shavings.  I carefully measured out 10 grams of grated nutmeg for my roommate and myself.  My other buddy took about 8 grams and our two female companions each took 6 grams.  We ate it between 6 and 7pm and settled down with a few beers and a few joints to await the effects. ",
  "I must say that the most unpleasant aspect of the whole experiment was the ingestion of the powerful spice.  I took my portion in 4 spoonfuls, each one followed by a big gulp of chocolate milk.  The shavings of nutmeg tasted terrible on my tongue, but it went down easy enough without leaving much of an aftertaste.  The really torturous part was the six hours of disgustingly spicy nutmeg burps that followed.  Nothing I ate or drank afterward was strong enough to mask the overpowering taste of nutmeg that kept creeping up my esophagus.  For the next four hours there were no noticable signs of anything.  I experienced some mild nausea but no one else seemed to be bothered at all by abdominal pains.  My roommate and I were both running on empty stomachs so we expected the stuff to take hold pretty soon.  Right around midnight, just as the burps were beginnig to subside, the nutmeg decided to show itself.  Our friends had already left because they figured nothing was gonna happen, so it was just me and my roommate and another friend who had not eaten the nutmeg.  I had probably only had about six beers to drink since the ingestion of nutmeg.  I had also smoked a few joints.  Suddenly I started feeling very, very fucked up. ",
  "It took nearly six hours for the shit to really kick in.  I was lying on the couch when my head started to feel like a fifty-pound stone.  My eyelids were even heavier.  I lost the desire to drink beer, but pot seemed to make the spice come on stronger.  I felt very lethargic, very tired and extremely stoned.  The girls who assumed nothing would happen came back over and they were fucked up, too.  We laughed a lot and listened to music after watching the Yankees lose to the A's.  The nutmeg seemed to produce a pot/alcohol-like buzz, it made me very tired.  My roommate reported seeing some visuals, but I did not experience any kind of hallucinogenic effect at all.  By 3am I was having trouble keeping my eyes open.  My thoughts were coming very slowly and it felt like my brain was operating at about one-tenth the normal speed.  My speech sounded coherent to me, but my friends assured me that it was slurred.  The buzz was pretty powerful but I was dissappointed that I didn't trip.",
  "I went to bed shortly after 3 and woke up this morning at about 10.  I felt pretty groggy but was able to write this report.  The nutmeg really slowed down my response to stimuli.  My friends would ask me a question and I would reply several minutes later.  It wasn't a bad experience but it wasn't very fun, either.  The nutmeg burps were absolutely repulsive and the feeling in my gut was not very pleasant.  The hangover is not that bad as I am experiencing that right now.  Obviously I can still type on the computer and earlier I went to get some food, so all my motor funtions seem to be intact.  I may try this experiment again some day with a higher dosage, but not for a while.  The memory of the terrible burps will keep me away for some time."
 ],
 "erowid": {
  "id": "9920",
  "citation": " Tennessee Jack. \"Spice Adventures Pt.1: experience with Nutmeg, Alcohol & Cannabis (ID 9920)\". Erowid.org. Aug 7, 2004. erowid.org/exp/9920",
  "substance": "Nutmeg, Alcohol & Cannabis",
  "views": "13799"
 }
}
