{
 "id": 14166,
 "title": "Researching in a Canyon",
 "date": {
  "submission": "2013-04-03T07:00:00.000Z",
  "experience": "2012"
 },
 "author": {
  "name": "Acidhat",
  "gender": "Male",
  "weight": 61
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "",
   "substance": "2C-I-NBOMe",
   "form": "(blotter / tab)"
  }
 ],
 "report": [
  "Me and 3 of my friends all dropped 1 tab of 1mg 25i and began biking in the nearby canyon.",
  "T+1 - just beginning to feel the effects. No visuals yet, but there's an amazing body high. Better than the body high I got from 3 tabs (not even going to try to estimate the dose) of LSD. Biking is beginning to feel easier and more flow-y. Going fast down hills feels like piloting   However I do feel surprisingly chilly, considering I'm layered up in 2 jackets. The vasoconstriction never got any worse than a few shivers, though.",
  "T+2 - at this point I was starting to get visuals. Nothing  compared to lsd, but patterns become noticeable in the trees and hills. Instead of the bright tesselating patterns I get with LSD, the visuals were more calm and breathing. The trees swayed from side to side to the rhythm of the music, and colors appeared more pastel-like, rather than the bright neon colors of LSD.",
  "T+3 - I'm definitely peaking at this point, and my group has settled on a rock in the canyon. Everything is hilarious, yet the humor is slightly empty in a way. I can't help but laugh at nearly everything, but I know that its not actually funny. The visuals are getting a little more intense, but they never surpass the levels that lsd has brought me.",
  "T+4.5 - Standing high up on a rock in the center of this canyon, I look far into the distance and see a bridge with cars padding over it. As usually happens with psychedelics, I get to some 'deep' philosophical thinking. I think about how in one of those cars is a person, and throughout his entire life and my entire life the only time there is ever any interaction between us is that split second, the moment that he comes into view from behind a cliff and then disappears behind some trees. It makes me feel small and insignificant. Yet that also makes me mystified and happy. I have many more moments like this, but this example is the most memorable.",
  "T+4 -the empty feeling still persists, I have trouble caring about what's going on around me. Sometimes when my friends are laughing, I laugh only so I don't seem different. This isn't to say I'm not enjoying it though. I'm just too absorbed in my trip to really give a shit about the outside world. This feeling of solitude comes and goes for the duration of the trip.",
  "T+5 - we are now biking back to my friend's house, and oh my god biking is exhilarating and relaxing at the same time. Looking around and seeing all the brushes and trees fly by is exciting. Yet I keep forgetting to change gears so even the slightest change in slope brings with it a quick rush of stress and annoyance as I struggle to remember which levers change which gears.",
  "T+6 - from this point on the trip is mostly the same as I've described in the past few paragraphs. I watched Pink Floyd - The Wall, which was very mentally stimulating. Other than that, the rest of the night was insignificant.",
  "Other things to note:",
  "The trip lasted all day. I dosed at about 1:30, felt high around 2:30 or 3, and it lasted without waning until I went to bed around midnight.",
  "This drug is a lot less fun than other psychelics, in my opinion. Don't get me wrong, I had a blast, but it doesn't have the same sense of child-like ecstasy as acid does. In general I think this drug is more suited to artistic expression than ravey-fun times."
 ],
 "erowid": {
  "id": "99194",
  "citation": " Acidhat. \"Researching in a Canyon: experience with 25i-NBOMe (ID 99194)\". Erowid.org. Apr 3, 2013. erowid.org/exp/99194",
  "substance": "25i-NBOMe",
  "views": "2505"
 }
}
