{
 "id": 14169,
 "title": "Everything Was Amazing to Me",
 "date": {
  "submission": "2004-08-07T07:00:00.000Z",
  "experience": "1999-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "tweaker",
  "gender": "Female",
  "weight": 57
 },
 "dose": [
  {
   "time": "0",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  },
  {
   "time": "2:00",
   "amount": "1 hit",
   "administration": "oral",
   "substance": "LSD",
   "form": "(liquid)"
  },
  {
   "time": "0",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  }
 ],
 "report": [
  "I was 16 years old. I hadn't had any experience with psychedelics before. Just pot, pain killers, etc.. I was very interested in trying acid for a long time. Then the day came that I got my hands on some. A friend of mine talked to me in school and said he had stumbled upon a vial and asked me to buy some hits off of him(He knew I was looking to do it for awhile) I initially bought six and sold 4 of them to two friends of mine. We made plans to chill at my house that night and all take it together. My friends had experienced acid before so I figured I was in good hands. We first dosed at about 9:00. We were watching a movie and just chilling in my room. It took about a 1/2 for it to hit me. I was amazed at how powerful it was. I took one hit to start with while my buds D and M both took two. I was not expecting anything that started to happen. Everything was amazing to me. It felt like I had an understanding for how everything worked. I sat in the middle of the room, on the floor and stared at the trip-toy strobe light we turned on.",
  "I don't think I've ever had a bigger smile on my face in my whole life. i just sat there, completely and utterly fascinated by how the colors looked and moved on the ceiling. All of my visuals were peaceful and happy. I felt like I was on top of the world.",
  "About 2 hours into it I decided to take my other hit. By the time that hit me I was totally at one with the Universe. Me, D, and M went outside to have a cigarette. While outside I was staring at the lights of the passing cars, and just getting this wonderful, overwhelming feeling of happiness. i later discovered that it was the lights that were getting me all wound up.  That whole night was just an extrememly mind-blowing experience. I have been using acid since that and have yet to have a bad trip. I don't know if its luck or what....."
 ],
 "erowid": {
  "id": "9921",
  "citation": " tweaker. \"Everything Was Amazing to Me: experience with LSD (ID 9921)\". Erowid.org. Aug 7, 2004. erowid.org/exp/9921",
  "substance": "LSD",
  "views": "6174"
 }
}
