{
 "id": 1416,
 "title": "Good Natural Aphrodesiac",
 "date": {
  "submission": "2004-12-08T08:00:00.000Z",
  "experience": "2002-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Stiffler",
  "gender": "Male",
  "weight": 91
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 drops",
   "administration": "oral",
   "substance": "Yohimbe",
   "form": "extract"
  },
  {
   "time": "0",
   "administration": "oral",
   "substance": "Pharms - Paroxetine",
   "form": "daily"
  }
 ],
 "report": [
  "I've heard of yohimbe over the years, but never gave it a try.  Recently, I decided to try an SSRI (Selective Serotonin Reuptake Inhibitor) called Paxil to try to get over some anxiety problems in my life.  I was warned that there could be sexual side effects including loss of libido and impotence.  I thought that it was worth a shot since the side effects weren't guaranteed.  Well, what do you know... I got the side effects.  After a couple of weeks on Paxil, I was having a hard time (well actually a limp time) getting an erection, and an even harder time reaching orgasm.  This was the case with a partner, and even when I was at the controls myself.",
  "First, I'll give you the details of the control setup to my experiment, which is me masturbating to internet porn while suffering from loss of libido/weak erection as a side effect of Paxil treatment.  I'll try not to be too graphic or gross anyone out, but I want to be scientific and give you the pertinent details.  Basically, it was difficult to achieve initial erection.  I had to be looking at porn, and really work at it to get hard.  Once hard, it was a precarious situation.  If I stopped stimulating myself, I would lose my erection within about 10 seconds.  Finally, it was difficult to achieve orgasm -- I just wasn't feeling the great feeling that sexual stimulation normally gives a person.  I would get it in small amounts, so it would take a long time to build up to an orgasm.  I also had to buy some lubricant because of this so I wouldn't hurt myself! :/",
  "Before getting off of Paxil, I decided to try Yohimbe.  It's available in many health food stores/vitamin shops in pill form as 'Yohimbine Extract'.  It's also available as raw bark or in a liquid extract form.  I got a bottle of liquid extract (concentration unknown) which recommended a dosage of 30-45 drops in a 'bit' of water up to 3 times daily.  I've taken it about 5 times now, so the details below are the result of several experiments.",
  "The taste is kind of like a bitter tea... not too unpleasant.  On my first few tries, I waited for a while just to see if I would get a spontaneous erection or anything like that.  No dice.  After about 30 minutes, I looked at a little porn, and found myself to be very easily aroused just by touching myself through my pajamas.  It was very easy to get an erection, and I felt the tingly sensations that I had been missing due to Paxil.  I also got *very* hard.  I could let go for about a minute before I would start to lose pressure in my erection.  My soldier was definitely at full attention.  It was slightly easier to achieve orgasm, however, I would say that Yohimbe's positive effects on a) getting hard and b) staying hard were more significant that its effect (if any) on my time/effort to reach orgasm.",
  "After orgasm, the erection slowly subsided -- pretty much as a normal functioning man's should, and I had no occurrences of incidental erection thereafter. ",
  "Now, for the side effects that I've experienced.  Yohimbe is definitely stimulating, and gets your blood flowing.  If you have any kind of heart condition, high blood pressure, or any other condition where you're advised against taking stimulants, then you should definitely check with your doctor before trying yohimbe.  It gives me a little bit of a fluttery feeling in my chest from time to time where I feel my heart beating. ",
  "Also, I fully concur with everyone else's reports on yohimbe's sleep inhibiting effects.  If I take yohimbe at 10 or 11 pm, and don't take any kind of depressant afterwards, I'll be rolling around in bed, trying to sleep until about 6 am.  A prescription sleep aid called Ambien (zolpidem) solves this problem for me.",
  "Finally, I do experience a slight hangover the next day (for about half the day) from yohimbe, where I feel a bit drained and groggy.",
  "So, IMHO, yohimbe definitely works.  If your bits and pieces aren't working as they should, and you don't have an explanation like an SSRI's side effects, SEE YOUR DOCTOR!  Don't be shy about it -- there might be a physical problem that can be solved.  If you're just not performing as you used to because you're getting older or fatter ;), then maybe yohimbe will help.  Don't forget, though, that a healthy lifestyle including exercise and a good diet will help that too.",
  "As for those without any sexual dysfunction who want to try yohimbe just for the hell of it... I think it might make for a fun night.",
  "As for those who have reported =that it made them sick and wired out of their gourds... I really think that they took too much.  If you're skinny, have low body fat, get drunk easily, etc, then start with a lower dosage than what is recommended on your packaging.",
  "Hope this helps whoever's reading it.  Peace."
 ],
 "erowid": {
  "id": "14332",
  "citation": " Stiffler. \"Good Natural Aphrodesiac: experience with Yohimbe & Paroxetine (ID 14332)\". Erowid.org. Dec 8, 2004. erowid.org/exp/14332",
  "substance": "Yohimbe & Paroxetine",
  "views": "35064"
 }
}
