{
 "id": 14177,
 "title": "A Good Day",
 "date": {
  "submission": "2013-07-13T07:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "arah",
  "gender": "Male",
  "weight": 75
 },
 "dose": [
  {
   "time": "0",
   "amount": "800 ug",
   "administration": "buccal",
   "substance": "25C-NBOMe",
   "form": "blotter/tab"
  }
 ],
 "report": [
  "Everything in quotes is exactly as I wrote it down during the trip after that is supplemental information. This is my first time with the 25c-NBOME compound. I have tried 25i-NBOME and 25b-NBOME before to great success.",
  "10:00AM: 'Placed blotter up in between gums turned on some music, blotter feels like it's chilling the gums'",
  "This is zero time. I just woke up and removed one blotter from a strip and placed it in the upper right part of my gums. It fits snug up there and I think I notice the numbing effect that thus far all the nbome serious has shown. I wait about 15 minutes before getting in the shower to let the compound manifest.",
  "+0.20 I hop in the shower and the first thing I notice is a picture of water on the side of a shampoo bottle, its flowing and morphing around the surface of the bottle and coming out of it slightly. I looked around and could see no other visuals. I poke the blotter with my tongue and it tastes awful.",
  "+1:00 'Effects noticeable, hard to type, trailing, noticing small details, clear head if easy to get distracted'",
  "Small things are starting to pop out I look at ceiling that I have seen a thousand times before, before it was just white, not now it is a shimmering painting full of detail and stark contrast. It is beautiful; it is just a white ceiling.",
  "I tried to meditate. That did not go well, my thoughts just flow and I cant keep a hold on them, cant calm the storm, it's just energy though, my thought patterns arent changed.",
  "+1.05 'Pupils seem a little larger than normal'",
  "+1.08 'Things are starting to get that animated around the edges look.'",
  "+1.55 'pupils dilated. Just went on a walk, felt very introspective. Still seeing trailers, every thing looks very liquid, bright.'",
  "I have been doing some experiments with powdered KMnO4. Its a very bright purple compound that when added to a solution makes a very nice color. I tried to weigh some of it out and mix it with HCl. However I was finding it quit hard to separate out the small amounts I needed. Motor control was definitely impaired on a fine level, and when I tried to write down my measurements and findings I could not make the letters as small as I wanted them to. They just flowed off the page.",
  "+2.36 'pupils still dilated, slight jaw clenching, visuals still very apparent'",
  "+3.13 'coming down?'",
  "+3.27 'pupils more dilated than +2.36'",
  "+3.34 'things still look wavy if view right'",
  "I am defiantly coming down at this point. I slowly trailed off from there and by about hour 5 or 6 I was back to baseline. Jaw is sore I was clenching it the whole time. I peaked at a plus 2.",
  "I would try this compound again, and if I do probably increase the dose to 1 mg."
 ],
 "erowid": {
  "id": "99245",
  "citation": " arah. \"A Good Day: experience with 25C-NBOMe (ID 99245)\". Erowid.org. Jul 13, 2013. erowid.org/exp/99245",
  "substance": "25C-NBOMe",
  "views": "476"
 }
}
