{
 "id": 14178,
 "title": "Beginner Psychedelic",
 "date": {
  "submission": "2013-09-20T07:00:00.000Z",
  "experience": "2013"
 },
 "author": {
  "name": "phenethylamineB",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "750 ug",
   "administration": "sublingual",
   "substance": "25C-NBOMe",
   "form": "(blotter / tab)"
  },
  {
   "time": "0:36",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "1:37",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Tobacco - Cigarettes",
   "form": ""
  },
  {
   "time": "6:00",
   "amount": "2 hits",
   "administration": "inhaled",
   "substance": "Nitrous Oxide",
   "form": ""
  }
 ],
 "report": [
  "Let me begin with my drug experience. Ive tried psilocybin (mushrooms), LSD, MDMA, 2C-E, salvia, marijuana, cocaine, nitrous, alcohol, nicotine, and a slew of prescription pills (Hydrocodone, Oxycodone, Roxicodone, Tramadal, Adderall, Vyvanse, and Valium). I consider myself an experienced user. Im a 22 year old student in America, healthy, and had a clear conscious at the time of the experience.",
  "I got a hold of a tab of 750ug 25C-NBOMe, and since Ive tried 2C-E on multiple occasions (15mg orally and 5mg insufflated) and really enjoy it, I wanted to try another from the 2C family. The setting is at a friends place, so that he could watch over me in case anything went wrong. For most of the night, I am sitting on a couch watching tv. At one point though, I move to a bed to be alone and to listen to music.",
  "17:10  Ate a full dinner.",
  "19:40  Dosed. Put tab under my tongue and let it sit without swallowing for 30 minutes. Tasted slightly bitter.",
  "20:16  Smoked a cigarette. The sky was clear and pulsing with light, comparable to a strobe. It was faint, but definitely pulsing. Tracers are already noticeable. Body feels very speedy, like if you drank too much caffeine.",
  "20:51  I notice that if I stare at the carpet for a minute, it flows and moves in waves, but only slightly. The speedy body feeling has subsided some and now sitting comfortably on a couch. I would classify as a plus one.",
  "20:59  Now, if I stare at the carpet or ceiling, I can pull patterns out. It takes some concentrating, but definitely there. Tiles dont do much probably due to simple design with only straight lines. Carpet or a stucco ceiling is what moves and creates patterns.",
  "21:17  Smoked a cigarette.",
  "21:34  Moved to bedroom, laid down, and listened to music to be alone and have a change of scenery. Now there is a slight euphoria. Im very comfortable lying down. Patterns are still a bit difficult to pull out, but still there. I do notice that what I am directly looking at doesnt move too much, but things in my peripherals move a lot. If I stare blankly at a wall and not focus on it, the entire room can slowly shift as if it is turning on its side (only slight movement). At one point, I was staring at a wall in the bathroom (light was on), and I saw streaks of yellow slowly waving. I looked away and blinked, but the streaks stayed. At this point, tracers are very strong. Also, my mind is very clear and wouldnt stop thinking about stuff. Would classify as a plus two, not quite a three.",
  "21:50  Looks like coming up on 2C-E.",
  "22:35  Still a plus 2. If I want, I can talk with my friend and watch tv with no problem, but could also focus my attention to the floor and enjoy the waving of the carpet.",
  "23:32  Feel euphoric, very comfortable. Still a mild plus two. Still have ability to stare blankly at a wall and cause the entire room to shift.",
  "00:35  Notre Dame defeats Lousiville in 5OT 104-101. Hell of a game.",
  "00:54  Concluded that I had dropped to a plus one, at most. Very conscious and aware of my surroundings (was never not aware of my surroundings). I drive home, stopping at a gas station on the way to get a drink. No problems were had.\r[Erowid Note: Driving while intoxicated or tripping is dangerous and irresponsible because it endangers other people. Don't do it!]",
  "01:40  Take 2 hits of nitrous since I heard that nitrous is fun on psychedelics and I had forgotten to earlier. Nothing different, just the usual awesome 30 second nitrous high. Floor still moves slightly, but in general walking around and being on the computer, nothing is noticed except the slight euphoria felt.",
  "~03:00  Go to bed. Back to baseline.",
  "13:00  Wake up with slight headache (may or may not be a result of 25C). Nothing 2 Aleve and a shower couldnt help.",
  "In conclusion, 750ug of 25C-NBOMe was fun. Not quite a plus three, but definite plus two. Felt good, visuals werent mind-blowing, and my mind was clear. Comparing 25C to 2C-E, there is no comparison. 2C-E blows 25C out of the water with visuals. 25C is a good beginner psychedelic because the body load isnt bad (even euphoric), mild visuals, and clear mind."
 ],
 "erowid": {
  "id": "99246",
  "citation": " phenethylamineB. \"Beginner Psychedelic: experience with 25C-NBOMe (ID 99246)\". Erowid.org. Sep 20, 2013. erowid.org/exp/99246",
  "substance": "25C-NBOMe",
  "views": "598"
 }
}
