{
 "id": 14175,
 "title": "Lame",
 "date": {
  "submission": "2013-02-14T08:00:00.000Z",
  "experience": "2013-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Volatile Oil",
  "gender": "Male",
  "weight": 70
 },
 "dose": [
  {
   "time": "0",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "Napthylpyrovalerone",
   "form": "(powder / crystals)"
  },
  {
   "time": "1:00",
   "amount": "30 mg",
   "administration": "insufflated",
   "substance": "Napthylpyrovalerone",
   "form": "(powder / crystals)"
  }
 ],
 "report": [
  "Well I found myself in another funny situation with research chemicals.  I was going to buy weed for myself and some friends whom I had just dosed with some 4-aco-dmt.  I had been smoking hash all week and all day so my mind was kinda fucked.  I was forgetting to do things like blow out a candle before you leave the house. ",
  "So I show up at this party my friend with the weed is at and he says 'who wants some bath salts!!'  well how could I say no. (I'm very close to the guy, when he said bath salts I knew he meant naphyrone because he told me he had it,  I also double checked before snorting it).",
  "The effects came on in about ten minutes it was a very smooth stimulation that brought me back to reality and took off my hash haze for a while.  I did a second line after about an hour once I could tell the effects were agreeable.  The second line didn't do much more so I smoked a few hash hits a blunt and some cig's while talking with strangers.  Talking to people who I didn't know was much easier than normal.",
  "I then left the party and met up with my tripping friends at a funk disco dance party.  I had a good time dancing, I can't dance and have a good time easily.   I also enjoyed the music, which is unusual for me. ",
  "The high wore off after about 4 hours. When I was trying to fall asleep next to my girlfriend I was very aroused and had a hard time sleeping.  My heart was alternating between beating hard, fast, hard and fast, and normal.  I don't think it ever exceeded 100bpm, but the sound of my heart beating was making sleep even more difficult. ",
  "The next morning I was still turned on, got turned down though, which made me unexpectedly annoyed and depressed.  I know enough not to go and complain about not getting sex, or even to express it, normally its no big deal.  I guessing the naphyrone left me with a decent crash,  I'm skipping work because I feel to depressed to go do 5 hours of telephone fundraising.",
  "I tried smoking some hits of hash but it made me feel more depressed, which is very unusual. I also made a smoothy with soy milk 3 banana's 2 cups of strawberries, 2.2g NALT, 200mg caffeine, 250mg L-Theanine, 1.9g taurine, 400mg 5-htp, 400mg tyrptophan, 700mg DMAE, 1g coline.  I'm hoping this helps me recover, it would help after an adderal day or a 4-fa binge,  but it doesn't seem to be helping with this.  Hopefully in 8-12 hours after my body metabolizes the pro-drugs I will feel normal.",
  "I'm not going to do naphyrone again, to much crash for not enough reward."
 ],
 "erowid": {
  "id": "99242",
  "citation": " Volatile Oil. \"Lame: experience with Napthylpyrovalerone (NRG-1, Naphyrone)  (ID 99242)\". Erowid.org. Feb 14, 2013. erowid.org/exp/99242",
  "substance": "Napthylpyrovalerone (NRG-1, Naphyrone) ",
  "views": "1451"
 }
}
