{
 "id": 14184,
 "title": "New Respect for the Life I'm Living",
 "date": {
  "submission": "2013-02-14T08:00:00.000Z",
  "experience": "2010-01-01T00:00:00.000Z"
 },
 "author": {
  "name": "Matriculated",
  "gender": "Male",
  "weight": 80
 },
 "dose": [
  {
   "time": "0",
   "amount": {
    "number": "15",
    "unit": "mg"
   },
   "administration": "oral",
   "substance": "2C-T-4",
   "form": "powder/crystals"
  },
  {
   "time": "0",
   "amount": "repeated",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "plant material"
  }
 ],
 "report": [
  "Substance:",
  "2-[4-(Isopropylthio)-2,5-dimethoxyphenyl]ethanamine",
  "Amount: 15mg, oral",
  "Setting:  at home, alone, watching movies, thinking.",
  "Set: ready for a 12hour+trip.",
  "Duration: 15-16hours (13u30 - 4u30).",
  "T0: Ingestion",
  "T+30-45min: onset. I started this without too much expectation, only that I was about to trip more than 12hours. This was necessary to 'free my mind'.",
  "T+45min - 3hours: coming up. This is more physical than a tryptamine. Cool headspace. It felt kind of chemical but in retrospect I think this is just the phenethylamine feel. I went to the bathroom and this was extremely nice. Nothing sexual, but a great body high. I was also surpprised by the nice visuals at this point.",
  "T+3h - 13hours: Plateau. Nice smooth ride until the plateau, no unlikable feeling so far, so I think this will stay for the rest of the trip. Flowing patterns, breathing colors. Also with eyes closed this was easily workable. This works like a 'construct', in which the emotions you have are enlarged by a 10.000x-fold. If that's something to put in numbers, anyway.. .",
  "I cried for 30minutes because I was thankful for being alive. Since my AMT-trips I refound new respect for the life I'm living, and I'm enjoying it more ever since. It's very easy to get back old memories. Old and VERY old. Sometimes there were accupuncture-like sensations in the body, and in the brain. This feels like intense relaxing.",
  "I had a large sandwich with a cola after 7hours, without side effects. I felt a little jaw tension, I helped this with a magnesium supplement. Weed was extremely nice, very bodily feeling as well. I 'felt' the core of my body, and saw that it was beautiful. Colors shined maybe even more than on 4HOMET, but less playful. 2C-T-4 is not very empathogenic like MDMA but I'm very intrigued and openminded to hear the other side of things. Contemplative. Introspective. Real friends stuff. It asks a lot of the body. I wanted to relax HARD, and that's what I did :). After 12hours I was still tripping strong, and had jelly-like legs to walk on. I felt the weed harder than ever. Muscles were contracting and expanding constantly. Butterflies in the stomach. Serotonin ? Traffic lights were shining very hard.",
  "Some moments lend themselves to meditation. Next time I'll do this all alone. (I had a visitor at the tail-end of the peak). Asthetic appreciation went up enormously. Little bit coordination loss but nothing to extreme.",
  "T+12,5hours: I wouldn't want to drive.",
  "T+13hours: I had another sandwich, which tasted nice:). When I orgasmed, there was a clear distinction between body and mind. When these occur together, there is a huge, intense, very long orgasm. I had insights about premature ejaculation.",
  "T+13 - 16hours: easy comedown."
 ],
 "erowid": {
  "id": "99278",
  "citation": " Matriculated. \"New Respect for the Life I'm Living: experience with 2C-T-4 & Cannabis (ID 99278)\". Erowid.org. Feb 14, 2013. erowid.org/exp/99278",
  "substance": "2C-T-4 & Cannabis",
  "views": "954"
 }
}
