{
 "title": "Its All About Me",
 "author": "Shrooms",
 "citation": " Shrooms. \"Its All About Me: experience with Mushrooms (ID 14188)\". Erowid.org. Jun 23, 2007. erowid.org/exp/14188",
 "substance": "Mushrooms",
 "bodyweight": "135 lb",
 "report": "<p>Amazing, this was my first time tripping. I smoke marijuana regularly, and I have tried opium, but neither was anything like shrooming. I first realized that I was tripping approximately 30 min after I ate the mushrooms. I had felt tingly and a little disoriented a while earlier, but did not think it was significant. When I finally did feel like I was tripping, it was because I felt like I was melting together, and into the couch. If I touched any parts of my body together, I felt like they were melting together like hot wax, and that I was slowly sinking into the couch.</p><p>I also noticed that everything was forming patterns, for instance, at one point I went outside and saw a tree. it looked like all the branches of the tree moved so that they were perfectly aligned forming a grid similar to the pattern of a chain link fence. At this time I started smoking, this was done inside a walk in closet, lit by blacklight, with glowing drawings on the wall. the drawings began to shift shapes and move, forming intricate and amazing patterns. I was mesmorized for what seemed like days on end watching them, but it actually was a much shorter period of time. probably about a half hour.</p><p>I felt a lot like a young child throughout the experience. I had the gimmies... I want this music, I want to go to this room, I like this picture, I don't like this. I had very stern opinions of everything. I either liked or didn't like, wanted or didn't want, things were good or bad, there was no grey area. I also had the feeling that the entire thing was staged, like a play, and I was the star, everything was about me. I was very proud of myself, and would walk into a room and pose for everyone to see, and I thought everyone was so concerned with watching me. I thought some people were in on the play, and would observe that 'he knows' or 'she doesn't know'. I had an overwhelming feeling that people were plotting things to confuse me, but I enjoyed the confusion.</p><p>I saw colors everywhere, lights were extra bright, and colors and rainbows swirled outward from them. Moods changed quickly, but even when mellow, were happy. Things such as a different person talking or a song changing would completely alter everything I felt. They would go from dark and swirling to bright and colorful. There was constant and intense change. Things got boring quickly, a person could be hilarious to me, and then only seconds later, while still in the same conversation could be overly boring. Everything was loud, and echoing. I felt like every sound was made for me to hear, the tv talked to me, the music played for me, peoples conversations were held for me. Every once in a while I would lose all grip on reality and begin laughing hysterically. Everything was connected to each other, such as feelings to music, but everything was disconnected to reality, and I felt as if I was in a crazy dream. Overall it was an amazing experience and I enjoyed it.</p>",
 "year": "2002",
 "id": "14188",
 "gender": "Male",
 "timestamp": "2007-06-23T07:00:00.000Z",
 "views": "2851",
 "dose": {
  "0": {
   "time": "DOSE:",
   "amount": "1.75 g",
   "administration": "oral",
   "substance": "Mushrooms",
   "form": "(dried)"
  }
 }
}
