{
 "id": 14192,
 "title": "Trippy Patches Of Color",
 "date": {
  "submission": "2005-07-11T07:00:00.000Z",
  "experience": "2001"
 },
 "author": {
  "name": "G-Shroom",
  "gender": "Male",
  "weight": "190 lb"
 },
 "dose": [
  {
   "time": "0",
   "amount": "3 caps",
   "administration": "oral",
   "substance": "Amanitas",
   "form": "(dried)"
  },
  {
   "time": " T+ 0:30",
   "amount": "1 cig.",
   "administration": "smoked",
   "substance": "Cannabis",
   "form": "(plant material)"
  }
 ],
 "report": [
  "Me and a friend where boredI had found a couple yellow orange fly agarics the day before and dried them at 250 degrees. I took one and my brother took one with no effects.",
  "I suggested to my bored friend that we look for more and up the dose a little. He agreed and we went for a short hike. It didn't take us long as we found a ring of yellow fly's around a pine treewe picked six of them and dried them out the same way as the first.",
  "We ate 3 each at about 10 PM or so at a friends housewe got some pot and about a half hour later  my stomach was a little upset. We went outside and sparked a blunt, that helped. We then went to a friends house to sleep over. On the bike ride there I noticed a little energy burst. By the time I got there it was about a little past 11pm and I was surprised that I didn't have cotton mouth at allin fact my mouth was dripping wet. My friend didn't have the same experience just yet.",
  "Laterabout 12 or so, I started to sweat, it lasted for about a half hour and got my shirt pretty wet. My friends mouth then started to salivate. My friend didn't sweat more than usual the whole timethat goes to show the different effects on different people.",
  "I turned on some music and I drifted to a relaxed state. I then started to get floaters in my visionI asked my friend if he had the same and he said he did. The floaters were like blurry spots, with the lights on or off. If we looked at something straight on we couldn't see what we were looking at. A little later the spot grew a little bigger and colors started growing in the middlefirst it was bluethen blue and yellowthen blue and red in different patternsat one point the pattern resembled a cartoon face of an old manI asked my friend what he was seeing and he explained the same sort of thing. The visuals didn't last too longit wasn't difficult to speak to each otherwe could think clearlyno confusionno loss of equilibriumno memory loss.",
  "After the trip we both enjoyed a peaceful sleep.",
  "I enjoyed my experience alot and the only bad effect was the sweating, which my friend didn't even get. I actually liked the increased salivation. I want to do more next time, and hopefully extend the visual stage by doing so.",
  "Peace!"
 ],
 "erowid": {
  "id": "9932",
  "citation": " G-Shroom. \"Trippy Patches Of Color: experience with Amanita muscaria var. formosa & Cannabis (ID 9932)\". Erowid.org. Jul 11, 2005. erowid.org/exp/9932",
  "substance": "Amanita muscaria var. formosa & Cannabis",
  "views": "10228"
 }
}
